["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Have you ever had to have lunch with your lover’s fiancé? It was a first for me, too. There were four of us at lunch, but only one of us was new to half the table. Dr. Ellen Radborne was about my height, 5' 3\" with thick shoulder length brunette hair that I might have thought was black, but my hair was black, so I knew hers was really just dark brown. Her eyes were brown, like mine, though again mine were a little darker. She had a pale summer tan, to my nearly white skin, but then my skin never tanned, it just burned, and then went back to being pale. She was curvy, maybe not as curvy through the chest as me, but no man who liked breasts would complain that she lacked. She was in shape, though not as fit as I, but then I doubt she needed to hit the weights and cardio as hard for her job as I did for mine.</p><p>We’d chatted through ordering food, eating food, and finally ordered coffee and tea, and still they hadn’t brought up anything serious, or anything to do with the reason for this meeting. I hadn't had to endure this much small talk in years. We’d learned a lot about each other, but unless we were looking to date, I didn’t see the point.</p><p>She taught college level biology, and continued to do research field work in the summers. She reminded me of the last two serious girlfriends he’s had. He certainly had a type, as if only the names changed for his short, dark haired women. He’d sleep with a variety, but for serious dating it was always women like us. She liked camping, bird watching, hiking, caving, climbing, and all sorts of outdoor stuff. I had, at one time, enjoyed all of that, but my job as a U. S. Marshal for the preternatural branch didn’t leave me much room for hobbies.</p><p>My gym time was more serious, because my life could depend on how fast I could run, how hard I could hit, and just how tough I could be. Dr. Radborne probably didn’t have to worry about any of that. It meant I could have out arm wrestled her, but she probably had a more reasonable work schedule.</p> <p>We sat across from each other smiling, but her eyes were a little uncertain, and I was trying very hard not to make my eyes look empty. Most women took eyes that were too neutral as unfriendly. Men understood that sometimes you didn’t want to smile, but you weren’t mad either, while women expect other women to be pleasant, and if you’re not they think you don’t like them. There are so many reasons that most of my friends are men.</p><p>The only saving grace to this Saturday lunch fiasco was that we weren’t alone, though in some ways that also made it more awkward. I was still happy to have a hand to hold on my side of the table while she hung on the arm of her fiancé across the table from us.</p><p>The us was Micah Callahan, who was the same height as the good doctor and me. He was the only man I’d ever dated who matched my height. Micah was wearing a forest green t-shirt that was actually made of silk, which always seemed wrong for a t-shirt, but since it also made it petably soft and looked fabulous on him I didn’t complain. It made the rim of green around his irises more vibrant, and the circle of yellow on the outside of them more gold, so that his eyes were even more beautiful set in the delicate triangle of his dark skinned face. He still had his summer tan that he got every year from jogging in nothing but shorts, so he was dark and his eyes were jewel-like in the almost feminine beauty of his face. The shirt also fit every curve of his upper body, showing just how much muscle was under there. He had broad shoulders for his size, and a nice chest that went down to a waist so slender we could share some of our jeans, but in too many clothes he just looked delicate, because he fought for every ounce of muscle he got in the gym, or on the track, which was not true for the man sitting beside Dr. Ellen Radborne.</p><p>Richard Zeeman was 6' 1\" and had always muscled easily, and it showed in his broad shoulders, impressive chest, and the swell of his arms against his own cotton t-shirt, which was also forest green. It hadn’t occurred to me to coordinate what the boys were wearing. Dr. Ellen had asked Richard to ask what I was wearing, so that I’d had to think about it ahead of time more than I normally would for a Saturday. I’d told her jeans and a t-shirt with boots, because it was fall. I was wearing skinny black jeans tucked into some really nice boots, and a silk t-shirt that matched Micah’s except for color -- mine was red, which matched my lipstick, and brought out the flame pattern in my boots. The boots were fun, and I figured I’d need some fun for the lunch. I’d been right, but Ellen had worn more ordinary blue jeans tucked into dressy brown cowboy boots, and a button up dress shirt in a blue that complimented the jeans more than her skin tone, or at least, that was my opinion, which I kept to myself. But it was unfortunate that the men were wearing nearly identical t-shirts, and that they both had their summer tans and looked fabulous in them. Micah looked better in his, but it was the eyes. Richard’s eyes were a deep, even, milk chocolate brown, lovely eyes, but they couldn’t compete with Micah’s leopard eyes. They were both wearing jeans, Micah in black, Richard in blue, so again we each coordinated with our other half. Micah was wearing black cordovan leather designer shoes so that with my three inch heels I was actually taller than he was, but he never cared, he was secure in all sorts of ways. Richard was wearing brown hiking boots, which was one of his favorite types of shoes on the weekends.</p><p>Richard’s hair fell in foaming waves of brown with golden highlights, and in strong enough sunlight I knew that there were threads of coppery red in it, so that saying he had brown hair never did it justice. Micah’s hair was curly, not wavy, and he normally wore it back in a pony tail, or a braid of some kind, but since this lunch was supposed to help Dr. Ellen understand that I had other yummy men in my life so I didn’t need to steal Richard from her, Micah had left the hair unbound around his shoulders so that it trailed deep brown chestnut curls to mid-back. My hair was the same length, and I realized, weirdly, that both Richard’s and Dr. Ellen’s hair was just past their shoulders. They say that after awhile couples begin to look alike.</p> <p>She gave Richard’s arm a little extra squeeze where her arm was snaked through his, and then sat up more evenly in her own chair. “Well, this is more awkward than I thought it would be,” she said.</p><p>“It’s about as awkward as I thought it would be,” I said.</p><p>Micah squeezed my hand under the table, a silent bid for me to play nice. I smiled harder, and did my best to push it up into my eyes.</p><p>“I’m sorry, I did force this on all of us,” she said, and she looked genuinely uncomfortable.</p><p>I sighed. “I’m sorry, Ellen, I just meant that Miss Manners doesn’t cover this, and I don’t know what to say either.”</p><p>She smiled a little uncertainly at me, but nodded, and took Richard’s hand across the white table cloth. “Do you understand why I wanted to meet?”</p> <p>I shrugged, because I couldn’t think of anything good to say. Richard’s agenda for the lunch meeting had been to reassure his recent fiancé that I had other men in my life, so I wouldn’t be trying to steal him back and keep him all to myself. Why did I feel we owed Richard this lunch? He wasn’t an ex-lover, but a current lover, and Ellen knew that, so socially awkward didn’t even begin to cover today’s little event.</p><p>I tried to take a sip of the coffee in front of me, but the smell alone made me put it back down. Weird, but it just smelled bitter. Micah hadn’t touched his either; maybe it wasn’t just me. Richard and Ellen had both ordered different kinds of hot tea, though they weren’t drinking either. I think we’d all ordered simply to have an excuse to stay at the table longer without the waiter bitching.</p><p>Micah said, “You wanted some reassurance.”</p><p>“Yes,” she said, smiling at him and looking relieved, then her glance went back to me, “though I’m not sure I’m going to end up reassured.”</p><p>I knew with that small eye flick that I looked too good, had dressed too well, and she had done that girl thing where you compare yourself to the ex, and she didn’t feel like she was winning. This was so not my problem; I hadn’t asked for the lunch, I’d told her what I was wearing. It wasn’t like I’d shown up in a designer outfit after telling her I was wearing jeans. It wasn’t my fault that I dressed my jeans up more than she did.</p><p>I looked at Richard across the table, and hoped he could read my expression, because I was fighting not to get angry. Micah started rubbing his thumb over the back of my hand where he held it on my thigh. He leaned in and laid a gentle kiss on my cheek. It made me let out the breath I’d been holding and try to ease the tension in my shoulders.</p><p>Richard hugged Ellen to him. “Ellen, honey, you can see that Anita and Micah are a couple. What more do you want to be reassured?”</p><p>“Honestly?” she asked.</p> <p>“That would be nice,” I said.</p><p>Micah whispered, “Easy.”</p><p>Ellen gave me a not entirely friendly look and said, “For you not to sit there looking fabulously beautiful and making me feel like an ugly duckling to your swan.”</p><p>“I don’t know what to say to that,” I said, and looked first at Micah and then at Richard for a clue, a hint, something.</p><p>Richard turned that handsome face to her, and said, “You’re beautiful, Ellen, you know that.”</p><p>She shook her head. “I’m pretty, but I’m not . . .” she waved vaguely in my direction, “. . . this.”</p><p>I sighed and looked at Micah for some help. He spoke out loud what I was thinking, “She won’t believe you.”</p><p>“What won’t I believe?” Ellen asked.</p><p>“Go ahead,” he said, and moved his hand to my thigh, which was sometimes more calming for both of us than hand holding. He kept his other arm across my shoulders.</p><p>“I’m not prettier than you are,” I said.</p><p>She gave me a look of utter scorn. “From one woman to another, don’t bullshit me.”</p><p>“Ellen, she’s not lying,” Richard said.</p><p>“How can you say that?” she demanded, and moved away from his hand.</p><p>“How honest do you want me to be?” I asked.</p><p>“I don’t know,” Micah said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not brutal,” Richard said.</p><p>“Honest,” she said.</p><p>“With the right makeup and a blue that had more jewel tones you’d look every bit as good as I do.”</p> <p>“Oh, thanks, are you going to offer to take me shopping next to give me makeup lessons?” Her voice was thick with scorn.</p><p>“God no, but the friends who gave me lessons taught me not to be afraid of color and bright red lipstick, because it looked good on me and on them. You dress like I did a couple of years ago, more subdued, but your coloring is close enough to mine that you need more color, that’s all.”</p><p>“A different shirt and lipstick isn’t going to make me exotic like you.”</p><p>I blinked at her. “I’m not exotic.”</p><p>“False modesty is just irritating to the rest of us, Anita. You say you’re not exotic and not beautiful, and if you believe that than I have to be ugly in comparison.”</p> <p>“Anita has trouble seeing herself as beautiful,” Micah said.</p><p>“No, I don’t owe her that story,” I said.</p><p>Ellen looked at Micah, and then at me. I glared at her. I was about to be done being friendly.</p><p>“How do we make the point without it?” Micah asked, and that was him all over, he had his eye on the goal, which was to make her feel reassured. He was more goal-oriented even than I was, but for him and for the fact that our little social group was actually working better than it ever had, I’d try. God help me, but I’d try.</p><p>“When I first started dating Richard I thought he was too handsome to like me. He was the kind of guy that made me feel awkward in high school, and that I just assumed would never look at me twice.”</p><p>She looked at Richard and smiled, it was a good smile. “He is amazing.”</p> <p>“Yes, he is, and it made me uncomfortable at first that he paid so much attention to me.”</p><p>“Why?” she asked.</p><p>“He’s too handsome,” I said.</p><p>“You can never be too handsome,” she said smiling up at him. He smiled back. We were making progress.</p><p>“Richard was the beginning of me understanding that I was attractive, because if beautiful men kept wanting to date me logic dictated that I had to be attractive enough to make them want to date me.” I sighed, even to me that sounded convoluted like I was torturing the logic rather than making a point.</p><p>“Every woman knows how attractive she is, it’s ingrained into us as little girls.”</p><p>“Not if one of the people raising you tells you that you’re not pretty as a little girl, and not if your father remarries someone that spends your childhood telling people, ‘No, she’s not mine, from his first marriage. Her mother was Mexican.’” I did my best imitation of my stepmother, Judith.</p><p>“Your stepmother said that?” Ellen asked.</p> <p>“Constantly.”</p><p>“Didn’t your father stop her?”</p><p>“She never said it in front of him. It was actually my stepsister, Andria, who told my father when we were twelve. She and I didn’t get along that much, but apparently she was embarrassed that her mother was so . . . whatever, but it left me feeling too short, too dark, too not tall, blond and Nordic like everyone else in the family.”</p><p>“Didn’t you see your mother part of the time?”</p><p>“She died when I was eight, and when I was younger I looked like she’d cloned herself except for father’s skin tone. Can’t tan worth a damn. Maybe that’s why my stepmother was so hateful, because I was a constant reminder of my father’s first love. Hell, I don’t know. One of the things you learn in therapy is that you can work on your own issues, and on healing the damage that was done to you, but you can’t fathom why the people that hurt you did what they did. That’s on their head, in their heart.”</p><p>Ellen looked at me. “What an awful thing to do to a child. I’m so sorry.”</p><p>“I didn’t tell you for sympathy, I told you to try and explain that I have trouble seeing myself. Micah is beautiful and he loves me, Richard did love me and he’s gorgeous, and I have other men in my life who are just as amazing, so, like I said, logic dictates that if beautiful people keep wanting to date me, then I can’t be ugly.”</p><p>“But you still don’t feel beautiful,” she said softly.</p><p>“Sometimes,” I said.</p><p>She nodded. “So you mean it, that you think we’re both pretty, because you don’t believe you’re beautiful?”</p><p>“Something like that.”</p><p>She took in some air, let it out slow, and said, “I’m sorry that I got upset and made you feel like you had to share that story.”</p><p>I shrugged, because, me too.</p><p>Richard said, “Thank you.” He looked way too sympathetic. I didn’t want sympathy from him right now.</p><p>Micah kissed me, gently so he wouldn’t be wearing too much of my red lipstick. It made me smile to see the line of red on his lips.</p><p>“The go-faster-stripe,” he said, softly.</p><p>“The what?” Ellen asked.</p><p>“The go-faster-stripe,” I said, “it’s what Nathaniel named the line of lipstick when I kiss them.”</p><p>“Nathaniel is your other . . .” she seemed lost for words.</p><p>“Boyfriend works,” I said. I didn’t add that it was the phrase I used for vanilla friends who didn’t understand our alternative lifestyle and didn’t really want to.</p><p>“So, Micah is your . . .?” again she paused for help with the right word.</p><p>“It’s okay, Ellen,” Micah said, “vocabulary for polyamory is hard, even for us.”</p><p>“I know that polyamory means loving more people, but beyond that I don’t really understand it,” she said.</p><p>“If I’m at a social event where we don’t know most of the people, then I introduce Micah and Nathaniel as my boyfriends, anything else just seems to confuse people. If we’re someplace where they understand what poly is, or at least it’s not straight vanilla, then Micah is my significant other, and Nathaniel is our Third.”</p><p>“What does third mean?”</p><p>“It usually means your live-in third partner,” Micah said.</p><p>“How do you introduce Nathaniel and Anita?” She asked Micah.</p><p>“My girlfriend and our boyfriend, or Significant other and our Third, depending on the event.”</p><p>“Then how would you introduce Richard?” she asked.</p><p>Micah and I looked at each other. He gave me a long look, letting me know this was my ball to hit. Great. “Micah has no relationship with Richard, really. Richard is never going to take me to a vanilla social event as his girlfriend, so that’s not an issue. At a more poly- or kink-friendly event, if we felt compelled to say anything, I guess, I’d say he’s my Top.”</p><p>Ellen turned to Richard. “How would you introduce Anita?”</p><p>“As my bottom, or submissive.”</p><p>I shook my head. “I’m not your submissive, I’ll agree to the term bottom, but I’m not submissive to anyone.”</p><p>Richard fought not to frown and almost succeeded. “I could argue that you are to other people, but fine.”</p><p>Ellen was watching us closely. “Okay, why did you say one thing and Anita the other? What’s the difference between bottom and submissive?”</p><p>“To me,” I said, trying not to frown at Richard, “bottom is someone who just submits, or wants to be dominated, in the bedroom, or dungeon, but outside of that they are dominant and in control.”</p><p>“That’s not a complete answer, Anita. Some people who are very dominant in every other part of their life are submissive in the dungeon and bedroom, and are still okay with the term, and say they have a dominant.”</p><p>“I’m not, because I may like to be physically dominated, but no one dominates me by will, or force of personality. To me a submissive is more than just physically dominated, it’s about giving up your will to someone else and letting them control you more completely,” I said.</p><p>“I think what you let Asher do with you is submissive,” Richard said.</p><p>“I disagree and since I’m the one getting tied up, it’s my call.”</p><p>“I don’t understand how either of you can let a vampire touch you, but Asher is submissive to Richard, so how can he also be dominant, or top, to Anita? If the two of you can’t even agree then how am I ever going to understand this?” Ellen asked.</p><p>I didn’t know what to say to her remark about vampires, so I let it go.</p><p>“It is confusing,” Micah said, with a smile and an attempt to ease her discomfort. He was ignoring the vampire remark, too. We’d take the maze one twist at a time, I guess.</p><p>I was uncomfortable, too, but if it was “make this work or give up Richard” as a part of our social group I’d muscle through it. Richard had worked his therapy hard to come to a place where he could admit what made him happy, all of what made him happy, and try to find a way to incorporate all of it into his life. He’d found the woman he wanted to have the white picket fence marriage with, but he wanted to keep the black metal spike gate, too. I wasn’t sure you could have a white picket fence with a Gothic gate, but hey, it wasn’t my life. I was only a small part of Richard’s life, as he was a small part of mine now.</p><p>“And I am totally lost that Richard says that Asher is his submissive, but he’s also Anita’s top, and Richard is her top, too. Richard says that Asher is his submissive, but Anita is only a bottom. How can you have more than one of each?”</p><p>“May I?” Micah asked.</p><p>Richard and I both said, “Yes.”</p><p>Micah smiled at Ellen. “First, Asher and Anita are both switches, which means they switch between top and bottom, but it’s more complicated than that, I’m afraid. Asher gives up almost all control to Richard in the dungeon/bedroom. He wants to be dominated in every way. Anita just wants Richard to dominate her physically with his superior strength, so she thinks of it as just bottoming.”</p><p>“But Richard says that she lets Asher do a great deal more than just use his strength. Asher . . . well, he . . .” she seemed acutely embarrassed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He ties me up and does nefarious things to me,” I said.</p><p>Ellen nodded. “Yes, that.” She actually blushed.</p><p>Since I used to blush at the drop of a hat, I sympathized. “I maintain that it isn’t what a person enjoys in the bedroom, or dungeon, that makes them submissive, but the mindset that goes with it.”</p> <p>“You go as far into sub mindset as Asher does sometimes,” Richard said.</p><p>“What’s sub mindset?” she asked.</p><p>I suddenly despaired of ever explaining this enough to her. It was like explaining color to the blind: they accept that there is such a thing as color, but they have no basis for understanding it as a reality. Either you enjoyed being tied up, or you didn’t, and if you didn’t you were just never going to understand it.</p><p>Micah stroked my thigh with his free hand as if he’d felt some of my frustration. “I don’t honestly understand that personally, myself,” he said, “but I’ve seen Anita do it. Her eyes, face, body language changes. It’s as if some tension leaves her that she holds onto in every other part of her life, except in the bedroom, or the dungeon.”</p><p>“Richard told me it’s not a real dungeon.”</p> <p>We actually did have access to a real dungeon at the Circus of the Damned, but I couldn’t make myself use it for fun. I’d seen friends chained in the place for real torture when evil vampires had been in charge of things. I knew that Richard had taken Asher to it for fun and games, but at my request Nathaniel would not go with Asher to play without me. I still had nightmares about a friend dying chained to one of the walls, and Nathaniel in there for anything was just too close to that memory.</p><p>Micah smiled, softly. “It’s just a term for the bondage side of things that go beyond just rough sex.” We’d all agreed not to cloud the issue with mentioning we did have a real dungeon.</p><p>She winced, I think at the term “rough sex.” Again, it wasn’t a good sign. How vanilla was Dr. Ellen Radborne? The thought of Richard married to someone who thought just saying the phrase “rough sex” was embarrassing, or bad in some way, made me sad for him. I knew that Richard was capable of enjoying gentler lovemaking, but he was so well-endowed that there was an element of roughness in most of his sex. How could you enjoy sex with him if you didn’t like it a little rough? Or maybe, how would Richard be able to enjoy it if she didn’t like a little rough? It just seemed sad. Why was he doing this to himself?</p><p>Some of what I was thinking must have shown because Richard looked at me. I stared into that handsome face with those high, perfect cheekbones, and male model face, and thought, he should have been able to have almost anyone he wanted, why Ellen?</p><p>“Ellen is willing to try and let me keep you, Asher, and Jean-Claude in my life, Anita. That’s a lot.”</p><p>I nodded. “Yes, yes it is.” I sounded tired even to me as I said it.</p> <p>Micah hugged me, placing his face next to mine. I cuddled into the warmth of the skin on skin contact; sometimes even touching through clothes wasn’t enough. My hands found his and one hand slid up his arm until we were half-hugging.</p><p>“Richard explained that excessive touching in public is a sign of stress, or need for reassurance between lycanthropes. What happened just now to stress you, Anita?”</p><p>I opened my eyes where I was cuddled in against the warmth and pulse of Micah’s neck. I looked at her, and it might not have been an entirely friendly look, because her eyes widened just a bit. I switched the look higher to Richard, and said, “What do you want me to say, Richard?”</p><p>“Ellen, honey,” he said, her hand in his, “that’s not excessive public display of affection for Anita and Micah.”</p><p>Ellen turned and looked up at him, eyes wide. “You’re teasing me.”</p><p>Richard shook his head and looked down at her at the same time, so that his hair fell forward and hid most of his face from me.</p><p>Ellen stared up at him for a few seconds and then turned back to us with an almost horrified look on her face. I had no idea what we’d done to earn that look.</p><p>Micah sat up a little straighter, doing more of a standard arm across the shoulders half-hug with the other hand just holding mine on the table top. I sat up straighter, too, though part of me wanted to do something even more up close and personal just so Ellen would have a real reason for looking shocked, but I wasn’t a child, and this was Richard’s problem, not mine. As one of our newer vampires, who was originally Polish, would say, “Nie Moj Cyrk, Nie Moje Malpy - Not my circus, not my monkeys.”</p> <p>Of course, the fact that he was still my lover, and still with Jean-Claude, and Asher, meant that in a way he was still a part of our circus and he, at least was still our monkey, but Ellen wasn’t. Unfortunately, one thing I’d learned about being poly is that just because you’re not having sex with someone doesn’t mean they can’t screw it all up; everyone’s lover can affect the emotional side of things and Ellen had all the ear marks of being a pain in everyone’s emotional poly ass.</p><p>I decided to go for truth. I didn’t know what else to do; besides our lives were working and that was too important to fuck with by not being honest.</p><p>“What did we do just now that bothered you, Ellen?” I asked.</p><p>Micah hugged me a little harder, as if in warning.</p><p>I glanced at him. “We can’t avoid upsetting her if we don’t know what upset her in the first place.” I looked at Ellen, and tried to look helpful, questioning, waiting.</p><p>She glanced at Richard.</p><p>“Anita has a point, if we don’t know what makes you anxious we can’t avoid it.”</p><p>She looked from one to the other of us. “I . . . I . . . it was just so . . . intimate. Holding hands, kissing, hugging, sitting close, and rubbing your faces against each other’s necks and faces. The way your hand keeps disappearing underneath the table and I can see your hand moving, Anita.”</p><p>“I’m petting his thigh, Ellen, that’s all. My hand may be close to his groin, but I would never do that sitting in public and especially not in a situation where I’m trying to help convince you that this is all somehow normal and okay. That would be rude and stupid. I’m trying not to be the first, and I’m not the second if I can avoid it.”</p><p>She blushed. “I’m sorry . . . I’m so sorry.” She stood up.</p><p>Richard caught her hand. “Ellen, please.”</p><p>“No, Richard, she’s deliberately trying to make me feel stupid and rude, and just . . . I can’t do this.”</p><p>“For the love of God, Ellen, if you don’t tell us what upset you we can’t fix it,” I said.</p><p>She shook her head. “I thought I could do this, Richard, I really did. I thought meeting Anita and seeing her with someone else she loved would make me feel more secure about it all, but it doesn’t. It just doesn’t help at all.”</p><p>“Ellen, please sit back down and talk to us,” Richard said. He still had her hand in his.</p><p>She pulled on his hand for a moment and then, as she stared down at him, her face softened. Looking at how yummy he was always made it hard for me to be mad at him, too, or had once. Being in love with someone gives them a lot of extra clout. She finally let him ease her back into her chair.</p><p>She looked at us; her eyes were shiny with unshed tears, but her voice was calm when it came. “I thought I could do this, but I don’t think I can. I love you, and you are everything I want, all I want, Richard. I was willing to believe that you needed rougher things in the bedroom than I was comfortable with, so I thought I could accept you needed someone for that and for bondage, but now I see her and you have to stop lying to me, Richard. It’s not needing to be rough, or needing bondage, it’s just her. You want to keep her in your bed, and that’s that.” The first hard tear started down her cheek.</p><p>Micah hugged me tighter, and said, “Trust me, Ellen, it is rough sex that they do together. Rougher than anything I enjoy. I accept that Anita needs some things in the bedroom that I just do not want to do.”</p><p>She stared at him and again there was that soft horror on her face. “You’ve watched . . .”</p><p>“No,” he said, very firmly, “but I’ve seen the marks on her body afterwards. Anita and Richard are not a couple in the way that you and Richard are, Ellen. He loves you, is in love with you, just like I’m in love with Anita.”</p><p>“Marks,” Ellen said softly, “what kind of marks?”</p><p>Micah looked at Richard. “I don’t think that’s my question to answer.”</p><p>Richard hugged her close and said, “Bruises sometimes.”</p><p>She looked stricken. “You beat her?”</p><p>“No,” he and I said together.</p><p>“I would never let anyone beat me, Ellen,” I said.</p><p>“Then I don’t understand,” she said looking from one to the other of us.</p><p>I looked at Richard, because I got bruised from struggling pitting my strength against his. I didn’t fight as hard as I could, and neither did he. We didn’t want to really hurt each other, but we liked seeing how far we could push it sometimes in our little rape fantasies. But there was no way I was saying the phrase, “rape fantasy,” to Ellen. That either came from Richard, or no one; besides, honestly, it still embarrassed me a little. It seemed so anti-feminist to enjoy being overpowered in the bedroom, but under the right circumstances, with the right people I loved it. I was tired of pretending about the things that made me happy in my life; I’d decided I’d rather just be happy.</p><p>“I would never allow Richard to abuse me, or any man for that matter,” she said.</p><p>“I am not an abuse victim, Ellen. I’m not a victim at all. I own my sexuality in every sense, and I top some of the men in my life. It’s not just me on the receiving end of the rough.”</p><p>“You abuse some of the men?”</p><p>“It’s not abuse.” I was getting pissed and trying not to be.</p><p>“You hurt each other. How is that not abuse?” she asked.</p><p>“This is my sexuality; it’s what makes me happy. You saying that it’s abuse is insulting; it would be like me saying that your idea of sex is boring.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“How do you know what kind of sex I enjoy?” She looked at Richard.</p><p>“I didn’t say anything about our sex life to anyone,” he said.</p><p>“I’m assuming some things from your reaction, Ellen, that’s all. I hope I’m wrong for your sake and Richard’s.”</p> <p>“Wrong about what?” she asked.</p><p>“Your idea of sex.”</p><p>She squirmed in her seat, and wouldn’t meet anyone’s eyes. “It’s none of your business.”</p><p>That was it for me. “You sit there and demand that we tell you intimate things about our sex life, our relationships, but you share nothing. You get all embarrassed, why can’t we be embarrassed, too?”</p><p>She looked startled. “I just thought . . .”</p> <p>“Thought what, that because we like kinky sex we can’t be embarrassed?”</p><p>She glanced at Richard, then back at me. “I guess I assumed that if you were this open it didn’t bother you to talk about it.”</p><p>“It doesn’t bother me to talk to my sweeties, but to someone who I’ve just met and who is judging every word I say, yeah, it bothers me.”</p><p>“I’m not judging you,” she said.</p><p>“Aren’t you?”</p><p>Micah hugged me a little harder. “It’s okay,” he said.</p> <p>“No,” I said, “it’s not.” I looked at Richard. We had a moment of looking deep into each other’s brown eyes, but it wasn’t a love look, it was a soul-searching one. The look you give someone that you know well, or did at one time, as you’re wondering what the hell they’re doing to their lives. Richard had finally worked through his issues so it was nice to have him in our lives again, and part of me wondered if Ellen was his new way of denying himself. It was a nice way of setting himself up to withdraw from the bondage and the rough sex without admitting that he was conflicted. He wouldn’t be conflicted, he’d be giving it all up so he could be married and have that white picket fence dream. Was it possible to lie to yourself so well that you didn’t realize you were doing it? Hell, yes. I’d done it myself for years.</p><p>“There,” she said, “that look, how can I not feel threatened when the two of you have such a strong connection?”</p><p>“We weren’t looking lovingly into each other’s eyes, trust me on that,” I said and cuddled in against Micah. I just wanted to leave. I was so done with this conversation.</p><p>“Then what did that look mean?”</p><p>I shook my head.</p><p>Richard answered, “Anita is wondering why I want someone who is so uncomfortable with so much of my life, right?”</p><p>“Yes,” I said and looked at them both.</p><p>“It’s just sex, not his whole life,” she said.</p> <p>I gave Richard very direct eye contact, and raised an eyebrow at him.</p><p>“What?” she asked, “What is that look you’re giving each other?”</p><p>“If you believe that sex isn’t that important to you, that’s your choice, but . . .” I stopped without finishing the sentence.</p><p>“But what?” she asked.</p><p>I looked at Richard.</p><p>“Just say it, Anita,” he said.</p><p>I sighed, Micah squeezed my hand. “But if you believe that sex isn’t important to Richard . . . that would be a mistake and not true.”</p><p>“I don’t understand,” she said.</p><p>Richard took her hand in his, and gazed into her eyes. “I love you, I want to spend my life with you and have children with you. I want to go to PTA meetings and Boy Scout meetings, and do all of it with you.”</p><p>She wrapped her smaller hands around his. “Oh, Richard, I want that too, so much.”</p><p>“But to have all that with you, and be happy, I need certain things that you don’t want to do.”</p><p>“Why is it wrong that I don’t want you to tie me up and hurt me?”</p><p>“It’s not wrong,” he said, “but it’s also not wrong that I want and need to do that with someone.”</p><p>“I don’t understand that,” she said.</p><p>“I know you don’t, honey, but can you accept that it’s true for me?”</p><p>“You’re asking me to let you have sex with Anita and then come home to me as if it’s all normal.”</p><p>“Yes, that’s what I’m asking.”</p><p>“You selfish bastard,” she said, and she was crying again. She took her hands out of his and this time he let her do it. She stood up and gave him a look of rage and disgust that must have been like a knife through his heart. “Are you honestly saying, that if I don’t say yes to all this perverted sex that you won’t marry me?”</p><p>The tables near us were beginning to notice the show, and trying to act as if they hadn’t heard that oh, so, provocative sentence.</p><p>We had Richard’s face in profile. He swallowed hard enough that we heard it, and then he said, “I’ve worked too hard to accept who I really am. Ellen, I can’t go back to hiding. I can’t go back to lying to myself.”</p><p>“So you are choosing her over me,” Ellen said.</p><p>“No, I’m choosing myself,” he said.</p><p>She aimed that rage at me. “You must be incredible in bed for him to throw everything away. I guess I can’t compete with a fur banging, blood whore.”</p><p>Micah pressed his arm against my shoulders, holding me in my chair, because I had started to stand. “No,” he said.</p><p>He was right, because if I stood up I wasn’t sure what I was going to do -- nothing good.</p><p>Richard stood up. “That was an ugly thing to say.”</p><p>“It’s the truth, isn’t it?”</p><p>“If she’s Jean-Claude’s blood whore, then so am I,” he said.</p><p>Ellen stared at him; her face didn’t seem to know what expression it wanted to have, as if so many thoughts were chasing around her mind that she didn’t know what to do.</p><p>“You don’t have sex with him. You told me you don’t have sex with either of the vampires.”</p><p>He leaned in and spoke low, so the other people around wouldn’t hear. Some of the people at the nearest tables were trying not to stare; others were openly watching. He bent closer to her, and said, “Just because no one sticks their dicks in each other doesn’t mean it’s not sex.”</p><p>She slapped him, hard enough for it to echo in the suddenly silent restaurant. Everyone was looking now; it was too good a show to look away. Richard hadn’t done anything to protect himself, he’d just let her hit him. If a man had done the same thing to a woman someone would have been calling the police.</p><p>Richard stood up straighter, taking his face out of her reach. “I love you, Ellen.”</p><p>“I hate you, Richard Zeeman, I hate you for making me love you, and for this . . .” she gestured at me and Micah, though I think we were just representative of the problem.</p><p>She started to sob, put her hands over her face and then ran towards the archway and the door beyond. I honestly expected Richard to follow her, but he just stood there with his cheek reddened from her slap. She was outside in the sunlight now, hesitating on the sidewalk, looking behind her. She kept looking back, and I realized she was expecting him to run after her. When he didn’t appear there, she turned toward the window. Richard didn’t turn around. He didn’t see her on the sidewalk. He didn’t see her look in through the windows at him. Ellen had expected him to follow her. I think she’d seen running out as an escalation, but not an end, and if he’d gone after her, she’d have been right. The look on her face as she realized he wasn’t going to follow was one of raw pain.</p><p>Micah touched my arm, which made me look at him. He looked at me and I knew the look. I was supposed to do something.</p><p>I said, “Richard, if you don’t follow her . . .”</p><p>“It’s over,” Richard said.</p><p>“Yes,” I said.</p><p>“I know,” Richard said.</p><p>I looked at his very straight, very still back, and then turned to the window. Ellen was looking at him, as if willing him to turn around, but he didn’t. She walked out of sight, fresh tears streaming down her face. Richard didn’t follow her.</p><p>THE END </p> </body></html>"]