["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I.</p><p>“Father, are you mad? Beatrice of Callaway is barely ten years of age!” Bernard of Derkland frowned and finished off his tankard of ale, wishing his father would leave off grousing at him. If they’d only have one conversation where the man did not bring up suitable wives...!</p><p>“Aye, but if one judges by her mother, in five years she’ll be a good breeder—and a generous dowry she brings.” Lord Harold turned to look out over the rows of diners eating in the great hall of Wyckford Heath. They were guests at the week-long celebration of the wedding of the Lord of Wyckford’s youngest daughter. “What of Theresa, daughter of Lord Enderman?”</p><p>Bernard gaped. Was not his parent supposed to have some care for him? “Father, would you have that horse-faced shrew in your wedding bed? An’ she hasn’t a brides’ portion big enough to make one forget that her temper is worse than a goat in heat.” He drummed his fingers on the rough trestle table.</p> <p>His father chuckled and traced the outline of his mouth with a thumb and forefinger. “Mayhaps you speak the truth on that. Even the dogs slink away when she walks thither.” He chuckled again and bit off a chunk of roasted venison from its cross-shaped bone. Chewing thoughtfully for a moment, he drew his bushy grey brows together as if deep in thought. A moment later, his brows sprang apart as a new idea lit his face. “Mathilda, Lady Cretton, has a generous bride’s price an’ she is not hard on the eyes. What say you that, Bernard? I’ll speak to her father on the morrow.”</p><p>“Only if you would like to find your firstborn son dead of mysterious causes,” Bernard shot back. “All the wagging tongues say that she helped her first two husbands to an early grave. I’d as lief not be the third.” He stood, stepping backward over the long bench that lined the trestle table at which they ate. “Father, I know that ’tis important that I wed, but I should prefer to choose a bride of my own liking.”</p><p>“An’ choose her you shall, if you make a decision anon. ’Tis past time you wed, and if you do not make your choice, I will make one for you.” Harold’s countenance took on a firm cast that brooked no disagreement from his son.</p><p>In truth, Bernard knew that the time for equivocating was gone. With his younger brother Dirick haring off with the new king in Aquitaine, and their middle brother wearing the robes of a simple monk, the necessity of wedding and breeding weighed heavily upon him. At one score and seven, Bernard had no excuses to offer. Duty beckoned.</p><p>“Aye, Father. I’ll begin to attend to it during our stay here.”</p> <p>With a curt nod, he strode off, out of the hall, pushing past the throngs of people and stepping around the begging hounds. He took long, hard steps that bespoke of his height and solid build, and as he left the noise of the hall behind him, his boots made echoing thumps in the empty passageway.</p><p>If ’tweren’t dark, and he weren’t in unfamiliar territory, Bernard would mount his stallion and ride to clear his head. As ’twas, he could only visit the stables and talk to his favorite horse, Rock, and save the ride for daylight.</p><p>At times, the weight of being heir to the vast lands of Derkland weighed so heavily upon him that he wished for the freedom of his brother Dirick, who could travel and live his life as he wished. But then that weight would lessen as he recalled that his own brother had naught to bring to a beautiful lady whom he might wish to wed, and that his prospects would not be near as numerous as Bernard’s own.</p><p>And he did love Derkland, Bernard reflected as he slipped into the stables, with all of her rolling green hills and thick forests, tiny thatched huts and fat woolly sheep. But most of all, he loved the soft brown noses of the fierce destriers that Derkland bred—the heavy, stamping hooves that made even his bulk seem insubstantial, and their smart, shrewd eyes. There were none better than those from his father’s stables, and none better than his own Rock, the grey-brown steed that rode and kicked and fought as solidly as its namesake.</p><p>The animal was glad to see him, and although he wasn’t as gentle as a mare, he did toss his jet black mane and dance in greeting. Bernard shared some aged carrots and an apple core he’d sneaked from the kitchen earlier that day, patting Rock’s velvety nose with affection.</p><p>A soft cry from the depths of the stables reached his keen ears, even over the whuffling and stamping of the horses. Turning instinctively, Bernard thought to investigate, then halted. ’Twas likely only a man-at-arms finding his pleasure with one of the buxom serving wenches that adorned Wyckford Heath Hall. The piles of hay in a stable were warm and soft, if a bit prickly to the one on the bottom, and as good place as any to find privacy with Wyckford Castle being filled to the rafters by wedding-goers.</p> <p>Bernard returned to Rock, allowing him to butt his head against his unshaven cheek, but keeping his ears attuned to from where the sound had come. He tried to return his thoughts to the path upon which they should be focused—finding a wife for himself, for his father’s threat was not an idle one—but something nagged in the back of his mind.</p><p>At last, with a frown at his foolishness, he gave Rock a quick pat and walked silently toward the back of the stable. In the event that it was just a randy man-at-arms rolling in the hay with his lady, Bernard could slip away silently with no one the wiser. But if, as the upright hair at the back of his neck warned, ’twas something more....</p><p>A dim light shone in the depths of the stable, and as he turned a corner, he found himself in a small room, lit by a torch on the wall.</p><p>A girl sat in the hay, her skirts bunched around her as she bent her attention to something he could not identify. Her back was to him, with a long braid that fell from an intricate headdress that did not belong to a serving wench.</p><p>She turned, saying, “Leonard, if you would—” Her words ended in a small gasp as she caught sight of Bernard.</p><p>As she scrambled to her feet, her eyes wide in a face shadowed by the flickering torch, Bernard noted that she was more than a girl, and most definitely not a mere serving wench. Even in the low light he could see the quality of her gown, and the glitter of some jewels in her hair and at her well-rounded bosom.</p><p>“My lady, I did not mean to disturb you,” he began, not quite certain how to proceed as she looked at him with such fearful eyes.</p><p>He knew that his great stature and solidness was oftentimes disconcerting for women. Something about this female who, though fear shone in her eyes, stood as tall as her height allowed, made him particularly conscious of his imposing appearance. He stepped backward to put space between them. “I meant only to assure myself that naught was amiss. I heard a sound that sounded like distress, and thought to see if I could be of assistance.”</p> <p>She had a heart-shaped face, angelic and delicate, with ropes of honey-gold hair that glinted even in the flame-light. As he stood there, caught suddenly by her beauty, he saw the fear lessen in her eyes. “You heard my cry?” she repeated, her head tilting slightly, as she seemed to turn the words over in her mind. “You would have come to my aid?”</p><p>“Aye, of course, my lady,” Bernard replied. He didn’t stumble on the form of address. It was obvious she was of noble title—but what was not so clear was why she was in the stables, alone, during a wedding celebration. And what was she doing in the hay?</p><p>Curious, he took a step forward without thinking about how this would affect her—but she did not move away and only gave the barest flinch as he came closer. “What do you here?” he asked.</p><p>She did not need to answer, for at once he saw for himself the large grey cat ensconced in the hay. Five tiny kittens, barely covered with fur, and eyes still shut, nursed whilst the mother watched Bernard crouching next to her.</p><p>“They were born only today, and I came to see how they fared,” the woman spoke, still standing behind him, now with the height advantage. “Cleome—’tis the cat’s name—had a foot injured by one of the dogs, and ’twas only because Leonard, the stable boy, intervened that she lived to deliver this litter.”</p><p>Bernard reached to pet the mother cat. The woman warned him—“Nay, she will scratch!”—but became silent when she saw Cleome’s eyes barely flicker as Bernard traced a large finger over the top of her pointed head and down to rub her side.</p><p>“’Tis a miracle,” she murmured, watching as his hand traced the thick fur down to Cleome’s tail again and again. His hand was so wide and brown that it nearly covered the cat’s entire abdomen, and she watched with mingled fear and fascination as such a powerful appendage was used so gently.</p><p>I should be afraid, Joanna realized dimly, of this great man whose presence had filled the doorway. But she was not, and that was in itself a unique experience. Instead, she sat quietly on a stool Leonard had put in the corner and watched as he stroked the cat in silence, thanking the Virgin that she’d already covered the parcel in the corner with straw.</p><p>She glanced briefly toward the shadowed corner to reassure herself that it would not be noticed, then returned her attention to the countenance of the man, noting the tight, dark curls that covered his head in an unfashionably short style. His face was lean and sober, with deep-set eyes that had held no challenge when he’d greeted her earlier. The tan of his hand was echoed in the color of his face, and the wiriness of his dark hair in the short-clipped beard and moustache he wore.</p><p>“You have a gift,” she said at last, breaking what had become an easy silence.</p><p>He nodded once, turning a glance toward her that lingered over her face. “Aye. ’Tis my blessing that animals find no fear of me. My father—”</p><p>He was interrupted by the sound of someone approaching, and Joanna stood with a sudden fear clutching her middle, unable to keep a small gasp from her throat. God and the Virgin help her if she were discovered alone with such a man.</p><p>It was Leonard this time, thank Mary, and the discomfort in her stomach eased. But she must return to the keep now, for she’d been away too long and did not want to be missed.</p><p>Now ignoring the giant man, who watched her as she spoke to the stable boy, she told him to keep watch of the litter and where to move them should aught disturb the mother and her kittens. Then, with a quick glance at the giant, she dropped the slightest of curtseys and began to take her leave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“My lady, allow me to escort you to your destination,” he offered, extending his arm.</p><p>“Nay!” Joanna took a breath and continued, “Nay, sir, but I must not be seen with—not be seen with anyone. I can find my way without assistance.” She bent to gather her light cloak and, doing so, noticed that one of her braids had fallen from its mooring. Joanna bit her lip and reached behind to re-fasten the recalcitrant braid, knowing that if she returned to the hall and it was noticed, she would be the worse for it.</p><p>The giant stepped toward her, behind her, towering over her small frame as she attempted to twist her arms in the most awkward position.</p> <p>“Allow me, my lady.” His smooth voice, warm and deep, seemed to slide over her like a fur cloak. Her heart pounding, Joanna forced herself to remain still as his warm, deft fingers relieved her own of the rope of hair. In a trice, he had found its place and secured it with one of the jeweled pins her maid had used earlier. Then, mercifully, he moved away.</p><p>“Th-thank you, sir.” She hated that her voice quavered, but ’twas so foreign to have a man so close to her, so gentle, yet so imposing. “And now, I must return.”</p><p>Bernard could only watch her go, hurrying down the hall of the stable. Though he felt uneasy with her request to let her go alone, he abided by her wishes and stayed until she was safely out of sight.</p><p>Then, he turned to Leonard, the stable boy who now knelt beside the grey cat, and asked, “Who is the lady? What is her name?”</p><p>“’Twas Lady Joanna, my lord.”</p> <p>Bernard bit back a grin. At the least the young boy had recognized his station, although the Lady Joanna had not. “An’ how does she know this stable so well?”</p><p>“She is my lord’s daughter—the Lord of Wyckford’s daughter.”</p><p>“The sister of the bride, then?”</p><p>“Aye, my lord.”</p><p>Then Bernard suddenly remembered that he had been invited to a wedding, that his father would surely miss him by now...and that he had dallied long enough.</p><p>And, at the nonce, he would search out the lady to see if he could find her within the keep.</p> <p>Unfortunately for Bernard, when he returned to the great hall, most of the men—bridegroom included—were in their cups, and the celebration had begun to wane. Since the musicians had begun to disperse,and the dancing slowed—and even the wine and ale began to dry up—the only entertainment that remained was to see the bride and groom off to the bridal chamber.</p><p>’Twas of little interest to Bernard to see the spindly-legged groom stripped naked and escorted to his bride’s chamber, but he did not decline too strongly and soon found himself within the group of men doing just that.</p><p>They made the usual bawdy jests, drank from jugs of ale and attempted to force more down the throat of the already dazed groom as others helped him out of his tunic, undertunic, and chausses.</p><p>“Give ’er all ye got,” encouraged one man, slapping the groom on the bare skin of his back.</p><p>Another gestured to the groom’s flaccid member, chortling, “Ye might need some help, there, eh, Will? Just call out and I’ll step in your place.”</p><p>“Eh, I trow Will will keep the bitch in line,” grated a voice next to Bernard. “Don’t need much more than a raised hand—an’ she’ll be doin’ your bidding as you please.” The man, obviously well into his cups, swayed against Bernard, causing his perpetually-full cup of ale to slosh onto his tunic. “Have a care, sirrah,” he warned, leaning threateningly into Bernard’s face. “Ye’ve spilt on my new tunic!”</p><p>Bernard, hardly able to breathe from the stench of ale emanating from the man, chose to ignore the rough drunkard and turned away. Aside of that, he’d recognized the man as Lord Ralf, one of the sons by law of Lord Wyckford, and allowed that the man had probably been celebrating the wedding for far longer and more deeply than he should have.</p><p>When Bernard felt a hard shove from behind, however, he whirled, automatically clapping a hand to where his dagger hung. “Aye?” he asked, coming face to face with the drunkard. “Did you wish to speak with me?”</p> <p>The man’s eyes were nearly at a level of Bernard’s. There was a hard light behind the ale-glaze in them. “I said that ye spilled ale on my tunic, sirrah, and I would expect you to make recompense.”</p><p>“’Twas your own clumsiness that caused it, man. Do you not make a mistake you will later come to regret,” Bernard responded easily, but he allowed a hard warning to flare in his eyes. It was probably best not to participate in a scene with one of the family at a wedding celebration, regardless of what a cock-licker the man was.</p><p>From the belligerence in the other man’s face, he knew there might have been more of an altercation had not Lord Wyckford announced that the bridal chamber was ready to receive the groom. With a lethal look at Bernard, Ralf pushed none-too-gently away from him to stand beside Will, the groom.</p><p>The group of men tottered along the passageway, trading more bawdy comments and suggestions for Will, and Bernard followed their progression. He’d realized somewhere along the way that as sister to the bride, the young woman he’d met in the stables would likely be there at the bedding ceremony.</p><p>The door to the bridal chamber opened, and a flood of men pushed their way in. Joanna stood near the fire, chafing the icy hands of her sister, the bride, who was about to be disrobed.</p><p>The scents of men and ale and smoke filled the room, along with that of stale, panting breath and loud exchanges. Joanna felt a familiar wave of anxiety at their closeness, the crowdedness of the chamber, and her sister swayed slightly, clutching at Joanna’s hand in the folds of her gown.</p><p>“Shh, ’twill soon be over,” she murmured into Ava’s ear, smoothing a hand over her shoulder, even as she curled the fingers on her other hand into a tight fist. “And when you and Will are alone—”</p><p>“Bring forth the bride and groom!” intoned the priest, pushing through the crowd of men.</p><p>Waves of bawdy laughter and noises rose and roared, filling the room as the men shoved Will forward. The slim man stumbled but caught himself on the tall spindle of the bed and leered at Ava with the vacant eyes of one who had imbibed overmuch.</p><p>Joanna gently pushed her sister forward, and, blocking from her mind the memories of her own wedding night, began to assist her maid Maeve in removing the bride’s clothing. She hoped to make the moment as brief as possible for Ava’s sake, although what would happen in the chamber thereafter mayhap could be worse.</p><p>Ava’s jewel-studded girdle jangled to the floor, and Joanna reached to pull the fine overtunic above her head. After handing it to Maeve to fold, she turned to unlace the sides of the bridal gown. As she moved around to the far side of Ava, she glanced for the first time toward the sea of ogling male faces. Her attention fixed on one for the merest instant and her insides froze.</p><p>The man from the stable.</p><p>Joanna’s heart slipped off its beat, then returned to a faster pulse. Her fingers became clumsy and it took her twice as long to unlace the second side as it had the first. What was he doing here? Dear God, if Ralf were to learn that they’d met, or even spoken...if the big stranger made any sort of gesture of familiarity toward her—</p><p>She felt the color drain from her face as her stomach churned with fear. Mary, Mother of God, please help me.</p><p>But mayhap Ralf wasn’t here...mayhaps he lay in his cups somewhere....</p><p>She raised her hands to lift the gown over Ava’s head, and felt her own wide sleeves slip back to her shoulders, baring her slim arms. Maeve took the bundle of fabric from her and Joanna turned to the last bit—the light, fine linen chemise that hid very little of the curves and dark areas of Ava’s body. Knowing it was all that much easier if it were quick, she bent to take the hem, lifting it smoothly and easily up and over, leaving Ava beautifully nude in the midst of gaping, gawking, groping men for the merest instant. Maeve was mercifully quick with the fur-lined cloak, throwing it over Ava’s shoulders and masking her nakedness.</p><p>Someone pushed Will, who stumbled again, this time into his bride, nearly knocking her over. The noise of hoots and whistles deafened Joanna, once again, bringing her back to the terrifying memory of her own wedding night. Firmly pushing the thoughts away, she returned to her work and drew the blankets back from the bed, then assisted her sister to slip under the coverings as quickly as possible. Now, she could do naught for Ava but pray that ’twould end soon, and that her husband would have a care when they were alone.</p><p>Backing away, nearer the fire again, Joanna watched as the priest raised the arms of the groom for all to see his nude body.</p><p>“There appears no reason that the groom should be unable to fulfill his marital duties,” intoned the priest, and the room erupted with taunts and whistles as the evidence of Lord Will’s virility swelled and rose to attention.</p><p>“Now, to bed with thee!”</p><p>Joanna turned to slip out of the room and came face to face with her husband.</p><p>“My lord,” she choked. What she had feared was in his eyes—glassiness, but behind it, glinting sharply, lust.</p><p>“My tunic has been soiled,” Ralf grated, his hand slipping around to grasp her arm. “You’ll come to assist me in removing it.”</p><p>“Aye, my lord,” was all she could say.</p><p>Each of his fingers was a separate ridge, biting into the tenderness of her upper arm, and Joanna held back a wince as he propelled her toward the door way. Mother of God. She prayed silently—prayed that the man from the stable would not acknowledge her, prayed that Ralf would become distracted from his purpose, prayed that his overindulgence would get the best of him.</p><p>One, at least, of her prayers, was to be answered.</p><p>As they passed through the doorway, Joanna came briefly face to face with the giant from the stables. His expression was unreadable but his eyes caught and held hers for the barest of instants before she dragged her own gaze away as Harman directed her toward her fate.</p><p>Mercifully, the man said naught.</p><p>But Joanna could feel the weight of his stare behind her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>II.</p><p>Until she’d raised her arms to assist the bride in removing her chemise, the Lady Joanna had entranced Bernard with her shy beauty and graceful movements. He knew of her soft heart just from their moments in the stable. The manner in which she’d treated him when she thought him less than a lord and the care for which she’d shown a mother cat told Bernard all that he needed to know.</p><p>In the bridal chamber, he’d stood to the side, sipping, not gulping, the bitter ale that must have come from the dregs of the barrel, watching her, suddenly wanting her...knowing that he must have and protect her. He saw the way candlelight glinted off her rich, honey-gold hair, wanted to touch the creaminess of her half-shadowed skin, and felt the desire to feel her small hands cover his broad chest.</p> <p>It was a miracle that after so long, and so many women, after so much nagging from his father, that he should find the woman he had to marry this suddenly. And he knew, clearly, that it would be she.</p><p>And then, Lady Joanna had raised her arms to help Lady Ava off with her chemise. And Bernard found his attention fixed not on the newly-bare body of the bride, but on the slender, upraised, bruised arms of her sister, Joanna.</p><p>Black and purple marks patterned the upper portion of her arms, both of them, leaving no doubt as to their origin. Bernard felt the loud, crowded chamber slide away, leaving him cold and stunned that someone—for it had to be someone; ’twas no accident, those markings—could have inflicted such pain upon a small, fragile woman.</p><p>He’d hoped to talk with her, to find a moment where he could ask her what or who....but ’twas not to be. As soon as Joanna moved to leave the bedside of her frightened sister, she was accosted. Nay, claimed.</p><p>Ralf. The whoreson.</p> <p>Bernard could barely control his rage at the realization that this low-bellied snake not only had some claim to Lady Joanna, but that he doubtless had inflicted such bruises upon her person—or if he did not, then he knew who had.</p><p>It was all Bernard could do to allow the couple to pass by him at the chamber door, and remain passive. He looked closely at Joanna, catching her eyes—soft blue ones glazed with anxiety—as she passed, trying to send the message that he would stop them if she wished.</p><p>The way her gaze flickered away instantly bespoke of her fear, and Bernard forced himself to remain still, tightening his hands into painful fists, knowing that any action on his part would bear more ill toward Joanna.</p><p>They left, and Bernard had no choice but to follow the remaining men from the chamber. A heavy sickening settled in his belly as he stomped along the hallway with the other men.</p><p>It took only one question to ascertain what he’d inherently known: Lady Joanna was wed to Ralf, Lord of Swerthmoor.</p><p>The next morn, Bernard woke with a head fuzzy from little sleep and too much ale. The last person he wished to see, however, was waiting as he stumbled from his pallet. Bernard was not the last of the men to rise, but near enough to it that his father must call attention to that fact.</p> <p>“Good morrow, dear son,” spoke Lord Harold Derkland, looking up at Bernard, but somehow managing to appear the taller. “And how fares your head this morn? ’Twould be what I’d expect from Dirick—such overindulgence—but not that I’d see from you.”</p><p>“Leave me be,” growled Bernard, brushing past his father on a mission to splash his face with water in hopes of washing the fog away.</p><p>His father chuckled, but followed along. They picked their way among the pallets scattered over the rush-strewn floor in an antechamber of the Great Hall, taking care not to tread upon any outstretched hand or foot of the snoring men. “I’ve found a wife for you, Bernard.”</p><p>By the time his father spoke the unwelcome words, Bernard’s face was inside a barrel filled with water so that he did not have the breath to bellow his discord. But when he pulled up, whipping his head back so that water sprayed even from his short curls, he turned to level a glare at Harold.</p><p>“Aye? I’ll find my own bride, I’ve told you.” He swiped the arm of his tunic over his beard, then passed his hand over the top of his head. More water rained down over his face, and he wiped it again.</p><p>“So say you, and you haven’t even looked at one yet,” Harold griped. “But the one I’ve found is all that you’d ask: well-landed, no history of ill-fated husbands, and quite easy on the eyes.”</p><p>“Father—”</p><p>“Maris of Langumont, she is. And her father is a good man. She’d make you a fine bride, son.”</p> <p>Bernard drew in a breath and tamped back his annoyance. Father meant only for his good welfare...and he could not know that Bernard had already found the woman he wanted to marry. ’Twas not the fault of his father that she was already wed.</p><p>“Father, I beg you. Please leave off—at the least for today.” He had to find Lady Joanna...he had to speak with her, if for no other reason than to see that she truly was the woman he believed.</p><p>Lord Harold allowed his son to take his leave, but only after wringing a vow that Bernard would sup with himself and Lord Merle of Langumont that evening.</p><p>“Aye,” growled Bernard. “Anything to remove the leech that is my father from my neck.” He stalked off, ignoring the grating chuckle that echoed behind him.</p><p>Out side of the keep, the sun shone hot and bright—enough to make Bernard wince and his head throb all that bit more. His feet took him toward the stable, and that was as good a destination as any. If luck was with him, Bernard would find Lady Joanna tending to her cat. If not, then he would visit with Rock and hope that Leonard would have some information for him.</p><p>Just as he was about to step into the welcome dimness of the stable, however, Bernard happened to glance toward the small herb garden that grew plentifully behind the structure. God must have caused him to do so, he thought, shifting his direction so that he was now walking toward the honey-gold head that bent over some small bush in the garden.</p><p>And God was indeed with him, for ’twas Lady Joanna who hovered over a growth of lavender.</p><p>She started and sat back quickly on her heels when his shadow cast over her task, and when she looked up and saw that it was he, she stumbled over her skirts, trying frantically to get to her feet.</p><p>“My lady,” he said gently, proffering a hand to steady her. “I mislike that I have only to step near you and you are falling about yourself to get away from me. ’Tis not the reaction I desire.” He spoke without jest, seeing the apprehension in her face. “Why is that so?”</p><p>“My lor—Sir, I—’tis only that—”</p><p>He stepped forward to grasp her small hand—which she had not extended toward his offered one, closing his fingers around her smooth skin. “You may call me ‘my lord,’ Lady Joanna. I am Bernard Derkland...and I am most delighted to know you.” And then, without giving a thought to her reaction, he slid his hand up her arm, pushing up the sleeve of her gown nearly to her shoulder. Rage surged through him anew at the sight of the bluish-green, black and purple mottles on her creamy skin.</p><p>“I would kill he who would do this to a woman,” he breathed through teeth clenched so hard that his head hurt. “Joanna, who?”</p><p>She had already jerked away, stepping on the fragrant lavender. Her determined actions and expression showed him that she was not the simple, cowering woman she appeared. “Leave your hands from me, and your interests thither, Si—Lord Bernard. Please. There is naught that you—or anyone—can do. And do not call me Joanna!”</p><p>“My lady, I—”</p><p>“Nay!” Her voice rose even as she pressed her hand against his chest. This movement stilled him, this first time she reached to touch him—though the message of the touch was naught but a rebuff. “Nay, my lord, your interference would serve only to incense him further...and make it all the more difficult for me.”</p><p>Then, as though realizing where they were, she whirled to look toward the stable and the bailey as if afraid they might have been seen. Fortunately, during the course of their conversation, they’d moved behind a cluster of raspberry bushes and were out of sight of anyone walking toward the stables. The scent of the crushed lavender hung in the air, along with the faint perfume of roses. “Please, Lord Bernard, if he were to find us...”</p><p>“Is it Ralf? Is he your husband? Is it he who lays his hand upon you thus?” Bernard reached, gently closing his fingers around her cleft chin, reveling in the warmth of her sun-drenched skin. He looked into her eyes, past the gray-blue color of her irises and into their depths. He saw fear and anxiety, but he did not see repulsion or anger. He breathed a mental sigh of relief. She was not afraid of him.</p><p>“Aye.” Her voice was but a breath, but it was all he needed.</p><p>“Then I will rid you of him. And you shall be free to wed with me.” His words were soft, steely, and deadly serious.</p><p>“You—but Lord Bernard, you cannot! Wed with you?” Her shock at the first part of his threat seemed to disintegrate as she fixated on the latter promise. “Wed with you?” Shock lined her beautiful, heart-shaped face as she looked up at him, hands raised in front of her as if to thrust him away. “Are you mad? I am wed, and—and you know naught of me to say that you will marry me.”</p><p>Bernard laughed in spite of the unhappy situation. She was so incredibly lovely. And she had a spine, she did, under the weight of the fear from her own husband.</p><p>If Bernard could indeed remove that fear from her eyes, she would make a fine wife...and a fine chatelaine for Derkland Castle.</p><p>“Lady Joanna, I know as much as I need know that you are the woman I have waited to marry. My father has groused at me for over the last fortnight and now that I have found you, I will find a way to please him and marry you at the nonce.”</p><p>She sank to the ground, not as if in obeisance, but as though her legs could no longer hold her up under the weight of this conversation. Bernard knelt next to her, taking care not to tread upon her skirts, but arranging himself closely enough that he could smell the femininity of her scent. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Lord Bernard, you truly know nothing of me. How can you? We’ve met naught but once....” She raised her face to his and his breath caught in his throat at the hunger in her eyes...the hunger, he saw, not for him as much as to know that there was something of herself that he should want.</p><p>Fury seized him at the thought of this beautiful creature being abused by the man who should have been her protector, and even her love...and the realization that she thought herself unlovable. He quelled the anger that rose inside him, taking care to keep his expression easy and calm. It wouldn’t do for him to give her cause to fear him as well.</p><p>“I know that you are the most beautiful woman I have ever seen,” he told her quietly. Then, with the flash of jest, he added, “with the exception of my mother.” He pretended to think for a moment, then added, “Nay, you are even more beautiful than she.” Her smile came and went, leaving more than a trace of sadness in its wake.</p><p>“I have never met my mother, as she perished birthing Ava when I was but two summers.”</p> <p>Bernard closed his fingers over her hand resting on the ground, feeling the warmth of her next to the cool moistness of the rich earth. Somehow he knew it was of grave importance to make her feel as beautiful inside as he found her appearance. “In our brief meetings, I’ve learned that beyond your lovely face and beautiful form, you are a kind-hearted woman who would put her own comfort and safety at risk for the life of a cat and her litter. I know that you speak well even to serfs such as the lowly stable boy Leonard. I know that you care for your sister and wished to spare her any angst that might have come her way on the night of her wedding. I know, too, that you are brave enough to stand up to a man when you are not trapped with him by marriage—which means that you are not foolish in your bravery, only prudent. And I know that my heart has been yours from the moment I pinned your thick, heavy braid into your hair last even, smelled the lavender water you must use, and felt the softness of your skin.”</p><p>He looked into her eyes—eyes that now held wonder—and said, “That is all I need to know, Joanna.”</p><p>“My lord....Bernard....” she breathed, her fingers twisting in his to cling to his hand. “I....”</p><p>“I vow to you, Joanna, on the life of my father and mother—and my own—that I will find a way to free you from the ties by which you are bound. And then, if you will have me, I will wed you and care for you and love you all of our days.”</p><p>The perfume of the roses about them touched his nose, mingling with that of the crushed lavender and Joanna’s own erotic scent. It was too much for him to resist—he leaned forward to taste her parted lips.</p> <p>She trembled under him, and moved not at all but for that slight tremor, so he forced himself to barely brush against her mouth, taking care not to drag the bristles of his beard and moustache too harshly over her tender skin. Joanna’s lips were sweet and plump and warm, as he’d known they’d be...and she tasted of mint and strawberries—or something like them.</p><p>Or mayhap ’twas just her. Just Joanna.</p><p>When she began to pull back, he allowed her to do so immediately and took a deep breath to slow his racing heart. “And now that I know you taste like heaven,” he murmured, the intensity of his emotions coming out as a crooked smile, “I am thrice as indebted to my vow.”</p><p>Knowing they’d tested Fate long enough, and not able to trust that he wouldn’t put her to the test again, he pulled to his feet. “I must leave you now, Joanna. But know that you are not alone...nor will you be.”</p><p>III.</p><p>Joanna started when her husband strode purposefully into their chamber. She sat near the window-slit of the room that had been hers before she married and moved with Ralf to Swerthmoor, mending a rent in his garment by the dim light.</p> <p>“What do you here?” Ralf said in his rough, grating voice as he slid his sword from the sheath around his waist. He took his time, allowing the steel to scrape slowly and deliberately over its metal casing.</p><p>The hair at the back of Joanna’s neck rose, prickling, and her breath quickened though she tried not to show it. “I but sew the tear in your tunic, my lord.”</p><p>He stepped closer, his booted foot ringing solidly on the stone floor and causing her stomach to churn. Joanna clamped her lips together as she continued to sew, her fingers clumsy with tremors as he stood, watching. “Have you spoken with your father betimes?”</p><p>“Nay. I—”</p><p>“Joanna.” His voice, dry and cracked as her throat had become, lashed into the room. “I want that map.” With a sudden movement, and a glint of steel, he moved, and the point of the sword slipped under her chin, resting there flatly.</p><p>Joanna swallowed, and felt the weight of the cold steel shift against her throat. She fought to keep her voice steady. “My lord, I thought to speak with him on the morrow—after the melee tournament. He is sure to be in a fine mood with the purses you will win as his champion.”</p><p>“A poor attempt at flattery will not turn my eyes from your disobedience, Joanna.”</p><p>She hated the way he said her name—the way the sounds came so gutturally from his mouth, twisting it into something mocking and ugly. The point of the sword pricked the soft skin under her chin and she did not move, barely breathing, focusing her thoughts on the leather placket still hidden in the stable...and the earnestness in Bernard of Derkland’s face.</p> <p>Ralf would not kill her—at the least not until he got the map. But there would likely be pain to come and she steeled herself for it. She could—she would—endure it.</p><p>“Well, my lady? Have you swallowed your tongue?” Something warm trickled down her neck.</p><p>“I do not mean disobedience, my lord.” She managed to speak without moving her jaws or lips. “I would speak with my father on the right occasion so that he will grant your wish.”</p><p>Mercifully, the sword tipped away, and he slid it back into its case. Then, untying the sheath from his waist, he flung it onto the bed—all the while his eyes boring heavily into her. “Did you remove that stain from my tunic of last eve?”</p><p>“Aye, my lord. ’tis clean and awaits your attention.” She gestured to a trunk near the fireplace, then returned her hands to clench in her lap.</p><p>“I’d as lief have a crossed sword with the cock-sucking bastard that spilled his ale on’t.” Ralf sat on a stool near the fire and kicked off his boots.</p><p>Joanna obediently moved to kneel in front of him, untying the crossgarters over his chausses and unwinding them from his calf.</p><p>“Bernard of Derkland,” sneered Ralf, and Joanna flinched at the name, her heart-speed increasing as cold fear washed over her. Had someone seen them together? “I’ll meet him on the lists on the morrow and teach the oaf to have a care near his betters.” He stood and Joanna forced herself to raise the tunic over his head, coming too close to his sweaty, stale skin. She turned away quickly to place it on the trunk, but the hand on her arm jerked her to a halt.</p><p>“He was the big man in the bridal chamber last evening, Joanna. Know you him?”</p><p>She dared not pull from his grasp, and she dared not look him in the eye. Aye, she knew him...he’d haunted her thoughts all the night and day since their meeting in the stable. Joanna concentrated on folding his tunic as she phrased her answer. “Nay, my lord, not until I saw him last eve.”</p><p>He released her and she turned away, her throat dry and her heart thumping madly. She placed the tunic deliberately on the trunk, then, when she had no further choice, she turned back.</p><p>“He looked at you, Joanna. He did not watch the bride. He looked at you.”</p><p>The blood drained from her face, and she swayed slightly. All of her strong focus shattered. “My lord—”</p><p>He stood, not so much taller than she, in his hose and tunic, his craggy face stark with the look she knew too well. “You are beautiful, Joanna. Oh, aye—mayhap too beautiful. He shoots too high if he looks to you. But mayhap you are too beautiful and aught should be done to remove that temptation from his sight.”</p><p>Acid rose in her throat as all feeling in her limbs disappeared. “My lord—”</p><p>“You would not tempt the man, would you Joanna?”</p><p>He stepped toward her.</p><p>“Nay.” Her voice was a thread wisping through the air.</p><p>“He wishes to have the best of me. And you’ll not be a part of it.”</p><p>“My lord, Ralf, I—”</p><p>“Come here, Joanna.” He pulled a long, thin, leather cord from around his waist. “We’ve time before supper.”</p><p>Aye, Maris of Langumont was beautiful. No man could deny that.</p><p>Bernard endured three knowing grins from his father before his own ferocious countenance caused Harold to desist. But his father could not resist one last well-placed kick under the table before turning his attention to Maris’s father, Lord Merle.</p><p>“’Tis the first time you’ve traveled from Langumont?” Bernard asked Maris as he used his knife to tear the rabbit meat from its bone. He glanced out over the hall, hoping to catch sight of Joanna as he pushed some of the dry, stringy meat to Maris’s side of their bread trencher.</p><p>“Aye, at least, this is the first time that I recall doing so,” she replied. “Other than to visit Father’s other fiefs, I’ve been nowhere from Langumont. I should like to visit the court—’tis much I’ve heard about the new queen Eleanor.”</p><p>“My brother travels with Henry’s court, and was there when they wed,” Bernard replied. His sharp ear caught a snatch of the conversation between their two fathers—and he tensed at the words “betrothal” and “Christ’s Mass.” By the rood, his father had best refrain from sealing any contracts without his approval.</p><p>“They speak of our betrothal,” Maris told him needlessly. She leaned closer, and a pleasing scent came with her—but the floral scent only reminded him of Joanna, and their proximity in the garden. “But ’twill be for naught, for I’ve told my father I’ve no wish to wed.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stopped in the middle of a chew, looked blankly at her, then resumed. “But of course you shall wed if your father wishes it so.”</p><p>“Nay. He’ll not force me. And,” she rested her hand with surprising familiarity on his arm, “’tis nothing of you, my lord Bernard, truly. You are most kind and polite and easy on the eyes. ’Tis only that I see no reason to bind myself to a man. Particularly one who wishes only to gain control of my lands.”</p><p>Bernard found that he needed a large gulp of ale to digest this stunning piece of information. “Is that so, Lady Maris?” He attempted to keep the incredulity from his voice even as he cast his gaze over the hall of diners yet again.</p> <p>“I have no need of a husband, as Father has trained me to be chatelaine and also to manage the fiefs as well as any man. I ride and hunt as well as many of his men-at-arms...not with a sword, of course, but I’ve my own bow and a trained falcon.”</p><p>He turned to look into her large, quite serious, hazel eyes and suddenly wished his brother Dirick were there. He would find such a woman a welcome challenge. “But who would manage the accounts?” he asked, refilling her wine, and then his own. “And defend the castle from siege?” He could think of naught else to say—for what else should a woman do but marry and breed?</p><p>Then he saw her—near the dais where her father sat with the newly-wedded couple. All else faded from his attention as Bernard watched Joanna pace, very slowly, behind her husband and then take her seat next to him. Her hair and neck were covered by a veil that shimmered with her movements, and her face, so fair and pale, seemed small within its confines.</p><p>How would he find a way to free her from her life’s lot? Bernard’s mouth tightened, his lower lip drawing up under his moustache.</p><p>“What is it, my lord?” asked Lady Maris. “Your face became so dark just now.”</p> <p>He looked back at his dinner partner, swiftly gathering his thoughts. “’Twas only that I reminded myself of some task I’d forgotten. My pardons, my lady, for disturbing you.”</p><p>She laughed—not daintily, but with true gusto. “Nay, my lord, you did not disturb me. The only distress I felt was for whomever should bring such an expression to your face.”</p><p>Bernard’s tension did not relax for Maris’s concern was well-founded. “Aye, my lady, and well it should,” he managed to say with relative calm. Then, with great effort, he turned his full attention to his dinner partner, and, with a reference to the heads of their huddled fathers, commented, “’Tis our lot in life to be harangued into marriage, then, is it not my lady? We each have our duty—as the heirs to our fathers’ lands.”</p><p>Maris nodded, her lips firm. “Aye, ’tis what my father would say—but he would not force me, and I do not intend to find a man whom I will marry.” She looked up at him from under her lashes, and again, Bernard was struck by her beauty, if not daunted by her boldness, and added, “So you may rest easy, my lord, that we shall not find ourselves signed, sealed, and betrothed ere this wedding celebration is over.”</p><p>Bernard opened his mouth, searching for something to say, but, mercifully, his father leaned over to interrupt. “My son handles the lute better than that vagabond over yonder, Lady Maris. Mayhap it would be his pleasure to sing for you.”</p><p>Maris smiled so warmly that Harold blushed and kicked Bernard again. “Lord Harold, what a splendid suggestion. Mayhap you should hail the minstrel hither and he could do so.” And then, under her breath, she added only for the ears of Bernard, “and if you dare compare my eyes to stars, or my hair to the wind, I shall kick you myself under the table!”</p> <p>Joanna slowly raised her goblet to sip deeply of the wine. It was warm and soothing as it coursed through her limbs, numbing her body and blanketing her mind with its gentle fog.</p><p>She forced herself to eat the capon that Ralf tore from the bird between them. He speared it with his knife—he did not permit her to carry her own, as harmless as it would have been—and tore into it with relish.</p><p>She hurt.</p><p>Marry, she hurt.</p><p>But before supper, she’d managed to speak with Leonard’s sister, who carried the message from the stable boy that her parcel had been moved—along with Cleome the cat—into the loft of the stable. If she could keep her thoughts centered on the freedom that leather packet of gold coin might bring, she knew she could survive the rest of the se’ennight at Wyckford Heath.</p><p>She’d located Bernard, seated many rows away from the dais, immediately. It was clear he’d been looking for her, for she felt the weight of his stare as she followed Ralf to their seats. Though she knew it would be impossible, Joanna nevertheless nursed the little flicker of hope Bernard had lit inside her.</p><p>He had been so gentle, so kind and soothing to her. His face haunted her dreams, along with the memory of his pleasantly-heavy hands, pinning up her braid, covering hers in the garden...and the softness of his mouth touching hers. Warmth and a shiver, inexplicably opposite sensations, traveled through her body, warming her as the wine had not, and she wondered what it would be like to be held in his strong arms. To be safe. To be secure. To be loved.</p><p>A covert glance at Ralf told Joanna that he was imbibing less than usual anight—most likely because of the jousting and melee tournament on the morrow. And Bernard had somehow attracted the attention—the venomous attention—of her husband, which would be taken to violence on the tourney fields tomorrow. She must find a way to warn him away from her, else he might find himself the victim of Ralf’s irrational anger. Even though ’twas customary and expected to use blunted weapons at such celebratory tournaments, men had been injured and even killed in them.</p> <p>And Joanna could not bear the thought of the gentle, brave Bernard sliced to ribbons.</p><p>“Ah...the oaf sings like a lady.” Ralf’s grating voice, somehow reaching inside her to make her cringe, pulled Joanna’s attention from her own musings.</p><p>She froze, her hand closing around a crust of bread. It had not taken Joanna more than a few weeks of marriage to Ralf to learn that traps such as these were as common as the tiny pebbles ground into wheat bread. If she looked up, he’d accuse her of casting her eyes upon another man...if she did not respond, he would be angry that she ignored him.</p><p>A loud guffaw and the retort, “Aye, he looks like a sot-head who doesn’t know the sharp end of a sword from his arse!” caused Joanna to exhale in relief. ’Twas a friend of his, who sat across the table, to whom Ralf spoke.</p><p>But when she glanced up, looking toward the singer with the smooth, mellow voice, her heart nearly stopped beating. It was Bernard.</p><p>Somehow, he’d come by a lute, and, even more oddly, he’d moved to the dais, where he stood, leaning against the side of the raised floor—plucking the strings of the lute...and singing.</p><p>And watching her.</p><p>Joanna ducked her head, turning her attention to the crust she’d mangled, but his image was burned into her memory. And even as his voice reached her ears, clear and deep as the River Wyckford, she saw his dark head and serious eyes.</p><p>And prayed that Ralf wouldn’t notice the object of his attention.</p><p>He sang a common song, one about an oath between a knight and his lady...a vow made over a relic of the True Cross....But Bernard changed the words to sing of a promise made over a bed of lavender in a garden, to a maiden fair.</p><p>When she looked up again, her heart swelling hugely, she was relieved to find that Bernard no longer looked at her. Instead, he smiled upon several ladies who had taken seats near him, and who gazed up at him as though he was the Savior himself. At their urging, he ran his fingers over the strings and began to pluck another ballad from the lute.</p><p>Joanna measured her moments carefully: watching him for as long as she dared before Ralf might turn to look at her...and taking care to note every detail about him.</p><p>She would carry this memory—the memory of the man who’d been so gentle and kind—when she was gone.</p><p>When Ralf excused himself—if standing abruptly walking off with a companion to play at dice could be called excusing himself—Joanna was surprised and pleased to be relieved of his volatile presence.</p><p>She stood and slipped between crowded trestle tables, dancers, and jugglers to make her way slowly out of the hall. Every step made her wince, and once, when an overly enthusiastic man-at-arms bumped into her shoulder, she gasped aloud from the pain.</p><p>“Does something ail you, lady?”</p><p>Joanna had just reached the hallway that led to a row of chambers when this voice stopped her. She turned to see a woman perhaps two or three years younger than herself, with dark hair and fine clothing. “Nay, lady. I am merely a bit sore.”</p><p>“I am Maris of Langumont,” said the young woman woman, stepping toward her. Concern lit her eyes. “I do not believe you, I am afraid. You are in some pain. I would try to help you.”</p><p>Joanna rested her hand against the stone wall as a wave of dizziness washed over her. “I am Joanna of Swerthmoor, daughter of the Lord of Wyckford Heath. You are very kind to have a care for me, when you do not know me.”</p><p>“I have care for anyone who is ill or injured. I am a healer.” She offered her arm. “Here, Lady Joanna, walk with me. We shall see what can be done for your pain.”</p><p>“You are a healer? Nay, you are a lady.” Joanna slipped her arm through Maris’s, and allowed the taller woman to help her along.</p><p>“I am a great heiress, but I am also a healer. Now, tell me as we walk, what causes your pain? Have you had it long?”</p><p>Joanna gave a short, bitter laugh. “I’ve had pain since I wed my husband one year past.”</p><p>The sound of heavy footsteps echoed in the corridor behind them, coming quickly and purposefully. Joanna started and sprang away from Maris, who looked at her in surprise. “What—”</p><p>“Joanna!” The voice was not the one she’d feared to hear, but ’twas familiar to her.</p><p>She turned to see Bernard striding toward them, and her heart leaped even as her glance darted around to see that no one else was there. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Lady Joanna,” Bernard said as he approached. “I wish to have a word with you.” He glanced at Maris, who appeared to be watching with very sharp eyes, and added, “if you would excuse us, my lady. I wish to speak with Jo-Lady Joanna.” His gaze raked over Joanna, touching her from head to toe as though to assure himself that she was all right.</p><p>She raised her face high to look up at him, for her head reached only to the top of his broad chest. “Lord Bernard...I did not know you to be such a fine singer.”</p><p>She noticed that his eyes were dark, shadowed by the flickering torch light, and his mouth set in a firm line that echoed the straightness of his neat moustache.</p> <p>“Many thanks, my lady,” he replied, a startled look passing over his face. “But I would wish—”</p><p>“Did you not hear Lord Bernard as he sang such beautiful ballads this eve?” Joanna turned casually to Maris. “I vow, there’s never been a minstrel with such a rich voice.”</p><p>“Aye, ’tis so,” Maris replied, her gaze moving from one to the other. “Lord Bernard, Lady Joanna is in some pain, and I was just about to—”</p><p>“You are hurt? I thought the veil was to hide something.” His face darkened further as he tore the flimsy covering from her head, even as Joanna tried to duck aside.</p><p>“Mary, Mother of God....” Maris breathed.</p> <p>Bernard’s hand fell to his sword even as he reached gently to touch the tender swelling on the side of her face. “He does not deserve to live....” he ground out. “I’ll kill the bastard, by God!”</p><p>“Bernard, nay!” Despite her soreness, Joanna grasped his arm, clutching hard ridges of muscle. “Nay, you cannot—do you not be a fool. I am his wife. He can do with me what he will.” She looked up at him and saw a frightening rage in his eyes. “I belong to him.”</p><p>Maris stepped forward, brushing one of Joanna’s thick braids back from her temple to look more closely at the bruising all along her face. “He deserves to die, he who would do this. Come, Joanna, I’ll tend you in my chamber.” When Bernard would speak, she looked up at him, “Nay, Bernard—you cannot attend her. You know that. Your task is to ensure that her husband does not return, looking for her, until midnight at the least. Start a fight with him if you must, but keep him away. Now go, you.”</p><p>“’Tis a good thing you do not wish to wed, Lady Maris—for I know of few men who would have a termagent such as you,” Bernard muttered.</p><p>Joanna drew back, insulted for her new friend and shocked that he would utter such words, but Maris merely laughed. “’Tis my own secret—and now yours—that that is the way I wish it to be. Now make haste!”</p><p>But Bernard ignored her command, and instead took Joanna’s hand in his large fingers. He raised it to his lips, brushing his mouth over her palm and the sensitive inside of her wrist. Prickles of warmth skittered up her spine, and she breathed a faint gasp at the unexpected pleasure. The soft bristles of his moustache, and the warmth of his lips pressed one last kiss on the back of her hand before he released it.</p> <p>“Joanna, would that I could protect you now....But I cannot—not yet. I will find a way, my lady. Have a care tonight, and I will see you on the morrow.” He turned to Maris, giving a faint bow, and added, “My thanks, my lady, for caring for her. If only we could find a way to keep her from her husband.”</p><p>Maris had been watching the two of them, and now she spoke. “I do not wish her to be in his custody any more than you do, Bernard, but she is his wife. There is no means of interference. Yet, I will think on it, and see if there is aught that can be done to somehow arrange a reprieve.”</p><p>Bernard bowed and turned away. He took two steps, stopped, and turned back, holding Joanna’s veil. “I shall wear your favor on the lists tomorrow.” Then he strode off.</p><p>“Come, Joanna.” Maris once again slipped her arm through hers.</p><p>“’Tis dangerous for Bernard,” Joanna said as they paced along the corridor. “Ralf—my husband—bears ill will toward him.”</p><p>Maris looked at her, faint amusement showing in her face. “It would appear that Bernard can protect himself, Joanna. I am most concerned with you and your fate.” The humor faded from her expression. “Here.” She stopped in front of a door and opened it for them to enter. She spoke immediately to the young servant within. “Anna, do you sit out side of the door and knock should anyone approach.” As her maid hurried to do her bidding, Maris gently pulled Joanna into the chamber and directed her to sit on the bed.</p><p>“Now, let us get that gown off. I trow there is more anger hidden beneath it.”</p><p>Her bruises were so painful that Joanna was forced to allow Maris to assist her in disrobing, and when the other woman saw the marks and cuts on her back, arms, and legs, she knelt beside her, clasping her hand.</p> <p>Tears filled her eyes as she looked up at Joanna. “How do you bear it?” she asked. “How do you bear it so bravely, so strongly?” A gentle hand smoothed down her back—the first touch Joanna had received on bare skin that was not designed to hurt.</p><p>She moved her shoulders in an awkward shrug. “I have no choice. ’Tis my lot.” She pressed her hand onto Maris’s. “I could hide in my chambers all the day—’tis true—or end my life, or cower and squeak like no more than a mouse. An’ there are times when I must try to be invisible, and there are times when the merest noise causes me to jump—for it might be him.”</p><p>She took a deep breath as Maris rose, and confessed the secret which burned deep inside her. “I am most likely damned, for I cannot accept my lot. I know that I must be obedient to my husband—that he owns me, and may do with me what he will....but I cannot accept that.”</p><p>“And well you should not.” Maris returned to the bed, carrying a thick leather satchel. She flipped it open, and it unrolled, exposing small pouches, packets wrapped in leather and parchment, and other utensils. “God helps those who help themselves, and accepting of such a life is foolish. You will be killed if he continues like this.”</p><p>Joanna drew in her breath deeply as Maris began to smooth a soothing salve onto her bruised face, and down to the shoulder that had been jolted by the man-at-arms in the hall.</p><p>She took some small, dried green leaves and, crumbling them in her hands, sprinkled them over the salve on Joanna’s shoulder where Ralf’s knife had cut her. “Woad. Dried woad will ease the pain and start the healing. Jesu, no man should be allowed to live after this!”</p><p>Joanna laughed bitterly. “Aye. There are many a night when I contemplate ways to send him to his death. But ’twould be almost as much of a sin—more, aye—than what he does to me.” She passed a shaking hand over her hair, pushing a thick lock from her face. “But I’ve dreamed of it.”</p><p>“You are a better woman than I—for I would have done it after the first moon of enduring such treatment, damnation or nay.” Maris pressed a strip of cloth onto the herb-sprinkled salve. “Can your father not help? Can you not flee to him for protection?”</p><p>“’Tis my father who gave me to Ralf. He does not care—he says what all men say: that a wife belongs to her husband.”</p><p>“Another reason I shall never wed,” Maris said, dabbing something onto another fresh cut. It stung, but not so much as the leather whipcord had, and Joanna barely flinched.</p><p>“You shan’t wed?”</p><p>“Nay. My father will not force me, and I do not wish to be bound to a man.”</p><p>Joanna shook her head slowly. “I do not mind being wed—but to a man such as Ralf, ’tis hell. When I leave, I shall have no—” Realizing what she’d said, she bit back her words and froze into silence.</p><p>“Leave?”</p><p>Joanna said nothing, cursing herself for letting her tongue relax.</p><p>“Is Bernard to help you to leave? Do you run off with him?” Maris looked sharply at her. “Do not tell me you are Bathsheba to his David.”</p><p>“Nay, oh nay! I would not allow it of him—or anyone. If Ralf does find me, he’ll kill me, and whoever would be with me, and whoever might have helped me along the way.”</p><p>Miraculously, Joanna’s pain began to ebb, and her head to clear as she continued to speak. “Ralf does not allow me to leave the keep at Swerthmoor, but he could not keep me from coming to my sister’s wedding celebration, so I have this chance—this one chance—to run from him. I have been saving gold pieces, waiting for such an opportunity. He does not notice the small amount missing.”</p><p>“Where will you go?”</p><p>“I know of an abbey nearby—as I grew up here. The sisters will take me in, and hide me, I am certain. I shall live in a cloister all the rest of my days. If Ralf does not find me, and follow me, I shall be safe. And....” she hesitated.</p><p>“Is there more?”</p><p>“Aye. My father has a map of this keep, for there is a tale of great treasure hidden in the warren of secret tunnels beneath it. I plan to take the map during the tourney on the morrow, and it is with its help and through the tunnels that I’ll take my flight. Thus I will get outside of the walls unseen.”</p><p>“If it is so legendary, does not your husband know of the map?”</p><p>“Aye, and therein is my trick. Ralf has demanded that I obtain it from my father, but he will not ask for it on his own. He knows my father will not give it to him.” Joanna’s lips curved into a slight smile. “I will make a false copy and to give to Ralf—and use the true one for my own purposes.”</p><p>Maris stopped her work to grin at her. “Clever girl. For even should he attempt to follow you, he will be lost.”</p><p>“Aye.”</p><p>They were silent for a moment—Joanna enjoying the touch of a healer and the moment where she need not fear that her peace would be interrupted. Maris worked quickly and with great efficiency.</p><p>When she finished her work, Maris carefully rolled up the leather satchel and walked to a large trunk beside the fireplace. As she turned, she spoke. “What of Bernard, Joanna? How does he figure into this scheme?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>’Twas a question Joanna had avoided in her own mind, and now she was face to face with it. “I do not know. Any involvement with me will anger Ralf....but Bernard has promised to free me from my husband. In sooth, I do not know how he would—other than to murder him.” She looked at Maris, who stood solemnly watching her, aware of her earlier question regarding David and Bathsheba. “Nay. He is an honorable man. He would not do that.”</p><p>“Do you care for him?”</p><p>“Aye.” Oh, aye. She could not think of him without a smile starting to rim her face, and a warmth bubbling within—and a sadness that he’d come into her life so tardily.</p> <p>She stood, thrusting those thoughts away. “I must take your leave now, Maris. I am so very grateful that we have met—and I thank you for tending to me.”</p><p>There was an awkward moment before Maris stepped forward to embrace her gingerly—but even so, Joanna drew in her breath at the pain.</p><p>“Have a care, Joanna. I would sit with you on the morrow to watch the jousting.”</p><p>“Thank you again. I will find my own way to my chamber.” And with that, Joanna slipped out the door and back into her life of hell.</p><p>IV.</p> <p>As it was most often, Bernard’s instinct was accurate. He made an early visit to the stables and found Joanna within.</p><p>She halted in the act of climbing a ladder into the loft of the stable when he approached, and for the barest moment, a flicker of anxiety crossed her face. But then, she gestured for him to join her as she continued her ascension.</p><p>“Good morrow, my lady,” Bernard said in a low voice as he stepped onto the thick hay, joining her in the loft. He ducked nearly double to walk toward her, finally sinking into a spot next to her.</p><p>“Good morrow, my lord.” She glanced briefly at him, then, as though shy in his presence, turned her attention to Cleome—who nestled comfortably in a pile of straw. As he watched, she withdrew a cloth-wrapped parcel, unfolding it to reveal a bit of meat and cheese.</p><p>“Are you well?” he asked, scrutinizing her as well as he could in the dim light. “I had to see that Ralf did you no further ill last eve.”</p><p>“Nay. He returned to the chamber very late, and fell asleep immediately. ’Twas strange, as he had not had much ale to drink at dinner.” She fed Cleome from her hand.</p> <p>Bernard could not keep a satisfied smile from his face. He’d taken care to keep Ralf from returning to the chamber by soundly defeating the man in a very long game of dice. ’Though Ralf’s parting words were an angry threat to meet him on the lists this day, Bernard gave little thought to the warning. “Good.”</p><p>He reached for her hand, gently taking the remainder of Cleome’s food from her fingers, and turning Joanna to face him. “Come hither, my lady. I wish for a token from you before I joust this day.”</p><p>“But you have my favor,” she replied in confusion.</p><p>“I speak not of that favor, but of another, sweeter, one.” With a gentle tug, he brought her shoulders and face closer to him. “Now, where we cannot be seen, might I take a soft kiss from you, my lady? As though I were going into battle?”</p><p>Her lips curved softly, and her cheeks warmed. “Aye, my lord, though I am not well-practiced in the art of kissing. I would that you should teach me.”</p><p>Her simple statement caused a great surge of affection and desire to course through him. In what other arts would she need tutoring?</p><p>“Joanna....” He fitted his hands around her face, cupping her chin with his palms and curving his fingers about the back of her neck. Her braids rested heavily against his wrists, and her sweet, fresh scent filled him, even before he brought his mouth to cover hers. She raised her eyes trustingly, and for the moment, he was taken aback that she—who had been so abused by a man—should so easily come to trust him. He was humbled, for he would never have been able to open himself thus.</p><p>Her lips parted as he covered them, and the hint of warm moistness tasted as it had before—of strawberries and freshness. This time, however, Bernard took more than the faint brushing of lips in the garden. He fitted his mouth to hers, nibbling on her lips, delving into her mouth, inhaling the essence of Joanna.</p> <p>She gave a soft moan that vibrated against his lips, sending a new wave of arousal through him. She lifted her hands from their place in the hay, shifting so that she leaned into him, and brought her fingers to gently touch the curls on his head. His scalp came alive at that unfamiliar touch, tingles shooting down the back of his neck and along his spine. Then, as she kissed him with growing fervor, her hands smoothed down over his ears and to his shoulders, where their heat burned him, but their weight was barely noticeable.</p><p>Pulling her to his chest so that their torsos fit together as they knelt in the straw, he deepened the kiss—fighting to keep from frightening her with his desire, but needing to get his fill. It was the softness, the gentleness, the clean womanness of her scent that he held and wanted...and through the haze of irrational desire, vowed he would have.</p><p>At last, she pulled away, and he opened his eyes to see whether he’d taken too much from her. But the swollen curve of her lips, and the soft light in her eyes told him that, nay, she had been plundered no more than what she herself had desired. When she raised her hand to touch his cheek, smoothing the bristles of hair that grew there, he smiled and her fingers slipped near his mouth. She traced his lips, hidden by the moustache, before he captured her hand for a last kiss in her palm.</p><p>“Enough, now, my lady—else I shall not be at my best on the lists this day.” With reluctance, he set her away from him and moved himself back so as to be out of easy reach of temptation.</p><p>God’s bones, she was beautiful, all plump-lipped and heavy-eyed, with her hair still perfectly braided and coiled in swirls on her head. Bernard nearly pulled her to him again, but caught himself in time.</p><p>“I shall carry that favor in my heart, and this one”—he pulled a scrap of white from the sleeve of his tunic—“on my lance.”</p><p>“Oh, Bernard, you had best not. Please, should Ralf see it....”</p><p>“He would recognize this piece of cloth as yours?” he asked, pulling it through his hands. It was soft, as she was, and smelled of her—and well he knew, for he’d slept with it on his pillow the last eve.</p><p>“Oh, yes, Bernard. Ralf has the most discerning eye for such things.” She looked at him with such fear in eyes that had been dazed with desire only moments before.</p><p>“Then I shall wear this favor near my heart,” he told her. With a quick jerk, he had his over tunic off, and then his sherte, leaving him bare-chested. At the sight of him, she drew in her breath deeply and Bernard could not help but the swell of pride that she should react thus. After all, she had been the victim of a man as powerfully as he.</p><p>She watched him as he wrapped the white linen veil around his hirsute, muscular chest, and, as though she could not remain away any longer, moved forward to take the ends of the veil and tie it herself. Then her hands slipped boldly—so boldly for his shy, demure Joanna—up through the thick coarse hair and over the top of his shoulders, sending the same searing heat that came from her gaze.</p><p>“You are wondrous,” she told him. “And ’tis all the more miraculous that you have the gentleness of a mare about you. With such strength, you could rule the simple life of anyone.”</p><p>Touched, and shamed that his fellow man should be the cause of such grief, Bernard reached to stroke her face, gently, over the purpling bruise. It took great effort not to ruin the moment by allowing the cold fury he felt toward her husband to burst forth. “One with my strength has no need to prove his power at the expense of a weaker one. Nor should any man need have that urge. I am sorry that you should have experienced this yourself. Joanna, I will protect you. I will find a way.”</p><p>She tipped her face to touch her mouth to his, then drew back before the kiss could deepen. “Aye, Bernard....and God be with you on the lists today—for Ralf does bear you ill. You do not intend to meet him, do you?”</p><p>His eyes jolted wide in surprise. “But of course I will meet him, Joanna. Knocking the whoreson on his arse will be the greatest pleasure for me. Would that I could do more damage, but of course, I cannot in such a tournament. But I vow that you’ll have naught to worry you on this eve, for Ralf will be in no shape to raise a hand to you.”</p><p>Sweat trickled down his back and along the sides of his cheeks as the noon sun beat down upon him. Bernard shifted the heavy, straight lance in his hand, testing its weight even as he reined back Rock from his eagerness to leap forward.</p><p>A roar of approval rose from the crowd that lined both sides of the jousting lists as a lance found its mark on a second pass, dumping an unfortunate jouster onto the dusty ground. The victor raised his lance and galloped along the front of the stands, kicking up more dust and causing a greater shout from the crowd.</p><p>“Lord Bernard of Derkland...challenged by Sir Marven de Hanover.”</p><p>A thrill of anticipation shot through him as Bernard wheeled Rock forward to take their place at one end of the list. His squire, Rowan, handed him first his helm, then his shield. Bernard glanced briefly at the crowd, in hopes of locating Joanna, but did not place her before the signal to commence was given.</p><p>Bernard did not know Sir Marven, and he did not care why the man challenged him—’twas likely for no other reason than the opportunity to gain a greater purse. He looked down the list at his opponent, noting that he was a solid, well-built man who rode a passable mount. Though size was helpful in most competitions, in jousting it was not as important as skill and balance. A large man could easily be unseated by a skilled jouster, regardless of whether the opponent was of his size or nay.</p><p>Bernard snapped to attention as the signal sounded and dug his heels into Rock’s straining body. The destrier was ready for his first action of the day, and leapt forward, taking one bounding step where the opponent’s mount took three. Wind rushed over him, cooling Bernard’s sweaty face and neck, as he positioned the lance, aiming it for his opponent’s right shoulder. One good hit with the blunted lance, which not meant to injure, only to unseat, and Sir Marven would tumble to the ground. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The lance lay across his thigh, pinned firmly under his arm and held in place by Bernard’s left hand, while the other slanted his shield for protection. When the lance struck his opponent’s shield, the long wooden pike barely moved, so true was its aim. Marven fell neatly off his mount and onto the ground.</p><p>Bernard turned Rock to ride back again, glancing at the man to assure himself he’d attained no injury, and then along the line of spectators, still hoping to see Joanna. He was rewarded this time, for he saw her, sitting next to Maris near the middle of the stands. He nodded in the general direction of the crowd, but when he placed his hand over his heart, and the hidden favor that rested beneath his tunic, ’twas meant for her.</p><p>He galloped back to where Rowan and his father waited as the next challenge was announced.</p> <p>“Fine job, son,” greeted Harold as his son wheeled up to him, removing his helm. “It wasn’t a sufficient test of your abilities, but ’twas over quickly and simply.” Coughing and waving the dust out of his eyes, he looked up with a smirk. “Do you not wear the favor of your lady?”</p><p>“Aye, that I do—but ’tis not for your eyes, Father.” He handed the lance and helm to his squire and swiped an open hand over his damp curls. “And do not give me a look with that smugness, for you have no reason to believe your machinations have come to fruition.”</p><p>Harold’s thick brows rose up a high forehead. “Oh, aye? And did I not see you with mine own eyes head-to-head with Lady Maris last eve, and did I not see you follow in her steps out of the Hall? You can not fool me with such protestations, as I saw where your eyes led over yonder.” He gestured toward the spectator stands, and still the satisfied smile curved his face.</p><p>Bernard’s response was lost as his name was again announced, coupled with a different challenger. With a smile of pleasure, he kicked Rock, and they bounded off for the lists.</p><p>The powerful thrust of his opponent’s lance was poorly aimed, but nearly unseated Bernard on the second pass. He held firm in the saddle, taking the brunt of the blunted lance in the shoulder of the arm wielding the pike. Even through the mail that protected his body, Bernard felt the strength of the man’s blow.</p> <p>On the third pass, the same lance struck the same sore spot on Bernard’s shoulder, and he cursed aloud as the pain intensified. His aim was true, though, and he took pleasure in watching his stocky opponent waver, then fall from the saddle just as they passed each other. With a grunt of triumph, Bernard allowed his own lance to his rest on his thighs, and prodded Rock into a canter back to his squire.</p><p>Groaning in pain, Bernard slid from the saddle as Rowan leapt to take the shield from him. Harold and his own squire attended him as well. “God’s blood—that bastard had poor aim to strike twice in the same wrong place.” He tried to rotate his shoulder, but the throbbing heat radiated up his shoulder and along his arm, fading over to his shoulder blade.</p><p>“Aye,” Harold said. He began to pull Bernard’s tunic off his shoulder, but his son jerked his arm away.</p><p>“Father, there is no need to play nursemaid to me—especially when there are others watching. The injury is not that severe.”</p><p>But he had barely spoken those words when his name was called yet again. “Peste!” Bernard turned to whistle for his horse, but Rowan had heard the challenge and brought Rock immediately. He pulled himself into the saddle, smothering a wince, and took a new lance offered by Harold’s squire.</p><p>“Stay in your seat,” Harold called after him as they galloped off. Bernard choked on a retort at the needless warning, and put his meddling father out of mind.</p> <p>Swiping the sweat from his face yet again, Bernard eyed his third opponent. It wasn’t Ralf, though he’d been expecting to be called to challenge him at any moment. This man again was someone that he did not know, and he appeared very solid and heavy in his saddle. The horse was fine, enough for Bernard to notice in appreciation, though not nearly as perfect as his own Derkland-bred mount.</p><p>He’d barely settled the lance in his lap, attempting to keep it from weighting on his injured shoulder until the very last moment, when the signal was given. Rock leapt forward before Bernard even gave him the heel of his boot, and suddenly the wind streamed over his face as they galloped down the list.</p><p>Thwack! The impact of his opponent’s lance struck Bernard even as his own bounced off the top of the other man’s shoulder. The power of his thighs gripping Rock was the only thing that kept him from tumbling onto the ground, and his fingers loosened, dropping the lance onto the dusty ground.</p><p>A loud exclamation rose from the crowd, either because it was the first time Bernard had missed a hit, or because he’d taken a good one, but he barely heard it through the searing pain that shot down his arm. The other knight’s lance had caught him again near the injury he’d sustained in the last challenge, and now agonizing heat caused black spots to dance before his eyes.</p><p>Of all the bad luck.</p><p>Gritting his teeth, Bernard turned Rock and headed back to his side of the list, keeping the dancing mount to a trot to give himself time to catch his breath. Rowan met him there with a choice of four lances to choose from. Again, taking as much time as he could, Bernard hefted each one in his hand before selecting the first one.</p><p>He gave a quick nod to his father’s questioning glance, then, steeling himself for one, mayhaps two, more passes, he kicked Rock into motion. He managed to make it through the next two charges without being unsaddled—though it was a close one on the last. He did not manage, however, to unseat the other man, and, instead, took one more hit to his shoulder.</p><p>“Who have you angered thus to keep you in the lists?” asked Harold jovially as Bernard returned and dismounted, tossing his shield to Rowan.</p> <p>Breathing heavily, Bernard nearly discounted the jest, but then realized that without meaning to, his father spoke the truth. Surely it was Ralf’s doing, for Bernard knew few of the men here, and none of his challengers thus far. Swerthmore’s intent was likely to tire him before meeting him on the lists, and mayhap causing him some injury. “Bastard.”</p><p>His father looked at him, but Bernard dismissed him with a wave of his hand. “’Tis naught of your concern.”</p><p>At last, after Bernard was called thrice more, the challenge he’d been waiting for was announced. A fresh wave of anger—and determination—rushed through him as he selected a lance. He’d saved himself as much as possible during the last passes, now knowing Ralf’s game.</p><p>With a glance toward the stands, Bernard stroked a corner of Joanna’s veil, feeling its softness clinging to his sweaty torso. If for no other than her, he’d see Ralf face-down onto the ground.</p><p>Bernard and Rock settled into their place at one end of the list, the horse dancing with impatience as though sensing that there was more at stake with this challenge. The signal broke the tension and they leapt forward, galloping toward Ralf at full speed.</p><p>Thwump! Bernard nearly screamed aloud as his opponent’s lance passed by his shield, driving into his injury, just where his arm and shoulder met. He saw black and heard a loud, hard laugh as they passed by, his own lance slipping off into nothing and nearly causing him to topple. He could barely breathe, the pain was so intense, and he realized what had happened.</p><p>He’d given Ralf too little credit—for the man had selected very skilled jousters to challenge him. Their intent was not to up-end him from the saddle, but to injure him in a manner that would keep him from his best. All of them had struck the same place—purposely. And now Ralf had chosen to put the finish on him before claiming victory.</p><p>Weary, but his teeth clenching hard enough to take his mind from his throbbing shoulder, Bernard chose another lance and, adjusting his shield, turned to face his opponent.</p><p>Twice more.</p><p>They charged as the signal was given, galloping down the list toward each other at breakneck speed. Bernard felt sweat slick his hand, but he held fast, determined to knock the bastard onto the ground this time.</p><p>He concentrated as Ralf sped toward him, picking out his faint slant in the saddle, looking for an opening—and found it. He leveled the long lance, aiming, forgetting the pain in his shoulder by thinking of what Joanna had lived through. Just as they met, just as the other lance brushed his shoulder, Bernard twisted slightly and found his mark. The other lance slipped harmlessly up and over his shield and the other man teetered in his seat.</p><p>Bernard and Rock roared past Ralf, and only the disappointed groan from the crowd told him that his opponent had recovered. He cursed the luck of the devil, and spun his mount around to choose his last lance.</p><p>Breathing heavily, Bernard took little care in selecting the lance offered by Rowan. He trusted his squire, and meant only to get back to the lists for the final pass. His shoulder’s ache had lessened slightly, but when he moved to steady his long halberd, the pain shot down his arm.</p><p>The last time.</p><p>He sensed the fury and hatred emanating from the other man—waves of it came across the field—and it seemed as though the watchers felt it too, for a near hush fell over them. Only the sound of Rock stamping his feet, and the jingle of mail and bridle, fell on his ears....or mayhap ’twas just that he concentrated so solidly.</p><p>The cry to arms bellowed from the announcer, and he kicked Rock forward. They nearly flew through the air, smoothly, as one. The intensity of his pain diminished as he sighted the lance on Ralf’s shield, focusing on the place that would dump him from the saddle.</p><p>He leaned forward, urging Rock on, holding the lance steady as they barrelled toward Ralf.</p><p>One moment more...</p><p>He fought the hovering pain as he gripped the lance, steadying it, ready to thrust it forward....</p><p>Thump!</p><p>Pain crashed over him as he took the brunt of Ralf’s own blow in his shoulder, even as his lance connected with the other man’s shield. With a howl of rage, Bernard held steady and gave one last thrust as they passed by.</p><p>He heard the roar of the crowd dimly through hot, white streaks that shot up his arm and across his shoulder. Gasping for air, he turned Rock around in time to see Ralf struggling to his feet. A faint lift of one side of his mouth was all he could managed as he galloped past the stands and to his father and squire. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bastard.</p><p>V.</p><p>Joanna smoothed the crinkling paper, examining the black marks that identified the labyrinth of tunnels beneath Wyckford Heath Hall. Even as a young girl, she’d heard stories of the passages that led out of the keep, but had never been able to find them.</p> <p>She’d also heard the tales that treasures hidden centuries earlier by the Saxons during the Anglo invasion were still in the tunnels below. Therein lay Ralf’s interest in the map—while hers rested only in the freedom it would gain her.</p><p>She rolled the map and tucked it behind a loose stone near the fireplace, for she hadn’t time to make a false sketch for Ralf before he returned from the tournament.</p><p>At the thought of the competition, a great rush of warmth surged through her as she recalled the mighty, powerful Bernard—how he rode his steed, and wielded his lance in too many challenges to count. She’d watched him, swelling with pride and nearly crying when he was struck with bone-shattering blows—yet he’d remained in his saddle as a fresh and untested Ralf had not.</p><p>Maris had rushed to see to his hurts after the last challenge while Joanna returned to her chamber, grieving the fact that she could not attend him as well.</p><p>Instead, she relived the gentle moment with him in the stable loft, where they’d come together in a passionate kiss that still caused her heart to race. She might be damned for wanting and kissing another man whilst she was bound to another, but in her heart of hearts, she believed that God—who helped those who helped themselves—would not judge her too harshly. For was not love the greatest gift?</p> <p>Bernard was the first person in her life to truly show her love.</p><p>The door to the chamber flew open and Joanna turned, startled, to see Ralf limp in. His face held no expression as he stared at her. Her middle dropped and she moved to stand by her stool at the fire, keeping her expression carefully blank.</p><p>Without relieving her from his gaze, Ralf shoved the door behind him, and it closed with a dull thud that made sweat spring to her temples. Her voice wavered. “May I tend to you—”</p><p>“Silence!” His voice lashed across the room.</p><p>Joanna swallowed, her heart thumping so hard that she thought it would burst from her chest. Ralf took a step toward her...then another. “Do you gloat at my defeat this day?”</p><p>She did not move, even to step away, and replied, “Nay, my lord, I do not—”</p> <p>“Bitch!” he snarled.</p><p>The backhanded slap sent her head crashing into the stone wall, and sharp pain radiated along the side of her face. Warm, metallic liquid filled her mouth. A pounding reverberated in her temple where she’d struck stone.</p><p>He stared at her, his harsh breathing rasping in the air between them. “Do you dare to laugh at me? I would show you the error of your ways, Joanna.”</p><p>Her fingers became ice and the room shifted. “My lord, please—”</p><p>“Did I not tell you to be silent?”</p><p>A fist plowed into her breast, and another into her abdomen. Her lungs emptied and she could not gather enough air to cry out. She sank to the floor, her hand splaying over the rough stone. Her fingers spasmed over the slate as his booted foot slammed into her hip.</p><p>“Where is the map?” Her stool crashed onto the floor next to her, splintering in pieces and barely missing her head.</p><p>The map. Somehow she dragged herself from the pain to realize that he would not kill her until he had it. Struggling to draw a breath, she whispered, “I do not have it.”</p> <p>“You do not have it?” he screamed, lashing out with his foot.</p><p>Joanna tried to roll away, but she found herself trapped between Ralf and the unyielding wall. Fists and feet pummeled her, driving her into a corner from which she had no escape but the warm memories of Bernard.</p><p>Bernard endured the excruciating pain inflicted upon him by Maris’s instructions to Harold and Rowan. His arm had become dislodged from his shoulder with Ralf’s last thrust, and it took the strength of the two men to pop it back into place.</p><p>That done, he promptly slid into the comfort of blackness even as he heard Maris giving more directions to Rowan.</p><p>When Bernard awoke, it was dusk, and well into the evening meal. Rowan, as a good squire should, stayed with him to tend to his needs, but ’twas obvious he was as hungery as Bernard. They went down to find a place at the long trestle tables, Bernard’s injured arm strapped to his torso by an adamant Maris.</p><p>Joanna was not at dinner—though her evil husband sat near her father, the Lord of Wyckford. Bernard flattened his lips at the thought of Ralf’s manipulations this day, and he felt that same penetrating fury he’d experienced earlier emanating from across the loud hall.</p><p>Once, Ralf turned to look at him, steadily, for a long moment, and Bernard felt prickles erupt along the back of his neck. There was a self-satisfied glint in the man’s eyes, accompanied by dark fury. Though he knew himself to be the stronger and more-skilled fighter, Bernard felt a queasiness curdle in his middle. The man was pure evil.</p><p>A sudden burning desire to see Joanna—to hold and kiss her, and to whisk her away from her monstrous husband—caused Bernard to bolt to his feet. Now, whilst Ralf busied himself with dinner...now, mayhap he could chance to find her in her chamber.</p><p>Lord Harold, who sat plotting with Maris of Langumont’s father, looked up and gave his son a knowing smile. Bernard drew his brows together in a glower and gave an angry shake of his head before turning to stalk out of the hall. When would his father give up the chance to meddle in his life?</p><p>It did not take much for Bernard to learn where the chamber of Ralf, Lord of Swerthmore, and his wife, Lady Joanna, boarded. One simple question to the stable boy Leonard, and Bernard found himself hurrying back into the keep and down a dark, torchlit passageway to a chamber on the second floor.</p><p>He knocked boldly, not caring whether anyone might hear him—wanting only to see the woman who had somehow become everything to him in the last two days.</p><p>There was a long pause, and then just as he raised his hand to pound again, the door cracked open...then was flung wide.</p><p>“Lady Maris.” Bernard stepped in to find the room warm and sunny with a blazing fire and three candles. “What do you here?”</p><p>He did not need to wait for her answer, for in the wake of his words, he saw his Joanna lying on her side in a large bed. She was curled into a ball, her hand fisted under her cheek, her eyes closed and her breathing fast and shallow.</p><p>When he saw the cuts on her face and hand, the black and purpling on her face, he swayed and had to clutch at the bedpost as white rage poured through him.</p><p>“Joanna!” he choked, moving to her side to touch her clammy cheek, to trace gently an angry cut along her fair cheek.</p><p>“She is well hurt,” Maris told him. “She was beaten nearly to death by Ralf.” Even as she spoke, her voice sharp and flat with fury, she ground herbs with a small mortar and pestle.</p><p>Joanna remained still, only the short puffs of air belying that she yet lived. Rage and guilt swelled within him as he looked down at her battered body. How could he have left her to this man’s anger? He should have known—known—that Ralf, having lost the battle, would take out his fury on Joanna.</p><p>“She must be taken from him, Lady Maris, and then I will kill him.”</p><p>’Twas his own fault that Joanna now lay still as death, for if Bernard hadn’t angered Ralf so, the cock-sucker would not have been propelled to injure her thus.</p><p>Guilt, strong and sharp as the lash of a blade, made him ill and weak. How could he have left her to this? “We must take her from here, now,” he said.</p><p>Maris shook her head regretfully. “Nay, Bernard, ’twould not be best for her to be moved. She has two broken ribs and she is very, very weak. Can you not settle a guard here?”</p><p>Bernard snorted. “In the home of the father who wed her to this monster? Aye, I’ll do it, but I do not know how long he’ll allow it.”</p><p>“Allow it?” Maris echoed. “When his daughter has been near beaten to the death, her own father will not allow her to be kept safe?”</p><p>Bernard shook his head, sick at heart. What could he do to ensure Joanna’s safety? With all his being, he desired nothing more than to stalk back to the great hall and plunge a dagger into the throat of Ralf.</p><p>Such an action would free Joanna from the man, certainly, but would leave Bernard hanging for murder and Joanna unencumbered—and sure to be wed to another man. Much as he had the blood lust to do away with Ralf, Bernard could not allow Joanna to belong to anyone but him.</p><p>Not now that he’d found her.</p><p>He stood, leaned to press a kiss to the cool, still cheek of his beloved, and turned to Maris. “I will fetch my father’s men-at-arms and send them here anon. Please have a care for yourself and my beloved. I will find some way to tend to this.”</p><p>VI.</p><p>Through a heavy murkiness, Joanna heard a haze of voices...staccato bursts of anger.</p><p>She struggled to open her eyes, but it felt as though her lashes were plastered onto her cheeks. Pain radiated through her body, echoing everywhere so that she could not tell where it began and where it ended.</p><p>Her senses faded, and she slipped into the depths of darkness, buffered from the pain.</p><p>She heard the voices again, and they pulled her from her deepest, safest place. They tugged her relentlessly from the numb cocoon that kept the agony at bay, and as she became more aware, the heaviness of her hurts throbbed and battered her body, even though she lay still.</p><p>This time, she managed to pry her eyes open—the only part of her body that moved without pain—to see Ralf holding something in his hand, something flowing, and white. His face was a mask of fury, and even as she watched, he whirled in anger upon another figure in the room—a woman—and turned upon her, grabbing her shoulders and tossing her aside.</p><p>The other woman screamed, then fell to the floor, silenced.</p><p>And Ralf rounded upon her, Joanna, in her bed.</p><p>“Wake up, you cock-spittle bitch!”</p><p>Hands seized her shoulders, and she was jerked up, her head snapping back as a scream choked in the back of her throat. Red-hot pain stabbed her head, her abdomen, and flashed through her body like fire. She could not control the wail that erupted from her abdomen and burst from her mouth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What is this? What is this?” he was shrieking. Somehow, through all of the hazy pain, she felt the spittle fly from his mouth, flecking her face. “Whore!” He released her, and she fell back onto the bed, her teeth jarring together.</p><p>She struggled to make sense of what he raged about, fighting to focus her eyes on the white cloth that he brandished whilst she prepared herself for the blows and pain yet to come.</p><p>“You thought to cuckold me?”</p> <p>He raged about the room, not yet deigning to take his fury out on her physically...but she knew ’twas only a matter of moments before the blows fell. What was he angry about?</p><p>“My squire heard you in the stable—with your lover! He saw you make the whore of yourself—and ’twill be the last time you do!” He leaned forward, menacing, over her. His eyes were wild and yellow in his face, and Joanna nearly fainted as his words penetrated.</p><p>His hand closed around her throat, squeezed and released, so that she coughed in agony. She gathered all of her strength, trying to twist away...but in its battered state, her pain-filled body was no match for his iron grip. His fingers closed again, and she reached to claw them away as spots of black light flashed at the corners of her eyes.</p><p>Death. ’Twould be welcome—’twould be heaven compared to living her life in this fear.</p><p>Bernard.</p> <p>His face flashed before her as the life began to seep from her body.</p><p>And suddenly, Joanna realized she had one last chance. She forced herself to form the single syllable that might save her life.</p><p>“Map.”</p><p>As though ’twere magic, the word, grating even to her ears, caused Ralf to lessen his grip. She sucked in a huge breath of air, her body shuddering with the effort, and gasped the word again. “Map.”</p><p>“Where is it? Where is the map, Joanna?”</p><p>As she’d hoped, greed proved a stronger force to Ralf than anger. She managed to nod her head, barely.</p> <p>“You have it?” His hands flew to grip her shoulders and she gasped in pain. “Where is it, bitch? Tell me and I might spare your life!”</p><p>“Fire...place,” she whispered, streaks of agony catching her breath and making the words nearly unbearable.</p><p>He was on her in a moment. “You burned it?” The rage turned his face into a grey stone mask with burning yellow eyes, and he reached for her with clawed hands.</p><p>With all of her effort, she half-rolled away, her denial little more than an agonized moan. “Nay!”</p><p>He whirled away from her, toward the fireplace, and began to pull on the stones, kicking them, shoving at them. “Is it here?”</p><p>Joanna stifled her sobs of pain as she struggled to rise from the bed.</p><p>She managed to pull herself up to sit, her head spinning crazily and her mouth dry with pain, when she saw movement out of the corner of her eye. If she’d had any strength, she would have screamed in shock and fear...but when she saw Maris of Langumont pull to her feet from the floor, Joanna’s fears subsided.</p><p>She watched as Maris moved quickly and silently, taking a heavy wooden bowl and, stepping behind Ralf, brought it down with a loud crack! onto his head.</p> <p>He slumped instantly into a heap at the fireplace hearth.</p><p>Maris turned to Joanna, staggering slightly as she made her way to the bed. “Come, we must go.”</p><p>She slipped an arm around her, and eased her off the pallet. Joanna tried to find her feet, but the room spun and she sagged against the taller woman. “Come,” Maris puffed, half-dragging her to the door. “Come.” ’Twas as though she said the words to keep herself moving.</p><p>They made it to the door, and a moan from Ralf nearly caused Joanna to faint. Maris managed to prop Joanna against the wall, and Joanna, for her part, kept her knees from buckling whilst her friend got the heavy door open. They fairly fell into the dark, empty passageway out side of her chamber, and Maris shut the door behind.</p><p>Joanna summoned more energy and managed to wrap her arm around Maris’s waist and to actually take a step. They paced slowly down the hall until they came to another corridor. A small alcove recessed behind it, and Joanna pulled away toward the dark corner. “Go. You cannot...carry me....” she gasped. “I will stay. Safe.”</p><p>Maris hesitated, then, seeing the wisdom of searching for someone who could carry an ill woman, gave a quick nod and stepped back, looking carefully to see if Joanna would be noticed should Ralf erupt from their chamber. “I’ll get my father.”</p><p>Bernard raged into the great hall, pushing past revelers and serfs, using his bound elbow as a battering ram. His eyes focused on the dais where Joanna’s father sat...and where Ralf had also eaten his meal. He saw immediately that Ralf was no longer at his father-by-law’s side, and worry for Joanna propelled his feet even faster.</p><p>“Lord Wyckford,” he bawled, charging up to the high table, caring little that he interrupted a jongeleur at his tricks. “Lord Wyckford, I must speak with you!” He nearly leapt upon the dais, and was at the man’s side in one quick stride.</p><p>“Who are you to accost me so boldly?” The Lord of Wyckford shot a disdainful glance at Bernard, and buried his face in his goblet.</p><p>Bernard restrained the urge to knock the cup from his hand and instead planted his one free hand on the table next to the man, bringing his face into his. “Your daughter Joanna lies near death in her chamber—”</p><p>“What say you?”</p><p>“And ’tis the fault of her husband that she has been beaten near to her grave. You must place guards at her door to keep him from further harming her.”</p><p>Wyckford looked at him and blinked slowly. “Do you not give me orders in my own home,” he grunted. “And I cannot interfere betwixt a man and his wife—for ’tis the law of the church that the wife is the chattel of her lord.”</p><p>Bernard’s rage blinded him. “She lies near death, man! She is your daughter!” He curled his fist into the table and splinters pierced the skin under his fingernails.</p><p>Wyckford glanced over Bernard’s shoulder and seemed to reconsider. The hall had grown quiet and all appeared to listen for his response. “I shall send guards as you have requested. But I do not relish coming between a husband and his wife...and you, sirrah, should have a care for yourself, else you are accused of worse. Now begone!”</p><p>Bernard’s teeth creaked as he turned away, clamping his jaw in fury. He would send his own men, damn the man! He spun on his boots, jumped off the dais, and began to push his way out of the hall with the same force as he’d arrived.</p><p>The crowd melted away as he stalked through them, his face a set, still mask that likely brought fear to more than one man’s heart. In a haze of anger, he started for the quarters of the men-at-arms in search of his own men...then again spun on his heel and started back down a long corridor.</p><p>Foolish! Whilst Bernard berated Wyckford and sought his own men, Ralf was nowhere to be found...and with a lump in his throat that threatened to choke him, Bernard had a fear that he knew where the man had gone.</p><p>He ran down the corridor, through the twisting passageway lit by flickering torches and silent as a tomb. As spirited as she was, Maris would not be able to stand up to Ralf should he appear...and Joanna was so weak that one blow could send her to her grave.</p><p>His footsteps rang with hollow thuds as he dashed down the corridor and around the corner to the hallway leading to the chamber where Joanna lay. He stamped to a halt when he reached the room and saw that the door was slightly ajar.</p><p>A heavy fear settled over him as he prodded the door open with his toe, uncertain of what he would find. The door swayed open, silently, baring the chamber to his gaze. Bernard stepped onto the threshold and saw that the room was in shambles: stools overturned, the bed empty, clothing strewn about, the only light from a sputtering fire.</p><p>He started into the dim room, fear clutching him. Joanna was nowhere to be found, nor was Maris....</p><p>He did not know what alerted him, but aught caused Bernard to swivel just as something dark and fleeting whooshed toward him. Instinct propelled him out of harm’s way, and Bernard groped, one-handed, for the dagger that he wore at his waist.</p><p>“Whoreson!” Ralf’s grating voice reached his ears just as the man made his appearance from behind the door. “You thought to steal my wife from beneath my nose!” He brandished a long sword that gleamed in the flickering firelight. “Bastard—you will learn better from me now!”</p><p>Rage and satisfaction surged through Bernard....at last he would have his opportunity. They were well-matched—Ralf with two working arms and a sword, and Bernard with one arm, a dagger, and the might of chivalry on his side. He would relish the opportunity to fight the bastard to his death.</p><p>The slice of the sword cut through the air, stirring Bernard’s hair, even as he drove a quick thrust of his short dagger at Ralf’s shoulder. A squeal of rage told him he’d hit his target even as he whirled from the sword’s upswing, narrowly missing being caught by it.</p><p>Spittle flecked the corner of Ralf’s mouth as he charged toward Bernard. Fury drove his movements, making him careless, and ’twas simple for Bernard to feint aside at the last moment and allow Ralf to lurch past. The man turned and Bernard was waiting with his dagger poised, just ready to bury it in the man’s throat, when there was a choking cry behind him.</p><p>Bernard saw his beloved...and it distracted him only for an instant...but it was enough for Ralf to bring the flat of his sword down, knocking the dagger from Bernard’s hand, sending it clattering to the floor.</p><p>Joanna shrieked again, but Bernard had seen that she stood sagging in the doorway and knew that he could not be distracted again. The sword came down, slicing through the tunic on his good shoulder, and with a roar of pent-up rage, Bernard launched himself at Ralf whilst the sword was on that downswing.</p><p>His timing was perfect, and the two men fell to the rough stone floor, the sword pinned between them. Bernard was at a disadvantage, now, with one arm bound to his side, and Ralf, fueled by crazy rage, drove his knee into Bernard’s middle, then with a great shove, pushed him off. Bernard rolled to one side with a grunt, gasping for air, and his head slammed against the stone wall. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He struggled to roll back, but Ralf had already leapt to his feet and retrieved the grip on his sword, trapping Bernard against the wall.</p><p>“Prepare to die, whoreson.” He raised the sword with both hands, and drove it down.</p><p>At the last moment, Bernard pushed away from the wall, knocking into Ralf and unbalancing him just as the sword’s point slammed into the floor, shattering. A scream of rage erupted from Ralf and he slashed the broken tip of the sword down again just as Bernard caught sight of his dagger lying on the floor. Joanna saw it, and staggered forward to kick it toward him.</p> <p>The sword missed Bernard’s throat by a hairsbreadth and, pulse thrumming wildly, he rolled again, closing his fingers over the coolness of his knife.</p><p>He became dimly aware of newcomers to the scene, crowding in the doorway, but Bernard was too ensconced in the fight for his life to note who they were. He tightened his grip on the dagger and prepared to strike.</p><p>Ralf towered above him, brandishing the sword—all the more deadly now with its jagged edge—and Bernard tensed, ready.</p><p>It happened at once. The sword came down, Bernard thrust up, his dagger found its mark, and the sword clattered helplessly to the floor. Ralf screamed and collapsed in a heap next to it.</p><p>Bernard leapt to his feet and, bracing himself, looked down at the fallen man. He lay unmoving, blood oozing from the wound in his neck, his eyes closed in death.</p> <p>“Joanna,” Bernard said, never taking his eyes off Ralf, but opening his arm for her. She moved swiftly, nearly falling into his embrace, and she clutched him as they stood staring down at her husband.</p><p>A loud clearing of the throat brought Bernard’s attention to the audience that had clustered in the doorway.</p><p>“Aye, Merle, it appears that our plotting has all been for naught.” Bernard’s father, Lord Harold, coughed into his hand. “My son has a mind of his own.”</p><p>“Aye, and my daughter, too,” responded Merle of Langumont, tucking said daughter’s arm through the crook of his elbow. “Now, let us help Bernard in ridding himself of the remains of this vermin.”</p><p>VII.</p><p>After all of the events during Ava’s wedding celebration, Lord Wyckford represented himself as the outraged father, angry at his son-by-law’s treatment of his daughter—much to Bernard’s disgust.</p> <p>However, the man made no argument when Bernard informed him that he would wed Joanna, for Derkland’s lands would be a valuable asset to the lands Wyckford already controlled through his own demesne and those of Swerthmore.</p><p>Lady Maris stood witness to the wedding a se’ennight later, and Bernard’s brother Thomas performed the ceremony. Bernard’s other brother, Dirick, was absent from the ceremony as he still traveled with the king...but Bernard hid some hope that mayhap he would some day meet Lady Maris of Langumont.</p><p>He suspected she would be more than a challenge for his wild, devil-may-care brother.</p><p>When he wed Joanna, Bernard refused to allow a bedding ceremony, for he would not subject his wife to the indignity of being stripped. But in the privacy of their chamber, when he gently lifted the fine linen undertunic and bared her body for the first time, he nearly wept at the sight of her green and blue bruising, along with the barely-healed cuts from Ralf’s leather whip.</p><p>“If he weren’t already dead,” Bernard breathed, his trembling fingers sliding lightly over her hip, “I would make him wish he’d never laid so much as a breath on you.” His face was stricken, for this was the first he’d ever seen the full extent of her injuries. “Joanna, how can you suffer any touch? Does it still pain you?”</p><p>“Your touch is a most welcome balm,” she told him, her gaze steady and calm, easing his fears. “Though if you tell Maris I have compared you to her medicines and found them lacking, I must deny it.”</p><p>A little chuckle at her jest surprised him. “Lady Maris is rather serious about her medicinals, is she not?” Bernard said, still trying not to think of what had been done to the delicate woman next to him. Surely his very touch would be nothing but pain!</p><p>Smiling, Joanna pulled him close, pressing a sweet kiss to the corner of his trembling mouth. His eyes closed and he relaxed into her.</p> <p>“Ralf is gone,” she murmured against his moustache, “and in the best of ways, he brought us together. Can we not celebrate this new life and forget the evil of my old one?”</p><p>“Aye, beloved,” he said, gathering her into his arms. “There is nothing else I would rather do. Now and forever.” </p> </body></html>"]