["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mike knew that there was absolutely no chance that she was going to answer his little chat outreach anytime within the next twenty-four hours. He knew that Dylan had a date with her last night, but hoping against hope and because he was an eternal optimist, he decided to log on while he was having his morning cup of coffee.</p><p>And just to see if maybe – just maybe – she might have answered him, even though it was now six minutes before seven in the morning. He figured she was still in Dylan’s bed, probably going on for round seven (knowing Dylan), and there wasn’t a chance in hell that she would...wait, what?</p><p>He stared at his phone where he’d logged into the app for the online dating site. Her little icon blinked rapidly – he’d subscribed to her and her avatar had suddenly turned green.</p><p>Oh, holy hell, no! he thought. Hell, yes! a different voice answered in his poor, addled brain. Enough with the ridiculous self doubts – he had to grab his chance now. She was logged on to the dating site early in the morning after a date with Dylan. This meant – oh, the implications stunned him. Made him smirk.</p> <p>Mike took a swig of coffee and quickly tapped out:</p><p>Hi, there. Are you on right now?</p><p>She typed back,</p><p>I’m just drinking my coffee and getting ready for work and I logged in and saw your message, so hi!</p><p>Wait a minute. Back up for a second. So if she was at home drinking her coffee, then that meant Dylan had struck out. Ooh! Well that wasn’t quite what he wanted. He wanted Dylan to have some success but not to hit a home run. And so it looked like maybe he’d hit a single? A double?</p> <p>The app stared at him, as if it were mortal. He quickly punched in:</p><p>Oh, good morning! Yeah, I’m not really functional without two or three cups of coffee myself</p><p>with a little grin icon.</p><p>See, now, this was the problem with trying to find the right women. He didn’t want to be the sloppy second that the women settled for. He wanted someone both he and Dylan could share, equally. When it came to their limited experience trying to find the right, single woman, Dylan had always been the front man and Mike had been the wingman. He was tired of being the wingman. Maybe it was time, really, for the best man to win. That comment to Dylan had most definitely not been just a joke – he’d been very, intensely serious.</p><p>And that man was stepping up to the plate now, ready for his turn at bat. Oh God, he was getting sick of the baseball metaphors.</p><p>The app beeped as she replied with:</p> <p>So I see you’re like, Mr. Triathlon and ski dude, and my idea of exercise is walking across the room to get the remote.</p><p>Oh, man. She was chatting him up. There was a natural opportunity here and he – he couldn’t blow it. He couldn’t blow it. He sat there in his boxer briefs, typing away with one finger on his ridiculous smart phone interface and realized that the boxer briefs were getting awfully uncomfortable. Because as he typed, he stared at her little avatar with those sweet dimples, and that amazing, intelligent look on her face and decided that his body’s response was telling him pretty much all he needed to know.</p><p>He typed out something that sounded good on the surface, and then the second that he hit enter – augh! – he wanted to take it back.</p><p>lolol, yeah don’t be afraid, we could just go for a hike if you want.</p><p>Oh, I think I just asked you out.</p><p>Yeah I did.</p><p>and then he ended it with a question mark.</p><p>Shit, a hike? A hike? God, could that be any lamer? Why couldn’t you come up with something romantic? Beating himself up came naturally, and this time he had good cause – a hike? Dylan had taken him up on his advice and taken Laura out to the fancy Asian fusion place that so many of the women they had dated loved to go to but, then again, he could count “all of the women they dated” on one hand.</p> <p>All of the women had also flatly and resoundingly rejected what they were offering, which was, he had to admit, pretty unique. However, settling for second best had left them both hollow and incomplete, and now they had an added complication. 2.2 billion of them, to be exact.</p><p>A hike, yeah, I’d like that. That sounds really cool.</p><p>The words sat on the screen like fairy dust, as if some unseen spirit had conjured them from a mystical layer in the universe and plopped them on Mike’s phone. Seriously? She said yes?</p><p>She liked the hike idea. Oh, my God. Oh, my God. He sucked down more coffee, the hot liquid helping to regenerate his brain cells, making him come alive and think think think to say the right answer.</p><p>Which was...? Smacking his forehead, he ran twitchy fingers through his hair, his palm grazing a day’s growth on his chin. Jesus. She was saying yes! The coffee felt like a pool of hot lead in his gut now as he raced to reply, typing out a response. OK, OK, breathe dude. Breathe, breathe, breathe. What could he say?</p><p>What could he say? Keep it simple. With a shaking finger, he wrote:</p><p>OK. So, how about this afternoon. After work? You wanna do lunch and then go for hike? I know a great spot in this State Park, a nice easy trail, it won’t be too hard on you.</p><p>He hit enter and then realized that that was probably one of the stupidest things he could have said, his fingers itching to find some magical “retract” button, a switch he could flip to withdraw his words from cyberspace.</p><p>Fuck! He wasn’t implying when she was out of the shape, he didn’t mean to... oh, shit. Mike, you idiot! He buried his head in his hands and fully expected her little icon to go away and disappear, and for Laura to think he was just a double failure at this shit, to go running back to Dylan – who knew how to handle women. Then again, if he was that good, why was Laura chatting right now?</p><p>She replied:</p><p>Sounds good. I’ll wear my hiking boots, don’t worry. I have feet, I can walk, I can use them, I can even move them independently while chewing gum.</p><p>And funny, too! He laughed and wrote back:</p><p>OK, phew, good to know. I like bipeds</p><p>and typed down his phone number. Laura sent hers back and he realized that he needed to say something, yet had no idea what to say because this was the first time that he had actually found a woman, on his own, without Dylan.</p><p>Yeah, yeah, yeah – technically Dylan had found her, but Dylan had no idea that he was independently pursuing her. The not-inconsequential fact that he had just essentially sniped her couldn’t be ignored, either.</p><p>Wow! He just stared at his smart phone, dumbfounded, willing his erection to go away but it wasn’t, and there was no hope that it was going to go away. He could tell as he just stared at the blinking cursor.</p><p>Finally she wrote back,</p><p>Hello, hello. Are you there, Mike?</p><p>Oh, Jesus. He startled as he realized he needed to respond, and quickly typed back,</p><p>Yeah, sorry. Not enough coffee yet. So, great, it’s a date? And thanks.</p><p>She wrote back a little smiley face, and he realize as he leaned back in the chair that he may have just made the biggest mistake of his life.</p><p>Had she really just made a date less than three hours after sneaking out of another guy’s bed? She opened up one of the seventeen texts from Josie which, as she scrolled through them, appeared to all be variations of “Please tell me about the hot guy.”</p><p>So she finally decided to put Josie out of her misery and typed out, “Hey. Awesome night. Will tell you the deets later“, hit “send” and almost instantly got back a response.</p><p>What do you mean later? Hell, no. I’m coming over.</p><p>She wrote back:</p><p>Can’t. I’m late for work as it is. Let’s just say I need a shower this morning.</p><p>and hit “Send”.</p><p>Squeeeee</p><p>was Josie’s reply.</p><p>Do you have another date?</p><p>Do I have another date? Oh, yeah, Josie, I have another date. It’s just not with the same guy. Ugh, how was she going to tell her this? She needed two showers. One to wash off Dylan and the other one to wash off her own skank.</p><p>This was getting ridiculous. She typed back:</p><p>There’s a lot to this. Will write more later. Come over after work.</p><p>She hit “Send” and turned her phone over, leaving Josie hanging, and padded into the shower. Indeed, it was time to wash off Dylan and her own... er... her own sense of ambiguity? Indecision? Disappointment?</p><p>Revelation? For she had learned so much these past few days, mostly about herself. In some ways, she was surprised to realize, it didn’t matter that Dylan was with someone else. In the past, that would have crushed her, but now – now she felt a renewed sense of power. Of strength. Stripping down and turning up the temperature on the shower’s spray, she felt her body melt into the hot water, the sting of the jets tearing her away from her looping thoughts, putting the focus back on her body. Rivulets of water streamed over her breasts, down her belly, with its gentle curves and lush skin, pooling at her V and sliding down her thighs, a familiar heat rushing into her womanhood.</p><p>It may have been only a few hours since she’d left his bed, but his mark really was on her. Closing her eyes, she remembered his touch and felt an incongruous sense of guilt. Guilt? He’s the one who had a girlfriend or wife. Yet here she was, scheduling a date with a stranger hours after having Dylan in her. On her. All over her.</p><p>The detachable shower head was about to earn its keep. She knew exactly where to aim it, her hands practiced when it came to masturbating. All her normal fantasies, though, weren’t cutting it – not the dream about Jake Gyllenhaal, or Matt Bomer, or even Zach Braff. Instead, her mind drifted to Dylan. And Mike.</p><p>As she parted her labia and zeroed the jet spray on her clit, she fought the image of Dylan. And Mike! Both? Yet nothing made it go away. Her body responded to the mere idea of it, of both of them at once, of four hands, two mouths, two cocks all focused on her. Laura. On her needs, on her pleasure, on her discovery. Ahhhhh...</p><p>This was crazy! She hadn’t even met Mike yet. Had crawled out of Dylan’s bed just a few hours ago, resolved never to see him again. Why was she letting them dominate her fantasies? She still had Dylan’s juices in her, his saliva dried on her, his kiss and skin and lips all – well, now that the water washed the night away, that wasn’t really true, but her neck tightened as her breasts swelled, her hands holding the shower spray in one hand, centered straight on her clit now, her other hand parting her labia and two fingers slowly entering her, the balance hard to achieve but easier as she propped one foot up on the edge of the tub and leaned back against the shower wall.</p><p>Her fingers encountered slightly sore flesh, her mouth spreading with an unexpected grin as she recognized why it hurt a bit, why the water’s sting was so bittersweet. Ah, Dylan – he had been thick and huge and gentle and rough all at once, knowing exactly how to press her skin, tweak her tight spots, play her body to perfect orgasm over and over with his tongue, his lips, his fingers, his hands, and that gorgeous, veined cock.</p><p>Now she had a face for her menage fantasies – Mike’s. Why not? Live a little, Laura. No one knew what went on in the privacy of her own mind, her own shower, and as she sighed deeply, the pressure of everything vanquished, she felt a familiar heat and bliss rise up in her as the water pulsed its way into her soul, her clit crying out for more, her fingers sliding in and out of her tight pussy not in a heated rush but, instead, slowly, stroking that spot on the top that always made her clench just a tad harder, made her breath hitch, made her imagine it was Mike’s fingers in her, Dylan’s tongue strumming her clit, both men eager and ready to enter her at once. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Mmmmm,” Mike moaned in her ear, his thick, wiry runner’s body sliding next to hers in the shower, beads of water darkening that blonde hair, toned arms lifting her up and plunging her down on his ready cock. And then – was that Dylan’s mouth on her ass? Then gently parting her cheeks as Mike lifted her, had her straddle him across the waist as he effortlessly held her in place, strong legs bending slightly so Dylan could...</p><p>She snaked her pinkie finger down so it played with her puckered anus, the mere touch of her fingertip on her perineum enough to tip her over, imagining Dylan filling her, double entry almost too kinky to even let herself dream about.</p><p>“Ah, God, Laura, more,” Dylan groaned behind her, his cock inching slowly inside her ass, Mike’s tip pushing hard against her cervix, her body entombed between them as the water sprayed down. When Dylan’s mouth found her earlobe she –</p><p>Exploded. The shower head, her pinkie finger on her anus, her fingers exploring her g-spot, and her dream all combined to make her bend down and scream as a mad rush of orgasm pounded her instantly, no warning, no teasing, just a wall of everything that left her gaping, her mouth open and her throat hoarse as she let it all unleash, her shoulders twitching and bashing into the wall, her hands moving and milking this for everything she could find, her mind filled with images of Dylan and Mike simulfucking her, their faces strained and cumming, too, all from her. Her body, her presence – her.</p> <p>And then – nothing. Like a switch flipped, she pulled her hands out of all her orifices, turned the shower head off, washed up fast and got ready for work. Sated, but not distracted, she shifted from horny, bewildered single on the dating scene to Business Analyst for the megacorporation.</p><p>That wouldn’t last more than a few minutes, for she knew her mind would wander, soon. For now, though, it was a welcome and much-needed break.</p><p>Mike had no idea what he was supposed to say as he stared at the chat window. This was so out of his element and Laura seemed so out of his league, but he knew he needed to do something. He couldn’t let Dylan be the one in charge of yet another woman. They were supposed to share her – that was the entire plan.</p><p>So he had typed,</p><p>“lolol, yeah don’t be afraid, we could just go for a hike if you want.</p> <p>Oh, I think I just asked you out.</p><p>Yeah I did” .</p><p>And when she typed “Yes,” he couldn’t believe it – and panicked. Now he actually had to step forward. Dylan had always gone out and found the women and had been the one to find Jill, and no matter how desperately they both missed Jill, Jill was gone and they had to accept that.</p><p>Laura was pretty much the opposite of Jill, but he could see what Dylan saw in her. That was a sweet smile. She seemed accomplished, and there was something Mike couldn’t put his finger on, a genuineness and authenticity, but he and Dylan were not exactly the most conventional package.</p><p>So he worried that maybe a business analyst at Stohlman Industries wasn’t going to make the cut – or maybe he was more worried that they wouldn’t make the cut with her. The office cubicle type wasn’t exactly eager to go out on the slopes or to even watch him at mile marker twenty during a marathon, in his experience.</p><p>But Dylan was giving it a good try and Mike had to, too. The problem was that Mike had to do it in secret. He typed in a few more words, they scheduled the hike, and then she disappeared, off to whatever corporate job she had on whatever floor of whatever giant skyscraper downtown. That world was so alien to him; he worked at a ski resort, and in fact he was missing it already.</p> <p>You don’t just work there anymore, a voice inside him said. You own it...</p><p>The season hadn’t started yet, but he looked forward to it. He always did every year and when he wasn’t skiing he was running. Between the two he kept his sanity somehow, for over the years he had learned that the endorphin kick that came from running and from the massive double diamond trails in the winter were what he needed most. Jill had fit in nicely with his life and with Dylan’s life, spending time running with him. Man, was she an ace on the slopes, too.</p><p>She and Dylan had an affinity for action movies, for cooking and...he let himself get nostalgic, even let his eyes well up with tears. Letting the memories flood him was dangerous, his mind tipping over from nostalgia to deep grief, a mourning he’d only recently been able to emerge from, the slam of Jill’s inheritance making him ache all over again.</p><p>His body was consumed suddenly by grief at her loss. It hadn’t been running, it hadn’t been skiing, it hadn’t been any of Dylan’s crazy antics like sky diving or parasailing that had killed Jill.</p><p>It had been one cell that mutated and mutated and mutated until finally it had taken over her body, the lymphoma wasting her away and neither of them had gotten over her death from eighteen months ago. In some ways Mike had gotten over Jill even faster than Dylan, though Dylan had been the first to go out and find somebody to sleep with. Mike hadn’t gone out and broken that physical barrier yet, replacing the memory of Jill’s body with someone else’s – he just hadn’t. Couldn’t.</p><p>Eighteen months, though. It had been a long dry spell and he was getting frustrated. Now he finally felt emotionally ready to at least give this a try, and he was more than physically ready. Who knew what the hike would bring? All he knew was that he had to try, and he had to try on his own. He couldn’t be the tag along with Dylan. That had complicated their relationship with Jill for far too long. It wasn’t until it was too late that Mike realized that it actually hadn’t mattered. He had loved Jill. Jill had loved him and they both loved Dylan. And the three of them had made it work, somehow, in their own crazy way.</p><p>Now the question was, could the three of them – this time with Laura – make it work? He was getting ahead of himself. All that mattered was having one hike with the woman. He just needed to see if this could be his future – their future.</p><p>She had never gone on a date like this – hiking? Meeting Dylan last night had been a very public affair, even if it ended in the very private way. She thought about it and realized that she needed to call in some reinforcements, so she texted Josie:</p> <p>Hey, Jose, I have a date tonight. Can you help me?</p><p>Josie texted back:</p><p>Oh, cool, the firefighter? Awesome.</p><p>Laura winced and answered:</p><p>Well, no, not the firefighter. Someone different.</p><p>What?</p><p>Yeah, it turns out I’m popular on that online dating site.</p><p>Josie texted:</p><p>Hold on, I’m five minutes away from your house – why didn’t you tell me earlier? Thought you were late for work.</p><p>I am, but who cares. You have time?</p><p>There is no way you can have that kind of date like last night and now a new date and not give me the juicy details before work.</p><p>Laura walked over to the coffee maker, put the basket in, dumped in some grounds and started what she knew was going to be the first of many cups of coffee today. As promised, Josie arrived within five minutes, barreling through the front door and plopping down her suitcase-sized purse on the kitchen table, eyes ablaze with curiosity.</p><p>“You slut!” Josie said it with a tone of admiration, not condemnation, and the expression on her face was so comical it made Laura burst into laughter.</p><p>“Well, thank you, I guess.”</p><p>“No, no, I just mean – damn. So, how does this work? What the hell happened with the firefighter?”</p><p>“He’s married. Or has a girlfriend.” Josie’s face fell, shifting from eager curiosity to self-righteous anger on Laura’s behalf. What a great friend. Laura almost laughed at how bulldoggish Josie looked.</p><p>“How do you know?”</p><p>“Because I woke up in his bed at three in the morning and there were pictures of her everywhere. It wasn’t hard to figure out.”</p><p>“Maybe it was his sister?” Josie asked, her voice going up high, as if hopeful and as if there was a snowball’s chance in hell it was true.</p><p>“In a bikini at the beach? Being kissed by him? Uh, no. Unless she’s Angelina Jolie and he routinely tongue-kisses his sister – ”</p><p>“OK, ewww. Point taken. So the guy is a slimeball and took you home while his girlfriend’s out of town. Fucker.” She rubbed Laura’s shoulder. “How did you handle it?”</p><p>“I woke up, saw the pictures, freaked out on the inside but stayed quiet, got dressed and almost cried in the cab.” Laura gulped a hot mouthful of coffee down.</p><p>“So you sneak home after ditching a guy in his bed, after sleeping with him within what? Three hours, four – OK, four hours of knowing him. You find out he has a girlfriend, with pictures of her plastered all over his room, so you decide you’re going to come home and write him off and...now you have a date with another guy?” Josie’s expression was, to say the least, comical. It was like a graphic of a “what the fuck” emoticon.</p><p>Only in real life.</p><p>“It is pretty freaking amazing,” Laura agreed, nodding absentmindedly as she added two spoons of sugar to her coffee. She hadn’t consumed coffee with sugar since tenth grade. Since returning home from her date, though, she’d been doing a lot of out-of-character things, including dating two men on the same day.</p><p>“Spill it.”</p><p>“I came home, was about to shower, and this guy IM’d me on the dating site. I had just blocked Dylan, actually, and made sure he wasn’t in my ‘Favorites’ anymore. So then Mike – ”</p><p>“Suddenly some guy pops up in the chat window on this website and asks you out?”</p><p>“Yes.”</p><p>“Worth it?” That was code for whether he was attractive.</p><p>“He looks like that actor who played Thor in the movie.”</p><p>Josie’s jaw dropped. “Not fair! When do I get Captain America hitting on me?”</p><p>Laura laughed and dumped her coffee, pouring a fresh cup. She started to tremble inside, the urge uncontrollable. It was all too much, too intense, and spelling it out for her best friend was making it all too real.</p><p>“What’s he do for a living?”</p><p>“Ski instructor,” Laura mumbled as she hurried to fill her mouth with more coffee and delay the interrogation. Josie rolled her eyes.</p><p>Her friend poured herself another cup of coffee, glanced at the clock and said, “Oh shit, I’m late for work, but I don’t care, this is, this is – this is awesome! Way, way better than any movie. Plus I have a front seat view!” They both winced at each other and Josie added, “Uh, you know what I mean. Not literally.” She shuddered.</p><p>“I’m so glad that I’m meeting your entertainment needs.”</p><p>“Come on, what kind of life do I have? I haven’t had sex in seven months. I have to live vicariously through you.”</p><p>Laura snorted, “Well, it serves you right after years of doing it through you. It’s only fair.”</p><p>Josie hung her head in mock shame. “Well, yeah, OK, fair enough, but lay off the years comment. I haven’t gone through that many men.”</p><p>“I beg to dif – ”</p><p>“Shut your whore mouth!” Josie threw half an English muffin at Laura’s head and, with catlike precision, she dodged it, both women howling with laughter. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Laura paused, thought for a moment, and said, “You know, you can open your own profile and see what pops up. To solve that seven month problem you’ve got going on there.” She gestured vaguely at Josie’s torso.</p><p>“Oh, I’ve seen what pops up. You know the phrase, ‘shit floats’?”</p><p>Laura just laughed. Ouch. Then again, Josie’s last date had been from an online dating site. Turned out to be a sixty-year-old neocon Tea Party activist who used a Groupon for dinner and made Josie pay her half before the coupon. Capitalism at its best – he’d made money off their date. And all Josie had to remind her was a lovely restraining order when the guy wouldn’t leave her alone.</p><p>“So when is the date?”</p> <p>“Tonight.”</p><p>“Tonight?”</p><p>“Well yeah, right after work. Mike says there’s enough daylight to make the climb in ninety minutes.”</p><p>“The climb?”</p><p>“We’re hiking. One of those hills at the state park outside of town.” If Josie rolled her eyes any harder they’d pop out and wander down the hallway out into the street.</p> <p>“He hikes, too?”</p><p>“He’s a triathlete.” Laura coughed, the unveiling increasingly ridiculous. Was any of this really happening?</p><p>“So wait a minute, Mr. Ski Instructor Gorgeous Triathlete Thor Lookalike chats with you for a couple minutes this morning and already tonight, you,” Josie looked her up and down as if surveying her from hair down to toes, “who are about as athletic as a slug, are going on a hike to the top of one of the biggest hills outside of the city where you will eaten to death by mosquitoes, you will become sweaty and ridiculously tired and then...”</p><p>“You’re so flattering,” Laura muttered.</p><p>“What? You’re gonna what? Climb a mountain, Laura? You have a heart attack when you can’t find the remote and have to actually stand up to change the channel.” That gave Laura a reason to pause. What the hell was she going to do? By the time she met up with Mike it’d be six at night. He said it was a ninety minute climb to the top. Granted, it was summer so there was plenty of sunlight until nine or so. But what had she gotten herself into? Did she even own hiking boots?</p><p>Josie continued, “Do you even have any shoes that are going to work with any kind of an outfit for climbing a mountain?”</p> <p>Laura just stared at her as if she’d been reading her mind. “I guess I’ll have to figure that out. All I know is I’m kind of in a super-emotional state right now, Josie. I got an unsolicited chat yesterday morning from a hot firefighter. Went out with him to one of the trendiest restaurants in town and ended up in his bed. When I woke up, I was surrounded with pictures of a women who looked like she was a combination of a beach volleyball player and a surfer. Which I’m not. Ever. At all. It will take me four lifetimes to ever be like that. I slumped out of there and then – boom! – I come home and there’s a chat from another guy. I, I don’t even have time to think. I don’t even know what to I’m supposed to think. All I know is I’m just saying yes to it all. I’m saying yes to life, I’m saying no to doubt and I’m just grabbing the brass ring and – ”</p><p>Josie interrupted her. “And you’re throwing out the clichés, like you’re talking a mile a minute, you won’t throw out the baby with the bath water, you aren’t going to count your chickens before they’ve hatched, like you’re ...”</p><p>“Oh, shut up.”</p><p>Josie stopped and put her hand on Laura’s arm. “Just be careful.”</p><p>“Oh, no, it’s fine. I’ve got condoms.”</p><p>“No, that’s not what I’m talking about. You...I just don’t want your heart broken again. You deserve – you deserve everything that’s going on right now. You certainly deserve to be able to fuck two hot guys in twenty-four hours.”</p><p>“I’m not going to do that.”</p><p>“Well,” Josie wiggled her eyebrows, “I would.”</p> <p>“Yeah, I know you would.”</p><p>“But I’m not you, Laura. And I’m just saying, be careful with that heart of yours. You – you know what I mean.”</p><p>Laura sighed. “Yeah, I know what you mean.” She squared her shoulders, took in a deep breath, let it out. A nice cleansing breath. “I’m saying yes. I’m saying yes.”</p><p>“Great. Will you buy coffee this time on our way to work? I really need a triple latte.”</p><p>“What?” Laura shook her head as if clearing it. What was Josie talking about?</p><p>“You said you’re saying yes. Say yes to buying me an overpriced coffee. Say yessssssssss.....”</p><p>She waved Josie off and got out of the chat window and did what every woman does in the twenty-first century after being contacted by a guy from an online dating website. She Googled him, just as she had Googled Dylan.</p><p>“Wow. What a strange set of results, Josie. Check this out.” Her friend craned over Laura’s shoulder to see the screen. Mike’s name appeared over and over, followed by a bunch of numbers. Some sort of times, like a race? Wait. The Tri-state Marathon. The Sunshine Regional Triathlon. Oh, my God. He wasn’t kidding.</p><p>He really was a triathlete. More than that – he was a steady, longtime triathlete. This wasn’t some guy who did it once for bragging rights.</p><p>She knew that guys could shine her on, that people lied in online dating sites and they often talked about being athletic – which was code for I watch TV on Sundays when the football game is on as an excuse to eat wings.</p><p>But this guy was the real deal. Page after page – she had to go twelve pages in before she found anything other than some race time. According to the dates, this guy had been doing this for at least the past ten years. Then she found a ski resort page. He worked at the ski resort. That’s what he told her, so he had been telling the truth. He was a ski instructor and first aid person. Interesting. That was as different from her life as you could possibly get. Same with Dylan.</p><p>She pushed aside thoughts of Dylan. Dylan was, as far as she was concerned, off her radar screen. He may still be lingering on her skin in that deep, sensitive part of her belly, and the scent of him might still be on her sweater – and maybe in the crook of her elbow, and behind her earlobe and –</p><p>Oh stop it, Laura, just stop it. The guy had a girlfriend. He was trolling the online dating sites, probably just to find a one-night stand or because he was a sex addict or – who knew? No more Dylan. In fact, she had blocked his number on her phone, removed him from her “Favorites” on the online dating website, and she was 100 percent done. Just wrote him off. No more Dylan.</p><p>Mike, on the other hand – Mike was new. Fresh. Untainted. What could she learn from Mike? Some protective voice inside her said, Are you a complete and utter moron? You’re going to go at twilight, during dusk, and walk a multi-mile trail in the woods with some guy you’ve never met yet – are you crazy?</p><p>Josie knocked her out of her reverie. “He seems interesting. I’m trying to imagine you running a – ” Josie gasped, “ – marathon.” Wheezy laughter. “Uh...I just can’t.”</p><p>“You just lost your free latte.”</p><p>“You know me, I’m a fast metabolizer of caffeine – that’s what my genetic testing showed me. You have to get me one! This – ” she pointed to the cup of coffee Laura had just made her – “isn’t enough!” She mooned a begging face.</p><p>“Did your genetic testing show that you consume enough caffeine to mimic a sun-addled mosquito on crack every day?”</p><p>“Yes.”</p><p>“Really?”</p><p>“Yes, it did.” Josie nodded soberly. “And so therefore, that explains why I need you to buy me a triple latte, Miss I’m Going to Say Yes to Life.” Josie frowned, “So was the sex any good last night?”</p><p>“What?! Why are you asking me that?”</p><p>“Well, we’re talking about saying ‘yes,’ so it seemed like a natural segue...”</p><p>“Of course it was good.” Laura rolled her eyes, her chest heaving a bit as she sighed deeply. “Too good.”</p><p>“What do you mean, too good? Is that possible?”</p><p>“Well, it’s too good when it turns out he has a girlfriend. He was just, phew – oh boy, Josie.”</p><p>“The best you’ve ever had?” Josie asked.</p><p>“Well,” she sighed heavily. “Yeah.”</p><p>“You’re sure he has a girlfriend?”</p><p>“The pictures made it clear.”</p><p>“Damn. Well, maybe you can say ‘yes’ to this guy you’re seeing tonight.”</p><p>“Yeah.”</p><p>“Yes.”</p><p>Huff, huff, huff. Laura was more out of shape then she’d ever imagined. Her idea of exercise was lifting her hand from her mouth to the bag of Doritos or lifting the spoon out of the pint of Ben &amp; Jerry’s. No, she chided herself, that wasn’t really true. She took the stairs at work, and that wasn’t a joke, considering the fact that she worked on the thirty-second floor. And she and Josie power walked around her neighborhood (Josie jokingly called it their Mugging Prevention Program), but this kind of sustained, prolonged effort that used muscles that involved the hard work of uneven terrain, hiking along the trails and the woods? This she wasn’t used to.</p><p>And that was OK. Really. Mike was a sweetheart who slowed his pace down and who was absolutely, fantastically interesting. Talking about everything from books that Laura hadn’t read since college, but had always loved, to movies – who knew he had a Christopher Guest obsession, too? She couldn’t wait for a second date where they could sit and watch Best in Show, and she could enjoy having that someone finally who appreciated the humor.</p><p>Second date? She was getting ahead of herself.</p><p>And she really liked that.</p><p>“Laura, are you OK?” Mike asked, a look of concern covering his face as she wheezed slightly while rounding a bend and staring at the tall hill leading to the summit. Too tall. Too high. Too little air. Ah, hell. What had she agreed to? Huff huff huff.</p><p>“Oh, I’m fine,” she lied. “Just not used to these tall hills. I’m more accustomed to doing eleven street blocks downtown while carrying my morning latte. Not hiking up a steep mountain while carrying a stainless steel water bottle. I’m adjusting, though – I’ll be good.”</p><p>He smiled and stared at her. “You’re a good sport you know?”</p><p>“I have to be. I don’t think I have the oxygen to run away.”</p><p>They both laughed in unison and Laura felt a warmth spreading through her. She couldn’t quite believe the way that the past two days had gone. First, she’d had an absolutely amazing date with Dylan. She could still feel him on her skin, even though she had slunk out of his apartment like a sorority girl sophomore learning how to navigate the world of one-night stands. Then again, it wasn’t exactly her fault that he had pictures of his girlfriend all over the place; funny how that killed the mood. All of that was (hours) behind her, for now here was this golden boy, smiling at her and standing there like Thor at the gates of Asgard, taking her on a hike. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mike was about as opposite of Dylan as you could possibly get. Tall – if he was shorter than 6‘5” she’d be surprised – blonde, maybe Danish, with piercing blue eyes and the lanky body of a thirty-something guy who walked like he was seventeen and still a little awkward. Just looking at his body told her he was a true athlete, and he had told her himself he was a ski instructor, so obviously he was coordinated, toned and balanced, and could move with fluidity and grace whether they were hiking, skiing, or...in bed?</p><p>She, on the other hand, felt like a giant cotton ball right now. A sweaty, huffing cotton ball. Who wanted nothing more than to relax in a hammock with a pitcher of sangrias.</p><p>And an oxygen tank.</p><p>Yet here she was, about a quarter mile from the summit of some crazy-ass hill that he wanted her to climb to the top of. She could expand her horizons. This was something new. He was sweet, quiet, kind of taciturn – but not in a bad way. Nothing was awkward. Nothing was uncomfortable. He was just was a man who didn’t talk too much. He preferred, obviously, to act, to stretch, to move – to move up that damn hill. Which she now stared at as if she were looking at the top of Mount Everest.</p> <p>“So, we’re really going to climb up that?” she asked, trying to keep the skepticism out of her voice.</p><p>“Yep, we really are!” he grinned. “But,” he patted the log next to him where he’d sat down, stretching out his long legs, his arms toned and golden, eyes kind and nervous. “We can take a short break.”</p><p>“A short break?” Eek. She didn’t mean to sound so overwhelmed, but if she paused, took a deep breath, and did an inner inventory, she had to admit that this hike was killing her. This may be her true walk of shame, especially if Mike had to call 911 and have her hauled down this mountain on a hand-held stretcher. With her luck, Dylan would be the paramedic on call.</p><p>Don’t think about Dylan!</p><p>“OK, a long break.” His hearty laugh put her at ease. What was most comfortable, though, was what he didn’t say – how he just moved from laughter to quiet, the silence self-composed and genuine. He wasn’t shifting around or twitching in his own skin. He just wasn’t going to say anything if he didn’t have anything to say, and yet his nonverbal communication was calm and sweet. Mike was just there, with Laura, and the two were spending time together. That was enough.</p> <p>She liked this. It was new. Time and space were enough, and as the seconds unfolded gradually into minutes, the minutes now more than an hour, she felt like she was spending time in a bubble with this new man, learning an entire new language of mindfulness.</p><p>“Whew,” she said, collapsing on the log next to him, trying to suck in her belly at the same time as her hamstrings cried out in relief.</p><p>Laura suddenly felt like a complete ass, her calm focus from just seconds ago vanquished, replaced by a self-consciousness that was most unwelcome. Not exactly experienced with dates like this, she’d overdressed and now, many miles into this hike, she was dripping with sweat, her hair limp and plastered against the edges of her face, her body flushed with the heat and the exertion of this trek up this crazy tall hill. She felt about as feminine as a wet tissue and yet that kernel of woman in her did have a spark of femininity, because she was responding to Mike in ways that shocked her.</p><p>Her body should have been spent from the night with Dylan. Rather than finding herself halting or tentative, it was as if what she had done with Dylan the night before had opened her up like a flower blossoming, giving permission to show its true colors and to spread itself in full glory – and right now, Laura was ready to spread herself again.</p><p>Easy, girl, she told herself as she stole another look at Mike.</p><p>What was it about these two? Dylan was incredible last night and yet she’d already crossed him off her mental list of eligible partners because the guy obviously had a girlfriend – or, worse, a wife. Who keeps the pictures of some gorgeous woman all over the place in their bedroom otherwise? And now here she was, less than fifteen hours after sneaking out of Dylan’s house and heading home for what she thought would be a nice, big cry and a pint of ice cream, finding herself with yet another incredibly hopeful relationship staring her in the face.</p> <p>Literally. She looked up and realized that Mike was watching her, his head cocked to the side, a little half grin making him look boyish and absolutely adorable. “What are you thinking, Laura?” he asked.</p><p>“Uh...” she stammered, completely unwilling to tell him what she was really thinking. “Oh, I was just marveling at how beautiful it is here.”</p><p>“Yeah it’s amazing isn’t it?” Was he staring at her to tell her that those words had a double meaning? She felt shy, suddenly, and tucked a clump of wet hair behind her ear, feeling her face flush with bashfulness. A rising heat between her legs didn’t help, either. Her body was telling her that they were alone, out in the woods, he was gorgeous and attentive, and –</p><p>“So you work here?” She forced herself to ask the question, to break her thought loop out of its rush, because if she didn’t, pretty soon she would just plain old jump him.</p><p>“Well, yeah in the winter, but I just thought I’d bring you up here on a hike right now, because the canyon looks so much better. Different – when it’s not covered with snow and skiers. Actually it’s kinda nice to be here when I’m not on duty and worrying about some teenager who breaks a leg or some eight year old who can’t grab the tow rope properly and gets dragged up the hill.” He chuckled and she joined him. That was the most she had heard out of his mouth in one continuous stretch since she’d met him.</p><p>He seemed so good-natured, didn’t talk much, was kind of quiet – and she liked that way more than she ever would have imagined. It was really different from Dylan, who was so gregarious, open and extroverted. There was a quiet depth to Mike that she found refreshing. Most guys she’d met on the dating site were either out for a piece of ass or to just sit there on a date and talk themselves up. Nobody had ever asked her out on a hiking date and she was starting to realize that this guy was different, this guy was special – and she hoped she was special enough for him.</p><p>“Shh!” he said, grabbing her arm suddenly, the pressure of his fingers more urgent than arousing. “Look!” he hissed, pointing into the woods. She leaned into him, craning her head to see what he was pointing to, taking advantage of the moment to get that much closer, to cross the silent boundary between them and to bridge the gap in those first seconds of contact that you never get back.</p><p>She could smell him this close and he smelled like pine and sweat and something more – a sporty musk that seemed to turn on her inner sensors, making her instantly flushed, a lump forming in her throat that told her that there was definitely a spark of chemistry here. An inner bliss poured into her veins, channeling through her, making every pore hum and relax as she reveled in the newness of Mike.</p> <p>“What is it?” she asked.</p><p>“There – do you see it?” Two deer stood deep in the woods munching on the bark of a tree. The mother perked her head up, turned to her fawn, and looked back at Laura and Mike with a precision only animals could possess. The doe nudged her baby and the two ran off into the woods, not so much scared as careful. You never know about humans; they’re just as likely to be friend as foe, and Laura understood. Goodbye, little Mama, she thought.</p><p>“Oh, wow,” Laura said. “That’s really beautiful.” A quick glance showed he was watching the animals as intently as she was, yet also attuned to the tension between them, now shifting from the sheer simplicity of first contact to a journey of unspoken communication. Blood pulsed through her, beating a rhythm of questions she hoped he could feel and that, in turn, he could decipher. I want you, it said, and the greatest hope inside her was that his return beat would be the message, I want you, too.</p><p>The pressure of his fingers lightened, shifting from a grab of urgency to a lingering touch that asked a question his mouth couldn’t – or wouldn’t – ask. Two seconds, Laura, she told herself, two seconds to just start to breathe before turning and looking at him. Was that his return beat? The feel of his fingertips was agonizingly puzzling, for it could mean nothing or, if she was right, it could mean everything.</p><p>When she turned, body perked like the doe’s, heightened by animal instinct, he saw it in his eyes, too, as Mike leaned down and took her lips with his.</p><p>Bringing Laura up here had been a dicey move. He hadn’t really thought much about his request to make a first date out of a hike, but then again he wasn’t exactly Mr. Suave. And this was his life, so sharing it with someone upfront made a certain kind of sense to him. Get reality out of the way and if the other person still wanted to see him, then great. If not, they didn’t waste their time and could move on. If only everything were so simple. Dating, so far, hadn’t been, no matter how hard he tried to make it cut and dried.</p><p>He found solace – he found peace – he found meaning and fun and even excitement in the woods, on the slopes, on a long run. When he ran, his mind turned off and something deeper turned on. An awareness of being that he only got from the pounding of his soles against the pavement, against the dirt, on the trail.</p><p>Most people didn’t like the way he lived. It was too different, too quiet, too introspective and too focused on doing and not focused enough on talking or posturing or obvious displays of status or of involvement in things that just didn’t matter to him. He wanted to move. He wanted to run. He wanted to ski. He wanted to help people.</p><p>And to his surprise, as he’d reached adulthood, he’d found that there weren’t many women, or men for that matter, who valued that. He watched Laura closely and had liked what he saw. She wasn’t an outdoors type but she was gamely marching on up this hill; he could tell she wasn’t a hiker. He could tell she wasn’t the type who would, on her own, take the initiative and go for a long bike or a run or a swim. She certainly wasn’t a triathlete, but she had a gentleness about her and openness and a willingness to just be that he didn’t find in many people.</p><p>He didn’t find it in any people other than, strangely enough, Dylan – and then in Jill. And so when he leaned in to kiss Laura, he surprised himself; that was the last thing he expected he would do on a first date. He wasn’t exactly the kind of guy who wined and dined women, and yet this felt right. It felt perfect.</p><p>Something in him deepened as their mouths met, as he reached for her, as he claimed those curves for his own. In that moment, he rose up and a finesse, a sophistication that he knew was there but buried very deep, surged to the surface. This woman was his, in his arms as she softened, opening up to him, their tongues intertwining. He would definitely not be just sharing this woman with Dylan. They would be partners with this woman.</p><p>Arousal burst through his veins, like a pump turned on, a switch flipped, with a sudden explosion of want and need and lust. Hungry for more of her in his hands, on his lips, against his body, he searched her, like going on a journey through another person’s land, and found that his need to explore was absolutely endless. His erection pressed against her leg as she leaned into him pushing, searching, wanting. The two joined in an obvious mutual exploration that made him wish he had asked her to his cabin for dinner so that a bed were handy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And then his mind slipped into that place it went when he ran, when he skied, when he hiked. He had never been able to access that part of himself through anything but heavy exertion or laser-like focus on the kinesthetics of life, but here, here he found himself shifting. A subtle and then suddenly dramatic movement from one layer of life to another.</p><p>As her hands roamed over his shoulders, felt his back, tightened over his waist and went elsewhere, he filled with a warmth, with an urgency that eighteen months of grief and denial and restraint and constraint had allowed to grow into something so strong, something so big that it was in their kiss, and her touch unleashed it, here and now.</p><p>It just was. Endless and timeless and present, exactly as it had been with Jill.</p><p>But more.</p> <p>Oh, my God, what was she doing? She still had Dylan’s taste in the back of her throat, Dylan’s scent on parts of her skin in spite of her thorough shower this morning, Dylan’s essence deep inside her – and here she was in the arms of another man. A godlike, amazing, muscular man. She felt his warmth underneath his clothes and wanted desperately to feel his skin without the layer between them.</p><p>How could this be happening? How could two incredible men want her and within twenty-four hours of each other? This was...her mind went blank as Mike probed her mouth, his tongue filled with more questions and answers, his hands thick and strong, grabbing and caressing and owning parts of her. Her own questions faded, melted into the warm wetness of his mouth and she knew, just knew on some deep level, some layer within herself that she didn’t even know she had, that this was so much more than she ever anticipated when that little chat window had popped up this morning.</p><p>Thank whatever higher power she was supposed to thank for that little chat window.</p><p>His hot breath filled her and then cool air touched her lips as he pulled away. The sound of his deep breath, an intentional, centering breath that she recognized instantly, filled her with uncertainty. Was he having second thoughts? All these extra curves weren’t exactly accessories she figured were standard features on the women Mike normally dated. Those were the weekend yoga babes, the women who competed in mini-triathlons for fun and who went on 100-mile weekend bike rides just because. They were a different kind of woman than Laura. Hell, they might as well have been a different species. What would Mike want with her, with all her soft rolls and overflowing cups and dimples and apple cheeks and –</p><p>Had she gone too far in kissing him? Wait a minute, now – he was the one who initiated the kiss. He had kissed her. She had nothing to worry about; she done nothing premature. C’mon, Laura, she thought to herself, just stop this. This is crazy. Her old insecurities flooded her as she tipped her head down, averting his eyes, his hand still on her shoulders, one trailing a lazy path down the side of her rib cage, brushing briefly against her breast.</p> <p>He let go of her shoulder and reached up to her chin, tipping it, forcing her to meet his eyes. What she saw there told her everything she needed to know. She laughed nervously, “I don’t normally do this, you know?”</p><p>“Do what?” His voice was smoky with need. It had changed. The affable, slightly awkward man she’d started this hike with had suddenly evolved into a determined, commanding, dominant man.</p><p>“I don’t normally go on long hikes with guys and then kiss them before we reach the summit. Typically, I wait until we get to the top.”</p><p>He smiled. “OK, then I have something to look forward to. Come on.” He pointed to the trail head.</p><p>She groaned. “All right, if you insist.”</p><p>He held his hand out in a gesture of chivalry, “Ladies first.”</p> <p>“Promise?” she asked, the word popping out of her mouth before she could take it back.</p><p>He cocked one eyebrow, a lascivious look, “Oh, you can count on it.”</p><p>What was she doing basically promising this guy that she was going to have sex with him when they reached the top of the mountain? Earth to Laura! She had to laugh at herself on the inside, trying to hide the racing thoughts from Mike. The pounding of her inner voice was so strong, so loud and so pervasive that she feared everything going on inside her head was so obvious that he could read her.</p><p>As he took her hand, intertwining their fingers, and they walked slowly at Laura’s pace up to the top, she felt herself tip over. This was something new and this was something good and she wasn’t going to let that ridiculous doubting voice inside her ruin it.</p><p>With each step she felt her energy rebound, her heart rate steadying and her body finding some sort of equilibrium to keep pumping herself up, to manage the trail and to climb higher. Perhaps it was the excitement of Mike’s kiss, his proximity, of the promise of something more when they reached their goal. Silly though it seemed, that made her live in the moment, and when they finally reached the end, the view really was otherworldly.</p><p>So was Mike’s touch.</p><p>Just don’t sleep with him, that little voice chided her. Don’t be that kind of woman. Wait one more date. In some ways, she hated that voice, but this time it really was right. Sleeping with Mike this soon after Dylan would seem crass. Over the top. Unfair to Mike.</p><p>Unfair to her. She needed a few days off from everyone to just think this through. Of course, she’d never see Dylan again. That was a done deal. However, she still had unresolved feelings for him, and that meant clearing her mind. Couldn’t do that with Mike’s tongue in her mouth.</p> <p>Or his dick in her –</p><p>“Hey? That’s an interesting look. What’s going on in that mind of yours?” Talk about a loaded question. Laura struggled to answer. He peered at her, seemed to really study her, and it was as if he knew. Knew what she was thinking, understood the demons she wrestled with, and was being respectful – but still curious. If it weren’t 100 percent impossible for him to have any idea about her date with Dylan last night (this morning) she would have thought he was giving her space to think things through.</p><p>That was just crazy, though.</p><p>His arm reached for her, pulled her into his embrace, her back to his chest, and he settled in, holding her as if they’d done this a million times. Inhaling deeply, she relaxed into the hold, feeling like they had done this forever. How could this be? Why did she feel so settled with him already – and yet so excited to get to know him, all at the same time? She examined his forearms, bare and wrapped around her ribs and chest. Light, sandy hair dotted the arms, which were deeply freckled, though the spots were light. A few scars, but nothing that spoke of severe trauma. No ring, and no tell-tale white skin where a ring normally resided. He did wear an old-fashioned friendship bracelet, the kind she hadn’t seen since she was a young teen.</p><p>“What’s that?” She fingered the thin, braided band, faded from red and blue to a pale pink and blah-ish grey color. Changing the subject might help her escape more scrutiny about her thoughts.</p><p>He tensed, his wrist starting to pull back, and then he paused, taking a deep breath that she felt against her back. How rare, she thought. A man who took the handful of seconds to consider his actions, to be deliberate. Whatever response he was about to give her, she knew, would be forthright and honest, coming from a deep center she wanted to touch.</p><p>“An old friend gave that to me.” She could feel him swallow, could sense the unspoken. Someone very, very special.</p><p>“It’s been beaten up and seems to have gone through a lot, but looks well-loved.”</p><p>“So was she.” Laura stopped breathing. His voice had gone quiet, the words a whoosh out of his lungs, like something he couldn’t control but that he could barely stand to say. The mood had shifted abruptly, her innocent questions something she normally would wish she could take back, would normally berate herself for asking, for making everything awkward with one simple piece of chit chat.</p><p>Except she wasn’t. Regretful. Asking that question may damn well have been the best choice she’d made all day, because she got a glimpse into a very, intensely private man and his profound nature was revealed, even in a tiny sliver.</p><p>This was what she wanted. And Dylan. Go away, Dylan! she chided no one – the voice in her head – as if he himself had invaded her thoughts. Why was she experiencing this strange duality, in Mike’s arms and feeling his pain for someone he’d once loved all while thinking about a man she’d been with last night – one with a hidden significant other?</p><p>It was madness.</p><p>“I’m sorry,” Mike said, stepping back and turning her around. His eyes were sincere and warm, tinged with nostalgia and troubled. “Mentioning her is the last thing I should do on dates. Talking about a past girlfriend isn’t exactly part of the blueprint for a successful new relationship.”</p><p>Relationship? Did he say relationship? Laura’s heart sang.</p><p>“It’s fine,” she assured him. “I understand. You loved her. You can’t separate that from who you are and what you feel in any given moment.”</p><p>He flinched but kept eye contact, obviously shocked by her words. Had she said the wrong thing? Her usual insecurity was gone, replaced by a steadfast calm. Whatever she said, it had been from the heart, and that is all that really counted.</p><p>How could she read him so well? Freakishly well. He felt like a complete idiot for talking about Jill right now, and yet somehow Laura made it seem fine. Natural. Like another extension of himself, just a perfectly typical part of life. Against all hope he had thought there might – just might – be a woman like this out there for him and Dylan. Someone sweet and nice and understanding and accepting. Not quite convinced she was out there, he had basically given up, and now Dylan had found her on a damn online dating site, of all places. The kind of place where men trolled for sex.</p><p>Dylan, though, had been seeking something more. And now here “more” was, standing before him, telling him that who he was was totally fine. That talking about his dead girlfriend was OK because it was how he felt.</p><p>What had he done to deserve this – and how could he keep it all going?</p><p>Pulling her into his arms, he kissed her again, this time with more urgency and a deeper acceptance. Less questioning, more certainty. Was he imagining that she felt it, too? Her lips were less tentative, more confident, as her tongue slipped in and did its own claiming, her hands pressing against his shoulder blades and pushing him into her, her hips lifting up against his. She was shorter than he was used to, a good foot smaller than he, but her curves were addictive, his hands wanting to touch every inch of flesh, especially the expanse from the soft spot where her ass and thigh met up through to her breasts. Handfuls of Laura and her little sighs of pleasure made him harden even more – if that were possible – and by God, if they weren’t heading toward dusk on a mountain where it wasn’t safe to be unprotected at night, he’d have spent the next five hours devouring her, right here, right now.</p><p>However, if they stayed, the bears might very well do the devouring, so with great reluctance he pulled back, cradling her face in his hands, smiling down at her lovely, flushed cheeks, those eyes eager and bright. “We need to go down the mountain now before it gets dark.” He pressed his forehead against hers and closed his eyes, taking a deep breath. “I wish...” He couldn’t finish his thought, too overwhelmed by the crushing chaos of turbulence inside him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She nodded, making his head bob slightly, in turn triggering a grin on his lips. “That would be an inauspicious first date. ‘Woman eaten by bear.’”</p><p>“Why do you assume the bear would eat you?” He laughed and opened his eyes. She was looking at him with a half-smile.</p><p>“Because I have more body fat and you can run faster.”</p><p>“I would help you climb a tree.”</p> <p>“Guys do that so they have an excuse to stare at our asses.”</p><p>He craned his head behind her body and looked down. “I don’t need an excuse.”</p><p>She blushed and looked up, a tight, amused smile on her lips. Had he gone too far? “First date?” she said. She seemed to be forcing herself to make eye contact.</p><p>Puzzled, he frowned. “Uh, yes?”</p><p>“That implies there might...”</p> <p>“...be a second?”</p><p>She nodded.</p><p>“That’s up to you, Laura.”</p><p>Not telling Dylan about Laura really was going to kill him, but he needed this second date to confirm his suspicions. When he came out of his bedroom and found Dylan hunched over his laptop, naked except for his boxer briefs, shoulders curled and face staring intently at the screen as he chowed down a bowl of cereal, Mike couldn’t help himself. He snickered.</p><p>Dylan practically climbed the walls, startling, his face panicked and body spidery with a fight-or-flight stance. “What the fuck, Mike? Why do you do that?”</p><p>“Do what?”</p> <p>“Creep up on people like that!” He had one hand on his heart. “Fucking gave me a heart attack.”</p><p>“Hey, I didn’t do anything weird. I walked into my own kitchen to grab breakfast. You’re the freak. Why are you in another world?” A quick glance at the screen gave him his answer: the online dating site.</p><p>With Laura’s picture and profile.</p><p>Fuck. Suppressing his jealousy, Mike opened the fridge door and grabbed a half gallon of milk to pour a glass as he popped two pieces of bread in the toaster.</p><p>“I’m – ah, hell, I guess I’m stalking Laura.” A rush of protectiveness hit Mike in the solar plexus like a punch. He knew Dylan wasn’t going to harm her. Knew it was just because Dylan was crazy about her. Knew all that.</p><p>Still reacted.</p><p>“But I thought she blocked you?”</p><p>“She did. Wait – I told you that?”</p> <p>“Yup.”</p><p>“Well, I made a new account and am trying that way.”</p><p>Mike blinked. The toast popped. Dylan returned his attention to the screen. As Mike grabbed peanut butter, he asked, “So you created a new identity to try to trick her into talking to you?”</p><p>“No. My new account says it’s me. I’m not that crazy.”</p><p>Yes, you are, Mike thought. Almost said it. Held back. Smearing the peanut butter, he shredded the toast with too much force, making the piece collapse and slime his hand and wrist with nut butter. What a mess.</p><p>Yeah. What a mess.</p><p>“Aren’t you worried she’s going to be creeped out by you? I mean, she blocked you. Case closed. Move on.”</p><p>Dylan shook his head and sighed, his six pack folding in and then out, the muscles rippling up through his chest. Mike admired it with a contentment, like looking at fine art. He didn’t need to touch it; just seeing it was satisfying enough. Knowing it was there when he wanted it sufficed.</p><p>“Seriously, Dylan. Any woman would be freaked if some guy went around chasing her like this. You tried messages on her old account. She blocked you. You tried calling – same. Now you’re getting unhinged.”</p><p>Beep-blip! “Woot!” Dylan shouted. “She’s responding!”</p><p>Mike rushed across the room to see. A swirl of good and bad mixed within him, for if she wanted Dylan again, would she stop seeing Mike? Or, hope against hope, would she consider seeing them both?</p><p>Please leave me alone, she wrote. Mike couldn’t contain a snort of laughter. Dylan scowled.</p><p>“Fuck!” Schadenfreude aside, Mike’s inner thoughts mirrored Dylan’s, because in the end while this was amusing, watching Dylan twist in the wind, the fact that he wanted to share Laura meant that somehow he had to find a way to make her see his partner again, to clear up whatever misunderstanding had developed that one night they’d been together.</p><p>Of course, Dylan couldn’t know that Mike was dating her – man, when had this become so complicated?</p><p>When you asked her out, Dumbass.</p><p>Oh. Yeah.</p><p>“How many messages have you sent her?”</p><p>“Thirty-four.”</p><p>“THIRTY-FOUR?” Mike howled with laughter now, unable to hold back, leaning against the counter and spilling the last bit of milk in the half gallon carton as it toppled over, sideways, then plummeted to the tiled floor. “Shit!” he shouted, grabbing a hand towel and bending down to clean it up.</p><p>“Is that a metaphor?’ Dylan muttered, typing something in the chat window.</p><p>“What are you writing?” Mike split his attention between the milk mess and Dylan’s mess.</p><p>“I’m asking her to meet me for coffee.”</p><p>“No chianti and fava beans?”</p><p>“Shut up.” Dylan’s glare turned from simple annoyance to a simmering fury. OK. Mike knew when to let up. Half a minute later and the milk was cleaned up; time to get out of the house and let Dylan find his way through his heartache. He had a date tonight.</p><p>One that required some serious planning to pull off. What was Laura thinking right now, facing her own screen as Dylan tried again and again to talk to her? Was she scared? Intrigued? Pissed? She kept turning him down, and that didn’t bode well for a future triad.</p><p>All Mike could do now was “wow” her with tonight’s date. He left half-naked, brooding Dylan to find his way through her roadblocks, the man grousing about all the ways he might have screwed up on their date.</p><p>Same mountain, new date. Or, it seemed like the same mountain. They all seemed the same to her as her vision blurred, her veins unaccustomed to blood pumping this hard through her body for any reason other than sheer arousal.</p><p>Arousal was an issue here, though, too.</p><p>The view from the top of the mountain was breathtaking and Laura probably would’ve appreciated it more if her attention weren’t completely focused on Mike. He was all she wanted to watch as he surprised her. He’d carried a back pack at his side through much of the walk. Not wearing – just carrying it. And now like some sort of a magician’s hat, he pulled out a blanket, two bottles of red wine, a couple of glasses, a container filled with five or six different kinds of cheese, most of them names she couldn’t pronounce, and a set of grapes and strawberries, a couple of them chocolate covered.</p><p>“What’s this?” she said.</p><p>“I thought I’d surprise us with a light dinner.” He smiled shyly. “I’m too much of a gentleman to take a woman out and not feed her at least something. I may have dragged you along for this crazy hike and ruin my chances at the second date, but I’m at least you can’t say we didn’t have dinner.”</p><p>She surveyed the layout before her. Some sort of a camping blanket; thin, but well-worn. Actual stemware, wine glasses that he kept in a special case. And as he inserted the cork screw into the first bottle of wine, and very deftly opened it, she sampled one of the cheeses.</p><p>“Mmm, sheep’s cheese?” she asked.</p><p>His eyes lit up. “Yes! You can tell from the taste?”</p><p>“Yeah,” she said, “it’s one of my favorites.”</p><p>“Well, hot damn! Who knew I’d find someone who knows their fromage?” he said, biting his lower lip, and smiling and nodding at the same time, as if he quietly celebrated a minor success.</p><p>“Yeah,” she said quietly, “who knew?” Her face shifted in an expression of wistfulness, of serenity, of being very much in the moment.</p><p>She felt she could breathe around him, that she could appreciate each breath. And as he handed her the glass of red wine, she sniffed it, then took a sip. “This is good.”</p><p>“Guess?”</p><p>“Guess what?” she asked.</p><p>“Guess what kind of wine this is.”</p><p>She surveyed the bouquet, sniffing a couple of times, lapped at the red wine very ostentatiously, took a zip, and looked at him grandly, with as much pretension she could muster, and declared, “It’s red.”</p><p>He burst into laughter. “How sophisticated.”</p><p>She shrugged. “Sorry. I may know something about cheese, but I know nothing, absolutely nothing, about wine. But I like this.” She reached for his hand as they stood and stared out at the valley. “I like this a lot.”</p><p>His warm palm closed over her shoulder and he looked down at her, standing a full foot above her frame, his neck leaning toward her, his face an inch away. “Yeah. I like it a lot too.”</p><p>Making love outside, in the fresh air, had never been part of her bucket list. In fact, it was more a part of her anti-bucket list; bright light, no covers, on the hard ground? Who would find that appealing?</p><p>Uh, her. Right here. Right now.</p><p>As Mike stared at her, eyes burning with an intensity she fell into, an abyss of wanting, she found herself startlingly interested in trying this new experience. Was this why he had gone to so much trouble – the wine, the special blanket, the fromagerie of cheeses and such? It dawned on her that he wasn’t just being a sweetheart, giving her a lovely, gourmet picnic for their second date.</p><p>As a matter of fact, what they had eaten was just an appetizer.</p><p>She was the entree.</p><p>His kiss wasn’t a surprise; what shocked her most was the preternatural urge that welled up, unbidden, as his hands seized her ass and hips, his body knowing exactly what – and who – it wanted. He shifted, like he had on their first date, from a mild-mannered, lanky, zen-like dude to a ferocious, sexual alpha male.</p><p>And she – she – had triggered all that. It excited her almost more than his touch, the way his tongue conquered hers, how his palms were greedy for so much of her skin, his chest pressed into hers, the thick outline of his erection in such stark relief against her inner thigh she could probably sculpt it out of clay from memory. When he urged her, gently, to kneel, then recline, on the blanket, she knew her outdoor sex cherry was about to be popped, and the inner burst of need that felt like a thin membrane of restraint about to give way told her she was more than ready to bare all before nature.</p><p>“Mmmmmmmm,” she sighed. His mouth moved from hers, hands tracing patterns of lust and hold on her breasts, as if he were memorizing the terrain, his flattened palm stealing down her ribcage as his lips caressed her neck. She had worn a skirt today a just in case move that she was grateful for, now, because the easy access meant that this would be so much simpler, more direct, less complicated.</p><p>Like Mike.</p><p>And, thankfully, she had shaved. Landscaped, if you will. Going nearly bald had been a new experience, the little landing strip like a giant, glowing neon sign pointing to her clit. She almost smiled to herself; would he like it? Hate it? Not care?</p><p>Barely functioning nerves kicked in and she couldn’t turn off the lopping thoughts, the cluster of fears and insecurities, even with this gorgeous athlete’s hands greedily touching every part of her, even as his lips brushed her abdomen, her hands in his hair and – oh! He was going... </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The smooth, cold feeling of her skirt sliding up her thighs felt like butter melting on hot flesh as a light breeze blew up to her V, centered on the little bit of hair under her postage-stamp thong. She shivered and he nearly growled, his face about to descend on her womanhood, his eyelids heavy and his hands communicating his own, barely-controlled need. A deep sigh from him as his hands roamed up her torso told her more than words, that he was enjoying this, that her body was his and fine and enough.</p><p>As he slid the thin string of her thong down her legs she worried they were too plump, too full, too – and then, oh wow, he gently kissed her labia, a soft touch like a promise, so profound she nearly came in his mouth, the thought and feel of this giant, gentle man wanting her such a balm. A quick flash of Dylan – would he never leave her thoughts? – nearly ruined the moment for her, but she pushed him away and let Mike continue, surrendered to what was before her.</p><p>A man who very much desired her – and who was showing it, touch by touch.</p><p>“Oh, oh!” she whispered, his hands slipping between her ass and the blanket, her naked bottom half exposed for the sun and clouds and sky to view unfettered. Modesty disappeared under the sun’s rays in their secluded spot, and the knowledge that here, miles from anything that could judge her, they just were two people enjoying each others’ bodies and minds. Muscled arms pressed in the right places, his fingertips gently folding back her labia and his hot breath teasing her just before his tongue did its dance, flicking against the tender, red skin that craved his mouth so much.</p><p>She bloomed with lust, every pulse of energy focused on her womanhood as he sucked her clit, slowly extracting the release within, entering and pulling back with two perfect fingers as he seemed to know exactly what to do to make her build to a climax. This wasn’t some shy guy who didn’t know his way around a woman’s body; she couldn’t control her shaking legs, a sign she was getting so close and, moreso, that he was a master at triggering a woman’s touch points, making the different parts fall into place for the grand finale.</p><p>Letting go was so hard, but at one point Mike’s hand came up and touched her hip bone, the simple, non-sexual gesture a symbol of a bond here – that this wasn’t just sex, but it was something more. A connection. She looked down – something she never, ever did during oral sex – and her hands found their way into his hair again, her eyes wide open as she took in the cloud formations, the shine of sunlight on the side of the mountain, the lush greenery, the quality of the light and the chirping of birds. They were just mammals who were part of nature, yet so much more.</p><p>“Please, please!” The words came out of her so abruptly she nearly pulsated as she came, her pussy walls slamming against each other as the orgasm hit her without warning. She groaned, pelvis grinding into his mouth and tongue, which danced maddeningly right where she needed it most. Then he lapped her, enlarging the surface area of his amazing tongue, changing between flat and pointed to tweak every pixel of flesh he could. Feeling both sensations led to a screaming rush as a huge, muscular wave tightened every part of her, her dripping hole clinging to his finger, fucking his face, his tongue eagerly catching up to her clit.</p><p>“No! Keep going!” she groaned, hands curling into fists of orgasm, her pussy crammed into his tongue as she hissed, “You are so – oh, Mike!” The vortex of lust, the churn of hope and disbelief and pleasure, didn’t stop and she didn’t think it was possible to feel so much so fast, his fingers strumming her and his tongue licking exactly what she wanted and where she needed, the blanket beneath her ass soaked, his breath coming in little pants now as she imagined he was ready to explode, too.</p><p>Keeping her pussy on his tongue, he maintained a steady pace, little laps followed by faster, eager strokes, tonguing her, working to extract every last bit as she came and came and came, comfortable enough to let her face contort and her body twist as she reveled in what he could do to her. One deep, full-body clench as she closed her eyes so hard she saw fireworks behind them and she was done, the peak ended, her prayers nearly silent, the breath leaving her body.</p><p>He grinned, then climbed up her body, his long, lanky runner’s frame a muscled wall as he made his journey up to her. One hot kiss full of her taste made her red and engorged again, her clit tightening so much she came right there from just a kiss, her hips pushing into him, her own musk covering her lips, her nose, the intoxicating odor so powerful that she couldn’t believe she was coming again. What kind of man could do this to her?</p><p>This kind.</p><p>Frantic hands that didn’t feel like hers, but were, pulled at his waist. She wanted him in her now. Preliminaries first, of course – she had to give him some attention, too, as a wildflower patch nearly mingled with a low breeze to send an incredible, heady rush of pollen and perfume their way. Freeing him, she gasped.</p><p>She looked down at his cock, pausing a moment to really appreciate it, rising up to meet her.</p><p>“Laura,” he said, his voice gravelly and tight.</p><p>“Yes?”</p><p>Then he reached for her and in one fluid movement stripped off her shirt, his eyes lighting up as her skin shone in the light. She hunched her shoulders forward, a bit embarrassed to be so exposed in bright, unrelenting sunshine.</p><p>“Don’t,” he said, his hands cupping her breasts, fingers playing with the light-pink lace at the top of her bra. “Don’t do that.”</p><p>“Do what?” Alarm raced through her veins, mixing with the endorphins from the orgasms she’d just enjoyed, leaving her cotton-headed and puzzled.</p><p>“Don’t hide yourself. Oh, Laura – you are so beautiful,” he whispered in her ear as he leaned forward, unclasped her bra, and pulled off his t-shirt. Within seconds he had unveiled himself completely, his body nude before her, and he gestured for her to do the same.</p><p>She had to stand to slide off her skirt and she sucked in her lower abdomen, wishing she’d spent more time on pilates than dead-lifting, the pain of each fat roll of excess ruining her arousal.</p><p>Until Mike said, “You’re like a model in a Renaissance painting. Perfect and real.” He pulled her hand and brought her down to the blanket, kissed the nape of her neck, and she melted.</p><p>She was real.</p><p>As she grinned, she took one experienced hand, making sure she had his full, erect attention now. She ran her tongue over her lips, savoring the pleasure she was about to give, so the first touch would be perfect, not too dry or bothersome – and, of course, all-too-real.</p> <p>She clutched his swollen rod in one hand and teased his tip, ripples of muscle under his rib cage going crazy. Flicking the tip until he groaned, she perfected the friction level all the way down, completely aroused by his excitement. Thick runner’s legs shifted, the hair against hair like the sound of light sandpaper, and his face was open, languid, even, as she touched him.</p><p>No one – not even Dylan – had made her feel this comfortable with her own sexuality. So pure. So real. So alive. Mike was so present with his arousal, so into the moment of her hand, her mouth – her.</p><p>Returning her attention to the tip, firming her grip and tonguing the soft rim of his mushroom, she knew he was getting close. Her hand rubbed the base of his cock while she very gradually moved her mouth up and down on him, accentuating the sensation of the roof of her mouth, her tongue and her lips, pumping him with her hand and hoping that she could give him the same pleasure he’d so beautifully given her just moments ago.</p><p>One of his hands touched her head, stroking her hair encouragingly, the fingers trying to tell her something she already knew – this was good. Great. Amazing. She took her time to extend his pleasure, for making love on this blanket at the top of a mountain, jet trails above them the only testimony to civilization, was a once-in-a-lifetime event. She wanted to make it perfect.</p><p>She continued this motion, going slowly faster and faster as his fingers tightened in her hair. She gently touched his balls, knowing she was on the right track when she began to taste him as he released that little drop of fluid, and she groaned with enjoyment. She took him into her mouth as far as she could, as her fingers clutched the base of his cock while continuing to stroke it, his athlete’s body tensing and clamping without regard for anything but the pending release.</p><p>Blowing more air on the sensitive skin while milking him, he groaned, neck muscles tense with the agony of holding back. She was ready to give him the release he so desperately needed and licked her palm to get ready for more when a firm hand covered hers.</p><p>“No. Not like this. I want to be in you,” he commanded. It wasn’t a request. Laura was more than ready to comply, but he beat her to it.</p><p>He searched for her clit, finding her willing again. “You make me want to take you right here, right now, in the wild open, Laura.” A completely new wave of arousal came out of nowhere, slamming her, making her want to fuck him for the rest of time. Or, at least, for the next hour. She wanted to straddle him, to ride him, to feel that Greek-God body on top of hers, to be together and come together and so much more.</p><p>“Climb on me, Laura. I want to touch you,” he said, pulling her gently onto his hips. She was so wet as she reached beneath her, straddling his hips now, the little scalloped edges of muscle where his abs met his hips too tempting not to touch. As her fingertips brushed there he shivered and nudged her just so – making the tip of him go in her. It felt like sinking into the perfect, hot bath, like the first bite of a chocolate torte in a cafe in Paris, like – so cliched! – like coming home.</p><p>To a home you didn’t know you had.</p><p>He pulsated and she moaned with pleasure as her thighs hit his balls. “You are so amazing,” she moaned. Her entire body stretched up, catlike, her breasts thrusting forward and instantly covered with his enormous palms, the feeling of his fingers pinching her nipples like a direct, hot route to her clit. Something zinged on her arm, then again on her thigh, and she felt more inside her pussy walls, her body overcome with little zaps that hurt, then faded.</p><p>As she rocketed herself up to the mushroom cap, the friction made her shiver, growing an orgasm that felt like it might just very well be more supernova than any before. He licked one hand and stroked her nipple, then repeated on the other side, the pale pink skin pebbling at his touch, making her throat tighten and her passage wetter than she thought it could be. He was making her G-spot scream for attention. She shifted, changing her weight distribution, then drew him all the way out to the tip, clamped her pussy, hard, then impaled herself.</p><p>“How did you – What are you doing?” he groaned. “Do more,” he urged, his hips thrusting up to catch her now, the rhythm clear. He was close, and so was she. She was at a loss, the feeling too intense.</p><p>Mike took charge, his hands on her ass, guiding her in rhythm as he used his glutes and thigh muscles to push up, then pull back. If he angled her hips just so, he could hit her –</p><p>“Ah, God, right there, Mike!” she gasped. She needed to touch herself, as he widened her pleasure zone by stretching his legs open a bit. Sitting up, she gave herself access to her clit, a bit shy. Some guys didn’t like it when she touched herself, but – </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes,” he urged. “Take the pleasure you deserve, Laura,” he added, kissing the hand that had just touched her clit. She grinned and parted the soft, thick skin of her mons, finding her clit standing at attention and ready for explosion. A few strokes down to her hot cave, where Mike thrust in and out and moaned and clenched, and she had liquid to move and circle, to –</p><p>She ground into him, the feeling so maddening, pounding beautifully into her cervix. And then she just...tipped over. That was it, and the release was there with very little warning, her hitched breath and sudden clamping the only clue poor Mike had. “Oooooohhhh!” she moaned. She hollered and wriggled and thrust back, hot cream and sex bursting as their juices flowed, gushing.</p><p>“The heat! You are so warm, so – ” Fading out, Mike’s voice disappeared but he bucked up, fucking her hard and fast as he drained himself of his orgasm, too, their bodies twitching and pushing against each other to use whatever the laws of physics would give them. Her body made her come repeatedly, her flesh too weak to manage anything but release.</p><p>He pounded and pounded, she slammed back, he stroked her belly, and took one hand to tweak her right nipple, the pain mixing with the thrusting and the explosion to make her scream an animal sound – and then it was just a tired feeling, all cock and slick and mouth.</p> <p>They slowed, little clenches from the remainders of their sex slowing down. The sounds of nature filled her ears, layer by layer – birds. A buzzing. A pinch. She smacked a mosquito off her shoulder and then relaxed. Laura was still full of him as Mike relaxed, trapping her, their wetness and his muscled body all she felt now. She had no thoughts, her body surrendered, everything good, all complete, all chaperoned by the winking sun.</p><p>Neither said a word. Not one. By the time Laura realized they needed to leave, the sun had begun to set. Had they really just relaxed there, naked as the day they were born, for hours – just staring at each other, watching the clouds, feeling the wind whip their sated skin? Time disappeared, and as they reluctantly dressed in the sunset’s glow, she decided not to say anything until he did. Perhaps this was more spiritual than she knew possible, and speaking would end whatever this was.</p><p>Mike packed and carried all their gear in silence the entire walk down to the trailhead’s parking lot, where both their cars sat, expectant and a bit miffed, like parents of children new to the dating scene. Laura laughed at the sight of their abandoned cars, the only ones in the lot, and Mike just looked at her quizzically.</p><p>He remained silent, but stepped forward and kissed her cheek gently. “Third date?” he whispered in her ear. She grinned so widely her cheek hit his.</p><p>“I’ll take that as a yes,” he whispered, then strode to his car, popped the hatchback, carefully placed the backpack and picnic goods, closed the trunk door and climbed in his car, watching Laura carefully.</p> <p>By the time they both pulled out of the parking lot and made their respective turns, Laura’s face was covered with tears.</p><p>Some things were just too personal to share even with her best friend. Laura was going steadily mad and if the itching didn’t stop she was going to scream. Rubbing her butt against her kitchen chair wasn’t working, damn it – why on earth had she ever bought vinyl covered seats? With good old upholstery at least she could have scratched her butt in a way that gave her some friction – and some relief.</p><p>This itching was slowly penetrating her every conscious move, making her one big, non-stop twitch, and she’d only been conscious for an hour. Two cups of coffee hadn’t helped. Finally, Josie, who had finished four cups to Laura’s two, cocked her head and said, “What in the hell are you doing, Laura? You look like a nine-year-old boy who just had an ice cream fest and a few shots of espresso.”</p><p>“I am just not comfortable.” Understatement of the year. Rub rub rub.</p><p>“Did you pick something up from one of the two guys you fucked within twenty-four hours?”</p><p>Ouch. “Oh please, it wasn’t within twenty-four...and you can’t get...oh, I don’t even want to go there. Shut up, Josie.” She reached behind and scratched her ass.</p> <p>“You’re scratching your ass in public. I mean, man – ”</p><p>“We’re not in public – we’re in my apartment.”</p><p>“I am public. I am a human being.”</p><p>“No, you’re not. You’re my best friend.”</p><p>“You...what is going on?” Now Laura couldn’t help herself and start to scratch her breast. Her nipple was throbbing with the hot, torturous itch that plagued her ass as well. “Why on earth are you scratching your boob?”</p><p>“Because it itches.”</p><p>“Come on Laura, that’s not what I meant.” Josie’s exasperation showed in her tone and, finally, Laura couldn’t stand it anymore. She stood up, pulled her pants down, pulled down her underwear halfway and reached for the tube of hydrocortisone cream that she’d shoved in her purse to take to work.</p><p>“Laura, oh, my God.”</p> <p>“What?” Laura twisted around and stared at her own ass. Yup. It wasn’t any better this morning. What had started out as a series of small mosquito bites was now a minefield of red, hot flesh, swollen up into these enormous hive-like bites. When she had returned home from her date with Mike, she’d realized pretty quickly what had happened. While making love outside in nature, in a field, on top of a mountain, with the most incredible view possible – both of nature and of Mike’s body – had been earth shattering, quite literally, the reality of nature had set in.</p><p>In her butt.</p><p>She had about fifty mosquito bites all over her ass down her legs, up her chest, and one had managed to land on her left breast areola. Those zaps? Those zings of pleasure? Not arousal! Nature’s vampires.</p><p>As she smeared the hydrocortisone cream all over the top of her ass, Josie just shook her head and laughed, folding in half as she held her gut, tears streaming down her face.</p><p>Laura tried pointedly to ignore her but couldn’t help it. “It itches.”</p><p>“Oh, Laura, that is awful. On your boob.”</p><p>“Yeah, I know.” She pulled her pants up and went over to the kitchen sink to wash her hands. “How do you think it feels?”</p><p>“Well, I don’t know how it feels. I’ve never fucked somebody on the top of a mountain where a bunch of mosquitoes decided to feast on me.” She snickered. “If a mosquito bites you in the ass is that some way...is that nature’s version of oral sex?”</p><p>“Oh, stop it.”</p><p>“You don’t have any on your, you know – on your hoo-ha?”</p><p>“Hoo-ha? Who calls it a hoo-ha?”</p><p>Josie fanned herself.“You know me. I was raised in Virginia, I’m a good old Southern lady.”</p><p>“Lady? Yeah, right. Like you’re a lady.”</p><p>“Take some Benadryl for that, you’ll thank me.”</p><p>“But Benadryl makes me sleepy.”</p><p>“Really? I mean, because, if you don’t do something more drastic you’re going to go to work and you’re going to look like a hyena who ate twenty-five Mexican jumping beans. You’re a lot better off looking like you’re just a little sleepy or hung over on antihistamines.”</p><p>Laura thought about that one for a minute. It’s not like she had a really busy work day. Could she just call in sick? Oh, no. The monthly management meeting was today. Shouldn’t really have to do anything, but she had to be there.</p><p>“Yeah, you’re right. Maybe if I take some Benadryl, it’ll make it easier to get through the monthly meeting anyhow.”</p><p>Josie nodded. “So, Laura,” she laughed. “Was it worth it?”</p><p>Laura reached down her V-neck into her bra and found the offending bite, scratching it furiously, knowing full well that at this rate, she was going to break the skin but at least that would give her some sweet relief. “Yeah. It was worth it, but next time I’ll wear a bug spray instead of perfume.”</p><p>Mike sat in bed staring up at the ceiling, counting the little holes in the tiles yet again, for what felt like the thousandth time. Actually, it probably was the thousandth time. He’d done it over and over and over ever since Jill died a year and a half ago. Except this time, he was doing it to keep his mind occupied, not to keep his mind distracted.</p><p>He was doing it because it was something habitual, something rote, something that he just could slip into so that he didn’t have to deal with the actually messy emotional aftermath of his date with Laura. It had gone so much better than he ever could have expected. He never intended to sleep with her. And he certainly never intended to make love to her at the top of that mountain on that blanket.</p><p>Yet he had and he was glad.</p><p>The last time he and Jill had made love had been right there. While he wanted to reclaim the space with someone new, he hadn’t planned to do it in quite that manner. Laura moved something inside of him. Her soft curves, her joyful laugh, the way that she focused and her face melted into passion as she came. It all was so overwhelming and too intense.</p><p>Mike needed to talk to someone about Laura. How intoxicating. How calm. How lush. How sweet. How – him. It was as if someone had hand-sculpted the perfect woman for him and forgotten to tell him that this was what he really wanted. No, she wasn’t Jill. And no one ever would be Jill. That was OK, because it had to be OK. He didn’t have a choice.</p><p>Always assuming he would never, ever fall in love again, Mike hadn’t considered the idea that he might find a different love – one that was no more, nor less, than what he and Dylan had with Jill. Could life with Laura be as good? Better? Different? The sex had been astounding, though he could do without the damn mosquito bites. Next time he would take her to his cabin.</p><p>Next time. He didn’t care that he was getting ahead of himself. But then...Dylan probably thought he had a next time, and Laura had shut him out. What was that about? He knew Dylan was tormented by her silence, but he couldn’t exactly ask her about it, now, could he? Not without blowing his cover. Cover? What the hell, Mike? he asked himself. This wasn’t some CIA movie or FBI plot. He wasn’t the center of a sting operation or an undercover drug bust.</p><p>He was, however, being deceitful, and that felt very, very wrong. Laura had no idea that he and Dylan were a – what? What were they, exactly? Explaining their relationship hadn’t been an issue with Jill. They just fell into their life as a threesome, as uncomplicated and easily as any other twosome. He and Dylan weren’t gay. Not quite. But they weren’t straight, either. They had tried, before Jill, to each date separate women but that first encounter, back in high school, where they both lost their virginity to the same girl had cemented their needs. What they wanted was the power of three, and it made them both complete.</p><p>Dating one woman, sleeping with one woman, was pleasurable. Hell, Laura had certainly proven that! Already, though, he felt a longing for more. He imagined Dylan did, too. The complication now, though, was that Laura was spurning Dylan and deepening her relationship with Mike.</p><p>In the short term this was fine, but in the long run...what could he do? How could he mend the relationship between Dylan and Laura to make the triad complete? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Worse, though, was a niggling fear in the back of his mind. His heart. What if she preferred Dylan over him?</p><p>Opening up to Laura would be a whole other mess. “Hi, Laura. My partner, Dylan, found you on that dating website and figured you might be open to a long-term threesome. And, by the way, we’re billionaires. So...can we keep dating?” The deception was already over the top, strung out too long. A week, though, really – how could a week create such joy and do so much damage? How could their lives change so abruptly, so deeply, in such a short period of time?</p><p>There was no choice here. Whatever Laura decided was final. He couldn’t read her – just knew she liked him. A lot. Had she liked Dylan this much, too? If not, why? What had driven her away from him and into Mike’s arms?</p><p>The only way out was through. Through his heart, and hers. And Dylan’s. He would have to come clean to him, and soon, before this spiraled out of control.</p> <p>It wasn’t fear that made him keep his mouth shut. It was exhilaration. Excitement. The secret of mine. Mine. Laura was his, for now. Only his. While he knew that wouldn’t sustain him in the long run, just as Dylan’s dating her, alone, wouldn’t do it for him, either, there was a heady confidence that came from scooping Dylan. He could never have imagined, never dreamed that Laura would spurn Dylan and turn to Mike, but here they were. This was how it had turned out, and now the only concern he had was that Laura would hate him once she knew that they knew each other.</p><p>Wait, Mike, he told himself. Savor this. After eighteen months of loneliness and pain, it was good to wake up in the morning with a smile on his face.</p><p>Even better, though, would be to wake up to two other smiles in his bed. God, the thought made him hard. Rock hard.</p><p>And so he found himself counting – 879, 880, 881, 882 – counting, counting, counting. And then he looked down and saw the tent on the top sheet. Ah, shit. There’s only one way to deal with this. A run.</p><p>He left the bedroom and nearly slammed into Dylan, who was coming out of the shower. “Hey, hey man, how was that date last night?”</p> <p>Mike felt his expression shift to complete shock and he tried to cover up his feelings.”Oh, oh yeah, uh, yeah it was good.”</p><p>“Great,” Dylan clapped him on the back, staring down at Mike’s erection. “Yeah, thinking about her?”</p><p>“Thinking about a lot of things,” Mike answered, still stammering on the inside. Fuck – what if Dylan guessed what was going on before Mike could confess it? This was just too much. He spent most of his life trying to craft as simple a life as possible, and now he’d created a huge romantic clusterfuck. Way to go!</p><p>Dylan said, “Yeah, I have been too. But, well, anyhow...” He shook his head as if willing away something that was bothering him.</p><p>Mike knew he should ask, Mike knew that he should inquire, that this was Dylan’s way of reaching out, of being emotionally open, and yet he couldn’t. He just couldn’t muster the energy to deal with anyone else’s emotional struggles right now. Hell, he couldn’t even deal with his own. “Yeah, well, I’m gonna go for a run. I’ll see ya.”</p><p>“Alright, bye.”</p> <p>They were just so articulate when it came to expressing their feelings. He could hear Jill’s words echoing in his head: “You two are about as good at talking about your feelings as I am at shaving my own balls.”</p><p>If he could get his feet pounding on the pavement, pounding on the trail, running in the dirt, the trees flying by, the buses groaning – whatever, wherever, whenever. Air in, air out, muscles up, muscles down. If he could reach that place within where everything disappeared and nothing was all – Mike knew he could figure out how on earth he was gonna tell Dylan that he had just stolen his girlfriend.</p><p>Dylan threw on a pair of shorts and some t-shirt from – he looked at the front – middle school? Yeah, middle school. He still had it. In fact, he never let go of any of his t-shirts; he probably had hundreds of them in various states floating around his apartment, everything from the Monsters of Rock t-shirt that he got when he was a kid from his older brother, down to the latest cheesy Daily Show shirt.</p><p>He opened up his laptop and he tried one more time. Clicking on Laura’s profile, he typed in the chat window, “Hey, Laura, are you there?” She had completely shut him out. He knew it had been a day, one day, that was it. Just a single day since she left his bed. But she didn’t answer his texts, didn’t answer his phone calls, didn’t respond to his chat window – nothing – and she had slunk out of his house in the middle of the night.</p><p>Now he was certainly used to one night stands and having women sneak out – or being the one who sneaks out on a woman – but he had felt such a connection with her that this mystified him. And now, the great silence. What was that about? Why was she doing this?</p><p>He knew how to find her address. He knew where she worked. He even knew the floor; she had told him. But he didn’t want to be a stalker. He didn’t want to be that guy.</p><p>And he wasn’t that guy. It wasn’t his style; he never did that kind of thing to a woman. This one, though? Oh, he could actually feel himself drooling, imaging her body, conjuring her touch, the way she shifted her hips, the way that she leaned against him, the way that her hair hung in his face, the way that her lips seemed to –</p><p>Oh, man.</p> <p>He and Mike were a matching pair of tented shorts now.</p><p>What in the hell was up with Mike? He was acting awfully squirrelly. Not that that was anything new, but Dylan was going to all this trouble to find them another person. Not that anybody could replace Jill, but he wanted that closeness, he wanted that sense of family that only three could give him and Mike. And now, now he felt unmoored. Lost.</p><p>So he typed again. “Well, Laura, if you’re there, please, I’m trying to reach you. Give me a call, text me, something. I just wanted to talk. I really enjoyed the other night and let’s touch base”. And with that, he shut down, he logged out, set aside his computer and went to join Mike on that run.</p><p>As he started to put on his running shoes he remembered, Oh shit, I forgot to email my mom. His mom’s seventieth birthday party was coming up and he needed to give his dad some answer about some detail. His computer was already off. Oh, wait a minute, maybe I could just use Mike’s, he thought.</p><p>So he went into Mike’s room and yes, the laptop was open. This would be easy. He clicked on the browser and up popped the same online dating website where he met Laura. That’s funny, he thought, maybe that’s how Mike found his date last night. You would think he would have told me.</p><p>Blink, blink. Dylan wasn’t sure what he was looking at, but a dull, creeping dread began to fill his veins. As he stared at the computer screen and read the chat windows, the account information, the all-too-familiar picture, and scanned over every detail on the screen, it slowly dawned on him that Mike was logged into his account and having a lovely conversation about his most recent date.</p><p>With Laura.</p><p>To be continued in Her Two Billionaires – the story of how Laura, Dylan and Mike become one.</p><p>A sample:</p><p>Bang bang bang. Fireworks exploded above her, the dazzling pastels blooming before her eyes in a furious cascade of sparks. As the hot coals showered down like burning rain, Laura jumped when one touched</p><p>her.</p><p>Bang bang bang! they exploded, the little pieces hitting her face, her legs, suddenly soft and caressing her like –</p><p>“Laura!” Bang bang bang. “If I hadn’t lost your key I would come in!”</p><p>Josie. Wha? Laura opened her eyes and fumbled for her phone. 7:22 a.m. She sat upright in horror.</p><p>“Hang on!” she shouted, stumbling to the door, unchaining and unlocking it. Josie stood there, petite and jaunty, peering around Laura.</p><p>“So is he still here?” she asked breathlessly. “Is that why you didn’t answer?”</p><p>“Is who still here?” Laura yawned and stood on tiptoe, her muscles desperate for oxygen, blood rushing into her extremities and nearly giving her a calf cramp as she slowly went down to flat feet, rolling her shoulders and stretching her neck.</p><p>“Whatever hot, eligible bachelor contacted you last night, because you are on a roll, Baby! One a day, right?” She punched Laura lightly in the shoulder and stormed past her, banging and shuffling things as Laura stared at the back of her front door.</p><p>For the briefest of seconds she ran a frantic mental check – had she gone out last night? – and then cursed herself. This was getting out of hand. No, last night she had stayed home and finished up some quarterly reports, watched a few episodes of Mad Men, and gone to bed early. Apparently, she’d needed the sleep. And, apparently, she had forgotten to set her alarm. Now she would be late for work, though she knew her boss wouldn’t mind. Last night she had clocked an extra three hours; flex time and a salaried position made it easier to go in a bit late this morning.</p><p>Josie didn’t have that luxury. As a geriatric nurse, she needed to be on shift on time, every time. At least she only worked three shifts a week, though. Soon her rotation would take her to midnight shifts, which Josie hated. So did Laura; it was hard to get together when her best friend kept a schedule better suited for vampires.</p><p>“I took a break from my busy fuckbuddy schedule,” Laura yawned, stretching again. Her belly felt cold as her shirt hiked up, and when she looked down her braless breasts hung lower, and off to the sides, like small,</p><p>smooth animals with the metabolism of a sloth. Josie had a chest like a boy’s, if a boy had tight little breasts you could fit in a headphone cover. Mostly, they envied each others’ figures, though Laura could never understand why Josie would want these boobs. At this rate, she’d need a wheelbarrow by the age of fifty. Or to marry a</p><p>good plastic surgeon.</p><p>A quick thought of Mike, then a more surprising flash of Dylan, hit her. She couldn’t get over Dylan – didn’t want to, really. Mike had called her last night. Asked her out again. This time to his cabin up on the mountain. Maybe they could make love without a million uninvited, biting guests. That would be a step up, Laura thought, as she absent-mindedly scratched her ass over her flannel pajamas. She needed some Arnica for the bites and kept forgetting to buy some.</p><p>“Quit scratching yourself and come have some coffee!” Josie called.</p><p>How did she knew she was scratching? The woman was part psychic. Or heard the scrit scrit scrit of fabric as she scratched. Or watched her reflection in the hallway mirror. Ah – that was it. She looked and</p><p>saw Josie’s cheesy, overstretched grin as she held up a mug and took a sip.</p><p>“Ahhhhh. Coffee tastes so much better at your house, Laura.”</p><p>“That’s because it’s free.”</p><p>Josie sputtered and laughed. “OK, you got me there.”</p><p>Laura poured a cup of coffee and sat at her little kitchen table, taking deep breaths. “What am I going to do, Josie? Mike asked me out on a date tonight.”</p><p>“What did you say?”</p><p>“Yes, of course. I really like him.” She took a sip. “More than I want to.”</p><p>“What does that mean?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Laura said nothing, then started to explain, but thought the better of it. “Nevermind.”</p><p>“You are stuck on Dylan, aren’t you?” Josie’s tone was incredulous. “Did you ever figure out who that woman was?”</p><p>“Nope.”</p><p>“And has he tried to reach you?”</p> <p>Laura blew air out her nose, laughing softly. “I have 34 messages from him on the dating site.”</p><p>“Oh, he’s playing it cool, isn’t he?” Josie frowned. “But I thought you blocked him?</p><p>“He created a new account.” Josie made a low whistling sound of disbelief.</p><p>Laura smiled wistfully. “Yeah. I just can’t go there, Josie. You know how much it hurt when I found out about Ryan...” She had dated Ryan for the better part of a year. They’d shopped for engagement rings. He’d introduced her to his boss, went on double dates, and then one day she got an anonymous message on Facebook. A request to friend.</p><p>Someone with Ryan’s last name.</p> <p>His wife.</p><p>Funny how he forgot that detail.</p><p>She had a pretty simple morality: don’t date people who file taxes with other people as a married couple. Her rule was pretty simple. Too hard for Ryan, though.</p><p>And now she applied the same rule to Dylan: no dating people who were involved with other people.</p><p>“If I’m going to be part of a threesome, Josie, it won’t be as the invisible third.”</p><p>“Mmmmm, a man sandwich with Laura in the middle. And those two men...” Josie licked her lips with great exaggeration.</p> <p>Laura’s hands reached out to shove Josie before she could think to stop herself. “Cut it out!” Her face burned, though, with the thought. Josie just cackled.</p><p>A threesome. Menage. She’d never done it. But she sure had thought about it. As her breath hitched with embarrassment and arousal she shifted in her seat, now painfully aware of the increased heat in her nether regions.</p><p>Regions that had seen more activity – and from more men – in two days than in two months.</p><p>“Laura and Mike and Dylan, sitting in a tree – o!” Josie joked, skittering away so Laura couldn’t punch her again. Shaking her head, Laura buried her face in her coffee to hide her expression from her friend, who was about a hair away from figuring out that Laura would welcome the menage.</p><p>More than she could even acknowledge to herself, much less admit to her friend. There were lines in friendship. This was one of them. She couldn’t take back the words if she blurted them out, and right now she was just too confused and tired to deal with the fallout of admitting what her heart really desired.</p><p>Besides, there was that pesky issue of Dylan’s girlfriend. Funny how that put a screeching halt to any sandwich fantasies.</p><p>At least she had Mike.</p><p>“You still have Mike, though,” Josie mused. “Poor Laura. Have to settle for a guy who looks like something out of Asgard. Does he have a tongue like a god, too?”</p> <p>Laura threw the empty half-n-half container at Josie, who just chuckled as she stood and walked out the door, leaving Laura to get ready for a torturous day at work, the hours before seeing Mike stretching out like years.</p><p>As she dressed, though, she remembered her drive home from their last date. For some reason she still didn’t understand, she’d started crying as soon as they’d gotten in their cars. At first, she’d almost jumped out of the seat and run after him, just needing something – more. More words? No. More sex? Ah – no.</p><p>Just more.</p><p>By the time she’d arrived home she had been fine, so whatever triggered the tears seemed to have settled and found its place inside her. Could sex with someone she’d only met a couple of days ago unleash emotions that strong?</p><p>Was it deeper than that? Her earring got stuck as she tried to shove the post through the ancient hole, the back of the earlobe grown over. A few layers of skin closed up the back of the lobe and she worked to center the end of the post over the spot where the lump of scar tissue was thickest. Gritting her teeth, she forced the metal rod through, the hot sting of newly-pierced tissue evolving into a throb.</p><p>Her favorite pearl earring dangled nicely. Was it worth the pain?</p><p>Sure. For the sake of wearing something that complemented her perfectly.</p><p>Maybe Mike’s the same, she thought. You had to date a lot of painful jerks before you found the one who complemented you perfectly.</p><p>Hot tears filled her mouth and eyes.</p><p>Aha. Now she understood.</p><p>And yet Dylan – she closed her eyes and full drops poured out of her inner tear ducts and down her nostrils. An ache in her throat spread to her chest. Ignoring his messages had been agony. Sheer, unadulterated pain in the form of restraint.</p><p>She had held fast, though she had faltered only once. The (gorgeous, incredible, irresistible) idiot had gone and created a completely new online dating account to circumvent her blocking him! How stalkerish and weird and creepy and –</p><p>Flattering.</p><p>Charming.</p><p>Arousing.</p><p>She had almost – almost, achingly almost nearly so close – broken down and agreed to meet him for coffee, just to hear his side of the story – which she already knew. It was a cliché upon a cliché, right?</p><p>Holding fast, though, she had simply typed:</p><p>Please leave me alone.</p><p>And, like magic, he had.</p><p>The ache that his respect for her wishes created in her was so contradictory yet so pervasive it made her question her own sanity. Why was she so drawn to this guy? What was so special that she would override her own moral code for him?</p><p>Ah, but you didn’t, her conscience reminded her.</p><p>Oh, how I want to, she retorted.</p><p>Dylan stared at the computer monitor, completely unsure and yet painfully, deeply certain of what he was reading. Mike and Laura? Mike was hitting on Laura at the online dating site? What? He scrolled through the history of the chat window and realized that – that the first chat took place the morning after his date with her.</p><p>Oof. His stomach twisted and his balls felt like lead. Stretching his neck and clearing his throat, he fought back a tearful rage. Ease up, Buddy. Last time you let your temper flare you had a $400 door to replace.</p><p>Now, he’d been a bit confused when he woke up that morning and she had been gone. But he’d had plenty of encounters where that happened – yet he’d expected her to answer one of his phone calls or his texts. She had plenty of opportunities.</p><p>While he wasn’t quite ready to stomp over to her house and hold a boom box over his head, with Peter Gabriel’s In Your Eyes blasting from it, he was definitely in that uncomfortable zone where he expected to have a second date with her, anticipated it – really, frankly was excited by the prospect of it and had been stymied by her refusal to talk to him.</p><p>Mike had sniped her? This wasn’t a rare baseball card on eBay, for fuck’s sake.</p><p>Even though it had been less than twenty-four hours since he last saw her, and he knew he shouldn’t be so eager, it stung. He had an inkling about why she was blowing him off now – some inkling. A 6‘5” inkling.</p><p>And according to the times on the chat window, it looked like within a few hours of leaving his bed, she was planning a date with—Mike?</p><p>Mike? Mild mannered, boring old Mike?</p><p>This didn’t make any sense! Dylan was the one who went out and found someone for them. Dylan had found Jill, who had been their one and only.</p><p>Jill.</p><p>He sighed, his shoulders slumping, and he leaned cradling his face in his hands, a wash of nostalgia, of mourning, of pain came over him. And this time he let it. Normally, he pushed it away, manned up and did what a lot of guys do – went for a run, watched the football game, ate too many wings, pumped iron. But right now he let his feelings sink in. Watching her die had been one of the most – no, the most difficult thing – Dylan had ever experienced. The helplessness had nearly killed him, too. Mike had just retreated into his own world. Running tens of miles, half marathons, day in and day out until his shoes wore out within weeks, until his feet blistered, until he put his body into a state of pain that let some of the agony in his heart leak out.</p><p>Dylan wasn’t like that. Dylan had fought and fought, and fought some more. Had argued with the doctors, had argued with Jill. Bargained with God and anyone who could help. Tried to convince her to try all sorts of alternative therapies that he had read about on the Internet, from vitamin C to certain yoga positions to chelation – and while the doctors said none of it could hurt, none of it helped.</p><p>Jill had gently accepted her own fate after a valiant struggle; Dylan had never accepted it. Ever. And now here he was, a year and a half after her death finding someone like Laura, hoping that maybe she could help to repair some of the scars that were still fresh from Jill’s death.</p><p>And then Mike goes and turns into a snake.</p><p>Why would he do this? This wasn’t Mike’s style at all. He wasn’t the type to poach a girl. Mike was the beta. They joked about it. Dylan was the alpha and Mike was the beta and that was just the law of nature and how things worked between the two of them – between the three of them, with Jill. Jill had liked Mike’s sensitive touchy-feelly, new-agey nature and she’d loved Dylan’s arrogance.</p><p>Oh, that had hurt. She had called him arrogant all the time, as if his self-confidence didn’t have a bedrock foundation for his firm grounding. Here he was a fire-fighter, a paramedic – built, a former model and he was arrogant? He could wave it away most of the time, but now he just chuckled to himself, thinking about the times she had put him in his place. Frankly, he had needed that, needed her steady, sardonic wit, her –</p><p>“Oh, stop it Dylan. She’s gone. Just stop it.” He looked up stared at the monitor again, and the nostalgia came to a screeching halt.</p><p>He narrowed his eyes.</p><p>It was time for the alpha to put the beta in his place.</p><p>Whistling some Lady Gaga tune that he’d caught in the car in the long drive home from the mountain, Mike was feeling pretty pleased with himself. He had just proven that he, on his own, could catch the same woman Dylan could catch.</p><p>And boy, what a catch Laura was. Way more than he ever expected. She was absolutely, positively nothing like Jill. And yet, he had a feeling that if the two had met, Jill would have really liked her – and probably would have given her approval. Laura accepted the fact that he was quiet sometimes and he was able to sit in absolute silence with her, out in a field, staring at the mountain. The two of them could just coexist in peace together. You couldn’t find that in many people. Very few, in fact.</p><p>Jill had been one of them. Dylan definitely wasn’t, but he had other traits that made him worth being with, hard as it may be these days to remember them. And so, as he pulled into his parking spot his mind was filled with nothing but plans to see Laura again. A niggling irritant scratched deep within his brain, though, ruining the absolute perfection of this new beginning.</p><p>Dylan.</p><p>He had to tell Dylan at some point and it wasn’t going to go well. He and Dylan had been together since high school and he knew him backwards, forwards and upside-down. Even though Mike’s intentions were pure, Dylan would view this as a threat, as a challenge, as some sort of – as Dylan put it – alpha-beta problem. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mike just rolled his eyes and ignored the alpha-beta crap, because he knew that on the surface he looked like a beta. They weren’t wolves, though, and this wasn’t a pack; they were human beings who were complex and nuanced. He could show Dylan, and himself, that he was capable of going out on his own and finding a woman.</p><p>Well, OK, that wasn’t quite accurate. Dylan had found the woman. Fair enough – but he could go out on his own and test the waters. Make sure the woman was attracted to him on her own and not as part of some package with Dylan at the lead.</p><p>And he had just done that today. Quite pleased with himself, that sense of pleasure faded, like a light switch being flipped off, the second he walked in the apartment and saw Dylan’s face.</p><p>“You slept with her, didn’t you?” Dylan wasn’t just pissed. Betrayal was too mild a word to describe his feelings. Dylan was itching for a fight, his fingers clinching against his hot palms.</p> <p>Mike walked through the door, a cheerful smile on his face, a loose, languid quality to his joints that made Dylan want to throw him against the wall and beat the ever-loving shit out of him for taking his woman.</p><p>Their woman.</p><p>Funny, how history seemed to repeat itself. This was exactly what had happened with Jill almost ten years ago when they’d all first met. Mike would deny it, but the reality was that Jill had been Dylan’s girlfriend and Mike had been the interloper then. So, even though Dylan knew that they had this running joke, that he was the alpha and Mike was the beta, Mike was neither – he was really just a snake.</p><p>A snake Dylan couldn’t live without.</p><p>“You son of a bitch, you went and – you found Laura and you – the morning after my date with her, you contacted her and got her to go out with you!” He couldn’t help but stammer, and the sputtering made him feel small and insignificant, reduced to babbling like a lovesick teen. Fury plumed in him, hot and fast, with a taste like blood.</p> <p>Mike stopped dead in his tracks and shoved his hands in his pockets, staring dead ahead at Dylan, eyes boring into his.</p><p>“Yep.”</p><p>That enraged Dylan more than anything, because he knew at this point Mike would only give one-word answers. Like a robot, the man shut down and steeled himself, becoming an impenetrable fortress of quotidian bullshit. “You knew how important this date was, you knew that I was checking her out for us, not just for me, you jerk!” Dylan seethed now, his anger fueled by Mike’s withdrawal. “Why in the hell would you go behind my back and contact her? And a few hours after I slept with her!”</p><p>“I didn’t know you slept with her!”</p><p>Dylan cocked his head, rolled his eyes, and made an Oh please! gesture. “Right, like any woman I wanna sleep with isn’t going to sleep with me on the first date!”</p><p>Mike let out a puff of laughter. “Do you know how much you sound like a total douche? Like any woman I wanna sleep with is gonna to turn me down,” he mocked, his hands gesturing like Dylan’s, chest puffed up and prancing around like a peacock. Animated, mocking Mike was way worse than Robot Mike.</p> <p>Dylan could feel his heart rate zoom, and, he feared, his skin turn green as he morphed into something so angry he couldn’t control it, a firefighter, billionaire Hulk.</p><p>And it was all aimed right at Mike.</p><p>Her Two Billionaires will be published in December 2012.</p><p>Her First Billionaire – a sample...</p><p>Read how it all starts, with Laura, Dylan – and Mike’s entrance at the end – as the two men find their way to bringing Laura into a most unique, and decidedly hot, forever threesome. Here’s a sample from Laura and Dylan’s story:</p><p>“Hot, luscious piece of ass who can suck a golf ball through forty feet of garden hose seeks rippling-ab’d firefighter who has a tongue that thrums like a hummingbird and enjoys painting my toenails and eating Ben &amp; Jerry’s out of the carton while watching Mad Men.”</p><p>Laura Michaels stared at the online dating site’s registration screen and frowned. That’s what she really wanted to write. Here was the truth:</p><p>“Needy, insecure, overweight twenty-six year old Business Analyst with three cats, a corporate job with pension and no debt seeks Mr. Impossible for way more than friendship and lots of ice cream. I’m desperate for some physical affection and oral sex with a guy who doesn’t view it as some sort of favor he’s granting me, and then expects to be praised like he cleaned my toilet. One night stands are better than nothing as long as you brush your teeth. Call me!”</p> <p>Her best friend, Josie Mendham, punched her in the bicep. “You can’t say either of those!” Josie was Laura’s opposite. Where Laura was 5‘6”, Josie was barely tall enough to ride roller coasters. Remove the 1 from Laura’s size and you still had to go down to 2 to get Josie’s. Where Laura had long, curly blonde hair and bright green eyes, Josie was chocolate all around. “Mutt and Jeff” her mom had called them, and they’d been besties since eighth grade.</p><p>Which meant Josie knew Laura too well. “You are going to do this, damn it,” she said, wagging a finger in front of Laura’s face. “No trying to be perfect. Perfect is the enemy of good enough.”</p><p>“I haven’t even found Mr. Good Enough!”</p><p>“That’s because the hundreds of Mr. Good Enoughs have walked past you, Laura, and you’re blind to them.” Josie nudged Laura aside and started typing, her long nails burning up the keyboard. How did she do that? Typing on the pads of her fingers seemed impossible, but Josie did it, keeping her manicure intact, little replicas of the famous grey necktie from Fifty Shades of Grey on each nail.</p><p>The two had been out at a club the night before and Josie spent the night, waking up chipper and springing this online dating thing on Laura before she’d even had her first cup of coffee. As the machine gurgled and burbled, Laura willed it to hurry. Weighing out her entire dating future in a half-zombie state was not good.</p><p>Laura knew she had to lie, but how much was acceptable? Could she shave off a few sizes, or would she need to hack off an imaginary arm and leg to make herself seem “fit” and “athletic”? The drop-down box with its built in descriptors seemed like judgmental torment. No choices were there for “zaftig” or “juicy” or “full figure.”</p><p>Being a size 18 with size F breasts wasn’t a crime, she knew; in real life she was fashionable and flowing, plump and pleasing, and could arm wrestle most guys into submission, but reducing her accomplishments, personality and, yes, body into a vocabulary designed by some Internet start-up team of nineteen-year-old dropouts from Stanford and Carnegie Mellon made her irrationally angry.</p><p>No – rationally angry.</p><p>Seeing little choice, she pointed to the boxes on the screen and told Josie, “Pick the word ‘fit.’ I can deadlift 105 pounds. Which is,” she eyed Josie, “more than you weigh.”</p><p>Josie pointedly ignored her, biting her lower lip and deep in concentration. “Voila!” she shouted, her hands spread wide in a grandiose gesture. “There’s your ad.”</p><p>She announced:</p><p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I’m a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p><p>“I can’t write that!” Laura groaned. “It makes me look like I want an orgy!” She squinted at the screen. “And what the hell is ‘YOLO’?”</p><p>“Who doesn’t want an orgy?” Josie wiggled her eyebrows lasciviously and stuck out her tongue, waggling it like she was performing a very bad imitation of oral sex. “And YOLO stands for ‘you only live once.’”</p><p>“Cut it out. You’re turning me on. It’s been that long since I got some ass, and the last guy used his tongue like he was a Roto Rooter man. Like that.” She pointed at Josie’s tongue and bent over, laughing.</p><p>And then Josie, with a flourish, pressed the “Submit” button. “Thank you for joining – your profile is now live!” the screen read.</p><p>“Oh, shit, Josie, did you just do that?” Laura sputtered, spilling creamy coffee all over her sleeve as she grabbed the mouse. “Fuck!”</p><p>“What?” Josie batted her eyelashes. “Live a little. See who replies!” She grabbed her heavy, over-full Vera Bradley purse that they had discovered at a local thrift shop for $3.99 and fingered her car keys. “Gotta go, Laura. And don’t you dare delete that.”</p><p>Laura laughed. “You know me too well.”</p><p>“No shit,” Josie muttered. Her face turned serious. “Really, Laura. You need to get out there. Some guy is being deprived of your awesomeness. And besides, your budget needs the break.”</p><p>“My budget?”</p><p>“Yeah. What are you spending in batteries for Bob?”</p><p>Confused, Laura shook her head. It was like Josie spoke a foreign language sometimes. “Huh?”</p><p>“Your battery-operated boyfriend. You know – BOB.” And with that she snickered, running for the door as Laura threw a section of a fashion magazine at her. Josie’s evil laughter filled the apartment as she ran down the hallway, the sound fading once she hit the stairwell. “Have a good day at work!” she hollered from the street.</p><p>The coffee machine gave its death-rattle gasp that signaled the pot was done, and Laura went to drink it greedily, needing sustenance to kick her brain into gear. Enough caffeine and she could date anyone. Hmm, maybe she should do a search for baristas on that site. Free lattes would be a nice perk.</p><p>Dylan Stanwyck couldn’t quite believe what he saw when he logged into the online dating site. Four months of weeding through so many crappy profiles had jaded him. Finding the right woman would be like coming across the proverbial needle in a haystack, but in this case he didn’t want to face any pricks.</p><p>And yes, women could be pricks. So far he had been inundated with requests to chat, and he knew exactly why. Being a firefighter who competed in weightlifting competitions for fun, along with the occasional mini triathlon, made his pictures look quite nice. The problem with the women who were responding to him was that they were also the type to be drawn to appearances only. It seemed so shallow of him to think it, but sometimes being built the way he was could be a curse.</p><p>Curse of the Jersey Shore chicks. Because that was the type who seemed to seek him out, like moths to a flame. A trashy, Snooki-like flame of ho-dom. When he would meet up with these women he found himself in some alternate universe, where they licked their lips and offered themselves up in the alley behind the nice tapas restaurant where he liked to take women. A few goat cheese stuffed dates and pitchers of sangria later and he was being humped up against a slimy brick wall next to the trash cans.</p><p>And when he turned them down...he still had scars from one woman’s long, overdone nails raking his neck as she screeched, “You don’t know me!” over and over, requiring police assistance as passersby gawked, took pictures they probably uploaded to Reddit, and mercifully called 911 on his behalf. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So when this new profile for Laura appeared, he peered at the description and leaned back in his chair, taking a deep breath. Cute. But not too cute. A little sassy. He liked sassy. He ran a hand through his thick, wavy hair. Time to get a haircut, dude. You look like a survivalist. And smell like one, too, he thought as he studied her picture and caught a whiff of himself. His morning run was done, 3.8 miles logged on his online fitness program, and he reeked.</p><p>She looked like a 1940s pin up girl. A little plumper, with soft curves to her shoulders, a fuzzy, lime-green sweater accentuating her breasts. Her jaw line seemed firm and gentle all at once, and what appeared to be naturally-blonde hair was swept up off her face in a pony tail. His mom would call her a “corn-fed farm girl” and those lips – lush and grinning a half smile that seemed to say “Kiss me, Dylan.”</p><p>Smart, too. A business analyst? Sounded suitably bland and yet signaled she was smart enough to carry her own in a conversation about something other than Kim Kardashian or Fifty Shades of Grey (really – why? Why had every date for the past two months mentioned it?). A real woman. What a refreshing change.</p><p>So he continued reading:</p> <p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I’m a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p><p>Something fierce and hot inside him came to life. From that description it sounded like she...seriously? No way.</p><p>“Mike! Hey, Mike! Get in here!” If there were a chance – any chance at all, here, then he had to act fast. Someone this amazing was about to get inundated by messages from needy weirdos.</p><p>And he needed to be the first.</p><p>His roommate wandered in. Where Dylan was all muscle and brawn, Mike Pine was tall and sleek, a marathoner’s body of long, lean tissue. Dylan’s dark, Italian, thick looks made him popular with women, but Mike was the golden boy, with blonde hair and blue eyes, the long distance runner with a soft heart, the guy women turned to and poured their hearts out, Mr. Sensitive to Dylan’s Mr. Conquest.</p> <p>Dylan tapped the screen. “Take a look at her.” He smiled smugly as Mike’s eyes raced across the screen. They’d been waiting for a long time. Too long. His roommate’s expression told him everything he needed to know. Score! It might finally be time.</p><p>“Do you really think that’s some sort of code for being up for a threesome?” Mike asked, eyebrows arched. “I don’t know, Dyl...I think it’s just some sort of joke she’s making. You know how nervous and weird people can be when they try to distill their entire life into a few sentences.”</p><p>Dylan chewed on the inside of his cheek. Bad habit. “Good point. Well, even if she isn’t into a nice menage arrangement, she is one fine woman.” A low whistle escaped from his lips. “I have a project on my hands now, don’t I?”</p><p>Mike nodded, peering at the screen, eyes lingering. “You are going to have a lot of competition.”</p><p>Dylan snorted. “Like I give a fuck. May the best man win.”</p><p>Mike went silent, then grinned, his fresh-faced boy-next-door look morphing into a Wall Street trader’s predatory smile that made Dylan suddenly uncomfortable for no reason he could pinpoint. “Yeah. I hope he does.”</p> <p>Ding! The little chat box on the online dating site lit up like a Christmas tree. Laura sucked the last mouthful of her coffee and gaped at the screen. You have got to be kidding me, Laura thought. Already? She clicked and read a message from “9inluvr”:</p><p>Hey, babe. I live in the city and so do you, so let’s hook up for some FWB action.</p><p>She snorted. Oh, sure. Just like that. Yer a catch, Bud. A real romantic.</p><p>Ding! This one was from some guy named Dylan. Before she read the chat she looked at his profile.</p><p>Well hellooooo there, Mr. Firefighter. A thin line of drool formed at the corner of her mouth, an instant response to the picture before her. It was a professional picture, the guy wearing no shirt, a fireman’s hat perched at a jaunty tilt. Like a stripper’s picture in a firefighter’s role. Oh, God. I can’t date a stripper, she thought. He’d have nicer g-strings than mine.</p><p>But no – he was a real firefighter. The picture, he explained in his profile, came from a charity bachelor auction he was in. Bachelor auction? How much had he gone for? As she studied the picture she figured it had to be a solid four figures. Hell, she was ready to empty her life savings for a night with this guy.</p><p>On a whim she Googled “Dylan charity bachelor auction firefighter” and her drool increased so much she would soon need a bucket.</p><p>Oh, holy hell. The image search showed the same man, whose name was Dylan Stanwyck, in firefighter’s pants, boots, a fireman’s hat and suspenders, perched on the floor of a fire station right next to the pole. He was leaning on one elbow and had smears of soot on him, with well-oiled muscles and a smug-ass grin. Whoever set up that photograph needed to be recruited for her company’s marketing department because damn – she was ready to use up every available dollar on her credit cards to get a night with him.</p> <p>Maybe she could save a bunch of money and just set herself on fire. Or her car. It probably wasn’t worth much, but if she found out his schedule and whether he’d be the one responding...</p><p>And he was pinging her on the dating site? She dropped her coffee and scrambled to write back in the chat room.</p><p>“Hi,” she said, all inspiration and creativity vanishing as the heat forming between her legs apparently melted her brain.</p><p>Hi. I’m Dylan. Nice to “meet” you. :)</p><p>Think, Laura. Think. Man, where was Josie? Of all the times for that girl to be on time to go to work. She needed help figuring out something witty to say.</p><p>Hi. I’m Laura. Nice to “meet” you, too!</p><p>She wrote back. Then he answered:</p><p>You’re probably on your way to work analyzing businesses, or businessing analysis, or whatever it is you do ;). I was hoping you might be interested in going out? We can do coffee, maybe? Or go to a nice tapas bar?</p><p>Tapas! Her favorite! But wait – Josie always said any guy who likes tapas must be gay. Laura checked the photo again. No way. And even if Dylan was gay, she would still sleep with him. Cute, polite, and loves tapas?</p><p>Tapas sounds great! When?</p><p>Dammit! Now she sounded too eager. And then he waited. And waited. No reply. Shit! Maybe he was having second thoughts. Or she sounded like a moron. Or he realized he didn’t like tapas after all. Or he really was gay. Or this was his cat impersonating him. She began to pace, willing the chat bar to ping. If she stared hard enough, maybe it would come – now! No, now! Or...now!</p><p>Finally:</p><p>Uh, this might seem too eager, but I don’t care. I am free tonight. I work a 24 tomorrow, so this is my last chance for a few days. I don’t mean to be rude, asking you on short notice, but...please tell me you’re free tonight.</p><p>Yes! Yes, yes, yes, she wanted to write. But she needed to play that stupid game, the dance of meeting someone new. Her turn to wait. She reread his message. What was a 24? She puzzled over that one as she chewed on her nailbed, pulling on it until it bled. Brilliant! Screw up your manicure when you have a hot date tonight, Laura.</p><p>Might have. Might have. Don’t put the cart before the horse.</p><p>I am free. Prince William is now taken and so I have an opening in my busy social schedule.</p><p>She hit “Send” before she could change her mind. Too cheesy?</p><p>LOL. Sounds great. Meet me at Tempo Bistro after work. At 6?</p><p>Tempo Bistro? The most expensive, chi-chi restaurant in town? Not tapas, either – something she couldn’t quite remember. Asian fusion? How on earth could a firefighter afford that? Not your problem, Laura. And she was making terrible assumptions. She needed to assume they were going dutch. Good thing she was a careful saver.</p><p>‘lo?</p><p>The chat window pinged. Geez, Laura. Get out of your head. She typed furiously:</p><p>Sounds even better. I’ll see you there and you know what I look like.</p><p>And he replied,</p><p>Oh, yes. :P</p><p>What was that supposed to mean? Her eyes swept over the clock – now she had eight minutes to shower. Damn! Laura just shook her head and walked to the bathroom, stripping naked by the time she crossed the threshold and turned on the hot water.</p><p>Sliding under the spray was bliss, the beads of water trailing their way down her body, her hair wet and ropy within seconds, the curl relaxed and the strands stretching long enough to tickle the top of her sacrum. Eh – why not leave the ad up? Who knew. Maybe she’d attract a better breed of guy. Or, at least, a different kind. She eyed the shower head – did she have time? Eight minutes?</p><p>More than enough for the last guy she dated.</p><p>Just enough time for some intimate attention from Mr. Showerhead, though. Josie was wrong. It wasn’t her battery bill that was getting expensive. Her water bill, on the other hand...</p><p>Good thing her vibrator was waterproof. As she soaped up she was cognizant of the time, knowing she had minutes to finish. Pulling up the old standby fantasy always worked. Two men, luscious and thickly-muscled, both in the shower with her. Mmmm...</p><p>The extra tip of her vibrator slid along the soft, sensitive skin of her clit as she perched one foot on the tub, opening up for access to slide in her fantasy lover, who was soaping her body with his sculpted, large hands, hands that smoothed over her curves, cupping her ass to pull him toward her, sliding his enormous cock in her while the other nameless, faceless lover kissed her, hard, his tongue lashing against her and exploring as the spray rolled down in rivulets between them, gathering at her folds and adding to the tease on her clit.</p><p>Her passage tightened as she imagined him bending down, on his knees, his tongue now lapping where the vibrator’s little antennae tweaked her, not her own hands moving the thick shaft in and out but the lovers’, four hands at once on her as one mouth descended on her eager, red nub, the other man thrusting her up against the shower’s wall, her body ready for more.</p><p>She tensed, knowing she was so close, craving all these hands, more than enough for two men who wanted and needed her, the familiar muscled cresting of her climax so innate she barely cried out, the release perfunctory but oh, so welcome.</p><p>And, now, the guilt. Because how could a “normal” woman really want two men at once? As she absent-mindedly rushed through the rest of the shower, quickly washing off her trusty toy, a persistent voice said, You, Laura. You. </p> </body></html>"]