["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>RAPHAEL</p><p>BY ALEXANDRA IVY</p><p>Legend of the Pantera</p><p>To most people the Pantera, a mystical race of puma shifters who live in the depths of the Louisiana swamps, have become little more than a legend.</p> <p>It was rumored that in the ancient past twin sisters, born of magic, had created a sacred land and claimed it as their own. From that land came creatures who were neither human or animal, but a mixture of the two.</p><p>They became faster and stronger than normal humans. Their senses were hyper-acute. And when surrounded by the magic of the Wildlands they were capable of shifting into pumas.</p><p>It was also whispered that they possessed other gifts. Telepathy, witchcraft, immortality and the ability to produce a musk that could enthrall mere mortals.</p><p>Mothers warned young girls never to roam alone near the swamps, convinced that they would be snatched by the Pantera, while young men were trained to avoid hunting anywhere near the protected Wildlands.</p><p>Not that the warnings were always successful.</p> <p>What girl didn't dream of being seduced by a gorgeous, mysterious stranger? And what young man didn't want to try his skill against the most lethal predators?</p><p>As the years passed, however, the sightings of the Pantera became so rare that the rumors faded to myths.</p><p>Most believed the species had become extinct.</p><p>Sadly, they weren't entirely mistaken...</p><p>CHAPTER 1</p><p>SLUT. Whore.</p> <p>Worthless piece of white trash.</p><p>The words were still ringing in Ashe Pascal's ears as the door to the trailer slammed behind her.</p><p>She grimaced as she gathered her clothes that littered the front porch and headed for her piece-of-shit clunker that was parked near the curb.</p><p>For once the drunken insults flung by her mother managed to hit a nerve.</p><p>Not that she was a whore. It wasn't like she'd gotten paid for spreading her legs, was it?</p><p>Hell no, she'd spread them for free.</p><p>Or at least she assumed she had.</p><p>How else could she be pregnant? Immaculate conceptions might happen in the good book, but in the bayous of southern Louisiana women got knocked-up the good old-fashioned way.</p> <p>A damned shame she couldn't remember what happened.</p><p>If she had to pay the piper she should at least have enjoyed the dance.</p><p>With a shake of her head, she yanked open the door of her car and tossed her clothes on the cracked leather seat before climbing behind the driver's wheel.</p><p>Shoving her key into the ignition, she breathed out a sigh of relief as the engine rattled to weary life. The way her pissy luck was running she'd expected the battery to be dead. Again.</p><p>She supposed there was an irony in the fact that she'd promised herself that she would start looking for a new car just as soon as she'd paid off her mother's latest bar tab. She'd even driven to the bar to tell the owner that she was done being her mother's personal banker.</p><p>And that's when the trouble had started.</p><p>Barely aware that she'd shoved her car in gear, Ashe absently drove through the small town that hovered on the edge of the bayou, pulling to a halt across the street from the only bar in town.</p><p>The two story wooden building with a tin roof had at one time been painted a cheery yellow, but over the years it'd faded to a miserable mustard, with heavy green shutters that could offer protection during hurricane season. The entire structure was built on heavy stilts to keep the main floor off the ground. A necessary precaution in this area. The danger of flooding was a hundred percent, which no doubt explained why less than a few hundred people lived in the town.</p><p>She gave a humorless laugh at the neon sign that blinked in the thickening gloom.</p><p>'The Cougar's Den'</p><p>It sounded like a hang-out for the local football team, or maybe a taxidermist's shop.</p><p>Instead it was filled with a motley crew who she assumed came in from the oil fields, the shrimp boats and the dark shadows of the swamps. And of course, locals like her mother who were so desperate for a drink they were willing to ignore the thick air of aggression that filled the entire building.</p><p>The rest of the town avoided the place like the plague.</p><p>Including the pack of stray dogs that terrorized the rest of the town.</p><p>The Cougar's Den was a cesspit of danger.</p><p>Her grim thoughts were abruptly interrupted as the humid spring breeze swept through her open window, tugging at her long, black curls and caressing her skin that remained a pale ivory no matter how much sun she got. Her eyes, as dark as a midnight sky, narrowed.</p><p>There was something in the breeze.</p><p>Something beyond the hint of azaleas, and newly bloomed roses from Old Lady La Vaux's garden, and even the more distant smell of rotting vegetation that wafted from the swamps.</p><p>What the hell was that scent?</p><p>Not cologne, but...musk.</p><p>Yes. That's what it was. A rich, intoxicating male musk.</p><p>Without warning, a flash of memory seared through her brain.</p><p>She was in the cramped barroom, trying to ignore the flat, unfriendly glares from the large group of men who were gathered around the pool tables at the back of the darkly paneled room.</p><p>One in particular had separated himself from the pack, staring at her as if she were a creature from another planet.</p><p>He was big. Six foot two at least. And powerful, with sleek, chiseled muscles beneath his tight white tee and black jeans.</p><p>In the dim light he looked like some exotic god.</p><p>His shoulder-length hair was thick and shimmered like molten gold in the dim light. His features were lean, stunningly beautiful. And his eyes...</p><p>Words couldn't capture their beauty.</p><p>They were the same gold as his hair, but flecked with hints of jade and in the darkness they glowed with an inner light.</p><p>Abruptly her memory took a leap forward.</p><p>She was no longer in the public room, but lying on a bed in a room upstairs.</p><p>It was dark and that aromatic male musk saturated the air.</p><p>A low, male voice whispered in her ear.</p><p>\"You're so wet, ma chere. Do you want me to lick your cream?\"</p><p>She groaned, her legs parting as she felt soft kisses blaze a trail down her quivering belly.</p><p>\"Raphael, please.\"</p><p>\"Tell me what you want.\" A command. \"Say the words.\"</p><p>\"You.\" She clutched the soft quilt beneath her, her body on fire with need. It'd never been this way. Not this raw, frantic hunger that clawed through her with an addictive force. \"I want you.\"</p><p>There was a low chuckle and she gasped at the feel of his hot breath against the sensitive skin of her inner thigh.</p><p>\"Where do you want me?\" he teased. \"Here?\" The stroke of a rough tongue through her wet slit.</p><p>Sucking a sharp breath, Ashe shattered the strange vision.</p><p>Was the memory real? Or just her mind trying to sugarcoat the hideous truth?</p><p>With a low cry, she shoved the car back into gear and stomped her foot down on the accelerator.</p><p>There were no answers here.</p><p>What she needed was a hot meal and somewhere to sleep for the night.</p><p>Tomorrow she would worry about how she was going to take care of a baby when she could barely take care of herself.</p><p>Standing in the shadows beneath the bar, Raphael strained against the large man who kept him from charging after the sorry excuse for a car currently speeding away.</p><p>\"Release me,\" he growled, his eyes glowing with a luminous gold in the darkness.</p><p>\"Goddammit, Raphael.\" Bayon shared Rafael's golden good looks although his hair was a shade paler and his eyes held more green. He was also built on bulkier lines. \"Leash your damned animal and listen to me.\"</p><p>Raphael battled through the primal instincts that had nothing to do with humanity and everything to do with raw, animal desire.</p><p>Holy hell.</p><p>Of all the Pantera, he was the one who'd had the best control over his primitive nature.</p><p>It was the reason he'd been chosen by the elders to become one of the most trusted diplomats for his people, traveling away from the Wildlands to meet in secret with various world leaders. At least that was his public persona. In truth, his primary duty was heading up his peoples' vast network of spies who infiltrated the various governments and scientific communities.</p><p>He could travel for weeks away from the reservation without being debilitated by his need to shift. And more importantly, he'd developed the ability to mimic the humans so he could function in their world.</p><p>He was still a feral feline at heart, but a feline with manners.</p><p>Now, however, he was at the mercy of savage need that thundered through his body with the force of a tsunami.</p><p>\"I'm not going to tell you again,\" he growled. \"Let me go.\"</p><p>Bayon leaned in until they were nose to nose. The bastard was one of the few who had the cojones to get in Raphael's grill.</p><p>\"This has to be a trick,\" the younger warrior snapped. \"We've tried for the past fifty years to discover human women who can carry our seed-\"</p><p>\"You don't have to remind me of our history.\"</p><p>And he didn't. Raphael knew better than anyone the struggles of the Pantera.</p><p>It'd started slow.</p><p>Fewer and fewer females going into heat. And those who did were unable to carry their babes to full-term.</p><p>At first the elders believed that it was the fault of the human contact with the Pantera. They shut off their borders and became increasingly isolated from the world.</p><p>When that didn't work, they began to fear it was a genetic anomaly. The Pantera had, after all, interbred for centuries.</p><p>So discreetly selecting the finest specimens of human females who agreed to become surrogates at an enormous price for their secrecy, they'd brought the women to their high-tech medical facilities. They were the rare few who realized the Pantera were more than mere myths.</p><p>The human females, however, had been unable to breed with the Pantera. Not even with the most potent fertility drugs.</p><p>So his people had no choice but to seek answers outside the Wildlands.</p><p>Keeping a low profile, a handful of Pantera scientists had covertly gained employment at various research facilities, seeking information from the humans' work on DNA.</p><p>At the same time, the 'Suits,' or Political Faction of the Pantera, had sent spies to infiltrate the various governments.</p><p>They needed to know if there was some physical change that was affecting the magic of their land.</p><p>Toxic waste. Global warming. Bio-chemical warfare.</p><p>It could be accidental or deliberate sabotage, but if the humans were involved then Raphael intended to uncover the truth.</p><p>He had just been returning from his latest trip abroad when he'd stopped at The Cougar's Den, needing to blow off some steam before traveling to the Wildlands and making his latest report.</p><p>The elders weren't going to be pleased with his lack of progress.</p><p>Hell, he wasn't pleased.</p><p>The last thing he expected was to be blindsided by a human female. Or to find himself returning to the decrepit bar week after week in the hopes of spotting her again.</p><p>And now...shit.</p><p>Giving Raphael a shake, Bayon glared at him, his anger causing the temperature to spike.</p><p>\"Then you realize it's impossible for that female to be pregnant with your child.\"</p><p>Raphael met his friend glare for glare. \"Impossible or not, I know what I smelled.\"</p><p>\"Think about it.\" Bayon's eyes glowed with golden power. \"A strange woman just happens to stroll into a bar where the Pantera gather. She magically stirs your mating urges despite being human, and now she deliberately parks her car close enough that you were bound to pick up her scent before driving away like a madwoman.\" He gave Raphael another shake. \"Does she have to have T R A P tattooed on her ass for you to get it?\"</p><p>Raphael made a sound of frustration. His friend wasn't saying anything that Raphael hadn't already told himself.</p><p>Hell, he'd be shocked if it wasn't some sort of trick.</p><p>But until he discovered exactly what was happening, he wasn't going to let the female out of his sight.</p><p>Or out of his bed, a treacherous voice whispered in the back of his mind.</p><p>\"There's one way to find out.\"</p><p>With a strength that caught Bayon off-guard, Raphael shoved them away and headed toward the road.</p><p>\"Wait,\" Bayon called. \"What are you going to do?\"</p><p>\"To find my woman and discover exactly what she has tattooed on her ass,\" he snarled.</p><p>\"Christ, Raphael.\"</p><p>Focused on the rapidly fading scent, Raphael jogged away from the bar, his dark jeans and black tee allowing him to disappear among the shadows.</p><p>He expected the female to head to her house. The more respectable citizens of the small town tended to be tucked safely behind closed doors as soon as the sun went down. They might not logically believe in voodoo or ghosts or even the Pantera, but they were smart enough to know that strange creatures crawled out of the swamps at night.</p><p>No reason to become easy prey.</p><p>But instead of heading toward the wooden houses that ran in tidy rows facing the red brick schoolhouse and attached community center that doubled as a church, she turned in the opposite direction toward the town square that was framed by a handful of small shops.</p><p>At last she parked her car next to the three-story hotel that was squashed between the beauty shop and post office. Raphael stood beneath the draping branches of the weeping willow in the center of the square, watching the slender female enter through the glass door.</p><p>Did she work at the hotel?</p><p>Or was she there to meet someone?</p><p>Some man?</p><p>A low snarl rumbled through his chest, his cat twisting beneath his skin with a primeval fury.</p><p>The woman was his.</p><p>Branded by his passion and bound to him by the babe she carried in her womb.</p><p>Mine. Mine. Mine.</p><p>The words whispered through his soul as he strolled across the street to enter the cramped lobby of the hotel.</p><p>His nose wrinkled at the stench that clung to the ugly green and yellow diamond-patterned carpet and the mold that had multiplied into a thriving community behind the warped wood paneling. There was a wilted fake plant shoved in a corner and a reception desk at the back of the room. Currently a bleached-blonde woman was leaning on the desk as she flipped through a glossy magazine.</p><p>Lifting her head at his entrance, she gave a low whistle, her chubby face flushing with pleasure as her blue gaze made a slow, thorough survey of his body.</p><p>\"Can I help you?\" she murmured, tugging at her loose top to better display her massive rack.</p><p>Clearly the middle-aged woman thought her breasts worthy of putting on public display.</p><p>A delusional belief, but Raphael wasn't a trained diplomat just because he could travel away from the Wildlands.</p><p>With his most charming smile he strolled forward, halting near the desk so he could covertly take note of an office to the left where two small dogs were yapping at his arrival and, to the right, a back door that led to the alleyway.</p><p>\"I was passing and I thought I saw a friend come in here.\"</p><p>The female gave her blouse another tug. \"Lucky friend.\"</p><p>\"Maybe you would recognize her. She's tall, dark-haired...beautiful.\"</p><p>\"Oh, you mean Ashe Pascal.\"</p><p>Ashe. He silently tested the name. A Native American name.</p><p>Did she carry their blood?</p><p>\"Yes.\"</p><p>The woman eyed him with a growing curiosity. \"She just went to her room. Do you want me to give her a call?\"</p><p>\"That's not necessary.\" He shared another dazzling smile. \"Is she a guest here?\"</p><p>\"For tonight.\" The bleach-blonde curls bounced as the female shook her head in a gesture of disgust. \"That mother of hers kicked her out. The damned bitch should be flogged for the way she treats her daughter.\"</p><p>Raphael's brows lowered. \"Ashe never speaks of her family.\"</p><p>The woman shrugged. \"What's to say? Her worthless father walked out when she was just a babe and her mother's a drunk. Ashe spends every penny trying to keep a roof over her head and the bills paid. Not that Dixie Pascal appreciates what Ashe does for her. Most nights she's down at that nasty Cougar's Den swilling cheap vodka.\" She grimaced. \"Just as a warning, if you're new in town, you'll wanna give that bar a miss. It's not a place for decent folk.\"</p><p>A pure shaft of fury pierced his heart.</p><p>The Pantera were a close-knit society who protected their young with a ferocious intensity.</p><p>But Ashe had been treated like trash. Tossed onto the streets by her mother.</p><p>She'd been left vulnerable, her child...his child...put at risk in this shabby hotel that was barely a step above sleeping in the gutter.</p><p>The knowledge was unacceptable.</p><p>Sensing the hotel manager's growing curiosity, Raphael leashed his anger.</p><p>He would deal with Ashe's worthless parents after he had her safely hidden in his lair.</p><p>For now he had to make certain that his savage obsession with the beautiful female wasn't blinding him to an obvious trap.</p><p>\"I'll keep that in mind,\" he murmured.</p><p>The older woman tilted her head. \"Are you wanting to see Ashe?\"</p><p>With every fiber of his being.</p><p>He forced himself to shake his head.</p><p>\"Perhaps later. Unfortunately, I have a meeting, but I can't remember the exact address.\" He held the manager's pale gaze allowing a tendril of his musk to fill the air. It wasn't enough to captivate the woman, but it would loosen her tongue. \"I don't suppose you've seen any strangers hanging around here?\"</p><p>\"Here?\" She frowned, considering the question. \"I've had the usual crew from the oil rigs and the Jenkins family came in from Baton Rouge for a reunion.\"</p><p>\"There hasn't been anyone around town asking questions?\" he pressed.</p><p>\"The only strangers in town are down at The Cougar's Den.\" The woman heaved an exasperated frown as the dogs caught the whiff of his musk and went into a whining frenzy. \"What the hell is wrong with them dogs? Excusez-moi.\"</p><p>Raphael waited until the woman had stomped into the office to pacify her terrified animals before silently sliding out the back door.</p><p>He stepped into the shadows, disappearing from prying eyes as he allowed his senses to absorb his surroundings.</p><p>He caught the sound of mice tunneling through the trash cans. The buzz of the street lights at the end of the alley. The breeze that carried a threat of rain.</p><p>And, overwhelming everything, the sweet perfume that had haunted his dreams for the past six weeks.</p><p>Sucking in a deep breath, Raphael focused on the window where he could sense Ashe.</p><p>He would wait to slip into her room once she was asleep.</p><p>And then...</p><p>Then he would have the truth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>ASHE hadn't expected to sleep.</p><p>Even when she'd stripped off her clothes and crawled beneath the sheets buck-naked, she'd assumed she was too worried to actually relax enough to rest.</p><p>But the emotional upheaval of the day, combined with the hormonal changes that were already affecting her body, soon had her tumbling into a welcomed darkness.</p><p>Not that her rest was peaceful.</p> <p>She'd barely fallen asleep when her dreams were filled with the memories of a hard, hot body pressing her into the mattress.</p><p>She moaned, her head twisting on the pillow as seeking lips trailed a line of kisses down the column of her neck. Her hands ran a restless path over the wide back, savoring the feel of rippling muscles beneath the silken skin.</p><p>Raphael.</p><p>Her legs parted as he settled between them, the steel-hard length of his erection pressing against her inner thigh. Her entire body was on fire, shaking with the need to feel him deep inside her.</p><p>It'd never been like this.</p> <p>Never before had she experienced this savage...hunger.</p><p>She felt the head of his cock penetrate her, but while her hands moved to clasp his hard ass, he refused to deepen the thrust. Instead his lips blazed a path of devastation along the line of her collarbone, kissing and sucking the sensitive skin.</p><p>Her hips lifted in a silent plea, her breath wrenched from her lungs as his mouth traveled over the soft globe of her breast and latched onto her nipple.</p><p>She whimpered.</p><p>Oh...god.</p><p>It was good. So good.</p> <p>His teeth closed over the aching tip, biting hard enough to send a jolt of sizzling excitement through her.</p><p>Please.</p><p>What do you want?</p><p>You.</p><p>Only me. Do you understand? You're mine.</p><p>Yes.</p><p>Say it.</p><p>Only you.</p> <p>She heard a rumble of satisfaction deep in his chest, the intoxicating musk filling her senses. Oh, hell. How had she ever thought sex an overrated pastime?</p><p>This was mind-blowingly fantastic.</p><p>The inane thought was shattered as he pressed his hips forward, entering her with a slow, ruthless slide that stretched her with a delicious friction.</p><p>He was huge.</p><p>A gasp of pleasure was ripped from her lips as his hands gripped her hips, tilting her so he could sink even deeper, invading her with the promise of paradise.</p><p>Raphael.</p><p>I'm here.</p><p>Jerked out of her dream, Ashe lifted a hand to her ear, feeling the lingering warmth. As if lips had just brushed the delicate shell.</p><p>Shit.</p><p>Slowly sitting up, she tugged the sheet over her breasts as she impatiently brushed her tangled hair out of her face.</p><p>\"Hello?\" Her eyes searched the darkness, sensing a presence even though she couldn't see the intruder. A chill inched down her spine. \"I know there's someone here.\"</p><p>\"You smell so sweet.\" The male voice was low, whiskey-smooth. And terrifyingly familiar. \"Like night-blooming jasmine.\"</p><p>She didn't scream. Instinctively she knew that he would pounce before she could be heard.</p><p>Her hand fumbled for her cell phone.</p><p>Where the hell was it? She'd left it on the nightstand, hadn't she?</p><p>\"I have a gun,\" she tried to bluff.</p><p>She heard a soft footfall, but the intruder remained in the shadows while she was bathed in the moonlight that slanted through the window.</p><p>The open window.</p><p>No need to ask how he managed to get in.</p><p>\"That's what first caught my attention,\" he continued, ignoring her threat. \"That scent...\" She heard him suck in a deep breath. \"It intoxicates me.\"</p><p>\"I'll shoot,\" she tried again, even knowing it was futile. \"I swear I will.\"</p><p>\"And then I caught sight of you.\" His words seemed to brush over her skin, creating tiny sparks of awareness. \"The exquisite lines of your profile. The sexy tumble of ebony curls. The ivory satin of your skin. The elegant lines of your body.\" There was a low rumble. Did it come from the man? \"You were a purebred, all pride and nervous energy.\"</p><p>Her mouth went dry and she forgot her search for her missing phone. Instead her fingers went toward the lamp.</p><p>\"Who are you?\"</p><p>\"No, don't turn on the light.\"</p><p>She shivered at the command in his voice. \"Then answer the question.\"</p><p>\"Raphael.\"</p><p>So, she hadn't imagined knowing his name.</p><p>Christ. Did that mean the rest was true as well?</p><p>The thought should terrify her. Or at least infuriate her.</p><p>It sure the hell shouldn't cause a treacherous heat to bloom between her legs.</p><p>\"Just Raphael?\" she rasped.</p><p>\"Just Raphael.\"</p><p>\"Why are you in my room?\"</p><p>There was a beat of silence, as if he was startled by the question.</p><p>\"You know why.\"</p><p>A sudden premonition stole her breath. \"No.\"</p><p>\"You carry my child.\"</p><p>\"Shit.\"</p><p>The panic that should have hit the minute she woke with a strange man in her hotel room belatedly thundered through Ashe. Without conscious thought she was shoving aside the sheet and preparing to leap off the bed.</p><p>She didn't know where she intended to go.</p><p>She was naked, broke and currently homeless.</p><p>But anywhere had to be better than locked in a room with a lunatic.</p><p>There was no warning.</p><p>One minute she was struggling to untangle her feet from the covers and the next she was flat on her back, a heavy body pressing her into the mattress.</p><p>Oh...hell.</p><p>This was it.</p><p>Her dream.</p><p>Except in her dreams he was naked. Now his denims scraped against her upper thighs and a soft tee brushed the aching tips of her breasts.</p><p>Unbelievably the sensations were almost as erotic as the feel of his bare skin.</p><p>Or maybe not so unbelievably.</p><p>Even with a layer of clothing between them she could feel the searing heat of his body seeping into her, stirring her blood. And that musk...</p><p>How was a woman supposed to think clearly?</p><p>Her lips parted-whether to scream or moan she would never know-as his head swooped down and her mouth was taken in a savage kiss.</p><p>She gasped, shocked by the jolts of sheer pleasure that ravaged her body.</p><p>It was like being struck by lightning.</p><p>Dazzling. Electric. Stunning her with an instant need that made her pussy clench with anticipation.</p><p>She squirmed beneath him, pressing the aching tips of her breasts against the heat of his chest. Oh god. It felt so good.</p><p>With a groan, Raphael ripped his mouth from hers to bury his face in the curve of her throat.</p><p>\"That smell,\" he muttered, his nose lingered against her thundering pulse as his hands pinned her arms over her head.</p><p>His heavy legs held the bottom half of her body motionless, but even with her mind clouded by lust she realized that he was taking great care not to press any weight against her stomach.</p><p>The knowledge sent an odd flare of tenderness through her. A sensation that was far more disturbing than the desire pulsing through her blood.</p><p>Instinctively, she tried to put some distance between them.</p><p>\"No.\" A warning growl rumbled deep in his chest as he lifted his head. \"Don't move.\"</p><p>Her hair rose at the prickles of heat that filled the air. \"Are you going to hurt me?\"</p><p>\"No. But your struggles...\" His golden eyes suddenly seemed to shimmer with a luminosity in the darkness. \"Excite my animal.\"</p><p>Those eyes.</p><p>Those magnificent golden eyes that had glowed with hunger as he'd ridden her with a rough urgency.</p><p>\"Oh god, it was you,\" she breathed.</p><p>\"Yes.\"</p><p>A surge of anger merged with her lust, forming a combustible combination.</p><p>\"You're right, you are an animal,\" she snapped. \"What kind of man drugs and rapes a helpless woman?\"</p><p>He hissed in genuine outrage. \"There were no drugs and there sure as hell was no rape.\" He lowered his head until they were nose to nose, his breath a warm caress against her face. \"You begged, ma chere.\"</p><p>\"A lie,\" she muttered.</p><p>He brushed his lips over her cheek until he could whisper directly in her ear, his tone pitched high as he mimicked her words.</p><p>\"Please don't stop,\" he breathed. \"Please, please. I need your cock deep inside me.\"</p><p>Her lips parted, but the protest died as she could hear the words in her own voice echoing through a dark room.</p><p>She had begged.</p><p>She'd even grabbed the steel-hard length of his cock to try and steer him to her sweet spot.</p><p>\"It was the drugs,\" she muttered.</p><p>He nipped her earlobe. \"No drugs.\"</p><p>A violent shudder racked her body, her legs spreading as he settled between them, the ridge of his erection pressing against her inner thigh.</p><p>\"There had to be,\" she insisted. \"I don't have sex with strangers. And even if I did I wouldn't forget-\"</p><p>Her words faltered as he did something with his hips that aligned his cock directly against her throbbing clit.</p><p>\"Mind-shattering climaxes that left us both gasping for air?\"</p><p>Her breath was wrenched from her lungs even as she dug her nails into the hands that gripped her wrists above her head.</p><p>\"Stop it,\" she moaned, wanting nothing more than to wrap her legs around his waist and rub herself to climax. This wasn't her. She didn't become hot and bothered just because some guy wanted to have sex with her. Even if he was a gorgeous stud who was built like a freaking Greek god. \"You did something to me.\"</p><p>\"No, we did something to each other.\" He caught her bottom lip between his teeth, giving it a sensual tug before nibbling at the corner of her mouth. \"Something that shouldn't be possible.\"</p><p>\"I don't know what you're talking about.\"</p><p>\"And that's the problem.\"</p><p>Hell, there were a whole lot of problems.</p><p>And this man making her go up in flames was the cause of all of them.</p><p>\"Could you please get off me?\" she demanded, lifting her hips as if she could actually buck him off.</p><p>His hands tightened on her wrists, his breath hissing between his clenched teeth.</p><p>\"Stay. Still.\"</p><p>Her heart halted as something seemed to shift behind his glowing eyes. An...awareness that was watching her with a feral hunger.</p><p>\"Christ.\"</p><p>He sucked in a deep breath, a muscle clenching in his jaw. \"Listen, ma chere, we need to talk. But if you keep moving, I'm going to forget everything except my instinct to fuck you.\"</p><p>Moisture gathered between her legs, a raw craving clawing through her.</p><p>\"Don't...don't say things like that.\"</p><p>\"Does it excite you?\"</p><p>Yes. God, yes.</p><p>She wanted to be fucked.</p><p>Here. Now.</p><p>She swallowed a moan.</p><p>\"It disgusts me,\" she forced herself to lie. \"You disgust me.\"</p><p>His low chuckle brushed over her heated face. \"Is that why you're wet?\" he teased. \"Why you've got your nails dug into my hands as if you're terrified I might leave before I satisfy that ache inside you?\"</p><p>She shuddered. He was right.</p><p>It would be unbearable to be left to suffer the overwhelming lust that was spiking ever higher.</p><p>\"God.\"</p><p>\"Shh.\" He brushed a gentle kiss over her lips. \"Right now I just want to talk.\"</p><p>She refused to be comforted. \"Before or after you drug me?\"</p><p>\"Dammit.\" The austere beauty of his face tightened with annoyance. Then, with an obvious effort, he struggled to keep his temper. \"Have you heard of the Pantera?\"</p><p>She blinked.</p><p>Of all the questions she'd been expecting, that had to be at the bottom of the list.</p><p>\"The beast-men who roam the swamps?\" she asked in confusion.</p><p>His lips twisted. \"I suppose that's one way of describing them. What do you know?\"</p><p>She shrugged. Like every child who grew up near the swamps she'd heard the stories of the strange beasts who were part man, part animal, who roamed the darkness.</p><p>Her own grandmother had sworn the mysterious race had openly interacted with the townsfolk when she'd been young, but the old woman had often been confused. Hell, she'd all but implied that Ashe's father had been some sort of magical shaman instead of a lazy jackass who'd bolted the minute he discovered her mother was pregnant.</p><p>\"I know they're about as real as Rougarou and Bigfoot,\" she said.</p><p>\"They're real.\" There was a deliberate pause. \"I'm real.\"</p><p>Her mouth went dry, a sharp-edged fear slicing through her heart.</p><p>\"You're saying you're a beast-man?\"</p><p>The beautiful face was set in a grim expression. \"I'm Pantera.\"</p><p>She tried to laugh, only to have it come out as a shaky moan. \"Yeah, right.\"</p><p>\"Look at me, Ashe.\" The eyes glowed brighter, as if there were a fire burning deep inside them with flecks of jade. They were...magnificent. Stunning. But they sure as hell weren't human. \"You know I speak the truth. You've sensed I was different from the moment we met.\"</p><p>Of course she'd sensed he was different.</p><p>No mere man could move with such graceful speed, or hold a woman captive with one hand.</p><p>And then there was that enticing musk that clouded her mind and made it impossible to think.</p><p>\"I didn't know you were a freaking animal,\" she rasped.</p><p>He flinched, his nose flaring with irritation. \"Careful, ma chere, the child you carry is Pantera.\"</p><p>Abruptly she squeezed her eyes shut. It was too much.</p><p>Too. Damned. Much.</p><p>\"God, please let this be a nightmare.\"</p><p>\"Do you intend to act like you're five and hope you can close your eyes and wish away the monster?\" he chastised. \"Or are you going to look at me and discuss this like an adult?\"</p><p>Her eyes snapped open.</p><p>Did he think a child of a raging drunk had ever been allowed to pretend she could wish away monsters?</p><p>\"I was an adult at five,\" she said, coldly.</p><p>Something that might have been regret softened his aquiline features.</p><p>\"Then you understand that we have to face the consequences of our actions.\"</p><p>\"Easy for you to say. I don't even remember our...actions.\" She narrowed her gaze. \"You did something to me to make me forget, didn't you? Is it a power you have?\"</p><p>He shrugged. \"One of many.\"</p><p>So she hadn't blacked out that night.</p><p>She didn't know if his confession made her feel better or not.</p><p>Actually, she didn't know what she felt.</p><p>She licked her lips, shivering as his glowing gaze lowered to study her mouth with an unsettling intensity.</p><p>\"Are you-\"</p><p>\"What?\"</p><p>\"Part beast?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>RAPHAEL lifted a brow.</p><p>Christ. Did she actually think he had furry parts when he was in this form?</p><p>Then he bleakly reminded himself that while every kiss, every soft moan as he plunged deep inside her, was branded on his mind, she had only flashes of memory.</p><p>The thought stirred a startling compulsion to repeat the performance.</p> <p>To fuck her so long and so thoroughly she would never, ever be able to forget his touch.</p><p>To mark her so no other man would ever dare lay a finger on her.</p><p>Mine.</p><p>He swallowed a low snarl. Dammit. He'd been chosen as a diplomat because he was one of the Pantera capable of controlling his emotions.</p><p>How did this female manage to destroy that restraint?</p> <p>\"Yes, I'm part beast,\" he said dryly. \"And before you try to peek, I don't have animal parts when I'm in human form.\"</p><p>With a remarkable courage, considering all she'd been through over the past few hours, she met his gaze, determined to learn the truth.</p><p>\"I assume that means you have more than one form?\"</p><p>\"When I'm on my native soil I can shift.\"</p><p>\"Shift?\" She blinked. \"Like a werewolf?\"</p><p>He made a sound of disgust. \"No, I'm a puma, not a mangy dog.\"</p> <p>She slowly absorbed his words, her face pale. \"How?\"</p><p>Raphael hesitated, battling against his instinctive urge to ignore her question.</p><p>Over the past fifty years the already elusive Pantera had become increasingly isolated, sensing they were in danger but unable to pinpoint the precise threat.</p><p>Only those individuals necessary for survival of their race actually left the Wildlands and they remained incognito except to a rare few, trusted humans. Well, and the politicians who had the power to screw with their homeland.</p><p>But even as he struggled against his training, he knew deep in his gut that this woman was innocent.</p><p>He would have been able to sense if she were lying to him.</p><p>She truly had no idea what Pantera were or that the child she carried was supposed to be an impossible dream.</p><p>\"You'll have to discuss the subject with our philosophers if you want an exhaustive explanation,\" he at last answered. \"But the short story is that the Wildlands possess a magic that created my distant ancestors.\"</p> <p>She frowned. \"Turning them into pumas?\"</p><p>\"Giving them the ability to shift into animal form. It's still hotly debated whether they could have chosen any animal and settled on pumas since they were the most lethal predator capable of surviving in the bayous, or if it was the only form the magic allowed.\"</p><p>Her face paled another shade, emphasizing her fragile beauty. \"What else can you do?\"</p><p>Feeling a jab of regret, Raphael loosened his grip on her wrists, skimming his hands down her bare arms.</p><p>This had to be difficult for her.</p><p>Unfortunately, he didn't know how to make it any easier.</p><p>\"Like humans, we each have our own talents.\"</p><p>She shivered with growing excitement, but her expression remained hard with suspicion.</p><p>\"That's...evasive.\"</p><p>His concentration was shattered by the feel of her satin skin beneath his fingertips, the cat inside him stirring with restless hunger.</p><p>It didn't understand this need to talk.</p><p>It wanted to pounce. Devour. To mate with this female who was warm and wet beneath him.</p><p>\"We're a secretive race.\"</p><p>\"No shit,\" she breathed. \"Why?\"</p><p>\"We have our reasons.\"</p><p>Her eyes darkened as his hands traced her shoulders before heading down the line of her collarbone, her own concentration obviously beginning to fracture.</p><p>\"Just tell me, is one of your talents seducing humans?\" she hissed through clenched teeth.</p><p>\"We produce a pheromone that can be an aphrodisiac,\" he said, not surprised when her eyes widened and she wildly grasped for the excuse to explain her violent arousal whenever he touched her.</p><p>\"I knew it,\" she rasped.</p><p>He shook his head. \"Ashe, that's not what happened between us.\"</p><p>\"You just said-\"</p><p>\"I said it's possible to produce a pheromone, but believe me I had no need to do anything,\" he said, his voice thickening as his dick began to throb with an insistent craving. \"You walked into the bar and the air combusted between us.\"</p><p>He could hear her heart miss a beat as her nipples hardened into tiny nubs of temptation.</p><p>\"So you're saying I caught sight of you and instantly climbed into the nearest bed?\"</p><p>She tried for scorn, but there was no missing the dilation of her pupils and the scent of her arousal.</p><p>He sucked in a deep breath, savoring her sweet scent. \"I don't have an explanation beyond the fact that we saw one another, the mating heat hit, and not a force on this earth could have kept me from claiming you.\"</p><p>\"Mating heat?\"</p><p>\"When a female Pantera is fertile she-\"</p><p>\"Don't.\" She pressed a hand over his mouth, a complex tangle of emotions rippling over her delicate features. \"I'm not Pantera.\"</p><p>\"No,\" he swiftly agreed. \"And even if you were, I should have been able to control myself. I might have the soul of an animal, but I'm still human.\"</p><p>She studied his somber expression, searching for the truth. \"Did you truly make me forget?\"</p><p>Raphael forced himself to meet her gaze. He wasn't proud that he'd used his power to scrub her mind.</p><p>But the bald truth was that he'd been as shocked as she was by the intensity of his desire for her. And while he'd had sex with any number of human females, he'd never lost control like he had that night.</p><p>He couldn't be entirely certain that he hadn't given away the fact he wasn't a normal lover.</p><p>Now he knew that his little stunt was only going to complicate their already fucked-up relationship.</p><p>\"I have the ability to cloud your memories,\" he reluctantly admitted.</p><p>She stiffened beneath him. \"You can manipulate my mind?\"</p><p>\"No,\" he growled. \"I can only...urge you not to remember. It's a small trick that has allowed my people to keep our presence hidden from most of the world.\"</p><p>He could feel her stiffen beneath him. \"That's what you call it? A small trick?\" she snapped, her eyes flashing with midnight fire. \"I thought I was going crazy when I went to the doctor and he told me I was pregnant. Then I started getting flashes of memories. It terrified me. I didn't know if they were real or if they were fragments of a growing insanity.\"</p><p>\"I'm sorry,\" he said.</p><p>And he was. The thought of causing this woman one second of pain was abhorrent. But as he slowly began to accept that the child she carried was no trick, that she was actually pregnant with his babe, he couldn't regret that he'd given into his primitive urges.</p><p>To have this woman as his mate, and a child to call his own...</p><p>It filled him with a fierce happiness he never expected.</p><p>Her lips flattened. \"That's all you have to say? I'm sorry?\"</p><p>His gaze lingered on her mouth, his cock twitching as his cat reached the end of its patience.</p><p>\"It shouldn't have been possible.\"</p><p>\"The memories?\"</p><p>\"The memories or the pregnancy.\"</p><p>\"You used protection?\"</p><p>\"No.\" His gaze returned to meet the challenge in her eyes, once again struck by her courage. Most humans, male or female, would be cowering in fear. But not his beautiful Ashe. His cat preened with pride. \"I'm incapable of catching or carrying human diseases so you were in no danger. And there's never been a human female impregnated by a Pantera.\"</p><p>\"Never?\"</p><p>\"Not one in recent memory.\"</p><p>Her eyes widened. \"Then maybe this baby isn't yours.\"</p><p>\"Ashe-\"</p><p>\"You said yourself you screwed with my memories. Maybe I left you and had sex with some other man...\" She gave a small scream as his teeth sank into her neck. Not hard enough to break the skin, but with enough force to claim his ownership. \"Shit, Raphael,\" she gasped, her nails digging into his shoulders as she squirmed beneath him.</p><p>Not in pain.</p><p>But pure excitement.</p><p>\"No other man has touched you,\" he snarled, his nose pressed against her skin as he breathed deep of her scent, seeking to calm his animal.</p><p>She shivered, her head pressing into the pillow to arch her neck in unconscious invitation.</p><p>\"How can you be so certain?\"</p><p>\"Because you're mine.\" He soothed his bite mark with tender kisses before heading downward. \"You even taste like you're mine,\" he murmured, trailing his tongue down to the tip of her nipple.</p><p>Ashe moaned, her fingers shoving into his hair. \"What does that mean?\" she demanded.</p><p>\"You taste of sunshine,\" he whispered, his tongue continuing to tease the hard nub, \"and rich, fertile earth, and magic. You taste of home.\"</p><p>Her eyes squeezed shut, a flush staining her cheeks. \"What are you doing to me?\"</p><p>\"Nothing you don't want, ma chere,\" he promised, his lips tracing a gentle path of kisses to her stomach. \"Mine,\" he murmured, his superior senses already able to detect the tiny babe in her womb.</p><p>Whispering a soft hello, he shoved himself off the bed, ridding himself of his clothes with a minimum of fuss, relishing the sensation of her avid gaze taking in the hard muscles of his naked body and the tattoo on his upper chest. He paused, taking a heartbeat to simply appreciate the sight of Ashe stretched across the mattress, her slender body painted in silver moonlight and her dark hair spilled across the sheet.</p><p>Like an exquisite sacrifice to the gods.</p><p>Then, placing a knee on the edge of the bed, he bent down to kiss the sensitive arch of her foot before nibbling each tiny toe.</p><p>She gave a choked groan as he slowly explored up her calf, relishing the intoxicating smell of her arousal perfuming the air.</p><p>With a low groan she restlessly stirred on the sheets, and Raphael grasped her hips, holding her still.</p><p>He intended to feast on her, making her scream with pleasure before he was done.</p><p>Giving her a punishing nip, he worked his way upward, spreading her legs as his cat gave a low snarl of anticipation.</p><p>\"Raphael.\" Her fingers clenched in his hair as his tongue discovered her moist heat.</p><p>He slid his hands beneath her hips, finding the perfect angle before returning to his single-minded task.</p><p>Lapping at her cream, Raphael savored her sweetness, dipping his tongue into her tight little passage.</p><p>Holy hell. Her taste was intoxicating. Better than the finest wine.</p><p>He stroked back to the top of her clit, finding her tiny bundle of pleasure to suck between his lips.</p><p>Her hips bucked upward, her hands tugging at his hair as her moans became shortened pants.</p><p>He could taste her nearing climax on his tongue, making his cock twitch in protest.</p><p>As tempting as it might be to stroke her to completion, he needed more.</p><p>He wanted to look her in the eye as he thrust deep inside her, completing the most intimate connection possible between lovers.</p><p>With a last, lingering lap of his tongue, Raphael surged upward, claiming her mouth in a kiss of stark hunger. He would never have his fill of her.</p><p>Never.</p><p>Her legs wrapped instinctively around his waist in a silent offering and Raphael gave a rough groan. He was quivering with the need to slam his cock into her, pounding them both to a swift, satisfying climax, but he was acutely conscious that she was far more fragile than a Pantera female.</p><p>He had to be careful.</p><p>Peering deep into her dazed eyes, he pressed the head of his cock at her entrance, halting to appreciate the sensation of her moist flesh wrapped around his crown.</p><p>Oh, hell. He could come just like this, it felt so good.</p><p>Beneath him, Ashe whimpered, her nails digging into his upper arms as she struggled to tug him closer.</p><p>\"Why are you stopping?\" she pleaded. \"I need you.\"</p><p>\"Easy, ma chere,\" he murmured. \"I don't want to hurt you.\"</p><p>\"You won't...oh god...\"</p><p>She lifted her hips, taking another inch of his throbbing erection inside her. They both groaned, the air spiced with the musky scent of his cat who was dangerously close to the surface.</p><p>This was a Pantera at his most primitive, stripped of the layer of civilization that gave him the appearance of being human.</p><p>He slid his hands beneath her shoulder blades, lowering his head to claim her lips even as he thrust forward and claimed her with his steel-hard erection.</p><p>With him buried to the hilt, they clutched at one another, the pleasure rolling over them in searing waves.</p><p>\"You have enthralled me,\" he breathed as he slowly pulled out of her to surge back with a roll of his hips. She gave a startled gasp that was choked off as the swelling excitement held them in sexual thrall. \"I am yours.\"</p><p>Scattering kisses over her damp face, he drove himself into her heat, keeping the pace relentless, but gentle. Man, he wanted this to last all night, but already he could feel the building pressure of his orgasm. Burying his face in the curve of her neck, his fingers flexed against her back, his nails unconsciously digging into her tender flesh.</p><p>He was lost.</p><p>Lost in the overwhelming sensation of her pussy clenched tight and hot around his surging cock.</p><p>Continuing his relentless pace, he waited for her to tense beneath him, the sound of her thundering heartbeat echoing inside him with a pagan rhythm.</p><p>Still it wasn't until she gave a soft cry of release that he unleashed his cat, unknowingly using his claws to slice through her skin, marking her on a most primal level.</p><p>With one last thrust he buried himself until his balls were flush against her ass and allowed his climax to smash into him with mind-numbing force.</p><p>God. Damn.</p><p>Was the world still spinning? It felt as if it must have come to a shuddering, cataclysmic halt.</p><p>Raising his head, he studied Ashe's sated expression, a smile of smug satisfaction curving his lips.</p><p>The scent of lust and his personal musk was thick in the air, along with...</p><p>Blood?</p><p>With a stunned sense of disbelief, he turned to the side, rolling her over so he could inspect the scratches that marred the satin skin of her upper back.</p><p>Marks made by claws, not human nails.</p><p>They weren't deep, but he knew beyond a shadow of a doubt that they would leave four silver lines on each shoulder that would forever claim her as his mate.</p><p>No. It wasn't possible.</p><p>A Pantera couldn't shift unless they were in the Wildlands.</p><p>Their eyes glowed in the dark, or when their emotions were aroused, and they produced a musk that was directly connected to their cats. But they couldn't actually change body parts.</p><p>So what the hell had just happened? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>RAPHAEL didn't try to prevent Ashe from lying back on the mattress, a frown chasing away her earlier glow of post-coital bliss as she regarded him with a wary suspicion.</p><p>\"What was that about?\"</p><p>\"This is madness,\" he muttered.</p><p>\"I agree.\" Her chin tilted to a defensive angle, yanking the sheet over her body still flushed from her recent climax. \"Sex with a stranger who says he's not even human is most certainly madness. Even worse, I'm now stuck with an unwanted pregnancy.\"</p> <p>His stunned reaction to yet another impossibility becoming possible was shattered by her stark words.</p><p>While he'd been reeling at the sight of his mating marks, she'd been left feeling raw and exposed by their explosive passion. He should have been cuddling her close and assuring her that she was precisely where she belonged.</p><p>In his arms.</p><p>Now she was scrambling to resurrect her protective walls.</p><p>Christ, could he fuck up the situation any worse?</p> <p>He leaned on his elbow, meeting her guarded gaze with an expression of open concern.</p><p>\"You don't want the baby?\"</p><p>Her defiance faltered, something heartrendingly vulnerable visible in the depths of her dark eyes.</p><p>\"I...haven't had time to think about it.\"</p><p>His hand moved to cautiously touch her lower stomach, struggling against the sudden, brutal fear that she might actually do something to end the pregnancy.</p><p>\"Ashe, I'm not exaggerating when I say this is a miracle,\" he said softly, not minding the edge of pleading in his voice. His child might very well prove to be the savior of the Pantera. \"My people-\"</p> <p>His words came to abrupt halt as he tensed, turning his head toward the door.</p><p>\"What is it?\" she demanded.</p><p>\"I'm not sure.\"</p><p>With a fluid movement he was off the bed and pulling on his jeans and T-shirt before moving silently across the room.</p><p>He pressed his ear to the door, his heightened senses picking up the unmistakable scent of two human males walking up the steps and the metallic tang of the guns they carried.</p><p>It wasn't the stench of their weapons, however, that made his cat snarl in warning.</p><p>There was something...off in their smell.</p><p>Not drugs or disease.</p> <p>But a sour smell that was just wrong.</p><p>Without hesitation he spun on his heel and headed back across the room. He didn't know who the hell these men were, but he wasn't hanging around to find out.</p><p>Not when his mate and child needed his protection.</p><p>Reaching the bed, Raphael leaned down to wrap the sheet around a startled Ashe, scooping her off the mattress and cradling her against his chest as he headed toward the open window.</p><p>\"What the hell are you doing?\" she rasped, futilely battling against the sheet tangled around her limbs.</p><p>\"We're leaving.\"</p><p>\"But I'm-\"</p><p>He covered her mouth with his hand, bending down to whisper directly in her ear.</p><p>\"Shh. We need to get out of here. Now.\"</p><p>She tensed in his arms. \"You're scaring me.\"</p><p>\"I'm not going to let anything happen to you.\" The words were a vow that came from his very soul. \"Hold on.\"</p><p>Her eyes widened as he held her out the window, and she belatedly realized his intent.</p><p>\"No,\" she choked as he gave a shove with his feet and they were falling through the air.</p><p>He landed softly, keeping her tightly pressed against his chest as he allowed his senses to search the darkness.</p><p>Only when he was certain that there were no strangers lurking in the alley did he jog toward a nearby side street, heading south of town at a speed that could never be mistaken for human.</p><p>Right now he didn't care if he exposed his superior skills or not. He needed to get Ashe somewhere safe.</p><p>Still struggling to get her arms free so she could no doubt punch him in the face, Ashe at last gave a hiss of frustration.</p><p>\"Dammit, let me down.\"</p><p>\"Not until we're safe.\"</p><p>\"Safe from what?\"</p><p>He met her narrowed black eyes, knowing nothing he said was going to make her happy.</p><p>\"I'm not sure.\"</p><p>\"You're dragging me naked through town in the middle of the night and you're not sure why?\"</p><p>\"That about sums it up.\"</p><p>\"Sums it up?\" She kicked her feet in fury. \"Take me back to the hotel.\"</p><p>\"Not a chance in hell.\"</p><p>\"I'll scream. I-\" She bit off her words as he reached the outskirts of town, jogging along the edge of the swamp before heading straight for The Cougar's Den. \"Why did you bring me here?\"</p><p>He ignored her question, heading up the back stairs and slamming his fist against the steel door.</p><p>There was a tense wait as security checked him out on the monitors, then the door was finally shoved open to reveal a furious Bayon.</p><p>\"What the hell are you doing?\" the younger Pantera snarled, glaring at the female in Raphael's arms.</p><p>Raphael stepped past his friend, entering the storage room of the bar.</p><p>\"Make sure we weren't followed,\" he commanded.</p><p>For a moment Bayon bristled, as if he might demand an explanation. Then, muttering something about crazy cats in heat, he slipped out the door and melted into the shadows.</p><p>Tightening his hold on a still furious Ashe, Raphael crossed the storage room to kick the edge of the wooden shelves, watching the wall swing inward to reveal the secret chambers hidden behind the bar.</p><p>He halted in the communal room, where the Pantera visiting the area could gather in private.</p><p>It wasn't fancy. Nothing more than two overstuffed sofas and a handful of padded chairs sturdy enough to endure the roughhousing that came with a race of people who were cats at heart.</p><p>It was, however, the only place they could talk in privacy.</p><p>The attached room was dedicated to high-tech security that kept watch on the fringes of the swamp, monitoring everything and everyone who entered the bayous, while the upper story was set aside for private bedrooms.</p><p>There was no way in hell he was going to take Ashe to another room that included a bed.</p><p>Not until he was convinced there was no threat.</p><p>Gingerly setting Ashe on her feet, Raphael stepped back, but not before she managed to take a swing, clipping him on the chin.</p><p>\"How dare you kidnap me?\" she snapped, covering her seething fear behind rage.</p><p>Rafael rubbed his chin. More to give her the satisfaction of believing she'd hurt him than in any true pain.</p><p>\"I'm going to protect you and my child whether you want me to or not.\"</p><p>She tugged the sheet until it was wrapped tightly over her breasts, her hair spilling over her bare ivory shoulders like a river of ebony.</p><p>\"Protect me from what?\"</p><p>\"That's my question,\" Bayon interrupted, stepping into the room and folding his arms over his chest.</p><p>Instinctively, Raphael moved to stand protectively at Ashe's side.</p><p>\"Ashe, this is Bayon,\" he said, his warning gaze never leaving Bayon's grim expression.</p><p>\"He's a-\"</p><p>She didn't need to finish the question for Raphael to know what she was asking.</p><p>\"Pantera. Yes.\"</p><p>Bayon scowled. \"Shit, you told her?\"</p><p>Feeling Ashe shiver, Raphael wrapped an arm around her shoulder and tugged her close.</p><p>\"She carries my child.\"</p><p>Bayon hissed in shock as Ashe's back was exposed, revealing the rapidly healing scratches.</p><p>\"And your mark.\" Bayon gave a disbelieving shake of his head. \"Dammit, Raphael. What the hell is going on?\"</p><p>\"The question is open for debate.\"</p><p>\"Yeah, and until we can find out the truth, you shouldn't have brought her here. She can't be trusted.\"</p><p>\"I can't be trusted? Is that a joke?\" Ashe broke into the argument, her eyes flashing fire. \"I didn't emit some sort of lust odor to get an unsuspecting woman pregnant and then mess with her mind before kidnapping her.\"</p><p>Bayon's brows snapped together. \"Why did you come here that first night?\"</p><p>Ashe stiffened. \"It's none of your business.\"</p><p>Bayon took a step forward. \"Who sent you?\"</p><p>\"No one sent me.\"</p><p>\"Then why were you here?\"</p><p>\"I was paying my mother's bar tab. She's the town drunk,\" Ashe snapped, seeming to realize that the stubborn Pantera wasn't going to let it go. \"Satisfied?\"</p><p>\"Not even close.\"</p><p>Bayon reached out a hand and a red mist clouded Raphael's mind. He didn't truly believe his friend meant to harm Ashe, but it didn't matter.</p><p>Between one beat of his heart and the next, he had Bayon pinned to the wall, his forearm pressed against the man's throat.</p><p>\"Don't. Touch. Her,\" he warned, the air prickling with the threat of violence. \"She's innocent.\"</p><p>Bayon stilled, accepting that he'd pressed Raphael too far.</p><p>\"You can't be certain.\"</p><p>\"Yes. I can.\"</p><p>\"How?\"</p><p>Raphael held his friend's gaze, allowing him to see the truth in his eyes.</p><p>\"Because she's mine.\"</p><p>Bayon scowled, but a hint of uncertainty flashed through leaf green eyes.</p><p>\"That's impossible.\"</p><p>\"We can argue about it later.\" Raphael forced himself to lower his arm and step back. \"For now I need your skills.\"</p><p>Bayon cast a swift glance toward the tense Ashe before returning his attention to Raphael and offering a slow nod.</p><p>\"For what?\"</p><p>\"I caught the scent of two men entering the hotel.\"</p><p>Bayon blinked. \"Is that the start of a bad joke?\"</p><p>\"They were armed.\"</p><p>\"Everyone in this godforsaken town carries a gun.\"</p><p>Raphael shook his head. \"Not enough to start World War III.\"</p><p>\"They could have been poachers,\" Bayon pointed out with a shrug.</p><p>\"They smelled...\"</p><p>\"What?\"</p><p>\"Wrong.\"</p><p>Bayon held Raphael's gaze as they both recalled the warning from Parish, the leader of the Hunter Faction, that there'd been reports of Pantera running across humans with scents that repelled their inner cats.</p><p>Parish had been certain they were attempting to spy on the Wildlands.</p><p>Now Bayon gave a sharp nod. \"I'll check them out.\"</p><p>Waiting for his friend to shut the door behind his retreating form, Raphael moved to stand directly in front of Ashe.</p><p>He didn't for a second believe her momentary silence and stoic expression were a sign of resignation. Unfortunately he had to make a call to the Wildlands to warn them to put extra guards on the borders.</p><p>\"I need you to stay here,\" he said, trying to console his raw nerves with the knowledge that there was no way she could escape even if she wanted to.</p><p>The locks were specifically designed to only respond to the touch of a Pantera. They wouldn't budge for a human.</p><p>She frowned, clutching the sheet with a white-knuckled grip. \"Where are you going?\"</p><p>\"To call...a friend.\"</p><p>\"And you expect me to wait here?\" She glared at him with a seething fury. \"Do you think a few bouts of hot sex have given me Stockholm syndrome?\"</p><p>Lowering his head, he claimed her lips in a kiss of sheer frustration.</p><p>All he wanted to do was sweep her into his arms and carry her to his homeland where they could celebrate the new life they'd created.</p><p>Instead he was plagued with a growing fear that an unseen danger was lurking just out of sight.</p><p>\"Just stay here and behave yourself.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>ASHE was still reeling as Raphael left through a narrow door on the far side of the room.</p><p>Of course, she'd been reeling since the doctor had called with the shocking news of her pregnancy.</p><p>That was one of the reason's she'd gone to the hotel instead of trying to convince her mother to let her return home.</p><p>She'd needed a few hours to consider her options in private.</p> <p>But instead of a few hours of peace, she'd been accosted by the man who'd impregnated her, discovered he was a creature she'd long believed to be a myth, seduced all over again and kidnapped.</p><p>She grimaced as she lifted her fingers to lips that still tingled from his touch.</p><p>Okay. Maybe it wasn't entirely fair to claim he'd seduced her.</p><p>She'd all but begged him to ease the desire that had been on a slow simmer for the past six weeks.</p><p>And if she were honest, she'd admit that her treacherous body was ready and eager to repeat the performance.</p> <p>Which was precisely why she needed to get the hell away from the disturbing man.</p><p>No...not man.</p><p>Pantera.</p><p>Beast.</p><p>Absently she reached over her shoulder to touch the scratches that had seemed to shock Bayon. They didn't hurt. In fact, they tingled with a pleasure that was as disturbing as the implication that Raphael had deliberately marked her.</p><p>Yeah. She was in dire need of some space to clear her head.</p> <p>Crossing to where they'd first entered the room, she placed a cautious hand on the silver doorknob.</p><p>She didn't know what she'd expected.</p><p>Ringing alarms. A trap door opening to drop her into a pit of alligators. An electric shock.</p><p>Something to prevent her from leaving the private rooms.</p><p>But stepping into the back storage area, there was nothing to break the silence beyond the thundering beat of her heart.</p><p>Still, she remained on edge as she tiptoed to the outer door. It was quite possible a silent alarm had been activated. Or that there would be guards outside that she hadn't noticed when she'd first arrived with Raphael.</p><p>And, of course, there was the mysterious danger that Raphael insisted was stalking him.</p><p>Until she was far enough away from the bizarre creatures she would have to take extra care.</p> <p>Surprised yet again when the door opened easily, Ashe crouched low as she darted down the steep staircase, and headed directly toward the cars that lined the narrow street.</p><p>She shivered, feeling a strange chill of premonition. As if unseen eyes were following her every movement.</p><p>Damn. She needed to get back to the hotel.</p><p>She was going to get dressed, get her car keys and head out of this town as fast as possible.</p><p>After that...</p><p>Well, she'd worry about that once she was far, far away.</p><p>Pausing to tuck the sheet tighter around her body, Ashe sucked in a deep breath and gathered her shaken courage.</p><p>She'd endured a childhood of neglect interspersed with episodes of terrifying violence from a mother who'd never loved her. She'd been humiliated and bullied throughout school. She'd been forced to work as a secretary for a bastard who couldn't keep his hands to himself, just to keep a roof over her head.</p><p>She had truly discovered the meaning behind 'what didn't kill you only makes you stronger'.\"</p><p>Now she stiffened her spine and gave one last glare toward the shabby bar that glowed in the neon lights.</p><p>\"Behave myself?\" she muttered. \"Not in this lifetime.\"</p><p>Kicking the folds of the sheet away from her bare feet, she turned to gaze at the untamed edge of the swamp across the street. She had no genuine desire to wade through the muck, not to mention risking the endless dangers that haunted the bayous. But she couldn't walk down the streets in a sheet without attracting unwanted attention, not even in this podunk town.</p><p>She would have to skirt the swamps until she was closer to the hotel.</p><p>The decision made, she dashed across the road, grimacing as the gravel dug into the soles of her feet. God almighty. Would this night ever end?</p><p>The thought had barely formed when a strange buzzing flew past her ear. She waved an impatient hand, assuming it was one of the humongous bugs that filled the night air.</p><p>Some grew to the size of small birds.</p><p>It wasn't until there was an audible thwack in a cypress tree just behind her that she turned her head to stare at the arrow stuck in the trunk.</p><p>She stumbled to a baffled halt.</p><p>It wasn't that unusual for the locals to hunt with bow and arrow.</p><p>Some preferred following in the traditions of their forefathers. Some preferred the challenge of hunting old-school. And some just didn't have the money to buy a gun.</p><p>But who would be out hunting this time of night?</p><p>And why would they be so close to town?</p><p>Stupidly, it wasn't until the second arrow clipped the top of her shoulder as it whizzed past that she accepted that she was the prey, not some hapless rabbit.</p><p>Shit. Shit. Shit.</p><p>She hadn't thought Raphael's buddies would actually try to kill her.</p><p>Unless it wasn't his friends, but his supposed enemies?</p><p>But why would they shoot at her?</p><p>Not that the who, what or where mattered at the moment.</p><p>With a muffled cry she darted toward the nearest clump of bushes, kneeling down to peer through the thick branches.</p><p>It was too dark to see more than vague outlines of shapes. She thought she could see something running along the roof of the closed lumberyard, and...was that someone creeping between those trucks?</p><p>Oh god.</p><p>For a crazed second, panic threatened to overwhelm her.</p><p>She had no phone, no clothes, no weapons that could help protect her.</p><p>Worse, she didn't know if a scream would bring help or more danger.</p><p>Then her hand unconsciously slid to her stomach, a protective burst of determination stiffening her spine.</p><p>Dammit, she wasn't going to wait here like a sitting duck.</p><p>She had a child to protect, which meant she had to get away.</p><p>Wrapping the bottom of the sheet around her arm so it was above her knees, she scooted backward. If she could reach the actual bayou she had a chance of shaking the bastards.</p><p>She ignored the sound of approaching footsteps, and the strange smell that made her nose curl in disgust. Her only hope of survival was slipping away before her stalker could pinpoint her precise location.</p><p>Concentrating on backing away as silently as possible, Ashe froze when a low, enraged snarl reverberated through the air.</p><p>It was the sort of full-throated roar that caused a terrified hush to spread through the area.</p><p>A feral predator on the hunt.</p><p>Barely daring to breathe, Ashe listened as she heard a muttered curse from just beyond the bush and the sound of rustling, followed by the unmistakable click of a gun. Either the person wasn't the same psycho Robin Hood who'd been flinging arrows in her direction, or he'd decided that approaching danger was worth pulling out the big guns.</p><p>Literally.</p><p>But, even as she prepared herself for the deafening blast of the gunshot, there was another snarl and a blood-chilling scream that she knew beyond a shadow of a doubt would haunt her dreams for nights to come.</p><p>Barely realizing she was moving, Ashe straightened to peer over the top of the bush. It wasn't so much a desire to see what was happening. Hell, no. She had a hideous suspicion it was going to be awful. But she needed to make sure the stalker was too busy fighting off the rabid animal to notice her escape.</p><p>She needn't have worried.</p><p>The man who'd been standing by the bush wasn't going to be firing arrows at her or anyone else.</p><p>Paralyzed, Ashe's gaze roamed over the man who was now sprawled on the ground, his throat ripped out and his face mangled. His dead eyes stared sightlessly at the star-studded sky, his arms flung wide with a gun in one hand and his empty bow in the other.</p><p>She gagged, a hand pressed to her mouth as her stomach threatened to revolt against the grisly sight.</p><p>She'd never seen a dead man before.</p><p>Especially not one who had been mauled by a wild animal.</p><p>Then her shattered disbelief was distracted as a sleek form detached from the shadows, gliding toward her with an uncanny silence.</p><p>\"No,\" she breathed, taking in the sight of the large cat in stunned amazement.</p><p>The color of rich caramel, the fur was thick and glossy in the moonlight. The broad head had small rounded ears and large golden eyes that studied her with an unnerving intensity. His body was chiseled muscle with long legs and a tail that was tipped with black.</p><p>Any other time she would have found the animal a beautiful sight.</p><p>Lethal certainly, and due proper respect, but...beautiful.</p><p>This wasn't any other time, however, and facing the deadly predator with his most recent kill mangled on the ground between them only ratcheted up her fear.</p><p>She held out her hand. Like that was going to help.</p><p>\"Stay back.\"</p><p>\"Ashe?\" She jerked at the sound of her name being called, turning to watch Bayon appear from behind the large cat. The male came to a sharp halt as the animal whirled to hiss at him in warning. \"Holy shit.\" His gaze focused on Ashe as she took a step toward him, giving a fierce shake of his head. \"No, don't move. He won't hurt you.\"</p><p>\"How do you know?\" she demanded, her voice as shaky as her nerves. \"Is this your pet?\"</p><p>\"Pet?\" A humorless smile twisted his lips. \"No.\"</p><p>\"Then how do you know he's not going to hurt me?\"</p><p>\"He's trying to protect you.\"</p><p>Her heart slammed against her chest as a disturbing suspicion began to form in the back of her mind.</p><p>\"A wild animal is trying to protect me?\" she tried to scoff. \"Yeah right.\"</p><p>Bayon held her wary gaze. \"He may be wild, but he's not entirely an animal.\"</p><p>\"Don't.\" She turned her attention toward the cat who had moved to stand directly between her and Bayon. It was one thing to be told of humans who could transform into pumas and another to see it in the flesh. Literally. \"You can't seriously expect me to believe that...that creature is Raphael?\"</p><p>The green eyes blazed with sheer male aggravation. \"It doesn't matter what you believe.\"</p><p>\"But-\"</p><p>\"Who was that man?\" he interrupted her protest.</p><p>She grimaced, reluctantly turning her gaze to the bloody corpse. \"I don't have a clue. I assumed he was a friend of yours.\"</p><p>\"No.\" Without warning, Bayon leaned forward to spit on the dead man. \"Tell me what happened.\"</p><p>Yikes. So not a friend.</p><p>\"I...decided to return to the hotel.\"</p><p>He narrowed his gaze. \"And Raphael just let you go?\"</p><p>She tilted her chin. Arrogant ass.</p><p>\"I didn't have to ask for his permission.\" She met him glare for glare. \"Or yours.\"</p><p>He went rigid, seemingly startled by her words. \"You opened the doors?\"</p><p>\"Of course I did. I'm not helpless.\"</p><p>He studied her with a disturbing intensity. \"The locks are specifically designed to respond only to Pantera. They should never have opened for you.\"</p><p>She frowned, recalling her own amazement that her escape had been so easy.</p><p>Was it possible...</p><p>No.</p><p>God. She was so tired she couldn't even think straight.</p><p>\"Then they must have been left unlocked,\" she said, her tone warning she was a breath away from snapping.</p><p>He hesitated, as if he wanted to press her, but meeting her panicked glare, he at last gave an impatient wave of his hand.</p><p>\"What happened next?\"</p><p>\"I was trying to get back to the hotel without everyone realizing I was waltzing through town in just a sheet when this...\" She waved a hand toward the corpse. \"Whack job started shooting arrows at me.\" She shook her head. \"I mean, who uses a bow and arrow when you have a gun?\"</p><p>\"Someone who wants to kill without attracting unwanted attention.\"</p><p>Her breath tangled in her throat. Oh. Yeah. Good point.</p><p>She shivered, vividly aware of how close she'd come to death.</p><p>\"I was trying to sneak away when I heard a roar and-\" Her words trailed away as she glanced toward the puma staring at her with glowing golden eyes.</p><p>\"Raphael?\" Bayon helpfully supplied, his own gaze trained on the big cat.</p><p>\"He attacked.\"</p><p>Bayon shook his head. \"Astonishing.\"</p><p>\"Astonishing?\" She made a choked sound. \"A man is dead.\"</p><p>He lifted his head to stab her with a fierce glare. \"A man trying to kill you. Would you rather Raphael had allowed him to finish his task?\"</p><p>No. The answer came without hesitation, her hand once again pressing against her belly. To protect her child she would have done anything.</p><p>Including killing the man herself.</p><p>She shuddered, unthinkingly stepping toward Bayon. She might not trust him, but she desperately needed a hot bath, a warm bed and a return to sanity.</p><p>Instantly the puma turned, opening his mouth to display his impressively sharp teeth.</p><p>\"No,\" Bayon snapped. \"Stay there.\"</p><p>She scowled in frustration. \"If it's Raphael then why is he keeping me trapped here?\"</p><p>\"He's keeping me away from you.\"</p><p>\"I thought you were friends?\"</p><p>\"We are, but his beast is convinced you're his mate and he won't willingly allow another male near you.\"</p><p>Mate.</p><p>She pressed her fingers to her throbbing temple. \"God...this can't be happening.\"</p><p>\"You have no idea,\" Bayon muttered.</p><p>\"What's that supposed to mean?\"</p><p>\"A Pantera can only shift when we're in the Wildlands.\"</p><p>Ashe stared at him in confusion. She was still trying wrap her brain around the whole 'shifting' thing.</p><p>\"This town is part of the Wildlands?\"</p><p>\"No.\"</p><p>\"Then I don't understand.\"</p><p>\"Neither do I.\" There was a dangerous edge in his voice. \"But I intend to find out.\"</p><p>Keeping his gaze trained on the cat, Bayon began to whisper in an unfamiliar language, the haunting words resonating deep inside her, like a bell being struck.</p><p>Ashe bit her lip, ignoring the terrified voice in the back of her head that urged her to flee while Bayon was distracted.</p><p>Where would she go?</p><p>Certainly nowhere that she wouldn't be constantly looking over her shoulder for fear there might be an arrow trained at her back.</p><p>Besides, she couldn't avoid the truth any longer.</p><p>Raphael was a mythical Pantera and no amount of denial was going to change the fact.</p><p>Or the chance that the child she carried was going to be one as well.</p><p>She had to find out as much as possible about these mysterious people if she was going to keep her child safe.</p><p>Inching away from the body lying lifeless on the ground, she watched with a growing fascination as Bayon lowered himself to his knees and continued to whisper as he looked directly into the eyes of the beast.</p><p>Ashe felt a breathtaking surge of electricity dance over her skin, then her eyes widened as she watched a silver mist form around the puma, nearly disguising the sight of the limbs twisting and elongating, the fur seeming to melt as if by magic.</p><p>Fascinated, she took several steps closer, unable to tear her gaze away.</p><p>It was odd. She would have assumed watching an animal shift into a man would be revolting.</p><p>Instead it was...poignantly moving.</p><p>How many people could say they witnessed magic with their own eyes?</p><p>The mist dissipated, leaving behind an unconscious, and extremely naked, Raphael.</p><p>\"Oh.\" She furtively licked her lips. \"Where are his clothes?\"</p><p>\"This wasn't a natural shift. When I force a Pantera to change from human to cat, or cat to human, my magic strips him down to his most basic form. Clothing, jewelry, sometimes even tattoos are lost in the transition.\"</p><p>Still caught in a sense of wonder, Ashe watched in silence as Bayon grabbed his friend around the waist and with an unbelievable display of strength heaved his limp body over his shoulder.</p><p>Rising to his feet, he spared Ashe an impatient glance. \"Let's go.\"</p><p>She flipped him off behind his back, but she obediently followed him back to The Cougar's Den.</p><p>Her decision had been made.</p><p>She would stay with Raphael until she could be absolutely certain her child was safe.</p><p>After that...</p><p>She shook her head, hitching up the sheet as she climbed the stairs leading to the back of the bar.</p><p>Right now it was enough to take it day by day.</p><p>Hell, it was enough to take it minute by minute.</p><p>Bayon led them back through the storage area and into the hidden room she'd been in before, but he never paused as he continued through a door at the back that led to a narrow staircase.</p><p>She grimaced, feeling an odd sense of deja vu as they headed to the top floor. A feeling that only intensified as he entered one of the rooms that lined the long hall.</p><p>Absently walking toward the double bed in the center of the wood-planked floor, she barely paid attention to Bayon as he slid the still unconscious Raphael off his shoulder and onto the mattress.</p><p>This was the room she'd been in over a month ago.</p><p>She was certain of it.</p><p>There was a foggy memory of the hand-carved headboard that matched the wooden rocking chair in the corner. And the paintings of graceful plantation homes that were framed and hung on the walls. And of course, the patchwork quilt that covered the bed...</p><p>Sorting through her vague recollections, Ashe sensed Bayon step toward her, but it wasn't until she felt something cold snap around her wrist that she realized her danger.</p><p>With a gasp, she glanced down to discover that she'd been handcuffed to the sturdy headboard</p><p>The jackass.</p><p>\"What the hell?\" she growled, glaring into his impassive face. \"I'm not going run again.\"</p><p>\"No, you're not.\"</p><p>With those words he headed toward the door.</p><p>\"Wait.\" She tugged at the metal bracelet holding her captive, achieving nothing more than a painful welt on her wrist. \"Let me out of this thing.\"</p><p>He didn't even bother to acknowledge her plea as he stepped out of the room and closed the door.</p><p>\"Bastard.\"</p><p>Cursing the day from hell that refused to end, Ashe awkwardly climbed onto the bed. She was too weary to work up a proper fury.</p><p>Not that she was the forgive-and-forget type.</p><p>Next time she crossed paths with Bayon she was going to kick him in the nuts.</p><p>Managing to keep the sheet wrapped around her, she moved until the handcuff wasn't biting into her skin and turned her attention to the man sprawled in the middle of the mattress.</p><p>Did they always pass out after shifting back to human?</p><p>It didn't seem very efficient.</p><p>Or had he been hurt?</p><p>Leaning to the side, she inspected the bronzed perfection spread over the quilt.</p><p>Her mouth went dry as she tried to concentrate on searching him for injuries. She'd never seen a man so magnificently...proportioned.</p><p>A broad, chiseled chest. Powerful shoulders. Washboard abs. Long, muscular legs. And a huge...</p><p>Yeah. Magnificently proportioned.</p><p>Her gaze moved back to his chest, lingering on the stylized tattoo that resembled a puma crouched to pounce.</p><p>She had a hazy memory of exploring that tattoo with her tongue the first night they'd shared this bed.</p><p>Did it have a special meaning?</p><p>Raphael made a low sound, his head turning in her direction. Without thought, she reached out to brush the silken golden hair from his face, her fingers tracing the prominent line of his cheekbones before moving to the lush curve of his lips.</p><p>She'd tried to fight against the sense of connection that she'd felt from the moment she'd opened her eyes to find him in her hotel room.</p><p>Now she simply savored the comfort of having him near.</p><p>No one had ever tried to protect her.</p><p>Certainly not her mother or deadbeat father.</p><p>It made her feel...cherished.</p><p>Shuffling through her unfamiliar emotions, Ashe wasn't prepared when Raphael's eyes snapped open, something that might have been panic flaring in the golden depths before he was surging up to grab her face between his hands.</p><p>\"Ashe.\"</p><p>She barely had a chance to brace herself before he was covering her lips in a kiss of stark need.</p><p>\"Raphael,\" she muttered, when he at last lifted his head so she could breathe.</p><p>\"I thought I'd lost you.\" He spread desperate kisses over her face before he bent down to place his mouth against her lower stomach. \"I thought I'd lost you both.\"</p><p>The heat of his lips seared through the thin sheet, and without thought she combed her fingers through the satin gold of his hair.</p><p>There was no mistaking the stark fear that continued to haunt him.</p><p>\"We're fine,\" she soothed, stroking him in a comforting motion.</p><p>\"Ashe.\" His hands brushed down her shoulders, his lips nibbling a tender path upward. \"I couldn't bear to lose you.\"</p><p>\"Raphael, I-\" Whatever she was about to say was lost in a haze of pleasure as his lips reached the edge of the sheet.</p><p>\"What?\" he whispered.</p><p>\"I don't remember.\"</p><p>He chuckled as his hands drifted down her arms, pausing when he reached the handcuff.</p><p>With a sound of surprise he lifted his head to meet her darkening gaze.</p><p>\"What's this?\"</p><p>She made a sound of disgust. \"Your pain-in-the-ass friend was afraid I might try to escape again.\"</p><p>\"But the locks...\" His gaze narrowed as he belatedly remembered she'd escaped before. \"How the hell did you get out of here?\"</p><p>She rolled her eyes. Like she knew?</p><p>\"I just walked out.\" She shook her arm, making the handcuff rattle. \"Get this off me.\"</p><p>A slow, wicked smile curved his lips. \"I think we should leave it in place for now.\"</p><p>A treacherous heat flared through her body. \"Don't tell me you're kinky?\"</p><p>\"Desperate,\" he corrected, his smile fading as his eyes smoldered with a naked hunger. \"I need to be inside you, ma chere,\" he said with blunt honesty. \"My cat needs to know I haven't lost you. Say yes.\"</p><p>Ashe shuddered at the simple plea. She found it oddly erotic to know just how much he wanted her. It gave her a sense of power that she rarely experienced.</p><p>\"Yes.\"</p><p>He hissed, as if he was caught off guard by her ready capitulation, and then with a slow motion he was pulling open the ends of the sheet.</p><p>She forgot how to breathe as the night air hit her skin, her heart pounding as his fingers gently cupped the small firmness of her breasts.</p><p>\"Beautiful,\" he muttered, stroking his thumbs over the hard points of her nipples.</p><p>Ashe knew she wasn't beautiful.</p><p>Her own mother had lamented the thick dark hair and prominent nose that Ashe had inherited from her father. And then there was her body that was too skinny, and her skin too pale.</p><p>But beneath his predatory gaze she felt beautiful.</p><p>Snarling deep in his throat, Raphael turned her until his lips could stroke down the sensitive scratch marks that were nearly healed on her back. His touch sent jolts of shocking arousal through her, but she made no effort to pull away.</p><p>In this moment she needed him as much as he needed her.</p><p>Turning back to face him, she boldly ran her free hand over his chest, astonished by the satin smoothness of his skin. He was completely furless. A perfect bronze velvet draped over steel.</p><p>Enjoying her exploration, Ashe barely noticed when Raphael gently arranged her against the pile of pillows, careful to keep her shackled arm above her head. Not until he bent over her to capture a nipple between his teeth.</p><p>She moaned as his tongue teased the sensitized tip, tormenting her until she was moving restlessly beneath him. Good lord. She'd never gotten so hot so quickly.</p><p>It was as if his touch had a direct connection to her libido.</p><p>\"Oh, yes,\" she moaned, arching upward as his lips traced the curve between the mounds of her breasts before moving to the other aching nipple.</p><p>Her fingers impatiently threaded through his hair. The satin strands brushed her skin, only heightening her pleasure.</p><p>\"Do you like that, ma chere?\" he breathed, his hands skimming over her hips and down her thighs. His touch was searing hot, matching the molten heat flowing through her veins.</p><p>Tugging at her nipple with the edge of his teeth, Raphael eased his hand between her legs and sought the moist heat.</p><p>She grasped the strong column of his neck, hanging on for dear life as he stroked his fingers over her clit, finding the sweet spot of her pleasure.</p><p>She was falling into a whirlpool of sensation that bordered on pain, it was so intense.</p><p>\"Raphael.\"</p><p>Easily sensing the raw edge of need in her voice, Raphael lifted his head to nuzzle his lips just below her jaw.</p><p>\"I have you...ma chere,\" he softly soothed. \"I will always have you.\"</p><p>She shivered as her hips instinctively lifted to press more firmly to his caressing finger.</p><p>\"I know.\"</p><p>He lifted onto his elbow and peered deep into her wide eyes. \"Are you ready for me?\"</p><p>For a long moment she merely gazed into his beautiful face. With his golden hair tumbled over his shoulders and the muted light playing over his stark features he looked barely civilized.</p><p>Feral.</p><p>Her lips parted, her breath coming in short pants.</p><p>\"Yes.\"</p><p>His mouth covered hers as he rolled to settle between her parted legs and impale her with one smooth thrust. He swallowed her cry of pleasure as her hips left the mattress and her nails scored down his back.</p><p>Yes. God, yes.</p><p>She grasped the headboard as he plunged in and out of her, always careful to keep his weight off her stomach.</p><p>It was swift and raw and exactly what she needed.</p><p>She was being consumed by Raphael and she couldn't make herself care. For this one priceless moment she wanted to be overwhelmed. She wanted to belong to this man on the most basic level.</p><p>Thrusting his tongue between her willing lips, Raphael fucked her with an increasing intensity. Ashe clutched at him as the pressure built to a looming crescendo.</p><p>She was perilously close.</p><p>\"Raphael.\"</p><p>\"I know, ma chere,\" he muttered against her mouth, his body pressing deeper.</p><p>Her breath came in jagged gasps as the pleasure tightened and spiraled toward a shimmering point. His strokes quickened, sinking him deep in her. At the same time, he angled his head to bite the vulnerable curve of her neck.</p><p>The pleasure/pain hit a critical point and her entire body tightened. For a breathless moment she hovered on the edge, then with explosive force the bliss shattered through her and she was soaring through paradise.</p><p>They lay in dazed astonishment for a long moment, Raphael groaning as he emptied his seed. Ashe held him tight, savoring the rare moment of absolute peace.</p><p>At last Raphael gently pulled out, cradling her face as he spread delicate kisses over her flushed cheeks.</p><p>Boneless, Ashe watched in silence as he reached into a side table to grab the key to the handcuffs. Removing the steel bracelet, he gently kissed the red mark that circled her wrist before covering both of them with the quilt.</p><p>\"That was...\" She released a shaky breath. \"Amazing.\"</p><p>He pressed a lingering kiss to her lips before pulling back to regard her with a searching gaze.</p><p>\"Why did you leave the bar after I told you to stay?\"</p><p>\"Why?\" She met his accusing gaze with a frown, her sense of contentment swiftly fading. She might be slowly accepting that her life was now tied with this male, but that didn't mean she was ever going to follow orders. \"Because I don't appreciate being held captive.\"</p><p>\"I was trying to protect you,\" he growled.</p><p>The rasp of male possession made her frown deepen. Okay, this was something that needed to be nipped in the bud.</p><p>Raphael had the sort of alpha personality that would ride roughshod over her if she didn't take a stand.</p><p>\"A protection that wouldn't have been necessary if you hadn't gotten me caught in the middle of your gang war.\"</p><p>He stiffened, his brow furrowing in confusion. \"Gang war?\"</p><p>\"That man obviously thought I was with you and wanted to make a point.\"</p><p>\"We are Pantera, not a gang,\" he said. \"And we certainly aren't at war.\"</p><p>\"Then why was that lunatic shooting arrows at me?\"</p><p>He held her gaze. \"I don't know, but it's you they're after.\"</p><p>A chill inched down her spine. \"That's ridiculous. I've lived here all my life without having people trying to kill me.\"</p><p>His hand moved to lie gently against her lower stomach. \"You weren't carrying this.\"</p><p>She studied his grim expression, the chill spreading through her body.</p><p>\"My baby?\"</p><p>\"Our baby.\"</p><p>\"But...\" She licked her dry lips. \"No one knows I'm pregnant.\"</p><p>He arched a brow. \"No one?\"</p><p>She shrugged. \"My mother, but she wouldn't tell anyone.\"</p><p>\"Not even if she was drinking?\"</p><p>She flinched as his words hit a nerve. Her mother was notoriously chatty when she was sitting on a barstool. There wasn't a person in town who hadn't heard when Ashe had her first period or when she'd been stood up on prom night.</p><p>Thankfully, people had long ago started ignoring the increasingly incoherent woman.</p><p>\"Who listens to a drunk?\" she muttered.</p><p>\"You might be surprised.\" The edge in his voice suggested he'd spent more than a few nights cross-examining an unsuspecting, inebriated fool. \"Anyone else?\"</p><p>She chewed her bottom lip, knowing the question was important. \"My doctor.\"</p><p>\"Local?\"</p><p>\"Yes.\"</p><p>\"When did you see him?\"</p><p>\"Two days ago.\" Her lips twisted in a rueful smile. It seemed a lifetime since she'd walked into the small clinic believing she was suffering from a bout of the stomach flu. \"He called earlier today with the results.\"</p><p>\"Time enough to share the information.\"</p><p>She frowned. \"With who?\"</p><p>He caught her chin in his fingers, forcing her to meet his determined gaze.</p><p>\"Until we can find out, I need to get you to the Wildlands.\"</p><p>\"The Wildlands?\" She shook her head in disbelief. Until a few hours ago the name had been nothing more than a place in legend and myth. Now he wanted her to leave her home and travel there? \"I can't.\"</p><p>\"Ashe, it's the only place you and our baby will be safe.\"</p><p>\"But-\"</p><p>Her protest was drowned out by a sudden thump on the door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>SENSING Bayon standing in the hall, Raphael muttered a curse as he leapt off the bed and headed toward the dresser.</p><p>Yanking open a drawer, he removed a pair of gray sweats, pulling on the bottoms before tossing the matching top to Ashe.</p><p>It was three sizes too large for her, but it did fall to her knees, providing a small amount of modesty.</p><p>It would have to do until he could send someone back to the hotel to pick up her suitcase.</p> <p>Pulling open the door, Raphael stepped aside to allow his fellow Pantera to enter the room, his cat keeping a watchful eye on the male to make certain Bayon didn't stray too close to his mate.</p><p>No doubt sensing Raphael's unease, Bayon remained close to the door, his pale green gaze never straying from Raphael.</p><p>\"Glad to see you back, mon ami.\"</p><p>Raphael grimaced. He was still reeling from the combination of shifting despite being away from the Wildlands and the shock of being yanked out of his animal form.</p><p>\"I assume you were the one to trance me?\"</p> <p>Bayon nodded with regret. \"Sorry I had to put you out. You were too hyped for me to convince you to return to human and I needed to get you away from the kill.\"</p><p>Raphael waved aside the apology. Although it was rare to use the words of power that would force a Pantera back to his human form, he knew his cat would never have allowed his friend near.</p><p>\"You did what you had to do.\"</p><p>Bayon folded his arms over his chest, his expression grim. \"The obvious question, is...why did I have to do it?\"</p><p>\"Damned if I know.\" Raphael's memories were hazed by the surge of adrenaline that had gripped him from the minute he'd realized Ashe had left the safety of the bar. \"I was tracking Ashe when I caught sight of the stranger.\" His voice thickened with fury. \"When I realized he was trying to skewer her with an arrow, my cat took over.\"</p><p>\"Did the stranger do anything to you?\"</p> <p>Raphael arched a brow. \"Do?\"</p><p>\"Shoot you with a poison arrow?\" Bayon asked. \"Cast a spell? Use a secret military weapon to force you to change?\"</p><p>He snorted at the moronic questions. \"It didn't have anything to do with the stranger. I changed when I came close enough to feel Ashe's aura.\"</p><p>Both men glanced toward the silent woman standing in the center of the room. Instantly she held up her hands in a gesture of innocence.</p><p>\"Hey, don't look at me. I didn't do anything.\"</p><p>\"Could it be the child?\" Bayon suggested.</p><p>Raphael frowned, considering the precise second he'd shifted.</p><p>As he'd sprinted across the dark street there had been terror that he was going to be too late. And a blinding fury that anyone would try to hurt his mate. But his last memory was the sweet smell of lush land and female magic.</p> <p>Ashe's scent.</p><p>\"I'm not a medic or a philosopher,\" he at last said with a shrug. \"All I know is that my cat decided this female was mine at first sight and it wasn't going to let anyone or anything hurt her.\"</p><p>\"Maybe the elders have some idea,\" Bayon muttered. \"We need to get her home.\"</p><p>\"My thought exactly.\"</p><p>\"Wait,\" Ashe protested. \"This town is my home, not the middle of the swamp.\"</p><p>Glaring toward Bayon, who parted his lips to demand Ashe's compliance in his usual blunt style, Raphael moved to stand directly in front of her, his finger brushing over her too-pale cheek.</p><p>\"Is it truly your home, ma chere, or somewhere that you live?\"</p><p>\"I-\"</p><p>\"The truth.\"</p><p>Their gazes locked, her dark eyes revealing the lonely, wounded child who'd been unwanted her entire life.</p><p>Until she'd walked across his path.</p><p>Now she would never, ever be lonely or unwanted again.</p><p>Cupping her cheek in his hand, he prepared to convince her just how desperately he needed her, when Bayon made a sound of impatience.</p><p>\"I hate to interrupt, but this touching scene will have to wait.\"</p><p>Raphael glared at his friend. \"Are you deliberately trying to piss me off?\"</p><p>\"It's in my job description.\"</p><p>\"No shit.\"</p><p>Reaching into his back pocket, Bayon held out a scrap of material.</p><p>\"Here.\"</p><p>\"What's this?\"</p><p>\"Open it.\"</p><p>Raphael's sensitive nose curled at the stench of rotting flesh and something else. That same 'wrongness' he'd smelled on the humans entering the hotel earlier. With reluctance, he flipped aside the folded material to reveal the patch of skin cut into a perfect six by six square.</p><p>He hissed in shock.</p><p>Not at the fact that he was holding a slab of flesh. He was a predator who'd just ripped out the throat of a man.</p><p>But at the sight of a brand that portrayed the outline of a raven with wings spread in front of a full moon.</p><p>\"Where did you get this?\"</p><p>\"I returned to dispose of the body,\" Bayon answered. \"This was branded on his lower back.\"</p><p>Beside him Ashe gave a gasp of horror. \"Oh my god, is that his skin?\"</p><p>Raphael flinched, wishing he could protect her from the darker side of his nature. Christ, it was bad enough she'd had to witness him tearing apart a man just a few feet away from her without having to endure the gruesome prize he held in his hands.</p><p>Unfortunately, this brand changed everything.</p><p>\"The Mark of the Shakpi,\" he breathed. \"This is-\"</p><p>\"Impossible?\" Bayon took the word out of his mouth. \"Yeah, there's a lot of that going around.\"</p><p>Ashe cleared her throat, struggling to hang on to her severely tested courage.</p><p>\"What is the Mark of Shakpi?\"</p><p>\"It's an ancient legend that speaks of the origin of our people,\" Bayon answered, his flat tone intended to bring an end to the conversation.</p><p>Of course Raphael's stubborn mate wasn't going to be intimidated.</p><p>\"And?\"</p><p>Raphael took charge of the story. \"The legend claims that the bayous gave birth to twins,\" he said, sharing the oral history that every Pantera learned while still in the nursery. \"Opela was able to call upon the magic of the land, eventually creating the Pantera. Her sister, Shakpi, grew jealous of Opela's love for her children and tried to create her own children to rule the Pantera. The children twisted the magic, using it for evil, and Opela had no choice but to have her sister imprisoned.\"</p><p>Ashe frowned. \"Imprisoned in the swamps?\"</p><p>He shrugged. \"No one knows where she was sent.\"</p><p>She gave a slow shake of her head. \"There are a lot of stories about the bayous.\"</p><p>\"Only one that our people believe.\"</p><p>\"So you really think some mythical woman has escaped from her secret prison and is now going around branding her personal Robin Hoods?\"</p><p>Did he?</p><p>Raphael glanced back down at the branded skin, a primitive fear lodging deep in his gut.</p><p>A part of him wanted to laugh it off as an old wives tale. As Ashe pointed out, there were a dozen stories that came out of the bayous.</p><p>But he didn't laugh.</p><p>He wasn't human. He was Pantera. A creature of magic.</p><p>And the fact that this brand was discovered when their people were unable to breed...well, it had to mean something.</p><p>\"It's one explanation,\" he murmured.</p><p>She pressed a hand to her temple, as if her head was throbbing. \"I really have fallen down the rabbit hole.\"</p><p>Raphael gave a short, humorless laugh. He felt exactly the same way.</p><p>Six weeks ago he'd been a respected diplomat for his people, in absolute control of his life.</p><p>Now he was mated to a human, expecting a child, and growing increasingly convinced his people were being hunted by an evil, ancient goddess.</p><p>Yeah, that was one hell of a rabbit hole.</p><p>Giving a shake of his head, he thrust aside his rising panic and turned his attention to Bayon.</p><p>\"The most important thing is to keep Ashe and our babe safe,\" he announced.</p><p>\"Agreed,\" his friend swiftly agreed. Then they both froze as that now-familiar scent drifted through the open window. \"Raphael.\"</p><p>\"I smell them,\" he rasped.</p><p>Bayon pulled a gun from the holster at his lower back, his eyes glowing with power.</p><p>\"Get her out of here while I distract them.\"</p><p>Raphael didn't bother to argue. Not only would it be pointless to try and keep Bayon out of a fight, but his duty was to protect Ashe and the child she carried.</p><p>Moving forward he laid a hand on his friend's shoulder. \"I'll meet you back at the Wildlands. Take care.\"</p><p>\"And you.\" Bayon flashed a smile of anticipation before he was running across the room and leaping out of the window with reckless valor.</p><p>Raphael returned to his mate's side, staring down at her frighteningly pale face.</p><p>She'd been through hell and back in the past six weeks. More than anyone should have to endure. Let alone a pregnant woman.</p><p>His heart clenched with regret. God dammit, he had to get her somewhere safe.</p><p>\"Ashe, will you trust me?\" he asked.</p><p>\"Yes.\"</p><p>Something connected inside him at her swift, unhesitating agreement. A sense of completion, as if two separate pieces had just clicked together to form a perfect whole.</p><p>He paused just long enough to savor the unexpected sensation before leaning down to scoop Ashe off her feet.</p><p>\"Don't make a sound,\" he whispered next to her ear.</p><p>Barely giving her time to wrap her arms around his neck, Raphael moved toward the door, glancing down the hall as he used his senses to search for enemies.</p><p>Below them he could hear the scramble of Pantera to meet the unexpected threat outside. Which meant the attackers would be occupied. At least for a few minutes.</p><p>Holding Ashe tight against his chest, Raphael darted down the hall and shoved open the door that led to a maintenance closet. He locked the door behind him, then, tilting Ashe's slight weight so he could hold her with one hand, he gave a leap upward, knocking aside the trap door that led to the roof.</p><p>He landed lightly on the flat surface, his finger touching Ashe's lips as they parted to utter a small shriek.</p><p>In the street below he heard the sound of gunfire and a scream of pain followed by the unmistakable scent of blood that made his cat snarl with the need to be in the middle of the fight.</p><p>Raphael battled back the instinct to shift.</p><p>The only way to get Ashe to safety was to remain in his human form.</p><p>Staying low, he headed to the far side of the roof, halting at the edge to once again whisper in Ashe's ear.</p><p>\"I need you to hold on tight,\" he commanded.</p><p>She gave a shaky nod, her dark eyes wide with fear. He paused long enough to brush a kiss over her lips, then with a strength only a Pantera could possess, he jumped off the roof and landed on a nearby branch.</p><p>Keeping a terrified Ashe cradled in one arm, and the other wrapped around the branch above him, Raphael crouched in the tree, listening intently to the battle that still raged in the street.</p><p>There had been no cry of alarm to reveal he'd been spotted.</p><p>So far, so good.</p><p>Cautiously, he weaved his way through the branches and easily vaulted to the neighboring tree. Ashe gasped, burying her face in his neck as he balanced on a narrow branch, waiting to make sure they remained unnoticed before repeating his stealthy performance until they reached the edge of the swamp.</p><p>Once there, he had no choice but to leap to the spongy ground.</p><p>His people were skilled at traveling through the trees undetected, but he wasn't going to risk dropping his precious cargo.</p><p>Not now. Not ever.</p><p>Heading deeper into the swamps, Raphael kept his attention trained on the ever-changing landscape. In the bayous the very ground melted beneath his feet. There were no roads, no permanent pathways. Even the lily-clogged canals could be there one day and gone the next.</p><p>A perfect place for monsters to hide.</p><p>Thankfully he was the most dangerous monster around.</p><p>Or he had been until tonight.</p><p>He had only a faint buzzing sound of warning before he felt a pinprick of pain in the back of his neck.</p><p>What the fuck?</p><p>Carefully lowering Ashe to the thick underbrush, he reached up a hand to pluck the annoying barb out of his flesh.</p><p>A dart?</p><p>He studied the small weapon with a frown, wondering who the hell thought a full-grown Pantera could be hurt by a mere toy.</p><p>Then, a strange chill spread through his body, making him shiver, and worse, numbing his connection to his cat.</p><p>\"Shit,\" he breathed, realizing that the poison coursing through his body had made it impossible for him to shift.</p><p>\"Raphael?\" Ashe touched his arm, her expression troubled. \"What is it?\"</p><p>He dropped the dart, gripping her shoulders as he held her worried gaze with a fierce determination.</p><p>\"Listen to me, ma chere, I need you to run as fast and far as you can.\"</p><p>\"No.\" She shook her head. \"I'm not leaving you.\"</p><p>\"I can't shift. My cat...\" He gave a low snarl of frustration. \"Dammit. Run. I'll find you.\" He swooped down to steal a kiss of raw promise. \"I'll always find you.\"</p><p>She reached up to cup his face with shaking fingers. \"What about you?\"</p><p>\"I can take care of myself,\" he softly assured her. \"But I need you to take care of our child. Do you understand?\"</p><p>She bit her lip, giving a grudging nod. \"Yes.\"</p><p>\"Trust me.\" He gave her a firm push toward the tangle of swamp milkweed that would easily hide her tracks. \"Go.\"</p><p>Waiting until she'd disappeared into the thick foliage, Raphael slowly turned, concentrating on the human male he could sense hiding behind the narrow trunk of a tupelo tree.</p><p>\"Come out of the shadows and face me like a man, you spineless coward,\" he taunted, oddly unnerved by the pharmaceutical barrier that separated him from his cat.</p><p>Although he couldn't shift while away from his homelands-well, until Ashe had crashed into his life-he was always in touch with his inner animal.</p><p>To be cut off from that connection was like missing a limb.</p><p>Someone was going to pay.</p><p>In blood.</p><p>That someone stepped from behind the tree, revealing an average-sized man dressed in camo fatigues, with his hair buzzed in a military cut.</p><p>Not that Raphael believed for a second the stranger was a part of the armed services.</p><p>He'd secretly traveled the globe to meet with world leaders. He easily recognized the crisp movements and precise bearing that marked a trained soldier.</p><p>This yokel was a bully who'd been given a gun and the illusion of power.</p><p>\"I don't fear an animal,\" the man mocked, his square face and beady eyes revealing a confidence that came from his mistaken belief that the gun he clutched in his fingers gave him the upper hand.</p><p>\"Good.\" Raphael moved forward, a taunting smile curving his lips. \"Then let's do this thing.\"</p><p>G.I. Joe Wannabe frowned, glancing over Raphael's shoulder. \"Where's the female?\"</p><p>Raphael prowled steadily forward. The idiot didn't even realize his danger.</p><p>\"Why?\"</p><p>\"She has to die.\"</p><p>Raphael halted, a ball of dread lodged in the pit of his stomach.</p><p>It was one thing to suspect the strangers were after Ashe, and another to have it confirmed.</p><p>He battled back the red haze that demanded blood and tearing flesh and crunching bones.</p><p>Before he ripped the bastard apart he needed information.</p><p>\"Because she carries my child?\"</p><p>\"Because she carries the magic.\"</p><p>\"Magic?\" He frowned, baffled by the unexpected words. \"What magic?\"</p><p>The man narrowed his gaze, belatedly realizing he'd given away more than he intended.</p><p>\"I'll find her.\" He lifted the gun. \"But first I intend to rid the world of an abomination.\"</p><p>He squeezed the trigger at the same instant that Raphael leaped forward.</p><p>It shouldn't have been a contest.</p><p>Raphael was bigger, stronger, and infinitely better trained.</p><p>But whatever drug was coursing through his body had done more than put his cat to sleep. His movements were awkward, lethargic.</p><p>He slammed into the bastard even as the bullet sliced through his upper shoulder. Pain seared through him, but wrapping his arms around the man, Raphael drove him into the ground, landing on top of him.</p><p>He knocked aside the gun, wrapping his fingers around the man's thick throat.</p><p>\"Who sent you to kill Ashe?\"</p><p>The man laughed, the fetid stench of 'wrongness' intensifying.</p><p>\"This is bigger than you,\" he choked out, his eyes simmering with the madness of a true fanatic. \"This is bigger than all of us.\"</p><p>Raphael tightened his grip, battling back the growing weakness that threatened his survival.</p><p>\"Tell me who sent you, dammit,\" he roared.</p><p>Without warning the man jerked his upper body off the ground, smashing his forehead into Raphael's with enough force to make him see stars.</p><p>Giving a shake of his head, Raphael suddenly found himself being rolled onto his back, the man holding him down as he reached for the gun that lay a few feet away.</p><p>Oh...hell.</p><p>Raphael wanted answers, but the combination of the unknown poison and the blood loss from his wound was taking its toll.</p><p>If he didn't kill the man quickly, he was the one who was going to end up in a soggy grave.</p><p>Clearing his double vision, Raphael bared his teeth. He was going to rip off the man's head and feed it to the gators.</p><p>The satisfying thought had barely formed in his mind when he caught a familiar scent and his heart forgot how to beat.</p><p>Goddammit. That stubborn female was going to get locked in his house and never let out again.</p><p>He gathered his waning strength, desperately grasping his attacker's arms to keep him from reaching the gun. At the same time, Ashe stepped into view, her arms held over her head as she swung a heavy stick toward the back of the man's head.</p><p>There was sickening crunch as the skull busted at the impact, and the man's eyes glazed.</p><p>Raphael didn't hesitate. Grabbing the man's face, he jerked his head to the side with enough force to snap his neck. Instantly the stranger went limp and Raphael tossed his dead body aside.</p><p>Rising to his feet, he stepped over the corpse so he could glare down at his mate in frustration.</p><p>\"I thought I told you to run?\"</p><p>She rolled her eyes, tossing the stick aside so she could wrap an arm around his waist. Only then did he realize that he was swaying like a drunkard.</p><p>\"You know how well I take orders,\" she reminded him with a wry smile.</p><p>He brushed his lips over the top of her head, allowing her to keep him balanced as they continued their interrupted journey through the bayou.</p><p>Once he reached the Wildlands he would send someone back to check the body for a brand.</p><p>For now he had to get Ashe to the safety of his people.</p><p>\"That's something we're going to have to work on,\" he assured her.</p><p>She tilted back her head to meet his weary smile.</p><p>\"Together.\"</p><p>\"Together,\" he breathed, wondering if a word had ever sounded so sweet.</p><p>Leaning against each other, they managed to stumble their way through the swamp, combining their strength as only a truly mated pair could.</p><p>They reached the Wildlands just as the sun crested the horizon, and Raphael wasn't remotely surprised when a cat padded forward to greet them.</p><p>Dark as the shadows, the lethal feline regarded them with a predatory gaze.</p><p>Then, with a low roar the creature surrounded itself in a silvery mist, shifting to reveal a tall, grim-faced warrior.</p><p>\"So it's true, Raphael. You return with a mate and a child,\" the leader of the Hunters drawled with a taunting smile. \"I don't know whether to congratulate you or have you thrown into the psych ward.\"</p><p>\"And a happy fucking hello to you, Parish.\"</p><p>With a shared chuckle, they stepped into the Wildlands, the magic wrapping around them as overhead a raven screeched in fury. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>BY LAURA WRIGHT</p><p>CHAPTER 1</p><p>THE baby emerged writhing and covered in amniotic fluid. Cradling the child, unable to curb the proud and relieved smile breaking on her sweaty face, Dr. Julia Cabot reached across the bed and placed him on his weary mother's belly and chest. Annette, one of the three nurses assisting, quickly covered him with a blanket, then suctioned his nose and mouth with a bulb syringe. In seconds, a hearty wail erupted from the infant, the welcome sound pinging off the walls and calling forth a duet of sighs from the baby's father and aunt.</p><p>Twenty-one hours of hard labor. This woman's a freaking rock star. Julia glanced at the clock. \"9:51 pm.\"</p> <p>\"Got it,\" Annette said, scribbling on the chart. \"Do you want me to get his scores now, Doc?\"</p><p>\"Right on his mom's chest will be fine.\" Julia returned to her work, another nurse assisting as she delivered the placenta. \"So, Mrs. Dubroux, do you have a name for your beautiful boy?\"</p><p>\"Garth,\" the woman said, pulling her gaze from her little love and looking up at her husband. \"Garth Allan Dubroux, just like his daddy.\"</p><p>The man beamed.</p><p>\"Nines across the board, Doc,\" Annette announced, making the note in her chart.</p> <p>\"Well, well, you've got a strong one there,\" Julia said, pulling off her gloves and letting the nurse take over with the cleaning. She walked around to the side of the bed and eyed the precious new family member. \"Welcome to the world, Garth.\"</p><p>As the baby rooted around on her chest, Mrs. Dubroux smiled up at Julia, tears brightening her eyes. \"Thank you. Thank you so much.\"</p><p>\"You're a godsend, Doctor Cabot,\" Mr. Dubroux added, his arm tightening around his wife's shoulders. \"Marilyn would've been in the surgery room if it wasn't for you.\"</p><p>\"It was my pleasure,\" Julia said, trying to hold back the wave of emotion and sadness at such a lovely ending to her career at New Orleans General. \"One of the nurses will help you with breastfeeding if you need it, and Doctor Salander will be coming in to check on the both of you very soon.\" She gave them one last smile. \"Congratulations, and good luck.\"</p><p>\"Nice work, Doc,\" Annette said as they left the room. \"Never seen anyone turn a baby like that. You have a gift.\"</p><p>Julia headed for the nurses' station. She needed to fill out some paperwork before she was done for the night. Before she was done, period. She didn't want to be rude, but talking about her work right now...well, it was too painful. She was going to miss this place, the staff, the patients.</p> <p>Sidling up next to her, Annette clucked her tongue as she watched Julia scribble on Marilyn Dubroux's chart. \"Damn shame. Best baby doctor this hospital's ever seen.\"</p><p>The words pinged inside Julia's heart. She was good at her job because she believed in it so much, truly cared about each and every new family that came to the hospital. She wanted their first moments as a unit to be special because after they left, when they got home, sometimes things changed.</p><p>\"You want to stay at my place tonight, Sugar?\"</p><p>Julia turned to face the nurse. With her beehive of graying brown hair and warm, chocolate eyes, Annette Monty was hard to resist. She had that kind of older woman, motherly charm that was so irresistible to one who'd lost her own mother at a young age. But encouraging a connection that was just days away from being severed wasn't wise.</p><p>\"Thanks, Annette,\" Julia said, giving the woman a soft smile. \"But I have a hotel room.\"</p><p>\"He paying for it?\"</p><p>The sour note in Annette's voice made Julia flinch. \"No.\"</p><p>\"Bastard.\"</p> <p>Julia's lips pressed together and she returned to her charts.</p><p>\"The worst kind of asshole,\" Annette continued.</p><p>Yes. And what a fool she'd been to believe herself in love with him.</p><p>\"Wish he wasn't my boss.\" The nurse sniffed with irritation. \"If I didn't need this job, I might just walk right into that new office of his and-\"</p><p>That brought Julia's chin up once again. She eyed the woman seriously. \"Don't even think about it. You have three teenagers at home, and Dell is still recovering from knee surgery.\"</p><p>Impassioned brown eyes softened. \"You're a good, kind gal, Julia Cabot. That man should be strung up from the nearest light pole for hurting you like he did-not getting a gawd damn promotion.\"</p><p>Head of pediatric surgery. It was amazing how some people were rewarded for bad behavior. Dr. Gary Share: mega-talented physician, desperately disappointing man.</p><p>Annette wasn't about to let the subject go. Keeping her voice just above a whisper, she hissed, \"Brings you all the way out here from California, promises you a home and a family, and,\" her voice dropped to a whisper, \"takes that salope into your bed.\"</p><p>A still shot flashed in Julia's mind, the same one she'd been seeing every day and night for a week. Lunch hour, coming home to bring Gary, who'd been up all night in surgery, a hot meal. She'd heard it, heard them, the minute she'd walked into the house, and yet she couldn't stop herself. She'd walked up those stairs, heart pounding, food clutched in her shaking hands, and into the bedroom she shared with Gary.</p><p>It's a surreal experience to see the person you care about and trust most in the world lying on their back, legs spread, with one of the new nurses from emergency on top of them. But it's something else entirely when they don't even stop, when they don't pull out or even have the decency to look horrified when they utter breathlessly, \"What are you doing here, Julia? You're supposed to be at the hospital.\"</p><p>\"You going to stay here in New Orleans or go back home to Hollywood country?\"</p><p>Annette's question tore Julia from her unrelenting vision, and she cleared her throat. \"I haven't decided where I'm going.\"</p><p>Or when.</p><p>It was a little pathetic to admit. She'd given her notice a week ago, been living in a hotel and she couldn't seem to plan her next move. Where should she go? Where did she belong? Her mother was dead, her father had never been in the picture, and she had no siblings, and the few friends she'd managed to make in medical school were scattered around the country. It had been the main reason she'd accepted Gary's offer to move to New Orleans. She'd been smitten with him, surely, and the idea of a new city, a job that was waiting for her. But the one thing she'd wanted above all else was a chance to create a life, a community-a family.</p><p>Lucky little Garth.</p><p>She smiled to herself as she handed all her files to the nurse behind the desk.</p><p>\"Come stay with me, Sugar,\" Annette said, touching Julia's shoulder. \"One night. We can play Yahtzee, watch something with a lot of hot men running around without their shirts on, and take down that box of wine I have in my pantry.\"</p><p>Julia laughed softly, shook her head. \"Did anyone ever tell you that you are the sweetest, kindest and pushiest woman...\" Her words died as her gaze caught sight of something down the hall. Her heart leapt into her throat.</p><p>\"That they have, Sugar,\" Annette continued with a soft rumble of laughter. \"So what do you say? I'm off in an hour.\"</p><p>Air wasn't getting into Julia's lungs. She tried to breathe normally, but her insides refused to cooperate. Her hands formed fists and her lips went dry. Walking down the hall toward her, all five foot eleven, perfectly cropped blond hair, pressed pants and a coldly charming smile, was the slimeball himself.</p><p>Dr. Gary.</p><p>God, what was wrong with her? Why was she reacting like this? Insecure and embarrassed? He'd screwed her over! He'd kicked her out of the house he'd made sure to keep in his name, 'suggested' she find a new place to work, then moved his afternoon delight in before she'd even found herself a hotel.</p><p>\"Turn around, Sugar, and face me. Don't let that towheaded rat bastard see your face.\"</p><p>Annette might have been one of the bossiest, most loveable irritants around, but at that moment, Julia had never been more grateful to have her near.</p><p>Inside the empty hospital room, Parish crouched near the open doorway, nostrils flaring as he took in the scent of his prey. A delectable combination of vanilla and female sweat. A low growl vibrated in his throat.</p><p>\"What are you doing, Parish?\" Michel hissed behind him. \"You sound feral.\"</p><p>Feral? Yes. Hungry. Always.</p><p>She smelled especially appetizing.</p><p>As he watched the human female interact with her co-worker, his body stirred, and even though Pantera couldn't shift outside the magical boundaries of the Wildlands, his cat scratched at the base of his skull. The puma was intrigued by her, too.</p><p>Granted, he despised humans, didn't trust them with anything but destruction, but he'd never scented anything like her-never seen something like her in his life. Skin the color of cream, hair, long and straight and sun-lightened yellow, eyes as pale blue as the bayou sky he awoke beneath every morning, and a smile that was equally sweet as it was sad. She wasn't very tall. With the small heel on her sexy black shoes, maybe she'd reach his shoulder, but he liked that. His hands could easily wrap around her small waist as he gathered her in his arms, crushed her body to his and took off back to the Wildlands.</p><p>Another growl escaped his throat, and his breathing changed. Beside him, Michel cursed. The Suit was one of the many spies the Pantera had living and working outside the Wildlands, and was Parish's New Orleans contact. The Political Faction of the Pantera was always on the alert, needing to know about any human-based threat to their species, or a physical one that could affect the magic of their land.</p><p>Tonight's mission, however, was something vastly more important. The miracle the Pantera had spent over five decades praying for could finally be upon them, and the female with the addictive scent, sunlit hair and black kitten heels was the key to its success.</p><p>\"Parish,\" Michel said with more force than he'd shown all night. \"Do I need to pull you back here?\"</p><p>Parish grinned broadly. As if that were possible. \"That's my doctor.\"</p><p>\"Yes, but you can't just barrel down the hospital hallway and take what you want.\"</p><p>Watch me. His eyes narrowed into predatory slits and he moved forward, but Michel put a hand on his shoulder to stay him.</p><p>Parish shrugged him off, then growled, his canines vibrating with their need to drop.</p><p>\"Goddamit, Hunter.\" The Pantera spy cut in front of him. The male wasn't as tall as Parish, but he was broad shouldered in his suit and tie, and his green eyes flashed with the thick heat of the bayou. \"It doesn't work this way. If we want to keep our alliance with human law enforcement, and the identities of our spies hidden, protocol and rules cannot be broken.\"</p><p>\"Rules don't apply to Hunters,\" Parish snarled.</p><p>Michel's frown deepened. \"Inside the Wildlands, that may be true. But this is the human world.\"</p><p>Parish didn't care where they were. \"Raphael wants a female doctor for his pregnant human. She will help deliver the first Pantera child in decades.\" His gaze cut once again to the blond woman who was bending over to retrieve her co-worker's pen from the floor. Parish growled softly at her, his assignment. He suspected she would look very appealing on her hands and knees before him.</p><p>\"I think this is a mistake,\" Michel remarked dryly. \"Perhaps someone from the Nurturer Faction should be sent-\"</p><p>Parish's gaze ripped back to the male before him. \"Too late. I will have her.\"</p><p>Michel cursed. \"This is not a store, and she is not for purchase.\"</p><p>\"I'm not buying, Michel, I'm taking.\"</p><p>Even as he said it, the possessive purr in Parish's tone surprised him. He'd never felt such an immediate and intense need for a female. No doubt she'd be afraid of him when he approached. Most females were. Perpetually on the hunt, he didn't have the softness, the easy manners of some other Pantera males. But he would try to be gentle with her.</p><p>The male shook his head and sighed. \"I don't understand Raphael's choice in sending you.\"</p><p>\"Do you not?\" It was in fact a job for both himself and his second-in-command, Bayon. But the other male had been called away on some emergency when they'd arrived in New Orleans. Knowing Bayon, the emergency probably had large breasts, a ripe ass and the morning free. \"I am leader of the Hunters, and Raphael's mate carries our future within her womb.\" One dark eyebrow lifted sardonically. \"Never send a Suit or a Nurturer to do a Hunter's job.\"</p><p>Michel reddened and his lip curled.</p><p>\"You've done your part. Go back to work.\" Parish pushed past the male, his nostrils already filling with her scent once again.</p><p>\"Do not hurt her.\"</p><p>Parish didn't even glance back, but his lips did twist into a humorless smile as the woman left the nurses' station and headed for the bank of elevators. \"She will be well taken care of.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>THE French Quarter, the nerve center of downtown New Orleans, was overflowing with people, and yet the moment Julia hit Gravier Street, she knew she was being followed. Living in Los Angeles, always working late, taking the bus everywhere or walking home, her instincts had been tested, proven and finely honed. Just seconds after leaving the hospital, she'd felt something, sensed someone keeping pace with her, but she hadn't stopped or turned around. That was an amateur's move. One that could easily get the looker hurt or killed.</p><p>Don't ever let the bogeyman know you know he's there.</p><p>Her mother's words, back when she'd still been able to communicate, had fallen on teenage know-it-all ears. But one night after a late class, Julia had found herself on the terrifying and ill-prepared end of a mugger's switchblade. The lesson had cost her a computer, medical school books, ID, credit cards, cash and a week's worth of sleep. From that day forward, her mother's warning remained steadfast in her head.</p><p>Don't ever let the bogeyman know you know he's there until you're ready to either lead him directly into the path of a cop, you have a clear and realistic way to ditch him, or you can bring him with you into a crowd of people and make a huge goddamn stink.</p> <p>The hair on the back of Julia's neck prickled and she quickened her pace, heading directly into the eye of the NOLA bar crawl.</p><p>Just a few blocks to the hotel.</p><p>As the sound of cool jazz, and the scents of body odor, grilling crawfish and stale beer came at her on the warm air, her eyes searched the massive crowd for a cop, but came up empty.</p><p>What did he want? she wondered, the concentrated sounds of revelry enveloping her, driving up her adrenaline, making her senses incredibly keen. Didn't he know she had nothing?</p><p>Shit. Less than nothing?</p> <p>Didn't he know she'd already been robbed this week? Of a life, a future, a promise?</p><p>The noise grew in strength, and the crowd thickened. Instead of fear, anger started to stir within her. Anger that had been festering in her chest, waiting, squeezing, aching to find release. Maybe this was it. The time.</p><p>The bogeyman.</p><p>It was in that moment she felt a hand brush her waist. Her pulse jerked in her blood and instinct fed her already jacked-up rage. Coming to a sudden halt, she whirled around and faced the bastard who had just dared to touch her.</p><p>Eyes the color of melted gold met her.</p><p>Julia froze where she stood, her anger leaking from her gut like a punctured balloon. All she could do was stare at the creature before her. He was stunning, incredible, unlike anything she had ever seen before. Around her, the crowd noise dissipated to a dull hum, but she barely noticed. Her gaze was slowly traveling the length of him, taking in his predatory stance and powerful muscle and tanned skin. He wore plain clothes; jeans and a black T-shirt with scuffed combat boots. But he was the furthest thing from plain she'd ever seen. Far over six feet tall with broad shoulders and long, ink-black hair that was tied back at his neck. A few stray pieces had escaped and were licking at the ridges of his sharply drawn features. His face was shockingly handsome, tan and smooth, except for the two healed scars near his right ear and mouth. Her nails scraped against her palms as she thought about running her index finger over the small white lines.</p> <p>A low growl sounded, but Julia didn't register where the noise was coming from. Her head was far too fuzzy, and her skin felt uncomfortably warm. It was only when a heavily muscled arm snaked around her waist and pulled her close that she snapped out of the haze enveloping her.</p><p>\"I like the way you look at me,\" he said, his voice a dark, sensual rumble. \"For once, I am the prey.\"</p><p>His words and the feel of his breath against her face turned her legs to rubber. What the hell was going on here? What was wrong with her that she was reacting like this? She brought her hands to his chest and pushed like hell, but he didn't budge.</p><p>\"You don't have to be afraid of me,\" he said, his eyes cutting away for a moment to check their surroundings. \"I would never hurt you.\"</p><p>The man's dark, erotic scent rushed into Julia's nostrils and she whimpered. Where were her guts? Why wasn't she screaming in terror? That coveted ability she thought she possessed, the one where she kept her shit together in the face of danger, lay completely out of her reach as his golden eyes, now flecked with blue and gray, returned to hers and all but urged her to relinquish her very soul to him.</p><p>Her mind raced, her feet were rooted to the ground, the drunk New Orleans crowd just continued to party around them, and instead of wanting to knee him in the balls and run, she actually wanted to move closer, nuzzle her face against the steely wall of his chest.</p><p>His lips curved into a sexy smile, those small white scars calling out to her as he spoke. \"I understand Raphael's need for his human woman now.\"</p><p>Raphael.</p> <p>Human woman?</p><p>The words snaked through Julia's brain, tugging at her rational thought, waking her fear center. Oh shit. Her pulse jumped in her throat and she swallowed. For the first time since she'd laid eyes on this man, she found her voice.</p><p>\"Let me go,\" she whispered.</p><p>The gold in his incredible eyes receded for a moment and black irises emerged.</p><p>Adrenaline pumping, she eased back from him. \"Let me go,\" she said again, far more firmly this time. Her heartbeat was so loud now she heard it in her ears. \"I'll scream. I'll scream so goddamn loud the cops will be on you in a second.\"</p><p>The man's face fell. He looked completely taken aback by her words, maybe even offended. But he didn't let her go. \"There's no reason to be afraid, Doctor Cabot.\"</p><p>Julia's insides went cold with terror. He knows who I am. How does he know who I am?</p><p>She started to struggle, panic causing her skin to prickle. \"Why are you following me? What do you want?\"</p><p>\"I was sent to find you.\"</p><p>Sent? \"By who?\" she demanded, trying to get her arm free, her knee, anything she could use.</p><p>\"You need to calm down,\" he urged softly, his arm tightening around her waist as, once again, he looked around, up at a few buildings, then into the crowd. \"Your heart beats too fast.\"</p><p>Who would send someone after her? She didn't know anyone outside the hospital. She didn't have family. She didn't-</p><p>She stopped struggling and stared up at him, her mouth dry. \"Is this Gary's doing?\" she said hoarsely as a group of drunk college girls stumbled past them. Oh god. That bastard. He'd told her he would hire a lawyer if she didn't go away quietly-if she tried to stake a claim to the house or any of its contents. \"Are you a private detective or something? Is he actually having me followed? Because that would be both incredibly shitty of him and unnecessary since I want nothing from him.\"</p><p>\"Gary?\" The man's nostrils flared. \"Is this your male?\"</p><p>\"My male?\" she repeated with an almost hysterical laugh. \"Gary was my boyfriend until I found him in our bed, balls-deep in one of my nurses. Or didn't he tell you that part?\"</p><p>Dark brows lifted over those extraordinary eyes.</p><p>\"You can tell that jackass that there's no reason to follow me. I don't want anything from him.\" Her voice broke. Goddamit. She hated tears. They were worthless and made a person look weak. \"Except my cat. I want my cat.\"</p><p>That damn cat. She missed him like crazy.</p><p>A large hand moved slowly up her back and held her possessively between the shoulder blades. \"You don't wish to return to this Gary?\" the man said with a slight snarl. \"This male who betrayed you?\"</p><p>\"I'd rather eat my own hand.\" She gritted her teeth. \"And you can tell him as soon as I'm out of the hotel and living somewhere permanent, I'll send someone to get Fangs.\"</p><p>\"Who is Fangs?\" he asked.</p><p>\"My cat.\"</p><p>She saw a flicker of a grin on his dark, rugged face. \"The female likes cats.\"</p><p>Before Julia could say another word, the man pressed her closer to his chest and took off into the crowd. He moved so quickly that all she saw before she passed out was a blur of city lights, and all she felt were his arms around her and air rushing over her skin.</p><p>\"What the hell where you thinking?\" Raphael admonished.</p><p>Pacing near the bed in the medical ward, Parish glanced up and flashed his canines at yet another Diplomat. \"I did what I was sent to do.\"</p><p>\"You were supposed to talk to her-\"</p><p>\"I did talk to her,\" Parish cut in. He continued to pace. It bothered him to look at the woman, unconscious and pale behind the white sheet. He hadn't meant for this to happen. He hadn't known she would pass out from the burst of speed he'd used to get them out of the crowd and on their way to the Wildlands. \"She has quit her job and has no family. She's broken things off with a bastard male who fucked another female right in front of her.\" He growled softly, his cat itching to spring free and hunt down this human called Gary. \"Just like a human to go sniffing around when he has something beautiful and perfect in his bed.\"</p><p>\"Dammit, Parish.\" Raphael's green eyes flashed with irritation. \"Gathering personal information was not the assignment. You were supposed to talk with her about Ashe and the child. You were supposed to explain our situation and our offer. Invite her to come here. Instead you snatched her off the street, rendering her unconscious in the process.\"</p><p>\"I am a Hunter. I do not ask. When you ask, you give your prey the opportunity to say no.\"</p><p>Even as he said the words, Parish's gaze cut to the woman on the bed. As much as he wanted to think of her as prey, as human-as nothing at all to him-there was something inside of him that had already connected to her. She was the most beautiful female he'd ever seen. Her smooth, pale skin called to him, as did her full pink mouth. She had to wake. She must. He needed to hear her voice again, see her eyes flash in anger and heat as he held her against him.</p><p>He turned from the bed with a frustrated snarl.</p><p>\"This is your fault,\" Raphael called to Bayon. The massive blond Hunter leaned against the doorframe, refusing to commit to entering either the medical room or the conversation. \"Running off while one of our wildest takes on a human alone.\"</p><p>Parish quick-flashed the Suit his puma, then drew it back inside before continuing to pace. He needed air, needed his clothes off and his fur on just for a few hours. But he couldn't leave the woman.</p><p>Julia.</p><p>Just her name made his body stir.</p><p>\"Parish was with Michel,\" Bayon said. \"The meet, greet and offer with the doctor was all set up. It should've gone smoothly.\"</p><p>Raphael hissed. \"Where the hell were you?\"</p><p>\"I had something to take care of.\"</p><p>\"That's not an answer, Bayon.\"</p><p>\"It is the only answer I'm willing to give.\"</p><p>\"Something to take care of - more like someone, right?\"</p><p>Bayon's eyes narrowed. \"Cage your cat before I have to.\"</p><p>\"You were off hunting tail instead of backing up your leader!\" Raphael roared.</p><p>\"Enough!\" Parish growled, coming to stand between the warring shifters. He would not have Julia upset, awakening to a verbal brawl in a strange room. He turned on Raphael, prowling closer to the dark blond male. \"You sent the leader of the Hunters to bring back the best female baby doctor in New Orleans.\" He cocked his head. \"And I did.\"</p><p>Nostrils flared, Raphael seemed to be searching for patience. \"She's unconscious, Parish.\"</p><p>The words twisted in Parish's gut. He'd never thought about his reckless, instinctive ways before. Never felt so unsure of himself until now. \"It's only for a short time. She is well. Pulse, breathing, vital signs. Our doctors have said so.\"</p><p>\"If this gets out, if any of the Diplomats learn of this-\"</p><p>\"Handle it. Suit business is for you to figure out.\"</p><p>\"You're right about that,\" Raphael ground out. \"Go. You're done here.\" He knocked his chin toward Bayon and the door. \"I'll make sure this doesn't become a problem.\"</p><p>Panic flared within Parish and his gaze cut to the bed. \"But the female...\"</p><p>Cold authority bled from the Suit's tone. \"I'll assign someone to take care of the doctor.\"</p><p>\"No!\" The sudden rush of anger and possessiveness toward the woman surprised Parish. And Raphael too by the look on his face.</p><p>\"She's going to need a guard,\" he said. \"Like you, there are many Pantera who do not welcome humans. They're tolerant of Ashe because she carries my child, and the hope for our species. But they may not feel we need a human doctor. They might see it as an insult. When she wakes up, after I have spoken to her, explained things, and if she agrees to remain, one of the Nurturer guards will take her-\"</p><p>A snarl ripped from Parish's throat.</p><p>\"-Will take her to and from her quarters and make sure no harm comes to her.\"</p><p>Parish moved closer to the bed, blocking Julia from Raphael's view, his stance aggressive, protective.</p><p>\"Ease up, Parish.\" Bayon stepped inside the room, moved toward his leader. \"What is it? Are you losing control of your hatred for humans? We can't risk her...\"</p><p>Parish ground his molars. They didn't get it. Shit, he barely understood his irrational anger and desperate need himself. But the one thing he did know was that he couldn't leave Julia.</p><p>He glanced down at the woman. Her color was coming back and beneath her pale lids, he saw movement. His chest expanded with hope. She would awaken soon, and the first face he wanted her to see was his own.</p><p>\"I found her,\" he said softly. \"I took her. She is mine.\"</p><p>Bayon cursed behind him.</p><p>\"Yours?\" Raphael said.</p><p>Parish's hand inched forward, toward her until his fingers met her elbow. As irrational and impossible as it was, he wanted to claim her, announce to both Raphael and Bayon that something had happened on the street in New Orleans when he'd pulled this woman into his arms and gazed down into her lovely face. A connection, a need, a pull he'd never imagined he'd ever feel for a female, much less a human woman. And the idea of being separated from her made not only him but his cat ache.</p><p>But he pushed back the urge. He knew such a declaration would sound insane. He would do better to claim her as a Hunter, a protector.</p><p>\"To guard,\" he amended, his gaze moving over her face. \"The doctor is mine to guard. She will live with me, have my full protection as she cares for Ashe.\"</p><p>Bayon started to laugh, then abruptly stopped when Parish turned and glared at him.</p><p>\"You're serious? Live with you in the caves? A human female?\" The blond male tossed a look at Raphael. \"Presuming she actually agrees, she won't last a minute in that dank, uncivilized rock. She'll be running from us.\"</p><p>She won't get far.</p><p>\"I will agree to you guarding her, Parish,\" Raphael said slowly. \"But it will be somewhere with hot water and clean sheets.\"</p><p>There was nothing Parish wanted more in that moment then to scoop her up in his arms and take her home to his caves, but he knew Raphael's mind, knew how far to push the male when it came to protocol. And perhaps the beautiful doctor deserved a little pampering after what he'd put her through. He nodded at Raphael. \"Fine. I'll bring her to Natty's.\"</p><p>\"She may very well be afraid of you. She's not going to soften around the feline who shut down her mind and abducted her.\"</p><p>Parish's lip curled, but the ire was more for himself than for the Suit. \"I won't be harsh with her. I won't scare her.\"</p><p>The male looked unconvinced. \"Can you truly promise that? Your dislike of humans is legendary. And understandably so.\"</p><p>\"She is different.\"</p><p>She is mine.</p><p>\"She is special.\" Raphael came to stand beside him at the bed, his puma's face flashing momentarily from its normally controlled cage. \"I cannot have this go wrong.\"</p><p>Parish knew exactly how important this was, for the both of them. \"I give you my word. I will keep her safe and well.\"</p><p>Golden green eyes searched his. \"All right. If the woman agrees, she is yours to protect.\"</p><p>The cat inside of Parish purred. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>JULIA returned to consciousness slowly, her mind still wrapped in a delectable dream. One she wasn't all that keen on releasing.</p><p>She was on her bed in the hotel. It was night and the windows were open, letting in the glow of moonlight and the balmy New Orleans breeze. Beneath her lay a man with bronze skin and hungry, gold cat eyes. His long black hair kissed his broad shoulders and chest, both of which were beaded with sweat. As she rode him, he growled at her, his hands gripping her hips.</p><p>Beside the bed, watching, his expression strangled and confused, was Gary. Blond, buttoned-up, cheater, liar and all around heel, Gary. He kept whispering the words, \"You're supposed to be at the hospital, Julia,\" over and over, but Julia barely spared him a glance. She was close, so close. The one beneath her, the one inside her, the one who growled and snarled at her as he made her come again, was the only thing that mattered.</p><p>\"You belong to me!\"</p> <p>Julia collapsed onto his chest, his possessive roar echoing in her ears as his hot seed filled her sex.</p><p>\"Julia?\" A voice, female and insistent, was trying to reach her, break in to her wonderful dream.</p><p>\"Julia?\" the voice said again. \"Her breathing's worrying me, Raphael. And she looks flushed.\"</p><p>Julia felt something cold on her face and gasped. Body on fire, limbs shaking, her eyes flickered open. It took her several seconds to focus, but when she did fear gripped her. The dream was gone, and the woman who sat beside her, on what Julia could only guess was a hospital bed, was a complete stranger.</p><p>\"I'm Ashe.\" Long black hair framed a beautiful, concerned face. \"Please don't be scared.\"</p> <p>\"What's going on?\" Julia demanded, trying to sit up, but failing immediately. \"Did I pass out?\"</p><p>The woman glanced behind her and Julia followed her line of vision. A man stood several feet away. He was tall and imposing and reminded her of someone. Why couldn't she remember?</p><p>\"The effects will wear off,\" Ashe said, her gaze returning to Julia's. \"It just takes a little while.\"</p><p>The effects? The effects of what?</p><p>Her heart started to pound.</p><p>\"Do you remember anything?\" Ashe asked gently. \"Where you were before you... Who you were with?\"</p> <p>Julia's hands gripped the sheet that covered her. Did she remember? God, she hated this. Her mind felt blank. Fuzzy as hell, but blank. \"I was at the hospital,\" she said, struggling to see past the white noise in her brain. \"I delivered a baby. Garth. It was a really difficult delivery, but everything turned out well.\" She squinted. \"It was my last day, and I was going back to my hotel. I was walking down Gravier when I thought someone was...\"</p><p>She jerked her head up, her gaze crashing into Ashe's. \"Oh my god. The guy...\"</p><p>The woman inched forward on the bed, her eyes heavy with concern. \"Please. I need you to stay calm.\"</p><p>Shit. Her heart was now slamming painfully against her ribs. Calm was the last thing she felt. \"Did you see that guy? The one who followed me? Did he bring me here? He has black, long hair and golden eyes...\" Her head began to pound and she winced. \"That sounds impossible, I know. Was I drugged?\"</p><p>\"No.\" The woman cursed, and once again glanced over her shoulder. \"Listen, I'll tell you. Everything. But I need you to promise me you won't freak out until after I'm done.\"</p><p>How could she promise that? How could she promise anything to a stranger? Someone who might know the man who took her, who brought her here. But desperation to know the truth, get any kind of information, had her agreeing. \"Okay.\"</p><p>\"Have you ever heard of the Pantera?\"</p><p>Julia frowned, struggling with the fog weighing down her mind. \"No.\"</p> <p>\"They're a group of...people who live deep in the bayou,\" Ashe explained, her expression uneasy. \"They're rumored to have magical powers and an ability to shape-shift.\"</p><p>Julia's head continued to pound, competing for the highest decibel level with her heart. Maybe she was still lost in a dream. Maybe she was in her hotel room. \"I don't know,\" she managed, her mouth irritatingly dry. \"I may have heard some crazy legend about cat people or something. But what does that have to do with me? With that guy who followed me? Who grabbed me and-\" Her chest tightened as she recalled the feel of his body against her own. \"This isn't my hospital, is it?\"</p><p>\"Ma chere,\" called the man at the door, his gaze on Ashe. \"Maybe I should talk with her...explain what has happened...\"</p><p>\"No,\" Ashe insisted, her worried gaze locked with Julia's. \"She's here because of me. She needs to know the truth before anything else.\" The woman gave Julia a small smile. \"The Pantera, the cat people you've heard about, are not a legend. They live in the bayou, in a secret, sacred place called the Wildlands. They are shape shifters.\"</p><p>Had she hit her head? Had the gorgeous man dropped her? Was he even real? Or was she imagining him? \"I don't believe you. I don't believe any of this.\" She tried to sit up again, and this time, her brain didn't balk, didn't feel like it wanted to explode. God, she needed to get out of here, back to what she knew to be real.</p><p>\"You're in the medical facility in the Wildlands,\" Ashe continued quickly. \"You were brought here. For me. To help me.\"</p><p>Julia inched backward into the pillows. \"I'm in the psyc ward, right? I had a breakdown over this shit with Gary?\" She cursed again. \"Seriously, I can't believe I'm this weak.\"</p><p>\"You're not weak,\" Ashe said, reaching out and taking her hand. \"And don't say that guy's name again. It's not worthy of crossing your lips.\"</p><p>\"You know Gary?\" Julia asked, stunned. What the hell was this? What had she got mixed up in?</p><p>\"Parish told us about him. What he did to you.\" Her eyes narrowed. \"Sounds like a real jerk.\"</p><p>Julia shook her head. \"Who the hell is Parish?\"</p><p>A low growl sounded, echoed throughout the room. Julia hunched in terror, ready to throw herself off the bed. Find escape. But the voice at the door froze her.</p><p>\"I told you to stay out until we spoke with her.\" It was the man who'd called Ashe \"ma chere\".</p><p>\"You spoke with her,\" came another male voice from outside the door. \"I heard it. I refuse to walk the halls another goddamn second.\"</p><p>Julia's heart dropped into her stomach. She knew that voice, had just dreamt of that voice and the man who owned it. The man who had followed her from the hospital, who'd held her close and gazed down at her like he'd wanted to consume her very breath. Or was that part of her dream, too? She eased her hand from Ashe's and closed her eyes, trying to sort reality from fiction.</p><p>But that voice resumed its assault on her senses.</p><p>\"How are you feeling, Julia?\"</p><p>Julia couldn't help herself. She lifted her lids and her gaze shot to the man walking toward her. Holy shit. He was real. Flesh and blood, and if it were possible, even more gorgeous than she remembered. When he'd pulled her close on Gravier Street his hair had been back off his face, but now it hung loose and wild and sexy around his beautiful, scarred face. Like before, he wore jeans, but instead of a T-shirt, he had on a black tank that revealed heavily muscled shoulders and arms.</p><p>Her mouth dropped open as she stared at him.</p><p>\"I'm confused,\" she managed. What had happened? How had she ended up here? And where exactly was she?</p><p>His dark eyes, eyes that had once been golden, grew concerned as he approached the bed. \"I'm sorry for the way I brought you here. I'm not used to asking or discussing.\"</p><p>That she believed. Her gaze ran up his body. He was so tall, such a fierce presence beside her bed. \"What did you do to me?\"</p><p>He winced, looking guilty, and his gaze cut away for a moment. \"The speed at which I move was too disorienting for your mind. And my musk, the one I used to try and calm you, is more potent than most Pantera's. I should've known.\" His eyes slid back to connect with hers once again. \"I apologize.\"</p><p>\"Musk?\" Julia felt suddenly exhausted. It was like they were all speaking another language. \"What's this musk? A drug?\"</p><p>\"No,\" he said, worry etching his expression. \"It's magic we can release-</p><p>\"Magic.\" There was that word again.</p><p>\"-a scent to calm or soothe or arouse. ...It's nothing permanent.\"</p><p>She had to be freaking dreaming.</p><p>\"You will be able to get up soon, walk-\"</p><p>\"Walk out of here?\" Julia said, her pulse jumping against her neck. \"I can leave?\"</p><p>His eyes shuttered. \"I would not like that.\"</p><p>\"Okay. Go.\" Ashe pointed at Parish, then glanced over her shoulder at the other male. \"Leave. Both of you.\"</p><p>Parish growled, and the sound penetrated Julia's skin and vibrated through her. She practically moaned. \"God, what was that?\"</p><p>\"It's Parish being rude and insensitive,\" Ashe said, her tone nearly lethal now. She glared at the man. \"You're scaring her, confusing her. I will explain things, woman to woman.\"</p><p>\"You heard my female,\" said the other man, who continued to remain near the door. \"Let's go, Parish.\"</p><p>Parish's gaze moved down Julia's body, then back to her face. His nostrils flared. \"Fine,\" he muttered. \"But I'll be back.\"</p><p>He turned and stormed out. The other man gave Ashe a quick, tight smile before turning and walking...</p><p>Julia gasped, her blood suddenly fire hot in her veins. Impossible. She blinked, then stared hard at the empty doorway. The man was now gone, but she swore...No. She shook her head. It was the drugs or the head injury or the story Ashe had just told her. She did not just see the back end of a large cat where the man had been.</p><p>Or a long golden tail.</p><p>She let her head fall back against the pillows and closed her eyes, tried to calm her breathing. After a moment, when she felt in control, she opened them and focused on the nearly empty room. It seemed darker now, colder. Julia frowned at her odd reaction. She should be able to breathe easier with him gone, shouldn't she?</p><p>Still seated beside the bed, Ashe gave her an understanding, tight-lipped smile. \"I know it's overwhelming. They tend to be pretty protective. And possessive. Parish seems to think he's responsible for you after how he handled things. But don't worry, Raphael will take care of that.\"</p><p>\"Raphael?\" Unbearable confusion tested the last of Julia's patience. She fixed her gaze on Ashe and repeated her question. \"Who is Raphael?\"</p><p>\"My mate.\" She smiled, her eyes softening. \"First, let me say that I know exactly how you're feeling. It's confusing and impossible sounding.\" She laughed. \"I'm pretty sure my face had that exact same expression when I found out.\"</p><p>\"Found out what?\" Julia ground out. \"That you were being drugged? That you were living in a dream state?</p><p>Ashe shook her head, her eyes bright. \"That magic truly does exist. That the man I fell in love with is a puma shifter.\" She bit her bottom lip. \"And that the baby I'm carrying is half human, half Pantera.\"</p><p>\"What?\" Julia said on a gasp, her gaze slipping down to the woman's flat belly.</p><p>\"I'm only six weeks along.\" Ashe grabbed Julia's hand again, her eyes imploring. \"I'm scared. I have no idea what to expect. No clue as to how long I'll be pregnant, what the gestational period of a puma/human hybrid will be.\" She swallowed. \"I want this baby to be okay. And having a human doctor...\" She shook her head. \"I can't believe Parish just took you without telling you anything.\"</p><p>Parish. Just hearing his name made her skin tighten. This was madness. A puma/human hybrid. Christ. This woman didn't need an OB, she needed a shrink. And I need to get the hell out of here before I'm sucked in further.</p><p>\"I know. I know where your head's at.\" Ashe leaned toward her. \"And I don't blame you. I'm just asking for some time.\"</p><p>\"Time for what?\"</p><p>Ashe licked her lips. \"To prove it to you. To show you. Them.\"</p><p>Pale gold fur, a set of feline hips and a long, thick tail moved slowly through Julia's mind. She gritted her teeth against the vision. She couldn't believe Ashe, she refused to. But if she wanted to get out of here, maybe she needed to play their game for a little while.</p><p>Julia held the woman's gaze and sighed. \"If all this is true, and I'm not saying it is, wouldn't it be better to have a doctor who's a...\" Shit, she could barely get the word out because it was so ludicrous. \"Shifter?\"</p><p>\"There are plenty of those here. But they've only dealt with puma births. Plus, they haven't delivered a child in over fifty years.\"</p><p>Puma. Births. And yet, her damn doctor's curiosity had her asking, \"Why not?\"</p><p>\"The female Pantera either couldn't get pregnant or were unable to carry the babies to full-term. It's a horrific situation. They even tried to impregnate humans, willing test subjects, but nothing happened.\"</p><p>\"Until you,\" Julia said softly, eyeing her sharply.</p><p>Ashe nodded.</p><p>This poor woman needed help. Serious, professional help. Julia was going to do her best to find a way out of here. Maybe she could convince Ashe to go with her.</p><p>\"Listen, Ashe,\" she said in a gentle voice. \"I know some really incredible doctors back in the city-\"</p><p>Squeezing her hand tightly, Ashe implored her, \"Please don't say no. Don't say anything. Not yet.\" Ashe released her hand after one final squeeze and quickly got to her feet. \"I'll leave you alone. Let you try and sort this out. It took me a while...Hell, I think I'm still reeling from the truth. But know this: you'll have whatever you need and want here. A home, salary, protection, freedom.\" She smiled down at Julia with the most stable, yet concerned expression. \"If you decide to leave, though, no one's going to hold you here against your will-not even Parish.\"</p><p>Was it true? She could go if she wanted? Julia lifted a brow. \"I don't know about that. Parish seems pretty intent on me staying.\" And god, I think I like that part of this dream.</p><p>Ashe shrugged. \"He's a Hunter. He's wild, untamed, used to taking what he wants. And he doesn't have the best manners. But he's also honorable.\"</p><p>Honorable. She hadn't met an honorable man in a long time.</p><p>Ashe was almost at the door when she glanced back. \"Like you, I don't have much back home. Nothing I want to run to, anyway. My family is Raphael and...well,\" she touched her belly again. \"Little No-Name here.\" She smiled. \"It would be great to have a friend as well as a doctor.\"</p><p>Julia stared at the woman, watched her leave the room, and as soon as the door closed she pivoted to sit on the edge of the bed. Her head felt light, but okay. She had to find a way out, a way home. To the hotel and the jobless, family-less life. She couldn't stay here. Right? With the crazy lady and shape-shifting Pantera? With the gorgeous, golden-eyed male who looked at her with unmasked desire and hope?</p><p>It was reality vs. fantasy. And as a doctor, a scientist, she was nothing if she couldn't choose fact over fiction.</p><p>A shaft of light spilled into the room then, snaking across her legs and coating the metal door beyond. Completely taken by its brilliant, pale glow, Julia pushed to her feet and followed its origin. The long picture window was closed, but when she arrived at the glass and looked out over the unfamiliar setting, she gasped in amazement.</p><p>Parish opened the door and entered with the silent predatory grace he was known for as leader of the Hunters. His gaze went first to the bed, then shifted to the window where she stood looking out over the courtyard. He wondered how long she'd been standing there; poised at the glass, her arms spread, her hands curled around the edges of the sill. His gaze moved deliberately, covetously down her body. The sun was bathing her in its warm light, allowing him to see through her white T-shirt to the curves beneath. Deadly, brain-altering curves. His mouth filled with saliva and his cat scratched to get out, run at her and pounce.</p><p>He had to convince her to stay, but more importantly he had to convince her that he was the best male to protect her. Just the idea of Raphael assigning another male to guard her, another puma sniffing around her, looking at her with a desire only he should feel, made him insane with jealousy.</p><p>He wasn't willing to admit his claim on her out loud, but he would make damn sure the Wildlands' males felt it, sensed it, scented it, every time they got close to her.</p><p>He growled softly, and she instantly turned around. He waited for fear to ignite in her eyes, but all that appeared in her expression was relief. His heart softened, pressed against his chest as if it wanted to get to her. She didn't fear him. Unlike so many other females, she didn't fear him.</p><p>\"I can't believe this place,\" she said, turning back to the window. \"It's incredible. I thought I might be dreaming, but now I'm convinced of it.\"</p><p>He came to stand beside her. \"You shouldn't be out of bed.\" His words were meant to be gentle, caring, but they came out slightly gruff as his mind conjured images of taking her back to bed himself. Maybe curling beside her and purring against her neck.</p><p>\"What is it called again? This place?\"</p><p>\"The Wildlands.\"</p><p>\"I've never seen anything so beautiful.\"</p><p>Leaning against the window, Parish stared at her. No, neither had he. Far too beautiful for the likes of a scarred Hunter with a bad attitude. And yet, he couldn't look away from her, couldn't stand the thought of her leaving the bayou. How was this possible? Taken with a human? He hated humans. They had no conscience, no honor. They destroyed the good and the innocent.</p><p>They'd destroyed her.</p><p>His gut tightened with pain as it did every time he thought of Keira. How could he even think of caring for a human? Giving his protection to one?</p><p>\"It's so green.\" Julia glanced over at him, the smile curving her mouth echoed in her eyes. \"But shades of green I've never seen before. I mean, I've been to the bayou. Several times, in fact, but I've never seen anything like this. It's paradise.\"</p><p>He had always thought humans were attracted to electronics, tall buildings, glass and metal. Not the wild, untamed landscape he'd been born to, protected and loved fiercely. But the fact that Julia saw it as he did pleased him.</p><p>\"Do people know about it?\" she asked. \"Do they come here?\"</p><p>\"It's masked,\" he told her. \"To keep out intruders.\"</p><p>\"Like me.\" Her eyes flashed with sudden and unexpected humor.</p><p>He shook his head slowly. \"Unwanted humans.\"</p><p>\"And you are,\" her eyes cut to the landscape, then back at him, \"what exactly?\"</p><p>His brows drew together. \"Ashe told you. We are Pantera.\"</p><p>\"Cat shifters,\" she said.</p><p>\"Puma,\" he corrected.</p><p>She laughed softly and shook her head, returned her gaze to the Wildlands.</p><p>\"You don't believe it.\" He stared at her. It hadn't occurred to him she would need convincing. Not after what happened on the street in New Orleans. She couldn't have missed the rush of magic. \"You must believe.\"</p><p>She glanced back at him. \"Why? Why should this unwanted human-\"</p><p>\"You're different,\" he interrupted in a tone far too fierce for his liking. \"Ashe may want you here, but I need you, Julia Cabot.\"</p><p>The humor in her gaze instantly retreated.</p><p>Parish turned and rubbed his forehead against the cool glass. \"I don't know how to explain it. These feelings I have for you. I'm not good with words. Or making others feel at ease.\"</p><p>\"You're doing all right,\" she said.</p><p>Parish turned and looked at her. She wore a confused expression and her eyes looked incredibly blue and vulnerable. The sun blazed in through the window, turning her blond hair almost white. She looked like an angel. What was he to do about this, about her? He reached out and lifted a piece of her pale hair from her cheek, rolled it gently between his fingers. \"Soft.\"</p><p>Her eyes never left his, but her lips parted to draw in a shaky breath. Whether she accepted it or not, she was as affected by him as he was by her.</p><p>\"Will you stay here, Julia?\" he whispered, moving closer, his hand opening to cup her cheek. \"In this paradise? This dream you're not sure is real? Help Ashe? Allow me to protect you? I would consider it a great honor.\"</p><p>\"Parish...\" she whispered.</p><p>He groaned. \"Say my name like that again, Doc, and my mouth'll be on yours before you can take another breath.\"</p><p>Someone coughed. Someone by the door. Then a familiar female voice remarked, \"You're up. And Parish is back.\"</p><p>Damn woman. Parish growled blackly as Julia turned away from him. Raphael's woman was really starting to get on his nerves.</p><p>In the doorway, Ashe stood beside another female, small and grinning broadly as she looked from Julia to Parish with giddy interest. Parish believed the female to be Nurturer Faction, but in that moment he couldn't care less. He wanted her gone. Ashe, too. He wanted that moment of mutual need between Julia and him back. Now.</p><p>\"Seems like the musk has worn off.\" Ashe looked only at Julia. \"I thought if you felt up to it, we might take you to lunch. There's something I want to show you.\"</p><p>Parish narrowed his eyes at the woman. Forget the males sniffing around his human. What he truly needed to worry about was Ashe. Only one resident of the Wildlands was going to protect Dr. Julia Cabot, and it was going to be him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>THE Pantera ate lunch as a community. A spirited, tightly woven community who gathered around the fifty or so intricately carved wooden tables that ran along the bayou. Dressed with pale green cloth, each table was piled high with boiled shrimp, crawfish pie, etoufee, potatoes, corn, bread pudding, buttermilk cake and iced sweet tea. For Julia, who normally grabbed a salad or a cup of soup in the hospital cafeteria whenever she had a second free during the day, this sprawling, home-style picnic of a lunch was as overwhelming as it was delicious.</p><p>She glanced across the table at Ashe and grinned. \"This is the best meal I've ever had.\"</p><p>Ashe laughed. \"I know, right?\" She offered Julia another helping of creamy grits, then spooned some onto her own plate. \"At first I thought it was the pregnancy, but then I realized the food's just different here. Super fresh, homemade, and you know,\" she winked, \"maybe there's a little magic in there.\"</p><p>Julia didn't say anything. She'd been reminding herself how imperative it was for her to find the Wildlands' exit and get back home to New Orleans, that this wasn't real, and there was no such thing as puma shifters. But it wasn't so easy. The land surrounding the charming village was vast and completely rural. Where was she going to go? She didn't know this area. How dangerous would it be to just go walking off into the bayou?</p> <p>And then there was the undeniable curiosity she couldn't seem to shed. About Parish and the Wildlands. She hated to admit it, and had used her concern for Ashe as an excuse, but she was interested in this place, how it came to be, how it remained off the tourist trade's radar.</p><p>\"Oh, there's magic in everything here.\" Ines, the small woman with the dark hair and sable cat eyes who'd come to Julia's room with Ashe, sat at the head of the table. \"It's in the air and the earth and the water. Makes the food irresistible.\" With a grin, she added, \"The males, too.\"</p><p>Julia's mind instantly filled with images of Parish and she tried to combat them with a hefty spoonful of grits.</p><p>Ashe snorted. \"I believe mine was irresistible way before I came to the Wildlands.\"</p><p>\"Well, you're special,\" Ines said, reaching for the ladle in a nearby bowl. \"Have some of this, Ashe. Creole alligator. Cook's specialty. He was fresh caught this morning and very tender.\" Not waiting for an answer, the woman dropped a helping on Ashe's plate. \"You'll love it. As will your cub.\"</p> <p>Julia looked up from her plate. \"Cub?\"</p><p>\"Her child,\" Ines said, passing an entire buttermilk pie to the table behind them. \"It will be half puma. When it shifts for the first time from human form to cat, it'll no longer be considered a baby.\"</p><p>With wide eyes, Ashe glanced over at Julia. \"You see why I need a little human help here?\"</p><p>The woman's face was so momentarily panic-stricken, Julia couldn't help but laugh. She didn't believe what Ines was saying, couldn't, and wanted to scold the woman and find out why they were all feeding Ashe's psychosis. But as she sat there near the slowly moving bayou water, with the fish jumping over the floating vegetation and the sun filtering through the trees above, granting them a gentle, tolerable warmth, she couldn't bring herself to break the incredible mood of this village's picnic.</p><p>Maybe she was a coward.</p><p>Or maybe the magic of the Wildlands was starting to affect her, too.</p> <p>\"If you decide to stay, Dr. Julia,\" Ines said, a forkful of buttermilk pie on its way to her mouth. \"I would love to assist you. I'm a Nurturer, and trained to work with young, but so far I haven't been able to use my skills.\"</p><p>In that moment Julia turned away from the table and glanced around. She ignored the gentle, sweet breeze on her skin, the laughter, and the incredible scenery, to take in the people - the Pantera - at the tables nearest to them. She hadn't noticed it before, even on the walk over here, but there were no children anywhere. She'd heard what Ashe had said back in the medical facility, but she hadn't given it any thought. She hadn't believed it. The world around the bayou carried no infantile sounds, no cries or coos, no immature squabbles or echoes of pint-sized laughter coming from up and down the shoreline. Her heart clenched. It wasn't possible. Maybe they were at school. This couldn't truly be a community without young.</p><p>Her eyes cut to the woman who was leaning back in her chair, her hands spread protectively over her still-flat belly. \"How many weeks did you say you were?\"</p><p>\"Six.\"</p><p>\"How are you feeling?\" she asked, unable to stop herself from slipping into doctor mode.</p><p>\"With the pregnancy?\" Ashe asked. \"Good. Strong.\" She grinned. \"Happy.\"</p><p>\"No pain? Spotting?\"</p><p>She shook her head. \"I'm a little tired, and hungry. Always hungry.\"</p> <p>\"Hungry's good. Can I have your hand?\" Julia reached out and instantly curled her fingers around the woman's wrist. For one minute, she felt Ashe's steady pulse. \"Have you had your blood pressure taken? Any tests?\"</p><p>\"Nothing yet. I haven't been here that long.\" Ashe cocked her head to the side, her eyes playfully narrowed on Julia. \"You're sounding like a doctor, Doctor.\"</p><p>\"Hard habit to break.\"</p><p>\"Then don't break it,\" Ashe said, her eyes soft. \"Stay.\"</p><p>\"I don't think I can,\" Julia told her. \"It's complicated, I'm not sure...\"</p><p>Ashe's eyes darkened. \"It's Parish, isn't it? He's coming on too strongly.\"</p><p>Strongly, sensually, irresistibly.</p><p>\"He can't help it,\" Ines said, leaning forward. \"Hunters can be very intense, but Parish most of all. He lives in the caves, you know, rarely changes out of his puma state, and I don't think I've ever seen him smile.\"</p><p>\"Really?\" Julia said, deciding she hadn't heard the part about him rarely changing out of his puma state.</p><p>\"He's smiling now, Ines,\" Ashe remarked with a note of concern in her voice.</p><p>\"What? Where?\"</p><p>\"Over at the Hunters' table.\" She pointed behind Julia. \"I didn't want to make you self-conscious, but he hasn't been able to take his eyes off you since we got here.\"</p><p>Julia glanced over her shoulder, heart jumping into her throat as her gaze searched for the man with the long black hair and eyes that held such intensity, such heat. She'd wondered where he was, if he was having lunch with the rest of them, the Pantera. She spotted him about twenty yards away at a table that sat among a stand of river birch, its four legs submerged in an inch or two of water. Clustered around the table were ten or so of the most wild-looking, barely clothed, heavily muscled men and women she'd ever seen. And at the head, standing on a branch a foot above them all was Parish. He was barefoot and tanned, and wearing only a pair of faded jeans, which rested just below his hipbones. His hair was wild and the scar near his mouth winked in the sunlight. Julia's gaze moved covetously over every inch of him. His narrow waist and ripped stomach that widened to a broad chest, powerful shoulders and lean, muscular arms. He looked ready to spring. And the muscles in Julia's belly turned to liquid fire as she watched him watch her.</p><p>\"The Hunters moved their table to the water about ten years ago,\" Ines was saying. \"They like to see if they can catch prey from the bank. I swear they never tire. A wild bunch, but incredible at what they do. Most of the Factions take midday meal together, but Hunters always do.\"</p><p>\"He's very taken with you, Julia,\" Ashe said, not sounding all that pleased. \"Say the word and I'll tell Raphael to speak with him, get him to back off.\"</p><p>\"No, don't do that.\" She said the words very quickly, a fact that wasn't lost on Ashe.</p><p>\"You find him attractive. I can see that, but be careful.\"</p><p>\"Yes,\" Ines agreed. \"He is not the soft, gentle human male you're no doubt used to.\"</p><p>Good. I think I'm tired of human males.</p><p>She mentally kicked herself for the thought. As the warm, sultry breeze moved over her skin and the trees listed back and forth overhead, her gaze held Parish's. She couldn't look away. She didn't believe in magic, but goddammit, she wanted to believe in him, in whatever this was that burned between them.</p><p>\"Don't worry, Ashe,\" Ines continued. \"With his history, he won't think of her in a serious way.\"</p><p>The woman's words cut the invisible string that had locked her gaze to Parish's, and she whirled around to face Ines. \"What do you mean?\"</p><p>Ines shrugged one shoulder. \"Just that he'll never mate with a human. Not after what happened to his sister.\"</p><p>Julia looked first at Ashe, who shook her head, then back at Ines, who was now loading up her plate with a massive helping of bread pudding. \"What happened to his sister?\"</p><p>\"His twin actually, and the leader of the Hunters for nearly a decade. Keira was a complete warrior female. She was brilliant and tough and stunningly beautiful, and she was the only family Parish had. But she wasn't happy here. She wanted to see the world. She wanted to work outside the Wildlands.\"</p><p>\"What happened?\" Though even as she asked, she felt the answer in her gut.</p><p>Ines looked down at her plate and said in a small voice, \"She was killed. By the human male she fell in love with.\"</p><p>\"How terrible,\" Ashe remarked.</p><p>\"Since then, Parish has preferred his puma state, keeping to himself.\" Ines's eyes lifted, found hers again. \"I'm surprised he's showing an interest in you. It'll make our females jealous. Though some fear him, there are many who hope to catch his eye.\"</p><p>Julia glanced over her shoulder again, found Parish standing on the bank near his table. His attention was now on his Hunters, and as he spoke to them, one shuddered almost violently, then stretched his neck abnormally far forward. Julia's heart jumped into her throat. What was happening to him? A strange silver mist appeared, from the bayou or out of nowhere, Julia couldn't tell. But it moved over the man, and as it did his clothing seemed to melt into his skin. It was almost tattoo-like until-</p><p>\"Oh my god,\" Julia uttered, her gaze pinned on the man. No. He wasn't a man. Not anymore.</p><p>This had to be a dream. Or drugs. Maybe she wasn't even awake. She'd hit her head.</p><p>She gasped, gripped the table, as another man shuddered. Same stretch, same mist, same shift into golden brown...</p><p>\"They're going back to work,\" Ines remarked as though the sight before them was nothing out of the ordinary. \"The hunt's tomorrow and they have to secure the borders.\"</p><p>\"Oh, Julia,\" Ashe exclaimed excitedly, \"you have to stay now. I've never seen the hunt, but I hear it's amazing. We could go together.\"</p><p>Julia was only barely listening. Her gaze cut to Parish. Two large, golden eyed pumas were bracketing him. Pumas who had once been...human? How was this possible?</p><p>\"Parish leads the hunt,\" Ines said with a grin in her voice. \"He's incredible to watch. His cat is one of the fastest and fiercest predators I've ever seen.\"</p><p>The very moment Ines stopped talking, Parish looked over at Julia. Her heart thudded in her chest, her ears, her blood. Her lips parted as if she was going to speak, but instead her breath came out in a rush. Before her eyes, Parish shuddered, and in a wave of silver mist, he shifted into a large, powerfully built, slate gray cat. Julia might've said something or whimpered, she wasn't sure. Her heart was pounding so hard she was afraid it would rupture inside her chest. Her entire focus was trained on the incredible magic she'd just witnessed. The magic she could no longer deny. She'd thought the first puma she'd seen shift was beautiful, but he was nothing-absolutely nothing-to Parish. His broad head and luscious coat were formidable, but it was his eyes, gold flecked with blue and gray, rimmed with the darkest, deepest black, that took her breath away.</p><p>\"Seeing is believing,\" Ashe said behind her.</p><p>Julia stared at the male, the cat.</p><p>Parish.</p><p>She didn't turn back to face the women as she uttered breathlessly, \"It's real. He's real.\"</p><p>He's magic.</p><p>The puma opened his mouth and attempted to draw her scent deeper into his lungs. Now that she had proof of what he was, he wanted to see if, as she stared at him, her chemical reaction to him changed. Was she disgusted by his feline form or curious?</p><p>The slight hint of arousal that met the roof of his mouth made him growl.</p><p>He wanted to spring across the green, over tables and capture her between his teeth, toss her onto his back and return her to her room at Medical. He didn't like some of the looks the other Pantera males were giving her. They would need to be shown just to whom this new doctor belonged.</p><p>But before he could move a paw in her direction, two massive gold cats came bounding up to the table.</p><p>North border is secure, Mercier said, his deep voice booming inside Parish's head.</p><p>It was how they communicated in their puma form, but only when they were on duty. Rules regarding privacy had been established long ago. A Hunter never spoke or listened in to the thoughts of other Hunters unless they were working.</p><p>Parish turned to the other for her report. Rosalie?</p><p>Her silence instantly drew his concern. What is it?</p><p>Could be nothing, she said, nodding at a few of the other Hunters who stood nearby. Could be big game or a few nosy locals, but I picked up traces of human male scent near the east border.</p><p>Parish's gut tightened. How many?</p><p>Three.</p><p>Shit. And right before the hunt. He cut his gaze to Mercier. Let's go. You, me, Rosalie and Hiss. I want to see what we're dealing with. He turned to the other five Hunters who had already shifted and were calmly and attentively waiting for their orders. Split up. Run the west and southern borders. I want every inch scented.</p><p>Parish took off along the water's edge, glancing at Julia as he passed. She was watching him with wide eyes and a stunned expression. He'd wanted to stay with her, get her reaction to his cat firsthand and find out when she could be moved to Natty's house. But it looked as though he'd have to wait until later. In the meantime, she would be protected at Medical, and he would make sure she, and every Pantera in the Wildlands, remained safe from those who might wish them harm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>THE three-story Greek Revival house sat on an impressive expanse of lawn, with a small stream a few yards from the front door, and several raised Creole cottages in the distance. On her way there, walking through the Wildlands' village, with Raphael at her side and men and women shifting in and out of their puma states as they went about their day, Julia had pretty much stopped questioning her surroundings, the magic, the shifting creatures, and how such a remote spot so deep within the bayou could be the most incredible oasis she'd ever laid eyes on.</p><p>Maybe tomorrow she'd wake up to a different reality, but for now, for tonight, she was living among the Pantera.</p><p>\"I thought this would suit your needs rather nicely.\" Miss Nathalie, the proprietor of the boarding house, stood in the doorway of the top floor bedroom, her hands on her hips as she looked around. \"But I have two others downstairs that're unoccupied I could show you.\"</p><p>Julia smiled at the tall, pin-thin woman who appeared to be in her early sixties. \"It's perfect.\" And it was. Spacious, yet cozy, the room sported white and pale blue wallpaper and linens, elegant handmade furniture, and a clawfoot bathtub in a small alcove that overlooked a massive oak tree. It was like something out of a magazine. \"You have a beautiful home,\" she told her.</p> <p>The woman grinned, leaning against the doorframe. \"Oldest one in the Wildlands. My great, great grandparents built it...or maybe they conjured it with magic.\" When she laughed, her pale green eyes sparkled with gold. \"Never can be sure.\"</p><p>\"I'd believe the magic part.\" Julia's eyes came to rest on the bed. Queen-sized with dark wood that rose to an intricately carved canopy.</p><p>\"My children did, too,\" Miss Nathalie remarked a bit wistfully. \"They loved it here, but they're gone now. Livin' on their own. Both of 'em Suits. Diplomatic Faction, like Raphael. Not sure how that happened when their papa and I are Nurturer. But the Shaman always knows.\"</p><p>Julia's attention shifted back to the woman. \"The Shaman?\"</p><p>\"Ah, yes. She's been here longer than anybody, even the elders.\" As her grin widened, the woman looked about twenty years old. \"She's magic, she is. Predicted the placement of every Pantera cub born.\"</p> <p>How incredible, Julia thought, and yet completely in keeping with the mystery of this secret bayou village. \"So you don't decide which Faction you're going to be in, or your child's going to be in?\"</p><p>\"No, Gal. The magic decides. You're born to it. It's already inside you. Been a long time since we've seen the Shaman make a prediction.\" Her eyes suddenly brightened. \"But if you stick around you might see for yourself.\"</p><p>She was speaking of Raphael and Ashe's child. The one Julia had been asked to help bring into the world. The more she learned about the history and complications of the Pantera race, the more interested she became, and the more pressure she felt. She wanted to help them, help Ashe, but frankly, she wasn't sure she had the skills. This child, and Ashe's pregnancy, they would be something she'd never experienced before.</p><p>\"Glad you're here, Gal,\" Miss Nathalie said as she moved into the room and headed for the window. \"Nice to have a female around.\"</p><p>\"You don't get many female boarders?\"</p><p>\"Most who come here are males.\" She turned, pressed her back to the large pane of glass. \"Mates who've been sent away by their females.\"</p> <p>Julia laughed. \"Really? Why?\"</p><p>\"Got mated too quick, without understanding the way a female works.\"</p><p>Julia felt her cheeks warm. \"I see.\"</p><p>Miss Nathalie laughed at her expression. \"No, no. Not that way, Gal. Every Pantera male is gifted when it comes to sex. Their animal takes over, knows innately how to please their partner. But with the animal comes a lack of personal skills. Some of our males, even the Nurturers, don't know how to listen, comfort, be a friend to their mates. That's where I come in. And this place. They stay, and I talk to 'em, school 'em until they're ready to go home.\"</p><p>\"In other words,\" came an irritated male snarl near the bedroom door. \"She has them neutered and declawed.\"</p><p>Julia's heart lurched into her throat and she turned to see Parish standing in the doorway. She always forgot how tall and broad he was. He looked gorgeous, freshly showered, in jeans and a black T-shirt, his expression wicked. And those eyes, they still glowed with the gold heat of his puma.</p><p>Julia couldn't tell herself it wasn't true anymore. She'd seen it with her own eyes. And damn, if it hadn't been the most glorious sight ever.</p><p>\"Your time'll come, Parish Montreuil,\" Miss Nathalie said with a soft chuckle. \"If you ever meet the right gal, that is.\"</p> <p>Parish didn't answer her. He was too busy looking at Julia. His gaze raked down her body, a combination of desire, concern and anger shadowing his expression. \"Raphael will feel my fangs for this.\"</p><p>\"What are you going on about, Hunter?\" Miss Nathalie asked, her teasing, motherly tone dissolving as she sensed his ire.</p><p>\"Looking after Dr. Cabot here. Guarding her.\" His eyes cut to Miss Nathalie. \"She was moved from Medical without my knowledge or my consent.\"</p><p>\"Raphael brought me here,\" Julia said, not understanding his fierceness. \"He didn't say anything about me having a guard.\"</p><p>Parish's gaze ripped back to her and he growled softly. \"Well, you do. And it's me.\"</p><p>Julia's heart leapt in her chest and she felt slightly breathless. The way this man looked at her, with the animal behind his eyes, was as worrisome as it was erotic.</p><p>\"Oh my.\" Her expression brimming with humor, Miss Nathalie turned to Julia, her eyebrows raised. \"What do you say to this, Miss Julia? Shall I kick this self-important feline out of my house, or do you want to accept his care?\"</p><p>\"She has no choice,\" Parish said quickly, moving into the room, toward her.</p><p>No choice? Oh, he wasn't going to take it there, was he? He might be the sexiest, most gorgeous man she'd ever known, but no one was going to run Julia Cabot's life but her. Not anymore. Not even in this amazing place where magic actually existed. She glared at him as he approached, and spoke slowly and clearly. \"I will always have a choice, Parish Montreuil. Got it?\"</p><p>Dark brows lifted over blazing gold eyes.</p><p>Miss Nathalie chuckled. \"I like this human gal.\"</p><p>Parish looked stunned, as though he wasn't used to being scolded or contradicted. He moved past her, his gaze going from the tub to the bed. \"You need someone to protect you, Dr. Cabot. A human living among the Pantera, it's asking for trouble.\"</p><p>\"Maybe I like trouble,\" Julia found herself saying. Maybe I'm even asking for it.</p><p>Parish turned to face her. At first his expression was tight, and Julia thought he was gearing up for another verbal argument. But after moment, his face broke into a broad smile, then he started to laugh. \"I think I might like this human gal too, Natty.\"</p><p>\"Peas in a pot, I never thought I'd see this day,\" Miss Nathalie uttered, shaking her head. \"Cave-dwelling, arsenic-spewing Parish Montreuil, laughing his fool head off.\"</p><p>\"I'll be staying for supper, Natty,\" Parish said, though his eyes remained fixed on Julia. \"So make sure it's a good one.\"</p><p>\"It's Miss Nathalie to you, and you'll eat whatever I put in front of you. And you'll like it.\"</p><p>He growled playfully low in his throat, and Julia felt the sound all the way to her toes.</p><p>\"Growl like that at me again, Feline, and I'll have you peeling potatoes with your canines.\"</p><p>\"Can't.\" Parish reached out suddenly, and took Julia's hand. \"I'm taking Miss Julia for a walk.\" He purposefully gentled his tone. \"If she accepts my care, that is.\"</p><p>His hand felt strong and callused in hers, and she had the strangest desire to tighten her grip on him. The warmth of him seeped through the skin of her palm and into her blood. She had to force herself to breathe as she looked up at him. \"She accepts. For now.\"</p><p>Miss Nathalie snorted. \"Well, be back before the sun goes down.\" She was on her way out the door when she added, \"Supper's at six-thirty sharp.\"</p><p>The minute she was gone, Parish rounded on Julia, pulled her close until they were just a foot apart. His dark eyes flashed with gold as he gazed down at her. \"Don't do that to me again, Doc.\"</p><p>Breathing still felt awkward. \"What?\"</p><p>\"Leave. Without telling me first.\"</p><p>Heat was pouring off his body. \"I didn't. Raphael came-\"</p><p>\"I know,\" he said quickly. \"But I'm asking you, wait for me next time.\"</p><p>The strength and intensity of his gaze was affecting her brain, how it processed. \"You were worried?\"</p><p>His nostrils flared and he growled at her softly. \"Out of my mind. Until Ashe told me where you were.\"</p><p>\"I'm sorry.\"</p><p>\"No.\" He squeezed her hand. \"You have nothing to be sorry about. I know I'm overbearing and blunt and a scarred-up wreck of a male, but I have to protect you.\" He looked like he wanted to say more, but held himself back.</p><p>\"Because of the baby,\" Julia prompted, her breathing still uneven and shallow as she stared up at him.</p><p>\"It should be because of the baby.\"</p><p>\"But it's not.\"</p><p>He shook his head, his gaze fierce with wanting.</p><p>Julia's skin prickled and her mouth felt suddenly dry. No one had ever looked at her like this. No one had ever said such words as their eyes filled with deep, vulnerable need. And yet, even with her newfound belief in magic and honorable, sexy, shape-shifting males, the fear of failure, of getting hurt, of what had happened with Gary-with all the Garys in her past-clung tightly to her heart.</p><p>\"You've got to understand something,\" she began, \"I'm just getting out of a relationship. I don't want to-\"</p><p>\"That wasn't a relationship, Julia.\" His thumb rubbed her palm gently, but his expression was resolute. \"That was a lie told by an arrogant, self-centered piece of shit who had no idea what he had. What he was blessed with.\" As his gaze roamed her face, his eyes turned completely gold. \"If I was lucky enough to be claimed by you, I'd never give you cause to wonder.\"</p><p>Tears formed in Julia's throat. His words, his gaze...the blatant sincerity behind both...this man had the power to change her, her heart and her soul, if she would ever allow it.</p><p>\"Come, Miss Julia,\" Parish said, turning and leading her toward the door. \"You think what you saw today at midday meal and out your window was beautiful, you haven't seen anything yet.\"</p><p>She felt like heaven on his back.</p><p>The weight of her, the way her thighs gripped the sides of his body. And her hands, fisting the fur at his nape as he ran the familiar course, weaving in and out of trees with the warm bayou air against his face.</p><p>Damn, he could get used to this.</p><p>Several feet from the bluff, his puma came to a halt. For one exceptional moment, he looked out over his sacred space and purred as Julia leaned down, wrapped her arms around his neck and squeezed. He'd never brought anyone here. It was the secret hideout he and Keira had spent hours playing in as cubs, then the home Parish had created after she'd left. No...after she'd been murdered. A mile from anything Pantera, anything that wanted to talk, lecture or demand, the caves had been his solace. While the scent of the bayou, the sharpness of the rocks, and even the intensity of the heat had become his family. He'd never needed more than that to feel whole, never craved more.</p><p>Until now.</p><p>Until her.</p><p>Parish allowed Julia a moment to slide off his back, then quickly shifted and walked to the very edge of the bluff. As was his daily custom, he took a visual inventory of each curve of rugged hillside and the caves above, the heavy vegetation that hung from the rocks and dipped gently into the warm water of the bayou pool below. He sensed nothing unusual or threatening, and his muscles relaxed.</p><p>\"Incredible,\" Julia said behind him, her tone awestruck.</p><p>Glancing over his shoulder, Parish eyed her with just a hint of playful arrogance. \"Me or the landscape?\"</p><p>She smiled. \"You within the landscape.\"</p><p>\"Thank you for that.\" He smiled back and reached for her hand. When she instantly curled her fingers around his, his cat purred. Her touch did what nothing else could: comforted him, made him feel something remarkably close to happiness.</p><p>Keeping her protectively at his side, Parish led her down the incline to the grassy bank near the pool. The scent of bayou coated the insides of his nostrils, and he breathed it deeper into his lungs.</p><p>\"I'm not sure of the reason,\" he said. \"But the water here is incredibly warm.\"</p><p>\"And clear.\"</p><p>\"And remarkably free of critters.\"</p><p>She laughed. \"Do you bathe in it?\"</p><p>He turned. \"I do.\"</p><p>Her eyes flashed with sensual interest. \"I thought cats weren't supposed to like the water.\"</p><p>\"I'm not your typical cat.\"</p><p>\"Really?\"</p><p>He nodded.</p><p>\"Prove it.\"</p><p>His eyebrows lifted. \"You want me to go in the water? Bathe in your presence?\"</p><p>She pretended to think for a moment, then she smiled. \"Yes, I believe I do.\"</p><p>He chuckled. \"Fine, but you're going with me.\"</p><p>\"What?\" A choked giggle erupted from her as he slid one arm around her back and another under her knees. \"No. Wait.\"</p><p>He lifted her up and started walking into the water. \"Don't struggle, Doc. I might drop you.\"</p><p>\"Okay, okay,\" she said, laughing, kicking her feet. \"You called my bluff.\"</p><p>\"Never dare a Pantera.\" He waded farther in.</p><p>\"Come on, bring me back.\"</p><p>\"You want me wet and I want you-\"</p><p>\"Parish!\" she cried out in shock.</p><p>He stopped, the water swirling around his waist, his entire body tense as he gazed down at her. \"What did you call me?\"</p><p>\"Parish,\" she said, this time with a wave of heat attached to each syllable. She bit her bottom lip, suppressing a giggle.</p><p>He lowered his head and lapped at that bottom lip with his tongue. \"Oh, Doc,\" he uttered. \"I warned you what would happen the next time you said my name like that.\"</p><p>Her eyes flashed. \"Yes, you did.\"</p><p>His mouth closed over hers, hard and hungry, and he groaned with the instant and incredible feel of her soft, wet lips. She could drive him insane with just her scent, her warm breath. He suckled her bottom lip, then nipped it, and when she whispered his name again and pressed herself closer, he thrust his tongue inside her hot mouth and claimed her.</p><p>Christ, how did he tell her?</p><p>How did he form the words, then release them?</p><p>How did he make her understand when he himself barely did? She didn't live in his world or understand how things were when a Pantera male claimed a female.</p><p>How could he explain to her that there was no going back? That she belonged to him now.</p><p>His hands gripped her thighs and waist as he caressed her tongue with his own, then plunged it deep inside her mouth, over and over until they were both panting. There. See how much I want you, Julia Cabot. Understand that you are mine.</p><p>Water splashed as she suddenly struggled in his arms, trying to turn, reposition herself. When she faced him, her legs wrapping around his waist and squeezing, Parish growled and caged her ass in his palms as he took her mouth again. Fuck. She was wet. And not just from the splash of the warm bayou water around them. He could feel her damp pussy through the fabric of her jeans. It ground against him, calling to his rigid cock, begging to be filled, fed. And he wanted to oblige. He wanted take her, rip her clothes from her body and sink himself balls-deep into her tight, tender flesh.</p><p>Just the thought of it made him mad with lust. He'd never wanted anything or anyone like he wanted her. The intensity of his desire almost frightened him.</p><p>He ripped his mouth from hers and nuzzled her neck, ran his sharp canines gently across her pounding pulse.</p><p>\"Parish?\" she uttered on a moan.</p><p>He lapped at her pulse, wondered what her blood would taste like. \"Hmmmm?\"</p><p>She gasped, pressed her breasts against his chest. \"You said this pool was free of critters.\"</p><p>\"Mmmmmm...Yes...\"</p><p>\"Then...what's that behind you?\"</p><p>His mind came awake like a shock of electricity. He drew back from her neck and whirled around, coming face to face with a small alligator. The thing was only about two feet long, but it was packing a set of impressively sharp teeth. Protective of his woman, his puma rose to the surface and growled, flashing the small creature his own set of sharp and deadly hardware. The alligator instantly turned around and swam the other way.</p><p>\"Damn reptile,\" Parish grumbled, still gripping Julia's sweet ass as he carried her to shore. His body screamed with need, his cock hard as stone and pulsing. But he wasn't risking another encounter with sharp teeth.</p><p>Other than his own.</p><p>If she was willing.</p><p>His puma purred at the thought. For a second, he wondered about taking her to the caves above, where he lived and slept. But it didn't seem right, didn't feel like the proper place to take the female he intended on claiming as his mate. Not for their first time together, anyway. He had enough cold, hard stone to deal with as it was.</p><p>At the bank, he gently eased her to her feet and tried to get his mind to focus on something else, something that would make his cock calm the hell down. But one look her way, one brief trip down her body, had the thing creaming at the tip.</p><p>Wet clothes clinging to delectable hips, round succulent breasts and erect nipples.</p><p>Fuck.</p><p>He grabbed her hand and started up the incline to the bluff. \"Sun's going down. We should get back.\" His tone was nearly a growl. \"Natty'll have my hide if I bring you home late for supper.\"</p><p>\"Can't have that.\" The thread of unfulfilled desire in her tone was unmistakable.</p><p>Parish cursed inwardly. \"Nope.\"</p><p>\"You're probably hungry.\"</p><p>You have no idea, Doc.</p><p>\"Parish?\" she said as they reached the top of the hill.</p><p>\"Yeah.\"</p><p>\"Was that magic?\"</p><p>His head came around, and his eyes met her hers. \"What?\"</p><p>She looked disheveled in the sexiest of ways: pink cheeked, and eyes wide and heavy with lust. \"Not the alligator or your shift, but what happened in the pool, between us. Was that magic?\"</p><p>Parish felt his heart squeeze inside his chest. \"No, Doc.\" He drew her closer. \"That was so much more.\" That was just the beginning.</p><p>Before he took her right there on the bluff, he shifted back into his puma, then waited for her to climb onto his back and fist his fur. He couldn't wait much longer to have her. When the moon rose and stole the bayou heat, she'd lie beneath him, and she wouldn't just be speaking his name. She'd be screaming it.</p><p>His puma roared into the coming eve and he took off into the trees. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>DINNER had been fantastic. Or at least Julia assumed it had. Her plate was clean, she just couldn't remember actually tasting any of it. Ever since she'd returned to the boarding house, all her tongue seemed to want to register was Parish. And if that wasn't bad enough, all her mind wanted to bring forth were images of their incredible time at the bayou pool.</p><p>She let out a long breath. She could still feel his arms around her, so tight, so possessive, his mouth working hers with soft kisses, hungry bites and snarls of arousal. She'd known what he'd wanted from her. Not because it was pressed against her belly, inciting the blazing heat inside her sex to liquefy, but because it was exactly the same thing she'd wanted from him.</p><p>The deepest, most intensely erotic fuck of her life.</p><p>Her body contracted at the thought, and she gripped the table. What would it be like to be touched by him? Her back to the mattress, Parish looming above her, the muscles in his arms and chest and stomach pulled tight under sweat-laced, tanned skin?</p> <p>\"Dr. Cabot?\" came a soft male growl.</p><p>Julia glanced up from her empty plate and caught Parish staring at her across the dinner table with a mask of sensual ferocity, his black hair loose to his shoulders. He was so sexy. Every inch of his face, from his eyes to the scar near his lips, tempted her, made her mouth water.</p><p>His nostrils flared. He glanced left, saw Nathalie chatting it up with one of the other boarders down the table, then returned his gaze to Julia as he leaned forward.</p><p>\"You have to stop thinking about us or I won't be able to stop myself from throwing you over my shoulder and hauling your sexy ass upstairs to bed.\"</p><p>Julia's mouth dropped open. \"How did you know-?\"</p> <p>\"Your scent.\"</p><p>My scent?? She tilted her head in the direction of Miss Nathalie. \"Does she know?\"</p><p>\"Probably.\"</p><p>Oh my god. \"I'm so embarrassed.\"</p><p>\"Don't be. She knows how I feel about you.\" He grinned, molten gold flashing in his eyes. \"And now she knows that as you're thinking about my tongue in your mouth,\" his voice dropped, his chin too, \"I'm thinking about my tongue somewhere else.\"</p><p>Julia's eyes widened, yet everything below her neck went hot and tight. \"Stop that,\" she whispered.</p> <p>\"Impossible. Your scent makes me insane.\" His canines lengthened.</p><p>\"You're not the only one,\" remarked the male down at the far end of the table beside Nathalie.</p><p>Julia turned apple red and cursed, while Parish flashed the male his puma. \"Don't even think about it, Mace. In fact, keep your eyes on your plate.\"</p><p>The male grunted. \"I'm mated, Hunter.\"</p><p>\"Then you remember exactly what's running through my blood right now,\" Parish said with a deep growl.</p><p>Nathalie stared at Parish, but spoke to Julia. \"Perhaps you should retire, Miss Julia. Might I suggest a bath?\" She sighed. \"With soap.\"</p><p>At first, Julia was so consumed with the aggressive banter of the two males at the table she didn't catch the woman's meaning right away. But when she did, she closed her eyes and winced with humiliation. She was turned on thinking about Parish, every damn feline in the room could smell it, and she was being told to get upstairs and wash it off. What the hell ever happened to privacy? She pushed back her chair and scrambled to her feet. Her eyes were drawn to Parish. \"Are you staying tonight or...\"</p><p>\"He'll be sleeping on the porch,\" Miss Nathalie said quickly.</p> <p>Parish hissed at her. \"I will sleep wherever I want, Female.\"</p><p>\"Outside?\" Julia said. \"But-\"</p><p>\"Not to worry, Miss Julia,\" Nathalie continued. \"He's used to it.\"</p><p>\"Isn't it time to clean up?\" Parish growled softly, his eyes narrowed on the older female.</p><p>Miss Nathalie ignored him. \"After all, he still sleeps in those caves a mile out, don't you, Parish?\"</p><p>\"Dammit, Natty!\" He pushed back his chair and stood.</p><p>\"What?\" she grumbled. \"Isn't a secret, now is it?\"</p><p>Julia turned to him, confused. \"You live there? Where we were today?\"</p><p>He didn't answer. His nostrils were flared with irritation as he continued to glare at Miss Nathalie.</p><p>Julia stared at him. Why wouldn't he have told her that? And why was he refusing to look at her? Was he hiding something? Or was it that he just didn't think her important enough to share information about his personal life?</p><p>A spark of apprehension moved through her. She hated this feeling, that something was being kept from her. That the man she'd just been fantasizing about, had just kissed like she'd needed it, needed him, to breathe, wasn't being honest with her. It gave her a killer sense of deja vu.</p><p>She turned from him and offered Miss Nathalie a small smile. \"Good night. Thank you for dinner.\"</p><p>She needed a moment to herself. Needed to really think about what she was doing here, and how long-</p><p>As she walked out of the room, she heard Parish growl behind her. \"Julia.\"</p><p>\"Let her be, Parish,\" Nathalie scolded.</p><p>\"Like hell I will.\"</p><p>\"You're acting like a jackass.\"</p><p>\"No,\" said Mace. \"He's acting like a mated Pantera male.\"</p><p>Julia only made it to her bedroom door before Parish was upon her.</p><p>\"I didn't tell you about the caves for a good reason.\" He followed her inside the blue and white bedroom suite.</p><p>\"They're all good reasons,\" she said, heading for the windows.</p><p>\"I know what you're doing, Doc.\" He kicked the door closed behind him. \"Don't compare me to that lying bastard who cheated on you.\"</p><p>\"I'm not.\"</p><p>\"Turn around.\"</p><p>She heaved a great sigh and turned to face him. Her cheeks were flushed, her eyes a shocking blue against the pale hair that hung about her face.</p><p>\"I'm not comparing you to Gary,\" she said. \"There is no comparison. He was a mistake, and you...you're a hope, a dream...magic...\" Shadows moved over her eyes. \"It just scares me, Parish.\"</p><p>Fear was the last thing he ever wanted her to feel with him. \"What scares you?\"</p><p>\"I've never wanted to be with anyone more than I want to be with you.\" Her voice caught as she spoke, and her eyes brimmed with tears. \"I actually ache for you. I think about you every second.\" She shook her head. \"My body responds to your voice like it's your touch. That's not normal.\"</p><p>He hated how upset she was, how fearful she sounded because to him her words were his magic, his potential first step back into life, and a future he never thought he'd see. He crossed the room and pulled her into his arms. \"Look at me.\" One hand raked up her spine to her neck. \"That's our normal, Doc. My mind is filled with you, too. Your tears make my fucking heart ache. I don't know what to do with this desperate need I feel for you, except...this.\" He dropped his head and kissed her, groaning at the raw hunger and blatant need between them. When he pulled back, he found beautiful, stormy blue eyes gazing up at him. \"Julia...\"</p><p>\"I love when you say my name,\" she whispered.</p><p>His gut tightened. \"I didn't tell you about the caves because I was ashamed.\"</p><p>Her brow furrowed. \"What?\"</p><p>\"I know you're aware of what happened to Keira.\" The damned tortured sound in his voice never went away. \"Ashe told me. But what you don't know is that she was my everything, my only family, my best goddamn friend, and when she left, when she was killed I...fuck...I went to the one place where I felt closest to her.\"</p><p>\"The caves,\" Julia whispered.</p><p>He nodded. \"I never left. Never wanted to.\" He reached up and cupped her chin and cheek in his palm. \"Until you.\"</p><p>\"Oh, Parish...\"</p><p>He smiled. \"I love it when you say my name too, Doc.\" He captured her mouth again, kissing her frantically. \"I want you.\" He nipped her lip. \"Christ, the scent of your heat. It calls to me, begs me to taste.\" With one hand around her waist, he easily lifted her. \"Let me earn my way into your bed.\"</p><p>\"You already have,\" she said breathlessly.</p><p>He tossed her onto the bed, then drew back. \"Not even close.\" He stripped bare, and grinned as her gaze moved hungrily over him. \"You know what I am.\"</p><p>Her eyes lifted, connected to his. She nodded.</p><p>He growled softly at her. \"Then open your legs for me, Julia. This cat must have his cream.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>JULIA had never been undressed so quickly, so frantically, and with such desperate hunger in her life.</p><p>And she loved it.</p><p>Her back to the mattress, her legs bent and spread, Julia trembled with heat and desire as she stared up at Parish. Without clothes, he wasn't just sexy-he was stunning. Drool-worthy. His powerful body flexed with every movement, each muscle defined. But it was the long, thick muscle standing hard and proud against the six-pack of abdominal perfection that made her mouth water. What would he feel like in her mouth, taste like against her tongue? She almost reached for him when he knelt, placed his hands under her buttocks and yanked her to the edge of the mattress.</p><p>His breath fanned her stomach and hipbones. \"I've thought about this ever since we met. How you looked, scented...\" He lowered his head and lapped at her. Just once. Julia gasped and arched her back. \"How you tasted.\"</p><p>How was it possible that just one swipe of his tongue made every muscle in her body jump? He was magic. There was no other explanation for it. She lifted her head to see what he was doing, and the blood rushed to her sex. Nostrils flared, dark eyes glittering with exotic desire, his gaze was locked between her thighs.</p><p>A soft growl came from his throat. \"You're so beautiful, Doc. Every inch of you is soaking wet. Your pussy's like a ripe peach, juice running down your leg.\" Once again, he dropped his head, but this time he ran his tongue up her inner thigh.</p><p>Julia nearly came right then. His tongue. It wasn't smooth like a human's. It was slightly rough, like a...</p><p>She stared at him.</p><p>\"Cat,\" he said with a grin, lapping at just the edges of her sex. \"So sweet. Christ, I think I'll drown in you.\"</p><p>The heat building inside her burst into flames. Her ass clenched, her breasts tightened into sensitive buds and she felt her pussy cream right before him.</p><p>Parish saw it too and his canines dropped. \"My cock's crying for you too, Doc. But first I'm going to fuck you with my tongue.\" Without another word, he curled his fingers around her knees and spread her wider. He purred, his eyes glowing. \"Oh, yes...there it is. Your clit is ripe, Doc. So damn pretty. So pink.\"</p><p>Julia's legs shook, her sex pulsed and ached to be filled, touched, eaten. God, she was going to go out of her mind just from the way he talked. \"Please, Parish...\" she moaned, letting her head fall back on the mattress.</p><p>\"Spread yourself for me,\" he commanded, his breath fanning her wet sex. \"Wide. I want my entire mouth on you, my tongue thrusting inside you as my lips suck that plump little clit.\"</p><p>With trembling fingers, Julia moved her hands down her belly, over her hips and into her hair. She gasped at how wet she was, how sensitive.</p><p>\"Hurry, Doc,\" he growled with need, his fingers digging gently into her thighs. \"I want to taste you before you come, and you're so ready.\"</p><p>His shoulders pushed between her legs, and the minute she spread herself wide, he latched onto her clit, suckling gently as his tongue flicked feather-light. In seconds, she came. Spasming on the mattress, her hips slamming upward, pumping as she moaned. Dammit. It's too soon. Too fast.</p><p>Just as she was about to lift her head, Parish chuckled against her sex, his hot breath making her writhe. \"Now, we can begin.\" Without another word, he thrust his tongue up into her, and fucked her in slow, rhythmic strokes.</p><p>Her hands fisting the bedspread, Julia tried to focus but it was impossible. She was so tense, so heated, her body refusing to come down from the orgasm. It wanted more. It craved more.</p><p>He drew back then, eased his tongue out of her and replaced it with two thick fingers. \"I feel you around me,\" he growled, thrusting into her so deeply she felt it at her belly. \"You're so wet, suckling my finger.\"</p><p>\"Oh, god,\" she moaned as he started licking her again, using his entire tongue in greedy circles.</p><p>Julia didn't know what to do with this feeling. She'd never experienced such mind-numbing pleasure. She wanted him so badly, yet didn't want him to stop licking her or thrusting his fingers inside her.</p><p>She released her pussy lips and plowed her fingers through his soft, thick, hair. She scratched at his scalp as he ate her. Instantly, he started to purr, the sound making his lips and tongue vibrate against her. Her eyes slammed open and she gasped in a breath. She was going to come. Again.</p><p>\"Parish, please,\" she begged, rocking her hips against his face, her juices pouring out of her, down her thighs. \"I want you inside me.\"</p> <p>But he wouldn't stop. Hungry and determined, he drank her down, his purr coiling around her aching clit.</p><p>The climax that tore through her was raw and shocking. For a moment, she was blind and deaf, all her senses pooling below her waist. She cried out, pumping wildly, barely feeling him draw back and loom over her. She could hardly breathe, and her eyes were as wet as her sex. Nothing could feel better. Nothing.</p><p>And then she felt something nudge against her sensitive mound. Instinct blossomed inside of her and she reached out and grasped him. Hot, rock-hard cock filled her hand, and she moaned a hungry, \"Yes.\" Up and down, she stroked him until he started to breathe differently, moan, curse, and pump himself off in her palm.</p><p>\"Inside,\" he growled. \"I need you. I need to be up inside you where it's hot and tight and still shaking from your climax.\"</p><p>She released him, and he entered her with one quick, deep, gasp-inducing thrust. Julia gripped his shoulders, her nails digging into his skin. He felt so right there, so perfect.</p><p>\"Wrap your legs around me, Doc. I want to ride you.\"</p><p>She groaned, closing her thighs, her heels squeezing his tight ass. For one moment, his eyes met hers and he grinned. Then he started to fuck her, deep and slow, all the way to her womb. Oh, the pleasure. The heat.</p><p>\"You've claimed my heart, Julia Cabot,\" he whispered against her mouth as his thrusts quickened. \"It's useless to anyone else, but full of life and love and desire for you. I want no one but you.\"</p><p>Oh, god yes. She wanted him, too. But... \"I'm scared.\"</p><p>\"Of what? Being loved? Taken care of? Respected and desired? Of never having to worry about my devotion, my commitment?\" His kissed her, then settled in the curve of her neck. \"Pantera mate for life, Julia.\"</p><p>She gasped as he bit her gently.</p><p>\"Tell me I can claim you.\"</p><p>She moaned.</p><p>\"Tell me you want not only my cock inside of you, but my mark on your body.\"</p><p>\"I want you,\" she cried out, climax so close she could taste it. \"All of you.\"</p><p>He growled harshly, \"Mine...all mine,\" as he scored the skin between her waist and navel with his claws and pounded her deep into the mattress.</p><p>Julia came with a jolt and a scream, and as she did, Parish roared out her name, pumping his hot seed into her soaked and sensitive pussy. Freefalling, Julia slapped her arms around him, holding on tight as he continued to come inside of her.</p><p>Long minutes passed before he rolled to his side, but when he did, he didn't break their connection. His powerful arms curled her snugly against his chest, where she rested and tried to catch her breath. Tears threatened as she gripped him possessively, almost fearfully. Had he truly marked her? Was that the delicious sting she felt on her abdomen? And if so, what did it mean?</p><p>Oh, god...</p><p>Parish kissed her hair and whispered, his voice raw with emotion. \"Tell me you're going to stay. Here. In the Wildlands with me. I need to hear it.\"</p><p>Her heart squeezed. \"I want to.\"</p><p>\"But something holds you back. What is it?\"</p><p>She rubbed her face against his hard pectoral. \"I don't know. I have nothing back there, nothing but my cat. But how do I trust my wants and desires when they've always led me into failed misery?\"</p><p>He tipped her face up to meet his, brushed the hair from her cheek so lovingly she nearly burst into tears. \"Perhaps this time you should trust your gut and your instincts. I watched you that day in the hospital. You used them delivering the child, didn't you?\"</p><p>Her breath caught in her throat. He'd been watching her? \"Yes.\"</p><p>He smiled. \"You have Pantera in you, I think. When I looked at you for the first time I felt need and desire unlike anything I'd ever felt. But you were human, and I was lost in anger and grief. It was my gut and my instinct that told me we belonged together.\"</p><p>Stunned, Julia just stared at him. She'd never heard such a thing. No man had ever talked to her like this, told her to trust herself and her instincts. What more was she looking for? A sign? Christ, she had magic.</p><p>Exhaustion overtook her thoughts and she cuddled in close to Parish as he kissed her hair and stroked her back until she fell asleep. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>JULIA woke to a strange, yet familiar sound.</p><p>The emerging light of dawn filtered into the room, casting shadows on the walls and floor. Beneath the covers she was warm, but instinctively she knew that Parish was gone. The hunt. He would need to prepare before dawn.</p><p>Meeeooowww.</p><p>Julia's head jerked around to where Parish had lain on his side, holding her, still connected to her as he soothed her to sleep. He was gone, but something else was curled atop his pillow. Julia screeched with joy, and threw off her blanket. How had he managed it? And when?</p> <p>Rousing from his own sleep, gazing at her with narrowed yellow eyes, was Fangs.</p><p>\"How the hell did you get here?\" she asked the cat, reaching out and scooping him up, cuddling him to her chest.</p><p>He immediately balked at the closeness, clawing and mewling until she let him down. When his paws hit the sheets, he took off toward the headboard, leapt onto the edge and remained there, perfectly balanced on all four feet.</p><p>That's when Julia noticed the note, taped to the wood.</p><p>He didn't come quietly. At least until he realized who I was bringing him to.</p> <p>Fangs is here, Doc.</p><p>Now you must stay.</p><p>Forever.</p><p>I will look for you at the hunt.</p><p>Parish</p><p>Julia stared at the note for long seconds, then glanced down at her belly, her naked flesh, scored with four silvery claw marks. She ran her fingers over the smooth, healed tattoo. He'd truly marked her as his, and given her his heart in both action and deed. The night before she'd thought about and rejected the idea of a sign. Parish didn't have to prove anything to her. She knew that now. And yet...he'd gone to New Orleans sometime in the night while she slept. Broke into Gary's house, and retrieved the only thing she valued outside the Wildlands.</p> <p>No, this wasn't a sign.</p><p>It was love and caring and listening and hoping. It was everything she'd ever wanted, ever wished for.</p><p>She gave Fangs a quick rub under his chin, jumped out of bed and headed for the shower.</p><p>\"I've never seen you wound so tight,\" Bayon remarked, his puma shifting in and out of his leaf-green gaze as he readied for the hunt.</p><p>\"I'm fine,\" Parish uttered, his eyes cutting from one entry point to the other.</p><p>Where was she?</p><p>Raphael had promised to bring Julia early. Didn't the Suit understand how desperately Parish needed to see his woman, scent her? Christ, he wanted her to see him hunt, recognize that he was a worthy male-that he could provide for her, always protect her.</p><p>\"Rosalie asked if you were going to the swim afterwards.\" Bayon eyed him curiously. \"She's invited the two new apprentices. One of the females is a redhead, both in and out of shift.\" He grinned broadly. \"What do you say? I'd be happy to share.\"</p> <p>Washing the blood from their skin in the bayou was always done after a hunt, but playing with females held absolutely no interest for him. He started to pace back and forth over the cold ground. \"I'm going to my Julia.\"</p><p>\"Your Julia?\" Bayon repeated. \"Since when does she belong to you?\"</p><p>\"I've marked her. She's mine, my family now.\"</p><p>Bayon didn't say anything at first. Parish's second-in-command was undeniably one of the top Hunters in the Faction, but to him females were for play and pleasure, and commitment was to be avoided. Which made his thoughtful, almost gentle gaze pretty damned significant.</p><p>\"It's good to see,\" Bayon said finally, as the dawn broke around them and Hunters stalked about in the open field near the shore of the bayou. \"You know Keira and I never saw eye to eye-\"</p><p>\"You hated her, and she hated you,\" Parish said with a quick grin.</p><p>A grin Bayon picked up and held. \"Yeah, well. She was a hardass, unforgiving, forgot she was a female most of the time, and probably the best goddamn Hunter I've ever witnessed. No offense.\"</p><p>\"None taken.\"</p><p>\"But when she...\" Bayon stared at the ground, shook his head. \"I thought you died that day too, brother.\"</p><p>\"Yeah,\" Parish uttered, his own gaze running the landscape. \"Well, maybe I did.\" Until her. Julia.</p><p>He needed her. He needed her here. Had she gotten his note? His gift?</p><p>Christ, he could still taste her. All he could think about was being inside her.</p><p>Her body.</p><p>Her heart.</p><p>Then he caught sight of Ashe and Raphael, walking through the trees. His heart pounded in his chest. Right beside them was Julia. Beautiful, desirable, fearful Julia. For a moment it was as if time stood still. He stared at her over the expanse of vegetation, willing her to look at him, and when she did, when her eyes met and held his, he released the breath inside his lungs.</p><p>When Ashe and Raphael stopped to speak with a group of Suits, Julia continued forward. Her face split into a wide grin as she jumped up on a rock and raised something above her head. It took Parish a moment to understand what it was. White and thin. Paper.</p><p>His note.</p><p>The one he'd taped to her headboard just a few hours ago. And there was something written over his words in big, bold red marker. His heart started to pump loudly, heavily in his chest. Was she refusing him? Was she returning to the outside world with her cat, and the heart he'd claimed last night? He narrowed his eyes to read:</p><p>CAN WE BUILD OUR HOUSE NEAR THE BAYOU POOL?</p><p>Parish would never be able to explain the overwhelming relief and intensity of feeling that surged through him in that moment, but his puma did. Even in his male form, the cat could not be reigned in. It broke from Parish's throat, roaring loudly and clearly and happily into the early morning air as its master ran at her. Mine, it screamed. Mine, Parish agreed as he jumped upon the rock beside her and pulled her into his arms.</p><p>\"Welcome home, Doc.\"</p><p>\"Thank you.\" She nipped at his lower lip and grinned. \"For everything. Fangs, the magic, for being you. I feel so...\"</p><p>\"Loved?\"</p><p>Her eyes filled with tears, and she wrapped her arms around his neck and squeezed. \"Yes.\"</p><p>Parish growled and nuzzled her neck and felt as if his heart would explode from wanting. He had love and family, and he would never allow anything or anyone to take it from him again.</p><p>\"Where's my gorgeous puma?\" she asked, drawing back, her blue eyes bright.</p><p>He growled again, soft and sensual. \"I got your puma right here, Doc.\" He stepped back, grinned, and in a plume of silver mist, he shifted. He roared into the cool, dawn air, then turned on the rock and called out to everyone present, \"I've caught the prey of a lifetime, Pantera, but she has come to see a hunt, and we will give it to her!\"</p><p>Silver mist coated the air around them as they floated down the bayou with the rest of the Pantera spectators. Along with Ashe and Raphael, Julia and two other Pantera, one female and one male, sat within the low-bottomed boat, following the pack of puma Hunters as they raced down river. The strange, six-foot long skiff had no motor, but it was definitely moving through the water as if it did.</p><p>Animal or magic? Julia wasn't sure she wanted to know.</p><p>\"It's the best way to watch the hunt,\" Raphael remarked, pointing to the gold and black cats breaking through the trees, stopping momentarily, nostrils flaring, mouths open, trying to catch a scent before taking off once again.</p><p>Parish's roar after he'd read her note still echoed through Julia's mind and body. She'd hoped he'd have that kind of reaction, and she couldn't wait to curl up against him later and show him just how happy he made her, and how deeply touched she felt about Fangs.</p><p>A loud, feral squeal tore through the mist then, and ripped Julia from her thoughts. What was it? she wondered. The prey they sought? Or an injury to one of the Hunters, perhaps?</p><p>She felt equal pangs of curiosity and horror, but along with everyone else on the boat, she lifted her chin and narrowed her eyes on the bank. At first she saw nothing but green, stands of trees and moving fur. She heard growling, followed by another squeal, then a cut off feral scream.</p><p>She turned to Raphael, so did Ashe.</p><p>\"That was quick. Parish is fired up.\" Raphael grinned at his woman. \"My cub will have bacon tonight.\"</p><p>Ashe turned slightly pale. \"Oh, jeez. Not a visual that's working for me right now, my love.\"</p><p>\"Sorry, ma chere. I promise, no more details-\"</p><p>\"Look!\" cried the female beside Julia. \"They're coming.\"</p><p>\"Maybe you want to keep your eyes closed, my love,\" Raphael said gently as the boat slowed, then stopped.</p><p>Turning from Ashe, Julia scrambled to her knees. Her gaze shot to the bank. She combed the water's edge until- There. She watched as the group emerged from behind a stand of cypress. Julia's heart jumped into her throat and she grinned. Out in front strode Parish's slate gray puma. Broad and fearsome, he searched each boat with his golden gaze. When he spotted her, his cat grinned with pride, blood covering its muzzle and teeth.</p><p>Julia beamed, waved at him. She'd never felt so proud, so possessive. That was her puma. The Hunter, the protector.</p><p>But her giddiness came to an abrupt halt when the boat jerked violently and she was tossed backwards onto the metal floor. Pain slammed into her elbow, and she saw the male Pantera passenger fall into the water, followed by something else. Her vision blurred and she felt slightly nauseous. All she could think was that they'd hit something, a rock or a tree. The wind was knocked from her lungs, and as she tried to capture breath, she heard Parish's roar ringing in her ears, then Raphael's cry.</p><p>Cry? Why was he crying?</p><p>She tried to push herself into a sitting position. Her elbow stung and stars swam before her eyes, but at least air was coming in and going out. She heard Raphael again. Then a female Pantera. They were screaming, roaring. But who were they screaming-</p><p>Ashe.</p><p>Oh, god...they were screaming for Ashe.</p><p>The boat rocked and jerked, and Julia heard a loud splash to her right, then water hit her face. She gasped as sound rushed her from all sides. Everyone was screaming, calling out for Ashe.</p><p>\"The bastard took her over the side with him!\" someone yelled.</p><p>\"Who was it?\" said another. \"What Faction?\"</p><p>\"I think he's Nurturer.\"</p><p>Julia blinked several times, trying like hell to get her bearings. What the hell was happening? Her vision cleared just as Raphael roared from somewhere in the water, \"He's swimming toward the other bank! We're close to the border! Go! Fuck! Go after him. I have Ashe.\"</p><p>Fully alert now, her heart slamming against her ribs, Julia scooted over to the edge of the boat. The water and the bank were complete chaos. Pantera were everywhere. She scanned the water for Raphael and Ashe. When she spotted them, her heart stopped. Raphael was swimming madly toward shore, Ashe tucked against him on her back. Julia could see the woman's face clearly in the burgeoning light of day. She looked cold and pale and quiet.</p><p>Without thinking, Julia dove into the water and swam hell-bent for shore. Once there, she scrambled to her feet and ran, neither noticing her aching lungs or how dripping wet and cold she was. She needed to get to Ashe, to her patient.</p><p>Pantera crowded around Raphael and his mate, but Julia pushed her way through. She slid to her knees beside Ashe, put her face near the woman's mouth and assessed her breathing.</p><p>\"She's bleeding.\"</p><p>Julia glanced up.</p><p>It was Raphael. He stared at Julia, horror-struck, terrified beyond measure. \"The baby.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PARISH had lost the piece of shit right as he'd crossed the border of the Wildlands.</p><p>Poof. Gone.</p><p>The instant his traitorous feet had touched down on human soil.</p><p>Parish had no idea how such a thing could be possible, or how a traitor had lived among them without detection. Because that was exactly what the bastard was. Ashe was Raphael's mate, which made her and her child Pantera. And when you attack within your clan you're a goddamn, good-for-nothing-but-gator-bait traitor.</p> <p>But Parish and his Hunters were going to find him. In fact, every Hunter he had was patrolling the border at this very moment. Except Bayon. The male was tight with Raphael, and had insisted on staying by his side at Medical. If anyone could keep Raphael from knocking down the door to Ashe's room, it was Bayon. Julia had made both Bayon and Parish promise to keep Raphael out until she knew what was going on. But it was becoming a nearly impossible task. Understandably, the Suit was losing it. He looked feral, terrified as shit, pacing and cursing and swearing that once he knew Ashe was all right he was going to find and disembowel the one who'd dared to hurt his woman and child.</p><p>It had been one hour since they'd arrived, since Julia and several other Pantera doctors had whisked Ashe away. Parish was so proud of his female. He'd never seen hands that worked so quickly, eyes that saw everything, a mind so clear and strong.</p><p>\"Julia will have news soon,\" he told Raphael, who looked as though he wasn't even aware of Parish's presence.</p><p>\"She's a good doctor,\" Bayon added, his gaze on Raphael even though he was speaking to Parish. \"We're lucky in that, as are you, Parish. She's going to make you a fine mate.\"</p><p>It was news to Raphael, but he didn't acknowledge it. He was pacing, hissing, cursing at nothing but his thoughts.</p> <p>\"You must go to the Elders,\" Bayon continued. \"I'd like to see their face when they hear another Pantera has taken a human as his mate.\" His eyes once again cut to Raphael. He was trying to pull the male back into reality. \"Where will you live?\"</p><p>Parish eyed the other Hunter, nodded. \"Not in my cave. Can't have a female and child there.\"</p><p>\"Child?\" Raphael stopped in his tracks. \"She's not pregnant?\"</p><p>Bayon released a breath, cursed.</p><p>\"Not yet,\" Parish told him. \"But if you can make cubs with your human, so can I. For now, we'll take a house close to town, and to Medical.\"</p><p>The door behind Parish opened then, and Julia, along with three Pantera doctors, emerged. Her thoughtful blue eyes flickered momentarily to Parish, then quickly focused on Raphael.</p> <p>\"First, let me say, the baby's perfect. All vital signs are normal; heartbeat, fluid within the-\"</p><p>\"Ashe?\" Raphael demanded, his expression terrified as he rushed toward her. \"Is she all right? Tell me!\"</p><p>\"Easy,\" Parish said, holding the male's shoulder.</p><p>\"She's okay,\" Julia said quickly. \"Stable, and her vital signs are good.\"</p><p>Raphael seemed dumbstruck, his breathing shallow. Parish had never seen a male react this way, and yet he knew that if it were Julia inside that room, he'd be acting the same way. Maybe worse.</p><p>\"Do you know what happened?\" Bayon asked her.</p><p>\"As far as I can tell, she was injected with something.\"</p><p>Raphael growled, his canines dropping. Parish and Bayon drew nearer to him as calm, cool Dr. Julia Cabot explained, \"I believe whoever did this was aiming for her uterus-\"</p> <p>\"The child?\" Parish uttered, slightly stunned. The attack was not on Ashe. It was on the baby.</p><p>Raphael hissed. \"I will bleed that bastard out so slowly and painfully he will beg me for death.\"</p><p>Julia swallowed, her face tight. \"Ashe must've deflected somehow, and under the water. She's already an amazing mother. The needle didn't puncture anything vital.\"</p><p>\"I need to see her,\" Raphael said, advancing on her. \"I need to see my Ashe.\"</p><p>Julia blocked the door, her eyes down.</p><p>\"What is your woman doing, Parish?\" Raphael said with a terrifying growl.</p><p>One Parish matched with his own. \"Stop and listen, Raphael.\"</p><p>\"I know this is hard,\" Julia said, taking a deep breath, then letting it out. \"As I said, she's physically well, healing properly, and all her vitals are stabilized.\" She glanced at the Pantera doctor to her right.</p><p>The male Nurturer stepped forward. \"I have only seen this once in our lifetime, brother. But whatever your woman was injected with...well, it has made her...\" He paused.</p><p>\"What!\" Raphael roared.</p><p>\"Unstable,\" the male finished. \"Dark magic now runs through Ashe's bloodstream.\" He locked eyes with Raphael. \"Something is trying to possess her.\"</p><p>The End </p> </body></html>"]