["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>Anger is coursing through me in waves. I can't control it. I feel betrayed and utterly decimated. The knot growing in my stomach forces its way up my throat and strangles me. My shirt is soaking wet, clinging to my body like a second skin. Drenched hair is plastered to both sides of my face. As I walk back to my bike, I grab the pony ring from my pocket and then wring my hair out while I walk. Water spatters on the pavement. The rain is slow and steady, barely more than mist. The sky is gray and the sea churns behind me with Cole standing, watching the waves crash into the shore.</p><p>Riding in the rain is stupid. I'm hyperaware of that, however, I have to get away from him. The words Cole said were like lashes to my soul. The way he looked at me, like I betrayed him for money, makes me sick. Quickly, I walk in long strides, slamming my boots onto the pavement, toward the front door. I grab my leather jacket from under the awning and pull it on. Cole doesn't turn. I know he won't move until he hears the motorcycle roar to life and fade into the distance.</p><p>I secure my helmet and swing my leg over my bike. I look back at Cole one last time, knowing I'll never see him again. He's too angry, too hurt to see through Sophia's web of lies. There are too many secrets between us and now there's no way to fix them. It feels like a hand reaches inside my chest, grabs onto my heart, and squeezes. It crushes me, making my chest feel like it's going to cave in. I can't stand it. I can't breathe.</p> <p>Shaking my head, I ignore the water pouring down my face and start the bike. Grabbing hold of the handlebars, I flip up the kickstand with my foot, and slam the bike into gear. My life sucks. It doesn't seem to matter what I do, it's always wrong - with Sophia, with Cole, with Edward - oh, God! It never ends. Every mistake strips away a confident piece of me and replaces it with a version of Anna that is jaded and hard. She's not me. That's not who I want to be, but I can feel her calling to me through tainted scorn. I want to crush Sottero. I want to obliterate her for what she did. I blink the rain water from my eyes and lower my head. I don't want to be that person, but I no longer know what I want from life at all. Nothing is the way I thought it would be. My ideals are gone.</p><p>Pressing my lips together, I feel the lump in my throat tighten, as I turn away from Cole. I start down the driveway and turn onto the street. I don't get far. The engine revs harder than I intended and the back wheel starts to slide. I'm not going very fast, not yet, but the street is slick and the motorcycle is heavy. I try to correct and lean into the skid, but it's too late. Gravity has me in its grip and isn't going to let go. A scream rips out of my throat and blasts every other sound to oblivion. The bike comes down on top of me. My helmet strikes the pavement hard, but I don't stop. My bottom leg is caught under the bike, and my jeans are getting torn apart as I skid to a stop. I push on the bike, trying to get up, but I can't make it move. It's too heavy and I'm too small. There's no leverage.</p><p>Before I know it, the motorcycle is lifted off of my and Cole is yelling. I can't focus on him. I look at the street, at my leg. My fingers lift and touch my head. I blink. The helmet is still strapped in place. Cole's voice echoes inside my mind, like his words are a memory and not being shouted in my face. I shake my head and it clears. Panic makes my heart pound harder.</p><p>Cole is trying to lift me, but I won't let him.</p><p>Suddenly, I'm yelling back, \"I don't need your help!\"</p> <p>Cole is irate. He's shaking. The muscles in his arms are bulging, ready to hit something. \"Anna,\" he growls. \"I can't believe you're doing this to me. You can't - \" his jaw hangs open and he freezes, as I pull the bike up and get back on. \"What the hell are you doing? You can't be serious.\" His tone changes, it shifts from angry to sensible.</p><p>I restart the bike and stare at him. \"I'm not staying here. Maybe you didn't realize it before, but Sottero threw me under the bus, too. Some jackass has been stalking me, and you don't believe a damn thing I'm saying. You're not the only one who's hurting. I don't have to stay here and explain myself to you, and even if I did - from that look on your face - I don't think you'd believe me, anyway.\"</p><p>My leg throbs like it's on fire. I look down and see an angry red gash showing through torn jeans. Fuck. It looks bad. I start to move, pressing my boots to the ground to get the bike going again. I won't turn so sharp a second time. The street is slicker than it looks.</p><p>I have to get out of here. I can't do this. I feel my heart crumbling, turning to ash. Oh God, the way he's looking at me like I stabbed him in the back. I can't stand it. I intend to ride away without another word when Cole steps in front of the bike and puts his hands on the handlebars. \"Don't be stupid Anna. It's raining! You already fell once.\"</p><p>\"I'm nothing, but stupid, Mr. Stevens.\" My eyes blaze as I glare at him. The tension in my jaw is so tight that it feels like the bone will snap. I can barely part my lips to speak. \"Believe what you want, believe that I did it - that I pretended to fall in love with you - and that I'd do it again. You know how much I love money, how much I want to ride the coattails of others to achieve my success. That sounds just like me, doesn't it, Mr. Stevens?</p><p>\"Every inch of me was covered in lies. You don't know me at all. Everything from my whacked out parents, to my fall two seconds ago, was constructed to make you fall for me. I'm a liar and a snake.\" I stand on my tip toes and lean closer to his face as I speak. \"I don't love you. I never have. Now, let go of my bike before I run you over.\"</p> <p>Cole stands there shell-shocked. Since I arrived, nothing I said to him even came close to registering in his brain, but that did. What I just said makes him stare at me like he's no longer certain of anything. I twist the handlebars hard, and yank them out of his grip. Before Cole can speak, I throw the bike into gear and pull away. I feel his eyes on my back until the road twists and I'm out of sight.</p><p>Chapter 2</p><p>Ma pulls the door open and her delighted smile quickly fades into horror. \"Oh my God! Anna, what have you done?\" Ma is frantic when she sees me. I look like a drown rat that's been smacked with a sword. The gash on my leg is bright red and looks horrible.</p><p>\"It's nothing, Ma.\" I sit down hard at the kitchen table after walking up the stairs. There's a trail of muddy puddles in my wake. I look back and say, \"I'm sorry. I can clean that up.\" I start to push myself up, but Ma slams me back down into the chair.</p><p>\"Sit,\" she snaps. \"Frankie! Get in here! Your daughter has a hole in her leg!\" Ma yells with that forceful voice of hers. She's wearing a pair of grey sweats, and white slippers. \"What'd you do? I told you not to go looking for him.\"</p><p>Daddy walks in and looks at the floor, then up at Ma, and finally his gaze lands on me. I'm soaking wet and the hole in my jeans is damning. I did something stupid and can't hide it. \"What the hell happened?\" He's angry now. Daddy hates it when I get hurt and when I tell him it was from the bike, he'll want to bash the bike in with a hammer.</p><p>\"It's not as bad as it looks. My jeans ripped and it's raining. There isn't that much blood.\" I put up my hands, trying to get them to calm down. \"I know that it looks really bad, but it's just a scrape. I promise.\"</p><p>\"I told you, Anna! That damn thing is a death trap.\" Daddy is more livid than I've seen him in years. That's all he manages to say before biting his lip so hard that his jaw trembles.</p> <p>Ma is gnashing her teeth at me from behind Wet 'n Wild pink lipstick. Her hands are on her hips, like she means to beat me with a spoon, but she doesn't. An instant later she deflates and grabs the scissors. \"Let's have a look.\" She cuts away the leg of my jeans and grabs a first-aid kit. She's shaking her head and muttering things as she cleans out the abrasion. I let her, gritting my teeth as she pours peroxide on the cut. When it's patted dry, it doesn't look that bad. The cut is long and thin, nowhere near as bad as it looked when I walked in the door. \"Go take a shower and we'll bandage that up. You were lucky this time, Anna. Most people aren't.\"</p><p>After steaming myself in the shower, I emerge in a pair of dry clothes. The rain has stopped and night has fallen. I sit at the table, not saying much, pushing my food around on my plate. I can't eat. I feel lost, like I'm sinking in quicksand, but I have no desire to break free. I push a meatball with my fork. It makes a red smear across my plate.</p><p>Ma has been watching me. Finally, she asks, \"So, did you find him?\" I nod. \"What happened?\" Worry shines in her eyes. I don't want to tell her, but I feel like I should.</p><p>\"He didn't believe me,\" I say softly. \"He thought I was after his money, like Sottero.\" My voice is barely audible. I push the meatball back into a pile of untouched spaghetti. Ma used to make this meal when I was little and had a bad day. They had seen the train wreck coming and warned me to leave Cole alone, but I didn't listen.</p><p>Ma understands. \"I remember what that felt like, finding out that someone was only there because I was rich. I found out who my real friends were when Mother disowned me. There weren't many. It's a hard lesson to learn. Cole's never had everything taken from him before. I remember how much I wanted to - \"</p><p>Normally, I wouldn't tell someone else's secrets, but I cut her off, \"He's had this happen before. Cole's situation was similar to yours. His Dad tossed him and didn't give Cole a dime.\" I find myself telling Cole's story, about Cole as a young solider, the battered Tiffany's box, the rejection and heartache I found in Cole Stevens. When I finish, no one speaks.</p><p>I put down my silverware and push away from the table. As I stand, I say, \"Now it looks like I'm just like the rest of them and only after his money.\"</p><p>I walk outside and sit at the table where Cole and I spoke not so long ago. I stare at his empty seat, trying to push past the waves of nausea that pound into me. After a few minutes, Daddy walks down the steps and takes the seat next to me. We sit together in silence, both of us staring at Ma's gardens that are overflowing with sweet summer blooms. The rain makes everything have a thick, fresh scent.</p><p>Daddy finally sighs and leans on the table. His forearms are thick and covered with gray hair. I used to think those arms could protect me from anything. \"You remember what this garden looked like when you were little?\" I nod. It was barren, mostly dead grass, sand, and rocks. The previous owner did nothing to cultivate the patch of land. \"There was nothing here. It was ugly, Anna. But when your Ma saw this house, she knew it was home. There are people like that, ones who see the good in something even when there's nothing to see.</p><p>\"You're like her, in that way - always seeing the best in people - even if there's nothing to see but a clump of dust there from what had once been. I never had that. I couldn't look at something that was all busted up and see what it could be. But you, you're like her with that. You could see what that man was before he ever told you, didn't you?\"</p><p>I stare at Daddy, wondering what he's trying to tell me. I nod again, slowly. \"What are you getting at, Dad?\"</p><p>He looks at the garden again. His thick fingers tangle together and he cracks his knuckles. When he looks back at me, he says, \"But that's only half the ticket. You got part of me in there, too.\" He pauses, trying to think of what to say next. \"Me and you do without. We always have, always will - money's nothing but paper to us. Yeah, we need it to pay bills and feed the family, but it's not the stuff of life. Me and you, we love with our whole hearts, and it's dangerous. It can change you, Anna. It sure changed me.\" He glances up at the window. Ma is standing there, drying a pot. The silver gleams in the light as she twists the cylinder in her hands. \"There's a time to accept defeat and admit that you lost, and there's a time to fight for what you want. No man won a woman's heart by running away.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Cole's not going to chase after me, Daddy.\" I stare at my hands as I say it, knowing it's true. The look in Cole's eyes said it all. Every wall I managed to knock down was erect and stronger than ever. Cole shut me out.</p><p>\"I'm not talking about him, sweets. I'm talking about you.\"</p><p>Blinking, I look up at him. My brow pinches together. \"What about me?\"</p><p>\"Life isn't filled with do-overs. How many shots you think you're gonna get at love? Most people are lucky if it comes their way once. Are you seriously telling me that you're going to let him walk away?\"</p> <p>I smile at Daddy, like he doesn't understand. \"I don't have a choice. I went to Cole. I told him the truth, and it didn't matter. Lies are easier to believe.\"</p><p>Daddy smiles back like he knows better. \"That's true, but you know what? Anything that's worth having is worth fighting for. Love is a strange thing. It shows up when you least expect it and defies expectation.</p><p>\"Ya know, I actually dumped your Ma? I told her that she'd be happier marrying some rich guy, that he could take care of her in a way that I'd never be able to. I said I didn't want to see her anymore. Your Granny even sent me a thank you card with a bunch of cash inside to stay away.\" He smirks. \"I sent the card back, wrote REFUSED on it in a big red marker. I didn't walk away for money. I walked away because I thought your Ma would be happy. Two days later, your Ma shows up, suitcase in hand, and that letter. I saw the red marker, and knew what she was holding.</p><p>\"Money's like poison, Anna. Too much of it kills anything that's worth having. Too much dough makes you paranoid, always wondering who - if anybody - loves you, and who's just trying to get a piece of you. Truth be told, no one loved your Ma, not even Granny.</p><p>\"The ones we love are worth fighting for. Me and you are fighters, Anna. We don't let things slip between our fingers, unless we want them to.\" He stands and looks down at me, arching a dark brow. It seems like a challenge, like he's saying I'm made of thicker stuff - that I shouldn't slink away if I want Cole - but I have no idea how to fix something that's so broken.</p> <p>Chapter 3</p><p>Before sunrise, I'm back on the parkway, headed toward my apartment. I need to stop there, ditch the bike, and put on clothes for Sottero's. My internship only has a few days remaining. My heart pounds harder as the clock ticks closer to eight. I hate her. I don't want to see Sottero, but I feel like there's something I should do.</p><p>I walk into my room with a towel wrapped around my body and another one in my hair. As I walk to the closet I feel a line of goose bumps break out across my back. Shivering, I clutch the towel and turn around expecting to see someone behind me, but the room is empty. I glance at the window, and see people moving below. I blink a few times, wondering if someone had been watching me. If so, they're gone now. Just in case I have a peeping tom, I dress quickly, making sure the closet door blocks my naked body.</p><p>As I walk toward the front door, I see Em in the kitchen. She says, \"Are you seriously going in?\"</p><p>I nod, \"What am I supposed to do?\"</p><p>\"Kick her in the balls, because she must have huge cojones to use you like that.\" Emma's eyes narrow as she shakes her head, like she's disappointed. \"What are you going to do?\"</p> <p>\"I honestly don't know. Part of me wants to confront her, but that won't change anything. And I need to graduate.\"</p><p>\"Do you?\" Em plants a seed in my mind and it takes root immediately, twisting and turning, asking questions that I don't want the answers to. She continues, \"I mean, do you really need a graduate degree to run a photography studio?\"</p><p>Why did I choose this path? Why did I get two degrees to do a skilled job? Why did I have plans to get a doctorate? Because that was pretty much what Sottero did, because I had idolized her and was following in her footsteps. My head turns slowly, as my eyes widen. I didn't realize it, but I based my entire future on this horrible woman.</p><p>\"Oh, shit.\" Em mutters, \"I broke your brain.\" She rushes out of the kitchen, dressed in a nice suit - which is weird - and wraps her arms around me. \"Ignore me. I'm being stupid. I didn't mean to imply anything. Finish what you started.\" She smiles at me, holding my shoulders, knowing that nothing is getting through because of that dazed look on my face. \"That's what you always say, 'finish what you start.' It's classic Anna. Do that.\"</p><p>My eyes come into focus and I look at Em's blue eyes, and a smile spills across my face. Nodding slowly, I say, \"That's exactly what I'm going to do. I'll finish what I started.\"</p><p>Emma is calling after me as I bound down the front steps. I changed out my heels for my sparkle yellow Chucks and take off for Sottero's. I know exactly what I'm going to do.</p><p>My thigh highs pull at the scab on my leg as I walk in determined strides toward Sottero's shooting room. She's in there getting ready for a bride that should arrive any second. I grab her cup of coffee along the way. The light brown liquid swishes as I walk, and gets close to the brim, but it doesn't spill.</p><p>Determination floods me. I'm not letting this woman ruin my life. I'll take the rubble and rebuild from the ashes. I'll be better for it. The only way I can fail is if I don't get up again, and I have no plans of staying down. Screw that.</p> <p>Sophia turns when I enter the room. Her slender arms fold across her chest and her head cocks to the side. Her gaze falls on my shoes. \"I am not amused, Anna dear.\" Anna, idiot. \"Remove those before the client arrives.\"</p><p>I smile at her and continue to walk towards her, like I'm going to hand her the coffee. When I stop I say, \"I had an interesting day off. How about you?\" Sophia remains rigid, with her arms folded. When she doesn't speak, I sip her coffee and say, \"Did you know that Cole Stevens raped me? That was totally news to me, because I don't remember having sex with him or anyone else recently.\"</p><p>Sophia's lips part, but she hides her shock quickly, \"I saw the story in the paper. Accusations can be damning, my dear, but they aren't enough to win lawsuits.\"</p><p>\"So, why'd you tattle to the dean? Did it bother you that I was sleeping in Cole's bed?\" Sophia's grip on her arm tightens. It's the only movement she makes. The motion makes her ring catch the light and for the first time, I really look at the ring. My jaw drops. Sophia's gaze drifts to the ring and slowly meets me gaze. \"The woman in the paintings was you!\"</p><p>That makes her move. Sophia grabs my arms and hauls me to the back of the room. We stand in front of a bank of windows by the supply closet. \"You listen here, you little bitch. You have no idea who you're playing with.\"</p><p>I rip my arm out of her grasp. Everything clicks together in my mind. Sophia and Cole were a couple. She was his muse, his inspiration, until something went wrong. Staring at her, I know exactly what made her hate Cole, what caused her to throw the Tiffany's ring back in his face. \"Likewise, Ms. Sottero. I'm not the moron you think I am. I know he proposed to you, and that you declined when he told you that he was broke. You're a money-grubbing bastard, and when you found out Cole was disowned, you turned on him like the heinous bitch you are.</p><p>\"But that wasn't good enough, was it? Breaking his heart and telling him you thought he was worthless didn't make you feel better? It didn't make up for all that time you invested with him, so you concocted this rape story. Exactly when was that supposed to take place? Before or after he proposed to you?\"</p><p>Sophia's eyes widen as I speak. Her ruby red lips part and I swear to God, she has a forked tongue when she replies. It slithers out of her mouth like Satan is talking. \"You conniving little whore! How dare you walk in here and - \"</p><p>I raise my hand and hold it in front of her mouth like a stop sign. I'm right. I know I'm right, but what I have no clue about is why Cole didn't fight the charge. Sophia's story is full of holes. \"I'm done working here, and I'm done wanting to be like you.\" I laugh hollowly, \"You know, I actually wanted to be like you? I idolized you and the way you did business. I actually believed all the shit I heard about you, about how you make each bride feel beautiful. The part everyone left out was how you talk trash when the bride's back is turned and make faces - you frickin' made faces at them, like a nine-year-old - as if they were beyond rank. Well, you're the one who's rank and if I never see you again, it'll be too soon.</p><p>\"Have a nice life, Sophia. I quit.\" I smirk and turn on my heel.</p><p>A crowd of people have been standing behind me, including the bride who was about to have her photo shoot. Two older women stand with the young bride, flanking her. Their eyes shoot daggers at Sophia, hating everything they heard. The employees stand there slack-jawed, their eyes trained on Sophia, who doesn't move. She stands there, shell-shocked.</p><p>I'm about to walk out when I see the cup of cold coffee in my hands. I turn back to Sophia and say, \"Oh, don't forget your coffee.\" I thrust the mug at her chest. Her hands fly up to grab the cup, but I push too hard. The contents slosh out and leak down the front of her blouse. I press my fingers to my lips before I say, \"I'm so sorry that happened, dear.\"</p><p>I walk away with a smile on my face. Sophia doesn't talk, but I feel her eyes burning a hole into my back. I push through the front doors of the building and into the early morning air. I spin around once, laughing like a lunatic, with my arms extended. I can't help it. It was perfect. The look on her face alone was beyond awesome. I've never felt so good in my life.</p><p>However, life caught up to me when a short balding guy asks, \"Anna Lamore?\"</p><p>I stop spinning and look at him, nodding. \"Yes?\" I have no idea who he is or what he wants. The guy doesn't even look vaguely familiar. He's short, balding, with dark skin and a big fat envelope in his hands.</p><p>He looks at me sternly, and slaps the envelope into my hand. \"You've been served.\" The man turns away as I look down at the package.</p><p>I don't know what this is, \"Hey!\" I shout, running after him. \"What the hell is this?\"</p><p>He won't look at me. He continues to walk briskly, like his main reason for doing so is to put space between us. \"Read it, kid. Just show up on the date and time it says.\"</p><p>I stop and look at the envelope again. I break the seal and unfold the contents, watching the short man walk away as fast as he can out of the corner of my eye. People bump into me, but I'm in mental a bubble. The letters on the top of the page mean nothing. I'm staring at the court case SOTTERO vs. STEVENS. I've been summoned to appear before a committee concerning the lawsuit. Great.</p><p>It never fails. When something finally goes right, something else goes wrong.</p><p>Chapter 4</p><p>When I get home, the apartment is empty. Emma is at her internship/ new job at Newsday. I wonder if I'm a moron while I stand in the shower, getting pelted with insanely hot water. My mind doesn't want to think about what I just did, quitting an internship days before it's over. No, my mind wants to wander back to Cole. The crushing sensation still weighs heavily on my chest. Whenever there's a space between thoughts, Cole's face appears, his blue eyes blazing with his barbed words, I thought so.</p><p>Life keeps throwing things at me that I don't expect. I didn't expect to enjoy working at Le Femme. I didn't expect to fall in love with Cole Stevens. And I certainly didn't expect Sottero to be a ravenous bitch. Out of everything that's happened, I'm not sure what I could have done differently, what I could have done to prevent it. When I questioned Sottero, when I said I was sleeping in Cole's bed, she obviously had no clue. That meant she didn't snitch to the dean or contact the papers about that little story. Someone else did. I scour my arm with a loofa as I think, covering my skin in white bubbles until I'm beat red. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Who else knew that? Who else knew I was sleeping at Cole's? Emma was the only person who knew I wasn't at home. I can't think of anyone else who knew that information and would want to use it against me. Jesse knew about my feelings for Cole, but he helped me with the dean. If Jesse wanted to get me in his bed, he could have said yes when I asked him to my rebound guy. He said no. I scrub my other arm and then wash my hair. The wound on my leg is finally healing. The hot water makes it itch. I turn off the shower and dry off, wrapping my towel around me as I head out of the steamy little bathroom.</p><p>As I pad barefoot to my bedroom, I feel uneasy again. My stomach curdles and the hairs on my neck raise. I clutch the towel and shift my eyes through the room. I'm the only one here. The sensation of being watched floods me. Heart racing, I wonder if I'm overreacting or if someone is really there, looking in the window. Silently, I walk to the windowpane and stand off to the side, looking out. The street is busy like always, but no one stands at a lamppost staring at my window. I drop the mini blinds, and touch the back of my head to the wall and sigh.</p><p>I'm paranoid. When did this happen? It never spooked me to be alone before, and now I am acting like the stupid chick in a horror movie, jumping every time I walk out of the shower. Annoyed with myself for being so twitchy, I dress quickly, but I can't shake the feeling. The goose bumps won't go down and I still feel eyes on me. I pull on jeans and a tank, grab my helmet, and dart out the door. It's too damn hot for the leather jacket today. On my way out the front door, I smack into Edward.</p><p>He takes my shoulders and steadies me, \"Whoa, there. Sorry, I didn't see you coming through the door.\"</p> <p>\"She's not here,\" I say, ignoring Edward's apology and shaking him off. I ran into him. I realize I'm acting like a bitch and turn back, practically hopping on one foot, as I fasten my helmet under my chin. \"She's at work until 5:00pm. Em started that new job today.\"</p><p>He looks at me from under those dark eyebrows, a grin forming on his face when I smile at him. \"Why are you home?\" he asks, confused.</p><p>A smirk lines my lips. \"I quit.\" That was the first time I said it, the first time that I admitted what I had done. Damn, it felt good. I couldn't stop smiling. I'm going to make my own future, become my own woman. I hid in college long enough. Those who couldn't do, teach, and those who are too chicken to try, hide out in the classroom until they need walkers. Screw that. I'm ready to try it on my own and I know exactly what I want to do. I busted my ass to get this far. I'm not wasting another day.</p><p>Edward's jaw drops open in shock. \"What?\" he squeaks, but I only smile broader in response.</p><p>As I skip across the street, I wave good-bye and run toward my bike without explanation. I can't wait to tell my parents what I did. There's no way in hell they'll understand, but all the same, my heart is pounding against my ribs because I know what I want and I'm finally content with that decision.</p> <p>\"You did what?\" Ma snaps, cookie half way to her mouth. It dangles there in midair between her forefinger and thumb. Her pinky is extended - a remnant of an old life.</p><p>\"I quit. Sottero held my future in her hands and there's no way in hell I was staying there, not after what she did to Cole. And, then I was thinking about why I went to grad school in the first place. You know what the answer is Ma?\"</p><p>\"Cause you wanted to be successful. Because you wanted to be the best in your field!\" She tells me, her voice growing louder - if that's possible - as she speaks.</p><p>\"No, Ma. I went because I was following in Sottero's footprints. I wanted to be like her and now I don't. She's a fraud and one of the worst people I've ever met. I don't want that life anymore, Ma. I don't want to be a wedding photographer.\" My words drop like little bombs, each one decimating years and years of careful articulation about my plans for the future.</p><p>From the way Ma is looking at me, I can tell she thinks I've lost my mind. Daddy is leaning against the counter, his arms folded across his chest. He's yet to say anything. He watches me and my mother, his eyes shifting between us. Frankie the dock dude is smarter than most people think.</p><p>Ma presses her fingers to her temples, trying to keep her brains from exploding and messing up the rose wallpaper she loves so much. In an even tone, she asks, \"Then, what do you want to be, Anna?\"</p> <p>I look at Ma and then at Daddy. They aren't going to like this. I didn't really mention what I was shooting at Le Femme, but I was good at it. \"A boudoir photographer.\"</p><p>In unison, they say, \"A what?\"</p><p>\"A boudoir photographer. It's like a pin-up photographer.\"</p><p>Daddy catches on first, \"Like what you were doing for Cole?\"</p><p>I nod, \"Yeah, I liked it and I was really good at it.\"</p><p>Ma shakes her head and slams her hands on the table. The entire thing shakes under the slam of her hands. \"No, Anna! What about college? What about all that money you spent getting that degree? You can't honestly tell me that you're quitting college when you're so close to graduating.\"</p><p>\"Ma,\" I groan like a little kid, wishing she'd understand, \"I took all my classes. Those were for me. The information's already in my brain. I don't need a piece of paper to tell me that.\"</p><p>Ma huffs. \"That piece of paper cost you twenty grand and you've got nothing to show for it.\"</p> <p>\"I will. I'll use everything I learned.\" I take a breath and spit it out. It's the plan I came up with on the drive out here. \"I'm going to open my own studio.\"</p><p>Ma's lips part, but she says nothing. She looks at Daddy like I've gone crazy and urges him, \"Say something.\"</p><p>Daddy nods his head for a moment, then tilts it to the side, asking, \"Will this make you happy? Working for yourself is hard and the only person to blame when things don't work out is you. You think you're up for that Anna?\"</p><p>Meeting his gaze, I nod. \"Yeah. I'm good at it, Daddy. I know what I want to do. I know how long it will take to turn a profit. I don't expect to ever be what Cole was, but I know I can support myself. All that money I saved to do post-graduate work is there as a cushion. I don't need more school, Dad. I need more guts. I've been hiding behind books for too long. It's time for me to get off my ass and start living my life. I'm not letting another day slip between my fingers.\"</p><p>Daddy smiles at me and my heart soars. It deafens me to my mother's voice as she screeches about how irresponsible it is for me to not finish something I started. She doesn't understand, but Daddy does. I am finishing what I started. My time with Cole changed me, for the better, and I'm ready to be that woman.</p><p>Chapter 5</p><p>Sitting at the counter, I shovel a spoon filled with Cheerios into my mouth. This will be the lunch of Anna Lamore until I can generate some income. From my awesome math skills, I deduced that I can live off of Ramen noodles, spaghetti, and Cheerios for seventy-three months and still manage to pay rent. If I can't manage to make my studio profitable in six years, then I'll move onto plan B. Honestly, I don't have plan B. This is it. And right now, I'm looking at the newspaper trying to find studio space, but everything is so expensive.</p><p>Jesse sits across from me and Emma is on the couch. Jesse shakes his head and says, \"I can't believe you did it.\"</p><p>\"Neither can I.\" I'm beaming, I can't help it. I'm so excited and terrified. I glance up at Jesse to see his big blue eyes looking at me in awe.</p><p>\"I bet your mother chewed you out and threatened to throw you off the Brooklyn Bridge,\" Emma says, frowning. She's trying to figure out how to use crochet hooks. It's not going well. So far, she's managed to create a lovely knot.</p><p>\"Pretty much,\" I agree. \"But, Dad understood.\"</p><p>\"I don't understand,\" Emma replies with her dark eyebrows disappearing under her bangs. She loops more yarn around the needles and moves them like chopsticks. \"I mean, you did a 180, like a total reversal in a couple of months. You were all wedding photography this and bridal pictures that for the past half-decade and now you're all wanting to shoot naked chicks. It's not like you.\"</p><p>Jesse grins. I kick him with my foot and answer Em, \"It's not naked chicks, you perv.\"</p><p>I finally focus on Emma. She's biting her tongue and beating the crap out of the yarn, stabbing it with the needles into the couch cushions. \"Die, beanie hat, die! I hate you!\" She stills and looks at me. \"What?\"</p><p>\"You have the attention span of a chimp.\" I smile at her, but she looks like she still wants to stab the yarn.</p><p>Jesse shakes his head, \"Nah, chimps can knit. It's more like the attention span of a fish. They seem to forget what they're doing and blink a lot.\" I laugh, which makes Jesse happy.</p><p>Emma on the other hand, slaps down the yarn and walks over to me. \"Chimps can knit,\" she mocks, and makes a face at Jesse. Em stops behind me and looks over my shoulder at the newspaper in my hands. \"So, say I want to be supportive of this new you. What do I do?\"</p><p>\"Well, let's see.\" I tick the things off on my fingers as I say them. \"You can keep an eye out for studio space, encourage me when I'm sick of cereal and noodles, and pretty much accept that this is what's going to make me happy.\" When I say it, my voice drops. I would have been happy with Cole. This will make me content. Happy is the wrong word. Emma sees it in my eyes.</p><p>I'm trying hard to keep moving forward and not look back. Cole hasn't called me. He didn't show up, crawling to me on his knees, apologizing. I don't know where he is and I don't want to know. He rejected me. I did nothing wrong, and he turned on me. From talking to my Dad I can understand how Cole could act that way, but I can't let it go. Maybe Cole was blindsided, but I could have turned on him when I first heard of the lawsuit and I didn't. Sottero's allegation was crap. I knew it. I didn't even ask him.</p><p>The empty place in my chest aches. I want to hear Cole's voice again, but I know I won't.</p><p>Jesse senses my mood and quickly tries to lighten it again. \"There's one other thing she forgot to add to that list: Be nice to Jesse, who is the best friend I never had.\"</p><p>Emma's hands are on her hips; her long dark hair trails down her back. She laughs in his face and things feel normal again. I don't know what it is with me. One moment I'm fine and the next I feel like I'm made from old parchment that's turning to dust. Night time is the worst. When Jesse leaves and Em is asleep in her room, I stare at the walls waiting for sunrise. Every time I close my eyes, I see Cole. His voice echoes in my mind asking what if...</p><p>What if we didn't fight? What if he believed me?</p><p>The thoughts come unbidden and don't stop. By the time dawn creeps across the night sky, dousing the city in golden light, I'm a nervous wreck. Insomnia doesn't look good on me. There are dark circles under my eyes. No one says anything about it. They try to act like I'm fine and hope that I will be, which is what I want.</p><p>Looking at paper, I point at Jesse with my pen and say, \"What he said.\"</p><p>\"Oh my God. You two are a pair of - \" Em starts to say, but I cut her off.</p><p>\"A pair of what?\"</p><p>She grins, \"A pleasant pair of people to spend a Sunday morning with.\" She purses her lips and widens her eyes until she looks like a fish caught in a vacuum cleaner hose.</p><p>I laugh and shake my head. I've circled a few possibilities for studio locations. They're all small, under 1,000 square feet, but I don't want to bleed my budget on the shooting room. I have one chance at this and that's it. If I do it wrong, I'll spend all my money and have no income. That part scares the crap out of me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I want to see these.\" I slide the paper toward Jesse.</p><p>He looks it over and nods. Only a few weeks have passed since my confrontation with Cole on the beach. Jesse's been around more, trying to be supportive. \"Some of these are in the hood, Anna.\"</p><p>\"It's all I can afford.\" That's the problem. Starting out, I won't have much and the rent on the studio space makes up more than half of my expenses. Actually, it will take at least six sessions just to pay rent and that doesn't include any profit for me or stuff that's important, like electricity or water. It sort of limits my options.</p><p>Emma chimes in as she walks down the hall. Talking over her shoulder, she shouts, \"Check the price of warehouse space on Long Island. It'll be cheaper than retail and as long as it's heated and cooled, you're in business.\"</p> <p>My smile widens. \"Want to spend the day looking at studio space with me?\"</p><p>Jesse's expression brightens, \"You know I do.\" He glances down the hall to make sure Emma is out of range. \"And anything else you might want.\" He reaches out and places his hand over mine. Our eyes meet and my heart starts pounding harder. \"I've been thinking about it and I shouldn't have told you no. If you still need me like that, I'm here for you.\" He means, If you still want me to be your sex toy, I'm down with that.</p><p>I didn't see this coming. I look at my hand and back at his face. I wanted a rebound guy. The nights are so horrible that I can't manage them alone. Everything reminds me of Cole. But if I have someone there, doing things to distract me - well, it sounds like a good idea. Jesse watches me carefully, like he just said something he shouldn't have.</p><p>I'm not sure how I feel about him. Jesse is more than a friend. He's sexy and has the ability to make butterflies erupt in my stomach. He can evoke a smile easily, even with me in a funk. We have so much in common. Everything about him would have dazzled me and I would have jumped at the chance to date him, but Cole found me first. Cole had become my unattainable god. Compared to Cole, Jesse was a nice guy. The contrast didn't work in Jesse's favor, but Cole isn't mine. He'll never be mine, and Jesse is sitting across from me, offering me anything that I need.</p><p>As these things rush through my mind, I look into his face. I'm silent too long, thinking about things - about him and what I want. Before he has a chance to pull his hand away, I hold it tighter. \"Thank you.\" The words are barely a whisper. Jesse nods once and looks at me from under his brow. It's the cutest expression I've ever seen.</p> <p>He stands and steps in front of me. The way he moves makes my stomach drop. I wanted this, I asked for this, but it still feels like he's the one advancing on me. It stirs something inside of me, a longing for Cole that's gone unanswered for too long. Jesse's eyes lock with mine and he lowers his face, inching slowly toward mine, until our lips gently brush together. He doesn't touch me, he doesn't force a bigger kiss. My breath catches in my throat as my body responds to him. I need to move on. When I look at him, I see that chance and don't know if I should take it.</p><p>Jesse pulls back a little bit, but remains close enough that I can feel his breath slip across my lips. He smells good, like fall and spices. When Jesse speaks, he whispers, \"I won't pressure you. If you want more, you'll have to say it.\" My cheeks flush and he smiles, pressing his forehead to mine. \"Damn, you're adorable. You blush.\"</p><p>I look up at him from under my lashes, \"You have no idea.\"</p><p>Chapter 6</p><p>I pull into the parking garage after 8:00pm with Jesse clinging to me. When I stop the bike, he jumps off and unfastens his helmet.</p><p>Wiping his hand across his lips, he says, \"I think I swallowed a bug.\"</p> <p>I laugh, \"Yeah, all part of the charm of riding a motorcycle. All sorts of stuff flies into your face, and sometimes you're lucky enough to swallow.\" An evil grin spreads across my face.</p><p>Before Jesse can respond, Edward appears. He's wearing jeans and a light sweater, like he's dressed for a casual night out. Good. Maybe he finally got over me and started dating again. I nod hello at him. Jesse is pleasant enough, but says nothing. Edward looks between us, and says, \"Nice night for a ride, huh?\"</p><p>\"Yeah, it was.\" I look over his shoulder and don't see anyone else. Jesse steps closer to me, but doesn't touch me. It's a territorial move, which surprises me. \"We went looking for studio space. Long day. Are you meeting someone or looking for Em?\"</p><p>Edward nods and smiles politely. \"Both. Meeting Em for dinner.\" Edward looks Jesse over so fast that he barely glances at the guy. \"So, is this the new boyfriend?\"</p><p>I start to cut him off, but Jesse steps next to me and takes my hand. \"As a matter of fact, I am. Jesse,\" he says, holding out his other hand to Edward.</p><p>Edward raises a brow and looks at me. He looks at Jesse's hand but doesn't take it. \"Well, good luck is all I'm saying.\"</p><p>\"Edward,\" I scold, but he doesn't say more. Instead he gestures for us to go first. We all leave the garage together in silence and walk back to my apartment. My feet are sore, and so is my back from being hunched over on the bike, riding two-up all day. I unlock the door and we head inside. Edward veers to the couch and sits, waiting for his sister. I shout to Em to let her know he's here.</p><p>Jesse sits at the counter as I go around the half wall and into the kitchen to grab us something to eat. Trying to ignore Edward, we talk. \"Which did you like the best?\" We saw so many options today.</p> <p>\"The one out in Islip looked promising, but it bumps up against a shopping center that looked kind of sketchy.\" Jesse leans on his elbows, and hunches his shoulders forward.</p><p>\"I liked that one too, but yeah, it kind of gave me the creeps.\"</p><p>\"Do you need a studio? Can you shoot on location or something for a while and then get one later?\" Jesse's eyes meet mine as he asks the question. It's not a bad idea and I've thought about it before.</p><p>\"I could, especially if I was shooting weddings, but I'm not.\" I avoid saying what I intend to do because of Edward. I wish he wasn't sitting there, but Em isn't ready yet. \"For this I need some place that's safe for both of us, you know what I mean? I don't want to be the icky shooter that meets people in hotels, and shooting at their house doesn't work. What if someone walks in on us? It'll look bad and I don't want my face punched in by some jealous idiot. No, I think the studio is a necessary evil. I guess I should keep looking.\" My hopes deflate a little bit as I stare into the fridge, not seeing the food, just thinking about what I should do next.</p><p>Jesse makes a sound of agreement.</p><p>When Emma walks out of her room, she looks stunning. She's wearing a little black dress that makes her have that vintage bombshell figure. Em's all curves. The shoes she's wearing are too awesome. I stare at her, my jaw agape. \"Holy shit! You look extra hot.\" I glance at Edward in confusion. \"Why'd you get dressed up to go out with your brother?\"</p><p>Em grins, \"Guys give me their number whether I'm with another guy or not. I figured, why risk meeting the perfect guy when I'm wearing jeans and a tank top.\" Her eyes widen as she looks over my outfit and backtracks, \"Not that there's anything wrong with that...\"</p><p>I laugh. I'm always wearing jeans and a tank top. It's my go-to outfit. Besides, it's not like I can ride my bike wearing short, fluttery skirts. I glance at Jesse and his eyes are locked on my neckline. I've never noticed him checking me out before. Tilting my head, I give him a look.</p><p>Busted, he smiles sheepishly and says, \"I like tank tops.\"</p><p>Em snorts, \"You would. You'd want to do her if she was wearing a trash bag. You're love-struck, little boy.\" She meant it to be funny, but the way Jesse looks at me, with horror seeping across his face, says Em hit the nail on the head. Before she can do more damage, she's out the door and Jesse and I are alone.</p><p>I feel like I should say something, but I don't know what to say. Finally, Jesse says, \"It's not like that.\"</p><p>\"It's not?\" I ask, relieved.</p><p>He shakes his head. \"No, not really. I just know what I want and Emma sees it, that's all.\"</p><p>I nod slowly. I can think of a hundred different things to say that would make him feel better and lead us to my bedroom, but I can't say any of them. Jesse's gaze locks with mine. I want to move on. I want to want him, but I don't feel it. I wonder if Cole broke me, if this is what Cole felt like around me because of Sophia. Internally, I cringe thinking about it.</p><p>After we ate and watched a movie, Jesse left and I was alone. I intended to go to bed early, but I can't sleep. I just lay there, the same way I do every night. I sit up in bed and pull the covers around my shoulders. This has never happened to me before and it kills me that it's happening now, with someone I didn't even have sex with. I shouldn't have thought of sex. As soon as I do, it lights my body like a raging fire, making me remember Cole's kisses and how they drifted below my waist. I shun the memory. I can't stand it. I have to know what happened to Cole, what he's doing. I pick up my cell phone off the nightstand and pull up his name. There's a picture and his number. I want to press it, I want to call him and hear his voice again. My thumb lingers over Cole's number, but I can't do it. Things didn't work out between us and it wasn't my fault. I tried to tell him that I had nothing to do with Sottero's spy, but it looked damning. It's a classic Anna issue: wrong place, wrong time. Part of me wishes that I knew who the snitch was, who got the information Sophia wanted, but in the end I know it doesn't matter. Cole didn't believe me. I'm not sure what I'd do if he suddenly did, if he showed up apologizing. Sometimes I'm not sure which was wounded worse, my pride or my heart. I don't know. They seem muddled together lately. I look at his name, knowing I can't dial and put the phone down. I rub my eyes with the heel of my hands. I can't stand this.</p><p>I get out of bed and throw on a black sundress and pull my hair into a pony tail, before putting on my sparkle Chucks. I look like a twelve year old, so I swipe on black liner and mascara. That's a little bit better. I head for the door. There's a bar down the street and I intend to get plastered. The sidewalks are littered with people. Most look like they're on their way home from a date or work. I shoulder past them and round the corner, not really paying attention to anything when I feel the back of my neck prickle. Stopping suddenly, I turn around. I scan the crowd. There's no one there, well no that's obviously reason for the icy dread that's crawling up my spine. I look around to dart into a shop, but they're all closed. I rush on, thinking that I'm losing my mind, but the feeling doesn't dissipate. It lingers, choking me like stale smoke. When I get to the bar, I try to hurl myself through the doors.</p><p>The bouncer stops me, and then laughs, \"Holy shit, I nearly didn't recognize you, Anna.\" When he spoke, his voice rumbled through the room. Several heads turn to look at me, and I feel my face warm.</p><p>Damn my blushing. Why do I blush all the time? \"It's okay,\" I say, after peeling myself off his arm. \"Long day. You want this?\" I hold my ID between two fingers, but the bouncer shakes his head.</p><p>\"Nah, I know you're barely legal,\" and he lets me through.</p><p>I walk to the far end of the bar and sit with my back to the door. If I see anyone else tonight, I'll die. I hope Emma doesn't come in here. I order a shot, knowing it'll go straight to my head. It burns my mouth and throat, but I manage to swallow it and ask for another. As the alcohol warms me, I stare at the amber liquid in the tiny glass. I want Cole. I want him so badly that it feels like my chest will cave in and I won't be able to breathe if he doesn't come. I pull my phone out of my purse, but put it down on the bar. I stare at the plastic case, at the scratches and dents, and feel lost. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I lift the second shot and down it. It doesn't burn as badly this time. The bartender gives me a third, but mutters something about slowing down. I don't care. I cradle the glass in my hand, watching the contents swirl. The door opens and closes a few times. People come and go. Their lives go on even though mine fell apart.</p><p>When I down the third drink, I slam it back down on the bar. My fingers pinch the glass. I'd been staring at my phone and the shot glass the entire time. I didn't bother to look up. When I do, I nearly choke. Those sapphire blue eyes lock with mine and steal my breath.</p><p>Cole.</p><p>Chapter 7</p> <p>My heart crawls up my throat and into my mouth. Every hair on my body stands on end and I shiver. It's like seeing a ghost. He was mine, and now he's not. Cole doesn't move, he doesn't say anything. He just sits there in his silk shirt and watches me from across the bar. An unbidden memory flashes behind my eyes of another time Cole watched me, and my cheeks flame red.</p><p>Eyes locked with Cole, I clear my throat and tap at my empty glass. The bartender is an older guy, Charlie. His hair is graying at his temples, dark eyes, and he's really nice. Charlie pours, and steps in front of me, blocking Cole. I look up at him. \"Anna,\" Charlie says in a whisper, \"someone's going to have to scrape you off the floor if you drink that. You want me to call someone?\"</p><p>I shake my head, but the room tilts. I think about something he said before about my weight and it finally make sense. I smile. \"Lightweight, ah, that's what you said.\" I take the glass from him. My body is warm and tingly. For once, I don't have the throbbing sense of loss in the center of my chest.</p><p>Charlie looks at me and shakes his head like I disappoint him. \"Let me know when you want to leave and I'll call you a cab.\"</p><p>I nod and regret it. The room appears to shift again. It tilts higher, like a boat stuck at the top of a wave, and then settles back to where it should be. When the room is no longer moving, it takes me longer to focus on Cole, but I do. He has stubble on his cheeks. It makes him look older than he is. There's a drink in his hand, probably scotch. His dark hair hangs over his eyes, making them seem bluer. Torment lines his face, like he hasn't slept in weeks. Cole watches me, his eyes never drifting from mine.</p> <p>I hold the drink longer than I intend, but I want to be able to walk home. Right now, with the way the bar seems to be swaying beneath me, that won't be possible. I giggle to myself. I love boat rides. That's what this feels like, a boat ride. The waves roll up and down, gently swaying me, or the room, or both. I don't really care. My mind snaps back to Cole and the momentary happy thought is blasted to bits.</p><p>I roll the rim of the glass between my thumb and forefinger, watching Cole. Neither of us speaks. Words pile in my mouth of things I want to say, but I know I'll never have the chance. It makes me feel hollow and brittle. In all my life, a single man has never had such an effect on me. I feel broken without Cole, like a piece of me snapped off and will never return.</p><p>I wonder if I'm like Jesse, if Cole admires me, but that's all. The look on Cole's face says something else, but I don't know what. I lean forward on the bar, stretching my arms out to help hold me up. It forces my cleavage up, pressing hard against my neckline. I lift the glass and put it to my lips. Cole's eyes track the movement, and his lips part like he wants to say something. Our eyes lock and for some reason it feels like he's telling me not to drink it, to put the glass down. We stare at each other for a few moments and then I toss back the shot. It doesn't even burn this time. I place the glass on the bar top and look at it. It's very pretty, all short and thick. The light shines through the clear glass, making an illuminated star on the bar top. I gaze at it and all the pretty points, and when I lift my head, Cole is gone.</p><p>Anguish rushes into my chest, crushing me. I can't do this. I can't see him and not react. My arms slip down and I rest my head on the bar.</p><p>A second later I feel a hand on my back, and Cole's voice is in my ear, \"Come on, Anna. I'll take you home.\" He slaps down some cash and it sounds way too loud.</p><p>It takes me a second to realize that Cole's trying to get me to stand up. The bartender and the bouncer both look at me like they're concerned, but neither of them says anything. Cole pushes us through the door and I'm hit with a gust of cool air. It makes me shiver. I wrap my arms around myself and look down. Sparklie yellow sneakers are on my feet. I love them! We stop walking so I can wiggle my toes and watch them glitter.</p> <p>Cole's warm hand wraps around my arm, \"What is it with you and those shoes?\" He pulls me gently, encouraging me to walk. I look up, surprised to see him.</p><p>\"I saw you in the bar,\" I say, smiling at his beautiful face. We stop walking and I speak to his chest, not looking at his eyes. My fingers lift and fuss with his collar. \"I never thought I'd see you again, and there you are.\" I blink and look up at him like he's not really here. Narrowing my eyes, I try to focus harder, expecting him to vanish when I do so. When he's still there, I lift my finger and press it hard to his chest. \"You are here.\" I want to cry. I want to weep. I want to giggle. My emotions are short circuiting and I have no idea what to do.</p><p>Cole takes my hand as my finger presses to his chest again. \"I'm here. I admit, I came looking for you and lost my nerve. I didn't expect you to walk in and get plastered.\" He's looking at me with those sexy eyes and I feel paralyzed.</p><p>I know I need to say something. \"I couldn't sleep.\"</p><p>\"Neither could I.\" He looks at me with such a humble expression on his face. Cole looks lost, his eyes drink me in, as his hands linger close to my face like he wants to touch me, but he doesn't. My gaze drops to my feet. I stare at the dirty side walk and my bright yellow sneakers.</p><p>Cole lifts my chin with his finger. I gaze into his eyes, unable to look away. \"I wish things could have been different.\" That's all he says. It's the same thought that slams around inside my skull all day long. A thousand what ifs keep me awake, pillaging my peace, and making me into a freaking lunatic.</p><p>\"Me, too,\" I manage. After a moment, Cole takes my arm again to steady me, and we walk back toward my apartment.</p><p>The night air fills my lungs, but I can't feel it. I can't feel anything; not Cole's hand on my arm, not the chill in the air, not the humidity that curls my hair tighter and sticks to my skin. Numbness races through my veins. It was the only way to get through the day, and now it's the only way to tolerate having Cole so close and knowing that he doesn't want me.</p> <p>We get to my door and Cole helps me up the steps. I fish through my purse looking for the key. When I lift it out, I see Cole's blue gaze and freeze. I want things to change, but I don't know how to change them. My heart beats harder, as his gaze drifts to my lips. I want him to kiss me. I want him to take me in his arms and cover me in kisses. I want him to tell me that he believes me and he'll never doubt me again. I want this rift between us to mend, but I don't know how to fix it.</p><p>Cole draws closer, like he can't manage to stand so near to me and not touch me. Before I know it, his lips are a breath from mine. His eyelashes brush my cheek as he stays there, nearly kissing me, but not. My pulse pounds in my ears. I want to reach up and take his face in my hands. I want to tell him that I love him. My body reacts to Cole, to that hot gaze, and the spot between my legs throbs. My breasts feel full, like they need to be touched. I barely breathe as Cole's lips stay there, like he's fighting the urge to kiss me.</p><p>Finally, Cole takes a breath and shudders. He pulls away, and I feel part of me ripped away with him. A shiver trails down my spine and drops into the coldness that pooled in my stomach. I can't stand it. Regret turns to tears, but I blink them away. I turn and push the key into the lock. The door won't open. I bang it with my fist, and start to cry. Cole reaches for the lock and twists the knob. The door opens and I walk through, without looking back at the man who broke my heart.</p><p>Chapter 8</p><p>Sunlight pours between the slats and blinds me. I roll over and pull my blanket over my head. Everything is so damn loud. The crinkling blankets sound like snapping boards. I groan and lay on my side, curled into a ball. Cole's eyes flash across my mind. Random words he said echo through my head. The sensation of his hand on my arm, how warm and strong it felt. These things flicker in my mind and are gone before I can blink. They don't connect to other thoughts. They just drift, floating on a current of regret that insists on bubbling up my throat.</p><p>Emma's voice is soft, as she speaks from the other side of the door. \"Anna, are you alright?\" She pushes the door open slowly, without knocking. I vaguely remember walking past her and Edward last night on the way to puking up my guts in the bathroom. \"It's past noon.\"</p><p>Bleary eyed, I turn over and lay flat on my back, but my stomach is still queasy and protests. I push myself up on my elbows and look at her. My voice is scratchy, \"I want to say that I'm fine and smile at you, but I just don't have it in me to fake it right now. I'm not fine. I'll never be fine.\" I breathe and feel the air fill my lungs. The words have been lodged in my mind for too long. It's something I know, but didn't have the heart to say.</p><p>Emma walks toward me slowly and sits on the edge of my bed. She pats my leg, saying, \"It'll be better. Give it time.\"</p><p>\"That's what people say when they don't know what else to do.\" I pull my legs into my chest and clutch my ankles under a wad of blankets. My head hurts. Emma watches me with pity in her eyes. Finally, I say, \"I saw him last night.\"</p><p>\"Who? Jesse?\" Her pretty face looks confused as she tries to figure out what I mean.</p><p>I don't shake my head. It'll hurt too much. Dejected, I stare at my bedspread and say, \"Cole. I was well on my way to being totally plastered when I looked up and saw him. He sat there, watching me.\" I find my voice doesn't want to work. It's the closest I've been to Cole in nearly a month.</p><p>\"Oh, Anna. I didn't know. I'm so sorry.\" She scoots up next to me and puts her arm across my back and gives me a sideways hug.</p><p>\"How do I get over him?\" I ask, looking at her. Emma's been my best friend for years. She's been there through labs and finals, but this is the first time I've had to deal with heartbreak. I wish it would just stop.</p><p>\"I don't know, Anna. I've never been that into a guy. I'm actually a little jealous about that.\"</p><p>\"What?\" I say, and glance at her, stunned. Emma always has a guy hanging around her. She seems crazy about most of them. Her answer surprises me.</p><p>She shrugs, \"I might turn a lot of heads, but I still haven't found anyone that comes anywhere close to getting my heart, but you have. It makes me a little envious.\" She winks at me.</p><p>\"My advice would be to keep doing what you're doing, because this part sucks.\" I rest my forehead on my knees.</p><p>Emma puts her hand on the back of my head. \"So, this part isn't worth the other part?\" I glance at her from under my arm. \"I mean this is the down side. Every coin has two sides and the other side had you reeling. I mean, is the bad so bad that you'd toss the good, too?\"</p><p>I want to say no, but right now I can't say anything. \"I have to get over him.\"</p><p>\"Anna, what if that isn't the way this works?\"</p><p>\"What do you mean?\" That was like the worst thing she could have said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I mean, what if you don't get over him? What if you just learn how to get on without him? People who've been in love have that haunted look in their eyes. It's like a piece of them is unattainable, forever held back and protected at all cost.\"</p><p>\"Like Cole's eyes.\"</p><p>She nods. \"I don't know my ass from my elbow on this stuff, but maybe he'll always be a part of you. Maybe you don't get over him, you just learn to get on without him.\"</p><p>Silence fills the air. I agree with her. I need to move on. \"You think I should be going out with Jesse?\"</p> <p>Emma pulls her knees to her chest and mirrors the way I sit. \"Maybe, that's up to you. But I don't think that you'll get back to your life until you make some changes. If nothing changes, everything stays the same, right?\" It was what the professor in our philosophy class said. \"If you do what you've always done, you get what you've always gotten. If you want something different, then make something different.\"</p><p>I understand now. I just don't know if I have the guts to do it. Being a workaholic sounds more appealing, but the nights are so unbearable. I feel the shift, the change within me. I accept what I have to do, and I'm lucky that there's already a great guy there who wants me.</p><p>Chapter 9</p><p>I dress for dinner carefully, making sure I look like a sex kitten. My hair is smoothed and hanging loose in long waves that extend down my back. I borrowed a black dress from Em that fits me a little too snuggly, but it makes my boobs look bigger, so hey, I can deal with it. I pull on inky thigh highs with lace at the top and attach them to my garter belt. That is also black lace. It matches my favorite bra. I slip my feet into killer shoes, meaning they could kill me if I fall from this height, or that I could easily use the heel as a weapon.</p><p>When I finish, Em does my make-up and talks to me about her job. \"Close your eye. Yeah, like that.\" A cold wet glob starts to get dabbed across my lashes, liquid liner. \"Stacey is easy to work with and after you gave me that exclusive, it really helped. It also made the press disappear which was awesome, because that would have sucked if they stuck around.\" She's talking too much because she's nervous for me. I never dress up this much. She knows what it means, she knows what I intend to do with Jesse later to move on.</p> <p>\"Look up.\" She dabs my lower lashes with cold gook and talks as I stare at the ceiling. \"He's really patient, too. They didn't teach us a bunch of stuff at college, but he said that's normal - that most of the things you use in real life are learned in real life. That's kind of like what you were saying with opening your studio. It's easier to understand when I'm doing it every day. I guess it's the difference between theory and practice.\"</p><p>She takes a tissue and blots my lips. I look at Emma as her eyes rove over my face, looking for imperfections in my make-up mask. After a moment she grins, and I know she's finished. Emma steps back and says, \"Heeellllllo sexy.\"</p><p>I feel different, more confident, more certain. I thank Em and the door buzzes. She takes off to let Jesse inside as I finish up. I hook a pendant around my neck. It dangles above my cleavage and draws attention to the girls. Like they need more attention. I'm practically popping out of this dress.</p><p>I smooth the supple fabric over my hips and will myself to relax. This is a good thing. This is what's next. Since speaking with Emma, I realized that I don't have to stop loving Cole to move on. I just have to be willing to try and live my life without him.</p><p>\"You can do this,\" I say to the mirror and turn toward the door.</p><p>Jesse is standing there with a smirk on his lips. \"You always talk to the mirror?\"</p> <p>My cheeks burn at his teasing, but he doesn't comment. His witty retorts died in his throat when I turned around. Jesse's eyes ravage me, drinking in every detail. He steps into the room and his gaze darkens. \"You look spectacular.\"</p><p>I smile shyly and it just makes him more taken with me. His eyes lock on my body. Jesse has a hard time keeping his gaze on my face.</p><p>\"Thanks,\" I say. \"I thought dinner, and then maybe we could come back here after?\"</p><p>His eyes lift and meet mine, \"Anything special you have planned for later?\"</p><p>\"Maybe,\" I grin back and lift the hem of my dress, showing off the thigh highs, and then lifting a little more so he can see the bottom of the lacy garter belt. \"I thought I could show you this and a little more.\" I drop the skirt and it falls back into place against my thigh. Jesse looks like he's going to race across the room and throw me on the bed.</p><p>Instead, he steps toward me and takes me in his arms. He presses a gentle kiss to my lips. When he pulls away, he says, \"That sounds perfect.\"</p><p>We go to dinner at some classy little place that Jesse picks out. We talk, but my mind keeps skipping to later. I want his hands on me. I want him to make me forget everything I lost. I wonder if I suck, if I'm a slut for forcing a relationship forward when I can't even feel anything. I hope Jesse's touch will make me feel something. I hope his kisses wake me back up and that I'll feel content in his arms.</p><p>Dinner is wonderful. After we order dessert, I excuse myself to use the ladies room. It's clear across the other side of the restaurant. As I walk, my skirt swishes above my knee, drawing male eyes. Their gazes land gently on me and I feel beautiful. Confidence surges through me as I smile. Something strange is happening to me. I'm no longer Anna. I'm this classic sex goddess. Guys never openly ogle me, but tonight, that's all they do. One guy winks at me. I wink back and keep walking.</p> <p>I spend a little too much time in the ladies room, and when I walk back to our table, I circle around the other way. I see someone - a guy - hunched over our table, blocking my view of Jesse. They're having a tense conversation. When I'm close enough, I catch the tail-end of it.</p><p>Jesse's tone is harsh, scolding, \"...might be the one fucking her, but you're the one who has her heart.\"</p><p>\"Anna doesn't - \" he starts saying, but I cut him off, shocked.</p><p>\"Cole. What are you doing here?\" He turns and looks me over, like he disapproves of my outfit.</p><p>\"That's very different than what you wore last night,\" Cole says coldly.</p><p>My hackles raise. I can't remember most of last night, and the innuendo will piss Jesse off. I breathe and his eyes drift to the swell of my breasts and slowly caress my neck, until Cole's gaze locks with mine. The way he does it sets off an explosion within me. I want him. I feel my body react to him, but I hide it. Cole doesn't see the desire I have for him, and he'll never see it again. \"I'm on a date and having you come over and bother us isn't becoming.\"</p><p>Cole's brow raises, \"I was just leaving, Miss Lamore. I wouldn't want to ruin your evening.\" He inclines his head to me and leaves. I watch him walk away, wondering how things got so bad. This is worse than when we first met.</p><p>I slide back into my seat and look at Jesse. \"How could you say that to him?\"</p><p>\"I didn't mean to upset you. I'm sorry.\" Jesse looks mortified. He didn't see me walk up to the table either. His eyes won't meet mine. \"I know it must have sounded horrible.\"</p><p>I shake my head and cover his hand with mine. He glances at me. \"Don't try to explain. I know you're just trying to help me get over him.\"</p><p>\"It's more than that, Anna.\" Jesse swallows hard and threads our fingers together. \"I'm not sure how much of a chance I have after him. Everything I do looks weak compared to that guy. I want you, Anna. I want you to give me a chance to make you happy.\" Jesse rubs my hand with his. Although his words are pleading, his voice is not. He won't beg.</p><p>I look at his hand, and then back up at his eyes. \"Let's get out of here. I have some more black lace to show you.\" I smile at him and wink. I don't understand why Cole was at the table, but I'm not letting him affect me anymore.</p><p>We walk back to the apartment hand in hand. Periodically Jesse's shoulder brushes mine. I smile at him. Somehow we start talking about my lace. \"I noticed you wear thigh highs. They're really sexy, but I had no idea you wore garters, too. That's dream territory, Anna.\"</p><p>My inner sex kitten is fighting to commandeer the conversation, but I keep beating her back. She sees the lust in his eyes and wants to use that to her advantage. \"Actually, the bra, panties, and garters were my favorite set.\"</p><p>\"Were?\" he asks.</p><p>I wink at him. \"Yes, they were my favorite set until the panties went missing.\"</p><p>Jesse stopped, his eyes not so subtly drifting to my hips. \"You're not wearing panties?\"</p><p>I don't answer. I just smile at him. He stands there panting like a cartoon character and I grab his tie. When we get to my door, I push him up against it and kiss him. I don't do the little chaste kisses he keeps giving me. I push my tongue into Jesse's mouth and slide my leg up his thigh. Jesse kisses me back and I finally feel hot. Pulse pounding, I break the kiss and turn around. Jesse leans against me, pressing me to the door. He rubs his hips against me and I can feel him, hard and ready.</p><p>He whispers in my ear. \"I want you so badly. You have no idea how much.\"</p><p>I moan, and stay there for a second, feeling him push against me. My heart's hammering in my chest. The thought of Jesse lifting my skirt and fucking me from behind, against the door in public, races through my mind. Oh God. I fumble with my key until the door opens and we stumble inside. His arms wrap around me as his tongue finds my mouth. Jesse kisses me harder and I let him. I don't hold back.</p><p>The apartment is empty. Emma left for the night to give me time alone with Jesse. His hand grips my thigh as I slide my leg up. His fingers press into my flesh between the garters and stockings. I lean into him, kissing him harder, forcing my breasts into his chest. I keep my eyes closed, thinking about nothing except the need in my body and that Jesse is there for me. I like him. I want him. This will be good for both of us.</p><p>Jesse's hand cups my bare ass, and I moan into his mouth. My hands find his tie and loosen it from his neck. I slowly work at his buttons as we kiss and peel his shirt away, stripping him in the living room. The curtains are open, but it's dark inside. I'm confident that no one can see in unless they press their face to the window.</p><p>Jesse pushes me away. Breathless, he says, \"I think we need to see the lace that started all of this.\"</p><p>I grin wickedly and unzip the back of the dress. It falls to the floor in a quick swoosh and I'm standing there in a sheer lacy bra, with thick lace garters where panties would be, thigh highs, and fuck-me heels. Jesse's eyes rove over my body and his hands soon follow. The lace garter belt sits right at my hips. If I part my legs, he'll see everything, and have open access to all of me.</p><p>Jesse lifts me and moves me to the couch. My legs wrap around him as he trails kisses down my neck and to my breast. I close my eyes, wanting to get lost in lust, but I see Cole's face. My eyes snap open. I won't do that. I won't have sex with one guy and pretend he's another.</p><p>Jesse feels me stiffen. \"Are you okay, Anna?\" His hands are behind my back, his lips gently pressing to the lace of my bra, teasing my nipples.</p><p>I nod and he continues, but I'm not okay. As Jesse's hands move over me, I notice how different they feel. I keep comparing him to Cole. It doesn't matter if my eyes are open or closed, I see Cole. In one last desperate attempt to get Cole out of my head, I lift Jesse's face to mine and press my lips to his. The kiss deepens and I hold him tightly to my body. His fingers splay on my face as he kisses me back. When Jesse rocks his hips against mine, and I feel his hard length though his pants, my fa&amp;ccedil;ade cracks. I suck in a jagged breath and push him back. Jesse is panting. His body is covered in a thin sheen of sweat. Desire darkens his eyes, but when Jesse looks at me, he sees it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Instead of saying something, he kisses my forehead and lies down next to me.</p><p>After a few minutes, I say, \"I'm sorry. I've been leading you on and I - \"</p><p>Jesse sits up and presses his fingers to his temples. His words are right - they're the words a gentleman should say - but his tone is off. He sounds scolding instead of understanding. He doesn't look at me as he speaks. \"No, don't say that. Never apologize for this.\" Jesse releases the death grip on his head and stands, running his hands through his hair. He takes a deep breath and looks at me.</p><p>\"I thought I could,\" I try to explain things to him. \"I thought if it was going to be anyone, that it'd be you.\"</p> <p>He turns and looks at me sadly. \"So did I. You're beautiful, Anna. Everything I ever wanted - the bombshell body and the brains. I hoped that I'd be the guy who got you over him, but I see that isn't going to happen.\" His tone shifts from hopeful to angry. It's horrible. I don't know what to do, but it turns out that I don't have to do anything. Jesse grabs his things and leaves without a backwards glance.</p><p>Chapter 10</p><p>After that dreadful moment, I pull on my dress and sit on the couch, staring at the wall like it's a TV. I'm such a mess. I can't even hook-up with a guy who's nuts about me without messing it up. Why did I have to say something?</p><p>I can't stand to sit home. I pull my dress back on and walk down to the bar. This time I order a shot and just sit there, staring at it like it has the power to reveal some hidden message that I'm just too thick to understand. The door opens and I feel the cool night air travel across the room and slip over my skin. The sleeveless dress doesn't do much to keep me warm, but it does lift my ego. I've had three attempts at my number since I walked in. Mental note to self; next time I want meaningless sex, borrow Emma's dress and walk around commando. It's like the guys have X-ray vision and know I've got nothing on. Actually, this is weird for me and the no-panties-thing wasn't on purpose, either. When I went to put on the bra, the panties were missing. They weren't more than a scrap of fabric, but I didn't have anything else that would look right under the lace garter, so I went without. Those were my favorite pair of panties. They fit perfectly and showcased my ass, making it look model perfect. I asked Emma if she'd seen them, but I must have left them at Ma's house with some of my other laundry.</p><p>I cross my legs and raise the glass to my lips. Finally, I tip it back. The amber liquid slides down my throat, burning a hot wake in its path. I take a breath and order another. My process repeats. I have no intention of becoming a drunk. I won't order another drink after this shot, so I sit with it longer, allowing the buzz from the first shot to penetrate my foul mood.</p> <p>I don't know what I'm upset about. So, I couldn't sleep with Jesse. That just means I'm not a slut, right? Wrong. That voice in the back of my head won't shut up tonight. I stare at the bar top. The lights gleam off the shiny surface.</p><p>I want my life to change, but I don't make changes. I keep doing the same thing. I feel eyes on the side of my face, but I don't look up. It's another guy wanting my number. I should just tell them that I'm a panty-less fraud, but he'd stop listening at panty-less. I cross my legs tighter, hooking my heel to the back of the stool. I don't look up. Instead, I trace the glow of the light on the bar top with my fingernail, while I keep my other perfectly manicured hand on the shot glass.</p><p>The guy sits next to me and it isn't until he orders that I notice who he is. His voice drips over my body like liquid seduction. He has the ability to stir something deep inside of me that makes me hot all over. I don't turn. I don't look at him. I hold my legs tighter together and try to ignore the sensations pelting my body.</p><p>Cole glances at me out of the corner of his eye, \"Date didn't go well?\"</p><p>\"You're an ass,\" I reply, still not looking at him. If I turn my head, if our eyes connect, there's no way I'll be able to live through it. I'll throw my arms around his neck and beg him to take me back. I'm not a prideful person, but I can't ask him to take me back. I can't let him know how badly he's messed with my head.</p><p>\"You say that to all the men.\" Cole sips his drink. The ice cubes clink together when he places the cup on the bar, empty. Charlie, the bartender, looks at me with questions in his eyes. I look back, willing him to understand that I want Cole to leave me alone, but Charlie doesn't get it. The bartender refills the drinks and leaves us.</p> <p>\"No,\" I say, \"just to you. Did you really have to walk over and give him pointers on getting me into bed? What the hell was that about, anyway?\" My skin prickles.</p><p>Cole's looking at me, his gaze is sliding over my arms and lands on my chest. Cole watches my breasts swell as I breathe, making no attempt to hide it. \"Wow. Did the little guy actually say that?\" After a second, Cole looks away from me. His tone shifts from condescending to serious. \"That's not what happened, okay? He approached me. I didn't want to talk to him. On my way out, I went to tell him off and you walked up.\"</p><p>\"Yeah right. Why would Jesse go talk to you? I was a sure thing, so he goes up to you and says... what?\" I can't even imagine why Jesse would do that. It makes no sense. Irritation shoots through me. I don't wait for him to answer. I do my shot and slam it on the bar, before standing, and saying, \"You know what? I don't care.\" I turn to leave, but Cole grabs my wrist.</p><p>He holds on tight, like I'll die if he lets go. \"He told me that you love me. He said he might have your body, but your heart is somewhere else, with someone else.\" Cole releases my arm and I freeze.</p><p>I can't move. I speak without thinking, \"Why would Jesse say that? Why would he do that?\"</p><p>\"Because he loves you. He wants you to be happy, even if it isn't with him.\"</p><p>Mortified, I stare at the floor, refusing to meet Cole's gaze. This can't be happening. I feel a tremor rock through my body. I feel the cool night air against my hot skin. I feel Cole's dark gaze burning a hole in the side of my face, but I remain rigid. I can't move. Neither of us says anything. Neither of us moves. I don't know if I want the moment to end or drag on forever. Suddenly, I ask, \"Are you following me?\"</p><p>He nods, \"Yes.\"</p> <p>Shocked, I ask, \"Why?\"</p><p>\"I wanted to tell you something, but I needed to know the answer to something first. I'd walk to your apartment or come in here, hoping to run into you, but I didn't get lucky until last night.\" I don't respond. I can't find my voice. My knees are jelly and the fuck-me heels are thinking about making me bend over a stool every time Cole's voice caresses my ears. \"Tonight was different. I didn't follow you and him. I wouldn't do that to you. It was a coincidence. I was out with my lawyer going over testimonies for the hearing and your name is on the witness list for Sottero. When I saw it, I lost my mind. Then, I look up and there you are, beautiful and blindingly sexy. God, every man in the room wanted you.\"</p><p>\"Not every man,\" I breathe. \"Not the one I want.\" My words free me and I can move. I don't look at him. I step away, expecting Cole to say my name, but he lets me leave. My eyes are on the floor as I walk to the door. Suddenly someone is in front of me. When I glance up, I suck in air, startled to see Cole.</p><p>His eyes lock with mine, pinning me in place. \"That's not true.\" My heart rate jumps, but I can't speak. Cole's blue eyes are filled with emotion. He moves to touch me and then acts like he thinks better of it. He swallows hard and says, \"Every man wanted you. Every man in this room wants you.\" My heart is soaring, but I yank it back like a kite caught in a wild wind, fearful that it'll break apart.</p><p>\"Desire isn't enough. I'm sorry.\" I push past him. The bouncer holds open the door. I look into his face and nod, noticing the sheen in his eyes.</p><p>I wrap my arms around my waist and walk faster. It makes my boobs climb up my throat, but I don't care. I want this night to end. I can't take another second of it. As tears streak my face, I hear footfalls race up behind me. A hand touches my shoulder, and I whirl around, ready to scream.</p><p>Cole's breathing hard, like he'd run after me. \"How do you feel about me?\"</p><p>\"I already told you, and I'm not saying it again. No matter how demented you think I am, I have no desire for you to rip my heart out again. Leave me alone, Cole. Go fuck with some other girl's mind.\"</p><p>Cole presses his eyes closed, and his lips crush together. I turn away.</p><p>He doesn't move. Cole doesn't follow me. When I hear his voice, I feel it float over me and course through me like Cole is a part of me, \"I love you, Anna.\"</p><p>Chapter 11</p><p>My spine goes straight as I turn slowly, my hands falling to my sides. Shock lines my face. I stare at him. \"I didn't want you pulled into the crap with Sottero. I didn't want you to think I was wealthy and then find out I had nothing. It felt deceptive. I kept you at arm's length, telling myself that those were the reasons - that it was to spare you.\"</p><p>He's walking towards me as he speaks. Uncertainty draws his brows together. Cole looks vulnerable. I see it in his hands, in the way he holds his shoulders back, like the weight of his mistakes is crushing him. \"But it was a lie. I kept you away because I thought it'd be easier to never have you, than to love you and watch you leave me when you found out that I'd lost everything.\"</p><p>\"I'm not her - I'm not Sophia.\" The wind blows gently, lifting my hair in the breeze.</p><p>\"I know, but the fear was there. It's always there. Everyone who - \" he bites his tongue and shakes his head. \"No, not everyone. Not you. I pushed you away. Everyone else left. It's hard. This is hard. I can't understand what you could possibly see in me. Once the money is gone, no one stays.\"</p><p>I stand there, staring at him. My mind is telling me to walk away, to say that he did this to himself. Live with it. But my heart takes control of my body. I step toward him slowly, like a battered cat, skittish and scared. My heart pounds inside my chest, but I won't release the death grip I have on my arms. Cole watches me, like he knows he lost me; like he knows these mistakes are beyond repair. I stand in front of him, nearly nose to nose thanks to my heels.</p><p>The grip on my arms loosens, and I lean in slowly and say what's been on my mind for weeks. \"I don't want your money. I want your heart.\" I breathe the words, fearful that whatever spell he's under will crack and I'll lose him again.</p><p>Before I know what I'm doing, I lean in closer, brushing my lips across his. The sensation's so light. Heat sears my skin from being so close, from touching his lips with mine. But Cole doesn't move. The kiss slips across his lips and I nearly step away before his brain catches up with his body. Cole clutches my wrists hard, and he pulls me to his chest. He kisses my face and my cheeks, and finally my lips. My heart pounds harder. I don't know how this happened, how this night turned out this way.</p><p>Cole breaks the kiss and presses his head to mine. \"You have my heart, Anna. You've had it this entire time.\" He grabs me, pulling me tightly to his body and kisses me harder. His kisses make my head spin. It feels like I've lost my mind, that this can't possibly be happening, but it is. We realize we're in the street and manage to get back to the apartment. Emma is still out, but will be home soon. We head to my room. Cole pushes the door shut and locks it.</p><p>I stand with my feet slightly apart in these insane heels, feeling the cool air drift between my legs. My skin is so sensitive, I can feel every bit of me. I want his hands on me, I want him in me. I keep thinking this is surreal - that I'll wake up and Cole will be gone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He remains on the other side of the small room with his back to the door. Cole pulls out the desk chair and sits down. \"Strip for me, Anna.\" His voice is filled with desire. I want to do what he says.</p><p>My face burns when he speaks, but Cole ignores it. Slowly, I move my hips, and arms, taking off my jewelry one piece at a time. I have no idea what I'm doing. I've never stripped before, I just move the way my body tells me, knowing how much Cole likes to watch me. After I pull off my last ring, I raise my hand over my head, while the other hand trails down my neck, through my cleavage, and to my navel.</p><p>When I reach around behind me, I unzip the dress slowly, walking toward him as I do it. I'm just out of his reach as I turn and slowly wiggle my body, making the dress slip lower and lower until it hits the floor. Cole's jaw is tense. He's straddling the chair and his arms are bulging so much that I think he might break the chair back. I'm wearing sheer black lace, and I know he can see through everything.</p><p>I look at Cole, thinking I'm done, when he says, \"Keep going, Lamore. Take all of it off.\"</p> <p>My heart pounds harder. This is so different from the teenage kisses Jesse was giving me. My heart feels like it's going to explode in my chest. Every inch of me is tingling, wanting to be touched, but Cole doesn't move. His eyes drift across my body lazily. If Cole hadn't confessed that he loves me moments ago, I wouldn't have been able to tell.</p><p>I run my hands slowly over my body, across my stomach, and over my breasts. I stretch my hands above my head and turn, sashaying my hips as I do so, and bend over to unhook my bra. I hold it out on my finger tip and let it dangle. Cole's eyes drink me in. He doesn't look at my face for a long time, and I don't want him to. I wonder what he's thinking about as he watches my breasts sway when I remove my stockings one at a time. The last thing I'm wearing is the black lace garter belt. I slip my thumbs under the edge of the fabric and sway my hips back and forth slowly, lowering the piece of fabric until it's on my ankle. I lean forward, like I'm going to kiss Cole, but I don't touch him. The muscles in his arms and chest are tense, like he can't sit there and watch for another second, but I'm not done yet.</p><p>Slowly, I bend at the waist, letting him watch from behind, as I take my impossibly high heels and slip them from my feet. When I'm done, I sigh like I'm bored and stretch, arching my back, forcing my breasts within a breath of his mouth.</p><p>Cole breathes harder. His gaze is hot, searing my body as he looks from my breasts to the place between my legs. I stand in front of him with all my weight on one foot and my hands on top of my head. I mean to sigh, again, but it turns into a moan. I want him so badly. I want him to cover my body in kisses, tie me up, and fuck me until I scream him his name, but Cole doesn't move.</p><p>I lower myself in front of him. My legs part as I go down, and I look him in the eye. My hands are next to his on the back of the chair, but neither of us touches. \"Fuck me.\" I say the words slowly, making my lips encase each syllable.</p> <p>Cole's eyes meet mine. They promise ecstasy, but he doesn't move. I do something crazy, and stay in front of him like that, knowing he can smell my need. I leave one hand on the back of the chair and dip the other below my waist. I stroke my clit a few times and push my fingers inside. I gasp as I do it, my lips parting as I sigh seductively. Cole's eyes never leave my face. He watches me as I do it and I know it's made him hard. The bulge in his jeans is all mine.</p><p>When I slip my fingers out from between my thighs, I lift them to Cole's lips and say, \"Taste me.\" He complies and parts his lips, opening his mouth enough for me to slip my fingers inside.</p><p>Each time his mouth sucks my finger, my body reacts. My nipples become taut, and my breasts swell, aching for his touch. His lips suck on my fingers, slowly teasing each one. It makes my body throb with desire. I want those lips pulling my nipples and teasing me into ecstasy. This isn't enough. My head falls back as I pull my finger from his mouth.</p><p>Cole grins at me. It's the first confirmation he's given that he likes what I'm doing. I don't know how to have sex this way. It's not rolling around in the blankets. It's a prolonged dance, each of us teasing the other until we are so fuck-crazy that one of us cracks. I see it in his eyes. That's what he wants. It's a battle of wills, of teasing and tasting, without touching. My God, he is so messed up, and I totally love it.</p><p>I repeat my previous movements and slip my fingers between my legs. I'm slicker this time, wetter. I close my eyes as I push one finger in at a time and pull them away covered in my damp heat. I lift my hand to Cole's mouth again and smile wickedly. \"Lick my fingers one at a time.\"</p><p>He does as I ask. His tongue sweeps across my finger, sucking and tasting each one. His fist grabs the chair back harder, tighter with each taste. It makes me wetter and fills my body with heat. I feel the place between my legs throb as he sucks my pinky and I'm sorry it's over.</p> <p>Before I can think of something else to torment him with, Cole says, \"On the bed.\"</p><p>Chapter 12</p><p>I rise slowly, brushing my breast against his cheek, feeling my hard nipples sweep across his lips as he sucks in air. Cole closes his eyes for a second and I scold him, \"Eyes open, Stevens. Watching is a requirement.\" His blue eyes are blazing when they open, like he wants to swallow me whole. My girl parts clench in response.</p><p>I climb onto the bed on all fours and crawl to the headboard. I know what he wants. I can do this for him, but when I sit down, he says, \"No. Ass toward me, in the air. Stay on all fours, Lamore.\"</p><p>Oh my God. I blink at him, shocked, but I do as he asks. I crawl back toward him, and once I'm at the end of the bed, I turn around. I lower my head and leave my ass in the air. I'd give anything to have his hands on me, to feel his dick pressing into me right now, but I refuse to be the one to cave first.</p><p>\"Rub your clit,\" he says from the chair. I move my hand over my sensitive flesh and instantly feel the need to have him inside me. Every inch of my body is screaming for him to pushing into me again and again. Lust races through my veins and I rub. I keep my hips still, knowing that's what he wants.</p><p>Before I know what's happened, he's behind me. I stop rubbing for a second and he slaps my ass. The sting of his hand shoots through my leg and between my thighs. I gasp. He says, \"Don't stop. Don't push back, and don't come.\"</p><p>Grabbing the pillows around my head, I moan his name. Okay, maybe I'm ready to beg. Cole is still dressed, so whatever he's planning to do isn't going to involve fucking me senseless. I continue to rub in slow circles as Cole's hand cups my butt. Suddenly, his other hand is between my legs, pushing into me. I gasp and move, not expecting his fingers there. His other hand slaps me and I moan. I want to fall on the bed. I want to be bad so he'll do that again.</p> <p>Cole pushes his finger inside me and slips in another, warning, \"Don't move, Lamore.\" I rub my nub and keep my butt in the air.</p><p>He pushes in another finger, slowly stretching me. The sensations shooting through my body have me so close to the edge. Panting, I feel Cole moving his fingers and it feels like magic. My body wants to writhe against his hand and move with him. It takes everything I have to stay still, to let him tease me like this and not move. I whimper, clutching the sheets in my fists, but manage to stay still. When he adds his fourth finger my body responds without me telling it to and hugs his hand.</p><p>\"Be still,\" he warns.</p><p>\"I am,\" I breathe, with so much lust burning through me that I can't stay still for another second.</p><p>That's when Cole's fingers do something I didn't think they could. He twists his hand and suddenly it's inside of me. I scream his name, not expecting the pressure, but it fades quickly to a more tolerable level. I sigh, realizing that I'm loving it. He strokes me from within, using his entire hand. Cole moves so carefully, so gently.</p><p>My body throbs, and heat explodes from inside of me. I'm wetter than I've ever been. I don't care that this will make me blush all shades of red in the morning. I love it and I want more. My fingers move as Cole required. I keep my hand between my thighs, and my ass pushes back, making his fist slide deeper inside of me.</p><p>\"Slowly, baby. I don't want to hurt you.\" Cole rests his other hand on my back and tries to still me. My body is so hot and wet. I tremble when he touches me, desperately wanting a release. \"Gentle, slowly, Anna.\"</p><p>\"I want more, harder. Please Cole.\"</p><p>\"I want you to be able to walk later. I'm not done with you, yet.\" His voice is like liquid sex. It pours over me and I can't stay still. \"Try this, sway your hips back and forth slowly.\"</p><p>Closing my eyes, I do as he says and sway back and forth. The rhythm builds inside of me, building hotter and hotter in my core.</p><p>Cole rocks me like that until I'm a mindless sex slave, begging for him to be with me. \"Please, Cole, please be with me. I need you. I need you inside of me.\" I clutch the blankets harder, trying to stay still.</p><p>Cole's magic hand is still inside me. \"Pinch.\" I do as he says, and he removes his hand, slipping one finger out of me at a time. By the time he's finished, I'm ready to hump anything. My mind has officially left my body. I fall on my stomach, facing down into the pillows. My hand slips away from my nether region. I lay there with every inch of me hypersensitive.</p><p>Cole trail kisses over my back and whispers in my ear, \"I'm going to fuck you until you can't walk. You'll have a hard time sitting down tomorrow, Anna.\"</p><p>His words make me crazy. \"I want it. Do it. I need you. I want you. Please, Cole. Please.\" I'm begging him for sex as he rolls me over. I look up into his dark eyes and see the man I love. He bows his head, taking my nipple between his lips and sucks. The sensation shoots warmth through my core and makes me scream his name. He's gentle at first, teasing and sucking.</p><p>When he stops, I start to beg again. \"Fuck me, Cole. Please...\" I arch my back and spread my legs.</p><p>He watches me, still wearing all his clothes, kneeling above me. I see the erection pressing against his pants. I have never been so jealous of a pair of jeans in my life. I want his dick on my face, in mouth, and inside me, pumping me hard. I want to wrap my legs around his waist and have him ride me until I come.</p><p>\"Please,\" I beg again.</p><p>Cole lowers his head, his dark hair is damp, and hanging in waves. \"I want to, it's just that every time you beg me, I have to make you wait longer. It's all part of the fun. If you want to be fucked senseless, stop begging me, Lamore.\"</p><p>I smile at him. It's one of those sex smiles that's sleepy and sensual. \"You want to fuck me senseless?\" There's a question in my voice.</p><p>Cole looks down at me and shakes his head. \"Of course I do.\" His voice is deep and filled with need. I lift my hand and press it to his jeans, feeling him through the fabric.</p><p>\"What happens if I strip you and jump on?\"</p><p>He laughs. The sound fills my soul. I feel a connection with him. It's like we're linked, like we understand each other. And I'm glad that he likes sex this way. It's better than I imagined.</p><p>His hand slips between my legs and he pushes into me. \"Oh God, you're so wet, Anna.\" He pushes hard one last time, forcing his finger in a far as it can go and pulls out. Raising his finger to his nose, he inhales and then wipes my damp heat across his lips.</p><p>\"You smell so sweet, so perfect. Taste for yourself.\" He lowers his head and kisses me, allowing me to taste what he tastes. I lick his lips and swallow, kissing him deeper. I want to show him I'll do anything he wants. \"That was so sexy. I had no idea you were so adventurous, Miss Vanilla.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Grinning, I say, \"I lied, remember?\"</p><p>\"I thought you were just saying what I wanted to hear.\"</p><p>I shake my head gently. Cole watches my face, his blue eyes pinning me in place. \"No, it's true. I'm a wanton woman, slightly slutty most of the time, insanely slutty around you.\" He smiles and presses a kiss to my neck, before his fingers go back to work on my bottom, pinching, pushing, and teasing me until I can't form a coherent sentence.</p><p>I pull at his shirt until it opens, ripping the buttons off the front. His chest is perfect. I pull him down on top of me and rub my naked bottom against his jeans, but he stops me. \"Beg for it, Lamore.\"</p> <p>Breathing hard, I say, \"I thought you didn't want me to?\"</p><p>Cole doesn't answer. Instead he slips off his jeans and boxers and tosses them on the floor. Cole straddles me, pushing his long, hard length against my stomach. He takes his hand and holds his length, rubbing it against me. He slips the tip of his long shaft along the outer edge of the sensitive flesh between my legs, moving it in slow circles, watching my face as he does it. When my hips buck, Cole pins me so I can't move.</p><p>Cole continues to torment me. I bite my lip to keep from begging him, loving the way he makes me feel. The teasing was so intense, so insane, that every inch of me wants to cry out his name.</p><p>Cole's voice pours over me when he speaks. \"Come on, Anna. I know you want it. Beg me.\"</p><p>He presses himself into me a tiny bit, just enough so that I can feel how hard and sharp he is. When Cole pulls away, he continues to rub his thick shaft in slow circles, teasing me. He dips into me again, so shallowly that I can't stand it.</p> <p>My body is corded so tight. I scream, begging him, \"Please, Cole, please!\"</p><p>\"Please, what?\"</p><p>\"Please, fuck me! I need you! Please!\" I keep screaming please as he slides inside of me. His fingers continue to work the hypersensitive nub and nipples, making me completely crazy.</p><p>He pushes in slowly and I gasp at his size, at how he fills me. Cole fits inside of me perfectly. Pulling out gently, Cole repeats the motion until we are clinging to each other, thrusting as hard and as fast as we can. I'm so high from lust, sex, and Cole that I don't think I'll ever come down. Every part of my body is soaring higher and higher, as he brings me closer and closer to climaxing. Cole pushes into me one last time and I shatter. Clawing his back, I scream his name and writhe against him. Cole pounds into me as I come, shattering with me, loving me completely and totally, until we are both spent. He falls breathless on top of me, his body covered in sweat, and then rolls to the side.</p><p>I blink slowly at him, like this is a dream. He's watching me with those beautiful blue eyes. \"I love you, Anna Lamore.\"</p><p>I smile sleepily back and snuggle into his chest. \"I love you, too.\"</p> <p>Chapter 13</p><p>I wake the next morning in Cole's arms. His naked body is pressed to mine. I smile and slip out of bed and pad down the hall. The scent of coffee is too appealing to resist. I emerge in the kitchen wearing my old robe. Emma is at the sink and Edward is on the other side of the counter. I feel funny seeing him, but I guess I have to get used to it. He's Em's brother. He was around before we were a thing, and he'll be around after. Besides, nothing could shake this afterglow I'm rocking.</p><p>Emma hands me a cup. Her lips are curved into a devilish grin, \"So, you going to tell me how you started the night with one guy and ended it screaming for a different one to fuck your brains out?\"</p><p>My cheeks burn as I blush. I punch her in the arm and don't look at Edward. \"Emma!\" I hiss. Sheepishly, I look up at her and realize that she heard me last night. Mortified, I bury my face in my hands.</p><p>Emma shoos Edward out and the front door closes before she winks and says, \"That's the way sex is supposed to be - all fireworks and begging for more.\"</p><p>I sip my coffee, still too shy to talk. As I wake up, the things we did last night come back to me. My cheeks are going to be stained red for the rest of my life. As if he knew I thought of him, Cole appears behind me and kisses my cheek. \"Good morning, lover.\"</p><p>Emma watches us with an amazed expression on her face.</p><p>\"What?\" I ask, after laughing a girlish giggle when Cole pinches my ass. I watch him walk to the coffee pot, thinking of all the things he did to me and wondering when he can do them again.</p> <p>Em shakes her head, \"Nothing. It's just that I didn't see it before. You two whack-jobs are perfect for each other. Who woulda thought?\" She leans her chin on her hand and stares at us like we're zoo creatures drinking coffee in her kitchen.</p><p>I swat her. \"Stop it. It's not that strange.\"</p><p>\"He's twice your age, and everything you hate. Of course it's strange. And it's wonderful, because I've never seen you so happy before. I expected you to tell me that you regretted last night, not this.\"</p><p>I smile and snuggle into Cole's strong arms. His chest is bare, but he has his jeans on. He looks at Anna and says, \"You're the one who told her to sleep with the boy?\" Cole doesn't say Jesse's name.</p><p>\"Yes, and it was a good plan to get her over you.\" Em shrugs, \"although it looks like your plan to show up and sweep her off her feet worked better.\" She takes a swig of coffee and puts the mug in the sink, and heads toward the shower.</p><p>When the water turns on in the bathroom, Cole pins me against the counter, holding me in place with his hips. He's dying to talk to me about last night. \"Did I hurt you?\"</p><p>\"No,\" I answer, shaking my head, looking into his bottomless blue eyes. I lower my voice to a whisper, \"I liked it. I think I may be a little bit of a nympho.\"</p><p>He grins, \"That's my girl.\"</p><p>I spend the next hour with Cole. We talk about me and my studio, although I never get around to the fact that I quit grad school and walked away from my diploma. I don't want him to think it was because of him. I want to find the right way to tell him at the right time. We are sitting at the table and he's leaning back, one arm over the back of his chair, grinning at me. I love that smile.</p><p>\"Come to my place later.\" He's not nervous at all. He says it like a command, like he can snap his fingers and I'll just show up. Honestly, after last night that's all it would take.</p><p>Leaning forward, I bat my eyelashes at him, \"Sounds good to me.\" Then I straighten up in my chair as a question forms in my mind. \"You still have your city apartment?\"</p><p>He nods. All the witty banter deflates and is gone. \"Yeah, my lawyer is trying to hold onto the studio and my home. She seems to think it's worth fighting for.\"</p><p>\"But, you don't think it's worth fighting for?\" I ask. This doesn't make sense. He worked his whole life to achieve this and for some reason he seems like he's letting Sophia win without a fight.</p><p>\"It's not that easy.\" He leans forward. His bare chest was distracting me before, but now I can't tear my gaze from his eyes. They look haunted.</p><p>\"Try me.\"</p><p>Cole's eyes flick up to meet mine. His lips remain pressed together, and then he decides. I see it flash across his face and his body relaxes a little bit. \"If I engage Sottero in a lawsuit, it invokes my family's right to repeal use of my name.\" He takes a deep breath and says, \"Basically, if I fight Sottero, I could lose the right to my last name.\"</p><p>I blink rapidly. This doesn't make sense. \"I don't understand. You're basically rolling over and letting Sophia screw you so that you can keep the last name of people you can't stand? Am I missing something?\"</p><p>Cole looks torn. His eyes shift from side to side and he won't look at me. His brows come together forming worry lines between his eyes. Finally, he says, \"It's the only thing I have, the only thing they gave me. Cutting off my name is like losing an arm. I could do it, but it's not the kind of thing I'd volunteer for.\"</p><p>\"So, what then, you let Sottero take everything you have so you can keep your name? Then what?\"</p><p>He looks at his hands on the table. His gaze lifts to meet mine, \"Then I start over. I did it before. I can do it again.\"</p><p>For some reason this is making me irate. He won't fight back. \"You can, but you don't have to. I love you Cole, and so take this with that in mind, but why do you want to keep the last name of the man who disowned you? What's the point? It's a name. It's not who you are.\" His spine straightens and I know I've landed on what's holding him back. \"Cole, you've forged your own path. You're not one of them. Let the name go.\"</p><p>\"I can't. It's my past. It reminds me of who I am, what I came from, and where I'm going. I can't do it. I can't risk losing my name.\" Anger fills his voice. I don't know if he's trying to convince me or him.</p><p>I smile sadly at him and put my hands on top of his. \"Whatever you do, I'll support you, but consider this. If things go well for us, if marriage ever becomes a path we want to go down, I would take your name without a second thought, but I'd still be Anna Lamore. I'll always been me, even when the name is gone.\" I smile sadly at him, wishing he could understand. \"That name may have defined the first part of your life, but it doesn't have to define the second. You are who you chose to be. No piece of paper, no grouping of letters, gets to decide that part. That part is up to you.\"</p><p>Cole stares straight ahead and I wonder if I've said too much, if I've crossed a line, but then he reaches for my hand and pulls me around the table to sit in his lap. I'm wearing my bathrobe and he's wearing jeans. I snuggle into his chest as his hand presses my head to his shoulder. He breathes deeply and says, \"Sometimes it's scary how articulate you can be. It's like you saw my past, like you were there or something.\"</p><p>I decide to tell him, \"Remember how I told you that this stuff kinda did happen to my family?\" He nods. \"It happened to my mother. My Grandmother didn't like my Dad. She didn't think he was good enough. Ma ran off with him. She lost her inheritance and her name. And you know what's funny? I never once felt sorry for Ma. Yeah, we were broke, but some things are worth more than money, ya know? And when you find them, you hold onto them no matter the cost.\"</p><p>Cole's silently presses a kiss to my temple. \"I'm glad I have you.\"</p><p>\"You'll always have me.\"</p><p>Chapter 14</p><p>We stay like that for a little bit. Cole has to take care of some things with his lawyer this afternoon, in preparation for the court case later this week. Before he leaves, Cole smiles at me and leans close, whispering something naughty in my ear. When he pulls back he sees my face turn bright red as I smile sheepishly.</p><p>God, I love him.</p><p>Cole leaves for his apartment after that and I have the place to myself for a few hours. I spend the day getting girlied up for later tonight. After painting my nails, I lay in a hot tub filled with bubbles, relaxing and feeling happy. Memories of last night play through my mind and I let them. The way Cole's hands felt on me, the way his eyes seared my skin, everything Cole did was exactly what I wanted. I've never had a sex dream that made me that excited. Having it happen in real life was insanely awesome. I nearly giggle thinking about what will happen later tonight.</p><p>I hope there will be more watching and teasing. And, maybe, Cole won't mind if things get a little kinky.</p><p>I smile to myself and close my eyes, leaning my head back against tub. I've never been this happy, like ever. I don't believe in fate, but that's what it seems like. Cole and I are meant to be together. Nothing can keep us apart. It scares and astounds me how much I love him. I decide that's a good thing. I relax, flicking my toes and popping bubbles occasionally, when I hear a noise. My forehead creases as I sit up a little bit and listen harder. The water dripping off my body muffles it so that I can't hear much. It's not a loud noise, so I don't know why it concerns me. It's the kind of sound a cat makes when it jumps off a couch and onto the floor. We don't have a cat though, and all the windows are shut. For a second, I think a squirrel or something got inside, but I should hear nails scraping on the floor and scampering little feet. Turning, I dangle my arms over the edge of the tub and listen. I sit so still that the only thing I can hear is my heartbeat. Maybe it's not an animal. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Em, is that you?\" I call out, but there's no answer. The feeling that I'm not alone doesn't fade. I try to ignore it, write it off as strung out nerves from the past few weeks, but when I lay back in the bubbles, I can't relax. The bathroom door is shut, but not locked. I feel a crazy urge to lock it and hide. I glance around and curse silently. I usually leave my phone on the counter, but it's in the other room. My pepper spray is in my purse, next to my bed on the floor. I don't have anything in here to protect myself with, except a curling iron and some hairspray.</p><p>Stop it, Anna! I scold myself. There's no one here.</p><p>On principle, I lean back and force myself to sit in the tub for another five minutes. I'm not some scared little kid who can't stay home alone. I try to close my eyes, but it creeps the hell out of me. My entire body is covered in goose bumps and I shiver like someone stepped on my grave. My throat tightens and I want to scream.</p><p>I sit up slowly, trying not to make a noise. I feel stupid for reacting this way. I locked the front door after Cole left. The windows are all locked. There's no way someone got inside. I would have heard the door split open. The sound should have been loud, but it wasn't. It was soft, like a paw striking the carpet.</p> <p>Just as I decide to get up, the floorboard outside the bathroom door creaks. Instinctively, I tense. My eyes widen as my pulse jumps up into heart attack territory. I stare at the space between the bottom of the door and the floor - there's a shadow. Someone is standing there.</p><p>I don't move. I don't breathe. I sit there in the soapy water waiting for Em to knock. It has to be her. It has to be. But in my gut, I know it's not. The hairs on the back of my neck are all standing on end. Every inch of my forearms is prickled with bumps. My throat goes dry. It feels like I should scream, but I can't. I can't blink, I can't swallow. I just stare at the shadow and shiver. The sound of a hand resting on the doorknob echoes through my ears.</p><p>I'm waiting for something to make sense, waiting for Emma's voice, but it never comes. </p> </body></html>"]