["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>One</p><p>“At least he died with a smile on his face,” a forensic tech said to Fort Lauderdale Homicide Detective Adam Rafael Suarez as he helped him turn over the corpse. The tech crouched down to inspect the victim’s tight, tanned backside, and the green-handled object still extruding from it. “And a... weed-whacker up his ass?”</p><p>“A cattle prod.” Detective Samantha Brown, Rafael’s partner, joined them. “Known on the streets as a ‘joy stick.’”</p><p>The tech grimaced. “I’m thinking he didn’t get much joy out of it, Detective.”</p> <p>“Carjackers slip the tip through a window crack when the driver stops at a traffic light, zap, stunned driver,” she said, tapping the appropriate spot on her windbreaker. “You can buy them off the internet.”</p><p>“No carjacker would leave the prod behind.” Evan Tenderson, the assistant medical examiner, came to stand next to the body. “Prod... behind... get it?” He stopped chuckling when he caught Rafael’s gaze. “What’s your problem, Suarez? Didn’t Castro let you make puns back in Cuba?”</p><p>“Murder is not amusing,” Rafael said, “and I am not Cuban.”</p><p>“Hell, you Hispanicos all look alike to me.” Put out by the lack of response to his joke, Tenderson lit a cigarette and pointed one of his loafers at the victim. “Get these mitts covered, Brad.”</p><p>“A cattle prod,” the tech muttered as he bagged the victim’s hands. “What happened to the good old days, when people just killed each other with guns and knives?”</p> <p>Rafael didn’t answer. In his good old days, people killed each other with crossbows, swords and battle axes.</p><p>Something about the color of the victim’s upper back didn’t seem right, and Rafael bent down to take a closer look. What had appeared to be random tan lines was a series of long, healed welts running from just below the neck to the small of the spine.</p><p>“Who called it in?” Samantha was asking Tenderson.</p><p>The assistant ME’s top lip curled over the end of his cigarette. “Do I look like a receptionist to you, Brown?”</p><p>“It came in as an anonymous tip, traced to a pay phone down the street,” the tech said as he clipped thin plastic bags over the victim’s hands. “The dispatcher said the caller sounded like a Latino.”</p><p>“Well, that narrows it down to, what, eighty-five percent of the population?” Tenderson gave Rafael a smile filled with malice and tobacco-stained teeth. “Good luck finding the perp.”</p> <p>“Oh, shut up, Tenderson,” Samantha said, sounding bored.</p><p>“These are lash marks,” Rafael told her, indicated the fresh scarring. “This man has been repeatedly restrained and whipped some time in the recent past.”</p><p>“Detective Suarez.” One of the uniformed officers who had been performing a sweep of the grounds around the crime scene walked up and handed Rafael a large evidence bag containing something made of spiked leather and heavy silver chains. “We found this draped on that statue over there.” He indicated the life-size figure of the Virgin Mary, which paired with a matching statue of St. Theresa stood guard in oval shell niches near the convent’s walls. “Someone smashed the flood light or we would have spotted it right away. Looks like leather bar stuff, or maybe a Halloween costume. No blood stains that I could see.”</p><p>“Like you’d know how to look, Dipshit.” Tenderson grabbed his case and headed for the statue.</p><p>“Halloween isn’t until tomorrow night.” Samantha eyed the bag. “Is there a full-head zippered mask in there?” When the patrol officer nodded, she turned to the body. “Lash marks, sexual torture and fetish wear. I’ll bet he’s a sub.” She caught Rafael’s blank look. “A submissive, into bondage, beatings and other assorted masochistic kinks.”</p><p>“Aroused by torture.” Rafael felt pity for the dead man. “Perhaps he was with a lover, and things went too far this time.”</p><p>“Doesn’t explain why the body was dumped here, though.” She glanced around. “No drag marks, no wheel ruts, and it’s at least three hundred yards to the nearest parking spot. He looks like he’s about one seventy-five, one eighty, right? That’s a lot of dead body to haul around.”</p><p>Rafael waited until the patrolman had walked away before asking, “Did you touch him yet?”</p> <p>“No point.” Samantha possessed a psychic ability to see the recent past of the newly-dead through their blood. Although her life had changed dramatically three months ago, she could still use that last, human gift. “The body has been completely drained.”</p><p>Rafael and Samantha worked Homicide’s graveyard shift for a specific reason. Their colleagues on the force thought it was because they were both single and had no families to go home to. No one suspected the partners were both nocturnal, blood-dependent immortals known as Darkyn.</p><p>“What are you thinking?” Rafael asked her.</p><p>“Kinky sex and a bloodless body dumped in front of a Catholic convent.” Samantha switched off her PDA. “Someone from our little vampire club having a good time, maybe?”</p><p>Rafael heard the doubt behind the sarcasm. He had not been human for seven hundred years, but only a few months had passed since Samantha had become Kyn. She had yet to adjust to the enormous changes it had caused in her life, including discovering the fact that the man she loved had been a Kyn assassin for centuries. Some nights Samantha was more accepting of her situation than others.</p><p>Tonight might not be one of those nights.</p><p>“There is no scent trace, and no Kyn could drain a body and walk away from it. We would have found his attacker lying next to him, in thrall from drinking so much blood.” Rafael glanced up at the high walls of the cloister only twenty feet away. “It does seem as if the body was left here for a reason.”</p><p>“In front of the convent, or on our beat?” Samantha waved over the techs waiting to remove the body. “Has my boyfriend made some new enemies?”</p><p>“I cannot say.” Rafael met her gaze. “Samantha—”</p><p>“I know. He doesn’t kill humans. Or anyone. We hope. Unless they shoot me. Christ, ever since I died my life has gotten so complicated.” She buttoned the front of her jacket. “Let’s go talk to the ladies.”</p><p>The man and woman were coming to the door.</p><p>Of course they were, Dani thought as she watched them approach through the peephole. A dead body had been found in front of the sanctuary. They would come to the door, and ring the bell, and ask for someone in charge. They would have questions.</p><p>Questions for which they would want answers.</p><p>The sound of the bell made the women gathered around her turn en masse to stare at Dani.</p><p>“I will see to them,” she said, covering her hair with a long black veil that effectively shadowed her features. “Go back to bed.”</p><p>Before she had succumbed to advanced breast cancer, Sister Marguerite Aretino had given Dani her heavy ring of keys, along with strict instructions. All doors and windows were to be kept locked, and no outsiders were ever to be allowed inside the walls of the sanctuary. Boundaries had to be preserved, and the women of the sanctuary protected at all costs.</p><p>Guard them with your life, Marguerite had whispered, clutching Dani’s hand as tightly as she had her rosary. God demands this of you now, Daniela, as penance for your sins.</p><p>Her sins. What were they? she wondered. Being born to her mother? Being a female child? Or being made by the Father to absolve – to pay – for the sins of others?</p><p>She had asked the old woman once, before Marguerite had brought her to America. What I have done, what you wish me to do – when will it be enough? When may I be free of this duty?</p><p>The slap to her face had hurt, but not as much as Marguerite’s answer: You dare question the will of God? Without his mercy you would still be in the jungle, living like a savage. Or worse.</p><p>Dani unlocked the double entry doors and stepped out before the man and woman on the other side could enter. “Yes?”</p><p>“Good evening, Sister. I’m Detective Suarez, Fort Lauderdale Homicide.” He gestured to the woman. “This is my partner, Detective Brown. We’d like to ask you some questions.”</p><p>Dani stared up at Detective Suarez, who seemed excessively tall and broad-chested for an American policeman. Her ear told her he was no American, however. His accent, like his neatly trimmed black mustache and beard, brought back memories of the men who came from Europe to visit the exiles in Argentina. They, too, came out of the night, so many silent, walking shadows, with blue glints in their hair and death in their eyes.</p><p>“Sister?”</p><p>He wanted her to speak. She was staring at him like an awe-struck child instead of hiding her features. Had Marguerite lived, she would have beaten Dani until she couldn’t rise from her pallet for three days.</p><p>“I’m sorry.” She spoke to the woman, who smelled deliciously of coffee. “What questions?”</p><p>Detective Brown took out an electronic device that served as some sort of note pad. “We’ll start with: what’s your name and what do you do here?”</p><p>“My name is Sister Marguerite.” Dani slipped her hands into the ends of her sleeves. “I am in charge.”</p><p>Suarez took a step closer, almost looming over her. “You seem rather young to be running a convent, Sister.”</p><p>The woman’s earthy scent faded beneath the warm, sweet perfume of orange blossoms. Dani held her breath, and felt sweat prickling her scalp. What should she say, what should she say? Marguerite had insisted her English be perfect, but she had never permitted her much opportunity to speak with anyone. The Father hadn’t cared.</p><p>Say something polite. “Thank you.” She switched her gaze to where two men in dark overalls were carefully lifting the dead man’s thin, tortured body. The body shifted, and the street light illuminated a narrow back striped by a terrible flogging. At this distance, she could see the pattern that the scars formed.</p><p>Dani’s last, bright flicker of hope winked out and turned to dull gray ash. He’s found me again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Suarez touched her sleeve, tugging her attention back to him. Eyes of darkness, a face filled with smooth angles and strength in hiding. For a moment she thought she recognized a quieter version of her own shock. Had he, too, read the name that had been beaten into the poor man’s back? Did he know what it meant?</p><p>“Were you expecting any visitors tonight, Sister?” His voice reached into her, coaxing. “Relatives, delivery people?”</p><p>Aunts, uncles, UPS, madman?</p> <p>Daniela ignored the haven being offered by the detective’s compelling eyes and voice. He did not know. He could never understand. Dani knew what had to come next. She would not look at the dead man. There was nothing she could do to help that one now. She would keep calm.</p><p>She would go as soon as she got rid of them.</p><p>“No,” Dani said, before he repeated his question. “No one comes here. No one leaves.”</p><p>“You’re saying that the nuns here never leave the property?” Detective Brown seemed skeptical. “What about doctor appointments, jury duty, or vacations?”</p><p>They thought they were nuns. It was a logical assumption, as the sanctuary had once been a working convent. Marguerite had never left the church, not in her heart. Dani knew she was being foolish, intriguing them with the truth, but there were no more lies left in her.</p> <p>The scent of orange blossoms embraced her. “Sister?”</p><p>Daniela pressed back against the doors. “We do not leave. I have no information for you. Good evening.” She turned, but her head buzzed and her hands didn’t want to work.</p><p>“Just a minute, Sister,” Detective Brown said. “I’ll need to interview the other nuns to see if they have any information as to what happened.”</p><p>“That is not possible,” Daniela told the door. What would Marguerite tell them? “I can assure you that no one saw or heard anything.”</p><p>“I’ll confirm that personally,” Detective Brown said, “if you don’t mind.”</p><p>“No, Detective. No one here will talk to you or anyone else.” She faced them. “It is a violation for any of us to speak to you. We have all taken a vow of silence.”</p> <p>Two</p><p>“She knows something,” Samantha said as she climbed in behind the wheel of their unmarked unit. “We should have called in for a search warrant. Cap could have gotten one for us.”</p><p>Captain Ernesto Garcia, Chief of Homicide, played the part of their superior within the Fort Lauderdale Police Department. In reality, he served as Rafael’s tresora, his human servant. That he could issue orders as well as accept them made him an unusual ally.</p><p>Rafael had considered obtaining a warrant as well, but the sanctity of the convent had touched him on a level far deeper and older than his current obligations. He had been a Templar priest long before he had joined the police force. His beliefs had changed in the centuries since he had left the church, but his respect for those who devoted their lives to God had not. “Finding a dead man near a convent does not constitute probable cause to search it.”</p><p>“I guess. But still, that nun.” Because Samantha’s instincts often proved correct, she had a difficult time letting go of a suspicion. “She saw something, heard something, maybe. I don’t know. Did you see how she was shaking when she ran back inside and bolted the door? With the way we were perfuming the air, she should have talked more openly to us, too.”</p><p>Rafael nodded. Meeting Sister Marguerite had also disturbed him on several levels, including a very personal one which he never allowed to interfere with his duty. “Some humans do not respond to l’attrait.” The individual, sweet scent produced by Kyn bodies acted like a drug on humans, rendering them amenable to almost any suggestion. It also caused a certain amount of sexual arousal, which helped to make feeding on humans easier. “Or perhaps I did not shed enough scent.”</p><p>“Please. I felt like I was standing in an orange grove. You totally cancelled me out.” Samantha turned a corner and coasted to a stop at a red light. “She looked like she was going to faint when you touched her. It was right after she saw the body for the first time. What was that all about?”</p><p>“Shock and horror, I would think.” Lust had made him notice other things about the young sister, things he had no business even contemplating in such a fashion. “She is a nun, and has been sheltered from such things. Her world is made up of purity, prayer and silence.”</p> <p>“Correct me if I’m wrong, but it had something to do with you, too.”</p><p>Rafael recalled the taut face, and how she had tried to keep it averted so that he would not look at her. The excessive modesty of a bride promised only to Christ. “I am cursed by God. I expect her reaction was a natural one.”</p><p>“Cursed my ass,” Samantha said. “You’re a homicide detective.”</p><p>He looked at her.</p><p>“Okay, you’re a cursed, inhuman homicide detective. Does that mean I am now, too?” She didn’t wait for an answer. “Let’s focus on the murder and worry about God and curses another night.”</p><p>Two hours later, in the small, cramped room that served as FLPD’s Homicide Department, Samantha hung up the phone and rested her head against her fist. “God, I hate that man.”</p><p>“Perhaps you should feed on him. It might make him more willing to cooperate with you.”</p><p>“I’d rather lick blood out of a used ashtray.” She sat back. “After giving me a lot of unnecessary grief, Smokestack performed the autopsy on our victim. Cause of death was exsanguination. He found five puncture wounds: two on the wrists, one on the temple, one on the back and one on the left side of the abdomen.”</p><p>Rafael recalled a mental image of the victim’s body. “I saw no such wounds.”</p><p>“Neither did I,” she said, “but there’s a reason we didn’t, and it’s a creepy one: the killer packed some shit in the wounds and then covered them with stage makeup so they wouldn’t be seen.”</p><p>He went still. “What sort of ‘shit?’”</p><p>“Flower petals.”</p><p>Either kill me or take me as I am, because I'll be damned if I ever change...</p><p>He has been poisoned. Richard, still human, newly-crowned, crumpling the letters and tossing them into the fireplace. He will not last the month. You will go to France and see to the arrangements. And this time, Rafael, be sure that he stays in the ground.</p><p>That summer in France, with so many bodies rotting where they had fallen. Heavily-laden carriages jolting as their drivers whipped the horses into straining and pulling their occupants and the baggage out of Paris as fast as they could go. The ugly granite walls of the asylum, streaked by black streams from the countless chamber pots emptied from the ward windows. The smell of fresh-burned wood ash on the wind—</p><p>He who believeth in me will never die.</p><p>Samantha cleared her throat and lowered her voice. “Mind telling me why you look like I just kicked you in the cajones?”</p><p>“It’s nothing.” Rafael had watched as the body had been carried out of the asylum, loaded onto a cart and driven to the village cemetery. There he had observed the funeral, and stayed behind to watch the grave for weeks. Nothing had disturbed it. No one had crawled out of it. It is not Donatien. “Our shift ended thirty minutes ago,” he said, rising from his chair. “We must clock out.”</p><p>To keep up appearances, Rafael and Samantha drove their own cars to work and home, but they both lived in the penthouse apartments above the very popular night club, Infusion. The club served as a magnet for the local goth crowd, as a business front for the Jardin Noir, and the headquarters of its suzerain, the Darkyn high lord’s former chief assassin, Lucan.</p><p>Rafael reached the club first and went immediately to his master’s downstairs office. Lucan, who had an unexpected flair for creating wealth, had taken over managing most of the jardin’s business affairs. During the day, his tresora, Herbert Burke, did the rest. Rafael suspected it was his master’s way of allowing him to continue working beside Samantha for the police, although Lucan would never admit it.</p><p>The suzerain sat behind his desk, idly paging through his computerized ledgers, and sipping from a glass of bloodwine. As fair as Rafael was dark, Lucan had the face of a film star and the frame of a stunt man, and used them both without a moment of conscience. Finely-fitted black gloves encased large hands, which when bared could kill any living thing they touched.</p><p>“We are paying too much for the kegs of ale,” Lucan said to Rafael without looking up. “I should like to find a new beverage supplier before this one bankrupts me. Why are you late?”</p><p>Rafael tried to think of alternate suppliers, but all he could summon was the image of an undisturbed grave. “A human was murdered and left in front of a convent tonight. There are indications that perhaps one of the Kyn were involved.”</p><p>Lucan stopped tapping the keyboard and turned his head. “Which Kyn, precisely?”</p><p>“I cannot say for certain. The victim had been tortured and drained.” He saw his master’s gray eyes turn to chrome. “The wounds were found to be packed with flower petals, and covered with greasepaint.”</p><p>Lucan reacted to this by not reacting at all. “Then Donatien still breathes.”</p><p>“No,” Rafael insisted. “Richard sent me to France. I saw him die of copper poisoning. After, I sat watch for a month over his grave. He did not rise again.”</p><p>“Donatien was, unlike you, a patient soul, and in fact he did somehow survive his second burial. Richard had me hunt him in nineteen thirty-nine, but he used the Nazis to elude me. When he never resurfaced, Richard decided the war had killed him.” Lucan raised one blond eyebrow. “You still do not believe me. Very well, this victim you found, was he violated?”</p><p>Rafael nodded. “Sodomized with an electrical device.”</p><p>“The Brethren rarely violate, but when they do, they do not leave such work to be discovered. Donatien enjoyed putting his cruelties on display, and he always signed his work.”</p><p>“The lash marks.” Rafael could see the pattern of them now. “They spelled out his name.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Have you told Samantha anything about him?” When Rafael shook his head, Lucan’s expression relaxed. “Say nothing to her. Send word to the rest of the jardin. Donatien is to be tracked but not confronted. I will see to him personally. Now, tell me about this convent.”</p><p>“It is a few miles from here. The Sisters of the Annunciata. Their Mother Superior is named Sister Marguerite.” Rafael would not imagine her in Donatien’s hands. “She seemed very young to be in charge.”</p><p>“Then likely she is not. God, nuns, even in this enlightened age. What a waste of perfectly good females.” Lucan switched over screens and began typing. He read through the search results and clicked on a news item. “It seems that the convent is owned by a Daniel A. Nieves, and is no longer a convent.”</p> <p>“But the Mother Superior—”</p><p>“—Died six months ago,” Lucan said. “Marguerite Aretino, aged eighty-seven, Sister of the Annunciata and the last member of her order. She owned the property and the convent outright, but refused to deed it to the church after her death. Much ado was made about it at the time by the Miami Archbishop.” Lucan kept reading. “It seems she left it to Mr. Nieves, who converted it into a private nursing home.”</p><p>“Donatien would never be interested in such a place. He despised the sick and elderly; being locked in the asylum drove him mad. Only youth and beauty drew him to...” Rafael’s gut clenched. “The one pretending to be Marguerite. It must be her he seeks. She is lovely, and no more than twenty.”</p><p>Lucan nodded. “He never could resist a pretty young face.”</p><p>He would not touch hers. “I must return to convent before dawn arrives. Your sygkenis will also need protection, my lord.” Rafael didn’t have to remind his master that Samantha was still vulnerable to Kyn talent, or what Donatien could do to her, given the chance.</p> <p>“I can take care of myself, thank you very much.” Samantha said as she walked in and went to stand behind Lucan. “So, my man, why are you playing on the internet instead of waiting upstairs for me?”</p><p>Rafael glanced at the screen, but his master had managed to clear the information from it.</p><p>“Because the price of ale annoys me and you, madam, are very, very tardy.” Lucan turned around and pulled Samantha down onto his lap. “That is why Rafael believes you need protection. When bruised, my ego knows no bounds.”</p><p>Rafael saw that his presence was no longer required, and went to the door.</p><p>“Your ego makes Kevlar look like Kleenex.” Samantha began peeling off one of Lucan’s black silk gloves. Unlike the rest of the Kyn, she didn’t fear the destructive power of her lover’s hands. “Rafael, we need to get in some extra hours on this case. See you at noon?”</p><p>“I may be a little late.” He smiled at her. “Sleep well, Samantha.”</p> <p>You can’t leave us, Bridget wrote on the blackboard. The police will return tomorrow. They will have search warrants. They will wish to question us.</p><p>Dani kept packing. “You have nothing to hide. Show them everything. I told them you are living under a vow of silence. At worst, they will think you a bunch of religious hysterics.”</p><p>You promised our Mother that you would protect us from the outside world.</p><p>“I can’t protect you if I’m the one being hunted. And I am.” She slammed the suitcase shut and turned to face the older woman. “It will be the way it was in South America; that was why Marguerite brought me here. Now that he knows where I am, he will kill every one of you to get to me. But if I go, he will follow me.”</p><p>Bridget sighed and turned to the board. You could tell the police about it. They may help you.</p><p>Dani shook her head. “Enough have died.” She picked up the suitcase and took the keys to Marguerite’s car from her desk. “Tell the police as much of the truth as you can. The man – Suarez – he seemed kind.”</p><p>“I am kind,” a familiar male voice said from outside the doorway. “But I will have all of the truth, Sister.”</p><p>Dani dropped the suitcase and went for the open window, but almost as soon as she moved large hands seized her and spun her around.</p> <p>“I regret that I cannot allow you to leave.” Detective Suarez put one arm around her and caught her fist before it connected with his jaw. “Or that.”</p><p>“You have no right to trespass on our property or assault me.” Dani felt the strength beneath the care with which he held her, and didn’t struggle. What else would Marguerite say? “Release me and leave at once.”</p><p>“No.” He took out a pair of steel handcuffs and snapped one end over her wrist. “What is your name?” he asked as he reached for her free hand.</p><p>“Sister Marguerite Aretino.”</p><p>“Sister Marguerite is dead,” Suarez told her. “Who are you?”</p><p>Bridget fell to her knees in front of the door, blocking in with her bulk. She closed her eyes, extending her hands and letting her head fall back.</p><p>“No.” Dani lunged against the detective's hold. “Let go of me. Bridget, for the love of God, no.”</p><p>Two quarter-size wounds appeared in the woman's wrists, and blood began to pulse from them.</p><p>Suarez took in a sharp breath. “Dios mío.” His arms fell away, and at last Dani was free.</p><p>She caught Bridget before she toppled over and turned to glare at Suarez. “Get the first aid kit. In the desk there.” Gently she lowered the heavyset woman to the rug, and yanked up her sleeves.</p><p>“What did she use to cut her wrists so fast?” he asked as he brought the white plastic box to her.</p><p>“Nothing.” She grabbed a roll of bandages from the kit and began wrapping the wounds. “Here,” she said when she had one bandage in place, and handed him the wrist. “Apply direct pressure.”</p><p>“We will take her to the emergency room,” he said. “She will require a doctor's attention.”</p><p>“A doctor can't do anything for her.” She finished wrapping the other wound and firmly pressed her fingers over it. The cuff Suarez had snapped on her dangled from her wrist as she met the detective's gold-shot gaze. “No one can.”</p><p>“Don't be foolish. At the very least she will need stitches.”</p><p>Dani closed her eyes. She had not used it since leaving South America, so it was much stronger now.</p><p>“What are you doing?” she heard Suarez demand.</p><p>“Praying.”</p><p>Suarez believed her, and gave her the time she needed to finish. As soon as it was done, she unwrapped the bandages and wiped away the blood to make sure the wound had disappeared.</p><p>Suarez did the same thing, and muttered something under his breath. “This is impossible. She cut herself—”</p><p>“No, she did not.” Dani gently wiped a tear from the unconscious woman’s cheek. “The wounds come as God wills. Sometimes, when Bridget is afraid, I think she can make them appear.”</p><p>“Now you are speaking nonsense,” he said as he checked both wrists closely. “No wounds appear just like that, without explanation or cause.”</p><p>“There is a cause, Detective, although I cannot explain it.” She looked down at the unmarked wrists. “Do you know what the stigmata is?”</p><p>“I know of the myth,” Suarez said. “Stigmata are injuries that zealots inflict on themselves to imitate the wounds Christ received before he was crucified.”</p><p>“You must be an ex-Catholic.” Dani pressed her hand to Bridget’s brow, and saw a drop of blood fall from her sleeve. If he saw... “She is feverish. I should give her some water. Please hold her up for me.”</p><p>As soon as Suarez had his arms filled with Bridget, Dani stood and looked down at him. For a moment she wondered what it would be like to be held in his arms, to be protected by such a man. Then she ran across the room.</p><p>“No.”</p><p>Sunlight filled up her eyes, erasing the open window and everything around her. The stucco wall came next, slamming into her face. Dani fell back and the light became a warm, lovely pool of gold. As she sank into it, she wondered how Suarez had made the sun rise two hours early, and if he would be the next one to die.</p><p>Three</p><p>Donatien strolled up A1A, enjoying the attention his magenta velvet suit and lacy white cravat drew from passing tourists. Such formal attire did not actually suit this time or locale, which even on this October night dripped with heat and humidity, but his immortal body had not produced much in the way of body fluids since his second rising.</p><p>The Spaniard would have to bleed for him.</p><p>His two favorite accessories, a beautiful redheaded girl on his right arm, and a handsome brunette boy on his left, walked on rhythm with his movements. Both said and looked at nothing. He felt it a pity that they had become so well-trained in so short a time. Nothing on this earth that amused him lasted very long.</p><p>That would have to change before existence bored him to death.</p><p>Donatien did not resent his present circumstances. He had been quite happy to leave the Middle East, where he had lived since Hitler’s fall from grace. As amusing as the descendents of the Saracens could be, the decades of carte blanche had gone too quickly. When the Americans came, the place had become a hotbed of night bombings and CNN exclusives. So he moved on. He had always wanted to go to South America to look up an old friend from the war they should have won. Unhappily Le Chevillard had been stupid enough to get himself drowned, but he had left behind some very amusing play things – and Cristál, his pearl among the swine.</p><p>At first Donatien had not believed what he had read in the old journals. Le Chevillard had been a madman, and his ramblings (while vastly entertaining) could hardly be called reliable. Donatien had consoled himself for a time by playing with the savages, all of whom proved to be vigorous and in remarkably good health. Then he had seen it for himself, first in the scars of horrendous wounds on the bodies of his playthings, then by listening closely to the babbled tales of miracles.</p><p>The Hand of God had not saved them. A girl had. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They had tried to protect Cristál by denying she existed, denials that Donatien had quickly reduced to pleas and sobs. The girl had been clever, too, hiding away at night and resisting his lures. The entire matter had wasted a great deal of Donatien’s valuable time, during which someone had summoned that Catholic cunt, Sister Marguerite, to spirit away his Cristál.</p><p>The years of searching did not sting as much as the nun who had deceived him. She had sworn he would never touch Cristál or her, and had settled the matter by setting fire to the convent where he had found them. Fool that he was, he truly believed the old bitch and his pearl had been consumed in the flames.</p><p>Reading of Marguerite Aretino’s actual death years brought tears of hope and joy to Donatien’s eyes, or would have, had his tear ducts still functioned. Further inquiries confirmed that she had not, in fact, killed herself or Cristál. She had faked everything in order to escape to America. Learning from an old Kyn ally that the Spaniard lived in south Florida as well, serving as seneschal to the newly-appointed suzerain, had been Fate’s dessert course.</p><p>Arranging for the Spaniard to meet Cristál had been a simple matter. Doubtless in the short time they were together, Donatien’s old love and his new would become fast friends. Donatien preferred his toys to have feelings for each other, at least for as long as they could feel something. It brought out displays of heroism and sacrifice that he always found touching.</p> <p>The Spaniard had honor, and Daniela compassion. It was a match made in hell.</p><p>Donatien did congratulate himself for maintaining around-the-clock surveillance on the convent. Such a terribly modern thing to do. Waiting for her to emerge had been boring, but he had been there to see her being carried out in the arms of Richard’s former emissary, the angel of light with the hellfire eyes.</p><p>Now he would have them both. His angelic demon and his demonic angel.</p><p>“ID’s,’ the large, fat man dressed as an evil clown at the entrance to the fetish club said as they stopped before him.</p><p>Donatien patted non-existent pockets. “Dear me. I do believe that I left mine at home.” He urged his accessories forward. “Of course, my friends will vouch for me.”</p> <p>The bouncer gave his companions a cursory glance. “We don't admit perverts or their underage friends.”</p><p>“Fortunately I am a libertine, not a pervert,” Donatien said. “My companions are much older and wiser than they were a week ago.”</p><p>“Look, moron, I’m not—\" the bouncer reached out to grab the front of his jacket.</p><p>“Mind your bowels, young man,” Donatien said, placing one hand on the bouncer’s frilled sleeve. “One never knows when their contents are about to exit in a decidedly explosive manner.”</p><p>The bouncer's hand dropped to clutch at his abdomen. A low, wrenching groan crawled through his clenched teeth as he doubled over.</p><p>“We'll see ourselves in, thank you.” Donatien guided his accessories to the door.</p> <p>The gruesome atmosphere and dangerous-looking members of Club Dominion never failed to cheer up Donatien, who led his accessories to the best table in the house. The occupants, clad as they were in various rigs of leather and chains, rose from their seats as soon as they spotted him. Donatien felt pleased at the automatic deference, and graced them with an approving smile, and a round of intense migraines.</p><p>Now to find the last pawn.</p><p>The assistant manager of the club, a fellow named Butcher, whose body had been pierced as often as the Virgin Queen Elizabeth's maidenhead, appeared with two waitresses and a staff dominatrix. All were dressed in ghastly costumes and makeup.</p><p>“Your Excellency,” Butcher said, and bowed. “You’re early tonight. We are honored.”</p><p>“You are likely missing a doorman, however,” Donatien advised him. “Bring my young friends mineral water.”</p><p>Butcher dispatched one waitress with a snap of his black-nailed fingers, and sent the other staff members off to supervise a flogging exhibition. “Your Excellency, may I ask if you have seen the club’s owner, Erik? He was the young man who left with you last week, and no one has heard from him since that night.”</p><p>“Erik decided to move on to a better place,” Donatien said. “He did sign over this establishment to me before he left. Would you care to run it for me?”</p><p>“I am honored.” Butcher hid his surprise by bowing deeply. “I will not disappoint you, Your Excellency.”</p> <p>“No one ever does in the end, dear boy.” He scanned the surrounding tables. “Now bring me a blonde. Something young, nubile, and as untouched as possible.”</p><p>“Would Your Excellency wish a blonde girl or boy?” Butcher asked.</p><p>“I never discriminate,” Donatien said, quite truthfully. “Either will do.”</p><p>The band onstage played something as unpleasant and ungainly as the dancing being performed on the floor in front of them. Donatien didn’t mind the ugliness of the music or motion. One had to be born with elegance; it could not be taught, bought or otherwise acquired. Seeing humans behave like the pitiful apes that they were merely reinforced his notions of evolution.</p><p>The waitress delivered drinks for his accessories and a young blonde female dressed in a too-tight merry widow and leather skirt. She had applied fake blood and adhesive scars to much of her exposed skin. Beneath the cheap cosmetics he could smell a trace of fresh blood, likely from some self-inflicted nonsense hidden under her clothes. The ennui in her eyes beckoned to him like dying candle flames.</p><p>“This is Tragedy,” the waitress said.</p><p>“Of course it is. Do sit down, dearest,” Donatien said, indicating the chair across from him.</p><p>The girl moved with all the grace of a sack of root vegetables, and immediately propped her elbows on the table. “My name is Tragedy.” She had a dreadful overbite, and ears that had been pierced in the most unlikely spots. Cheap, weighty jack-o-lantern earrings were pulling her earlobes into taffy, but her hair appeared to be natural, and under her heavy makeup lay somewhat dewy skin. “You’re very pretty.” She made it sound like a criminal offense.</p><p>He inclined his head. “I am Donatien.”</p><p>“I’ve heard about you. They say you’re a big shot new master around here.” She fiddled with her spiked vinyl bracelets, miming boredom. “Whenever you come to the club, they say other girls have cat fights just to talk to you. I guess ‘cause you’re so pretty.”</p><p>“Bigshot, yes, new, no, cat fights, I cannot say. And please, do think of another word with which to describe me. I know you can, dear Tragedy, because you are not like other girls, are you?” She had the voice of a fishwife and the manners of a gutter cleaner, but he smelled no chemicals or alcohol on her breath, and along with the hair and the skin that was all that mattered to him.</p><p>Tragedy preened. “I’m not like anyone you’ve ever had.”</p><p>Youth, freshness, clean blood, functioning nerves, and misplaced pride and arrogance. What more perfect clay could be found? “Tell me why you come here, to such a terrible place.”</p><p>“It’s something to do.” Her shoulders moved out and back into her slouch. “I’m free, white and twenty-one. I bottom and top. No cutting or bathroom games.” Her glance flicked with studied indifference to his redhead. “I do girls sometimes.”</p><p>She wanted his toy instead of him. She, who had called him pretty. For that, he would make her beg him to kill her long before the night’s games concluded.</p><p>“If I permitted you to play with my sweet little strawberry shortcake,” Donatien asked, stroking his hand over his redhead’s shoulder, “what would you do to her for my amusement?”</p><p>Interest finally enlivened the dull eyes. “Biting, licking, twisting, spanking. I’ll use vibrators, whips and clamps, whatever you like.”</p><p>Dear God, would humans ever abandon these pedestrian desires? Where was the imagination in this century? They could land space craft on Mars, but in matters erotic, they were still as infantile as the Saracens and the Nazis. “That’s all?”</p><p>The blonde’s bottom lip protruded. “What do you want me to do?”</p><p>It amused him how the humans of this era wished everything spelled out for them in advance. One had to almost hire an attorney and strike a contract to arrange a proper liaison. “Give me your hand.”</p><p>Tragedy did not. “I don’t like you.”</p><p>“I don’t require you to like me.” Donatien rested his hand on his boy’s shoulder, noting the slight jerk his touch produced. “I asked you to give me your hand.”</p><p>His brunette struck without warning, clamping onto the blonde’s forearm and dragging it across the table. The girl opened her mouth to shout, only to find herself being kissed by his redhead.</p><p>Donatien folded his hand around Tragedy’s as his redhead broke off the kiss and inserted her slim hand down the front of the merry widow to fondle the groaning girl. “Show me your pleasure, mademoiselle.”</p><p>Chilled air enveloped the table as Tragedy's mouth went slack. Her eyelids drooped over dilated pupils. A ghostly copy of her own face, much younger and decorated with small cuts and artful bruising, masked her features for a moment before it faded.</p><p>“Who?” Donatien prompted.</p><p>“Caroline,” she whimpered. “The babysitter.”</p><p>“I gather she was a redhead. How terribly apt, that you named yourself for what she made of you.” Donatien released her hand. It was near dawn, and he had so much more to accomplish before the night’s work was finished. “You will do.”</p><p>Her lids lifted a fraction. “You'll mean, you’ll let me hurt her? You’ll watch?”</p><p>“I regret that she is probably beyond your limited abilities to inflict suffering, Tragedy. Fortunately, I am willing to serve as your tutor.” Donatien gestured to Butcher, who had been hovering within fawning range. “We will need to use the former owner’s private playroom for a time. While I am occupied, lock the doors and don’t permit anyone to leave.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The club’s new manager looked confused. “We close at five a.m., Your Excellency.”</p><p>Donatien smiled. “Not tonight, dear boy.”</p><p>Lucan resisted the weariness that dawn had draped over him and listened to Samantha breathe. Accustomed as she was to working all night and sleeping through the day, even as she had during her human life, she still fell asleep quickly and rarely stirred.</p> <p>He propped himself up on one elbow to stare down at her. His long, tall goddess had a magnificent body, and used it to give him an outrageous amount of pleasure, but her face equally fascinated him. The first time he had seen Samantha, he had been dumbfounded by the striking resemblance she bore to his long-dead love, Frances. It had taken time for him to see past the face and come to know Samantha for who she was, and by then he had forgotten the ghosts of his past.</p><p>Frances had been a lovely, feminine woman, all soft curves and gentle colors as befitted a female of her time. Samantha’s toned, disciplined body sang of the beauty and self-control of a modern-day female warrior. Lucan had yearned after Frances from afar like a lovesick boy, never acknowledging her indifference to him. He had been shattered by Samantha’s selfless love for him, and had done his best to destroy it – only to discover its strength and resilience.</p><p>That Samantha had survived their courtship was a miracle; near the end of it she had been shot by a determined stalker. Ending that vermin’s life had been one of the few joys Lucan had ever derived from his own lethal gift. Then he had done something even worse to save the woman he loved.</p><p>Alexandra Keller, the only person to survive the transition from human to Kyn in six hundred years, had been furious when Lucan had used her blood to save Samantha. It should have poisoned her, but the terrible gamble had paid off, and miraculously Samantha had become, like Alexandra, an immortal.</p><p>That such a brave and selfless woman would choose to spend that eternity with someone like him... that was the true miracle.</p> <p>“Are you done inspecting me?” Samantha asked, her eyes still closed. “I’ve got to pull a double shift on this case, and I’d like to get some sleep before noon.”</p><p>A miracle that often turned and slapped at him when he least expected it. “Allow me my harmless diversions, love.” He ran a fingertip over the curve of her chin. “They keep me out of trouble.”</p><p>“You’re not the one being ogled while you sleep.” She turned her face away. “Is it really that much fun to watch me snore?”</p><p>“You don’t snore.” Lucan sifted his fingers through her dark chocolate hair, admiring the way the silky strands clung to his skin. Only with Samantha did he dare leave off his gloves. “You do, on occasion, drool a bit.”</p><p>Her head turned, and hazel-green eyes glared at him. “I never drool.”</p><p>“Shall I show you the wet patches on your pillow tonight?” He grinned as she pushed him over onto his back and straddled him. “Well, perhaps not.”</p> <p>Lucan ran his hands down her arms, watching the reaction on her face as his talent played along the nerves beneath her skin. Samantha’s transition had been, like Alex’s, unusual. Kyn talent still affected her, and she was slower to heal. Although an unusual psychic ability from her human life – the power to read the past through the blood of its victims – remained intact, she had yet to show her true Kyn talent. She also had an annoying habit of routinely placing herself into harm’s way.</p><p>He could not allow her to do so with Donatien in his territory.</p><p>She nudged his ribcage with her knees. “Hello. Aren’t you tired yet?”</p><p>“Not with you.” Since they both slept naked, he only had to lift her hips to work his cock into her. She made a soft sound as she surrounded him in damp, tight heat. “Never with you.”</p><p>Lucan sat up, holding her in place with his arms, so that they were face-to-face and he moved deeper inside her. Her hips jerked as the soft heat of her melted around him, clasping and caressing him at the same time. He had taken countless women over the course of his long life, and not one of them had felt this good, this right. No one could make him feel this safe.</p><p>If he lost her, it would be the end of him.</p><p>“Hey.” Samantha brought his hands to her breasts, covering them with her own, her eyes darker now. “I’m not going anywhere.”</p><p>“Yes, you are.” He flipped her onto her back, keeping himself lodged high inside her as he urged her long, strong legs up and up. When the back of her calves pressed against his shoulders, he withdrew almost to the point of disengaging their bodies, and then teased her a little with the head of his cock. When she tried to counterthrust and force him back inside her, he spread his hand over the faint curve of her lower belly and pinned her.</p> <p>Samantha’s body began to shake. “Not fair.”</p><p>“Love rarely is,” Lucan agreed, and kissed her, sliding his tongue between her lips as he pushed slowly back inside her body.</p><p>Making love with Samantha was something he preferred to do with a decided amount of leisure, but he sensed the quivering of her muscles was not solely due to passion. He took her quickly to a hot, hard climax, and then drew her back down, stroking into her gently until they came together. She whispered his name as she drifted off, her body going limp with satisfaction.</p><p>When Lucan felt sure that she truly slept, he eased out of their bed, dressed and went down to his office.</p><p>Herbert Burke, Lucan’s tresora, sat at the desk sorting through the night’s sales slips. He looked up as Lucan entered. “Master, is something the matter?”</p><p>“Not for long.” Lucan closed the door. “Where is Rafael?”</p><p>“He called from Miami about thirty minutes ago,” Burke said, retrieving his note pad to read from it. “He said to tell you that he has the young lady from the convent, and will bring her to you tonight.”</p><p>“He must have had trouble with her.” Lucan paced for a moment. “Contact Cyprien and make him aware that the Marquis is alive and hunting in America.”</p><p>“The Marquis.” Burke paled under his new tan. “Surely not, Master. The historic accounts, they all say that—”</p><p>“I know what the books say, and they are wrong.” Lucan saw a crack divide one of the lenses in Burke’s spectacles, and put a tight leash on his temper. “Forgive me. My concern is for Samantha. Kyn talent still affects her. If he came here, if he touched her...”</p><p>“He would not dare.” Dark color flagged the smaller man’s cheeks.</p><p>“We must see to it that he does not.” Lucan went to his wall safe and took out a small aluminum case. He handed it to Burke. “While Samantha is sleeping, replace all of the ammunition in her weapons with these rounds.” He selected a .44 Magnum from the safe and carefully loaded it. Copper bullets wouldn’t kill the Marquis, but they might slow him down. He put the gun back in the safe. “Cancel the Halloween events, close the club until further notice, and put everyone on patrol. If they see the Marquis, they are only to call in his location. No one is to confront him or go within his sight. Make that very clear to the men.”</p><p>“I will advise them immediately.” Burke removed his cracked glasses and replaced them with a spare pair he always carried. “Master, you should not go hunting by yourself.”</p><p>“I work better alone, Herbert.” He checked the cartridges for the tranquilizer pistol Alexandra Keller had left behind for him. He had no idea if the drug she had invented to sedate the Kyn would work on Donatien, but he would take it as well. “Wake me before sunset. I will track him from the convent.”</p><p>“Master.” Worry etched Burke’s mild features. He glanced at his hands. “Can you stop him?”</p><p>Lucan had promised his sygkenis he would never again use his talent to harm anyone. He had no more stomach for the work, either. But Donatien had been a walking plague for too long, and it was past time to bury him. “I will try, Herbert. I will try.”</p><p>Four</p><p>Rafael often found his double life a tribulation. Being both cop and seneschal, human protector and Kyn servant meant that his duties ate up nearly every moment of his waking hours. Now in addition to solving a murder and catching a madman, he had to protect a young nun who had tried to jump through a third story window to escape him.</p><p>Some days, Lucan would say, it does not pay to rise from one’s silk sheets.</p><p>For months after Michael Cyprien, the seigneur over all the American jardins, had sent Lucan to serve as suzerain over south Florida, Rafael had contemplated leaving America and returning to Spain. The jardin should have been his, not Lucan’s. He had taken care of the Kyn in the southernmost part of the country for decades. It was neither just nor appropriate that an outsider be given rule over them all.</p><p>As lofty and unfriendly as Lucan could be, no master proved a mystery to his seneschal, and over time Rafael had come to know the man behind the façade. As Richard’s former chief assassin, Lucan had been a victim of his talent, which had made him one of the most deadly Kyn alive. It had also scarred his soul in terrible ways. He had come to America to escape his past and begin a new life, and for all his posing and sarcasm, Lucan had proven to be a fair and worthy master. He slipped into the role of suzerain with indecent ease, and made an excellent, if somewhat unorthodox, leader. Lucan’s power naturally commanded respect, but he had gone to great lengths to establish a true suzerainty, one that was improving life for the Kyn of the Jardin Noir.</p><p>Rafael felt little surprise over those who had been quick to forget him and pledge their loyalties to Lucan. He had never inspired them the way Lucan did, and if that occasionally made him feel bitter, he had learned to accept that as well.</p><p>“Would you please turn off the light now?” a small voice called from his bed. “I won't try to run again.”</p><p>Rafael drew the curtains and secured the bedroom door before allowing the light created by his talent to fade. It should have felt strange to have her here – he never brought women to the apartment – but he liked seeing her under his sheets. So much so that he kept ten feet between him and the bed. “Why did you run from me? If you had gone through that window, you might have broken your neck.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The girl sat up and rubbed the side of her face. “I was afraid. I thought you might belong to him.”</p><p>“To whom? Donatien?”</p><p>She straightened. “You do know him.” Her gaze swept the room, pausing only on the windows and the door. Finding her boundaries, Rafael realized, and seeking avenues of escape.</p> <p>“I did, once.” How had someone so young and unworldly come to know such a creature? “He killed the man and left him in front of the convent.”</p><p>“If you know what he can do, then you must help me.” She pushed the covers away and discovered she was handcuffed. “Remove these and call a taxi from me. I can go directly to the airport. There is an open ticket waiting for me there.” She held out her wrists. \"Please. He will sleep for the most of the day.\"</p><p>Rafael saw two, barely-healed wounds on her wrists. Was she, like Bridget and the other women, a stigmatic? “You must stay here until we can catch him. You are quite safe with me.”</p><p>She laughed, a raw, tight sound. “Then you do not know Donatien at all, Detective.”</p><p>“Rafael.” The wildness in her eyes made him forget about keeping his distance, and he went to stand at the side of the bed. Dried lavender perfumed her habit and veil, but beneath it he caught the soft, delicate scent of her skin. He had not yet fed, and felt the ache of hunger and something darker in his fangs. “Tell me your real name.”</p> <p>“Dani. Daniela Nieves.”</p><p>Daniela Nieves, Daniel A. Nieves. It couldn’t be a coincidence. “Either you are named for your father, or you own The Sisters of the Annunciata.”</p><p>“I am the owner in name only.” She twisted her wrists. “I don’t like these things. They hurt.” Her expression turned puzzled. “Do you think I’m going to attack you?”</p><p>“No. Stop fighting them.” He put his hand over the short chain between her wrists. Being alone with her and having her completely at his mercy brought temptation, so unexpected and ravenous that he nearly tugged her into his arms. But he would not feed on a nun, nor would he seduce one. “I will remove the handcuffs as soon as you tell me how you have become involved with Donatien. The truth,” he added when she began to reply. “Not another pretty story you think I will believe.”</p><p>She tucked her chin in and scooted into a sitting position. “You won’t believe it.”</p><p>He borrowed one of Samantha’s favorite phrases. “Try me.”</p> <p>“Before I came to America, I lived in Argentina.” Daniela pulled her knees up and hugged them with her cuffed arms. “Donatien came to our village one night, looking for young and lovely ones. Women and men; he wanted them all. He kept coming back for more.” She glanced at him. “You have seen him with people – you know how he is, how he looks, how he makes them feel?” He nodded. “They went to him like ants to wild honey.”</p><p>“He killed these people.”</p><p>“I don’t know. They never came back.” Daniela’s head drooped, and she began speaking in Spanish. “Some tried to run away, but he would find them and bring them back. There were screams and laughter in the night. The air always smelled of dead fires. He came and he came until the young and lovely ones were gone, and then he took the others. Until I was the only one left.”</p><p>Rafael wondered what Daniela’s native language was. Her Spanish was flawless, but it was the language of the school room, not that of a native speaker. “How were you able to resist him?”</p><p>She avoided his gaze now. “I stayed in the jungle at night, in places he didn’t know. Then Sister Marguerite came during the day, while he was sleeping. She found me and took me away to a convent in Rio. She said I would be safe there, and for a long time I was, but then he came again. When the Mother Superior would not let him in, he began taking people from the streets.” Her voice broke. “He hurt them in terrible ways first. Then he killed them and left their bodies outside the convent. Like the man last night.”</p><p>Rafael took her hands in his. “But you escaped him again.”</p><p>“Sister Marguerite moved me to another place, but he found me again. He climbed over the walls at night and walked about the place, looking for me, calling my name.” She twisted her hands together, so tightly that all of her tendons strained. “When I didn’t go to him, he killed all the nuns and left a message written in their blood on the wall. He said I could never escape him.”</p><p>The way she spoke of what happened bothered him as much as her Spanish – again, the stuff of the school room. Daniela’s speech patterns were more like a child’s. “That’s why Sister Marguerite brought you to America.”</p> <p>“After she made him think that we were both dead, yes. But he is here now, and he knows. I must go away before he kills any more people.” She held out her wrists. “Will you take them off now?”</p><p>“In a moment.” Rafael slipped off the veil covering her long hair. It spilled around her face in soft, dark waves. “When did you take your vows?”</p><p>“Last year.” She swallowed and looked away again.</p><p>Rafael leaned closer. “What was the name of your village?”</p><p>“It was – it had no name. It was only the village.”</p><p>“This convent where you took your vows, what was it called?” When she groped for an answer, he asked, “The name of the one that burned down? What was it? And the name of your order?”</p><p>“They are gone.” She almost stuttered the words. “I can’t remember.”</p><p>“You’ve never taken vows.” A fierce and completely unexpected satisfaction filled him. “You’re not a nun.”</p><p>“I have, I was... I said—”</p><p>“They shave your head when you pledge yourself to Christ,” he said, grabbing a fistful of her hair, dragging it around in front of her eyes. “Now tell me the truth.”</p><p>“I don't know,” she shouted, and then hunched her shoulders and tried to curl away from him. “They never told me. I was from the compound. I was not like them. They would not speak to me.” She twisted, yanking her hair from his grasp.</p><p>He held onto her arms. “What compound?”</p><p>“It was in the jungle, near the village. It was why Donatien came to Argentina. To see it. To touch the Father’s things, and to look through the photos and read his journals. He took pleasure in them, laughed over them as if they were amusing. I watched him through the windows.”</p><p>“Look at me, Daniela.” When she wouldn’t, Rafael lifted her chin and used his thumbs to wipe away the incessant tears. “I can help you, but I have to know the truth.”</p><p>She went rigid. “Marguerite made me promise. She said if anyone knew, if anyone saw, that they would lock me away and never let me go.”</p><p>Rafael was glad the old nun was dead. “I will not. I will not permit anyone to do that to you.”</p><p>All the fight went out of her. “It won’t make any difference. He has found me. But I will show you.” Dull-eyed now, she looked across the room. “That fern there, the brown one. Would you bring it to me, please?”</p><p>Rafael reluctantly released her, and went over to the hanging plant that, like every other thing he had attempted to grow in the apartment, had died. Brittle brown leaves showered his arms as he took it down and carried it to the bed. “This is a lost cause, I think.”</p><p>“No. Not yet.” Slowly, almost painfully, she brought her cuffed hands to the dead thing. “The Father ran so many tests on me, but he could never find out how, or make another like me again. It angered him.” She plunged her hands into the dry, scratchy snarl of leaves.</p><p>Rafael felt it first. A warmth that, given the efficiency of his apartment's air conditioning, should not have spread as it did. But within a few seconds it created a pool around the bed, causing beads of sweat to gather in his temples and streak down his back.</p><p>Daniela closed her eyes and seemed to shrink in on herself, as if squeezed by the growing heat.</p><p>The vibrations came next. Rafael had felt something similar whenever his master lost his temper or used his talent. Lucan often caused any glass in close proximity to shatter whenever that happened. Yet these waves did not have the same, destructive feel to them. They seemed to dance around him, unseen creatures of the air.</p><p>“What... “ Rafael glanced down at the fern, which began rustling around the girl's hands. The dead leaves slowly straightened out of their lifeless curls, and their color paled to yellow.</p><p>Daniela opened her eyes, which had turned a ghostly blue. “It was almost gone,” she whispered, a note of censure in her soft voice. “I cannot bring them back when they are gone. There has to be a little left.”</p><p>Rafael hardly heard her. The fern’s yellow leaves had begun to glow with something that was not light or heat but part of both. The base of each leaf turned a dark green that quickly devoured the yellow as it spread to each tip. Daniela’s eyes closed a second time, and the entire plant shook, its stalks stabbing up into the air and spreading like eager fingers. At last she took her hands from the pot, and sagged back against the pillows.</p><p>The heat pressing around them vanished as if it had never been.</p><p>Rafael carefully picked up the plant and turned it around in his hands. It was as fresh and full of life as the day he had brought it home. He looked over it at the huddled form in his bed. “How long have you been able to do this?”</p><p>“Since I was born.” Her exhausted voice matched the color of her skin. She lifted her hands. “Do you have bandages?”</p><p>“Why?”</p><p>“There is a price for what I do.” She extended her arms, showing him bloody fingers and palms, swollen wrists and bruised forearms.</p><p>With a curse he pulled a small key from his pocket and released the cuffs around her wrists, sitting down and gently examining her wounds. “Does this happen every time?”</p><p>She wouldn’t look at him. “Sometimes it is not so bad. Sometimes it is worse.” A bitter curl twisted her mouth. “But now you know.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stared at her. “It is not only plants.”</p><p>“I can do it for animals and people. Anything that has some life left in it. That is why Donatien wants me. For the ones he hurts.” She stared at the fern. “Because I can keep them alive.”</p><p>Samantha started her shift on Halloween by stopping at the Chief of Homicide's office. “I’ve got some updates on the convent murder.”</p> <p>Ernesto Garcia closed the file he was reading. “Tell me.”</p><p>She took out her PDA and punched up her notes. “Victim identified as Erik Bergen, age thirty-two, single, lives alone, no kids. Currently owns a fetish place called Club Dominion. No significant other, no family other than an elderly father in Brooklyn. NYPD will handle the notification.”</p><p>“Dominion’s that one across from the Ambassador’s Towers?” When she nodded, he said, “I thought that was a private B.Y.O.B. club.”</p><p>“Bergen got a liquor license and opened it to the public about a year ago,” she said. “Clientele’s been busted a few times since for indecent exposure, public sex during vice sweeps, but no working girls or anything else to blow air up the Mayor’s tasteful skirt. It’s a place to dress out and hookup. How long are we going to do this?”</p><p>“As long as it takes.” He glanced up and saw her expression. “If you’re talking about Suarez, he won’t be in. Kyn business.”</p> <p>“I’m Kyn now, but I guess I don’t count.” Sam sat down and took a pocket recorder from her jacket. “This is voice-activated. For those times when you guys decide that Sam can’t handle that all-important, hush-hush Kyn business.”</p><p>She switched on the tape, which played a conversation first between Lucan and Rafael, and then between Lucan and Herbert Burke. When it was finished, she switched it off.</p><p>“I like the parts where everyone decides what’s good for me, and that no one is to speak to me about a guy who appears to be the prime suspect in my fucking murder case,” she said sweetly. “Don’t you?”</p><p>Garcia picked up the recorder and regarded it the same way he might a dead rat. “Somehow I doubt the suzerain will appreciate the fact that you’ve bugged his office.”</p><p>“I will deal with the suzerain later, I assure you.” Her temper, which had been simmering since she’d listened to the tape, flared. “Now can we stop dancing around this and you give me some answers? Or do I go start roughing up some vampires, starting with my partner?”</p><p>His expression shuttered. “I can’t tell you anything more than what is on that tape.”</p> <p>“You’re Rafael’s tresora, of course you can.” She waited for him to reply. “I am a decent cop, you know. I can just go looking for them. Guy likes to cruise fetish clubs, right? We don’t have that many around here, and I’m in the mood to go beat the hell out of someone anyway.”</p><p>Garcia hissed in a breath. “You can’t. Samantha, there are some things about the Kyn that you’re better off not knowing. Donatien – the Marquis – is one of them.”</p><p>“So they are talking about the same person. Thought so.” She enjoyed his wince over the slip. “This Donatien may be Kyn, but he killed Erik Bergen, which makes it my business.”</p><p>“Donatien is not Kyn.” He rubbed a hand over his shaved scalp. “You remember Faryl, the changeling who tried to kill Lucan?”</p><p>“Snake-man, sure,” she said. “I cut off his tail. Made him kind of unforgettable.”</p><p>“Faryl was what happens to a Kyn when they live only on animal blood,” Garcia told her. “There have been Kyn who went the other way, who refused to curtail their hunger. They not only kill humans, they toy with them. Like cats with mice.”</p><p>“So he’s out of control.”</p><p>“That was how he began, and he was among the worst of us. Then something happened.” Garcia seemed to be choosing his words with great care. “It should have killed him, but instead it made him more powerful, more dangerous.”</p> <p>She folded her arms. “I’m not leaving until you give me all the facts, Cap.”</p><p>Ernesto rose to his feet and went to the one window he had in his office, which overlooked the department parking lot. “If I do, Lucan will have my head.”</p><p>“I’ll have it if you don’t, and you have to work with me every day,” she reminded him. “Him you can dodge.”</p><p>He nodded and went to his filing cabinet, taking out a folder and handing it to her. “That is what current information we have. It’s not much. Rumors, a few unconfirmed sightings, unsolved murder sprees in the Middle East and Germany.”</p><p>She opened the folder and made an exasperated sound. “It’s written in French, which I don’t speak or read.” She pulled out a sketch of a man so beautiful he made Brad Pitt look like a troll. “This is the monster?”</p><p>“That is Donatien Alphonse François,” Garcia told her. “Better known as Le Marquis de Sade.”</p><p>Five</p><p>Dani dreamed of the one place in the world where she had never felt afraid: the jungle beyond the compound. On warm, moonlit nights, when the Father's men had gone into the village to drink and chase women, she had slipped under the fence and into that cool, green darkness.</p><p>The Father had told her that it was impossible for her to remember her mother (she died birthing you, Cristál, he would always say, hating her with his eyes) but Dani felt her presence in every shadow, heard her whisper in every movement through the leaves. Mama had belonged to the jungle, had been buried by the Father somewhere in it, and so she had become a part of Dani’s rare night wanderings.</p><p>Tonight she felt her mother as if from a distance, but that hint of tender love was all she needed. She raced through the brush, chasing it not in desperation but in a playful, teasing fashion that made her mother's ghost laugh.</p><p>Until the dark man stepped out into the moonlight, blocking her path.</p><p>Daniela. He held out his hand, tiny golden lights filling the palm. Don’t run away from me.</p><p>She stayed. She had never like men very much – the Father often hurt her, and the guards despised and feared her – but the dark man felt different. He smelled wonderful, too, not at all like the sour odor that clung to everyone at the compound. She went to him, and when she reached for his hand, he tossed up the lights, showering her with their cool, tickling sparkles.</p><p>“Rafael.” She remembered his name from the other place. His name became poetry on her tongue, and she savored it twice more. “Rafael, Rafael. How did you find me?”</p><p>We are sharing a dream, he told her, clasping her wrists with his hands. Is this your home?</p><p>Dani had never thought of the jungle as anything but freedom. It did not belong to her, and the Father would never permit her to live in it. Home was the compound, where everyone feared the Father and what he did in the white-washed rooms. She did not want to think about that, not here. Here she came to be, to run, to forget.</p><p>“I wish it were,” she told him.</p><p>I had a place like this, once, a long time ago. A flock of green parrots fluttered around them, and he drew her closer, holding her to his side. Can you show me the compound?</p><p>Somewhere in the shadows, a jaguar growled.</p><p>“Do I have to?” When Rafael nodded, she sighed and guided him down the old path to the clearing where the Father had made the compound. The rusting, barbed wire fence sagged in places, some parts of it cut out and missing. A few ghosts scrounged around the burned and gutted buildings, the old ones who still thought they were alive, and could pick through the debris for scrap to sell in city.</p><p>Someone burned it to the ground?</p><p>“The Father did before he left the country.” She stared at the place where she had been so miserable. “Men came from Europe – not his men, but others that were angry with him – so he set fire to the top part.” She took him to one of the lower level entrances, pushing aside the tool shed that concealed it. “The soldiers came and took things and burned it, and I had to go live in the village. They never did find the bottom part.”</p><p>Dani hated going below, but knew Rafael should see it all. The sensors that still worked turned on the Father’s lights as they walked down the stairs and into the center corridor. Ghosts in wrinkled white coats shuffled past them. They wrote on blank clipboards with empty pens. Seeing the spirits made Dani’s arms throb.</p><p>Rafael ignored the spirits and looked through some of the dusty windows. This is a hospital.</p><p>“The Father called it that, but he never fixed anyone. He broke them and made me do it.” She surreptitiously checked the sleeves of her smock to see if she was bleeding again. “I didn’t like him. He pretended to be happy and kind, but underneath he was like Donatien. He didn’t really care about the tests he said he had to do, or the soldiers he was going to make to take back to his land. He simply liked doing the breaking.”</p><p>Rafael stopped in front of one of the many framed pictures the Father had left behind, and wiped the dust from the glass over it. What was his name?</p><p>“He never told us. We were made to call him ‘Doctor’ or ‘Father.’” She saw a portrait of the Father as a handsome young man and turned away. “Can we go back to the jungle now?”</p><p>In a moment. Rafael looked at some of the other pictures and then saw the birthing room, where the spirit of a village woman floated above the table, shrieking without sound as she struggled to deliver a baby that would never take a breath. Was he your father? Was his name Nieves?</p><p>“No. Daniela Nieves is not my name. Marguerite made it up for me, for my papers. The Father called me ‘Cristál’, or this.” She pulled up the sleeve of her smock and showed him the numbers on her left arm.</p><p>Six-one-two-seven. He ran his fingertips over the faded mark. What do they mean?</p><p>“He never told me, but I think they are when I was born.”</p><p>No one calls a child by a number.</p><p>She looked at the writhing ghost woman. “The Father did.” She pulled at his arm. “Can we leave now? Everything here is cold and dead.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rafael followed her out of the lower level, although he kept glancing back over his shoulder, as if still not quite believing what she had shown him. Is this place why the villagers would not speak to you?</p><p>Dani thought of the years she had spent in the village. “They were afraid of me. I could walk through the jungle, and nothing would hurt me. I never got sick. When they were sick or hurt, I was the only one who could help them. They needed me, and they took care of me, but they resented me.” She almost ran back into the jungle.</p><p>Rafael caught up with her, turning her to him. I was wrong to make you show me that place. I’m sorry, Daniela.</p> <p>“It was not all bad. I could always go into the jungle. My mother is here. So is life.” Dani felt a cold, icy touch along the length of her spine, and on impulse she hugged him. The pain it caused in her arms was worth seeing the startled pleasure in his eyes. “Now you are, too.”</p><p>I’m not what you think I am. He moved as if to set her away, and then brought one of his hands to her face. Compelled to touch, as she was. You are so young and innocent. I must leave you alone.</p><p>Joy deepened into feelings Dani had never experienced, even when the Father had tried to force her to feel such things. He had wanted to breed her like a cow, to see if her children would be as she was, only to discover that she could not make children. Rafael didn’t care that she had numbers for a name. He saw her as she saw the jungle, and that was a dream she had never expected to come true.</p><p>He was the one, the meaning, the reason to go on.</p><p>She brought her arms up and encircled his neck. “I don’t want to be alone anymore.”</p> <p>Instead of bending down, he lifted her up to his mouth. Dani felt her feet dangling for an instant, and then his lips touched hers. She could taste his breath blending with hers, felt the silken abrasion of his mustache and beard against her face. Before she was ready, he lifted his mouth and began to lower her to the ground.</p><p>He wasn’t afraid of her. He feared what he might do to her. What his hunger might do to her. It was so ridiculous that she almost laughed.</p><p>Dani wrapped her legs around his waist and clutched at his shoulders. “That was a terrible kiss. Here.” She used her hand to draw his mouth again to hers. “Let me show you.”</p><p>She tilted her head, making a new angle, and teased his lips with the tip of her tongue. He tasted of sunlight and shadow, and in that moment before he took her kiss and made it his, Dani knew it wouldn’t be enough, it could never be enough, and that was why he was the one, the meaning, and the reason.</p><p>Dani could feel the cold touch of death again, but pushed it away. This is my mate, my love, and I have been waiting for him for so long that I hardly know what to do.</p><p>The floor of the jungle became a silken twist of sheets and clothes, and the kiss he gave her came with the weight of his body on hers. For a long, luxurious interval Dani moved against the searching caress of his hands, content to drift along on a haze of not-quite-waking need. She felt something sharp against the edge of her tongue, tasted blood, and heard him groan.</p> <p>The dream ebbed, casting them both back into the now.</p><p>Lucan felt his sygkenis before he smelled her, something he could do only when one of them was angry. Since the wine glass in his hand remained whole, he assumed the temper about to explode was hers.</p><p>“If you punch me,” he told her before she came into sight, “your hand will hurt longer than my nose. What is wrong?”</p><p>“Wrong? What could be wrong? My life is all hearts and flowers, Lord and Master Lucan.” She came around the side of the white leather couch and stood before him. “You’ve done a great job of that.”</p><p>“So I have... made you happy?” He contemplated his bloodwine to avoid looking into her furious eyes. “Apparently not. May God have mercy on my soul.”</p><p>“Not until I’m done with you, pal. Let’s start with ‘Say nothing to Samantha,’” she said with a very accurate imitation of his native English accent. “Or how about, ‘While Samantha is sleeping, replace all of the ammunition in her weapons.’”</p><p>He stared at her. “I’ve soundproofed every inch of this building, so I know you weren’t listening at the keyhole.” Then it occurred to him. “You bugged my office. You bitch. How could you do such a thing?”</p><p>“You’re replacing my ammo and lying to me, you bastard, so what’s the difference?” She shook her head and went to the closet he had surrendered when she had moved in with him. “I know we still have trust issues,” she said as she began sorting through cartridge boxes. “I’m a cop, you’re a retired assassin, goes with the territory. But you know, you’re the one who made me Kyn.”</p> <p>“Yes,” he seized on that. “I did. And I saved your life.”</p><p>“You killed me before Dwyer’s bullet could,” she corrected him. “But what you did brought me back, so I forgive you. I like living better than dying. Even with the fangs, the lousy diet, you being grandmaster vampire and all your other medieval shit.”</p><p>“Suzerain.”</p><p>She slammed the closet door shut. “Whatever.”</p><p>“I have been patient as well,” Lucan said. “You are still working for the police, are you not? As is my seneschal, I might add. You wish to come and go as you please, and so you do. You put yourself in danger each night to protect humans, while I wait for you to come home to me.” He turned his face away from her. “And wonder if you will.”</p><p>“Why are you worried? You’re gorgeous. You’re great in bed. I’m not going anywhere. You’re a good man, you son of a bitch, and as much as I’d like to, I can’t punch you in the nose. I love you.” Something dark and hurt shimmered in her eyes. “I love you so much, Lucan.”</p><p>He rose to his feet and went to her. “Do you think I feel anything less for you? My God, woman. I would die for you.”</p><p>“I know.” She buried her face against his chest.</p><p>He held her close. “I only want to protect you.”</p><p>“So you lie to me, and do things behind my back?” She jerked out of his arms. “No, my man. We have to settle this. Now. I’m tired of you sneaking out of bed. I don’t want to bug your office. I’m your lover, your life companion, whatever the sygkenis thing means, right?” When he nodded, she held out her hands. “Then respect me enough to tell me the truth. Keep me in the loop. Especially when a monster like Donatien comes to town.”</p><p>“Very well. I will keep you informed, as long as you follow my orders,” he told her. “We are Kyn, Samantha, and I am your liege lord as well your lover. I will not command you often, but when I do, you will obey me.”</p><p>She nodded slowly.</p><p>“Good. I’m going out to hunt Donatien tonight, and I’m going alone.” Before she could say anything, he shook his head. “He is too dangerous. I don’t want to kill anyone, but I am the only one powerful enough to do it. Whatever happens, I’ll return at dawn.” He hesitated. “I think you should stop by Rafael’s apartment before you go back to work.”</p><p>“Is he all right?”</p><p>“I’m sure he is.” Lucan bent down to kiss her. “But you should perhaps check on the nun.”</p><p>Dani opened her eyes to find herself naked and in a very unfamiliar place, pinned as she was under Detective Suarez’s body. He held her wrists over her head with one hand, and was using the other to knead her left breast. His damp mouth lifted from hers, and on it she saw a smear of blood and the glitter of white, sharp teeth.</p><p>The air around them felt frosty against her face, but his body kept her warm.</p><p>“Daniela.” He murmured her name as he propped himself on one elbow and looked down at her through drowsy, confused eyes. “What are we doing?”</p><p>She glanced down at the chest flattening her breasts. “I think we’re having sex.”</p><p>“I am sorry.” And he was. “I only meant to rest beside you for an hour.”</p><p>“Wait.” As he tried to roll away, she wrapped a leg around the back of his. “Don’t pull away from me.” She felt his erection against her belly, and although this was only the fourth time she had seen this man in her life, that was fine with her. As for what had happened, it was too soon to speak of dreams of love. For now, desire would have to do. “Do you want me?”</p><p>“I cannot do this.” Finally, fully awake, Rafael seemed slightly horrified by their present positions. “You are hurt.”</p><p>“Not really.” She showed him her arms, wrists and hands, which had almost entirely healed while she slept. “The after-effects never last very long. Thank heaven.” She tried to kiss him, but he turned his face away. “If you don’t want me, then say it.”</p><p>“It is not that.” He struggled with the words. “Daniela, I am too old, and you are too young. You do not know what I am.”</p><p>Trust a man to put such emphasis on ages and confessions.</p><p>“I know you.” She moved under him, impatient and so aroused she thought she’d tear out her hair if he didn’t take her. None of this made much sense, but it didn’t concern her, either. They could find reasons and exchange their secrets later. “Do you want me?”</p><p>His dark eyes sparkled with the same lights he had held in the dream. “I have wanted you from the moment I first saw you.”</p><p>“Well, then.” She arched her neck so she could brush her mouth across his. “I’m yours.”</p><p>“I must tell you this first.” When she did, he opened his mouth, showing her two long, sharp teeth that had not been there before. “I am not human. I am a vrykolakas, an immortal being, and I live on human blood. We are called the Darkyn.”</p><p>“I know. Marguerite told me about your kind. Donatien is one of you.” Perhaps it should have frightened her, but instead it made the world right again. In all things, there had to be a balance. “You and the others are not like him, are you?”</p><p>He nodded. “We do not kill. We protect.” He brushed a lock of hair back from her face. “And if you do not push me away in the next ten seconds, I fear that I am going to make love to you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t be afraid.” She smiled up at him. He cared enough now to make sure that she understood before this last, irrevocable choice was made. If she survived this – if he could help her – he had earned whatever he asked of her. “But could you make that five seconds, please?”</p><p>Rafael waited all of three before his mouth came down over hers, and he gave her a kiss so deep and perfect Dani never wanted it to end. But then his head lifted, and his hands began mapping her, shaping the curves of her flesh to his gentle demands. He only stopped when she stroked his back, and only then to wrap her wrists with a soft length of cord, which he then tied to the headboard.</p><p>Dani glanced up, frustrated and amused. “You do like binding me.”</p> <p>“Restraining you,” he murmured, kissing the hard peak of one breast and then the other. He frowned at her tied hands as if seeing them for the first time, and then his face cleared. “If you touch me again, I will not be responsible for what happens.”</p><p>Rafael's sharp teeth flashed as he spoke, and she sensed they hurt as much as the hard shaft nestled between her thighs. She put her mouth on his, not giving him a chance to refuse as she edged the tips with the soft inside of her lower lip. With a groan he bit down, shuddering as he drank from her mouth, pressing the head of his penis against her and then into her, until Dani arched up, needed her aching emptiness to be filled. It became a wild, reckless thing inside her, making her test her bonds and meet the hard thrust of his body with her own.</p><p>From there it quickened, the dance and glide of flesh with the dark and needy fusion of their mouths. Rafael took a little of her blood and then soothed the two small wounds with his tongue, even as his hands fastened to the sides of her thighs and held her open for the deep, steady stroke of his cock. When he nuzzled her throat, Dani expected to feel him bite again, but his mouth glanced across the sweep of her shoulder and then found her ear, where he whispered something in a language she didn’t understand and yet felt as surely as the pleasure streaming through her.</p><p>Dani wanted to touch him, to sink her fingernails into his back and urge him to stop holding back and to take her as she wanted him to, as he wished to. The words poured out of her in her own language, one he must have understood because he stiffened over her, his muscles locking for a long moment as he lay buried inside her body. Dani jerked under him, and that and her words were all it took to destroy his control.</p><p>“You want more?” he rasped, driving into her with the full force of the passion she had released. “Take all of it. All of me, Daniela.”</p> <p>Dani drew him down until his cheek pressed to her temple, and sank her own blunt teeth into the side of his strong neck. She kissed the marks she left, panting against them as her spine bowed and her orgasm flooded through her, wrenching a low cry from her that went on and on until Rafael covered her mouth with his own and gathered her up into his arms, holding her as he followed.</p><p>A thousand years later, Rafael lifted his head and stared down at her as if he didn’t recognize her. “What have we done?”</p><p>“It was a dream. We were dreaming.” Her hands shook as she held onto him, all of the old doubts chased away by new ones. “Weren’t we?”</p><p>Six</p><p>The sun crossed from morning to afternoon skies before Rafael woke. Daniela lay in his arms, so deeply asleep that she did not stir when he extracted himself from the warm softness of their embrace. A wedge of sunshine from a gap in the curtains played over her, displaying everything he remembered from the night: the pale golden skin, high firm breasts, and silky hair that poured from her scalp over the pillows in dark streams, fringed the faint shadows of her eyelids, and cupped her mound in a tangle of delicate curls.</p><p>Rafael knew it hadn’t been a dream. He could still feel her moving under him. He could still taste her on his lips.</p> <p>After he secured her, he pulled on his trousers and went to wash and think of how and why he had done this to her. He had been drawn to her from the moment he first saw her, stepping out into the moonlight. He had also recognized her youth, and heard the tremors of fear in her voice. He did not seduce innocent, frightened human females; when he wanted sex he sought out a mature, experienced woman who understood mutual pleasure and spent one night with her. Anything more than that was not possible.</p><p>He had not been Daniela’s first, that much was a comfort. She had enough knowledge of a man’s needs not to be frightened of them, as a virgin would be. That and her body had welcomed his completely, with no discomfort or awkwardness. Still, there had been moments when he had felt her react to his love-making as if she had never experienced the like. Perhaps her other lovers had been inept.</p><p>There will be no other lovers. Rafael swept his hair back from his face with an impatient hand. She will have me.</p><p>Was he seriously thinking about taking a human as his lover? As Lucan had once planned to do with Samantha? Or was it because Donatien pursued her, Donatien wanted her?</p><p>I’m not what you think I am.</p><p>It had taken years for Rafael to accept what he had done in Richard’s name. He should have known that something was wrong from the moment the high lord had given him that case of rare, exquisite cognac mixed with blood as a gift to the Marquis. To help ease his pain in his last days, Richard had said. Never mentioning that it had been aged in old copper vats.</p><p>Donatien must have known. Rafael had brought a bottle to the asylum each time he called on the Marquis in his private suite. He could still see him sipping the lethal blood brandy, smiling with pleasure. The fine particles of copper would have burned his insides as he swallowed, would have made his gut feel as if it were on fire. Yet the Marquis had said nothing, drinking one bottle after another each night. The same nights he had tried to seduce Rafael.</p><p>He could still feel the touch of Donatien’s hands, as gentle and curious as a young girl’s. Give yourself to me, my night angel, and I will take you to places that you have never been.</p> <p>Rafael had never desired men, but nothing on this earth had been as beautiful or seductive as Donatien.</p><p>“I hate to ask a stupid question,” his partner said from where she stood in the doorway, “but why is there a naked nun handcuffed to your bed?”</p><p>“She is not a nun. Please be quiet, Samantha. She is sleeping.” Rafael shrugged into a shirt as he walked out of the bathroom, went to close the bedroom door, and moved on to his weapons cabinet. “The handcuffs are merely a precaution. I don’t want her to run away again.”</p><p>“Kidnapping victims have a way of doing that. We call it escaping their captor.” Samantha propped her arm across the cabinet, prevented him from opening it. “Uncuff her, Rafael. Lie to her. Tell her you had too much to drink, and that it was all a terrible mistake. Then give her cab fare and send her back to the convent. And pray she’s into forgiveness in a big way.”</p><p>“I cannot send her back.” He glanced at the bedroom, wondering if their voices would disturb her. After what they had shared in and out of the dream, when she woke she might feel disoriented, even frightened. His own guilt had been gnawing steadily at him. What had she done to him? “Daniela is different. She is like us.”</p><p>Her expression turned skeptical. “You’re telling me that she’s a vampire nun?”</p><p>“No, she’s human, but she was... it is complicated.” He was not even sure what Daniela was, only that she could heal with a touch, and that Donatien would stop at nothing to have her. Of that much he was certain. “She is in grave danger.”</p><p>“Like you aren’t?” She opened her jacket and tapped the butt of her pistol. “Guess who replaced all my ammunition with copper rounds last night? Want to play target and let me find out how well they work?”</p><p>Rafael knew she wouldn’t shoot him, but thought it prudent to dispel some of her anger all the same. “Samantha, I have to protect her. The man who is hunting her is the same one who killed the man at the convent. He is–”</p><p>“Not a man, and not particularly sane. He was Kyn, but got himself tossed in the nuthouse after he slaughtered a few too many humans, where he went genuinely nuts and poisoned himself by eating copper, and then rose a second time. No one knows what he’s capable of, but he scares the shit out of everyone, even Lucan.” She nodded at his startled look. “Yep. I know all about the Marquis now, Rafael.”</p><p>Despite Lucan’s orders, someone had told Samantha about Donatien. There wouldn’t be a window left intact in the city. “I regret that you were not told about him,” he said, playing diplomat, “but it changes nothing. Daniela must stay with me.”</p><p>Samantha breathed in as if to shout, and then wrinkled her nose. “What is that smell? God, it’s getting on my nerves more than you are.” She paced around the room. “Have you started smoking?”</p><p>“No.” Rafael’s head was still filled with Dani, whose scent still painted his skin. “I am rarely here. Likely it is exhaust fumes from the street outside the building.”</p><p>“Close the windows, then, because it’s really—” Samantha came to an abrupt stop and squatted, touching a spot on the burgundy carpet. “There’s blood here.” She flushed as a vision came over her. “Oh, don’t tell me you fed on her, too?”</p><p>“I was not thinking clearly.” Obviously. “I promise you, I did not harm her.”</p><p>“Great. It’ll all be in her blood, and really, the last thing I want to watch in my head is pornography starring you and the nun. Jesus, I’m going to hell just for saying that.” She stood and strode into the kitchen, but stopped short of the sink. “Rafael.”</p><p>“I told you before, she is not a nun.” He holstered his gun and took out the spare he carried along with a box of copper rounds. “I never intended for it to happen. It simply did.”</p><p>“Rafael, this isn’t hers.”</p><p>“It must have been the dream. I think she took me back to where she lived, in Argentina.” He was almost sure of it. “We went to an underground compound – some sort of medical research facility–” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Rafael,” Samantha said, very patiently, “I’d love to hear about your dreams all day, but this blood on my hand isn’t Daniela’s. I think it belongs to the decapitated head sitting in your sink.”</p><p>He didn’t believe her, not until he saw it for himself. It was indeed a human head, that of a young woman with blonde hair. Garish jack-o-lantern earrings dangled from her lobes while her clouded eyes stared up at him, wide and terrified. Her mouth formed an unnatural, ghastly smile. The head had been placed so neatly in his sink that its fluids dripped directly into the open drain.</p><p>“Trick-or-treat,” Samantha muttered.</p> <p>“Someone must have broken in and put it here while I slept,” he said. The decapitation, he saw from the condition of the neck stump, had been performed precisely and cleanly, with a perfectly level blade. “Can you tell where she was killed?”</p><p>Samantha placed her hand, scarred in the center palm from the bullet of a hired killer, into the small amount of blood rimming the drain. Her pupils narrowed to splinters of black, and a flush rose from her neck to race up her cheeks.</p><p>“Hanging blade, torture room,” Samantha said in a distant monotone. “Darkness. Walking down a narrow hallway. Darkness, wait, she keeps zoning out. Redhead in a maroon dress. Ugly pierced guy grinning. Darkness. Table, brown haired man. Hand on her hand and... oh, my God.\" Her face white now, she snatched her hand out of the sink and scrubbed at it with a towel. “Is that what he does? He makes them feel those things? Relive them? Want them? What?”</p><p>Rafael thought of Daniela and how completely she had given herself to him. “What did you smell before?”</p><p>“Who was this girl?” she countered. “Why did he kill her and bring her head to your apartment?”</p> <p>“I am trying to find out,” he said through clenched teeth. “What did you smell?”</p><p>“Something gross, like an overflowing ashtray. Or Evan Tenderson. But I repeat myself.” Her mobile phone beeped, and it seemed to calm her as she answered it. “Brown.” She listened.</p><p>Rafael quickly searched the apartment, but found nothing and no one hiding in it. He went back to Samantha.</p><p>“Ten minutes,” she said as she ended one call and made another.</p><p>“What now?”</p><p>“Bad news.” Into the phone, she said, “Burke? It’s Sam. I need you to send some guys over here to Rafael’s place. To move the kidnapped nun I’m not supposed to know about to a safer place so the nutcase zombie vampire you’re not supposed to tell me about doesn’t kill her. There’s also a decapitated head in the sink. I’d appreciate it.” She switched off the phone. “Pack it up. We’ve got work to do.”</p> <p>He didn’t wish to leave Daniela in the care of others. “Samantha—”</p><p>“Donatien hung the other part of this girl in front of Club Dominion. He left a note addressed to you. He wrote it in blood on the torso.” She tossed her keys to him. “I’ll wait with her until the men get here. You get down to the club before Tenderson does, read the message, and then get rid of it.”</p><p>Dani woke up to the smell of hot coffee, and found Detective Brown unlocking the handcuffs binding her wrists to Rafael’s head board. “What are you doing here?”</p><p>“Trying not to think of ways to off my partner.” She tossed the cuffs aside and checked Daniela’s arms, which were still somewhat bruised, and chafed her wrists. “I’m so sorry about this, Ms. Nieves.”</p><p>“It’s Dani. Don’t be upset, Detective, please. I’m not.” She smiled a little, thinking of the night she’d shared with Rafael. “I guess I should tell you that I’m not really a nun.”</p><p>“Rafael mentioned it a couple dozen times. I can’t say I’m not relieved.” Green eyes crinkled with a genuine smile. “Call me Sam.”</p><p>She looked over Samantha's shoulder. \"Where is Rafael?\"</p><p>“I kicked him out to go do some work.” Samantha began gathering Dani’s clothes, which were scattered all around the bed. “I need you to get dressed. We're going to move you to a safer place, keep you there until we can catch this guy.”</p> <p>“Donatien is coming for me,” Dani told her bluntly. “I’m the one he wants.”</p><p>“Well, he can’t have you.” She straightened and sniffed the air. “Do you smoke?”</p><p>Dani could smell it, too. She had smelled it before, in the village, in the compound, in the jungle. The dead fires.</p><p>“It’s him. He’s here.” She jolted out of the bed, grabbed her clothes from Sam and began dressing frantically.</p><p>“Easy, honey,” Sam said. “Rafael searched the apartment before he left; there’s no one here.”</p><p>Dani shoved her feet into her shoes and then heard something moving in the ceiling. “You have to hide,” she whispered, dragging Sam toward the closet. “Don’t make any sound.”</p><p>“Waste of time,” Sam said, staring up.</p><p>Cold air poured into the room as a beautiful man dressed in sky-blue velvet lowered himself into the room from a gap in the ceiling panels. The ageless face had not changed, nor had the perfect proportions of his long, lean body. From the pristine suede of his shoes to the gentle waves of his caramel-colored hair, he might have been a living work of art.</p><p>“No.” Dani shoved Samantha behind her. “My – my lord, it is you.”</p><p>“At long last, we meet again, my pearl.” His lovely tenor seemed to make the air quiver. “I must say, you have not made my pursuit a leisurely one.” He eyed Samantha with interest. “Do introduce me to this delicious-looking Amazon.”</p><p>“I’m the woman who’s about to kick your ass,” Sam replied, drawing her weapon.</p><p>Donatien produced a smile so heart-breaking that Dani gasped. “Beautiful, spirited, and armed. Delightful.”</p><p>Dani reached out to him. “She is nothing, no one. I will come with you, my lord, and do whatever you want. Only leave her.”</p><p>“Shut up, Dani,” Sam snapped, aiming for Donatien’s heart.</p><p>“Of course you will, my pearl. That was never in doubt.” He approached Samantha, ignoring her warnings and smiling until she fired three times. “Now, dearest, someone should have told you about my fondness for copper.” He reached into his jacket and pulled out the flattened rounds, one by one, as if they had come from a pocket instead of the wall of his chest. “I’ve acquired something of a tolerance for it since the last time I died, so shooting me will only make holes in my jacket.” He caught Samantha in mid-lunge and lifted her by the throat with one hand, pressing his other to her abdomen.</p><p>“No,” Dani begged. “Not to her.”</p><p>Donatien ignored her to whisper against Samantha’s ear. “Such painful old wounds, Detective. And you, allergic to morphine. How you must have suffered.”</p><p>Samantha uttered a sharp cry, doubling over when he released her. She groaned, clutching herself as she fell to her knees.</p><p>“A newly-made Kyn, still vulnerable to talent. You would be Lucan’s sygkenis, Samantha Brown.” Donatien gave the top of the detective's head a fond pat before he addressed Dani. “You need not look so frightened, child. You know how much regard I have for you. Why, I wouldn't harm a single hair on your sweet head.”</p><p>“Take me, but leave her, I beg you.” Dani went to kneel before him, knowing he enjoyed that, hoping it would appease him. “I am the one you came for, my lord. Take me.”</p><p>“And leave behind a prize like the suzerain’s sygkenis? She will serve as our passport to anywhere.” Donatien grabbed Samantha by a fistful of her hair and dragged her to her feet. \"Did you enjoy the Spaniard last night, my pearl?” he asked Dani. “I thought he might remind you of old times.”</p><p>Something cold and dreadful settled over Dani. “You came here last night?”</p><p>“Only to supervise your satisfaction, dearest.” As Samantha groaned, he glanced at the bed. “It was not as imaginative as it should have been, given my contribution, but something kept undoing my best efforts to inspire you.” He shoved Samantha at Dani. “Your gift, I presume. It does spoil so many things.”</p><p>“You did not make Rafael desire me.” She placed her hand on Samantha’s abdomen, but felt no physical wounds inside. “You could not. He is like you.”</p><p>“Quite right. What I made you do, my pearl, was feel his natural desire for you so acutely that you had no choice but to fuck him. I’m sure he was quite overcome by your passion.” The scent of dead fires choked the air as his eyes lost their focus. “It was why they killed me, you know, my pet. Pure, petty jealousy. I was beauty incarnate, and then I was beauty immortal. They knew no human or Kyn could resist me.” He smiled and lowered his voice to a murmur. “Now I will have both of you.”</p><p>“Rafael resisted,” Dani guessed. “Didn’t he? That’s why you want him. Because he rejected you.”</p><p>Donatien slapped her. “No one refuses me.”</p><p>Samantha clutched at Dani, jerking as if being tugged by a string.</p><p>“You see? It is so simple to stir desire, even where there was none.” He gestured toward Samantha, whose body shook. She put stiff arms around Dani and kissed her with cold, unmoving lips.</p><p>Dani hugged the other woman, looking into her horrified eyes. “I know,” she whispered against Sam’s lifeless mouth. “It is him, not you. Don't fight him, he will only hurt you more.”</p><p>“Now, dearest, you’re interfering with my pleasure again,” Donatien told Dani. “I do wish we had time for more than a mere kiss – I wager her mouth would look very fetching pressed between your legs – but the plane to Buenos Aires leaves in few hours.” He clapped his hands together, and a brown-haired man and redheaded woman came into the room. “Escort our new friends downstairs.”</p><p>“Where are you taking us?” Dani demanded, struggling against the man’s tight hold. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You do have to perform a penance before we return to Argentina, my pearl,” he said. “Where better than in a convent?”</p><p>Seven</p><p>Lucan was not the best tracker among the Kyn – Gabriel Seran had long held that distinction – but after spending most of his lengthy existence hunting his own kind, he could pick up any Kyn scent with little effort. Discovering that Donatien no longer shed scent proved no impediment, as the Marquis never traveled alone. It only took a few moments for Lucan to find the acrid, sour trail of two humans teetering on the brink of rapture. How like the Marquis to drain his companions to the point of near-death, and then leave them there, imprisoned by the pain and terror induced by his talent, too weak from blood loss to do anything but serve and endure.</p> <p>Bastard.</p><p>Tracking the human female and male Donatien had recently enslaved led Lucan directly across the city, to the cluster of hotels and clubs catering to the needs of the young, moneyed and bored. The trail ended at Club Dominion, and there, standing beneath it and holding court among a dozen human patrons waiting to enter the club was his seneschal, Rafael.</p><p>A faint halo of golden light surrounded Rafael – light, Lucan knew, that would be completely blinding to any human eye – as well as the sweet, pervasive scent of orange blossoms.</p><p>The humans weren’t waiting to enter the club. Rafael had shed a massive amount of scent, using l’attrait to bespell them. As he drew closer, Lucan saw the reason why he had also drawn on his talent to blind the humans. Someone had barred the open doors of the club by hanging the decapitated body of a female in front of it.</p><p>Lucan joined his seneschal in front of the gruesome display. “A gift from Donatien?”</p> <p>“A message. He left her head in my apartment.” Rafael stared at the dead girl’s torso. Her blouse had been neatly cut off from the bottom of her breasts to the top of her mound. An elegant hand had written on it in blood:</p><p>If you truly wish to see the light, Rafael, you must bleed for the sins of the world. Annuciata – I will begin killing them at midnight.</p><p>“This has to end.” Lucan turned and concentrated, and the scent of jasmine grew thick. “Go home,” he told the waiting humans. “Do not return here again.”</p><p>Slowly the crowd shuffled off to their cars.</p><p>Rafael took out a dagger, cut the rope tied under the dead woman’s breasts, and carried the body into the club.</p><p>Lucan followed, and saw several patrons were all sitting quietly at their tables, staring at the band on stage. The musicians stood bound by spiked chains to their instruments, garish spot lights illuminating their blank faces.</p> <p>The thick odor of fresh blood drew him to the nearest table. The two girls sitting at it were motionless, their eyes unblinking. They were alive, their pulses regular, but their hands had been nailed to the top of the table. At the next table, a young man and his date were tied to their chairs with razor wire.</p><p>Lucan looked at his seneschal. “He’s been at all of them.”</p><p>Rafael placed the body in the stock room before he came out and bolted the doors. Lucan worked quickly with him to free the humans from the various, ghastly methods Donatien had used to restrain them, and coax them back to semi-consciousness. Women and men began to huddle together and weep.</p><p>“I will go with you to the convent,” Lucan said once they had freed the last of the patrons, and suggested through l’attrait that they forget what had happened while they sought out medical treatment for their wounds. “Where is Samantha?”</p><p>“She stayed behind at the apartment with Daniela. Burke sent men to help escort her to a safer location.” His mobile phone rang, and he answered it. “Suarez.” With a frown, he switched it to speaker. “Samantha? Say that again?”</p><p>“I said, we’re okay,” Samantha said, her voice filled with laughter. “I’m taking Dani back to the convent. Can you meet me there? There’s been a ten twenty-two, and I could use a hand with it.”</p><p>His seneschal froze. “I’ll be there shortly.”</p><p>“Great, thanks. See you.” The line clicked off.</p> <p>“What is it?” Lucan demanded.</p><p>“Samantha was warning me,” Rafael said. “‘Ten twenty-two’ is radio code for ‘disregard the last assignment.’ It’s a trap.”</p><p>Light bulbs and glasses all around the club began exploding.</p><p>“He took her,” Lucan said, hearing nothing but the roar of blood in his head. “God damn it, he has her.” He started for the door, only to be brought up short by a hard hand on his arm. He stared at Rafael in amazement. “You dare.”</p><p>“I do,” his seneschal said flatly. “We will summon the men and have them surround the convent. I will go in alone.”</p><p>Lucan stared at him. “If you expect me to wait outside and do nothing while you have a polite tête-à-tête with that lunatic, think again.”</p><p>“I have no plans to negotiate with Donatien, my lord,” Rafael said. “It will be a simple, even exchange. Me for Samantha, Daniela and the rest of the women.”</p><p>“And then?” Lucan snarled. “Am I to simply walk away and leave you to him?”</p><p>“Then,” his seneschal said, “I will finish this.”</p><p>Dani held on to Samantha as Donatien escorted them inside the silent walls of the Annuciata. The women of the convent were nowhere to be seen, and the fear he had already killed them clutched at her throat, making it hard to breathe.</p><p>“I think what I admire most about that cunt Marguerite was her ingenuity,” Donatien said as he brought them into the convent’s main work room, where the nuns had once spent years sort and mending donations of used clothing for the poor. Neat, ominous rows of garden tools, cooking utensils and every knife from the kitchen covered the table top. “You had no religion when she took you from the village, did you?”</p><p>Dani shook her head. The Father had had nothing but contempt for the church.</p><p>“She gave you a cause, my pearl, one well-suited to your particular abilities. How like a Catholic to teach you to worship an imaginary God while you cared for the victims of that faith.” Donatien sat down in what had been the Mother Superior’s chair at the head of the table and indicated the others to his right and left. “Do be seated, ladies.”</p><p>“You have me now, my lord,” Dani said as she lowered herself in the chair to his left. “I will serve you willingly. I swear it. But if we do not leave this country quickly, your enemies will seek revenge.”</p><p>“I can only hope, my pearl.” Donatien nodded to the redheaded woman, who opened the door to the adjoining storage room. In a single line, the women of the convent shuffled into the room. Each went to stand against the wall, their faces as empty as their eyes.</p><p>“If you harm them,” she promised, “I will never serve you.”</p><p>“I do not flatter myself to think I can hold your loyalty, whatever may be my wishes in the matter. I must therefore resort to more drastic measures.” He picked up a boning knife. “If you attempt to leave me again, I will forego my usual pleasures and begin killing every human I touch. Like so.” Donatien placed a hand on the redhead's arm. She uttered a short, almost grateful cry, and blood poured from her mouth, nose and ears.</p><p>Dani ran to her, but by the time her body crumpled to the floor, she was dead. She held the woman's lifeless body in her arms and looked up at the smiling monster. “I will stay with you.”</p><p>“You see? We understand each other at last. Excellent.” He took out a golden pocket watch and consulted it. “Midnight has arrived, but I fear your lover has not. We must start the entertainment without him.” He made a languid gesture.</p><p>Bridget came forward, moving as if in a daze. She began mechanically rolling up the sleeves of her robe.</p><p>“This one cuts herself, did you know that?” Donatien asked in a conversational tone. “Very cleverly, in fact, with small bits of razor blades concealed in the ends of her fingernails. She almost had me convinced, and I am not an easy man to deceive. Poor Cristál. All this time, you have been wasting your talents on a pathetic self-mutilator.”</p><p>“I knew she could hurt herself,” Dani said, her eyes filling with tears. “It is not her fault. She is sick.”</p><p>“A pity you could not repair her mind as well as you have her little cuts.” Donatien tossed the boning knife to Bridget, who caught and held it in a white-knuckled fist. “The wrists first, I think, dearest. You’ll last longer that way.”</p><p>Dani saw Bridget drag the blade across her arm and bolted out of her chair. Before she could reach the woman, Donatien caught her by her hair and dragged her back, holding her at his side.</p><p>“She loves the pain,” he whispered against Dani’s cheek. “It makes her feel alive inside. It even arouses her. Look at her eyes. See how bright they are? By the time she makes the third cut, she’ll orgasm for us.”</p><p>“My lord,” a cold voice said from behind them. “I have come, as you commanded.”</p><p>Donatien turned to smile at Rafael. “My old friend, the emissary of cognac.” He released Dani’s hair. “How delighted I am to see you after so many years.”</p><p>Dani took advantage of the distraction to go to Bridget and tear the knife out of her grip. She clamped her hand over the woman’s bleeding wrist, pouring herself into the wound as quickly as she could.</p><p>“I come with an offer of trade for safe passage,” Rafael said.</p><p>Donatien’s eyebrows lifted. “Now I am intrigued.”</p><p>“My master Lucan has agreed to end my service to him,” Rafael said to Donatien. “Release the women, and I will make my oath to you now. I will take you to any destination you wish, establish your household and, if you desire, gather a jardin to serve you. I swear this on my honor.”</p><p>“You would be my seneschal? What a provocative idea.” Donatien glanced at Samantha. “Alas, I have become quickly enamored of my fierce Amazon. Perhaps I will send her back to him someday, but I cannot surrender my new jewel now.” He smiled. “What else do you offer, emissary?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rafael opened his jacket, revealing a vest covered with wired sticks of dynamite. He held out his hand to display a remote device, a button on which his thumb had pressed down. “Release Samantha and the other women now, or I will detonate the explosives. There are enough strapped to me to obliterate everyone in this room.”</p><p>“Dear boy, I am impressed.” Donatien leaned against the table, striking a beautiful pose. “You are, of course, bluffing.”</p><p>“My master’s order were explicit,” Rafael told him. “Samantha is his sygkenis. If he can not have her, no one will.”</p> <p>Donatien chuckled. “That sounds more like the Lucan I remember. But what of your little lover, Emissary? Are you ready to sacrifice her on the altar of honor as well?”</p><p>“I am the one responsible for poisoning you,” Rafael replied. “I am Kyn, and not easily killed. You can spend eternity taking out your vengeance on me.”</p><p>“No.” Dani walked slowly toward Rafael. “You don’t have to do this.” Her wrist throbbed, and she felt her flesh parting and blood welling.</p><p>“Listen to your sweetheart, Rafael,” Donatien said. “Do as I wish, and you and I can spend eternity playing with her.”</p><p>“Daniela.” Rafael met her gaze for a long, sorrowful instant.</p> <p>“I know,” she whispered as she reached out and took Donatien’s cold hand in hers.</p><p>“My pearl, don’t be afraid. He is all... talk and...” a frown marred his perfect features as he tried to take his hand from hers and discovered that he couldn’t break her hold. “Cristál? What are you doing, child?”</p><p>Dani took his other hand in hers, and looked into his puzzled eyes. “What I was made to do.” She closed her eyes.</p><p>He felt her then, and struggled, jerking at her hands. “No. You are gifted, pet, but this is too ambitious. You cannot.”</p><p>From a distance Dani heard Rafael call her name in a terrible voice, and felt his hands wrench at hers. But even with his vampire strength, he could not break the connection between her and the monster.</p><p>“Take your hands off me,” Donatien ordered in a thick, ugly voice. “Stop this. Stop this immediately, I command you—”</p> <p>Dani opened her eyes. Donatien’s face began to wither, his cheeks contracting, his lovely mouth thinning, his eyes sinking back into his head. His flawless skin grew mottled as capillaries burst and formed an ugly red web around his nose and across his cheeks. His teeth, bared now, darkened from flawless white to a stained, chipped yellow. Clumps of his caramel hair began to drift to the floor as patches of bare scalp sprouted on his head. Beneath his clothing, muscles thinned and shrank, and bones creaked and snapped.</p><p>Tiny dots appeared all over him; particles of copper being pushed out of the pores of his skin. They rained on the floor, reddish-orange dust.</p><p>Dani had never held on so long, but she did not let go until she felt the last of the copper and the strength leave Donatien’s body. Then she stepped back away from the stooped, skeletal thing he had become.</p><p>“Ashes to ashes,” Donatien croaked in an impossibly ancient voice. “Dust to dust. My pearl, you have... undone me.”</p><p>His body collapsed in on itself, a house of forgotten cards. The body she had healed was too old and fragile to sustain itself now. He had cheated the grave too long, and Death came to grind him under its heel. In less time than it took for Rafael to disconnect the explosives strapped to his body, what had been Le Marquis de Sade lay in a crumpled pile of velvet, bone and ash.</p><p>Dani knew she didn’t have much time left; what she had taken into herself would soon take over her. “Rafael.” She smiled as he came to her and took her face between his hands. “It was not him last night. It was you, and it was me. Only us. I promise.”</p><p>“Daniela.” He kissed her and held her against him, and shouted for someone. “Tell me what to do. What will happen to you?”</p><p>“I must go now.” She had already slipped the knife from his belt. One small push, and it slid between her ribs and into her heart as gently as a lover’s sigh. “Be happy.”</p> <p>Epilogue</p><p>“I remember doing this,” Lucan said as he watched Rafael tuck the sheets around Daniela's motionless body. “I was about to give up when she finally came back to me.”</p><p>Rafael sat down beside the bed and rubbed his eyes. “With all due respect, my lord? Go away.”</p><p>“My friend, I will give you as much time as you need with her,” Lucan said. “But she absorbed the whole of Donatien into herself. I do not think Christ himself could have shouldered such a burden.”</p><p>The door closed, and Rafael was alone again with her. Alone and waiting, as he had for three weeks. She had healed from what had been a mortal wound, but she had not transitioned to Kyn as Samantha had. Still human, Daniela would drink and swallow soft foods, and her natural body functions continued, but she remained locked in what seemed an endless sleep. He had tried entering her dreams, as he had on the night they had spent together, but her mind never again opened to him.</p><p>Soon he would have to make a decision, Rafael knew that. He could not spend eternity waiting for Daniela to wake up. The women of the convent had offered to care for her. Perhaps it was meant to be.</p><p>Samantha paid the next visit. “How’s she doing?”</p><p>“No change.” His voice sounded like stones grating together.</p><p>“I finished running the background check on her,” Samantha said as she came to the bed. “No birth records, no missing person reports, nothing. As far as Argentina is concerned, she doesn’t exist. I did better with the dream about the compound, though.”</p><p>He looked up. “It was real?”</p><p>She nodded. “I had a guy I know over at University of Miami get in touch with an archeologist working down there. He went looking in the area you described and he found the compound and the hidden entrance under the shed. You’re never going to guess who ‘the Father’ was.”</p><p>“Joseph Mengele.”</p><p>“Oh, hell.” She planted her hands on her hips. “How did you know?”</p><p>“I saw photos of him on the wall, in the dream.”</p><p>“Yeah, well, that spoils my big surprise. Seems after Mengele fled Europe to avoid prosecution for war crimes, he set up this place and spent years conducting experiments on the locals. According to the records they found, he took in mostly poor pregnant women. He was trying to genetically alter their unborn children. Only one baby survived. A little girl.”</p><p>“Cristál. Patient six-one-two-seven.”</p><p>“That’s her.” Samantha took Daniela's hand in hers. “There are some weird bits we can’t explain. Like the fact that Cristál’s records indicate she was born on February seventh, nineteen sixty-one.” She gazed down at the young, unlined face. “You know, if this is her, she looks pretty damn good for a forty-five year old woman.”</p><p>“Impossible. The records must belong to someone else.”</p><p>“She remembers Mengele, and he died in nineteen seventy-nine, Rafael. That alone would put her in her mid-to-late thirties.” Samantha looked thoughtful. “Anyway, I’ll leave you two alone. You might try the Sleeping Beauty cure. It’s how Lucan brought me back to the land of the living.”</p><p>He couldn’t concentrate enough to decipher her meaning. “Sleeping Beauty cure?”</p><p>“Tell her you love her and kiss her, you dumb ass.” Samantha grinned at him and left.</p><p>Rafael moved to sit next to Daniela on the bed. “Is that all it would take? To tell you that I love you? I hardly know you.” He bent close, and breathed in the scent of her skin. “But if you will come back to me, Daniela, I will love you. I know that in my heart now. We only need time together.”</p><p>She did not stir.</p><p>“Daniela, please. I cannot love a dream. I need you.” He lifted her up into his arms. “Come back to me now. Give me some hope.” He put his mouth to hers, and kissed her, and felt the pulse of her heart under his lips.</p><p>Rafael held her for a long time, willing her to wake, but she remained in her dream world. He made her comfortable, turning her on her side so that bed sores wouldn’t form on her back, and went to stand at the window to watch another sunrise alone.</p><p>He had responsibilities to Lucan, and to the humans he protected as a cop. He couldn’t ignore them forever. If he put her in the care of the women of the convent, he could still visit her every day. He wouldn’t give up on her. She had saved him from an eternity of suffering. He would never abandon her.</p><p>His face felt wet. It couldn’t be. He had not wept in six hundred years.</p><p>“Rafael.” A soft hand slipped into his, and Daniela was there, standing beside him, alive, awake, a dream come true.</p><p>He had to touch her to be sure. “Sleeping Beauty.” He caressed her cheek.</p><p>“I dreamed I was hiding in the jungle. Someone wanted to catch me, but he couldn’t, and then I think he finally went away.” She yawned, as if she had done nothing more than wake from a long nap. “Are you all right?”</p><p>“I am now,” he said, and pulled her into his arms. </p> </body></html>"]