["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Beware of Jesting Vegetables</p><p>1</p><p>In retrospect, I should have known something was wrong when the arugula started telling knock-knock jokes.</p><p>Leafy greens rarely had a sense of humor. And yet there I was, standing in the bustling kitchen of my busy Chicago restaurant, watching the vegetables on the prep table perform their own vaudeville act.</p> <p>When confronted by the comedic stylings of salad ingredients, most people would have maybe called it a night, taken a sick day. A normal person would have done exactly that. I was willing to admit that now, exiled from my kitchen and the city that I loved to the wilds of western Kentucky.</p><p>My only excuse was sheer exhaustion. The restaurant, Coda, had been overbooked since it opened four years before, far beyond even the wildest expectations of the owners. Six months in, the executive chef quit in a very loud, very public snit over farm-grown oysters, which I still didn’t understand, so I’d been promoted to the head position on the fly. Changes I’d made to the menu caught the attention of some reviewers, which brought even more people through the door. The owners offered me a 5 percent share of the business because I’d been working eighteen-hour days for nearly three years and hadn’t yet called the labor board. Even when I did manage to get a night off, some crisis would call me back into the kitchen, and before I knew it, I’d worked twenty-one days without a break.</p><p>I started making stupid mistakes, confusing sea bass with turbot and mistiming pasta. It was all fixable, but in my head, the mistakes compounded and made me a nervous, double-checking wreck. And yet I still kept up the schedule, only coming home to collapse for a few hours before rising again to scour the supplier markets for ingredients. Chefs who slept in missed the freshest produce and the choicest cuts of meat.</p><p>I ignored the signs that I was overworked every time I looked in the mirror. My hair was dark and thick but hung in a limp cloud around my face. It had no luster, no life. My skin was pale, pasty, and drawn. While I had a passably pert nose, my lips were far too wide and my blue eyes too large for my face, which was emphasized as my cheekbones became more prominent and the dark undereye circles spread.</p><p>I lost weight that I couldn’t really afford to lose. I was short and small-boned but what one briefly employed busboy charmingly referred to as “stacked like hell.” As if I needed another reason for men not to take me seriously in the kitchen, the distraction of an above-average rack meant I had to work that much harder, which led to more hours, which led to my interactions with giggling vegetables.</p> <p>On top of the sleep deprivation, my vacation to London had been canceled because the restaurant’s business manager, Phillip, booked a high-profile vintner’s dinner for that week, deciding that I “wouldn’t mind” putting off my trip for another year. That same manager, who also happened to be my ex-boyfriend, had asked me for “space” three months earlier and then had gotten engaged to the woman who cleaned his teeth. Who also happened to be his ex-girlfriend, something I didn’t find out until after their engagement. No wonder he spent all that time flossing. And because I worked such insane hours, the chances of meeting a new man I was attracted to and didn’t work with—trust me, I’d learned my lesson there—were practically nil. My rent was going up again, just as I was getting close to saving enough for a down payment on a townhouse. So if I wanted to buy my own home anytime soon, I was going to have to work more hours.</p><p>More. Hours.</p><p>I was contemplating how to bend the space-time continuum to make this possible, when the arugula shouted, “Knock knock!” When I answered, “Who’s there?” that seemed to upset my coworkers. Joining the veggies in a full-on George Burns soft-shoe ensured Tess Maitland’s place in the chronicles of “chefs who publicly flipped their shit.”</p><p>The room tilted under my feet like a ship’s deck, leaving me seasick and dizzy. I heard the disembodied voice of my mentor, Chef John Gamling, telling me that my hollandaise was gelatinous swill not fit to dress a McMuffin, which was weird, because I hadn’t made hollandaise sauce that night. I tried to argue that I had people to do that for me, but then I collapsed on the floor in a heap.</p><p>And that’s when the paramedics showed up.</p><p>Phillip, the ex-slash-manager, “strongly encouraged” me to take some time off. I said, fine, I would take the weekend. And then he made a noise in his throat that made it clear that two days was not what he had in mind. And then he used the word “sabbatical,” which was international culinary code for “lost her fricking mind.”</p> <p>We cooks liked to pretend that our exiled brethren were touring northern Italy or southern France, collecting recipes and refining pastry techniques. But “on sabbatical” usually meant they were drying out in a facility called Promises or Sunrises or some such thing.</p><p>I responded by inviting Phillip to commit indecent acts upon himself with a lemon zester. Phillip suspended me without pay for six weeks, which was, I felt, an overreaction. By the time a dishwasher drove me home, the urge to sing and dance with garnishes had worn off. I sat in my living room, staring at the blank beige walls, and I got pissed.</p><p>“Coda” meant a satisfying conclusion—the slow build of a good meal brought to a delicious climax. Phillip had come up with the name. He could be a pretentious prick, but he knew about branding. Where was my coda? I loved my work. That kitchen was my life. But was I supposed to work myself into delirious zombiehood and then collapse dead on my stove?</p><p>The fact was, I needed a break. I needed to rest, to sleep, to have conversations with people that did not involve butter-fat ratios. I needed to get as far from Coda as possible so I wouldn’t get sucked back into the kitchen and into that compulsive vortex of crazy. I made some arrangements online, packed a few essentials, and drove to Half-Moon Hollow, Kentucky, the only place I thought I’d get a welcome. Also, I may or may not have driven to Phillip’s apartment and thrown a honey ricotta cheesecake at his front door.</p><p>Chef Gamling and his life partner, George, had retired to Kentucky a year before to be near George’s family. Chef, my mentor in culinary school, was the only family I’d had in a long time. Never one to tolerate martyrs or kitchen drama, Chef had assigned himself the task of “whipping me back into shape.”</p><p>Knowing Chef as I did, it was possible he would use a wire whisk.</p><p>So there I stood, on a dirt driveway in the middle of nowhere, outside the two-bedroom farmhouse I’d rented from late September to late October. It looked as if someone had been building a sturdy little farmhouse and at the last minute decided that Victorian gingerbread and frills were an absolute necessity. The house was halfway to restored, with recently painted lemon yellow siding and bleached white trim. But there were no flowers in the yard, no silly wind chimes laced through the gingerbread eaves, and I found that sort of sad. There were carefully mulched beds surrounding the house, but no one had bothered to plant anything in them. The house seemed ancient but somehow half-finished, a pall of failure hanging over it like real estate B.O.</p><p>I would fit right in.</p> <p>My landlady, Lindy Clemson, had placed the house on a rental site after she and her husband filed for divorce. She’d told me she wanted to get some income out of it before she put it on the market in late October, when the divorce was finalized. Lindy seemed nice enough, if a little tightly wound. It was a real stroke of luck finding a landlord willing to rent for a term as short as one month, particularly in such a small town.</p><p>I heaved a sigh and adjusted the messenger bag on my shoulder, blowing the stick-straight dark brown hair from my face. Resolved, I tugged open the rear door of my SUV and hauled out my suitcases and boxes of kitchen equipment. The thought of using someone else’s pots, pans, and knives was just ridiculous. I’d also packed coolers with the contents of my fridge—organic eggs, cheeses from Meroni’s, asparagus from Sal (my asparagus guy), and enough wine to sink a ship. And of course, my travel-sized spice kit.</p><p>None of the food talked to me during the drive, which I took as a good sign.</p><p>Unpacking didn’t take long. I hadn’t brought many clothes, and I left my pans and knives in their special linen wrappings in the packing boxes. I explored the house, but once you got past living room, kitchen, dining-room-turned-office, two bedrooms, and bath, there wasn’t much to discover. The basement, Lindy had explained, was being used to store her ex’s belongings and wouldn’t be accessible under my rental agreement.</p><p>The rooms were clean but bare. Lindy had left only the most basic of furnishings, the kind of stuff older relatives pawn off on college students and newlyweds: an old brown plaid couch, a sprung pleather Barcalounger, a chipped pressed-wood coffee table. Not to mention the bold brass and black laminate dining-room table that may have belonged to a villain on Miami Vice.</p><p>A few pictures decorated the walls, but squares of unfaded wallpaper revealed where other frames had hung. Other rooms were freshly painted or, like the pretty little kitchen with its cheerful white and blue tile, had recently been refloored. The house smelled pleasantly of linseed oil and sawdust. I explored the rooms, pleased to find the odd window seat or corner bookshelf here and there.</p><p>While I was happy with the house, it didn’t matter much. I could live without cubbies and comforts. I just wanted to do my time “on sabbatical” and get back to the city to reclaim my life.</p><p>The main problem was, without the grinding routine of the restaurant, I had no flipping clue what to do with myself. There was TV, but it only had basic cable, and I didn’t feel like sitting down for the farm report. I hadn’t thought to bring any books with me, and the only selections to be found in the house were a bunch of John Jakes paperbacks. I wasn’t even hungry. Ever since “The Incident,” my stomach fought against anything but chamomile tea and toast. So I did something I hadn’t done in almost ten years: I treated myself to more than four hours of sleep.</p><p>I put fresh sheets on the lumpy little double bed in the master bedroom, pulled the shades tight, and went to bed at 7:30 P.M. I slept deep and dreamless, even with the occasional creak of the house settling against a backdrop of blissful country silence.</p><p>The first order of business the next morning was to drop by my landlady’s office with my deposit and rent for the month, then to visit Chef Gamling. It shocked me to find that Chef Gamling was well and truly retired. Like most of his students, I believed he would die with a spatula in one hand and an unruly saucier’s collar in the other. Now he ambled around his house all day in yoga pants while George taught chemistry at the community college. He was taking up gardening and painting abstract watercolor landscapes that looked like extremely depressing Rorschach blots.</p><p>George, a sweet man with fading cornsilk-colored hair and shoulders as broad as a barn, insisted I was too skinny from the moment I walked through the door of their cute little ranch house. Before ushering me to the back porch, George loaded me down with a bowl of something called monkey bread (a local specialty, I assumed). It was basically blobs of biscuit dough shoved into a Bundt pan and doused in caramel syrup. I don’t believe monkey was an actual ingredient. I didn’t want to ask.</p><p>I think this lump of sucrose-soaked carbs was supposed to serve as a comforting buffer for when Chef lowered the boom on me. It did not work.</p><p>“Any proper student of mine would know better,” Chef growled without preamble, glaring down from his easel, a paintbrush hanging loose in his hand. Chef was a stocky, mustachioed bull of a man with salt-and-pepper hair and deceptively steely gray eyes. And because I knew he loved me and I deserved the ass chewing, I contritely sipped iced tea, trying not to feel like an ill-behaved third-grader called to the principal’s office. The hint of a German accent made the admonishments seem even sterner than he intended.</p><p>“A chef must be sharp, reacting to a multitude of crises with calm and confidence. In order to do that, you need rest and proper meals. Did I not tell all of my students that ignoring your body’s basic needs was a one-way ticket to addiction, exhaustion, and disaster? How are you to maintain quality and prevent mistakes if you can’t remember orders? What good are you to your staff if you have run yourself down like a soggy dishrag? How are staff to respect you if you are singing and dancing like the puppet show—what’s it called, with the chicken and the vampire?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Sesame Street?” I suggested.</p><p>“Yes, Sesame Street.”</p><p>“I don’t think Big Bird is a chicken,” I grumbled petulantly.</p> <p>“Yes, I’m so sorry. You clearly have the expertise in performing figments of one’s imagination. And sassy-mouthing your mentor.”</p><p>“You’re going to make me peel potatoes again, aren’t you?” I groaned.</p><p>Chef Gamling did not, in fact, make me peel potatoes, as he would have when I made a stupid mistake in school. He gave me several Tupperware containers full of his special maultaschen, a German dumpling dish that he only made for me when I was sick in school.</p><p>His eyes softened as I bobbled the containers. “I worry about you, süße.” My throat caught at his rare use of a German endearment. He pinched my cheek gently, as if gauging how much weight I’d lost over the last year. “I don’t hear from you in months, and you show up at my door looking like this? Pale, skinny, big dark circles under your eyes. You look like you’re going to drop at any moment. And George is no good with first aid.”</p><p>“You wouldn’t be performing mouth-to-mouth on me in the ‘dropping’ scenario?” I asked, squinting up at him.</p> <p>He shook his head and hugged me fiercely. “I have heard the foul words that mouth is capable of producing. Lips that dirty shall never touch mine.”</p><p>“Hey, you were the one who told the female students that professional chefs ‘often season the food with salty language,’ so we couldn’t afford to become ladylike and offended.”</p><p>“Yes, but I didn’t expect you to embrace the concept so wholeheartedly.” He sighed.</p><p>And so I was instructed to go home, sleep, eat, and then sleep again. If I didn’t finish the maultaschen within three days, he was going to add malted milkshakes to my “regimen.” Also, I was supposed to meet him at the HMH First Baptist Church the next Saturday. The last time I’d seen the inside of a church, a funeral was involved, so this was not a good sign.</p><p>—</p><p>George caught me on my way out of the house and gave me a tire-sized chunk of monkey bread to call my very own. I couldn’t help but accept it, because the gesture was so sweet. So very, very sweet.</p> <p>George was a veritable font of information about local quirks and perks. When he heard where I was staying, he’d clapped his hands together like a little kid and demanded to know all of the details. When I gave him nothing but a confused smile, he told me that “the Lassiter place” had quite a reputation. “Everybody knew” that the house was rife with ghostly lights and strange noises. Before Lindy’s husband bought the place, teenagers used to sneak out to the property and dare each other to knock on the door and call out for the original owner, John Lassiter.</p><p>“You’re saying my house is haunted?” I asked.</p><p>“More like cursed,” George told me. “Ever since poor John Lassiter built it for his wife-to-be in 1900. He was one of those confirmed bachelors who suddenly decide to get married in their fifties. His fiancée was young and fickle. Elizabeth Early didn’t really want to marry John, so she kept finding reasons that the house wasn’t ready. She wanted the kitchen to be east-facing, she wanted a water closet, she wanted gingerbread and bits of flotsam all over the eaves. Finally, her father put his foot down and told her to quit stalling and put poor John out of his misery. The morning of their wedding, they woke up to find Elizabeth had run off with a peddler.”</p><p>“Tacky.”</p><p>“But effective,” George conceded. “John never heard from her again. He died a few years later, alone in that little house. He could have sold it. There were plenty of young men who would have given him good money for a pretty house to offer their brides. But he wouldn’t budge. He didn’t want a happy couple living in his house when he was so alone. And ever since he died, any couple who has lived together in that place has either died or had a marriage so miserable they wished they were dead.”</p><p>“So there’s no such thing as divorce in backwoods ghost stories?” I deadpanned.</p><p>“Laugh all you want, smartass. The only reason you’re renting the house is that Lindy Clemson’s husband died unexpectedly. It’s cursed, I tell you.”</p><p>“Lindy told me she was getting a divorce.”</p> <p>George blanched, as if he regretted revealing the information. He cleared his throat. “Well, in her case, it’s a little bit of both.”</p><p>“How could it possibly be both?”</p><p>“Things are different here, honey. This is Kentucky.”</p><p>“Oh, fine, so my house is cursed.” I sighed. “What are the terms?”</p><p>“Terms?”</p><p>“Every curse has terms. You know, sleep a hundred years and kiss a prince, you’re in the clear, that sort of thing. So what did John want from the couples who lived in his house? How can they get back in his good graces?”</p><p>“I don’t think he set any terms.”</p><p>I sniffed. “Well, then it’s more of a jinx than a curse.”</p><p>“Semantics.”</p><p>“I will try not to provoke the spirits of the epically lovelorn while I’m in town,” I promised.</p><p>“See that you don’t, sweetie.”</p><p>The Travel Wok—When Pepper Spray Just Won’t Do</p><p>2</p><p>There it was again!</p><p>The soft thump down the hall had me sitting up in bed, blinking into the black quiet of my room. My sleep-blurred brain tumbled to George, his stories about poor, lovelorn Mr. Lassiter, and the possibility that said deceased bachelor could be wandering around my house in spectral form.</p><p>This was what I got for going to bed so early. My internal clock was all wonky. Thoroughly chastised and toting Tupperware and a bowling-ball-sized chunk of monkey bread, I’d found myself back in my house with nothing to do. No dishes to prep. Nothing to chop or sauté. No pans to wash. No knives to sharpen. The highlight of the evening was tripping and falling flat on my face as soon as I walked into the living room. The coffee table seemed... off. I remembered it being a little farther away from the couch. Then again, I was still adjusting to, well, everything, so who was I to think I’d already mentally mapped the living room?</p><p>I settled for more sleep. It seemed the more I slept, the more I needed to sleep. My body had been running on fumes for so long it was as if it was soaking up all the rest it could because I couldn’t be trusted to sleep decently again when I went back to my life. The house was so quiet, a far cry from the traffic noises and sirens that bounced around my city apartment. I didn’t need a white-noise machine here. The silence of the house seemed to wrap around me like a sweet cocoon, helping me ignore my ailing stomach and table bruises.</p><p>The only hitch in my “sleep the month away” plan was that the extreme quiet made every creak, every groan, of every board echo like a gunshot. I didn’t know much about old houses, but it seemed this one spent a lot of time settling. At times, it almost sounded like footsteps falling softly against the hardwood floors—ridiculous, as I’d triple-checked the locks myself, a habit I’d carried with me from Chicago.</p><p>The Clemsons’ debris was strewn across the house like broken toys. Lindy left a bunch of men’s plaid flannels and Clemson Construction T-shirts in the closet. A manly bar of plain yellow Dial still occupied the little soap dish in the master bath. When I opened the coat closet, I had to dive out of the way to avoid the avalanche of blueprints and graph paper that came tumbling from the top shelf.</p><p>And now, on top of these depressing relics, I had to deal with things that went bump in the night? I tilted my head, like a dog listening for its master, and it happened again. The weird noise echoed down the hall. It didn’t sound like the house creaking. This time, it really did sound like footsteps, distinct movements on the floor. As if someone was walking around in the kitchen.</p><p>Slowly, my hand slid down the side of the mattress, reaching for the Louisville Slugger I kept under the bed in my apartment. But of course, it wasn’t there. Why would I bring a weapon to a nice, safe country cottage?</p><p>Something in the other room hit the floor with a muted thud, sending a cold, watery flash through my belly. I’d seen Straw Dogs. I knew this scenario wouldn’t end well for the out-of-towner.</p><p>I jumped out of bed, carefully moving to close the door with a soft click. I leaned against it, both palms pressed to the wood, as if my scrawny self could be any kind of barricade. Forcing myself to take slow, deep breaths, I stepped into my sneakers and a hoodie.</p><p>Options! I barked at my brain. Give me options. You can panic later.</p><p>I needed to call 911. But Lindy had taken all of the landline phones with her when she’d moved out. My cell phone? In my bag, on the TV table next to the front door. The front door, which was right by the kitchen. That was very poor planning on my part.</p><p>I would kick myself later, I promised. OK, I couldn’t call for help. I couldn’t get to my car keys. Could I run? My nearest neighbors were three miles away, but if I cut across the cow pasture that bordered the property, I could make that distance pretty easily. I could run in my pajama pants. It would mean leaving my purse behind, but at this point, I was willing to live without my cell phone and the fourteen Chap-Sticks rattling around in my shoulder bag.</p><p>I crept over to the window and tried to shove the sash up. Nothing. It didn’t budge a millimeter. Planting my feet, I tried again, shoving with all my might. Nothing. Being low to the ground gave me proper leverage, but I was also skinny, malnourished, with no weight-lifting regimen.</p><p>I leaned closer to the sill. “What the hell?” I hissed. The windows had been nailed shut from the outside. “Who does that?”</p><p>Were all of the windows nailed shut? Why would Lindy do that? I considered throwing my nightstand through the single-pane window and making a break for it, but having no idea who was in the house or why, I preferred to get away without calling attention to myself.</p><p>I need more options, Brain!</p><p>But Brain was ignoring me in favor of regurgitating random soup recipes. Because knowing the exact amount of mushrooms in the porcini bisque special from the previous week was super-useful at the moment. Stupid Brain.</p><p>OK, the back door was near the kitchen, which was clearly not a viable route. If I was very quiet, I might be able to sneak past the kitchen, grab my purse, and get out through the front door, calling the cops while I ran for the neighbors’. It was better than cowering in my room, waiting for some unknown intruder to decide whether he wanted to add murder to his criminal résumé.</p><p>I listened at the door, unable to hear anything on the other side. I touched the knob with shaking fingers, forcing myself to grasp it and turn. I could do this, I told myself. I was a city girl. And I would not let some hillbilly housebreaker intimidate me. I eased the door open. This was my house, damn it, however temporary. I didn’t let people intimidate me in my kitchen, much less my house. Giving up the relative safety of my room, I took a few resolute steps out into the hall.</p><p>I was Tess Maitland, terror of junior line cooks everywhere. I wasn’t afraid of anything.</p><p>Except for heights. And sharks. And backwoods burglars.</p><p>My bravado deflated to nil as I neared the kitchen. If I could just sneak past unnoticed and slip out the front door... If I could grab my keys and make it to my car, all the better.</p><p>My favorite wok—fourteen inches in diameter and carbon steel, nice and heavy—sat on top of a box full of kitchen supplies I’d left in the hallway. I slipped my fingers through the smooth wood handle. Now if he got in the way, the home intruder was going to get a nice, solid whack.</p><p>From the kitchen, I could now hear the low hum of the microwave. My arms fell to my sides, wok bumping against my leg.</p><p>Who the hell breaks into someone’s house to use their microwave?</p><p>Believe it or not, this actually made me feel better. For one thing, someone who was warming up ramen in a stranger’s house probably wasn’t planning the dismemberment of said stranger. And the microwave had probably covered the sound of my approach. As long as I didn’t— </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I moved my left foot, wincing as the board beneath it squeaked.</p><p>Damn it.</p><p>The microwave stopped, and swift footsteps moved toward the kitchen door. I threw myself against the wall, hoping to make myself invisible.</p> <p>The kitchen lights were flicked off, and something was coming my way. My hands shook as I gripped the pan tightly.</p><p>As the dark shape moved toward me, I raised my weapon high over my head. In front of me, white hands came into view, and a clear, low voice said, “Wait a min—”</p><p>Without waiting for the rest of his speech, I did what any reasonable person would do. I brought the steel pan crashing down on his head.</p><p>“Ow,” the shape growled, although he did not drop to his knees.</p><p>I shrieked and whacked him again, a nice uppercut swing that landed across his face. Enough moonlight spilled from the window that I could just make out the slim build, long limbs, dark hair, and darker eyes.</p> <p>“Stop that!” he spat, sounding rather annoyed now. And I found the tone of his voice really pissed me off. He was in my house. He was skulking around in my kitchen, cooking what I assumed was my food, and he was annoyed with me for interrupting him? He grunted when I swung the pan down on the crown of his head, but he still didn’t drop.</p><p>“Screw this, I’m going to get my knives,” I hissed, stomping toward the kitchen.</p><p>This was stupid for two reasons. One, I could have just walked out of the house unscathed. Also, I’d just broadcast my plans to my opponent. The moment I moved past him, his arm shot out and caught me by the hand, squeezing with enough force that I cried out. Twirling the wok with my free hand, I smacked his arm away with the edge of the pan.</p><p>“Stop hittin’ me with Asian cookware!” he shouted, shoving me away, sending me skidding into the fridge.</p><p>“Get the hell out of my house!” I shouted back.</p><p>He backed toward the doorway. “Look, I’m going to turn on the lights. And when I do, please don’t swing any other kitchen stuff at my head.”</p> <p>“Did you miss the part where I said ‘Get the hell out of my house’?”</p><p>“Well, that’s the thing. It’s not your house, it’s mine.”</p><p>I squinted as he flicked on the lights.</p><p>Holy hell.</p><p>My deluded burglar was sex in a pair of Levi’s. He was tall and lean, with the exception of a well-developed chest and arms under a worn True Value Hardware T-shirt. His eyes were a warm teak color with dark chocolate centers around the pupils, which complemented the mussed dark hair nicely. He had high cheekbones, marked with a little triangle of freckles at the corner of his left eye, which shouldn’t have been adorable on a burglar, but it was.</p><p>The most unusual thing about him was his skin, which was paper-pale. No one I’d so far seen in this town was pale, particularly the young men. People here spent so much time outdoors, doing farm work or yard work or hunting or fishing—everyone I’d seen had a healthy windburned glow. But this guy’s skin was like polished marble, smooth and white, with a faintly iridescent shine. He flashed me his best winning smile, a blinding white with prominent canines. I stepped back instinctively.</p><p>“Oh, come on! You’re a vampire?”</p><p>He grinned nastily, dropping his fangs.</p> <p>“Damn it.”</p><p>Contrary to popular legend, vampires didn’t have to wait to be invited into your house. They could walk through any human’s door any time they wanted. They just chose not to out of politeness. This was one of the many, many misconceptions that had been blown out of the water when vampires came out of the coffin in 1999.</p><p>Believe it or not, even living in a big city, I hadn’t come into contact with vampires often. Unable to digest human food, they didn’t exactly flood my restaurant with business. We had a vampire dishwasher for a while. The hours suited him perfectly, but being around that much silver, to which vampires were severely allergic, had him on edge for his entire shift, and he quit after three weeks. We tried to point out that our silverware was actually stainless steel, but Bruno couldn’t be persuaded. It was a shame. He was the one guy we could count on to show up on time.</p><p>I’d always figured that vampires had centuries under the radar to sink their teeth into anyone they wanted before the Coming Out, so why would they pick off random bystanders now that they were under media scrutiny? At least, that’s what I thought before one of them slunk into my kitchen and used my microwave without permission.</p><p>What the hell did a vampire heat up in a microwave, anyway?</p><p>“Whatsa matter?” he asked, the faint bluegrass twang rising and falling like ripples in bourbon. “Cat got your tongue?”</p><p>Despite the panty-dropping lilt of his voice, he touched the nerve that hadn’t sparked since Phillip had uttered the word “sabbatical.” I grabbed for the canvas carrying case that protected my ungodly expensive ceramic knives.</p><p>“Oh, put the knives down,” he said, moving around me at lightning speed and pushing the case out of my reach. “Gosh darn hysterical female.”</p><p>“Look, pulse or no pulse, you are breaking and entering. You need to get out, right now, or I’ll call the Council hotline.”</p><p>“Call V-one-one,” he said, referring to the nickname for the World Council for the Equal Treatment of the Undead’s national hotline for humans with vampire problems. “I have every right to be here.”</p><p>“I have a rental agreement in my bag that says otherwise,” I shot back.</p><p>“My name is Sam Clemson. I’ve lived here for the last five years. My wife and I are in the middle of a divorce. Until it’s final on October 28, I have the legal right to be here.”</p><p>“Tess Maitland. Wait—” I clapped my hand over my face. “Lindy’s husband? George said her husband died!”</p><p>“Well, to be fair, he wasn’t wrong,” he admitted. “I was turned about two years ago.”</p><p>“Show me some ID,” I said, holding out my hand imperiously. I would think about exactly how stupid it was to order vampires around at a later date.</p><p>The corners of his lips quirked. “What?”</p><p>“How do I know you’re not just some crazy who wandered into the house? All vampires are required by Council to register after they’re turned and file for their vampire identification card.”</p><p>“Congratulations, you’ve read USA Today.”</p><p>“Show me the card, Mr. Clemson.”</p><p>“Sam, please. Mr. Clemson was my father.”</p><p>“Are you sure about that?” I retorted.</p><p>“Haha, I’m a bastard, clever.” He grumbled as he pulled his wallet out of his back pocket and handed me the little green card. He was indeed Sam Clemson, and this was his address. And contrary to all laws of DMV logic, Sam took a damn fine ID picture.</p><p>“So, you’ve been here this whole time? How? Where have you been sleeping—” I gasped. “Is that why I can’t get into the basement? You’re locked in there during the day?”</p><p>“I don’t think I should tell you where I sleep during the day,” he said, lifting an eyebrow.</p><p>My lips wanted to twitch into a smile, but I clamped them tightly together. I supposed I couldn’t blame him for being cautious. Some paranoid humans spent the first year “postvampire” finding any reason possible to drag vampires out into the daylight or push them onto handy pointy wooden objects. The Council formed to “formally interact with human governments and facilitate open, cordial communication.” In other words, they busted their way into the homes of presidents, prime ministers, and dictators around the world and told them, “Quit killing us off for your twisted amusement, or we will FedEx you pieces of your beloved Robert Pattinson.”</p><p>And then a thought occurred to me.</p><p>“Wait, did Lindy know you were still staying here?” I demanded. He nodded, stepping away from me and my kitchen implements. “She rented this house to me knowing there was a vampire sleeping in the basement? That bitch!”</p><p>“Hey,” he objected. “That’s my—well, my ex-wife you’re talkin’ about. Do you always cuss so much?”</p><p>“Aren’t you the least bit upset about this?” I yelled.</p><p>“Of course I’m upset about it,” he shouted back. “Do you think I’m happy that my wi—Lindy thought it was OK to open our home up to some stranger, without tellin’ me? I didn’t even realize you were here until yesterday, when I tripped over your stupid box of kitchen stuff. How early have you been goin’ to sleep, woman?”</p><p>“Beside the point.”</p><p>“I was still tryin’ to figure out how to get you out of the house without talking to you, when you came in here swingin’ that wok. Who travels with a wok?”</p><p>“You, don’t talk anymore,” I snapped at him. I snatched up my purse from the hallway and grabbed my phone. I didn’t feel bad about calling, despite the fact that it was after 11:00 P.M. Even if Lindy was in bed, I thought she owed me an explanation. She didn’t pick up, and the call went to voice mail. I hissed out very specific instructions to call me as soon as she got my message, no matter what the time.</p><p>I slammed my phone onto the counter and let out a vicious stream of anatomically detailed curses.</p><p>He pulled those full, pale lips into a sneer. “You are just a big ol’ ball of sunshine, aren’t you?”</p><p>“The better to melt your face with, my dear,” I snapped. I took a deep breath and tried to remember that even if this guy was being a bit of a dick, it wasn’t his fault that his ex-wife had taken the last of my cash reserves under false pretenses. I was ashamed that I’d been conned by that little bumpkin bimbo. Clearly, a perky blond ponytail and a great big Jesus fish on one’s car didn’t make a person trustworthy.</p><p>I sighed. “OK, calling the cops is out, because you apparently live here. And I really need to take full advantage of my lease. I’m only here for a month.”</p><p>“I will not leave my house for some random stranger.”</p><p>“So, I guess we’re at an impasse,” I said.</p><p>“Yeah, if ‘impasse’ means ‘the foul-mouthed human moves out as soon as possible.’”</p><p>I crossed my arms under my chest... and realized that sort of pushed my boobs up into this weird cleavage popover. I dropped my arms. “I’m not going anywhere.”</p><p>“Fine, you don’t have to leave,” he said silkily as moved toward me. His body language suddenly shifted into a predatory lean, his tall frame looming over me, trapping me against the counter. “By all means, please stay. It gets so lonely out here when I’m on my own. I could use some... companionship.” He dropped his fangs and bared them dramatically.</p><p>And because the bad-decision-making lobes of my brain were in charge, I giggled instead of cowering against the counter. I stepped forward, into the cage of his arms.</p><p>“I’m sorry. Are you trying to intimidate me?” I scoffed. “You’re about as threatening as the cornfield chorus on Hee Haw. Do you have any idea what it takes for a woman to work her way up to head chef at a fine-dining restaurant in a major city? Or what kind of bullshit I’ve had to put up with over the years from chauvinist pigs who didn’t think I should be able to tell them what to do because I lacked the requisite testicles? I’m going to tell you the same thing I told them. I own thirty different types of extremely expensive knives. And I know how to put each of them to creative use. Try to intimidate me again, and you will wake up next to a beautifully plated medley of freshly sautéed vampire bits.”</p><p>Slightly boggled, Sam stared down at me, horrified, and backed away. “You’re crazy.”</p><p>“You’ll find that all chefs are a little unstable.” I offered him my scariest smile, the kind that made waiters cringe away like frightened deer. “Normal people don’t like to play with fire and raw meat all day.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grabbed his mug of what I assumed was blood and stalked toward the basement door, glaring over his shoulder.</p><p>I grinned to myself. “I think I won that one.”</p><p>—</p> <p>With the (disturbingly attractive) interloper holed up in his basement, I made a huge pot of coffee and retreated to my room. I threw my blinds up so the minute the sun rose, my room would be bathed in light, and crouched on my bed.</p><p>I had a vampire roommate. This was just the cherry on the crap sundae of my life.</p><p>Was this even legal? Could Lindy rent the house to me when it was already occupied? Vampire property rights were still a little vague. After the Great Coming Out, the Council wrangled with the human governments over financial issues. Vampires became the answer to a dwindling economy, an untapped taxable workforce capable of launching untold cottage industries—blood banks, all-night shopping centers, fang-friendly dental clinics.</p><p>But there were problems. Recently turned vampires weren’t eager to take back the credit-card balances they’d left behind when they’d “died.” Other vampires hadn’t paid taxes in centuries and deeply resented the idea that they’d have to file 1040s. This reluctance led to some resentment from the humans, which led to some “less than friendly” policies toward the undead when it came to mortgages, leases, and probate laws. After all, vampires weren’t technically alive, so how could they have property rights?</p><p>Even after the Undead Civil Rights Act, there were still loopholes of which humans took full advantage. Landlords suddenly aware of why some tenants only came out at night kicked vampires out of their apartments over the slightest infractions. Home loans to vampires came with outrageous interest rates. And when they divorced, they were lucky to get away with the clothes on their backs. I couldn’t imagine a judge in semirural Kentucky giving Sam a fair shake against sweet little Lindy.</p> <p>Was this rental scheme some sort of revenge against Sam? They’d been married for three years before Sam had been turned. Clearly, Lindy had skinned him in the divorce. She’d taken all of the good furniture, whatever had been hanging on the walls. There wasn’t anything in the kitchen cupboards but lint and the groceries I’d brought. I was surprised she let Sam stay in the house.</p><p>I didn’t have the luxury of sympathizing with Sam. Maybe it was selfish, but I wasn’t in a very stable position myself. I’d cleared out my checking account to put down the rent on this place. I had a healthy savings account, but it was earmarked for my new apartment. And I didn’t know whether I had a job to return to after my “sabbatical.” My contract with Coda was performance-based. I got a share in the business, but the owners didn’t have to keep using me in the kitchen if I was unable to fulfill their expectations. If I didn’t have a regular paycheck, I would need every penny when I got back to the city.</p><p>I didn’t have the available cash to travel somewhere else. I couldn’t go home. I lived right around the corner from Coda. The temptation to go back to check on my kitchen would be too great. I could stay with Chef Gamling and George, I supposed. But it would prick my pride. It was bad enough that Chef felt he had to nurse me back to health like some emotionally stunted kitten. Plus, Chef’s house didn’t even have a guest room. The second bedroom had been converted into Chef’s painting studio. I would be reduced to a couch surfer. A big pathetic couch-surfing loser who talked to vegetables.</p><p>Still, I wouldn’t stay in a house with a strange man, much less a man who saw me as his favorite food group.</p><p>I didn’t want to leave the house. Hell, if I had the money for a vacation home in the sticks, I would buy the place. I liked the weird nooks and crannies in the design. I liked the quiet and the way the light came through the kitchen windows in the morning. I could sleep there, and I couldn’t seem to sleep anywhere. I wasn’t going to give that up. I needed the Lassiter place to get better. If Sam was going to get in the way of that, he would have to go.</p><p>Blinded by the Brine</p> <p>3</p><p>My new landlord did not appreciate my predawn call.</p><p>“Is there a problem with the house?” Lindy asked, all guilelessness and concern.</p><p>I huffed out an irritated sigh. She was honestly going to make me say it. She was going to plead ignorance, just in case I was calling about a leak in the roof or a plumbing problem.</p><p>“Yes, you didn’t make it clear in the rental ad that the house came with a fully furnished vampire lair in the basement,” I snapped.</p><p>“Oh, that.”</p><p>“Yes, that. Your vampire ex-husband is sleeping in the basement. That would be pertinent information to give a prospective tenant, I think, before renting out the house.”</p><p>“Look, this really isn’t my problem, Tess.”</p> <p>“You rented me a house that someone was already living in!”</p><p>She yawned. “Technically, no one is living there.”</p><p>“Don’t you argue semantics with me. You either get your vampire ex out of here, or you refund my money.”</p><p>“You’ll find I don’t have to do either. You signed the paperwork. The house is livable. Besides, I don’t have your money anymore.”</p><p>It was all downhill from there. Lindy said the house was my problem now and told me I had to deal with it. I told her to do a lot of things, most of which were not anatomically possible. She called the cops and reported me for harassment.</p><p>It turned out that there was very little that local law enforcement could do to help me resolve my dispute with Lindy. Until the divorce was final, Lindy was technically entitled to rent out the space as she chose, according to Half-Moon Hollow Police Sergeant Russell Lane, although he said it in a tone that gave me the distinct impression that he was guessing. The good news was that as far as the police were concerned, I hadn’t violated my rental agreement. I hadn’t actually threatened Lindy, just annoyed her. So she couldn’t force me to leave just because she was upset with me.</p><p>“Don’t I have the right to a house without undead occupants?” I’d asked Sergeant Lane.</p><p>He shrugged. “You are free to take her to small-claims court.”</p><p>Considering that the case would likely be called months after I returned to Chicago, I decided against that. I also passed on Lane’s suggestion that I could move into a motel in town if I was so uncomfortable with Sam’s presence in the house. I saw a few of those establishments on my first drive through town. Unless I was an out-of-state fisherman or an adulterer, I didn’t think I would be comfortable at the Lucky Clover Motel.</p><p>Given the choice between sticky sheets and bedbugs versus a vampire, I would take my chances with the vampire.</p><p>My day did not get better. Despite my extreme fatigue, I couldn’t get any rest. I tossed and turned, but I was too keyed up from my visit from the fuzz. There was this weird gnawing sensation under my breastbone that kept me from relaxing.</p><p>How had I become so uncomfortable in my own skin? I used to be such a physical person. When I was in school, everything seemed easy. When I was hungry, I ate. If my body felt too soft, I exercised. And the sex. Everything you’ve heard about the stove being a hotbed for sexual tension is completely true.</p><p>But when you reach a certain level of success in the kitchen, everything becomes so competitive—who gets the best reviews, who gets their photos taken with celebrity diners, who gets guest spots on the Food Network. Because of my schedule, I rarely spent time with nonculinary “civilians.” I couldn’t date other chefs, because they became insecure if they felt they were the “beta” in the relationship. Even Phillip, whose image and income depended on my success, seemed uncomfortable with the idea of a girlfriend who was “high-profile.” He wanted to conduct the front of house like a maestro with his orchestra, not answer diners’ questions about his girlfriend. No wonder he’d gone back to the dental hygienist. No one wanted to discuss flossing in detail.</p><p>So for months, there had been no sleep and no sex. Clearly, I was lucky I hadn’t taken out bystanders in my vegetable-based breakdown.</p><p>I stretched. I popped a few antacids. I opened my laptop, checked my e-mail, and was shocked to find a dozen or so messages from restaurant owners around Chicago. Most of them were the standard “get well soon” messages one would expect from a colleague, even a competitor. But others seemed to be fishing for information. Was I leaving Coda? Was I really having health problems, or had the gossip mill blown that out of proportion? What were my immediate plans when I got back into town? There were a few subtle hints—that if my sudden decline was simply an excuse to get away from newly engaged Phillip, that several establishments would be more than willing to hire me.</p><p>The fact that I didn’t immediately delete the e-mail was a bit shocking. For years, I’d devoted every waking hour to Coda. Could I really leave the restaurant? I would have to move. It would be too awkward, living so close to the restaurant. If I was going to do this, I wanted a fresh start. I would need a new apartment—maybe I’d even indulge in something with a view of the Chicago skyline that didn’t involve the guy across the street practicing nude yoga in front of an open window.</p><p>Before I’d left, the owners at Coda had made it clear that if I wanted to sell out, they would be happy to reclaim stakes in their business from a potentially crazy woman. They’d only offered the small share I held to appease me. If I sold out, I might have enough to put the down payment on a modest townhouse in a semisafe neighborhood.</p><p>I would check the apartments across the street for nude yoga enthusiasts before I moved in.</p><p>—</p><p>That night, I sat at the kitchen counter with some jasmine tea and waited, feeling like a teenager on her first job interview.</p><p>I tried to focus on the positive steps I’d taken that day—unpacking, finding a store that sold Amish breads and sweets, buying a very large lock for my bedroom door at the hardware store. Lindy would just have to deal with the fact that her master bedroom now had a brand-new mental-hospital-quality deadbolt.</p><p>But I was about to have a potentially unpleasant conversation with my new vampire roommate, and I just couldn’t seem to shake the feeling that it was going to end badly—or bloodily—for me.</p><p>The sun dropped behind the horizon, leaving the kitchen purpled and shadowed. Just as I flipped the light switch, I could hear footsteps lumbering up the basement stairs. I took a deep breath, willing myself to be calm, cool, civil.</p><p>At the very least, I would not threaten him with Asian cookware.</p><p>Sam stepped through the basement door, just as tall and broody as I remembered. Pulling a faded blue T-shirt over some pale but nicely defined abs, he started at the sight of a human sitting at his counter. He frowned, shifting the donor bag of blood between his hands. “Oh, you’re still here.”</p><p>“All of the awkwardness of a one-night stand without any of the fun,” I said, trying desperately to look anywhere but at the half-buttoned jeans. It didn’t work. It was as if there were some sort of vision magnet embedded in the little metal rivets. Don’t look, Tess. Don’t loo—</p><p>Damn it. I looked. And he caught me.</p><p>Sam smirked, a devilish little dimple winking out at me as he crossed to the microwave and heated a mugful of synthetic blood. With his jeans still undone. At this point, I was pretty sure he was refusing to button them, just to mess with me. So I stared at the wall and forged ahead.</p><p>“Remember that impasse we discussed? Well, I had a conversation with your ex this morning... and the police. And it would appear that Lindy doesn’t have to repay my money, but she can’t force me out, either. So I’m here to stay.”</p><p>“Why don’t you just go back home? There’s nothing for you here.”</p><p>“Because I’m supposed to be ‘recuperating.’ If I go back to Chicago, I will end up somewhere I don’t need to be.”</p><p>He turned his head sharply, glaring at me. “Hold on, are you a drug addict?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The flinty tone of Sam’s voice, the command, set my nerves on edge. Chef Gamling was the only one allowed to use that tone with me. I took a deep breath, forcing myself to exhale slowly.</p><p>“I am not a drug addict,” I said through clenched teeth. “I’m a workaholic. You probably figured out from all of the kitchen equipment that I’m a chef. I had a bit of a setback at my restaurant, and my boss put me on leave. If I go back before I’m supposed to, my manager-slash-ex will probably fire me. I’ll be humiliated, again, and probably won’t be able to find work. My point is, I’m not leaving. Can’t you just go stay with one of your vampire friends for a while?”</p><p>Sam scowled. “I haven’t been a vampire long enough to have a ‘crash pad’ in the undead community. And my wife got all my living friends in the divorce.”</p> <p>“Well, I’m sorry that your being antisocial has worked against you. But I am not going to share a house with you. And that’s not because you’re a vampire. It’s because you’re a strange male vampire, who could be a tutu-wearing serial killer for all I know.”</p><p>His dark brows drew together as he shook off that visual. “I guess one of us is just going to have to leave.”</p><p>“Yeah, I guess one of us is,” I shot back. “In case you missed it, ‘one of us’ translates to the one not freeloading.’”</p><p>“Freeloading?”</p><p>“I’m paying my way here. You have no job that I’m aware of. You have no decent aboveground furniture. You’re riding out the time left on a divorce settlement before Lindy puts this place on the market.”</p> <p>I should not have said that. Even before the words came out of my mouth, I knew I shouldn’t have called him out on his broken marriage. Why didn’t I just go drop-kick a baby polar bear and then poke its mama with a stick?</p><p>He muttered something along the lines of “She’s that sure I won’t get the money, is she?”</p><p>Given the sharp expression in Sam’s dark eyes, I had no choice but to backtrack. “Look, I’m really sorry about your marital issues, but it doesn’t change the fact that I’m staying. I’ve paid to stay the month, so I’m not going anywhere.”</p><p>“You may be paying your way, but that doesn’t make this your home,” he hissed, gripping the counter with those strong white hands. “You can pack up and leave anytime. And trust me, I’m going to do everything I can to try to make that time come sooner than you expect.”</p><p>“Are you threatening me?” I asked, a sly grin spreading across my face as I looked up at him. I couldn’t help it. I couldn’t think of the last time a man challenged me like this. For the first time in a long time, I felt a frisson of... something there were no clean words for. “I bet you I can make you run screaming from this house like something out of The Amityville Horror.”</p><p>“You sound awfully confident for a mortal without superpowers.” He growled, leaning ever so slightly closer. His nostrils flared as if he was taking in my scent. “You won’t make me move an inch.”</p> <p>I showed off my own teeth in a sharp, wicked smile. “You will run screaming into broad daylight like a little, tiny girl.”</p><p>“First one to fold leaves for good?” he asked, licking his lips.</p><p>“Agreed.”</p><p>Sam offered his hand to shake on the deal. “Bring it on, cupcake.”</p><p>I smirked, grasping his cool hand tightly. The slight wince he gave showed he didn’t expect me to have much of a grip. “Sweetie, you’re already standing in the middle of it, and you’re too dumb to see it.”</p><p>One Epiphany, Hold the Pimento Cheese</p><p>4</p><p>The next twenty-four hours were tense, the long, silent wait for the first shot in a battle.</p> <p>Sam’s first efforts at “pranking” me were the stuff of summer camps and middle school sleepovers. While I was asleep, he sneaked into the bathroom and Saran Wrapped the toilet. He also switched all of the staples in the kitchen. There was salt in the sugar canister, baking soda in the can of baking powder, that sort of thing. It might have confused someone who hadn’t taken professional baking courses.</p><p>After visiting an establishment called Bubba’s Beer and Bait, I responded by drilling a little hole in the basement door and gently coaxing two containers of live crickets through a funnel and onto the basement steps. I corked the hole and wedged a towel into the crack under the door so they couldn’t escape. The best part was that Sam would never find all of them. They would crawl under his bed and into corners, and he would drive himself nuts trying to find the source of their annoying little cheeps.</p><p>I was careful to lock myself in my room by sundown that night, just so I could listen to his irritated yelps as he woke up to hundreds of chirping bunkmates. The combination was downright musical.</p><p>I was having fun. For the first time in a long time, I felt challenged by a man, and not just in a “You can’t tell me what to do!” rebelling-against-Daddy sort of way. Sam was playing with me, sometimes in a mean-spirited, irritating fashion, but he was devoting a lot of time and effort to keeping me entertained. And that made me like him just the tiniest bit.</p><p>But then the sawing started. Nights at the house went from blissfully quiet to my own personal construction zone. Sawing, hammering, drilling, and some sound I could only identify as a cat getting stuck in a dishwasher. I never knew when it was going to start. And some nights, I would sit up until the wee hours of the morning, waiting for it, only to be treated to a quick fifteen minutes of audio torture before dawn.</p><p>I would wake up every morning, unlock my bedroom, and find some project half-completed that made my life more difficult. The tub was left stripped and half-caulked, meaning that I couldn’t bathe without doing permanent damage to the surrounding drywall. The hardwood floors in the hallway were refinished, meaning that if I wanted to leave my room, I had to choose between climbing out the windows or walking across the fresh sealant and ruining his work. He knew I liked the house too much to want to hurt it. Damn him.</p><p>One morning, I found that he’d removed all of the knobs from the house. All of the knobs. The faucets, the doorknobs, the drawer pulls for the bathroom vanity, the stove and oven knobs, and the volume knob for the TV. Yes, I was shocked that Sam’s TV had a volume knob. Let’s just say that Lindy didn’t leave him HDTV-ready.</p><p>I launched a reciprocal offensive. I roasted a turkey and placed an oscillating fan so that it blew the delicious Thanksgiving fragrance toward the basement door. I baked fragrant cinnamon rolls and lasagnas redolent with garlic and herbs. This gastronomical warfare worked on two fronts, physical and emotional. One, human food smelled spoiled and rancid to vampires. They lacked the enzymes to process solids, so exposure to most “regular” food resulted in projectile vomiting. And two, Sam would be reminded of all of the things he missed about eating as a human and—in my mind—would wind up weeping in a little pile of soggy vampire on the kitchen floor.</p><p>It seemed to be having some effect on him. Every few days, I would find a cheap discount-store saucepan in the kitchen sink, burned black and coated with some unidentifiable oily substance. Was he trying to retaliate?</p><p>I supposed I went too far when I made my special peanut-butter-cup brownies and left them under a glass dome on the counter. I even left a little card next to the display that read, “Enjoy!” The next day, I woke up to find that he’d shut off the gas connection to the stove, rendering it unusable. Clearly, he didn’t expect me to know how to fix that.</p><p>Amateur.</p><p>While the pranks kept my mind active and distracted from the potential disasters looming when I returned to Chicago, the sleep deprivation from the constant power-tooling was taking a physical toll. I was getting even less rest than when I was living at home. I took naps in the afternoons, just to keep alert during Sam’s active hours.</p><p>My routine was changing—again—and I was feeling it. What little progress I’d made health-wise took a distinct slide in the opposite direction. Chef was pleased to see that I was keeping the weight I’d gained from forced helpings of dumplings and milkshakes, but he tsked over the reemergence of dark circles under my eyes. I’d looked forward to jogging on some of the green-canopied country roads that surrounded the house, but I didn’t have the energy. I became snappish and grumpy, even with Chef, earning me a ten-pound bag of potatoes to peel.</p><p>After I’d reconnected the stove’s innards, I went back to bed and tried to think calm, happy thoughts. I needed to sleep if I was going to come up with an appropriate and painful rebuttal to this abuse of my domain. Striking at my stove was a new low for Sam. How would he like it if I went into his basement and melted down all of his precious tools?</p><p>Hmmmm.</p><p>“Oh, come on, Tess, where are you going to get a smelter?” I said to myself, sighing and rubbing at the persistent ache in my middle. Perplexed, I sat up in my sad, lumpy bed and realized I was hungry. Not just a little peckish. I was seriously, feeling-my-belly-button-rub-against-my-spine starving. I hadn’t been this hungry in years, certainly not this early in the morning. I was usually just hungry enough to need a snack by the end of a dinner shift, meaning a lot of midnight carbs. I usually skipped breakfast in favor of running five miles to make up for the late-night eating.</p><p>I thought back to the last time I’d actually made breakfast for myself and couldn’t remember what I’d eaten. And now that I was hungry, what did I want? Waffles? Frittata? Crepes?</p><p>Those things were all well and good, but what I really wanted was Lucky Charms. I hadn’t had sugary cereals since culinary school, when I’d regularly carried those mini-single-serving boxes around for snacking between classes. My pastry instructor found a box of Sugar Smacks sticking out of my purse in class one day and embarrassed me so thoroughly for my “toddler palate” that I’d lost my taste for them. But now I wanted a bowl of marshmallowy, sugar-coated goodness—badly. But what I had was fancy cheeses, eggs, and brioche.</p><p>So, instead of Lucky Charms, I had a spinach and feta omelet.</p><p>This just wouldn’t do.</p><p>—</p><p>On my safari into the Shop ’n Save, I grabbed my Lucky Charms, and some Cap’n Crunch for good measure. I bought Oreos, Pop-Tarts, and the makings of Fluffernutter sandwiches—things I’d loved as a kid but had abandoned for the sake of refining my palate. After recovering from the shock of how little I’d spent at the register, I tucked the grocery bags underneath the front seat of my car and cast a longing glance down the quaint little street. It was one of those old-fashioned Main Street arrangements, skinny two-story buildings all bunched up against one another—a hardware store, an antiques store, one of those old-fashioned ice cream parlors, and a sandwich shop called the Three Little Pigs. The cars lining the parking lots were older but well maintained, and the people milling around did it pretty slowly. This was not the place for the Hollow’s young and hip to do their errands.</p><p>Did the Hollow have a young and hip crowd?</p><p>I didn’t want to go home just yet. So I walked. I window-shopped at the antiques store and browsed the selections at the ice cream parlor for later reference.</p><p>I walked past the Three Little Pigs, a snug little brick building with a ridiculously charming cartoon sign. Catching sight of a patron chowing down on a triple-decker ham sandwich through the front window, I seemed to be moving over the threshold before I could stop myself. I was just in time for a late lunch, and I was hoping that whatever I ordered incorporated cheese fries in some way. I hadn’t had cheese fries in years.</p><p>The interior was done in dark panels and black-and-white hunting photos, presumably of the owner’s family. The menu was scrawled on a chalkboard in bright colors. The smell was incredible, so many layers of scent—fresh bread, frying bacon, melting cheese. I had to catch myself to keep from drooling all over the floor. This might be even better than Lucky Charms. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With an emphasis on carnivorous delights, the Three Little Pigs seemed to be primarily a sandwich shop. If it once had a pulse, it could be grilled, fried, braised, or roasted, then slapped between two slices of bread and delivered to your table. I was trying to decide between the house specialty—pork chop on wheat, topped with grilled ham and bacon—or starting off small with a turkey club, when a dill pickle flew over the opposite side of my booth and smacked me square in the eye.</p><p>“Sonofa—” I yelped, turning to see the adorable strawberry blond toddler who had blinded me with dill brine. “Gun,” I finished lamely.</p><p>“I’m so sorry!” a beautiful auburn-haired woman gushed, stepping around the booth and handing me a napkin to dab at my stinging, stinky eye. Her tinny country twang contrasted sharply with the fierce elegance of her face, but I doubted the sandy-haired man sitting with her minded all that much. “We’re still workin’ on hand-eye coordination and table manners. Trust me, they normally don’t waste a bite.”</p> <p>“That really stings,” I marveled as she hovered.</p><p>“I know, it’s the vinegar,” she said, clucking her tongue and offering more napkins. “I’m so sorry.”</p><p>I snorted a little. “That’s OK. ‘Blinded by flying pickles’ goes nicely with the rest of my week.”</p><p>“I’m Jolene Lavelle, and this is my husband, Zeb.” She gestured to the sandy-haired man, who was currently scrubbing barbecue sauce from the boy twin’s face. “And these are our twins, Janelyn and Joe.”</p><p>“Nice to meet you,” I said, swiping at my eye one last time. “Tess Maitland.”</p> <p>“You new in town?” Jolene drawled.</p><p>“Yeah, how can you tell?”</p><p>“The accent. You don’t have one.”</p><p>I chuckled. “I’m from Chicago. I’m just visiting the area for a while.”</p><p>“And you’re not having a very good time?” Zeb asked, his big brown doe eyes sympathetic. “You said a pickle to the eye went with the rest of your week. That can’t be a good vacation.”</p><p>“Come on over here, honey, and tell us all about it,” Jolene said, dragging me out of my booth. Geez, this girl was crazy strong for someone so slight. As she pushed me into the seat opposite Joe the pickle flinger, she yelled for someone named Maybelline to bring her a “tall blue.”</p> <p>I really hoped that was some sort of home-brewed moonshine, because I could have used a drink right about then.</p><p>Imagine my surprise when a tall blue turned out to be a large blue glass bottle of homemade root beer, which Jolene swore would cheer me right up. It was tasty, with strong undertones of sassafras and ginger. The lack of carbonation was a little weird, but it settled my stomach almost instantly, and the lift in blood sugar helped my outlook considerably.</p><p>Jolene took the kids behind the counter and handed them off to two equally pretty waitresses, who bore a strong resemblance to my new friend. The ladies bobbed the babies on their hips and fed them bits of smoked sausage, which could not possibly be good for them. Then again, those kids seemed to have a lot of teeth.</p><p>Jolene snapped me out of my thoughts by sliding onto the bench seat next to me. “OK, now you have my full attention. Let’s hear it.” I lifted my eyebrows at her commanding tone. “Oh, come on, you look like your head’s about to pop off. You’re dyin’ to talk to someone. Now, spill.”</p><p>I looked to Zeb, who smiled at his wife fondly. “It’s best to just do what she asks. She’ll get it out of you somehow.”</p><p>I sighed. “It’s just, this house I’m renting, I have an ‘unexpected’ roommate. I would feel sorry for him, but he’s kind of rude and prickly. And I can’t get rid of him because I don’t have superstrength.”</p><p>On and on, I rambled about the house, which I loved, and Lindy, whom I didn’t have any fond feelings for, about Sam and Phillip and talking arugula, until I finished with “My professional reputation is in shreds. I haven’t had sex in six months, and I’m starting to think that after a certain period of disuse, everything grows over down there. Plus, I don’t know if I have a job or health insurance to go back to, so how am I going to afford the reconstructive hooha surgery?”</p><p>“Wow,” Jolene marveled. “That was an impressive rant.” She shot a look to her husband. “That was a Jane rant.”</p> <p>Zeb grinned and shrugged, as if answering some unspoken question from his wife. There was a nonverbal coziness to their communication that made my chest ache a bit. I’d never had that kind of intimacy with any of my boyfriends.</p><p>“It’s all going to be just fine, Tess. You’ll see. You just relax now, while I get us a little lunch.”</p><p>Jolene returned to the table with two trays piled high with all sorts of foods that I didn’t recognize—colorful casseroles and fried mystery items and ribs.</p><p>“There’s no way the three of us could eat all this!” I cried, rising to help her heft the trays. “Please let me know what the check total is, so I can cover my share.”</p><p>“Pay?” Zeb scoffed. “McClaines eat free at the Three Little Pigs. Otherwise, we wouldn’t get access to Aunt Lulu’s special seven-layer salad. She doesn’t give that to just anybody.”</p><p>Without responding, I poked at the mayonnaise-covered bowl skeptically. “Why don’t I see any green vegetables in that salad?”</p><p>“Surrounded by beautiful smartasses, that’s my lot in life.” Zeb sighed, lifting his eyes to the ceiling.</p><p>“Everything you see here was made by my family, except for the pulled pork and the ribs,” Jolene said, unloading her culinary treasures with a practiced hand. “It’s on special, provided by the Volunteer Fire Department. They’re hosting a barbecue booth at Burley Days, and they needed the practice. My uncles don’t handle barbecue very well, which is why they don’t usually serve it here. Something about the smokers and fire—they get all wound up bein’ manly men and end up overcookin’ the meat.”</p><p>“Outdoor cooking has been known to do that. So, seven-layer salad?” I said, lifting a brow and staring at some well-disguised romaine lettuce that seemed to be topped with mayonnaise and bacon.</p><p>Jolene shook her head in a maternal fashion. “Hold on, sweetie, we have to start you out slow. We’ll work you up to seven-layer salad. You’re new to this whole Southern comfort food thing, and I don’t want you to get sick off your first try.”</p><p>I scanned the table to try to find something I recognized. “How is it that I grew up just a few hundred miles from here and I’ve never heard of these dishes?”</p><p>“We have a recipe-hoarding border patrol at the Illinois state line,” Jolene deadpanned.</p><p>“We can’t possibly eat all of this.”</p><p>“Just watch,” Zeb muttered. “Jolene will mow through this in no time flat.”</p><p>I wondered at the crack on Jolene’s eating habits, particularly from Zeb, since she didn’t have a spare ounce on her and she’d recently given birth to his twins. But there was no malice in expression or tone. It was fond, as if he was just waiting for the word to run and get another tray full of food. The silly, love-struck look on his face made my heart ache a little.</p><p>Jolene began systematically loading my plate with little scoops of every dish. I sampled a few familiar things—potato salad, corn casserole, three-bean salad. But when I got to the orangey-yellow substance that sort of resembled scrambled eggs with little red bits, I poked it with my fork. “I’m sorry. But what the hell is this?”</p><p>“Homemade pimento cheese,” Jolene said. I took a little bite. “Velveeta, pimentos, and mayonnaise. Oh, and bacon. It’s Aunt Vonnie’s recipe.”</p><p>I swallowed, then took a huge gulp of water to wash down the gelatinous mass of funk. “Is Aunt Vonnie here?” I asked. And when they shook their heads, I shuddered, wiping at my mouth with my napkin. “Why? Oh, my God, why would anyone do that to an innocent processed food product?”</p><p>“I believe that pimento cheese was invented as a practical joke by two mean old church ladies, but they died before they could get their laugh in,” Zeb told me. “We are left with their legacy of mean-spirited hospitality.”</p><p>“I’m going for the seven-layer salad,” I told Jolene, aiming my fork for the bowl of lettuce, peas, bacon, shredded cheese, and purple onions, covered in a dressing consisting of mayonnaise, parmesan cheese, and sugar.</p><p>“Don’t say I didn’t warn you,” she retorted as I forked a healthy sample into my mouth.</p><p>Seven-layer salad was freaking amazing. Simple, fresh, and green, with a series of flavors tumbling against my tongue like dominoes. “This should not be as good as it is,” I told her, taking another huge bite.</p><p>“It’s the great mystery of Southern cuisine,” Jolene intoned.</p><p>“And what’s that?” I asked, stabbing through a cornflake crust to find a bubbling mixture of cheese and potatoes.</p><p>“Hash-brown casserole—hash browns, cream of mushroom soup, cheddar cheese, and a couple of other things.”</p><p>I put a scoop into my mouth. It was everything that was good about comfort food, warm and cheesy and gooey and savory. I tucked more into my mouth, moaning indecently.</p><p>“Would you two like to be alone?” Zeb asked, eyeing the casserole.</p><p>“I think so,” I said, sighing happily as I swallowed another bite.</p><p>“Easy, girl.” Jolene chortled. “Pulling the full Meg Ryan is not a good way to introduce yourself to Half-Moon Hollow society.”</p><p>“I’ll try to contain myself,” I promised.</p><p>This was what food was supposed to be. This was satisfying, filling, comforting. Food was supposed to feed you, body and soul. It was so simple that I felt stupid for not seeing it sooner. Pink Himalayan sea salt? Was just freaking salt. Black truffles? Stinky mushrooms, and I really never liked the taste of them anyway. Smoked extra-virgin olive oil? Well, that was pretty awesome. I couldn’t really give that up.</p><p>Food could be simple. Food could be anything you wanted, whether the ingredients came from a farmer’s market or a convenience store. Food could be fan-freaking-tastic.</p><p>I shook my head, as if to clear it, and took another bite of cheesy potatoes. Maybe Jolene had slipped some sort of hallucinogen into my portion.</p><p>I didn’t care all that much.</p><p>Zeb unwrapped a steaming aluminum-foil packet the size of a basketball. “Now, this is pulled pork shoulder. We’re going to give it to you straight, no sauce, at first, because I figure you’d appreciate it by itself. But there are three levels of sauce here in these little cups. Mild, which is basically ketchup, the sort of thing we give to the kids. Hot, which is more of a Tabasco-sauce level of heat. And nuclear, which I do not recommend, even if you enjoy spicy food. There are some intestinal consequences that cannot be undone.”</p><p>“Ew!” Jolene squealed. “Zeb!”</p><p>“She ate pimento cheese in public. Her threshold for gross is pretty high,” he said, shrugging.</p><p>“He has a point,” I conceded, placing a small bite of the pink-gray smoked meat on my tongue. I gripped the picnic table for support as a shudder of pleasure rippled up from my throat. Everything that was good about meat was currently in my mouth.</p><p>I sincerely hoped I hadn’t just said that out loud.</p><p>“How have I never had barbecue like this before?” I demanded, forking more meat onto my plate. I could taste garlic, white pepper, paprika, the smoky essence of cumin. My mind immediately began scanning my internal wine list to select which vintage would offset the tangy hickory flavor. “I thought barbecue was supposed to be all gloppy sauce and burned ends. But this is like a meat marshmallow, slightly caramelized on the outside, and bursting with soft, moist flavor inside. This is—” I paused to lick my fingers. “How do they do this? What temperature do they use? For how long? Are they just using hickory, or do I detect a note of applewood, too? The smoker, is it aluminum or cast-iron?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Because she had no answers for me, Jolene simply led me over to the booth where most of the Half-Moon Hollow Volunteer Fire Department was having lunch and introduced me to the cooks, Anna and Joe Bob. They were more than happy to discuss the ins and outs of the smokers, the hickory wood used to smoke and flavor the meat as it cooked, and the base for the sauces. Joe Bob promised to show me which cuts of pork shoulder worked best and how to keep the ribs from drying out before they cooked completely.</p><p>“We’re firing up another batch at dawn if you wanna come by,” Anna offered cheerfully, her round, cherubic cheeks smudged with soot from the smoker. “You could see the whole shebang from start to finish.”</p><p>“I would love to!” I exclaimed, clapping and hopping up and down like a cranked-up game-show contestant.</p> <p>“Are you going to keep doing that?” she asked, lifting her eyebrow.</p><p>I bit my lip and stopped with the hopping. “No.”</p><p>“We’ll get along just fine, then.”</p><p>Now, That’s a Spicy Vampire!</p><p>5</p> <p>It was a matter of timing. Sam never left the basement door unlocked while he was awake. So in the window of time between his warming up his “wake-up” blood and showering, I managed to slip into the basement to do my dirty work and ducked out the front door before he saw me.</p><p>Jolene had invited me to join her book club for the evening, despite the fact that I hadn’t read The Night Circus. I’d expected a bunch of frustrated housewives slugging back wine in some well-appointed suburban living room. And while there was wine, the group was made up of open, friendly gals who met at a funky little bookshop called Specialty Books.</p><p>The interior of the shop was a cheerful mix of paperback pop culture and antique tomes. The walls were painted a cheerful midnight blue, with a sprinkle of twinkling silver stars. There were comfy purple chairs and café tables arranged around the room in little conversation groups. The leaded-glass and maple cabinet that held the cash register displayed a collection of ritual knives and candles that I didn’t quite understand. I was OK with not understanding.</p><p>The store had an impressive selection of cookbooks, everything from Introducing Variety to the Undead Diet to Food Gifts for Faerie Folk. I found a deeply discounted title on drinkable sauces for vampires, but Jane, the shopkeeper and book club organizer, warned me against it. It turned out the recently turned French chef–author had not bothered to test his recipes, and his use of eggs, flour, and purees had made several hapless vampire customers quite ill. Jane only kept the book on the shelves because it was something of a cookbook cautionary tale.</p><p>Jane was a vampire, as were her manager, Andrea, and several members of the club. At first, I worried that it was a setup, that Sam had somehow managed to round up some of his undead friends to strong-arm me out of town. But then Jane referred to me as Jolene’s “pocket-sized new friend,” and I figured that was more humor than one usually found in a paid assailant.</p><p>Jane and Andrea were funny, smart, and snarky as hell, having both been turned in the last five years and having a more human perspective than most vampires. Although they were obviously close, the ladies were polar opposites on the vampire fashion spectrum. Titian-haired Andrea was polished and perfect in a peach sweater set and pearls, while tousled brunette Jane was wearing jeans over her impossibly long legs and a T-shirt touting “Dick Cheney for President—2012.” When I asked her about it, she grumbled that she’d lost a bet with Andrea’s husband.</p> <p>After paying lip service to the book of the month, the women broke up into smaller “discussion groups,” and I learned all about Jane’s sordid history in the vampire community, including the fact that she’d been turned after a local drunk mistook her for a deer and shot her. A vampire, Gabriel, to whom Jane was now married, saved her by turning her, and they lived happily ever after. Sort of.</p><p>“Isn’t that an unusual way to be turned?” I asked, sipping the surprisingly tasty latte Andrea had prepared for me. “I mean, you’d think you guys would make it into the news more often if ‘mistaken for a deer and shot’ was the average vampire experience.”</p><p>“Yes, Jane is very unusual,” Andrea said, rolling her eyes. “But she was given a choice about whether she wanted to be turned, which is the norm nowadays. Despite the fact that it’s illegal to turn a human into a vampire against their will, some of us weren’t afforded that luxury. But we make the best of it.”</p><p>I noticed the slightly pained expression on Jane’s face as she gave Andrea’s shoulder a little squeeze. I got the feeling there were details about Andrea’s transition that I was missing, but it would be rude to ask. Andrea shrugged and handed Jane what looked like a mochaccino.</p><p>“Wait a minute,” I said. “I thought you guys couldn’t eat human food.”</p><p>“We don’t. But Andrea and I have been experimenting for years with all those fancy coffees that folks can’t seem to live without, trying to find ways to make them more palatable for vampires.”</p><p>“Interesting!” I exclaimed. “Would you mind if I asked you about your techniques?”</p><p>“Tess is a chef,” Jolene said proudly. “In one of those big-city restaurants where the paparazzi lie in wait for celebrities.”</p> <p>“Jolene made friends with a chef, color me shocked,” Andrea said, smirking and shaking her head.</p><p>Again with the cracks about Jolene’s eating? Had Jolene recently lost a bunch of weight? She’d eaten a pretty hefty lunch at the Three Little Pigs, so she wasn’t dieting. Either way, it was sort of shitty for her friend to poke fun at her.</p><p>I was about to jump to her defense when Jane piped up in a desperate tone, “So, Tess, I’m always interested in how people ended up in their professions. Why did you start cooking?”</p><p>“I’m good at it,” I said, shrugging.</p><p>Jane didn’t seem satisfied with this and leaned a bit closer, staring into my eyes as if there were secret messages written on my corneas. “But you didn’t know that until you started. And that’s what I was asking, how did you start cooking?”</p><p>A bit rattled by Jane’s gaze and feeling very much like a lobster over a pot of boiling water, I blurted out, “Cooking made sense, even when I was a kid. You put eggs, milk, and cinnamon on bread, you got French toast. As long as I followed the rules, I knew what the outcome would be. It was one of the few areas of my life that was predictable. And most of the time, if my parents were eating something I made, their mouths were too full to bicker. It was quite the incentive.”</p><p>My mouth snapped shut like a steel trap. I stirred my cappuccino, shocked that I’d said so much. I rarely talked about my parents, even with Chef. Hell, in those two sessions of therapy I’d attended, I hadn’t said more than, “My parents were well-intentioned but selfish people who would probably be making each other—and me by extension—miserable today if they hadn’t died.”</p><p>“Do you mind if I ask why you’re so curious about vampires?” Jane asked, sensing somehow that I needed a change in topics. “Jolene said you would probably have some questions for us.”</p><p>I cleared my throat, commanding my brain to produce more polite conversation. “Oh, I live with one. Not quite voluntarily.”</p><p>“Anyone we know?” Andrea asked.</p><p>“Sam Clemson,” I said.</p><p>Andrea and Jane both tilted their heads and gave me the “aw” face. “Poor Sam.” Jane sighed.</p><p>“Why ‘poor Sam’?” I asked. “I mean, other than he’s married to a ring-tailed bitch.”</p><p>Silence. My comment was met with complete, stone-faced silence. I bit my lip, afraid that I’d offended my new acquaintances. But then Jane burst out laughing and exclaimed, “Thank you!” while Andrea rolled her eyes.</p><p>Andrea said, “Lindy’s not that bad.”</p><p>“She tricked Tess into renting her house without telling her Sam was sleeping in the basement,” Jolene informed her.</p><p>“Oh, then she’s an evil she-beast,” Andrea conceded. I chuckled, and she shrugged. “My opinions are very adaptable. They have to be when you’re married to a vampire named Dick Cheney.”</p><p>Jane’s T-shirt made much more sense now.</p><p>“I actually meant ‘poor Sam,’ as in he was one of the vampires we were talking about, the ones who don’t get a choice about whether they were turned or not,” Jane said. “You know Sam was a contractor, right?”</p><p>I shook my head. “Actually, I don’t know anything beyond Sam’s the cranky guy who lives in my basement.”</p><p>“Sam was pretty well known around here for being a trustworthy guy,” Jolene said. “He did quality work at a fair price, and you didn’t have to worry about him raiding your jewelry box while you were out. We hired him to finish up our house after some, uh, other companies failed to do the work they’d been paid for.”</p><p>Jane smirked but didn’t elaborate. “Sam and Lindy moved here about six months before Sam took a job for an old-school vampire who’d just moved into the area. The vampire—his name was Hans something—asked for a light-proof sleeping compartment to be added to his bedroom closet. When Sam finished it, the vampire decided he didn’t want a human knowing where his evil lair was and drained him.”</p><p>“I thought it was illegal to forcibly turn a human.”</p><p>“Technically, he didn’t turn him. Hans just drained him until it would be impossible for Sam to survive and dumped him in the woods behind his house to let nature take its course. Fortunately, Hans was already under surveillance for some suspicious feeding activity over in Murphy. When the head of the local Council, Ophelia, saw him tossing Sam’s body, she stepped in and had one of her Council goons turn him. Ophelia would do just about anything to avoid scandal for the vampire community. Draining innocent human temp workers would qualify as a PR disaster.”</p><p>“Of course, Lindy pitched a fit, told everybody in town that Sam had gone off the deep end, had an early midlife crisis, fooled around with some vamp-tramp, and got himself ‘infected,’” Jolene said. “Oh, and because of the physical trauma he’d been through, it took Sam nearly five days to transform into a vampire, which is practically unheard of. The Council admitted that it was possible that Sam might not make it through the transformation to vampire, and Lindy managed to get some judge to declare him too dead and/or incompetent to handle his own affairs, which was a legal first. There was no will, and Lindy got everything. She controls every bit of their money until the divorce goes through. Sam gets an allowance for his blood and utilities.”</p><p>I mulled that over for a moment. Part of me felt sort of bad for him, in love with a woman who couldn’t see him as the same person she’d married, just because his diet and waking hours had changed. And then I remembered the previous Tuesday, when he’d hidden every product I had that contained caffeine—after keeping me up until 3:00 A.M. with the melodious screams of a jigsaw. My sympathy was short-lived.</p><p>“Honestly, I think he just hasn’t adjusted to unlife yet,” she said. “Sam seems like a do-it-yourself kind of guy. And those first few months as a vampire, all you need is help. You feel like you’re losing your connection to the human world and your place in it. You need someone to help you figure out your new schedule, how to feed without hurting your human donor, to vampire-proof your house. Sam went through all that alone.”</p><p>A strange, hot sensation twisted in my belly. What if Sam felt like that? What if he was lost and alone? Here I was making life that much more difficult for him, taking away from what little time he had left in his own home. I felt something shift inside me, a little spark of empathy I’d been missing for a while.</p><p>I jumped to my feet, nearly knocking over the little café table and our coffees. “I’ve got to go.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What? Why?” Jolene’s surprised expression morphed into wary resignation. “What did you do?”</p><p>I cringed, thinking of the various traps I’d left around the house for Sam. Suddenly, Jane burst out laughing and clapped her hand over her mouth.</p><p>My own jaw dropped. Could Jane read my mind?</p> <p>Jane winked at me and nodded.</p><p>I would worry about that later.</p><p>I dug my keys out of my bag. “Someone may have sprayed down the basement steps with high-viscosity cooking spray, making them superslick.”</p><p>Jolene sighed as Jane struggled to cover her snickers with her hand. “Tess.”</p><p>I held my hands, defenseless. “No, I said someone.”</p> <p>“Don’t you think you’ve taken this prank thang a little too far?” she asked. “I mean, some of these tricks are sort of stupid and juvenile, not to mention sort of mean.”</p><p>I dashed toward the door. “This was really the least stupid or juvenile idea I had. You should have seen what I had planned with a can of Sterno and a jar of pineapple jelly.”</p><p>Jolene slapped her palm over her face as I opened the door. Over the tinkle of the little cowbell above the door frame, I heard Jane say, “I really like her.”</p><p>—</p><p>After driving across town in record time, I dashed into the house just as Sam opened the microwave. The house was still standing, which was a good sign. Sam was in the kitchen, apparently uninjured, also a good sign. What was not good was that he was making his dinner, tossing a warmed bag back and forth between his hands to settle the red cells.</p><p>“Look, I’ve had a bad night at work, and I really don’t want to deal with you right now.” He sighed, his shoulders sagging underneath his faded John Deere T-shirt.</p> <p>Stalled midwarning, I raised an eyebrow. Work? Since when did Sam work? And where? Was that where he was all those nights when the construction noises didn’t start until the wee hours? I thought he was slow-playing me, depriving me of sleep with the anticipation of torture. Had he been out on a job? This new perspective changed the way I’d looked at a lot of the stunts I’d chalked up to Sam’s mean temper. Maybe he was leaving the chores around the house half-finished because he didn’t have the time he needed, not because he wanted to the leave the house unlivable. Then again, that didn’t explain the Saran Wrap. Or the stove.</p><p>“Sam, you really don’t want to do that,” I cautioned as he reached toward the cabinet where we kept the coffee mugs. In my haste, I bumped into a saucepan I’d set on the stove. The handle came away in my hands, and the metal bowl clattered to the floor. I gasped in horror as the pieces of my dismantled darling came clattering to a standstill. I shot him a murderous look. He smirked at me, his dark eyes twinkling. I jerked open the drawer where I kept my pots and pans. Everything I touched came apart in my hands. Somehow Sam had managed to remove the rivets from my pans.</p><p>I whirled on him. “You no-good, undead douche!”</p><p>“You know, with those dulcet tones, it really is surprising that some lucky man hasn’t snatched you right up,” he said, smirking.</p><p>Snarling, I whipped the pan handle at him. He used his unnatural speed to duck out of the way, which was fortunate, because I threw it so hard that it broke through the plaster behind his head.</p><p>“You!” I growled. “What the hell is wrong with you? Do you have any decency? You wanna hide my stuff? Fine. Use sleep deprivation to drive me into a psychotic episode? All righty, then. But when you mess around with my pans, that’s going just one step too freaking far!”</p><p>“Really, this is what pushed you over the edge?” he asked blandly as he poured his warmed blood into a mug. “I messed around with your cookware?”</p><p>“You don’t touch a chef’s pans!” I shouted as he took a long drink, wincing as the blood rolled down his throat. I smiled sweetly, pulling a carefully wrapped dropper bottle from my pocket and placing it on the counter in front of me.</p> <p>“What the?” he asked, clearing his throat and pulling at the collar of his plaid work shirt. By now, he was feeling that tickle of discomfort near the back of his tongue, that feeling that something was definitely not right with his evening meal.</p><p>“Ever hear of something called the ghost chili?” I asked, rolling the plastic-wrapped extract bottle between my thumb and forefinger. “In the pepper family, it’s basically the crazy cousin who just got out of prison, around a million units on the Scoville heat scale.” He gave me a confused frown, and if I wasn’t mistaken, there was just the hint of sweat popping out on his upper lip. I didn’t know vampires could sweat. “That’s about four hundred times hotter than the average jalapeño pepper.”</p><p>“What did you do?” he demanded, rubbing at his throat. With the rush of spicy blood to his cheeks, I could see what he had looked like as a human, ruddy and virile, like something out of a “Hunky Farmhand of the Month” calendar.</p><p>I cleared my own throat, forcing myself to focus. This was war, damn it. Dirty, nasty, nonsexy war.</p><p>“Well, I called my friend Sakar, who works in my favorite spice shop, and asked him where I could find something special.” I grinned nastily. “For my roommate. He just happened to know a store about forty miles from here that carries extract of ghost chili.”</p><p>“You put it in my blood bag?” He grunted, coughing and spluttering as the capsaicin set flame to his tongue. He reached into the fridge, tore open another bag, and dumped the still-cold contents into his mouth.</p><p>I snickered. “Not just that bag.”</p><p>“Augh!” he cried, dropping the doctored bag and running for the faucet. He stuck the sprayer into his mouth and turned it on full blast. When that failed to quell the heat raging through his mouth, he ran for the shower.</p><p>“Did I mention that water only makes the oil spread around?” I called. I dropped the bottle into the trash. Thinking better of it, I fished the bottle out, emptied it, and buried it in the backyard so he couldn’t use it against me later.</p><p>When I came back into the house, a very wet, very red Sam was practically vibrating with rage. His fangs were down, and he looked every inch the dangerous vampire. I suddenly wondered about the wisdom of this weird little war. And it occurred to me that I should have had those worries before I pranked someone with superstrength.</p><p>“So, no yelling?” I asked, faking bravery as he glowered down at me. “No calling me names or making empty threats?”</p><p>“No.” He scooped his hands under the lines of my jaw and dragged me to him. I squeaked as his mouth clashed with mine, pulling my tongue into his mouth to dance with his. I braced myself against his bare chest, fingertips digging into the cool flesh. His lips dragged across mine, and his tongue rippled over every ridge and bump of my mouth. He bit harshly down on my bottom lip, drawing just the tiniest bit of blood to the surface. I could feel my nipples blossoming into little points through my shirt as he pulled blood from the wound. It was like some warm thread was running directly from my thighs to the flow of blood, and every time he pulled on it, that thread drew across my nerves with a luxurious tension.</p><p>I was panting as if I’d run a marathon by the time he pulled away.</p><p>“What the hell was that?” I demanded.</p><p>He leered, halfway between self-satisfied smirk and impish grin. “I just wanted to share.”</p><p>And that’s when the tingling started.</p><p>“Oh, motherf—” I gasped as the chili oil that now coated my lips and tongue began to burn. I clapped a hand over my aching, searing lips. “You!”</p><p>Sam laughed while I ran for the fridge. I felt as if I’d swallowed about a hundred yellow jackets and they were all stinging the absolute shit out of my tongue.</p><p>I reached into the fridge for the only solution I knew of: dairy and popsicles. I ripped the lid off a container of plain Greek yogurt and started licking the contents while I unwrapped a Fudgsicle. I alternated between the two, cursing at him the whole time.</p><p>Because cursing sounds superintimidating when it’s muffled by a Fudgsicle.</p><p>“Give up, you crazy woman,” he growled out. “And could you please, please watch the cursing? This isn’t a truck stop.”</p><p>“No!” I pulled the Fudgsicle out long enough to shout. “You apologize for dismantling my kitchen!”</p><p>“It’s not your kitchen!” he spat back. “You apologize for giving me doctored blood. No wonder you got fired. You’re like some sort of evil comic-book villain. You—you’re the Joker!”</p><p>“Oh, all I did was respond in kind. Look, I felt a little sorry for you earlier tonight, because of your bad luck and your tragic marriage. Clearly, empathizing with the enemy was a mistake. Now, either you fix my pans, or I will find brand-new places to put that chili extract, jackass.” I growled, backing out of the room and stalking toward my bedroom.</p><p>He called after me, “I’d say this one was a draw, wouldn’t you, sweetheart?”</p><p>Here in Lunch Lady Land...</p><p>6</p><p>Jolene was not impressed with my vampire-provoking shenanigans.</p><p>“Have I not explained how dangerous it can be to spend time with vampires when they’re in a good mood?” She sighed, frowning at me in that way that only mothers could master.</p><p>Jolene’s powers of emotional concentration would have been more impressive had she not been staring me down while turning her van into a dry cleaner’s parking lot. I was trying to treat the still-tingling nerves of my lips and tongue with a strawberry milkshake from the Dairy Freeze. I was starting to suspect that it was more than just physiological, because nothing was working. It wasn’t even unpleasant anymore, just a lasting, warm tingle over my skin. This couldn’t be normal. “I thought you were goin’ home to prevent your pranks from ‘goin’ off’ on Sam.”</p><p>“I tried to stop it,” I said lamely, clutching the door frame for all it was worth, so I wouldn’t smack my face into the window. “And then he took apart my pans and said mean things to me, and I sort of stopped myself from stopping it.”</p><p>“So he slipped down the basement steps?” she said, cringing as she pulled to a screeching stop.</p><p>“I forgot about that,” I said. “It would explain the loud thump I heard before bed.”</p><p>Jolene gave me a withering look.</p><p>“What?” I grumped, crossing my arms.</p><p>“Have you thought about the fact that under the fangs and the bluster, there’s a person with feelings?”</p><p>“I don’t really care how he feels, Jolene,” I protested. “I’m sorry for what he’s going through. But he’s not the only one out there in pain. I—what is it we’re doing here, again? I thought we were going to Jane’s shop.”</p><p>“I need to make a quick stop first. I work part-time for a vampire concierge service here in town. My boss, Iris, asked me to pick up some of her clients’ dry cleaning. Vampires are hell on clothes, let me tell you. I’ll just be a minute. Do you want to come in?”</p><p>I glanced around the busy corner of Main Street, right off the memorial square of downtown Half-Moon Hollow. There was a classic white gazebo in the center, flanked by golden ginkgo trees and statues of Civil War soldiers. There was a huge plastic banner stretched across the street, advertising “Burley Days! Food, Frolic, and Family Fun!” starting in two weeks.</p><p>“No, I’ll just wander around, if that’s OK. I’ll meet you back here in a bit.”</p><p>She glanced down the street at the small-town oasis drawing me in and grinned broadly. I was stunned for just a moment by the sheer brilliant expanse of that smile. There was a fierce quality to Jolene, something not quite human rippling under that beauty. I started to wonder whether the reason she was so comfortable with the supernatural was that she was something supernatural.</p><p>Not that I’d let something like that get between us. Other than Chef and George, Jolene was the only real friend I’d made in years. I was determined not to care about it. If she felt like it, she would tell me in her own time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You do that,” she said. “I’ll catch up to you.”</p><p>As Jolene ducked into AAA Cleaners, I perused the posters for Burley Days hung in various shop windows. “Family Fun” apparently included rides, game, a parade, street performers, and something called the “First-Ever Faux Type O Bloody Bake-Off!” which sounded absolutely disgusting. I would be skipping Burley Days.</p><p>I wandered down the street, staring at the old 1930s architecture. In Chicago, these buildings wouldn’t be anything special. The Second City prided itself on preserving anything that had survived the Great Fire, the Depression, and both Richard Daleys. But it was clear that these old banks and general stores were the pride of the Hollow, lovingly restored and newly painted—all except this white and pink two-story building wedged between what were now an antiques shop and a florist. The windows were blocked over with soap, but I could still make out the faded paint reading, “HOWLIN’ HANK’S BBQ, Est. 1968.”</p> <p>The white paint flaked off the brick front like falling snow. The door handle was damaged, as if someone had tried to kick it in. Someone had replaced the old faded Realtor sign with a new one: “A Honey of a Deal! Call Sherry Jameson, Hometown Realtors!” with Sherry’s contact information spelled out in bold red print. Another poster for the Bloody Bake-Off had been tacked over a broken pane in the front door but was now hanging loose at the upper right corner, giving me a glimpse inside.</p><p>Someone had loved this place once but gave up a long time ago. The maroon pleather booths were cracked and peeling. The napkin dispensers consisted of paper-towel racks mounted against the oak paneling. The tables flanked a stout oak bar/counter. Old neon beer signs still hung on the walls, the tubing broken in places; one particularly ornate Budweiser sign was home to a rather large bird’s nest. I could barely see the kitchen through the dining room, but I could make out a huge brick pit in the middle of the space.</p><p>I could see that the dusty tables had been intricately carved with messages. “Marcy Loves Joe Lee, 1976,” or “Petey and Maybelline, First Date, 06/23/81,” or a heart carved around the initials “MH + DW, 1992.” It was sort of sweet, all of these couples marking their lives together on the tables where they’d shared meals. And I was sad that those people, who most likely still lived in the Hollow, couldn’t come back there to visit their little milestone markers.</p><p>I rattled the doorknob, wondering if it counted as breaking and entering if the building was already “broken.” The knob twisted in my hands, and—</p><p>“Kind of sad, isn’t it?”</p> <p>Jolene’s voice sounded just behind me, making me jump and smack my head against the decorative rack of ribs hanging low over the doorway. “Ow!”</p><p>Jolene continued as if I hadn’t just beaned myself with plaster-of-Paris pork. “This place was a Half-Moon Hollow institution until about ten years ago. Hank Fowler died, and his kids just didn’t have the business sense or the flair for the kitchen that their daddy did. They limped along until a couple of years ago. They just couldn’t keep the doors open anymore. I don’t know why they’ve never sold the place.”</p><p>“Too many prospective buyers injured themselves on the low-hanging decorative pig?” I said, rubbing my head. I nodded toward the poster. “OK, explain this Burley Days thing to me.”</p><p>“It’s the highlight of the Hollow social calendar,” Jolene said, feigning distress at my ignorance. “It goes back to when burley tobacco was the big crop around here. Local farmers would bring their harvests to the brokers and get paid on one particular weekend each fall. They’d have money to spend, so vendors and carnies showed up every year to take it. It became a big party. Farmers around here have moved on to soybeans and such, but we’ve kept the tradition alive with funnel cake and ring toss. It’s a hoot.”</p><p>“How does a Bloody Bake-Off figure into this?” I asked, cringing.</p><p>Jolene wrinkled her nose. “Jane says that Faux Type O is sponsoring some sort of cook-off, asking people to come up with recipes using synthetic blood.”</p> <p>“Why would the company want to do that?” I asked as we ambled back toward the van.</p><p>“Newer vampires miss human food,” she said. “They want more variety in their diet. Rather than lose their audience, Faux Type O is lookin’ for ways to incorporate its product into the sort of ‘cravin’ foods’ that new vampires will want. They’re going to put the winning recipes into a cookbook. So if you win, you’re basically selling the rights to the recipe for your prize money.</p><p>“They’re hosting the contests all over the country. Ophelia, the head of our local Council office—she’s really scary,” Jolene said. “She has connections at the beverage company, and she’s good at intimidating city officials. She said she wants to, quote, ‘integrate the undead community into the Hollow’s traditions.’”</p><p>“She gets a cut from the company, doesn’t she?” I asked.</p><p>“Probably.”</p><p>“Is Jane going to enter?” I asked.</p><p>Jolene stopped in her tracks, spluttering and choking, nearly doubled over in laughter. When she finally straightened up and wiped at her eyes, she wheezed out, “Jane’s first few solo attempts at serving coffee at the shop sent people into convulsions. I don’t think she’s willing to do that, even if it means winning twenty-five thousand dollars.”</p><p>Now it was time for me to splutter. “Twenty-five thousand dollars! You’re telling me some vampire could win twenty-five thousand dollars just for making up a recipe?”</p> <p>“Doesn’t have to be a vampire,” Jolene said, giving me a pointed look. When I scoffed, she cried, “What? You cook all the time.”</p><p>“Yes, for people with pulses and the ability to process solid foods,” I said. “There are some dietary restrictions even I can’t work with.”</p><p>“Fine, leave the vampire judges to deal with Jane’s mama’s Bloody Pot Pie.” Jolene sighed as we climbed into the minivan. “Jane’s mama seems to think she can force Jane into eating human food again if she just gives her enough pot pies. If she figures out a way to put Faux Type O in a pot pie, I pity those poor volunteers—including Jane.”</p><p>“Why would Jane volunteer for something like that?”</p><p>“Like I said, Ophelia is scary,” Jolene said, shrugging. “So, are you ready for tonight?”</p><p>“What’s tonight?”</p><p>“I’m droppin’ these clothes off, and then you, me, Jane, and Andrea are goin’ out for a girls’ night. Jane hasn’t made any of the plans, so we should be safe. Think you’re up for it?”</p><p>I snorted. “I think I’m ready for whatever nightlife Half-Moon Hollow can dish out.”</p><p>—</p><p>I was so not ready.</p><p>Girls’ night, apparently, meant The Cellar, where it was “Country-Western Night,” and Jane never paid for drinks, because she’d rescued the owner-bartender during an attempted robbery a few years ago. So we had not only unlimited alcohol but also access to a mechanical bull.</p><p>One of the few things I could remember clearly about the evening was being grateful that Sam wasn’t home when I stumbled through the front door around 2:00 A.M. and broke my fall with my face. But according to the pictures Andrea saved to my phone, I had not only ridden the mechanical bull, I’d borrowed a stranger’s cowboy hat to make my experience more authentic. I thought the hat went very nicely with Andrea’s sparkly black tank top. And the western-wear lover’s phone number appeared to be scrawled on my arm, next to “Call me, Cowgirl!”</p><p>Oh, well, at least he was cute, according to the picture that showed me returning his hat and giving him a big wet kiss on the cheek.</p><p>The rest of the pictures included various shots of Jolene attempting karaoke, Jane hugging Norm, the cuddly bartender whose life she’d saved, and the four of us gathered at the bar, shot glasses in hand, giggling our asses off while Jolene tried to fit all of us into the frame.</p><p>At some point, my friends’ husbands dropped by to scrape our inebriated asses off the barroom floor and drive us home. I’d met Zeb before and liked him. Underneath his oily charm, the vampire Dick Cheney was a really sweet guy who clearly loved Andrea and his friends with the ferocity of a pissed-off honey badger. I sort of recalled that the one guy who tried to hit on me in his presence was given the scariest stink-eyed glare this side of a correctional facility. Jane’s Gabriel was more of a mystery, all brooding silence and stiff upper lip, until Jane made some ridiculous joke and he smiled like a man seeing boobs for the first time. But in a really romantic, courtly way.</p><p>The final picture was a group shot taken by Norm. Somehow I ended up in the middle of all of those couples without sticking out like the sore single thumb. I looked happy. Not just drunk-giddy or relaxed but genuinely, no-holds-barred happy. I couldn’t remember seeing that expression on my own face since... I couldn’t remember seeing that expression on my face.</p><p>Still, it was the deepest night’s (and most of the morning’s) sleep I’d had since I arrived in the Hollow. I rolled onto my back, and the reverberating pain in my head made me instantly regret moving. Zeb, my designated driver, had apparently left a glass of water and some Advil next to my bed when he’d dropped me off. I lifted my head from the pillow, just barely, to look at my alarm clock and saw that I was supposed to be meeting Chef Gamling at the Half-Moon Hollow First Baptist Church in less than an hour. Moving gingerly, I eased up from the bed and reached for the water glass. It only took me three tries to pick it up.</p><p>After scrubbing off eau de barroom, I discovered that Sam not only had soaked all of my clean bras and put them in the freezer, but he had also destroyed yet another cheap pot and left it in the sink. After preparing my traditional hangover cure of a bacon, egg, and tomato sandwich, I barely had time to Super Glue Sam’s car keys to the counter before I was due to meet Chef.</p><p>The Half-Moon Hollow First Baptist Church was one of those classic brick churches with stained-glass windows. I felt nervous walking through the back entrance of the fellowship, as if God would reject my hungover presence in his house like a faulty kidney. But he let me walk all the way into the industrial-sized kitchen unscathed, so figured I wasn’t his top “smiting” priority.</p><p>Chef Gamling was already stationed at the counter, shredding cheddar from a block the size of a football. A gigantic stock pot boiled on the stove, while another pot held a huge batch of green beans with bits of bacon. I could smell ham baking and the cinnamon-spice mix Chef used for his special apple pie recipe.</p><p>“Are we catering a party?” I asked.</p><p>He turned and leveled a critical gaze at my clean jeans and T-shirt, the sensible shoes and tight ponytail. He tossed an apron at me. “You’ll do.”</p><p>My transition back to Chef’s galley slave was made with alarmingly little force. He had me chopping veggies, straining pasta, making a roux for the basic white sauce he needed. Dealing with hot butter fats was particularly cruel given my hungover state, but I think that was probably the point to Chef’s exercise.</p><p>“What exactly are we making?” I asked as he added the shredded cheese to the white sauce.</p><p>“Macaroni and cheese,” he said. “Ham. Granny Houston’s famous green beans—a recipe I had to barter a Le Creuset casserole for, thank you—and apple pie.”</p><p>“For what?”</p><p>“The church has Saturday-afternoon fellowship meals. Everybody from the community is welcome, whether they pay or not, whether they’re members of the church or not. The pastor thinks it’s important for everybody to gather for a good meal, for no other reason than to spend time together. Usually, they play board games or volleyball, depending on the weather. I think the plan for today is an Uno tournament.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re going to all this trouble—aged cheddar, sauce from scratch, what appears to be green beans combined with bacon, butter, and brown sugar—so you can feed a church crowd mac ’n’ cheese before a card game?”</p><p>“These people deserve good food, carefully prepared, whether it’s simple fare or a wedding feast. They’re going to share a meal, something to bring them closer together. That’s the point of what we do, Tess. Not the reviews or the interviews. Good food. Happy diners. That’s all there is.”</p><p>He pinned me with that frank gray gaze, and I felt a little ashamed of myself. “Now, be a good girl and stir the sauce.”</p> <p>With that, he popped me on the butt with a dishtowel and returned to his nutritionally bankrupt green beans.</p><p>—</p><p>When I was in college, I saw cafeteria serving as the last stop before culinary oblivion. I had nightmares in which I woke up patting my head to make sure the hairnet wasn’t really there. But now I found that I liked greeting people as they came through the kitchen line for their lunches. I liked being able to talk to friendly faces as they moved by, complimenting the colors of the food or the delicious smells wafting up from the steam table.</p><p>I’d never had this sort of contact with customers before. Phillip did his damnedest to make sure I was insulated from dealing with overenthusiastic customers. I rarely left my kitchen, just in case.</p><p>But because these diners liked Chef, I was accepted as his little helper, greeted warmly, and complimented for my addition of smoked paprika to the macaroni and cheese. After we’d fed everyone, some of them twice, Chef made me sit at the counter and eat a huge helping of everything. I wasn’t gaining weight back fast enough, in his opinion. Overall, it was a very pleasant way to spend an afternoon.</p> <p>I guessed Chef didn’t have more Kitchen Yoda wisdom to impart, because he joined the Uno games—leaving me with the dishes, thank you very much. I was up to my elbows in bubbles when a trilling feminine voice behind me cried, “Hi there!”</p><p>Jumping and nearly dropping a sixty-four-ounce glass measuring cup on my foot, I turned to see a pretty, slender woman with a brown bob and mischievous hazel eyes. The shape of her mouth reminded me of someone.</p><p>“Aren’t you Tess?” she asked, smiling broadly.</p><p>“Um, ye—gah!” I yelped when the woman threw her arms around me and squished me to her bosom.</p><p>“Oh, honey!” she exclaimed. “I’m so glad my Jane has a friend who goes to church!”</p><p>Well, I was standing in a church building, so I guess she was technically right.</p> <p>“I’m Sherry Jameson, Jane’s mama.” She sighed, giving me one last squeeze. “But you can call me Sherry. All her little friends do. Jane told me you’d be here today, and I just couldn’t wait to meet you! Now, don’t get me wrong, I love Andrea and Jolene, but it’s just so good to know that my daughter spends time with a nice girl. I mean, just look at you, cooking up a storm in the Lord’s kitchen.”</p><p>Now was so not the time to whip out my phone and show her the pictures of Jane and me running tequila boat races. So I settled for a bland smile while Mrs. Jameson pressed a heavy Saran Wrapped package in my damp hands.</p><p>“I made you my special peach cobbler. Jane mentioned you’re a cook, so I knew you’d appreciate a little something sweet. Don’t you worry about sugar or calories, all right, honey? You need a little meat on your bones,” she said. “I used to make this for my Jane all the time, but you know, she doesn’t eat anymore.”</p><p>“Thank you,” I managed to say before Sherry crushed me into another hug, my arms flailing against her back.</p><p>I glanced down at the package in my hands. Mrs. Jameson had cooked for me. I didn’t even know if it was any good. But it was thrilling to have someone else cook something for me, not because she was trying to impress me or drill me for information but for no other reason than that I was a friend of her daughter’s and she thought I needed it.</p><p>Hungover or not, I was going to go home and eat every bite.</p><p>Somewhere in the back of my pickled brain, a switch labeled “Sherry Jameson” flipped into place. Now I knew why Sherry’s name sounded so familiar.</p><p>I smiled brightly, though it sort of hurt my cheeks. “Aren’t you the Realtor selling Howlin’ Hank’s?”</p> <p>—</p><p>Two hours later, I was in love with the Howlin’ Hank’s building.</p><p>Miss Sherry was honest with me. Hometown Realtors had assigned her this building to test her newly official salesman skills. The agency had been trying to offload the place for years and hadn’t had so much as a nibble. The idea that she could be the one finally to sell it had thrown Sherry into warp speed, as Jane put it.</p><p>Chef Gamling accompanied us as my “anti-life-ruining-decision lifeguard.” Before she let me in the front door, Sherry went in to turn on all of the old beer signs and the jukebox. The current selection was a Hank Williams Jr. song made overtly off-key by the warped 45. That’s right. The jukebox was so old it played actual records. Still, the electric display gave me a better idea of what the place had looked like in its heyday.</p><p>Chef Gamling didn’t comment on the dilapidated condition of the building or the sheer amount of beer and/or NASCAR memorabilia on the walls. He simply wandered around the kitchen, his hands clasped behind his back, while he chewed on his lip. The kitchen was in surprisingly good shape, albeit seriously outdated. I would need to replace all of the appliances, but the traffic flow of the room was pitch-perfect for maximum efficiency from the stove to the pass to the dishwashing area.</p><p>The dining room’s open floor plan, the old oak bar worn satiny smooth by countless hands, the wide, spacious booths—it was the perfect setup for a small, informal restaurant. Before I’d even put down my purse, I’d started making plans in my head. I’d keep some of the more retro beer signs, but I would paint the walls a soft denim blue. I would have to replace the tables. But I might be able to preserve the carved tabletops and use them as wall panels.</p><p>I would keep the view to the kitchen open, so the customers would get the feeling that they were just hanging out at a friend’s place, waiting for their meals to be finished. I would replace the battered dartboards with photos of the original Hank’s and maybe a few of the remodel—something to show that I appreciated the history of this place and wanted to be part of it.</p><p>Oh, how I wanted to be part of it.</p><p>I rubbed at my sternum, praying for the acidic roll in my stomach to die down. Could I really do this? Could I stay in the Hollow and open up my own restaurant? Chef Gamling was here. My friends were here. What did I have waiting for me in Chicago?</p><p>I had acquaintances and colleagues in the city but nobody who would take me out for drinks and mechanical-bull rides. I had Phillip, who was waiting for his marriage-license paperwork, not for me. I had my reputation, but that wasn’t exactly keeping me warm at night. It couldn’t even give me the warm sense of fulfillment that it used to.</p><p>I sat down at one of the booths, leaning over to put my head between my knees. Across the table, I could hear the sound of old leatherette crackling. I looked up to squint at Chef, grimacing. “Am I completely insane?”</p><p>“Why would this be insane?”</p><p>“Because I’ve only cooked. I’ve never managed a restaurant. Because of the risks involved. Because these are disastrous economic times to strike out on my own.”</p><p>“This is all true,” he conceded. “But do you want this?”</p><p>I chewed on my lip, nodding. It scared me how much I wanted this. I didn’t think I’d ever wanted something so badly in my life. Sure, I’d wanted to leave my hometown. I’d wanted to graduate. I’d wanted the job at Coda. But this was a different level of desire. I had to have this place. I could feel the desperation down in my bones, crushing my stomach with the anxiety that I might not be able to make it happen.</p><p>I had a place in the city. I had a routine. But I could have a life here. I didn’t exactly fit in, but I could love people here. I was well on my way to loving a few already. And those people could love me if I let them.</p><p>I could do this. I could make a life here. Hell, I already had a life here.</p><p>I wanted to feed people, not just because they had showed up for a business meeting or to be seen. I wanted them to leave my dining room happy. I wanted to cook and not think about whether the ingredients were exotic enough to please the customers. I wanted to serve food that nourished people, that made them feel comfort, whether it meant using Velveeta or ungodly expensive Jarlsberg cheese.</p><p>“Yes,” I whispered. “I really want this.”</p><p>“Then you are insane,” Chef said, shrugging. “But it could be just the kind of insane needed to run this place.”</p><p>“Not helpful.” I groaned, dropping my head back to the table.</p><p>I felt a cool, damp cloth pressed to the back of my neck and heard a fond tsking sound just in front of me.</p><p>Sherry pressed her handkerchief to my temples and smiled gently. “Jane felt the same way just before she decided to renovate her shop. She was so afraid of making a change, so afraid that she would fail. But she couldn’t stand not to try to make a go of it. She’s always been my brave one, you know. Though if you tell her that, I’ll deny it just to keep her on her toes. The bottom line is, life is for living, sweetie. It’s for taking chances and trying to grab up every little piece of happiness you can latch on to. And I say that as a mama and a friend and not someone who stands to make a very healthy commission if you agree to take this place on.”</p><p>I laughed and handed the damp handkerchief back to Sherry.</p><p>I stood and took another look around the restaurant. While my savings were not enough for the real estate market in Chicago, I had more than enough for the down payment on the building. Heck, given Hank’s kids’ desire to unload the building, I might be able to buy it outright, if Sherry and I were clever enough. The problem would be the cost of renovating; I would have to figure out a way to pay for that.</p><p>I needed to make this change. I needed this town. I needed the slower pace, the quiet. I needed the people here. This was my place now.</p><p>I edged toward the dusty old chalkboard behind the bar, advertising the specials and “pie du jour” in place when Hank’s had closed. I took the eraser and carefully swiped off the old chalk marks. The brittle white chalk nearly crumbled under my touch, but I was able to scratch out what I wanted. “Honey-smoked pork with apples,” I wrote. “Corn fritters with spicy relish. Dessert of the day: raisin brioche bread pudding.”</p><p>I stood back and admired my handiwork.</p><p>“I would have served a chutney with the fritters,” Chef said, sniffing.</p><p>My lips twitched. “Well, it’s not your restaurant.”</p><p>He sighed, rolling his eyes heavenward. “Sassy-mouthing again.”</p><p>Sherry grinned at my very first selection of specials. “I take it you’ve made a decision?”</p><p>I turned and threw my arms around her and squealed, a very un-Tess-like squeal. She laughed again and patted my back. “Is it OK to hug your Realtor?” I asked.</p><p>Sherry gave me a very momlike little squeeze. “I’ll allow it this once.”</p><p>Poaching Territory</p><p>7</p><p>I sat on the front porch, under a purpling sky, mulling over the paperwork for Howlin’ Hank’s. I teetered between giddy joy and abject horror over signing a letter of intent to buy the building. What was I thinking? What had I done? What would I serve? What would I call the place?</p><p>I should have considered that before I signed the papers.</p><p>I made calls to Chicago as I drove, shell-shocked, back to the house. Phillip was very gracious about accepting my resignation and agreed that it would be too awkward to work with me while planning his wedding to someone else.</p><p>As expected, Coda’s owners jumped at the chance to buy me out and promised to deliver a cashier’s check within forty-eight hours. While their offer was generous, considering the economy, it left me with two options: Take out a mortgage for the building and a second loan to cover the costs of renovating, or pay cash for the building and leave myself with a practically nonexistent budget for the facelift. Neither seemed like the ideal situation. While the building was structurally sound—with the exception of some storm damage to the roof—it would need some serious cosmetic work. Key changes usually translated to “expensive” in construction-speak. The whole prospect made me nervous. Thanks to some youthful indiscretions with a Visa card, my credit wasn’t stellar. Damn my addiction to fancy Belgian knives. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Giving up my apartment would be shockingly easy. I’d barely spent enough time there over the years to make it a home. I hadn’t decorated or added any personal touches. Everything was beige, for cripe’s sake. But the thought of giving up the Lassiter place was singularly depressing.</p><p>Sherry had shown me the apartment above Howlin’ Hank’s and it was perfectly adequate. Or would be, after the renovations that would jack up my construction budget even further. But ultimately, I had enough on my plate taking on the restaurant. I wouldn’t have the time, money, or energy to take on a fixer-upper house.</p><p>If I could find a way to stretch my budget another twenty thousand dollars or so, I’d have enough breathing room to do what I hoped to with the restaurant. But I did not, in fact, have naked pictures with which to blackmail Bill Gates, and I didn’t have anything else to sell, unless you counted my car or a kidney—and I would need both.</p> <p>The sun slipped over the horizon, leaving long lavender shadows in its wake. I buried my face in my hands and groaned. I leaned against the porch railing and looked out over the velvety green lawn. I would miss this place. I would miss having my own quiet space. I would miss waking up every morning to plot revenge against Sam for his pranks, even if I did sort of regret dosing his blood with essence of third-degree tongue burn. Then again, that had led to receiving the hottest kiss of my life, in every sense of the word, so it couldn’t have been a terrible plan.</p><p>A soft thump sounded behind me, making me turn toward the front door. Speak of the bewildering devil. Sam was standing there, framed behind the screen door, his dark hair tousled. He was staring at me, his head tilted at a quizzical angle. I simply stared back, unsure of what else to do. I supposed I should have been nervous, caught in the sights of an apex predator, but there was nothing threatening in his gaze. He seemed curious, a little irritated, as if he were looking at some overpriced abstract painting he couldn’t figure out... because he probably wasn’t supposed to. I tilted my head to mirror his posture, because, frankly, I doubted I’d ever interpret Sam correctly, either. I wanted to. I just didn’t know how to reset our relationship from minor domestic booby-trapping to “let’s be friends.”</p><p>What could we have been, if we hadn’t started off so badly? If we’d just met walking down the sidewalk on Main Street, would we have been friends? Would he have asked me out for coffee, or whatever vampires did for awkward-first-date beverages? It was sad that I would never know. Part of me—a teeny, tiny synapse in the dimmer region of my brain—would even miss Sam when I moved out. Yes, he pissed me off. And yes, he had hurt my pans. But he kept things entertaining. And I couldn’t deny that through the frustrations and near-injuries, we had chemistry. The sort of chemistry that seemed to be melting holes in the screen door at the moment.</p><p>Blinking slowly, Sam seemed to come to his senses and backed away from the screen, closing the front door behind him.</p><p>Well, that was weird.</p> <p>It struck me that it wasn’t a great idea to start my new life in the Hollow with a local vampire pissed off at me. Maybe as a going-away present, I could make something nice for Sam, some variation of whatever he was trying to do with those burned-out saucepans, only edible. He obviously missed real food, and I had sort of tortured him with the lasagna and the brownies. That seemed less OK now that I would probably bump into him at Walmart at some point.</p><p>But where would I start? How did you make blood more palatable? Add other, tastier bloods? Herbs and spices? Make it into gravy? Blood pudding?</p><p>I slapped my hand over my face. How could I forget about something called the Bloody Bake-Off? If I entered the contest and won, the grand prize was $25,000. That would pad my construction budget considerably. And frankly, I didn’t think any other gourmet chefs of my caliber would be entering. My chances of beating Jane’s mom were pretty high. Plus, it couldn’t hurt my reputation locally for word to get around that I was a good enough cook to make vampire food palatable.</p><p>I pulled out my phone and dialed the number listed in my contacts under “Jane, if you’re not calling for bail $$.”</p><p>“Hey, Jane, it’s Tess,” I said. “Do you know where I sign up for this vampire cooking contest?”</p><p>—</p> <p>My approach to the contest entries was simple. I wanted to make something that reminded the judges of their human days—assuming they remembered them—but still appealed to their vampire palates. Clearly, all of the ingredients had to be liquid. I didn’t even want to risk purees after what Jane had told me about the French cookbook.</p><p>I tried to stay with familiar flavors, nothing too exotic. Hell, I even made a very thin marinara from tomato juice, but I needed some feedback before I decided which entry was the best. I tried tasting a few of my samples, but the weird metallic aftertaste of the Faux Type O overrode any other flavors.</p><p>This brought my favorite vampires, Jane, Gabriel, Andrea, and Dick, to the recently cleaned bar in the Howlin’ Hank’s building. (I was really going to have to come up with a name for the place soon.) The family was more than willing to let me “play” in the space while the final sale paperwork was ironed out, as long as I paid cash. I was so confident in my ability to win the prize money that I’d agreed. I bought the building outright, saving just a few thousand for the renovations and new equipment.</p><p>The dining room was still pretty beat-up, but I’d done a thorough cleaning. I’d found and washed some shot glasses, then used them to set up a tasting session at the bar.</p><p>“Are you sure it’s safe to eat anything prepared here?” Gabriel asked, obviously trying to keep his tone in the “nonpanic” range as he eyed the defunct beer signs and broken chairs. “Did you say you only had the electricity turned back on this morning?”</p><p>“I didn’t cook this here,” I assured him. “I cooked it at home, but I didn’t want to stir up my cranky roommate by inviting a bunch of people there. I thought this would be more fun.”</p><p>“She clearly has Jane’s idea of fun,” Dick muttered to Gabriel.</p><p>“So, when are you going to start work on this place?” Jane asked, elbowing Dick as I poured shot glasses full of a warm, deep-red concoction.</p> <p>“I’m not sure. I have to find a contractor who’s willing to work with my budget.”</p><p>“Why don’t you talk to Sam?” Andrea asked as I sprinkled a tiny bit of rosemary oil over each shot.</p><p>“Because I don’t want my lower lip nailed to the bar at some point during the construction process?” I asked. “I mean, I’ve done things to him that the Geneva Convention would frown upon. I don’t think he’s going to give me a fair and accurate estimate, Andrea.”</p><p>“I might know someone,” Dick said before the other three cut him off with a chorus of “NO!” Dick huffed and crossed his arms over his chest. “Fine.”</p><p>“Jolene will help you find someone. If she doesn’t have a cousin who will do it for you, she has a cousin who knows someone who will do it for you,” Jane assured me, lifting a shot glass and sniffing. “So, what do we have here?”</p><p>I wiped my hands on a dishtowel and did a small curtsy behind the bar. “OK, this is a red-wine reduction with shallots—well, shallot juice—and a few other goodies, and, of course, Faux Type O. It’s basically the go-to sauce for any chef auditioning for a job.”</p><p>The vampires sniffed the glasses and then, giving one another subtly wary looks, knocked back the shots.</p><p>“So, what do you think?” I said, bouncing up and down on my heels. “Should I stick with this one as the contest entry, or do you want to taste more? Because I’m pretty sure this is the best selection.”</p><p>They stared at me, eyes unnaturally wide. That’s when I noticed that they weren’t smiling. Most people smiled when they were eating my food.</p><p>Dick swallowed heavily, grimacing. “Taste more?”</p><p>“This is the best one?” Jane said, dabbing at her mouth with a napkin.</p><p>My eyes flicked to each vampire’s face and their expressions of strained, polite discomfort. They hated it.</p><p>A cold flush of shock and panic skittered down my spine. My brain kept screaming, Impossible! I didn’t make bad food. Even when I made blue-box macaroni and cheese, I did it with flair. And this was my red-wine reduction. Everybody loved my red-wine reduction, even Chef Gamling.</p><p>I’d tasted this batch myself just before adding the blood. It was the perfect mix of sophistication and Southern comfort. Except it wasn’t, because Dick seemed to be trying to scrape his tongue with a napkin without being obvious about it.</p><p>“Does synthetic blood curdle?” I reached for the shot glass and sniffed. It smelled fine to me, a little coppery under the peppery tang of the sauce, but fine.</p><p>Gabriel cleared his throat. “No, no, it’s fine. It just a little...”</p><p>Dick murmured, “How can we put this delicately?”</p><p>Jane took my hands in hers, looked me straight in the eye, and said, “It tastes like old sandals and feta cheese.”</p><p>“That was delicately?” I deadpanned.</p><p>“For Jane, yes, it was,” Andrea informed me.</p><p>“OK, what could I change?” I asked, my voice hitching slightly. I took a deep breath to stave off the worst of my panic. “Should I season it differently? Change the consistency?”</p><p>“I don’t know,” Jane said. “It’s not even an issue of spices or texture. It just tastes... wrong.”</p><p>“OK.” I whisked another set of shot glasses off the counter, the one containing my second choice, an attempt at masking the taste of the blood in an Asian-inspired plum sauce. “Try this one.”</p><p>Dick couldn’t hold the glass to his lips for more than two seconds before shuddering, giving me an apologetic look, and placing the glass back on my tray. When Andrea lifted the glass to her mouth, Dick’s hand shot toward her and pulled the glass out of her grasp. Jane sipped, gagged, and spat the sauce back into her shot glass. Gabriel, who seemed to feel sorry for me, downed the sauce in one gulp. He paled, which was saying something, mumbled “Excuse me,” and ran for the bathroom.</p><p>“What am I doing wrong?” I exclaimed.</p><p>“I don’t know,” Jane said sympathetically. “But you’ll get it. Don’t worry.”</p><p>But I was worried. I refused to subject my guests to further gastronomical torture. I went home to my kitchen and went over my recipes one by one. These were my tried-and-true recipes. I used versions of them at Coda every day. No one hated these. I’d done my research. I’d broken down the flavor profiles on a molecular level to match the right sauce to the right blood type.</p><p>If I didn’t win this contest, I would barely have enough to make Howlin’ Hank’s habitable. I’d been so stupidly confident in my skills, in my ability to blow the locals out of the water, that creating something inedible hadn’t even crossed my mind.</p><p>I felt like such an idiot. Did vampire taste buds really change so much after death? Gabriel described the taste issue as the vampire body’s method of digestive self-defense. The vampire’s brain instinctually knew that solid food would make them sick, so it sent messages to the body that human food was rancid and disgusting. Maybe if I could trick the vampire’s brain into thinking it was just enjoying another cup of blood, I wouldn’t serve them something that tasted like the inside of Mike Tyson’s gym bag.</p><p>“I can fix this,” I assured them. I grabbed the spices and herbal oils I’d brought with me to garnish the shots and went to work doctoring the remaining entries. Dick grimaced but gamely stepped up to the bar. Gabriel rolled his eyes but clearly didn’t want to be outdone in the chivalry department. He stepped forward, too.</p><p>“I haven’t thrown up in more than a year,” Andrea told me, taking her own shot glass in hand. “You break my streak, and I’m going to be pissed at you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>—</p><p>I’d broken Andrea’s streak and then some. My poor ladies’ room would never be the same.</p><p>Hours later, I sat at the Lassiter house’s kitchen counter, my face buried in my hands. I’d never cooked anything bad before. When I was a culinary student, I’d gotten cocky with the seasonings and turned a simple roast chicken into a garlic-soaked mess. Even then, I’d managed to turn the carcass into a palatable soup and gotten partial credit.</p> <p>“What did I do?” I groaned, thunking my head on the counter. I let it rest there as hot tears tracked down my cheeks. If I didn’t come up with a prize-winning entry, I had no shot at the money I needed for renovations. Who would want to eat in a restaurant with a semiprivate bathroom?</p><p>A cool hand awkwardly patted my head, followed by an arm slipping around my shoulder. I glanced up through my hair to see Sam sitting next to me, stretching his body as far away from me as possible, as if he was cuddling up to an incendiary device.</p><p>“There, there,” he said, his voice resigned and sheepish as he patted my head. “I’m sorry I hurt your pans.”</p><p>“What?” I exclaimed, snorting far too loudly as my head popped up.</p><p>Sam looked stricken, his cheeks pale(r) and his brown eyes clouded with concern. His lean frame was curved around mine almost protectively, and I found I didn’t want to move away. Hell, I wanted to move closer. I sniffed, offering him a watery smile.</p> <p>“Don’t flatter yourself. This is not about you.” I waved a hand at my tear-stained cheeks. “This is just... everything. I’ve been on this roller coaster, feeling like a failure, feeling almost normal, feeling I’ve got it all figured out, and then right back at failure again. Only this time, I don’t know if I can bounce back. I have hubris-ed myself right into a corner, and I don’t even think that’s a verb.”</p><p>“Psfff.” He snorted, pulling a bar stool close to mine and sitting. “Failure. Trust me, I know failure. Whatever this is, it’s just a bump in the road. I moved here to try to save my marriage. And livin’ here is what destroyed it.”</p><p>“I’m sorry,” I said. “I heard that Lindy didn’t handle your, er, transition, very well.”</p><p>He scoffed. “You know, her brother was one of my best friends. He warned me against her, and not just in that ‘friends don’t mess around with their friends’ sisters’ way. He told me Lindy was a ‘wanter.’ She planned and prayed, but then once she had whatever ‘it’ was, she didn’t want it anymore. She got a degree in marketing but decided she wanted to be a medical coder. I rented us an apartment, but she wanted out of the lease by the third month. She went through three wedding dresses before I even proposed.</p><p>“I thought she would settle down, be happy, once we were married. We were living in Nashville. I was workin’ as a project manager for this big construction firm. Lots of hours, lots of travelin’. I hardly ever saw Lindy. She’s the one who pushed for us to move. This house, in this town, was supposed to save our marriage. A quieter life, less stress, more time together.”</p><p>“And it didn’t work?”</p> <p>He grimaced, that cute little constellation of freckles disappearing into the creases under his eyes. “It turned out that not spending time together was what held our marriage together for so long in the first place.”</p><p>“Ouch.”</p><p>“I fit right into the Hollow. There are nice people here. It was a good place if we wanted to raise a family. My business picked up faster than I expected. Lindy just sort of drifted, which was unusual for her. She couldn’t find friends. It was too quiet for her. She didn’t like livin’ in a work in progress. When she saw how happy I was, I think it pissed her off. I think she decided that I was the latest thing she just didn’t want anymore.</p><p>“I wasn’t perfect,” he admitted when I made a derisive snorting noise. “The more Lindy tried to tell me what I should and shouldn’t do, the more I dug in and did what I thought I needed. I thought that once the place was finished, it would get better. Livin’ our life in this house, livin’ up to its potential, was supposed to fix things. But then I took that job for Hans and got turned. I know it was scary for her, not knowing if I was dead or not, not knowing what it would be like, married to me. But hell, it was scary for me, too. I woke up, and she was gone. Our life together was gone. And when I tried to talk to her about it, well, she freaked out. Called me a monster, told me to stay away from her. And I... may have gotten Hulk-angry and thrown a couch through a window.”</p><p>“Wow.”</p><p>“Not my finest moment,” he admitted, running his fingers through his unruly hair. His mouth formed a slanted, rueful grin. “Lindy, of course, insisted I was too dangerous to be around normal people. Called her family, our friends, my friends here in town, to ‘warn’ them about my new nature and how fast I could turn on humans. Damn near ruined the life I’d built here, but she was scared and confused, and I guess I can’t blame her.”</p><p>I muttered, “I can.” He frowned at me, making me shrug. “I’m a grudge holder.”</p><p>“She’s puttin’ the house on the market on October 28,” he said, his voice toneless and resigned. “All the property went to her when I died. But thanks to the Council’s intervention, I got to stay here, and she had to return the holdings for my construction business—the business account, the tools, equipment, and such—and I have until October 28 to buy her out of the house. I’ve been working a little, doing nighttime projects for one of our neighbors, Mr. Calix. He’s added a fence, an outbuilding, and a finished basement to his house in the last few months. I think he’s just doin’ it because he’s tryin’ to help me out, but he’s too nice to say anythin’ about it. It hasn’t been enough to save what I need.”</p> <p>I muttered, “That explains why the drills didn’t start until the wee hours some nights.”</p><p>“I had to squeeze annoyin’ you in where I could,” he admitted, grinning sheepishly. “I am sorry you got pulled into this mess. Lindy was using you, leasin’ the house to you while I was still here. She was countin’ on something called the Vampire Squatters’ Act. Right after the Comin’ Out, human mortgage companies and landlords got tired of newly turned vampires just walking away from their homes, figurin’ that mortgages and leases didn’t apply to them anymore. So the government declared that any vampire who left their property for more than thirty-two days had abandoned it.</p><p>“She must have a buyer lined up already. If I raise the money before the deadline, she has to sell me the house. That’s why she rented it. She thought if some tenant annoyed me enough, I would move out for the length of the lease, and the house would be considered abandoned to her. She’d be free to sell it without giving me a dime.”</p><p>“So I was her backup plan? I think that hurts my feelings,” I mumbled, my face flushing hot with shame. No wonder Sam had put up such a fight against leaving, despite my campaign against him. I hated the idea that I’d been helping Lindy, albeit unwittingly, try to drive Sam away from this place. The manipulative little wench would pay for that.</p><p>“I’m really sorry about the crickets,” I said, my voice soft. “And the ghost chili. And gluing your car keys to the counter. Well, I’m pretty sure you deserved the chili thing, but—this is not how a normal person behaves. I’m sorry. I can’t leave, but I don’t want to be this crazy wok-swinging whackaloon anymore. If we could just find a way to share the house for just a little while longer, I swear I won’t attack you again. I’m supposed to be resting, not plotting.”</p><p>“I don’t want to do this anymore, either. I’m afraid we’re going to escalate to the point where one of us is left with a permanent limp,” he said. “And to my everlastin’ shame, between the two of us, your pranks seem to be more effective, so I’m all for a ceasefire.”</p><p>“It’s not even that I don’t like you,” I said, wiping at my dripping nose with my sleeve just as Sam tried to hand me a red bandanna from his back pocket. “There’s nothing specific about you not to like. Other than your mere presence.</p><p>“I will stay out of the basement,” I swore. “If you agree to stay away from my cookware.”</p><p>“Agreed,” he said, patting my shoulder again. “We’re goin’ to be OK. When I’m not actively tryin’ to get rid of someone, I’m actually a very easygoin’ roommate.”</p><p>“Oh, sure, you’re a charmer.” I lifted my head and looked directly at him for the first time since the conversation started. It amazed me that I could move it so easily. My neck felt as if it had had a bowling ball lifted off it.</p><p>“If we’re going to make an honest go of this, we’re going to have to abide by some rules.”</p><p>“More rules? I’ve already agreed not to attack you with kitchen implements!” I exclaimed, feigning indignation.</p><p>He gave me a withering, and somehow incredibly sexy, glare.</p><p>“Such as?” I asked.</p><p>“I stay out of your room,” he said. “And you stay out of mine.”</p><p>“Like I wanted to visit your lair.” I snorted.</p><p>“I think a part of you is a little curious about it,” he said, grinning cheekily.</p><p>“I’m a little curious about tattoos,” I shot back. “Doesn’t mean I’m going to get a tramp stamp.”</p><p>“I think you’d look hot with a tramp stamp,” he said, tilting his head and giving me a long, speculative look that made a shiver ripple up my spine. “A cute little kitten... wavin’ a very sharp knife.”</p><p>“Funny,” I retorted. “And on that note, I promise that I won’t threaten you with my knives anymore. No more hitting you with pans. No more tainting your blood with evil pepper juice. If you’re civil to me, I’m civil to you. It’s what I should have said in the first place.”</p><p>“Agreed. And I will stop callin’ you a psycho.”</p><p>“You called me a psycho?”</p><p>He shrugged. “Not to your face.” He took a long pull from the bottle of synthetic blood, the faintest lines of a grimace crinkling the corners of his mouth.</p><p>“Not as good as the real thing?” I asked.</p><p>His brows drew up in surprise. “You offering?”</p><p>“No,” I said, shaking my head emphatically. “No, no, no. I’m just curious about what that tastes like to you. What would make it taste better, that sort of thing. I’m trying to enter this cooking contest for vampires—”</p><p>“The Bloody Bake-Off?”</p><p>“Yes, and I can’t quite get a grasp on what I’m supposed to be doing. It’s more than that—I’m, aw hell, I’m just sucking beyond the telling of it.” I unwrapped the remnants of the red-wine reduction sauce and held it up for him to sniff. “I’ve done everything I can to cover up the taste of the synthetic blood, but all of my efforts made my vampire friends sick. And if I don’t figure out what I’m doing wrong, my life here in the Hollow is going to be... well, less than I’d hoped.”</p><p>He brought the sauce up to his face and winced. “You’re probably lookin’ at it from your own perspective, what tastes good to you. You make something that sounds good for a human palate and then add some blood. You need to think about what tastes good to a vampire, start with the blood, and work from there.” He held up the half-empty bottle of synthetic blood. “This doesn’t taste like anything. For vampires, it’s not so much bein’ hungry as bein’ really, really thirsty. You can’t think of anything else until you feed. Human blood, donated or live-fed, answers that thirst and lets you think clearly again. This? This is like drinkin’ water when you could be havin’ an ice-cold lemonade.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hmmph.”</p><p>He snickered at my distaste. “I take it that you’ve never thought about being turned into a vampire?”</p><p>I pulled a frown. “Well, everything I cooked would taste spoiled and rotten to me. Not exactly a great career move.”</p> <p>“Good point.” He sighed, pushed to his feet, and wiped his hands on his jeans, as if his palms had been sweating. “OK, get up, wash your face, and show me some of these samples that made your friends upchuck.”</p><p>I sniffed, more than a little startled by his friendly tone and the way he stretched his long fingers toward mine. I was sure I’d misheard him. “What?”</p><p>“Look, I’ve tried coming up with a contest entry of my own, but I can’t boil water without startin’ a fire. And you can’t seem to grasp the whole vampire-taste-bud thing. But if we combine our efforts, we might have a chance at winnin’ this thing.”</p><p>“That’s why I’ve been finding the burned pans? You were cooking on your own?”</p><p>“Sadly, yes.”</p> <p>I cackled, making him pout a little. “What temperature setting were you using on the stove?”</p><p>He frowned. “There are different settings?”</p><p>I rubbed my temples. “I weep for you, I really do. But I have plans for that prize money, as much as I want to help you stick it to Lindy.”</p><p>“I know, you just bought Howlin’ Hank’s, and you need the money to fix it up,” he said. When my jaw dropped, he added, “It’s a small town. Word gets around, even to the hermits.”</p><p>“So if you know I need the money, why are you asking me to do this?”</p><p>He dropped to bended knee in an exaggerated show of chivalry. He took my hand in his cool, slim fingers and pressed both over his still heart. His dark eyes twinkled as he looked up at me. “Because I have a proposal for you. I’ll help you perfect the recipe for your entry. If you win, you give me the prize money so I can buy the house from Lindy. In exchange, I will do all of the renovations on your restaurant, for the cost of materials.”</p> <p>“You’re screwing with me,” I scoffed. “If I helped you, and I’m not saying I will, you would run off with the money, leaving me with squat.”</p><p>“I wouldn’t,” he swore. “I may be a lot of things, but I’m a man of my word. And if it makes you feel any better, I’d sign a contract with you, guaranteeing my services. We could file it with the Council office.”</p><p>I pinched my lips into a prim expression to prevent the crazy grin that threatened to split my face. “I have other vampire friends who are willing to be my guinea pigs.”</p><p>“None of them can hang drywall like I can.”</p><p>Why did that sound slightly dirty when he said it? I eyed him suspiciously. As much as I wanted to rain some sort of biblical vengeance upon Sam’s snotty blond ex, I didn’t really want to be pulled into their marital drama. I did not need to take on other people’s stress when I was just learning to manage my own, and I found angry-married-people baggage to be particularly distasteful. But Sam had been honest with me, more honest than my last three boyfriends. And frankly, he did do some very nice work around the house. I would love to see what he could do for the restaurant.</p><p>“Come on, Tess, what do you say?” he said, the sound of my name on his lips making my stomach do strange, flippy things.</p><p>I shuddered but managed to maintain what little composure I had left as I said, “I don’t even know if I want to use you as a contractor.”</p><p>“Aw, come on, you can play dirty all you want, but don’t play dumb,” he countered, sounding miffed at the slight against his abilities.</p> <p>Snickering, I reached out my other hand for an official shake, then retracted it, narrowing my eyes at him. “This isn’t another prank?”</p><p>He dropped my hand and held up his own in a mockery of the Boy Scout oath. “I promise.”</p><p>“I’m going to need some time to think about it.”</p><p>He rose to his feet, standing a little closer to me than I was comfortable with. I backed up, only to bump against the counter. “I understand. And while you’re thinking, I just want you to consider one thing.”</p><p>“What?”</p><p>He grinned at me with those sharp white teeth, making my knees wobble a bit. I held on to the counter for support as he leaned closer and whispered, “How much it’s going to piss Lindy off when she realizes her ‘renter’ is helping to snatch the house out from under her.”</p><p>Blending Oil and Water</p><p>8</p><p>Hey, Sam!” I called. “Would you come taste this?”</p><p>I hovered over the rust-colored mixture bubbling merrily in my saucepan, waiting for just the right moment of consistency to remove it from the heat. I whisked the pan from the stove and stirred it carefully before noting the time and cooking temperature in my little recipe notebook.</p><p>On the other side of the house, I heard the whining peal of an electric drill. But this time, instead of attempting to drive me insane, Sam was putting up a heavy-duty curtain rod for sunproof shades.</p><p>In the last week or so, we’d developed a routine at the Lassiter house. I would visit Jolene, nap, or experiment with new recipes during the day. Then I’d make dinner and warm up some blood just in time for Sam to rise. We’d eat together, hold completely ridiculous conversations about ’80s music, our favorite tacky monster movies, and whether reality television would be the social factor that finally triggered the apocalypse.</p><p>Sam would work through the samples I’d prepared that day, and—depending on whether or not I’d made him violently ill—we’d spend the rest of the night making small changes in the recipes.</p><p>While we talked about movies, music, food, sports, and any number of pop-culture phenomena, we rarely ventured into territory as personal as his revelations about his marriage to Lindy. It seemed to have made him uncomfortable, being that open, and he’d retreated to safer topics. That was fine, as long as we kept talking. Now that we were on the same team, I was seeing a whole new side to Sam—funny, laid-back, sensible, easy with a smile, and quick to admit when his cooking advice went horribly awry. I didn’t feel I had to play down my accomplishments, as I had to with so many men I’d dated before. I didn’t have to pretend to be a delicate little flower who rarely ate more than a salad with dressing on the side. Because Sam knew I was neither delicate nor flowerlike. And he’d seen me eat an entire quart of Three Little Pigs hash-brown casserole in one sitting. I could be myself with Sam, the unglossed, cooking-in-a-wife-beater-and-yoga-pants, “real” version of me that Phillip hadn’t met until we’d been dating for six months. We’d barely lasted seven.</p><p>I would miss our evenings together when I moved into the apartment over my as-yet-unnamed eatery. Maybe we’d arrange some sort of vampire-food-for-maintenance-work barter system after I opened, just so we could keep in touch.</p><p>I spent several afternoons helping Chef Gamling with the church dinners. On the rare evening I didn’t spend with Chef or Sam, I was with Jolene and her friends. Jolene was very quickly becoming my first meaningful friendship outside of the kitchen. She was funny, warm, smart in a no-nonsense, “don’t try to screw with me just because I’m gorgeous” way that sort of made me want to have her babies. Not that I would, because (a) science wasn’t quite there yet, and (b) she seemed pretty attached to Zeb, for whom I also had very fond feelings.</p><p>I’d found a circle of friends here. And I was really enjoying my time with them. Jolene had talked her uncles into letting me shadow them in their kitchen at the Three Little Pigs. Jane had invited me to one of her infamous girls’ movie nights, which guaranteed that I would never look at Jane Austen adaptations ever again.</p><p>Sam’s voice behind me drew me out of my musings. “You hollered?”</p><p>“Did you like Italian food when you were human? Because this has chicken stock and Marsala wine. The cooking process should have left a result that won’t make you sick.”</p><p>“Should?” he said, eyeing the shot glass suspiciously.</p><p>Without responding to his concerns, I added, “Just try it.” I pushed the shot glass toward his lips.</p><p>“But you said you weren’t sure about it,” he protested.</p><p>I took the shot glass out of his hand and pressed it to his lips.</p><p>“That’s not bad,” he said.</p><p>“No nausea?”</p><p>“Can I have another?”</p><p>“Try this one,” I said. “It’s like barbecue sauce. Honey, liquid smoke, pork stock, and other by-products you may not want to know about.”</p><p>“There’s pig’s blood in here?” he said, wrinkling his nose.</p><p>“How is it different from drinking human blood?” I asked. “Besides, if you ate bacon in life, it’s a little hypocritical to turn your nose up at pig’s blood now.”</p><p>“Oh,” he said, sighing, after knocking back the shot. “Now I just really miss ribs.”</p><p>“My blender cannot handle rib bones,” I told him.</p><p>“This,” he informed me, lifting the barbecue sauce, “is awesome. If you could bottle this, you would kick the crap out of Paul Newman and his salad dressings.”</p><p>“Paul Newman’s dead,” I reminded him, narrowing my eyes. “Unless there’s something you and the vampire community have to explain to me.”</p><p>“That’s not nice,” he said. “You could be the first celebrity chef for vampires, like Rachael Ray or, if Mr. Gamling keeps giving you those dumplin’s, that Paula Deen chick.”</p><p>“Thank you for reminding me why being nice to you is never a good idea, you ass.”</p><p>He leaned in close, his brown eyes twinkling. “Oh, come on, Tess, I’m sorry. You can be as nice to me and my ass as you want.”</p><p>“I’m not touching that one.”</p><p>He smirked. “You know you want to.”</p><p>“Do you want to go back to cricket warfare again? Because I’m feeling a trip to the bait shop coming on.”</p><p>He shuddered, giving me the vampire puppy-dog eyes, which was just disturbing. “Please, ma’am, don’t unleash your biblical plagues of bitchery upon my household.”</p><p>I laughed, shoving at his shoulder. He was so close, and my arm was pulled flush against his chest. I closed my eyes, enjoying the vibrations from his laughter traveling from his chest through my fingertips, all the way up my arm to my heart. It was like feeling the pulse he no longer had. I felt my lips part in a smile so wide my cheeks ached. This wouldn’t do. I couldn’t let him see that smile and know what a big part he played in it. I dipped my head, glancing down at the feet so closely arranged we could have been dancing. My forehead brushed against his shoulder. He tucked his fingertips under my chin and tilted my head toward his. His eyes were hooded and dark and stared right through me. His lips looked so soft, even turned into that slightly mocking grin he was giving me. I could stand up on my tippy-toes, or maybe on a chair, and kiss him so easily.</p><p>But I didn’t.</p><p>Smiling awkwardly, I stepped away and took a deep breath. He wasn’t ready. And no matter how loudly my raging hormones screamed, You moron, do you realize how long it’s been since anyone has gone near your forbidden zones? I couldn’t be the one to decide that he was over his ex-wife.</p><p>He was going to have to make the first move. And considering the fact that I was standing immediately lip-adjacent and he didn’t give me a 20 percent lean-in, I didn’t think he was going to be doing that anytime soon.</p><p>“So, the barbecue sauce, huh?”</p><p>He nodded, taking a step back. “That’s your winner.”</p><p>—</p><p>The nights went by faster than I imagined they could. We focused our efforts on perfecting the barbecue sauce. We experimented with cooking times, temperatures, spices, sauce bases, until Sam pronounced it almost as good as eating real food when he was human. Sam and I visited the restaurant and discussed the changes he would make, including improvements to the apartment upstairs. My calendar filled up with closings with the Realtor, appointments with the bank, and drinks with the girls. Before I knew it, we were bumping down the country road toward town in Sam’s truck, with our contest entry carefully balanced on my lap. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t be nervous,” Sam told me.</p><p>“Can’t help it,” I said, leaning my head back against the seat rest. “There’s a reason I hide in a kitchen all day. I’m not good with crowds.”</p><p>He nudged me with his elbow. “You’re going to be fine.”</p> <p>“Liar.” I sighed.</p><p>Sam’s truck smelled nice, like Murphy’s Oil Soap and piña colada air freshener. This was a very different vampire from the one I’d been pranking. He was relaxed, if not quite happy, as he hummed along to George Strait. He actually smiled at me when he emerged from the basement earlier and complimented me on the little red sweater I’d paired with jeans. It felt natural driving along with him like this, almost like a date, if one’s first date involved hauling several servings of synthetic blood around in a warmer.</p><p>Sam pulled the truck to a stop in front of an old bank building, near Howlin’ Hank’s. While I stared, bewildered by the sheer number of cars parked in front of the darkened buildings, he pulled me out of the truck and helped me with our parcels.</p><p>While parents hauled sunburned, exhausted children to their cars, the “night shift” for Burley Days was arriving in droves. The town square was bustling with laughing humans and vampires toting an odd assortment of cheap stuffed animals. Red, white, and blue twinkle lights hung from every stationary object, giving the square a festive glow. Gleeful screams echoed over the insistent country and western music pumped over the PA system.</p><p>We carried our sauce samples in a foam chest lined with warming gel packs. As we walked, I noticed several people watching Sam, flashes of recognition flitting across their faces before they averted their eyes. They were human, I could tell by their tans, and they refused to make eye contact. They didn’t exactly turn their backs, but they definitely weren’t giving him manly fist bumps. Were these people Sam’s friends and clients before he was turned? What had Lindy said to them that would make them retreat this way? My irritation with Sam’s ex ratcheted up to “bitch-slap on sight” levels.</p> <p>When Sam took my hand to lead me through the crowd gathered in front of the dunking booth, I gave his a little squeeze. He dropped it as if I’d burned him, but I tried not to take it personally. Earlier head patting aside, it must have been strange to have me touching him after I’d done everything in my power to injure him.</p><p>We spotted the garish black and red Faux Type O booth near the center of the square. Two tall black columns flanked a long red-swathed table. A black banner proclaimed Half-Moon Hollow’s historic participation in the first-ever Bloody Bake-Off. A handful of people, human and vampire alike, were lined up at the registration point, holding various containers. One woman, with heavy circles under her eyes and a cigarette dangling from her lips, seemed to be holding a pitcher of bloodred margaritas. She actually had me worried. But we registered our entry, which we were calling “Blood Creek Barbecue Sauce,” with little incident. A registration number kept our entry anonymous and prevented bias from the judges. That made me feel a bit guilty, considering that Jane had helped me taste-test. But she’d never tasted the final sauce. Heck, the fact that she’d tasted my lesser efforts would probably keep her from guessing which one was mine.</p><p>We were given a goodie bag courtesy of the local Council office, just for participating. The contents included a sample of Solar Shield SPF 500 Sunblock, iron supplements, a six-pack of Faux Type O, and a to-go-sized container of Razor Wire Fang Floss.</p><p>“I’m just going to let you hold on to that,” I said, handing the tote to Sam.</p><p>“Probably for the best,” he said, peering into the bag. “They make mouthwash just for vampires?”</p><p>“You have so much to learn about your own culture,” I said.</p> <p>“A bag full of blood and dental supplies is culture?”</p><p>“It’s some culture. Speaking of which, what do we do now?” I asked. “We’ve got an hour before the results are announced.”</p><p>“Now we explore the magic and mystery of Burley Days.”</p><p>Sam led me through the rows of food vendors and rigged games and a particularly bewildering antiques mall. We stopped in front of a table where a dozen grown men were participating in a Frito-Pie-eating contest. I watched in horror as they dove face-first into a combination of corn chips, chili, and cheese, lapping it up like ravenous dogs.</p><p>He chuckled, dragging me away from the carnage. “This must be hell for you.”</p><p>“No, but it will be when the first ‘loser’ sicks up his efforts,” I said, shuddering. “Haven’t you people ever heard of fruit pies?”</p><p>“No,” he said, laughing harder. “I meant there are no fancy food emporiums, no Apple Stores, only one Starbucks within a fifty-mile radius. Growin’ up around that sort of thing, you probably take it for granted until you end up in a place like this.”</p><p>“I didn’t grow up around it.” I scoffed. “I grew up in Hader’s Knob, Missouri. Population five thousand thirty-four.”</p> <p>He frowned as he seemed to mentally review all of the conversations we’d had over the last few nights. “I just assumed.”</p><p>“You never asked,” I said, smirking. “It wasn’t the greatest place to call home. The liquor stores and the pawn shops were the only businesses that did well.”</p><p>“Do you ever go home to visit?”</p><p>I shrugged. “No reason to. My parents were killed in a car accident when I was in college. Chef Gamling was the one who drove me home from school to help me arrange my parents’ funeral. He was the one who helped me figure out how to handle their mess of an estate. And he’s right here in the Hollow, so where else would I go?”</p><p>“So you’re a small-town girl,” he said, eyeing me speculatively. “Bein’ a small-town boy myself—Mount Pleasant, Tennessee, thank you very much—I can appreciate that. How’d you end up in Chicago?”</p><p>“Culinary school,” I said. “My dad thought it was nuts, but Mom said I should follow my dream, even when that dream led me about four hundred miles away from them... which was half of its charm.”</p><p>He made a waving motion with his hand, as if to say, And? When I didn’t respond, he nudged my ribs with his elbow. “Woman, I’ve seen you weepin’ over maimed kitchen gadgets. You know about my torpedoed marriage. And I’ve made out with you under the influence of evil peppers. We have no secrets.”</p><p>“My parents didn’t fight, exactly. They bickered a lot, but I can’t remember them ever really raising their voices. They were locked in this bizarre constant battle for who was winning at the relationship. One of them was always leaving the other one, demanding apologies, demanding that I take sides one way or the other. They separated, they got back together, they separated, they got back together, over and over.” The words seemed to rush out of my mouth like water. And when they’d finished, I was a bit out of breath but felt lighter. I frowned, mulling over what it meant that I could say those things to Sam in the middle of a crowded street but not to my mentor or licensed psychiatric professionals.</p><p>“That must have been... confusin’?” he suggested, with a wary expression on his handsome face, as if he wasn’t sure if I was joking, but he knew he wasn’t supposed to laugh.</p><p>I shrugged. “They always said they were staying together for my sake. Because clearly, it would traumatize me if my parents got a divorce, but telling me every other month that ‘this time it’s over for good’ was OK. Frankly, I would have been relieved if they’d just made a clean break of it. Lived separate lives. Maybe they would have been happy apart. Maybe it was selfish of me to want to get away from that. And believe me, the fact that they died with so much between us unsettled—there isn’t a day that goes by that I don’t regret that. But I had to have my own life. I just couldn’t spend another minute mixed up in their drama. Either you love somebody enough to spend the rest of your life with them, or you don’t. In my mind, there’s not much room in between.”</p><p>“I’m sorry,” he said, closing his hand around my shoulder and pulling me into a sort of side hug.</p><p>I nodded, once again marveling at the loose, relaxed feeling in my chest. “And now the only real family I have is a cranky old German professor and his life partner, both of them trying to fatten me up with dumplings and monkey bread.”</p><p>After a long, contemplative pause, he nodded and sagely observed, “I thought I noticed a little more junk in your trunk.”</p><p>I took a swat at his shoulder. “Jerk.”</p><p>“Ouch!” He dodged and cackled at me, drawing the eyes of several curious bystanders. “It’s not right that someone so small can hit so hard. I’m going to miss your gentle, delicate mannerisms after you move out.”</p><p>“Oh, come on.” I snickered. “You know you’ll miss me.”</p><p>His smile faltered. His lips parted as if to say something, but before he could, I heard Jolene cry, “Tess!” from across the square. I turned to see her dragging a bemused Zeb in her wake. Jolene threw her arms around me in an enthusiastic, if slightly painful, hug. “Are you excited about the contest?”</p><p>“Nearly wetting myself,” I assured her, patting her back. “Sam, I think you know Zeb and Jolene Lavelle. Zeb and Jolene, my, uh, roommate, Sam Clemson.”</p><p>“Nice to see you again, Sam,” Zeb said, holding out his hand.</p><p>Sam smiled, almost shyly, and shook it. “Good to see you two. How are the kids?”</p><p>As Zeb whipped out a cell phone full of photos, Jolene launched into a story about little Joe the pickle flinger and his attempts to chew his way out of his crib. Sam listened with interested amusement, oohing and aahing appropriately at the cuteness of my friends’ offspring. This kept us all sufficiently distracted until we heard, “Ladies and gents, if you’ll proceed to the center stage, we’ll announce the results for the Hollow’s First-Ever Bloody Bake-Off,” from a human man in his forties shouting into the microphone near the Faux Type O booth. A teenage girl dressed in a red gingham picnic dress—whom Jolene identified as the scary teen-vampire bureaucrat Ophelia—shrank away from him, as if his loud “yee-haw” was going to make her ears bleed.</p><p>As the crowd milled over to the main (and only) stage, Ophelia snatched the mic out of his hands and eyed the poor, unsuspecting man in a way I’d only seen diabetics case the dessert cart. She sighed and turned to the vampires wearing “official judge” sashes. All of them, including my hapless friend, Jane, had their arms crossed over their middles and looked slightly ill.</p><p>“We were very pleased to receive such a wide array of entries, everything from a Chum Cherry Slushie to a Bloody Pot Pie,” Ophelia said, smirking at Jane, who sent her a hard look in return.</p><p>Even in this crowd, I could hear Sherry Jameson saying, “Well, she used to love them when she was human!”</p><p>Poor Jane.</p><p>I found it a little disturbing that Ophelia hadn’t mentioned the barbecue sauce. Did that mean something? Did that mean that my entry hadn’t been memorable enough to mention? I’d felt pretty comfortable with my submission when I got here, but now, seeing those nauseated expressions on the judges’ faces—Oh, my God, what if I lost a cook-off in small-town Kentucky to a bunch of homemakers? What if I failed, leaving Sam without a house and myself without a construction budget? The sudden rush of cold, hard fear up my spine had me bending slightly, bracing my hands against my knees.</p><p>I felt cool, insistent pressure at the base of my neck. It rubbed in soft circles over my nape, and I realized it was Sam’s hand. I peered up at him through the haze of hair that hung over my face.</p><p>“It will be OK,” he promised. “Now, suck it up, people are starting to stare.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Got it,” I said, clearing my throat and straightening to my full (though not impressive) height. “Thanks.”</p><p>I rolled my shoulders and took a deep breath. I noticed that Sam’s hand remained on the back of my neck, his thumb occasionally sweeping over my vertebrae. I shivered a bit, but Sam kept his hand there.</p><p>“Now, before I announce the award winners, which will be included in the first-ever Faux Type O cookbook, Blue Ribbons with Bite, I’d like to announce the honorable mentions. First, we have Rita Scott with her Chum Cherry Slushie, a delightfully pulverized mix of blood blended with cherry syrup and ice.”</p> <p>A plump, pretty blond woman in a bright pink church dress squealed joyfully and went to the stage to accept her yellow ribbon and certificate. Jane turned slightly green around the gills. I gave her a sympathetic look but then started to giggle. She made a very rude gesture behind the thin shield of her left hand. When Ophelia announced the second honorable mention as Ginger Lavelle with her Bloody Mary Margarita, the haggard chain-smoker I’d seen earlier launched herself at Ophelia and snatched her victory ribbon, waving it like a war banner. Ophelia stepped out of range, an unimpressed grimace twisting her young features.</p><p>“Lavelle?” I looked to Jolene. “Any relation?”</p><p>Jolene huffed out an irritated sigh. “That would be my mother-in-law.”</p><p>We watched as Ginger Lavelle did a victory shimmy that looked like something from a burlesque performance. “Wow,” I marveled.</p><p>“Well, she stuck with her area of expertise,” Jolene grumbled. “Booze.”</p> <p>I expected Zeb to take offense at this, but he just nodded. “It’s possible she would have stumbled upon this recipe without the contest.”</p><p>Ophelia moved on to the prize winners. Third place and a thousand-dollar check went to a blood-and-beef-broth concoction created by Martha Hackett, a sweet-looking elderly lady I’d assumed was human until she grinned and flashed her fangs at the crowd. The fact that another name was called filled me with equal parts dread and hope. If I hadn’t placed third, it was likely that I’d placed second or first. Then again, I might not have placed at all. I imagined the humiliation of explaining to Chef Gamling that I hadn’t... and there I was, bent over hyperventilating again.</p><p>“Would you stop that?” Sam exclaimed, pulling me upright and pressing me against his side.</p><p>Second place went to Lulu McClaine’s Thinned Blood Pudding, a “charming drinkable dessert that tickled each judge’s palate.” Jolene whooped and cheered for her aunt before giving me an apologetic look. “Sorry, family loyalties.”</p><p>I groaned. I knew I should have made blood pudding!</p><p>“This is what we want,” Sam reminded me. “We’ve still got a shot. And if you throw up on me, I will get seriously pissed at you.”</p> <p>I kept my face buried in my hands as Ophelia built up to the announcement of first place, describing the fabulous photo spread each prize winner would receive in the cookbook, the cash prize, and, of course, “the knowledge that the winner had helped new vampires adjust to their new diet.” Finally, Ophelia felt that she’d tortured us enough and exclaimed, “Every judge was pleased with the first-prize winner. For our recently turned panelists, it was everything good about summer cookouts, without the regrets of solid food on the vampire digestive system. Ladies and gentlemen, the winner of the Faux Type O Bloody Bake-Off and the twenty-five-thousand-dollar grand prize—Blood Creek Barbecue Sauce by Tess Maitland and Sam Clemson!”</p><p>If there was applause, I couldn’t hear it. I was frozen, unable to move or see anything beyond Sam’s face and its elated expression. His bright, unearthly smile lit up the town square. We’d done it. We had the money to buy the house out from under Lindy. I could stay in the Hollow and live in the place I loved. For the first time, everything I really wanted was in my grasp.</p><p>Jolene hugged me, and I shrieked, hopping up and down like a maniac. Sam laughed, watching with amusement as I seemed to lose my mind. I threw my arms around him and squeezed until he made a wheezing uhf sound. I beamed up at him.</p><p>Well, maybe not everything I wanted. But it was a good start.</p><p>“You put my name on the entry slip?” Sam asked as we made our way to the stage. “I didn’t see you do that.”</p><p>As an overenthusiastic well-wisher slapped me on the back, nearly bowling me over, Sam caught my elbow and shot the guy a dark look. I laughed, waving off the back-slapper’s apologies. “Of course I did. You were just as much a part of the creative process as I was. Without you, the vampire judges might have ended up in the hospital with food poisoning.”</p><p>He gave my arm an affectionate squeeze. “Thanks, Tess. I mean it.”</p><p>“I meant it, too,” I countered. Sam leaned in closer to me, his eyes intent on my upturned mouth. I smiled up at him, my hand slipping over the fingers gripping my arm.</p> <p>From the stage, we heard a none-too-subtle throat clearing. Ophelia stood there, holding an oversized novelty check, her eyebrows arched. I blushed, and Sam gave her an apologetic shrug. We crossed the stage and claimed the giant check and the blue ribbon. We shook the judges’ hands. And while Jane was clearly trying to maintain the appearance of objectivity, the excited squeeze she gave my hand nearly brought me to my knees.</p><p>“I didn’t know it was yours, I swear,” she whispered. “After all, your first efforts were so... uh, raw. I thought you’d made the Valentine’s Day Massacre Marinara Sauce.”</p><p>“That’s so wrong,” I whispered back.</p><p>Jane shuddered. “Yes, it was.”</p><p>Ophelia motioned for me to join her and Sam at the mic. I blinked at the sheer number of people gathered in front of me. Oh, hell. This was why I hid out in the kitchen at work. I was not great in front of crowds. Ophelia gave me another nudge toward the mic, where I spluttered, “Um, th-thanks. Thanks so much for this. I’m thrilled.”</p><p>Ophelia looked less than impressed with my oratory skills, and when I tried to back away from the mic, she looped her arm through mine and kept me in place. “Tess is a recent addition to Half-Moon Hollow. One of our judges has informed me that our winner will be opening a restaurant here in town soon. And I’m sure she will have a wide selection of vampire menu items.”</p><p>Ophelia gave me a pointed smile, which I supposed deserved a response. “Uh, sure.”</p><p>“What are you going to call your establishment, Tess?” Ophelia asked.</p><p>I floundered, my cheeks hot. I couldn’t believe I still hadn’t come up with a name for the place yet. Stricken, I looked up to Sam, who leaned into the microphone and announced, “Miss Maitland’s new restaurant will be called Southern Comforts.”</p><p>“Yes,” I squeaked. “Southern Comforts.”</p><p>“Well, I’m sure we’re all looking forward to the opening,” Ophelia said, smirking. The crowd applauded, and I waved halfheartedly. Ophelia leaned closer and whispered, “You should go now.”</p><p>Still a bit rattled, I nodded, and Sam led me offstage. Ophelia’s assistant gave us paperwork to sign and details about collecting our winnings. We also received a large cast-iron pot full of Faux Type O products to “continue our experimentation.”</p><p>After we thanked Jane again, she warned us to beware the unexpected gift basket and the potential trouble it could bring into our lives. Explaining that Jane had “issues” with gift baskets, Jolene and Zeb helped us lug the check and the cast-iron albatross to the truck. Then they insisted on taking us for drinks over at the Fraternal Order of Police beer garden. I noticed that Sam snagged one of the “special occasion” bottles of Faux Type O High Life before walking back with us.</p><p>“Thanks for naming my restaurant for me,” I told him as we took our seats at a picnic table near an improvised stage, where the night-shift sergeants picked out old country-western standards on acoustic guitars.</p><p>Sam grimaced. “Yeah, sorry. You just had this frozen deer expression, and I didn’t know how long it would take you to snap out of it.”</p><p>“Or Ophelia could have snapped on you,” Zeb observed.</p><p>“It’s OK, I like it,” I said. “Southern Comforts has quite the ring to it. And it fits with the theme I’d planned.” Sam sipped his drink, looking pleased, so I added, “Of course, you’re going to have to be my guinea pig.”</p><p>He chuckled, then straightened his expression into a frown. “I never agreed to that.”</p><p>“I think you’ll be willing to renegotiate,” I said, arching my eyebrows into a supervillain expression. “Or I will lace every bottle of blood in that gift basket with ghost chili oil.”</p><p>He narrowed his eyes at me. “You are the most twisted, evil little thing.”</p><p>“Why does that sound all sexy when he says it?” Zeb asked his wife.</p><p>Shaking her head, Jolene raised her cup of beer in a toast. “Here’s to your first Burley Days.”</p><p>“So far, it hasn’t sucked,” I added, clinking my cup against hers. I caught Sam’s eye before repeating the gesture against his blood bottle. “To ceasefires.”</p><p>Sam’s lips quirked into a grin. “To ceasefires.”</p><p>—</p><p>A few beers later, Sam decided it was time to leave. I kept lingering, discussing plans for the restaurant with Jolene, until Sam and Zeb shared a determined “manly men together” look and dragged us away from the table.</p><p>“You know, if you make too much of a show of this, some very ugly rumors about vampire brutality on tourists will start spreading around town,” I told Sam, snickering as he slung me under his arm like a football and carried me down the darkened sidewalk to his truck.</p><p>“Yeah, because I have such a great reputation.” He grunted as he hauled me toward the truck. “My God, woman, how much funnel cake did you eat?”</p><p>“Nice.” I barked out a laugh while he opened the truck door for me. He grinned down at me, giving me a boost as I climbed into the passenger seat. His hands were resting on my hips, and I had the strangest urge to map that little constellation of freckles on his cheekbone with my tongue. His lips parted, and I leaned forward just in time to hear—</p><p>“Sammy?”</p><p>Breaking a Few Eggs</p><p>9</p><p>The spell broke as we turned to find Sam’s ex-wife standing on the sidewalk, gaping at us.</p><p>“Sammy, what are you doing here?” Lindy demanded, shrugging off the insistent arm of a blond, tan man in jeans and pink polo shirt. The guy was in his midthirties and had intentionally popped his collar.</p><p>An unfiltered expression of pain flashed across Sam’s face, particularly when he saw Mr. Popped Collar’s arm around Lindy’s shoulders.</p><p>“You know it’s not a good idea for you to be out in public.” Lindy sighed, as if she were scolding a small child. “You know how you are. What if you hurt someone?”</p><p>“I’m fine.” Sam growled, ever so subtly stepping away from me. I looked to Popped Collar, to gauge how he felt about interloping in the Clemsons’ bizarre marital drama. He appeared to be playing Angry Birds on his phone.</p><p>“Still, maybe I should take you home,” Lindy fussed. “You know how you get around humans. This has to be pushing your control to the limit. Let’s just get you home before you hurt someone.”</p><p>“Don’t you worry about me!” Sam barked. “You owe Tess here an apology for dragging her into our mess. How could you rent the house without even talkin’ to me? That’s out-there, even for you, Lindy.”</p><p>“Sammy, I didn’t want to rent out the house, but I needed the money,” she said, her voice rising to a wheedling, babyish tone that grated on my nerves. “You know how expensive it is to start up with a new apartment. I just need a little extra to put down the security deposit.”</p><p>I huffed. “Oh, come on!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sam turned to me with a weird, glazed expression, as if he’d almost forgotten I was there, despite the fact that he’d just spoken about me. “Could you just give me a minute?” he asked.</p><p>I sighed. “Fine.”</p><p>I climbed into the truck and slammed the door. Unfortunately, Sam’s windows were pretty solid, and I couldn’t hear what was being said on the other side of the glass. That was a shame, because Lindy appeared to be wailing like a banshee, and Sam was waving his arms to an invisible orchestra.</p> <p>Sam’s fangs kept popping down, which was a problem for new vampires not quite in control of their emotions. Of course, every time it happened, Lindy flinched dramatically, which only made Sam more upset. Popped Collar remained blissfully uninvolved.</p><p>When Lindy started screaming, her face flushing red while she jabbed her finger toward Sam’s face, I’d had enough. I didn’t want to get pulled into the middle of this, but damn it, she didn’t get to talk to Sam that way. Not after what she’d pulled, not after leaving him without money or friends or the house he loved. I threw the truck door open, hauling the heavy cast-iron pot with me, just in time to hear Sam exclaim, “You’re going to have to deal with it!”</p><p>The next five seconds were a balletic comedy of errors. Sam slammed the truck door just as I started to climb out, shutting it on my foot. I yowled in protest, and when he realized that he’d hurt me, he turned toward me, which irritated Lindy. She swung her purse at his head. Sam ducked just as I pushed my way out of the truck and stepped right into Lindy’s swing. Her (fortunately, very soft) quilted Vera Bradley handbag landed broadside across my cheek, leaving me with a resounding thud bouncing around my skull.</p><p>“Here,” I said, and handed the pot to Sam’s ex. She blinked at me, confused, as I drew my hand back as if I was going to slap her. She shrieked, dropping the handles to cover her face with her hands. The heavy iron pot crashed down on Lindy’s foot with a clang. She howled, hopping up and down on her good foot.</p><p>“That’s for screwing me over on the lease!” I shouted.</p> <p>Lindy lunged for me, claws out. Sam threw me over his shoulder, turning to plop me back into the truck, only to smack my forehead across the edge of the door. I yelped, he spun around too quickly to see what had happened, and my sneaker whacked Lindy across the mouth. Lindy wailed, but I was too busy nursing my aching temple to laugh.</p><p>“Your vampire reflexes suck.” I groaned as Sam threw me unceremoniously into the passenger seat while Lindy continued to berate us both.</p><p>Sam rounded the truck, jumped into the driver’s seat, and gave me a long, incredulous look. “Did you just drop a pot on my ex-wife’s foot?”</p><p>As he turned the key in the ignition, I shook my head, wincing at the pain in my temple. “Technically, she dropped the pot on her foot.”</p><p>“You’re a scary woman.”</p><p>And through it all, Popped Collar continued to kill those little green pigs.</p> <p>—</p><p>I stood at the back door, sipping jasmine tea and watching the late-afternoon sky shift into an angry, bruised green. The trees danced so violently in the wind that I was afraid the limbs would snap off and come crashing into the house.</p><p>With that in mind, I stepped back from the windows a few paces.</p><p>It had been a very productive couple of days. The beverage company had wired the prize money into Sam’s account, allowing Sam to file papers with the bank. Sam and I had finalized blueprints for the changes to the restaurant. I had started making arrangements to move out of the house.</p><p>Somehow the sky went even darker, casting the house in purpling shadows as roiling clouds gathered overhead. I was wondering whether I should go look for a flashlight when the electricity winked off with a snap of ozone.</p><p>I groaned. Perfect timing.</p><p>There were no flashlights, of course. Lindy had probably run off with them when she left. I lit a “Relaxing Seascape” pillar candle on the mantel.</p><p>“Yep, I’m more relaxed already,” I muttered.</p> <p>The house was getting darker and darker as sheets of rain lashed against the windows. Even though we were reaching “house sucked away by a cyclone” levels of interior shade, Sam wasn’t due to wake up for a few more hours.</p><p>I was trying to figure out what my dinner options would be without power or a manual can opener when I heard a strange thumping noise from the side of the house. I rushed to the window and saw that one side of the in-ground double door to the cellar had come loose and was flapping in the wind like a particularly heavy flag. Had the latch slipped out of place?</p><p>Oh, shoot. The cellar, where Sam was sleeping. Rain was pouring into the open door.</p><p>The second I stepped outside, my brain shouted, Error! Error! Get your ass back inside!</p><p>The rain felt like being slapped around by quick, icy hands, soaking through my T-shirt and stinging my skin. A wind gust knocked me back against the porch railing. I tried to take a step toward the banging noise, but I couldn’t keep my eyes open against the force of the wind and the water.</p><p>I scrambled back through the door, slamming it behind me. I flicked my hair out of my face, slinging water across the room. I looked out the window, and through the blurred, rain-spattered glass, I saw that the other door was now waving back and forth. “Well, that was stupid.”</p><p>I couldn’t just leave it like that. I didn’t know where the cellar door opened in relation to Sam’s resting place. The storm could pass through quickly, and if Sam was sleeping anywhere near the door and sunlight suddenly broke through the clouds, he could end up a little pile of dust. Candle in hand, I traipsed through the darkened kitchen. The basement door wasn’t locked, which I thought was a nice sign of trust.</p><p>The candle was warming in my hand, the wax softening and releasing its strange sharp-clean scent, as I carefully made my way down the stairs. While the walls were lined with neatly hung tools and clean, orderly worktables, the floor space was open. At least I wouldn’t trip over anything. The noise of the door flapping was deafening, but I couldn’t see Sam anywhere. There was another door at the other end of the cellar, a solid metal door surrounded by new brick. It reminded me of one of those old-fashioned walk-in bank safes.</p><p>Of course, Sam had built himself an actual lair. I laughed, shoving my hair back from my face and setting the candle aside on a worktable. It took me a few tries to get the doors shut, particularly when I found that the latch had broken off. I had to secure it with a shovel through the door handles. And thanks to additional rain battering, my white T-shirt and khakis were now completely transparent, which was a fun look for me.</p><p>I took the still-burning candle, and I swear, I meant to just walk out, but there was that door at the end of the room. Beckoning. A mental itch I couldn’t ignore. All these nights, I’d been staying in this house, and I’d never seen where Sam slept. It couldn’t hurt to look, right? I mean, he was technically dead at the moment. He’d never find out.</p><p>By the time I’d reached the door, I’d rationalized it seven different ways. The vault door featured a traditional combination dial, set to the combination and therefore unlocked. It made me feel equal parts guilty and happy that he trusted me enough to sleep unguarded.</p><p>The space was small. Sam had bricked in just enough room for a bed and a dresser. Now that I’d opened that door, it felt so intrusive and wrong. But I couldn’t help but look at the slim form sprawled across the bed. It was one of those lovely old-fashioned wrought-iron numbers with curlicues in the headboard and a feather tick mattress. How had Lindy missed this? Had Sam sneaked it down here before she started her ransacking of the house?</p><p>I moved closer, the small flame from the candle casting a dancing orange light across Sam’s pale face. He was handsome when he was awake. He was absolutely beautiful in sleep, all white angles and smooth skin. His long lashes rested against high cheekbones. He was relaxed, not quite innocent, but definitely not the angry, sad guy I’d met weeks ago.</p><p>Also, Sam slept naked.</p><p>Panic bloomed in my chest. This was so wrong. He was lying there, naked and vulnerable, and I was peeping at him. I was going to be listed on some sort of Council sex-offender list. Just then, hot wax dripped down the side of the pillar candle and burned my fingers. I hissed in pain, bobbling the candle and spilling even more wax, dripping it right onto Sam’s chest.</p><p>And that was the moment I remembered the story about Cupid and Psyche. I’d become painfully familiar with Greek mythology while planning a “themed meal” for one of my culinary-school projects. I’d chosen “A Feast for the Gods.” Spanakopita. Never again.</p><p>Psyche was told never to bother Cupid while he was sleeping, but she couldn’t help her curiosity and sneaked into his room with an oil lamp, dripping oil on his shoulder and burning him. He was furious and left her shortly after, and she had to perform several dignity-defying tasks for the gods before he would come back.</p><p>Shit.</p><p>Sam didn’t seem to be stirring. I stepped back, slowly pulling my arm and the candle out of reach. A hand shot out to clamp around my wrist. Sam’s eyes were open, hungry, and dark. I pulled frantically at my wrist, barely keeping the candle upright as he dragged me down to the mattress.</p><p>“Sam, I’m sorry, I just wanted to make sure you’re OK. There’s a storm—mmph!”</p><p>His mouth closed over mine, pulling my bottom lip between his teeth and nibbling it. He pulled the candle from my hand and placed it on a bedside table. He yanked me close, rolling over me and pressing me into the mattress, plucking the buttons of my wet shirt like guitar strings. His hips pressed into mine, pinning me down. He was so solid, so sure, over me, when my head seemed to be running on its own roller-coaster track.</p><p>He pushed the wet shirt from my shoulders, running his hands under my back until they cupped my butt, and rocked his hips. I groaned shamelessly, throwing my head back against the pillow. He rained kisses down the line of my throat. I could feel his wicked smile against my skin when I didn’t so much as tense when his teeth skimmed over my jugular.</p><p>His fingers worked over my collarbone, tickled the rim of my belly button, and traced my hips. Somewhere in the course of this, my pants seemed to have disappeared. I glanced down, transfixed by the sight of Sam’s hard length slipping between my thighs.</p><p>I gasped. I would worry about the pants later.</p><p>—</p><p>The storm died down. I had no idea when, but by the time I collapsed back against the mattress, sore, sweaty, and a little dizzy, the wind had dwindled to a dull roar. We could still hear the rain spattering against the siding. It was nice, sprawling out on the bed, the light low, and what sounded like ocean waves beating against the walls.</p><p>Sam’s arm was thrown over me, his face pressed into the mattress. I didn’t want to brag, but I was pretty sure I’d broken him. Toward the end, I’d taken his power of speech and the ability to control his eyelids. But he’d done his damage, too. The pretty iron curlicues on the headboard now looked like something from a Tim Burton movie.</p><p>His head rose, and his eyelids twitched slightly as he gave me a lazy smile. He grabbed me and pulled me close.</p><p>“I was wonderin’ how long it would take you to come down here,” he murmured against my mouth. “Really, woman, how many hints do I have to give you?”</p><p>“H-hints?” I sputtered</p><p>“I left the doors unlocked.”</p><p>“That’s not a hint. That’s inattention to personal safety.”</p><p>“Says the woman who spilled candle wax on a sleepin’ vampire,” he whispered, biting lightly at the place where my neck met my jaw. “Kinky girl.”</p><p>“Nice.” I rolled my eyes and made myself more comfortable, balancing carefully on his chest. My knee hit the mattress wrong, and the bed sagged in the middle. As pretty as it was, the mattress was lumpy as hell, and the springs squeaked every time we moved. But I was so comfortable. And I loved the feeling of Sam’s hands slipping along my spine, tracing each vertebra with his fingertips. I lay there, my head tilted sweetly against the ridge of his collarbone, completely relaxed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So, what happens now?” he asked.</p><p>“I think that’s my line,” I said without looking up.</p><p>“You know what I mean,” he said, poking my ribs. “When you move out, will I see you again, or will I just be part of the Half-Moon Hollow welcome wagon package?”</p> <p>“I’ll give you a good review on Yelp, if that will make you feel better.”</p><p>“Oh, you’re funny, you are.”</p><p>“I try.” I was so tempted to tell him I was staying right there with him, in this very house, as long as he wanted me. And I would be willing to sleep in this freaky Tim Burton bed if he would keep rubbing my back like that. But for now, that sounded a little psycho. So I gave him a Cheshire Cat smile and said, “I’m not quite sure yet.”</p><p>“Oh, that’s mean.” He groaned.</p><p>I slid my arms around his neck and rolled over him. “Maybe I should take another spin on the welcome wagon before I decide.”</p> <p>I nipped along the line of his throat, leaving a deliberate mark on his collarbone with my teeth. It faded in seconds. I was going to have to find a way to make those stick.</p><p>“That’s so wrong.” he said, sighing.</p><p>“You want more genteel pillow talk, get a more genteel girl.”</p><p>—</p><p>The next thing I knew, I startled awake in the bed, alone. I could hear footsteps above me, making the floorboards creak. Sam was pacing upstairs in the living room, and I could hear his hushed tones even in the basement. I blinked blearily at the alarm clock on the bedside table. It was after 10:00 P.M. Who would be visiting here at this time of night?</p><p>I slipped into my shirt and jeans and crept quietly up the stairs. The kitchen was dark, but the lights in the living room were blazing. I could hear Sam yelling, “No, I don’t have to explain that to you!” followed by tinny babbling. Was he talking on the phone? I hovered near the door, watching as Sam paced back and forth over the worn rug.</p> <p>“Lindy, that was the amount agreed upon in the settlement. I have a promissory note to show the court. I’ve made the deadline. If you’re not happy with the payment, talk to the judge about it.”</p><p>More squawking on the other end of the line.</p><p>“No, you don’t have the right to ask that,” he spat. “Because it’s none of your—no!” He sighed. “No. I’m not sleepin’ with her. Lindy, she’s not even my type...</p><p>“She’s a friend!” he yelled in response to something Lindy had asked. “She’s just a friend. She’s a nice girl you took advantage of. I felt sorry for her after what you did, so we made an effort to get along. Stop gettin’ away from the point. I’m gettin’ the house fair and square. You need to deal with it...</p><p>“No, I don’t want to meet up to talk about it!” he barked. After a long pause, his voice softened as he said, “Look, Lindy, please don’t cry. Please, just stop. No, I don’t hate you. No, I’m not mad anymore... You know I do.”</p><p>I backed away from the door, feeling as if I’d been punched in the stomach. Was that really how he felt? I was just a friend? He felt sorry for me? Was I a “friend with benefits” now? A rebound lay? I didn’t want to be boxed into some “friend zone” category of women Sam liked enough to sleep with but not enough to date. And I wanted a relationship with Sam, a real one. I hadn’t realized that until I heard him describe me in such bland terms.</p><p>Why would he say I was “just a friend”? Because he didn’t want to hurt Lindy? Did he still love her, despite everything? Was he going to end up going back to his ex like Phillip? Would I get sucked into another bizarre cyclical marriage trap like my parents’ relationship hell? Would any progress I made die as Sam yo-yoed back and forth between the two of us?</p><p>My breath came out in a painful little hiccup as I found my shoes and purse. I threaded my fingers through the handle of my bag. I couldn’t be here for this. I couldn’t listen to him talk this way. I couldn’t stay in the house, knowing that he might come down the stairs and find some gentle, “friendly” way to ask me to go upstairs to my own bed. The rational, reasonable part of my brain seemed to be on vacation—again—while the more primal portions yelled for me to get out. Get out now! Get out before he gives us the “I need space” speech!</p> <p>My keys jangled slightly, and I caught them before Sam overheard. I approached the living room. His back was turned to me as he growled into the phone, “Fine, call your lawyer! He wrote the agreement in the first place!” Hands shaking, I slipped from the kitchen to the front hall in a few steps, launching out the door as if I were on a catapult. As I revved my engine and sped down the drive, I glanced back in the rearview mirror and saw Sam framed in the doorway.</p><p>—</p><p>That night, I cried the whole thing out to Jolene, curled up on her couch.</p><p>“It’s just so embarrassing.” I sighed. “I don’t get caught up this way, all emotional and crazy and snotting all over my friends’ sofas. It’s not the first time I’ve slept with a man who didn’t love me. Hell, Phillip made it clear he didn’t even like me toward the end of our relationship. But it’s never hurt this badly before.”</p><p>“Maybe that’s because you didn’t care about any of those guys before,” Jolene said, offering me a tall glass of liquor, the origin of which I chose not to question. “And you may be overreacting, you know. You never actually heard him say he still wanted her around. All he said was that he didn’t hate her. It’s not exactly a declaration of love.”</p><p>“No one likes a smartass, Jolene,” I informed her, wiping at my wet cheeks.</p><p>Zeb, who had disappeared like a cartoon coyote when he’d opened the door and saw my tearstained face, crept quietly into the living room, placed a beer and a plate of chocolate-chip cookies in front of me, and dashed to the safety of the twins’ room.</p><p>“I hope that’s not true, for your sake,” she muttered. “So, what are you going to do now?”</p><p>I swiped at my cheeks. “Go ahead with my plans. This doesn’t really change anything, except that I need to move out of Sam’s place ahead of schedule. I think we both need to figure out what we want. I don’t think we can do that if I’m living in his back pocket. I’ll just have to find a new contractor. And a bank willing to give me a very low-interest loan—or maybe I’ll just rob a bank, I haven’t decided.”</p><p>“I have some cousins who work construction,” Jolene offered.</p><p>“Of course you do.” I snorted into a tissue. “So, Jolene—my best friend, my right hand, the only person I know who loves food as much as I do—would you like a job?”</p><p>Jolene frowned at me. “I will not track Lindy down and kill her for you. I mean, I know how to hide a body, but I’ve got kids now.”</p><p>“No!” I exclaimed. “I mean a job at the restaurant. Would you like to manage it for me?”</p><p>“Well, I already work part-time for Beeline, and I work some days at my uncle’s shop.”</p><p>“Exactly. You know how a restaurant works, and you know the people here much better than I do. If you see me doing something stupid, you’ll tell me, loudly.”</p><p>“Would you actually listen to me?” she asked dryly.</p><p>“At least half the time,” I promised. “Come on, how would you feel about dropping the part-time jobs and working for me? I can offer you a pitiful salary and all of the free food you can eat.”</p><p>“You may want to rethink that!” Zeb called from the back of the house.</p><p>“I don’t think my uncles would like me working for the competition.”</p><p>“That’s just it. I don’t plan on competing with your uncles’ place. They do beautiful sandwiches and deli selections, mostly lunch and breakfast. I’m aiming more for comfort foods, slightly upscale, but not so much that you wouldn’t be comfortable there in jeans. A lunch and dinner crowd.”</p><p>“I’d still want to check with them first. And my dad.”</p><p>I raised an eyebrow.</p><p>She nodded. “We’re a close family.”</p><p>I muttered, “Must be a Southern thing.”</p><p>—</p><p>Jolene helped me get the apartment above Southern Comforts into a somewhat livable condition over the next few days, cleaning and making small repairs. After retrieving my stuff from Sam’s house, Jane and Andrea showed up with an enormous care package stocked with housewarming gifts such as a new shower curtain, cleaning supplies, and a great big bottle of vodka. I loved Jane and Andrea. I really did.</p><p>Sam called, but I didn’t pick up the phone. His messages were increasingly apologetic, which just made me feel worse for hurting him. He was sorry I woke up to his conversation with Lindy, he said. He didn’t know what I’d heard, but he wished I would talk to him so we could work this out. One message had him sounding so worried, so lonely, that I nearly hit “end” so I could dial Sam’s number, but then he said, “I thought we were friends.” And that kept me from checking my messages for the next two days.</p><p>By day three, the words “just a friend” kept running through my head on a loop, making me cringe and cry and occasionally throw a pot at a wall.</p><p>I was really going to have to stop doing that.</p><p>On October 28, the day Sam was supposed to reclaim his house, I sat in my new restaurant with a perfectly nice lager resting on the bar in front of me. Jolene had finally agreed to take the job at Southern Comforts. But her uncles had warned me that if they caught me duplicating from their menu, I would be in for an old-fashioned ass-whupping. But I hadn’t had any luck finding a contractor to do the repairs I needed. I was having trouble narrowing down which human and vampire menus I wanted to use for the restaurant. I couldn’t even decide on a color scheme for the menu.</p><p>For the first time in my life, I truly had no clue what to do. Even when I had my meltdown, I’d had a plan—visit Chef Gamling, get my life back in order. But now, even though I knew what I was doing in the long term, I was completely paralyzed by indecision over what to do in the next few days, in the next few hours.</p><p>I toyed with the cap from a Faux Type O bottle. There were so many things I could do with this place, but I wasn’t sure of any of them now. Did I really want to save the tabletops as wall displays? Could I refinish the bar to its original oaken glory? How much additional storage space could I allow myself in the kitchen? I wanted Sam’s input in these decisions, his sensible contractor’s brain. But it seemed that John Lassiter’s curse had killed my pseudo-relationship before it even got off the ground, taking my construction plans down with it.</p><p>I took a deep breath and a deeper draw from my beer. This stopped now. The time for useless pouting and self-flagellating was done. I was a homeowner, sort of. I owned my own restaurant. I had friends, real friends who liked me, despite my basket-case tendencies. I’d managed a semifunctional relationship for a few days, which was a personal record. My life was so much better than it was when I’d rolled into town.</p><p>The first order of business was turning off this playlist, because Adele’s gorgeous emo postbreakup music was killing me.</p><p>I scrolled through the lists on my iPod until I found some Lynyrd Skynyrd and filled my kitchen with the sounds of “Sweet Home Alabama.” I pulled out a notebook and pen and began painstakingly writing text and printing instructions for the menu of my new restaurant.</p><p>Coda</p><p>10</p><p>Jolene, put the green down, and step away from the wall.”</p><p>“But it’s so cheerful!” Jolene protested, holding up the paint can labeled “New Leaf.”</p><p>“It’s neon!”</p><p>“It is rather, er, bright,” Chef Gamling told her gently.</p><p>Jolene chucked a fork at my head. “It is not!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yipe!” I cried, ducking out of the way. “Hey, you left the kids at home to limit the number of items thrown at my head tonight. And giving me a fork-related head contusion will not change the fact that our color scheme is white and blue.”</p><p>“Actually, we left the kids at home because we’re spending the evening in a construction zone,” Zeb said. “A construction zone with a bar in it.”</p><p>“Just give the green a chance!” Jolene begged.</p><p>”Are you going to be this stubborn about everything?” I groaned.</p> <p>I shot a pleading look at Zeb, Jane, Gabriel, Dick, and Andrea, who were sitting at the bar, watching the exchange gleefully. Apparently, whatever instinct they may have had to protect the “new girl” in the group had evaporated over Halloween, when I beat Jane at quarters while dressed as Wonder Woman. Vampires seemed to take drinking games very seriously.</p><p>My eyes narrowed. “Oh, you guys are no help whatsoever.”</p><p>“Just be glad it’s not peach,” Gabriel said.</p><p>Jane cackled when she saw my confused expression. “Someday, I’ll show you pictures of the bridesmaids’ dresses from Jolene and Zeb’s wedding.”</p><p>“I didn’t even pick out that color!” Jolene retorted. “That’s not fair.”</p> <p>“I’m just here for the free eats,” Dick said, raising a shot glass full of the Blood Creek Barbecue Sauce. Although Faux Type O technically owned the recipe, the company was so impressed with my plan to open a vampire-friendly restaurant that they’d let me keep the rights to serving it. We were calling the special menu Southern Comforts Blood Shots, to prevent confusions with the liquor menu or the human menu. My resident vampire friends were helping me tweak the recipes with another taste-testing.</p><p>Chef Gamling, who had agreed to work part-time in my kitchen when the restaurant opened, was leading them through the “appropriate tasting process” and recording their comments.</p><p>Since he didn’t drink blood, Zeb was content to sample the various pie concoctions we’d come up with—caramel apple, peppermint cream with a crushed Oreo crust, and a mixed fruit involving strawberries, cranberries, and raspberries. And, of course, he enjoyed my attempts to control his wife’s horrendous decorating skills. Is there a color-sense equivalent to being tone-deaf?</p><p>With the endless details I was juggling, I worried that I would be too busy to maintain my newfound connections with the group. But they simply wouldn’t let me quietly fade into my work as I had in Chicago. Jolene was with me at every step of setting up shop, whether I wanted her opinions or not. Dick had offered to help me find dishes and equipment through his “connections,” while Gabriel stood behind him and shook his dark head vehemently. Jane had offered her advice on starting a small business in the Hollow, the chief of which was to avoid the local Chamber of Commerce like the plague. Andrea’s help had been invaluable while I waded through the complicated licensing process for blending and serving human donor blood. I supposed it shouldn’t be easy to serve human blood to an unsuspecting public, but the red tape was a serious pain in the ass.</p><p>“Isn’t it premature to start picking paint colors when you have so much structural work to do around here?” Gabriel asked, a concerned expression wrinkling his brow.</p><p>“Why don’t you just ask Sam to help you?” Jane asked.</p> <p>“You know why,” I shot back, making her raise her hands defensively.</p><p>“I tried to help Tess find a contractor,” Dick protested. While the girls tried to nurse me through my confused post-Sam feelings with ice cream and Jane Austen movies, Dick’s method was taking me to The Cellar and getting me hammered. Which made Dick my new favorite guy ever.</p><p>I shot my new drinking buddy the stink-eye. “Dick, it only took me two ‘laying pipe’ innuendos from your handsy plumbing guy to decide that I will only use contractors I find through the Yellow Pages.”</p><p>“Hey!” Dick exclaimed. “That wasn’t my guy, that was a cousin of my guy. Doesn’t count! And didn’t he come back to apologize?”</p><p>“Yes, black and blue, he came back to apologize, which meant I ended up feeling guilty because you beat the tar out of him.”</p><p>“Gabriel helped!” Dick protested. “If I knew he would go in for a boob grab in lieu of a handshake, I never would have recommended him. The beatin’ was deserved.”</p><p>Dick turned as the battered cowbell above the door jangled and Sam stepped through.</p><p>Well, I could at least take comfort in the fact that he looked as bad as I felt. The last two weeks of radio silence had not been kind to Sam Clemson. He looked as if Dick and Gabriel had gotten a piece of him, too—dark bruiselike circles under his eyes, paler-than-usual cheeks, and thin, pinched lips. Something seemed lodged in my throat, a weighty lump that kept me from breathing or swallowing.</p> <p>Seeing him, all wretched and drawn, made me feel a bit ridiculous for being so angry with him. He hadn’t hurt me intentionally. The f-word he’d used wasn’t an insult. And he wasn’t the first guy to have lingering feelings for his ex-wife. Don’t get me wrong. The fact that I seemed to feel more for him than he felt for me still hurt. But I didn’t feel the urge to damage him or my drywall, which felt like progress.</p><p>I finally choked out a profound “Sam?”</p><p>The awkward silence continued for a few more agonizing seconds before Jane announced, “Well, kids, I think we should be going now.”</p><p>“But we’ll miss the fireworks,” Dick protested, then saw Andrea’s stern expression. He sighed. “Fine.”</p><p>Jane edged Gabriel off his stool while Andrea bumped Dick out the door. Jolene was so busy glaring at Sam that Zeb had to walk around the bar and literally drag her out. Chef Gamling gave Sam a long, speculative look before following the thundering herd out the door. I heard it shut just as Dick said, “If she throws knives and we miss it, I’m going to be pissed.”</p><p>Sam looked around the ruins of the dining room. “I like what you’ve done with the place.”</p><p>“Well, I’ve had a little trouble finding reliable contractors,” I said, crossing my arms over my chest protectively. I wanted to round the bar, sit next to him on the stools. But I needed space. I needed a physical barrier to keep from making a complete fool of myself.</p><p>He nodded and picked up a shot glass from Andrea’s plate. He smiled. “You’re really going through with it, huh? The vampire menu?”</p><p>“I don’t see why not. I want to feed people. Whether they have a pulse is irrelevant,” I said, fidgeting with a dishtowel.</p><p>“So, I’ve been callin’ you. A lot.”</p><p>“I know.”</p><p>He frowned. “Oh, so there wasn’t some tragic fire that destroyed your phone... which means you’ve just been ignorin’ me. That makes me feel better.”</p><p>“I haven’t been ignoring you. I’ve been giving you space,” I countered.</p><p>“The difference is that when you give someone space, you tell them ahead of time. Otherwise, it’s just ignorin’ them. Look, I know you overheard me talkin’ to Lindy. I don’t know what I said that upset you, but I take it back. I take it all back. I just want you to talk to me again. I tried stayin’ away... after the eighth straight day of you not returnin’ my calls. But the house is just empty without you. There’s no light, no music, no weird smells coming from the kitchen. I can’t take it anymore.”</p><p>“You told Lindy I was just a friend. You told her you felt sorry for me. You said you didn’t hate her.”</p><p>And yes, I did realize how lame that last bit sounded, but I wasn’t about to weaken my position with logic.</p><p>“Well, I don’t hate her. I never hated her. I just don’t want to be married to her anymore.” Sam rounded the bar, advancing until his hand ghosted down the length of my arm, never quite touching. He smirked down at me. “Besides, what was I supposed to say? ‘Hey, Lindy, I know we still have a real estate and divorce settlement pending, but I want to let you know that I just had awesome sex with that woman who whacked you with a cast-iron pot. Yes, the same woman who helped me swipe the house out from under you, ruining your plan to sell it and keep the money for yourself. And by the way, I also think she’s prettier and far more interesting than you’? Lindy was already ranting and raving like a crazy woman about you, saying you’d ruined her plans to sell the house to some doctor from Louisville. The last thing I wanted to do was give her more reasons to hate you. The fact that I couldn’t wait to get back downstairs because your skin was soft and warm and smelled like honeysuckle was definitely going to make her hate you.”</p><p>I glared up at him, but inside, I was doing the tiniest victory dance. “But what about ‘You know I do’?” I asked.</p><p>He blinked a few times, as if trying to operate on the same insane wavelength as my brain. “You mean the part where she said, ‘Are you sure you want to go through with this divorce?’ And yes, I do. It was just like her to ask that right before the divorce was final. This is just another case of Lindy getting what she wanted and then not wanting it anymore. So, am I glad the divorce is final? Yes, I am. Am I glad the bank papers are signed and the house is mine? Yes, I am. And am I willing to call Lindy right now and describe our awesome sex in detail? Yes, I am.”</p><p>My lips twitched as I squinted up at him. “You know, when I was a little girl and I dreamed of a man declaring his love for me, it did not involve the words ‘Let’s call my ex-wife and give her details about our awesome sex life.’”</p><p>“I didn’t say I was declaring my love for you.”</p><p>“Oh, please.” I snickered, rolling my eyes. “I’ve owned your ass since the moment you kissed me.”</p><p>He pulled me closer, settling his hands at the small of my back. “Oh, you mean the night you tainted my food supply with a dangerous substance?”</p><p>“Uh-huh,” I said, grinning, pressing my lips to his. His whole body seemed to relax, to sag against mine as he pulled me closer. I murmured against his chest, “I think you need some time to be alone, to get over Lindy. I don’t want to be that rebound girl who helps you heal up for your next ‘real relationship.’”</p><p>“Honey, it doesn’t get any more real than the girl who pepper-sprays my insides and drips hot candle wax on me while I sleep. Frankly, I have to make up with you. I’m afraid of what would happen if you were angry at me much longer. I don’t need to get over Lindy. We were over a long time ago. I’ve been ready for a new life for a while now. I just needed everything else to catch up.”</p><p>“I don’t want you to rush.”</p><p>“We won’t,” he promised. “We’ll take it slow.” Then he added under his breath, “As soon as we move your stuff back in.”</p><p>“What?”</p><p>“I was thinking, it’s pretty silly for you to live here, in a crappy little apartment, when there’s plenty of room at the house. Besides, we should do it just to prove Lassiter wrong.”</p><p>“So we should live together to break a hundred-year-old curse? That’s a line I haven’t heard before.” I rolled my eyes at him. “So have you told Lindy I’ll be moving in?”</p><p>He ducked his head. “Not important.”</p><p>“She hit you with cookware, too, didn’t she?”</p><p>“Not important,” he insisted.</p><p>“Can I hit her with cookware?” I asked.</p><p>“If you keep doing that to people, someone’s going to file charges against you.” He sighed into my neck. “We’re not going to do anything to Lindy. She’s not an issue for me anymore, and she shouldn’t be one for you. We’re not going to devote any more energy to her. And swinging that wok of yours takes a lot of energy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>I supposed that was fair. But I would keep my wok handy.</p><p>I laughed as he squeezed me tight. “Well, I have to warn you, there will need to be some rules.”</p><p>“Such as?”</p> <p>“Personal space is overrated. I want to be able to see you at least a few hours a night, even if we have to move around our work schedules.”</p><p>“Sounds reasonable,” he said. “And I promise, I will only remove parts from the doors and cabinets when they need to be fixed, not just to amuse myself.”</p><p>“Very reasonable,” I told him. “I will only threaten you with pans and pepper extracts when you really deserve it.”</p><p>“And the vampire issue,” he said. “Any idea where you stand on that?”</p><p>“I don’t know,” I admitted. “And I don’t know if I’ll be able to give you an answer anytime soon. But for right now, I want to be with you. Bad furniture and all. Besides, I need a contractor, and you’re the only one I know who doesn’t make my skin crawl.”</p> <p>He gave me a quick flash of a grin, then covered it with a mocking frown. He slid his arms around me. “I don’t know if you can afford me.”</p><p>I kissed him, pinching his butt just a little bit. “I think we can work out a barter system.” </p>  </body></html>"]