["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>June 1851</p><p>Hampshire, England</p><p>Kev Merripen wasn’t surprised by the signs of bad luck as his wedding day approached. But he was determined to have Win as his wife, no matter what obstacles had to be overcome.</p> <p>“Nothing is going to stop this wedding,” he told her as he came into her bedroom one evening before the ceremony. “I’m going to marry you if lightning strikes the church. I’m going to marry you if the entire village of Stony Cross is flooded, or the pastor is drunk, or animals stampede through the ceremony.”</p><p>Smiling quizzically, Win turned the lamp low and came to him in her dressing gown. “I gather you’re expecting something to go wrong?”</p><p>“Of course. It’s a Hathaway wedding.”</p><p>Despite his grumbling, Kev felt his pulse escalate to a fast, heavy clamor as Win approached. She looked angelic, her slender body wrapped in white lace and ruffled silk, her light blonde hair cascading in loose shimmering waves. He adored her with an intensity that approached worship . . . and yet she was all woman to him. His woman.</p><p>Something about her had always cut past his defenses and reached his very soul.</p> <p>Reaching around his neck, Win let her fingers play gently in the cropped hair at his nape. Her body pressed all along his, the feminine curves molding sweetly against him. “What’s the matter?” she whispered.</p><p>He let his lips play in the glinting wisps of hair at her temple. “Beatrix found a wounded owl this morning and brought it to the house.”</p><p>“Poor thing. If anyone could make it well, it would be Beatrix.”</p><p>“You’re missing the point,” Kev said, smiling reluctantly. “Owls are bad luck.”</p><p>“I don’t believe in bad luck.” Standing on her toes, Win brushed the tip of her nose playfully against his.</p><p>Kev felt compelled to make his case. “I also caught a glimpse of your wedding dress while Amelia was sewing something on it in the parlor.”</p> <p>“Yes, but I wasn’t in the dress.”</p><p>“Still bad luck,” he insisted. “And then the dairymaid told me some gadje poem about the best day to marry. Saturday isn’t one of them.” Gadje was the term Gypsies used to refer to outsiders.</p><p>“Yes, I know the poem. Monday for health, Tuesday for wealth, Wednesday’s the best of all. Thursday brings crosses, and Friday losses, but Saturday no luck at all.”</p><p>Kev gave her a quick frown. “You knew that poem, and you still chose a Saturday for the wedding?”</p><p>“The almanac said it would be a fine day,” Win protested. “Besides, I didn’t think you’d put any stock in a gadje superstition.”</p><p>“I do when it’s about our wedding!”</p><p>She had the nerve to grin. “You’re far too superstitious.” She went to stand by the bed. Sending him a provocative glance, she untied the sash of her dressing gown and began on the row of tiny buttons along the front. “I’m yours already, Kev. It doesn’t matter what goes wrong at the wedding . . . the ceremony is a mere formality. We’ve made our vows and consummated them . . . or did I only imagine that you stole me right out of this bed not long ago?”</p><p>The reminder caught Kev’s attention, as she had intended.</p> <p>“You didn’t protest,” he pointed out, watching as she unfastened one tiny button, and another. He went instantly hard as he caught a glimpse of her breast.</p><p>“Of course I didn’t. I’d been trying to get you to ravish me for years.”</p><p>“I always wanted you.” His voice was thick and low.</p><p>“I knew. But you were so stubborn.” Little by little the front of the dressing gown fell open, revealing, soft, pale skin.</p><p>As Win saw his reaction to the display, a glint of satisfaction appeared in her eyes before she could conceal it.</p><p>Kev was well aware that Win managed him adeptly in her own soft, sweet way.</p><p>Being a Romany male, he probably should have resented that. But he was too enchanted by her shy seduction to object. He moved toward her, reaching out to ease the lace and silk from her shoulders. “In my heart you’re already my wife,” he said.</p><p>“But I’ll have no peace until you’re legally mine. No man has ever been so eager for his wedding day.” His lashes half-lowered as he felt her tender mouth on the side of his neck.</p><p>“I’m eager for the wedding night,” Win told him breathlessly.</p><p>A sound of amusement rustled in his chest. “Why? Do you think I have something out of the ordinary planned for you?” A grin tugged at his lips as he felt her nod against his throat. “Perhaps I do,” he murmured. “There are things I haven’t shown you yet.”</p><p>Win drew back to give a look of wide-eyed surprise. He held her gaze, smiling slightly as he saw the color rise in her cheeks.</p><p>“We haven’t done everything?” she asked.</p><p>Kev shook his head.</p><p>Her flush deepened, and she gave a disconcerted laugh. “Well, now I’m cross with you. I’ve been feeling very worldly and experienced, and now you tell me that I’m still a novice?”</p><p>His smile lingered. “I’ll teach you more when you’re ready.”</p><p>The moment was delicious. The silence between them was warm and provocative, their breaths mingling, her naked body clasped carefully against his clothed one.</p><p>“Teach me now,” she whispered.</p><p>“Giving orders?” Kev chided, his dark eyes sparkling. “A Romany wife must learn to obey her husband. Perhaps I should have mentioned earlier . . . the Rom have a special custom for the wedding night.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Do they?” She jumped a little as his warm hand slid over the curves of her bottom.</p><p>He nodded. “The husband takes one of the wife’s shoes and sets it on the floor, on his side of the bed.”</p><p>“Why?”</p><p>He squeezed her bottom meaningfully. “So she’ll know who is master.”</p> <p>Win regarded him with a flirting grin. “We’ll see about that. I’m very fond of my shoes, and I won’t surrender them easily.”</p><p>His mouth passed gently over hers, and he tasted her with the tip of his tongue. “You’ll surrender.”</p><p>Win pulled away with a muffled laugh. Leaning back against the edge of the mattress, she watched in fascination as Kev stripped off his shirt. Her gaze traveled over his muscled torso, the gleam of his smooth, hairless chest. Her breath quickened in excitement as he came to her.</p><p>Clenching one hand into the spill of her long hair, Kev carefully eased her head back to expose her throat. And he dragged his mouth along her neck, using his tongue, while his other hand went between her thighs. He caressed her, played with her, until he could slip two fingers easily inside. His mouth covered hers, his tongue sinking deep, and she shivered in arousal at the simultaneous penetrations.</p><p>“Kev,” she said in an unsteady whisper, her hands gripping his bare back, “Love me.”</p> <p>“I do,” he whispered back, his fingers deep and coaxing inside her. “You’re my soulmate, my twin flame. I knew it the first time I saw you.”</p><p>“So did I,” she said, trembling.</p><p>“You’re never out of my thoughts . . . I want you always . . . ”</p><p>Withdrawing his gentle touch, he lowered her to the bed. As he lay beside her, he smoothed his palm along her front, fingertips sensitive to every quiver of her nerves. Bending over her br**sts, he caught a rosy tip and drew his tongue against the tautness, while his hands moved over her in light erotic paths.</p><p>She arched upward helplessly as his mouth traversed her body, the soft secret places where sensation converged. He filled her powerfully, following the pulse and heat of her, riding every sweet undulation. And he reached the summit with her, glorying in their shared pleasure . . . surrendering to his own endless passion for her.</p><p>Chapter Two</p> <p>“Keep her immobile,” Cam murmured to Beatrix as they bent over the injured owl. “If she gets loose, she’ll damage herself, and probably us as well. Those talons are like knives.”</p><p>“She wants to hold something,” Beatrix said quietly, glancing at the bird’s clutching talons. “Can you find us a stick, Amelia?”</p><p>“Certainly.” Amelia hurried from the parlor to the kitchen, found a wooden spoon, and brought it back to her husband and sister. They were crouched on the floor over the straining form of a tawny owl. Beatrix had found the wounded bird during one of her daily rambles through the wood. The owl’s wing was broken, and Cam was attempting to set and splint it.</p><p>Beatrix had wrapped the tubby little owl in a blanket. Tearing her concerned gaze from the bird, she reached for the wooden spoon that Amelia had brought, and carefully pushed the handle against the owl’s talons. The spoon was immediately accepted and held. Amelia could have sworn the owl actually looked relieved.</p><p>Not for the first time she marveled at Beatrix’s empathy with animals, though whether that was a blessing or a curse remained to be seen. Setting aside her worry for the moment, Amelia took a nearby chair and watched her husband.</p><p>Three years earlier Amelia had stunned the family—and herself--by marrying Cam Rohan, a Rom from London, after knowing him only a matter of weeks. Until then she had prided herself on being a sensible woman who had never understood the phrase “swept off her feet.”</p><p>But that was exactly what Cam had done. Handsome, exotic, sensual, he was not the kind of man one might have expected Amelia to wed. In fact, Amelia had never expected to wed at all. After the deaths of her parents she had reconciled herself to taking care of her four siblings; Leo, Win, Poppy and Beatrix. But then Cam had entered her life, understanding her secret dreams and needs with unnerving acuity. He had seduced her, mind, body and soul.</p><p>And he had stayed, explaining that every once in a while, some Gypsy found his atchen-tan, his stopping-place. To Cam, love and family meant far more than his freedom. Gradually much of the burden of taking care of the Hathaways had shifted to Cam’s strong shoulders.</p> <p>As Cam tended the owl, carefully folding a splint around the wing, a breeze came through the windows and toyed with the locks of shining black hair on his forehead. Amelia gazed at him possessively, appreciating the way his thin linen shirt clung to the powerful lines of his back. He was a ridiculously beautiful man, with his amber eyes and flashing smile. And how patient he was, his hands deft and graceful as he wrapped the splinted wing against the owl’s body.</p><p>“Kew-wick,” the bird fretted and protested. “Kew-wick! ”</p><p>Cam said something in Romany, the words soft and soothing, and the owl quieted. “Why don’t you take her to the barn now?” Cam suggested to Beatrix. “She’ll want to rest in her nest box.”</p><p>“Should I offer her water?”</p><p>“You might try it, but she won’t want much. Owls usually draw their moisture from their prey. Which reminds me—you’d better find some mice for her.”</p><p>Beatrix made a face, hating the necessity of feeding live mice to the bird. “I’ll see if I can get Dodger to catch some.” She drew on a makeshift gauntlet—a leather glove borrowed from Merripen—and together she and Cam unwrapped the owl and coaxed her to perch on Beatrix’s arm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Beatrix,” Amelia said, “before you go, might I have a word with you?”</p><p>“Yes, have I done something?” Beatrix gave her a cheerfully quizzical glance, her blue eyes nearly as round as the owl’s.</p><p>She was a striking girl of nineteen, not classically beautiful as Win and Poppy were, but she possessed a sweet, coltish grace and a winsome appeal that charmed everyone who met her. Most irresistible of all, she had a smile that flashed out of nowhere, textured with sly irreverence. Beatrix was radiant, open, and as curious as her pet ferret Dodger.</p><p>What kind of man would ever be right for Beatrix? A young one, perhaps.</p> <p>Someone who would not crush her exuberant nature. But might Beatrix be better off with someone older? Someone who would curb her impulsiveness and protect her?</p><p>Ironically, during the two seasons that Beatrix and Poppy had spent in London, Beatrix had been infinitely more sought-after. And Beatrix couldn’t have cared less about finding someone to marry. Whereas poor Poppy, who wanted desperately to have her own family, had had very little success so far.</p><p>“I think it’s because Poppy becomes nervous around gentlemen, and she starts talking very fast,” Beatrix had confided to Amelia.</p><p>“But you don’t feel nervous around them?” Amelia had asked.</p><p>“Well, no. I merely ask questions to keep them talking, and they seem pleased with that.”</p> <p>Bringing her mind to the present, Amelia smiled at her youngest sister, who was in her usual state of disarray. The hems of Beatrix’s skirts were muddy, and her dark brown hair was falling from its pins, and there was a smudge at the tip of her adorable nose.</p><p>“No, you haven’t done anything,” Amelia said. “I merely wanted to mention that much of the local gentry will be attending Win’s wedding next week.” A wry smile twisted her face as she added, “And it has been impressed on me by some well-meaning friends that there will be eligible gentlemen present.”</p><p>Beatrix’s expression was similar to the one she had worn when the live mice were mentioned. “Poppy can have them. She wants to get married much more than I do.”</p><p>“Yes, but . . . Bea . . . you’re of the appropriate age as well, and . . .” Amelia paused, searching earnestly for words. “What I’m asking is that you let yourself be open to the possibility of liking one of these gentlemen.”</p><p>“You want to marry me off?” Beatrix asked blankly.</p><p>“No, it’s not that . . . it’s only that I see how absorbed you are in your creatures. You’re intent on helping them and caring for them to the exclusion of all else. But the opportunities you have now won’t always be available. Most young women don’t have more than three seasons in London before they’re considered . . .”</p> <p>“On the shelf?” Beatrix suggested.</p><p>The owl looked expectantly from Beatrix to Amelia, its round face mildly concerned.</p><p>Amelia grimaced. “I detest that expression. It makes an unmarried girl sound like a book no one’s reading.”</p><p>Beatrix shrugged. “I’d rather be on the shelf than marry any of the gentlemen I’ve met so far.” She looked genuinely contrite. “I’m sorry, Amelia. I know you’re giving me practical advice, as always. Truly, I’ve tried to like the gentlemen I’ve met, but none of them is very interesting or appealing.”</p><p>“Perhaps one of them has hidden qualities,” Amelia said, making room for Cam as he sat beside her. “I wonder, Bea, if you might try to view gentlemen with the same sympathetic interest that you have for animals? In some regards, they’re not all that different. What I mean is—” She broke off and scowled at Cam, who had dissolved into helpless laughter. “Oh, hush, you know what I’m trying to say!”</p><p>Beatrix was trying unsuccessfully to hide a grin. “I understand, Amelia. I promise that from now on, I’ll try to think of eligible gentlemen as an interesting new species.”</p><p>After her younger sister had left, Amelia buried her face in her hands. A groan escaped through her fingers. “What are we to do with her?”</p><p>Cam smiled and pulled her close. He spoke in a soothing tone not unlike the one he had used for the tawny owl. “Be at ease, monisha. No ordinary man will do for Beatrix. We’ll have to let him appear in his own time.”</p> <p>“He’s taking too long.”</p><p>“Beatrix is only nineteen, love.”</p><p>“I know that. But she needs someone, Cam. Someone just for her. There’s a restlessness in her, a sense of aloneness . . . whatever it is, it makes her want to draw away from the family. She spends far too much time rambling alone in the wood. Even after Miss Mark’s etiquette instructions, Beatrix is still only half-civilized.”</p><p>Cam drew back to look at her, his gaze steady and thoughtful. “Having her marry the wrong person won’t solve the problem.”</p><p>“No, and I certainly don’t want that. It’s just that if the right man does come along, Beatrix will be so busy trimming alpaca hooves or rescuing orphaned badgers that she won’t notice him.”</p><p>Cam smiled. “She doesn’t have an alpaca.”</p><p>“Yet.” Amelia gave a rueful sigh. “I’m afraid this obsession with animals is Beatrix’s way of avoiding risk and pain. She’s never been quite the same since Mother and Father died. She was so young—I think losing them both so quickly affected her more than the rest of us.” Met with his silence, she gave him an anxious glance. “What do you think?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I think Beatrix will find someone when the time is right. And you’re trying to bend fate to your will, which never works.” He smoothed her hair back and kissed her forehead. “Relax. Let your sister follow her own path.”</p><p>“I’m not good at relaxing,” Amelia said, a rueful grin tugging at the corners of her mouth. “I’m far better at worrying.”</p><p>Cam slid a protective hand over the slight curve of her stomach. “I can’t allow that in your condition. Come upstairs with me, and I’ll see if I can help.”</p><p>“Thank you, but I don’t need a nap.”</p> <p>“I wasn’t thinking about a nap.”</p><p>Meeting his gaze, Amelia saw the glint in his eyes, and her color rose. “In the middle of the day?” she asked faintly.</p><p>A soft laugh escaped him. He stood and pulled her up from the settee, and kept her hand in his. “By the time I’ve finished with you, hummingbird, you won’t remember what you were worried about.”</p><p>Chapter Three</p><p>Beatrix kept the young owl close to her body, stroking the sleek feathers of her back. She felt the nervous clench of the bird’s talons against the leather gauntlet. The owl was light, fragile, and yet filled with tensile strength. “It’s all right,” she said gently. “I’ll take care of you. I’ll have you well soon, so you can fly back to your family.”</p> <p>“My sister is right, you know,” she said as she carried the owl toward the barn.</p><p>“I want to find a mate. But I’ve been through two seasons, and I’ve met a thousand men. And they’re all so languid and lifeless, and most of them spend their days in idle amusement, waiting for someone to die so they can inherit. They take pride in being sophisticated, which means they say the opposite of what they really mean, and then you’re supposed to praise them for being clever. Ha. At least when male owls come courting, they’ll bring food for you.”</p><p>The bird clicked quietly, her entire body vibrating.</p><p>“I agree,” Beatrix said. “One has to take the best of what’s offered.” A wistful smile touched her lips, and she curved her long fingers protectively around the stocky little body. “It’s just that I can’t help wishing to find someone who sees the world as I do. How silly and senseless all these rules are. Manners, corsets, gossip, asparagus forks . . . and heaven help me, polite conversation. If I can’t talk about something real, I’d rather not talk at all.”</p><p>She paused as the owl chattered at her. “What kind of man, you ask? I haven’t the least idea. I like the idea of marrying a Rom, but it’s awfully difficult to make them stay in one place. And I don’t want to roam the world. I like Hampshire. I’m quite territorial, actually.”</p><p>Entering the barn, a large limestone building, she made her way to the upper hayloft. It was a chall barn, built into a slope so that both the first and ground floors were accessible without the need for steps. Down below, there was central threshing floor, a row of cattle shippons, and built-in sheds for carts and implements.</p> <p>Beatrix went to a corner of the hayloft, and settled the owl into a nest box.</p><p>“Here you are,” she said tenderly. “A dry, safe place for you to rest. In just a little while I’ll take my ferret Dodger to the granary, and we’ll catch dinner for you.”</p><p>Sunlight pressed through the slats of a louvered window, sending bright yellow stripes across the hayloft. Sitting by the nest box, Beatrix watched the owl preen herself. “Is there someone waiting for you?” she asked. “Someone who’s wondering where you’ve gone?”</p><p>Leaning her head back against the wall, Beatrix closed her eyes and inhaled the comforting incense of hay and cattle and barn-smells. “The problem is, I’m not going to find the man I want in a stuffy London drawing-room. I want . . .”</p><p>But she fell silent, unable to confess or describe the intense yearning she felt, the caged feeling that would only be released by someone whose force of will equaled her own. She wanted to be loved . . . to be overtaken, challenged, surprised. And she had found no one like her imaginary lover in the succession of passive town dandies she’d met during the season.</p><p>Picking up a stalk of hay, she nibbled thoughtfully at the tip, tasting its dry sweetness. “Is it possible that I’ve already met him but somehow overlooked him? I can’t imagine it. I’m sure he’s not the sort of man one could--”</p><p>“Miss Beatrix!” It was a young boy’s voice, coming from the open threshing area below. “Miss Beatrix, are you up there?”</p><p>Beatrix’s brows lifted. “Excuse me,” she told the owl, and went to peer over the edge of the hayloft. “Thomas,” she exclaimed upon seeing one of the servants, an eleven year-old hall boy named Thomas. He lived with his parents in the village and came to work at Ramsay house every day after attending school. A busy, bright-eyed child, Thomas was given tasks such as polishing boots or cutlery, or assisting the footmen in their work. “How are you?”</p> <p>His round face was glum as he gazed up at her. “Awful, miss.”</p><p>“What is the matter?” Beatrix asked in concern.</p><p>“I’ve just come from seeing Fulloway’s traveling menagerie show in the village.</p><p>I should have saved my tuppence.”</p><p>Beatrix nodded, a frown pinching her forehead. The exhibition practices of such traveling menageries were criminal, in her opinion. Exotic animals such as tigers, lions and zebras were conveyed from town to town in so-called “beast wagons,” and displayed to the public, along with bands and jugglers and other entertainments. The animals always looked dispirited and maltreated, which filled Beatrix with outrage. It was inhuman to take an animal from the wild and confine it to a cage to be gawked at for the rest of its life. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I can’t abide traveling menageries,” Beatrix said. “And I’m not all that fond of zoological exhibitions, either.”</p><p>“I went to Fulloway’s because they advertised a dancing elephant,” Thomas said. “But Bettina—that’s the elephant’s name—dropped dead when they got here—they made her walk too fast and too far, someone said. So they put up a sign that reads, “Dead elephant on display,” and they showed it to us and let some people poke the carcass with sticks.”</p><p>“I don’t need to hear more,” Beatrix said. “That’s dreadful, Thomas.”</p><p>“There’s only one elephant left, a small one, but he won’t dance or even stand up,” the boy added. “The band plays music, and the trainers prod him with a bull hook, but he just lays there moaning.”</p> <p>“I’m sure he’s mourning his friend,” Beatrix said quietly.</p><p>“The dead one was his mother, they said.”</p><p>A feeling of sadness pressed down on her, until Beatrix could hardly breathe from the weight of emotion. Closing her eyes, she thought, You can’t save all of them.</p><p>Moreover, she couldn’t let herself become any more eccentric than she already was.</p><p>No more misadventures. No more scrapes.</p> <p>“You have a way with animals, Miss Beatrix,” Thomas said. “Maybe you could visit the elephant and do something for ‘im? If he would just move a little, they might stop jabbing him with that bull hook.”</p><p>“I’m not at all familiar with elephants,” Beatrix said. “There’s nothing I can do. I’m sure he’ll recover on his own, Thomas.”</p><p>“Yes, miss.” Obviously disappointed, the boy went to attend to his chores.</p><p>Beatrix groaned and went back to the nest box. “I can’t help him,” she said, staring at the drowsing owl. “I can’t.”</p><p>But she couldn’t stop imagining the young elephant collapsed in despair, while people were entertained by the sight of his dead parent nearby.</p><p>God help her, she knew what it was like to lose a mother.</p> <p>The village green of Stony Cross had been temporarily enclosed for the Fulloway Menagerie, at least fifteen large caravans arranged in a rectangle. A decidedly flimsy fence had been erected to the north of the enclosure, while decorative displays and signs had been arranged in front to attract potential ticket buyers. To lure in onlookers, a band on a wooden platform played polkas and lively airs, while a trio of acrobats performed a balancing act.</p><p>Beatrix glanced dismissively at one of the yellow caravans, which had been painted with a likeness of George Fulloway, the owner of the menagerie. Fulloway was a florid-faced man with cheeks that hung like saddlebags on either side of a white goatee and a billowing mustache that seemed to pull his upper lip aloft as he smiled.</p><p>“He must love animals,” Thomas commented, “to collect so many of them.”</p><p>Viewing the filthy monkey cages nearby, Beatrix smiled without humor. “One wonders,” she said, “if he has their best interests at heart. Where did you see the little elephant, Thomas?”</p><p>“In the pen on the other side of those wagons. The fencing’s awful flimsy . . . it wouldn’t hold him if he wanted to go somewhere.”</p><p>“Where would he go?” Beatrix asked rhetorically.</p><p>They went cautiously around the perimeter of the fencing, and saw the dejected bulk of an elephant on the ground, beside the fence. He was smaller than Beatrix had expected, certainly no more than five feet when standing. His skin was gray, and sparsely covered with hair, and his ears were relatively small. An Indian elephant, reputedly more timid than the African species.</p><p>The animal’s eyes were half-open, his gaze on Beatrix as she approached the fence. But he didn’t stir, only lay there as if he were drugged or ill.</p> <p>Or prostrate with grief.</p><p>“Hello, boy,” Beatrix said gently. “What is your name?”</p><p>“Ollie, the sign said,” Thomas volunteered.</p><p>Beatrix lowered to her haunches, looking at the elephant through the fence.</p><p>Taking out an apple she had brought, she rolled it through the flimsy slats. “That’s for you, Ollie.”</p><p>The young elephant regarded the fruit listlessly but made no move to take it.</p><p>“Look at the scars on his stomach,” Beatrix told Thomas. “And the fresh wounds around his neck. They’ve struck him with the bull hook in places where it’s not as likely to show.”</p><p>“His hide looks right thick,” Thomas observed. “Maybe he doesn’t feel it.”</p><p>“You think not? When something tears the skin until it bleeds, it is painful, Thomas.”</p><p>The boy looked contrite. Before he could reply, however, they were interrupted by a harsh voice.</p><p>“What are you doing? Making mischief, are you? Get away from that animal, both of you!”</p><p>Beatrix stood slowly as a lean, hatchet-faced man approached them from inside the pen. He was dressed in rough clothes and a bowler hat with a rounded crown. One of his hands grasped a long implement with a large iron hook at the end.</p><p>“We meant no harm,” Beatrix said, trying to sound conciliatory, even though she was filled with hostility at the sight of a man approaching a helpless animal with a weapon.</p><p>“If you want to see the animals, you’ll have to pay tuppence like everyone else.”</p><p>“Is the elephant ill?” Beatrix asked.</p><p>The man responded with a scornful laugh. “No, only lazy.” He brandished the bull hook. “He’ll show some spirit before I’m through.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Perhaps he needs some time to recover after the death of his mother.”</p><p>A smile twisted the man’s mouth. “Just like a woman. You think a poor dumb brute’s got feelings, when Ollie’s only shirking. And considering what he eats, he’d better earn his keep!” He came to the dispirited creature, jabbing him with the bull hook. “Time to dance, Ollie. You’ll perform while the band plays, or I’ll make short work of you.”</p><p>“May I speak to him?” Beatrix asked impulsively. “Just for a moment?”</p><p>“Speak to him?” The request earned an incredulous glance, and he viewed her as if she were a halfwit. “Who the blazes are you?”</p> <p>“This is Miss Hathaway,” Thomas said, before Beatrix could hush him. “Animals love her—she can speak their language. Please let her talk to him, sir!”</p><p>The man began to laugh, shaking his head. “Speak elephant, do you?”</p><p>“No, sir,” Beatrix said with dignity. “It’s only that I treat animals with kindness and respect. Most of them respond quite well to that. You might try it sometime.”</p><p>The quiet rebuke seemed to sail right over his head. “Go on, then. See if you can wheedle him into doing his job. And if your means don’t work, mine will.”</p><p>Beatrix nodded and lowered to the ground. “Ollie,” she said softly. “Poor Ollie. . . you must believe that I’m a friend.” Reaching her slender arm through the slats, she rested her hand on the ground, palm-up. “I know you don’t feel like eating, or dancing, or doing any of the things they want of you. I know your heart is broken. I lost my mother when I was young, too. And the truth is, you’ll never stop missing her.</p> <p>But there are others who will love you. Who want to help you. And I’m one of them.”</p><p>As Beatrix spoke, an inquiring trunk crept toward her hand and touched her palm gently. She curved her fingers against the warm, rough skin. After a moment, Ollie held his trunk up to her face, seeking the scent of her breath. “I’ll help you,” she whispered. “Trust me. But for now, please get up and do as he asks.”</p><p>The elephant reached for the apple, picked it up, and tucked it into his mouth.</p><p>Chewing slowly, he lurched to a sitting position, his bottom legs splayed in the manner of a young child.</p><p>“He’s doing it,” Thomas said in gratified wonder.</p><p>The man with the bull hook let out a bark of surprised laughter.</p> <p>It seemed none of them dared to speak, watching as Ollie got up one leg at a time. He faced Beatrix, standing as close as possible to the fence to view her with clear, heavily-lashed brown eyes. His trunk reached over the fence, and Beatrix extended her arm. Carefully he wrapped his trunk around her arm up to the elbow, a sort of elephant handshake.</p><p>“That’s enough,” the man declared, reasserting his dominance over the situation. “If you want to view the elephant, you can pay tuppence and go through the entrance along with the other visitors.”</p><p>“Not a word of thanks?” Thomas asked indignantly. “If it weren’t for Miss Hathaway—”</p><p>“That’s perfectly all right,” Beatrix interrupted, gently disentangling her arm from the elephant, trying desperately to ignore his stare of mournful appeal. “We have to go now. Goodbye, Ollie.”</p><p>For now, she added silently, and forced herself to walk away.</p><p>Chapter Four</p><p>A summer storm assailed Hampshire the night before Win and Merripen’s wedding, lashing Stony Cross with rain and high winds that damaged homes and brought down trees. Thankfully there were no reports of injury to any of the village residents, and the morning rose bright and clear.</p><p>Win awoke with the vague memory of Kev having left her some time after midnight, so as not to risk the bad luck of seeing his bride on the wedding morning. My superstitious Rom, she thought with a drowsy smile, curling her arms around the pillow he had used.</p> <p>“Good morning, dear,” came Amelia’s cheerful voice.</p><p>“Good morning.” Win sat up and yawned. “It’s my wedding day! I thought it would never arrive.”</p><p>“Oh, it’s here,” Amelia said wryly, coming into the room. She was wearing a ruffled white dressing-robe and carrying a cup of tea. She gave the tea to Win and sat carefully on the edge of the mattress.</p><p>“Have you been up and about for long?” Win asked.</p><p>“Nearly a half-hour. And I have a great deal of news to report.”</p><p>Win’s fine brows lifted. “Are we having any of the bad luck that Kev was worried about?”</p><p>“To start with, Beatrix awoke with a head-cold, quite a snifter. I think she must have gone out to the barn during the storm to see if her owl was all right. She tracked in a cartload of mud and water, and the housekeeper is annoyed.”</p><p>“Poor Bea,” Win said in concern, lifting the tea cup to her lips.</p><p>“There’s more. The vicar sent a boy from the village this morning to tell us that a tree fell onto the room of the church and knocked part of it in. And the rain poured into the chancel and main sanctuary.”</p><p>“Oh no.” Win frowned. Perhaps Kev’s forebodings had been right, after all.</p><p>“Does that mean we’ll have to put the wedding off?”</p><p>“Were the bridegroom anyone other than Merripen, I would say yes. But he’s being stubborn. Cam and Leo are talking with him downstairs.”</p><p>They were both silent for a moment, listening intently.</p><p>“I don’t hear any shouting,” Win said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Merripen is being very calm, actually. But I think he’s covertly planning to murder someone. He told me to come help you dress—he says there will be a wedding.</p><p>Somehow. Somewhere.”</p><p>“Very well.” Smiling, Win took another swallow of tea. “I know better than to doubt him.”</p><p>Having accompanied the errand boy to town, the Hathaways’ brother Leo assessed the damage to the church and spoke to the vicar. Immediately upon returning to Ramsay House, Leo went to confer with Cam and Kev. Leo was a tall, blue-eyed scoundrel, articulate under pressure, perpetually irreverent. He was also a master at bending rules and slipping around regulations. If there were any way to push the wedding through, Leo would find it.</p> <p>“No chance of a ceremony inside the church,” he reported to Kev and Cam as they gathered in the main parlor. “It’s a sodding mess.”</p><p>“We’ll get married on the church steps, then,” Kev said.</p><p>“Impossible, I’m afraid.” Leo looked rueful. “According to the rubric of the church, it has to be inside a church or chapel that has been officially licensed. And neither the vicar nor the rector dare go against the laws. The consequences are so severe that they might receive three years’ suspension. When I asked where the nearest licensed chapel was, they looked in the records. As it happens, about fifty years ago our estate chapel was licensed for a family wedding, but it ran out since then.”</p><p>“Can we renew it?” Cam asked. “Today?”</p><p>“I asked that. The rector seemed to think it was an acceptable solution, and he agreed as long as Merripen and Win promised to privately solemnize the marriage at the church as soon as the roof is repaired.”</p> <p>“But the marriage would be legal starting today?” Kev demanded.</p><p>“Yes, legal and registered, as long as it’s held before noon. The church won’t recognize a wedding if it’s held even one minute after twelve.”</p><p>“Good,” Kev said curtly. “We’ll marry this morning at the estate chapel. Pay the rector whatever he demands.”</p><p>“There’s only one problem with this plan,” Cam said. “We don’t have an estate chapel. At least, I’ve never seen one.”</p><p>Leo looked blank. “What the bloody hell happened to it?”</p><p>They both glanced at Kev, who had been in charge of the estate restoration for the past two years. He had taken down walls, razed small buildings, and made new additions to the original manor house.</p> <p>“What did you do with the chapel, phral?” Cam asked apprehensively.</p><p>A scowl settled on Kev’s face. “No one was using it except some nesting birds.</p><p>So we turned it into a granary and attached it to the barn.” In the face of their silence, he said defensively, “It still counts.”</p><p>“You want to be married in a granary?” Leo asked incredulously. “Among bins of animal feed?”</p><p>“I want to be married anywhere,” Kev said. “The granary’s as good a place as any.”</p><p>Leo looked sardonic. “Someone may want to ask Win if she is willing to be married in a former chapel that now amounts to a shed attached to the barn.</p><p>Forbearing as my sister is, even she has standards.”</p><p>“I’m willing!” came Win’s voice from the stairs.</p> <p>Cam smothered a grin.</p><p>Leo shook his head and spoke in his sister’s direction. “It’s a barn, Win.”</p><p>“If our Lord didn’t mind being born in a stable,” she replied cheerfully, “I certainly have no objection to being married in a barn.”</p><p>Briefly lifting his gaze heavenward, Leo muttered, “I’ll go take care of the renewal fee. I can hardly wait to see the vicar’s expression when I tell him we’ve turned the chapel into a granary. It doesn’t reflect well on this family’s piety, let me tell you.”</p><p>“You’re concerned about appearing pious?” Kev asked.</p><p>“Not yet. I’m still in the process of being led astray. But when I finally get around to repenting, I’ll have no damned chapel for it.”</p><p>“You can repent in our officially licensed granary,” Cam said, shrugging into his coat. He headed to the front door, opened it, and paused as the ebullient sound of guitars and Romany voices flowed inside.</p><p>Joining him at the door, Kev saw at least three dozen of their Romany relations clustered at the front of the house, dressed in colorful finery, singing and playing.</p><p>“They’re supposed to be traveling,” Kev said dazedly. “What are they doing here?”</p><p>Cam rubbed his forehead as if to push away an encroaching headache. “It looks like they’ve come to help us celebrate your wedding.”</p><p>“I don’t need that kind of help,” Kev said.</p><p>Leo came up behind them. “Well,” he remarked, “the good news is, there’s not much else than can go wrong now.”</p><p>Thanks to the hurried efforts of Amelia, Poppy, Beatrix and their companion Miss Marks, the granary was adorned with flowers and white ribbon, and rose petals were scattered generously over the wooden floor.</p><p>After a generous so-called “renewal fee,” the vicar offered no objections to performing the ceremony in the makeshift chapel. “As long as it’s done by twelve,” he told the family, “the marriage will be registered today.”</p><p>At precisely eleven-thirty, Kev waited with Cam at one end of the granary, which had been modified with large doors on both sides to allow for the easy transport of grain, implements and carts. Romantic guitar music floated in from outside, while an eclectic mixture of guests crowded into every inch of available space in the granary. A path was left clear for the bride. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Standing in the front of the granary with her family, Beatrix sneezed into a lace handkerchief. As she glanced at Merripen, she felt a surge of overwhelming happiness for him. He and Win had loved each other for so long, and had overcome so many seemingly impossible obstacles. How many people took marriage for granted, whereas for Merripen it was a reward for years of sacrifice.</p><p>Win entered the church on Leo’s arm, and proceeded through the granary. She was pristine and beautiful in a simple dress, silk whiter than moonlight, overlaid with lace gauze, her face partially concealed by a lace veil. Merripen watched her as if he’d found himself in some wondrous dream he didn’t want to wake from.</p><p>Carefully he lifted the veil and folded it back, and stared down into Win’s smiling face. The gaze they shared was intimate, trusting, ardent . . . it was devotion, Beatrix realized. The feeling between them seemed to cast a spell over the gathering.</p><p>“Dearly beloved,” the vicar began, “we are gathered together here in the sight of God, and in the face of this congregation, to join together this Man and this Woman in holy Matrimony . . .”</p> <p>Beatrix couldn’t help but wish that the vicar would hurry. The hour of noon was fast approaching.</p><p>“. . . therefore is not an enterprise to be taken unadvisedly, lightly, or wantonly, to satisfy men's carnal lusts and appetites, like brute beasts that have no understanding; but reverently, discreetly, advisedly, soberly . . .”</p><p>Feeling another sneeze come on, Beatrix hastily buried her nose in her handkerchief. It was one of those sneezes that couldn’t quite decide what it was going to do . . . it just hovered, tickling and stinging, until finally the feeling subsided.</p><p>Beatrix was relieved, because she certainly didn’t want to disrupt the ceremony with a loud sneeze.</p><p>And then she saw it . . . a long gray trunk emerging from an open transom space between the barn and the granary. Beatrix’s eyes widened. She couldn’t move a muscle, couldn’t say anything as the trunk delicately reached for Win’s veil and headpiece, and plucked it off her head.</p> <p>A few gasps and yelps of surprise came from the crowd.</p><p>Lifting a hand to her head, Win shot a confused glance toward the transom.</p><p>Kev instinctively put a protective arm in front of her. Together they stared at Ollie, who watched them through the opening in the wall, waving the veil back and forth as if he were cheering them on.</p><p>Everyone fell silent, the group struggling as a whole to comprehend what their gazes were telling them.</p><p>Leo was the first to speak. “Beatrix,” he said calmly, “do you have something you’d like to tell us?”</p><p>Chapter Five</p> <p>“I’m so sorry,” Beatrix said, “but I can explain everything. You see, this poor animal was being terribly abused, and so I thought—”</p><p>“Beatrix,” Merripen interrupted, “I’m very interested to hear your explanation, but we only have a quarter-hour left. Could we—” He paused as Win turned her face into his shoulder and made a peculiar gasping sound. At first Beatrix thought her sister might have been crying, but as Merripen slid his fingers beneath Win’s chin and tilted her face upward, it became evident that she was choking on giggles. Merripen couldn’t hold back a grin. With an effort, he mastered himself and asked Beatrix mildly, “Could the explanation wait until after twelve?”</p><p>“Certainly,” she said, and motioned to Ollie to cease his veil-waving. He stopped and watched the ceremony attentively.</p><p>The vicar gave the elephant an apprehensive glance. “I’m not certain the church allows animals to attend weddings.”</p><p>“If there’s a fee for it,” Leo assured him, “we’ll settle up later. For now, let’s proceed.”</p><p>“Yes, my lord.” Clearing his throat, the vicar continued the ceremony with great dignity. Eventually he said, “Therefore, if any man can show any just cause why they may not lawfully be joined together, let him now speak, or else hereafter for ever hold his—”</p><p>“Stop at once!” came a booming, stentorian voice, and the entire congregation turned toward the back of the granary.</p><p>Beatrix’s stomach dropped as she recognized the man’s distinctive white moustache and goatee.</p> <p>It was Mr. Fulloway, the owner of the traveling menagerie.</p><p>She didn’t dare glance at Ollie, but out of the periphery of her vision she saw his trunk withdraw stealthily into the barn.</p><p>“I’m here to retrieve stolen property,” Fulloway announced, his eyes narrowed to slits.</p><p>The man beside him carried a bull hook. He and Beatrix recognized each other at the same time. “That’s her, Mr. Fulloway,” he snapped. “The Hathaway girl I caught visiting Ollie in his pen yesterday. She’s the one who took him, I guarantee it!”</p><p>Leo stepped forward, suddenly looking every inch the aristocrat, his face hard, his eyes the icy blue of glaciers. “I am Lord Ramsay,” he said. “You’re trespassing on my estate. And in case you hadn’t noticed, you’re interrupting a wedding.”</p><p>Fulloway made a scoffing sound. “You can’t get married in a barn.”</p><p>“This isn’t a barn,” Leo said, “it’s our family chapel. There’s the vicar, and that fellow with the large fists and the feral gaze is the bridegroom. And if I were you I wouldn’t delay his wedding, or you may not live to see another morning.”</p><p>“I’m not leaving until I get my elephant,” Fulloway thundered. “He draws in paying customers, and I need him for my business, and besides, he’s mine.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He’s here, Mr. Fulloway!” came a muffled shout from the other side of the wall, and Beatrix realized with alarm that Fulloway had sent someone into the barn to look for Ollie.</p><p>The air was rent with a frightened trumpet. Ollie fled the barn and came racing into the attached granary, desperately seeking refuge. Seeing Beatrix, he went to hide behind her, his entire body trembling. She backed up to him protectively, and glared at the man with the bull hook as he strode toward her. “You can’t have him, you butcher!” she shouted.</p><p>“You’re a thief!” Fulloway bellowed. “I’ll have you prosecuted!”</p><p>The entire barn erupted into a cacophony, everyone shouting, Gypsies crowding in from outside, while Ollie trumpeted and screamed. Even the vicar had raised his voice in the effort to be heard.</p> <p>Merripen viewed the chaos in the granary with baffled fury.</p><p>“Quiet!” he thundered.</p><p>Everyone fell silent. Even the elephant.</p><p>“For the next ten minutes,” Merripen warned the entire gathering, “no one is to move, speak, or even breathe. All of this will be sorted out after noon. For now, any one of you who interrupts will find himself tossed headfirst into the nearest grain bin.”</p><p>Win slipped her arm through his, and they turned to face the vicar.</p> <p>As Merripen stared at him expectantly, the vicar proceeded. “Wilt thou have this woman to thy wedded wife, to live together after God's ordinance in the holy estate of matrimony? Wilt thou love her, comfort her, honor, and keep her in sickness and in health; and, forsaking all other, keep thee only unto her, so long as ye both shall live?”</p><p>“I will.” Merripen’s voice was quiet but strong.</p><p>The vicar asked the same of Win.</p><p>“I will.” A flush of happiness rose in her cheeks.</p><p>And the vows continued. “For better for worse, for richer for poorer, in sickness and in health, to love and to cherish . . . with this Ring I thee wed, with my Body I thee worship . . .”</p><p>Finally, Merripen slid a simple gold band onto Win’s finger.</p> <p>The vicar finished, “Those whom God hath joined together let no man put asunder.”</p><p>And in one impassioned, decidedly improper, highly romantic moment, Merripen bent to kiss his bride. Her lace-covered arms rose around his neck, and she clasped him tightly, their mutual joy radiating through the makeshift chapel.</p><p>Beatrix smiled and dabbed her eyes. Still standing behind her, Ollie waved the wedding veil briskly, the tail of it flapping against her side.</p><p>“Now,” Mr. Fulloway said, coming forward, “I’ll take my elephant.”</p><p>“No,” Beatrix cried, glancing desperately at her family. “They’ll kill him as they did his mother. Look at the wounds around his neck, and the—”</p><p>“Hush,” Merripen said, making a staying gesture with his hand. Keeping his gaze on Fulloway, Merripen paused as Win stood on her toes to whisper something in his ear. He smiled ruefully. “Anything you ask,” he murmured. Stepping forward, Merripen inserted himself between Fulloway and the elephant. “It seems that my wife—” He hesitated almost imperceptibly, seeming to savor the last two words,</p><p>“would like to have the elephant as a wedding present. Which means we’ll be negotiating for him.”</p><p>“I’m not open to bargaining,” Fulloway said. “He’s the only elephant I’ve got left, and—”</p> <p>“You misunderstand,” Merripen interrupted quietly. “I’m not asking if we can negotiate, I’m informing you that we will.”</p><p>Fulloway’s complexion reddened behind snowy swaths of facial hair. “No one tells me what to do. Do you know who I am?” He turned to gesture sharply to the man with the bull hook.</p><p>But at that precise moment Cam grasped the man’s wrist, twisted sharply, and the bull hook clattered to the floor.</p><p>Behind Beatrix, Ollie flapped his ears and gave a rumbling chortle.</p><p>Fulloway found himself corralled between Leo and Merripen.</p><p>“Have you heard of the legislation passed three years ago, outlawing wanton and malicious cruelty to animals?” Leo asked. “No? Well, I know all about it, as I’ve had to sit through everlasting sessions of Parliament while they’ve brought up new amendments. And if you give us any further difficulty, you’ll find yourself so busy defending against prosecutions, you’ll have to close your bloody traveling show and—”</p><p>“All right,” Fulloway said, unnerved by Merripen’s threatening glare. “I’m willing to negotiate. But I want a fair price. This is no cut-rate elephant!”</p><p>Beatrix sighed in relief. Ollie came to stand beside her, and she stroked his ear comfortingly. “You’re not going back,” she murmured. “You’re safe now.”</p><p>Her sister Amelia approached them, gazing at Ollie in wonder. Carefully Amelia reached out and rubbed the elephant’s forehead, and smiled into his clear brown eyes. “What a well-behaved fellow,” she said. “I never suspected an elephant would comport himself so nicely at a wedding.”</p><p>“Amelia,” Beatrix said apologetically, “I know what I promised earlier, but—”</p><p>“Wait,” Amelia said, her voice gentle. “Before you say anything, Bea . . . Cam told me to let you follow your own path. And he was right. You don’t have to change yourself to suit someone else. You’re perfectly wonderful the way you are.” She smiled. “All I want is for you to be happy. And I don’t think you could be, if you weren’t free to follow your heart.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Beatrix launched forward and hugged her sister. “I love you,” she said.</p><p>As they stood embracing, Ollie tried to wrap his trunk around them.</p><p>“We’re not keeping him,” Leo warned. “You’re going to find some kind of sanctuary or refuge for him, Beatrix.”</p><p>“Yes, of course. Some place with other elephants. He’ll want to live among his own kind.” Beaming, Beatrix led the elephant out of the granary. “But in the meantime . . . won’t the neighbors love it when I take Ollie out for a walk?”</p> <p>Dressed in a white nightgown, her fair hair loose and flowing, Win entered the bedroom to find Kev waiting for her.</p><p>Their first night as husband and wife.</p><p>And although Kev, in all his dark handsomeness, was beloved and familiar to her, she felt a pleasant ripple of nervousness.</p><p>He stripped off his shirt, revealing a sleek, powerful torso, and tossed it aside.</p><p>His gaze smoldered as it passed over her slowly. Standing beside the bed, he extended a commanding hand, palm-up.</p> <p>“Your slipper,” he said.</p><p>So he intended to adhere to the Romany tradition, Win thought, amused and perhaps the slightest bit annoyed. Her shoe would be placed on his side of the bed to show who was master. Very well. He could have his symbolic victory.</p><p>Although it would prove nothing.</p><p>Win removed a slipper and went to hand it to him.</p><p>In the process, however, she nearly tripped over something on the floor. She paused to glance down at it in mild surprise.</p><p>A large black man’s shoe had been placed on her side of the bed.</p> <p>Understanding, Win glanced up at him with laughter in her gaze. “But who’ll be in charge?”</p><p>Taking her slipper, Kev set it ceremoniously on the floor, and reached for her.</p><p>“We’ll take turns,” he said, his hard arms closing around her, his warm breath caressing her lips just before he kissed her. “Me first.”</p><p>The End - </p> </body></html>"]