["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>ONE</p><p>Her hose was shredded, Ria thought, staring uncomprehendingly at the bottoms of her feet.</p><p>Where were her shoes? Lost somewhere in the alley where</p><p>that bastard had tried to rape her as “down payment” on the protection money her family refused to pay.</p> <p>Something fluttered over her shoulders and was tucked around her, warm and thick. A blanket. She gripped it tight, then winced as her bloodied palms made contact with the wool. Her hands spasmed open. Released, the blanket began to slide to the floor of the large paramedic van.</p><p>“I’ve got you.” Following the deep voice, she blinked into a face she didn’t know. The changeling who’d thrown her attacker against the wall had been blond and blue-eyed, reminding her of the cocky youth of her younger brother, Ken. This man . . . he was hewn out of rougher material, his jaw shadowed, his eyes the rich amber shade of aged whiskey, his hair thick and dark, a hundred shades of brown and gold intertwined. “Come on, sweetheart, speak to me.”</p><p>She swallowed, tried to find words but they lost their way in the chaos of her brain, leaving her dumb. Instead, her mind filled with the terror of the lifetime she’d spent in that alley only minutes from her family home, in one of the streets surrounding the bustle of Chinatown. It had taken mere seconds for</p><p>everything to change. One moment she was smiling, and the next, her excitement at finishing her final night class had given way to pain and shock as he hit and pawed—</p><p>A smooth burst of Mandarin, so unexpected, so welcome that it broke through the haze of pain and fear. She looked up again, astonished. This man, this stranger was speaking to her in the language of her grandmother, asking her if she was okay. She nodded, found the words to say, “I speak English.”</p> <p>She rarely had to say that. Unlike her half-Caucasian mother, Ria had inherited little from her grandmother but her bones. Her hair was stick-straight, but a dark brown instead of jet black. Her eyes were faintly almond-shaped, but only if someone was really looking. She’d gotten the majority of her features from her brown-haired, brown-eyed All-American father.</p><p>“What’s your name, darling?” A hand cupping her cheek.</p><p>She flinched, but this hand, though big, was gentle. And patient. She relaxed into the warmth after long minutes, reassured by the calluses that spoke of a man accustomed to working with his hands. “Ria. Who are you?”</p><p>“Emmett,” he said, his voice holding nothing of laughter. “And I’m in charge of you.”</p><p>Her brow furrowed, the real Ria fighting her way through the fog of shock. “Who’re you to be in charge of me?”</p><p>“I’m big, I’m strong, and I’m pissed as hell that someone dared touch a woman on my watch.”</p> <p>She blinked. “Your watch?”</p><p>“Dorian’s part of my team,” he said, nodding to the blond man who’d turned her attacker into a sack of broken bones. “Wish he hadn’t done such a</p><p>good job—I would’ve liked to bloody the piece of shit myself.”</p><p>Ria wasn’t used to violence, but she knew without a doubt that this man was a changeling, that he could turn into a leopard with a single thought—and that the leopard had no problem with the most brutal kind of justice. When she looked into his eyes, she saw rage . . . and the flickers of something that wasn’t quite human. “He can’t hurt me.” Somehow, she found herself trying to comfort him.</p><p>“But he did.” An implacable statement. “And I’m going to sniff out the nest this little viper came from no matter what.”</p><p>She glanced at her assailant’s unconscious body. He was alive, barely. But he wouldn’t be talking for a while yet. “He wasn’t working alone?”</p><p>“Indications are he’s with a new gang.” Emmett tucked her blanket gently around her feet when it came loose. “Dark-River’s done a hell of a lot of work to clear the city of this kind of scum, but sometimes, they pop back up.”</p><p>Ria knew of DarkRiver. Who didn’t? The leopard pack, based in the Yosemite forest, had claimed San Francisco as part of their territory when Ria had been a child—no other predatory changelings could enter the city without their permission.</p> <p>But in the past few years, they’d gone further and begun to wipe out human predators, too.</p><p>“I can tell you a little about him,” she said, her voice gaining strength on a cresting wave of anger. “He came to my mother’s shop, left an account</p><p>number where she was supposed to wire ‘protection’ money. We thought he was just another thug.”</p><p>“I’ll get the number from you tomorrow. Right now, you need to be seen to.” Sliding one muscular arm under her legs, he curved the other around her back, just below her shoulders, and scooped her up before she knew what was happening.</p><p>She gave a startled cry.</p><p>“I won’t drop you.” A soothing murmur as he shifted her deeper into the van. “Just getting you out of the wind.”</p><p>She should’ve protested, but she was tired and achy and he was so warm. Resting her head against his heart when he sat down with her in his arms,</p><p>she breathed deep. Her body sighed. He smelled good. All hot and male and real, his after-shave something clean and fresh. Though he clearly needed to shave more than once a day. His jaw rasped against her hair as he settled her more firmly on his lap. Not that she minded, she thought, her eyes</p><p>fluttering shut.</p><p>Emmett stroked his hand over the hair of the mink in his arms. She was a little thing, and right now, she was at the end of her resources. Enraged at the thought that someone had dared harm her, he held her with conscious gentleness until he felt her begin to relax. When she sighed and snuggled closer, the leopard in him gave a pleased growl—right as Dorian looked into the van.</p><p>The blond soldier nodded at Ria. “She okay?”</p><p>“Where the hell are the paramedics?” Emmett snarled.</p><p>“With the piece of shit.” Dorian shrugged. “I should’ve killed him.”</p><p>The feral part of Emmett wanted to tell the man to go out there and finish the job, but he forced himself to think past the leopard’s need to maul and tear.</p><p>“We need any information he can give us on the Crew, so let’s hope he can talk later.”</p><p>“This is when a Psy would come in handy,” Dorian muttered, referring to the psychic race that was the third part of the triumvirate that was their world.</p><p>“One of the telepaths could rip the information right from the bastard’s head.”</p><p>“You guys are gruesome,” said a drowsy feminine voice.</p><p>Emmett looked down to find Ria’s eyes closed. “Yeah, we are.” But he had a feeling she was already asleep, her lashes dark-moon crescents against</p><p>skin so creamy, he wanted to taste it. Returning his attention to Dorian through sheer force of will, he said, “Did you find any emergency contact details in her wallet?” He’d left the young soldier to handle that while he took care of Ria.</p><p>“Yeah—parents are on their way.” Dorian’s smile was sharp. “Her daddy sounds like he’s itching for a fight, so maybe you shouldn’t look at her that way.</p><p>”</p><p>“Mind your own fucking business.” He tightened his hold.</p><p>Raising his hands, Dorian backed off, laughing. “Hey, your funeral.”</p><p>“Go get a paramedic here.”</p><p>“I think Tammy just arrived—she can stitch up your girl.”</p><p>The DarkRiver healer popped into the van on the heels of Dorian’s statement. “Let me have a look at her,” she said in a soft voice, putting her kit on the floor.</p><p>Ria’s eyes snapped open at the other woman’s first touch. Emmett ran a hand down her back in reassurance. “Ria, this is Tamsyn, our healer. You can trust her.” To his leopard’s delight, he felt her body relax almost at once.</p><p>“Call me Tammy.” Tamsyn smiled. “Everyone does.”</p><p>“I know you,” Ria said an instant later. “You bought a chunk of jade from my mom’s store.”</p><p>“Alex is your mom?” Tammy smiled at Ria’s nod. “I told her I needed something to threaten my mate with when he got blockheaded, and she said, why</p><p>not a block for a block?”</p><p>“That sounds more like my grandmother.”</p><p>Tammy grinned. “All women sound like their mothers after a certain age.” A wink.</p><p>Ria found herself smiling despite herself. “Then I’m doomed.” She held out her hands for Tammy to clean. “It doesn’t actually really hurt anymore.”</p><p>“Hmm, let me see. You got this falling on your hands?” Tammy was cleaning the dirt and debris from the wounds as she spoke.</p><p>Ria nodded, wincing at the sting of the antiseptic. “Yes.”</p><p>The healer looked at her now clean palms. “No cuts that need stitching,” the gorgeous brunette murmured. “Let me look at your face, sweetheart.” Her hands were incredibly competent and careful, for all that she looked like a fashion model, with her height and her elegant bones.</p><p>Ria had always wanted to be tall. That was the one thing she hadn’t inherited from her father.</p><p>Instead, she was stuck with her mother’s diminutive height</p><p>—but not Alex’s naturally slender body. No, Ria had gotten stuck with short and “curvy.”</p><p>Hah, more like generously padded. Her mother ate six dumplings in a row and had room for more. Ria ate three and put on five pounds.</p><p>“You asleep?” It was a rumble against her ear.</p><p>She shook her head. “Awake.” Sort of.</p><p>“Your face is going to bruise some,” Tamsyn told her, “but there’s no permanent damage.”</p><p>She soothed something over the skin. “This’ll help keep the bruising down.”</p><p>“Xie xie.” It came out automatically, a response to this healer’s touch. Tamsyn had hands like her grandmother. Caring hands. Trustworthy hands.</p><p>“You’re welcome.” A smile she could hear though her eyes were closed. “Emmett, you need to leave us alone for a few minutes.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She felt the big body around hers tense. Forcing open her lids, she patted him on the chest, not quite sure where she found the courage. The leopard</p><p>changelings were lethal when roused. But, in spite of the fierce scowl on his face, she had a feeling this cat would never hurt her. “I’ll be okay.”</p><p>“Tammy,” Emmett argued, scowl darkening even further, “she’s half asleep.”</p> <p>“I need to ask her some personal questions,” Tamsyn said in that calm, capable voice, “so I can see if she needs any other meds.”</p><p>Ria’s fuzzy brain cleared. “He didn’t get that far. Just knocked me around some.”</p><p>A growl filled the air. She jolted upright, heart thudding at a hundred miles an hour. “What was that?”</p><p>“Emmett.”</p><p>Blinking at Tammy’s tone, she glanced at the man who held her. “You?”</p> <p>“I am a leopard,” he said, as if surprised by her surprise.</p><p>“Forget him,” Tamsyn said, catching Ria’s gaze as she disinfected the scratches on her knees. “You sure about what happened, kitten? No one’s going to judge you.”</p><p>It was impossible not to trust this woman. “I threw my handbag at him, kneed him in the balls.</p><p>After that, he was more interested in hurting me than . . .</p><p>you know.”</p><p>Tamsyn nodded. “Alright, then. But if you ever need to talk, you call me.” She slid a card into the giant handbag someone had retrieved and put in the</p> <p>ambulance while Ria hadn’t been looking.</p><p>“That’s—” Ria began when there was a commotion outside.</p><p>“Where’s my daughter? You! Where is she? Tell me right now or I’ll—”</p><p>“Mom.” Ria felt tears rise for the first time as her mother entered the ambulance, pushing Tammy out of the way as if the other woman wasn’t stronger and taller.</p><p>“My baby.” Alex patted her all over, kissing her forehead with a mother’s tender warmth.</p><p>“That piece of shit.”</p><p>“Mom!” Her mother never swore. When Ria’s grandmother was feeling wicked, she called Alex a “tightass” simply to see her explode—her</p><p>grandmother was a firecracker.</p> <p>“You!” Alex fixed a gimlet eye on Emmett. “Why do you have your hands on my daughter?”</p><p>Those hands cuddled her even closer. “I’m looking after her.”</p><p>Alex huffed. “Didn’t look after her very well, did you? She got attacked right here, almost on the main road.”</p><p>“Mom,” Ria said, intending to stop the diatribe, when Emmett calmly nodded and said, “It was my fault. I’ll fix it.”</p><p>“It was not your fault,” Ria said, but no one was listening to her.</p><p>“Good.” Alex turned back to Ria. “Your grandmother’s waiting for you.”</p><p>“How did you manage to make her wait at home?”</p><p>“I told her you’d want her special jasmine tea when you got back.”</p><p>Emmett had grown up in a strong and vibrant pack. He’d figured he could handle Ria’s family. That was before he met her grandmother. Five feet nothing of pure fury and a tightly held rage that was all the more impressive for its control. Ria came first, of course. Emmett would’ve allowed noth-Ria came first, of course. Emmett would’ve allowed nothing less, even if her grandmother hadn’t ordered him to carry Ria—who was protesting that she could “walk, for goodness sake”—into what looked like the grandmother’s bedroom, so she could wash up and change. Soon as he’d completed that task, he was</p><p>banished to the kitchen to wait.</p><p>Ria’s father was still at the site, being restrained from giving the near-dead attacker even more of a beating. So was Ria’s older brother. Which left him in the kitchen with Ria’s mom and sister-in-law. Alex and Amber looked more like sisters than anything else. Ria’s mom was a pretty woman, petite and</p><p>graceful. Amber was cut in the same mold—even heavily pregnant as she was now, her features were delicate, her arms slimly fragile.</p><p>Emmett stayed very carefully in the chair where he’d been ordered to sit. He was afraid he’d break one of them if he accidentally touched them. Now</p><p>Ria, Ria he wanted to handle.</p><p>“Drink!” Something slammed in front of him.</p><p>He looked down at the puddle of jasmine tea around his little cup and decided not to mention Alex’s temper. “Thanks.”</p><p>“You think I don’t see it?” She poked him in the shoulder. “You, the way you look at my baby?”</p><p>Nobody dared attack Emmett. He wasn’t one of the more volatile leopards in DarkRiver, but he was beyond dangerous when riled. And wouldn’t all his</p><p>trainees just love to see him now, not daring to lift a finger for fear of bruising Alex. “How do I look at her?”</p><p>Alex narrowed her eyes. “Like a big cat with its food.” She hooked her hands into claws and made as if she was shoving others aside. “Like that.”</p><p>“You have a problem with that?”</p><p>“I have a problem with every man who wants to date my daughter.” With that, Alex turned and walked back to the counter. “And her father, he has twice the problem.”</p><p>Emmett wondered if Alex expected that to scare him off. “I grew up in a pack.” He was used to nosy packmates, snarling fathers, ferally protective</p><p>mothers.</p><p>Amber smiled when Alex sniffed and turned away. “They have problems with women, too,”</p><p>she said in a mock-whisper. “When I started dating Jet, Alex told me if I broke his heart, she’d beat me with a rolling pin.”</p><p>Alex waved the very same implement in Amber’s direction. “Don’t you forget it.”</p><p>Laughing, Amber hugged Alex. “She’s okay, Mom. Ria will bounce back—better than you or I ever would.”</p><p>That was when Ria’s male relatives returned. Her father’s first question was, “Who the hell is he?”</p><p>TWO</p><p>Ria sat back in the bubble bath her grandmother had drawn and sighed.</p><p>A light knock came moments later.</p><p>“It’s okay, Popo.”</p><p>Her grandmother came in. Though tiny, with a face that bore the million marks of a life well-lived, her stride was steady and her eyes clear. Miaoling Olivier had a whole heap of decades left in her yet, as she liked to say. Now, she walked in and took a seat on the closed lid of the toilet as Ria’s father began yelling in the kitchen.</p><p>“Here we go,” Miaoling said, rolling her eyes. “Sometimes, I think we accidentally opened our home to the inmates of an insane asylum.”</p><p>Ria felt her lips twitch, her eyes water. “They’re just angry and scared for me.”</p><p>“Smart girl.” Reaching over, her grandmother took one of Ria’s ravaged palms and brought it to her mouth.</p><p>The kiss was soft, loving. It healed Ria from the inside out. “I love you, Popo.”</p><p>“Do you know,” Miaoling said, “you’re the only one who calls me that. Ken and Jet both say nana.”</p><p>“That’s why they’re not your favorites and I am.”</p><p>“Shh.” Miaoling’s eyes twinkled as she put Ria’s hand back down on the edge of the bath.</p><p>“Did you thank the young man who found you? Maybe you</p><p>should bake him a cake.”</p><p>That made Ria smile. “Not interested,” she told her ever-hopeful grandmother. “He’s a little too beautiful for me.” The blond DarkRiver male was clearly a highly trained member of the pack, but slender, looked more like a teenage surfer than a grown man. Emmett on the other hand . . .</p><p>Her grandmother sighed. “You go on like this, your female parts will dry up.”</p><p>Ria snorted with laughter. “Popo!”</p><p>“What? I say only the truth.” Miaoling’s speech shifted, going from Harvard-perfect English to a rhythm she only ever used with those she was</p><p>comfortable with. “Your age, I had your mother on the way.”</p><p>“Times have changed—and I’m twenty-two, hardly shriveled up.” She rested her head against the wall. “Tell me how you met Grandfather.”</p><p>“Why? You know that already.”</p><p>“Please.” The story comforted her, and right now, she needed comforting.</p><p>“Alright, for my Ri-ri.” A deep breath. “I was living on a farm in Henan Province and my family was trying to arrange my marriage. But, ai, I was a terrible one. I wouldn’t marry any of the boys they brought around—too skinny, too fat, too stupid, too tied to his mama’s apron strings.”</p><p>“They let you get away with that?”</p><p>“I was only girl after three boys. I was spoiled.” Said with a fond smile. “Then one day, my father comes home and says, Miaoling, today you dress nice, American doctor is coming to the village to check old people’s eyes.”</p><p>“Cataracts.”</p><p>“Yes. My father says, maybe crazy American will want crazy Chinese wife who doesn’t listen to anyone. Of course, that makes me want to not like</p><p>American at all.”</p><p>Ria giggled, as drawn into the story as she’d been as a child. “Then Grandfather came to the house for dinner.”</p><p>“And I wore brown dress, ugly brown dress, with ugly brown shoes.” Her grandmother’s hand stroked over Ria’s hair, hair that Miaoling had once said held the silk of China but the lush chocolate shade of an entirely different culture. “But he’s so handsome. Pretty green eyes, yellow hair. And he’s nice. He laughs at me silently all night across the dinner table. He knows what I’m up to.”</p><p>“But he asked you to marry him anyway.”</p><p>“After one week. And crazy Miaoling said yes, and we came to America.”</p><p>“So quick,” Ria said, shaking her head. “Weren’t you scared?”</p><p>“Pah, why scared? When in love, no scared. Only impatient.”</p><p>“Don’t say it, Popo!”</p><p>But it was too late. “Impatient to use woman parts!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Emmett hid his grin in his jasmine tea. His hearing was leopard-acute. He could hear everything Ria’s grandmother was saying—and damn if he wasn’t half in love with the lady already. No wonder Ria’s grandfather had married her.</p><p>Glancing up, he caught Alex’s expression as her husband folded her into his arms. All her bluster aside, Alex really was worried about Ria. “No one will hurt your daughter again,” he said quietly, rising to his feet.</p><p>They all looked at him for long minutes, until finally, Simon, Ria’s father, nodded. But when he spoke, it was to say, “She’s not for you. She’s taken.”</p> <p>Emmett raised an eyebrow. “She’s not wearing a ring.” And if some moron had been stupid enough not to claim her when he’d had the chance, that</p><p>wasn’t Emmett’s problem.</p><p>“She will,” Simon said. “We’ve been friends with Tom’s family, the Clarks, for years. The marriage proposal is a formality.”</p><p>Emmett could hear Ria and her grandmother even now, giggling in the bathroom. Neither of them had mentioned this Tom in their discussion of utilizing</p><p>“woman parts.” The leopard gave a feline grin of satisfaction, though the man kept his face expressionless. “I have a feeling that nothing is a given with your daughter—she’ll make her own choices.” Of course, he had every intention of making sure she chose him, but no need to tell her parents that. Not yet.</p> <p>Two hours later, after a quick meeting with the DarkRiver alpha and a number of other soldiers, Emmett rubbed at gritty eyes as he accepted the beer Nathan threw him. “I’ve got to head home, get some sleep.”</p><p>“Take a few minutes to relax,” the sentinel—one of the pack’s highest-ranking soldiers—told him. “You’ve been taut as a bow all night. Everything go</p><p>okay with the girl who was attacked?”</p><p>“Yeah.” Emmett had no intention of discussing Ria further with anyone. Not tonight. “What was that Luc was saying about the Psy?” Changeling</p><p>concerns rarely intersected with those of the unemotional psychic race, but from what he’d caught tonight, it might in this case.</p><p>Nate took a swig of his beer. “You know how they dominate politics. We’ve heard they might try to neutralize the Crew themselves.”</p> <p>“Why? They don’t give a shit about human and changeling casualties.” The sole reason the other race stayed in power—aside from the fact that their competitors had a way of withdrawing from the race after the publication of one scandal or another—was their ability to make money, money that did</p><p>occasionally trickle down to the voters.</p><p>“We’re starting to step on their toes,” Nate said. “Psy like to be the top dogs in any given situation.”</p><p>“Guess we’ll have to move fast.”</p><p>“We’ve got a little time.” The other man put down his beer. “Apparently, not everyone in the Psy ranks is convinced we pose a credible threat.”</p><p>Emmett snorted. “They really can’t see beyond their ivory towers, can they?”</p><p>“Humans and changelings don’t figure much on their radar.” Nate’s smile was distinctly pleased. “And while they’re busy deciding whether or not to bother paying attention to us, we’ll take this city.”</p><p>Emmett raised his bottle in a toast. “To a successful campaign.” However, right then, he was thinking less about Dark-River’s takeover of the city, and more about a very private campaign of his own. Come on, mink, play with me.</p> <p>Ria lay in bed that night and sighed. She’d been cosseted, petted, and smothered half to death by her family in the hours since her return home. Most days, it would’ve made her certifiable. Today, she’d needed that warm blanket of love.</p><p>Warmth. Heat.</p><p>Her body softened, remembering what it had felt like to lie curled up in Emmett’s lap. She’d never found herself in a man’s lap before. Most of the men who’d dared run the gauntlet of her family’s protectiveness to ask her out were nice boys from the neighborhood. She had nothing against them. But the thing was, she’d grown up with a father who was fierce in his care of his family, and an older brother who hadn’t deviated far from the paternal mold when it came to looking after those who were his own. They ate those nice boys for breakfast.</p><p>Ria dreamed of a man who’d occasionally chew them up instead!</p><p>Hugging her pillow, she smiled at her own thoughts. You’d think she didn’t like her family.</p><p>That was far from the truth. But well, they were overwhelming.</p><p>They kind of took over everything. How was she supposed to respect a man who let himself be taken over?</p><p>I’ll be back to check on you tomorrow.</p><p>Emmett had said that right in front of her father.</p><p>Goose bumps broke out over her entire body. She wondered what those big, strong hands of his would feel like smoothing over her skin, all hot and—</p><p>Her phone beeped. She groaned when she saw the caller ID.</p><p>Tom.</p><p>Sighing, she went to answer, but the well-concealed devil in her made her turn off the cell instead. There was nothing wrong with Tom, except that he wanted to marry her. Her father liked Tom. Even Alex liked Tom. Ria had no problem with Tom. She just didn’t want to marry him. No, what she dreamed of was a love story like her grandmother’s—and Miaoling was the only one in the family who supported Ria’s resistance to the “Great Match.”</p><p>From Alex’s and Simon’s point of view, it truly was a great match. Like her, Tom was part Chinese. Like her, he’d grown up in the States, and had a very Western outlook on life, without having forgotten the other side of his heritage. Best of all, the Clarks and the Wembleys had been friends since before</p><p>either Ria or Tom had been born.</p><p>It was all perfect.</p><p>Except Tom would never laugh with her over a secret joke as her grandfather had done with her grandmother. He’d never hold her with the furious</p><p>tenderness with which Simon held Alex when he thought no one was looking. And he’d never pick a fight with her just so he’d get to make up, as Jet did with Amber.</p><p>Why couldn’t they see that she wanted the same thing? All her life she’d been content to let Jet and their younger brother, Ken, take the spotlight. Being the middle child was actually kind of nice—she got the best of both worlds, and her relationship with her siblings was airtight. But with her man, with her husband, she wanted to be number one.</p><p>“Go to sleep, Ria,” she muttered to herself, knowing she was obsessing because she was afraid of nightmares.</p><p>But when she did sleep, it wasn’t to fall into a nightmare . . . but into the powerful arms of a man who looked at her with eyes gone cat-green.</p><p>Emmett studied his face in the bathroom mirror the next morning and scowled. It was a wonder Ria hadn’t run screaming from him when he’d taken her into his arms. She was all soft and silky, a luscious armful. He, by comparison, looked like he’d had a few run-ins with both fists and walls. The fists were true, but like all changelings, he’d healed the damage fast. No, this was simply the face he’d been born with. It had never really bothered him before, but now he rubbed a hand over his stubbled jaw and decided he’d damn well better shave before he went to check up on Ria.</p><p>The shave and shower cleaned him up, but he was aware he still looked like a thug when he knocked on the door to her family home. He most definitely looked nothing like the pretty boy walking up the drive with a huge bouquet of roses.</p><p>Shit.</p><p>Why the hell hadn’t he thought to bring flowers?</p><p>“Hello,” the other man said in an Ivy League-educated voice. “I’m Tom.”</p><p>Emmett held out a hand. “Emmett.”</p><p>“Simon mentioned you on the phone,” Tom said with a friendly smile that failed to hide the calculation in his eyes. “You helped Ria last night.”</p><p>“You’re a friend of the family?” Emmett asked to see what Tom would say, just as the door opened.</p><p>“No, he’s my daughter’s fiancé,” Alex said, pulling Tom down for a kiss on the cheek.</p><p>Emmett glanced at Tom. “You don’t believe in rings?”</p><p>“It’s not official yet.” The other man was calm, confident, clearly sure of his suit.</p><p>Emmett didn’t smile, but the leopard snapped its teeth inside him. This human cub was about to learn that leopard males didn’t recognize any claim not acknowledged by the female. And Ria didn’t consider herself bound to this one. Even if he hadn’t overhead her conversation with her grandmother,</p><p>nothing about her had spoken of a commitment to another. She didn’t carry Tom’s scent . . .</p><p>and she hadn’t pushed Emmett away last night.</p><p>Saying nothing of that, he turned to face Alex. “Could I speak to Ria?”</p><p>“Why?” Alex’s eyes narrowed, even as she pulled Tom inside and put her hand on the opposite doorjamb as if to bar Emmett’s way.</p><p>“I need to see if she remembers anything else about her attacker.” Emmett’s leopard knew a worthy adversary when it saw one. Alex was one hell of a</p><p>protective mama-bear. But Emmett had tangled with plenty like her in the pack. “It’ll help us make the streets safer for all daughters.” No, he wasn’t above using emotional blackmail to talk his way in.</p><p>Alex dropped her arm. “Hmm. Come in—but if you upset Ria, I’ll beat you up myself.”</p><p>“I’m not fragile, Mom.” A familiar voice, a familiar scent—soft, fresh, but with a lingering spice to it.</p><p>He drew the contradiction of it deep into his lungs, his leopard keeping careful watch as Ria hugged her mother, then took the flowers from Tom. No</p><p>kiss. Good. His claws scratched inside his skin, wanting out, wanting to do damage. Pretty Tom with his slick hair and flawless skin irritated him.</p><p>“Emmett.” Ria looked to him, all big brown eyes and hair. “We can talk in the living room.”</p><p>As he nodded, Alex took the roses. “I’ll put these in water. Tom can sit with you for moral support.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“On second thought,” Ria said, making Alex freeze, “I think I’d rather go out for a walk—I can show Emmett where I was ambushed. Grandmother wants</p><p>to talk to Tom.”</p><p>Grinning inwardly at how neatly she’d cut off all options but the one she wanted, Emmett stepped out onto the drive and waited for her to join him.</p> <p>“You’ve done this before,” he said when she came up beside him and they headed off.</p><p>“You have to grow a fairly strong personality in my family,” she said, a smile flirting with her lips. “It’s a survival mechanism.” Reaching into the pocket of her coat, she passed over a folded piece of paper. “The account number.”</p><p>“Thanks.” He glanced at her features, frowning at the bruise she’d tried to hide under makeup. “Show me your hands.”</p><p>She turned them palm-sides-up. “Healing okay.”</p><p>“The bastard is in a coma,” he muttered, cupping her hands so he could inspect the damage.</p> <p>The leopard hated seeing her marked up. So did the</p><p>man. “You know a Psy we could chat up?”</p><p>“Well,” she said when he forced himself to let her go, “my mother’s accountant is Psy but I don’t think Ms. Bhaskar is into interrogations.”</p><p>“Pity.”</p><p>“So, last night . . .”</p><p>“Can you talk about it?” He paused to look down into her face. “If it’s too hard, we can delay it for a few days.”</p> <p>A hint of open irritation flared in her eyes. “What about making the streets safer for all daughters?”</p><p>“It’s important,” he admitted. “This gang, Vincent’s Crew, they’re taunting us. If we don’t get them out of the city soon, we lose the right to hold it.”</p><p>“Really?” Lines marked her forehead. “Why?”</p><p>“It’s about power,” he told her. “A predatory changeling pack can only legitimately claim territory it can hold—and that means clearing it of all other predators. The Crew calls our authority into question. Another changeling group could decide that means we have no right to this area.”</p><p>“And then blood would spill,” she said, voice solemn. “The SnowDancer wolves?”</p><p>“Dangerous,” he told her. “But they’re holding a massive amount of territory already. Our intel says they haven’t got the manpower to push us out.”</p><p>“But they’re not the only ones are they?” Sliding her hands into the pockets of her vivid red coat, Ria nodded left. “That’s the alley where he grabbed me.</p><p>I was walking home after a night class. My last class actually.”</p> <p>“Why were you alone?” he asked, a slight growl in his voice. “It was after dark.”</p><p>“It was barely eight.” Irritation sparked again—Emmett was starting to show the same overprotective tendencies as her parents. “And I’m an adult in case you haven’t noticed.”</p><p>A slow blink. “Oh, I noticed.”</p><p>THREE</p><p>Heat curled up from her stomach, spread through her limbs, threatened to color her face.</p><p>“Then don’t patronize me.” Steeling her spine against the impact, she met those gorgeous eyes of his. “My decision was a solid one. There were a lot of people around, heading out to restaurants or coming home from work. That excuse for a human being took me during a split-second respite in the foot traffic.”</p><p>“Means he had to have been following you, just waiting for an opportunity.” Emmett stared into the dark maw of the alley, his eyes narrowed.</p><p>She wondered if he’d even heard her first two sentences. “That’s what I thought. I’m always careful when I get off the skytrain, but it’s hard to pick up that sort of thing when so many people disembark at the stations.” Last night, the mass of humanity had spread out as soon as they hit the ground, but there’d been enough of a crowd going her way that she hadn’t really paid attention to anyone in particular.</p><p>“Until we neutralize the Crew,” Emmett murmured, still staring into the alley, “you don’t go anywhere alone.”</p><p>Her mouth fell open. “What?”</p><p>“To Death,” he said, turning to face her, “that’s their motto. They follow their quarry to death.</p><p>They’ll come after you again and again. It’s a matter of</p><p>‘honor.’ ” He all but spat on the street. “What the fuck kind of honor is it to hurt a woman?”</p><p>The unflinching conviction of his words reached straight through to the warm feminine core of her. But—“I can’t sit at home. I have to start interviewing for jobs for one.” Work was her ticket to freedom, a freedom she’d worked hard to gain. “And I take my grandmother to her appointments—”</p><p>“Who said you have to sit at home?” An intent stare.</p><p>Ria didn’t react well to any kind of intimidation. “Well, if I can’t go anywhere alone—and I’m not going to put my grandmother in danger—then what else</p><p>am I supposed to do, hire a bodyguard?” The minute, the second, her father found out about this, he’d use it as an excuse to stop her from finding a job.</p><p>Simon and Alex Wembley loved their only daughter. They loved her so much, they couldn’t bear to have the world put a single bruise on her soul. As a result, Ria had grown up being protected and cosseted. If it hadn’t been for her grandmother, she might have turned into a spoiled brat. Instead, she’d grown up cherishing her parents’ love . . . while understanding the sadness that lay behind its protective fervor. That’s why she hadn’t gone away to college like Ken—she hadn’t been able to put that much worry in their hearts. But she couldn’t live in a cocoon forever, not even for her mom and dad. It would</p><p>never suit her—it would, in fact, destroy her.</p><p>However, her parents hadn’t yet figured that out. In Simon’s and Alex’s minds, marriage to Tom would provide the ultimate protection—as a Clark wife, she’d be expected to do nothing more strenuous than look pretty and maybe arrange a few flowers. “Emmett?” she prompted when he remained silent.</p><p>“I’ll protect you.”</p><p>Her heart thudded. “How long?”</p><p>“As long as it takes.”</p><p>She almost took a step back at the sheer untamed power of him. “You can’t be with me twenty-four/seven. I won’t say no to an escort from the skytrain at night, though.” She was independent, not stupid.</p><p>“The Crew’s been known to kidnap people off the street in broad daylight.” His skin pulled taut over his cheekbones. “They intimidate any witnesses into silence, so their victims seem to disappear into thin air.”</p><p>The need for freedom came up against the logic of what he was saying. “What about my family?”</p><p>“We’ve already posted pack soldiers at your mother’s store and around your home. The Crew’s M.O. is to hit the women in the family, so your mother, sister-in-law, and grandmother are most at risk.”</p><p>“Amber’s over eight months pregnant,” Ria began.</p><p>“Really?” A teasing smile. “I thought she looked a bit different.”</p><p>She felt a flush stain her cheekbones. “She hasn’t been going out much anyway—if we tell her about the Crew’s tactics, she’ll probably be okay with staying inside for a bit.”</p><p>“It would definitely make our job easier. Your mother?”</p><p>“No way. She’ll go to work—she refuses to surrender to intimidation.”</p><p>“I can’t say that’s exactly a surprise.” He shook his head. “I’m not even going to ask about your grandmother. Just make sure she knows someone will</p><p>be shadowing her every time she goes out alone.”</p><p>“Knowing her, she’ll get them to carry her shopping.”</p><p>Emmett’s eyes gleamed. “And you?”</p><p>“I’ll be ignoring you,” she said, feeling an odd sense of excitement in her gut.</p><p>No smile, no hint of softening in his face. “You’re welcome to try.”</p><p>Emmett finished fixing the computronics inside his mother’s car and picked up his cell phone to call her. “I’ll drop it off tomorrow morning. It was a short circuit, nothing big.”</p><p>“Thanks, baby.” His mom was the only one Emmett let get away with calling him “baby.” The one time he’d tried to question her about it, she’d simply stared at him until he’d sighed and given in.</p><p>“Has Dad gotten in yet?”</p><p>“No,” she told him, her voice holding a rare kind of clarity. “He’s running an extra training session for some of the new soldiers. If things keep going the way they have been, I think there’ll come a time when we’ll have to take a stand against the Psy—we need to be prepared.”</p><p>Since his mother was the pack historian, her words carried real weight. “What do you see?”</p><p>“I’ve been tracking the Psy Council’s actions since I was a teenager,” she told him, “and year by year, I see more and more darkness creep into their</p><p>world. They’re slowly going beyond cold, to a place that makes me scared for the Psy race as a whole.”</p><p>Emmett felt no pity for the Psy—not given what he’d seen of their tactics, but his mother had always had a soft heart. “Lucas is obviously listening to you</p><p>—I’m scheduled to teach more sessions as well.” Somewhat to his surprise, he’d inherited his father’s way with the younger members of the pack.</p><p>His mother chuckled. “I hear he gave you the ten- to fourteen-year-old crowd.”</p><p>“They teach me patience.” It was a deadpan comment.</p><p>“Oh, Emmett.” Another laugh. “Why are you single? You’re gorgeous, good with children, and you adore your mother.”</p><p>Grinning, he fixed the timecode on the dashboard computer. “Not that you’re biased.”</p><p>“I get to be biased about my baby.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There is someone,” he found himself saying, “but she’s being stubborn.”</p><p>“I like her already.”</p><p>Ria did try to ignore Emmett as she’d vowed. But ignoring six feet and a few spare inches of predatory changeling, especially one as quietly dangerous as Emmett, was not an easy task. She could feel his eyes on her even while he stood easy task. She could feel his eyes on her even while he stood</p> <p>outside as she walked into a shop with her grandmother.</p><p>“Tea will take some time.” Miaoling patted her arm. “Go and talk to that leopard who looks at you like you’re food.”</p><p>Heat rushed into her cheeks. “He does not.” Though she’d found herself fighting the insane urge to stroke him . . . just to see what he’d do. Would he let her? The thought caused her stomach muscles to clench.</p><p>Miaoling made a face at Ria’s response.</p><p>Ria kept talking, knowing she was protesting too much. “He’s only protecting us because the Crew poses a threat to DarkRiver’s control of the city.”</p> <p>“Pah!” Miaoling waved a hand. “I know when a man’s hungry. And if you’d use your woman parts more often, you’d know, too!”</p><p>Thankfully, Mr. Wong appeared at that instant, eager to lead Miaoling upstairs to his apartment for their weekly tea-conference, as they called it. The two were as thick as thieves. Ria had no idea what they discussed at these conferences, but her grandmother always had a Cheshire cat smile on her face</p><p>when she left Mr. Wong’s.</p><p>At first, Ria had thought the two were . . . well . . . but her grandmother had put her straight with an unexpectedly solemn response.</p><p>“No, Ri-ri. I’ve loved only one man my whole life. I love the same man still.”</p><p>The depth of devotion in that single sentence had brought tears to Ria’s eyes. Her grandfather had been twenty years her grandmother’s senior, and had taken his last breath when Ria was fifteen. His death had devastated Miaoling, but she hadn’t ever broken down where Ria could see her. Instead, she’d used the memory of her love as a shield.</p> <p>Miaoling still spoke to her husband as if he could hear her. Though she never did it when pragmatic Alex was nearby, she was open with it in front of Ria. Because Ria understood. Truly, when she was with her grandmother, she sometimes thought her grandfather was in the room with them, watching over the wife who, he’d often complained, had always made him wait.</p><p>Going to be slow coming up to heaven, too, aren’t you, my darling?</p><p>Words her grandfather had said on his deathbed, his hand wrapped around his wife’s.</p><p>Miaoling had smiled and kissed him, teasing him to the last.</p><p>Now, as Ria watched Miaoling ascend to the second floor of the shop, she felt her heart contract. “Grandmother?”</p><p>“Yes?” Miaoling looked over her shoulder, her eyes warm, full of silent encouragement.</p><p>“How long will you be?”</p><p>“Perhaps three hours. We’re having lunch today as well.”</p> <p>“Then maybe I will go for a stroll.”</p><p>Her grandmother smiled and continued on her way.</p><p>Heading out of Mr. Wong’s, Ria found Emmett standing to her left, scanning the street. “Have you got someone who can stay here with my</p><p>grandmother?” she asked.</p><p>“She’s already inside,” Emmett said. “Mr. Wong’s planning to tell your grandmother she’s his new assistant.”</p><p>“The beautiful brunette minding the shop?” Her eyes widened. “She doesn’t look dangerous enough to swat a fly.”</p><p>“Not only can she swat flies, she can kill most men with a single blow.”</p><p>Ria felt a sudden sense of inadequacy. “I wish I could do that.”</p><p>“If you’re serious,” he said, looking her up and down in a way that was distinctly professional,</p><p>“I can teach you enough self-defense that you won’t ever</p><p>feel helpless again. You’re fit and you move well. You should pick it up quick.”</p><p>Startled, she stared. “You’d do that?” A few tentative tendrils of hope wrapped around her heart—she’d begun to believe that Emmett was as</p><p>suffocatingly protective as her father, but this argued differently.</p><p>“How much time do we have now?”</p><p>“Three hours.”</p><p>He straightened away from the wall. “We can practice in a small basement gym members of the pack use when they can’t get out of the city for a good hard run. You’ll need workout gear.”</p><p>Ria thought about it. “I’ll buy some. There’s a shop two blocks over.” That way, none of her family would even know about the training. Not that their objections would’ve stopped her—but she didn’t have time to have the argument.</p><p>Emmett slid his hand along Ria’s arm, positioning her as she needed to be, and asked himself—for the hundredth time—why he was torturing himself like this. Even in the loose sweats and T-shirt she’d changed into, the woman who currently stood with her back to his chest set his body on fire. But the little mink didn’t seem inclined to play—she’d been all business since the moment they got to the gym. The leopard wasn’t pleased. Neither was the man. But no way was he going to push himself on Ria and make her uncomfortable. Not after what that bloody waste of space from the Crew had done to her.</p><p>“There.” He released her. “Perfect. Now kick.”</p><p>Ria brought up her leg in a forceful, fast kick. It wasn’t graceful or poetic. It was hard, rough, dirty. Emmett didn’t care about pretty. He cared about</p><p>making sure she could protect herself. “I want you to practice for ten minutes while I go make a few calls.”</p><p>Giving him a nod, Ria began to go through the beginner routine he’d devised. She was a fast learner, but as a human, her strength was much less than</p><p>a changeling’s. Added to that, she was small and female—so the next time they worked out, he planned to teach her to fight using anything at her</p><p>disposal, as she’d used her handbag two nights ago. That is, unless she had the option to turn and run. A physical fight would never be the smart first choice for her.</p><p>Walking a short distance from where she moved that sweet little body with such focused determination, he brought out his phone and coded in a call to his alpha, Lucas. “Were you able to track the source of the hang-ups to Amber’s cell phone?”</p><p>Ria had told him about the calls this morning.</p><p>“Disposable.” Lucas’s anger was clear. “But we got another one of the bastards. He made the bad decision to try to shake down a couple while Clay was running patrol.”</p><p>Emmett’s leopard smiled, its teeth razor sharp. “Is he dead?” Clay didn’t see the point in keeping vermin alive.</p><p>“Clay thought we might want to question him, so he only broke a few ribs. Man’s refusing to talk, but I’ve had Clay prowling around him in leopard form</p><p>—he’ll break when those teeth get too close.”</p><p>“What’s your gut say—small fry or big gun?”</p><p>“Very small fry. He’s not likely to know anything important.” A sigh of frustration. “Keep on the girl. They’ll do anything to get to her, because the longer she remains alive, the more traction Vincent loses.”</p><p>Emmett traced Ria’s form with his gaze as she went through her routine. The curve of her butt was the perfect shape to fit into his hands. “I’m not letting her out of my sight.”</p><p>FOUR</p><p>Having done two reps of the routine Emmett had shown her, Ria turned to see him walking back to her.</p><p>The savage edge in his eyes raised every hair on her body.</p><p>The man looked hungry. No one had ever looked at Ria like that. It was almost terrifying. But she stood in place, waiting, wondering.</p><p>“Ready for the next step?” His voice was deep, holding the beginnings of what sounded like a growl . . . a leopard barely contained.</p><p>She swallowed. “Sure.”</p><p>He padded to a spot opposite her, still dressed in the jeans and T-shirt he’d been wearing earlier. It was obvious why he hadn’t bothered to change—he hadn’t so much as broken a sweat with what they’d done so far, while her muscles were starting to protest. Now, he crooked a finger. “Come on, mink, use what I just taught you.”</p><p>She was so startled by what he’d called her that she completely lost her focus. He was in her face an instant later. “What the hell was that?” he growled.</p><p>“If you blank out in a fight, you’re dead.”</p><p>“You called me a mink!” She refused to back off.</p><p>“Did I?” Moving at inhuman speed, he closed a hand around her throat before she knew what was happening. “Let’s make sure you’re not a dead mink.</p><p>”</p><p>Eyes narrowed, she reached up and tried to break his nose using the flat of her hand. He caught it using his free hand. Her knee was already aiming for his crotch, and when he blocked that, she leaned forward and sunk her teeth hard into his forearm.</p><p>“Fuck!” The hand around her neck remained in place, but he released her other hand. She immediately went for his eyes and his crotch again. Her knee brushed against something very hard, before he twisted away and swore. She kept going, kicking, trying to scratch, even attempting to break the pinkie of the hand he had around her throat.</p><p>He finally let go. “Truce.”</p><p>Her heart was in her throat, exhilaration in her bloodstream. She knew he’d been playing with her—with his strength and training, he could’ve had her on the ground in one second flat. “How did I do?”</p><p>He glanced at his forearm. “I didn’t teach you the biting.” It was a snarl.</p><p>Or maybe he hadn’t been playing the whole time. “I decided to add it on my own,” she said, though in truth, it had been an instinctive response to his arrogant provocation. Her eyes went to the marks she’d made. Deep and red and perfectly formed. Guilt invaded. “I didn’t mean to bite you that hard. But .</p><p>. . I’m not sorry.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh?” He walked over, slow, so slow. This time, she backed up. It was one thing to play with a predator who was keeping his claws sheathed, quite</p><p>another to know you were prey. He kept coming. She knew the door out of the basement was only about a foot away. Making a quick move, she went to dart left.</p><p>Too late.</p> <p>He was there before her and somehow, she found herself pasted up against the closed door, very aware she was all alone with a big, dangerous</p><p>leopard in human skin. Except instead of fear, it was a vivid excitement that beat in her blood as he placed his hands palms-down on either side of her</p><p>head and bent until their breaths mingled. “Boo.”</p><p>She jumped, then wanted to slap herself for it. “Stop acting like the big bad cat.”</p><p>A blink, and when he raised his lashes, the eyes that looked back at her were in no way human. “Mmm, I smell a pretty little human in my territory.” A soft whisper against her lips, bright green-gold eyes daring her to respond.</p> <p>Her breasts brushed his chest as he pressed closer, her breath coming in jagged pants.</p><p>“You’re behaving very badly.” It was a husky reproach.</p><p>“You bit me.” He angled his head a little to the left, and though she couldn’t see those amazing eyes except for a glint through his lashes, she knew he was looking at her lips. “Say sorry.”</p><p>She didn’t know what made her do it. Parting her lips, she said, “No.”</p><p>His mouth was on hers before the syllable ended. She found herself being kissed as she’d never been kissed in her life. He took over her mouth,</p><p>slicked his tongue in, and tasted her like she was the finest candy and he was starving.</p> <p>Against her, his body was a hot, hard, impregnable wall. Her hands were somehow under his T-shirt and on his back, touching skin that burned with a wild fever that made her moan in the back of her throat.</p><p>A sound akin to a growl rolled up from his chest and into her mouth. Before she could process it, his hands were at her waist and he was lifting her up against the door. Wrapping her legs around him, she gave herself up to the possessive demand of his kiss. It fed fire through her body, a hot, pulsing storm. Then one of those big hands stroked down her back to squeeze her bottom.</p><p>She gasped, breaking the kiss.</p><p>He followed, taking her mouth again before she could do more than suck in a breath. Oh, Lord. He was stroking her butt, cupping and petting even as he devoured her mouth. It was wild, raw, primal. The heat in her stomach was matched only by the dampness between her thighs. Part of her was</p><p>scandalized at her response, but that part was drowned out by the wild thunder of her pulse as pleasure sizzled through her veins, pure liquid flame.</p><p>Emmett broke the kiss just as her head was starting to spin. An instant later, she felt those delicious male lips along her jaw, down her throat. And that hand on her bottom . . . she swallowed, tried to think, lost the thread when Emmett shifted his hold so that his fingers brushed the heat between her legs.</p><p>She cried out. “Stop.”</p><p>A fluttering stroke that arced electricity right through her. “Please tell me you don’t mean that.” His stubble brushed her throat as he leaned in to nibble at her ear. “Come on, mink. Just a little more.”</p> <p>God, the man was a devil. And he smelled so good. A faint hint of sweat, the luscious warmth of male body heat, and the unique scent that was Emmett.</p><p>She found she was kissing his jaw, fascinated by the contrast between the stubble and his skin. “Random sex isn’t my style.”</p><p>“Who said anything about random?” Another teasing brush, another rush of exquisite pleasure. “I plan to have sex with you on a regular basis.”</p><p>The arrogance of the comment should have snapped her out of it. Instead, her mind bombarded her with images of naked limbs intertwined, a heavy male thigh pushing between her own. He’d be no gentle, easy lover. He’d demand and he’d take. He might even bite. “That’s assuming an awful lot,” she somehow found the willpower to say.</p><p>A press of his fingers this time, not a brush. She sucked in a breath, her eyes closing as she waited for it to pass. But he didn’t stop. Instead, he lifted her until she was positioned just right . . . and began to rub himself against her in slow, grinding circles. She almost screamed. And then his fingers were on her again and she did scream.</p><p>Emmett caught Ria’s scream with his mouth as he continued to tease her with his body—</p><p>torturing himself in the process. But the scent of her damp heat, it was pure ambrosia. He wanted to sit her down—no, lay her down—on a sprawling playground of a bed, spread her thighs wide and taste. His cock pulsed, the leopard’s hunger threatening to overwhelm the man’s control.</p><p>Fighting the urge to tear off her sweats, he concentrated on driving her over the edge of pleasure. He hadn’t needed her to tell him—he’d known</p><p>instinctively that Ria wasn’t a woman who took sex casually. He’d have to coax her into his bed. Taking her against the scarred door of a basement gym was hardly going to reassure her that her pleasure mattered to him. Mattered enough that when her body tightened, he grit his teeth and stroked her through the orgasm.</p><p>Her fingernails dug into his shoulders through his T-shirt—he wished like hell he’d taken the damn thing off. He wanted those marks on his skin, wanted to know she’d put them there. Next time, he promised the cat. Next time. “Beautiful,” he murmured, nuzzling at her neck as she shuddered against him, her body going limp. “Pretty and soft and beautiful.” And mine. The leopard bared its teeth at the thought, even as the man bit back a rawly possessive</p><p>smile.</p><p>Finally shifting his hold from the gorgeous curve of her butt, he ran his hands up her sides as he kissed and petted her through the aftershocks of</p><p>pleasure. Her eyes were still a little unfocused when she said, “Put me down.” It was an order.</p><p>The leopard snarled, but he did as asked. She pressed her hands flat against the door and looked up at him. “You’re . . .” Color streaked across her cheekbones.</p><p>He gave her a smile that he knew held a distinctly savage edge. “I’m thinking I want lots and lots of time when I slide into you.”</p><p>“Are all cats as arrogant as you?”</p><p>He shrugged and leaned in close. “I’m the only cat you need to be thinking about.”</p><p>Ria couldn’t not think about Emmett. That night, as she sat across from her parents at the dinner table, she kept finding herself drifting off in the middle of conversations. Emmett’s herself drifting off in the middle of conversations. Emmett’s scent seemed to have become locked in her brain. She was</p><p>fantasizing about burying her face in his neck, his strong body hard and taut against hers when Alex’s voice penetrated.</p><p>“Ria!”</p><p>Jumping, Ria met her mother’s eyes, hoping the guilt didn’t show. “Sorry, what did you say?”</p><p>“Tom’s popping by for coffee tonight. Why don’t you change into a dress?”</p><p>Ria’s fingers turned to iron around her chopsticks. Enough, she thought. And strangely, it had nothing to do with Emmett. Perhaps he’d pushed her to this point faster, but she’d always been walking toward it. “Mom,” she said, putting down the abused chopsticks, “I have no interest whatsoever in Tom.”</p><p>Utter silence.</p><p>Simon was the one to break it. “What’s gotten into you, Ria? You and Tom grew up together—he knows you. He’ll make a good husband.” The tone of his voice said the matter was settled.</p><p>Ria looked into her father’s face. “I love you, Dad, but not even for you will I marry a man who thinks I should be patted on the head once in a while and put in the corner like a good little girl the rest of the time.”</p><p>White lines bracketed Simon’s mouth. “That boy’s only ever treated you with respect.”</p><p>“He treats me like a dimwit,” Ria said, skin blazing with temper. “Last week, he told me I wouldn’t have to worry about finances when we were married, that he knows math confuses females.”</p><p>Alex made a choked little sound that succeeded in ripping Ria’s attention from her father’s disapproving face. Alex’s expression was a mix of outrage and disbelief. “He did not say that. You’re making it up.”</p><p>“Popo?” Ria turned to her right.</p><p>Miaoling ate a fried shrimp and nodded. “He said it. Then he smiled as if expecting praise.”</p><p>Alex’s hands clenched on the tablecloth. “And who does he think does the books for the shop, huh?”</p><p>“Alex.” Simon closed his hand over his wife’s. “We’re getting off topic.”</p><p>Taking a deep breath, Alex nodded. “You’re right. Sweetheart, Tom is a very good match for you. You never had a problem with him before you met that disreputable leopard.”</p><p>Ria supposed Emmett was disreputable—that stubble, those hands that had squeezed and petted, those eyes that told her he wanted to do all kinds of wicked things to her. But . . . “He’s an honorable man.” That core of honor was so much a part of him, she wondered if he was even aware of it. It was why it had been so easy for her to lose control in the gym today—she’d trusted Emmett to take care of her. And that, she thought, was a dangerous thing . . .</p><p>the kind that could lead to a broken heart if she wasn’t careful. “He’s protecting our family.”</p><p>“Exactly,” Jet said, jumping into the conversation. “Maybe he’s making time with you while he does this duty, but he won’t marry you, Ria. Those cats</p><p>stick together.”</p><p>Ria’s stomach twisted, because she knew her brother was right. “This isn’t about Emmett. It’s about me. I will, under no circumstances, marry Tom.”</p><p>“Why not?” Alex asked, eyes flashing. “He’s intelligent, handsome, has a good job, and brings you flowers.”</p><p>Frustrated, Ria threw down her napkin and rose to her feet. “If he’s that great, you marry him. I will not marry a man who hasn’t even attempted to French-kiss me the entire year we’ve been ‘dating.’ ” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her parents yelled her name, but Jet’s incredulous voice drowned them out. “Seriously? Not even a little tongue? You’re right—dude is lame.”</p><p>“JET!” It was Alex. She flew into a rapid stream of Mandarin.</p><p>Miaoling looked up at Ria and winked. “Sit. Eat.”</p> <p>And oddly enough, Ria did. The family fought through the entire meal, but now her parents were mad at Jet because he figured Tom had to be gay.</p><p>Alex glared at her son. “Maybe he’s just being respectful of your sister.”</p><p>“No effing way.” A skeptical snort. “Men aren’t that noble when it comes to women they want.” Jet turned to his wife, his voice dropping. “When I saw Amber, all I wanted to do was—”</p><p>“You finish that sentence,” Alex threatened, “and you’ll be breathing fire I’ll put so much chili in your food.”</p><p>Amber grinned and blew Jet a kiss. “You know, it sounds to me like Tom’s planning to marry Ria and get himself a nice, respectable wife, while having a bit on the side.”</p> <p>Simon’s mouth fell open at this scandalous contribution from his flawlessly elegant daughter-in-law.</p><p>Miaoling ate another shrimp. “She’s right. Like father, like son.”</p><p>Silence. Deeper. More shocked.</p><p>FIVE</p><p>Simon cleared his throat. “Mother,” he said, his tone that of a man who knows he’s done for,</p><p>“is that true?”</p> <p>“You think I’m lying?”</p><p>“I think you’d do anything for your favorite granddaughter.”</p><p>Leaning back, Miaoling actually cackled. “This time, I don’t have to. Wait.” She got up and headed toward her room.</p><p>Ria shrugged when all eyes turned to her. “Don’t look at me.”</p><p>“Eat some tofu,” Alex said when they just sat there. “It’ll go bad if we don’t finish it tonight.”</p><p>Everyone ate. But the instant Miaoling walked back into the room, all implements were abandoned, food forgotten. Wearing the same smile she always displayed when she came out of Mr. Wong’s, Miaoling sat down and opened an envelope.</p><p>Ria’s eyes went wide when she saw the photograph in her</p><p>grandmother’s hand—Tom’s father with his tongue down the throat of the woman everyone knew as his secretary. “Oh, my, God.”</p> <p>“Don’t show me,” Alex said, slapping her hands over her eyes. “I can’t bear it. Essie’s one of my best friends!”</p><p>Miaoling waved off the objection. “She knows. Doesn’t care—it keeps Tom Sr. from interrupting her hobbies. She’s making lanterns this year.”</p><p>“Popo,” Ria said, choking, “how did you—”</p><p>“What do you think Mr. Wong and I talk about?” She turned her gaze to Ria’s parents. “Want to know about the apartment Tom bought his mistress?”</p><p>Alex looked like she was about to keel over. “Mistress?” It was a thin sound.</p><p>A sense of fair play induced Ria to attempt to defend Tom. After all, she was now involved with Emmett. “Grandmother, no one has mistresses anymore.</p><p>Tom was probably just waiting for the right time to tell me he’d fallen for someone else.” Yes, he should’ve been man enough to stop the charade of their non-engagement soon as he met his girlfriend, but Ria wasn’t going to beat him up about that. Chances were, he’d needed time to work up the strength to stand firm against familial pressure.</p><p>“I talked to her.”</p><p>Jet whooped at Miaoling’s words, while Amber shushed him and said, “How, Nana?”</p><p>“I’m a weak old lady, always need so much help.” Miaoling’s eyes gleamed. “Nice girl, too nice for Tom. She’s so sad for him because he has to marry some plain, fat girl—”</p><p>“That snake!” Alex’s hand clenched on a sharp knife as Ria’s sympathy for Tom died a quick and permanent death.</p><p>“—but nothing’s going to change between them after the wedding. Tom’s set it all up so he can visit her on his way home every night. He’s even</p><p>promised to take her to Paris after he explains how things are to his wife.”</p><p>Simon looked at Ria, a tic in his jaw. “If you even think about marrying Tom, I’ll hogtie you and send you to live with my parents in Idaho.”</p><p>“Yes, Dad.” Grinning, Ria walked around to hug her parents. But she waited until she was alone with her grandmother to ask, “Was that in case I didn’t get up the guts to pull myself out?”</p><p>“No, it was just backup.” Miaoling’s wrinkled hand was a touch of love against her cheek. “I always knew you’d find your voice. Don’t ever let anyone</p><p>take it away from you.”</p><p>Pleased and frustrated in equal measures by his earlier encounter with Ria, Emmett forced himself to focus as he ran his early-evening class through some hand-to-hand combat moves. There were only four in this group—he preferred to spend more one-on-one time with the older, higher-level students.</p><p>“Jazz,” he said, when the sole girl in the group smiled slowly at one of the boys before blowing him a flirtatious kiss—the poor kid lost his rhythm completely.</p><p>Emmett’s cat found her little tricks amusing, but he put on a stern face, knowing if he didn’t, she’d keep on doing exactly as she wanted. Female</p><p>leopards were a handful—throw teenage hormones into the mix, and no wonder half the pack had sent him sympathy cards when Lucas put him in charge of this lot. The other half had offered to take him drinking.</p><p>“Yes, sir?” An innocent look.</p><p>“Unless you plan to beat your opponents with nothing but a smile and a hip wiggle,” he said,</p><p>“I suggest you work on your hand to eye coordination. It’s off.”</p><p>“It is not.” Her back went ramrod straight. “I can move smoother than anyone else in this class.”</p><p>He met her militant gaze. “Ten laps. Now.”</p><p>Swallowing at his unusually harsh tone, the ebony-skinned girl took off to do the required laps. Emmett turned back to the three boys who remained.</p><p>“Gentlemen, you have something to say?”</p><p>One of them, a slender kid named Aaron, stepped forward. “She’s right—she is better than all of us at the hand to eye stuff.”</p><p>“Not today—she’s too busy playing head games.” Sending them back to their training, he waited for Jazz to return.</p><p>“Grab a drink and a seat,” he said when she did, red-faced from having done the laps at full changeling speed as required. After making sure the boys</p><p>had enough to carry on with, he walked over to hunker down in front of her. “Why do you think I made you do that?”</p><p>A shrug. “I was mouthing off.”</p><p>“Yeah.” And because he knew something of young female pride, he reached out to tug on one of her braids. “You are top of the class.”</p><p>A small smile peeked out.</p><p>“But, kitten,” he said, meeting her gaze, “that won’t get you far if you can’t hold your temper.</p><p>You can still be Jazz, still be a smart-ass, too, if you want”</p><p>—that got him another small smile—“but you need to learn to work within a hierarchy.”</p><p>Because that was how changeling packs stayed strong, though they were often far fewer in number than either of the two other races. And if his mother was correct in her predictions, that internal strength would become even more important in the years to come. These kids were all highly independent predatory changelings—his job was to start teaching them to work as a unit.</p><p>“I think I understand,” Jazz said after a thoughtful pause. “It’s how the sentinels and soldiers work to protect the alpha—they know they can always rely on each other.”</p><p>“Exactly.” Rising, he tugged her to her feet, “Go on, finish your training routine, and then we’ll do some one-on-one combat.”</p><p>A sharp grin. “I’m going to kick the boys’ butts tonight.”</p><p>Chuckling as he watched her slide easily into the graceful rhythm of combat, he wondered what Ria would think of the measures DarkRiver was taking to protect its future. Would she understand, or would she be repelled by the threat of violence, by the aggressiveness that was an inherent part of a predatory changeling’s nature? Not that he had any intention of discussing those things with her—not as long as he could avoid it. She’d clearly been</p><p>brought up in a sheltered environment—why ask her to worry about things she didn’t have to? Protection was his job. His plans for Ria Wembley were all about pleasure . . . of the most decadent, delicious kind.</p><p>His entire body thrummed in anticipation.</p><p>Ria stayed home for two days after the explosive events in the gym, seeing Emmett only to say hi.</p><p>He scowled at her when she looked out the window on the second day. She had a good feeling she knew what he was thinking—that she was running scared after coming apart in his arms—but tempting as it was to head out and put him straight, she stayed in.</p><p>Of course, that temptation wasn’t the sole one where Emmett was concerned—her body wasn’t letting her get much sleep. Now that it had had a taste of real pleasure, it wanted more. The sleepless nights left her frustrated in more ways than one, and she intended to punish the damn cat for it.</p><p>But first, she had to do something.</p><p>On the third day after he’d crushed her up against the basement door and kissed her senseless, she walked out dressed in a deep peach skirt suit teamed with a white silk shell. Emmett looked her up and down, then did it again . . . slow.</p><p>Her cheeks felt like they matched her suit by the time he finished.</p><p>“I like it.” A slow, feline purr.</p><p>She thrust a list at him. “Interview locations.”</p><p>He raised an eyebrow as he scanned the list, but all he said was, “Hold on. I’ll get cover for your home then we can go.”</p><p>“Still no luck with tracking Vincent down?”</p><p>Sliding the phone into his pocket after rearranging his people, he shook his head. “Creep’s laying low. He thinks we’ll give up.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That, she knew, was simply not a possibility. “You haven’t been sitting still.” He’d only swung by her house in the mornings and at night. The other times, they’d had a rotation of both male and female DarkRiver soldiers.</p><p>“We have a bead on his base of operations.” A smile that was openly feral. “We’ll get him.”</p><p>She nodded, but had the distinct feeling he wasn’t telling her everything. And why should he, part of her pointed out. She was just someone he was protecting. Maybe he lusted after her, too, but Jet was right, the cats stuck together. She didn’t know any DarkRiver people who’d entered into long-term relationships with humans—sexual, business, or otherwise. “Emmett,” she began, intending to ask that question, then realizing he might see it as</p> <p>expectation.</p><p>“Yeah?”</p><p>“Nothing.” She shook her head. “I think the first appointment is about a ten-minute walk away.”</p><p>For a second, it looked like Emmett was going to pursue her aborted statement, but to her relief, he followed her lead and they headed off—with Ria sandwiched between the safety of the shop walls and Emmett’s big frame. His constant alertness made her feel safe on the innermost level.</p><p>“What kinds of jobs are you applying for?” he asked a block from the first location on her list.</p> <p>“Administrative,” she said, then made a face. “I’d really love to run my own office—you know, be in charge of all the organizing for the boss, but that’s going to be far in the future. First, I need experience—so I’ll end up someone’s lackey.”</p><p>Emmett laughed at her tone. “I don’t think you’ll be a lackey for long.”</p><p>“No, I won’t,” she said, and took several deep breaths. “Right, here it is. Wish me luck.”</p><p>“I’ll wish you luck inside.” He pulled open the outer door.</p><p>“Emmett, I can’t go into an interview with a bodyguard.”</p><p>His eyes turned flint-hard. “Vincent knew when you’d be coming home from your course.</p> <p>Chances are high that he’s worked out you’d now be applying for jobs.”</p><p>She grit her teeth. “This is an established firm. I hardly think I’m going to be in danger from the sixty-year-old manager.”</p><p>“You’re not going behind a closed door with anyone.”</p><p>Ria argued until she was close to the screaming point but he wouldn’t budge. Predictably, her interviews didn’t go well. The first manager was so</p><p>affronted at the idea of being considered a threat that he booted her out without an interview.</p><p>The next two were female and couldn’t stop staring at</p><p>Emmett long enough to listen to Ria. When one finally did throw her a crumb of attention, it was to give her a condescending smile and say that maybe</p><p>she wasn’t cut out for office work.</p> <p>A babysitter didn’t exactly inspire confidence.</p><p>Ria was close to tears by the fourth interview, but not from anxiety. From sheer rage. “Thank you for destroying my chances of employment,” she said as they got off the skytrain near Chinatown, having circled the city for her appointments.</p><p>“Ria,” he began.</p><p>She slapped up a hand, palm out. “I am cut out for office work. I do my mother’s books. Not only that, I do the entire family’s books. I make sure my father goes to his appointments and Amber sees the obstetrician on time, that Grandmother takes her medications and Jet doesn’t forget to write New Year cards to our aunts in Albuquerque. I am damn well cut out for office work!”</p><p>“I never said you weren’t.”</p><p>The soothing tone in his voice made Ria want to bite him. “No, you simply stood there like I couldn’t be counted on to take care of myself if someone</p><p>tried to hurt me. That day, at the gym, it was all bullshit!”</p><p>His scowl was thunderous. “Take that back.”</p><p>“I’m not talking about that, you idiot. I’m talking about the self-defense stuff. It was just to pacify me. You don’t even trust me to scream.” That had been the first lesson he’d taught her—scream as loud as you can and run. “You know what, I think that makes the other stuff bullshit, too.”</p><p>“Hold on a fucking minute.”__</p><p>SIX</p><p>I gnoring him, she walked through the automatic doors of the medium-sized office building that was the location of her next appointment and strode up to the counter. “Hi,” she said to the well-groomed woman on the other side, her skin a lush, flawless mahogany. “I have an appointment with Lucas Hunter.”</p><p>The woman’s eyes flicked behind Ria’s shoulder, and something like surprise passed through them, but her voice, when she turned to Ria, was wholly professional. “Name?”</p><p>“Ria Wembley.”</p><p>A warm smile. “You’re fifteen minutes early, Ms. Wembley. If you’ll wait here, I’ll let you know when Lucas has finished with the current applicant.”</p><p>“Thanks.” She was walking toward the seating area when she belatedly realized she didn’t know the name of this company. The ad had simply said that a small but growing construction firm was seeking administrative staff. Since that ad had been vetted by the college where she’d taken her course, she hadn’t worried too much about the lack. But her ignorance probably wouldn’t look too good . .</p><p>. if this Hunter person even bothered to see her after</p><p>learning about Emmett.</p><p>Turning on her heel, she skirted around Emmett to speak to the receptionist again. “I’m sorry.</p><p>I noticed that your doors don’t have the company name on</p><p>them.”</p><p>The woman’s gaze flicked to Emmett again. Ria fumed. But the beautiful brunette didn’t seem to be checking him out. “Actually,” she said after a small pause, “the name’s still in discussions . . . er, the partners haven’t decided on the order.”</p><p>“Oh.” That was odd, but not odd enough to make her run. Beggars, as they said, couldn’t be choosers. Nodding, she walked to the comfortable</p><p>arrangement of armchairs to the left of the reception counter, choosing a seat bathed in sunshine.</p><p>Emmett sprawled beside her. “What we shared was not bullshit. And I didn’t know you even knew how to swear.”</p><p>The joke just irritated her. “If you can lie about one thing, why not another?”</p><p>“Now, hold on. I never lied to you.”</p><p>“Oh yeah? What do you call teaching me self-defense, then treating me like a brainless ninny?”</p><p>“Excuse me.”</p><p>Ria jerked up at the sound of the receptionist’s voice.</p><p>“Lucas is free now,” she was told. “The interviews are taking place one floor up.”</p><p>As she got up and headed across the lobby to the elevators, someone called out a hello.</p><p>Since she didn’t know the male heading out the front door, she assumed it had been aimed at Emmett. “Friend?” She stabbed the touchpad beside the elevator.</p><p>He wouldn’t meet her eyes. “Yeah.”</p><p>The elevator doors opened to reveal an empty cage and she could’ve sworn she heard Emmett sigh in relief. “Fear of crowded elevators?”</p><p>“Something like that.”</p><p>They were on the next floor what felt like an instant later. The meeting room was obvious by its open door. The man who came to that door was beyond</p><p>handsome—bright green eyes, dark hair that brushed his shoulders and savage clawlike markings on the right side of his face. He was young . . . yet not.</p><p>Experience flickered in that striking green gaze, and Ria knew he’d sized her up in a single fleeting instant.</p><p>“Ria”—he held out a hand—“I’m Lucas. Come on in.”</p><p>She shook and went to explain Emmett . . . except that her self-appointed bodyguard had already grabbed a seat in the plush armchair outside the</p><p>meeting room. Her mouth hung open for a second before she snapped it shut. What in the . .</p><p>. ? This Lucas, with his aura of contained power, was</p><p>undoubtedly far more dangerous than anyone else she’d met today and Emmett was okay with her being alone with him?</p><p>Deciding not to look a gift horse in the mouth, she walked in, aware of Lucas closing the door behind her as she took a seat on one side of a small</p><p>table. There was something about his walk when he came to take his own seat . . . he reminded her of someone.</p><p>“Water?” At her nod, he poured her a glass and pushed it across. “I’ve read your resume.</p><p>You’ve just completed studies in advanced office</p><p>administration?”</p><p>She took a sip before answering. “Yes, at the top of my class. I’ve also had some on-the-job experience through the course.”</p><p>Lucas nodded. “I have no doubt your technical skills are excellent. We checked with the college and with the people you put down as references.”</p><p>The efficiency of it surprised and pleased her. “Your ad said you were seeking a number of staff,” she said, finding herself relaxing in spite of her vivid awareness of his power. The woman who took on Lucas Hunter, she thought, would have her work cut out for her. “Could you give me more information about the positions—I could perhaps tell you which I might be best suited for.”</p><p>“Actually, you’re on the short list for a particular position already. That’s what I want to discuss—it’s in no way a normal administrative job.”</p><p>Ria was intrigued. “No?”</p><p>“No.” A smile that turned him from gorgeous to beautiful in a very masculine way. She appreciated the sight, but without wanting to jump his bones. Not like with Emmett. And that thought had no business interrupting her interview. Corralling her runaway hormones, she turned her attention firmly back to Lucas.</p><p>“How are you with chaos?” he asked.</p><p>“I love it.” Her response was instinctive. “It gives me more to organize.”</p><p>Lucas laughed. “What about constant interruptions, having to rejig meetings on a moment’s notice, and a boss who might be impossible to track down </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>at times?”</p><p>“If it needs to be done, it’ll get done,” she said, meeting those brilliant green eyes. “But I’ll be honest—even though I probably shouldn’t be. I’m likely to get a little short-tempered now and then.”</p><p>“A temper might come in handy in this position.” His lips tilted up at the corners. “This is a . . .</p> <p>family business. And that family will be in and out. Can you handle being the focus of their curiosity?”</p><p>It was a strange question, but her answer was easy. “Let’s see—every Sunday without fail, my aunt Eadie calls to interrogate me about my life and offer</p><p>‘essential fashion advice.’ My paternal grandparents live in Idaho, but last week, they sent me a dossier on all the nice boys in town—just in case. Oh, and my normally very forward-thinking parents recently tried to arrange my marriage. I know how to handle family.”</p><p>His eyes danced. “And the arranged marriage?”</p><p>Since she’d brought it up, she couldn’t exactly avoid the personal question. “Not happening.”</p> <p>“That’s what I thought.” He rose to his feet, an amused curve to his mouth. “I think that’s all I need from you, Ria.”</p><p>Standing, she picked up her purse. “It’s you, isn’t it? The person I’d be working for if I get the job?”</p><p>A slight nod.</p><p>“Usually HR interviews applicants.”</p><p>“I’m picky.” He pulled open the door. “I need to trust the person I hire.”</p><p>Smiling even as her stomach dropped, she stepped out. Emmett was up and waiting for her.</p> <p>They entered the elevator in silence and walked out into</p><p>the street.</p><p>“How’d it go?” Emmett asked.</p><p>“Good.”</p><p>He rubbed the back of his neck. “Still mad?”</p><p>“You think I should give you credit for letting me go in there alone?” She raised an eyebrow, wondering what he’d do.</p><p>“Er.” His cheeks flushed. “Never mind.”</p><p>She felt her lips twitch. “I know he was a cat, Emmett. The way you leopards walk, it’s a dead giveaway.” They prowled, all soft and silent and lethal.</p> <p>“Shit.” He grinned. “I was hoping to score brownie points.”</p><p>“So it’s DarkRiver Construction?”</p><p>“Part of it. The building will also function as the pack’s city headquarters—we outgrew the old premises.”</p><p>All of which, Ria knew, meant she’d never get the job. Changeling packs looked after their own, sticking together like glue. Sure they’d helped clean up the city, making it safer for everyone, but as Emmett had explained, that had more to do with holding territory than anything else.</p><p>Tired, dispirited, and hungry, she walked into a neighborhood restaurant run by a family she’d seen at community functions, and grabbed a seat.</p><p>Emmett took the chair opposite hers.</p><p>“You order,” he said, scanning the room.</p><p>She was telling the waitress—who also happened to be the owner’s daughter—that she wanted cashew chicken, when Emmett moved across the table to smash her and the waitress both to the ground. A split second later, she heard a loud pop followed by a scream. Emmett was already up and</p><p>speaking on his cell. “He’s heading out, past the candy shop—” He ran toward the door.</p><p>Getting up, Ria helped the shaken waitress to her feet. Emmett was back before she’d finished. “You hurt?” His hands swept over her body.</p><p>Aware of several interested glances, she slapped them off. “I’m fine.” She turned to check on the waitress and got the same answer in response. “What</p><p>happened?” she asked Emmett.</p><p>He pointed behind her. A large hole marred the previously pristine wall. “Bullet.” His jaw was a brutal line, his eyes . . . his eyes.</p><p>Stepping instinctively closer, she put her hand on his chest. “Emmett.”</p><p>He glanced down, those incredible green-gold eyes, leopard eyes, looking out at her from a human face. His hand cupped her cheek. “You have a</p><p>scratch here.” A thumb stroking gently over a hurt she didn’t even feel, his gaze predator-cold.</p><p>She didn’t know how she knew what to do. She just did. Instead of fighting off his hold as she had earlier, she leaned into him, slipping her arms around his waist. His own came around her at almost the same instant, and he squeezed her close, until she could barely breathe. But she held on, held tight.</p><p>She didn’t know how long they stood wrapped around each other, but when he did finally release her, the fear in the restaurant had turned to</p><p>speculation. Likely, her grandmother and mother would be hearing all about it in the time it took to type a text message. She didn’t care. Because the leopard was gone from Emmett’s eyes, his rage under control.</p><p>He tapped her cheek. “Grab your purse. This place needs to be looked at by our techs, and I want you safe at home.”</p><p>Realizing he wanted to start tracking the shooter as soon as possible, Ria didn’t argue.</p><p>Emmett’s eyes were hyperalert as they began to head out of the restaurant, his big body vibrating with protectiveness.</p><p>“Please!”</p><p>Startled, she looked over her shoulder. It was the waitress Emmett had taken down—the woman ran over, a bag of take-out containers in hand. Her smile was a little wary as it flicked to Emmett, but her gratitude clear. “Thank you.” She shook her head when Emmett, the majority of his attention clearly on ensuring no more nasty surprises, went to grab his wallet. “It’s a gift. My father was in the army. He says that bullet would’ve hit me first.” She pressed the bag into Ria’s hands. “Please take this.”</p><p>Ria accepted it, understanding the family’s need to give something back to the man who’d saved their child’s life. “Thank you.”</p><p>The woman smiled and looked up at Emmett. “You’re welcome at our table at any time.”</p><p>Emmett gave a short nod. Ria wondered if he understood the value of the invitation. She could’ve let it go, but that wasn’t who she was—she asked him about it as they walked home at a rapid clip.</p><p>“I know,” he said, his voice tense as he scanned the area. “We’ve been working on building relationships with the folks around here, but it’s been a slow process. You’re very insular.”</p><p>“Talk about the big, fat charcoaled pot calling the kettle black.”</p><p>An unworried shrug, no smile. “Didn’t say we didn’t understand.”</p><p>“People like DarkRiver cats,” she said, wondering why that damn arrogance was sexy on him. “You’ve cleaned things up so the shopkeepers feel safe.”</p><p>“We’re starting to get friendlier smiles,” he told her, “but that’s all going to be fucked to hell if Vincent and his gang of thugs start shooting holes in</p><p>defenseless people.”</p><p>“I have a feeling they don’t know what they’re up against.”</p><p>A hard glance. “You got that right, mink.”</p><p>She opened her mouth to respond but they’d arrived at her family home and Amber was waiting in the doorway, cell phone in hand. “She’s home!” her sister-in-law said into the slim white device as soon as she spotted Ria. “No, she’s safe.</p><p>Emmett’s with her.”</p><p>All but lifting Ria inside, Emmett ordered Amber to shut the door. “And stay inside.” He was gone before Ria could say anything else.</p><p>Blowing out a breath, she took the phone Amber was holding out. “Mom, I’m fine.” She repeated that for the next ten minutes, until Alex finally calmed down. By that time, her grandmother had prepared tea, brought out two giant hunks of Mr.</p><p>Wong’s famous Divine Madeira Cake, and begun to make her</p><p>special sweet black-sesame soup, one of Ria’s favorites.</p><p>“Sit!” she said when Amber began to stand up as if to help.</p><p>Amber sat with a thankful groan. “The baby’s kicking so hard. Want to feel?”</p><p>“Yes!” Ria scooted over. Amber was a great sister-in-law, but she was also intensely private.</p><p>This kind of an invitation didn’t come often. Placing her hand on Amber’s abdomen, she stayed very still. Miaoling’s future great-grand(gender unknown) didn’t keep Ria waiting. She felt two very distinct thuds.</p><p>“Wow, I think I felt the shape of a foot.”</p><p>Amber laughed. “Probably. Baby Wembley has a future as a football player. Fitting really, given the family name.”</p><p>“Don’t tell Jet,” Ria teased, biting into her cake. The familiar taste was as welcome as a hug, soft and comforting. “He’s hoping for a golf buddy.”</p><p>“What about you, Ria?” Breaking off a piece of her own slice, Amber brought it to her mouth.</p><p>“You thinking of popping out any golf buddies sometime</p><p>soon?”</p><p>“Amber!” Ria fell back, laughing. “Where do you think I’m going to get the other half of the equation now that the Great Match is done for?”</p><p>“Oh, I don’t know.” Amber’s eyes turned sly. “But I know a cat who looks at you like he wants to eat you up, then come back for seconds.”</p><p>Ria was still gasping at the scandalous comment from her—usually—shy sister-in-law, when Miaoling began laughing. Slapping her thigh, she laughed</p><p>so hard that Ria could do nothing but join in. “You heard”—she sobbed between bursts that left her stomach aching—“what Jet said. They don’t get</p><p>serious with humans.”</p><p>“Who says?” Amber’s eyes were shiny with humor. “Just because we don’t know about any.”</p><p>That cut off Ria’s laughter. She sat back. Thought about it. Shook her head. “We’d have heard. I’d have heard at the college.”</p><p>“Not necessarily,” Amber argued. “They don’t exactly advertise things. I’d say I’d never met a more closemouthed lot, but . . .” She waved a hand. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ria blew out a breath. “I can’t ask him. You know that.”</p><p>“Why?” Miaoling asked.</p><p>“Because then he’d think I was hinting at something!”</p> <p>Her grandmother gave her a gimlet-eyed glance. “If you don’t hint, how’s he going to know?”</p><p>Ria’s mind flooded with the memories of her pressed up against that gym door, his hand stroking over her, his tongue in her mouth. “He knows.”</p><p>“Yes,” Amber said. “Changelings have a better sense of smell than humans. He can probably scent your you-know-what.”</p><p>Ria stared. “Amber, what’s come over you?”</p><p>Her sister-in-law picked up another piece of cake. “I’m going to blame it on the pregnancy.” A slow grin.</p> <p>SEVEN</p><p>Emmett’s blood was at fever point. Returning to the restaurant, he caught the scent of the shooter and began tracking. Dorian and Clay had both picked up the trail while he escorted Ria home, but this was his hunt.</p><p>His fingers remembered the soft feel of Ria’s skin, the delicate roughness of the scratch that shouldn’t have been on her face. The leopard paced</p><p>inside his skull, wanting out, wanting to do damage, but Emmett held on to his humanity. For now.</p><p>Minutes later, he found both Dorian and Clay standing frustrated at a busy intersection.</p><p>“Fuck,” Emmett said, sensing what they had. The shooter’s scent simply disappeared.</p> <p>“Probably someone waiting to pick him up,” Dorian muttered, looking around. “No CCTV</p><p>cameras in this area. We need to fix that.”</p><p>Emmett narrowed his eyes, making a slow circuit of all four points of the intersection. It was clogged with people. “Can’t have been a pickup. It’d be too hard to make a quick getaway,” he muttered almost to himself . . . and looked up.</p><p>The old-fashioned fire escape ladder hung a few feet off the ground, just far enough up to confuse the scent trail with this many people around. Landing on the ladder with a single powerful jump, he began to follow the fading trail with the fluid grace of the leopard he was. No human could ever hope to match a predatory changeling moving at full speed.</p><p>Making it to the top of the building in seconds, he pursued the scent to the other side.</p><p>Another ladder, this one looking down into a small parklike area thronged with elders playing what looked like a combination of mahjong and chess. Ignoring the ladder, he jumped straight to the ground, making several people scream. His cat ensured he landed on his feet, his body perfectly balanced.</p><p>Again, the scent was muddied by the number of people in the park. But worse, a few meters later it was overwhelmed totally by the strong disinfectant used to sanitize the nearby automated public toilets. Swearing under his breath, he did a circle of the park and came up with nothing. Frustration clawed at him. He was certain this was where the shooter had been picked up—on one of these narrow streets.</p><p>Thrusting a hand through his hair, he was striding back the way he’d come when an old man waved him over. “Here—he left his motorcycle parked on</p> <p>the footpath. Very rude.” A piece of paper was put into his hand.</p><p>Opening it, he found a license plate number. Hot damn. “Thanks.” His cell phone was in his hand an instant later. The elderly man waved away his</p><p>thanks and went back to his game even as Emmett fed the tip through to the DarkRiver techs. Changelings had made it their business to be up-to-date on all technology known to man—because if the coldly powerful Psy had a weakness, it was that they relied too much on their machines.</p><p>But that technical knowledge also came in handy when DarkRiver needed to hack into Enforcement databases. Emmett had an address to go with the license plate five minutes later. Assembling a team took only a further three minutes—Lucas, Vaughn, and Clay, with Dorian holding a surveillance</p><p>position. The young soldier was turning into one hell of a sharpshooter.</p><p>“How’re we doing this?” Lucas asked as they got out of their vehicle a short distance from the shooter’s home, his eyes cold.</p><p>“I want the bastard alive,” Emmett said through gritted teeth. “We need to get Vincent’s location.” He glanced at Lucas. “We’re skating way past the edge of the law here.” Changelings had jurisdiction over crimes that involved their kind, but this shooter was most likely human. “It’s daylight—we’ll be seen.”</p><p>His alpha shrugged. “Let me handle that.”</p><p>Trusting his word, Emmett gave the signal and they fanned out, coming in at the suspect’s dirty trailer from all sides. The bike sat near the back—and it was sticky with the scent Emmett had detected at the restaurant.</p><p>Even that close, no one shot out at them, and a couple of seconds later, Emmett’s leopard picked up a new scent. Blood. Fresh and thick.</p><p>“Goddammit,” he muttered under his breath, knowing what they’d find. He was right.</p><p>The shooter lay slumped over a rickety table, the back of his head blown off execution style.</p><p>“Vincent knew we’d picked up his scent,” Lucas said,</p><p>taking in the scene from the doorway beside Emmett. “I bet that blood is still warm.”</p><p>They both stepped back out, Emmett’s frustration making him want to kick something. “Think there might be intel in there that could lead us to Vincent?”</p><p>Lucas nodded at the neighbors in the surrounding trailers, a few of whom were openly staring. “We can’t risk going in and giving the cops a reason to hassle us. As it is, these folks saw us open the door, stand in the doorway. No harm, no foul.”</p><p>“I wouldn’t let it bother you,” Clay said, breaking his customary silence. “This guy, he was expendable. They’d have told him squat.”</p><p>Emmett tried to believe that as he circled the trailer.</p><p>A hint of movement in his peripheral vision, prey breaking into a run.</p><p>He didn’t even think about it, shifting into hard pursuit between one second and the next. The skinny guy in front of him didn’t look back as he snaked</p><p>through the trailer park. Not until he passed a group of children kicking around a dusty soccer ball. Emmett’s gut chilled as the man’s hand came up. “Get down!” he yelled, thrusting himself into an incredible burst of speed. Slamming into the shooter’s arm, he pushed it up just as the man fired. The shot was silent, the bullet lost in the sky.</p><p>The shooter was already moving, using his body with the fluid grace of an experienced street fighter. His fist hit Emmett’s cheek with enough force to jerk it back, but Emmett didn’t let go of the man’s wrist, holding the gun pointed up, even as he used his free elbow to hit the assassin’s jaw. The bastard didn’t go down.</p><p>Fuck it. Emmett squeezed the man’s wrist, crushing his fragile human bones.</p><p>With a scream, the shooter dropped to his knees, the gun falling out of his hand. “Keep an eye on it,” Emmett ordered Vaughn.</p><p>The jaguar nodded and made sure any kids who hadn’t already scattered got the hell out.</p><p>Emmett kept his hand around the shooter’s wrist as the</p><p>whimpering male knelt in the dust. This one, Emmett thought, would know something about Vincent. Dropping into a crouch, he met the man’s shiny-wet eyes. “Tell me what I want to know,” he said very quietly, “or I’ll crush your wrist so badly, they’ll never be able to put it back together.”</p><p>The man spat at him. “I’ll get a cloned replacement.”</p><p>Emmett heard the faint sound of Enforcement sirens and knew he had a couple of minutes at most. Leaning close, he deliberately let his eyes go cat, his claws shooting out. Then he smiled. “You know, they’re not very good at cloning eyes.”</p><p>He touched a claw to the very edge of the man’s right eye.</p><p>“Funny how a claw can accidentally blind a man during fighting.”</p><p>Fear burned off the shooter, acrid and thick. “You can’t do that. There’re witnesses.”</p><p>“Really?”</p><p>He watched as the man turned . . . to see only closed doors and shuttered windows.</p><p>“You threatened their kids,” Emmett whispered. “Who do you think’s going to come forward to save you?” He pressed in the claw until the edge actually touched the delicate surface.</p><p>The fear turned into sheer terror. “I’ll answer your questions!”</p><p>Emmett asked them hard and fast. By the time Enforcement arrived, the Crew male was so grateful to see them, he confessed to the shooting just to get away from Emmett. The cops looked like they wanted to take Emmett in, too, but all of a sudden, there were twenty witnesses who’d seen everything</p><p>—and who swore Emmett was a hero.</p><p>Faced with that many enthusiastic supporters, the cops gave up. One older female met Emmett’s eyes. “You didn’t have to crush his wrist.” It wasn’t censure, more a question.</p><p>Emmett raised an eyebrow.</p><p>She smiled and walked off. Right into Dorian.</p><p>The blond soldier grinned. “How about you let me buy you dinner?”</p><p>The cop laughed. “You’re adorable. But I gave up cradle robbing a few years back.”</p><p>Dorian was unabashed. Walking over to Emmett after the woman left, he folded his arms.</p><p>“Sooooo . . . what happens if I flirt with Ria?”</p><p>“I use your ribs to make a wind chime.”</p><p>“That’s what I thought.”</p><p>Emmett told the others what the assassin had revealed. “Vincent stays out of sight by living in a mobile home—it’s a hover-truck, black, with constantly changing license plates. But it’s shiny, all tricked out. The bastard likes living in style.”</p><p>“That’ll make it easier to spot him,” Lucas said. “We’ll start circulating the description.</p><p>Someone will talk.”</p><p>“He also said Vincent has a stockpile of weapons, so we need to be ready for what he might do when cornered.” The bastard wouldn’t care who he hit.</p><p>“He’s got connections to one of the big crime families up north—this is a test run. We don’t kick him out, we’re going to have more problems.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucas nodded. “It’s not just the human gangs we need to worry about—we don’t handle this challenge right, other changeling groups are going to start looking at our territory.”</p><p>“Then let’s make sure we take care of business.”</p><p>Emmett spent the rest of the day ensuring his more shadowy informants knew to look out for the truck. By the time night fell, there was only one thing he wanted to do . . . and only one person he wanted to do it with.</p> <p>Unfortunately, though his split lip had healed with changeling speed, he still had a fairly impressive black eye. No way in hell would Ria’s family let him in through the front door, especially at this time of night. If it had been his daughter, Emmett thought with a twist in his heart, he’d have done the same. But that didn’t mean he was going to stay away from Ria.</p><p>Finding his way to the back of the two-story house that was the Wembley home, he nodded at Nate, on watch that shift, and looked up at the window that he knew faced out from Ria’s bedroom. Nate gave him an interested look. “Wall’s got no handholds.”</p><p>“If I can hook myself up to that window,” Emmett said, working out the mechanics, “I can get up.”</p><p>The other man judged the gap. “Doable.”</p><p>Decision made, Emmett backed up until he had enough distance, kicked himself into gear and jumped. The leopard made sure he caught the ledge he</p> <p>aimed for, and from there, it was a fairly simple climb. Holding himself up with one hand on the lower edge of Ria’s darkened window, while his feet found precarious purchase on the slight ledge of the kitchen window below, he tapped on the glass.</p><p>Silence. Then a shush of sound, as if she was wearing something that trailed on the floor.</p><p>His mind filled with a thousand erotic images, but the window didn’t go up. Instead, he heard Nate’s phone ring. Ria was being very careful. Smiling as he heard the sentinel answer, he waited.</p><p>The window went up a few seconds later. “Are you insane?” Ria hissed, sticking out her head. “How are you even staying up?”</p><p>“Not easily,” he said with a grin, the stress of the day wiped away by the sight of her all sleep mussed and kissable. “Let me in?”</p><p>Pulling back, she waved him in. “Dear God, Emmett,” she said the instant he was inside.</p> <p>“You could’ve fallen and broken your fool neck.”</p><p>“I’m a leopard, mink. Climbing’s my thing.”</p><p>“I don’t think leopards evolved to climb two-storied—” A gasp and she nudged his face toward the light coming in through the window. “What</p><p>happened?”</p><p>“I didn’t dodge fast enough.” He pushed down the window, knowing Nate wouldn’t be able to hear anything now if they kept their voices low. “My own</p><p>fault.”</p><p>Ria slapped a hand on his chest. “I want a straight answer. Talk.”</p><p>He fingered the strap of her ankle-length satin nightgown. The material looked soft and utterly silky. He wanted to gather it up in his hands and bare something even softer and silkier.</p> <p>“Emmett!” A low whisper, but her eyes were snapping fire.</p><p>Sliding his hands down her arms, he tugged her closer. “Who wants to talk?” He dropped his head, nuzzled the scent of her into his lungs.</p><p>Feminine heat and a delicate, exotic perfume.</p><p>Licking out to taste it was instinct. He wanted to know everything about his mate. The leopard smiled at the easy, absolute realization. Of course she was his mate. Why the hell else would he have climbed up that damn wall? Only for Ria. “I like your perfume.”</p><p>She shuddered. “You’re being bad again.”</p><p>“Did you buy it for me?” He stroked his hands down her back, pressing her softness against the pounding heat of his cock.</p><p>“I-I had it from a gift set.” She tangled her hands in his hair. “It said it’s formulated for changelings.”</p><p>“Mmm.” Nibbling his way up from her neck to her lips, he took her mouth in a slow, lazy kiss.</p><p>“Our sense of smell is so strong, normal perfume is too</p><p>intense.”</p><p>“I can’t even smell this one,” she murmured against his lips. “Guess you’ll have to buy my perfume for me.”</p><p>His cat purred, wondering if she realized what she’d just given away. “I’m going to buy you bubble bath, too.”</p><p>“Emmett.” A moan.</p><p>He kissed it away. “Does your door have a lock?”</p><p>“Yes.” She pressed her lips to the pulse in his neck. “But it’s not set.”</p><p>Groaning, he swept her up into his arms and carried her to the door. “Do it.”</p><p>“Say please.”</p><p>He looked down into that teasing face and gave in to the urge to bite, sinking his teeth—very carefully—into the sensitive spot between shoulder and</p><p>neck. She trembled, and he felt the lock turn. “How quiet?” he asked, licking over the mark as he carried her to the bed.</p><p>“My mother has ears like a bat.”</p><p>Grinning, he dropped her lightly on the mattress, coming down on top of her as she finished the sentence. She was all soft and curvy under him, the</p><p>satin of her nightgown delicious torture. He ran his hand down the side. It snagged. “Damn.”</p><p>His hands were rough, calloused, nothing like her creamy</p><p>flesh.</p><p>“I love your hands, Emmett.” It was an intimate whisper in the night-dark of her room.</p><p>He looked down into those intelligent eyes, and knew he was lost. Raising himself off her and to the side, he said, “I don’t want to mess up your pretty nightgown. Pull it up for me.”</p><p>She swallowed, but her hands moved to the satin, pulling it up with slow, sensual tugs. “I’m supposed to be mad at you.”</p><p>“Hmm.” He cupped her knee as it was revealed, waiting for more, for everything.</p><p>“You going to mess up my interviews next time, too?”</p><p>The sweet slope of her thigh. “Probably.” He stroked his hand up, knew he’d have to taste.</p><p>A soft moan, her leg rising slightly, that knee bending as she rubbed her foot on the sheet.</p><p>“How do you do this to me?”</p><p>Shifting his hand fully between her legs, he cupped her.</p><p>EIGHT</p><p>Her gasp was almost silent this time, her body rising in a sinuous curve. Tempted beyond measure, he leaned in to steal another kiss. “The same way you do it to me.” She was so damp and hot under his palm that it was all he could do not to tear off her panties and slide his fingers into liquid-soft flesh.</p><p>Her hands tugged at his T-shirt. “Off.”</p><p>He considered it. “I’ll have to move my hand.” And he didn’t want to.</p><p>Ria’s lips parted. “Your eyes have gone leopard.”</p><p>“I can smell you, all slick and luscious and ready.” He pressed the heel of his hand against the enticement of her, teasing, playing, caressing.</p><p>Her eyes fluttered closed. “Emmett”—a husky order—“if you don’t get that T-shirt off, I’m not going to be responsible for my actions.”</p><p>Moving his hand with reluctance, he pulled off the T-shirt, then got rid of the rest of his clothing—he wanted no more interruptions. Ria’s eyes went wide as he came down beside her again, his hand closing over her thigh. “I want to rip off your panties.”</p><p>Those gorgeous eyes went impossibly wider. “If you promise to buy me a replacement pair.”</p><p>He froze, so aroused he could barely see straight. Burying his head against her neck, he breathed deep. It only twisted the coils more strongly around him. And those coils were soft, feminine, erotic beyond all measure. Fingers tensing, he tore off the scrap of fabric that had so tormented him.</p><p>Ria arched up and he took her mouth again, addicted to the sugar and spice taste of her.</p><p>Under his fingers, she was pure feminine seduction, hot and slick with need. But he wasn’t ready to end this. Continuing to play his fingers between her legs, he licked and kissed his way down her throat, and over the satin to the hollow of her breasts. Her chest rose and fell in jagged breaths, her hand sliding through his hair.</p><p>“Emmett.” Her voice was husky, her passion unhidden.</p><p>Not yet, he told himself, and flicked his fingers over her clit, making her body jerk. When she tugged on his hair, he refused to go up. Instead, he closed his mouth over her nipple, sucking hard through the delicate satin of her gown. Her fingers clenched and unclenched convulsively, her entire body twisting as if it wanted to escape . . . and get closer at the same time.</p><p>Sensing that she was riding the fine edge of pleasure, Emmett slipped two fingers into her tight sheath, stroking her to trembling release. She bit his shoulder to muffle her cry, inciting the leopard to primal possessiveness. Petting her down from the orgasm, he moved to cover her body with his, one hand on the pillow beside her head, the other tangled in her hair as he tugged her back for an almost savage kiss.</p><p>She opened to him immediately, her arms wrapping around him. He nipped at her mouth and tore the straps of her gown, pushing down the material so he could close his hand over the sweet roundness of her breast. When he released her mouth, she pulled him back down. Growling low in his throat, he gave her what she wanted, molding her breast under his hand. She was so lush that he wanted to bite. Next time, he promised himself.</p><p>This time, his patience was at its limit.</p><p>Nudging apart her thighs, he nipped at her lower lip. “Put those pretty legs around my waist, mink.”</p><p>An exquisite slide of soft feminine flesh as she gave him what he wanted. Then she gave him more, pressing her lips to his throat, nibbling on him with delicate possession as he fought not to thrust inside her in a single hard push. Shuddering, he ran one hand down her back to tilt her at just the right angle.</p><p>And then he was sliding in, the liquid heat of her almost scorching. Gritting his teeth, he clenched his hand on the pillow and pushed, slow and easy.</p><p>“Next time,” he choked out, “I get to go fast.”</p><p>Gripping his biceps, Ria drew in a deep breath. “So long as you don’t get any bigger . . . </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Emmett.” The last was a moan as he buried himself to the hilt.</p><p>He didn’t move for several seconds, knowing he was a big man. But then Ria began to shift beneath him in slow rolling movements that drove him out of his mind. The leopard took control and he only just had the presence of mind to take her mouth in a kiss before he surrendered to the driving hunger to take, to mark.</p><p>Mine, he thought, mine.</p> <p>A moment later, even that thought was lost.</p><p>Ria stared at the ceiling over the muscled slope of Emmett’s shoulder. He was heavy, but she didn’t mind being squashed. Not right now. Not when her body was so loose and sated, she felt like a big lazy cat herself. Which, she thought, was exactly what Emmett was acting like. He sprawled over her . . .</p><p>inside her.</p><p>Her cheeks heated. How could she still be shy after what they’d done? But well, she hadn’t expected him to start revving up for a second go so fast.</p><p>“Fast recovery time?” she asked, not quite sure where she found the sass.</p> <p>“Something like that.” It was a rumble against her throat.</p><p>She ran her fingers through his hair, smiling.</p><p>“Ria?”</p><p>“Hmm?”</p><p>“Were you a virgin?”</p><p>The question made her cheeks burn. “Technically.”</p> <p>He sounded a little choked as he said, “Technically?”</p><p>“I’m twenty-two, Emmett. Just because I chose to wait for the right man doesn’t mean I wasn’t curious.” She thought she might have shocked him when he remained silent for several long minutes.</p><p>She should’ve known better.</p><p>“Where do you keep the stuff you used to satisfy your curiosity?”</p><p>Her throat dried up. “Never you mind.”</p><p>A squeeze of her hip. “Please?”</p><p>Her heart tumbled over. This man, she thought, could enslave her. “No.”</p><p>“Next time?”</p> <p>“No.” She didn’t know if she could survive the eroticism.</p><p>Emmett grazed her throat with his teeth. “I’ll buy you some. And make you open them in front of me.”</p><p>Her mind overloaded. She felt her body ready itself for another ride, and dear Lord she wanted it. “Less talk, more action, pussycat.”</p><p>That got her a pinch on the butt, a low male growl, and all the action she could’ve hoped for.</p><p>Ria couldn’t meet her mother’s eyes the next morning. Not because she was ashamed—how could she possibly be ashamed of the glory of what she’d</p><p>done with Emmett? The sex was one thing, but he’d been so affectionate afterward, not leaving until almost dawn. She’d felt petted and adored.</p><p>That was the reason she couldn’t meet Alex’s eyes. She was sure her mother would spot the bubbling joy in her, the certain knowledge that she was in love with a man who was almost perfect. And that almost, she thought with a frown, might yet be a big problem. She had more interviews lined up this week, and while Emmett had hinted that they were close to catching Vincent, that still left her with a bodyguard.</p><p>The phone rang as Alex was muttering about it being nine already. Since the shop opened at ten, she had plenty of time to get there, but Alex didn’t like being late. “I’ll grab it,” Amber said, having just walked into the room. “Hello? Yes, she’s here. One moment.” She held out the phone to Ria, mouthing DarkRiver Construction.</p><p>Ready to hear the bad news, Ria took the receiver, not bothering to step out of the kitchen/dining room—Alex, Amber, and Miaoling would simply follow her. “Ria speaking.”</p><p>“It’s Lucas Hunter.”</p><p>“Good morning.” Her eyes narrowed. “May I ask a question?”</p><p>A chuckle. “No. Ask Emmett.”</p><p>That was the problem, Ria thought. Emmett wouldn’t answer her questions. His protectiveness was starting to get on her nerves—even the nerves that loved the bejesus out of him. “Then what can I do for you?”</p><p>“How about sorting out my filing system?”</p><p>Excitement shot through her . . . before coming to a crashing halt. “No, thank you.”</p><p>A pause. “Ria, this has nothing to do with anything else. I’m an ice-cold bastard when it comes to business—I need an assistant who can deliver the goods.”</p><p>“And the fact that I’d be protected at DarkRiver HQ is coincidence?”</p><p>“Yep. If you suck at your job, I’ll boot you out after the probationary period.”</p><p>Hearing that delighted her. “I,” she said, starting to grin, “am very good at what I do.”</p><p>“Then when can you start?”</p><p>Ria blinked. “Today if necessary.”</p><p>“I’ll see you when you arrive.”</p><p>Hanging up, Ria looked into three pairs of avidly interested eyes. The symmetry of it struck her deep in the heart. Miaoling, with her wise, laughing gaze.</p><p>Alex, so energetic and impatient. Amber, with both Miaoling’s sense of calm and a slight wickedness it took even friends and family a long time to see.</p><p>Smile cracking her face, Ria pumped her fist in a victory salute before jumping over to do a little dance around the three most important women in her life. Alex opened up a bottle of champagne she’d secreted away—though Amber had to be satisfied with grape juice—and did a toast. “Here’s to my daughter. Much too smart for that imbecile, Tom.”</p><p>Emmett walked into Lucas’s office area and winked at the assistant sitting primly at her desk.</p><p>“Boss in?” “You look like a hoodlum,” he was told, before Ria got up and came over. “Did you even brush your hair after you showered?” She was threading her fingers through that hair as she spoke.</p><p>Emmett savored the feel of her so close. Hearing Lucas’s door open, he bent down, picked Ria up, and planted a bone-tingling kiss on her lips.</p><p>She was panting for breath by the time he finished, her cheeks adorably red. “Emmett! I’m at work.”</p><p>Shrugging, he met Lucas’s eyes over the top of her head. His alpha held up his hands, his amusement open. “We ready to go?”</p><p>Emmett nodded. “He’s parked about half an hour out of the city.”</p><p>Ria looked between the two men. “Vincent?”</p><p>“Yes,” Emmett said as Lucas made a signal that he’d be out in a minute and walked back into his office. “Bastard’s ass is toast.”</p><p>Ria put a hand on his chest. “Are you going in with lots of backup?”</p><p>“Don’t worry about it, mink. I know what I’m doing.”</p><p>“Emmett!” Her voice was a whip.</p><p>Surprised, he looked at her. “What?”</p><p>“Don’t tell me not to worry! Don’t pat me on the head as if I’m a brainless bimbo and tell me everything’s going to be okay.” She poked him with a finger.</p><p>“If we’re going to be in a relationship—” Snapping her mouth shut, she folded her arms and returned to her desk.</p><p>Stupefied, he prowled after her. “If we’re going to be in a relationship, then what?”</p><p>“Nothing.” She began to order papers on her desk. “Just don’t get yourself killed. That would make me seriously angry.”</p><p>He knew that wasn’t it. Grabbing her arm, he pulled her toward him. “I’m not leaving till you tell me what’s up.”</p><p>Ria looked toward Lucas’s open doorway. “This is not the time and place.”</p><p>He waited.</p><p>She blew out a breath. “Are we in a relationship?”</p><p>“What did you think last night was?” This was one of those times when he didn’t get women.</p><p>Scratch that. When he didn’t get his woman.</p><p>“Well, men don’t necessarily equate sex with a relationship.” It was a whisper, her eyes flicking to Lucas’s door again.</p><p>Emmett decided not to remind her that Luc could probably hear everything anyway. “That wasn’t sex, Ria. That was fucking-amazing-sex.” He grinned at her blush. “And I equate everything I do with you to a relationship. Try going out with another man and see where it gets you.”</p><p>She tried for a glare but a smile peeked out. “Go. Be careful.” A tight hug. “We’ll discuss the other stuff when you’re back safe and sound. I’ll be waiting.”</p><p>He walked out with the scent of her bound into his very skin, her promise in his ears.</p><p>Ria found herself escorted home by an older man called Cian that day. “Any word?” she asked him as they reached the front door.</p><p>A shake of his head. “I don’t think they’ll move until a few hours after dark.”</p><p>Something about Cian struck Ria as oddly familiar, but she was sure he’d never been on protection detail before. “Will you let me know if you learn anything?”</p><p>His eyes were warm when he looked at her. “Of course, Ria.”</p><p>Nodding, she thanked him and walked inside. Her father had beaten everyone home and was at the stove, concocting his (in)famous secret spaghetti sauce. “Hey, Dad.” She bussed him on the cheek. “Where’s Amber?” she asked, guessing her grandmother was catching a nap as she sometimes did.</p><p>“She thought she might be having contractions—Jet came home and took her to the hospital.”</p><p>Ria stopped in the process of taking off her coat. “Is she in labor?”</p><p>“Doctor thinks it’s false, but he’s keeping her there for a couple of hours to make sure.” He touched his back pocket. “Jet’s gonna buzz me if it looks like my grandbaby’s going to come early.”</p><p>Smiling, she hung up her coat and went to stand by his side, sliding one arm around his waist. “Smells good.”</p><p>He put his free arm around her shoulders. “So, you involved with that cat?”</p><p>“Yep.” She’d never lied to her father. Skirted around the truth maybe, but never lied. “I’m crazy about him.”</p><p>A sigh. “Invite him to dinner.”</p><p>“So you can grill him?”</p><p>“It’s what fathers do.” A squeeze of her shoulders. “I only want what’s best for you. Have you considered how this man is going to support you?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ria didn’t point out that she could support herself. That wasn’t the issue at hand. “Well, when he’s not acting as a DarkRiver soldier, he has another job.”</p><p>She’d discovered that sometime last night—even now, the memory of Emmett’s lazy voice murmuring the answers to all the little questions she had about him was enough to make her body flush.</p><p>“Oh?”</p> <p>NINE</p><p>“Yeah.” She drew it out, knowing it would drive her father Ycrazy.</p><p>“Ria.”</p><p>Laughing, she met his scowling eyes. “He’s an engineer.”</p><p>Her father’s eyebrows climbed to his hairline. “Who does he work for?”</p> <p>“DarkRiver Construction. He specializes in making sure buildings are built to withstand seismic events.” That was how he’d put it, sounding far more academic than she’d expected. It had been obvious in that single sentence that he not only knew what he was doing, but that he loved his work. “He</p><p>trained with Angus Wittier.” Wittier was considered the premier expert on seismic-proof building in the country.</p><p>Simon nodded, his face contemplative. “Pass me the oregano and go get changed.”</p><p>“Will the spaghetti be ready soon?” She wasn’t hungry, her stomach in knots as she waited to hear the outcome of the DarkRiver-Crew showdown, but</p><p>she wanted to keep the emotional temperature mellow for her father. Simon only cooked spaghetti when he was stressed—Amber’s situation was clearly worrying him more than he’d admitted.</p><p>“Ten minutes.”</p> <p>“I’ll set the table after I change.” Walking up to her bedroom, she closed the door before calling Jet. “How’s Amber?” she asked when her brother</p><p>answered.</p><p>“She’s okay right now, resting.” His voice was soft. “Tell Mom and Dad not to worry—the doctor says everything’s super with the baby.”</p><p>“Hah,” she said, with a smile. “You know how they are.”</p><p>“You’ll keep them calm, Ri-ri.” Said with absolute confidence. “I’ll call you as soon as anything changes.”</p><p>Hanging up, Ria changed, and then did what Jet had expected her to do—she made sure everyone remained calm—though her own emotions had her</p><p>feeling incredibly fragile beneath the surface. What if something happened to Emmett? No, she told herself, somehow managing to maintain her</p><p>composed facade even when Amber suddenly went into labor and the entire family rushed to the hospital, escorted by a trio of DarkRiver soldiers.</p> <p>They were walking past the emergency room when several ambulances came screaming in.</p><p>Ria recognized the shock of white-blond hair on the</p><p>stretcher they pulled out of the back of one vehicle. “Dorian,” she whispered, looking for Emmett’s big form. He wasn’t there. But Dorian was bleeding, the red stark against the pale gold of his skin. “Popo—”</p><p>“Go.” Miaoling squeezed her hand. “I’ll take care of your mom.”</p><p>Cian by her side, Ria ran to the fallen DarkRiver soldier, slipping her hand into his as the medical team worked around her. “Hold on, Dorian.” He was unconscious, but she felt as if he knew she was there. She turned to Cian. “Tamsyn?”</p><p>A nurse pushed Ria out of the way as they wheeled Dorian into an operating theatre.</p><p>Turning, she found Cian on the phone. “She’s almost here,” he told her, putting the phone in his pocket. Tiny lines of concern fanned out from the corners of his pale blue eyes.</p><p>Tamsyn ran in mere minutes later, a slender blonde female by her side. While the healer ran through to prep for the operating theatre, the woman halted beside Cian. The soldier immediately put his arm around her shoulders. “What’re you doing here?”</p><p>“I was at Tammy’s when the call came in,” the woman said, pushing back her hair.</p><p>The instant Ria saw her eyes, all the pieces fell into place. The way Cian moved, the way he spoke, no wonder it had seemed familiar. “You’re Emmett’s parents.”</p><p>“And you must be Ria. I’m Keelie.” Emmett’s mother’s smile was wide, those whiskey-colored eyes she’d bequeathed her son as bright as diamonds.</p><p>Ria didn’t even think about shaking hands. She walked forward and into open arms. The hug was tight. “Have you heard from Emmett?” Keelie asked.</p><p>Surprised that Keelie expected Emmett to call her first, Ria shook her head. “Not yet.” Her phone rang at that very instant. Pulling it out, she put it to her ear.</p><p>“I’m on my way to the hospital, mink. Don’t faint.”</p><p>She felt her stomach drop. “What’s wrong? Emmett, if you’ve been shot—”</p><p>“It’s just a flesh wound. You can kiss it better.” His tone was warm, a caress across her skin.</p><p>“I’ll come by after I stop in at the hospital—”</p><p>“I’m here,” she interrupted him. “Amber’s in labor.”</p><p>“Problems?” Sharp concern.</p><p>Her heart clenched. “It’s a couple of weeks too early, but the doctor said he didn’t foresee any difficulties.” She took a shuddering breath, trying to convince herself of that. “I’m in the ER. I saw Dorian being brought in.”</p><p>“Is Blondie okay?”</p><p>“Tamsyn’s in there with him.”</p><p>“He took a bullet through the ribs—don’t think it hit anything major. Hold on. Be there in a minute.”</p><p>Closing the phone, she turned to share what he’d said with Keelie and Cian, but the couple shook their heads. “We heard.”</p><p>“Oh, right.”</p><p>“Emmett’ll get you an earpiece,” Keelie said. “It’s what the other human members of the pack use when they want to have private conversations.”</p><p>Ria’s curiosity momentarily overwhelmed her worry. “You have human members?”</p><p>“Of course!” Keelie smiled. “I guess people must assume they’re cats.”</p><p>Ria opened her mouth to reply but something made her turn to the doorway. She was running toward Emmett before she realized she’d moved. He caught her with one arm, the other in a sling.</p><p>“Flesh wound?” She pushed aside his shirt to reveal the bandage. “That’s an awfully large bandage for a flesh wound.”</p><p>One big hand stroked over her hair. “It’ll be fine as soon as Tammy has some time free.</p><p>Gimme a kiss, mink.”</p><p>“Emmett! Your parents are standing right there.”</p><p>But he was already kissing her, and what could she do but kiss him back? She held on tight, so glad he was safe. “When did you turn into such an</p><p>exhibitionist?” she whispered after he drew back, her cheeks nuclear-hot.</p><p>A small, wicked smile. “Just letting the others know you belong to me.”</p><p>Her eyes widening in horror, she looked around his shoulder . . . to see the grinning faces of ten more DarkRiver soldiers. Including her boss. And a tall redheaded female who was giving her the thumbs-up. “Oh. My. God.” She buried her face in Emmett’s chest and felt the laughter rolling through his body.</p><p>“I’m going to kill you.” But in truth, all she wanted to do was stay pressed to him forever.</p><p>Dorian was pronounced stable half an hour later, and Tamsyn had enough energy left over to do a little extra healing. “How does it work?” Ria asked as the healer put her hand on Emmett’s shoulder and closed her eyes.</p><p>“Some healers say it comes from within, but I think I act as a reservoir for pack energy.”</p><p>Tamsyn’s forehead furrowed in concentration. “My body can only hold a finite amount, so if Dorian had been hurt too badly, I would’ve been wiped out. But he’s a strong one.”</p><p>“She’s selling herself short,” Emmett said. “Tammy directs and channels her energy so it does the most good—probably knows more about the human</p><p>body than most doctors. Though she’s one of those, too.”</p><p>Ten minutes later, the sling was gone, Emmett’s wound a soft pink. Ria ran her fingers over it, taking utmost care. “Does it hurt?”</p><p>“Naw, I’m tough. But if you want to kiss it better, I won’t object.”</p><p>Laughing, Tamsyn backed out of the cubicle. “Remember kids, this is a hospital.” She closed the folding door behind herself.</p><p>Ria punched an unrepentant Emmett gently on his uninjured shoulder. “How did you get shot?”</p><p>“Aw, come on, mink, you don’t want me to get into that.”</p><p>Putting her hands on her hips, she faced him head-on. “Emmett, you know how we were going to have a conversation later?”</p><p>He looked a little wary. “Yeah?”</p><p>“Well—” she began just as her phone started to beep in a frantic pattern only the family ever used. “Amber!” She put the cell to her ear. “Mom?”</p><p>A fragile response. “Amber’s in trouble.”</p><p>Ria began moving, conscious of Emmett at her back. The maternity ward was in a completely different wing of the hospital so it took precious minutes to get there. She arrived to find Miaoling sitting down, her hand intertwined so tightly with Alex’s her fingers had turned bone white. Simon sat on Alex’s other side. No one said a word.</p><p>Ria’s heart stopped. “What? What is it?”</p><p>It was her father who answered. “There was bleeding. Complications. They don’t know if . . .”</p><p>“No one will talk to us,” Alex said, sounding on the verge of tears. “They just rush in and out.”</p><p>“Wait.” Ria took a deep breath and grabbed the first nurse she saw.</p><p>Crouching down beside Miaoling, Emmett took her small, wrinkled hand in his as he watched Ria quietly and effectively intimidate a nurse into giving her the information her family needed. She returned several minutes later, a small fierce warrior.</p><p>“They’ve got a fetal heartbeat. Amber’s conscious and</p><p>talking.”</p><p>“The bleeding?” Alex asked, her voice breaking on the words. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“They’re working on getting it under control.” Ria looked up as another group burst into the waiting room.</p><p>Amber’s parents, Emmett realized as Ria greeted them in a flowing burst of Mandarin, clearly trying to stave off their panic. The couple sat down on</p><p>Simon’s other side, asking Ria more questions. She shot Emmett a grateful glance as he continued to talk to Miaoling and Alex in a low voice, telling them about life in the pack, anything to take their minds off what was happening in the room only a few feet away.</p> <p>They asked him all kinds of questions, but he knew they’d be unlikely to remember any of it come morning. Still he talked, giving them the distraction they needed, as Ria did the same with Amber’s parents. Simon spoke to both his wife and mother-in-law, and Amber’s parents, in turn, obviously trying to stay strong for his family.</p><p>But Ria was the glue, the quiet strength that held everyone together.</p><p>His leopard growled in pride.</p><p>Forty minutes later, there were tears of happiness, not sorrow. Amber was pronounced stable—though she’d have to stay in the hospital a bit longer than usual—the baby was a squalling ball of red-faced anger, and Jet was grinning like a fool.</p><p>“What’re you going to call her?” Ria asked after everyone had piled into the room and reassured themselves that both mother and baby were fine.</p> <p>“Joy,” Jet said, touching one gentle finger to the baby’s cheek. “That’s what she is—our Joy.”</p><p>“It’s a beautiful name.”</p><p>“Yeah. Amber wants to use Nana’s name as a middle name.” He drifted to his wife’s side as if drawn there, curling his hand around hers. Though her</p><p>face was lined with tiredness, Amber smiled. “Hey you.”</p><p>Ria began to nudge everyone out of the room.</p><p>Half an hour later, Emmett used Simon’s car to drop off Amber’s parents, along with Alex and Miaoling, since none of them were in any condition to drive, before returning to pick up Ria and her father. Simon got into the passenger seat, as Ria slid into the back. Emmett could feel the older man’s focus on him as they drove and it was no surprise to hear Simon say, “Ri, go inside. We’ll be in in a moment.”</p> <p>Ria looked from one man to the other. Emmett shook his head in a slight negative when she went to open her mouth. Pursing her lips, she got out and entered the house. Emmett glanced at Simon. “I’ll take care of her.”</p><p>“She’s special,” Simon said, looking him straight in the eye. “We lost a baby girl to a late-pregnancy miscarriage a year after Jet was born. We weren’t the same after . . . but then Ria came. She healed us. She’s our heart.”</p><p>Emmett nodded, fully comprehending the sheer depth of everyone’s terror at the hospital tonight. “I understand.” And he did. Because she was his</p><p>heartbeat, too.</p><p>A pause. Then Simon opened the door and got out. “I’ll send Ria to you. Save you sneaking up the wall.”</p><p>Emmett winced. “Um . . .”</p><p>Simon’s lips curved. “Ask me sometime about how I used to get into Alex’s room when we were high school students.”</p><p>Emmett was still grinning when Ria slid into the passenger seat. Before she could say anything, he started up the engine again. “Think your dad would mind if we took the car for a spin?”</p> <p>“No, but where are we going?”</p><p>“For a little ride.” Putting the vehicle into hover-drive, he took them out of the city, and through the red arches of the bridge that had been there so long, the world couldn’t imagine San Francisco without it.</p><p>Ria sat back, releasing a sigh. “I’m so glad everyone’s okay.”</p><p>“Even me?”</p><p>“Even the idiot who got himself shot up when I specifically told him not to.”</p><p>The leopard batted playfully at her sharp response, delighted by her. “Just checking.”</p><p>Passing the main lookout on the other side of the bridge, he drove up a “secret” route that all the high schoolers knew about.</p><p>“Hey, where does this go?” She twisted around. “I’ve never been up here.”</p><p>“Mink, you must’ve been one hell of a good kid.”</p><p>“I admit my nerdiness with pride.” She made a choked up sound of surprise when she saw four other cars parked at the top, all of them a good distance from each other. “You brought us to a make-out spot?”</p><p>“How else was I supposed to get my hands on you?” Parking the car at the end of the dirt lot, he slid away the manual controls, then reached over and</p><p>undid Ria’s safety belt. “Come here.”</p><p>Laughter danced in her eyes as she shifted over to straddle him, knees on the seat on either side of his thighs. “We are not making out in my parents’</p><p>car.”</p><p>“Yes, we are. That’s the rule. You think those kids own those cars?” He nodded out the window. “Exactly.”</p><p>Ria’s smile softened, grew serious. “I was so scared for you, Emmett.”</p><p>“Hey.” He pressed his lips to hers. “I can’t promise you I’ll never be hurt, but I can promise that I’ll do everything in my power to come back to you every day.”</p><p>Her lips trembled. “If you don’t, I’ll come after you.”</p><p>“I know.” After seeing her at the hospital, he finally understood what she’d been trying to tell him all this time—Ria might be small and vulnerably human, but she was also strong enough to take anything the world threw at her, a warrior in her own way. It was time he started treating her like one. “You want to hear how it went down?”</p><p>A jerky nod.</p><p>“Okay, we have the truck surrounded, and we’ve blocked off the streets he could use to drive out, so he’s a rat in a cage. We wait till nightfall.” He unbuttoned the first three buttons on her shirt.</p><p>“Emmett!”</p><p>“It’s to make the bad memories go away.”</p><p>Giving a burst of stifled laughter, she thrust her fingers through his hair as he pressed a kiss to the delicate skin between her breasts. “God, you’re</p><p>pretty, mink. I’m gonna kiss you all over next time.”</p><p>“I like that song.”</p><p>“Me, too.” Another kiss before he straightened. “So, everything’s going to plan. Problem is, Vincent’s smart. He’s got the immediate area around his</p><p>truck set up with sensors. No way to get to the truck without alerting him.”</p><p>“But you were sure he was in there?”</p><p>“We saw him come out earlier in the day—”</p><p>“How did you know what he looked like?”</p><p>Smart question. Nothing less than he expected from his mate. “No need. It was obvious he was the alpha dog.”</p><p>“Go on.”</p><p>He ran his finger down her bared skin, undoing a few more buttons along the way. His leopard rose to the forefront, possessive and oh-so-hungry.</p><p>TEN</p><p>Breathing past the desire to simply take, he continued. “It was clear we wouldn’t be able to get into the truck even if we somehow got past the alarms</p><p>—thing was armored like a tank. No windows, no visible vents. So we threw something at the back doors.”</p><p>Ria blinked. “High-tech.”</p><p>“All we needed was one of the goons to open the doors. Soon as he did, we shot in so many canisters of tear gas, they couldn’t throw them all back.”</p><p>He’d finished unbuttoning her shirt, but she was too involved in the story to notice. The cat grinned. “Bastards had to come pouring out eventually. But the morons came out shooting, even though they couldn’t see a target.”</p><p>“You got shot by accident?” she asked, as if it was his fault.</p><p>“I got shot by morons.” He bent to press kisses along the creamy upper curves of her breasts. “Aside from two lucky shots, they were useless. We had them down on their knees in seconds.”</p><p>“What did you do to them?”</p><p>Looking up, he met her gaze. “I’m a leopard, Ria. I protect what’s mine.”</p><p>“I know.” Absolute acceptance in her eyes, her face.</p><p>“I was the one to take Vincent down—and maybe he got a little banged up in the process, but we turned the whole lot of them over to Enforcement.”</p><p>“Really?”</p><p>“Scout’s honor.” He smiled, letting the leopard out to play. “Turns out the Crew killed two cops in cold blood only a few hours before our takedown.</p><p>Enforcement was real happy to take them in.”</p><p>“Two birds, one stone,” she murmured. “Vincent never again sees the light of day, and you make friends in Enforcement.”</p><p>“And,” he said, knowing she needed to know everything, “by taking down the Crew so completely, we gave notice to the Psy Council that we’re here to stay.”</p><p>Ria’s eyes darkened. “They’ll make trouble for you if they think you’re a threat.”</p><p>“Yeah.”</p><p>“Good thing you cats are so tough.” A soft whisper that told him she’d stand by him, no matter what.</p><p>Proud of her courage, he said, “We did let one goon go.”</p><p>“Why?”</p><p>“So he could take a message to the famiglia up north. Anyone else comes down, we’ll be sending them back in little tiny pieces. And then we’ll come up and do the same to those who gave the orders.”</p><p>“Would you really?”</p><p>“What do you think?”</p><p>“I think family comes first.” She smiled. “You did something else. I can tell.”</p><p>He began to slip her shirt off her shoulders. “We have some expert hackers. Maybe the big bosses found their data compromised and pictures of</p><p>leopards as screen savers.”</p><p>Ria’s body began to shake as the shirt dropped to the floor. Her laughter was infectious—the leopard purred into her mouth as he took it in a slow, deep kiss. She kissed him back with an intensity that was pure Ria, then slid her mouth over his jaw and up to nibble on his ear. He was stroking his hand down to cup her breast when she screamed and jerked back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He knew she was saying something, but he couldn’t hear it, his entire body in agony.</p><p>Mouth snapping shut as her eyes fell on his face, Ria touched her fingers to a point below Emmett’s right ear. “Oh, God.” She realized his ears were bleeding. Her heart almost stopped. “Emmett?”</p><p>His eyes were hazy—he was clearly in pain. And still, she saw him turn to look for whatever it was that had made her scream. But the little spider on the headrest was long gone, scared by her stupid reaction. “Okay,” she said. “Okay.” A few contortions and she managed to get her shirt back on. Fastening a single button between her breasts, she slid back Emmett’s door and half scrambled, half fell out of the vehicle.</p> <p>Once out, she pushed at his shoulders, trying to get him into the passenger seat. He finally seemed to get the message and slid over, his movements</p><p>nowhere near as graceful as usual. Instead, he slumped heavily into the seat and mimed writing.</p><p>Grabbing the purse she’d left on the dash, she pulled out the tiny notepad and pen she always carried. Emmett took it and wrote down an address, with the name Tammy at the top.</p><p>“Tamsyn.” Nodding, Ria started up the car. The healer was a little ways out of the city, but if Emmett wanted to go to her rather than to Emergency, Ria</p><p>wasn’t going to argue.</p> <p>It was the worst drive she’d ever made. Emmett touched his knuckles to the back of her cheek ten minutes into the journey, but his tenderness only made her feel worse. Fighting off tears, she drove as fast as she dared and made it to Tamsyn’s just after one in the morning. Emmett slid back his own door and was out by the time she got to him. He swayed, as if he’d lost his center of balance.</p><p>Pulling his arm around her shoulders, she began to walk him to the door. It was wrenched open before they reached the first step. Nathan, who Ria had met during his watch on her parents’ house, walked out, followed by Tamsyn. The healer was wearing a kimono-style robe in vivid blue, but it was her eyes that stole the scene, night-glow in the darkness.</p><p>“What happened?” she asked, coming to a stop in front of Emmett.</p><p>Tears streamed down Ria’s face. “I screamed right next to his ear.”</p><p>“Is that all?” Lifting her hands, the healer cupped them gently over Emmett’s ears. “It won’t take long to heal. He’ll be extra-sensitive for a week, but after that, his hearing will go back to normal.”</p><p>Ria felt Emmett squeeze her shoulders, his eyes already looking clearer. But she didn’t breathe easy until Tamsyn drew back her hands and said,</p> <p>“There.”</p><p>Emmett turned to Ria. “What was it?”</p><p>“A spider,” she admitted, shamefaced. “Teeny, tiny.”</p><p>“Scared of spiders, mink?” He drew her into his embrace.</p><p>“Very.” Her eyes met Tamsyn’s. “Thank you.”</p><p>“No problem.” Touching her fingers gently to Ria’s cheek, she took the damp towel Nathan held out to her. “For the blood.”</p><p>As Ria accepted the soft cloth with a murmur of thanks, Nathan jerked his head toward the house. “I’ll leave the door open if you want to come in.”</p><p>“No.” Emmett shook his head. “I have to get Ria home.”</p> <p>The couple headed in with a wave. Reaching up, Ria dabbed away the blood with careful hands. Emmett bent his head and let her do what she needed to do. Only when his face was clear did he take the towel and put it on the hood of the car.</p><p>“You gonna look at me anytime soon?”</p><p>She shook her head. “I’m so sorry, Emmett.”</p><p>“Hey, it wasn’t that bad.” He tipped up her chin, forcing her to meet his gaze. “Excruciating, but otherwise not that bad.”</p><p>Guilt threatened to crush her. Then she caught the glint in his eye. “Emmett, if I didn’t love you so much, I’d kill you right now.”</p><p>His eyes went night-glow between one second and the next. “What did you say?”</p><p>That was when she realized she’d given away everything. Her heart in her throat, she swallowed. “I said I love you.”</p><p>Emmett cupped her cheek in his hand, those amazing, wild eyes becoming impossibly wilder. “Say that again.”</p><p>She did.</p><p>Emmett’s smile was slow, possessive, brilliant. “I love you, too, mink.”</p><p>Her lips trembled. Throwing her arms around him, she let him pick her up and kiss the air right out of her. Sometime later, he said, “You’re my mate.</p><p>Think you can handle that?”</p><p>It was hard to speak with her heart bursting open. “Think you can handle me?”</p><p>“So long as you’re gentle with me.”</p><p>And she knew he was going to tease her about this for the rest of their lives. Her smile almost cracked her face, she was so delighted by the idea.</p><p>EPILOGUE</p><p>Of course Dorian flirted shamelessly with Ria at her and Emmett’s mating ceremony. But Emmett didn’t carry through his threat to eviscerate the younger man. Because Ria was his now, and Dorian, like every other man in DarkRiver, would rather die than cross that line.</p><p>His leopard smiled indulgently as the blond soldier danced Emmett’s mate into a whirl, then caught her laughing form. Her eyes met Emmett’s over</p><p>Dorian’s shoulder and she blew him a kiss. Smiling, he decided he’d shared his mate quite enough. “Go find another partner, Blondie.”</p><p>Dorian released Ria with a mournful smile. “But I like your mink.” Dodging Emmett’s swipe, he walked off with a cocky grin.</p><p>“Is your pack always like this?” Ria asked, looking up at him, her arms wrapped around his waist.</p><p>“Crazy?”</p><p>“That, too. But so . . . like family.”</p><p>“Yep. Pack is family.”</p><p>A frown gathered between her brows. “What about my parents, grandmother, my brothers, Amber, and Joy—will they be shut out now?”</p><p>“They’re family, too,” he told her. “Sometimes, they might wish they weren’t.” Grinning, he directed her gaze to where poor Amber and Joy were being</p><p>“looked after.” The changelings weren’t touching either mother or baby, but it was obvious they wanted to. Then Ria noticed the beautiful handcrafted baby blanket being held out to Amber. Her sister-in-law looked stunned . . . before a slow smile crept over her face.</p><p>“We like kids,” Emmett whispered in her ear.</p><p>Pressing herself to him, she stood on tiptoe to whisper back. “Me, too.”</p><p>He squeezed her close.</p><p>“How come you took so long to find me?” she asked.</p><p>“Stupidity.” A nip of her ear. “But now that I have you, I’m never letting go.”</p><p>Ria smiled and kissed the edge of his jaw. “Who says I’d let you?”</p><p>Laughing, Emmett spun her off her feet and around in a dizzying circle. Ria met her grandmother’s eyes halfway through the first rotation. Miaoling was holding court with the young ones, but her smile was just for Ria. And Ria knew her grandmother understood.</p><p>Emmett was it for her. Forever. No matter what.</p><p>It was, she thought, looking down into eyes gone cat in joyful play, perfect.</p><p>The San Francisco Gazette</p><p>January 1, 2073 </p> </body></html>"]