["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> 1</p><p>THE PRESENT</p><p>Michael Wyndham stepped out of his bedroom, walked down the hall, and saw his best friend, Derik Gardner, on the main floor headed for the front door. He grabbed the banister and vaulted, dropped fifteen feet, and landed with a solid thud he felt all the way through his knees. \"Hey, Derik!\" he called cheerfully. \"Wait a sec!\" From his bedroom he heard his wife mutter, \"Ihate when he does that... gives me a flippin' heart attack every time,\" and couldn't help grinning. Wyndham Manor had been his home all his life, and the only time he walked up or down those stairs was when he was carrying his daughter, Lara. He didn't know how ordinary humans could stand walking around in their fragile little shells. He'd tried to talk to his wife about this on a few occasions, but her eyes always went flinty, and her gun hand flexed, and the phrase \"hairy fascist bastard\" came up, and things got awkward. Werewolves were tough, incredibly tough, but compared to Homo sapiens, who wasn't?</p><p>It was a ridiculously perfect day outside, and he couldn't blame Derik for wanting to head out as quickly as possible. Still, there was something troubling his old friend, and Michael was determined to get to the bottom of it.</p> <p>\"Hold up,\" Michael said, reaching for Derik's shoulder. \"I want to—\"</p><p>\"I don't care what you want,\" Derik replied without turning. He grabbed Michael's hand and flung it away, so sharply Michael lost his balance for a second. \"I'm going out.\"</p><p>Michael tried to laugh it off, ignoring the way the hairs on the back of his neck tried to stand up. \"Touch-ee! Hey, I just want to—\"</p><p>\"I'm goingout!\" Derik moved, cat-quick, and then Michael was flying through the air with the greatest of ease, only to slam into the door to the coat closet hard enough to splinter it down the middle.</p><p>Michael lay on his back a moment like a stunned beetle. Then he flipped to his feet, ignoring the slashing pain down his back. \"My friend,\" he said, \"you are so right. Except you're going out on the tip of my boot, pardon me while I kick your ass.\" This in a tone of mild banter, but Michael was crossing the room in swift strides, barely noticing that his friend Moira, who had just come in from the kitchen, squeaked and jumped out of the way.</p> <p>Best friend or no, nobody—nobody—knocked the alpha male around in his own ... damned .. . house. The other Pack members lived there by his grace and favor, thanks very much, and while the forty-room house had more than enough room for them all, certain things were simply ... not... done.</p><p>\"Don't start with me,\" Derik warned. The morning sunlight was slanting through the skylight, shining so brightly it looked like Derik's hair was about to burst into flames. His friend's mouth—usually relaxed in a wiseass grin—was a tight slash. His grass-green eyes were narrow. He looked—Michael had trouble believing it—ugly and dangerous. Rogue. \"Just stay off.\"</p><p>\"You started it, at the risk of sounding junior high, and you're going to show throat and apologize, or you'll be counting your broken ribs all the way to the emergency room.\"</p><p>\"Come near me again, and we'll see who's counting ribs.\"</p><p>\"Derik. Last chance.\"</p><p>\"Cut it out!\" It was Moira, shrieking from a safe distance. \"Don't do this in his own house, you idiot! He won't stand down, and you two morons—schmucks—losers will hurt each other!\"</p> <p>\"Shut up,\" Derik said to the woman he (usually) lovingly regarded as a sister. \"And get lost. . . this isn't for you.\"</p><p>\"I'm getting the hose,\" she warned, \"and thenyou can pay to have the floors resealed.\"</p><p>\"Moira, out,\" Michael said without looking around. She was a fiercely intelligent female werewolf who could knock over an elm if she needed to, but she was no match for two males squaring off. The day was headed down the shit hole already; he wouldn't see Moira hurt on top of it. \"And Derik, she's right, let's take this outside-—ooooof!\"</p><p>He didn't duck, though he could see the blow coming. He should have ducked, but... he still couldn't believe what was happening. His best friend—Mr. Nice Guy himself!—was challenging his authority. Derik, always the one to jolly people out of a fight. Derik, who had Michael's back in every fight, who had saved his wife's life, who loved Lara like she was his own.</p><p>The blow—hard enough to shatter an ordinary man's jaw—knocked him back a full three steps. And that was that. Allowances had been made, but now the gloves were off. Moira was still shrieking, and he could sense other people filling the room, but it faded to an unimportant drone.</p><p>Derik gave up trying for the door and slowly turned. It was like watching an evil moon come over the horizon. He glared, full in the face: a dead-on challenge for dominance. Michael grabbed for his throat, Derik blocked, they grappled. A red cloud of rage swam across Michael's vision; he didn't see his boyhood friend, he saw a rival. A challenger.</p><p>Derik wasn't giving an inch, was shoving back just as hard, warning growls ripping from his throat, growls that only fed Michael's rage(rival! rival for your mate, your cub! show throat or die!)</p><p>made him yearn to twist Derik's head off, . made him want to pound, tear, hurt—</p> <p>Suddenly, startlingly, a small form was between them. Was shoving, hard. Sheer surprise broke them apart.</p><p>\"Daddy! Quit it!\" Lara stood between them, arms akimbo. \"Just. . . don't do that!\"</p><p>His daughter was standing protectively in front of Derik. Not that Derik cared, or even noticed; his gaze was locked on Michael's: hot and uncompromising.</p><p>Jeannie, frozen at the foot of the stairs, let out a yelp and lunged toward her daughter, but Moira moved with the speed of an adder and flung her arms around the taller woman. This earned her a bellow of rage. \"Moira, what the hell? Let go!\"</p><p>\"You can't interfere,\" was the small blonde's quiet reply. \"None of us can.\" Although Jeannie was quite a bit taller and heavier, the smaller woman had no trouble holding Jeannie back. Jeannie was the alpha female, but human—the first human alpha the Pack had known in three hundred years. Moira would follow almost any command Jeannie might make . . . but wouldn't let the woman endanger herself, or interfere with Pack law that was as old as the family of Man;</p><p>Oblivious to the drama on the stairs, Derik started forward again, but Lara planted her feet. \"Quit it, Derik!\" She swung her small foot into Derik's shin, which he barely noticed. \"And Daddy, you quit, too. Leave him alone. He's just sad and feeling stuck. He doesn't want to hurt you.\"</p><p>Michael ignored her. He was glaring at his rival and reaching for Derik again, when his daughter's voice cut through the tension like a laser scalpel. \"I saidleave him alone.\"</p><p>Thatgot his attention; he looked down at her in a hurry. He expected tears, red-faced anger, but Lara's face was, if anything, too pale. Her eyes were huge, so light brown they were nearly gold. Her dark hair was pulled back in two curly pigtails.</p><p>He realized anew how tall she was for her age, and how she was her mother's daughter. And her father's. Her gaze was direct, adult. And not a little disconcerting.</p><p>\"What?\" Shock nearly made him stammer. Behind him, nobody moved. It seemed nobody even breathed. And Derik was standing down, backing off, heading for the door. Michael, in light of these highly interesting new events, let him go. He employed his best Annoyed Daddy tone. \"What did you say, Lara?\"</p><p>She didn't flinch. \"You heard me. But you won't hear me say it again.\"</p><p>He was furious, appalled. This wasn't—he had to—she couldn't—But pride was rising, blotting out the fury. Oh, his Lara! Intelligent, gorgeous— and utterly without fear! \"Would he have everdared face down his father?</p><p>It occurred to him that the future Pack leader was giving him an order. Now what to do about it?</p><p>A long silence passed, much longer in retrospect. This would be a moment his daughter would remember if she lived to be a thousand. He could break her ... or he could start training a born leader.</p><p>He bowed stiffly. He didn't show the back of his neck; it was the polite bow to an equal. \"A wiser head has prevailed. Thank you, Lara.\" He turned on his heel and walked toward the stairs, catching Jeannie's hand on the way up, leaving the others behind. Moira had released her grip on his wife, was staring, openmouthed, at Lara. They were all staring. He didn't think it had ever been so quiet in the main hall.</p><p>Michael was intent on reaching his bedroom where he could think about all that had just happened, and gain his wife's counsel. He didn't quite dare go after Derik just yet—best to take time for their blood to cool. Christ! It wasn't even eight o'clock in the morning!</p><p>\"Mikey—what—cripes—\"</p><p>And Lara. His daughter, who jumped between two werewolves with their blood up. Who faced him down and demanded he leave off. His daughter, defending her dearest friend. His daughter, who had just turned four. They had known she was ferociously intelligent, but to have such a strong sense of what was right and what was—</p><p>Jeannie cut through his thoughts with a typically wry understatement. \"Thiscan't be good. But I'm sure you can explain it to me. Use hand puppets. And me without my So You Married a Werewolf guide ...\"</p><p>Then he was closing their bedroom door and thinking about his place in the Pack, and his daughter's, and how he hoped he wouldn't have to kill his best friend before the sun set.</p><p>2</p><p>Derik heard the footsteps and slowed. He'd made it almost all the way to the beach but, unless he felt like swimming toLondon , it was time to stop and think with his head instead of his temper.</p><p>Whoever was approaching was downwind, so lie didn't know for sure, but he braced himself for Michael. He'd have to apologize, or there would he real trouble. And hewould apologize. He would. He owed it to his friend, and worse, he'd behaved badly. So he would apologize. Yes. Absolutely.</p><p>But it would taste like shit in his mouth.</p><p>Derik stared out to sea and shook his head at this sorry-ass turn of events. He and Mike had grown up together. Their mothers had often put them in the same crib to nap. They had experienced their first Change the same month of the same year; he remembered Mike had been as thrilled, as terrified, as drunk on the moon as he had been. They had chased together, hunted together, killed together. Had defended the Pack together. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He had no problem with Michael; he loved the big dope.</p><p>He just didn't love Michael being the boss. Not anymore.</p><p>Derik made a fist and hit himself on the thigh. This was his problem, not Michael's, and he had to figure out how to fix it, pronto. He owed the big guy respect, not just brotherly love. And show it he would, no matter how the words wanted to choke him. He wasn't some—some monkey, fighting for the sake of it. He was a werewolf, member of the Wyndham Pack, and fully grown besides. Squabbling was beneath him. So was picking fights.</p> <p>He turned, forcing a smile .. . and the clod of dirt hit him right in the middle of the forehead. It exploded, and dust sprayed everywhere.</p><p>\"Idiot! Putz! Dumb ass!\"</p><p>\"Jeez, Moira,\" he complained, secretly glad showing throat had been put off a bit, \"you could have put my eye out.\"</p><p>\"I wasaiming for your eye, you stupid asshole!\"</p><p>\"Now, Moira, you know you shouldn't use such vague terms,\" he teased. \"You gotta speak hi black and white, honey, really let people know what's on your mind.\"</p> <p>She wasn't having it; the scowl didn't crack. She marched the rest of the way up to him— looking cute as hell in khaki shorts and a lavender T-shirt—and kicked him smartly in the shin. It hurt, too; Moira had toenails like a sloth. \"How could you risk your life like that? We nearly had a fight for dominance in the main hall _- front of all your friends. In front of Lara! You're lucky Michael didn't tear your head off. You're lucky Jeannie didn't shoot you!\"</p><p>He didn't want to, but couldn't help it: He felt his lips draw back from his teeth. \"I could have taken him.\"</p><p>Moira threw up her hands. \"What iswrong with you? You've been like a hungry bear all summer. This is a good time for us, Derik— Michael's brought peace, Gerald's gone, we caught the monster who'd been killing those poor girls . . . there's never been a better time to be a werewolf. So why are you trying so hard to screw things up?\"</p><p>He looked at her, this fine woman, as dear to him as Michael was.Oh, yeah? a treacherous inner voice whispered.Dear to you, hub? You've got a funny way of showing it, jerkoff.</p><p>He didn't have an answer for her. \"I don't know what's wrong,\" he said dully. \"I just want to fight, all the time. Everything that comes out of Michael's mouth is pissing me off. I love him, but I could choke him right now just to watch his eyeballs bulge.\"</p><p>Moira's own eyeballs bulged a bit at that, but she recovered quickly. Her eyes—so fine a blue they were nearly lavender—went narrow and thoughtful. She began to pace, looking not unlike a petite blonde general.</p> <p>\"Okay, well, let's figure this out.\" He smiled in spite of himself. Moira the math genius. Every problem could be broken down to an equation and, thus, solved. Well, hell, she'd figured out where Bin Laden was hiding, hadn't she? Luckily for the world, one of the cabinet members was a werewolf. Moira had sent an E-mail, and forty-eight hours later, hello, spider hole. \"Are you in love with Jeannie?\"</p><p>\"Wha—no!\"</p><p>\"Okay, calm down. It's an explanation, you know ... if you wanted another man's mate.\"</p><p>\"Well, I don't. I mean, Ilike her and all, but Ac's Michael's. Just like he's hers. You can't really picture either of them with anyone else, can you?\"</p><p>Moira stopped pacing and smiled at him. \"No, you're right about that. All right, then,\" she continued matter-of-factly, \"are you in love with me?\"</p><p>\"Ewww, no!\"</p><p>Unfortunately, she kept going. \"Are you upset because I've taken a mate and am having sex with him pretty much every chance I—\"</p><p>\"Aagghh, Moira, please, my eardrums are gonna implode!\"</p> <p>She arched her brows. \" 'Eww'?\"</p><p>\"Honey, you're too cute to be believed, but I have never—never,yuck!—thought of you that way. Never. Ugh! Did I say never?\"</p><p>\"All right, you don't have to induce vomiting to get your point across.\"</p><p>\"If it'll get your mind off that track ...\" he warned, fully prepared to shove a finger down his throat.</p><p>\"Well, it's another theory, that's all.\"</p><p>\"A bad, terrible, awful, yucky theory. Baby, we grew up together. You're like the sister I never wanted.\" He flopped down onto the sand to watch her pace. \"Don't take this the wrong way or anything, but if you put your tongue in my mouth, I'd probably barf.\"</p><p>\"Mutual, wise guy. Actually, I was sure you were picking a fight because you've got the urge to settle down with a mate, and you're surrounded by mated couples, and ... well, I know how you feel, is all.\" She paused, looking pensive. \"I was so lonesome before Jared came.\"</p><p>\"Moira mated with a monkey, Moira mated with a monkey,\" Derik sang.</p><p>\"Shut up, don't call him that! God, I really hate that term.\"</p><p>\"I dare you to use it in front of Jeannie,\" he teased.</p><p>\"Do I look like I want to spend the rest of the day in an iron lung? Never mind the humans in our lives ... my point is, I couldn't stand to be around Michael or Jeannie, because seeing their happiness made me feel worse. I figured that was your problem, too.\"</p><p>\"Well, it's not. Don't get me wrong, cutie, I'd love to find the right girl and knock her up—\"</p><p>\"And cherish and love her,\" Moira added dryly.</p><p>\"—but I've got time. Hell, I'm not even thirty vet \"</p><p>\"Well, we could see if Michael—\"</p><p>\"Leave him out of this.\"</p><p>She chewed on her lower lip for a moment, then adopted an overly innocent expression that put him instantly on guard. The last time she'd looked like that, she had encouraged Lara to cut up his cashmere sweater to make soft puppets. \"We should talk to Michael, you know. He's our leader. He'll tell us what to do.\"</p><p>He ground his teeth in irritation. \"Moira, whatever the problem is,I will figure it out. I don't need Michael shoving his snout in where it's not wanted.\"</p><p>\"But he'll fix everything. He'll tell you how to solve your problem, and you'll listen to him, and you'll be better.\"</p><p>\"I said I can handle thisby myself!\"</p><p>\"You don't want his help?\"</p><p>He bounced to his feet so swiftly, to a human it would have looked like he teleported. \"Jesus, do I have to write it on my forehead? Whatever it is, it's my problem, not his, so he should justleave me be!\"</p><p>\"Ah,\" she said quietly. \"So that's it. Also, back up before I bite off your chin.\"</p><p>He did, realizing he and Moira were nose-to-nose. As nose-to-nose as they could be, anyway—he was a foot taller. \"Sorry. I should probably take a walk, sweetie, I'm not good company right now.\"</p><p>\"I wonder when it happened?\"</p><p>\"Whenwhat happened?\" he practically snarled.</p><p>\"When you became alpha.\"</p><p>\"Don't be ridiculous,\" he said automatically, but inwardly he could feel himself nodding.</p><p>\"Oh,\" she said, watching him, \"and you knew, of course. Sure. You knew, but you ignored it, because you don't want to hurt anyone, and you don't want to leave us. Why would you? You've lived here all your life—we all have. This is home.\"</p><p>He stared at her. Moira, so pretty and cute and helpless-looking . .. Moira, the most intuitive person he'd ever met. \"Sometimes you're scary, you know?\"</p><p>She smirked. \"Of course.\" Her smile dropped away. \"I'm only annoyed I didn't figure it out sooner. But Derik ... as you know perfectly well, one Pack cannot support two alphas. It just can't. That's why there are fights for dominance. That's why you have to leave. Now. Today.\"</p><p>\"But Moira, I—\"</p><p>\"Now.Today. Before this gets worse and you do something we'll all regret, forever.\" She softened her brisk tone and gently touched his brow. \"Because if you or Michael died . . . none of us could bear it.\"</p><p>She didn't add what they both knew. If Michael killed Derik, she would leave. And if Derik killed Michael, she would kill him—try, anyway—and leave. Would the Pack hold? Sure. It had been around for centuries and had been through much worse than the squabbles of alpha males. Would the Pack be a place of love and light any longer?</p><p>No.</p><p>He didn't dare say a word. She was speaking exact truths, her specialty, and though he could hardly stand to hear the words, he'd ignored the problem long enough. But if he spoke, he'd probably burst into tears like a kid and embarrass them both. He hadn't cried since his mother died, but these thoughts had been heavy on his heart for the last few months.</p><p>\"Derik, the wolf in you wants the Pack. But the man in you would never forgive himself if he took it.\"</p><p>Still he said nothing, but she stepped closer, and he rested his forehead on her shoulder. They stood that way, motionless on the beach, for a long time.</p><p>3</p><p>'AAAAAAGGGGGG—\"</p><p>\"I'm really sorry—\"</p><p>\"—ggggggggggghhhhhhhhh—\"</p><p>\"—but the transmission's completely shot—\"</p><p>\"—ggggggggggghhhhhhhhh—\"</p><p>\"—and we'll have to keep the car for at least a week—\"</p><p>\"—ggggggggggghhhhhhhhh—\"</p><p>\"—while we work on it—\"</p><p>\"—ggggggggggghhhhhhhhh—\"</p><p>\"—it'll cost a little more than the estimate I gave you . . . Christ, lady, take a breath, will ya?\"</p><p>Sara Gunn sagged against something large and greasy—not the mechanic—and concentrated on not passing out. New transmission! Eighty zillion dollars to fix, and meanwhile no car for at least a week! Now the mechanic would gouge out her eyes and make her catch up on her laundry, and the day would be complete.</p><p>\"We coulda caught it earlier if you had more than two oil changes a year,\" the mechanic (\"Dave\" was emblazoned on his shirt pocket) said with mild reproach. \"Ask me how to save on your next tire rotation!\" was on his T-shirt in migraine-inducing yellow. Sara disliked lectures from men who wore instructions on their clothing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I hate bringing my car to the garage,\" she muttered. She could feel the clammy sweat of panic beginning to bead between her shoulder blades.</p><p>\"How come?\"</p><p>\"Because I always get expensive news!\" she snapped. \"Look. I'm sorry. I know it's not your fault. It was a shock, and I don't handle surprises well.\"</p> <p>\"How could you be surprised? Your car's an automatic, but it doesn't change gears unless you hold the accelerator down for at least ten seconds-—\"</p><p>\"Well, it started okay, so I didn't think much of it.\"</p><p>\"And the cruise control locks up on you all the time—didn't you say the car forced you through a school zone at seventy miles an hour?\"</p><p>\"Hey, it was Sunday at ten o'clock at night, all right? It's not like there were kids around.\" He frowned at her and she flushed. \"Well, that's why I brought it in.\"</p><p>\"M' point is, you got no cause to be shocked that it's an expensive problem. You're exactly like a gal who finds a lump in her tit but won't go to the tit doc and then gets pissed when he tells her she has cancer,\" Dave pronounced. \"I see it all the time.\"</p> <p>\"First of all, that's the worst analogy I've ever heard. Second, I'm not paying you to lecture me.\"</p><p>\"Actually, you ain't paid me at all,\" he pointed out with a grin. She could be cute, if you liked them rangy and curvy and red-haired, which he surely did. \"Nope, not a cent.\"</p><p>\"Well, I'm going to, okay? Hell, your kids will go to Harvard thanks to my stupid transmission.\" On \"stupid,\" she kicked her rear left tire.</p><p>\"Ha! Harvard. I coulda gone,\" he confided, \"but I didn't want to live on the other coast.\"</p><p>\"Trust me, it was overrated.\" Sara sighed and ran her fingers through her too-long bangs. If hair that grew past your chin could be considered bangs. \"Well, as long as you're doing the transmission thing, see what you can do about the clock. It goes off when I turn on my headlights.\"</p><p>\"It does?\"</p> <p>\"Yes. But as soon as I turn my lights off, it comes right back on, except then it's wrong, and I have to adjust the time until the next time I turn on my headlights. Also, I lost the car lighter—\"</p><p>\"How could you lose—?\"</p><p>\"I just looked down one day and it was gone, all right? Why don't you get a spotlight and shine it into my eyes? Anyway, every once in a while sparks will shoot out from the lighter, which is kind of distracting.\"</p><p>\"I guess so.\"</p><p>\"My horn doesn't work, either.\"</p><p>\"Now, how did that happen?\"</p><p>She ignored the question. \"Also, my radio only gets the local pop station. Which wouldn't be so bad, but they play about six Lenny Kravitz songs each hour.\" She sighed again. \"I used to like Lenny Kravitz.\"</p><p>Dave blinked slowly, like a lizard. \"Why haven't you bought a new car?\"</p> <p>\"It was my mom's car,\" she said simply. \"She loved the wretched thing.\"</p><p>\"Oh.\" He gnawed his lower lip a moment. Everybody in town knew what had happened to Mrs. Gunn. Nobody talked about it. He'd have felt sorry for her even if she wasn't such a dolly. And Sarawas cute, with those crystal blue eyes and the flyaway mass of red curls. Her skin was perfectly white, like fresh cream . . . not a freckle in sight. He figured if she ever set foot on a tropical beach, she'd go up in flames.</p><p>\"Look, Dr. Gunn, I'm sorry to be the bringer of bad news to you and stuff, but I'll get your car in as quick as I can. Shouldn't take more than a few days.\"</p><p>\"A few days of purgatory!\" she shouted, startling him. That was another thing about Dr. Gunn. You'd be having a perfectly normal conversation with the woman, when she'd start screaming. It was true about the temperament of redheads, and that was a fact.</p><p>\"Meantime, I got a leaner I can let you have for\"—at least forty a day, or his boss would kill him. Okay, thirty. Twenty-five ninety-five and that was his final offer—\"for nothing. On account of you getting such a bad shock and all.\"</p><p>She smiled and he nearly fell back into the tire pile. She was cute when she was ranting and fussing and being a pain. She was completely gorgeous when she smiled. Her dimples popped into view, and her eyes crinkled at the corners and made you wonder what her mouth would taste like.</p><p>He smiled back.</p><p>What are you doing, Davey old pal? You got as much chance with Dr. Sara Gunn as you've got to grow tits and fly away.</p><p>\"That'd be great, Dave,\" she said with real warmth. \"I'm sorry about the tantrum.\"</p><p>\"It's not the first one I've seen. You gotta temper on you like a rabid polecat.\" He said this with total admiration.</p><p>\"Uh... thank you.\"</p><p>\"Maybe after your car is fixed, we could have dinner?\"</p><p>\"Of course! And it'll be my treat, for the free loaner.\" She smiled at him again. The way she smiled at her students, her colleagues, love-struck mechanics. Dr. Gunn was brainy, high-strung, occasionally shrill, and had no freakin' clue she was a stone knockout.</p><p>\"Thanks,\" he sighed.Ehh. Worth a shot. \"I'll call you when I get an idea how long it'll take.\"</p><p>\"Thanks again.\"</p><p>He ended up giving her the nicest loaner he had, a silver 2004 Dodge Stratus. His boss would strangle him like a rooster when he found out what he'd done.</p><p>Screw it.</p><p>4</p><p>\"You have to save the world.'</p><p>Derik fought to keep his jaw from dropping. \"Me?\"</p><p>\"Yes, brain-drain, you. In fact, could you get started on that right away?\"</p><p>Moira clapped her hands. \"A quest! Just what you needed, oh, it's perfect, perfect!\"</p><p>\"A quest? Do I look like a Hobbit to you?I have to save the world? From what?\"</p><p>Antonia smirked. \"From who, actually.\"</p><p>\"From whom, actually,\" Moira corrected.</p><p>Antonia glared at her. Moira stared back, eyebrows arched, and after a moment the taller woman dropped her gaze. Antonia was one of those rare human/werewolf hybrids, but nobody liked her much. Born of a human father and a were mother, she couldn't Change, though she had the preternatural strength and speed common to their kind.</p><p>Being unable to Change had been a tremendous burden on her as a child ... the Pack expected much from its hybrids. Her parents tried—and failed—to hide their despair. Hers had not been an easy adolescence, as much from the tremendous pressure she put on herself, as anything ever said, or intimated. \"The only thing I have going for me,\" she often said with bitter insight, \"are my looks. And around here, gorgeous bims are a dime a dozen.\"</p><p>This was true. No one was sure if it was breeding or genetics or great good fortune or the omnivore diet, but werewolves, in addition to being exceptionally strong and exceptionally fast, were exceptionally easy on the eyes. Antonia had enormous dark eyes and creamy skin, long legs and the figure of a swimsuit model, but it didn't set her apart.</p><p>Nobody had a clue what Antonia was until she woke up the morning of her seventeenth birthday, made herself toast and poached eggs, then fell over in a dead faint. When she regained consciousness, she brushed the egg out of her hair and told her astonished parents, \"Michael's going to get someone pregnant today, will be married by summertime and a father before Easter. Oh,\" she added thoughtfully, \"the baby will be a girl, and the epidural won't work for the mom-to-be. Hee!\"</p><p>To everyone's amazement, she had been right. It was the first of dozens of predictions, some mild (\"Moira's going to get stuck with another audit. . . ha!\"), some major (\"Stay the hell out of New York on September 11, 2001.\"). She was never wrong. She was never even off a little bit. No one had seen anything like it. No one was even sure what it meant—could werewolves harness mental power as well as physical? It was a mystery to all.</p><p>And overnight, Antonia had gone from Pack Nobody to Pack Demigod. Piss her off, and nothing might happen ... or she might foresee your death and fail to warn you, out of spite.</p><p>Now here she was, holding court in the solarium, explaining that the world was going to end unless Derik made it to6 Fairy Lane, Monterey, California, as soon as possible.</p><p>\"You guys know who Morgan Le Fay is?\"</p><p>Moira nodded. Derik blinked. \"Guess I'll play dumb blonde,\" he said, avoiding Moira's poke. \"No idea.\"</p><p>\"She was the half sister of King Arthur,\" Antonia explained. \"She had an incestuous affair with her brother and was responsible, indirectly, for his death. She was also a powerful sorceress.\"</p><p>\"Uh-huh. That's fascinating, hon. I like story time as much as the next fella, but this is relevant because ... ?\"</p><p>\"I got a line on her.\"</p><p>\"A line on her,\" Moira repeated. \"Toni, what in God's name are you talking about?\"</p><p>\"An-TON-ee-uh. And Morgan Le Fay is in Monterey Bay.\"</p><p>\"You're a poet, and you don't know it,\" Derik joked, and was unsurprised to see both women ignore him.</p><p>\"She's reincarnated and goes by the name of Dr. Sara Gunn. You have to get over there and take care of her. If you don't, a week from now none of us will be here.\"</p><p>Dead silence, broken by Moira's faint, \"Oh, Antonia ... for real?\"</p><p>\"No, I made it all up because I want the attention,\" she snapped. \"Yes! The world's gonna end, and we're all fucked, unless the Pack's answer to The Rock gets his ass in gear.\"</p><p>Another brief silence, and then Moira said, \"I think—I think I'd better go get Michael and Jean-nie.\"</p><p>For once, Derik didn't argue.</p><p>Michael cleared his throat from the doorway. \"You're going, then?\"</p><p>Derik straightened up from his packing. He'd tossed a few things into a carry-on and was ready to leave. More than ready. He was taking the Wyndham jet to San Jose, California, and from there he'd pick up a rental car to the Monterey Peninsula. He'd already said good-bye to Moira and Jeannie. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Yeah, I'm going now. In fact, I'd better get a move on.\"</p><p>\"Well. Be careful. Don't let her get the drop on you.\"</p><p>\"The reincarnation of the most powerful sorceress in the history of literature, fated to destroy the world in the next few days? No chance,\" he bragged, and was relieved to see a ghost of a grin on Michael's face. \"Leave it to me. This'll be just like the time I agreed to cater your mating ceremony. Except with less flour.\"</p> <p>\"I am leaving it to you,\" Michael said seriously. \"You knew Jeannie was pregnant again, right?\"</p><p>He nodded. They all knew.</p><p>\"Well, for God's sake, don't tell her you knew before I told you,\" Michael said hastily. \"I had the worst time pretending to be surprised when she finally got around to breaking the news. And, of course, she knew I wasn't surprised, and then the shit hit the fan.\"</p><p>\"It's not your fault you can smell it on her,\" he said, puzzled.</p><p>\"You'd think. Anyway ... my point is ... everything I have, and am, is in your hands. It's too bad—\"We haven't been getting along was the obvious end to that statement, but his friend was too tactful to say it.</p> <p>\"Yeah. Don't worry, chief.\"</p><p>Michael smiled again. \"I'm not. Well, I am, a little—it's how I'm made. But, hell, if anyone can save the world, you can. I'd bet my life on it.\" He paused. \"Iam betting my life on it.\"</p><p>Derik was too gratified to speak for a moment. He remembered his earlier words—his earlier actions—and felt his face burn with shame. So he wanted his own Pack—or at least, wanted to be his own man. Did that mean he had to treat his best friend like something to be scraped off the bottom of his shoe?</p><p>\"Uh .. . thanks ... but before I go ...\" He slung his bag over one shoulder, crossed the room, and started to hunch lower, prepared to show throat.</p><p>Michael grasped his shoulder and jerked him back up. \"Don't do that,\" he said quietly. \"For one thing, you're off to save the world, so as far as I'm concerned, the slate's clean between us. For another, Moira says you could be alpha. Since I'm pretty sure she's never been wrong about anything—\"</p><p>\"It's annoying,\" Derik agreed.</p> <p>\"—it's best for you to get out of the habit of showing throat as soon as possible.\"</p><p>Derik paused. \"So ... we almost had to cha-cha today, but because I'm gonna save the world, you're gonna let that go?\"</p><p>\"That's just the kind of swell guy I am,\" Michael said solemnly, and both men cracked up, their laughter sounding more like howls than anything else.</p><p>5</p><p>THE MONTEREY PENINSULA</p><p>He knew it made him shallow. he knew he was probably too old for such nonsense. He knew he should be focused on saving the world. But he couldn't help it.</p><p>Derik loved convertibles. And this one was sublime—electric, eye-watering blue, with leather seats and a superb sound system. Robert Palmer's \"Addicted to Love\" was tearing his head off, because, joy of joys, he'd found a local all-eighties rock radio station. The weather was gorgeous— low 70s and sunny—and his proximity to the ocean meant that thousands and thousands of tantalizing scents were on the air.</p><p>He took a gulp and dizzily tried to process.</p> <p>Derik's nose was an instrument of frightening precision, but even it could .be confused and overwhelmed. Shit, that was half the fun of a convertible! Right now he was smelling seaspray-lilacshottarmacdeerpoopraccoonsseagullfeathers— whoops! Now he was getting a tantalizing whiff of fishoceangrasslawnmowerexhaustpossumfried-chicken and—thank you, Jesus!—girlsweat and Dune perfume.</p><p>I am in California, land of babes and cool cars and movies-of-the-week, but I can't think about that until I save the world.</p><p>At the thought of what was riding on this little day trip, his heart lurched. He had always thought of himself as a mellow kind of fellow (recent events notwithstanding), and if someone had told him he'd be responsible for saving the world—not the Pack, or even his closest friends, but theworld, theentire world ... well, his mind just couldn't get around it. It would try, and then it would veer away and think about something stupid, like how great it was to find an eighties radio station so far from home.</p><p>Saying good-bye to Lara did it. Brought it home for him, however briefly. He loved that littie stinker like she was his own pup. He'd die for her in a New York minute. He'd wring the neck of anybody who hurt her and snap the spine of anyone who made her cry. But if he fucked up— if this Morgan gal got away from him—Lara would never make it to first grade. Never go on a date, never experience her first Change. Never grow up to be his boss, the way her daddy was.</p><p>Shit, he'd almost burst out crying just saying good-bye to her.</p><p>Quickest done, quickest back home.Not that he was so terribly anxious to go back home—the mansion held its own unique set of problems. Derik figured you knew your life was screwed up when you were almost glad you could use saving the world as a distraction.</p><p>Well. He and Mike would work shit out. They had to. Otherwise—otherwise, he just would never go home again, even though that probably wasn't the best way to handle things.</p><p>He didn't trust himself around Mike, that was all. If he lost his temper and things got way out of hand, the deed would be done, and Mike would be dead, and he'd be Pack leader, and Jeannie would be a widow, and Lara would be without a daddy, and then he'd probably go off in a corner and blow his brains out. Better to be a(coward) loner than risk that. Way better.</p><p>Sara Gunn thrust her foot into the second pair of panty hose of the morning and, incredibly, had the same thing happen. There was a zizzzzzzzz! sound, and then her big toenail ripped a runner through her last pair of panty hose.</p><p>\"Right,\" she grumbled. \"Why is it that when I'm running late, everything goes wrong? More important, why am I talking to myself?\" She jerked the nylon torture chamber off her foot and flung it over her shoulder to the floor. \"Okay, then . . . it's gorgeous out. A perfect day to go bare-legged.\" She ran a hand down her left leg. A little raspy, but hardly Yosemite Sam whiskers.Note to self: Shave legs more often when low on panty hose.</p><p>She heard the doorbell, that annoying dum-DUM-dum-dum . . . dum-DUM-dum . . . dum-DUM-dum-dum-DUM! Dah-dum-dah-dum-dum. She cursed her late mother's infatuation with Alex Trebekand Jeopardy. Every time she had a visitor, she felt like phrasing everything in the form of a question.</p><p>Iwill never see twenty-five again ... ortwenty-eight, for that matter, and I never quite managed to move out of my mother's house. Nice one, Gunn. Not pathetic at all!</p><p>She slipped her feet into a pair of low-heeled pumps and squinted distractedly at the mirror. Hair: presentable, if not exactly glamorous, caught up in one of those big black clips that looked like a medieval torture device. Skin: too pale; no time for makeup. Eyes: big and blue and bloodshot—damn thatDeep Space Nine marathon, anyway. Suit: cream linen, which meant she'd be a wrinkled mess in another hour. Legs: bare. Feet: narrow and stuffed into shoes so pointy, she could see the crack between her first and second toe.</p><p>\"Too bad, my girl!\" she told herself. \"Next time don't hit the snooze button so many times.\"</p><p>Dum-DUM-dum-dum . . . dum-DUM-dum ... dum-DUM-dum-dum-DUM! Dah-dum-dah-dum-dum.</p><p>\"Be right there!\" She hurried out of her bedroom,glanced through the kitchen, and breathed a sigh of relief at the sight of the leaner car. Finally! David, her mechanic, had at last had a chance to send over a leaner car for her use. A flashy loaner car, at that. Well, beggars can't be .. . et cetera. The other loaner had conked out after an hour— was it her fault she couldn't drive a stick?</p><p>She flung the door open. \"Thank goodness you're—whoa.\"</p><p>She stared at the man standing on her front porch. He was, to be blunt, delicious. He was to Homo sapiens what a hot fudge sundae was to vanilla ice cream: a complete and total improvement on the original. A full head taller than she was, he practically filled the door frame. His blond hair was the color of sunlight, of ripe wheat, of—of something really gorgeous. He had swimmers' shoulders and she could actually see the definition of his stomach muscles through the green T-shirt he wore. The shirt had the puzzling logo \"Martha Rocks\" in bright white letters. He was wearing khaki shorts, revealing heavily muscled legs tapering into absurdly large feet, sock-less in a pair of battered loafers. His hands, she noticed, were also quite large, with squared off fingers and blunt, short nails.</p><p>He was lightly tanned and had the look of a man equally at home camping in the woods, lounging poolside, or hunched over a. computer. His eyes were the brilliant green of wet leaves, and they sparkled with turbulence and lusty good humor. His mouth was wide and mobile and looked made for smiling.</p><p>He was smiling ather.</p><p>Get a grip,she ordered herself. She was annoyed to find her pulse was racing.It is unbelievably juvenile to be panting at this man, when all he's done is ring your bell twice and stand there. He hasn't even opened his mouth and you're practically a puddle on your own doorstep. He —oh, oh! He's talking!</p><p>\"—wrong house.\"</p><p>\"What did you say?\"</p><p>\"I said, I must have the wrong house.\" His smile widened, as his gaze raked her from head to foot, taking in her bare legs, scuffed shoes, rumpled suit, and messy hair. His teeth were perfectly straight, almost blindingly white, and looked sharp. The guy probably ate his steak raw. He could make a fortune doing Chiclets commercials. \"I'm sorry to bother you.\"</p><p>\"No, you've got the right house. I've been waiting for the loaner.\" She nodded at the flashy little blue convertible. \"The other profs are going to accuse me of entering my midlife crisis a little early, but what can you do? Come in. How are you getting back to the garage?\"</p><p>He stepped inside, and as she reached past him to shut the screen door, she was reminded all over again—as if she needed it!—just how large he was. She was not a petite woman by any means— in fact, she ought to lay off the chocolate croissants—but he made her feel absolutely tiny. She caught a sniff of him and nearly purred. He smelled like soap and male. Big, clean male. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He glanced around her kitchen. \"Listen, I don't want to put you out, but can you tell me which house is number6 Fairy Lane?\"</p><p>\"It's this one,\" she said with bare impatience. Gorgeous, but not terribly bright. Well, nobody was perfect. \"I told you, you're in the right place. I'm running late for rounds, so if you could just arrange to have someone pick you up—\"</p><p>\"Yeah, I'll do that. 'Cuz there's obviously been a mistake.\"</p> <p>\"Tell me about it,\" she said, looking at him with longing. In a perfect world, he would be her pool boy. Instead, she was late for work and he had to hitch a ride back to his place of business. \"Well, thanks for dropping off the car—see you.\"</p><p>He followed her onto the porch. \"It was nice meeting you. Sorry about the misunderstanding.\" But, interestingly, instead of being regretful, he sounded weirdly relieved.</p><p>Odd! But, she had no time to ponder it. \"Bye!\"</p><p>She got the car going with no trouble—she'd heard the phrase \"the engine purred like a kitten\" before but had no real experience with it until now—and pulled out of the driveway. She waved to the man who should have been her pool boy, who was looking as though he'd had a touch of sun, and dropped the pedal.</p><p>6</p> <p>Derik went to the nearest safe house, the one down the block from the aquarium. An adorable cub answered the door, a boy about eight years old with big dark eyes and black hair.</p><p>\"Hi,\" Derik said. \"Are your folks home?\"</p><p>\"Sure. What's your name?\"</p><p>\"Derik.\"</p><p>\"Okay. Come on in.\"</p><p>Derik followed the boy into a kitchen that smelled like cookie dough and found the lady of the house up to her elbows in butterscotch chips. \"Well, hi there,\" she said, her greeting a soft Midwestern twang. \"My name's Marjie Wolfton; this is my son, Terry. Do you need some help?\"</p> <p>\"Just a private phone. I'm—uh—sort of on a mission to—um—never mind.\" He just couldn't bring himself to say \"save the world.\" It was too bizarre.</p><p>Marjie, however, seemed to know all about it. Either that, or she was used to strange werewolves showing up at her door. \"Yes, of course. Terry, show Derik the den.\"</p><p>\"Okay.\" The boy snatched a fistful of dough and disappeared down a hallway. Derik followed him into the den, which had a hardwood floor, windows set into the ceiling, a computer, a phone, and a television.</p><p>\"Are you from Massachusetts?\" Terry asked.</p><p>\"Uh-huh.\" He was going to have to call Anto-nia and figure out this mess. No way was that distracted cutie Morgan Le Fay. No way. \"How'd you know? Am I dropping my Rs?\"</p><p>The boy ignored the question. \"And you live with Michael Wyndham? The Pack leader?\"</p><p>Derik looked at the boy, really looked. That was pure hero worship, if he wasn't mistaken. And since he used to think of Michael's father in the exact same way, Derik completely understood where the kid was coming from. Men who took a Pack .. . ran a Pack .. . they were just.. . different. Morethere. And they could make you like them. It was a talent, the way some people could raise just one eyebrow. It was hard to explain.</p><p>\"Yeah, I live out there with those guys. Michael's my best friend.\" Was? Is?Save the world first, he reminded himself.Then you can worry about it. \"He's a really great guy, and his wife is supercool. You should try to get out to see him sometime.\"</p> <p>\"I'm going when I'm twenty.\" The age of consent, for werewolves. Eighteen was too damned young; everybody knew that. \"I'm going to see if he needs a bodyguard, or maybe Lara will.\" The boy hugged himself and smiled. \"I can't wait! I bet it's so cool, living in a mansion with all the boss weres.\"</p><p>\"It's pretty great,\" Derik admitted. And it had been, until he'd fucked it up. Until he'd gotten the idea in his head that he could be a boss were. Dumb ass. \"I'll put in a good word for you, if you want.\"</p><p>\"Would you?\" The boy's eyes, already big, went huge. \"That'd be great. Thanks a lot.\"</p><p>\"What do your folks think about your ambition?\"</p><p>\"Oh.\" The boy waved his parents away in the careless manner of preadolescents. \"Mom wants me to stay out here and go to USC. Dad says I should aspire to more than being a 'spear carrier,' that's what he calls it. But I don't care. They're doing whatthey like. Now it's my turn. I mean, it will be.\"</p><p>\"Well, while you're waiting to turn twenty, you could take a year or two of college, see if it suits you.\"</p><p>Terry shrugged.</p><p>\"Terry! Get out of there and let the man have some privacy.\"</p><p>Terry sniffed the air. \"Also, cookies are almost ready,\" he muttered.</p><p>\"And cookies are almost ready! So get out here!\"</p><p>Derik cracked up when the boy rolled his eyes and walked out, closing the door behind him. Jesus, had he ever been that young?</p><p>Sure he had; he and Michael and Moira had practically been littermates. Man, the shit they used to pull... it's a wonder Michael's mom hadn't drowned them all.</p><p>He picked up the phone and punched in the main number of the mansion.</p><p>\"Wyndham residence,\" Jeannie answered, sounding harassed.</p><p>\"Hey, Jeannie, it's me, D—\"</p><p>\"Lara! No! Don't you dare jump from there— don't you dare! Hello?\"</p><p>\"Uh, yeah, Jean, it's me, D—\"</p><p>\"Lara! I don't care if your dad does it all the time. Your dad's an idiot! And if you think I'm wasting my afternoon by driving you to the E.R.—hello?\"</p><p>\"It's Derik!\" he hollered. \"Can you patch me through to Antonia's house, please?\"</p><p>\"Jeez, stop with the yelling. Sure I will. How's it going? Save the world yet?\"</p><p>\"I'm gonna, just as soon as I finish my butterscotch chip cookie,\" he said dryly.</p><p>\"All righty. Patching you—Lara!—through now.\" There was a smooth, humming silence, then another ringing telephone.</p><p>\"Thatis Morgan Le Fay,\" Antonia said by way of greeting. \"She's an unspeakably evil creature and must be stopped from destroying the world. So get your ass back there and take care of her.\"</p><p>\"What? Antonia? How'd you know it was—\"</p><p>\"I don't know about you,\" she said, \"but I don't have a lot of time for dumb questions. Also, you're boring the tits right off of me.\"</p><p>\"Come on, you shouldsee this girl! There's no way she's the one. She's a goof, and she's so cute. Not to mention really clueless. I think you got your wires crossed, or whatever, on this one.\"</p><p>\"Impossible. It's her. And you know what they say about the devil and pleasing faces. Now get back there and do your job.\"</p><p>\"This sucks,\" he said to the empty line, and hung up.</p><p>\"Cookie?\" Marjie asked brightly when he stomped into the kitchen.</p><p>He took six.</p><p>Sara Gunn, the unspeakably evil creature, noticed the van as she was parking her leaner, but shrugged it off—Monterey wasn'tthat big a town, and lots of people went to and from the hospital. Monterey Bay General was a teaching hospital, the largest in two hundred miles, and the parking lot was the size of a small college campus.</p><p>She hurried through the main lobby, afraid to look at her watch to see how late she was. Dr. Cummings hated it when staff was late for grand rounds, though God knows he'd kept them waiting often enough. And even though she wasDr. Gunn, her doctorate was in nursing, so to old-school jerkoffs like Cummings, she was just a glorified maid with an extra diploma. Most days it slid off her like water off a duck, but days like today, when she knew she was in for a reaming and resented the hell out of it, she—</p><p>\"Sara Gunn!\"</p><p>She had been just about to step into the elevator when she heard her name and jerked her foot back. She turned, and her brain processed the half-dozen men dressed in—could it be?—flowing red robes. They had monks at the hospital now? Monks dressed in red? Like big lipsticks?</p><p>Armed monks?</p><p>An avid movie fan, Sara recognized nine-millimeter Beretta pistols when she saw them and wasso startled, she froze in place. It was the context, of course. Sure. Seeing men in robes (big lipsticks!), toting guns, in the hospital,her hospital, was just. . . weird. If she had any sense, she'd be screaming her head off and hitting the floor, like several of the people around her, but she just stared, and now she was staring down the barrel of more than one pistol, and how many people could saythat in life, that not only did they have one gun pointed at them, they had several, it was just too—</p><p>The one nearest her tripped on the newly mopped floor, knocking over the bright yellow CAUTION sign. He hit hard, too hard; she heard the wet snap as his neck broke.</p><p>She heard a muffled explosion from her left and flinched, but the pistol had misfired and the barrel imploded; the would-be gunman was screaming through a faceful of blood, screaming and staggering around and dripping. He'd lost all interest in her, and she could actually hear his blood pattering to the floor, which now needed to be mopped again.</p><p>The clip fell out of the third one's gun, something Sara had never seen before—a day for firsts! She didn't realize clipscould fall out of guns, just slide out and clunk to the floor without anyone touching it, but this one had, and the robed man had taken to his heels, and then the lobby tipped crazily, as someone kicked her feet out from under her.</p><p>\"Cross of Christ,\" Dr. Cummings grumped. He was lying on the floor beside her, and she realized he was the one who had knocked her down. His white beard, hair, and eyebrows were their usual chaotic mess; the eyebrows in particular resembled a pair of large, struggling, albino caterpillars. He looked like a pissed-off Colonel Sanders. \"Leave the hospital for fifteen minutes, and the whole damned place falls apart. Last time I ever try to get coffee before rounds.\"</p><p>\"Sorry I'm late,\" she said to the tile.</p><p>\"Do you know why they're trying to kill you?\"</p><p>\"I have no idea. They—they knew my name.\" She realized she was existing in a ball of shock-induced calm. Well, that was all right. It was better than the screaming meemies. \"But they're not having much luck, is the thing, and lucky for me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She heard a terrific explosion, magnified in the lobby, and then heard it again, and saw the last two men fall, and saw the policeman standing by the Information Desk, gun out, very pale.</p><p>\"Lucky for you,\" Dr. Cummings said, \"there was a cop here.\"</p><p>\"Uh-huh.\"</p> <p>\"Really lucky,\" he said, giving her a strange look.</p><p>\"I'm going to go throw up now, I think.\"</p><p>\"No you aren't. We're late for rounds.\" He seized her by the elbow—for a man in his late fifties, he was as strong as a PCP addict—and hauled her to her feet, then pushed her into the elevator. \"You can puke later.\"</p><p>\"I'll make a note of it in my Palm Pilot,\" she said, but already the urge was passing. Damn Dr. Cummings! Or bless him. She could never decide which.</p><p>7</p> <p>The pool boy was still there when she got home. He was sitting on her front steps, chin cupped in hand, obviously waiting for her.</p><p>Sara brought the convertible to a smoking halt, bolted out the door, and ran to him. She had no idea why he was still there—Couldn't get a ride? Had news about her car?—and she didn't care. After the morning she'd had, she needed to talk to someone, and Dr. Cummings wasn't what you'd call a warm and nurturing person. This walking Ken doll would do just fine.</p><p>\"You wouldn't believe it, youwouldn't believe it!\" she cried as he stood. She seized a fistful of his shirt and shook it. He stared down at her. \"A bunch of robed weirdos came to the hospital today and tried to kill me! There were guns all over the place!\"</p><p>\"I believe it,\" he said, nodding glumly.</p><p>\"And Iwas late for grand rounds! And then I had to talk to the police for, like, ever. And I have no idea why you're here, but I have to tell you, I'm going in for a drink before I do anything, but you can have your car back, and maybe I'll have two drinks, I—I—oh, crap.\" She was fumbling with her keys and finally got her kitchen door unlocked.</p><p>Wordlessly, he followed her inside. She was momentarily uneasy, then dismissed it. Lightning wasn't going to strike twice today, and, besides, she knew this guy. Sort of. At least, her mechanic knew him. She was pretty sure.</p> <p>\"You wouldn't believe it, you wouldn'tbelieve it,\" she babbled again, pawing through her freezer for the bottle of Grey Goose vodka. A screwdriver—light on the O.J.—was just what she needed. Possibly more than one. Possibly half a dozen. \"What a crazy day! Even saying 'crazy day' doesn't do it justice—\"</p><p>\"Wait.\" At his command, she fell (uncharacteristically) silent. \"You're Sara Gunn?\"</p><p>\"What? Of course I am. You know who I am. Yes. Am I out of ice? Oh, who cares. I'll drink it neat, if I have to ... is vodka good with vanilla ice cream?\"</p><p>\"Sara Gunn of6 Fairy Lane?\"</p><p>\"Yes. We've beenover this.\" He was so beautiful, and so, so dumb. It wasn't fair. Like she neededthis, today of all days. \"Now, d'you want a drink? Because I'm having one. Or do you need a ride? Am I supposed to keep the blue one? It's a nice car and all, but not really my style. Although frankly, the day I've had, I don't give a shit either way.\" Belatedly, she remembered her manners. \"I'll call the garage for you and have someone come pick you up. Okeydokey?\"</p><p>He scowled at her, his gorgeous green eyes narrowing until they looked like pissed-off lasers. \"D'you think you can ramp down the condescension a little bit, Miss Gunn? I get enough of that from my friend Moira.\"</p><p>\"Doctor Gunn,\" she said automatically, even as she blushed. \"Sorry,\" she added. \"It's just that you seemed .. . confused. Even more than me.</p><p>And that's saying something.\" She reached for the phone. \"I'll call the garage.\"</p> <p>He took the phone out of her hand, moving so quickly she didn'trealize he'd taken it, until she saw he was holding the cordless.</p><p>Odd. Odd! One second he'd been standing by the kitchen door, the next he wasright in front of her. It was like watching a home movie, speeded up. Had she started drinking already?</p><p>He made a fist, still holding the phone, and then small pieces of plastic were raining down on her tile.</p><p>\"I'm really, really sorry about this,\" he said dully. \"It won't hurt. Just stand still.\"</p><p>\"Whatwon't hurt?\"</p><p>His hands reached for her throat.</p><p>8</p><p>At the last second, she wriggled out of his grip like a greased fish and kicked his shin pretty hard for a human. It actually hurt. \"What iswrong with you?\" she screeched. Her eyes were starry and wild. She reeked of tension and stress and fury. \"Has everyone in this town gone completely nutso bonkers today?\"</p><p>\"Sort of.\" He took another swipe at her—if he could get his hands around her neck, he could end it in about half a second for her—she'd be in Heaven before she heard the snap. She ducked, and his hands closed on air. \"It doesn't really matter. I'm so sorry. But I have to do this.</p><p>You're—I guess you're pretty dangerous. Sorry,\" he added lamely.</p><p>\"Jerkoff, you have no idea! Now get the hell out of my house!\" She snatched a statuette from the shelf by her head, and he ducked, but not fast enough—the five-inch-high Precious Moments figurine hit his forehead just above his right eye and exploded. By the time he shook the chips out of his hair and wiped the blood off his brow, she had darted down the hallway.</p><p>Grimly, he plodded after her. He didn't much like killing—heck, he'd only killed two people in his entire life, and they'd both been rogue werewolves. That had been a totally different thing, not even in the same universe as what he was attempting now. He'd been defending the Pack then, and that was entirely different from snapping this poor girl's neck.</p><p>This is defending the Pack, too, buddy. You'd better believe it. Now get your head in the game!</p><p>He tried. He really did. He understood intellectually that this sort of thing went against his even-tempered grain. He also understood that this woman was a threat to his family, his entire way of life. Intellectually. But he wasn't angry at her, he wasn't scared of her, she wasn't fucking somebody dangerous, he wasn't defending territory, he wasn't feeling any of the things he needed to feel in order to be okay with breaking a person's neck.</p><p>Not to mention, Sara Gunn was a stone cutie. He really liked her, even on such short acquaintance. He liked her sass, he liked her scatterbrained good humor, and heloved the way she smelled: like roses wrapped in cotton. Since she was a doctor, he figured she was the comely female embodiment of the absentminded professor, which was cute all in itself. Another time and place, and he'd be tempted to charm her into getting a nice hotel room for the day and ...</p><p>He caught up with her in the hallway, but she tripped as he reached for her neck, and he missed again. Well, of course he did. His heart was so completely not in this, it would have been funny if it wasn't so fucking depressing.</p><p>She kicked out at him from the floor and scrambled away. He reached again, and this timehe tripped, falling hard enough to rattle his teeth.</p><p>Christ, will you geton?Stop drawing this out! Bad enough you have to kill her, you've got toplay cat and mouse first? Scare her worse than she is? Asshole.</p><p>Except she wasn't so much scared as infuriated. Oh, he could smell the fear, an undercurrent beneath her rage, but she was primarily pissed. He really liked her for it. Any other woman-person!—would have been gibbering in the corner and begging for their life.</p><p>He climbed to his feet—only to be hit in the face with a box of tampons. The white missiles exploded out of the box and rained down on the floor.</p><p>\"Get. . .lost!\" she shrieked, hurling a perfume bottle at him. This time he did duck, and the bottle shattered behind him. Instantly the hallway reeked of lavender, and he sneezed.</p><p>\"Out!\"</p><p>\"I can't,\" he said, then sneezed again. \"You know, if you just stand still a minute, it'll be over in—\"</p><p>\"Fuck you!\"</p><p>\"Right. Well, that's understandable. I mean, I wouldn't stand still for this, either. It's okay,\" he added soothingly, if inanely. What, exactly, was okay? Nothing. Not a single goddamned thing.</p><p>He followed her into a bedroom and was momentarily startled at the sheer mess—it looked like someone had been killed in there. Then he realized that she was just a slob. There were clothes on almost every surface, and he couldn't tell what color the carpet was because of all the junk on the floor.</p><p>There were plenty of things to throw, too, and her aim was frightening—he was fast, but in her terror and anger, she was just a bit faster, raining missiles on him and shrieking like a fire alarm. He ducked about every two out of three, but that still left him vulnerable to: a jar of Noxema, an empty vase that smelled like stale water and dead flowers, a DVD case(Vertigo), a remote control, an empty box of Godiva chocolates, a box of computer discs, a hardcover copy of Stephen King'sThe Stand —cripes, how much didthat weigh?</p><p>Have you noticed you haven't been able to kill her? Sure, you're phoning it in, but come on—you're a werewolf in your prime. So how come she's not a corpse*.</p><p>His inner voice sounded weirdly like Michael, which made him inclined to ignore it. Normally.</p><p>But he realized—on the top of his mind this time, not just the bottom—that it was true. He hadn't been able to kill her. Every time he got close, she tripped, or he did, or she scored with another missile. His head was throbbing, and it was hard to think.</p><p>Still, she should have been toast about three minutes ago.</p><p>Okay, that was it. No more fooling around. She was treed on top of her dresser, which was bare of things to throw at the moment—she'd run out of ammo, finally. Instead of cowering, she crouched on it like a cat, one with several swipes left in its paws.</p><p>\"You son of a bitch,\" she rasped, hoarse from all the screaming hysterics. \"I haven't done a single thing to deserve this—\"</p><p>\"Well, not yet,\" he said.</p><p>\"—and now look at this mess! Worse than usual! My house is a wreck, there's a tear in my skirt, there's dead bodies all over my workplace, and my crazy blond stud of a mechanic's helper is trying to kill me! Son of a bitch!\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's been a bad day for both of us,\" he admitted. Then, \"Blond stud?\" He was absurdly flattered.</p><p>\"Fuck you! I want you to get lost andleave me the hell alone!\"</p><p>She had screamed that last part, shrieked it, roared it. Her fury was intense, overwhelming— he couldn't get the smell of burning cedar out of his nose—it was practically choking him.</p> <p>Suddenly, startlingly, the pain in his head intensified—cripes, it felt like his skull was splitting!—and he started to get dizzy for the first time in his life. It was extremely unpleasant. But before he could complain, or explain, everything got dark around the edges, and the room tilted, and then he didn't know anything, anything at all.</p><p>9</p><p>More exhilarated than frightened, Sara finished taping Psycho Jerkoff to her kitchen chair with her last roll of electrician's tape (a must for any single woman's toolbox). Then she stood back, looked at him for a long minute, and went to get her bag.</p><p>She supposed she should find a phone and call 911, but she wasn't too worried about what's-his-face getting out of that chair. In fact, she wondered if he'd ever get up again ... he was the color of kitchen plaster, and his body had a loose, boneless feel she didn't like at all.</p><p>She found her bag, shook the dirt off it, stepped over the spilled planter, and returned to the kitchen. She briefly wished for a cell phone— she kept losing the fucking things, and she was paying for it now—and bent to Psycho Jerkoff. She peeled up one of his eyelids and grimaced— blown pupil.Really blown . .. the thing looked like a burst pumpkin, all brownish orange leaks. The sclera was shot with red threads, and his breathing was gasping, agonal.</p> <p>What had she done to him? Was it like the rapist who was waiting—</p><p>But she wouldn't think about that now. What happened back then wasn't relevant to this poor fucker ... he was dying before her eyes. He had tried to kill her, but that didn't mean she wanted him to go toes-up in her kitchen. Poor dumb ass. Even his eye was—</p><p>Actually, it looked a little better. Less red, and the pupil seemed to be ... shrinking? Shrinking and pulling back, and the red was pulling back, too, disappearing, and then his perfectly whole pupil wasfixed on her, and he shifted his weight, and she stumbled backward so fast she tripped over another chair and went sprawling.</p><p>10</p><p>\"Well,\" Derik said, waking up. \"That was embarrassing.\"</p><p>She scuttled back from him, startled. He blinked down at her. What was she doing on the floor?</p> <p>\"What are you doing on the—\"</p><p>\"That wasfast,\" she said, almost gasped. \"One minute you were out cold, and the next—\"</p><p>\"I'm a quick healer.\" He started to get up, then realized he couldn't. He was—for crying out loud! \"You've taped me,\" he observed. \"Taped me to one of your kitchen chairs. That's a new one.\"</p><p>\"Electrician's tape,\" she said, gesturing to the depleted rolls on the counter. \"A must for every household. Now go back to sleep so I can call the cops, you psychotic freak.\"</p><p>He wriggled. He could get loose, but it would take some time. She was fiendish in her cleverness! Tapewas tough, and he sure couldn't untie it.</p><p>\"You might not believe this,\" he said, \"but I'm sort of glad.\" And he was! He hadn't been able to kill her. She was alive, and pissed, and he was actually kind of happy about it, and relieved. It was strange, and probably stupid, but right now he didn't care. \"Sorry about the mess in your house.\"</p><p>\"Oh, shut up. Listen, you were really screwed up. How, how did you get better?\" she burst out. It was as if she'd been dying to ask the question. \"You had a blown pupil—do you know what that means?\"</p><p>\"Well,\" he said, \"it doesn't sound very nice.\"</p> <p>\"You got that right. It's indicative of an aneurysm, get it? Brain bleed? Nothing good, in other words. But you got better while I watched. Which is impossible.\"</p><p>\"About as impossible as you still walking around alive. And I told you, I'm a quick healer. Got anything to eat around here?\"</p><p>\"I'm supposed to feed you now? After you tried to kill me?\"</p><p>\"I'm hungry,\" he whined.</p><p>\"Tell it to the judge.\" She reached for the phone, found it gone, then spotted the pieces of the handset all over the floor. \"Damn it! I forgot about that. You're buying me a new phone, buster. And a new everything else we broke!\" She knew, justknew, she would regret lending her bedroom phone to one of her former patients. Rose was a sweetie, but lending never meant lending, it always meant giving, and that was just—</p><p>\"Sure, okay. Hey, listen, I've got to tell you something.\" Man oh man, Antonia wouldnot be pleased. Neither would Michael. Fuck it. \"I was sent on a mission to kill you.\" \"</p><p>\"I gathered,\" she said dryly, \"judging from all the murder attempts.\"</p><p>\"No, I mean, my family sent me here. Specifically, to you. Because you're fated to destroy the world. And it's my job to stop you. Except I couldn't.\"</p><p>\"Andyou're fated for a Thorazine drip, as soon as the nice men in the white coats come.\" But she looked troubled, as if she was hearing a voice in a distant room, one that agreed with him completely. \"And I—I might have been wrong about your eyes. In fact, after the day I've had, a misdiagnosis wouldn't surprise me at all.\"</p><p>\"Sure,\" he sneered back. \"Because you make themall the time.\" This was a guess, but he figured Dr. Sara Gunn didn't get where she was by being a fuckup.</p><p>\"Never mind. Now: \"What the hell did I do with my old phone?\" she mused aloud, running her fingers through her red, red hair. It kept wanting to flop in her face, and she kept tossing it back with jerks of her head. It was the brightest thing in the room; he could hardly take his eyes off it. Off her. \"Did I throw it out? I don't think I did ... I never throw anything out, if I can help it... soon as you throw it out you need it again ... stupid thing.\"</p><p>\"Listen to me. I'm not crazy, though I totally understand why you think I might be.\"</p><p>\"Do ya?\" she asked with faux brightness.</p><p>\"I couldn't kill you. Get it? Never mind that I think my so-called sacred mission bites the bag; I was trying to kill you, and I couldn't do it. Don't you think that's a little bit weird?\"</p><p>\"No, I thinkyou're a little bit weird.\" But she frowned.</p><p>\"Hasn't stuff like this happened to you before? Weird days? Strangers popping up out of nowhere trying to do you harm? I can't believe my family's the only one who knows about you,\"</p><p>\"This is California,\" she said, looking more than troubled; looking vaguely alarmed. \"Weird stuff happens all the time out here. And it's not even an election year.\"</p><p>\"Yeah, California, not the Twilight Zone.\" He wriggled more and the tape pulled at his arm hairs. \"Ow!\"</p><p>\"Well, sit still.\"</p><p>\"And starve to death? Forget it.\"</p><p>\"Oh, for Pete's sake. How long have you gone without a meal?\"</p><p>\"Two hours.\"</p><p>\"An eternity, I'm sure.\"</p><p>\"Fast metabolism. Come on, you have to havesomething around here.\"</p><p>\"Buddy, you have got some nerve.\" She sounded almost. . . admiring? But she still looked pissed. Not that he could blame her. \"Weird stuff... you probably said that because you were in on it.\"</p><p>\"In on what?\"</p><p>\"Oh, like you don't know!\"</p><p>\"Idon't know,\" he said patiently. \"What are you talking about?\"</p><p>\"You don't know about the team of red-robed weirdos who tried to kill me at work.\" She said this with total skepticism.</p><p>\"No, but I can't say I'm surprised. See, you're the bad guy.\"</p><p>\"I'mthe bad guy?\"</p><p>\"Yup. In fact, you're fated to destroy the world.\"</p><p>She touched her chest, looking flabbergasted. \"I am?\"</p><p>\"Yup. That's why I was sent to make you take a dirt nap, so to speak. And I bet the crack team of weirdos was sent to do the same thing. So you should do three things: Feed me, untie me, and get the hell out of this house.\"</p><p>She stared at him.</p><p>\"Don't think you have to do it in that order, either,\" he added, wriggling again. Fucking tape! Why couldn't she use plain old rope, like his ex-girlfriend?</p><p>\"That's it,\" she finally said. \"I'm calling the police. Right now.\" But she didn't move, and he could smell that she didn't mean it. She was too confused and curious.</p><p>\"Okay, Morgan. Fetch the fuzz.\"</p><p>\"What did you call me?\"</p><p>\"Morgan. It's your other name.\"</p><p>\"I think I would know if I had another name.\"</p><p>\"Obviously, you don't.\"</p><p>\"Oh, piss off!\" she snapped, which almost made him laugh. \"I've had about enough of this 'mysterious stranger trying to kill me and then being all cryptic' garbage. Spit it out.\"</p><p>\"Okay. You're the reincarnation of Morgan Le Fay.\"</p><p>She threw up her hands. \"Oh, please! That's the best you could do?\"</p><p>He shrugged, as much as he could mummified in tape as he was. \"It's the truth. You're a bad witch, back to wreck the world. Sorry.\"</p><p>\"First of all, Morgan Le Fay wasn't necessarily bad. Second—\"</p><p>\"How do you know that?\"</p><p>\"I did some papers on her in college. Second—\"</p><p>\"Uh-huh. Of all the people in the world, living and dead, you picked her. I bet your minor in college had something to do with her.\"</p><p>\"Lots of people minor in European history. And as for picking Le Fay for a research topic— me and about a zillion other people through the ages,\" she said, but again looked vaguely troubled, as if listening to something he couldn't hear. Which with his hearing was impossible, frankly. \"Tell me, the place where you live . . . are there a lot of doctors there? And little cups of pills?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Very funny, Morgan.\"</p><p>\"Don't call me that,\" she said automatically, but with no real heat.</p><p>\"Look, at least consider the possibility. I mean, why would I come here? I live in Massachusetts, for Christ's sake, but I come all the way across the country just to wreckyour house?\"</p> <p>\"That's the theory I was going with, yes,\" she admitted.</p><p>\"Pretty shaky,\" he told her. \"And today not only am I here, but another group of killers? Would-be killers, I mean? And what happened to them? How come you're not dead? You avoided meand them?\"</p><p>\"We haven't established that you're not one of them,\" she pointed out. \"And they ran into some bad luck.\"</p><p>\"Yeah, I'll bet. I'll bet that happens a lot around you.\"</p><p>\"Well...\" Her brow knitted, and she looked severely cute as she pondered. Her blue eyes narrowed and her forehead wrinkled. \"I've always been lucky . . . but I don't think that proves anything.\"</p> <p>\"Since we're going to talk for a while—which I'm totally fine with, so don't sweat it—do you have an apple, or maybe you could fix me a PB&amp;J, or something?\"</p><p>\"Again with the food! You've got a lot of nerve, anybody ever tell you that?\"</p><p>\"Pretty much every day, back home. So, do you?\"</p><p>\"I don't believe this,\" she muttered but, praise God, she turned to the counter, plucked an apple out of the bowl, grabbed a knife out of the rack, and rapidly cut the fruit into bite-sized pieces.</p><p>She stomped over to him and stuffed three chunks into his mouth.</p><p>\"Fgggs,\" he said.</p> <p>\"You're welcome. So somebody sent you here to kill me because I'm the reincarnation of Morgan Le Fay, that's what you're telling me.\" He didn't answer because it wasn't an actual question. \"And other people are also out to get me, because of this.\" He nodded, still chewing. \"So I shouldn't call the cops, I should leave.\"</p><p>\"With me,\" he said, swallowing.</p><p>\"Oh, that'srich.\"</p><p>\"I figure there's more to this than meets the eye, y'know? So we should take off and see if we can see what's what.\"</p><p>She was cutting up another apple in rapid, angry motions, and he eyed the knife a little nervously; if she got pissed enough to plant it in his eye, he'd probably never howl at the moon again. He was a fast healer, but there was some brain damage that couldn't be fixed, no matter how close the full moon was.</p><p>\"See what's what,\" she repeated. \"Yeah, sure. Let's get right on that.\" She jammed a few more pieces into his mouth and, although eating cut-up apples had never seemed particularly erotic to him before, the smell of her and the touch of her skin on his lips was starting to, um, cause him a little problem. Okay, a big problem.</p><p>He shifted in the chair and wished he could cross his legs. \"Look, you get kind of weirded out whenever I suggest that there's maybe more to you than meets the eye,\" he said around a mouthful of apple. \"So why don't you tell me? What happened before today? How come you're so lucky?\"</p><p>\"I don'tknow. I just am. I always have been. My mom used to call me her lucky break.\"</p> <p>\"Oh yeah? Where is she now?'</p><p>\"She's dead.\"</p><p>\"Oh. Sorry. Mine, too.\"</p><p>\"Gosh, we've got all kinds of things in common,\" she said, rolling her eyes and shoving another chunk of apple between his lips.</p><p>\"Meant to be, I guess,\" he said, chomping.</p><p>\"Okay, so, I won the lottery. A couple of times,\" she said grudgingly.</p><p>\"Youwhat?\" He knew she wasn't lying, but it was still surprising. \"More than once?\"</p><p>\"I tend to get... windfalls . .. whenever I'm short of money. And once I needed a few thousand to pay for the last quarter of school, and I won the lottery, and it was exactly the amount I needed. And I got a refund one year when I needed some extra money to—but everybody gets tax refunds.\"</p><p>\"Yeah, but I've never even met one person who won the lottery, never mind won it twice.\"</p><p>\"Four times,\" she muttered.</p><p>\"Oh, for fuck's sake! And you're giving me shit like I'm crazy?\"</p><p>\"It doesn't mean anything,\" she insisted.</p><p>\"Okay, Morgan—\"</p><p>\"Quit that!\"</p><p>\"—maybe you can explain how, at the exact moment you needed to get me out of the way, I get a freakin'brain aneurysm, how about that?\"</p><p>\"A happy coincidence?\" she guessed.</p><p>\"For Christ's sake.\"</p><p>\"Actually,\" she said, clearing her throat, \"there was a serial rapist in this area a couple years ago. And, um, he got in somehow while I was at school, but when I came home I found him dead in my kitchen.\"</p><p>\"Brutally stabbed?\"</p><p>\"No, um, the autopsy showed he had a congenital heart defect, a minor one that shouldn't have given him any trouble, but for some reason, while he was waiting here to—to—well, he had an M.I. and died.\"</p><p>\"What's an M.I.?\"</p><p>\"Myocardial infarction. Heart attack,\" she said impatiently.</p><p>He gaped at her. \"Holy shit, I'm lucky to be alive!\"</p><p>\"Well, you really kind of are.\" She poked another piece of apple in his mouth. \"Let the record show I still think you're nuts. Also, once when I overslept and missed the bus, it crashed, and half the people aboard were killed.\"</p><p>\"Jesus Christ!\" It was all he could say. This was worse—and cooler—than he had ever dreamed. \"That's it, that's your magic. You're phenomenally fucking lucky.All the time.\"</p><p>\"There's no such thing as magic.\" But that species of hellish doubt was on her face again. \"Everybody's lucky.\"</p><p>\"Sara, for God's sake. Listen to yourself.\"</p><p>\"The team at the hospital...\"</p><p>\"Don't tell me, let me guess. They were like the Three Stooges—or however many of them there were. Knocking heads, falling down, having heart attacks on the spot... and you walked away without a scratch.\"</p><p>\"That might be true ...\"</p><p>\"We should go clubbing some night.\"</p><p>She laughed unwillingly. \"Sure we should. I'm sure the police will let you out in no time.\"</p><p>\"Oh, come on! After all this, you're still calling the cops on me? We should get out of here!\"</p><p>\"Youdid try to kill me,\" she reminded him— like he needed it! He'd never live it down. Derik Gardner, badass werewolf, totally unable to kill a nurse. A nurse with a doctorate, but still. \"And I've only got your word that you're not going to try again.\"</p><p>\"Well, my word's good,\" he grumped. Of course, she couldn'tknow that. Not like another Pack member would know it. It made everything harder. Which was kind of cool. Yet aggravating. \"And like I said, there's more to this than what we can smell. I think—\"</p><p>\"Than what we cansmell}'\"</p><p>\"Never mind. Look, let's do some digging, okay?\"</p><p>\"Okay!\" she said with fake enthusiasm. \"Do you want to be Nancy Drew or a Hardy Boy?\"</p><p>He ignored the sarcasm . .. he'd had years of practice with Moira. \"Let's find out what exactly you're supposed to do. I mean, you don't want to destroy the world, right?\"</p><p>\"This is the most surreal conversation I've ever had,\" she commented. \"And no. Duh.\"</p><p>\"So how come anybody who can see the future—I assume that's how the bad guys knew to come after you—says you're gonna do just that? Huh? Don't you think that's weird? Huh?\"</p><p>\"That's not the only thing I think is weird.\"</p><p>\"Then hold on to your hat, sunshine.\"</p><p>She eyed him warily. \"What? I'm not really up to more surreal revelations ...\"</p><p>\"I'm a werewolf.\"</p><p>\"Damn it! What did I justsay?\"</p><p>11</p><p>\"I'm a werewolf,\" the gorgeous nut job said again. He shifted in the chair and winced. She suspected he was sore ... certainly there was plenty of dried blood on his forehead and speckled all over his shirt. She felt sorry for him and stomped on the emotion. \"Soon to be a hairless one, but there you go.\"</p><p>\"Whine much? Try getting a bikini wax.\"</p><p>\"I'll pass.\"</p><p>\"Look, one thing at a time, all right?\" Sara tried not to show how rattled she was. She suspected she was fighting a losing battle. As if her day hadn't been upsetting enough, she was actually turned on by hand-feeding Hunka Hunka Burning Looney. She could feel the stubble on his chin when she popped more apple slices into his mouth, could feel the warmth of his face, smell the apple sweetness of his breath, could(I could do anything to him, anything at all.)</p><p>feel his ... his ...</p><p>(He couldn't stop me. He's tied up. I could sit on his lap and do...do anything...)</p><p>Aw, nuts. His lips were moving. More nonsense about(the true you)</p><p>Morgan Le Fay, no doubt.</p><p>\"What?\" she asked.</p><p>\"I said,one of my Pack members told me what you were going to do, and my—my boss, I guess you'd call him, he sent me here to take care of you. And not in a good way, F.Y.I.\"</p><p>\"Sounds like a real prince,\" she muttered, trying not to stare at his mouth.</p><p>Derik shrugged. \"More like a king, actually, and he's okay. He's my best friend, so I had to leave before I killed him.\"</p><p>\"Oh yeah?\"</p><p>\"Yeah. I mean, I couldn't imagine anything worse than killing a friend.\"</p><p>\"That's pretty bad,\" she admitted, wondering when she'd checked her sanity at the door. This was definitely the most surreal conversation she'd had in ... ever. \"It's probably just as well you left town to kill me instead.\"</p><p>\"To try to kill you,\" he corrected. Then he grinned, showing many teeth. It was so startling—a white flash, and cripes, those chompers lookedsharp —that she nearly took a step back. \"And I like you, too, by the way,\" he added, which made no sense, but who cared? \"You are, in case nobody's told you, extremely cute. Are you a natural redhead? You are, aren't you?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Never mind,\" she said severely. \"I'm going in the back room now, to call the police. You're extremely confused, if gorgeous, and I... have had .. . enough.\"</p><p>\"Oh, me, too,\" he assured her. \"I don't think I've been less comfortable in my life. So if you don't mind . . . and even if you do ...\" Then he did something like an all-over shrug, and she heard tearing tape, and then he—he was standing up!</p><p>One more time: He was standing up! \"Gah,\" she said, or something like it. How had he—how had he torn through all that—and the arm of the chair was broken, too, which was weird, and—</p> <p>He was grabbing her! Well, reaching for her.</p><p>Taking her by the arms \"Gah!\" and pulling her into a snug embrace \"Gah!\"</p><p>and bending his head toward hers \"Ga—mmph!\"</p><p>and then his mouth was on hers, moving deli-ciously across hers, and she was grabbing his shoulders to, um, push him away, okay, she was going with that, yeah, pushing him away, except now she was up on her tiptoes, the better to fit against him, and he smelled delicious, he smelled like the woods in springtime, and his mouth, oh God, his mouth was warm, and his breath was redolent of apples and ... and ...</p><p>He'd broken the kiss and was standing three feet away from her. She'd never seen him move. She'd blinked, and he was done. Her mind tried to process his speed and couldn't do it. Just... couldn't.</p> <p>\"Sorry,\" he said cheerfully. \"Wanted to dothat for oh, about the last four hours. Now it's out of my system. Okay, maybe not. So! What's next, sunshine?\"</p><p>\"Gah?\" she asked, raising a trembling hand to her mouth.</p><p>\"I think we should put our, um, heads together and figure out what's what.\"</p><p>\"You'renot a werewolf,\" she said, because it was the only thing she could think of.</p><p>He sighed and walked into her living room, squatted, picked up her couch, stood, and held it in one hand, in much the same way she would hold a tray. Fortunately, she had vaulted ceilings.</p><p>\"You're not gonna make me juggle it, are you?\" He tossed her couch a foot in the air, caught it, tossed it again. \"I don't think I have enough room.\"</p> <p>\"So you work out,\" she said through numb lips. \"That doesn't mean you—you—you know.\"</p><p>\"Get fuzzy and bark at the moon one night a month?\"</p><p>\"Well. . .\"</p><p>\"Look, I believedyou're a hideously dangerous sorceress fated to destroy the world.\"</p><p>\"Don't do me any favors,\" she snapped. \"And put that thing down.\"</p><p>\"Say it,\" he sang. He wasn't even out of breath!</p><p>\"Just put it down, and we'll talk some more, okay?\"</p><p>\"Saaaaaaaay it...\"</p> <p>\"Fine, fine! You're a werewolf, and I'm a demented sorceress. Now let go of my couch,\" she begged.</p><p>\"Okay.\" He carefully put it back where he'd found it. \"So, now what?\"</p><p>\"Well, I'm not going to destroy the world, I'll tell you that right now.\" She crossed her arms in front of her chest. It was easier to be brave-sound brave, anyway—when he was all the way across the room.</p><p>\"Works for me. How about another kiss? No? Spoilsport.\"</p><p>\"You're really weird,\" she informed him.</p><p>\"That's what they tell me.\" He was weirdly cheerful. He was, in fact, the smilingest guy she'd ever known. Maybe he was mildly retarded.</p><p>\" 'They' being . .. ?\"</p><p>\"My Pack.\"</p><p>\"Your pack.\"</p><p>\"Uppercase P.\"</p><p>\"Mmm. Of werewolves, right?\"</p><p>\"Yup.\"</p><p>\"Who sent you out here to stop me from destroying the world.\"</p><p>\"Yup.\"</p><p>\"But you're not going to kill me.\"</p><p>\"Well...\" He spread his hands apologetically. \"I couldn't, first of all. I mean, really couldn't. I felt bad about it, but I was gonna do it, don't get me wrong. But... I didn't. And in case no one's ever told you, an aneurysm hurts like a bastard.\"</p><p>\"Thanks for the tip.\"</p><p>\"So I figure, we team up, figure out who thereal bad guys are, and save the world.\"</p><p>\"But what ifyou're the real bad guy?\"</p><p>\"Well, I know it's not me. And you were pretty upset about something when you showed up. I'm betting you've met the real bad guys. So, I'll help you get 'em.\"</p><p>\"Why?\" she asked suspiciously.</p><p>\"Well. It'll help me both personally and professionally, see, because I've kinda wanted to be on my own, and I figure this is the chance to show what I can do. Just. . . don't blow up the planet in the meantime, okay? I'd never live it down. I mean—how totally embarrassing.\"</p><p>\"Team up?\" Why was the idea as exciting as it was frightening? \"Like that, eh?\"</p><p>He smiled at her and, oddly, the expression wasn't startling. Maybe because he wasn't showing so many teeth. \"Like that. So, what do you say?\"</p><p>\"I say we're both nuts.\" She pressed the heel of her hand to her forehead. \"I can't believe I'm considering this. I can't believe I'mnot calling the police. I can't believe ...\"</p><p>\"What?\"</p><p>\"Never mind.\"</p><p>\"Oh, that? Don't worry aboutthat. I told you, I like you, too.\"</p><p>\"Swell,\" she muttered.</p><p>12</p><p>\"I wish you wouldn't do that.\"</p><p>\"Sorry.\" He pulled back so his head was inside the car. \"Can't help it. This place smellsgreat.\"</p><p>\"Look, it's weird enough that you stick your head out of the car like a big—well, you know. But do you have to do it while you're driving?\"</p><p>\"No,\" he sulked.</p><p>\"Take a left at the light.\"</p><p>He did, and Monterey Bay General loomed before them. Sara stared at the brick building. It was completely perfect that they should show up here first. MB General had been her home forever. She'd learned there, worked there, fallen in love there, worked there, got dumped there, slept there, worked there, been forged there, worked there, found out she was an orphan there, grown up there.</p><p>Found a father there.</p><p>Well, at least Derik hadn't tried to kill her. Again.</p><p>\"I forgot,\" she said abruptly. \"What's your last name?\"</p><p>\"Gardner.\"</p><p>\"Oh.\" That sounded almost.. . normal. Safe and normal. \"Okay. So, I guess you already know my name.\"</p><p>\"Yup.\"</p><p>\"Of course,\" she muttered. Stupid! He'd only told her the whole silly story, and more than once. Maybe she couldn't retain the facts because she couldn't swallow them. Frankly, she still wasn't sure if she was buying into this whole \"you're doomed to destroy the world\" thing, but at the very least, it was more interesting than hanging out in her mechanic's garage.</p><p>\"You okay?\" he asked. \"You look like you're about to jump out of the car.\" He parked. \"Which you totally shouldn't do. I mean, you guys are mega-fragile. I don't know how you walk around in those breakable bodies of yours.\"</p><p>\"You kind of get in the habit of it, if you're born in one of those bodies.\"</p><p>\"Poor thing.\" He shook his head.</p><p>\"Never mind.\"</p><p>\"Okay,\" she said nervously. \"We're gonna go find Dr. Cummings. He's kind of like my mentor. He and my mom were good friends, and he took care of me after she—after she died. He knew a lot of stuff about my family that he would never talk about, and he—he's always been good in a crisis.\" More like completely unruffled, all the time. And hadn't he recovered awfully quickly from the morning attack? He'd been more annoyed than scared . . . not a typical reaction. Except from him. But it was enough to make her wonder. \"Anyway, we'll find him and see what he has to say, and maybe figure out where to go from there. Okay? Is that okay?\"</p><p>\"You're the killer sorceress,\" he said easily. \"I guess we'll go wherever you say.\"</p><p>\"Knock that off, or no Milk Bones for you tonight.\"</p><p>He groaned, which caused several female heads to swivel in their direction. Derik was slightly larger than life . .. hell, he was slightly larger than his T-shirt, which bulged and rippled in interesting directions. He was by far the largest man in the hospital lobby. Possibly in the hospital. Or the city. \"Don't start with the dog jokes, okay?\"</p><p>\"That depends on you,\" she said smugly. \"Now come on. Dr. Cummings is probably in his office.\"</p><p>\"What's he look like?\"</p><p>\"Like an angry Colonel Sanders.\"</p><p>Derik snorted. \"Does he have white hair and a white beard? And does he eat tons of Corn Nuts?\"</p><p>She stared at him and almost didn't get into the elevator. Sheer momentum carried her to his side. \"Have you been following me?\"</p><p>He looked at her curiously. \"That's gonna make you mad? That's worse than trying to kill your ''People have tried that before. I'm almost used to it. But I fuckingbate being followed,\" she snapped. \"It's sneaky and dishonest and nasty.\"</p><p>\"Take it easy!\" He threw his hands in the air. \"Seriously, Sara, don't get mad, okay? Just caaalm down. I wasn't following you. I can smell this Dr. Cummings guy on you, that's all.\"</p><p>\"That'sall?\" She stabbed the button for the fifth floor. Derik's slight panic was sort of amusing. It was nice to have the upper hand with someone so good-looking. And she knew, she justknew, he was one of Those Guys. Every woman in the lobby had been staring at him, and he hadn't even noticed. One of Those Guys never had a clue how great-looking they were. It was annoying. No, it was nice. No, it was annoying.</p><p>\"He must have hugged you or grabbed you or something. There's a couple of white hairs on your left shoulder. I mean, you got a nose like mine, you don't have to follow anybody. So mellow out, okay?\"</p><p>\"Dr. Cummings knocked me down in the lobby,\" she admitted. \"He was kind of pissed.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Derik frowned. \"At you?\"</p><p>\"No, about the killers making us late for grand rounds.\"</p><p>\"Seriously?\"</p> <p>\"Yes.\"</p><p>\"Huh. Yeah, we better go talk to this guy. Shit, maybe we can recruit him.\"</p><p>\"I'm sure,\" she said dryly, walking the Gauntlet—what everyone called the fifth floor physicians' offices—while Derik fell into step beside her, \"that he'd be thrilled.\"</p><p>She stopped outside Cummings's office and raised a hand to knock.</p><p>\"That door says Dr. Michaels,\" Derik pointed out.</p> <p>\"Mmm. It's one of the many ways Dr. Cum-mings tries to ensure interns don't bug him.\"</p><p>She rapped twice.</p><p>\"Go away, or I'll have you fired!\"</p><p>\"That's another one,\" she explained, and opened the door.</p><p>\"Oh, wonderful, it's Dr. Nurse Gunn. Or is it Nurse Gunn, Doctor? Don't let the door crush your tiny head on the way out.\"</p><p>\"This man here,\" Sara said, indicating Derik, who was openly fascinated by Dr. Cummings's fuzzy eyebrows, \"tells me I'm Morgan Le Fay.\"</p> <p>Dr. Cummings grunted and started pawing through the pile of last year'sLancet.</p><p>\"And that he was sent to kill me so I wouldn't destroy the world.\"</p><p>Dr. Cummings found the issue he wanted and settled back in his chair. He grunted again, an invitation for Sara to keep speaking.</p><p>\"And I was wondering,\" she continued, feeling foolish, \"what you might have to say about that.\"</p><p>\"I'm surprised the boy's still alive,\" Dr. Cummings said, not looking up from the magazine. \"And disappointed, I might add. I don't have anything to say beyond that, Your Highness.\"</p><p>She blinked. Thought that over. Started to speak. Changed her mind. Changed her mind again. Said: \"Your Highness?\"</p><p>\"Well. Youare the sister of a king. A centuries-dead king, but there you go.\"</p><p>\"Oh, dude,\" Derik said, and flopped down into the nearest chair. \"You're in major trouble, Cummings.\"</p> <p>\"You keep your hands to yourself, werewolf.\"</p><p>Sara's mouth fell open. Derik nearly fell out of the chair. \"Dude! How'd you know? You are so wo* Pack.\"</p><p>\"Do I look like I like my steak servedtartare?\" Cummings snapped. \"It's all over you. Predators walk, stand, move, and run quite a bit differently from the rest of us. If you want to fool Homo sapiens, I'd advise not walking around sizing everyone up like you're wondering how they'd taste. And as foryou, Your Highness,\" he said, swiveling toward Sara, \"what are you doing with this—thisriffraff? Fooled by his over-the-top handsomeness, I've no doubt. Strongly consider killing him, dear. Werewolves are nothing but trouble, and they donot make good husbands.\"</p><p>\"That's not true!\" Derik said hotly.</p><p>\"Where's your father, lycanthrope?\" Dr. Cummings asked with deceptive courtesy.</p><p>\"He's . . . um . . . look, let's stay on-topic, shall we? And don't call me that. Cough up what you know, chum. Right now.\" He turned to Sara, who was desperately trying to follow the conversation. \"But let's get back to this for a sec—-we dotoo make good husbands. You know—once we find the right girl.\"</p><p>Dr. Cummings made a sound. It was not a sound of encouragement.</p><p>\"See, most of the guys I know really want a mate—a wife, I mean—and kids. They really do. But there aren't very many of us, and there's tons and tons ofyou guys, so lots of times they don't really think it through before they settle down, and, well, humans are different from Pack, it's nothing to be embarrassed about—\"</p><p>\"Derik.\" She was exasperated—whocared? — and amused at his distress. \"Can we stay focused on this whole Your Highness thing? And you!\" Dr. Cummings flinched as she shook a finger at him. \"Start talking. Start with, 'I moved to Monterey Bay and knew your mother before you were born,' and end with, 'and then you and a werewolf came to my office.' Startnow.\"</p><p>\"Yeah!\" Derik added.</p><p>\"Don't raise your voice to me, pup.\" Cummings looked at Sara. \"I moved to Monterey Bay because by my art I knew Morgan Le Fay was to be born there in seventy-two hours. I found you at this hospital and befriended your mother. I explained to your mother who you were, but she wouldn't believe me, and forbade me to tell you.</p><p>I kept you safe these many years and looked after you after your mother died. Now Arthur's Chosen is trying to kill you. It has nothing to do with saving the world. They just don't like you. Then you and a werewolf came to my office.\" He picked up his magazine again.</p><p>\"Oh, dude.\" Derik rubbed his forehead. \"You are so asking for a heart attack or for your lungs to pop or your eyeballs to explode or something. I mean, I don't evenknow her and that whole story pissed me right off.\"</p><p>\"My mother?\" Sara coughed and tried again. \"My mother knew this?\"</p><p>\"No. You weren't listening, Dr. Gunn, a trait I've discussed with you before.\"</p><p>\"Sorry,\" she muttered.</p><p>\"Want me to pull his lungs out for you?\" Derik asked brightly.</p><p>\"Try it, lycanthrope.\"</p><p>\"I told you not to call me that.\"</p><p>\"You guys, cut itout!\" she snapped. \"Finish what you were saying, Doctor.\"</p><p>He sniffed. \"Well. As earlier, I said your mother refused to believe the truth. And she did. She willfully would not let herself believe. She went to her grave thinking you were like every other kid. She was, in fact, determined you were like every other kid. No matter what she saw. No matter what you did.\" Dr. Cummings paused. \"A nice woman,\" he said at last, \"but not terribly bright.\"</p><p>\"Donot talk about Sara's dam like that,\" Derik growled.</p><p>\"It's a free country, whelp, and do I look like I'm worried about irritating someone who licks his testicles during a full moon?\"</p><p>Derik's eyes bulged, and Sara choked back a laugh. She knew at once that the big blond stud was not used to humans in their fifties dishing out shit.</p><p>\"Okay, okay,\" she said, holding her hands up. \"Let's stay focused.\"</p><p>\"I donot lick my—\"</p><p>\"So, Dr. Cummings, why you? Why have you been sticking so close?\"</p><p>\"To protect you from the occasional moron who wants to kill you because of who you are.\" He glanced meaningfully at Derik, whose hands were clenching and relaxing, clenching and relaxing. \"Or, rather, who you were.\"</p><p>\"And those guys this morning?\"</p><p>\"I told you. Arthur's Chosen.\"</p><p>A long silence and, when it appeared Dr. Cum-mings had nothing more to say, Sara said, exasperated, \"And who are they?\"</p><p>\"Buncha losers, probably,\" Derik muttered. \"Out to get you just because they can.\"</p><p>\"Andyour purpose in our fair town was what, exactly?\" Dr. Cummings asked sharply. \"I'm sure I can guess. Your alpha gave you your marching orders, and off you went, without a question or a murmur. Typical Pack behavior.\"</p><p>\"He did not! I mean, I decided to come on my own. Well, um, and what the hell do you know about it, Cummings?\"</p><p>Dr. Cummings shrugged, and began rooting around for a pack of cigarettes. Smoking was, of course, forbidden in the hospital. Only Dr. Cummings dared to try. \"I spent some time—years— in the company of a lady lycanthrope. She'd been banished from your Pack for some trivial reason, and was lonely.\"</p><p>\"Where is she now?\" Sara asked, interested in spite of herself. She'd never seen Dr. Cummings in the company of anyone but her mother. In fact, there were rumors that he was gay.</p><p>\"A new Pack leader came to power, forgave her for her unbelievably minor transgression, and off she went, back to the Cape to live happily catching rabbits with her teeth.\"</p><p>\"Who was it?\" Derik asked. \"I probably know her family.\"</p><p>\"Never you mind. My point is, I wouldn't start pointing fingers at Arthur's Chosen, because your own reasons for being here aren't exactly beyond reproach.\"</p><p>\"Uh-huh! I'm trying to save the world, pal. Grief from puffing human busybodies I sodon't need.\"</p><p>\"Arthur's Chosen,\" Sara said, again trying to bring them back on track. \"What's their story?\"</p><p>Cummings shrugged and lit a cigarette. \"Rabid followers of the King Arthur legend. You know, of course, that Arthur was betrayed by his half sister, Morgan Le Fay, and it's ultimately why he fell in battle. Arthur's Chosen think that if they get rid ofyou, Arthur will finally return.\"</p><p>\"So,\" Derik said, \"they're cracked in the head.\"</p><p>\"Well, yes. They're fanatics. A tough group to reason with.\"</p><p>\"Just a minute,\" Sara said. \"Morgan's supposed 'evil nature' is legend, not fact. In fact, a lot of people believe today that Morgan's wickedness was the invention of misogynist monks.\"</p><p>Both Dr. Cummings and Derik shrugged. Sara resisted the urge to throw up her hands. Men! God forbid they look at history in a woman-friendly fashion. Morgan Le Fay was probably a perfectly nice woman for her time. Strong-willed, sure. But wicked and evil and a dark sorceress? Feh.</p><p>\"But how do they know Sara's Morgan?\" \"The same way I did. The stars, old books, legends, prophecies. How didyou know?\"</p><p>\"One of my Pack members can see the future,\" Derik admitted. \"She said if I didn't get my butt to Sara's address pronto, the world was gonna blow up, or whatever.\"</p><p>\"Hmm. Charming. So, what are your plans?\" Derik looked blank. Sara said, \"Plans?\" \"To eliminate the threat to your personal safety, to not destroy the world—the prophecies all agree onthat, I'm sorry to say—you know. Your plans.\"</p><p>\"Uh...\"</p><p>\"Great,\" Dr. Cummings grumped. \"I swear, Sara, you get dumber every year.\"</p><p>\"Watch it,\" Derik warned.</p><p>\"And you, I suspect, were never the sharpest knife in the drawer.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Dude, I am so going to make you eat your ears.\"</p><p>Dr. Gumming sighed. \"Very well. Arthur's sect has its home base in Salem, Massachusetts. Go there. Smite your enemies. Have a hot fudge sundae. The end.\"</p><p>\"Wait, wait, wait. If you knew all this was going to happen, why didn't you warn me? Why didn't you tell me about Arthur's Sect ten years ago?\"</p> <p>\"Right. I see now that I have failed you. Because you certainly would have believed me and left at once for Salem.\"</p><p>\"Might have,\" she mumbled.</p><p>\"Don't you see, Sara? I had to wait until forces started moving in on you. It's the only way there would have been a chance of you believing me.</p><p>The sect would never have harmed you as an infant, because all the prophecies say you don't destroy the world until you're fully grown.\"</p><p>\"Wait, wait,\" Derik protested. \"So why not kill her when she was a baby? Save the world that way?\"</p> <p>\"Because the sect can't use her if she's dead, stupid mongrel. And she's not so easy to kill, in case you forgot. Which wouldn't surprise me.\"</p><p>\"But how do they use her to destroy the world? These Arthur guys?\"</p><p>Dr. Cummings shrugged. \"No one knows. Only that she is integral to the plot. Kill her as an infant, and who knows what will happen? Wait until she's fully-grown—very fully grown, Sara, time to lay off the bagels—and risk the world being destroyed. It's not an easy choice. Most of us decided to watch and wait. Now go away.\"</p><p>\"It's not nice to kill old guys,\" Derik muttered under his breath. \"It's not nice to kill old guys. It's not nice to—\"</p><p>\"All I could do was stick close, which I have, and now I'm done, and it's Miller time.\" Dr. Cummings clapped his hands sharply, making Sara and Derik jump. \"Now go! Off to Salem. Good-bye.\"</p><p>Derik and Sara looked at each other, then shrugged in unison. \"I'm game if you are,\" she said. \"I don't want to walk into the hospital again and worry about Arthur's Chosen hurting bystanders.\"</p> <p>\"I'm going where you go.\"</p><p>\"How touching,\" Dr. Cummings said. \"I've approved your vacation request as of thirty seconds ago. I suggest you don't delay.\"</p><p>\"Why?\" Sara asked. \"Is there something you're not telling us?\"</p><p>\"No, I'm just bored now. Good-bye.\"</p><p>\"What a sweetheart,\" Derik muttered once they were on the other side of the door.</p><p>\"Off to Massachusetts,\" Sara said, \"dodging killers along the way, and with a werewolf bodyguard.\"</p><p>\"Don't forget about the hot fudge sundaes.\"</p><p>13</p> <p>\"We can't go back to your place.\"</p><p>\"Agreed. Besides, it would take about six hours of cleaning before the house was livable again. Thanks again, by the way.\"</p><p>Derik ignored her sarcasm. \"And I sure can't show up at the mansion withyou.\" \"Uh-huh. Err ... why is that, again?\" \"Because I was supposed to kill you, duh.\" \"Don't say duh to me,\" she ordered. \"I get enough of that from Dr. Cummings.\"</p><p>\"Yeah, cripes, what a grouch. Guy's not afraid of anything, is he?\" Derik said this in a tone of grudging admiration. \"But anyway, about you—</p><p>I can hardly walk through the front door and say, 'hey, guys, here's Morgan Le Fay, didn't feel like killing her, what's for lunch?'\"</p><p>Sara frowned. \"So you're saying you're going to get into trouble for this?\"</p><p>Derik stretched, wiggling in the driver's seat, then pulled into a convenience store parking lot. \"Maybe. Kind of. Okay, yes.\"</p><p>\"Derik, you can't—I mean, I appreciate you giving up your sacred holy mission of premeditated murder and all, but don't your kind banish Pack members for, like, teeny tiny reasons? Never mind huge reasons like not fulfilling your mission?\"</p><p>\"We have a group mentality,\" he explained. \"So if you do something that hurts the group, or may possibly hurt the group, it's bye-bye time.\"</p><p>\"So you—you can't go back?\" Sara tried not to sound as horrified as she felt. She was lonely— well, alone—by circumstance. Her father had died the day she was born; her mother when she was a teenager. But Derik was deliberately giving up his family ... for her. It was touching. And cracked. \"Not ever?\"</p><p>He yawned, apparently unconcerned. \"Well, I figure it's like this: Either you destroy the world, in which case, my alpha can't kick my ass, or you don't, in which case, my alpha will know I was right. Kind of a win/win for me.\"</p><p>\"Except for the possible death of billions.\"</p><p>\"Well, yeah. There's that.\"</p><p>\"But you can never see your friends again?\" Sara was having trouble letting this go. \"Your family?\"</p><p>\"I was going to leave anyway. It was either that, or—anyway, I had to go.\"</p><p>\"Well, thanks,\" she said doubtfully. \"I— thanks. What are we doing here?\"</p><p>\"I'm starved.\"</p><p>\"Again?\"</p><p>\"Hey, we don't all weigh a hundred pounds and have the metabolism of a fat monkey.\"</p><p>\"Oh, very nice!\" she snapped. \"Well, as long as you're here, let me get my cash card, I'll grab some money.\"</p><p>His hand closed over hers, which was startling, to say the least. He was very warm. His hand dwarfed hers and, in the California sunlight, the hair on the back of his knuckles was reddish blond. She was fascinated to note that his index finger was exactly as long as his middle finger. \"Nope.\"</p><p>She stared into his green, green eyes. \"What, nope?\"</p><p>\"We're on the way to Salem, right? Chances are, there's gonna be some bad guys on our tail. Right?\"</p><p>\"What, you're asking me? Ten hours ago my biggest problem was finding a pair of panty hose that didn't have a run in them.\"</p><p>\"So,you can't leave a money trail,\" he continued patiently. \"No cash cards, no credit cards. And if you make a big bank withdrawal, my Pack's gonna know you're alive. They'll assume I'm dead, and then there's gonna be real trouble.\"</p><p>\"How would they even know—never mind, don't tell me. We can't go across the country with no money,\" she pointed out.</p><p>\"Yeah, yeah. I'm working on that one.\"</p><p>\"What a relief,\" she said, getting out of the car and following him up the sidewalk. \"Seriously. You have no idea.\"</p><p>\"Aw, stick a sock in it. You—watch it.\" He grabbed her elbow and pulled her out of the way just as a teenager came barreling through the door of the store. The kid stopped for a minute, utterly panicked, and they all heard the wail of sirens at the same time.</p><p>Well, probably not, Sara thought. Probably Derik heard them about a minute earlier. Aggravating man. And what happened when the moon rose? Whatthen? Did she really believe he was going to turn into a wolf and run around peeing on fire hydrants?</p><p>\"Shit!\" the teen cried, and started to dart around them. Derik stepped in his way—</p><p>\"Don't do that,\" Sara said sharply. \"He might have a gun.\"</p><p>\"Hedoes have a gun,\" Derik replied, bored.</p><p>—and the teen suddenly thrust a paper bag at Sara, who tightened her grip around it purely by reflex.</p><p>They both watched the kid race out of the parking lot.</p><p>Sara opened the sack, which was bulging with twenties, tens, and fives. \"Oh,\" she said. \"Well. Um. I seem to have come into some untraceable cash for our trip.\"</p><p>Derik slapped the heel of his hand to his forehead, then shoved Sara back toward the car. \"Let's get out of here before the cops come.\" He jumped into the convertible, fighting a grin. \"You lucky bitch.\"</p><p>\"So, we need another car.\"</p><p>\"Okay,\" Sara said. They had left the Monterey city limits, and she had just finished counting the money. Eight hundred sixty-two dollars even. No change. \"Um, why?\"</p><p>\"Because my Pack rented this one for me. They can track it. We have to leave it and find something on our own.\"</p><p>\"Okay.\"</p><p>\"So, do it.\"</p><p>\"Dowhat?\"</p><p>\"You know. Work your hocus-pocus and wish us up a car.\"</p><p>\"It doesn't work like that.\"</p><p>\"The hell it doesn't.\"</p><p>\"I don't have conscious control over it,\" she explained, trying—and failing—to smooth her hair out of her face. Convertibles were sexy and cool in the movies, but in real life you couldn't see for all the hair flying around. And she dreaded trying to pull a brush through the mess when they parked. Not that she had a brush. But still. \"Heck, until you showed up, I didn't think I could do anything special at all. Except bowl,\" she added thoughtfully. \"I'm great at that.\"</p><p>\"Yeah, I bet those pins just happen to fall over for you all the time. Concentrate,\" he ordered. \"We need ... an untraceable ... car.\"</p><p>\"Stop . . . talking . . . like that.\"</p><p>He slapped the steering wheel with his palm. \"Shit. Well, I guess I could steal one. . . except we'd have to do that at least every day or so.\"</p><p>\"Why aren't we taking a plane? Isn't it a four-or five-day drive?\"</p><p>\"You want to show airport security your ID? Because I don't think that's, y'know, too cool. Which also lets out renting a car, and taking a train.\"</p><p>\"Are there that many werewolves running around the country?\"</p><p>\"No. There's only about three hundred thousand of us, worldwide. But still. I think it's too important to take chances. I'd hate to fuck this up through bad luck, y'know? Not that you exactly have bad luck. But still. I'm not crazy about taking chances. Okay, I am, but not chances of this magnitude. Get it?\"</p><p>\"Hardly. And you can't ask any of your—um, your family—the Pack, or whatever you call it— for a car?\"</p><p>\"Well, I could, but I'd rather not take a chance on anything getting back to Michael—my alpha,\" he explained. \"I'd risk spending a night or two with local Pack members, because my mission is top secret—\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Excellent, Mr. Bond.\"</p><p>\"Anyway,most of the Pack doesn't know what I'm up to. Just the East Coasters. So it's no big deal to show up on someone's doorstep and crash for the night. But to do that, and be in a situation where I'd have to borrow a car, and have you in. tow . . . that might get back to the wrong set of ears.\"</p><p>\"So, what?\"</p> <p>\"So, we need a car. We'll drive for a while, then crash.\"</p><p>Til tell you right now,\" Sara declared, \"no more convertibles!\"</p><p>\"Aw, how come?\" he whined. \"How can you not like the wind in your face?\"</p><p>She pointed to her head, which, thanks to mussed curls, was almost twice as large as usual. \"Forget it, Derik. For-get-it.\"</p><p>\"Aw, you look cute.\"</p> <p>\"And you're deranged, but we established that a couple hours earlier. No convertibles.\" \"Well, I'm not driving a zillion miles—\" \"Three thousand, five hundred,\" she said dryly.</p><p>\"—locked up in a steel box, I can tell you that right now, Sare-Bear!\"</p><p>\"Ew, don't call me that. Sare-Bear? Ugh.\" \" 'Cuz you look like a cute little bear with your hair all over the—\"</p><p>\"Stop talking. What? You're claustrophobic?\" \"No. I just don't like being shut up in a steel box for hours and hours a day.\" \"So, youare claustrophobic.\" \"No, it's just. . . that fake carpet... the .upholstery ...\" He shuddered. \"It reeks, man. It totally reeks.\"</p><p>\"You know what we need?\" \"For you not to destroy the world?\" \"Besides that. We need a truck. A nice big truck with four-wheel drive and a supercab.\" \"What's a supercab?\"</p><p>\"It's a truck that seats two or three people in the front seat and a couple in the backseat. There's plenty of space to store our stuff, and if you start feeling like the upholstery is closing in on you, you can ride in the back while I drive. Your hair mussed in the breeze, your ears flopping behind you .. . it'll be great.\"</p> <p>\"Can you destroy the world right now?\" he asked. \"Because if I gotta put up with one more dog joke...\"</p><p>\"And if we don't get a motel room or don't want to stop for long, we can spread some sleeping bags out in the back and sack out there. We'd have to stop and use some of this cash to buy camping equipment, but that'd be easy enough.\"</p><p>He frowned at her. He blinked at her. At last he said, \"That's kind of brilliant.\"</p><p>\"Well,\" she said modestly, \"Iam a doctor.\"</p><p>\"Okay, so. We try to steal a truck.\"</p><p>\"And what are we going to do when we catch up with Arthur's Chosen?\"</p><p>\"Let's get there first,\" he said grimly, and she had no reply to that.</p><p>14</p> <p>\"This is insane,\" she commented.</p><p>\"It is not. Now try to look like we're not stealing a car.\"</p><p>\"But weare stealing a car.\"</p><p>\"Will you cut that out? Look casual. Lean on the door.\"</p><p>\"The one you're trying to open?\"</p><p>Derik resisted the urge to strangle Sara. This was an interesting improvement over resisting the urge to kiss her. You'd think, since he'd saved her life—well, sort of, in that he hadn't tried to kill her again—and because he was helping her hunt down Arthur's Big Fat Losers, that she'd be a little grateful. Or at least nicer. But nooo. It was blah-blah-blah and bitch-bitch-bitch. Like she could do any better than a full-grown werewolf! Okay, well, maybe she could. But that was irrelevant. Wasn't it?</p><p>\"It's just that this is an extremely insane idea,\" she was explaining, like he'd gone retarded.</p><p>He grabbed the door handle again and tried to smell her hair without her catching on. Roses and cotton—yum! And how cute did she look in the convertible with those red curls flying all over the place? Her nose was sunburned now, and he even liked the shade of pink.</p><p>She turned to give him a suspicious look, and he held his breath in mid-sniff. Then, to distract her, he said, \"Show me another place that has all the cars lined up, with their keys in the ignition.\" He spread his arms to indicate the Enterprise Car Rental lot. \"Huh? Show me. That's all I ask.\"</p><p>\"Showme another place that hasless paperwork on any one of these cars. You don't think they do a head count or whatever—a grille count—before the last guy goes home for the day? They'll know it's gone in a cold minute.\"</p><p>\"So we find another car rental place,\" he said, \"and steal from there.\"</p><p>\"Help you folks?\"</p><p>They both spun, Derik swearing under his breath. Sure, the guy had snuck up on him from upwind, and sure, Sara was sort of distracting— she kind of jammed his radar, so to speak—but that was no excuse. No fucking excuse!</p><p>\"We were just looking,\" Sara explained, after clearing her throat and trying a smile.</p><p>The fella who'd hailed them looked more nervous than they did—and more angry than Derik felt. His gray suit was rumpled, and his tie was flying over his shoulder in the breeze. His brown hair was wisping about, and his watery blue eyes were alternately starey and darting. Derik started to grab Sara's shoulder to pull her behind him when he got a whiff of burning silk— the smell of desperation.</p><p>\"Uh-oh,\" he muttered.</p><p>\"You folks need a car? I'll tell you what. You can have that truck right over there.\" He pointed to a shiny, brand-new, red pickup truck, complete with supercab and about fourteen antennas.</p><p>They looked at the truck, glowing at them almost like a mirage, or the Holy Grail—Derik expected to hear a choir of angels humming—then looked at the sales guy.</p><p>\"I've had it with this place,\" he muttered. \"PromoteJim Danielson over me? The guy comes in an hour late every day and leaves an hour early. And don't get me started on his lunch breaks. They're more like miniature leaves of absence. The guy's fucking the manager's daughter sohe gets the promotion?Him ?\"</p><p>\"We, uh, don't want you to get in any trouble,\" Sara said.</p><p>\"And we don't want you to get any closer,\" Derik warned.</p><p>\"No, look, it's okay, see?\" The frustrated Enterprise employee grinned, which looked fairly ghastly. \"You guys know how to drive a standard transmission, right?\"</p><p>\"Driving a stick is sonot the big problem in this scenario,\" Derik said.</p><p>\"Shhh!\" Sara's elbow jabbed him in the side. \"Let him finish.\"</p><p>\"It's no problem. I'll just fix it in the computer. Nobody will even know about it. Go on, take it. You can help me stick it to my boss.\" He stared off at the horizon for a moment, looking haunted. \"I just—not today. I put up with it, and I put up with it, but for some reason, today I just—I.can't do it. Not one more day. So go on.\"</p><p>\"Stop looking so damn smug,\" Derik told Sara later, as they were leaving California behind.</p><p>\"Can't help it,\" she replied.</p><p>\"So, what are the chances of that happening?\"</p><p>\"About one in a zillion.\"</p><p>\"That's what I thought. Nice truck, though.\"</p><p>\"Greattruck.\"</p><p>\"You're looking smug again.\"</p><p>\"Sorry.\"</p><p>15</p><p>\"OKAYYY.. .we've got sleeping bags, a cooler, water, backpacks, flashlights, toilet paper, Purell, a first aid kit, dehydrated snacks, a couple of sharp knives, eating utensils, plates, cups, a grill, a frying pan, and a pot. Let's see, what am I forgetting?\"</p><p>\"The fact that I'm a werewolf,\" Derik muttered, so as not to be overheard.</p><p>\"Oh, yeah. That. I didn't forget it, I'm just totally discounting it.\"</p><p>\"Nice!\"</p><p>\"Quit it, now, you're making me lose track.\" She squinted at her list, pretending Derik wasn't heaving with indignation less than six inches away. Like Wal-Mart wasn't distracting enough . . . the camping section was bigger than Yosemite.</p><p>\"Okay, so, we can hit the grocery story for hot dogs, bacon, bread, and—\"</p><p>\"Sara, we don't need all this junk.\" He fingered the sleeping bag and practically sniffed in disgust. \"First off, we have a limited amount of money, so I'll tell you what you don't have to waste the bucks on.\"</p><p>\"Oh, would you? That would be swell.\" She rolled her eyes.</p><p>\"I can see in the dark, so don't bother with the flashlights. I sure as shit don't need the Band-Aids in the first aid kit. And I'd rather eat my own shit than touch one of those dehydrated beef stews.\"</p><p>\"You're so gross,\" she told him. \"And you're forgetting about me. I can neither see in the dark, nor bring my bleating prey down by the neck at a dead run. And I like to be warm at night.\"</p><p>\"Why don't you leave that to me?\" he leered.</p><p>\"Why don't you go fuck yourself?\"</p><p>He deflated. \"Aw, c'mon, Sara, it's my job to look out for you. You don't need all this junk.\"</p><p>\"Mmmm.\" She crossed a few more items off the list. \"Look, I appreciate that you've aborted the whole 'Kill Sara' plan, I really do. But if I'm going to travel across the country with a homicidal stranger—that's right, I said homicidal, don't puff up like a cobra and glare—then I'm going to take care of myself. Just like I've been doing all along. If you don't mind.\"And even if you do, Studboy.</p><p>\"That was a good speech,\" he said admiringly.</p><p>\"Oh, shut up. And grab that bug spray, will you?\"</p><p>\"Ech! You're not going to actually spray thaton you, are you?\"</p><p>\"No, I'm going to use it to sweeten my coffee. Just grab it,\" she said, already exhausted. Long day. Long fucking day, and that was a fact.</p><p>\"You need salt crystals and fresh ground pepper? And vanilla sticks?\" Derik cried. \"I thought we were roughing it!\"</p><p>\"We are, but there are some things I refuse to give up. I think I've been a pretty good sport up 'til now, don't you? I mean, you turned my whole life upside down, but I'm playing along. Look, think of it as bringing a little taste of home along with us on the road.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm thinking of it as a big goddamned waste of money and space, how about that?\"</p><p>\"A person of limited imagination,\" she admitted, \"and poor cooking skills might think of it like that.\"</p><p>He sniffed the jar that held the vanilla pods and tossed it into her cart. \"FYI, sunshine, I am a great damned cook, and these things are a total waste on a camping trip. Not to mention, they're from Mexico, not Madagascar, so on top of everything else, you're getting screwed.\"</p> <p>\"Say that after you've tried my campfire cocoa.\"</p><p>\"Sure I will. How much money do we have left, anyway?\"</p><p>\"Enough to get free range eggs,\" she said, plucking them out of the dairy section. \"Be a good boy and scamper off to get some Asiago cheese, will you?\"</p><p>\"I'm going to pretend you didn't say that,\" he said, folding his arms across his chest.</p><p>\"You're just mad because we skipped the Milk Bones aisle.\"</p> <p>\"Sara, for the love of God... if you don't stop with the dog jokes, and I mean, stop with them right now ...\" He followed her, practically wringing his hands, and she hid a smile. It was good to have the upper hand, however momentarily.</p><p>Camping across country with a werewolf... nowthat was going to be an adventure.</p><p>16</p><p>\"So you want to stop?\"</p><p>\"I don't mind stopping.\"</p><p>\"I didn't ask if you'dmind. I asked—\"</p> <p>\"Since I'm sitting right next to you,\" he said, trying not to snap, \"I was sorta able to follow the conversation. Look, I can go all night. Drive,\" he added when she went red. \"I can drive all night. If you want to, curl up in the back, go to sleep.\"</p><p>\"Well, we bought all this camping equipment.\"</p><p>\"You.You bought it all.\"</p><p>\"Right. And it's\"—she looked at her wrist— \"eight-thirty. We could stop, maybe sleep for a few hours.\"</p><p>\"And make some burgers?\"</p><p>\"What?\" she cried. \"We just dropped twenty bucks at McDonalds!\"</p><p>\"Oh, Big Macs,\" he scoffed. \"They're more like an appetizer than an actual meal.\"</p><p>\"Actually,\" she said frostily, \"if memory serves, someone insisted we stop so he could get the toy in the Happy Meal.\"</p> <p>\"It's for my friend's kid,\" he tried not to whine. \"Anyway, it's not my fault. That stuff doesn't fill you up. Half an hour later—\"</p><p>\"It's been twenty minutes.\"</p><p>\"—and you're hungry again.\"</p><p>She smacked herself in the forehead, which looked painful, and left a red mark. He resisted the urge to kiss it. \"Okay, okay. So, we'll stop, eat, and sleep. For a little while. We're out of California, anyway. I mean, we're making good time.\"</p><p>\"Okay,\" he said, because really, he didn't know what elseto say. She was getting nervous, which was makinghim nervous. Which he couldn't stand. It's like she hadn't really thought about the fact that they'd be sleeping right next to each other in the back of a truck until just a couple of minutes ago. Which was extremely weird, because Sara was many things, and stupid wasn't one of them. Shit, it was the first thing that went throughhis mind when they were deciding which nylon bags to buy. \"So, we'll stop.\"</p><p>She pointed. \"There's a campground.\"</p><p>\"Yeah, I see it.\"</p><p>Twenty minutes later, they had their one-night camping permit and had selected a teeny campsite that was roughly, given what he'd just paid, ten bucks a square foot.</p><p>He decided to kiss her again, break the ice. Well, that, and he wanted to kiss her again. But really, it was, like, a necessity. If she got any edgier, and thus bitchier, he just might try to kill her again, and another brain aneurysm he didnot need.</p><p>So, they'd kiss, and maybe it'd lead to something and maybe not, but she seemed to expectsomething, and he was certainly more than willing to oblige.</p><p>Except.</p><p>Except, she hopped down from the truck, groped in one of the bags, and was now coating herself head to foot with noxious chemicals. He coughed and gagged and waved the air in front of his face, to no avail. The cloud was suffocating him!</p><p>\"Enough, enough!\"</p><p>\"Do yousee all the mosquitoes?\" she cried. \"We'll get eaten alive.\"</p><p>\"Speak for yourself.\"</p><p>\"Are you serious?\" She walked over to him, and he backed up, terrified—she was a walking biohazard—but she grabbed his arm, forestalling his retreat. He was coughing so hard he missed her question.</p><p>\"What?\"</p><p>\"It's true! You don't have a mark on you.\"</p><p>\"Bugs don't like werewolves.\"</p><p>\"Lucky bastard,\" she muttered.</p><p>\"Listen, Sara ...\" She was still holding on to him, which he kind of liked. He bent in. \"You know, we're going to be spending a lot of... um . . . you know,time together . . . and . .. and . . . shit.\"</p><p>\"What?\" She was looking up into his eyes, and oh, she was just so pretty it was a damn crime, that's what it was, and ...</p><p>Shit.</p><p>His lungs exploded. Or, at least, that's what it felt like.</p><p>\"You've got to lay off the bug spray,\" he gasped after about ten minutes of spasms.</p><p>\"Well, what do you know about that,\" she said, and smiled for the first time in half an hour. \"It's werewolf repellent.\"</p><p>He laughed in spite of himself. \"Deep Woods Off: For those really pesky werewolves.\"</p><p>An hour later, he wasn't laughing. They'd eaten, doused their fire, said their good nights, crawled into their sleeping bags. Well, she did. He couldn't see how she could cocoon herself in a heavy bag when it was eighty degrees outside— humans wereweird, or maybe it was just females of any species—but whatever. And now he was lying beside her in the back of the truck, slowly going insane.</p><p>He'd dated humans before, so it wasn't like he'd never had this problem before. The communication thing. Because he had. But somehow, back then, with other women, it hadn't bothered him so much.</p><p>It bothered him now.</p><p>If Sara were a werewolf, she'd smell his intent and he'd smell hers, and they'd do it, or she'd say right out: Not interested, pal, take a hike, and they wouldn't do it. Period. The end. But Sara couldn't smell a thing, comparably speaking, and what was worse, she was pretending like she didn't know he was so horny he was ready to have sex with his rolled up sleeping bag. So it was this big—this bigthing that they weren't talking about. What was that saying? It was the elephant in the room. A big, green, horny elephant.</p><p>He tried to think: What would Michael do? Jeannie had driven the poor guy nuts in the beginning . . . still did, sometimes. And a lot of the early problems were because she had trouble settling into the Pack. And Michael, as alpha, expected her to fall in line. And Jeannie, as a human who carried firearms, thought he should drop dead. So Michael had a lot of experience with the communication thing. He'd been forced to learn, poor bastard. What wouldhe do?</p><p>He'd talk to Sara, that's what he'd do.</p><p>\"Sara,\" Derik whispered.</p><p>Nothing.</p><p>\"Listen, Sara—\" I really really like you, and you smell great, and I think your powers are really cool, if kind of terrifying, and oddly enough this makes you more appealing than any female I've ever known, and I definitely think we should fuck—oh, shit, I mean make love, you know, whatever—and then we can cuddle and I can get SOME FUCKING SLEEP.</p><p>\"Sara?\"</p><p>A light snore for an answer.</p><p>\"Shit.\"</p><p>Saving the world was going to be harder than he thought.</p><p>17</p><p>\"This werewolf thing,\" Sara said abruptly. She puffed a hank of hair out of her face and took a break from struggling with her sleeping bag. It was uncanny. You bought the thing in this nice little roll, and after you used it, you couldn't get it back into that nice little roll if someone stuck a gun in your ear. Uncanny! \"You know, the full moon's in a couple of days.\"</p><p>\"Seventy-eight hours. Yeah, I know.\"</p><p>\"So ... what then?\"</p><p>\"Sara, we could all be dead in seventy-eight hours.\"</p><p>\"How many times do I have to tell you?\" she snapped. \"I'm not going to destroy the world.</p><p>And what's with you this morning, you big blond grump?\"</p><p>He mumbled something. It sounded like \"I know you are but what am I?\" but even he wouldn't be that immature. And boy,, hadhe woken up on the wrong side of the truck this morning!</p><p>\"I'm just curious about what would happen, is all,\" she said. \"What if you lose control and bite me?\"</p><p>\"What if I do?\" he grumped.</p><p>\"Oh, very nice! ThinkI want to be worried about full moons and biting people and—and getting rabid and eating undercooked food and maybe getting Mad Werewolf Disease?\"</p><p>He covered his face with his hands and squatted by the smoldering remains of their fire. \"It's sooo early...\"</p><p>\"Seriously, Derik.\"</p><p>\"I am being serious. It's too early for this shit.\" He took his hands down from his face. \"Besides, it's not the flu, Sara. You can't catch it. I could give you a blood transfusion, and you wouldn't catch it. We're two different species.\"</p><p>\"Oh. I didn't know that. So all the movies are wrong?\"</p><p>\"Totally, totally wrong.\" He scrubbed his face with his hands and yawned. \"Don't waste your time watching them, unless it's for entertainment value. Also, we don't carry babies off in the moonlight, and I wouldn't eat a person on a bet. Yech.\"</p><p>\"Yech?\"</p><p>He shuddered, and she took offense. \"What's wrong with eating a person? You should be so lucky! Not that I want you to.\"</p><p>\"You taste terrible, that's what. All of you. The omnivore diet. . . blurgh.\" He actually gagged!</p><p>\"Well, nobody's asking you to eat anybody.\"</p><p>\"I'd make an exception,\" he grumbled.</p><p>\"Very funny. Don't even think about eating me. And if we're two different species, how do you have children with humans? And speaking of blood transfusions, would one of those even take?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Yes, and yes. It doesn't happen all the time— cubs with a human—but it does happen. I don't know why, I'm not a goddamned biologist.\" He groaned again and got up, then loped off toward the truck. \"Are we ready? Let's go. Ready?\"\"</p><p>\"What's the rush? And why are you so scratchy this morning?\"</p><p>\"Couldn't sleep,\" he replied shortly, stomping on the clutch and starting the truck with a roar. \"Went for a walk. All night.\"</p> <p>\"Well, excuuuse me, Mr. Insomniac—wait!\" She ran to throw the last sleeping bag into the back of the truck. \"Nobody told me werewolves were such rotten morning people!\" She lunged, and just managed to pop the door open as he accelerated.</p><p>\"Well, now you know,\" he said, shifting into second as she slammed her door.</p><p>\"So, what's the plan, Grumpy McGee? Besides a second, possibly third, breakfast by ten o'clock?\"</p><p>\"Drive until we're tired. Stop again. Eat. Sleep. Drive more. Find Arthur's Chosen. Kick their asses. The end.\"</p><p>\"A fine plan,\" she said.</p> <p>\"Except...\"</p><p>\"What?\"</p><p>He yawned again, which was startling—his jaw stretched wider than she thought would be possible, and he showed a lot of teeth. \"Well, I have to stay in touch with my people, or they'll start to worry about me. Maybe send someone else out here. So I thought tonight we'd stay at a safe house.\" This was a rather small lie. He didn't have to stay in the safe house; he could check in from the road. But the thought of having Sara in a warm bed .. . having Sara ...</p><p>\"What? I didn't catch that.\"</p><p>\"I said okay,\" she repeated. \"I don't mind sleeping with a roof over my head. Don't yawn anymore.\"</p><p>\"Huh? Never mind. And a shower. You should shower so you get all the bug spray—\"</p> <p>\"Yes,fine, all right. So, we stay at a safe house.\"</p><p>\"Well, the thing is, I'd have to explain you. Because if any other werewolf ever found out who you were, they'd try to kill you.\"</p><p>\"A possibility to be avoided at all costs,\" she agreed. \"So what do you suggest?\"</p><p>\"Pose as my future mate—my fiancee, I mean.\"</p><p>\"Oh.\"</p><p>\"I have to tell them something,\" he explained.</p><p>\"Well. Okay. I guess. I'm against being killed, you know—I'm not totally irrational. We'll just have to hide the fact that we don't know each other very well.\"</p><p>\"Um.\" He cleared his throat. \"There's one other small problem.\"</p> <p>\"Small, huh?\" She sighed as he slowed down and took the exit for Burger King. Like he hadn't just eaten a pound and a half of bacon! \"I'll bet. Well, bring it on. The week I'm having, I can take it.\"</p><p>\"The thing is, they'll know—my people will know—if we're not really, um, intimate.\"</p><p>Her mind processed this, then decided, the week she'd had, she couldnot take it. Probably she had misunderstood. \"What?\"</p><p>\"Well, like I said, they'll know if we aren't, you know, sleeping together. So we have to if we're going to pull this off. Sleep together, I mean.\"</p><p>She turned in her seat to glare at him. He kept his eyes steadily on the road, she noticed. Coward. \"You're telling me I have tofuck you in order to stay at the safe houses?\"</p><p>\"Yeah.\"</p><p>\"Well, too damned bad,\" she snapped, ignoring the surge of heat to her cheeks.</p><p>\"You'd rather have your neck broken at the safe house?\" he snapped back.</p><p>\"Yes, upon careful consideration, I think that would be preferable!\"</p><p>\"Oh, stop with the drama queen thing. It's just sex, that's all, just sex, sex, that all it is, and frankly, I'm kind of insulted that you'd rather be gutted than see me naked!\"</p><p>\"They're called standards, pal. And I can't help it if I'm one of the few who didn't tumble into bed within five minutes of first meeting you!\"</p><p>\"Standards!\"</p><p>\"Want me to find a dictionary, blondie?\" \"I want you to be a realist,\" he growled. \"In other words, drop your pants and save your life.\"</p><p>\"Anything sounds bad if you say it likethat.\" \"Forget it.\"</p><p>He pounded the steering wheel, which groaned alarmingly. \"Damn it, Sara, you are the most hardheaded, stubborn, infuriating, annoying, stuck-up, curliest, annoying—\"</p><p>\"Curliest?\"</p><p>\"Aw, shut up. Fine, it's your head. We'll sleep out in the woods again, no touchie. And again. And again. Homo sapiens, man, fucking hothouse flowers, I swear to God.\"</p><p>\"I am not,\" she said automatically, inwardly crushed. She'd sort of been looking forward to a shower. And a bed. She'd gone camping quite a bit as a girl, but now that she was in her late twenties, her idea of roughing it was a Super 8 and a hair dryer.</p><p>She cleared her throat and then asked timidly, \"Can't—can't you just tell them that because I'm not a—a werewolf, you're still working on getting me into bed?\"</p><p>He hesitated, then shook his head. \"Our kind doesn't make a life-commitment without, uh—\"</p><p>\"Sampling the merchandise?\"</p><p>\"Uh, yeah. I mean, it's a totally natural thing to us. We don't have this whole Victorian attitude toward sex that you guys do. And the thing is, I wouldn't bring a casual date to a safe house.\"</p><p>\"Oh.\"</p><p>He shrugged. \"So, okay. We'll keep camping. I guess I shouldn't have sprung it on you like that, but I thought it'd be worse if I didn't say anything until we were at the house.\"</p><p>She actually shivered at the thought. \"No, that's a good point. Well... what's a safe house like?\"</p><p>\"It's a house where a werewolf family lives and they take in guests a lot. People on the run, or on a mission, or even making a go-see trip to the Cape to meet Michael and Lara.\"</p><p>\"Lara being . . .\"</p><p>\"The next Pack leader.\"</p><p>\"Oh. You don't run a patriarchic society?\"</p><p>\"I don't think so,\" he said doubtfully.</p><p>\"Who's Lara again?\"</p><p>\"Michael's daughter.\"</p><p>\"Ah! Dynastic, then. Never mind. So it wouldn't be ... weird ... if we just showed up at this place and asked to spend the night.\"</p><p>\"No. It'd be normal.\"</p><p>\"But we'd have to share a bed.\"</p><p>\"Yup.\"</p><p>\"Actually, we'd have to do it before we showed up at the safe house, right? So the other werewolves could tell we'd been intimate? Not that it's any of their damn business,\" she added in a mutter.</p><p>There was a long pause, and then Derik answered, sounding almost like he was strangling. \"Yes, we'd have to do it before we showed up.\"</p><p>She drummed her fingers on the seat and watched the scenery go by. \"Well. I'm really not that kind of girl.\"</p><p>\"Oh, I know,\" he said earnestly.</p><p>\"But you're kind of cute.\"</p><p>\"Really?\" He seemed pleased.</p><p>\"In an overbearing, totally obnoxious sort of way,\" she explained, watching him deflate a bit. \"And weare on a mission to save the world.\"</p><p>He didn't say anything, just pulled into the BK parking lot.</p><p>\"We could talk about it, I guess. I mean ... I'd like a shower.\"</p><p>\"And I'd like for you to have a shower.\"</p><p>\"Bastard,\" she muttered.</p><p>18</p><p>They were still debating the merits of lovemaking—or not—when he pulled up to the Kwik N' Go. \"Gotta use the phone,\" he explained.</p><p>\"How?\"</p><p>\"Huh?\"</p><p>\"The phone,\" Sara said. She still reeked strongly of bug spray, but driving around for hours with the windows open had alleviated some of the damage. At least he could think about kissing her without gagging—a crucial step. And the wind had tossed her curls around and around; she looked like an adorable red dandelion. \"You can't use your cell phone, for obvious reasons. But how are you paying for a phone call to the Cape fromberet You can't use your credit card.\"</p><p>\"Oh.\"</p><p>\"And you can't call from the safe house?\"</p><p>\"They'd hear me anywhere in the house,\" he admitted.</p><p>\"Oh. Creepy. I suppose calling collect is out of the question?\"</p><p>\"Only if you don't mind a bunch of werewolves tracking you down.\"</p><p>\"Okay, well, let's try this.\" She hopped out of the truck and walked up to the pay phone on the sidewalk. \"This works for me sometimes,\" she explained over her shoulder. \"I used pay phones a lot before I got my cell, and it usually worked out.\"</p><p>She picked up the receiver, listened, then asked, \"What's the number?\"</p><p>He told her.</p><p>She tapped in the number, listened, then handed him the phone. \"It's ringing.\"</p><p>He took the receiver from her, staring. Itwas ringing. \"Won't it ask me for change, or—\"</p><p>\"Wyndham residence.\"</p><p>\"Oh, hi, Moira. Listen—\"</p><p>\"Derik! Hey, where the hell are you? How's it going? Are you okay? Michael's been going out of his mind, here! Me, too,\" she added.</p><p>\"Tracking her down has been a little harder than I thought,\" he said with a nervous glance at Sara. Thank God, thank God Moira wasn't anywhere near him. She'd smell a lie, and then kick his ass righteous. He'd deserve it, too. He couldn't remember ever lying before. It was a waste of time in the Pack. It made him feel like a real rat turd now. \"But I'm closing in. Just wanted to let everyone know I'm okay. Got that? I'm okay, everything's fine right now. Tell Mike, okay?\"</p><p>\"Okay, honey. Things out here are fine, too. We're basically hanging around, waiting to get the word, you know? So you take care of yourself, okay?\"</p><p>\"Sure. Um, patch me through to Antonia?\"</p><p>\"Sure. She's had a migraine since you left,\" Moira warned, which made Derik cringe—Anto-nia was a bear when she was feeling fine—\"so I'm not sure she'll be good company, to put it very,very mildly, but here she comes, so hold on to your fur.\" There was a click as he was put on hold._ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I guess this phone's screwed up,\" he said to Sara. \"It's not asking for change or anything.\"</p><p>\"Guess so,\" she replied, looking smug.</p><p>\"You're scary,\" he said, and then, \"Hello?\"</p> <p>\"What are youdoing} Owww!\" Antonia complained. \"My head, goddamn it!\"</p><p>\"Well, don't yell if you've got a migraine,\" he said reasonably. \"Listen, Antonia—\"</p><p>\"You chimp, what thehell are you doing?\"</p><p>\"Saving the world,\" he replied shortly. \"My own way. And don't call me that.\"</p><p>\"Butshe's right there!\"</p> <p>\"Duh. Listen, don't tell Mike, okay?\"</p><p>\"Aw, man, Derik, you're killing me,\" she complained. \"You arefucking killing me!\"</p><p>For a moment he actually thanked God that Antonia had a persecution complex. She was one of the few Pack members who would actually consider helping him deceive Michael. Moira, for example, would never, ever do it. She'd feel bad, she'd apologize the whole time she was kicking his ass and then dragging him by the scruff of the neck to take his medicine, but friendship was one thing, and Pack was Pack.</p><p>\"Look, Antonia, I wouldn't let you twist in the wind on this. We've got a plan. I'm pretty sure it will work.\"</p><p>\"Pretty sure?Owww!\"</p><p>\"Look, I must be on the right track, or you would have ratted me out to Mike by now, right? I mean, your visions must be showing you that something's going right. Right?\"</p> <p>Sullen silence.</p><p>\"Right,\" he repeated, on slightly surer ground. \"So, listen, I'm okay, she's okay, and we're gonna get the bad guys and save the world. See, I think the bad guys will accidentally trick her into destroying the world, so if we take care of them, we take care of anybody else.\"</p><p>\"And how the blue hell do you know that?\"</p><p>\"Well, I don't. Know it, exactly. You know, like you know two plus two makes four. But I feel it. I mean, I know Sara would never do something that bad on purpose. So the bad guys must do it, or trick her into doing it, or something.\"</p><p>\"You're talking out your ass. And besides, you're not an alpha, Derik,\" Antonia pointed out through gritted teeth. \"It's not your call. I mean ... you could run a Pack, but Michael's the boss of this Pack, and he told you what to do.And you're not doing it.\"</p><p>\"Just... don't say anything yet, okay?\"</p><p>\"Derik...\" This was more a howl than a groan.</p><p>\"Antonia.\"</p> <p>\"You're fucking crazy,you know you're crazy, right?\"</p><p>\"Just do this one thing for me.\"</p><p>\"Sure,\" she snapped. \"The first favor he ever asks me in twenty-two years, andthis is it!\"</p><p>For a moment he was startled ... Antonia was so annoying, so bitchy, so harassed because of her visions, it was easy to forget she was still just a baby. She was barely voting age, and look what he was asking of her!</p><p>\"Thanks,\" he said, because that was her way of saying yes. \"I owe you one.\"</p><p>\"You owe metwenty, you big, stupid, lumbering, asshole moronic—\" He hung up on her. The conversation had gone as well as he could have hoped; no need to drag it out.</p><p>\"Okay,\" he said, letting out a deep breath, \"I bought us some time, anyway.\"</p><p>Sara smiled at him. It was the first smile of the day—they'd spent the afternoon screeching at each other in between bouts of fast food—and it knocked him out all over again, how gorgeous she was, how funny, how cute, how—\"Yeah, sounds like you did. Thanks. What do you say we go find this safe house of yours?\"</p><p>\"Great,\" he said. \"Showers all around.\"</p><p>\"Enough rubbing in how bad I smell,\" she muttered, trailing him to the truck.</p><p>\"I just meant that I could use a shower, too.\"</p><p>\"Sure you did.\"</p><p>19</p><p>They had eaten (twice, in Derik's case), drunk cocoa, and roasted marshmallow after marsh-mallow. Sara knew if she gobbled one more soft white squishy candy she would explode. But she couldn't stop herself from eating them.</p><p>Quit stalling,she ordered herself.</p><p>Ugh,she answered herself.</p><p>\"Okay,\" she said thickly, noticing Derik was watching her with amazement. \"Let's do it before I lose my nerve.\"</p><p>\"How romantic,\" he commented. He was crouched over the fire, balanced on the balls of his feet. \"Are you all right? You look a little . . . bloated.\"</p><p>\"Do me,\" she commanded, and stripped off her shirt. Her belly, bulging with marshmallows, pooched out over the waistband of her jeans. \"You know you want to.\"</p><p>\"Uh . . . right this minute? I wouldn't bet the farm. Maybe you should lie down.\"</p><p>\"No, no, no. We're gonna do it. Wehave to do it, to save the world.\" She groaned and massaged her belly. \"And to sleep in a warm bed tomorrow night. And to have a shower! Think of it, all that warm water . . . and soap, think of the soap!\"</p><p>\"I can't do this,\" he announced. \"It's too much like taking advantage.\"</p><p>\"You're right about that, but I'll be the one— hurp!—taking advantage. Now get over here.\" She painfully wiggled out of her jeans, then lay, gasping like a landed trout, beside the fire.</p><p>Derik, was trying not to laugh, and as a result his face had gone an alarming shade of apple-red. \"I don't think you're up to this tonight,\" he gasped.</p><p>\"Aw, shaddup, when I want you to think, I'll yank your leash.\"</p><p>\"Now you're just being mean.\"</p><p>\"Whatever works, pal. Now strip.\"</p><p>\"Oh, it's like that? Strip?\"</p><p>She reached out and cupped the warm bulge in his jeans. \"Like you're not dying to.\"</p><p>\"Well, that's true,\" he said, and quit arguing, and in a minute he was naked, and helping her out of her bra and panties—</p><p>\"What's burning?\"</p><p>\"Your bra . . . sorry.\"</p><p>—and then they were rolling in the grass beside the truck, kissing and groping and moaning and for a minute Sara forgot about her grotesquely distended belly, and the mosquitoes munching on her legs.</p><p>And then he was easing inside her and that was fine—it was a little uncomfortable, because he was large and she wasn't ready, but it was all right, because she just wanted this over with, but oh, oh, she hadn't expected it to feel good, she hadn't expected .. . expected this.</p><p>He rocked against her, obligingly smacking the mosquitoes he saw on her, and then his rocking speeded up, and she wriggled in the grass to give him better access, and then he stiffened all over, the cords on his neck standing out like steel.</p><p>\"Ooofta,\" she said when he collapsed over her.</p><p>\"I swear,\" he mumbled into her neck. \"I swear I'm usually much better at this.\"</p><p>\"No, no, it's all right. Speed impresses me!\"</p><p>\"Sara, you're killing me.\"</p><p>She laughed, and stroked the back of his neck.</p><p>20</p><p>\"HI, I'M—JON?\"</p><p>Sara poked him in the side. \"Your name's Derik,\" she whispered.</p><p>He ignored her—and embraced the red-haired man in the doorway so hard, the poor guy left his feet. \"Jon, you son of a bitch! I thought that was your scent!\"</p><p>\"Never mind my mother,\" the other man replied, laughing. \"Or my scent. And put me down. Derik, what the hell are you doing here?\"</p><p>\"It's a long story,\" he said, jerking a thumb over his shoulder at Sara. \"This is my fiancee. We need a place to crash for the night. Okay?\"</p><p>His old friend's face lit up like a moonrise. \"Shit, yes, okay! Can you stay longer?\"</p><p>Derik shook his head and trailed the shorter man into the house. Sara, after a doubtful look around, followed. \"Got to get to the coast. Long story, which I won't bore you with. What are you doing in Kansas?\"</p><p>\"Hi,\" Jon said, extending a hand for Sara to shake. \"I'm Jon; Derik and I grew up together, and he's still got no manners at all. Welcome to my home.\"</p><p>\"Thank you,\" she said, jerking her head to get her hair out of her eyes. She thought about trying to straighten the mess and immediately dismissed it as a lost cause.</p><p>Jon was a redhead, too, except his hair was a rich, deep auburn, cut brutally short, and his eyes were the green of old Coke bottles. He was a couple of inches shorter than Derik; in fact, exactly her height. It was disconcerting to say the least, being able to look him straight in the eyes. His pupils, she noted clinically, were enormous. She had to swallow against the sudden blockage in her throat. Were all werewolves so ... unsettling and charismatic? And green-eyed? \"I'm Sara,\"</p><p>she managed at last. \"It's nice to be here. Nice to meet you, I mean.\" She noticed Jon trying not to wrinkle his nose, and sighed. \"I'll let you two catch up. Meantime, can I use your shower?\"</p><p>\"So, what the hell?' Derik had polished off the last of his steak tartare, and was now rooting through Jon's fridge for a beer. \"Last I heard, you got mated, Shannon was pregnant, and you were off to see the world. Now you're here? And where's the rest of the family?\"</p><p>\"Visiting Shannon's mother.\" Jon shuddered, \"I decided to pass. I don't like talking to grumpy old women who are hairy when the moonisn't full. I'm sorry you couldn't see my cub, though.\"</p><p>\"Heard you had a girl? Katie?\"</p><p>\"Mm-hmm. She's got my eyes and Shannon's brains, so that worked out nicely.\"</p><p>\"Very nicely,\" he agreed, still rooting. \"Listen, how come you left in the first place?\"Ah! Hello, beer, my old friend, I've come to glug you once again. He twisted the bottle cap off—werewolves disdained bottle openers—and took a deep drink.</p><p>\"Oh, yeah, that's the stuff. Oooh, baby. Anyway, how come you left? We all wondered.\"</p><p>\"Well, you know how it is.\" Jon had been tipped back in his kitchen chair, now he brought it forward until all four legs were on the floor. \"I mean, you're not there now,\" he pointed out. \"You can love the Pack but not necessarily want to be with them every second. I needed a little space. The mansion, big as it was, felt crowded after I mated.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I can relate. Mike and me almost got into a huge fight before Heft.\"</p><p>\"Over what?\"</p><p>\"Over nothing.\"</p> <p>\"Come on, cough up.\"</p><p>\"It was stupid.\"</p><p>\"Did it have anything to do with you being an alpha now?\" Jon asked quietly.</p><p>\"What, did Moira put it in the newsletter?\"</p><p>\"No. You're different. You walk different, stand different. . . even smell a little different. I bet Michael knew before you did and just waited for you to figure it out.\"</p> <p>\"Well, we almost tore each other's heads off. I had to get the hell out of there before I did something really stupid. Even for me.\"</p><p>Jon pondered that one in silence, while Derik finished the beer. Finally, he said, \"It's a dangerous business, I guess. Sometimes. You're lucky you didn't really fight. The last thing you need is to be running the Pack. Also,\" he added matter-of-factly, \"Jeannie would have shot you in the face.\"</p><p>Derik shrugged.</p><p>\"And now you're with that cute, curly haired redhead.\"</p><p>\"Yeah.\"</p><p>\"Human, huh? Well, congratulations.\"</p> <p>\"Thanks.\"</p><p>\"You don't seem like a happy mate-to-be, you'll excuse me for pointing it out.\"</p><p>\"We've been fighting a lot.\" Finally, an unvarnished truth! \"She might be having second thoughts.\"</p><p>Jon shook his head. \"She hasn't even had first thoughts. How long have you guys known each other?\"</p><p>\"Never mind.\"</p><p>\"So, less than a week.\"</p><p>\"Never mind, you nosy S.O.B.\"</p><p>\"Swept her off her feet, huh?\"</p> <p>\"Something like that,\" Derik said lamely.</p><p>\"Uh-huh.\"</p><p>\"Well, it was.\" He'd thought it would be bad, trying to fool a regular Pack member, but this was Jon. Practically his littermate! Of all the safe houses in all the world, why'd he have to walk into Jon's? \"It's been kind of a stressful week.\"</p><p>\"Mmm. You know what your mom always said.\"</p><p>\"If you chew on my hardwood floors one more time, I'll break your neck?\"</p><p>\"The other thing.\"</p><p>\"Yeah,\" he said sourly. \"Stick to your own kind.\"</p><p>Jon spread his hands, but didn't say anything.</p><p>21</p><p>\"SO!\" Sara said brightly, bouncing into the living room, which was floor-to-ceiling windows on the entire west side. She'd thought Kansas was supposed to be flat and boring, but it had a kind of wild beauty about it—like a prairie rose. And the windows in this place! Werewolves must not like being unable to see out. Well, of course she already knew that from Mr. \"Can't we please get a convertible?\" \"What should we do?\"</p><p>Derik, the big dope, nearly fell out of his chair. \"What? Now? What are you talking about?\"</p><p>\"It's only nine o'clock, calm down,\" she said. \"Do you guys want to watch a movie? Play a game?\"</p><p>\"A game?\" Jon asked. He was a yummy one, all right, with that build and that hair and those green, green eyes. No Derik, of course, but who was? He was a watcher, though, while Derik was a doer. She could tell. . . Jon didn't say much, but his eyes were always calculating, judging, weighing. She pitied the house burglar who tried to crackthis place. \"What kind of game?\"</p><p>\"I don't know . . . this isyour house. Whatcha got?\"</p><p>\"The only games we have are Candyland and Chutes and Ladders,\" Jon admitted.</p><p>\"Oh, you have a little girl, that's right—I saw the pictures in the hall. She's adorable.\" Adorable, with about six hundred too many teeth. A truly frightening smile for a four-year-old. \"Really darling.\"</p><p>\"Thank you. Shouldn't you guys—um—aren't you tired? Don't you want to go to bed?\"</p><p>\"No,\" Sara said, at the exact moment Derik said, \"Yes.\"</p><p>\"Uh-huh,\" Jon said, narrowing his eyes at Sara. \"Tell me again why you guys are—\"</p><p>\"Deck of cards?\" she said hurriedly. \"You've got to have one of those lying around.\"</p><p>\"Right!\" Derik said heartily. \"I could really go for a—a game of—vim—\"</p><p>\"Cards!\" Sara said brightly.</p><p>Jon sighed and got up. \"I think I can find one around here somewhere. Be right back.\"</p><p>Once he left, Derik muttered, \"Very smooth.\"</p><p>\"Shh! I thought you said he could hear everything.\"</p><p>\"He can. When are we going to bed?\"</p><p>\"When you stop being an asshole.\" She glanced at her watch. \"Shouldn't take more than a few years.\"</p><p>\"Very f—\"</p><p>\"Here we are,\" Jon said with fake heartiness.</p><p>\"This isn't such a great idea,\" Derik said.</p><p>\"Horny bastard,\" Sara muttered.</p><p>\"Well, yeah, but besides that.\"</p><p>\"Don't be such a spoilsport.\" Jon sat down on the end of the couch and pulled the coffee table closer to them. Though the tension was thick enough to swim through, he ignored it and, ever the polite host, handed the cards to Sara. \"One or two games, big deal.\"</p><p>Sara was blinking in confusion. \"What are you guys talking about?\"</p><p>\"Sare-Bear, we've sort of—\"</p><p>\"Got to stop calling me that.\"</p><p>\"—got the advantage. I mean, you can't bluff us. We'll know it. Your body language gives it away, even your smell changes.\"</p><p>\"Gross,\" she commented.</p><p>\"We'll always know when you have a good hand or a bad hand. It's not really fair. Now checkers ... we could play checkers ...\"</p><p>\"That's okay,\" she said. \"Cards will pass the time. Consider me warned.\"</p><p>\"Seriously,\" Jon said, shifting uncomfortably on his end of the couch. \"It's like playing cards when we can see your cards, but you can't see ours. Not very sporting.\"</p><p>\"Oh, hush up and deal. It'll be fun. What are we playing for? Got any quarters?\"</p><p>\"Oh, boy,\" Derik said half an hour later.</p><p>Sara, stacking her quarters, didn't look up.</p><p>\"Let me get this straight, no pun intended,\" Jon said. \"In ten hands, you've been dealt a full house, queens over jacks, a straight, a straight flush, four aces, another straight flush, another full house, aces over kings, and another four of a kind. Aces again.\"</p><p>\"What can I say? Lady luck likes me.\"</p><p>\"Uh-huh.\"</p><p>\"Told you it'd be fun.\"</p><p>\"Uh-huh. Derik, can I talk to you a minute?\"</p><p>\"No,\" Derik said.</p><p>\"Now.\"</p><p>\"That's what I said, now. You just misheard. Back in a minute, Sara.\"</p><p>\"You, uh, want me to come with?\" she said, nervously watching Jon grab Derik by the shoulder and haul him away.</p><p>\"No! Don't go near him. I mean, I'll be fine. I mean—\"</p><p>Then they were in the hall, and then they were in the office with the door closed.</p><p>\"Okay,\" Jon said.</p><p>\"Now, Jon—\"</p><p>\"What the hell are you up to?\"</p><p>\"Shh! Sara will hear.\"</p><p>\"She couldn't hear if I left the door open, and you know it, What's going on?\"</p><p>\"You wouldn't believe me if I told you.\"</p><p>Jon glared, and Derik didn't drop his gaze. Finally, Jon dropped his and said to the floor, \"For the record, you're both full of shit. You're not engaged, you barely know each other. You're hiding something huge, and there's something weird about your lady friend.Really weird. I can't put my finger on it... can't even get my nose around it... but it's making me really nervous.\" He rubbed the back of his neck, frowning.</p><p>\"Like I said. You wouldn't believe it.\" Derik could feel his heart rate—which had been trip-hammering at about one-eighty—slow down once Jon quit challenging him. Maybe this wouldn't be ugly. Maybe—</p><p>Jon dragged his gaze up. \"Derik, you're my friend, we grew up together. So I'm giving you the benefit of the doubt, here. And I don't want to fight, and I don't want to call Michael.\"</p><p>\"Well, shit, Jon, I don't want to fight either.\"</p><p>\"Uh-huh. But you better get your thumb out and do whatever the fuck it is you're supposed to do. I have a family.\"</p><p>Derik nodded. \"I know, Jon. Mike has one, too, and it's like my own family.You're like my own family. You think I'd screw around if it meant hurting you, or someone important to you? I'd never do that. I'd kill myself before I'd do that.\"</p><p>\"Finally,\" Jon commented, \"a truth.\"</p><p>\"Look, I'm not sure what's going to happen myself yet, but I've got it covered.\"I think.</p><p>\"Maybe I can help. Can you tell me about it?\"</p><p>\"Not really. It's hard to explain, but Sara and me—we make a good team. She can—you wouldn't believe it. But we're gonna do the right thing. She'll see to it, and I'll see to it. I swear it on my life, man. Not your family's, or Mike's, or Lara's life ...my own life.\"</p><p>There was a long, tense, moment, and then Jon relaxed. \"All right, Der. We've known each other too long not to trust each other when it gets down to the wire. Do you need help? I can come with you if—\"</p><p>\"No!\" Christ, no. He didn't want Jon anywherenear Arthur's Chosen when it went down. Bad enough he and Sara were going to be there. \"No, you stay here. Take care of your family. I'll come back and tell you all about it, when we're done.\"</p><p>\"Swear.\"</p><p>\"Swear.\"</p><p>Jon nibbled his lower lip, cut his eyes away for a moment, then finally said, \"All right, then.\"</p><p>Derik staggered down the hallway. He'd gotten away with it! Jon knew—it had been stupid to even try to fool him—but the sensible bastard was letting it ride. It wasn't the first time Derik had thanked God for Jon's basic levelheadedness. Werewolves really did have it better . . . Jon knew Derik was good for his word, and thus the unpleasantness of a fight to the death was avoided. Good deal! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Even better, he and Sara didn't have to have sex, which sucked for him but was nice for her, so that was—</p><p>He tapped on the door and walked into the guest room, just in time to see Sara drop her robe and slip between the covers. He got a tantalizing flash of cream-colored skin and streaming red curls, and then she was snuggled beneath the quilt.</p><p>\"There you are,\" she whispered. \"Close the door.\"</p> <p>He did.</p><p>\"Come over here.\"</p><p>He did.</p><p>\"Well, come on.\"</p><p>\"Uh?\"</p> <p>\"Let's get this over with.\" Then she blushed to her hairline. \"Sorry, I didn't mean it to sound like that. But let's do this before your friend gets any more suspicious. I was really worried about you when he whisked you away.\"</p><p>He was trying not to rock back on the heels; he couldn't get the smell of roses out of his nose. Not that he wanted to. Except he better. Yeah. Because if he didn't—\"Uh • • • we ... uh ...\"</p><p>She threw the quilt back, and he could see her bare leg, bent at the knee, the pale joint inviting kisses, inviting—</p><p>\"Comeon\" she said impatiently. \"Before I lose my nerve, or your friend gets any nutty ideas.\"</p><p>\"Okay,\" he said, and was out of his clothes in about six seconds. He ignored the twinges— okay, the big giant pokes—of conscience. It wasn't as hard as he thought it would be.</p><p>Her knee . . . that's what did it. It was as erotic to him as if she'd dropped the sheet and shown him her tits. And her smell. Her wonderful sweet smell. She was like—like dessert.</p> <p>You'll pay for this one later,his inner voice, the one that sounded annoyingly like Michael, informed him.Oh, boy, will you pay.</p><p>He didn't doubt it. And he couldn't help it. He was about to dance with possibly the most dangerous woman in the world ...</p><p>... and he couldn't wait.</p><p>22</p><p>I'm about to do it with a werewolf. A werewolf.Again! Sara kept saying it in her head, and it kept not working. This was weirder than the time she did it with the UPS guy. That had been like a bad porn movie come to life: \"Got a package for you, ma'am.\" \"Oooooh, a package! Bring it over here, stud.\" And then, natch, she never heard from him again. It was like he'd changed routes or something. Probably he had. But anyway, this had that beat by a country mile. A werewolf. Awerewolf!</p><p>Telling herself this was all part of saving the world didn't work, either. Truth was, Derik was magically delicious, and she meant to have another piece of him. The fact that theyhad to do it was icing on the cake. A big, blond, yummy cake. A big, muscle-y, preternaturally strong, sexy, fabulous cake. A—</p><p>Whoa.</p><p>He'd stripped in about half a second, and she barely had a glimpse of his ridiculously perfect body—washboard abs, long, long legs, flat stomach, bulging biceps, and a fairly fabulous dick, which jutted up like some sort of orgasm-seeking divining rod—before he was on her.</p> <p>\"Oh my God,\" he said, and then his mouth was on hers, he was tearing the quilt away, his tongue was in her mouth, and then he was nibbling her throat and breathing deeply, as if he couldn't get enough of the way she smelled. \"Oh, Jesus.\"</p><p>\"Are you going to talk through this whole thing? Because I'm trying to think of England, here.\"</p><p>\"Sara, for the love of God,please shut up.\"</p><p>\"Make me.\"</p><p>Then he was trailing kisses down her throat, her collarbone, her breasts. He played with her nipples until they were stiff and hard, and now she was doing a few \"oh my Gods\" herself, She squirmed beneath him, trying to give him better access, and gripped his shoulders, which were rigid with strain.</p><p>Now he was kissing her stomach, and now her mons, kissing and taking big gulps of air, and, weirdly, he was shuddering like he had a fever. Then he was coming up to her again, grabbing her thighs and slinging her legs over his shoulders. \"Sorry,\" he panted, and then she could feel his cock between her legs, urgent and heartless, and then he was shoving himself inside her.</p><p>She shrieked in surprise, then yelled again when he nipped the side of her neck. \"Sorry,\" he groaned again.</p><p>And here was the weird part. The weird, sick part. It hurt, sure. It was tight as hell. It had been a while for her—last night barely counted, that was for damn sure. And she was certainly accustomed to more than forty seconds of foreplay.</p><p>But she loved it, too. She loved that he was taking her, that he was so overcome by her they weren't playing nice. He needed to fuck her, and so he was.</p><p>And she needed to be fucked, and so she was.</p><p>He buried his face in her hair and gripped her thighs harder. The bed rocked and squeaked. She felt the change in him as his orgasm approached; his muscles, already rigid with strain, seemed to get even harder for a second, and then he was shaking over her, and then he was done, and couldn't look at her.</p><p>\"Well,\" she said, after wailing twenty seconds.</p><p>\"I swear,\" he said, still not looking at her. \"I swear I don't usually suck so much in bed. I'm aware you've heard that before.\"</p><p>She laughed; she couldn't help it. \"It's all right. You seemed, um, like you needed to do it.\"</p><p>\"Oh, I needed to do it. And in about ten minutes, I'm gonna need to do it again.\"</p><p>\"Gee,\" she said dryly, ignoring the bolt of excitement that it brought to her belly, \"I can hardly wait.\"</p><p>\"Nice try,\" he said, slipping out of her and kissing her deeply, deeply. He sucked on her tongue for a long minute, then added, \"But I can tell you like the idea.\"</p><p>\"Insufferable bastard,\" she muttered into his mouth.</p><p>\"God, you smell so good. Anybody ever tell you? I mean, seriously good.\" He stretched, and the bed creaked. \"They should bottle you.\"</p><p>\"I can safely say no one has ever suggested bottling me. So, uh, do you think Jon heard?\"</p><p>He hesitated. \"Well, yeah.\"</p><p>\"Okay. I mean, creepy, and I'll be freaking out about this tomorrow, but at least you won't get in trouble.\"</p><p>Another odd hesitation. \"Right.\"</p><p>\"Breakfast should be fun,\" she muttered. \"But at least that's done, right? So, good.\"</p><p>He didn't answer, just rolled over and kissed her again, then licked her nipples for what seemed like a delightful eternity. He cupped her left breast and brushed his thumb over her nipple again and again, while licking and kissing the other one, and then he would switch, until she was groaning and writhing beneath him.</p><p>He went lower, nuzzling between her legs, then separating her folds with his tongue, darting and licking, and then his tongue was inside her and she nearly hit the ceiling.</p><p>He settled between her thighs and over her clit and licked steadily for what seemed like an hour, until she was clawing at the bed sheets and whimpering like a maddened animal. Her orgasm hit her like a freight train, and he backed off, then was immediately on her again, spreading her apart with his hands and stroking her with his tongue and even, very very gently, biting her.</p><p>When he came up to her again she was more than ready; she wrapped her legs against his waist and was thrusting up at him before he was even seated all the way within her.</p><p>\"Oh, Christ,\" he managed, and propped himself up on his hands, and they went at each other for another eternity. She could come again if she tightened her thighs around him as he thrust, and did, and he groaned like he could feel it, feel her coming around him, and after a while she was begging him, begging him to come, and he was •nibbling the sweet spot behind her ear and ignoring her, and they were so slick with sweat they were sliding against each other, and finally she bit him on the ear, hard, and that was it, that was what he needed, and then they were done, and it took her about ten minutes to get her breath back.</p><p>When she did, she said, \"This doesn't mean we're married or anything, right?\"</p><p>\"Unfortunately, no.\"</p><p>\"What?\"</p><p>\"I said, no.\"</p><p>\"Oh. Okay. That was—\"The best in my life. Probably the best in anybody's life. Good work, old chap! \"That was really great.\"</p><p>\"I knew it'd be really great,\" he said softly, and picked up her hand, and kissed her palm.</p><p>\"Mmm. Conceited much?\"</p><p>\"Sara. Can I ask you something?\"</p><p>\"Mmm.\"</p><p>\"What happened to your mom?\"</p><p>She squinted at him, trying to see his face in the dark. \"Why would you ask me that?\"</p><p>\"I don't know ... something Dr. Cummings said. Actually, the way you reacted to something he said. It got me wondering.\"</p><p>\"Well, she was killed in a stupid accident. And it was her own fault—she wasn't watching where she was going. Plus she was jaywalking.\"</p><p>\"Oh. I'm sorry.\"</p><p>\"It's against the law for a reason, you know.\"</p><p>\"Yeah, okay. Well, I'm sorry,\" he said again.</p><p>\"Thanks. What about your folks?\"</p><p>\"They died helping Michael's dad take over the Pack.\"</p><p>\"Oh. Well, um, my mom got run over by a garbage truck.\" Pause. \"It's not funny, Derik.\"</p><p>\"I'm not laughing.\"</p><p>\"You big liar.\"</p><p>\"I'm really sorry,\" he said, sounding truly sincere. \"It was just. . . unexpected.\"</p><p>\"The really weird thing was, the city paid. I mean, I didn't sue or anything, they just gave me a big check. Just in time,\" she added glumly, \"for me to pay for the first couple years of college.\"</p><p>\"Oh.\"</p><p>\"Yeah, it was like living in 'The Monkey's Paw.' Gee, I wish I could afford to go to college . . . whoops, my mom's dead, and the city's paying for school.\" . There was a long pause. \"That's creepy.\"</p><p>\"Tell me about it,\" she said, and sighed.</p><p>Later, Sara dozed off, her small hand nestled on his chest. Derik was wide awake, ignoring the clamoring of his conscience.</p><p>Oh my God, that was so so good.</p><p>Oh my God, I'm such an asshole.</p><p>But it was so good! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And you'll pay for it, ass face. What the hell are you going to tell her? And when? Jerk.</p><p>So so good. Like, once in a lifetime good. And her poor mom! I'm glad she told me. Imagine living with—</p><p>Stay focused. Jerk.</p> <p>And oh Jesus, her smell, and the feel of her, the way she held on and whimpered and squirmed, the way—</p><p>The way you were a jerk. The way you didn't tell her she didn't have to. The way you didn't want another sleepless night.</p><p>Well, look at it this way, he thought. Maybe she'll destroy the world, and I'll never have to tell her tonight was completely unnecessary.</p><p>Nice,his inner voice—Michael's voice—said snidely.Maybe billions will die so you don't have to face the music. You're sick, dude.</p><p>23</p> <p>Derik rolled over and saw Sara sitting on the edge of the bed. \"Didja blow up the world yet?\" He mumbled, scrubbing his face with his palm.</p><p>\"Stop asking me that. And the answer is no.\" She took a sip of her coffee and grinned at him. \"So you have to get up,\"</p><p>\"Aw, man...\"</p><p>\"It's ten o'clock in the morning! I'm pretty sure the good guys don't laze away in bed, giving the bad guys plenty of time to plan.\"</p><p>\"Ummm . .. can I have a sip of your coffee?\"</p><p>\"Touch my cup and die. Jon's got a whole pot out in the kitchen. Besides, I put a ton of sugar in mine, and you don't like that.\"</p> <p>He yawned. \"How'd you know that?\"</p><p>\"I pay attention, numb nuts. Rise and shine.\"</p><p>\"Ummm . .. c'mere.\"</p><p>She scooted out of his reach. \"None of that, now. It's time to go.\" She smiled at him again. He supposed that in the movies the sun would be shining on her and she'd seem all godlike and bright to him, but this was real life, and so she only looked really really good. She was wearing a scoop-necked T-shirt that tantalized him with her cleavage, and when she smiled, her eyes lit up and looked like the deep end of a pool on a hot day. \"Play your cards right, though, and maybe we'll stop early for the day.\"</p><p>\"It's a date,\" he said, and bounded out of bed.</p><p>She nearly spilled her coffee. \"Jesus! A little warning before you do that.\"</p><p>\"Wait until I've had my coffee. Then you'll see something.\" He yawned again and scratched his ass, then remembered someone he wanted to impress was in the room, and stopped. \"Sleep good?\"</p><p>\"After you wore me out last night? I'm sort of surprised I didn't slip into a coma around two A.M.\"</p> <p>\"Awww,\" he said, and twined one of her red curls around his finger. \"That's so sweet.\" He let go, and it bounced into her eye.</p><p>\"Ow!\"</p><p>\"Oh, shit! Sorry.\"</p><p>\"As a tender moment,\" she informed him, \"that left a lot to be desired. Go take a shower.\"</p><p>\"Come with me,\" he wheedled.</p><p>\"Forget it,\" she said. \"Better hurry, or all the coffee will be gone.\"</p><p>They were finishing breakfast when Jon snapped his fingers, said, \"Forgot,\" got up, left, came back. \"Picked this up for you when I went out,\" he said, and slid a glossy magazine across the table.</p><p>\"Oh, dude! Thanks! I've been waiting for this one.\" To her complete and total amazement, Derik started thumbing through the current issue ofFine Cooking. \"I don't even know why I subscribe to this thing, it's really hard to wait for it to show up in the mail. I always end up buying it on the stands, too. Oh, well, I can always sell the extra ones on eBay.\"</p><p>\"What just happened?\" she asked.</p><p>\"If you're going to be with Derik,\" Jon said, \"you must also be obsessed with cooking.\"</p><p>\"What? Seriously?\" She looked at the big, strapping blond across from her. \"Big homemak-ing fan, are you?\"</p><p>\"No,\" Jon said as Derik became absorbed in an article on cilantro, \"but he's a big cooking fan.\"</p><p>\"I only get it for the articles,\" Derik said defensively.</p><p>\"Didn't you notice the shirt?\" Jon added, referring to Derik's black shirt with white lettering: FREE MARTHA.</p><p>\"I could hardly miss it,\" she said, \"but I thought it was some werewolf thing.\"</p><p>Jon snorted. \"To our everlasting relief, it's not.\"</p><p>\"Okay,this is the weirdest thing to happen to me this week,\" Sara said.</p><p>Derik slapped the magazine closed. \"I can't concentrate with you two jabbering like apes.\"</p><p>\"Hey, hey!\" Jon protested. \"Watch the language.\"</p><p>\"Sorry. Sara, are you ready to hit it?\"</p><p>She blinked. \"Sure, I guess. Areyou'}\"</p><p>\"I'll cook for you sometime. Then you won't give me shit.\"</p><p>\"You've been letting me slave over a hot campfire all this time?\"</p><p>\"I need my kitchen tools to do a really good job,\" he explained.</p><p>\"Great. Hey, I love to cook, too. At last, something in common! Not that, as an engaged couple, we don't have tons in common,\" she added hastily, realizing her slip. \"Because we totally, totally do. Have tons in common, I mean.Tons.\"</p><p>\"That's quite a hole you're digging with your mouth,\" Derik observed.</p><p>\"It's true,\" Jon supplied, rescuing her. \"Derik's an amazing cook. His tomato-less pizza will make you cry like a tiny girl. Don't get me started on his butterscotch cookies.\"</p><p>Sara said nothing. For the life of her, she couldn't think of a thing. Not that she was some sort of reverse chauvinist, all \"men shouldn't be in the kitchen because they're too big and strong,\" but it was hard to picture Derik in a KISS THE COOK apron.</p><p>The three of them stood around the table, Derik cradling his magazine, and there was a long, awkward moment, followed by Jon clearing his throat.</p><p>\"Well, good luck, you guys.\"</p><p>\"Thanks for letting us stay over,\" Sara said, giving him a hug. \"And for the, um, reading material.\"</p><p>\"Sure, Sara, anytime.\" Jon was looking at Derik. \"Sure you don't want an extra pair of hands?\"</p><p>\"We've got it covered,\" Derik replied. \"And by 'got it covered' I of course mean, we're pulling it out of our asses as we go along.\"</p><p>\"But don't worry,\" Sara added.</p><p>\"Right. Don't do that.\"</p><p>\"At least stay through the full moon,\" Jon coaxed. \"Rest up, figure out the rest of your plan.\"</p><p>\"We gotta hit it, Jon. It'll be fine. We'll be in a state park somewhere when She comes up.\"</p><p>\"Don't forget your promise,\" Jon said.</p><p>\"We'll be back,\" Derik said.</p><p>\"We're like terminators that way,\" Sara added brightly.</p><p>24</p><p>They were in another campsite, supper was done, even the dishes were done. Now they were snuggling beside the campfire, and when Sara looked up into his face, she noticed his eyes glowed back yellow-green. It was startling, yet comforting.</p><p>\"You know, the thing about Jon,\" she began.</p><p>\"Oh, good, I was hoping you were going to talk about another guy.\"</p><p>She ignored that. \"He seemed like a regular person, you know? I mean, to look at him, you wouldn't think, 'Thar's a werewolf, git the gun, Paw.'\"</p><p>\"Christ, I hope not. And I guess it makes sense. There's not very many of us. And there's tons of you. So I guess we blend in pretty good.\"</p><p>\"I mean, I see you all the time, and I forget about it a lot, unless you do something to remind me. Like this morning. I blinked, and you were on the other side of the room; It freaked me out.\"</p><p>\"I can't help it\"—he sighed—\"if I've evolved as a genetically superior being.\"</p><p>\"Oh, shut the hell up. Listen, what's the real reason you're avoiding your family? The Pack?\"</p><p>\"Huh?\"</p><p>\"Well, you just seem awfully concerned that they'll catch up with us, but not just because they'll try to ice me. So what's up with that?\"</p><p>\"It's . .. kind of complicated.\"</p><p>\"Derik...\"</p><p>\"Well.. . you know what an alpha is, right? Like the boss of a group? And our Pack has an alpha. It's Michael. Which is totally fine. But sometimes . . . sometimes alphas aren't born, they're made. And I don't know how it happened, but in the last couple of weeks I've wanted . . . wanted things I don't deserve. At least I think I don't deserve them. And I left before things could get... well, you know.\"</p><p>\"Oh.'</p><p>\"I can't go home again. So,\" he added, forcing cheer, \"it's just as well that this whole save-the-world thing came up, you know?\"</p><p>\"Well, what I don't get is—\"</p><p>\"Can we change the subject?\"</p><p>\"Uh . .. sure. So, what's the plan for tomorrow night?\"</p><p>\"Before or after we have hot, wild monkey sex?\"</p><p>\"Can we have a serious talk, here? Like for thirty seconds? Is that too much for you?\"</p><p>\"I can't help it if I'd rather picture you naked than talk about our feelings, or whatever.\"</p><p>\"I'm not even talking about our feelings, you half-wit!\" She saw that he was delighted he'd teased her into yelling. \"Very funny. Are you gonna answer the question?\"</p><p>\"Well. We'll have to make sure we're pulled over by the time the sun goes down, that's all. I'll Change, you'll sleep, I'll probably bring down a couple of rabbits and then curl up next to the fire, blah-blah.\"</p><p>\"Blahblah} This is the most surreal conversation I've ever had,\" she announced, \"and it's been quite a week for me, in case you hadn't noticed. You'll curl up next to the fire? Like a good boy? Should we pull over and get you some Milk Bones?\"</p><p>\"You know,\" he grumped,\"some people would be a little nervous about spending the night in the woods with a werewolf.\"</p><p>\"Some people cheat on their taxes. It's a weird world.\" She slipped her hand under his shirt. His pro-Martha Stewart shirt. Best not to go that route, if she wanted to maintain her horniness. \"So, uh, you got any plans for the rest of the evening?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Well, I was thinking about jumping your bones and then taking a nap.\"</p><p>\"Excellent! Oh, wait a minute, I'm not that easy.\" Heck, two nights ago she'd been fervently . .. well, a little bit... opposed to making love with a perfect stranger. Although Derik was far from perfect. \"What the hell.\" She sighed as he bent and nibbled on her throat. \"Yes, I am. By the way, I'm on the Pill. And I assume you're disease-free, being a genetically superior irritating being and all.\"</p><p>\"The Pill?\" He paused in mid-nibble. \"Oh. Okay. That's good.\"</p> <p>It didn't sound like he thought it was good. In fact, it sounded like he thought it was the opposite of good. \"What, you wanted me to get pregnant?\" she joked.</p><p>\"No, no.\"</p><p>Weird. Because he sounded . . . disappointed? Maybe it was. a cultural thing. She'd figure it out later.</p><p>She slapped a mosquito and kissed him back, delighting in the feel of his hard stomach beneath her fingers, the way his taut muscles rippled under—</p><p>\"Ouch, damn it!\"</p> <p>\"What? What?\"</p><p>\"I'm getting eaten alive, here.\"</p><p>\"Yeah, I know,\" he murmured into her ear. \"And if you give me another minute, I'll—\"</p><p>\"I meant by bugs, idiot.\"</p><p>\"Oh.\"</p><p>\"Where's the Off?\"</p> <p>\"Poison in a can? No. No, Sara. Please,\" he begged as she got up in search of relief. \"Don't put that stuff all over you. Please!\"</p><p>\"Derik,\" she said, exasperated. \"I'm going to be one big mosquito bite tomorrow. I'm sorry you don't like the smell, but—\"</p><p>\"Let's go in the truck,\" he suggested.</p><p>She paused and slapped another flying vampire. \"Good idea.\"</p><p>In another minute, they were groping and moaning on the front seat.</p><p>\"Oh, God...\"</p><p>\"Urn...\"</p><p>\"Oh, that's nice . .. here . .. move over here.\"</p> <p>\"Ah... oooh.\"</p><p>\"Yeah, like that... oh, God.\"</p><p>\"Ooooh, baby.\"</p><p>\"That's-ow!\"</p><p>\"What?\"</p><p>\"The gearshift is sticking into my neck . . . there. Um. Okay, that's better. Move your hand an inch to the . . . yeah. Oooh.\"</p><p>\"Mmm.\"</p><p>\"Ow!\"</p><p>\"What?\"</p><p>\"Your foot is caught in my shirt.\"</p><p>\"Sorry...\"</p><p>\"That's better .. . yeah ... um ... here, raise up ... a little more.\"</p><p>\"Oh, Christ.\"</p><p>\"Yeah.\"</p><p>\"Do not stop.\"</p><p>\"Well, I don't—ow!\"</p><p>He sighed. \"What?\"</p><p>\"What, what? My head is on the floor mat, and you're confused?\" She puffed hair out of her eyes, but due to her upside-down position, it just flopped back. \"It's a mystery why I'm protesting?\"</p><p>\"Sorry. How's that?\"</p><p>\"Derik, this isn't working.\"</p><p>''What are you talking about?\" He was panting, disheveled, bottomless. She would have laughed if she hadn't been so uncomfortable. \"It's fine.\"</p><p>\"What are you, high? You are, aren't you? And you aren't even sharing the good drugs.\"</p><p>\"You're the one with a prescription pad. Besides, you're just not giving it a chance.\"</p><p>\"Yourfoot was in myshirt. And now I have Raisinettes in my hair.\"</p><p>He burst out laughing. \"Okay, okay. You win. Go put the fucking poison on.\"</p><p>\"Forget it. Let's just bag it for tonight.\"</p><p>\"Aw, man...\" He indicated his dick, which was happy to see her. \"I'm kind of in an awkward situation, here.\"</p><p>\"So? Your erection will go away.\" She grinned. \"You know, eventually.\"</p><p>\"Aw, Sara . . . you're killing me. I mean, sincerely killing me. I think your luck is going to make my balls blow up.\"</p><p>\"Yeah, yeah, cry me a river.\" She paused. He really did look pathetic. \"Maybe I could help you out.\"</p><p>\"Please?\" he begged.</p><p>She wriggled and squirmed around and finally found herself in a position that didn't make her want to scream with pain. She gripped him by the root, pumped up and down, then bent and licked the pearly drop off his tip.</p><p>\"Oh my God,\" Derik gasped, his hips thrusting toward her. \"Oh, Christ, donot stop.\"</p><p>She licked and pumped and licked some more, and then his hand was on the back of her neck and she had a sense of his crushing power, power held in fierce check, heard him moan, \"Don't stop . . . don't. . . don't...\" Then he was pulsing into her mouth.</p><p>\"Yech!\" she said a minute later, while he lay gasping and limp as a noodle—all over. \"What have you been eating?\"</p><p>He rolled his eyes until he was looking at-her. \"Can't you just let me bask in the moment, here?\" he sighed.</p><p>\"Go jump in the lake,\" she replied. \"Literally.\"</p><p>25</p><p>Sara kept looking at him out of the corner of her eye, but she did it once too often, because finally Derik said, exasperated, \"What?\"</p><p>\"Sorry.\"</p><p>\"I can tell you that when I Change, you'll definitely notice. How 'bout that? So stop sneaking looks at me; it's creeping me right the hell out.\"</p><p>\"Give me a break,\" she said, slightly defensively. \"It's been a weird week. I can't help being a little nervous.\"</p><p>\"Well, don't be. I'd never hurt you.\"</p><p>\"No, just kill me.\"</p><p>\"Yeah, but it wouldn't have hurt,\" he said easily.</p><p>She could actually feel her eyes bulge in her head as her blood pressure zoomed. \"Oh my God, you're serious!\" He just looked at her.</p><p>\"Okay, well, you can go run off in the woods now,\" she said. \"I'm pissed again.\"</p><p>\"In a few minutes.\" The sky was a gorgeous blaze of pinks and reds—atruly staggering sunset. And she was too annoyed and freaked out to appreciate it. \"You okay?\"</p><p>\"Sure. Sure I am.\" She sneaked a glance at her wristwatch. It had been a long day—she'd spent it staring out the window, at the moon. Last night—heck, the night at Jon's—seemed a thousand years ago.</p><p>\"Look, you're all set here, right? Just stay with the truck. I'll probably stick close, anyway. Stop looking at your watch, it's making me nuts.\"</p><p>\"Sorry,\" she said, and like a bad dream, her gaze snuck to her watch again. \"So, is it, like,Farmer's Almanac sunset that you change? Or actual full dark? Because it's a full moon right now, you know.\"</p><p>\"I know,\" he said, and did his voice sound ... thick? She snuck another glance at him and noted he was staring dreamily at the sky. \"Sunset to sunrise. That's when we run with Her.\"</p><p>\"Oookay. I'll be cringing in my sleeping bag if you need me.\" She started toward the truck, and quick as thought, he had her by the arm, gently restraining her. His nails, she noticed with a detachment that was almost like being drugged, were quite long, and curving under.</p><p>Sure, it was like being drugged. She was scared, and her brain was trying to help her deal with that fear by going into analyze overload.</p><p>Oh, for God's sake, Sara!This was Derik, and bad first impressions aside, he'd chew off his left hand before hurting her.</p><p>That was true, and she felt better, even if the sight of those nails—claws, really—was a bit upsetting. \"What? What is it?\"</p><p>\"Stay with the truck,\" he said again, and itwasn't her imagination; hewas speaking with difficulty.</p><p>\"Okay,\" she said. \"You told me that already, but okay.\"</p><p>Then he was kissing her, almost devouring her, his tongue was in her mouth, and he'd picked her up off her feet, his arms were tight around her back. And he seemed—bigger? Was that possible? Or maybe he just seemed more there, because he was so close to his change.</p><p>His mouth moved to her throat... and then he abruptly pulled back.</p><p>\"Well,\" she said, almost panted. \"That was... urn, interesting. Could you let go of my arm now?\"</p><p>He did, and was rapidly shedding his clothes, in fact, the only time she saw him undress quicker was when they were about to have sex that first time. Was it only the day before yesterday?</p><p>\"Easy,\" she said as the button fly on his Levis went flying. She could hear something—was he grinding his teeth?</p><p>No; he was Changing. If she had blinked she would have missed it. He fell to his hands and knees, and his blonde hair grew out, and his fingernails were digging into the dirt of the campsite, and then an enormous wolf was looking up at her, a wolf with fur the exact color of Derik's hair, a wolf with green eyes like lamps in the dark.</p><p>The wolf leaned forward, and she bent to it— to him—and he nuzzled her, a quick snuffly kiss, and then she heard the growl ripping out of him and turned so quickly she nearly lost her balance.</p><p>There was a smaller wolf at the edge of their camp, hesitating as if sensing the borders of their territory. This one was coal black, with the yellow-gold eyes of a calico cat. And quite small, really very small; Derik quit growling and loped over, and it was shocking how much bigger he was than the other one.</p><p>They sniffed each other, and she noticed Derik was at ease with his enormous size, and was trying to put the other one at ease, too. The other one was almost timid, backing off but not running away.</p><p>Then she realized: The other one was female. And they were ... they were going off together! Without so much as a backward look, that fuzzy slut went and nabbed her would-be assassin/ boyfriend/fake fiance.</p><p>\"Well, shit,\" she said, and kicked one of the truck's tires.</p><p>Derik bounded up to their campsite the next morning, lured by the smell of frying bacon. He was so relaxed, and in such a good mood, it took him a while to realize something was wrong.</p><p>He supposed he should have expected it. Shewas human, even if she was an extraordinary one. And he did turn into a wolf in front of her. That was probably pretty weird for her. He'd thought about going off into the woods a good half hour before the sun set to spare her the admittedly odd sight, and in the end he'd shit-canned the idea. Because this was who he was, and if she didn't like it, tough. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But it was more than that: He wanted her to see. See all of him, and not be afraid.</p><p>\"What's wrong?\" he finally asked, deciding to grab the bull by the horns.</p><p>\"Nothing.\"</p> <p>\"Oh. Are you, uh, mad about something?\"</p><p>\"No,\" she lied.</p><p>\"Oh.\" Honest to God, he had no idea what to do now. She was lying, and he knew she was lying, and she probably knew he knew she was lying. So what the fuck? \"So, uh, everything go okay last night?\"</p><p>\"Fine.\"</p><p>\"That's good.\" Tell her she was lying? Ignore the fact that she was lying? Tell her but at the same time forgive her for lying? Tell a lie himself?</p> <p>What? \"Are you mad because I didn't bring back a rabbit? I thought about it, but to be honest, skinning and cleaning one would be a pretty messy job, and I didn't think-you—\"</p><p>\"I really don't care, Derik.\"</p><p>\"Oh.\"</p><p>\"So,\" she grumped, poking the fire.</p><p>\"So, what?\" He stretched, feeling pleasantly pooped. \"Is there any bacon left?\"</p><p>\"You know damned well there is,\" she snapped. \"Where's what's-her-fur?\"</p> <p>\"Huh?\" He sat up, puzzled. She wasn't kidding around. Not at all. She waspissed. She smelled exactly like the campfire. \"What? Did you wake up with a spider on you?What is it?\"</p><p>\"That hair-covered-whore you took off with last night, as if you don't remember. That'swhat.\"</p><p>\"Hair-covered . .. oh, you mean Mandy?\"</p><p>\"Mandy,\" she sneered.</p><p>\"She's not a hair-covered-whore,\" he said defensively. \"She owns her own accounting firm. And she's not here. She went home.\"</p><p>She shook the spatula at him, and he dodged drops of hot grease. \"Look, all I want is the truth. Just tell me the truth, okay? I promise I won't get mad.\"</p><p>\"But you're already mad,\" he said, wondering if he could crawl underneath the fire. The truth was, he was sort of morbidly curious ... what would her powers do to him if she was just mad, but not defending her life? Maybe just give him dandruff, or a sprained ankle. \"Really, really mad.\"</p><p>\"Oh, shut up. Did you guys do it out there in the woods?\"</p> <p>\"Do—oh. Oh!\" He laughed out of relief, then dodged as she jabbed the spatula at him. \"Sara, for crying out loud. Mandy'sgot a mate. We just paired up to hunt. Remember: Way more of you guys than us. It's really rare to just run into one of us in the woods. So we teamed up. She was on her own, because it was his turn to stay home with the cubs.\"</p><p>\"Hmm.\" She was staring at him with narrowed eyes, but he could tell she felt better.</p><p>\"I can't believe this! You've been stewing about this all morning?\" He was trying to stop laughing; it wasn't likely to make her less mad.</p><p>\"The most powerful sorceress in the world is jealous of an accountant?\"</p><p>\"M'not jealous,\" she muttered. \"Just wanted to know, is all.\"</p><p>\"Well, now you do. And thanks for the vote of confidence, by the way. Yes, we werewolves are so slutty we do it with anything on four legs.\"</p><p>\"I didn't mean it quite like that,\" she mumbled.</p><p>\"Yeah, sure you didn't.\"</p><p>\"Well, I'm sorry,\" she grumped.</p><p>\"Besides, I'd never go off with another female now. I'd—\" He'd shut his mouth with a snap.</p><p>\"You'd what?\"</p><p>\"I'd get some of that bacon, like, pronto. I'm starving!\"</p><p>\"And the Universe,\" Sara said dryly, \"realigns itself.\"</p><p>\"Seriously,\" he said after a long moment. \"That was really dumb.\"</p><p>\"Oh, shut up,\" she said, but he knew she wasn't mad anymore. Even if she hadn't smelled like roses again, she fixed a whole 'nother pound of bacon, just for him.</p><p>26</p><p>They were in St. Louis, and to tell the truth, Sara was getting pretty damned sick of the truck. And sick of sleeping outside. And sick of the smell of campfire, how it clung to her hair and clothes and skin.</p><p>And really, really sick of bacon. Derik, it appeared, could eat it with every meal. She could not.</p><p>But none of that mattered, none of it was important, because, as sick as she was of the whole thing, she didn't want it to end. She wanted to stay like this with Derik—in this adventure limbo—forever.</p><p>Because the world would end, or it wouldn't, and either way Derik would be out of her life.</p><p>Unacceptable.</p><p>That's nice,she told herself.Put off saving the world so you can get boned a few more times. Very nice.</p><p>\"Over halfway there,\" Derik said.</p><p>\"Uh-huh.\"</p><p>Right. Because werewolf lovers come along all the time. Why shouldn't I want to hang on to some happiness?</p><p>She coughed. \"Listen, is there a plan for when we get there? How do we find these guys, anyway? And then what do we do, once we find them?\"</p><p>\"I figured your luck would help us out with finding them. Shit, you'll probably trip and fall on the leader and accidentally give him a fatal concussion. As for the rest of it... I can take care of the rest of it.\"</p><p>\"You have no idea what the plan is, do you?\"</p><p>\"Never mind,\" he said primly, which made her laugh.</p><p>\"It's okay,\" she said. \"We've got some time to work on it, thank God,\"</p><p>\"Mmm. Listen, this Morgan Le Fay business . . . maybe if Arthur's Idiots find out you're a good enough gal, they'll stop trying to kill you. I mean, we've only got Dr. Cummings's word for it that they're the bad guys.\"</p><p>\"That and what I saw with my own eyes at the hospital,\" she pointed out.</p><p>\"Oh, right. Well, like I said, maybe once they find out you're not bad, they'll forget about the whole thing.\"</p><p>\"And maybe,\" she added brightly, \"I'll get caught up on my laundry this week. But probably not.\"</p><p>\"Seriously. Morgan's whole deal was that she was wicked, bad, blah-blah, but you're not like that.\"</p><p>\"Morgan's whole deal, as you so annoyingly put it, is that Merlin set her up, screwed over her family,splintered her family, and then took off after he did all that damage.\"</p><p>\"Oh.\" He paused. \"Really?\"</p><p>\"Listen, without his interference, she could have been Arthur's greatest champion. She really could have. But she's been totally screwed over, not just by real life but by history, too. Men write the history books,\" she added neutrally. \"So naturally their take on it was that Morgan was this wicked terrible evil witch who destroyed Arthur because she could. But that's not true at all. She wasset up to destroy him. And then she did. But if things had been different,. . .\"</p><p>\"Oh.\"</p><p>\"If she'd had a normal family life ... a normal upbringing . . . who knows?\"</p><p>\"Huh.\"</p><p>\"This is the part where you say, 'I never thought about it like that.'\"</p><p>\"Well, I never did.\"</p><p>\"Exactly. Men. I mean, I'm not mad about it or anything, because you can't help thinking with your dicks all the time—\"</p><p>\"As long as you're not mad.\"</p><p>\"Stop the truck!\" she shouted suddenly, and Derik stood on the brakes. Sara was half-strangled by her seat belt, but finally fought free of it and opened her door. She reached back, grabbed the large duffel bag they were using as a communal suitcase, and said, \"Come on.\"</p><p>\"Come on, what?\"</p><p>\"Trust me.\"</p><p>She ran toward the .. . Amtrak station, Derik belatedly noticed. He ran after her. \"A train?\" he called. \"You want to take a train? Why didn't you say so when we first started seeing trains?\"</p><p>\"I dunno. I'm sick of that truck,\" she explained, entering the busy station. \"And I'll bet you a million dollars we can find a train that goes to Boston. We can ride instead of driving.\"</p><p>\"One of ushas been riding instead of driving.\"</p><p>\"That's because you're a wheel hog. You wouldn't let me drive after that one time.\"</p><p>\"You can't drive a stick.\"</p><p>\"I can, too!\"</p><p>\"So we were stalling all the time, why again? And what are we doing looking for a train?\"</p><p>\"I don't know,\" she said, \"but I think it's going to be all right.\"</p><p>\"When we don't have a ticket? What am I saying. The ticket guy won't notice us, or will pretend like we have tickets, because his wife left him this morning, or Amtrak's entire computer system will crash, and they'll be too distracted to worry about two strangers on a train.\"</p><p>\"Exactly.\"</p><p>\"So, this is like instinct?\"</p><p>\"Exactly.\"</p><p>He was following her past the ticket windows. \"Okay.\"</p><p>She turned to look at him over her shoulder. \"Really okay?\"</p><p>\"Sure. I'm a huge believer in instinct. Besides\"—he smiled at her—\"you haven't steered us wrong yet.\"</p><p>27</p><p>\"You know, I could get used to this,\" Derik said, climbing into the sleeping berth beside Sara, who was propped up on one elbow, looking out the window. \"No ticket, no money? No problem!\"</p><p>\"I was wondering if it would work,\" she said, not looking around. \"I'm sick of my power—my whatever-it-is—being passive, you know? I wanted to see if I could make it work.\"</p><p>\"And you did.\"</p><p>\"Ithink I did.. .\"</p><p>\"And say, hon, can you see anything out there?\"</p><p>\"Ican't,\" she said, looking over her shoulder and smiling at him. It was ridiculous what a gorgeous smile she had. \"Come here and narrate.\"</p><p>He curled up behind her and peeked over the top of her head, out the window. \"Well. . . that's a farm . . . and that's another farm . . . oh, there's a herd of cows, sound asleep . . . mmm . . . cows ...\"</p><p>\"Don't start, you just ate.\"</p><p>\"What, 'just'? Half an hour ago. Oh, now look here, the land's thinning out, probably because ... yep, there's a river ... you can see those lights, right? Probably a town right on the river. Where the hell are we?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Somewhere in the Midwest.\"</p><p>\"Well,\" he said, nuzzling the back of her neck, \"that narrows it down.\"</p><p>\"Off my case, hose head, I'm not a walking atlas. You know, this time tomorrow, we could be getting stomped by Arthur's Chosen.\"</p> <p>\"What a cheerful thought. Thanks for the subject change.\"</p><p>\"It could all be over in just another day or two,\" she said, sounding weirdly neutral. \"Just think.\"</p><p>\"Yeah. All done. And either the world ends, or we go back to our lives.\"</p><p>\"Yeah,\" she said.</p><p>\"Um . . . Sara . . . this is going to sound dumb ... and slightly retarded ...\"</p> <p>\"Thanks for letting me brace myself.\"</p><p>\"... but I'm actually having a great time with you. I—I sort of don't want it to end.\"</p><p>\"You asshole,\" she said, and he was startled to see she was crying.</p><p>\"What? Jeez, don't do that. I freak out when you do that. Actually, it's the first time I've seen you do that, and I'm definitely freaking out.\"</p><p>\"Shut up,\" she sobbed. \"You talk too much.\"</p><p>\"Sara, what's wrong? Besides, um, everything.\"</p> <p>\"That about sums it up,\" she said, wiping her eyes. \"Everything. I don't want it to end, either. I'd rather stay on this train forever than fight and mess up and maybe die, or maybe the world dies, or maybe you die.\"</p><p>\"It'll be all right,\" he said with a total lack of conviction.</p><p>\"You're a terrible liar. Really. The worst I've ever seen.\"</p><p>\"What can I say, we're not bred for it. Not like you guys. You guys are total experts,\" he said, trying to cheer her up. \"Homo sapiens is the most deceitful, rapacious species the planet has ever—\"</p><p>\"Shut up. And have you—have you thought about—I mean, what if you're wrong?\"</p><p>He snuggled closer to her in the berth. \"I have no fucking idea what you're talking about, darling girl.\"</p><p>\"Maybe you should kill me tonight,\" she said quietly, and he nearly fell off the bunk. \"Save the world.\"</p><p>\"Bullshit!\"</p> <p>\"Don't yell, I'm right here.\"</p><p>\"You're not evil, Sara. Not even a little bit evil. So how can you destroy the world?\"</p><p>\"What if it's not a conscious act?\"</p><p>\"What if it is?\"</p><p>\"Quit that,\" she snapped. \"We'll get nowhere like this.\"</p><p>\"Exactly. So drop it, all right? I didn't go through all this crap to kill you now. Besides,\" he pointed out, \"I probably couldn't, remember? I mean, really couldn't. In addition to feeling just awful about it and not being able to make myself try again.\"</p><p>\"Oh. That's true,\" she said, cheering up. \"Your heart would probably explode if you tried.\"</p><p>\"Yeah, so quit crying, okay?\"</p><p>\"Shut the hell up and kiss me. Dumb ass.\"</p><p>He did, and she kissed him back, fiercely, almost desperately, and he smelled her fear and anxiety, and soothed her as best he could with his mouth and hands. And after a while, her anxiety gave way to lust, which kindled his own.</p><p>They shed their clothes and slid against each other, whispering, nibbling, teasing, sighing, and toward the end, he closed his eyes and breathed her perfume, and they rocked together as the train rolled through the Midwest.</p><p>\"If i tell you something,\" he said just as she was drifting off, \"you have to promise not to get mad.\"</p><p>\"Could you sound more like a big girl? What? What is it?\"</p><p>\"You have to promise not to get mad.\"</p><p>\"Whenever somebody says that, it's code for, 'you're gonna get mad as hell, so watch out'.\"</p><p>\"Yeah, well, you have to promise youwon't get mad.\"</p><p>\"No.\"</p><p>\"No?\"</p><p>\"That's right.\"</p><p>\"Shit. Sara, I've got to tell you this. I mean, it's been, like, haunting me.\"</p><p>\"So tell me.\"</p><p>\"But I don't want you to get mad,\" he whined.</p><p>\"Tough.\"</p><p>\"Gripes.\" He took a deep breath; the berth was so tiny she could feel his chest heave. \"Okay. We didn't have to have sex at Jon's. Or the night before, in the woods.\"</p><p>\"We didn't have to what what at where?\"</p><p>\"We didn't have to have sex. He knew you weren't really my fiancee.\"</p><p>\"And you kept this little tidbit to yourself, because .. . ?\"</p><p>\"Well, because I wanted to get laid,\" he said reasonably. Then, \"Owww!\"</p><p>\"What? I didn't lay a finger on you.\"</p><p>\"Oww, damn it, Sara!\"</p><p>\"You jerk! You creep! You ass! Oh,fuck!\" When she thought of the way she threw herself at him. . . dropping the robe and pulling the quilt back like a big old slut. .. telling herself they were Doing It for a good cause ... she was furious with embarrassment.</p><p>And what did it say about him, that he just boned her and never told her the truth? Other than the fact that he was a lying, sneaking, opportunistic— \"Owwwwww!\" —bastard.</p><p>\"What are you whining about?\" she snapped. \"I haven't even gotten started. You son of a bitch! You piece of shit! You—\"</p><p>\"Ow, my fucking sac!\" He was cradling his groin and rocking back and forth, as much as their crowded berth would allow. \"Sara, will you stop it?\"</p><p>\"Stop what?\"</p><p>\"Calm down,\" he begged. \"For the sake of our unborn children.\"</p><p>\"I told you, I'm not doing anything.\" But was she? She was certainly angry enough to picture a groin-related disaster. Possibly more than one.</p><p>Though his yelps of pain were doing wonders for her temper. \"Quit complaining.\"</p><p>\"Ow, ugh, ow! Oh, man.\" He moaned piteously. \"I think my testicles just imploded.\"</p><p>\"Serves you right,\" she snapped.</p><p>\"I'm serious, Sara. This is the worst pain I've ever known.\"</p><p>\"Good.\"</p><p>\"Look, I'm sorry, okay? Really, really, really, really sorry. I was sorry before you blew up my balls.\"</p><p>\"I didnot— \"</p><p>\"It's just, I couldn't have this hanging over us anymore. Especially not after what you said, about how tomorrow might be the big day, you know?\"</p><p>\"So?\" she sulked.</p><p>\"So, I wanted to tell you.\"</p><p>\"So, you did.\"</p><p>\"Yeah, but you promised not to get mad.\"</p><p>\"I did not.\"</p><p>\"Okay, well, you got your revenge, right?\" He gingerly felt himself. \"Oh, boy. I think I'm out of the Sexual Olympics for a while, Sare-Bear.\"</p><p>\"Serves you right,\" she said again, and flopped over on her side, as far away from him as she could get, which wasn't very far. \"Asshole.\"</p><p>\"Aw, c'mon,\" he coaxed. \"I said I was sorry. It's not my fault I wanted to fuck you so bad I was willing to—\"</p><p>\"You're not helping your case,\" she said grumpily, but when he snuggled contritely behind her, she let him.</p><p>28</p><p>\"Ah, boston, the sweet smell of—Sara, What thehell!\"</p><p>She had tripped, and he was too close on her heels, and went sprawling down the steps and over her. She hit the platform with a thump that made him wince and bit her tongue, hard.</p><p>\"Oww!\" she cried unnecessarily. \"I mit my mongue!\"</p><p>Derik rolled over, quick as a cat. \"You what your what?\"</p><p>\"My mongue! I mit it!\" She rolled it out, crossing her eyes in an attempt to look at it. \"Ith it mleeding?\"</p><p>\"No,\" he said, pulling her to her feet and ignoring the curious stares of their fellow passengers.</p><p>\"You nint even look!\"</p><p>\"Sara, if you were bleeding, I'd know it. Now what's the problem?\"</p><p>\"Themroblem ith that I nipped over my own two eet an—ow!\"</p><p>She'd said \"ow\" because he had grabbed her by the scruff of the neck and hauled her back up onto the train, brutally shoving passengers out of his way and ducking behind the window.</p><p>\"What? What's wrong? Is it Arthur's Chosen? They're waiting for us, aren't they?\" She clawed frantically in her pocket, came up with a Kleenex, dabbed her tongue, checked for blood, then readdressed the situation at hand. \"It's them, isn't it? Funny how imminent death totally took my mind off my sore tongue. Which still hurts like hell, FYI. It's the Chosen, isn't it?\"</p><p>\"Worse,\" he said grimly, peeking out the window. \"It's my Pack leader and his wife.\"</p><p>\"Really? More werewolves? Oh, that's so cool. And terrifying. Where?\"</p><p>\"Getdown, idiot.\"</p><p>\"Idiot? How'd you like another broken testicle?\"</p><p>He was ignoring her, peeking out the window. \"They're downwind ... thank God. But how in the hell did they know we'd be here at this particular train station at this particular ... Anto-nia.\"</p><p>\"I don't think so,\" Sara said, looking up at him from the floor. \"From what you told me, it sounded like she was keeping your secret.\"</p><p>\"How else can you explain it?\"</p><p>\"Well. There's me. I mean, my power.\"</p><p>\"Maybe.\" He peeked out the window again. \"Is it possible? Would your luck have brought them here? But how come? If Mike sees you, he'll try to kill you, and Jeannie will back him up. I mean, Mike's a toughie, but Jeannie'sinsane, especially when she's knocked up. So why would your luck put you in that position?\"</p><p>\"Are you actually having a conversation with me?\" she asked. \"Or thinking out loud?\"</p><p>\"It just doesn't make sense,\" he continued. \"The whole point is that we're trying to avoid my Pack. So what would bring them here now, right before we're about to go after the bad guys? Why are they here?\"</p><p>\"Why don't you ask them?\" Sara replied. Then she waved, looking past him. \"Hi there.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Don't kill her!\" he screeched before he even turned all the way around.</p><p>\"It's nice to see you, too, Derik,\" Michael said, yellow eyes glinting in amusement. And . . . something else. Surprise? No. Shock. They were both shocked, and covering.</p><p>\"Uh...\"</p><p>\"This is the part where he says, 'I can explain',\" Sara said helpfully.</p> <p>\"I sure as shit hope so,\" Jeannie said. She was looking bodaciously gorgeous as usual, with that shoulder-length mess of sun-colored curls, freckled nose, and flinty gaze. Terrifyingand beautiful, the perfect mate for his alpha. Right now she was nervously chewing on her lower lip. \"Start talking, or I start shooting.\"</p><p>Sara was slowly getting to her feet. \"Did you guys hear all that? You know, what he was babbling while you were walking up to us? Because I'm kind of curious, too. Not that it's not nice to meet you. Because it is, I'm sure. But what brings you here?\"</p><p>Jeannie and Michael looked at each other, then looked at Sara. \"We had to drop off a friend. She doesn't fly. Then I saw you, so we came over.\"</p><p>\"That makes perfect sense,\" Sara said. Derik was amazed; she wasn't scared at all. Meanwhile, his adrenal gland had dumped what felt like about six gallons of fight-or-flight into his system. \"I can't imagine werewolves like to fly. Stuck in an iron tube hurtling through space. I mean, it freaks me out to think of it, and I'm not claustrophobic. I don't think.\"</p><p>\"Just. . . everybody stay calm,\" Derik said.</p> <p>\"Weare calm,\" Michael pointed out.</p><p>\"Everybody relax, and I can explain everything.\"</p><p>\"Derik, we're fine,\" Sara said.</p><p>\"Just, nobody panic.\"</p><p>\"What's the matter with you?\" Jeannie asked. \"You're all twitchy and sweaty. You're usually much more laid back.\"</p><p>\"Well. You're armed, which makes me kind of nervous. And, uh, I didn't—we didn't—expect to see you here. Today, I mean. At the train station.\"</p> <p>\"We didn't expect to see you, either,\" Jeannie said. \"And with a friend.\" Blond eyebrows wiggled suggestively.</p><p>Michael stepped close and sniffed Sara. \"Agood friend,\" he said.</p><p>\"Quit that,\" Sara said, throwing up an elbow. \"It creeps me right the hell out.\"</p><p>Jeannie cleared her throat. \"Please note how I restrained myself from smelling your butt.\"</p><p>\"For which I will be forever grateful,\" Sara giggled. \"Seriously, cut it out.\" She shoved Michael back, gently enough. \"If you want to know something, just ask me.\"</p><p>\"Are you Morgan Le Fay?\"</p><p>\"Well, urn, yes.\"</p><p>\"But she's not evil,\" Derik said quickly.</p> <p>\"She doesn't smell evil,\" Michael agreed. He added, \"Evil usually smells a little more clove-like. But what I really want to know—\"</p><p>\"I want to know why I haven't gotten a hug,\" Jeannie said, spreading her arms wide. Relieved, Derik stepped close for the embrace, and then Jeannie's face shot over to the left and the entire side of his face was numb.</p><p>\"Ow!\"</p><p>\"That's for putting my kids and husband in danger while you concentrated on getting laid,\" she snapped, tapping the butt of her Clock.</p><p>\"Yeah,\" Michael said, a familiar look on hisface —amusement and disconcertedness. Jeannie had, literally, beaten him to the punch. \"What she said.\"</p><p>\"Hey, working on saving the world here, okay?\" he snapped back, rubbing his sore cheek.</p><p>\"That's why I didn't shoot you.\"</p><p>\"And what 'kids'? There's just Lara, because you're, like, five minutes pregnant.\"</p><p>\"Seven weeks.\"</p><p>\"Congratulations,\" Sara said. \"Don't touch him again.\"</p><p>Jeannie didn't even glance at her. At least she had taken her hand off her gun and buttoned her jacket back up, which was always a good sign. \"But Derik, I swear to God, if you put my family injeopardy ever again because you've got a personal agenda...\"</p><p>\"Ow!\"</p><p>\"Yeah,\" Michael added, pointing to Derik's face. \"Um, there'll be plenty more where that came from.\"</p><p>\"Don'ttouch himagain.\"</p><p>\"Or what, Red?\" Jeannie asked, supremely unimpressed.</p><p>\"Or I'll make you eat that Ann Taylor knock-off.\"</p><p>Jeannie gasped. \"It'snot a knockoff!\"</p><p>\"Regardless. Stop smacking him around. If anybody gets to hit him, I do.\"</p><p>\"Knock it off. This doesn't have anything to do with you, Red, so pipe down and shut the hell up.\"</p><p>\"How about instead I kick your ass up and down the railroad car?\"</p><p>\"I don't know about you,\" Michael said to Derik, \"but I'm experiencing a fantastic degree of sexual arousal.\"</p><p>\"I'm too nervous to get hard,\" Derik muttered back. \"Besides, I had kind of a bad night.\" Then, louder: \"Now, ladies, ladies ...\"</p><p>\"I mean, talk about nerve,\" Sara was saying. \"Sneaking up on us—\"</p><p>\"We walked up to you at five o'clock in the afternoon in broad daylight—\"</p><p>\"And being all annoying and threatening, and all we're doing is trying to save your ass, and everyone else's ass, and we get attitude for it—\"</p><p>\"He's chasing his dick instead of getting down to business! My kids are supposed to come before his sex life. And—and—\"</p><p>\"You never mind about his sex life.\"</p><p>\"I will when it's putting my family in danger.\"</p><p>\"Well then,\" Sara snapped back, \"you'd better shoot me.\"</p><p>Jeannie blinked.</p><p>Derik said, \"Don't shoot her.\"</p><p>\"I'm waaaiting,\" Sara sang, folding her arms across her chest.</p><p>\"Don't shoot her,\" Michael ordered.</p><p>\"Aw, can't I? She's so mouthy, it'd be a pure pleasure.\"</p><p>\"Look who's talking,\" Michael muttered, giving his wife a squeeze.</p><p>\"It won't work, anyway,\" Derik said. \"Don't you think I tried to ice her? It's sort of all tied up in this mess we're in.\"</p><p>\"I'm sure I could pull it off,\" Jeannie announced.</p><p>\"Try it, you dyed blond homicidal gun-toting weirdo.\"</p><p>\"I donot dye my hair!\"</p><p>\"Please stop,\" Derik begged.</p><p>\"Stop,\" Michael said, not begging, and Jeannie and Sara both closed their mouths.</p><p>\"Thank you,\" Derik said, relieved.</p><p>Michael was frowning. \"Derik, you think we're here for a reason? For real? Because we thought we were here dropping a friend off because—because of something else.\"</p><p>\"Getting to shoot someone,\" Jeannie added, \"would just be icing on the cake.\"</p><p>Sara crossed her eyes at her and stuck out her tongue. Jeannie started tapping the butt of her gun again.</p><p>\"Why don't we go get a drink, get off this train?\" Derik suggested, jabbing Sara in the ribs at the same moment Michael jabbed Jeannie. \"Talk about it?\"</p><p>\"Oh, going off and having a drink is your solution for everything,\" Jeannie snapped.</p><p>\"It makes a pleasant change from me killing you, and my wife shooting your friend,\" Michael said.</p><p>\"We could do that later,\" Sara suggested. \"If you get, you know, bored.\" .</p><p>Jeannie's forehead smoothed out, and she laughed, taken by surprise. Michael just shook his head, smiling.</p><p>29</p><p>\"So you've got money.\"</p><p>\"Yeah.\"</p><p>\"Okay, and you can take our car, we'll grab a rental for the trip back.\"</p><p>\"Thanks.\"</p><p>\"All right then. Good luck.\"</p><p>\"Mike, what's bugging you? It's not me blowing you off.\"</p><p>\"No?\"</p><p>Derik looked over at Jeannie and Sara, who were standing in the doorway of the restaurant, pretending to be polite to each other. Well, it wasn't surprising. In his experience, strong-willed women usually didn't get along. And hardly anybody got along with Jeannie. It was the alpha thing—somebody needed to be in charge. It made her perfect for the Pack, but low on girlfriends. \"No. I guess it's pretty bad. L guess you'd better tell me.\"</p><p>Michael hesitated, then plunged. \"We were really shocked to see you. Because Antonia ... Antonia is very upset.\"</p><p>\"Upset like screaming foul names upset? Upset like—\"</p><p>Mike didn't crack a smile. \"She said it was too late. She was lying down all morning and then she came to us and said it was too late. That it couldn't be fixed.\"</p><p>\"Oh. Well. .. oh.\"</p><p>\"Yeah.\"</p><p>\"But., .oh.\"</p><p>\"Yeah. So we were all hanging around the mansion waiting for the world to end—\"</p><p>\"I bet that was fun.\"</p><p>\"—and Rosie finally said she couldn't take it anymore, that if the world was going to end, she might as well head home for it, so we ran her up here to the train station. It was actually a relief to have something to do.\"</p><p>Derik didn't know what to say. It couldn't beover. They hadn't even tried to get the bad guys yet. How could it be over? But Antonia was never wrong.</p><p>And now here was his friend, talking about the end of the world like it was a normal everyday thing.</p><p>\"So,\" Michael continued, \"I'm glad we didn't spend what might be our last day fighting.\"</p><p>\"Me, too.\"</p><p>\"Good luck,\" he added with a total lack of conviction.</p><p>\"Mike,\" Derik said, then fell silent for a moment. Then, \"It'll be all right.\"</p><p>\"Yeah?\"</p><p>\"Yeah.\"</p><p>His friend shrugged. Derik still couldn't get over the weirdness of it all. They should be fighting. That's what an alpha did when a Pack member didn't do what he was told—kicked some ass. They should be fighting, and Jeannie should be doing what she did best, which was overreact when her family was in danger, and there should be a brawl right here on Milk Street. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hell, when you got right down to it, Derik should have listened to his leader in the first place.</p><p>And he didn't really believe it was done, did he? That it was too late? It couldn't be fixed?</p><p>\"Look,\" Mike was saying—uh oh, he'd better start paying attention—\"you're doing fine so far with all the, uh, ignoring my orders and hooking up with the most dangerous woman on earth—\"</p> <p>\"Thanks.\"</p><p>\"—but I've just got one piece of advice for you.\"</p><p>\"I'm waiting breathlessly, oh, wonderful Pack leader whose lightest utterance gives my life meaning.\"</p><p>\"For Christ's sake,\" Michael muttered. \"How does she put up with you? Anyway. The advice is this: Stay focused.\"</p><p>\"Stay focused.\"</p> <p>\"Yeah.\"</p><p>\"Okay.\"</p><p>\"I'm serious. Keep your eye on the ball.\"</p><p>\"It's good that you used a cliche,\" Derik replied, \"or I might not have understood your meaning.\"</p><p>\"Just keep it in mind,\" his friend said, super-mysteriously, which was annoying, but hey, at least they weren't fighting to the death, so that was all right.</p><p>\"They seemed nice,\" sara commented. For a couple of killer werewolf psychos.\" \"Hey, hey.\"</p> <p>\"Hedid sic you on me, Derik.\" \"Yeah, but he didn't know you then.\" \"What a relief,\" she said mockingly. \"Now I feel so much better. But at least now we know why they were here.\"</p><p>Derik looked at her, which was unnerving, because his pupils were unusually large; the rings of his irises were just thin hoops of green. In fact, ever since Michael and Jeannie had left, he'd been twitchy as hell. Which was making her twitchy as hell. \"I know why they were here,\" he said. \"I didn't know you knew.\"</p><p>\"It's obvious. Now we have money, and a car, and you're not worried about the Pack sniffing up our backtrail. We can focus on the matter at hand, right?\"</p><p>\"Right,\" Derik said. \"Focus. That's good advice. Actually, the.reason they were here was—oh my God!\"</p><p>\"What?\" She jerked back and looked around wildly. \"What's wrong? It's the bad guys for real this time, isn't it? Get 'em!\"</p><p>\"It's Rachel Ray! Look!\" '</p><p>Sara looked. They had been walking past the New England Aquarium and Legal Sea Foods, and she saw the cameras, the techs, the vans, the wires, and the lights; all evidence of a television show being taped. And in the distance, just disappearing into Legal's, a perfect brunette bob ...</p><p>\"Oh my God!\" Derik was rhapsodizing. \"I can't believe it! Look! They must be doing a show on Boston, or seafood. Or seafood restaurants in Boston.\" He gripped her arms and shook her like a maraca.\"Do you realize Rachel Ray is in that building less than a hundred feet away?\"</p> <p>\"This is so completely the opposite of staying focused,\" she informed him.</p><p>Incredibly, he was straightening his hair, which was so short it really never got mussed .. . not even after sex! Which was quite a trick. \"Do I look okay?\"</p><p>\"You look very pretty, Mabel.\"</p><p>\"God, I wish I had my cookbooks with me! I'd have her signThirty Minute Meals Two.\" He looked around wildly, as if expecting the book to pop out of nowhere. \"Shit! Oh, wait... I know! She can sign my shirt.\" He tugged his T-shirt out of his jeans and smoothed it.</p><p>\"If you take off the shirt, she can sign your nipple.\"</p><p>He shot her a withering look. \"This is serious business, Sara.\"</p><p>It was getting downright impossible not to burst out laughing. \"It is?\"</p><p>\"Look...\" He was holding her fingers, completely unaware that his grip was crushing. Annoying enhanced werewolf strength ... arrgghh! \"I have to do this. I mean, Ihave to. I've been watching her show ever since she started on the Food Network. Both her shows...Thirty Minute Meals andForty Dollars a Day. She's just the greatest. And I have to find out. This is my chance!\"</p><p>Sara was having a little trouble following the conversation, which she didn't beat herself up for, because it was pretty bizarre. \"Your chance for what?\"</p><p>\"To find out if she's Pack. I mean, she must be.</p><p>No ordinary human could be cuteand charmingand a great cookand do two shows for one network.\"</p><p>\"It's a persuasive argument,\" she admitted.</p><p>\"But I don't know forsure. If I get close enough to smell her, I'll know.\"</p><p>\"How can you not know?\"</p><p>\"What, there's a humongous list of werewolves, and I memorized it?\"</p><p>\"I guess not,\" she said. \"But doesn't Michael know?\"</p><p>\"He won't tell me. I've been after him for years, trying to figure it out, and he won't tell me! Bastard. How do I look?\"</p><p>\"I already told you.\"</p><p>\"Okay, well, I'm gonna go do this now.\" He took a few deep, steadying breaths. \"I have to do this.\"</p><p>\"I understand.\" She gestured toward the bright lights. \"Go to her.\"</p><p>\"Great!\" He bent, kissed her, loped off.</p><p>Sara watched him go, beyond amused. He was like a kid with a crush. A big, scary kid. She hoped Rachel would be nice to him.</p><p>Minutes later, he returned, looking so disappointed she knew at once he hadn't had a chance to meet his idol. \"There were too many people around,\" he said glumly. \"I mean, I could have gotten past them without too much—but I didn't want to scare her or make her think I was a stalker or something.\"</p><p>\"Maybe next time. Did you find out if she's a werewolf?\"</p><p>\"No. I could smell a Pack member, but I couldn't get close enough to sort it out from the rest... it could be a techie, could be her assistant, could be the guy who owns Legal's, for all I know.\" His eyes narrowed thoughtfully. \"But it's gotta be her. Itmust be her.\"</p><p>\"Well, you tried.\"</p><p>\"Yeah.\" He looked at her, a serious look. Uh-oh. \"Sara, I just wanted to say I really appreciate your support.\"</p><p>\"If by 'support' you mean 'mocking you behind your back', then yes, I am chock-full of support.\"</p><p>\"No, really, Sara. And I just wanted to say—I mean, to tell you, that maybe when this is all done, we can, you know, hit the road again, maybe try to run into Rachel again.\"</p><p>What an unbelievably weird idea.\"Okay. I mean, that'd be nice. I'd like to do that.\" As she said the words out loud, she realized it was true. \"When this is all done.\"</p><p>He took her hands again, more gently this time, she was relieved to note. \"I'm just saying, there's nobody I'd rather follow theThirty Minute Meals show with than you.\"</p><p>\"That's ... so sweet.\" She bit her lip so she wouldn't laugh. Then, to her total shock—and his, too, she'd bet—she burst into tears.</p><p>\"Oh, good,\" he said, hugging her. \"Because this is exactly the reaction I was hoping for.\"</p><p>\"I'm sorry,\" she sobbed. \"It's just that I want this to be over—over in a good way—so we can do dumb stuff like stalk Rachel Ray. Together.\"</p><p>\"Dumb?\" Then, \"I love you, Sara.\"</p><p>\"I love you, too.\"</p><p>He cradled her in his arms. His big, strong arms. She resisted the urge to melt.</p><p>\"Oh, Derik. How the hell did we get ourselves into this?\"</p><p>\"Who cares? I love you, and we'll fix it. I loved you,\" he added nostalgically, \"from the moment I tried to kill you.\"</p><p>\"It took a little longer for me,\" she confessed.</p><p>30</p><p>Sara had suggested, in a ploy to divert them from their mission and cheer Derik up, that they stop by Wordsworth and pick up a new cookbook. Derik agreed at once.</p><p>\"Is it totally lame that we're putting off going to Salem?\"</p><p>\"No.\"</p><p>\"Well, good.\" She paused, then walked into the bookstore as he held the door for her. \"Why isn't it lame, again?\"</p><p>\"We don't even know where we're supposed to go once we get to Salem,\" he pointed out reasonably. \"Maybe if we keep hanging out, your power will kick in, or the bad guys will make a move, or something.\"</p><p>\"Uh-huh. Is it just me, or has quite a bit of this world-saving trip entailed waiting around for something to happen?\"</p><p>\"It's just you,\" he said, and trotted toward the cooking section.</p><p>\"Like hell,\" she muttered. She had no desire to add to her cookbook collection, but maybe she could check the New Fiction section and see if Feehan had a...</p><p>Oh. Oh!</p><p>After a couple of minutes, she was sitting on the floor in the History section, looking up King Arthur. Which was really kind of silly, after all, she had done lots of papers in school on King Arthur and Morgan Le Fay,, so it was unlikely there would be a book here with information she didn't have on—</p><p>Arthur's Chosen. Also referred to as Arthur's Sect, Arthur's Guild, and Morgan's Bane. A mysterious sect founded in the year of King Arthur's death, Arthur's Chosen believes Arthur will return one day, but only with the help of his half sister, Morgan Le Fay...</p><p>Well. That was lucky. She'd just sit here and find out all about the bad guys, thank you very much.</p><p>Sara became absorbed.</p><p>ONE HOUR LATER...</p><p>IDIOT. FUCKING IDIOT!</p><p>\"You know better,\" he said out loud, startling the clerk standing a few feet away. He shot her an apologetic grin and followed Sara's scent out the door.</p><p>Well, isn't this what you were waiting for? Something to happen?</p><p>\"Shut up,\" he said—damn it, he was talking out loud again!</p><p>Bad move, bad guys. He could find Sara's backtrail in a snowstorm; he could certainly track her to Salem. And if they harmedone hair . . . onehalf of one hair ... if they touched her . . .breathed on her . . .thought about her...</p><p>He noticed people jumping out of his way and supposed he should calm down—he was scaring perfect strangers and really shouldn't growl in public—but he was too fucking annoyed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They weren't in Salem. They hadn't even left town. Tracking them—Sara—down had been totally super easy. He supposed he should have been suspicious, but he was too relieved.</p><p>He stomped over to the building—an abandoned warehouse near Logan Airport, of course, naturally, it was the sort of thing that all bad guys hung out in, and clearly these bad guys had been watching all the right movies—and was just about to rip the door off its hinges when his cell phone rang.</p><p>This was startling, as it hadn't rung since he left the Cape. In fact, most of the time he'd forgotten it was on his hip. He let it charge overnight and clipped it to his belt in the morning and never gave it a thought, just like he never gave pulling on Jockeys a thought. Everybody knew what he was supposedly working on, and no one wanted to bother him. Not to mention, werewolves weren't big on calling each other up and asking about the weather.</p> <p>So who was calling him? And why now, when he was about to go all Search and Rescue?</p><p>He sneezed—the stench of hydrocarbons in the area was really vomit-inducing—and flipped the phone open. Before he could even say hello, Antonia was screeching in his ear.</p><p>\"Don't do it! Derik, don't go in that building!\"</p><p>\"When this is over,\" he told her, more than a little rattled, \"we have to sit down and talk about how scary you are. You and Sara would get along great, by the way.\"</p><p>\"Turn around. Walk away. Leave now. Now!\"</p> <p>\"I can't. Sara's in there. I have to go—\"</p><p>\"Shut the fuck up! Derik, if you go in that building, you'll die. I saw it. You'll—\" Antonia's voice broke, and he nearly dropped the phone. Antonia? Worked up into tears overhis ugly ass? \"You'll die. Don't go in, Derik. Don't.\"</p><p>\"I appreciate the warning,\" he said. \"But I have to. If I don't see you again—\"</p><p>\"Don't!\"</p><p>\"—thanks for all your help.\"</p><p>\"You numb fuck! Men! I told Michael it couldn't be taken back, and what doeshe do?</p> <p>Goes to Boston for a day trip! You guys would think I was, like, wrong occasionally.\"</p><p>\"We know you're not wrong,\" he explained. \"But that doesn't mean we're going to lie down and wait for the world to end.\"</p><p>An inarticulate screech was her only answer.</p><p>\"And thanks for trying to save me. I don't suppose you saw what'll happen to Sara?\"</p><p>\"Ape! Chimp! Gorilla!\"</p><p>\"Now you're just being mean,\" he said, and closed the phone.</p><p>Nuts,he thought.I forgot to ask her how I die. Well, I suppose I'll find out in a few minutes.</p><p>He was weirdly sanguine about it, and after a moment's thought he knew why. He could face dying, if Sara was all right. He could even face the end of the world, if Sara was all right. But he couldn't stay out in this smelly parking lot and play it safe while the redhead was in trouble.</p> <p>So, he would go in. And die, because Antonia was never wrong. But maybe Sara would come out of it okay. And maybe not.</p><p>It was worth trying, anyway.</p><p>He kicked the door off its hinges, belatedly realizing it hadn't been locked. \"D'oh!\" he said, then picked the door up and sheepishly set it against the wall. \"Hello-o?\" he called. \"You guys better come get me! Quit whatever you're doing to what's-her-name and come on over here. Let's dance.\"</p><p>\"Let's dance?\" a thrillingly familiar voice said. \"That's really bad, Derik.\"</p><p>\"Sara!\" He avoided three of Arthur's Losers— the cranberry-colored robes were a dead giveaway,why did they do that?—and ran to her. \"Oh, man, thank God you're all right!\" He hugged her, lifting her off her feet. Then he shook her. \"And what the hell did you think you were doing, going off with the bad guys?\" Then he hugged her again. \"I don't know what I would have done if something had happened to you, oh, baby, baby.\" Then he shook her. \"Kicked some ass, that's what I would have done! And what is yourproblem? I tell you to stay put, and you leave? Have you never watched a horror movie in your life?\" Then he hugged her again. \"Oh, Sara, Sara ... you sweet, sweet dumb ass.\"</p><p>\"Will you stop?\" She extricated herself with difficulty and puffed a curl out of her face. \"I'm gonna throw up if you don't quit that. And I had to go with them.\"</p><p>\"What, had to?\"</p><p>\"They said—they said they had snipers. Trained on your head. And I didn't know if it was the truth or a lie. It seemed a little farfetched. But I know they use guns, because of that time in the hospital—God, was it only earlier this week? I wonder if my car's fixed yet.\"</p><p>\"Could you stay focused, please?\"</p><p>\"Iam. Anyway, I couldn't take a chance. I didn't think you—even you—could survive a head shot. They said if I went with them they wouldn't kill you. So, I went.\"</p><p>\"Dumb ass.\"</p><p>\"In retrospect, yeah.\" She lowered her voice, which was stupid, because the Chosen were right there, hearing every word. \"They needed my blood.\" She showed him the inside of her elbow, which had a drop of dried blood on it. \"And they didn't even disinfect the needle site. Bastards.\"</p><p>\"Your blood? They needed your blood?\" That didn't sound good. That didn't sound remotely good. \"Like, for to do magic? Like a spell?\"</p><p>\"I've missed their last few meetings,\" Sara said dryly, \"so I don't know exactly what they need it for.\"</p><p>He put his arm around her, protectively, then turned and glared at the Robed Weirdos. \"What's up, fellas? What'd you need her blood for?\"</p><p>The shortest Arthur's Chosen blinked. \"Who are you?\"</p><p>Derik was almost crushed. These guys clearly had access to powerful magicks, at least one of them could see the future, and they hadno fucking idea who he was! How totally embarrassing.</p><p>\"I'm this one's mate, so there,\" he snapped, squeezing so protectively that Sara yelped. \"Oh. Sorry, babe.\"</p><p>\"Mate, huh?\" Sara muttered back. \"Aw. I didn't know you cared.\"</p><p>Weirdly, the robed fellas were bowing. He could smell quite a few more and looked up ... there were at least a dozen on the catwalk, and even more in the back where he couldn't see. They wereall bowing.</p><p>\"Why are you doing that?\" Sara asked, and he was so puffed up with pride—she didn't sound afraid at all, though he knew perfectly well she was—that he almost squeezed her again. \"I don't think you should do that. Do you think they should do that, Derik?\"</p><p>\"Definitely not.\"</p><p>\"You are our sworn enemy,\" they all said in unison. Then the one who had spoken first added, \"But you are also the 'daughter of a king, and the sister of a king.\"</p><p>\"Urn ... I'm the daughter of an ad exec, and the sister of nobody,\" Sara said. \"But, thanks anyway.\"</p><p>\"Inthis incarnation,\" one robed fella said.</p><p>\"And I'm not going to destroy the world,\" she added, \"and you can't make me!\"</p><p>\"Darned right you're not,\" another of the Chosen said. \"Why do you thinkwe're here?\"</p><p>\"To, urn, kill me?\"</p><p>\"To try,\" Derik added silkily, in his turn.</p><p>\"We knew you were coming. Did you think we weren't ready? We've had years to arm ourselves with formidable magicks.\"</p><p>\"Whoa, whoa.\" Sara made the time-out sign with her hands. \"The only reason I'm here is because your Chosen Ones showed up at my hospital! My mentor told me all about you and sent us to Massachusetts. If you hadn't tried to kill me, I'd still be in California.\"</p><p>\"I'm such a loser,\" Derik muttered in her ear. \"Because that actually depressed the shit out of me. We'd never have met!\"</p><p>\"Stop thinking with your dick,\" she hissed back.</p><p>\"Your mentor is a traitor to our cause and will be killed on sight... as soon as we attend to this other business.\"</p><p>Sara gaped. \"Dr. Cummings was one of you?\"</p><p>\"Used to be one of us. Then we discovered he was a foul traitor.\"</p><p>\"He was only using us to get information for one of his doctorates,\" another one explained. \"He didn't care about our cause.\"</p><p>\"Yeah, that sounds about right,\" Sara agreed. \"He's really aggravating that way.\"</p><p>\"Nice of him to warn us, though,\" Derik said.</p><p>\"Extremely nice.\" Then Sara added, \"Besides, I can't do magic. I don't know any spells, or anything. I'm a nurse, for God's sake!\"</p><p>\"Then, as a nurse,\" one of them said from the catwalk, \"you know that sometimes it's necessary to hurt a patient to heal another one.\"</p><p>\"Uh . . . we're talking theoretically here, right?\"</p><p>\"Your blood will bring back His Majesty, King Arthur. Without your interference,woman\" —he spat that word out like someone else would have said \"child molester\"—\"he will be the greatest of all of us. He will raise Britain to heights only dreamed of. He will...not! Be! Dead!\"</p><p>\"Oh, boy,\" Derik muttered. \"Someone forgot their meds today.\"</p><p>\"Probably more than one day,\" Sara said. Then, louder: \"You mean you're not going to make me destroy the world? You're going to use my blood to—I dunno—clone or resurrect a new Arthur?\"</p><p>\"Well, sure,\" another robed one said, one not quite so frothy at the mouth. \"What'd you think we were going to do?\"</p><p>\"But Sara doesn't do magic,\" Derik said. \"In case you guys weren't listening the first time.\"</p><p>\"That's a relief,\" the mellower one said. \"It makes this all so much easier.\"</p><p>A few of the robed fellows in the corner, who had been bustling busily about during their conversation, now revealed the small lab table where they'd been working. Evil-smelling smoke was pouring from various beakers. It's color exactly matched the cranberry of their robes! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"They don't know about your luck,\" Derik whispered. \"How can they not know?\"</p><p>\"Shit, Derik,I didn't know until a few days ago. But how are they going to make Arthur just appear? Even if they cloned him, somehow, he'd have to grow. He wouldn't just appear—\"</p><p>\"We can hear you, you know,\" one of them said. \"I mean, you're only standing ten feet away.\"</p> <p>\"Aw, shut up,\" Derik said.</p><p>\"Arthur—the dead king Arthur—can't just appear,\" Sara was reasoning out loud. \"It doesn't make sense. Unless—\"</p><p>\"Doseda nosefta kerienba!\"</p><p>\"—unless they know some sort of magic spell,\" she finished, and sighed. \"Magic. Gripes! I'm from California, and I still don't believe it. Oh, yuck! Look. They're splashing my blood all over the table. Gross! And I don't see a single biohazard sign, thank you very much.\"</p><p>\"Uh,, if you don't need any more of her blood—\"</p> <p>\"Yes, yes, you're free to go,\" one of them said, without looking up.</p><p>Derik and Sara looked at each other.</p><p>\"Seriously?\" Sara finally asked.</p><p>\"Yes, yes. Go.\"</p><p>\"Go as inleave? Or go as in wait quietly in the corner for you to come over and kill us with an axe?\"</p><p>\"This makesno sense,\" Derik said. \"You tried to blow her brains out at the hospital, but now she can leave?\"</p> <p>\"We just needed some blood to complete the spell,\" Surprisingly Reasonable Robed Guy explained. \"It was the last thing. We've spent years collecting the other ingredients. And she /£ a foul sorceress. We didn't want to take any chances.\"</p><p>\"Which, since she accidentally killed all the bad guys, wasn't the worst plan, I suppose,\" Derik said grudgingly.</p><p>Surprisingly Reasonable Robed Guy shrugged. \"That was mostly Bob's plan.\"</p><p>\"So we'releaving?\" Sara blurted. \"We can just go?\"</p><p>No answer. The robed ones all took turns muttering chants and moving things around on the lab table. Sara pointed to the pentagram outlined in what looked like green chalk, which she had just noticed.</p><p>\"I have to admit,\" Derik admitted, \"I didn't really see this coming.\"</p><p>\"What do we do?\" Sara asked, gripping his hand. \"Do we leave? We can't just leave. Can we?\"</p><p>\"I... guess not.\"</p> <p>\"We didn't travel all the way across the country so they could snatch a few cc's of my blood and then kick us out.We're the good guys.We're supposed to save the world fromthem!\"</p><p>\"Hey, Sara, I'm with you, okay? What do you suggest?\" .</p><p>\"We stop them from the spell they're working on!\"</p><p>\"I don't know if messing with them when they're in the middle of performing black magic is the best idea . ..\"</p><p>\"True, but I don't think anything good can come from trying to raise the dead. It's, like, a philosophy of mine.\"</p><p>\"Even if it is King Arthur who, you gotta admit, would be kind of cool to talk to. Okay.</p><p>You stay here. On second thought, you come with me. Maybe if they try to stab me, you can give them a brain-bleed or something.\" He gripped her hand, then loosened his grip when she yelped again, and started forward. \"Hey! You guys! In the robes! Stop what you're doing!\"</p><p>31</p><p>\"Modesa noeka birienza doseda nosefta kerienba modesa noeka—\"</p><p>\"That's totally the opposite of stop what you're doing,\" Derik said, and Sara almost laughed. What a day. What a week! Nothing was turning out the way she had expected. Was that a good thing, or a bad thing?</p><p>A bubble, poison green and clear as glass, rose from the table, enveloping the chanters as it grew. With every spoken word, it got bigger. There was no pain when it enveloped her and Derik, and no smell. Suddenly, the world was green, and the bubble was still growing.</p><p>Derik rushed forward, tossing robed fellows like red checker pieces, and as she hurried to help him, the lab table fell over. The screams of the Chosen Ones almost drowned out the glass breaking.</p><p>The world was still clear green—it was like being trapped inside a mucous, bubble—but now an ominous humming had started. Sara clapped her hands over her ears—the sound was so low it made her teeth hurt—but the sound went on, and she realized it was going on inside her head.</p><p>\"We did not finish! We did not finish!\"</p><p>\"Let me guess,\" she said, taking her hands down—what was the point? \"That's bad.\"</p><p>\"The moGhurn! The moGhurn!\"</p><p>Derik was standing, brushing glass and blood off his T-shirt. \"What the hell is a moGhurn? And where are all of you guys going?\" \" There was something in the bubble with them. It was so sudden . . . one minute there was breaking glass and pandemonium and yelling, and the next she felt so heavy she had trouble breathing. The air had gotten heavier, or—it sounded dumb, but—her spirit had gotten heavier. Something had appeared, had been conjured up out of blood and despair and desperate hope, something the sect was trying to run from, but they were all trapped in the green bubble together.</p><p>The moGhurn looked like a devil crossed with an elm tree. It had a face, of sorts, and eyes and arms, and was terrible, all terrible—she could think of nothing good to describe it. It swept up members of the sect in its—arms?—branches?— and dashed them to the ground, or pulled their limbs off like her mother used to pull the leg off a chicken, and for a funny thing, it made much the same sound, the sound of gristle tearing and parting from meat, and then she bent, and stared at the green floor, and worked hard on not throwing up.</p><p>In the panic she had been separated from Derik, but now the dead gaze of the moGhurn fell on her, and it moved toward her with the rapid, inhuman speed of a snake. She backed up as far as the bubble would let her and she saw ... ... she saw ...</p><p>She saw the sect killed, all of them, heaps of robes everywhere. She saw Derik, dead. She saw the moGhurn reach for her, and then the bubble burst in a feat of amazing and unlikely luck—and tie moGhurn, delighted to be free, forgot about her and moved out into the world.</p><p>The moGhurn killed everyone in the Boston area, from the oldest man in the Chelsea nursing home, to the infant girl who was born forty minutes ago. This took the demon about two and a half hours. In a day, it had finished with Massachusetts; in a week, the Eastern seaboard. The more it destroyed, the stronger it grew—no magical green bubble to keep it in check any longer— and in a month, North America was gone.</p><p>Except for her. Lucky, lucky Sara, spared by the moGhurn, who was distracted at exactly the right moment.</p><p>And in another thirty days, she was alone. She was alone in the world. She had not meant to, but everyone was dead all the same, and the moGhurn was still hungry ... this time, Morgan Le Fay had triumphed, and her reward was a dead world.</p><p>Sara blinked, and the bubble was back. There were still bad guys running around in robes— though quite a few of them were dead. Derik was punching the bubble, trying to get out. Everything was green.</p><p>She groped, saw what she wanted, leaped for it. An empty hypo amid the broken glass and blood. She pressed the plunger, then pulled it back. Right in the heart. Instant embolism. No more luck. MoGhurn stays put.Good-bye, cruel world. Oh, Derik, and you'll never know how brave I was.</p><p>Do embolisms hurt?</p><p>No time like the present to find out. She slammed the needle forward, gritting her teeth, and then—</p><p>\"Ow!\"</p><p>Derik's hand, protectively across her chest. Goddamn it! That spooky werewolf speed could be a real pain in the ass sometimes.</p><p>\"Derik, you idiot!\" she shouted. \"I have to!\"</p><p>He jerked the needle out of the back of his hand, then tossed it. \"Like hell!\" he shouted back. \"Bad, bad, bad,bad plan. Bad Sara! No suicides today, please. If this fucking weird green circle thing ever breaks, you run like hell, Sara.\" He kissed her hard, then thrust her back. \"Run!\"</p><p>She wanted to scream after him but didn't have the breath—it had been knocked out of her by what she was seeing. Derik was running right for the moGhurn, knocking Chosen Ones out of the way like bowling pins.</p><p>\"We're supposed to be scared of a mutated oak tree?\" he shouted, then leaped for the demon, who caught him and shook him like a doll.</p><p>Shook him like adoll?</p><p>Her Derik?</p><p>Her Derik?</p><p>\"Get your tree limbs off him!\" she roared, stomping toward the demon. \"You piece of shit! You overgrown nightmare from a Tim Burton movie! You leafy motherfucker!Let him go or I will kill you, I swear it, I swear it!\"</p><p>She stomped through broken beakers, barely feeling the glass slice through her sneaker, her sock, her foot. \"Right now! Not tomorrow now, not an hour from now,now, now!\"</p><p>It towered over her, and Derik was dangling, limp, from its awful grip. She was afraid, but on top of the fear was anger—true, dark anger, that anyone, anything should treat her love like that. The moGhurn tossed Derik aside like an empty milk carton, and she saw red. Literally, saw red. It was reaching for her and she knew she was no match for it, knew it would kill her—but that was okay because it looked like Derik was dead, too, so who cared?—and she did the only thing she could as it bent toward her: She kicked it.</p><p>It screamed—horrid, awful, terrible noise— and staggered away from her. This was gratifying, if startling. It screamed, and screamed and shook, and knocked over Robed Ones, and ran around like an evil leafy tornado, and fell over, and twitched like it was being chopped down by a chainsaw, and then it shrank down into itself and disappeared.</p><p>Then the bubble popped, and she realized her foot hurt like hell, was, in fact, bleeding pretty good.</p><p>\"Who cares?\" she muttered, racing over to Derik, who was lying in the corner all crumpled and banged up. She skidded to her knees beside him, hesitated,I could ...I could ... Icould hurt him more by moving him and then turned him over. He came into her arms with a loose, boneless feel that scared her worse than the tree demon had.</p><p>\"Derik,\" she said softly, and cried at his dear, battered face, the way his head was tipped too far back in her arms—broken neck at the axis for sure, maybe the atlas as well—and the blood, all the blood. His eyes were open, but he wasn't seeing her. She groped for a pulse, found nothing. Nothing. \"Oh, Derik, you big 'dumb ass .. . you weren't supposed to die. Me, okay, and the rest of the world—a faint possibility. But not you. Never you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He's only clinically dead, you dumb ass! What, you've got no training? Get to work!</p><p>But his neck ... his neck was . . .</p><p>Get to work!</p> <p>Right. She set him down on the cement floor and started a closed chest massage. One and two and three and four. One and two and three and four.Oh, don't be dead. Don't. One and two and three and four.Oh, don't you dare leave me. Don't you dare. Like I could settle for an ordinary guy after this. Don't. And one and two and three—</p><p>\"Sara ...\"</p><p>\"Now I'm alone,\" she panted. And two and three and four. \"Alone with a zillion people in the world, and where the hell am I going to find someone else like you?\"</p><p>\"Sara...\"</p><p>\"What?\" she wept. She stopped pumping and pulled him back onto her lap. \"What, idiot?\"</p> <p>\"Where's the bad guy?\" The whites of his eyes were blood red, and blood was even leaking from his left eye like dark tears.</p><p>\"I kicked him and he died,\" she sobbed.</p><p>\"Way to make .. . make a guy feel... useful,\" he gasped, and coughed, and now there was more blood, oh, God, like there wasn't enough before.</p><p>\"Does it hurt?\" she cried. Probably not, she realized clinically; shock would keep much of the pain at bay.</p><p>\"It's pretty fucking excruciating,\" he admitted.</p><p>\"It is? Oh my God, Derik, I'm so sorry, let me go pull some robes off these dead idiots, you must be freezing.\"</p> <p>\"I just want a drink,\" he groaned. \"Possibly ten. Help me up.\"</p><p>She almost burst into fresh tears—he had no idea how badly he was hurt. How he had minutes, at the most, to live. How he had already died, and she'd only brought him back through luck and some brute skill. The damage she could see was bad enough—she couldn't imagine what had happened internally. - Crushed liver. Collapsed lungs—it was a wonder he had the breath to talk at all.Oh, Derik. \"Just—just lie still and the ambulance will come.\"</p><p>\"Sara, it stinks in here, I've had a bad day, and I'd really like to get off this disgusting floor,\" he snapped. \"Help me up.\"</p><p>\"Just lie still, Derik,\" she soothed.</p><p>He rotated his neck on his shoulders, irritably, like a man trying to work out a kink. She heard the crackling sound of air popping free of bones, and then he coughed again, wiped the blood off his chin with a grimace, and sat up in her arms. His left eye was still bloodshot. The right was entirely clear.</p><p>\"What a dump,\" he said in disgust, looking around the chaos of dead bodies, scorched robes, broken glass, upended tables. \"What a day! Let's get the hell out of here. Stop it, that tickles.\"</p><p>She was feeling him all over. \"Oh my God. Oh my God! So quick, it was so quick!\"</p><p>\"Yeah, well, superior life form, baby. I told you this already.\" He rubbed the eye that was still bloody, and when he quit she saw that it was now clear. \"Doesn't hurt that the full moon's not that far behind me. And I think you had something to do with it, too.\"</p> <p>\"Me?\" she gasped, feeling him.</p><p>\"Yeah, I wouldn't be able to heal this fast normally. I think your power—your sorcery—I dunno, wrapped me up in a magical envelope, or whatever.\"</p><p>\"Really? Let's consider this caref—\"</p><p>\"Later. Gripes, I'm sore. What a day.\"</p><p>\"Shut the hell up.\" She put her thumbs on his lower lids and pulled them down. The sclera of both eyes were a perfectly healthy pink. \"I can't believe it, I can't believe it! It was so fast!\"</p><p>\"Like I said. I think I've got you to thank for that. I mean, I'm a fast healer, but that was extra special. Maybe your power sort of wrapped me up, like a lucky hug. Or something.\" He grinned.\"I'd hug you, but first I need a new shirt. And possibly new underpants—that tree demon thingy was scary.\"</p><p>\"What about Arthur's Chosen?\" she asked, almost whispered. She'd never been in a room full of dead bodies before—not since nursing school.</p><p>\"What about 'em? They're all dead.Luckily, the demon killed them all, and then you fucked him up before he could do anything else.\"</p><p>\"You're right,\" she said after a minute. \"Iam scary.\"</p><p>\"Scarier than taxes, babe.\"</p><p>He took her hand and led her from the warehouse she'd honestly thought was to become her tomb.</p><p>32</p><p>\"I guess the question, 'Will they be surprised to see us?' has been answered,\" Sara commented as they pulled up to Wyndham Manor. A huge banner reading GOOD WORK SAVING THE WORLD was strung across the front entryway.</p><p>They got out of the car, just as a dizzying parade of people poured out of the doors of the house—mansion, really. Sara found herself picked up and hugged by Michael and several other ridiculously good-looking men she'd never met before. Jeannie was kissing and hugging Derik, and a petite, stunning blonde was climbing all over him like a monkey, laughing and saying over and over again, \"You did it! I can't believe you did it!\"</p><p>Then intros: Michael and Jeannie (whom she already knew), and their daughter, Lara, who had her father's odd yellow brown eyes and her mother's aggressiveness, and the petite blonde was Moira, and oh, several others that she lost track of, but she didn't mind, because even though they were all strangers, it was exactly like coming home.</p><p>\"So you told them we were coming, huh?\" Derik asked.</p><p>Antonia, who was just as ridiculously breath taking as the rest of them, shrugged. \"Don't get pissy. It's what I do.\"</p><p>\"Thanks for all your help,\" Sara said.</p><p>Antonia grunted. Sara had never known that someone who looked like a swimsuit model could be so sullen.</p><p>\"So, what's next for you two?\" Jeannie asked, picking up the pitcher of lemonade, pouring herself a glass, then promptly draining it off. They were sitting in a gorgeous sunroom, the remains of a glorious lunch laid out before them. \"And why did I do.that?\" she griped aloud. \"Like I don't have to pee often enough. Pregnancy,\" she finished in a mutter.</p><p>\"You're glowing,\" Michael said automatically.</p><p>\"That's because of all the puking,\" she retorted.</p><p>\"So?\" Michael prompted. \"You guys? What's next?\"</p><p>\"Um ...\" Sara said, because she didn't have a clue.</p><p>\"Well, we're getting married in a couple of days, and Mike's going to give us an RV for a wedding present, and then we're going to drive around the country looking for Rachel Ray.\"</p><p>\"That's the lamest marriage proposal ever,\" Sara commented, while Antonia actually cracked a smile.</p><p>\"Yeah, but you're gonna go along with it.\" When she didn't say anything, he dropped the cocky pose. \"Right, Sara? Sara? Right? You're gonna be my mate, right? Sara?\"</p><p>\"Oh, Christ, tell him yes,\" Antonia said, rolling her great dark eyes. \"Before I pick up this fork and jam it into my ear, just so I don't have to listen to any more of that.\"</p><p>\"Actually, it's a refreshing change,\" Michael commented, biting the chicken leg in half and sucking out the marrow in one slurp. Sara managed to conceal her shudder. \"Keep him on the hook, Sara.\"</p><p>\"Never mind,\" she told them, and then said to Derik, \"It would have been nice to have been asked, jerk. But it sounds like a fine plan.\"</p><p>\"Congratulations,\" Antonia said, bored. Then she leaned forward and speared Derik with her gaze. \"And before I forget, numb nuts, who told you to go to her house and kill her?\"</p><p>\"Huh? I mean, you did.\"</p><p>\"No, I told you totake care of her. As in, look out for her, so she could destroy the moGhurn when it manifested.\"</p><p>\"What?Wait just a goddamned minute! Younever told me to look out for her. You told me—</p><p>\"Well, I knew you wouldn't be able to ice her, but I wanted you to stay close anyway,\" Antonia explained. \"The world was saved because you were fated to love her, not because you were fated to kill her. Not to mention, you were fated to die ,. . but not for too long. Dumb ass.\"</p><p>\"Nowwait one minute.\" Derik was as furious as Sara had ever seen him. She clutched at his sleeve, trying to get him to sit down, but he towered over Antonia and ignored Sara's tugging. \"You sent me there to—\"</p><p>\"Take care of her—do I have to get out the hand puppets? Look, Derik, I couldn't tell you the whole thing. We probably wouldn't be sitting here right now if you'd known what I'd known. Not that you could ever be bright enough to know what I know—\"</p><p>\"'Goddamnit, Antonia!\"</p><p>\"Oh, take a chill pill. Everything that happened this week, you guys had to do. Itall led to the big showdown. High noon in Boston, so to speak.\"</p><p>\"I still don't get it,\" Sara confessed. \"The bad guys—Arthur's Chosen—made the demon-thingy on purpose? No?\"</p><p>\"No, it was an accident. You screwed up the spell. They were trying to bring Arthur back, remember? With your blood. But the spell screwed up—which anybody who watchesCharmed will tell you—and then they were in over their heads. I mean, that's the trouble with screwing around with black magic. You make one slip, and suddenly there's a world-devouring demon in your warehouse.\"</p><p>\"Which Sara got rid of,\" Derik said, calming down. \"You guys shoulda seen it.\"</p><p>Sara laughed, which calmed Derik down even further. \"I was so scared, I didn't know what to do. I think I kicked it—the whole thing's kind of a blur. I guess my blood did away with it? Because my blood conjured it up?\"</p><p>\"Do I look like I'm wearing a pointy Merlin hat?\" Derik griped. \"Track down your mentor, Dr. Cummings. Ask him. He can probably explain the whole thing.\"</p><p>\"And this whole 'everything is for a reason' bushwah ... you mean my car conking out was part of the big plan, too?\"</p><p>\"The universe is a mysterious place,\" Antonia said, popping the last cherry tomato into her mouth.</p><p>Derik sat down. \"Fucking miracle it all turned out all right,\" he muttered.\"Miracle.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Oh,\" Sara said, leaning forward and kissing him on the cheek. \"My specialty.\"</p><p>\"At least the alpha thing is taken care of,\" Moira said. \"Thank God.\"</p><p>\"What alpha thing?\" Sara asked.</p> <p>\"It doesn't matter now,\" Derik said, visibly uncomfortable.</p><p>\"What?\" Michael said. \"It's fine, Derik. Shit, I'm not one to argue fate.\" He glanced fondly at his wife. \"Not anymore.\"</p><p>\"What are you guys talking about?\" Sara asked.</p><p>\"Derik's an alpha, too, which usually means trouble for us,\" Moira explained, \"because our Pack already has an alpha.\"</p><p>\"I don't suppose he can, like, try to win the next alpha election, or whatever ...\"</p> <p>\"It doesn't exactly work like that,\" Antonia said dryly.</p><p>\"But part of the problem ofbeing alpha is the overwhelming urge toprove it... men,\" Moira added, shaking her head.</p><p>Sara decided she would like the tiny blonde, if the woman wasn't so damned cute. Thank God she was married!</p><p>\"Anyway, not only does Derik not have to prove anything,\" Moira went on, \"he's aligned himself with a mate who is quite possibly the most powerful being on the planet.\"</p><p>\"Oh, now, well,\" Sara said self-deprecatingly.</p><p>\"Know anybody else who can get rid of a demon by kicking it?\" Antonia asked rudely.</p> <p>\"Kicking it,\" Jeannie said, shaking her head. Then, \"Excuse me. I gotta pee.\"</p><p>\"Anyway,\" Moira continued, frowning at Antonia, who sneered back, \"it sounds like you guys aren't even going to be around that much. So the problem has, essentially, been solved. Both internally—feeling alpha and feeling the need to prove it—and externally, because you'll be traveling.\"</p><p>\"Oh,\" Sara said. It all sounded like a lot of werewolf bullshit to her. She'd have Derik go over it with her later. Probably. \"Well, that's good.\"</p><p>\"Real good,\" Michael said, \"because I would have broken out all his teeth, and then I really would have gone to work on him. And I would have hated to do that.\"</p><p>\"Dude, what have you been sniffing? You were sotoast if I decided to bring the smack-down. I would have spanked you!\"</p><p>\"And then I would have snapped your spine.\"</p><p>\"You're high! You are onserious uppers, dude! You gotta know I would have totally ...\"</p><p>\"God, I'm bored,\" Antonia mumbled. \"At least when we thought the world was gonna end, it was interesting around here.\"</p> <p>\"Maybe you can go off an have an adventure of your own,\" Sara suggested.</p><p>\"Yeah, yeah...\"</p><p>\"So,\" Sara said to Jeannie, who had just returned and was working on her third glass of lemonade, \"how are you feeling?\"</p><p>\"Oh, fine. I haven't started craving raw meat yet—thank heavens.\"</p><p>\"Are you thinking about names?\"</p><p>Jeannie set down her glass and shook her blonde hair out of her face. \"Well, you know, Sara,\" she said seriously, \"we really haven't been lately. Because of—because we weren't sure what was going to happen.\"</p><p>\"Oh. Sure, I get it.\"</p><p>\"But I guess now we have to get back to it.</p><p>And I think, just for the record, that Sara is a lovely name.\"</p><p>\"Oh, vomit,\" Antonia said, which was just as well, because Sara was too choked up to say anything.</p><p>\"HI, AND WELCOME TO 'FORTY DOLLARS A DAY.' I'M Rachel Ray, and I'm here today at the annual San Antonio rattlesnake festival with Derik Gardner, who has taken first prize with hiswonderful dish, Rattlesnakeen croûte. I know, I know, it sounds kind of yerrrgggh, but yougotta try it. Derik has come out ofnowhere and unseated last year's champion with his awesome dish. Derik, congratulations! \"</p><p>\"Thanks, Rachel.\"</p><p>\"Your dish isdelicious. I mean, yum! Who would have thought something made out of snake could look so delicious? I mean, look at that, so crispy and golden and just... gorgeous! And it's very tender. It really doesn't taste like chicken at all. So, Derik, do you catch the rattlesnakes yourself?\" \"Yes, I do, Rachel.\"</p><p>\"That'samazing ... do you use a net, or a trap?\"</p><p>\"Something like that, Rachel.\"</p><p>\"And this is your wife? Sara?\"</p><p>\"Yeah, hi.\"</p><p>\"Do you help Derik catch the rattlesnakes?\"</p><p>\"God, no. The whole thing just creeps me out. I stay in the RV, while he does that.\"</p><p>\"Well, it looks like you get to partake in the fruits of his labor, then ...\"</p><p>\"Yes, lucky me.\"</p><p>\"... and is it true you two travel around the country going to cooking shows and the like?\"</p><p>\"Yes, that's true, Rachel.\"</p><p>\"Well, that's certainly working out well for you so far, at least from where I'm standing.\"</p><p>\"Thank you, Rachel.\"</p><p>\"You're right about that one, Rachel.\"</p><p>\"Oh, whoa now! I guess you would call that the newlywed effect. . . and congratulations, by the way.\"</p><p>\"Thanks, Rachel.\"</p><p>\"Yeah,\" Derik said, beaming. \"Thanks.\"</p><p>Continue reading for a special preview of MaryJanice Davidson's next novel</p><p>Undead and Unappreciated</p><p>Look for the hardcover coming soon from Berkley Sensation!</p><p>\"Okay, guys, let's set up here... Charley, you okay here? You got light?\"</p><p>Her cameraman looked up. \"It's shitty out here. Should be better inside.\"</p><p>\"We won't film out here ... So, you're sure this is okay?\"</p><p>The representative, who was smooth and sweat-less, like an egg, clasped his hands together and nodded slowly. Even his suit seemed to be free of threads or seams. \"People need to see that it's not a bunch of chain-smoking losers who are afraid to go outside. There's doctors. There's lawyers. There's\"— he stared at her with pale blue eyes—\"anchor-women.\"</p><p>\"Right, right. And we'll put all that across.\" She turned away from the AA rep, muttering under her</p><p>breath. \"Fuckin' slow news days ... okay! Let's get in there, Chuckles.\"</p><p>Charley knew his stuff. With the new equipment, setup was not only a breeze, it was relatively quick and quiet. Interestingly, none of the room's inhabitants looked at them directly. There was a lot of coffee drinking and low chatting, a lot of nibbling on cheese and crackers, a lot of quiet milling and sideways glances. They looked, the newswoman thought to herself, exactly like the man said. Respectable, settled. Sober. She was amazed they'd agreed to the cameras. Wasn't the secondA supposed to be forAnonymous?</p><p>\"Okay, everyone,\" the rep said, standing in the front of the room. \"Let's get settled and get started. You all remember Channel9 is here tonight, to help raise awareness . . . someone watching tonight might see we're not all villains in trench coats and maybe will come down.\"</p><p>\"I left my trench coat in my other pants,\" someone called in a low voice, and the room rustled with restrained laughter.</p><p>\"Anyway, I'll start, and then we've got a new person here tonight...\"</p><p>Someone the reporter couldn't see protested in a</p><p>low voice, and was ignored—or wasn't heard—by the rep. \"I'm James,\" he said, \"and I've been sober for six years, eight months, and nine days.\"</p><p>There was a pause as he stepped down, then a rustle, a muffled \"Oof! Stupid steps\" and then a young woman in her mid-twenties was standing behind the small podium. She squinted out at the audience for a moment, as if the fluorescent lighting hurt her eyes, and then said in a completely mesmerizing voice, \"Well, hi. I'm Betsy. I haven't had a drink in three days and four hours.\"</p><p>\"Get on her!\" the reporter hissed.</p><p>\"I'm tight,\" Charley replied, dazzled.</p><p>The woman was tall—her head was just below the No Smoking On These Premises sign—which put her at about six feet. She was dressed in a cherry red suit, with the kind of suit jacket that buttoned up to her chin and needed no under blouse. The richly colored clothing superbly set off the delicate paleness of her skin and made her green eyes seem huge and dark, like leaves in the middle of the forest. Her hair was golden blond, shoulder length, and wavy, with red and gold highlights that framed her face. Her cheekbones were sharp planes in an interesting, even arresting face.</p><p>Her teeth were very white and flashed while she spoke.</p><p>\"Okay, um, like I said, I'm Betsy. And I thought I'd come here... I mean, I saw on the Web that. .. Anyway, I thought maybe you guys would have some tricks or something I could use to stop drinking.\"</p><p>Dead silence. The reporter noticed the audience was as rapt as Charley was. What presence! What clothes! What... were those Bruno Maglis? The reporter edged closer. They were! What did this woman do for a living? She herself had paid almost three hundred bucks for the pair in her closet.</p><p>\"It's just.. . always there. I wake up, and it's all I think about. I go to bed, I'm still thinking about it.\"</p><p>Everyone was nodding. Even Charley was nodding, making the camera wobble.</p><p>\"It just. .. takes over. Totally takes over your life. You start to plan events around how you can drink. Like, if I have breakfasthere with my friend, I can hit an alley afterwardthere, while she's going uptown. Or, if I blow another friend off for supper, I can reschedule onhim and get my fix instead.\"</p><p>Everyone was nodding harder. A few of the men</p><p>appeared to have tears in their eyes! Charley, thankfully, had stopped nodding, but was getting in on the woman as tightly as he could.</p><p>\"Get the suit in the shot,\" the reporter whispered.</p><p>\"I'm not used to this,\" the woman continued. \"I mean, I'm used to wanting things, but not likethis. I mean, gross.\"</p><p>A ripple of laughter.</p><p>\"I've tried to stop, but I just made myself sick. And I've talked to some of my friends about it, but they think I should just suck it up. Ha ha. And my new friends don't see that as a problem at all.\" More nods all around. \"So here I am. Nobody special. Just someone with a problem. Abig problem. And ... I thought maybe coming here and talking about it would help. That's all.\" Silence, so she added, \"That's really all.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>Spontaneous, almost savage, applause. The reporter had Charley pan back, getting the crowd's reaction. She wasn't sure the rep would let all their faces be shown on the ten o'clock news, but she wanted the film in the can, just in case.</p><p>She wanted Charley to get the woman walking to</p><p>the back of the room, but when he panned back, she was gone.</p> <p>The reporter and her cameraman looked for the gorgeous stranger for ten minutes, with zero luck.</p><p>Gone.</p><p>Shit. </p>  </body></html>"]