["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>To My Wonderful Readers,</p><p>Imagine for a moment a world similar to our own except for one small detail . . . Vampires.</p><p>They live among us in hidden Amish-like communities where the Purebloods rule the Impures, and the ten ancient members of the Order rule them all. Most vampires never fight against their class distinctions-just as most would never have the guts to leave if they were being ill-treated.</p><p>But our Roman brothers are not like most. Alexander, Nicholas and Lucian had not only the guts to run from their community and from the harsh rule of the Order, but the brains to stay hidden and fed. For many years, they have lived in peace and freedom, but now the Order has come for them. They want the brothers to fight for them, for the communities-and for the purity of the line. They want them to bring down an Impure rogue before there is an uprising in the Breed.</p> <p>The brothers want nothing to do with this war, but as they take on new members of their family, females and their kin, Impures and Purebloods alike, they know a war is coming. And if they wish to keep their family intact, they will have to choose a side and fight.</p><p>I am thrilled to be able to share this Mark of the Vampire e-novella, Eternal Blood, with you. As some of you may know, Gray Donohue is the Impure brother of our heroine, Sara, from the first book in this series, Eternal Hunger. Gray has always intrigued me; his struggles with his past, his closed mind and fire-ravaged hands and his need to shut off the world and give in to the pleasures of the body, as he did in Eternal Kiss. All of these factors have made me wonder what his future holds, what he will do now that he's found out he's an Impure, a half vampire, now that Alexander Roman brought him back to life. I've also wanted to explore the Impure world more. I feel as though we've seen a clear vision of how the Purebloods live, but really never see behind the mask of the Impure lifestyle, except to note that they are looked down upon and treated like second class citizens.</p><p>In Eternal Blood we get to see the truth behind the Impures' call to action, we get to see their struggles up close, and how the Order truly views and treats them. Granted, this is only the beginning of Gray's story-and the battles and triumphs of the Impures-but, boy, was it wonderful to write.</p><p>This e-novella fits perfectly between sexy and secretive Nicholas's book, Eternal Kiss, and bad-boy vamp Lucian's book, Eternal Captive, and I hope you enjoy it.</p><p>All the best and happy reading,</p> <p>Laura </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was like being back in the hospital again, this feeling of deep and overwhelming intensity-an intensity he had no control over. And the images that flickered through his mind; he couldn't hold on to them in any real way, get a fix on them. Then there were voices. Three voices at once, and all coming fast.</p><p>Fast and furious as fuck.</p><p>With instructions he couldn't comprehend, demands he wasn't certain he wanted to give in to, and a pressure inside his skull to open wide and receive, Gray Donohue slammed open his eyes and hissed a fierce, \"Stop! Christ. It's too much.\"</p><p>The quick images and harsh demands ringing inside his skull suddenly evaporated and he could breathe once again, focus again-even with the irritated and disappointed glares of the three Impures who encircled him.</p> <p>\"What's the problem?\" came the gruff voice at his shoulder.</p><p>Eyes narrowed, Gray turned to regard Riordon James, the massive Impure male with night-black eyes who had served most of his life in the human armed forces until he'd been caught bunking with a couple of his superior male officers.</p><p>\"I thought you liked threesomes,\" the male added with a growl of insincerity.</p><p>\"I do,\" Gray returned darkly. \"Unfortunately this one lacked the dirty talk I need to get it up. All that angel white noise you tossed my way really turned me off.\"</p><p>Gray watched the male's mouth thin even further than normal. One bullshit joke deserved another, didn't it? Besides, his idea of a threesome was naked, sweaty and mutually pleasurable. It sure as hell wasn't obliging three fully clothed Impure warriors who were attempting to drill his brain for answers-find out if he was the missing piece to their puzzle.</p> <p>Per usual, Riordon wasn't giving up or moving on. His nostrils flared as he said, \"You want dirty talk, do you, Impure?\"</p><p>\"Come on, Rio,\" Piper Leigh, the blond female Impure across from Gray, said quickly and calmly. \"Not necessary.\"</p><p>But her words were lost on the tank-like male, and in seconds his eyes narrowed and a wave of intensity shot through Gray's mind like an emotional bullet along with the words:</p><p>YOU KEEP THIS UP, I'LL CUT OFF YOUR COCK AND EAT IT FOR BREAKFAST.</p><p>It was like audio feedback times a thousand and Gray grit his teeth against the assault. The feeling of the words themselves inside his head weren't clear and present like Alexander's were, like anyone he could hear in his mind. No. These words slammed into his very being and ricocheted off his bones and muscle-it was like freaking God's voice booming around in there, and he tried not to jerk in response as he stared back at Riordon.</p><p>\"Dirty enough for you?\" the male asked, dark amusement glittering in his black eyes.</p> <p>Gray choked out a bitter reply, \"Not exactly what I had in mind, but I respect the effort.\"</p><p>Realizing he hadn't killed Gray's pluck as he'd hoped, Riordon snorted with disgust and turned away. \"This is bullshit. He's bullshit.\"</p><p>\"How about a break?\" Piper asked, her pale lavender eyes bright with concern.</p><p>\"We don't have time for breaks,\" said the male to her right-and to Gray's left. \"This needs to get done, get settled so we can continue our fight.\"</p><p>The third member of the small but powerful vampiric coven was nearly as intense as the first, but where Riordon was powerful and solid, milk-white skin over icy hard muscle, Vincent Seal sported long, lean athleticism wrapped up in dark caramel skin, eyes and hair.</p><p>\"I think we all need to chill out,\" Piper said, her eyes still connecting with Gray as though she were trying to read his mind, though her gifts were more akin to changing the thoughts of others. \"He's just getting his feet wet here.\"</p><p>His feet, Gray thought bitterly, glancing down. Where his feet had once been planted in the posh living quarters of the Roman brothers' household, they were now uncertainly tap dancing around a circle of red color and interwoven lines; the symbol of what he had come to realize was the Impure resistance, inside a sparsely furnished, unromantic warehouse space in the Bronx. It was the real deal here. No Ethan Dare plotting and sex parties-no Impures laid out on cushy mats and pillows as they attempted to bump and grind their way to respect and equality with the Pureblood communities they served. This was real . . . and raw, and blatantly stated that there was work to be done.</p><p>After leaving the Romans, Gray hadn't gone looking for these three gifted Impure warriors. He had been on the hunt for a purpose to his life, true-but he had been hoping to find a group of similar minded Impures, ready to band together and plan for the future. Unfortunately-or fortunately, depending on the outcome, Piper, Riordon and Vincent had found him first, convinced him that he belonged with them, to them-and to the cause he truly sought.</p> <p>Granted, the three of them had mental gifts that Gray could understand and relate to, but he wasn't altogether certain he wanted a part of whatever they were planning.</p><p>He stared at the symbol carved into the floor at their feet. Four coiled snakes with fangs extended. They had used their own blood to paint the symbol. It was their talisman, they said. It helped them both invoke power and calm their minds.</p><p>These three vipers.</p><p>And he was supposed to be their fourth.</p><p>A force that may be able to withstand the powers of the Order.</p><p>\"His feet are as wet as they're going to get,\" Riordon said, snapping Gray from his thoughts.</p><p>\"I say you get your head in the game or get out, Donohue.\"</p><p>\"Fuck you,\" Gray uttered, stepping back, out of the circle-out of their line of fire. \"You push too hard, too far. I'm working on it, okay!\" Working on deciding if he wanted to walk through this door or not, give in to another who wanted access to his brain.</p><p>Vincent shook his head. \"You know nothing of work, Gray. Not yet.\" He turned to Riordon. \"And no matter how much he irritates us, he's not going anywhere. He will remain and watch us-see what we can do without him-then perhaps later he will join us to see-\"</p><p>\"What we can do WITH him,\" Piper finished, giving the male a slash of a grin.</p><p>Vincent's dark brow lifted. \"Finishing my sentences again, Pip? Makes me feel like we're still together.\"</p><p>\"Just a bad habit, Sweets. One I'm really trying to kick-just like I did our relationship.\"</p><p>\"Thank Christ,\" Riordon uttered. \"Don't need those images in my head again.\"</p><p>Gray shoved his arms in his jacket. \"I hate to interrupt the trip down memory lane, but maybe you could give me a clue as to what you're planning. Not just that bullshit pat answer about gaining equality within the Breed.\" He eyeballed each one of them. \"I want details.\"</p><p>Piper shook her head. \"No details until we've cracked you, until the bond between us has fused.\"</p><p>\"Until we trust you,\" Vincent added.</p><p>Gray was getting tired of these non-answers. \"So I have to give you my brain before I get your trust. What if I want your trust before I give you my brain?\"</p><p>Vincent shook his head. \"No can do.\"</p><p>Gray sniffed. \"Sounds like you get all the power and I get left in the dark.\"</p><p>\"He's not the one,\" Riordon muttered, sitting on his haunches, running his fingers over the symbol. \"I say we cut him loose.\"</p><p>\"Not necessary,\" Gray tossed out, heading for the door.</p><p>\"Behind him,\" Vincent called, \"We don't have time to dick around, Gray. We want you. Need you. You could very well be the missing piece of our puzzle.\"</p><p>Gray stopped and turned around. \"And if I am?\"</p><p>The gold flash in Vincent's dark eyes was so bright it seemed to jet across the room. \"Then we have use of you.\"</p><p>\"Not interested in being used.\"</p><p>Riordon snorted, his gaze shifting from the symbol to Gray. \"Unless it's for your cock, right?\"</p><p>Gray's nostrils flared. \"At least that's mutually satisfying. Whereas this . . .\" He shook his head. \"I think I'll pass.\"</p><p>\"Gray, wait a sec,\" Piper called after him.</p><p>\"Gotta go. My cock and I have a date.\"</p><p>As Gray walked out of the room, he heard Vincent say, \"Rio's got a point, Pip. We don't have the time or the room for a piece of soggy ass milk toast. We need a trained mind and a passionate heart. If he isn't the one, then we'll go it alone while we find the true fourth piece.\"</p><p>The one. Gray snorted his derision and his disbelief as he stalked down the hall. What was this? The fucking Matrix? He wasn't special, wasn't anything but an Impure head case who refused to be controlled. Heading out of the building, his jaw tight as his asshole, he thought about his sister, his family-in particular his mother. How she'd kept what she was, what they all were, from him. And for what? To protect him? Protect herself? He wasn't interested in being protected anymore, wasn't interested in hiding and plotting and planning. He wasn't interested in being anyone's savior. He just wanted to be one of the pack-an Impure among all the others.</p><p>The wind bit at his skin as he moved down the street. But it wasn't going to be easy to just blend in and be a follower. It seemed as though the world was always attempting to make decisions for him-and without consulting him. Yes, he wanted to help the Impures. Yes, he thought they were getting a raw deal, but was it really that bad? They had the choice to stay in their credentis or get out into the real world, didn't they?</p><p>He'd just come off Ethan Dare's mind fuck of a ride. This time, he would choose where he got on and when he got off.</p><p>He rounded the corner and grinned. And speaking of getting off . . .</p><p>He jumped the curb and stepped right in front of the Hummer limo that skidded to a stop, inches from his gut. Without a thought or a word for the driver, he sprang onto the hood like a cat, walked easily up the windshield and when the sunroof opened he dropped inside.</p><p>His boots hit the floor with a dull thud, and the feminine gasp at his back had him turning around with a quick whoosh.</p><p>\"Damn, sugar. We could've killed you.\" Clad only in a hot pink trench coat-just as Gray had instructed-the woman sat up straight on the long back seat, her legs crossed at the ankles.</p><p>\"It would take a lot more than that to kill me,\" Gray said, his gaze moving over her, from painted toes to cleavage too rock hard to be real. But shit, who was really real these days anyway? He raised one arrogant brow. \"Now, let's see if you followed my instructions. Lie back like a good girl.\"</p><p>The woman's skin went pink, and she called out to the driver and his companion. \"Circle the block, Beecham.\"</p><p>\"Yes, ma'am,\" came the reply.</p><p>\"Until she tells you to stop,\" Gray ordered, his finger pressing down on the button for the privacy screen.</p><p>Before the glass even hit the top, the woman was reclining back in her seat, her eyes intermittently opening and closing as though she were tired. Or in heat, Gray thought, amused as he yanked the belt from her coat, tossed it to the floor and spread the lapels wide. She wasn't wearing a thing, save for the thin landing strip of hair at her core. Gray licked his lips and felt the tips of his fangs respond to his desire. He was a vampire. An Impure, true-but a vampire nonetheless, who lusted for blood and sex and more often than not the combination of both. He hovered over her, let his fire ravaged fingers trail down her taut and tan stomach, to her pelvic bone. He felt his mind shift with the action, first widen, then calm. This was where he excelled, where he felt real and right and needed. His ruined hands on skin, his mouth feeding-his cock inside a hot, wet pussy. There was something in the sound of a female's scream of pleasure that took his mind away, stole all shards of confusion and questioning about who he was, what he was. Inside a female, fingers, cock and tongue, he was air, light, adrift. Maybe that was weakness, maybe that was the Impure in him . . .</p><p>The woman hissed as he brushed his index finger through her hair, over her sensitive clit and to the opening of her body. He felt the gentle pulse of the vibrator caught inside and nodded.</p><p>\"Good girl,\" he whispered. \"I was hoping I wouldn't have to punish you.\"</p><p>Her hips tilted up and she bit her lower lip. \"This is punishment. Torture.\" She let out a soft moan. \"Take it out. Please, take it out. I can't hold on much longer.\"</p><p>Weak human female. He pressed the vibrator deeper into her pussy and growled, \"You haven't come already, have you?\"</p><p>She gasped, gripped the leather seat and shook her head. \"No. I swear.\"</p><p>\"I'll be able to tell. In fact . . .\" He eased the vibrator from her body, then thrust two fingers up inside of her.</p><p>She cried out, bucked her hips, and slammed her cunt against his knuckles.</p><p>He chuckled softly. \"No, no . . . You haven't come yet. Your walls weep with an unclaimed hunger.\" He pressed his thumb to her clit and stroked her, then lowered his head and sucked hard on one large pink nipple, biting at her the way she liked.</p><p>\"Oh, god,\" she uttered breathlessly, arching her back, giving herself over to him.</p><p>No resistance here. She wanted him, would give him anything-give in to anything. That knowledge made his cock stand up, pulse even, but it didn't fully satisfy his desire. Not anymore.</p><p>\"Please,\" she whimpered, her eyes closed, her cheeks inflamed, her hips swaying back and forth, hitting the black leather seat, then slapping against Gray's wet knuckles. \"I need you. I can't . . . I'll die . . .\"</p><p>What would satisfy him fully, he wondered? Not taking what wasn't offered, but perhaps a total loss of control . . . for her . . . for him?</p><p>\"All right,\" he whispered. \"I will help you-just this once.\"</p><p>He would be done with her tonight. His need had outgrown the sweet and simple play of this female and the others like her. But until midnight struck, he would forget all. He would forget the grand plan, the work of his brain, his mind-the connection to his fellow Impures and their need to bring down the Order, while bringing themselves into a position of power. Because, truly-THIS was the power he craved!</p><p>He ripped off the female's coat, eased his fingers from her quivering cunt and mounted her. She shook beneath him, her gaze finding his, her eyes so heavy with need and excitement and desperation to connect. He looked away. She wasn't his, didn't belong to him. They were about basic and mutual pleasure-a quick and easy distraction from their lives.</p><p>They were cunt and cock and nothing more.</p><p>With that, he sank into her hot, wet sheath and let her thoughts lead him toward climax. Slow easy stokes, his fingers pressed deep into her backside, his mouth, his tongue moving from one breast to the other, then up-up until his lips met the curve of her neck. He raked his fangs up and down her skin. Not a bite, just scratches.</p><p>Revved up now, her heart slamming inside her ribs, she wrapped her legs around his waist and slammed her hips against him in wild, manic thrusts, her cries for release getting louder by the moment. The males in the front seat heard her now just as Gray could hear their thoughts.</p><p>Lucky bastard.</p><p>Wish I could tap that.</p><p>Grinning, Gray turned his attention back to the woman, to his own rising climax, but as he heard her fall into orgasm just as her body stiffened beneath his, the images he'd tried so hard to shove into the trash of his mind began to show up. He tried pushing them away, but the stubborn bastards wouldn't budge.</p><p>The fire, the fucking fire.</p><p>The hospital.</p><p>And her.</p><p>Her!</p><p>Dillon.</p><p>Fuck, he didn't want her! Didn't want her anywhere near his mind right now. Why did she always come at him when he was getting so close to coming himself? And why was she wrapped up in his memories of the past?</p><p>He pounded into the woman, his thrusts bringing vision after vision to the backs of his eyelids. Dillon in his house, Dillon running into the fire.</p><p>Fuck.</p><p>He slammed into the woman harder, deeper, working her good, sending her into another earth shaking climax as come surge into his balls, ready to shoot home.</p><p>The female below him screamed, writhed and begged for his climax both aloud and deep inside her mind. Fully aware of the stupidity of the move, Gray's fangs pierced the flesh of her neck. Fuck it, he was hungry-manically hungry and he would be fed.</p><p>But he never tasted blood.</p><p>Never reached her vein.</p><p>Never captured release.</p><p>Before the next breath left his body, a net, invisible and impenetrable, was thrown around him and he was yanked from the body of the writhing human female. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Order.</p><p>It was the first thought in Gray's mind as his feet hit dirt and he became mobile once again. The Order had taken him, ripped him from the woman's arms and deposited here.</p><p>But where exactly was here?</p><p>He glanced around himself, taking in the dirt floor, the stone boulders jutting out behind him and the bars containing him in the front. What the hell was this? And why was this?</p> <p>He heard voices, deep inside his head. That's where they filtered into, where he could now contain and compartmentalize them. As he went through each one trying to figure out the truth of where he'd landed, his gaze moved through the bars and extended out to the massive oval beyond. It was something akin to a football stadium, but below ground, dark and lit with thousands of candles. He moved toward it, stopping only when he hit metal, and as he listened to the voices around him, he took in the landscape, dotted with stone tables. In the dim candlelight, Gray could make out the writhing bodies of Impure males and females laid out on the stone slabs, their arms and ankles bound, their bodies unclothed and shaking. His mind captured their cries for release, for mercy.</p><p>What the fuck was happening here?</p><p>More cages, more cells like the one he found himself in circumvented the oval space. One after the other, all facing the center-all able to watch the display. It was like a very large rattrap, Gray mused, and his fellow rats stood like him at the bars of their cages and watched the spectacle before them. Their faces pale, their minds filled with terror and sadness and a bleak hope for escape, while their bodies held rigid, unclothed and cold.</p><p>For the first time, Gray realized that he too was naked. The air felt cool and damp against his skin, as though he existed inside a spring-fed brook. But this place in which he had been dropped felt as far from the gentle and sweet smelling forest floor as one could get.</p><p>Another one.</p> <p>Another Impure fool.</p><p>The male voice inside Gray's head came from such a distance he could barely make it out, but by the last few words it shot forward and bloomed.</p><p>He wasn't alone in his cage.</p><p>Gray turned just in time to see a tall blond male walk out of the shadows of the rocks toward him. Gray narrowed his eyes and glanced past the male. How many others were back there? he wondered. And how far did their hiding place stretch? With his eyes narrowed, he glimpsed two others huddled within a split in the rock. An older male and a young female, both nude, both with strangely quiet minds.</p><p>\"What is this?\" Gray asked the male coming toward him, his tone low and fierce. He didn't know if these Impures were friendly or feral. \"Where are we?\"</p><p>\"You're kidding, right?\" the male said bitterly, his own nude frame gaunt, though his height rivaled Gray's.</p> <p>Gray held out his arms. \"Do I look like I'm kidding? Why are we being held here? Is this something else having to do with Ethan Dare or his followers?\"</p><p>The male narrowed his eyes. \"This is the Paleo.\"</p><p>The word meant nothing to Gray and he continued to press the male for answers. \"Never heard of it.\"</p><p>The male sniffed. \"Not possible. Anyone who grew up in the credenti knows of the Paleo.\"</p><p>\"Yes, Impure,\" the older male called out from behind the young one, moving his face into the light. It was a long, tired face, and felt somehow familiar. \"What game do you play?\" he asked brusquely.</p><p>\"This is no game to me,\" Gray assured them harshly. \"I was brought here without a word, without a chance to fight. I am in the dark about why the Order wants me here and all I'm asking for are answers.\" He was getting nothing from those around him-nothing but fear and pain and cries for release. It was so much like the time spent in Dare's presence, he could barely stomach it.</p><p>\"The Order wants you here for the same reason they want all of us here,\" the young male answered.</p><p>\"And why is that?\" Gray pressed with little patience.</p> <p>The male shook his head. \"Your Impure blood, of course.\"</p><p>A thread of unease moved through Gray. It was a thread born out of suspicion and all that he had learned living with the Roman brothers. \"Why would they want my blood? It's weak-it's nothing.\"</p><p>The male tipped up his chin. \"Exactly. And they don't want it reproduced, combined with the Pure-they don't want you spreading your Impure seed.\"</p><p>The thread expanded and made his heart constrict in his chest. \"They wish to take my blood? Is this a death camp?\"</p><p>'Tis the death of life as you know it, surely.</p><p>The silent words came from the female. Gray's eyes attempted to connect with hers, but she refused to look up.</p><p>Near rage began to bubble within him. This was bullshit. This wasn't happening. The Order would take nothing from him-not a hair on his head, not a drop of his blood. He whirled around, fisted the metal bars and started yelling. \"Hey! I want out of here now!\" His voice echoed in the massive space and spurred on a mental cacophony of pleas for help and whimpers of fear. \"I don't belong here! Get me the fuck out-\"</p><p>Before he finished his demands, he was yanked back by strong arms and landed on his ass in the dirt. The three naked Impures crowded around him.</p><p>\"Christ!\" said the young female.</p><p>\"Are you trying to get us all killed?\" muttered the male.</p><p>Trembling, their eyes frantic, unsure, the older male chastised him, \"What's wrong with you? Do you want to be dragged from here, laid out on the stone this very moment?\"</p><p>Snarling, Gray was off his ass and on his feet in seconds. \"I don't belong here. This is some kind of mistake.\"</p><p>All three stared up at him, their eyes first angry, then confused. Finally, the female released a weighty breath. \"You really don't know, do you? You don't know why you're here-why any of us are here.\"</p><p>Gray just stared at them, his nostrils flaring, his breathing abnormal.</p><p>\"You weren't born in a credenti, then?\" the younger male asked.</p><p>\"No,\" Gray said through gritted teeth.</p><p>The male looked at the older one, then at the female, then back at Gray. His eyes were touched with pity now. \"The Paleo has been in existence since the Order took power. It is where they perform the blood castration ritual.\"</p><p>A slow, sickening feeling moved through Gray's body. There was much he didn't know, so many terms he hadn't been brought up with, but these two words-blood castration-these two words he knew. He had heard about them from the Romans, from the dizzy and despondent minds of nearly every male and female under Ethan Dare's command.</p><p>Blood castration.</p><p>It was how the Order controlled their Impure population-kept them amenable. By draining all the desire, all the need, all the ability to fuck and to impregnate or be impregnated out of them...</p><p>He felt his cock stir against his leg and shook his head. \"No. This cannot happen. We will not be forced into such-\"</p><p>The older male laughed, such a bitter sound Gray could nearly taste it on his tongue. \"There is no fighting them, young Impure.\" His face, so ancient and gaunt, so strangely familiar, softened. \"We do not have the strength or the power to fight them.\"</p><p>This was madness-sick and inhumane. This was it, wasn't it? What the three Impure warriors were fighting against? Why they wanted him-needed his help? Gray's head buzzed. And he'd just run from them, like a child to a pretty toy.</p><p>Jesus, he should be ashamed.</p><p>\"How long have you all been here?\" Gray asked them. \"Days? Weeks?\"</p><p>\"We have avoided the fangs of the Order for nearly three weeks now,\" the older male said.</p><p>\"And you were taken from your homes?\"</p><p>He nodded. \"Inside our credenti in Wisconsin. My children here, Uma and Jacobi, were taken first. I, a few days later.\"</p><p>His children. Gray eyed the pair, both somewhere in their mid to late twenties. The female who wouldn't meet his gaze and the male who Gray had spoken to so harshly, the male he had distrusted. Reaching out, he offered his hand to the female, then to her brother. \"My name is Gray. Donohue. I live in New York, was taken from there-right off the streets. I swear I'm going to do everything in my power to get us out of here.\"</p><p>Jacobi shook his head. \"There is no way out of here but through the Order.\"</p><p>\"Donohue?\"</p><p>It was the older male who spoke. And the sound was riddled with shock. His face no longer held the calm sadness of a moment ago. It was tense and ashen.</p><p>\"Father?\" the female, Uma, said, gathering close to him, concerned. \"Father, what's wrong?\"</p><p>\"It can't be.\" The older male stared at Gray, looked him up and down, shaking his head as he said, \"No . . .\"</p><p>Gray felt the man's anxiety, his deep stare. \"What is it?\"</p><p>\"Father,\" Jacobi urged when the male said nothing. \"Please.\"</p><p>\"My closest friend, for fifty-two years . . .\" uttered the older male. His eyes locked with Gray. \"Jeremy Donohue.\"</p><p>The air rushed out of Gray's lungs and was lost. \"You knew my father?\"</p><p>The male reached for Gray's hand and squeezed it hard. \"How is it you are here? It is not supposed to be. Your father took great pains to keep this a secret from you, from your sister.\"</p><p>\"What secret is that?\" Gray asked, his mind and his body pounding with the rapid beats of his heart. It was the sound, the pressure-filled sound of inevitability. He was about to hear-to learn things he wasn't sure he wanted to learn. And yet, he pressed on. \"That my mother is a Pureblood? That she mated with a human and gave birth to two Impure balas? That much I know.\"</p><p>The older male's eyes drifted downward, dropping the connection. \"He was no human.\"</p><p>Heat slammed into Gray's skin, blood, and he nearly shouted his reply. \"What?\"</p><p>\"Your father.\" He swallowed, licked his dry lips. \"He was an Impure.\" His gaze flickered back up. \"One of the most powerful Impures in the Eternal Breed.\"</p><p>Gray shook his head. No. No. This wasn't happening-not this way. Not in a cage, stripped nude, waiting for his blood and his sex drive to run from two puncture wounds in his neck.</p><p>\"Your father led the resistance,\" the older male continued. \"He was raising an army to take down the Order. He had escaped his credenti when he was still a balas himself. He took care of himself, educated himself, and after he met your mother and gave life to you and your sister, he continued to protect Impures who had left their homes just as he protected you and your sister from being found.\"</p><p>\"How?\" Gray uttered, his throat as tight as the rest of him. \"How did he protect us?\"</p><p>\"He fed you human blood.\"</p><p>\"Oh, Christ,\" Gray whispered.</p><p>\"It was the only way to tamp down your vampire side, your Impure blood so that the Order wouldn't find you.\"</p><p>Gray's mind spun. He didn't remember this-any of this. The blood meals-it didn't happen.</p><p>\"But the Order found him.\"</p><p>The older male's words stalled Gray's heart. \"What do you mean? What are you saying?\"</p><p>Tears pricked the male's eyes and his daughter took his hand in hers. \"After your birth, the Order found him, brought him here.\"</p><p>Bile rose in Gray's throat, and he shook his head. \"No.\"</p><p>\"They blood castrated him. And it wasn't just his desire they stole, but his drive, his hunger for the resistance. He wasn't himself again. It was no wonder that your mother turned-\"</p><p>\"My mother?\" Gray interrupted. \"They didn't take her? Drain her?\"</p><p>\"No. She is Pureblood after all. But by taking your father's desire from him, they forced your mother to turn to another for companionship.\" His eyes dropped again as if the words he spoke held shame for them all.</p><p>And perhaps they did, Gray thought, his mind, his world completely shattered into puzzle pieces he had no idea if he could ever reconstruct.</p><p>\"Your name?\" Gray asked softly.</p><p>The older male smiled. \"Samuel Kendrick.\"</p><p>Yes. That name sounded right, sounded familiar. \"You saw us, me and my sister, before the fire?\"</p><p>Samuel's gaze shifted to Gray's fire damaged hands. \"I did. Your father loved you so very much. I know he would've hated to leave you in such a way, and by the hand of ones he sought so hard to destroy.\"</p><p>Sara's face came before him in his mind. \"My sister never meant for it to happen. She was a child, not-\"</p><p>\"No,\" Samuel said, his eyes now resolute. \"That fire was no accident.\"</p><p>So caught up in the moment, in the sudden fierce protectiveness that only a brother feels for his sister, Gray didn't hear the bars pull back behind him, didn't sense the footsteps of the guards as they entered the room.</p><p>But Samuel and his children did.</p><p>\"Don't fight them,\" Jacobi called, as one guard wrapped his wrists in rope behind his back. \"It's not worth it. There is more pain to be had than just the drain of blood.\"</p><p>Instinct struck at Gray just as a guard reached for his arms. A stray dog unwilling to be caught and hauled to the pound. He turned fast and furious and punched the male in the face, then sent a hard kick into one knee. The guard went down with a groan and crash, and Gray leapt at him, ready to keep his back to the dirt, his hands off Gray's flesh. But before his feet even left the ground, he was suddenly rendered immobile.</p><p>Jacobi found his gaze and shook his head. \"I told you not to fight. It's useless.\"</p><p>Once bound, all four of them were led out of the cell and down the dirt path that bordered the field and its stone tables. The Impure rats in their cages reached out to them as they passed, and Gray's mind was slammed with feeling and with cries and with a rage he now completely understood. They were halted on the path and ordered to stay put. Then Samuel was yanked forward by two guards and pulled toward the nearest stone slab.</p><p>Jacobi and Uma screamed for him, struggled against their captors and their bindings, but it was impossible. Their fate, all of their fates were not of their own making anymore.</p><p>As Samuel was placed on the slab, his arms and ankles bound, Jacobi strained like an animal at his bindings, and before Gray could say a word or warn him, the male got free and ran at his father.</p><p>He got only three feet before he was turned immobile and dropped to the ground.</p><p>His heart slamming in his ribs, his gut constricting, his limbs unless, Gray stared at the young male on the ground and at the tears that leaked from his eyes and ran heavy and grief stricken down his cheeks.</p><p>Oh, god . . . Oh, god . . .</p><p>It was Uma. Beside him. Her silent plea continued, and Gray looked up, followed her line of vision.</p><p>A female clad in long red robes had appeared directly at the side of the stone slab. Gray watched as her mouth opened, so wide it split her features in two, and brick red fangs descended menacingly. She was on Samuel in less than an instant, striking hard-entering his vein with a hiss and a crack, sucking the life's blood from his desire and his maleness as though it belonged to her.</p><p>Gray opened his mouth to yell, scream, curse his hatred and his vow to see every last member of the Order dead as the dirt at his feet. But no sound left his throat. A hand stole around his chest and he was pulled back so fast he lost his breath and his vision for several seconds.</p><p>When it returned, he was in an empty cell, and being pulled, yanked back deeper into the rocks. He struggled against whoever held him, but the arm was firm and resolute and dragged him another ten feet down a wet, black corridor.</p><p>\"Save the brawn for another time, Impure,\" the voice behind him hissed.</p><p>Oh, shit. Shit, he knew that voice. Goddamn, he knew that voice! He heard the motherfucking voice in his head every night-and every time his cock headed south into some random female.</p><p>\"What the hell are you doing here?\" he demanded as a strip of light beamed past his head and hit his feet.</p><p>\"Saving your sorry ass.\"</p><p>\"Why?\"</p><p>\"Just keep your mouth shut and hang on.\"</p><p>A few more feet and light completely encompassed them. Then sky, and the scent of earth. With a grunt of supreme force, she hauled him up and out of what appeared to be a hole in the ground, then dropped him on the grass.</p><p>She was breathing heavy. So was Gray. He stared up at her, nostrils flaring, and wished he wasn't bare-ass naked. Not that she seemed to care. She wasn't staring at anything but his face.</p><p>\"I have to go back,\" Gray said.</p><p>\"You're welcome, moron.\"</p><p>\"D, there are Impures down there.\"</p><p>\"No shit. I just saved your bare ass from becoming one of them-truly one of them. Not to mention, saving your cock from forever limping at the side of your leg.\"</p><p>So she had noticed.</p><p>Gray stood, a flood of renewed determination filling him. Samuel and Uma and Jacobi, he wasn't leaving them down there to be castrated.</p><p>\"I know what you're thinking,\" Dillon growled at him, her breath a living thing in the cool morning air. \"But you can't save them. The ones you were with.\"</p><p>His chin dropped, his gaze narrowed. \"You can. I'll help you.\"</p><p>Her jaw ticked and she slowly shook her head. \"No.\"</p><p>\"You refuse to help?\"</p><p>\"Damn right I do. I don't give a shit about any of them.\"</p><p>\"Just me,\" he shot back.</p><p>She didn't answer. \"Let's go.\"</p><p>\"No.\"</p><p>She turned to leave and he reached for her arm. \"I told you I'm not leaving them.\"</p><p>She whirled around and had his arm tucked behind his back before he took his next breath. \"They're already castrated, motherfucker! It's done. Done!\"</p><p>She never let him say a word in response. Her other hand wrapped around his cock and they were flashed from the stark morning light and the only known portal leading to both the Impures he would never forget and the truth they held deep within their beating hearts. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A little midflight hand job sounded exactly like something Gray Donohue would be into-if the circumstances were different. But this wasn't the time, the place, or, he thought almost regrettably, the girl.</p><p>And clearly Dillon felt the same.</p><p>The moment they hit ground, she released her hold on his naked frame and ushered him across a great expanse of snow-covered lawn like an army drill sergeant.</p><p>\"You gonna tell me where we are?\" Gray said through gritted teeth, the unsympathetic midwinter cold attacking his bare skin.</p> <p>\"My digs,\" she answered, nodding toward a two-story guesthouse set front and center on a sprawling piece of property.</p><p>\"And the McMansion behind it?\" he asked.</p><p>\"My boss's digs,\" she said, pushing him through the back door of the house and into a sunken living area.</p><p>\"The Senator? We're in Maine?\" No wonder it was so freaking cold.</p><p>\"Wasn't going to take you back home, Impure.\" She stripped out of her coat. \"Wherever that is.\"</p> <p>\"Surprised you didn't drop my ass at my sister's.\"</p><p>\"Sure,\" she said with a laugh, tossing the coat on the back of the long, plush couch. \" 'Cause the Order would never look for you there.\"</p><p>He ground his molars at her nonchalance, her sarcasm. He wanted to shoot back with something equally acerbic, but what would be the point? She was right. Shit, he hated that. Almost as much as he hated standing before her in nothing but a sneer. \"Hey, point me toward the shower, D. I need to warm up. I'm fucking freezing.\"</p><p>Her gaze dropped and she snorted. \"So I see.\"</p><p>\"Shower,\" he repeated, this time grabbing his cock. \"Unless you're going to warm me up. Again.\"</p><p>For a moment, it seemed as though she were contemplating it, or maybe she was just trying to make him nuts as she stared.</p> <p>Gray felt his cock twitch and swell in his hand, and it wasn't in response to his touch.</p><p>Finally Dillon's eyes lifted and her mouth tilted up at the corners. \"Up the stairs, Impure, third door on your left.\"</p><p>Gray released himself and walked away from her without another word. She liked games. She liked playing people, playing him-playing his sister. Well, he wasn't in the mood. Not today. Maybe not ever. The Paleo, and everything he'd witnessed there-everything he'd heard-still sat heavily inside his chest and made him feel unworthy to be here, in this house, his manhood intact. Dillon couldn't understand. She was cold and unfeeling with a heart that remained still and silent. And she was Pureblood. She was born and bred to look down her nose at him and everyone who shared his blood.</p><p>He felt her eyes on him as he headed up the stairs, but all he could think about was getting in that shower, under the hot water, the steam closeting him as he fought for answers, maybe a blip of inspiration, or a plan to get his father's best friend and his family out of that hole in the ground.</p><p>And what about the others?</p><p>Did he care about the others?</p><p>He moved down the hall, seeing nothing but the carpet path before him. The art on the wall, the trim around each door, the scent of several of Dillon's previous houseguests-it all registered somewhere in his brain, but his need for heat trumped it all. Third door on the left, and he was through it, slamming the thick wood behind himself and locking it-locking her out. He saw the glass door and massive stone shower. In seconds, his hand was fisting around the faucet, cranking the thing to blistering. As the water surged out of the head and pummeled the stone floor, Gray's mind splintered with all it had heard and consumed from Samuel back in the cage at the Paleo.</p><p>His father was an Impure.</p> <p>His father was the head of the Impure resistance.</p><p>His father was blood castrated.</p><p>Firecrackers hitting him in the ass, one after the other. It was shocking, unbelievable and yet . . . he knew it was the truth.</p><p>The heat of the shower beckoned him, but once under the burning spray he stood immobile, his mind conjuring images of Samuel stretched out on the stone table, the Order veana fang-deep in his vein, sucking the very maleness from his already weak body. Suddenly, the male's head turned to reveal not the face of Samuel, but Gray's father. And that face . . . that face stared straight at Gray with wide, terror-filled eyes.</p><p>\"Fuck!\" Gray said, reaching out with his left hand and pounding the side of the stone wall. They'd as good as murdered his father-every last member of the Order.</p><p>Steam rose up, circled his thighs, his groin, threatening, menacing as it snaked around his ravaged hands. Just as the fire had done-the fire that his sister, Sara, had accidentally set all those years ago.</p><p>And yet, with all that Samuel had revealed to him, had she started that fire? HAD SHE?</p><p>His throat went tight, painfully tight and he tried to swallow, to breathe. His entire past-was it a lie? Could that be? Or was it a mystery to be solved? Just as the fate of the Impures had been passed down to him through an old male's tale of the truth.</p><p>Gray tipped his head back and let the spray smack him in the face, the neck, where his pulse pounded.</p><p>He would go back there.</p><p>Had to go back there.</p><p>The shower door opened with such force the glass stuttered. Gray ratcheted up, his head shifting right to catch his intruder. Dillon stood there, nearly enveloped by the steam, her full lips curled with distaste and annoyance. \"You've been in here too long.\"</p><p>If there was a place between hate, curiosity, and deep, pulse-pounding lust, then that's where Gray resided when it came to this veana. \"Worried about me, D? Or did you come to tell me breakfast is ready-cause I'm starved.\"</p><p>\"Yeah. It's all laid out, Impure. Bacon, pancakes and eggs over-asshole.\"</p><p>\"I'll be right down. And by 'right down' I mean 'don't hold your breath.' \"</p><p>She looked down her nose at him, all serious now, real dictatorial. \"Let it go, okay, Gray? Get over it already.\"</p><p>Gray's mouth kicked up. \"Are we talking about that comment about my dick in the cold? Sure it stung a little, baby, but I was over it the moment I left you downstairs.\"</p><p>\"You know what I'm talking about.\" Her stare was resolute, unwavering in her seriousness. \"And don't call me baby.\"</p><p>Standing directly under the spray, water dancing down his skin, Gray returned, \"That how you deal with the tough stuff, D? Let it go? Pretend it isn't there?\"</p><p>\"Damn right I do.\" She shrugged. \"Any and all.\"</p><p>\"Well, you're a bigger man than me.\"</p><p>Her eyes flickered down, remained on his groin for several seconds, then lifted.</p><p>He couldn't deal with her, not here, not now. Couldn't deal with her eyes on him, her scent so fucking close it made him want to lap at the steam to just get a taste of her. He had to think, plan his next move. \"I have a shower to finish,\" he uttered, dropping his head, letting the water pound the back of his neck.</p><p>Again, she ignored his call for solitude. \"If you don't stop agonizing over something you can't change you'll make yourself crazy.\"</p><p>The water fell over him in gushes. Maybe he'd thought that same thing, maybe he hadn't thought at all. Not until he'd seen what he'd seen. Gotten personal with someone he'd never expected to meet-or shit, even knew existed.</p><p>\"If you're planning on going back, it's not going to happen,\" she continued. \"I'm the only one in this bathroom who knows where the Paleo is and I'm not telling.\"</p><p>Well, maybe he needed to look outside the bathroom.</p><p>But not yet.</p><p>He glanced sideways at her. \"How long have you known the location of that shithole?\"</p><p>She shrugged.</p><p>\"Days? Weeks? Months?\"</p><p>\"A few years.\"</p><p>Gray's jaw was so damn tight he thought it might crack. \"And you did nothing.\"</p><p>She inched forward, nearly hitting water. \"I told you I don't give a flying fuck about any of them. Impures and their problems are not my concern.\"</p><p>\"Except me.\"</p><p>\"You're not just an Impure, now are you?\" She cocked her head to the side. \"And why are you getting on my ass about this anyway? Before you were dragged down there, before you saw the Order's playground and toys, you didn't give a shit either.\"</p><p>\"Not true,\" he fired back, wincing internally at the possibility that she was right on the goddamn money with that assessment.</p><p>\"You've done nothing to help them, nothing to further your Cause. All you've been doing is baseline shit-looking for your 'kind,' looking for a place to live.\" Her eyes narrowed. \"Looking for another cunt to drown your aimless dick in.\"</p><p>He growled at her. \"The word cunt sounds so right on your lips.\"</p><p>\"Goddamn Impure pussy . . .\"</p><p>Gray reached out and grabbed her by the arms. His strength peaked, he yanked her inside the shower and deposited her right in front of his face. Water rained down on both of them and she cursed.</p><p>\"What's with the rescue, D?\" he demanded. It was eating at him-to know, to understand. She'd rescued him once, in the hospital, now she was at it again. Was this all about Sara or was there more? Did she have any kind of feelings for him other than clear and present irritation?</p><p>Her hair was soaked, her face alive and impassioned and pissed off. She looked hot. Way too hot for him to want to knock her out. Knock her up though . . .</p><p>She grabbed him around the neck, squeezed just a fraction of an inch. \"You know I allowed you to pull me in here, right?\"</p><p>His fangs dropped. \"Why. Did. You. Come. For. Me?\"</p><p>She leaned in, her mouth close to his, and she lapped at one sharp, white fang with her tongue. \"I've never come for you, Gray.\"</p><p>His cock twitched and started to rise. Fuck her. Screw her and her games.</p><p>She grinned at him. \"And I don't ever want you thinking you can put your hands on me without my permission.\" Completely wet now, she leaned back against the shower wall and crossed her arms over her chest.</p><p>Gray stared, a hunger fisting inside him as he took in her body and the wet clothes that clung to it. Her white shirt was totally see through, the bra too, and it made his breath catch in his throat. Round, achingly pretty breasts assaulted his vision, but it was her nipples, hard and highly edible, that made the skin over his bones convulse.</p><p>He was hard now, his cock rock solid and pulsing against his stomach as though it had a heartbeat of its own. \"Sara ask you to keep watch on me, D? Is that was this is all about? A favor for your fantasy girlfriend?\"</p><p>Within the confines of the swirling steam, her face remained calm, but implacable. \"She would never forgive me if I let something happen to you-something I could prevent.\"</p><p>\"You're such a good friend.\"</p><p>\"I try.\"</p><p>\"Yeah, I know you do.\" He raised a brow. \"Again and again to no avail. Talk about chasing something that can never be changed.\"</p><p>Her lip curled and her gaze drifted down his body. \"Glad to see the cock still goes up and down, Impure.\"</p><p>\"For anything with a nice set of tits.\" He leveled her with a callous gaze. \"You know how that is, D.\"</p><p>She laughed. \"If only I had a cock. Oh, the damage I could do.\"</p><p>His body went instantly on alert, heating up, rising up. \"What kind of damage?\"</p><p>She laughed at him.</p><p>She was so good at it, at making him feel like a dick, like a fool . . .</p><p>Like an Impure.</p><p>And yet, he wanted her. Wanted her more than he'd ever wanted anything.</p><p>\"Tell me about the damage, D,\" he said, trying to control the shudder in his voice, the desire to pounce on her, then pound her senseless. \"Or better yet, show me.\"</p><p>\"You couldn't handle it, Gray.\"</p><p>There was not a trace of teasing or bitchiness in her tone or words this time. Nothing but truth, grave truth. And something else, something deep within her hazel eyes. It flashed there, a warning light.</p><p>But when had he ever stopped on red?</p><p>\"Try me,\" he challenged.</p><p>She smiled-it may have been a sad, pitying smile, but he didn't care. She was away from the wall and coming at him like a tiger, graceful and deadly. Her fangs flashed as she wrapped her arms around his neck and captured his mouth.</p><p>Holy shit.</p><p>Gray felt as though he were dying, drowning. And he welcomed it-hell, he would've begged for it. It was the kind of kiss that consumed. The kind of kiss that didn't need to force the breath from your body because you handed it over without question or complaint. It was unlike any kiss Gray had ever experienced and as he gripped her waist and yanked her closer, impossibly closer, he let go of all thought, all concern. As the water rained down on both of them, and the world grew lava hot, Gray let the veana who both tortured and turned him on kiss the shit out of him.</p><p>Goddamn, her lips were so soft, impossibly soft-and luscious and teasing and when her tongue began to thrust into his mouth, back and forth with a sexual power that sent come to the tip of his cock, his fangs descended further and trembled with a desire he'd never experienced.</p><p>A desire maybe he should never have experienced because it would make every kiss pale in comparison after this.</p><p>She pulled back then, her eyes finding and locking with his. \"I'll let you finish up in here.\"</p><p>She left the shower, walked right out of the bathroom, dripping wet and sans towel.</p><p>Gray hesitated for less than a second, the sight of her walking away wrenching something deep inside him. He forgot everything else, even the running shower, and bolted after her. The hallway was empty, but he spotted her wet footprints and followed her down the stairs. He knew, his brain knew, that the wisest course of action was not the one he was taking. And yet, it was as though an animal's instinct, hunger, primal need had taken over and he was just along for the ride.</p><p>He cleared the last step, stood there for a moment sniffing. Where was she? Wet and cruel. Where had she run off to?</p><p>Then he spied droplets of water in the carpet leading down another hallway. He took off, ran down its length and into a room that contained her scent, her wet, teasing, diabolical scent.</p><p>Could've been the kitchen, could've been the garage-he was too blind to everything else but her to notice or care. He thought maybe there was a bed on one wall, but all he saw, all he wanted was the veana undressing near the window. He was on her in seconds, had her around the waist, had her yanked back against his chest, and without thought had his mouth on the back of her neck.</p><p>She tasted like sweat, and it was the sweetest, most erotic flavor to ever hit his tongue.</p><p>His fangs extended to pin-prick sharpness.</p><p>\"Fuck, Gray!\"</p><p>She wrenched free, turned in his grasp and slapped him hard in the face with the palm of her hand.</p><p>It felt like the brush of a butterfly's wings. That's how gone he was-beside himself. Hunger like he'd never known-predatory desire like he'd never known-coursed through his blood. The need was insatiable and he was unstoppable. He moved forward, struck again at her neck and this time made contact.</p><p>Dillon sucked in air, gripped his shoulders hard, painfully hard, but she didn't push him away. He knew she could-knew she was stronger than him by a thousand.</p><p>Blood, delectable blood snaked down his throat, and as it did he heard her moan, felt her nipples-naked and cool-grow hard against his chest. Oh shit, he wanted to fuck her senseless. His head dropped further, his fangs plunging deeper into her skin until he could do nothing but drink, drink and lap at her skin with his tongue.</p><p>\"Fuck,\" she cried out, her nails digging into his skin. \"Fuck!\" And then she was slapping him. Slapping his face, his cheek, over and over as she ground her hips against his.</p><p>It only made him drink harder, deeper.</p><p>She knew her effect on him.</p><p>He knew she knew it.</p><p>Suddenly, he stilled, stopped feeding, his mind racing. But how did he know it? It wasn't in her head. The thoughts, the silent cries of need, the ever present push to keep going, harder, faster, deeper, that he'd heard in the heads of every female he'd ever bedded.</p><p>The world, the moment, once wide and fever-pitched, shrunk down to a pinprick. He rocketed back, his fangs pulling out of her skin in one clean movement. What the hell was going on here? His breath coming in heavy gasps, he wiped the blood from his mouth and stared at her.</p><p>She grinned at him, her breathing normal-her eyes clear, not glazed with passion. \"You have a very nice set there, Impure. Sharp. Thick. Got the job done and then some.\"</p><p>She was unaffected. Completely and utterly. And he wanted to rage at her about it, force her to admit her attraction to him, but there was something far more worrisome on his heart at that moment. Eyes narrowed, completely uncaring of his nude frame and heavy cock, he said, \"I can't hear you.\"</p><p>She turned away, grabbed a tank top and threw it on. \"No worries. The buzzing will wear off in a moment. It's my blood. Pure, powerful-\"</p><p>\"No.\" He shook his head. She had to be thinking. Right now she had to have some thought in her head. But he was picking up nothing. She was a blank screen.</p><p>It was impossible.</p><p>Her eyes narrowed on him. \"What's wrong with you?\"</p><p>Did he tell her? Did he share his concern and ask her for a probable answer to the mystery? His head cocked, his gaze took in her fine features, cat eyes and firm set of her mouth. She seemed way too closed and he wasn't in a very trusting mood. Until he figured out the reason for this blip in his gift himself, he wasn't about to share it with the class.</p><p>\"Maybe you need to go lie down,\" she said, nodding toward the door. Her bedroom door, he now realized. \"Get some sleep.\"</p><p>Her bedroom. His gaze moved around the room. White walls, white bed, white, white, white except for the small stuffed animal wedged in between her pillows. A cat, or some kind of wild feline, he couldn't tell.</p><p>\"Your room's upstairs,\" she said, her voice tearing him from the bed, from the odd plaything among all that virginal white. \"It's right next to the bathroom.\"</p><p>\"Yeah,\" he said. \"Sure.\" Then headed for the door.</p><p>\"And when you wake up,\" she called after him, \"all this-everything that's happened--will have been just a bad dream.\"</p><p>His hand closed around the doorknob.</p><p>\"And I mean, everything.\"</p><p>Slowly, he glanced over his shoulder. Dillon stood there in a black tank and jeans, her hair a little wild, her eyes trained on him-her thoughts a mystery. She looked hard, mean, insensitive and untouchable, and if Gray would have allowed himself to sink back into hunter mode, he'd have been all over that. Again.</p><p>\"You understand, right?\" she said, dropping her chin, her eyes narrowing. \"You get it?\"</p><p>\"Get what, D?\" he said with barely restrained bitterness.</p><p>She shrugged. \"You know. It was as close as I'm ever going to get to Sara.\"</p><p>He stared at her. For one very long, agonizing moment. It stung. Her words. Stung like a motherfucker, and instead of wanting to walk out of the room, it made the newly unleashed predator in him want to prove her words a lie. But he was tired, tired of getting dicked around, and so he did it-turned and walked out. He walked down the hall, up the stairs, past the bathroom still heavy with steam and into the bedroom that supposedly belonged to him. He sank down on the mattress and prepared to wait. A minute, an hour, however long it took for her to forget that he existed so he could get the fuck out of Dodge and back where he belonged.</p><p>Where he had always belonged. </p> </body></html>"]