["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>I don’t understand. I stare at him with my mouth hanging open. “What’s not possible? At least tell me.”</p><p>Cole leans close enough to kiss me, but he doesn’t. My heart jumps. Those blue eyes are on me and my brain melts. His perfect lips form words and I can’t take my eyes off of them.</p><p>“Us. We’re not possible.” He licks his lips as he speaks. My eyes fixate on the movement. I think he’s going to say more, but he doesn’t.</p> <p>Disappointment leaks across my face. My heart is pounding and I don’t even know why. The way he looks at me, the soft touches—that kiss—all of it says we’re out of the friend-zone, but this utterly confuses me.</p><p>Cole sees it in my eyes, I know he does. But instead of putting my confusion to rest, he leaves it there. I feel hollow, like fragile glass, like I might shatter.</p><p>I want him to say it. I think about forcing the issue, but I can’t. Blowing the relationship apart, banishing the pieces I have for the pieces I want, seems foolish.</p><p>The disappointment slides off my face. Cole crosses the room and sits in the blue chair. His dark hair falls forward, obscuring his eyes. Tension lines his shoulders and creases his brow. This relationship will break if I push him. Something is there, something hidden that I can’t see. It holds him back. It makes him act like this.</p><p>I shift my weight in the bed and pull my knees into my chest. I don’t take my eyes off of him. Cole feels my gaze and looks up. I manage to say, “Then give me something else.” My heart is pounding. “You hold me at arm’s length with some things and then with other things, well—” I point both hands at the bed I’m sitting in, “Just give me something. Anything.” The plea in my voice makes my stomach twist.</p> <p>Cole gazes at me from the chair, “What do you want, Anna? No one is as close to me as you are. No one else shares my bed. Ever. It’s been years since another woman walked through that door every night,” he points toward the front of the house as he says it. Cole doesn’t sound mean, but he does sound like I’m asking for something he can’t give.</p><p>My voice is soft, “I’m not asking for everything. I actually like this, even though it sounds insane.” I wish it was more, but if it’s this or nothing, I choose this. I lick my lips, watching him shift his weight in the supple chair. “Tell me something, something about you. We can trade secrets. Tit for tat.”</p><p>Cole’s gaze narrows and a dark brow lifts, “Really? You’d be willing to answer anything I asked you? A complete revelation? No holding back? No areas off limits?” He leans forward, placing his elbows on his knees. Cole shakes his head, but he smiles softly as he does it, “I hardly think that’s wise, Miss Lamore.”</p><p>“Half the things I do aren’t wise, Mr. Stevens. As an act of good faith, you go first.” My hands are pulling the sheet over my lap. My bottoms are nothing more than a lacy boy short.</p><p>Cole is bare-chested. Soft flannel pants hang from his hips showing off his toned body. His tanned skin is smooth and completely lickable. Cole wiggles in the chair as a smirk lines his lips. “This isn’t a good idea, but...”</p><p>“It’s too tempting to refuse?”</p> <p>He nods, “Like so many things about you, it has the same seductive allure.” The corners of my mouth lift and I look away. His gaze is too intense. Cole straightens and leans back in the chair, “Very well, I’ll play along, but it’s only because I have a few questions that you aren’t forthcoming with, and your logic is baffling at best—”</p><p>“Just ask, Cole.”</p><p>He takes a breath, “The day you came to the internship interview, it was obvious that you didn’t hold me in the highest regard—”</p><p>I laugh, “I didn’t like you, dude. You can say it.” I lower my voice and bob my head as I imitate him, “Anna detested me.”</p><p>“Is that what you think I sound like?” he grins and shakes his head. Smiling,</p><p>I lift a brow at him and say, “Is that your question?”</p><p>“No,” he becomes serious again. “I am however wondering if I want to know the answer. It seemed like I disgusted you. I want to know why.” Cole’s voice becomes a whisper as he speaks.</p><p>I fidget in the bed. Swallowing hard, I look him in the eye, “The reasons seem stupid now. I didn’t know you, then. I thought I did, and I was wrong.”</p> <p>“That was hardly a personal answer, Miss Lamore. Care to elaborate?” His voice is teasing, but I can hear the genuine curiosity there as well.</p><p>I press my lips together gathering my thoughts. “I thought you were a sleaze, running a sleazy studio, groping girls in their underwear. Add to that your money and you didn’t have a chance.”</p><p>“The money made it worse?” he asks, his fingers steepeled at his lips. Those blue eyes gaze at me, unblinking, waiting for an answer.</p><p>I nod slowly, feeling more exposed than I thought I would. “Yes, the money made it much worse. It would have been better knowing you were disowned.” I straighten and kick the sheets off. Moving to the end of the bed, I flip onto my stomach and pull my feet up behind me, twisting my ankles together. I can tell he wants to ask more, but he doesn’t.</p><p>“Now it’s my turn.”</p><p>Cole seems nervous, but he doesn’t look away. He leans to the side, resting his head on his hand. “Ask me, Anna.”</p><p>“Who’s the chick in the red dress?” I nervously tuck some of my loose curls behind my ear. Ever since first seeing her, I’ve wanted to learn who she was and what she means to him.</p><p>“My lawyer. She’s been helping me prepare for something... unpleasant.” His voice is cool and even as he says it. This wasn’t the answer I expected. It’s revealed more questions I don’t have the answers to. But, whatever is going on, whatever Cole is dealing with, must be crushing him. The things that make him sound like that—voice level to the point of apathy—are the things that are the worst. Something bad is happening to him, something that requires legal advice.</p><p>“And?” I prompt.</p><p>“And nothing more. I believe you were inquiring as to our relationship status. It is professional and always has been. The formality of our attire was for appearances only, part of a public display to help cushion what’s coming.” As he speaks, Cole’s eyes take on a distant expression. The muscles in his arms tighten as his fingers fist. He tries to hide it, but he can’t. Something’s going to happen to him, something that I can’t stop.</p><p>“I’m sorry,” I say. “I had no idea.” I want to fix it, I want to take away his burdens, but I don’t know how. I don’t even know what’s wrong. Attempting to lighten the mood I say, “Ask me about Vanilla.”</p><p>Cole’s eyes dart up and meet mine. He holds my gaze and finally says, “Tell me why you prefer vanilla, Miss Lamore.”</p><p>“Anna. Call me Anna, Cole.”</p><p>His chest expands as he takes a deep breath and I openly admire him, my eyes drifting and lingering on his smooth skin. “Why do you prefer vanilla, Anna,” he breathes my name and sends shivers down my spine.</p><p>A wicked grin twists my lips. “I don’t.” The words roll of my lips and I’m suddenly very aware of my tongue.</p><p>Cole’s eyes darken. The stubble lining his cheeks accentuates the strong lines of his jaw. He’s gazing at me with a predatory look. “Explain.”</p><p>“My ex liked things plain and simple. I don’t. I like things he didn’t think were sexy. I like sticky, sweaty, slippery sex. I’m not Miss Vanilla, Cole. I’m the opposite.”</p><p>Cole works his jaw as I speak; his eyes riveted to my face. He stares at my eyes, then my mouth. He sucks in air and tilts his head back as I speak. “The opposite?” I nod slowly. My hair slides forward and I reach around and pull it to one side. Cole’s eyes drift to my chest and the cleavage that becomes visible as I do it. Something changed, but I don’t notice it yet.</p><p>“Yes,” I say looking back up at him. Shrugging I add, “I’d just met you and was thinking I was a bit of a freak for even wanting what I want. It seemed like a strange thing to tell you, so I hid it and switched things around.”</p><p>Cole’s tension sky-rockets as I speak, but when I say that I think I’m a freak, he drops his hands and stares at me slack-jawed. “How could you possibly think that?”</p><p>“You don’t know what I wanted to do,” my face flames as I choke out the words. Cole opens his mouth to ask more, but I shake my head. “Just so you know, we’re crossing my hell-no line, and whatever I ask you next has to be comparably horrifying. So tread lightly, Mr. Stevens.”</p><p>Cole nods slowly as his lips pull into the sexiest smile I’ve ever seen. Shaking his head, he says, “I understand. And I promise I’ll answer whatever you ask, even if it crosses my hell-no line, as you call it.” I grin at him and waggle my eyebrows. Taking a deep breath, I pull up the sheet. I can feel the question building before he even says it. I want to hide behind the sheet. Cole’s voice cuts through me and makes me melt. “What do you want most that he wouldn’t do?”</p><p>A high-pitched moan travels up my throat. I don’t want to tell him. I want to tell him. I clutch the sheet and cover my face. It sizzles as he asks; it burns because I know the answer. Cole stands, crosses the room, and pulls the sheet from my face as he kneels on the floor in front of me. We’re nose to nose. I feel his breath on my lips as his gaze pins me in place. I can’t look away. My pulse pounds in my ears and I shiver. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tell me,” he says gently, taking my shoulders in his hands. His fingers swirl little circles on my smooth skin. He swallows hard, waiting.</p><p>Butterflies fill my body, making me giddy. His hands are strong and warm. I feel them pressing against my skin and I wish they were on my face, cupping my cheeks. As if he heard me, Cole lifts his hands and splays them on the sides of my face. His thumbs stroke my skin as his fingers slide back into my hair.</p><p>“It sounds silly, like nothing.” My voice is light as a caress, barely audible. I watch Cole’s lips as I say it. I can’t look him in the eye and take the full on heat of his gaze. “I wanted him to kiss me between my legs where no one has, taste me, swallow, and ask for more.” Fear twists my stomach, sending a series of shivers cascading over my skin. I’m clutching the sheet, strangling it. Whenever I brought up oral sex with my previous boyfriends they were ecstatic that I wanted to do that with them, but they felt no desire to reciprocate. It made me feel like wanting them to want it was dirty.</p><p>Cole releases my face a beat after I say it. He remains in front of me, but looks away. “There’s nothing freaky about that, Anna. It’s a normal sexual act and I’m sorry he deprived you, but that doesn’t necessarily mean you’re into kinky things.” He looks up at me, his expression soft and kind.</p> <p>“Ah, that’s just an example, Cole. The thing I wanted most that he wouldn’t do. I didn’t say it was the kinkiest. That’s the tip of the unfulfilled, sexually frustrated iceberg.” My voice is husky and I can’t look away.</p><p>Cole stares at me like he’s never seen me before. The rosy glow that was limited to my cheeks now sears my entire body and he grins. “So, you’re telling me—let me make sure I got this right—that a kinky sex goddess has been laying in my bed every night for the past few weeks?”</p><p>Smiling, I nod once. The way Cole looks at me makes me think it’s okay, that things will be all right. He lowers his dark lashes and releases a breath slowly. His hands run through his hair tousling it even more. When he looks up at me, I can’t breathe. Everything about him tempts me beyond control. I want to tangle my fingers in his hair and pull his mouth down on mine.</p><p>Cole shakes his head like he can’t believe it and then sits back in the chair. It’s my turn to ask a question. Internally, I’m fighting over what to ask—about the ring in the safe or why he won’t touch me. Every inch of my skin prickles as I think about his hands on me. I wish he were close. I wish so much that he’d tell me. While I want to know about the ring, I want to know this more.</p><p>“Why won’t you touch me?” My voice is a whisper. I don’t look at him. I expect his answer to punch me in the gut. I expect to hear, because he doesn’t think of me that way, that I’m too young, too inexperienced to be with him like that.</p> <p>“Anna,” he breathes my name like it haunts him. When I steal a glance, his eyes are closed and his face is in his hands. I turn away before he says it. I don’t want to hear the reason. I’m sorry I asked. As Cole opens his mouth to speak, I cut him off.</p><p>Raising a hand, I reach it out in front of me, holding up my hand and say, “Stop. Wait.” Breathing hard, I look into his face. Remorse consumes him. I wish I could fix it. I wish he’d let me hold him and take away whatever sins haunt his memory. Cole’s lips remain parted, but he doesn’t speak. He waits for me to finish. I sit up in the bed and pull my feet under me. “I don’t want know.”</p><p>It’s quiet for a moment and the only sounds I hear are my racing heart and my ragged breaths. Then Cole says, “The answer isn’t just one thing. I can’t dismiss you Anna, but I can’t make this more than it already is.”</p><p>“What is it, Cole? Are we friends? This feels like more to me, but I can’t wrap my mind around it. I don’t understand how you can lay next to me at night without touching me.” I feel the panic in my voice and try to shove it back down, but it won’t recede. “Don’t lead me on. Don’t make me think one thing and then do another. I—”</p><p>Cole crosses the room in two steps and scoops me up in his arms. He sits down on the bed with me in his lap and I rest my head against his bare chest. His heart is racing. His arms tighten around me before he kisses my hair gently. “It wasn’t my intention to lead you on.”</p><p>“Then what is your intention?”</p> <p>“To protect you. To keep you from getting hurt. I thought that this was better, but it’s not. I should have kept my distance, but I didn’t. I can’t reverse this Anna. I can’t undo weeks of you sleeping in my bed and seeing your face every morning.”</p><p>I glance up at him. Fear pinches my throat tight. “Do you want to?”</p><p>His blue eyes are crystal clear and lock onto mine. I start to look away, but Cole gently pulls my chin back to meet his gaze. “No. Every memory of you, every moment was—” he presses his lips together and stops speaking for a minute. Finally, he breathes deeply and sets me down on the bed. “I have to maintain my original boundaries, otherwise this won’t work and I’m not ready to say good-bye yet. It’s utterly selfish, but it’s the best I can offer.”</p><p>I don’t understand, but I don’t say so. Dejected, I slide back into the bed away from him. What is this? Why won’t he let me get closer? I lay my head back onto my pillow and stare at the ceiling.</p><p>There’s nothing more to say.</p><p>CHAPTER 2</p><p>Early the next morning, I slip away to the parking garage across the street to get my bike. It’s safe, well, as safe as a parking garage can be. It’s well lit and has a guard booth at the front, but it still makes Cole uneasy. If I park in one of his slots, below his building, he knows nothing will happen to me or my bike. After last night, though, I don’t want to bring up anything that might torch our already precarious relationship.</p><p>Pressing my eyes closed as I reach the bike I sigh and press my fingers to my eyes. What relationship, Anna? There is no relationship. Correction, there is no sexual relationship. Somehow I’ve ended up in the same goddamn boat I had been in with Edward. With that thought, the skin on the back of my neck begins to prickle, making me glance around, but I can’t see anything except parked cars.</p> <p>I reach for my helmet and unlock it, pocketing the keys as I slip it onto my head. I fish a ponytail holder from my other pocket and work my hair back to the base of my neck and twist the piece of elastic in place. As I’m fastening my helmet, I feel like someone is watching me. My skin prickles all over and my heart starts to race. I turn and look around, but I still don’t see anyone. A car drives by and heads toward the exit. I can see the street from where I stand. The early morning traffic catches my attention with glittering red taillights and raucous horns blaring. Then I see him on the sidewalk. Edward. He sees me, waves and approaches me from the street.</p><p>Jogging over, he says, “Anna, good to see you.” Edward looks perfect. His jeans hug his slender hips and his long-sleeved pale-blue shirt brings out his eyes. But something puts me on edge. I can’t say what, I just feel uneasy around him and want to get away as quickly as possible. But I can’t seem to get my helmet strap tightened. Apparently, it twisted when I pulled it through the metal loops. I try to fix it without taking it off. I want to leave.</p><p>I nod and smile even though I don’t feel like it. “Good morning, Edward.” I can be civil. There’s nothing wrong. The fluttering in my heart and the panicked feeling telling me something isn’t right is insane. This is Edward. “What are you doing over here so early in the morning?” I glance up, wondering where the security guard is. His booth is empty, and a car that’s waiting for him decides to bypass payment and darts out into the street. It’s quiet again. No car engines rumbling inside the sunken cement, no exhaust fumes clinging to the ceiling.</p><p>He shrugs and slips his hands into his pockets, “On my way to an interview up the street.”</p><p>I arch a brow at him, “Who’s over here? I thought all these buildings were residential?” The helmet isn’t cooperating. I can’t seem to get it untwisted. I undo the chin strap completely, pull it, and start over.</p><p>Edward’s eyes fixate on my hands fumbling the helmet strap. “It is, but there’s a—” he stops talking and steps toward me. He reaches for the black straps and says, “Here, let me do that. You seem shaken up.”</p><p>I want to jerk my head back, but I don’t. Instead I stand there like an idiot and let him strap my helmet on. His fingers push the black strap through the metal loops and he pulls, tightening it. I grip my hands in front of my waist and try to slow my pulse.</p><p>When he finishes, he grins at me. When I don’t smile back, he asks, “What’s wrong? You seem out of sorts.”</p><p>I want to say only around you, but I don’t want him to think that he affects me. Besides, this doesn’t make sense, any of it. Why is he here? What are the odds that he’d walk in front of this garage at this time? Is he following me? I think I’m being paranoid, but the feeling doesn’t fade.</p><p>I turn away from him, smiling nervously and reach for the bike. “Nothing’s wrong. I’m just jacked up on caffeine. You know me.” I lie and swing my leg over the motorcycle. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I do know you, Anna. And I’m here if you need me.” He glances at me on the bike for half a beat and adds, “Be careful with this guy, Anna.” He says it like he knows something I don’t, like it’s more than a general warning.</p><p>I wonder how he knows anything about me and Cole. It must have been Emma. She must have told him I was with Cole. Irritation shoots through me. I didn’t think it was necessary to tell her not to discuss my love life with her brother, but apparently I was wrong.</p><p>I start the bike and say, “I can take care of myself, Edward. And you better get to your interview or you’ll be late.”</p><p>He laughs, “I’m never late. I’m still early actually.” That was probably true. He is always early. It irritated me when we were dating. Everywhere we went, he had to arrive half an hour early. Edward looks from his watch to me and steps in front of the bike. He rests his fingers on the handlebars and looks up at me. “Just be careful, okay?”</p> <p>I nod at him, wanting this conversation over. “I gotta go.” Edward steps aside and I rev the engine and pull away from him. I can feel his eyes on my back until I’m out of the garage and on the street zipping through early morning traffic.</p><p>I stop on the side of the Long Island Expressway and grab a cup of coffee. The morning air is cooler than usual. I breathe deeply, admiring the white fluffy clouds strewn across the sky. If I was still in high school, I’d be drawing clouds today. I had one art teacher who was always excited when those fluffy white ones appeared. I didn’t understand why until I tried to draw one. It turns out that drawing clouds is hard. Mine looked like floating bricks. There was nothing light and fluffy about them.</p><p>I pull out my phone and rest the coffee on my thigh. I won’t have time to see Emma until this weekend, but I have to know if she told her brother about me and Cole.</p><p>I text her as I sip my coffee.</p><p>Me: Hey Em. Saw your bro. Did you tell him anything about Cole?</p> <p>A few minutes pass. Emma is in class. I don’t expect anything back right away, but my phone dings.</p><p>Emma: No. That’d be worse than talking to u about him. What happened?</p><p>Me: Saw him in the garage this morning. He warned me away from Cole. Wondered how he knew.</p><p>Emma: idk. I swear I didn’t say anything.</p><p>Me: OK. Just asking. Will u b around tonight?</p><p>Emma: Yup. Catch up then?</p> <p>Me: Hell yeah. Lots to tell u.</p><p>For a second I just stared at the screen. How did he know about Cole? And did Edward really know something about Cole, or was he just screwing with me? I wasn’t sure, but it left me feeling very uneasy.</p><p>I poured the rest of the coffee down my throat and tossed the cup before pulling back into the traffic. Why I took the LIE is beyond me. It’s always crammed with traffic this far west. Once I got out onto the Island a little ways, it would clear up. In the meantime, I bobbed and weaved between cars and trucks, passing the occasional driver who was horrified of motorcycles. One woman nearly drove into the wall trying to get away from me. I zip past her and feel the rush of early morning air on my face.</p><p>I refuse to let my mind play games with me. Edward’s not a stalker. I dismiss my lingering apprehension from this morning and push it out of my mind, giving the situation with Cole full access to my entire brain.</p><p>Last night didn’t go the way I planned. I want more from Cole, but I don’t want to risk losing him. Finding out the woman in the red dress was his attorney doesn’t make me feel better. At first it did, then I realized that if she’s around that much something must be very wrong. I wish he’d ask me for help or at least lean on me a little, but Cole is so closed off. He keeps his emotions close to his chest and it’s hard to tell what he’s thinking. But after last night, I did learn one thing—I do mean something to him—I just have no idea what.</p><p>CHAPTER 3</p><p>“Regina, we have a full calendar today so I need you to fix the sets as we rotate through. That way as soon as the next client is here, we can start.”</p><p>Regina looks up at me. Her copper hair dangles over her shoulders. The green top she wears makes the color more awesome and her crop pants are so cute. Like all Le Femme employees, she’s barefoot. She nods, “No problem. Oh, there was a message from your school. They said they hadn’t received your internship papers yet and they need them back by the end of the week.”</p> <p>“By tomorrow?” My brows pinch together as I straighten and look at her. I drop the rug I’m holding and stare at her. That’s not right. The internship papers weren’t due until two weeks after the internship was over. That is four weeks away.</p><p>“Yup,” Regina says. She looks up at me when she sees my expression. “I wouldn’t worry about it. Cole probably lost the papers or something.”</p><p>I nod slowly and go back to what I’m doing, “Or something,” I say under my breath, trying to figure out what it is.</p><p>By the time I get to the campus, it’s nearly 5:00pm. They’ll close before I get to talk to someone. I glance at my watch. The line at the registrar’s office is moving at snail speed. When I finally get to the front, I’m really anxious and not looking forward to talking to some kid about the lost papers or why the university wants them back early.</p><p>I step up, ready to ask what the hell is wrong with them, when Jesse Oden looks up at me from the desk. “Can I help—” he smiles when he sees me, his expression completely changing. “Anna.”</p><p>“Jesse? What are you doing here? I thought you graduated?” The girl behind me audibly sighs and folds her arms.</p><p>He ignores her, “I did. I’m doing some grad work over the summer. Student job. So what do you need? Enrollment forms? Application for graduation?” he guesses.</p><p>“No, I’ve done all that stuff already. I got a phone call today that said my internship papers weren’t turned in. I thought they were due after the internship was over. I have two weeks left. Could you check my account and see what they want?”</p><p>“Sure,” he smiles tapping the keyboard. After I tell him my student number, he’s into my files. He grins, “Impressive GPA.”</p><p>“Snoop,” I laugh. He looks up at me and winks.</p><p>“Let’s see,” he says, his finger tracing lines on the screen, scanning it quickly. His expression changes as he does so. He glances up at me and I can tell something’s very wrong, but he says, “Yes, they want your papers early. There’s a note here for me to hand them to you when you come in, and schedule you an appointment with the dean.”</p><p>“The dean? What for?” Everyone is watching me now. This isn’t typical. Something is wrong, I just don’t know what.</p><p>Jesse nods as he collects the papers I need from the slots on his desk. Taking the stack, he taps them once on his desk and shoves them under the stapler, then hands them to me. “Get these back to me by tomorrow. And I’m scheduling you for an appointment with the dean for tomorrow at 4:00pm.” He hands me an appointment card. I’m annoyed and worried. I just take it and don’t look at it.</p><p>“Thanks,” I say and head out the door.</p><p>If I blow this internship, I don’t graduate. I want to pull my hair out. I exit the building and find a bench. Sunlight pours through the leaves forming a lacy pattern on the ground. Taking my phone, I enter the appointment time for tomorrow and notice Jesse wrote a note on the back of the card.</p><p>Wait for me.</p><p>I sit under a tree and watch the students as they head toward their evening activities. About ten minutes later, Jesse walks out of the building and sees me. He smiles initially, but it fades quickly. He sits next to me on the bench.</p><p>“So, what’s new?” he asks teasingly.</p><p>“Oh, my God! Is it that bad? I saw your face. Just tell me.”</p><p>Jesse looks up at me and I can tell it’s bad. His smile falters and he looks at his hands. “I’m not supposed to say anything, but it seems too insane to be true. Your internship was ended early,” he says softly. “Someone reported that you’re having sexual relations with your boss.” His dark brows creep up his face as he says it, looking at me like he can’t believe it.</p><p>I can’t breathe. I feel like someone hit me in the stomach with a board. I lean forward, panic flooding every inch of me. Even though Cole and I don’t have a sexual relationship, it looks like we do.</p><p>“So, it’s true? I’m guessing this is the guy who had your heart when I first met you, too—isn’t it?” He sounds sympathetic. He places his hand on my back and pats once like a friend. “It’s not going to go well if you tell them.”</p><p>I sit up quickly and stare at him, “There is no sexual relationship with him. There hasn’t been. It’s been all work. Nothing else.” My voice is soft, remorseful.</p><p>“But you wish it was,” he adds, and I nod. Blinking hard, I look over at him. “Thank you. I know you’ll get in trouble if they find out you told me. Did it say who made the allegation?”</p><p>He shakes his head, “No. The complaint was filed directly with your dean. The info wasn’t put into your main file.”</p><p>“This isn’t happening,” I clutch my face, horrified that I’m reacting this way in front of someone I barely know. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hey, if nothing happened, there’s nothing to worry about.” I feel desperate and lost. He leans close to my face, tucking a curl behind my ear. Our eyes lock. He wants what Cole can’t. Jesse breathes, “I’ll cover for you. I can tell them how we met that day on the beach. There were other people around. If you say that me and you are together, and deny your relationship with your boss, they should let it drop.”</p><p>“I can’t have you lie for me,” I say, not looking away, not putting more space between us.</p><p>“It’s not a lie,” he says lifting his hand to my cheek. “I haven’t stopped thinking about you. I keep checking my phone, hoping you’re over him—and calling me.”</p><p>I feel so lost, so alone. I need Cole, but that will just make it worse. The entire relationship with him made everything worse, including me. I want something with him that he won’t give. I want his whole heart, but he won’t let me in. Loneliness and fear mingle together and I can’t stop looking at Jesse’s lips. He pulls me to him slowly, gently pressing his mouth to mine. It’s like last time. The kiss is sweet and chaste, asking me if I want him.</p> <p>Indecision flashes through my mind. I could try to hold onto whatever I have with Cole, but there’s nothing there. Correction, there’s friendship there and nothing more. We traded sex secrets and he didn’t even look at me last night. I thought I meant something to him. The way he cradled me in his arms felt like I mattered, but I went to sleep alone and woke up alone. Cole didn’t see me off this morning and didn’t say anything else last night. Was it cheating to continue this kiss?</p><p>There’s nothing between you and Cole, so how are you cheating? The voice inside my head snaps at me like I should know better.</p><p>Jesse’s breath is warm, and the feeling of his hand on the side of my face is strong and perfect. He lingers by my lips, his lashes lowered, looking—waiting for me to push him away. But I don’t. I lean into the kiss, feeling a rush of emotions race by as I plummet off an emotional cliff and obliterate any chance of being with Cole.</p><p>Jesse’s tongue slips past my lips and into my mouth. He strokes me slowly, like he’s thought about this since the first time we met. I want to lean into him. I want to feel nothing, to let go of the weeks I’ve spent with Cole, but I can’t. I break the kiss and look down. Jesse’s hands remains splayed on my cheeks, cradling my face. I can’t look at him.</p><p>“Sorry. I just can’t...” my voice is shaky and trails off.</p> <p>He touches his forehead to mine, “It’s okay. You don’t have to say anything, Anna.” When he leans back, he drops his hands to his lap. He smiles at me sadly, “I wish I had better timing. I wish I found you first.”</p><p>I glance up from my hands, and try to smile, but I can’t. Everything is pressing down on me, making me feel like a claustrophobe trapped in a coffin. I can’t stand it. I want to nod at Jesse and act like he doesn’t affect me, but he does. I stand and he does the same.</p><p>“You okay?” he asks, trying to catch my eye.</p><p>I mean to look up and nod, but a sob catches in my throat. Tears fill my eyes as I nod and cry, “Yeeees.”</p><p>“I think you mean no.” He steps toward me and says, “Come on. Let’s go grab an early dinner.”</p><p>“Why are you being so nice to me?”</p> <p>“I’d rather be your friend than nothing at all. Besides, it seems like you could use a friend right about now, anyway.” He keeps his distance, occasionally brushing against my arm or directing me by my elbow, as we walk across campus and emerge onto the jammed streets. It’s rush hour. He takes me into the first place he sees and we grab a table in the corner.</p><p>I dab my eyes with a tissue and look up at him. He’s the only one who seems to want me, and I keep telling him no. What’s wrong with me? Jesse is my age, my type, and I’m pushing him away because I want something I can’t have—Cole Stevens.</p><p>“So, you want to talk about it?” he asks, leaning his arms on the table.</p><p>“There’s nothing to talk about. Nothing happened with me and Cole. Nothing’s happened the entire summer.”</p><p>“But you wish it did?” he says.</p><p>I nod. “I thought there was something there, but I was wrong. When we talked about it last night, he pretty much told me no.”</p><p>Jesse’s face twisted with confusion. “Then where’d the complaint come from?”</p><p>I shrug. “No idea. It’s a slap in the face after last night. Honestly, you got further with me than I got with him.”</p> <p>Jesse smiles. “Did I?”</p><p>I nod and look up at him. “If I met you a few weeks ago...”</p><p>“I know,” he says. “Listen, if things fall apart, you risk not graduating. We need to focus on that. That’s the main problem right now.” I nod, agreeing with him. “Let’s assume that they find you guilty.” My spine goes rigid as my mouth falls open.</p><p>“But I didn’t—”</p><p>“I know, but say things go to hell—worst case scenario. You’ll need another internship. Something where you can jump in and wrack up a ton of hours fast. Did you have a fallback?” I nod. Sophia ended up being my second choice. “I’d contact that person if the shit hits the fan and the university scratches your hours, especially if that studio showed any interest in you. It’s the fastest way to fix it.”</p><p>I think about that for a second. I’d be back where I was in the beginning, except Sophia would know I’d chosen Cole over her. I wasn’t sure how she’d do with that. I nod and look up at Jesse across the table. I wonder why I can’t let Cole go for him. I wonder if I do this to myself—pick guys who are defective to prevent having a real relationship with them. It seems like a double strikeout, first with Edward and now Cole. Meanwhile there is a perfectly hot guy sitting in front of me, who seems genuinely interested in me. I sigh and lower my gaze to the table. I’m such a head-case.</p><p>“That’s really the only option I have, right? Go back to Sottero and beg?” I look up at Jesse to see him nod.</p><p>“Do you have classes in the fall?”</p><p>I shake my head. “No, I finished everything early by taking short courses last year. Usually people have their internship over the summer, come back and complete their classes. The dean let me flip them around so that I could walk in graduation at the end of August.”</p><p>“So that’s your best bet. Go see the dean, deny the whole thing and hope it was just some jealous guy spewing crap. Maybe it won’t go anywhere.” Jesse waves at the waitress and she refills our glasses.</p><p>Sipping my soda, I ask, “You think someone did this to me on purpose?” Who would do that?</p><p>Jesse shrugs, “Maybe. Or maybe something just didn’t look right. Is there anything that would have made someone think you were together?”</p><p>My face flames. “Ah, well that answers that question. Listen, Anna.” He leans forward in the booth and pats my hand to get my attention. “Think of it as just another hurdle to jump over before graduation. No big deal. It’s your boss that’s going to catch hell for it, not you.”</p><p>“What do you mean?”</p><p>“It’s against university policy to have a sexual relationship with your intern. Period. If they think he did it, well, I’m not sure what they’ll do, but since it’s Cole Stevens I don’t think it’ll just get swept under the rug. Tabloids have been following him around for the past couple weeks. It’s like they sniffed out something brewing below the surface with him.”</p><p>As Jesse speaks I think about the woman in the red gown, his lawyer. Something bad was coming. Something Cole already knew about. My stomach twists and I wonder if he already knew about the accusations, if that’s the reason why he won’t touch me. Hope and dread flood through me, making me feel sick.</p><p>Jesse sees me pale. “Listen, you can handle this. Keep acting like it’s nothing. Don’t react until it hits the fan, okay?” He squeezes my hand. I look up at him and nod slowly. There isn’t a doubt in my mind that it already has and I’m the last to find out.</p><p>CHAPTER 4</p><p>“Anna Lamore is here to see you,” says a woman twice my age. She looks up at me with judgment in her eyes.</p><p>The intercom buzzes back, “One moment.”</p><p>“Have a seat. He’ll be with you shortly.” She gazes at me briefly and then returns to tapping the keys on her computer. I slip into a seat and wait. Students come in and out, scheduling their appointments to make last second changes to their fall schedule.</p><p>The commercial carpet on the floor is pristine. It must be new. The walls are lined with commercial art -- if you could even call it that -- of large flowers in ugly vases. The pale mint green paint does nothing to add any warmth to the room either.</p><p>The big brown door in front of me cracks open and the dean walks out. Dr. Grillo is a vertically-challenged man, close to fifty years old with a dusting of grey scattered through his remaining hair. He wears a brown suit with a pair of loafers that have seen better days.</p><p>“Miss Lamore,” he calls my name and holds the door open. He doesn’t smile at me the way he usually does and my stomach drops into my shoes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I walk past him into the office. He closes the door and clears his throat as he makes his way to his desk. “Since there is no easy way to begin this conversation, I’m just going to jump right in.” He sits behind an old wooden desk piled high with papers. He shifts his work to the side, folds his hands together, and looks at me sitting across from him. “Miss Lamore, someone has brought to our attention that you may be in an inappropriate relationship with your internship supervisor. Is this true?”</p><p>My voice catches in my throat, “No,” I clear my throat and say it again, louder. “No, it’s not true. Whoever told you that was misinformed.”</p><p>The dean‘s shoulders don’t slump with relief when I say it. “Anna, we know you’re an adult and can make your own choices when it comes to dating, however, when coupled with academia—”</p><p>I cut him off. “Nothing happened.” My hands are clutching the arms on the chair so hard that my knuckles are turning white. I don’t let go. This has me so angry that I can’t stand it. “Cole Stevens has been an excellent supervisor. My internship is going well, which is why I can’t understand who would say this.”</p> <p>“You haven’t been sleeping with him?” He asks me pointe blank.</p><p>I don’t think he means it literally, so I shake my head, “No. We do not have a sexual relationship. This is ridiculous! Graduation is too close for me to start over. You have to believe me.” I’m pleading with him. It hurt that Cole rejected me, but this makes it even worse.</p><p>“I’d like to, Anna, but the person who brought this matter to our attention has proof that you did stay at Mr. Steven’s residence on multiple occasions.”</p><p>My skin prickles as I realize what it means—someone has been following me. All those times I felt like someone was watching me, I thought I was insane, but now I’m angry.</p><p>“So, let me get this straight, Dr. Grillo. Someone provided you with proof that we were having sex. Is that what you’re saying?” I’m at the edge of my seat, ready to bounce out of it. Fury is fuming silently inside of me, threatening to explode. This is so wrong.</p> <p>“Please Anna, calm down. It’s enough to have your internship pulled and have Mr. Stevens reprimanded. We cannot allow even the appearance of indiscretion when it comes to academics. You know this, Anna. Do you want people questioning your grades? Do you want them to say your class rank had nothing to do with your mind? They will -- especially with regards to you. You’re at the top of your class. I’m sorry Anna, but we can’t let this slide. You’ll have to find another internship and start over in the fall.”</p><p>“But that means I won’t graduate until December.”</p><p>“I’m sorry,” he says. “There is nothing I can do about that. The internship is a requirement for graduation.”</p><p>“If I get another internship and complete the requirements in the next three weeks, can I still walk in August?” I don’t breathe. I didn’t want it to come to this, but this is what it came to.</p><p>The dean leans back in his hair and looks at me like he feels sorry for me. “If you can complete the requirements, then yes.”</p><p>I nod slowly. I don’t know what to say. It hurts that my words don’t matter, that the appearance of a relationship was enough to damn me. A question crosses my mind, “Have you spoken to Mr. Stevens yet?”</p> <p>Dr. Grillo nods, “Yes. He knows the repercussions for such an accusation.” I wait for him to explain, to tell me more, but he doesn’t. Instead he stands and says, “Go to the registrar’s office, get new forms, and if you manage to talk someone into an internship now, file the papers directly with me.”</p><p>CHAPTER 5</p><p>Emma isn’t home yet. I move around the tiny apartment, wandering like I’m lost. I don’t know what to do. Jesse was right. My internship with Cole is void and I have to start over. Nerves choke me, but I have to do it—there are no other options.</p><p>Dialing her number, I wait for Sophia to pick up. “Sottero Studios,” she says, even though she has caller ID and knows exactly who it is.</p><p>“Ms. Sottero, this is Anna Lamore. We met earlier this summer at an internship interview.”</p><p>“Yes, Anna. How can I help you?” Although that’s what she said, her voice sounds clipped, like she doesn’t want to waste more time on me.</p><p>“I need an internship. I’m willing to work every waking moment for the rest of the month.”</p><p>She sighs. “What happened? Did Cole fire you? I told you to avoid that man, but you didn’t listen. Why should I take you now?”</p> <p>That is a good question. “You shouldn’t,” I say. “I should have listened to you. I’m sorry to have bothered you. You’ve been more than kind. Thank you for your time—” I feel dejected and embarrassed.</p><p>She cuts me off, “Oh, don’t be so melodramatic, Anna. It’s not the end of the world, it’s an internship. Come to my office tomorrow morning. Bring the papers. We’ll get you started. How many hours do you need to log before the end of August?”</p><p>“Three hundred and twenty,” I say cringing.</p><p>“Not a problem,” she replies. “It’s wedding season. We can knock that out in a couple of weeks if you’re willing to work 18-hour days.”</p><p>“I am.”</p><p>“Good. Be here at 8:00am.” After giving me final directions on attire and locations, she hangs up.</p><p>I hold my phone in my hand looking at it. Nausea washes over me. It feels like I stabbed Cole in the back. It’s necessary I tell myself. Cole will understand.</p><p>The key scrapes the lock and Emma pushes through the door. “Oh, my god. Has hell frozen over?” She glances around the room and then back at me with a grin on her face. “Are you actually going to sleep in our apartment tonight?”</p><p>Emma should have been the only one who knew where I have been sleeping. Leaning on the counter I ask, “Did anyone ever talk to you about me? Ask where I was sleeping?”</p><p>She tosses her purse on the couch and sits down like her knees broke. “No. What’s going on?”</p><p>I told her everything and she listened with her mouth hanging open. “No fucking way. What did Cole say?”</p><p>“I haven’t spoken to him yet.”</p><p>“He’s going to be pissed.”</p><p>“I think he already knows,” I say. “His lawyer’s been around a lot lately.” I press my lips together to keep from saying more. “I need to go see him.” I head toward the door.</p><p>CHAPTER 6</p><p>By the time I get to Cole’s apartment, it’s nearly midnight. I walk through the front door and call his name. When I don’t get a response, I make my way through his house and find him sitting in the blue chair in his bedroom. A glass of amber liquid is in his left hand. His dark eyes look more black than blue. He sits in the shadows with the lights off.</p><p>“Cole,” I say, and he looks up at me in the doorway. I linger there for a moment, afraid of what will happen when I tell him, but from the look on his face I suspect he already knows.</p><p>“Miss Lamore.”</p><p>“Anna,” I correct and walk to the bed and sit on the edge across from him. “I suppose you already know.”</p><p>He stares at me blankly. Nerves slither over my skin and make me shiver. Finally he says, “The University told me that you’ll no longer be working for me. Is that your decision?”</p><p>“I don’t have a decision, Cole. I need an internship to graduate. If I don’t do one, the last four years mean nothing.” My voice is higher than usual. Panic spreads through me. He doesn’t want me to leave, but I have to.</p><p>“You’re the one who decides, Anna. Not them.” He swirls the contents of the glass and stares at me like I stabbed him in the back.</p><p>“My decision would have been to be with you. My decision would have been to have you touch me. My decision would have made the accusations true.” The words pour out of my mouth and don’t stop as I rise and step toward him. “But my decision doesn’t seem to matter.” I stand before him with my hands on my hips. Cole stares up at me.</p><p>“I apologize for depriving you, Miss Lamore.”</p><p>“Anna.”</p><p>The way his eyes bore into me steals my breath. “But I make decisions and stick with them. I will not touch you.”</p><p>“Fine. Then don’t.” Turning on my heel, I mean to leave, but he grabs my wrist.</p><p>My pulse skyrockets as he speaks. “I won’t,” he breathes inches from my lips. The way he says it sounds sexy, like that’s all he thinks about. He steps forward and I back into the bed. “Sit,” he says and I comply.</p><p>The intensity of his gaze and the way his body moves, like he wants to crawl across the bed and take me, makes me shiver. I don’t speak. I can’t. The entire thing seems surreal.</p><p>“Touch me,” I breathe.</p><p>Any restraint Cole kept in check snaps. His lips gently brush against mine and I melt. My stomach flips inside of me and I want to tangle my fingers in his hair, but he pulls away. His hands are splayed on my face. He presses his forehead to mine and sucks in a ragged breath, before stepping away from me and back into his chair. I don’t know why he left, what he’s doing. He relaxes a little, and grips the sides of the chair. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My body aches for his touch. I’m wound so tight that it feels like I’m coming undone. “Cole, you can’t leave me like this.”</p><p>“I don’t think you’re up to the kind of things I like to do.” Cole tosses back the rest of his drink and leaves the glass on the table next to him. “And I have no intention of pressuring you. You’re too young for me, Miss Lamore. There’s no way this will end well.”</p><p>“Anna,” I say breathlessly. My eyes lock with his. “And I don’t care how old we are or aren’t. I know you want me. I can feel it. I can see it in your eyes, in the way you look at me.” His lips part like he’s going to say something, but he doesn’t. He watches me as I crawl back onto his bed and lift my shirt over my head. I wiggle out of my pants and sit half-dressed on his bed. He watches me, his eyes drinking in every inch of my body. I kneel there, letting him look before saying, “Show me what you like.”</p><p>Cole remains still, slouching back in the chair like he doesn’t care that there’s a naked woman on his bed, but his eyes say something entirely different. They are dark, and threaten to devour me.</p><p>Cole blinks slowly, like he made a decision. His voice is even, unemotional. He breathes normally, like I don’t affect him. “Lean back against the headboard, and part your legs.” His tone is firm, commanding. It makes me feel afraid and excited. My eyes are locked on his face. I can’t look away. Pushing myself up, I lean back against the headboard and part my legs. He can see between my legs from where he’s sitting. My heart slams into my ribs as my stomach swirls with anticipation.</p><p>“Slip your bra off,” he commands. I reach around and unhook the bra. Cole watches carefully, taking in the sway of my breasts. When my hands are over my head, I realize how much he likes to watch. I slow my movements before tossing the bra to the floor, letting him look. “Now the panties,” he says.</p><p>I lift my bottom, and slide them down my thighs. I lift my legs, pulling them out of the leg holes one at a time. I pick up the bottoms and toss them to him. Cole catches them and presses the scrap of fabric to his face and breathes in. The action shocks me so much that I gasp. Cole glances up at me and smiles that predatory grin he has sometimes. It makes me shiver, but I’m not backing down. I want him and this is what he wants. I part my legs, spreading them wide. Cole’s eyes are locked on the sensitive flesh between my legs. I press myself back against the headboard, arching my body as I do it. His eyes drift to my breasts and then my face. His eyes lock with mine.</p><p>“Take one hand and spread your lips. Take the other and run a single finger over your clit, barely touching it.” His voice slides over me. His words make my face turn bright red. Cole watches me, his arms folded, his gaze hot. My left hand parts my lips and my breath hitches. I lower my gaze when my right hand is on my clit, but he says, “Watch me, Anna. Don’t look away.”</p><p>I stroke my clit and look into his eyes, “Yes, Cole,” I purr his name and blink slowly. My hand moves between my legs stroking the sensitive skin again and again, never taking my eyes off of him. My body flares to life, the lower parts of me tingle with anticipation, wanting more. My hips lift slightly, meeting my hand.</p><p>Cole sits across the room. He leans back in his chair, his hands on the arms. He breathes deeply, and leans forward watching me, not breaking eye contact. When my hips start to buck, he says, “Only move your hand, Anna.” Cole’s voice is hard, commanding.</p><p>I watch him as he says it and notice his gaze darken. He watches me move my hand across my body, stroking myself slowly. I try not to move and find it difficult. If he suggested doing this, I would have been mortified, but in the moment, it feels sexy and I don’t want to stop. My fingers move against my slick flesh with Cole watching, his gaze taking in every slow blink, every hitched breath as I fight to keep my senses and not come.</p><p>Cole’s gaze shifts between my eyes and the place between my legs. He watches as my muscles tense, and I try to remain still. I have trouble keeping my eyes open. I want to close them and lose myself in the steady heat that’s building between my legs, but Cole changes things. The onslaught of sensations flooding through my body overwhelms me. I want to do anything he says, I want to hear his voice telling me what to do. It’s hard to stay still, but Cole’s eyes pin me, so that only my hand moves.</p><p>“Faster,” he says. “Harder.”</p><p>My hand develops a quick rhythm moving between my legs. Wet heat throbs inside of me, begging for release. Every inch of my body is corded tight. My stomach twists into knots as Cole watches me. The way he sits there makes me think he doesn’t care, but his eyes say something else.</p><p>The damp heat spreads as my fingers stroke the skin between my legs. My mouth parts and I’m breathing hard. I fight my body as it wants to move, and buck my hips into my hand. I’ve never wanted to be touched so much in my life, but Cole doesn’t move.</p><p>Instead he says, “Stop.” My hand stills and I’m shaking. “Pinch your clit. Hard.”</p><p>My fingers grip the nub and press together. Air rushes out of my throat in a high pitched moan. I can’t think. I can’t talk. I want Cole to fuck me until I can’t walk. I want to feel him inside of me, pushing against me. The pressure on my clit is tormenting me and I realize that I’ve closed my eyes. When I reopen them, Cole is standing over me.</p><p>I’m trying so hard to stay still, but I can’t. My muscles are twitching on their own, making my hips move the tiniest amount. Cole grabs me by my ankles. He yanks me until my feet hang off the end of the bed. Crossing my ankles, he forces me to flip over. I lay face-down on my stomach gasping, with Cole between my legs, standing at the foot of the bed. Before I can say anything, I feel a hand across my ass. He strikes me and it stings, sending jolts of electricity through my pussy. I yelp and look back at him.</p><p>Cole says, “A little mistake gets a little spanking. Two more, Lamore.”</p><p>I relax and put my face down on the cool sheets. I purr and his hand lands on my bare skin again. I gasp and my knees threaten to give out. I want him. I can’t stand him teasing me like this. By the time the final strike comes, my body is ready for it. My hips buck as his hand connects making him strike me harder.</p><p>Cole pulls me until my hips are hanging off the bed. “Spread your legs.” I part my ankles and feel the cool air rush between my lower lips. Before I have a chance to breathe, I feel Cole’s hand on my back, pushing me into the bed. His hand slides lower, down to the small of my back. I remain like that, with my ass in the air, hoping he’ll fuck me.</p><p>Cole brushes his jeans against my ass, allowing me to feel his excitement. I want his hard length inside me. I bite my lip to keep from calling out. I can’t see what he’s doing, but I felt his hands on me, between my legs. He strokes me gently a few times, feeling me, learning every inch of me. He grips my clit hard and I start to lift off the bed, but his hand is still on my back and holding me down. “Don’t move, Lamore.”</p><p>As he speaks, I feel warm breath across my soft, damp skin. I shiver. He’s going to kiss me between my legs. The heat of his tongue makes me gasp, but I stay still. He licks me from my ass to my clit, his broad tongue sweeping over every inch of me, caressing every soft fold. My hands clutch the bed to keep from screaming. I want more. I can’t stay still. Then his tongue is inside me, thrusting deeper, tasting me. He shifts his hands until he holds my hips and pulls me down harder on his face. Rocking me slowly, he builds a rhythm that I can’t ignore. His tongue licks and sucks me, tasting every inch of me, driving me wild until my body is coiled so tight I can’t last another second.</p> <p>“Cole!” I cry as I shatter, coming in his mouth. His lips don’t pull away. His tongue licks my tender skin, tasting me until he is finished.</p><p>When he lifts his head, Cole steps back. My arms are weak, shaking—but I manage to roll myself over. My heart feels like it exploded. I try to speak, but only huffs of air come out. When I look at Cole, his gaze isn’t readable. He lifts me onto the bed, gently laying me on the pillows next to him. I am completely naked, sucking in ragged gasps, trying to stop and gain some semblance of control. But Cole just watches me. He lays on his side, bare-chested, above his jeans. His gaze lights a trail over my abdomen as he trails his finger from my navel to my neck.</p><p>“Cole,” I moan his name, not wanting him to stop.</p><p>“Anna,” he whispers in my ear, making me shiver. When I finally come back to myself, I gaze up at him.</p><p>“That was the sexiest thing anyone has ever done to me.”</p><p>He doesn’t say anything. Cole just slips his gaze over my body taking in the slight sheen of sweat and sliding his finger over my curves. Finally, he says, “I shouldn’t have done it.”</p><p>Taking his hand, I push myself up on my elbow and look him in the eye, “Don’t say that.”</p><p>“Anna, it was a mistake. I have trouble refusing you. Please forgive me.” He sits up and pulls his hand out of mine. Crossing the room, he places his hands on his dresser and doesn’t look back at me.</p><p>My heart is pounding hard again, reacting not to excitement but the regret that floods his voice. “There’s nothing to forgive.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But there is. There is so much.” He turns and when he looks at me fear crawls up my throat like an icy hand. “I think it’s best for both of us if you complete your internship and seek employment elsewhere.”</p><p>“What?” It feels like I a sucker-punch. I sit there, pulling up the sheet to cover me.</p><p>“It’s for the best.”</p><p>Anger flashes in my eyes, but Cole doesn’t look away. Grabbing my clothes, I pull them back on hastily. “Fine.” My voice is flat. “I’m done with this. I’m done with you.”</p> <p>CHAPTER 7</p><p>I cried my eyes out for the rest of the night and it shows. Sophia Sottero looks like perfection next to me with my puffy eyes and dark circles.</p><p>She gives me a once over in my black skirt and white blouse. It was the same outfit that Cole told me was too formal for work. “Anna dear, you look like hell frozen over. If you want to work eighteen-hour days, you can’t stay up doing god-knows-what the night before. For the next three weeks, you’re mine. No one else. Understand? Tell this boyfriend he’ll have to wait, because I won’t have this.” She gestures to me like I’m disgusting.</p><p>Offense flows through me. I don’t look that bad, but I also don’t look perfect, which Sophia obviously demands. I nod, “Yes, ma’am.”</p><p>She puts her hands on her hips and says, “Good. I’m glad we understand each other. Now, go grab me a cup of coffee—two creams, no sugar—and bring it to my desk. You’ll do that every morning.” I nod, realizing I’ve been demoted to gopher.</p> <p>Thoughts of Cole flood my mind as I try to adjust to working with Sophia. She’s anal OCD to the max. If I think about her too much she makes my eye twitch. Later that afternoon, another intern found me in the ladies room.</p><p>“You have been in here way too long,” she says zipping around the room, washing her hands and drying them before running for the door.</p><p>“What are you talking about? It’s barely been three minutes.”</p><p>She glances back at me, her dark eyes wide. “I know. Hurry up or she’ll bite your head off.”</p><p>After washing my hands, I emerge from the rest room.</p><p>“Ms. Sottero wants you in the shooting room,” says another intern. She glares at me like I’m irresponsible.</p> <p>I head to the shooting room and kick off my heels as I walk through the door. Sophia looks over at me, her dark eyes darting to my feet and then back to my face. “Shoes are required at all times, Anna dear.” She sighs and walks toward me. “It appears that I’ll be unteaching what Cole has taught you. Assuming nothing, all right?”</p><p>I slip back into my shoes and nod. I don’t like the way she speaks about Cole. I sense some unspoken resentment there, but I can’t put my finger on what exactly. A bride and her entourage arrive a few minutes later. I become a coat rack. Then I help dress the bride, pulling corset strings and making sure she looks perfect. I fan her train. I bring her water. I do everything that Regina does. Sophia doesn’t trust me with the lights or the camera. I groan internally. This is going to suck.</p><p>Sophia snaps her fingers in my face, “Wake up, Anna. Really.” She scolds. “Fan her train again and give her back her flowers.”</p><p>When I hand the bride her flowers, I notice she’s fidgeting - which seems to irritate Sophia. “Is something wrong?” I ask.</p><p>“Yes, the top of my foot is itchy. I think it’s from the petticoat. It keeps tickling me.” She moves again trying to get the itch. When she can’t she looks up at me, “Could you do it?”</p><p>That sums up the rest of my first day at Sottero’s: scratching feet, fetching coffee, and being all around slave labor. Sophia is kind enough to remind me before I leave that this internship position is not paid.</p><p>CHAPTER 8</p><p>It is late by the time I walk through the front door. Emma is sitting on the couch with Jesse. Surprised, I stop in my tracks and look up at him. “Hey,” I say.</p> <p>Emma waves at me, “He came by about an hour ago. I told him to wait for you.” She pops a chip into her mouth.</p><p>Jesse stands and walks toward me. “I hope that was okay.” He says, uncertainty lining his face.</p><p>“Of course. It’s fine.”</p><p>“I saw the papers for the new internship come through the office. Actually, I was the one to enter them into your account. I assume things with the dean didn’t go well.”</p><p>“Hardly,” I say, taking off my heels and rubbing my feet. The idea of shoving those on again tomorrow sounds horrifying. “They scrapped my hours with Cole and made me start over.”</p><p>“I’m sorry Anna. I know how much you were dreading that.”</p><p>I try to sound like it’s a good thing, but don’t quite manage it. “It’s fine. I originally wanted this internship anyway. Life has a funny way of sorting things out. I just didn’t belong with Cole, I guess.”</p><p>Jesse looks up at me. We gaze at each other for a beat, before I look away. “Uh, let’s go back here to talk, so Em can watch whatever’s on TV.”</p><p>“I can leave. Damn, just say it Anna.” Em says getting up.</p><p>“Sit down, grump. Eat your chocolate. You’re acting like the PMS Troll again.” Jesse’s eyes go wide as I toss Emma a Hershey bar.</p><p>She catches it and laughs. “Sorry. And thanks.”</p><p>“No problem,” I say, and indicate Jesse should follow me. As he walks into my room, I say, “Now don’t get the wrong idea. The apartment is really small and for some reason you know more about me and Cole than Emma does.”</p><p>Jesse nods and looks around for a place to sit. He chooses the chair in front of my desk. “I didn’t think it was an invitation for a booty call.” He grins. “I’m not that dense.”</p><p>“And that’s why I like you.” I peel off my jacket as I talk and put my shoes in the closet. Jesse watches me. He dangles his arm over the back of the chair.</p><p>“So,” he says, looking at me shyly. It’s a very different gaze than the intense looks Cole gives me.</p><p>“So,” I reply and smile weakly at him. The corners of my mouth fall and my worries can be seen plainly on my face.</p><p>“It’ll be all right, Anna. You can do this. Think of the time with Sottero like trying to sit through Peters’ class if it was a short course.”</p><p>“That’s about the only thing that would be worse.” Professor Peters was so boring I never even noticed Jesse sitting in front of me. I had to drink two Red Bulls to keep my head from hitting the desk. Thinking about Sottero, I say, “She’s nothing like I thought she’d be. Cole let me shoot...on my own. Sophia has me getting her coffee and scratching people’s feet. Feet, Jesse.”</p><p>He nods sympathetically. “So, I’ve heard.” He pauses for a second, leans toward me. His gaze falls to the floor and then back up to my face. “You know, there have been some interesting remarks about her when all the internship papers are handed in.”</p><p>“Such as?”</p><p>He smiles at me, and I get the feeling he’s telling me stuff I’m not supposed to know. “Nothing you can’t handle, not after putting up with Stevens. Sottero can be thoughtless and pushy. The interns didn’t feel they really got a hands-on learning experience. It was more like going through the motions to get to the next phase of life. But on the bright side, Sottero’s name is gold. You’ll get a job when you’re done without a problem.”</p><p>Pulling off my thigh-highs from the toe, I wad them up and toss them on my bed before sitting down hard. “I had a job. It was a great job.”</p><p>Jesse asks, “It sounds like you miss it.”</p><p>“A little,” I glance up at him.</p><p>Jesse glances at his watch. “I should get going. I just wanted to stop by and make sure you were okay.”</p><p>I nod and stand. “Better. Today was definitely better than yesterday.” Yesterday, when Cole jerked my emotions around like it didn’t matter. Yesterday, when I finally gave up on him even though I didn’t want to.</p><p>CHAPTER 9</p><p>Sophia snaps her fingers at me, “Anna, dear, we must hasten.”</p><p>Hasten? Really? Sophia Sottero is like Mary Poppins on crack. She smiles widely and makes everyone love her, well, everyone who doesn’t work for her. It seems like the interns scatter when Sophia is around. She’s constantly snapping her fingers and smacking people with newspapers and magazines like they’re wayward puppies. It’s getting on my nerves, but I made it through a week. Jesse was right. I can do this. The shorter time span meant longer hours each day, but it meant less days as well.</p><p>I jog toward her and she frowns at me, snatching the prop out of my hand, “Do not run.”</p><p>I smile and nod. I want to tell her that she’s friggin’ crazy and then quit, but I can’t. I deal with her the best I can. If I was stuck here permanently, I’d bash my brains in.</p><p>My mind drifts back to Cole. That night on his bed still floods my dreams and I can’t stop thinking about it—about him. Sophia is telling the bride how stunning she is and it sounds sincere, but she sneers when she turns to take the other camera in my hands. It’s clear she thinks the girl looks like a train wreck, but when she turns back around Sophia is all fake compliments. I get tired of this. Day after day, it’s the same thing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I finally ask, after a shoot one afternoon, “When will I be allowed to assist with the lights? Or a shoot? Or tag along to a wedding?”</p><p>Sophia turns slowly and looks at me like I’ve said something funny. When I wait for an answer, she places her hand over her heart and says, “Oh my God, you’re serious. You think you’ll get to shoot. How sweet.”</p><p>“Of course I thought I’d get to shoot. You told me over the phone that I’d be doing all of these awesome things, and I’m not doing any of them. I’m not learning anything.” Sophia has me sorting extension cords and wrapping them with zip ties. A large orange cord dangles from my wrists as I speak.</p><p>“I told you about the things you would do if you were hired here. I wasn’t referring to the internship, dear.” When Sophia says “dear” she really means “idiot.”</p> <p>Remembering the conversation, I shake my head. “No, I specifically recall you telling me to intern with you—that Cole couldn’t teach me the things you could. Then you went into detail about what those things were. Bundling extension cords wasn’t on the list.” I sound snitty, but I don’t care. I feel like this was the biggest bait and switch I’ve ever fallen for.</p><p>Sophia steps toward me, her stiletto heel clicking on the tiled floor. “Cole, is it? Not Mr. Stevens?” She arches a brow at me. When I say nothing, she smiles as if she knows how hard I’ve fallen for him. “Do yourself a favor and get over him.”</p><p>I hate the way she’s talking to me. I smirk, “I’ve never been under him and I don’t plan on it, so there’s nothing to get over. He was just more casual in how he conducted his business.”</p><p>Folding her slender arms across her chest she says, “I see. And tell me, Anna dear—did he keep you around? No. He fired you like all the rest. Every year it’s the same thing; interns calling up, crying their eyes out that Cole Stevens fired them. Please hire me, Ms. Sottero.” She tilts her head at me, “I would have thought you had more sense.”</p><p>I never told her that the university was the reason I didn’t finish with Cole. I can’t reply without making it known, so I just look away.</p> <p>“Thought so,” she says, and saunters away, spewing verbal vomit at the next client.</p><p>CHAPTER 10</p><p>After two weeks of non-stop Sottero I want to rip my ears off and my nerves are shot to Hell. Jesse offers to meet me at the bar on the way home. Still wearing my work clothes, I see him standing outside waiting for me. He looks good, wearing dark washed blue jeans and a black blazer. When he turns his gaze in my direction, his eyes slip over my tight skirt and sheer blouse. My jacket is over my arm. I would have thrown the shoes away on the subway, but walking barefoot in the city was a surefire way to contract cooties.</p><p>“Thank God,” I say, when I get close enough. My entire body wants to fold in half.</p><p>Jesse grins and takes my jacket. “That bad?”</p><p>“Worse,” I say heading for the door. “Take the worst thing you can imagine and multiple it by a hundred. Then add the word idiot to the end and that sums it up. I plan on getting completely and totally drunk. I’m afraid you’ll be responsible for me for the rest of the evening.”</p> <p>“Sure, but won’t Sophia go crazy on you if you show up with a hangover?” He holds the door for me. I look into my purse, trying to fish out my ID in the dim light. There are a few people in line in front of us.</p><p>I shake my head, “Nope. Tomorrow is Sottero-free. I have the day off. My only day off, so I plan on getting every annoying thought of her out of my head so I don’t accidentally claw her face off Tuesday morning.”</p><p>Jesse laughs. “Your eye is twitching again.”</p><p>I feel it flutter and press them closed, listening to Jesse chuckle. His arm wraps around my shoulders and pushes me forward. When I look up, I hand my ID to the guy at the door. He nods and let us pass.</p><p>The bar is dark and fairly crowded, but there are so many people in Manhattan that, at times, I go weeks without seeing a familiar face. I don’t expect to see him sitting there at the bar, hunched over a drink. When Cole looks up, his gaze makes my heart convulse. My feet don’t move. Whatever Jesse was saying is lost.</p><p>Cole’s gaze slides from me to Jesse, to Jesse’s arm at the small of my back pressing me toward the bar, and Cole. I stiffen and feel Jesse’s gaze on my face. He follows my stare across the room as he asks, “What’s wrong?”</p><p>I don’t answer. Instead I watch Cole get up and toss cash on the bar. He walks toward me and I’m caught in those sapphire eyes. There’s nothing else there. There’s no bar. There’s no Jesse. There’s no Sophia making my life hell. It’s the way it was last time we were together. It’s all tension and tingles. It’s all sweaty thoughts and scandalous surges of lust.</p><p>Cole stops in front of us. “Miss Lamore,” he says.</p> <p>I don’t correct him. I try to steady my voice even though my heart is beating wildly. “This is Jesse.”</p><p>Cole turns his gaze to Jesse. “Mr. Oden.”</p><p>Jesse finally figures out who this is, “Wow, Mr. Stevens.” He sounds like a star struck teenager.</p><p>Cole glances at me once more and says, “So this is what you’re doing now?”</p><p>Smirking I say, “This and Sottero. Bet you wish you could watch.”</p><p>When I say Sophia’s name, Cole’s eyes snap to mine. I have no idea what possessed me to say it, except I don’t like his innuendo and I can’t let it alone. Saying I know how he likes to watch seems harmless enough, but I know he does. Remembering the way his eyes moved across my body the last time I was with him is enough to make me damp just thinking about it.</p><p>“You’re mistaken, Miss Lamore.” His tone is flat, like he couldn’t care less. “Good night.” Cole walks out the door without a backward glance.</p><p>My entire body is strung so tight it feels like my head will burst. Jesse takes my hand and pulls me to the bar. He waves down the bartender and orders us shots.</p><p>“So, that was Cole, the guy who’s been giving you a mind-fuck since before we met?” Jesse asks and I nod.</p><p>The drinks are placed in front of us. I’m not a heavy drinker and I know that if I swallow that I’ll fall out of my chair, but I’m not thinking. I take the tiny glass and throw back the contents. It burns my throat as I swallow and I open my mouth wide.</p><p>Jesse watches me and laughs, “What was that?”</p><p>“I don’t drink a lot. I like to be in control of things, and being drunk is kind of the opposite.” I glance at him. “I usually drink wine.”</p><p>“How many glasses ‘til you fall over?”</p><p>I shrug, “Three, maybe four.”</p><p>He laughs, “Well, no more shots for you. Part of this therapy is venting and you can’t do that if you pass out after one shot.” He orders me wine. Grateful, I take the glass and sip it. “So rant. Pick one, because now I suspect Stevens is going to be part of what’s driving you crazy. If he looked at you any harder, he’d need a condom.”</p><p>Grimacing at him, “He doesn’t like me like that.”</p><p>“Um, are you blind? Did you not see that back there?” Jesse’s brows shoot up his face and he points to the spot where Cole stood. “He wants you bad.”</p><p>“Well, I told him I was doing you.”</p><p>“Yeah, thanks for that one, by the way. He’s probably waiting for me outside so he can chop my nuts off.”</p><p>I spew my wine and try to use the tiny napkin to wipe it up. “He is not. He’s not like that.”</p><p>“Not like what? A guy? Anna, I may be wrong about other things, but not this.” He switches to beer after doing the shot. “Hell, I don’t even—”</p><p>Taking his jacket lapels in my hands, I pull Jesse toward my mouth. His lips land lightly on mine. Shock silences him and I feel his lips move against mine. When he pulls back he’s grinning, “You always make guys stop talking that way?”</p><p>I smile softly and down the rest of my wine. “Wait until you see what I do later.” I waggle my eyebrows at him.</p><p>Jesse is too sweet for his own good. He takes my hand. “About that, I don’t mind being your plaything—I mean I’m actually really excited about it—but let’s keep it to one thing at a time, okay? Check off your list in order. Number one: Get drunk. Number two: Get home. Number three: Kiss Jesse good night.”</p><p>Smiling at him I say, “You don’t want to be the rebound guy.” The softness in his voice and the way he looks at me makes me think he wants more than that, when I’m ready to give it.</p><p>He shakes his head. “Definitely not. The more I’m around you the more I can see that you’re worth waiting for.”</p><p>CHAPTER 11</p><p>I no longer know what I’m saying. My heart spills over my lips as Jesse alternates between walking me home and carrying me home.</p><p>“I just want to be with someone who likes me the way I am. It seems like such a major thing.” I stumble and Jesse holds my elbow, righting me. I glance at him and the streetlights continue to spin. “Whoa.”</p><p>He smiles at me and helps me along, occasionally saying soothing words. It finally dawns on me that I shouldn’t be saying this stuff to him and I grow quiet. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I stare at the sidewalk, at my feet as we walk. I’m barefoot. My thigh highs are in my right hand. I don’t really consider where I step. Jesse steers me around things that might puncture my feet.</p><p>“Penny for your thoughts?” he finally asks as we walk up my front stairs.</p><p>Leaning on the door, I turn back to him. “Why’d I let him do it? Why did I let him get to me like this? I can’t get him out of my head. He’s always there. His voice is always there echoing inside my mind.” I glance up at him and say what I’m thinking. “I’m an idiot. Sottero is right. She calls me Anna Idiot, you know, and she’s right. Only a total idiot, I mean a prime, grade A, kind of idiot would fall in love with a guy twice her age who doesn’t even like her. How am I supposed to deal with this? I don’t even know what to do, Jesse. There was no relationship. No breakup. There should be nothing to get over, but I feel like I’ve had my guts ripped out.”</p><p>As I speak, I slide down the door and sit on the front stoop. It’s nearly 3:00am and New York is as sleepy as it’s going to get. A couple walks hand in hand down the street, their faces close as they whisper to each other.</p> <p>Jesse sits next to me and runs his hands through his hair. “Anna, you had a relationship. It’s normal to feel something when it’s over. It doesn’t matter what he says, I see it when he looks at you. He wanted you. He wants you still. I have no idea what’s holding him back, but I can’t say I’m not happy about it.” I lean on his shoulder and he puts his arm around me.</p><p>I sigh. “You sure you don’t want to be the rebound guy? All sex, no strings attached?”</p><p>He laughs, “You don’t want a rebound guy. They have herpes.”</p><p>This pulls a smile to my lips and I look up at him. He’s grinning at me. “Just wait a little longer. Deal with one thing at a time. Wait out Sottero, then deal with the rest.” I nod, accepting his plan, because I don’t know what else to do.</p><p>CHAPTER 12</p> <p>The knock on my bedroom door sounds like cannon fire. I groan for Emma to go away, but she comes in anyway. Crossing the room, she quickly flicks on a light. I bury my head under my pillow.</p><p>“Go away, Em.”</p><p>“Can’t babe,” she says and sits on the edge of my bed. “You need to get up.” The tone of her voice is wrong, even with the mind-splitting headache, I can hear it.</p><p>Glancing out from beneath the covers I ask, “What’s wrong?”</p><p>She hands me a newspaper, but I don’t understand. I sit up slowly and grab my head. The paper slips off my lap. Emma picks it up and gives it to me again. “Look, Anna.”</p><p>I force my eyes to focus and see a picture of Cole. The headline says MULTIMILLIONAIRE COLE STEVENS IS RUINED. My heart lurches as I clutch the paper and gasp. Turning to Emma, I ask, “What is this?”</p> <p>She has that look on her face that parents have when they have to tell their kid that their puppy died. My stomach churns and I feel sick. She takes my hand like I’ll need her support. “I don’t know. It says that Cole was in a lawsuit and settled. His properties were awarded to the other party as part of the settlement. Le Femme is gone.”</p><p>“Oh, my God,” I can’t think. I can’t breathe. Wildly, I try to read the article, but my eyes won’t focus. “Who’s the other party? Who’d he settle with?”</p><p>“Sophia Sottero.”</p><p>The name smacks into me like a frying pan. “What? Sophia? How? What does it say? I can’t fucking see!” Tears sting my eyes and even the headline blurs.</p><p>“It doesn’t have all the details, but it sounds like they’ve been in a dispute for years and Cole finally settled to keep it out of court. His assets are going to be liquidated to pay off the settlement. It looks like a rape charge that was hushed. The article claims the nature of the attack was private and Sottero didn’t comment to the paper this morning.”</p><p>“That’s why she gave me the day off.” I rub the heel of my hand into my eyes. “I can’t believe this.”</p><p>Emma sits next to me and says nothing. Her hand is on my shoulder, then she just looks at me with sympathy. “Did he hurt you?” The question makes something inside of me snap.</p><p>“No!” I scream in her face. “He didn’t fucking touch me!”</p> <p>She holds her palms up, “Sorry, I didn’t know how to ask and after reading this... forgive me, but I saw the way he looks at you. I just want to make sure you are okay.”</p><p>There it is again, that same phrase—the way he looks at me. I shake my head and instantly regret it. “How does he look at me, Em? Like an intern? Like a student? Like he can’t stand the sight of me?”</p><p>She tilts her head and snaps back, “No, Anna. Like he wants to tie you up and fuck you. Like he can’t get enough by just looking at you. Like he won’t stop if you ever give him the chance.” She spits out the words like they’re poison. Each one makes me feel more lost than I already am.</p><p>Near sobbing, I say, “He never looked at me like that.”</p><p>Em smiles and shakes her head. “He looked at you like that every day.”</p><p>Her words are too much. Tears spill down my cheeks and Emma’s tone softens, “Hey, I didn’t mean to dump this on you first thing, but it gets worse.”</p><p>Wiping the tears from my eyes I ask, “How can it possibly be worse?”</p><p>She turns to the page with the full article on Cole’s ruin and there is a smaller article across from it with information about the alleged sex scandal at the university. It ends with not naming the student involved. I glance up at Em.</p><p>“They figured it out?” I ask.</p><p>“Reporters have been camped on the front steps since 4:00am. You’re lucky you missed them last night.”</p><p>I bury my face in my hands. Shame floods me, flushing my entire body scarlet. This can’t be happening. I stumble out of bed and go to the window with Emma warning me to stay out of sight. I peek through the blinds and cringe. It’s true. There’s a swarm of people toting cameras outside. I suck in a sharp gasp and release the blinds.</p><p>Looking at Emma, I say, “What do I do?” My voice shakes. I need to cry or yell or something but my hangover prevents me.</p><p>Emma says, “We shove through them and get the hell out of here. We’ll hang out with your parent’s for a while and give them time to go away. They shouldn’t smear you for not wanting to talk to them about it.”</p><p>“But it makes him look guilty if I don’t.” I tilt my head back against the wall. My entire body aches. Why did I choose last night to drink too much? This kind of crap always happens to me. Once I decide to do something selfish, like wallow around in my own misery for a night, it blindsides me the next day.</p><p>“I just wanted to get over him,” I say to Emma with my eyes pressed closed.</p><p>“I know, Anna. I know.”</p><p>CHAPTER 13</p><p>I get dressed and Emma says she’ll help me out the door. I don’t plan on speaking to them. I’m going to make a beeline for my bike and not come back until they’re gone.</p><p>“Ready?” Emma asks as she reaches for the front door knob.</p><p>I smooth my jeans and tug on my leather jacket. I look too badass to be taken advantage of -- at least I hope I do. I have no idea how I’ll react to their questions, so I put on the huge sunglasses Emma wore to a 70’s beach bash last year. They cover half my face.</p><p>“These are guilty glasses,” I tell her. They’re the kind movie stars wear when they get tossed in jail for drinking and driving or something equally stupid.</p><p>“You don’t look guilty. You actually look a little intimidating with that helmet under your arm. Listen, I’ll follow you to your motorcycle to make sure you get out okay. Just keep walking. Don’t stop.” I nod sadly. “You can do this, Anna. I know what they’ll do. This is my job, remember? I’d die to be able to interview you right now. Every single one of them is standing there hoping you’ll crack and say something worth reporting. They’re hoping you’ll say it to them, that they’ll be the reporter who gets the story.”</p><p>“Wait,” I say as she starts to open the door. Emma stops and turns toward me. “That’s not a bad idea. What if you interviewed me? What if you had the story so that they followed you when I walk out the door? You can tell them that you’ll answer a few questions and a full story will be in your paper.”</p><p>Emma stares blankly at me for a moment. “I can’t ask you to do that. So much has happened. I don’t want to make it worse for you, and a story might do that.”</p><p>I point at the people parked on the porch, “Too late for that, now. Let’s just try to control the carnage. Besides, I can’t hide out at my parents forever and Sophia expects me in tomorrow. It’s my last week.”</p><p>Her eyes bug out, “You’re still going?”</p><p>“I have to. What choice do I have?”</p><p>She nods slowly and crosses the room. “So, Miss Lamore,” she says in a different tone, one that tells me she means business, “come sit and tell me your story.”</p><p>The plan works. When I step out onto the porch an array of flashes blind me. They expect Emma to walk with me, but she stays on the steps and does as I asked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’ll take a few questions on Miss Lamore’s behalf. The entire story will run in Newsday tomorrow.” The reporters polarize. Some continue to follow me, ignoring Emma, but eventually even they stop in their tracks and look back at her, unsure of who to follow.</p><p>I hustle to the parking garage and once I’m out of sight, I take a deep breath to steady myself. I can still see them even though I’m in shadows and out of sight. They look for me, but can’t tell where I went.</p><p>Turning, I walk toward my bike and will my heart to slow. I swing my leg over and quickly pull on my helmet. That’s when Edward appears again. He’s walking to his car, which is parked right next to me.</p><p>He rushes toward me and wraps his arms around me before I have time to blink. “Anna! Thank God you’re all right. I’ll kill him for touching you. I swear,” he says holding my helmeted head in his hands, “I’ll make sure he never touches you again.”</p> <p>I’m past the point of reasonable conversation. I’m angry and hurting. I hate that he’s here now, seeing me like this. I hate that he assumes I let Cole use me like that. I swat his hands away. The expression on his face changes rapidly from concern to shock. His lips part like he’s going to say something else stupid or condescending.</p><p>I speak before he has the chance, “Nothing happened between us. It was lies. I didn’t cheat on you. I never did anything with Cole like they implied in that article, so don’t stand there feeling sorry for me because nothing happened. It’s part of whatever crap is going on with my current boss—an attempt to smear Cole more than she already has. She tossed me under the bus with him. Do you understand? I’m pissed, but other than that, I’m fine.”</p><p>Edwards eyes are too cool for someone so mad only seconds ago. He nods calmly. “Many victims can’t accept what happened to them. It’s not your fault, Anna.” He reaches for my hand.</p><p>I snap. I can’t stand him. I don’t want to be here with him. I smack his hand and rev the engine as I kick start the bike. “Stay away from me, Edward. If I see you again, even by accident, I swear to God that I’ll punch you. So just stay away.” My voice is full of anger as I speak. When I finish I don’t wait for him to respond. Instead I gas the bike and peel out of the parking spot, zipping into traffic.</p><p>I drive too fast, bobbing and weaving when there’s no need. I do everything possible to hold myself together until I step onto my parent’s doorstep. Then the tears start and don’t stop.</p> <p>My mom takes me in her arms and for once doesn’t ask about anything. She runs her hand over the back of my head, and pulls me inside.</p><p>CHAPTER 14</p><p>“Frankie, grab us some coffees. Anna looks like she could use one.” Ma says.</p><p>Daddy grabs the coffee pot and makes me a cup the way I like it. Then he grabs some cookies from a white bakery box and puts them on the plate, too. He hands it to me and I know he’s thinking of me when I was little and he knew what to do. Now he stands there awkwardly, not sure if he should chase down Cole and skin him, or wait and listen to what I have to say.</p><p>“Here baby,” Dad says. His voice is gruff, like his rage is barely in check. After a moment, he says, “Tell me the truth. That guy, the one you brought here—was he forcing you to...?” Dad can’t finish the sentence. His face turns red, his mouth crushing into an expression of fury as he says it.</p><p>I reach out for his hand and look him in the eye. “No. They lied. The paper lied, Dad. Whoever had that article run was gunning for Cole. I just got caught in the splatter.” At least I hope that’s it. Admitting that Cole somehow wronged Sottero like that, with a settlement so large, is unthinkable. Cole is always so careful, not touching, always asking the assistant to do things at shoots. I never even saw him touch a woman at the studio, well, besides me.</p> <p>I backtrack and tell my parents about the dean and the internship. I tell them how I was surprised that I liked working with Cole and how horrible it was with Sottero. When I’m done they know everything. I even told them that I had a crush on Cole, and that he said no.</p><p>Dad’s shoulders relax as I speak, but the tension in his arms remains the same. He still wants to break something. There’s no doubt that Dad would be happy to kill someone and bury them in the backyard if they hurt me. The nervous twitch of his hands, the way his fingers move like he wants to strangle something doesn’t stop, even after he knows the truth.</p><p>Ma is silent, which is unusual. She watches me as I speak and I feel foolish telling her about the crush on Cole. I don’t mention the stripping, the touching right before he told me good-bye. Sadness consumes me, but I don’t want it to. Clearing my throat, I push away from the table.</p><p>Ma says, “Where are you going?”</p><p>“I have to find Cole. I have to know what’s going on. Whether I like it or not, I got sucked into this mess, and tomorrow I’m supposed to walk into Sottero’s and act like nothing happened?” My voice is getting louder, more terse as I speak. I can’t help it.</p><p>“No, of course not, but I’m not sure if talking to Cole is a good thing now or not.”</p><p>Grabbing my helmet, I say, “It’s a good thing. I need this. It’ll tell me what I need to know. It’ll give me closure.” I strap my helmet on as I speak, my fingers expertly moving the strap through the metal loops. I pause for a second, thinking of Edward and glance at my parents. “Has anyone been out here looking for me?”</p><p>Dad shakes his head, but Ma looks away. I tilt my extra-large, helmeted head and put my hands on my hips. “Just tell me, Ma. Who was it? And when?”</p> <p>She blinks rapidly, looking at my face. “Just a young man. He said you knew him.”</p><p>My heart flutters faster. “What’s his name?”</p><p>She fumbles it for a moment and shakes her head as she tries to remember. “He didn’t say, but he knew so much about you that I thought you were close. Is something wrong?”</p><p>I stare at her for a minute, too afraid to ask if it was Edward, if the man at the door matched his description. I can’t fathom it. I can’t picture him finding my parents and driving all the way out here to do...what? A chill races up my spine.</p><p>“Is someone following you?” Dad asks, voice stern. He looks at me, still tense.</p><p>I don’t want to worry them more, but I feel sick. My stomach is churning like I drank sour milk. Flashing a false smile, I shake my head. “No, Dad. I’m fine.” I give him a hug from behind, careful not to hit him with my helmet. “I’ll be back after dinner. Call me if you need anything.”</p><p>CHAPTER 15</p><p>Dialing Cole’s number, I sit on my bike and wait but he doesn’t answer. I think about where he’d be, where he’d go, and I know where he is. That place outside the Le Femme studio in the Hamptons. He went there last time he got bad news.</p><p>When I get there my skin is chilled. It starts misting like the sky is going to open up. There are no cars out front. No reporters. There’s a sign on the door that the studio is closed. Ignoring it I reach for the handle, but it doesn’t open. I place my helmet on the porch, under the awning, so it doesn’t get wet.</p><p>Unzipping my leather jacket, I walk around back looking for the path that leads to the bench down by the water. The sound of the waves fills my ears. My stomach is climbing up into my throat. I don’t know what to do or what to say when I see him.</p><p>I stop a few paces back. Cole is sitting on the bench. He is leaning forward, his head in his hands. His dark hair hangs over his fingers as he stares at the ground. Everything I feel for him comes rushing back. I can’t stand to see him like this. Suddenly, I don’t care that he pushed me away, that he told Jesse he could have me. I step toward him slowly, carefully. When I’m a few paces behind him, I call his name.</p><p>“Cole.”</p><p>He doesn’t move. Instead he closes his eyes tightly and clenches his hair hard. His fingers practically pull it out by the time he sits up and looks at me. “Lamore. What are you doing here?”</p><p>I want to go to him and wrap my arms around his shoulders, but I don’t. I maintain my distance. The sky opens up and the mist turns to drizzle. Beads of water cling to my bare arms and run down to my wrists. My hair finally stops frizzing under the weight of the water and drips onto my tank top. My jeans stick to my skin, making me shiver. But none of that matters. The look in Cole’s eyes makes me forget everything else.</p><p>“I saw the paper. What happened with you and Sottero?” Cole watches me, his eyes giving nothing away. I step closer. “I have to know. They ran an article next to it. One about me.”</p><p>Cole exhales loudly and stands. “So that’s what you want? A piece of me? Well, get in line. Sottero will wipe me clean. You can take whatever you can scavenge before that.” Cole turns his back to me and walks toward the water. The ocean is churning like a storm is coming. The waves crash into the shore.</p><p>“What are you talking about? I’m not here for a damn thing. Damn it, Cole! Wait!” I run up behind him and grab his elbow.</p><p>He spins around. Leaning down in front of my face, he says, “Yes, you are. Is that why you did it? Is that why you couldn’t keep your pants on? Now you have something to go with your claim at the University? I would have given you anything you asked for, but doing it like this was—” he shakes his head and doesn’t finish. His fingers pinch his eyes and I can tell his voice is caught in his throat. “Just leave. Tell Sottero you got what she needed. Game over.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I swear to God, i have no idea what you’re talking about.” Tears stream down my face and mix with rain drops. “I went crawling back to Sottero after the school told me I couldn’t intern with you. I didn’t tell her anything.” He doesn’t turn back to look at me. “I didn’t do anything!”</p><p>He turns quickly, his eyes burning like blue flames. In a low tense voice he warns, “Don’t lie to me.” He practically growls the words at me. My heart pounds harder in my chest. I don’t step away even though I want to run. “Someone gave Sottero exactly what she needed to hang me. You’re the only explanation.”</p><p>Swallowing hard, I look him in the eye, “I never said anything to anyone about you. I sure as hell didn’t tell Sophia Sottero!” I’m shouting in his face. He doesn’t flinch. He doesn’t back away. “She’s a two-faced bitch. I can’t stand her. That’s the truth.” Cole shakes his head ever so slightly, like he still thinks I’m lying. I lean closer so we’re nose to nose. “I have never lied to you. Go ahead and think whatever you fucking want, but you’re deluding yourself.”</p><p>“You had nothing to do with Sophia? Nothing to do with the paper? Come on, Anna. How foolish do you think I am? Your roommate is a reporter. You’ve been planning this with Sottero from day one. You think I didn’t notice the guy you sent snooping around? You think I didn’t see him watching me? Watching you? Looking for whatever she needed to seal her case.”</p> <p>“What the hell are you talking about? I didn’t send anyone to follow you!”</p><p>He continues like I didn’t speak, “I didn’t touch her. I never hurt her. Do you know why she did this? Do you know?” I flinch when he yells in my face. “Because she thought I lied to her when we were younger. That Tiffany’s ring in the safe was hers. The night I gave it to her, she fucking ran it over with her car. Want to know why, Lamore? Want to know why your boss ripped my heart out and ran it over? Because of my name. My fucking name. She thought I still had my inheritance and I was stupid enough to think she loved me.” My jaw drops as horror bubbles up into my throat. The ring box, the one that I saw, was Sophia’s. She used him. She rejected him after his family disowned him. My God. The devastation from that betrayal is strewn across his face. It was too thick to hide.</p><p>“You think I helped her?” I can’t breathe. Something changes as he speaks. I finally understand what he’s been through, why I couldn’t get close to him. Sophia broke him. His family shattered him and Sophia destroyed whatever hopes remained. Cole’s been alone all this time, too afraid to get close to anyone.</p><p>“Stop acting now, Anna. I applaud your efforts. You were very convincing. I admit it, I fell for it. I fell hard for you.” His eyes narrow as his voice changes. Instead of anger, it’s laced with apathy. “So tell me, how much did she pay you to get close to me and stab me in the back? One mil? Two?”</p><p>I stare at him. Tears overflow from my eyes and continue to fall in a silent stream. He thinks I betrayed him. He thinks everything that’s happening to him is because of me. I can’t think of anything to say, any plea that would make him hear me. His eyes burn into me as they slide over my skin with scorn.</p> <p>I don’t answer him. I can’t.</p><p>“I thought so,” he says. It feels like he hit me with a bat.</p><p>His words knock my breath from my lungs, but I don’t look back. The fact that he can even think that makes me sick. There’s no reconciliation. Not this time. Not for us. Sophia Sottero decimated any chance we had. She fucked with his mind twenty years ago and she stole his life’s work today.</p><p>I find myself walking back toward my bike, wondering how this happened. Sophia Sottero was everything I wanted to be. I said as much to Cole. Damn, he must have cringed when I said it. He knew what she was, what she was capable of, and I was sputtering like an idiot... talking about my idol like she was flawless, like she was a god. No wonder he thought I helped her. I couldn’t blame him. If I were in his shoes, I wouldn’t trust anyone either. I couldn’t. And after this, I didn’t know if I ever could. I’d been lied to and used, manipulated into being the straw that cracked the back of the famous Cole Stevens.</p><p>Turning back, I stare at a destroyed man staring at the sea. The wind whips his dark hair, his wet clothing clings to his body, but he doesn’t care. I watch Cole—I see the man I love becoming a hollow shell of what he once was and I vow that I’ll destroy Sophia Sottero for everything she’s done to him. To us. Cole has never seen forgiveness, so neither will she. </p> </body></html>"]