["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Origin of the Valkyrie</p><p>Into the blood-splattered snow, the lone warrior fell to one knee and shuddered with weakness. Still, an arm shot out to raise a sword against the oncoming legion.</p><p>Her dented breastplate swallowed her small form.</p><p>The winds howled, whipping her hair, but she heard the twang of the bowstring unleashed. She screamed in fury; the arrow punctured the center of her armor, the blow sending her flying back.</p> <p>The arrow had pierced through metal, then barely through her breastbone, just enough that her heart met the point with each beat. The beating of her own brave heart was killing her.</p><p>But her scream had woken two nearby gods sleeping together through a brutal, wintry decade. They stirred and looked down upon the maiden, seeing in her eyes courage burning bright. Bravery and will had marked her entire life, but the light ebbed with death and they mourned it.</p><p>Freya, the female god, whispered that they should take her courage and preserve it for eternity because it was so precious.</p><p>Woden agreed, and together they gave up lightning to cleave through the ether and strike the dying maiden.</p><p>The light was violent and slow to fade and made the army tremble.</p> <p>When blackness cloyed once more, the healed maiden woke in a strange place. She was untouched, her human mortality unchanged. But soon an immortal daughter would be born from her - a daughter who possessed her courage, Woden's wily brilliance, and Freya's mirth and fey beauty. Though this daughter enjoyed the power of lightning for sustenance, she also inherited Woden's arrogance and Freya's acquisitiveness, which merely endeared her to them more.</p><p>The gods were content and the maiden adoring of her new baby. Yet after an age had flickered past, the gods heard another female call out for courage as she died from a battle against a dark enemy. She wasn't a human, but a Furie, one among the Lore - that strata of clever beings who have convinced humans that they exist only in imagination. Scarce moments had the creature - in the freezing night her breaths were no longer visible.</p><p>\"Our halls are great, yet our family is small,\" Freya said, her eyes sparkling so brightly a mariner in the north was briefly blinded by the stars and almost lost his way.</p><p>Grim Woden took her hand, unable to deny her. Those surrounding the dying Furie saw lightning rent the sky once more.</p><p>And it would strike again and again in the coming years, continuing on well after female warriors - be they human, demoness, siren, changeling or any brave creature from the Lore - knew to pray for it as they died.</p><p>Thus the Valkyrie were born.</p> <p>Chapter One</p><p>Five years ago</p><p>Mt. Oblak Castle, Russia</p><p>If the overgrown vampire didn't stop staring at her face, even his wicked talent with his sword wouldn't keep his head upon his shoulders.</p><p>The thought made Myst, an immortal known as the Coveted One, grin as she curled up in the windowsill of her cell. Leaning against the reinforced bars, she watched the two vampire armies battle below as she might a rumble from the back of bleachers.</p><p>The poor warlord with his broad shoulders and jet-black hair was about to join a legion of other males whose last sight on earth was her smiling face -</p><p>She frowned when he ducked and ran through his enemy. He was a big male, at least six and a half feet tall, but he was surprisingly fast. Tilting her head, she studied him. He was good. She knew fighting and liked his style. Dirty. He'd cut with his sword then strike out with his fist, or duck a parry then throw an elbow. It amused her to watch, but what she wouldn't give to be down there fighting. In the middle. Against both sides. Against him.</p><p>She fought dirtier.</p> <p>His gaze continued to stray to her, and once he'd even killed while his eyes were still on her. She'd blown him a kiss, sincerely, choosing to see it as a tribute.</p><p>He found time to glance back even as he thundered orders and gave commands to the army of vampires around him, showing brilliance in strategy. She examined it all as though watching Decisive Battles on A&amp;E and grudgingly noted the effectiveness of his army's acid grenades and guns.</p><p>The creatures of the Lore scorned human weapons like these. The only ones such weapons could kill were humans, which was beyond nonsporting. Yet that was the thing about bullets - aside from ruining perfectly good couture, they hurt and could immobilize an immortal for precious seconds. Long enough for a dirty fighter to take your head. Done enough times, they could help take an \"untakable\" castle like Ivo the Cruel's.</p><p>Myst hardly cared that Ivo, her jailer and tormentor, was about to have his ass handed to him by this warlord with his forbidden modern weapons. Her situation would not change, for these rebels, turned humans known as the Forbearers, were still vampires. A blood foe is a blood foe is a blood foe...</p><p>An explosion rocked the castle, and sparks and bits of debris wafted down from the roof of Myst's cell. The low creatures in the dank holds down the corridor howled with impotent fury, increasing in urgency with each successive blast, until it was...over. Silence. An aftershock here and there, a muted whimper...</p><p>The defense of this castle was no more, its inhabitants having disappeared - by tracing, as the Lore called teleporting - leaving no more than an airy draft and the burned records of their Horde.</p><p>She could hear the rebels searching the bowels of this place but could've told them they wouldn't find any of their enemies. The denizens here had not been a fight-to-the-death sort, more of a he who fights and runs away, lives to run away another day type.</p><p>Shortly after, she heard heavy boots clicking on the stone floor of the dungeon and knew it was the warlord. He crossed directly to her cell and stood before it.</p><p>From her perch, curled in the window, she examined the vampire up close. He had thick, straight black hair that hung over his face in uneven sections, no doubt from where he'd sheared it off with his blade months ago, and never thought to cut it since. Some hanks were kept from his field of vision with those small ravel plaits like the berserkers used to wear. He had scars on his hands, and his big body was powerful and cut with muscle. She wanted to purr - because apparently central casting had just sent down the consummate virile warlord.</p><p>\"Come down from there and show yourself.\" Deep voice. Russian accent, moneyed, aristocratic.</p><p>\"Or what? You'll lock me away in a dungeon?\"</p><p>\"I might free you.\"</p><p>She was at the bars before he'd had time to lower his gaze from the window. Had his squared jaw slackened just the smallest bit? She listened for a quickening of his heart, but found none because there was no heartbeat whatsoever. So the vampire was single? His eyes were clear of the red haze that marked bloodlust, which meant he had never drunk a being to death. But then a Forbearer eschewed taking living blood through the flesh altogether.</p><p>When he saw her face up close, the key wasn't immediately in the lock as it usually would have been, but his lips parted, exposing his fangs for her to see. Of course his would be sexy - not too prominent or even much longer than a human's canines.</p><p>When she saw the short splendid scar that passed down both of his lips, lightning struck just outside, but he didn't flinch at the bolt or even glance up - he was too busy staring back at her.</p><p>Scars, any external evidence of pain, attracted Myst. Pain forged strength. Strength begat electricity. This one could give it to her.</p><p>It was possible he was even missing an eye under a thick hank of hair.</p><p>She stifled a throaty growl as her hand shot out to brush his hair back. But he was quick, catching her wrist. She curled one finger in a beckoning gesture, and after a moment he released her, allowing her to reach forward. She brushed his hair back, revealing a hard-planed, masculine face covered with grit and ash from the battle.</p><p>He was still in possession of both of his eyes and they were intense. Gun-metal gray.</p><p>When her hand dropped, his brows drew together, perhaps at her blatant interest, or perhaps at her fingers already stroking the bars in invitation as she stared at his mouth. She was surprised by how carnal she found it, especially since the vampire could use it to hurt her.</p><p>The smooth gold chain that she'd worn at her waist for millennia now felt heavy on her.</p><p>\"What are you?\" he asked in his pleasingly low voice. She realized then that his accent wasn't Russian, but from that of neighboring Eesti. The general was Estonian, which made him a kind of Nordic Russian, though she was sure he wouldn't appreciate that description.</p><p>She frowned at his question and pulled back her hair to show him her pointed ear. \"Nothing?\" She parted her lips and tapped her tongue against her smaller dormant fangs. No recognition.</p><p>Apparently, the rumors were true. Here was a leader in this army, a general most likely, and he hadn't a clue that she was his mortal enemy. He would think she was fey or a nymph. She'd prefer fey because she'd cringe to be confused with one of those little hookers -</p><p>She shook her head. As long as he didn't know she was Valkyrie it worked for her.</p><p>Killing the unwitting Forbearers would be easy for her and her sisters. Too easy. Almost like being your own secret Santa.</p><p>Myst had just confirmed rumors in the Lore that whispered of asses and elbows and this Horde's inability to differentiate between the two.</p><p>\"What are you?\" Nikolai Wroth demanded again, surprised his voice was steady.</p><p>When he'd seen her in the light, he'd felt like exhaling a stunned breath - if his kind respired - for she was strikingly lovely, with a beauty only hinted at from the distance of the battlefield. He'd been attracted to that face to his reckless peril.</p><p>Though she had expected him to recognize her kind, all he could determine was that she wasn't human and that he hadn't a clue what she might be. Her ears said fey, but she also had the smallest fangs.</p><p>\"Free me,\" the creature said. Flawless skin, coral pink lips, flame red hair. The eyes that flickered over him appraisingly were an impossible green.</p><p>The way she held the bars was suggestive - everything about her was...suggestive.</p><p>\"Swear fealty to my king, and I will free you.\"</p><p>\"I can't do that, but you've no right to keep me here.\"</p><p>His brother Murdoch passed by then, raised his eyebrows at Wroth's discovery, and muttered in Estonian, \"Sweet Christ.\" Then he walked on. Why was Wroth unable to do the same?</p><p>\"What's your name?\" He wasn't used to his questions going unanswered.</p><p>Another stroke of the bars. \"What do you want it to be?\"</p><p>He scowled. \"Are you a vampire?\"</p><p>\"Not the last time I checked.\" Her voice was sensual. He couldn't place her accent, but it was drawling, honeyed.</p><p>\"Are you innocent of malice against us?\"</p><p>She waved a dismissing hand. \"Oh, good God, no! I love, love, love to kill leeches.\"</p><p>\"Then rot in here.\" As if she could kill a vampire. She was scarcely over five feet tall and delicately built - aside from her generous breasts showcased in her tight shirt.</p><p>Just before he turned, he saw her eyes narrow. \"I smell smoke,\" she called after him. \"Ivo the Cruel burned his records before he fled, didn't he?\"</p><p>Wroth stilled, clenching his fists because he'd have to return.</p><p>\"He did,\" he grated at the cell once more.</p><p>\"And this new king's army is full of Forbearers - turned humans? It matters little. I'm sure the king is very knowledgeable about the vampire Horde's extensive list of enemies within the Lore. He wouldn't need this castle's millennia's worth of records. In fact, I'm positive that that is not the reason you chose this stronghold over the four others, including the royal seat.\"</p><p>How did she know their agenda so well?</p><p>Wroth could plan battles and sieges - he'd earned his rank by this victory alone - but he knew nothing of this new world to advance the army. Unfortunately, he wasn't the only one.</p><p>The blind leading the blind. When they'd found the records reduced to a smoldering heap of ash, that's what Kristoff had muttered.</p><p>\"You think to bargain for your freedom? If you do happen to have information, I can get it from you.\"</p><p>\"Torture?\" she asked with a laugh. \"My first piece of information I'll divulge to you? I wouldn't recommend trying to torture me. I dislike it and grow sulky under pincers. It's a fault.\"</p><p>The things in the cells, many of which he'd never even heard of, never could have envisioned, howled and grunted at that.</p><p>\"Now let's not quarrel, vampire. Free me, and we'll go to your room and talk.\" She offered her fragile-looking hand out to him. A smudge of ash was stark against her alabaster skin.</p><p>\"I don't think so.\"</p><p>\"You'll call for me. You'll be lonely in your new quarters and will feel out of sorts. I could let you pet my hair until you fell asleep.\"</p><p>He drew in closer and lowered his voice to ask in all seriousness, \"You're mad, aren't you?\"</p><p>\"As - a - hatter,\" she whispered back conspiratorially.</p><p>He felt a hint of sympathy for the creature. \"How long have you been in here?\"</p><p>\"For four long...interminable...days.\"</p><p>He glowered at her.</p><p>\"Which is why I want you to take me with you. I don't eat much.\"</p><p>The dungeon erupted with laughter again.</p><p>\"Don't hold your breath.\"</p><p>\"Certainly not like you, Forbearer.\"</p><p>\"How do you know what I am?\"</p><p>\"I know everything.\"</p><p>Then, if true, she had a wealth they didn't.</p><p>\"Leave her,\" Murdoch called at the gateway of the dungeon. His brows were drawn, no doubt puzzled by his brother's interest. Wroth had never pursued women. As a human, they'd either come to him or he'd gone without. He'd had no time in wartime. As a vampire he had no such need. Not until he could find his Bride.</p><p>He shook his head at the insane, fey creature, then forced himself to walk on, though he thought he heard her whisper, \"Call for me, General,\" making the hair on the back of his neck stand up.</p><p>He followed his brother to Kristoff's new antechamber and found their king gazing out into the clear night from a generous window - that would be shuttered in the few hours till dawn. When he turned to them, his gaunt face looked weary.</p><p>Wroth suspected it had been difficult killing other natural born vampires, his own kindred, no matter how crazed they'd become, and no matter that they followed his uncle Demestriu, who'd stolen his crown centuries ago. Wroth had no such compunctions. He was weary but only from injury and his sword arm being overworked as he hacked through them.</p><p>\"Were any of the records salvageable?\" Wroth asked with little hope. If the vampires of this castle had spent as much energy fighting as burning, they might have kept Oblak. To his disgust, they'd fled. He didn't understand it. When defending your home, you defend to the death.</p><p>He had.</p><p>Kristoff answered, \"None.\"</p><p>Without the records, their own ignorance would kill them. Kristoff, the rightful king, had been raised by humans far from Demestriu's reach. For centuries, he had lived among them, hiding his true nature yet learning little of the Lore. His army consisted of human warriors he'd turned as they died on the battlefield, so they knew nothing. Before Wroth had seen Kristoff standing over him like an angel of death, offering eternal life for eternal fealty, Wroth had thought vampires were mere myths.</p><p>The rules of this new world were complex and often counterintuitive, and their order knew little more than conjecture and what had been learned by painful trial over centuries. They were trapped in a kind of twilight - not human and yet universally shunned by all the factions of the Lore. Those beings hid in the shadows, fleeing from whatever land Kristoff's army occupied, working together to always be one step ahead. Wroth's human experience said they should have been able to get information by now, but the reality was that this was a different plane altogether. The same effort that went into hiding the Lore from humans for ages went into keeping Kristoff's soldiers in the dark as well.</p><p>\"Any sign of Conrad or Sebastian?\" Kristoff asked.</p><p>Wroth shook his head. He hadn't seen his brothers since shortly after they'd been turned, but he'd heard they'd been in a skirmish with natural born vampires. Though he and Murdoch hadn't expected to find their brothers here, they had hoped the two might be in the dungeons of the castle they'd strategically needed to take.</p><p>\"Perhaps the next Horde stronghold.\"</p><p>Wroth nodded, though he doubted it. He sensed his youngest brother Bastian was dead and suspected the mind of the next oldest, Conrad, was unreachable even if he could be found. The two had not appreciated the eternal life their older brothers had forced on them.</p><p>Murdoch examined a gouge in his arm, seeming unconcerned with this blow, but then he generally seemed unconcerned about everything. Though they shared similar looks, he and Wroth couldn't be more different in personality. Wroth believed in Kristoff's cause, seeing many parallels to his own past, and wanted to continue to fight. Murdoch didn't particularly care. Wroth suspected his brother fought only as a favor to him - or because they had nothing else now.</p><p>\"Wroth found a being in the dungeon,\" Murdoch said. \"She seems to have extensive knowledge of the Lore.\"</p><p>\"What kind of being?\"</p><p>Wroth answered, \"I have no idea. She appears fey, delicate, with sharply pointed ears. But she has these small fangs and her fingernails were more like...claws. She's not vampire.\"</p><p>Kristoff frowned at that. \"Perhaps she's born of more than one species?\"</p><p>\"Perhaps.\" More speculation. Wroth was sick of it. He wanted to know the rules of the game so he could dominate it.</p><p>\"Find out everything you can from her.\"</p><p>\"She won't talk. I've interrogated enough to know she'll hint but never truly divulge. And she hates vampires.\"</p><p>Kristoff pinched his forehead. \"Then tomorrow night if we haven't gotten information from the rest of the prisoners, we treat her as the Horde she hates would. Torture her for the information if you can't get it any other way.\"</p><p>Wroth nodded, but the idea sat ill with him. As a human he'd been merciless to his enemies, but he'd never tortured a woman. She wasn't truly a woman, he reminded himself. She was a female among the Lore, and their army's survival could depend on the knowledge she held.</p><p>Perhaps he'd never tortured a woman because he'd never needed to.</p><p>The creature had been right, Wroth thought as a guard showed him to his new chambers. He was going to call her up to him.</p><p>To do what with her, he didn't know. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Did you miss me? Because I missed you,\" she said when the guard escorted her inside his bedroom. Out of habit, he stood when a lady entered, and she flashed him a brilliant smile. \"A gentleman warrior. Who cleans up very well.\" She fanned herself with her hand. \"I think I'm in love.\"</p><p>He didn't answer, and she didn't seem to mind as she casually scanned the room. \"Retro Dracula. Not necessarily what I would have done, but then I'm not married to sun-proof shutters like you might be...\" She shrugged, then headed for the bathroom. \"Taking a shower if you don't mind,\" she said airily over her shoulder, making him raise his brows.</p><p>At the doorway, she unbuttoned her tight blouse and shrugged from it, leaving only a transparent black bra. She turned to him, revealing her scarcely covered breasts, he knew, just so he could see the creamy flesh spilling from the lace when she bent over to remove her boots. What he didn't know was why.</p><p>Was she truly mad? Most people who were mad didn't think they were, but she seemed to be proud of it. He was usually quick to determine people's motives. Yes, she wanted her freedom, but for some reason he knew she wouldn't sleep with him to receive it.</p> <p>If he had to guess, he would say that she simply didn't see stripping in front of him and making herself completely at home in a stranger's bedroom as odd. In fact, he suspected she didn't see them as strangers at all.</p><p>As he stood, concealing his surprise, she untied the fastening of her silky skirt at her hip, and it too fell to the ground.</p><p>A fine gold chain around her tiny waist caught his attention. It was unusual, the design appearing very old, but it glinted like new when she moved. Once he could take his eyes from it, he found her in only that wispy bra and scanty, black underwear so intricate he was shocked anew. They were like a work of art - or a like a ribbon decorating one.</p><p>She gave him a teasing smile. \"Vampire like?\" she purred, unclasping the front of her bra to toss it with her other clothes. He scowled because he did like. Very much. He ran a hand over his mouth, wondering if her high, plump breasts could be any more beautiful. She had coral pink nipples that he could spend hours tonguing and alabaster flesh he wanted to cup and palm. He began to speak, then had to cough in his fist to continue. \"You'll strip in front of a vampire when you don't even know his name?\"</p><p>She gasped with mock horror and covered her breasts with her hands. \"You're right! So what's your name?\"</p> <p>\"My answer will be as forthcoming as yours. What do you want it to be?\"</p><p>She smiled at that but then replied to the question, \"Some kind of name that fits a battle-scarred, overgrown vampire warlord.\"</p><p>Battle-scarred? Overgrown? He wondered why in the hell he cared how she saw him. She was divinely wrought, but mad. He'd take his scars with his sanity. \"Nikolai Wroth,\" he grated.</p><p>For the briefest second he thought he saw recognition flicker. But then she eyed him archly and breathed, \"Oh, you are good. Wroth, the old word for rage? That's a bingo idea for a name.\" Her hands dropped. \"I'll just call you by that,\" she said, then gave him a second look, shaking her head with a rueful smile as if she couldn't believe he was so clever.</p><p>...as a hatter.</p><p>She leaned back against the doorway, raising her bent arms above her head to grasp her elbows. Displaying her mouthwatering breasts and flashing a flirtatious smile that would've dropped most men to their knees, she asked in her whiskey voice, \"Care to join me, Wroth?\" She winked when she said his name and rolled her hips up off the doorframe.</p> <p>\"No,\" he bit out the word with difficulty. He didn't want her to know how his body didn't respond to her. His mind did, his vague memories of being human did. But not his body. He was the walking dead. No respiration, no heartbeat, no sexual need - or ability. Not until he found his predestined Bride and she \"blooded\" him fully. With his blooding, something inside him, some essence - maybe even his soul - would recognize her as his. He would see her as the one he was meant to spend eternity with, the woman he could love without measure, if one believed in that, and his body would wake for her.</p><p>In the past he'd yearned for his Bride because of the power she would bring him - he would finally be as strong as blooded vampires, his senses as acute as theirs - but he'd never missed the sex before this. And Wroth knew after this display that she was not his. For this should've blooded any vampire.</p><p>She shrugged, the simple movement a sight to behold, then turned the corner to the bathroom. When she emerged fifteen minutes later clad in a towel, she crossed to his closet. He was almost certain she'd used his toothbrush.</p><p>Which...charmed him for some reason -</p><p>The towel dropped, leaving her with only her chain and him with a view of her perfect ass.</p><p>He swallowed. \"Have you no modesty?\" Never in his life had he encountered a female so quick to be naked. Of course, he'd never in his life encountered a female who should so utterly be naked at any chance.</p><p>\"Not at my age,\" she said as she began exploring his recently unpacked clothing. How strange to hear her say that when she looked so young. He found his head tilting to keep his gaze on her as she moved and bent. The chain swayed at her waist, and her long, damp hair cascaded down over her breasts. He stifled a groan at a particularly fruitful glance. A true redhead. He closed his eyes. And he couldn't have her.</p><p>\"How old are you?\" he grated, opening his eyes.</p> <p>\"Physiologically, I'm twenty-five. Chronologically, I'm...not.\"</p><p>\"So you are an immortal?\"</p><p>An amused smile played about her lips. \"I am.\" She pulled on one of his shirts though it fell far off one shoulder and well down her legs.</p><p>\"Why did you stop aging at twenty-five?\"</p><p>\"When I was strongest. Not for the same reason you were frozen at...\" - she trailed off, eyeing him - \"thirty-four?\"</p><p>\"Thirty-five. And why do you think I stopped aging then?\"</p><p>She ignored him to continue digging. After a few moments, she plucked out an old bejeweled cross from his bag. She pinched the relic, holding it away from her, keeping her gaze from it. \"You're Catholic?\"</p><p>\"Yes. It was a gift from my father.\" To help keep him alive in wartime. Wroth shook his head at the irony of just how well it had worked. \"I thought I was the one who should be repelled by it.\"</p><p>\"Only a turned human would say that. Besides I'm in no way repelled. With jewels like that? If I look at it, I'll want it.\"</p><p>\"So you wouldn't want it because you're Catholic, I take it?\"</p><p>\"My family was very orthodox pagan. Can I have?\" She held it forward, still not looking at it. \"Can I, can I, Wroth?\"</p><p>\"Put it back,\" he said, fighting the unfamiliar urge to grin. With a pouty expression, she returned it, mumbling something about tightfisted vampires, then dipped her feet into his boots. When she turned to him with her hands on her hips, his lips almost curled at the sight of her, a mad pagan immortal swallowed by his boots.</p><p>\"What did your mother feed you?\" she teased. \"Renaissance anabolics?\"</p><p>His urge to smile faded. \"My mother died young.\"</p><p>\"So did mine.\" He thought he heard her murmur, \"The first time.\"</p><p>\"And I was born after the Renaissance.\"</p><p>She drew her feet from his boots and sauntered past him. \"But not by much.\"</p><p>\"That's true. And why do you think I stopped aging at thirty-five?\" he asked again.</p><p>She frowned as if she didn't know where his question had come from, then said, \"Because naughty Kristoff found you dying on a battlefield, decided you'd make a fine recruit, then made you drink his blood. Bit a wrist open, perhaps? Then with his vampiric hoo-doo blood in your veins, he let you die. Unless he was in a hurry, then he would've killed you. One to three nights later and voila, you rise from the dead - most likely with a frown on your face as you think 'Holy shite, it worked!' \"</p><p>He ignored the last and asked, \"How do you know the blood ritual?\" He'd thought that only vampires knew the true way to turn a human. In movies and books, the change always came as a consequence of a vampire's bite, when in fact a human had more chance of turning if he bit a vampire.</p><p>\"Like I said, I know everything.\"</p><p>Yes, but he was learning, if sporadically. She was an immortal, who'd been frozen physiologically at twenty-five. If she was pagan she was at least a few hundred years old. She knew of the blood ritual and that Kristoff \"recruited\" his soldiers straight from the battlefield.</p><p>When she scooped up her clothes, opened his door, then snapped her fingers for a guard down the hall, Wroth merely watched like a bystander.</p><p>\"Pssst. Minion. I need these laundered. Very little starch. Don't just stand there gawking or you'll anger my good frenemy General Wroth. We're like this.\"</p><p>He couldn't see her but knew she was twining two fingers together.</p><p>Once she'd foisted her laundry, she closed the door by dramatically leaning back against it - as if to say he couldn't get away from her now - then glided over to him. As a rule, he observed, he calculated and he waited, but he'd never quite enjoyed sitting back and watching events unfurl as much as with her. Unpredictable didn't begin to describe -</p><p>She clutched his shoulders and straddled him.</p><p>Nothing between them but his pants and a few inches. He could even feel her heat as she knelt over him. She was definitely not his Bride or he would've ripped through his zipper to get inside her. His heart would beat, he would take his first breath in three hundred years, and in the space of one of those breaths he would be buried so deep in her tightness, wrenching her down on him... But nothing approaching that happened.</p><p>\"Now, Wroth, we need to work some logistics out. When I'm kept as a pet, my care is very involved.\"</p><p>His brows drew together. \"I have no wish to keep you as a pet.\"</p><p>\"You hold me prisoner. You think to order me. How does this differ?\"</p><p>\"You're not a pet,\" he insisted. He couldn't think - her eyes were mesmerizing, her sex was inches away from his, and her pleasing accent was lulling.</p><p>She leaned in by his ear and murmured, \"What if I want to be your pet? Would you like that, vampire?\" Her fingers brushed their way over his chest, unbuttoning his shirt. She picked up his hands one at a time and set them on the armrests, giving each a squeeze as if to let him know she wanted them to stay that way.</p><p>With raised eyebrows, he let her. He wasn't about to move, and couldn't imagine what she would do next.</p><p>\"If I was your pet, you could keep me for your pleasure, and I would serve you in every way you desire.\" She pulled his shirt open, clearly admiring his chest. \"Hard.\" Her voice was breathy. \"Scars.\" She moistened her lips. \"I'd endeavor to blood you so you could wake at sunset with my mouth greedy on you while you clutched my thighs to drink from. You would go to sleep at sunrise still deep inside my body.\" Her hand was trailing down, her eyes raptly following the jagged scar that had been his deathblow. \"I am here for the taking and ache for your touch.\"</p><p>She reached down and cupped him beneath her before he could grip her wrist. In an instant her seductive look vanished, though she showed no surprise that he wasn't hard. She felt around his cock, then arched an eyebrow to say, \"Well, my word, Wroth. If you were hard, I wouldn't know whether to be tantalized or terrified.\"</p><p>Then with blurring speed she was off him, and in the bed, lying on her stomach, chin propped on her hands. She was utterly unaffected by what had just occurred, while he was angered and...shamed that she'd felt him like this. He wanted to show her hard...</p><p>\"How do you plan to keep me here during the day? An unblooded Forbearer shouldn't be so hard to vanquish.\"</p><p>Vanquished by her? Amusing. \"I'll send you back to the cell. You want to be my pet? I'll take you out and put you back in your cage at my pleasure.\"</p><p>She blinked at him. \"You don't want to send me back. Who will entertain you? I can deal poker and make shadow animals.\"</p><p>He shook himself. This was just another instance of the Lore playing with them. She was not normal. He knew that anything he'd learned about females was inapplicable with her.</p><p>If she could be unaffected, he could pretend it. \"I need you to answer some questions. I need to know what you are and what your name is.\"</p><p>\"I'll answer your questions if you answer mine.\"</p><p>\"Done,\" he said quickly. \"Ask.\"</p><p>\"Were you afraid when Kristoff stood over you?\"</p><p>\"I was...tired.\" Strange question.</p><p>\"Most mortals would have been terrified to see the Gravewalker.\"</p><p>\"Is that what he's called?\" Kristoff would find that amusing. At her nod, he said, \"Well, I'd seen a lot by that time.\"</p><p>\"What's his agenda? Does he want to replace Demestriu?\"</p><p>Wroth hesitated, then answered honestly, hoping that she would do the same. \"He wants his crown back, but he doesn't want to rule over any faction but our own.\"</p><p>\"Uh-huh.\" She raised an eyebrow as if she didn't believe him, then asked, \"That was your brother in the dungeon?\"</p><p>\"Murdoch, yes.\"</p><p>\"Turned vampires don't usually have family within the Horde.\"</p><p>\"Murdoch died in the same battle. I've two other brothers turned later as well.\"</p><p>\"You're young. Yet you're a general. How'd you swing that?\"</p><p>He was over three hundred years old. Young compared to her? \"I refused the dark gift if certain conditions weren't met.\"</p><p>Her eyes grew bright with new interest, and she patted the bed for him to come sit with her. He felt he was on the verge of learning something, so he complied, resting against the headboard to face her, stretching his legs out. He almost laughed. The first time he'd been in bed with a woman in centuries, and she was easily the most beautiful of any before - and he could do nothing with her. He couldn't even drink her, though his fangs ached to pierce the pale column of her neck. Thank God he'd fed before she'd been brought up.</p><p>\"Wroth, you countered with Kristoff as you lay dying?\"</p><p>When she put it like that it sounded more reckless than it had been. As Wroth had lain in his own cooling blood, nearly freed of the constant struggle, the ongoing war and famine and plague, he'd told Kristoff, \"You need me more than I need to live.\"</p><p>Kristoff had seen him in many battles and agreed. \"I did counter. I was used to giving orders and would take them from no one but a powerful king. I wanted my brother turned if he was dying, and trusted compatriots as well. Kristoff complied.\" That wasn't all. Wroth had asked for sixty years so he and Murdoch could watch over the rest of their living family - their father, four sisters and two other brothers.</p><p>They'd needed only three months.</p><p>\"You know, I'd heard of you when you were a human. Weren't you called the Overlord?\"</p><p>This surprised him. \"On kinder tongues. How could you have heard of me? Your accent isn't from the northlands.\"</p><p>She sighed. \"Not anymore. I'd heard of you because I'm interested in all things martial. You were quite the vicious leader.\"</p><p>He felt his expression grow cold. \"We were defending. I was anything I needed to be to see it done.\" He could tell by her reaction that she liked his answer. Her lips parted as she tilted her head at him. Then she sidled closer to him on the bed as if she couldn't help herself.</p><p>Her voice more gentle, she said, \"But in the end you lost.\"</p><p>He stared past her. \"Everything.\" The battle had only been like the final blow on a dying man. Prior to that, the enemy had scorched and salted their lands. Famine followed and there'd been no defending when plague erupted.</p><p>\"Wroth,\" she said softly. He turned his gaze to her. Her eyes were so captivating in her elven-like face, so clear and lucid at this moment. \"Let's make a pact, you and I.\" She eased open his legs to kneel between them. \"Let's vow that we won't harm the other in this room.\" She pressed him back until he lay fully on the rolled pillow. What would she do next?</p><p>When he gave her one quick nod, she flashed him a warm smile that made him feel praised in some way. Her damp hair was spilling down over his legs, and with the back of her hand, she swung it to one side, baring her tantalizing neck. A rush of the innate scent of her hair swept him up, like a drug. Sweet and subtle, just like her skin. If she smelled like this, he couldn't imagine what she would taste like. He wished she'd bared her flesh in offer to him.</p><p>\"Wroth, this is embarrassing,\" she murmured in a sensual voice, \"but I think I've caught you staring at my neck.\"</p><p>\"You did,\" he admitted, oddly feeling no shame to be contemplating his order's most reviled crime.</p><p>She brushed her fingertips over her skin. \"Are you tempted to take a drink from me?\"</p><p>In the worst way.</p><p>He wondered how many times Ivo had taken her and felt a spike of some unfamiliar feeling claw in his gut. \"We don't drink from living beings. It's how we got our name.\" It was this order's pledge, their pact. Wroth had never tasted flesh as he drank. But then he'd never felt the smallest stir of temptation to before her.</p><p>\"Why?\"</p><p>\"So we are never tempted to kill,\" he said, giving her the official line, which was true, but the whole truth was more complicated, and they kept the details they'd managed to learn secret. Living blood, blood not separated from its source, brought side effects with it. A vampire would suffer torments from it, such as his victim's memories. Kristoff believed these memories were what drove natural born vampires insane and made their eyes turn permanently red. As far as they could determine, the only way not to harvest them was to drink blood that had died, avoiding the evils - and the benefits.</p><p>\"What if you drank from an immortal that couldn't be killed from that?\" she asked, her words lulling again. He couldn't seem to take his eyes from hers.</p><p>A tricky question to answer without saying that the immortal would have far too many plaguing memories, multiple in number to a mortal. He answered her question with one of his own. \"Do you want me to take your flesh, creature?\" The mere idea of it made his words rough, his fangs ache.</p><p>At her titillated look, he feared she'd say yes, calling his bluff. What would he do then?</p><p>\"Rain check,\" she answered brightly. Then, to his shock, she curled up between his legs, face nuzzling against his uncovered torso, and wrapped her pale, delicate arms and hands around his thigh.</p><p>\"I never asked my questions,\" he said, staring at the ceiling, trying to sound casual about what was occurring. He'd seen a great many things in his life, but this female was throwing him.</p><p>\"We have all the time in the world for that, do we not?\"</p><p>He thought she kissed the scar on his lower stomach with her lips - and a slow little lick. He lay tensed, rasping, \"At least tell me your name, creature.\"</p><p>\"Myst,\" she whispered, then she fell asleep.</p><p>Myst. How fitting that she was named after something intangible and capricious.</p><p>Long after, he was still roiling. In sleep, his little pagan clutched his leg with her pink claws. And they were claws, sharp and curling, though somehow elegant. He ignored the pain, for it was little compared to the odd satisfaction of thinking that she clutched him for comfort.</p><p>He savored simply resting with her, doing nothing but watching as her hair dried into big, glossy red curls that spread out over his chest. For centuries their army had been constantly on the move, hiding in the shadows of the northlands in often grueling conditions, keeping their growing numbers secret. Everything had been about the war, all adding up to this attack, to furthering their cause.</p><p>He brought a curl up to his face to brush it over his lips. So soft, like her flawless skin. Tomorrow night, if she hadn't given him information - and he somehow knew she wouldn't voluntarily - could he lash her skin to get at her secrets? After Myst had cleaved to him so trustingly? Could he break any of her delicate bones and have her gaze at him with pain in those green eyes? If she'd been his Bride he wouldn't have to hurt her, would be forbidden from ever harming her - his life given over to protecting her.</p><p>He ran the backs of his fingers down her silken cheek, feeling her light, quick breaths warm on his stomach. He'd never truly felt the sting of envy in his life, had never envied other men except those who enjoyed peace in their land. He'd been born affluent, his family aristocratic, and fortune had followed him until the latter years of his mortality. To envy was to lack.</p><p>So why did he want to destroy any vampire who might be blooded by her? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Where the hell is my freaking warlord?</p><p>Myst jerked upright, waking from the first real sleep she'd enjoyed since she'd been taken by the Horde four nights ago. She was alone in his bed, her clothes washed and folded at the foot. She smiled to realize he'd drawn a blanket over her.</p><p>She needed to keep up with Wroth until her sisters broke her out of this pokey. She swore again that this was the last time she would be bait - and this time she meant it. Rumor was rife in the Lore, but tales of Ivo the Cruel making dark alliances proved worrisome enough for them to \"reconnoiter,\" or undertake Operation: Myst Gets Nabbed. Yet she'd learned little about Ivo for her troubles - the acting, the getting too close and then letting herself get caught, etc. - only that he was definitely planning something major.</p><p>She chuckled - that is, until General Wroth punked his ass out of a castle.</p> <p>No, she hadn't learned much about Ivo, but this Kristoff and the general would make good dish. What if this king really wanted to kill Demestriu and stop vampires from terrorizing everyone else? Was it possible that not all vampires had a predisposition toward sociopathic evil? What if the Valkyrie didn't have to war with these Forbearers? However, it was doubtful. Her sisters wouldn't discriminate between the two vampire factions. Kill first and then say, \"Gosh, were you actually good? My duh!\" Vampires as a species were simply too powerful to go unchecked.</p><p>Demestriu and his vampire Horde had been brutal to all the Lore, but especially the Valkyrie. Fifty years ago, Furie, their queen, the strongest and fiercest of them all, had tried to assassinate him. She had never returned. Tales abounded that he'd chained Furie to the bottom of the sea to drown again and again only to have her dogged immortality surge her to life for more torment. When the covens finally found her and freed her, Furie would be as none other on earth, awash in rage. She wouldn't check for vampire affiliation before she slaughtered and would expect her covens to follow her example.</p><p>So, until Myst's covens decided on their plan of action with this new power, she'd go about business as usual, which meant she needed to find Wroth. Before he'd come, Myst had been powerless here. She could handle weapons as well as most in the coven, though a sword and bow were not her strengths.</p><p>Her preferred weapon was men. And now she had one - a big, scarred one with gorgeous eyes, and with skin that she wanted to lick until her tongue got tired - in her clutches.</p><p>Or she'd had him.</p> <p>Manipulating them, playing them, making them believe she lived for them alone in order to have them do her bidding were her m.o. Furie had once asked her, \"Why would you ever send a man to do a woman's job?\"</p><p>Confused, Myst had answered, \"Because I can.\"</p><p>The problem with Oblak's vampires was that they had no appreciation for her whatsoever. At least Wroth liked to look at her.</p><p>For them, the blood superseded all, and she could neither withhold it nor capitalize on it. Though the eyes of every creature in the Lore turned a certain species-related color with intense emotion, theirs were permanently, wholly red from sucking the life from their victims to the very marrow - not from merely drinking as these Forbearers feared. One kill put them in a downward spiral, because with the kill came the bloodlust riding them to do it again and again. Then the subsequent accumulation of their victim's memories over the years drove many of them mad.</p><p>Yet for the last four nights, Ivo and his men had never drunk from her, vacillating, examining her as she had yawned with boredom. She'd snapped to Ivo, \"Get dental with me or don't, but make a damned decision.\" His eyes had slitted with menace, his red gaze a contrast to his pale face and shaven head, but in the end he'd avoided her blood, thinking her madness might be catching. Worked for her. In fact, she'd never in her life been bitten.</p><p>She wondered what it would have been like to have Wroth take her neck last night when his pupils had flickered black with want. She was an awful person, she knew it, weak with perversion to even entertain these thoughts. Probably the only Valkyrie on earth who'd ever fantasized about a vampire. She frowned. No. There'd been one other...</p> <p>Myst tapped her chin, wondering if she should tell the Forbearers that they forwent for really no reason.</p><p>Neh.</p><p>Maybe if the scrumptious general continued to be nice to her she'd hint a little. She had heard of him back in the day. Of course they'd had a correspondent in the field following that war and she'd reported back that Wroth had been big and brave and deliciously ruthless to his enemies. Though the Overlord had lost in the end against a much larger force, he'd bought his people at least a decade of protection.</p><p>Myst and her sisters had sat by the hearth, sighing over tales of his deeds as though ogling an issue of Tiger Beat. Myst remembered that she had felt loss at the news of his defeat because she'd known it meant the death of a great man. But he'd made a comeback, and, in person, he hadn't disappointed. Except for the fact that he was now a mortal enemy - or rather, an immortal mortal enemy. Oh, and a leech.</p><p>She tried the door to his room, just in case he'd decided to trust her, but it was locked - though not mystically reinforced like her cell was. She could easily have broken it down, but she didn't have to be back in the dungeon until dawn. So she took her time dressing and piling her hair up in a way she thought he'd like, and still had time to root through all his things. Though she kept her eyes from the shiny jeweled cross, lest she get sticky-fingered with it.</p><p>Digging through his clothes, she realized she liked how he dressed, his style modern but still aristocratic somehow. And she loved his scent and his careless but sexy hair. She'd rolled in the bed with one of his big cable-knit sweaters, her face buried in it, uncaring if he returned and found her like that. But he never showed, and instead two guards had arrived to escort her back down as per his orders.</p><p>They wouldn't meet her eyes.</p><p>Well, shite, they knew something she didn't. Wroth hadn't kept her as she'd hoped. She was in trouble, and she suspected she knew why. If you do happen to have information, I can get it from you, he'd said.</p> <p>When they closed the cell door behind her, and she realized she was the only one in the dungeon, her fears were confirmed. The low beings here - those who made up the Saturday night creature-feature underbelly of the Lore - had been taken away, no doubt to be tortured and killed.</p><p>She was the only girl left on the dance floor, but not for long, she knew, because none of the others would've talked. Of course, she'd threatened to peel them, and their families, for revealing any information, and there was a reason that \"And may you never feel a Valkyrie's breath at your back\" was a drinking toast among the Lore. The vampires might come and take one's village, but the Valkyrie would creep in, hiding under a bed to take one's head from one's pillow. Their word was law.</p><p>Which left her...She looked up when she heard boots clicking over the stone.</p><p>\"Listen carefully, Myst,\" Wroth said as a guard opened her cell before leaving them. \"I'm going to ask you questions about your kind and about the different factions in the Lore. You must answer them or I've been ordered to get the information from you by force.\"</p><p>\"Torture? Ordered? Can't disobey Kristoff for me?\"</p><p>\"Myst, you know I'd be dead if not for him. My brothers and friends as well. My life has not been my own since that night.\"</p><p>He was actually serious about this. But then Myst hadn't been kidding either when she'd said that torture really pissed her off. She'd been giving Wroth preferential treatment because he was, like, a celebrity in martial circles, but now he'd taken a plunge into vampirism - and she needed to remember that. She'd push and cajole to the end but after that...Bring it, leech. Still bubbly friendly, she said, \"Wroth, you could help me escape - \"</p><p>\"I swore my fealty and I'll see my order through. Answer or you'll face the consequences,\" he said. \"I'll begin with the most basic. What are you?\"</p><p>\"Pussy Cat Doll?\" she asked, immediately doing a slow headshake at his look. \"Judge, jury and executioner.\" He scowled. Her eyes lit up. \"Transient! What? Really. No? Babe in Toyland?\"</p><p>\"Damn it, Myst, just answer the questions. Then you can come back up to my room.\" He lowered his voice and curled his finger under her chin. \"We can sleep together again as we did today - \"</p><p>\"But you don't understand that torture would be easier for me than to go back to the Lore as an informant.\" She'd no longer be an A-lister, an \"avoid at all costs\" enemy. She'd lose her status as a creature with which one did not fuck.</p><p>\"My brother has tried to get information from the others - \"</p><p>\"But they didn't talk either, huh?\" Did she sound smug?</p><p>He seemed to shake himself, hardening his resolve. \"You're leaving me little choice.\"</p><p>Well. She was about to experience first-hand the Overlord's ruthlessness she'd admired, because apparently he'd decided she was an enemy just when she'd thought they were getting kinda cozy.</p><p>Way to hurt my feelings, Wroth. She sniffled. Now I'll really have to kill you.</p><p>With his thoughts constantly on her throughout the night, he'd stalled for hours, as much as he could, waiting till nearly dawn, ensuring it would at least be brief.</p><p>\"You're really going to do this?\" she asked as she turned from him, moving into the back corner.</p><p>Her shoulders were shaking, and he suspected she was laughing. When he crossed to her, taking her arm and turning her, he was shocked to find genuine tears streaming down her heartbreakingly beautiful face. \"Wroth, I thought we had an arrangement.\" She cast him a brows-drawn look of betrayal.</p><p>She wasn't feigning this. In her wild, mixed-up mind, she had thought they were...friends?</p><p>The cell wobbled and he braced himself, frowning that she seemed not to notice. Just aftershocks from last night.</p><p>He didn't want her to hurt. But her eyes blazed with it, raw and true and bare. He was actually seeing her - Myst with her false swagger and play peeled back. This was a facet of her, but it was finally Myst, and suddenly he found it unbearable as each tear fell. He flinched when one dropped to her cheek, flinched as if he'd been hit. Another shake all around him.</p><p>She turned from him and appeared to wipe her face. When she turned back, she was blatantly sexual, as though she'd donned a mask once more.</p><p>\"Myst, I don't want to hurt you, but you must answer my questions. This isn't a game.\"</p><p>She gave him a look of utter disbelief. \"That's exactly what this is. You want to know about the Lore? Learn this lesson well - we are all pawns.\"</p><p>The castle shook around him, and while he glanced around wildly, she remained undaunted. No, it was not the outside shaking.</p><p>The sound booming in his ears like an earthquake was coming from...within him. \"What are you?\" he demanded again.</p><p>Her face never lost its expression of vague distaste even when her hand pressed gently against his chest - to feel his heart stutter then thunder to life. Because he'd finally seen her and recognized her for what she was...</p><p>\"Apparently, I'm your Bride.\"</p><p>\"I was wondering if I could get you to turn for me,\" Myst purred to him, as he struggled to hide his shock.</p><p>She'd found him to be a cool, disciplined man, but she'd heard a new heartbeat was deafening for these unblooded vampires, the sudden rush of sexual desire overwhelming, their breaths unpracticed and rough at first. With soft touches, she eased him against the wall. His eyes were half-lidded as she rubbed up and down his chest. \"How does the air in your lungs feel?\"</p><p>He inhaled deeply. \"Cold. Pressure, but it feels good.\" He looked at her with such gratitude for blooding him.</p><p>They always did.</p><p>\"How does your blood feel, heating and moving?\"</p><p>\"Stronger. It's...searing.\"</p><p>She palmed his erection through his pants, and his entire body jerked as he threw back his head to yell out. She was almost as shocked. She'd known Wroth was very well endowed, but hard, he was overly so.</p><p>Like Demon or Lykae endowed.</p><p>He held her hand in place over his shaft, making her fingers curve around it as he slowly thrust against her palm. Her body softened when she imagined the onslaught of need clawing at him. In a sensual whisper, she asked, \"And how does this feel when it hardens and distends?\"</p><p>\"Good,\" he grated with a shudder. \"So damn good.\"</p><p>\"It's been three centuries? Well, you are due I suppose.\" She unzipped his pants just enough to wiggle her thumb inside and rub the broad tip of his penis, making it grow slick. His eyes rolled back in his head. \"I can only imagine how heavy and tight this feels, throbbing with pressure, close to exploding.\"</p><p>\"Why are you doing this to me?\"</p><p>Because I can.</p><p>Soon he would have no more thought than an animal. His eyes were growing black. She stroked his length through his pants, relieved she would never have to take his uncomfortable size within her body. Five, four, three, two...</p><p>Wroth attacked, groaning, and he was surprisingly strong as he pinned her arms over her head. He kissed her, deeply, possessively, seeming to brand her with his kiss. He left her panting when he bent down to lick her nipples, sucking at them through her blouse. His other hand cupped her sex.</p><p>With a growl, he yanked himself from her, and took her elbow. \"Come with me.\"</p><p>Damn it, dawn neared. Where were they? She had to keep him here. \"No, Wroth,\" she said.</p><p>\"Won't claim my Bride in a dungeon.\"</p><p>\"But I can't wait,\" she cried. \"Tell the guard to leave.\"</p><p>\"No - \"</p><p>\"Wroth,\" she gripped his shaft hard while whispering in his ear, \"my body weeps for this thrusting inside me.\"</p><p>He bellowed out that order, then tore open her blouse and bra, suckling and tonguing her nipples roughly. Involuntarily her back arched, pressing her breasts into his gorgeous lips. When had she begun undulating her hips for him?</p><p>\"I've waited for you,\" he bit out. \"So long I've waited.\"</p><p>One hand pinned her wrists above her, the other shot up her skirt and ripped her panties completely from her. His fingers roved, hot and slow over her, teasing. He knew exactly how to set her on fire, using the moisture from her own body to slide his thumb around her clitoris in slow, slick, mind-numbing circles.</p><p>\"So wet,\" he rasped against her breast. \"As soon as I saw you, I wanted it to be you.\" His lips took her hardened nipple, sucking on it till it throbbed. He turned to the other one for the same attention.</p><p>Myst made a decision then. There was simply no way she was going to miss this.</p><p>She moaned in truth, unable to control herself as lightning fired outside in conjunction with the emotion inside her. When he plunged one finger into her, withdrew, then thrust two deep within her, she wanted to come around them. He slid them into her unhurriedly but with enough force that she was rocked to her toes each time.</p><p>She arched her back more, wanting to offer up her breasts. She spread her legs, taking his fierce touch. \"Don't stop,\" she panted, so close, aching to reach for his shaft. But he'd captured her hands above her.</p><p>\"Never.\" He thrust harder, until she didn't know if her toes even touched the ground, then he spread his fingers inside her as if preparing her for his size. Her head fell back and she moaned at the overwhelming feeling of fullness.</p><p>She raised her leg to lay it over the knee he'd placed against the wall as if just for that purpose. Spread to him, she ground her hips wildly.</p><p>At her ear, he rumbled the words, \"Come for me, milaya.\"</p><p>\"Ah, yes...Wroth,\" she moaned again, about to succumb to his stroking. She gave a strangled cry and climaxed with a fiery, wet pulsing that staggered her and made him groan as if he had as well.</p><p>\"I can feel you come,\" he grated while she clutched him, rolling her hips against his masterful touch until she was too sensitive to continue. But he didn't stop until she was mindlessly moaning his name in his capturing arms.</p><p>When she was spent, she sagged against him, still weakly undulating for him. Her nipples were wet and achy from his tongue.</p><p>He cupped the back of her neck and yanked her up to face him, gazing down at her with lust, but his words were more. \"I will be good to you, Myst. I will protect you. You are mine.\"</p><p>He was saying these things because he was about to shove into her with that huge shaft, to claim her. A true vampire's Bride. He took her leg and clutched it to his hip, about to free himself.</p><p>Her half-lidded eyes had just widened with true alarm when she heard the merest whisper at the gateway to the dungeon.</p><p>Before he could react, Myst flung herself away. Why would she do that? His hand shot out to pull her back, but she shrank from him. Why wasn't he inside her right now? He'd made sure she was wet, ready to receive him -</p><p>He heard movement and jerked his head around, fangs sharpening in fury.</p><p>\"Look at the lovebirds.\" A creature similar to Myst was standing at the entry to the cell, a bow at the ready.</p><p>A second one with bright, glowing skin joined the first, happily chewing gum and flipping a dagger in the air. \"Don't make me look - I think I'll be sick. Myst, cavorting with a vampire is a new low even for you.\"</p><p>\"What is this?\" Wroth demanded, stalking toward them.</p><p>The archer nocked an arrow with supernatural speed and let it sing without hesitation. He lunged to dodge it, but she'd anticipated his move and the arrow pinned him to the wall. A second took his other shoulder, drilling its tip half a foot into the stone. He cast her a killing look, then lurched forward to simply let the arrows tear through him, but the shafts were ringed like shank nails.</p><p>When he realized he wouldn't be moving, he bellowed with rage.</p><p>He saw Myst pulling her clothing together, turning for the door. \"Don't you walk away from me.\"</p><p>\"So sorry to interrupt your plans for tonight.\" She cast him that hurt look. \"You almost made me forget that you'd come down here to torture me. You want to learn? Know that we hate torture. It starts to add up over the years - \"</p><p>\"That was before I knew you were my Bride.\"</p><p>Her face went cold in an instant. \"Before you knew you could finally screw me? Now that your body's in working order, I don't feel the skin flayed from mine?\"</p><p>\"You're my Bride. Mine. You belong to me.\"</p><p>She flew back at him, enraged. The bright one tossed her a dagger and Myst caught it behind her without looking. Again his mind demanded to know what she was.</p><p>She pressed the blade to his jugular. Her pupils were silver and lightning bombarded the castle. \"If I belonged to every man who wanted it so or to every vampire I've blooded there'd be nothing left of me. But no one cares about that.\"</p><p>\"You've not blooded others. They would be here protecting you, fighting for you.\"</p><p>\"Not\" - she leaned in closer, tilting her head like an animal - \"if I killed them all.\"</p><p>Then she grabbed the back of his head and pulled him to her, pressing her lips against his. She kissed him hard. Yet he soon tasted...her blood? Just as he groaned, she drew back with an inscrutable expression on her face.</p><p>Unimaginably warm and rich, her blood was as exquisite as everything else about her, and he shuddered in ecstasy at the luscious taste. \"You know I'll want nothing else now,\" he rasped.</p><p>In response, she snapped her teeth at him. To the others she commanded, \"Leave him,\" then exited the cell.</p><p>The archer and the bright one exchanged a confused glance. \"And by 'leave him' you clearly mean leave him beheaded, disemboweled, and chock full of quills like a pincushion.\"</p><p>\"You heard him - I'm his Bride.\"</p><p>\"Ohhh,\" the bright one said, blowing a bubble. \"You mean he hasn't, uh, you know, released, the first time since his blooding?\" Then with a quick glance at his crotch, she said, \"And he stays like that without you, right?\" She chuckled. \"I'm cool with the plan.\"</p><p>The archer wasn't convinced. \"Don't get me wrong, I enjoy condemning vampires to unending sexual torture as much as the next fabulously talented huntress...\" When Wroth heard a guard charging in, she leisurely shot an arrow in that direction, tilted her head at the result, then sighed to Myst, \"But Vampire Bride just sounds so B-movie. He just dragged you down to B-moviedom.\"</p><p>The bright one made her voice overly dramatic, saying, \"For that alone...he must die. Seriously, Myst. Your 'husband' has irrevocably damaged your street cred unless you kill him like the others.\"</p><p>They were all mad.</p><p>And still he was hard, aching for her body, for the blood she'd given him just to torture him. \"You evil, teasing bitch. Kill me then.\"</p><p>For just the merest second he imagined he saw compassion in her eyes, but when she shrugged, his hazy mind finally grasped that she was going to leave him here with nothing but a body knotted with lust for her and a taste of blood that he would go to his knees for. \"You're the most malicious bitch I've ever known.\"</p><p>\"Flatterer,\" she chirped.</p><p>Across the corridor, she easily leapt to the window forty feet above, opening the shutters to draw the unfortified bars from the space as though she might pluck back a curtain. She held a hand down for the others.</p><p>\"I will find you,\" he bit out. \"I will find you and make you pay for this a thousand times.\"</p><p>The bright one leapt up and caught Myst's forefinger with her own. \"Sounds like he's setting up a date,\" she said as she dangled.</p><p>\"Oooom,\" Myst purred, her gaze flickering over him. \"Dress casual.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Present Day</p><p>Never-ending sexual desire that could never be slaked.</p><p>She'd knowingly - delightedly - surrendered him to this torment. His Bride had blooded him, giving him his first need as a vampire, then stoked it to a fever pitch - and only his Bride could work his body free to release the first time. If she had only stayed long enough for him to take her just once, or to merely touch her skin as he'd taken his own ease, she could've spared him this. But then she'd clearly said that that was the plan.</p><p>And for the last five years, Wroth had been cursed with more than that. He was cursed with her memories as well.</p> <p>The minuscule drop of blood taken directly from her body did more than make any other blood taste like tar to him - it did just what the Forbearers feared. With her living blood came dreams where her memories unfolded, so realistic they were as if he was there to experience scents she'd smelled and textures she'd felt. Sometimes he could even feel her hands clench in anger. But he'd told no one, keeping his secrets because he didn't want to lose his power within their army - or be killed.</p><p>Each sunset he rose and checked his eyes for the telltale red, and every day if he could manage to sleep, he was subjected to the same series of memories that subtly grew in detail each time.</p><p>The first found her atop a hill, sun bright, with snow still on the ground. \"I've cursed you to your hell,\" Myst hissed at the site of a rough gravestone. She was roiling with so much hostility that Wroth knew she must have killed whatever being lay there. She spoke an ancient language that Wroth shouldn't understand, but he did. He felt the sensations she'd felt, the constant sway of her chain around her waist, the smell of the ocean just below her, brine on a cold day.</p><p>Another familiar dream. A drunken Roman senator kneeling at her feet. \"At long last, I'm about to have Myst the Coveted. And you'll no longer be coveted, you'll be possessed.\" He laughed. \"You'll make me twist on your little hook no longer.\"</p><p>Wroth had discovered the full name of his tormenter. Myst the Coveted.</p> <p>With disgust, Wroth saw the Roman take Myst's dainty foot in his mouth, sucking greedily, stroking himself, as she slowly lifted her skirt up her silken thighs for him. As ever, Wroth fought not to see this, fought to wake. His violent revulsion never diminished over time.</p><p>The first time he'd had that dream, he'd been relieved when another scene unfolded before that one came to some kind of sick conclusion. But never again...</p><p>Myst was running past a Viking raiding party on the coast of some northern land. Purposely. She wanted them to hunt her. To catch her and throw her to the ground in the hard snow. What kind of twisted need did she have? She was excited, her blood pumping. Her skin felt like it was sizzling with electricity, and lightning was generated from her excitement. She stifled a smile, when with bellows and cheers, the men gave chase...</p><p>As ever, Wroth fought to force his mind away before he saw a dozen Vikings rutting on his Bride. To her delight.</p><p>Tonight a new dream. Finally. Snow outside, packed so high it covered half the window. Women, or other creatures like her, met around a great hearth. They were sisters and Wroth saw their faces as though familiar and knew their names and who they were as well as Myst did. He recognized the archer as Lucia, and the bright one he now knew was Regin the Radiant. A vacant-eyed one was called N&amp;iuml;x, the oldest of her sisters and believed to be a soothsayer. Their clothing indicated early twentieth century.</p><p>They were meeting over the fate of a baby that their leader, a somber creature named Annika, wished to keep. Myst frowned at the little girl in Annika's arms, confused to feel some stirring of feeling for it.</p> <p>\"How are we to care for her, Annika?\" Lucia murmured.</p><p>Regin snapped, \"How can you bring a vampire among us when they slaughtered my people?\"</p><p>One named Daniela the Ice Maiden knelt beside Annika, gazing up at her, briefly touching her with a pale hand. Myst shivered to think of the pain Danii had just felt to offer that cold touch. Daniela's mother's people had been the ice fey and she couldn't be touched by anyone but one of them without extreme pain. \"She needs to be with her own kind. I know this well.\"</p><p>Annika shook her head determinedly. \"Her ears. Her eyes. She's Valkyrie as much as vampire.\"</p><p>Valkyrie...? Impossible.</p><p>\"She'll grow to be evil,\" Regin insisted. \"She's already snapped at me with her baby fangs. By Freya, she drinks blood!\"</p><p>\"Trifling,\" Myst interjected in a casual tone. \"We eat electricity.\"</p><p>The vacant-eyed N&amp;iuml;x laughed.</p> <p>A vampire child? Eating electricity? His heart was racing...</p><p>Annika said, \"I will keep Emmaline from the Horde and guide her to be all that was good and honorable about the Valkyrie before time eroded us.\" Her words were laced with sadness and triggered a memory that Myst hated.</p><p>Wroth wanted to see it but couldn't.</p><p>Annika rubbed noses with the baby and asked her, \"Now where's the best place to hide the most beautiful little vampire in the world?\"</p><p>N&amp;iuml;x laughed delightedly. \"Laissez les bon temps roulez...\"</p><p>New Orleans.</p><p>Wroth shot up in bed, body drenched with sweat.</p><p>My Bride's a Valkyrie? he thought with a choking cough. His mind couldn't wrap around the idea of it.</p><p>He hadn't known they even existed. A character from legends told around campfires was linked to him for eternity. From the dreams, he knew she was a millennias-old mystical being born of a fierce Pictish princess - who'd plunged a dagger into her heart rather than be taken alive by an enemy - and of gods.</p><p>She didn't eat because she took electrical energy from the earth and gave it back with her emotions in the form of lightning. She was a killer and had been a Roman senator's whore. She despised men and enjoyed tormenting them, just as she'd done with him.</p><p>He glanced down at his throbbing erection. Even his hatred couldn't battle his relentless need for her. The impulse to take his cock in his fist was there, but he fought it, knowing he could never bring himself to come, knowing it would only increase his pain.</p><p>For five years she'd sentenced him to suffering from this constant, grueling ache. Before he'd learned there was no relief without her, he would've futilely stroked himself or thrust against the bed, imagining it was Myst clutched beneath him, but he never took release.</p><p>Other females repelled him - because they weren't her. Even if he believed he could find ease with another woman, he would never demean himself with another. He'd felt his Myst's incredible softness, felt her wet with desire for him, her body squeezing around his fingers as she'd climaxed from his touch.</p><p>He shuddered and his cock pulsed hungrily. Linked for eternity. To Myst the Coveted, a mythological being who despised him. The only way he'd keep her for eternity would be to punish her for that long.</p><p>He knew he coveted her as none other had. And now he knew where to find her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The fumes of swamp, steamed hot dogs and soured beer wafted up to Myst and her sisters as they perched on a roof above the chaos that was Bourbon Street.</p><p>There were rumors of vampires running about in New Orleans.</p><p>Vampires in Louisiana? Unheard of.</p><p>If there'd been only one account of leeches, then she and Regin and N&amp;iuml;x would still be back at Val Hall, their bayou manor, playing video games. But a demon friend had sworn he'd seen one - and a phantom had whispered that there was not just one faction of vampires, but two.</p> <p>Myst's eyes darted over the scene, trying to remain focused and not notice the couples frantically grinding against each other in dark alleys. If Daniela was here she would blow them a kiss and cool them off, freezing hands to asses in mid-grope and making her sisters chortle and roll along the roof. Myst supposed that the Valkyrie were easily amused.</p><p>But focus was proving futile ever since her heart had sped up at the idea of vampires here. If for some reason they had come to the New World - which the Horde historically found vulgar and beneath them - that still didn't mean him.</p><p>Wroth. One of her true regrets in her life.</p><p>Every day, she mused that she shouldn't have left that vampire to suffer - she should have killed him.</p><p>Regin tossed her blade up, caught the point into her claw, then flicked it up once more. \"You know, not that I believe there are actual vampires here - cause that's just whacky speak - but if there were, they should know that this is our turf.\"</p> <p>\"Should we ask them to rumble? Or maybe mash?\" N&amp;iuml;x asked as she swiftly braided her waist-length black hair. \"I've heard those can be a graveyard smash.\" Even sporting the old-fashioned hairstyle and an occasionally confused glance - she saw the future more clearly than the present - N&amp;iuml;x still looked like a supermodel.</p><p>\"I'm serious,\" Regin said. \"New Orleans may have once been the mystical melting pot of the world, but we control this place now.\"</p><p>\"We can always send Mysty the Vampire Layer to battle them,\" N&amp;iuml;x said thoughtfully. \"Oh wait, she'd run off with them.\"</p><p>Regin added, \"Or use her famed tongue assault to flail the skin from their bodies as they inexplicably line up to sacrifice themselves.\"</p><p>\"Har-de-har-har,\" Myst mumbled, half-listening. She'd been razzed about this continually. And she deserved it. She might as well have been caught free-basing with the ghost of Bundy. Of course others had overheard the jokes in the coven and the word spread. Even other factions of the Lore - like the nymphs, those little hookers - whispered about her unsavory predilection toward vampires. But it wasn't vampires plural, it was only one.</p><p>Wroth. She shivered. With his slow, hot fingers...</p> <p>In her bed late at night, when she touched herself, she always fantasized about him, remembering his hard chest and harder shaft, imagining his ferocity, his intensity, if he ever found her again.</p><p>Truthfully, she thought he might have found her by now. She'd - accidentally? - given him her blood, possibly giving him her memories, which could lead him straight here. She often pondered that reckless kiss. She'd had no discernible intention of giving him blood, but hadn't she known in the back of her mind that his fangs would be razor sharp with her sisters' arrival? Had she wanted him to find her?</p><p>She shook her head, needing to stay sharp. Annika, Daniela and Lucia were down there somewhere.</p><p>\"Lookit,\" Regin said, pointing down. \"Men that big shouldn't get schnockered.\"</p><p>Myst turned her attention to a tall man who reminded her of Wroth from the back - why couldn't she get that vampire off the brain? - though this one was much rangier in build. The man leaned against another massive male, hanging on to him for balance as they walked. She noticed her claws were curling.</p><p>\"Myst, can't you control that?\" Regin asked with a fleeting glance at her claws. \"It's embarrassing.\"</p><p>\"Listen, I can't help it, I like big males with broad shoulders. And I bet under that trench coat he has an ass that begs to be clutched.\"</p><p>N&amp;iuml;x offered, \"And it's not like she can put Band-Aids over them - \"</p> <p>\"Holy shite,\" Regin exclaimed. \"I see a glow. Ghouls, down by Ursilines Avenue.\"</p><p>\"Damn it,\" Myst muttered. \"In public again? They are hard-up recruiting then.\" Ghouls were maniacal fighters out to increase their numbers by turning humans with their contagious bites and scratches. They had green, gelatinous blood, and the parish of Orleans went gooey every time the coven fought them.</p><p>\"Again.\" N&amp;iuml;x sighed. \"And there's only so many times we can convince drunken tourists they're extras in a sci-fi flick.\"</p><p>Regin slid her blade into her forearm sheath. \"Stargate part twelve is officially on location.\" She rose. \"We'll go canoodle the ghouls. You keep a watch out for vampires.\" She made a ghostly wooo-wooo sound. \"And try not to lift tail for any of them, 'kay?\"</p><p>As Myst rolled her eyes, her sisters linked arms and leapt down, moving so quickly they were like a blur. As usual, no one could see them, and if they did in this Lore-rich city no one registered it.</p><p>Myst surveyed the glow from afar. It wasn't that extensive, so she knew they could handle it. As eldest, N&amp;iuml;x was strong and Regin was wily. Besides, Myst had new boots on and she'd be damned if she'd lose another pair to the epic battle between buttery soft Italian leather and goo. Too many casualties already. It was terribly saddening. Really.</p><p>Her attention easily fell once more to the man on the street, and she raised an eyebrow. If his front matched his back, she'd be tempted. It had been ages, literally, since she'd had a little some-some, and she deserved -</p><p>She sucked in a breath, springing back against the dormer. The drunk was no drunk at all she saw when he peered down an alley, giving her his profile. The body she'd been ogling was that of her \"estranged husband,\" as the coven liked to tease her.</p><p>He stumbled not from drink but from weakness, his build different because he'd lost weight. And that was his brother Murdoch helping him - helping Wroth find her.</p><p>Shaking, she crept along the roof, pressing herself around the dormers, hoping to get away before he saw her. He stopped, lifting his head above the milling crowd, then swung around to her direction.</p><p>His gaze fell directly on her, his eyes black, feral and riveted to her with a look of utter possession. When Murdoch's gaze followed Wroth's, he gave her an almost pitying expression, then he slapped Wroth on the back before tracing away.</p><p>The blood left her face. She leapt to the roof of the adjoining building, gaining speed for the next -</p><p>She screamed as Wroth's gaunt visage appeared directly in front of her. Traced. She sprinted in the other direction, but he snatched her around her chest, pinning her to him, making her feel his erection thick against her. She elbowed his throat, dropped from his arms, and dove over the edge of the roof. She tumbled into a high-walled courtyard, landing on hands and feet, then scrambled up to leap out of the darkened space. But her speed was no match for his tracing.</p><p>He snagged her again, and though she fought, he was somehow stronger even in his condition - maybe because of his condition. One of his hands yanked up her short skirt.</p><p>\"Wroth! Don't do this!\"</p><p>\"Five years of hell,\" he sneered, palming her ass roughly. \"You deserve to be fucked till you can't walk.\"</p><p>She gasped, trembling. \"So the warlord claims his prize? It figures that you'd take your Bride whether she wants it or not. You'd make me remember being forced?\"</p><p>After a pause he bit out, \"No. God, no.\" She heard him freeing himself. \"Myst,\" he groaned, \"just feel me.\" He took her hand and made her cup his heavy sack, then grip his shaft. Never had she felt such hardness. \"Rub the head,\" he rasped in her ear, making her shiver as she felt the moisture. \"That's as close as I can get without you. I need to fuck you so bad I'm sick with it.\"</p><p>\"Wroth, don't...\"</p><p>With a bitter curse, he lowered his head, forehead against her neck, but he only thrust against her ass. \"Can't stop,\" he grated, and she knew then that he wasn't going to take her body, just touch it, use it. Why would he refrain for her...?</p><p>His fingers strummed her nipple. Lightning. No, she couldn't want this.</p><p>His breath was hot on her and made her body go liquid. She could want it, just as she did every night in her lonely bed. The air was sultry, redolent with the scent of jasmine and even more moist than usual from the pounding fountain in the corner. No one was home. He wouldn't take her, so why not enjoy this for mere moments?</p><p>When she went soft in his grasp, lacing her arms back to lock behind his head, he growled and kicked his feet against hers, making her spread her legs. Shuddering, he ruthlessly shoved against her flesh, then threw back his head and yelled out just before he came. At the last minute he turned from her and began to spill his seed onto the ground.</p><p>She was frozen, unable to see, and for some reason it affected her more to only hear his reactions, the guttural groans erupting from deep in his chest. She felt the violent shaking, the strength in his wracked body as he clenched her through waves of pleasure.</p><p>It went on and on, each second that passed reminding her of how badly he'd needed this. Then he put his lips to her neck, clutched her ass and she knew he was stroking himself directly to ejaculate again. When she thought about how many nights he would have envisioned this, her head fell back against his shoulder.</p><p>The second time was impossibly even more powerful as he desperately kissed and licked her skin, squeezing one breast then the other, reminding her keenly of when he'd brought her to come that night in the dungeon. She wanted to join him - she wanted him to work those fingers on her next.</p><p>When he was done, he lifted her hair and brushed his lips to her neck, shuddering and breathing heavily. Her eyes closed and she was just about to say, \"My turn,\" when he did the most bizarre thing.</p><p>He arranged his clothing again and pulled down her skirt, then he turned her to him to stare down into her eyes. He cupped the back of her neck hard to yank her to face him, but instead of drinking her, or hitting her, he squeezed her into his broad chest, his hand moving to the back of her head, tucking her into him with those powerful arms. Which was disconcertingly pleasant.</p><p>Curious, she let him embrace her, relaxing a fraction, and in return, he lowered his head to kiss her hair. Finally he set her back to face him. His expression was not as wild, but grim. \"I've searched for you, Bride.\"</p><p>\"Been right here.\"</p><p>\"You've treated me ill, leaving me in that state.\"</p><p>\"My sisters were going to kill you, but I saved your life. And you were about to treat me far worse.\"</p><p>\"And licking my fang?\"</p><p>That had been an accident! Still she raised her chin and said, \"The least I could do since you were about to torture me. Consider it a memento.\"</p><p>His face hardened at that, but then he seemed to get his temper under control. \"For five years I've envisioned the retribution I would mete out, constantly imagining making you pay for what you did to me.\" He exhaled a long breath. \"But I'm weary of it, Myst, weary of carrying this. I want to look forward and get on with our life.\"</p><p>Our life?</p><p>\"From here I'm willing to start with a clean slate. We are even for our misdeeds against the other and we will forget about any past...indiscretions that might have gone on before we met.\"</p><p>\"Indiscretions?\" How magnanimous of the vampire to give her an empty score card. To fill back up.</p><p>\"Your blood gave me more than a mere taste. How do you think I found you?\"</p><p>\"So you collected my memories?\" Lovely. Did he now know she'd been utterly infatuated with him? Had he harvested all her knowledge about the Lore? \"Did you enjoy telling your brother and your friends all about my life - my private thoughts and private...deeds?\"</p><p>\"I have never told anyone anything I've seen. Believe me,\" he added in an odd tone. \"And I vow I never will. That is between us.\"</p><p>\"Can you vow you'll never use information about my family to harm them?\"</p><p>He scowled.</p><p>\"Forget it, then. Doesn't matter anyway,\" she said, trying to wrench away from him. \"There's no starting our life - even if you hadn't been about to do what that night? Break my fingers, my legs?\"</p><p>He didn't deny these things. \"That is in the past and you've paid me for that in kind. If it is consolation you want, know that I've suffered far worse than I could ever have dreamed to inflict on you. For these years, I couldn't sleep, I couldn't drink. The only thing I could do was fantasize about fucking you, with no relief.\"</p><p>Warmth bloomed in her belly, but then she frowned. \"It doesn't console me. I just want you to let go of my arms and allow me to walk away. My kind abhors yours. And even if I liked you and you were decent to me, my sisters would kill you, and I'd be ostracized by every being in the Lore. There's no way I'd choose pariah-hood with you over my current life - which I happen to enjoy the hell out of - so back off. I don't want to have to hurt you again.\"</p><p>He raised a patronizing eyebrow at that, which made her bristle, then said, \"I can't let you go. I'll never do that. Not until I die.\"</p><p>\"I've given you a warning and I'll say only once more - release me.\"</p><p>\"It will never happen. So what will make you accept this? A vow? Done. I vow to you that I will never use what I've learned to harm your family. As your husband I could never hurt them anyway because the end would be hurting you.\"</p><p>When she saw he was deadly serious about this, she realized playing with him was over. He was going to try to force her to live with him. Because he felt that was his right over hers.</p><p>No different from all the others. Her name should be Myst the Possession.</p><p>She wondered if she'd keel over dead if someone finally asked her to be with them.</p><p>\"Wroth,\" she whispered, snaking her arms up his chest to twine her fingers behind his neck. He leaned down to hear her. \"Do you know what it would take to make me your Bride in truth?\"</p><p>\"Tell me,\" he said quickly.</p><p>\"The life leaving my cold, dead body.\" She kneed him, deciding at the last minute not to break his tailbone with her blow. When he fell to his knees, she backhanded him, sending him flying twenty feet into the courtyard wall.</p><p>He bellowed in fury, slow to rise as she sprinted down a breezeway nearing the wrought iron gates at the street. But he traced forward, snatching at her, brushing down her back with his fingertips, then snagging the chain. She screamed in pain when it broke from her.</p><p>Great Freya, not the chain. If he figured out its power over her, it wouldn't matter how strong she was as a Valkyrie or how well she fought. She ran for her life, busting through the locked gates, blowing them off their hinges to clatter and spark across the street. For two thousand years it had been unbreakable.</p><p>Don't hear, don't hear, run, escape from his voice...</p><p>\"Myst, stop!\" he roared, frustration choking him when he found only the fine, gold strand from her waist.</p><p>Yet she froze, nearly falling forward her feet planted so quickly.</p><p>She turned to him, sauntering back down the corridor to rejoin him in the courtyard. Licking her lips and smoothing her hair, she said, \"That's mine and I want it back.\"</p><p>She reached for it, but he held it high from her. He was not magically inclined - he hadn't believed in the Lore until he was turned - but even he felt the power in the strand of gold. The power of what?</p><p>\"How badly?\"</p><p>Lightning streaked the sky behind her. She must want it very badly indeed.</p><p>\"Would you steal from me?\"</p><p>\"You've stolen from me. Years - you've taken years from me.\"</p><p>\"I thought we were even.\"</p><p>\"That was until you tried to unman me.\"</p><p>\"I will be kinder to you if you give it back.\"</p><p>Her eyes were mesmerizing, and he had to shake himself. \"We're past that point. All I wanted was to make my life with yours. And you left me in pain.\" Earlier, when he'd finally been released from endless nights of torture, he'd felt overwhelming gratitude to her - irrational, since she'd consigned him to it - but he'd known a measure of contentment for the first time in years. Then she'd lashed out again. \"After tonight, I understand that you'll never be brought to heel.\" He clutched the chain, recalling earlier how she'd stopped so suddenly. \"Unless...\" He trailed off, staring down into her eyes, riveted to his. \"Kneel.\"</p><p>Her knees met the stone as if she'd been shoved down.</p><p>His eyebrows drew together in shock, his breaths coming fast. \"Shiver,\" he commanded, not quite believing...</p><p>She did, and her skin pricked as if with cold. Her nipples hardened and she hugged her arms around herself.</p><p>He knew his grin was wicked. Five years of imagining had never prepared him for this. \"Grasp my belt.\"</p><p>She looked up with dread, was staring into his eyes pleadingly when he said, \"Come.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As soon as her mind registered the command, her body rushed to obey with a swift, fiery clenching that left her sagging against him, her grasp on his belt the only thing that kept her from falling - as he'd anticipated.</p><p>When the bliss finally ended and she could catch her breath, she raised her face, parting her lips to ask -</p><p>\"Again.\"</p><p>She moaned, unable to release his belt as she twitched and swayed on her knees, brushing her breasts frantically against his legs. \"Stop, please...\" She pressed her face against his huge shaft, needing it, her body squeezing only emptiness. She ran her mouth over it even as she begged him to stop. Though she'd hurt him, he was recovering right beneath her lips.</p> <p>\"Come harder.\"</p><p>To her shame, she did, arching her back and crying out, opening her knees and undulating her hips for him to come fill her.</p><p>As the waves of pleasure relented, she dimly perceived him scooping her up into his arms. She was limp, disbelieving, yet every nerve was on fire. There was blackness, dizziness, and then she was in a new place, in a dark paneled study.</p><p>He set her to her feet, but she'd gone boneless from his orders and from...tracing?</p><p>In a tremulous voice, she asked, \"Where am I?\"</p> <p>He held her until she was steady, then crossed to open a small wall safe. He tossed the chain in and shut the door. \"You're at Blachmount, my manor in Eesti. This, Myst, is your new home.\"</p><p>Her lips parted in shock. \"You can't just keep me here - \"</p><p>\"Apparently I can do anything I want where you're concerned. This is where you'll stay and where I'm going to show you all the mercy you showed me.\"</p><p>Her eyes went wide.</p><p>\"Listen carefully. This safe is unbreakable and you will never, never touch the lock. You'll never try to deduce the combination or garner it from me. Do you understand? Answer me.\"</p><p>\"Y-yes.\"</p> <p>He strode to her, clutched her arm and traced them into what looked like a bedroom. A vampire's lair. With the bed in the corner on the floor as they preferred. She shivered, knowing she was well and truly screwed in every possible sense.</p><p>\"Undress,\" Nikolai ordered from the shower.</p><p>Her shock had been quickly replaced by rancor, and she glared before obeying. He didn't care. Watching her yanking her clothes off in the steamy bathroom was like witnessing a gift unwrapped.</p><p>He stood under the pounding water, his body healing at a rate he'd never imagined. He'd taken a blow from her that would've crippled him for days in the past, and yet he was already hard for her again. In fact, his pain had been the only thing that had kept him from covering her in the courtyard and plunging into her as she writhed from her orgasm, her eyes firing silver with pleasure. Now nothing would spare her.</p><p>When she was completely naked, he stared at those plump breasts that had haunted him, his mouth watering at the thatch of auburn curls between her legs. What to make her do? The possibilities were endless. He could tell her to take him into her mouth and see how many times she could make his cock rise under her tongue. He could force her to beg to do it, to beg for him shoved inside her. After these last long years of agony, and now to have such a gift as this chain...</p><p>If Wroth had a sense of humor, he might have laughed.</p><p>He didn't understand the chain's power, only knew that it was absolute over her. He wasn't one to mull over its origin. If he spent time questioning every new development in his life for the last centuries, he'd have gone mad. It was a tool he needed. Simple enough.</p><p>He'd decided to bury the past, but tonight he'd realized she was too wild and too vicious to accept him. She'd proven she was just as his dreams told him. With this mysterious chain, could he make her a biddable wife, in his life - and in his bed?</p> <p>Earlier, he'd been very conscious of her reaction as she came. She'd rubbed her face against his cock, wanting it. In an alley, with his clothes on, having just had his manhood battered, he hadn't been able to fully capitalize on her need. But in the shower...?</p><p>\"Join me, Bride.\"</p><p>She was compelled to, though she had an expression of disgust on her face. \"You keep calling me that, but you don't have that right. I've given no consent, so I think the term you're looking for is slave.\"</p><p>His eyes narrowed as he took her tiny waist and pulled her into the water with him. \"Semantics. The end's the same. You forget that I'm from a time when men needed no consent to take what they wanted.\"</p><p>\"And you forget that I lived in those times as well and was glad to get past them. I'd almost forgotten what it was like having to kill all the leeches like you when your pesky little hearts would beat for me.\" She cast him a look of pure venom. \"But it's coming back to me.\"</p><p>When she bent down to wash off her knees, he crossed to sit on the marble bench at the end of the shower, watching her move. \"If I weren't a vampire and we had no history, would your body be aroused by mine?\"</p><p>She'd just stood fully to lift her face to the water. At his words, she clenched her jaw.</p><p>\"Answer me.\"</p><p>\"Yes,\" she grated.</p><p>\"Good. Come here. Closer.\" When she'd finally sidled over, he commanded, \"Kneel once more.\"</p><p>\"You can't make me do this,\" she hissed even as she obeyed.</p><p>\"I'm not going to make you do anything. I will never force you to touch me or force myself upon you,\" he explained while her expression turned disbelieving. \"No matter how badly you've treated me. In fact, just to make this harder on you, I will never touch you or kiss you unless you ask me for it. This will be that much sweeter when you reach to put your hands on my cock or beg me to fuck you.\"</p><p>\"Never.\"</p><p>He ignored her protest. \"If at anytime in anything we do, you want to deepen the experience, for instance by climbing up here to straddle me, I give you leave.\"</p><p>\"Are you off your meds?\" she snapped, but he could tell she was nervous.</p><p>He gently cupped her face with both hands, thumbing her glistening bottom lip. \"Touch yourself.\"</p><p>She gasped, her hand flying to her skin as though magnetized. She stroked up and down between her breasts.</p><p>\"Lower,\" he commanded. Her fingers snaked down her flat stomach though she clearly resisted the order. \"Lower.\"</p><p>She twitched from the fight, but she obeyed, her fingers descending to her sex.</p><p>\"Open your knees wide and pleasure yourself as if I wasn't here.\"</p><p>\"Don't,\" she whispered, even as she spread her knees to run her delicate finger against her flesh. His cock pulsed and the head grew slick. After long moments of simply staring in awe as she began trembling and her eyes grew silver, he rasped, \"Are you wet?\"</p><p>\"Yes,\" she moaned.</p><p>He felt electricity rolling from her, pricking at his skin, revealing how much pleasure she was experiencing, and it quickened his own need. He bit out, \"Inside. Put your finger inside.\"</p><p>When her finger slipped inside her sex, she threw her head back, crying out.</p><p>\"Two fingers. Deeper.\" He clenched the edge of the bench, and the marble cracked under his grip. \"Harder.\"</p><p>She obeyed, this time throwing her head forward, hair cascading over his torso as she moaned against his cock. Her tongue flicked out while she panted against him.</p><p>\"Ah, deeper. Faster...\"</p><p>She moaned around him this time, because she'd taken the head into her mouth. She continued to work her body with one of her hands, her fingers sliding in and out of her heat. Her other hand was all over him, wickedly seeking, her lips so moist and plump and hungry, behaving just as he'd suspected she would...</p><p>His Bride was on her knees, her fingers deep inside her body at his command, sucking greedily at his cock. He bit out, \"Do you want me to touch your breasts?\"</p><p>When she nodded eagerly, he grated, \"You have to ask me for it.\"</p><p>Her fingers slowed, and she released him from her lips, though her head was still bowed. He didn't want her to stop, knew he'd pushed too far.</p><p>\"I want to, Myst. I want to have my hands on your beautiful breasts. I've dreamed of this for so long,\" he admitted.</p><p>She hesitated, her body quivering. \"Will you touch them?\" she breathed, then set right back to her ministrations. He choked out a groan when she kissed all around the head wetly with her tongue, as she might his mouth. She took him with such abandon that he knew she was on the verge again. He reached down and covered her breasts with his hands, closing his eyes at the feel, squeezing, stopping only to pluck and thumb her nipples.</p><p>The pressure was building inside him. His body tightened, knees opening and heels planting on the ground as he tensed to spend. He didn't know how he'd lived so long without this blinding pleasure.</p><p>\"Watch me come,\" he growled.</p><p>She raised her face, and somehow she knew he wanted her to meet his eyes, not watch the actual spilling of his seed. Silvery eyes riveted to his, she worked her fist on his cock, pumping it in time with her finger dipping inside her - as if she yearned for him to fill her.</p><p>That thought sent him over the edge. The unbearable pressure exploded as he ejaculated, mindlessly thrusting against her hand, arms shooting straight out to cup her face with both hands. When she saw him spend, her eyes grew wide before fluttering shut and she cried out, jerking against her fingers as she came all on her own.</p><p>She collapsed against his knees, still shuddering, clutching his leg as she had that night in Oblak. Before she'd left him, bleeding and in pain. The need dampened, the familiar resentment flared.</p><p>He brushed her aside and stood, rinsing his seed away, staring at the stunning, evil creature still on her spread knees, hands on her thighs as she panted. The sight of her perfect, generous ass and her wet hair whipped all along her slim back had him stirring yet again.</p><p>But she was breathing hard and he knew he'd worked her pitilessly for their first night together. \"Rise and come to me.\"</p><p>When she faced him, her eyes were stark, flickering in color, showing how shocked and uncomprehending she was as she stumbled to obey. He felt a stab of guilt, but made himself remember all the aching days he'd spent rolling in pain. The nights he'd sweated from fucking desperately at the very sheets to take relief. She'd reduced him to that.</p><p>She was wary, nearing him slowly, and when she was at arm's length, he said, \"Sleep,\" then caught her as she fell limp. He rinsed and dried her body and his own, then carried her to his bed.</p><p>This should have been a time of satisfaction - by Christ, he had a living, breathing Valkyrie in his bed, and she was his Bride - yet there was little. She was utterly under his control, but he wished she didn't have to be.</p><p>Like a natural born vampire, he hunched over her, dragging the beauty into the shadows with him as he bedded them down in a corner.</p><p>Rise.</p><p>Myst hazily heard the command, knew she must still be dreaming because her skin was touching another's, though she hadn't slept with a lover in memory. She frowned, disconcerted because her body was so pliant, every muscle released of the tension she normally carried. But why was her face pressed against the naked, broad chest of a man? She was surrounded by his delicious scent that made her go warm and liquid. Snuggling closer, she dragged a leg up over his.</p><p>She heard a male rumbling sound of pleasure, and her eyes went wide. She shot up, drawing the sheet to her neck. Dread settled over her as the events of the night came back to her mind. She was in a vampire's bed, here as a slave to his every whim. Or as she figured it, she was in hell.</p><p>\"Were you dreaming about last night?\"</p><p>\"No,\" she answered honestly. She'd been thinking about licking every inch of the hard male beneath her.</p><p>\"How do feel about what we did?\"</p><p>\"We? What you did.\"</p><p>\"I only commanded you to take your pleasure. Of your own volition you took me into your mouth.\" He raised an eyebrow. \"Greedily.\"</p><p>She turned away sharply. \"Then I feel shame.\"</p><p>\"And?\" When she frowned at him, he said in his deep voice, \"There's rarely an instance where emotions do not conflict. What else do you feel when you think of last night?\"</p><p>She recalled being mindless with lust as she had never been before, hungry for his huge shaft. She had wanted to straddle him and slowly work him within her. Shivering at the delicious image, she struggled to keep from admitting her desire. \"A-aroused,\" she bit out.</p><p>\"Are you aroused now?\"</p><p>She felt herself blushing deeply. Myst never blushed. \"Yes.\"</p><p>\"Do you need to come?\"</p><p>Oh, God, no, how could he ask her this just when she was reliving last night? \"Y-yes.\" She turned from him, curling her knees to her chest. \"But I won't ask you.\"</p><p>\"Even when I can give you what you need?\"</p><p>\"The only thing I'll ask you for is to give me my chain back.\"</p><p>\"You'll get it back when I am convinced you will stay with me,\" he said. \"Explain to me what it is.\" When she didn't reply, he grated, \"Answer me.\"</p><p>\"It's called the Brisingamen.\"</p><p>\"Why do you wear it?\"</p><p>\"Punishment and to protect it.\"</p><p>\"Punishment for what?\"</p><p>She placed a hand out to her side and turned back to him, her green eyes taunting. \"When I was only seventeen, I was caught in a compromising position with a demigod of no importance or standing other than his mind-shattering talent at kissing. My family was unamused.\"</p><p>A muscle ticked in his jaw. Demigod? Wroth was a battle-scarred vampire who would never walk in the sun with her.</p><p>She studied his expression. \"Jealous, vampire? Or do you realize I'm out of your league?\"</p><p>He ignored her words. \"So your family punished you with a vulnerability that gave men control of your body? How many have had it, commanding you to fuck them for your very life?\" When she glared at him, he calmly said, \"Answer. Fully.\"</p><p>\"There was no vulnerability. It has never been broken. I've been tossed by it, caught by it, even held above a pit of boiling tar by it. I'd tried to have it smelted from me in the olden days and then lasered recently. Nothing could touch the integrity of the chain before...\"</p><p>\"Before I pulled it free like a thread? So I'm the first.\" This pleased him and he exhaled in relief, only to immediately frown. \"You don't think it's more than coincidental that you were given to me over all other females in any time and place to be my Bride, just as I've freed you from something that no man has been able to before?\"</p><p>She clenched her jaw.</p><p>\"How do you find those facts? Answer honestly. Now.\"</p><p>\"I find them... They might be... It might be fated,\" she bit out.</p><p>\"We might be fated.\" He'd already known this without doubt. He couldn't believe his heart would beat for a woman that could never love him back. Of course, she'd said there'd been others she'd blooded - then killed.</p><p>\"Yes, but just because we've been set up by a fate with a sick sense of humor doesn't mean my feelings about you will change. Are you going to keep me prisoner for eternity?\"</p><p>\"Before I let you go philander with your demigods? Yes.\"</p><p>Her slim shoulders stiffened and she stood.</p><p>He lay back, proudly ogling his Bride's ass as she sauntered around the room, studying her new surroundings. Myst couldn't merely walk, he'd discovered - her every movement was the stuff of fantasy, her every touch as well. He hadn't even gotten the chance to claim her last night because he'd been so enthralled with her wet kiss, but he was hard yet again and would remedy that soon.</p><p>\"So what miraculous feat of engineering brought modern plumbing to this schwag place?\"</p><p>Schwag? He frowned at her question, watching as she ran her hand along an old papered wall. She opened a rusted shutter and gazed out the window into the night, seeing, he knew, tangled gardens blighted with neglect. He had a sudden urge to make an excuse as to why his home was in this condition.</p><p>\"You're actually going to keep me here? Your torture is fiendish and boundless, Wroth.\"</p><p>He clenched his jaw, then said, \"As I told you, here is called Blachmount and it used to be awing and will be so again, but the estate's been abandoned for many years. While I searched for you, I lived in New Orleans, and in Oblak before that. I only come here on occasion.\" When he missed his family.</p><p>She sighed, meandering to her pile of clothes, ripped and dirty on the floor. She stared at them then blinked up at him, clearly wondering what his next move would be. It hit him full force that no matter how he felt about her, it was his responsibility to take care of her. His stunning wife, with her wild red hair and her soft, pale skin, who was so utterly out of place here, would be living with him under his roof - he'd best get this ancient shell of a keep back to its former glory and give her a home as befitted her.</p><p>He knew there would be things she would require that he couldn't anticipate, because he was beyond unknowing when it came to female needs. Did he dare take her to get her things?</p><p>As soon as he'd realized where she lived, he'd left Oblak behind and had had Murdoch purchase a property far from the crowds of New Orleans where they could live during the search. Wroth could've traced back and forth, but the time change meant each night he'd face dawn back in Oblak. Plus he'd been weak, and tracing the shorter distance to the renovated mill on the outskirts of town had been less demanding.</p><p>Now he needed to return to the mill for the large supply of blood he'd left there. He was thirstier than usual, and claiming her in this condition would not be wise. He assured himself it was only because his appetite had been reawakened and not because throughout the day, he'd dreamed of drinking from her white thighs.</p><p>He could check in with Murdoch, send word to Kristoff that he'd found his Bride, and drink in preparation of finally claiming her. While in New Orleans, he might as well visit a Valkyrie den.</p><p>\"We go for your belongings tonight.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"How are we going to do that?\" she asked. \"You can only trace to places you've been to at least once.\"</p><p>\"But I can drive anywhere,\" Wroth replied casually, every inch a modern warlord.</p><p>So she was to return to her home in ripped clothing, with her skin still flushed from last night, her body still singing for a vampire's touch.</p><p>Lovely.</p> <p>She would never live this down. And for an immortal, never was a particularly woeful proposition.</p><p>Yes, going back to Val Hall would mean a possibility for escape, but he could kill one of her sisters if they tried to free her. When he rose and strode to his closet, she studied his body, noting yet again how incredibly strong he was.</p><p>He turned and tossed her a button-down, catching her gaze just as it drifted south to his hard shaft. She almost missed the shirt and he smirked, making her jerk her face away. \"Come here,\" he ordered and she dragged her feet over. His hands reached out to pile her hair up, just so he could lean down and breathe along her neck, then murmur in her ear, \"Bride, this is embarrassing. I think I've caught you staring at my cock,\" making her quiver. She'd teased him the same way when his eyes had been riveted to her neck so many years ago. He added in a sensual rumble, \"You like it, don't you?\"</p><p>When the question sunk in, her eyes went wide with disbelief, the spell broken. How could he ask her that? When she would be forced to answer? His lips hovering over her shoulder, he said, \"Answer me honestly.\"</p><p>I want to curl up between your legs, rest my head at your hip, and draw you over into my mouth to taste you for hours, she almost said, then negotiated her mind into another honest answer: \"It's too big.\"</p> <p>He dropped her hair, smirking again. \"So it terrifies you more than tantalizes?\" he asked using the words she remembered well.</p><p>Knowing he was getting his revenge little by little, she gritted her teeth against her answer but lost. \"Both.\"</p><p>He clucked her under the chin. \"I'll be sure to break you in slowly, ride you easy the first few times.\"</p><p>Myst of the witty banter and dripping sexual innuendo was speechless. Break her in? Arrogant! When he turned for the shower, she tried not to stare at his back and how it tapered to his narrow hips and his muscled ass with the hard hollows on the sides. She'd been right, it did beg to be clutched.</p><p>Damn her claws for curling -</p><p>\"I believe you like everything about me,\" he rumbled from inside the bathroom.</p> <p>She gazed at the ceiling, embarrassed as she couldn't remember ever being before. Of course he'd known she was staring, probably by the holes she was burning into his skin. As she dressed, she thought that he was right - she was tantalized, and she did like everything about him physically. The way he'd made her feel last night left no doubt in her mind that he could not only get her to ask for him inside her, but beg.</p><p>She needed to escape before then, before he \"claimed\" her. He hadn't drunk from her and they hadn't had sex. As long as those two things stayed sacred she could get past this patch in her life.</p><p>When he returned to the room, dressed like a male dream, she felt like shuffling her feet for her ridiculous getup, draped in his shirt that fell to her knees. She had never felt insecure before. But she didn't have long to ponder it, because he put his hands on her waist. \"Are you ready?\" he asked, staring down at her. Ready? To kiss him, hug him, go to her knees? What?</p><p>He pulled her to his body, wrapping his arms around her. \"Close your eyes,\" he commanded. She did. \"Open them.\"</p><p>Suddenly, they were in a garage. This was the first time she'd traced and been able to think about the process. She'd dropped an intoxispell or two in her day and found tracing on par with that. She was unsteady at first, but the air smelled like bayou at high tide, which she liked, and was heavy with humidity. New Orleans, but where? \"What is this place?\" she asked, breaking away from him to look around.</p><p>\"An old restored mill north of the city,\" Wroth answered. \"Where I stayed while scouring the streets for you for as long as I could manage every night. Before collapsing in agony and weakness.\"</p><p>She looked away quickly, fighting a flare of guilt - and spotted his cars. She tried to be cool, but of course, Wroth caught her eyeing them - especially the Maserati Spyder - and she knew he'd seen her flicker of appreciation. The Valkyrie prized fine things. They were acquisitive to a fault - it simply couldn't be helped. Her own mother had told her that Myst's first word was, roughly translated, gimme.</p><p>He opened her door to the Spyder, and once she was inside, she curled up on the soft leather, loving it. Joining her, he cast her an inscrutable expression. \"We are fortunate, Myst. You'll want for nothing as my wife.\"</p> <p>She'd already been fortunate. She already wanted for nothing. The coven divvied their collective earnings from investments, and the take was always incredibly generous. She had enough money to buy any clothing that struck her fancy, to purchase two thousand dollar hand-painted lingerie sets to placate her obsession. In a deadened tone, she mumbled, \"Oh joy. I'm rich.\"</p><p>He commanded her to direct him to her home, not in itself an unforgivable crime. They didn't hide their address like the Bat Cave, yet they didn't often have trespassers at Val Hall. When his breath hissed in at the sight of the manor, she was reminded why.</p><p>\"This is where you live?\" he bit out, forearms resting on the steering wheel, his tone incredulous.</p><p>She tried to see it from his eyes. Fog shrouded the property, and bolts of light illuminated it in a staccato rhythm. There were lightning rods everywhere, but sometimes they didn't catch all the lightning, as evidenced by the massive oaks in the yard still lazily giving up smoke. And the wood nymphs - those little hookers - were way behind on repairing the trees. If Myst heard them whine, \"But Mysty baby, there was this orgy,\" as an excuse one more time -</p><p>\"Hellish,\" Wroth said.</p><p>She tilted her head. In the olden days they used to stick a sword into the ground to mark a grave, and she'd always fancied that the rods made this place look like one of those mass burial sites. Even at this distance, shrieks could be heard coming from within. The Valkyrie often screamed. If Annika got angry enough, car alarms in three parishes would blare.</p><p>Okay, it might be a bit hellish.</p><p>\"It's time you had someone take you from here,\" he bit out as he continued closer.</p><p>She frowned at him. \"You forget. This is where I belong. I'm as much monster as what lies within.\"</p><p>\"You're a lot of things, Bride. But you're not a monster.\"</p><p>\"You're right. I'm what monsters like you fear beneath their beds.\"</p><p>\"But now you're in my bed where you belong.\"</p><p>\"So in this life of ours that your crazed mind envisions, I'm not going to fight?\"</p><p>He shook his head as he parked down the gravel drive. \"No. I'm well aware that you're deceptively strong. I know that other beings would rather die than risk your wrath. But I won't ever allow you to put yourself in danger again.\"</p><p>She batted her eyelashes at him and in a syrupy voice said, \"Because I'm just so darn precious to you?\"</p><p>\"Yes,\" he answered simply, making her roll her eyes. He got out of the car, and she followed, but he quickly traced to open it for her, looking at her as if she was crazy not to wait for him to assist her.</p><p>Perfect. A gentleman warrior. Which she was discovering she might have a weakness for.</p><p>As they walked the drive, he said, \"Hold my hand.\"</p><p>\"Big vampire scared the wittle Valkyrie will get away?\"</p><p>He turned to her with his brows drawn. \"I just want to hold your hand.\"</p><p>What was that flutter in her stomach? And why didn't she mind that her hand was slipping into his big, rough one to be completely enveloped and secured? They walked like this to the side of the cavernous thirty-room mansion.</p><p>He was tense here, ready to trace them away in a split second, and she almost felt sorry for him when she realized he'd never seen anything like her home before. He was of the Lore, and yet in so many ways he was as human as he'd once been.</p><p>When he made her point out the window to her room, showing him a destination, he was able to trace them again. Inside, he scanned the lace and silk filled space with those discerning eyes, studying everything within. She was the girlie-girl of the coven with her candles and silk sheets, her room and lifestyle the most human-like of any of them.</p><p>Her room was next to Cara's, which housed only a spartan sleeping mat, her ancient winged helmets, and a string of vampire fangs she'd taken as trophies. Across the gallery was the room of petite, timid Emmaline. Though she was part Valkyrie, she was a vampire through and through and made her little nest on the floor under her unused bed.</p><p>It could be argued that Emma proved that not all vampires were evil and that the coven could coexist with one. Yet Emma had been the daughter of a beloved Valkyrie, and that half was believed to \"temper\" the other. An exception had been made for her, but Myst often wondered if she was the only one who noticed Emma flinch and tremble, her big blue eyes glinting with apprehension whenever the coven shrieked and railed about killing leeches. \"Present company excepted\" really was a weak statement when one thought about it.</p><p>\"So what do you want me to pack?\" Myst asked.</p><p>He raised an eyebrow. \"You should be used to this. Choose clothes as if you were going away with your lover.\"</p><p>Her hands clenched as she crossed to her drawers that housed her Agent Provocateur, Strumpet &amp; Pink, and Jillian Sherry collections, and those were mass purchases from just last week. \"Depends on which lover.\" She plucked out a red leather quarter-cup bra and a baby-doll teddy that was completely translucent, then held them up for him.</p><p>\"Both,\" he rasped, his expression pained. She saw he was getting hard again. He noticed her noticing and his eyes darkened.</p><p>Assuming a brisk manner, she crossed to the closet to gather a weekender bag, but he picked her up bodily by the waist and set her out of the way to gather a four-foot-long moving case. He dropped it at her feet. \"Fill it, because you're never coming back to this place.\"</p><p>At his words, she nodded, making it somehow sarcastic, and he knew she was thinking to herself how wrong he was. He exhaled wearily. If he had to battle against her for the rest of their lives, he would.</p><p>He moved to assist her, but every drawer in her room was full of thongs, hose, lace and little silk nightgowns that made his blood pound. She had a drawer for nothing but garters. It would take him months to bite all of these off her body.</p><p>He frowned. Women wore clothes like this for a lover. How many did she currently have? When he imagined them relishing her beauty, the gold chain slapping against her body as she writhed on them, he crumpled the iron post end of her bed.</p><p>Now she smirked at him, reading him so clearly. \"Nikolai, if you can't control your jealousy, we're heading straight for divorce.\" She tapped her finger on her chin and added, \"Make a note now that I'll expect the house, the kids and the hellhound. Actually, you can keep the schwag house.\"</p><p>He scowled before turning away, examining her belongings for more insight. Her film collection was copious. He was unfamiliar with them, as he was with most things that had to do with leisure time. \"Which of these do you prefer?\"</p><p>She clearly hated having to answer his questions and struggled against it each time. \"I like romance and horror.\"</p><p>\"A bit disparate.\"</p><p>She eyed him. \"Funny, I used to think so.\"</p><p>He ignored that and tossed a few DVDs in the bag.</p><p>She put the inside of her forearm behind dozens of bottles of fingernail polish, pushing them over her dresser into the bag. The look she gave him dared him to say something. Nail polish was out of his realm of understanding, and he merely shrugged at her.</p><p>He crossed to her bathroom, searching the cabinets and drawers. \"There are no medicines. No things...females need.\"</p><p>\"I don't get ill and I don't have those types of functions. Just like you, vampire.\"</p><p>\"None at all?\" He wondered if she could get pregnant. Perhaps he didn't have to be as careful with that as he'd planned.</p><p>\"None. Why, you can force me to have sex with you nonstop all month!\"</p><p>\"Why would I force you when I can barely keep your hands - and mouth - off me now?\"</p><p>\"Wroth, darling,\" she purred, smiling so sweetly. \"I can't wait for the next time I get to put my mouth on you.\" In an instant the smile faded and she snapped her teeth and yanked her head back as if she was chewing something free.</p><p>He didn't even have time to cringe because she wriggled from his shirt then. At the sight of her naked body, his cock shot hard as steel. She sensually dragged her underwear up her legs and then bent over in only the thong to step into a skirt. Just as he was fighting the overwhelming urge to take her hips and feed himself into her, shrieks erupted from downstairs.</p><p>On edge in this place, he moved to peer over the landing outside her room and found ten or more Valkyrie downstairs. Some were lounging in front of a TV, bowls of popcorn in front of them - that they didn't eat. One was up and sparring with what looked like a ghost or a phantom. When the pair crossed in front of the television, the others screeched and threw popcorn at them.</p><p>A small Valkyrie stalked in the door. She was covered in blood.</p><p>\"Cara!\" they shouted in greeting, completely unsurprised by her appearance.</p><p>\"What'd you get into tonight?\" one asked from her perch on the mantle.</p><p>Cara pulled her sword sheath from her back. \"My human unknowingly went into a demon bar. A demoness thought to make her lover jealous using my charge.\" She shook her head. \"It was everything I could do to keep the demon from ripping Michael's throat out with his teeth.\"</p><p>\"How'd you do it?\"</p><p>Without blinking an eye, she said, \"I ripped the demon's throat out with my teeth.\"</p><p>When they all laughed, Wroth raised an eyebrow, vowing that Myst would never see these malicious creatures again. Never. Without their influence, she would be kinder, gentler.</p><p>She sure as hell couldn't get worse.</p><p>\"Have Myst or Daniela returned?\" Cara asked.</p><p>\"No. I'd expect this from Myst - \"</p><p>Because she often ran off with men?</p><p>\" - but certainly not from Daniela. She never returned from the Quarter.\"</p><p>\"Well, the hits keep coming - I just saw Ivo the Cruel in the Quarter.\"</p><p>When they laughed again, she said, \"You should know by now that I do not jest about vampires unless they're dead.\"</p><p>They sobered and one asked, \"Has he returned for Myst? Somebody needs to warn her.\"</p><p>Wroth quickly turned back to her room - but Myst was gone.</p><p>He traced to the opened window, then to the end of the field below when he caught sight of her sprinting away. He yelled for her to stop and somehow she kept running.</p><p>She was fast and might have outrun him with her unnatural speed as she covered miles, but he traced, lunging from that momentum to snag her ankle, tripping her forward. She wore plugs in her ears from a music player. Enraged, he yanked them from her, heard the music blaring and threw the contraption into the woods beyond.</p><p>She'd almost escaped him. Before he'd claimed her. Thoughts grew distant. A shadow fell over his vision. He pinned her down, tossed up her skirt, then ripped the silk from between her legs, glorying in that feeling. He was finally going to take his Bride.</p><p>Hazily, he realized she was still struggling from him. Her words echoed inside him. \"Wroth, you want it? I'll fight you for it.\"</p><p>He would always fight for her, always. Would he fight her for the right to her body?</p><p>\"Then you're mine.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A nightmare was about to take her.</p><p>When his fingers dug into her skin, dragging her beneath him, she knocked her forehead against his. He bellowed with rage, until she squirmed around and drove her elbow back into his throat. As he fought for breath, she took advantage by scrambling from him enough to mule-kick his chest, sending him reeling.</p><p>Why hadn't she broken his neck with her elbow through his throat? She had before with other vampires. Why did she hesitate whenever it came to hurting him? She wouldn't again, she thought as she leapt on top of him, drilling her fist into his face so quickly it was like a blur. His lip split. Another two hits in rapid succession. She thought she broke his cheekbone.</p><p>\"You'll get no mercy now,\" he bit out, his eyes black, his deep voice rumbling almost unrecognizably. He caught her fist when she struck again and squeezed. With her other hand she swiped her claws down his shirt, across his neck, hissing in fury. Lightning came down like a hail of bullets. Somehow he caught her free wrist and turned over on her, pinning her hands above her head.</p> <p>Just as she tensed to kick her leg straight between his and send him flying forward, he groaned as if in desperation, sinking his teeth deep into her neck. She shuddered and cried out, body going limp beneath him. Her eyes widened in shock as she stared at the lightning above. This wasn't pain he was giving her.</p><p>His bite was ecstasy.</p><p>He did it again and again lower on her neck. Each bite, each time his fangs entered her skin was like the thrust of a man inside her. Each time he released her skin was like a slow, measured withdrawal. The pleasure was dizzying. Exquisite agony.</p><p>She'd never been defeated before in a contest of two - no man had ever been strong enough. And Myst had an animal need deep inside her for a powerful male - like this one who'd pleasured her, fascinated her - to win. Her mind rebelled, reminding her of what he was. She'd killed the last three she'd blooded. Why not him? He'd planned to torture her in that horrid dungeon, planned to control her with the chain.</p><p>But his bite...It made her body demand, growing wetter, feeling empty without him shoved tightly inside her.</p> <p>Please be strong enough...Please...For once in her life would a man take control?</p><p>So she could finally lose it.</p><p>When he pinned her wrists with one hand - hard - she arched her back in delight. He used his other to rip open her shirt and bra and bare her breasts. He palmed her flesh, then opened his jeans and freed himself. His huge erection jutted between them, the sack heavy beneath.</p><p>Her eyes widened and she fought anew, digging her heels into the ground to scuttle back. Too large for her. Break her in slowly - that's what he'd said.</p><p>His palms landed with a slap on her upper thighs, lifting her pelvis. Her hands loose, she rose up and fought him viciously - scratched, bit, hit - but it was futile. Still clasping her thighs, he used his thumbs to spread her sex, then wrenched her down on his shaft. Yelling brutally as she cried out in pain, he buried himself into her flesh until he was thick and throbbing deep within her.</p><p>He'd done it. Myst will want the first man who can defeat her. That's what they'd always whispered about her.</p> <p>They'd been right. She'd challenged him and he'd bested her. In her mind, he deserved to claim his prize no matter the consequences.</p><p>He stilled, then bent his head to her and dragged his tongue over her nipple as if to soothe her. As if somewhere in his crazed mind, he wanted her to have pleasure.</p><p>He set to her other nipple for long moments, then sucked from her neck again. Somehow the bite turned pain to pleasure, helping her body grow slick to accept the invasion. She yanked the remains of his shirt open to sweep her fingers over his splendid chest and that helped as well.</p><p>As he slowly withdrew, he groaned, \"So wet,\" but when he thrust again, she hissed in a breath, eyes watering.</p><p>\"Wroth, it really hurts,\" she whispered.</p><p>\"Can't stop,\" he bit out. His neck and chest sheened with sweat, the muscles rigid from his effort already.</p><p>\"T-tell me not to feel pain.\"</p><p>\"Ah, Myst, don't hurt.\" His words were ragged. \"I don't want you to feel pain from this.\" Immediately, the pain muted to only a feeling of fullness.</p> <p>When he drank from her, pulled back his hips and then tentatively thrust, she cried out again. He stiffened. \"No, Wroth...it's good!...Keep going.\"</p><p>He did. He timed each draw from her neck with the bucking of his hips, and she knew it was over, gave herself up to it, arched her back, arms limp overhead. The lightning whipped up the wind, and it rushed over her heated body, over her tight nipples.</p><p>He raised his chest up, positioning himself on his knees. She whimpered when she thought he would withdraw, but he dragged her up with him until she was straddling him. He spread his knees so he could thrust up inside her. He was getting too large to move within her, already hitting the end of her sex so she couldn't take him to the hilt.</p><p>His body was so big around hers, making her feel truly vulnerable. As if he read her mind he wrapped his arms tight around her, pinning hers to her sides. He completely captured her to hold her in place while he drove into her from below.</p><p>She relaxed every muscle in her body - why not? This was a position she had never allowed before, from which there was no fighting even if she'd wished to. She knew he wouldn't let her go or fall. She relaxed in the crushing tightness of his arms, her naked breasts pressed against his scarred chest.</p><p>He kept her immobile while he continued to fuck like a piston below them. Her head fell back and she watched the sky in a daze of pleasure, seeing her own lightning thrashing the earth.</p><p>Bliss welling up, strengthening, so close.</p><p>\"Myst,\" he growled, releasing her neck.</p><p>She thought he would order her to come, thought he was tightening his arms even more as if to threaten her should she disobey, but he didn't. \"Milaya, I want you so much.\"</p><p>Milaya, the endearment from years ago said in his accent, sent her over the edge. She cried out from the shattering pleasure. But it only built when he desperately wrenched her up and down on his shaft as he tensed to come.</p><p>Groaning, snarling, another bite that made her shudder in her second orgasm. Then he threw his head back, neck and chest tensed with corded muscle, to bellow from the force of his spending. She felt it inside her, searing, palpable, seeming endless as he pumped and pumped within her. She came the entire time, her body squeezing around his thickness.</p><p>Then after-shudders. Arms loosening though she didn't want them to. She didn't want this to end.</p><p>When his breaths had calmed somewhat, he drew her back to search her face. His eyes had cleared. \"I didn't want to hurt you,\" he rasped. \"I didn't - Your neck,\" he said in a shocked tone, staring.</p><p>She brushed her fingertips over her marks. \"It didn't hurt. Even before you...we...uh, worked it out.\" They were nothing and would be healed by tomorrow. \"You've really never seen this before?\"</p><p>\"Never.\"</p><p>\"I was your first bitee?\" Why that would please her she couldn't know. Why she wasn't leaping away from him in disgust confused her. She was just so overwhelmed with everything. And she felt...tenderness toward him. Yes, Myst had always been the girlie-girl of the coven, but she'd never in her long, long life felt truly feminine until this male had squeezed her in his arms and taken charge. She had never - in all the lifetimes she'd endured - experienced that much pleasure.</p><p>\"I've never taken flesh to drink because I knew what it would do to me.\" He rested his forehead against hers. \"Myst, my eyes will go red from this. I will turn.\"</p><p>He looked so horrified, the words slipped out, \"Your eyes will go red only when you kill as you drink living blood. The ones whose eyes turn drink to the marrow of their victims, sucking from the pit of the soul. They take all the bad, all the madness, all the sin.\"</p><p>His jaw slackened. \"Is that why pure-blooded vampires go mad?\"</p><p>She shook her head. \"It's more than that. They get addicted to killing, which means they can never drink from the same source. After years and years of different victims, the memories add up.\"</p><p>He cupped his hand behind her head. \"Every sunset I checked my eyes, not sure if I would turn from your blood. Not knowing if my brothers would have to kill me.\"</p><p>His tone wasn't reproaching, but hell, could she feel more guilty? This male was still inside her, inside her body that was humming as she'd never even known it could...and she'd tortured him. \"Wroth, you're a vampire. Others might not agree, but I for one believe that you're meant to drink. To connect, to live. But never to kill like that. And it takes decades of killing every day for the memories to accumulate.\"</p><p>In a stunned voice, he said, \"I won't turn. I'm meant to drink.\" His lips curled, and he stroked her hair, still supporting her with one arm. He would never let her go. He's bested me - she shivered.</p><p>\"And you found pleasure in it.\"</p><p>It wasn't a question, but she answered, \"Your bite was the only thing that saved you from a stiff legged kick at your groin.\" When he grinned, she added softly, \"It was intense pleasure.\"</p><p>He groaned in approval and thrust into her once more, still semi-hard. To her surprise, she moaned, desire stoking again. \"Did I take too much?\" he asked. Still on his knees, he laid her back until she was horizontal, secure in his arms, one hand cupping her head, the other clutching under her shoulder as he pulled her along his length in a long, strong stroke.</p><p>Her eyes fluttered closed, and she answered without thought. \"Immortal here. Remember?\"</p><p>He stopped suddenly, brought her back into his chest, arms around her, protective once more. \"I heard something.\"</p><p>\"It's nothing.\" Frustrated, she kicked him in the ass with her heels, rocking on him. He stifled a groan but didn't thrust. When she opened her eyes, she found his gaze furious and focused on...the sword point tucked under his chin.</p><p>Regin was pressing hard enough to bring blood trickling down. Lucia stood at her side with an arrow nocked.</p><p>\"No,\" Myst said, her voice sounding hoarse from screaming. \"Don't.\"</p><p>Regin stared at her in disbelief. Regin, whose entire race had been destroyed by vampires...and who'd secretly learned to count by her mother's bite scars. \"This thing just violated you - \"</p><p>\"We followed the lightning here, Regin,\" Lucia interrupted. \"Whatever he did to her she let him do.\"</p><p>She couldn't imagine what they looked like there in the field. They'd fought ruthlessly. They must be bruised, bloody, their clothing in shreds.</p><p>Why hadn't he traced her away? Why hadn't he thrown her out of the way and attacked Regin? She suspected the answer to the first - he wanted them to see her like this. Their relationship couldn't be made more brutally clear. She pulled away from him, though his arms tightened around her to prevent it. \"Please, Wroth,\" she whispered in his ear, \"let me face them.\" He finally released her.</p><p>But jealous Myst didn't want her sisters to see Wroth hard, huge and magnificent, and she pulled her skirt over them as she drew him free from her, then yanked his shirttail down. That's mine, she thought irrationally. She'd been acquisitive all her life but never with men. Now she wanted possession.</p><p>When Myst stumbled away, Wroth reached for her, but Regin raised her sword against him, piercing several inches into his chest muscle. He didn't fight back - he could hardly feel it - and he had vowed not to harm her family.</p><p>He was euphoric. There stood his Bride, putting her chin up as she pulled her shirt closed. Claimed. He stifled an evil grin. With witnesses. She could never go back now. She was his.</p><p>His heart pumped madly for her, his blood rushing inside him - and her luscious blood as well. She'd enjoyed his bite, lightning had streaked the sky each time that she came - he'd seen her pleasure. He could give her lightning each time he drank, without fear of turning, without fear of hurting her. No more checking his eyes each sunset.</p><p>They could sustain each other. He'd never known greater satisfaction.</p><p>Now if he could just get her witch of a sister to cease stabbing him.</p><p>\"You just had sex with a vampire,\" Lucia said. \"Myst, where is your mind? You know the repercussions. You'll be shunned by the Lore, mistrusted.\"</p><p>Regin added in a deadened tone, \"When Furie rises...\"</p><p>Whatever that statement meant, it made Myst's brows suddenly draw together. She appeared shocked by everything, as if her sisters' arrival had splashed ice water over her, waking her from a dream. He needed to get her home, away from them.</p><p>Suddenly Regin gasped and stared at Myst in horror. \"Oh sweetheart,\" she whispered, \"where's your chain?\"</p><p>\"Quickly,\" Wroth snapped to Myst as he reached for her, \"take my hand.\" Myst obeyed, diving forward to take it. He traced them just as Regin leapt for Myst's legs and an arrow sang for him, hitting him in the shoulder but not staying within him as he disappeared.</p><p>Back at Blachmount, he set Myst on the edge of the bed. \"Stay here,\" he ordered, then returned for the goddamned bag he'd gone to get in the first place. Just as he arrived in her room, Regin and Lucia bolted up the stairs. \"Give her the chain back, leech!\"</p><p>\"I've claimed her. She's my wife now,\" he said simply, then traced with an ease he'd never had, covering the distance as if an afterthought.</p><p>Back home, he tossed her things to the side, then took her shoulders. \"Rest, milaya. Take a hot bath and relax here until I return.\" She didn't respond, and he didn't want to leave her unsteady from tracing and reeling from the events of the night, but he needed to let Kristoff know that Ivo was in the New World. They needed to hunt him down and destroy him.</p><p>As Wroth gazed down at his Bride he wondered how Ivo could not be searching for her.</p><p>He brushed her hair from her face, trying to get her eyes to meet his. \"Make yourself comfortable here. Your clothes are here. This is your home now.\"</p><p>When she nodded absently, her pupils were huge, her eyes stark, and he knew he couldn't leave her like this. He would warm her with a bath then put her in bed.</p><p>He ran water, undressed her and set her in it. She sat silently as he scrubbed the dirt and grass from her alabaster skin and held a cloth to her neck, to the bites that marred her.</p><p>Suddenly, she turned to him and placed her hands on his face. \"Wroth, you said you would vow never to hurt my family?\"</p><p>\"Yes. I make it again.\"</p><p>\"I believe you. You could've traced and attacked Regin and Lucia tonight and you didn't. But please, if you take more memories from this night, don't give others our weaknesses. Don't allow others to hurt them either.\"</p><p>Was his first loyalty to his king or to her? She was his Bride, and as he stared into her eyes, he realized that that meant she was his family. Wroth's family had always come first, and nothing had changed except that he'd now added to it.</p><p>\"If I learn of other factions I will relate that information. But never about your kind.\"</p><p>She pulled him to her and kissed him softly with trembling lips. \"Thank you,\" she whispered against him, then she gave him a shaky smile that made his turned heart do things he never remembered from being a human before.</p><p>Her shoulders tensed just as he heard voices sounding from downstairs.</p><p>Trespassers in his home. His fangs sharpened. That someone would dare enter his home when he had his Bride within it...\"Myst, finish up, then go to the bedroom and wait for me. If anyone comes in that door but me, run faster than you've ever run and escape them.\"</p><p>He traced downstairs, feeling his muscles tensing, his hands itching to kill. He was strong from her immortal blood, taken directly from her flesh, as powerful as he'd ever imagined, and he would use it to protect her. His fangs were sharp as razors -</p><p>\"Wroth, I pity the being who wishes to harm your Bride,\" Kristoff intoned from his seat at a long table in the great room. Murdoch and a couple of elders sat with him and all their eyebrows rose at his appearance.</p><p>As he struggled for control, he imagined how they saw him. His clothing was filthy, his shirt stabbed and shot through, and God help him, Myst's delicious blood marked his skin and clothing. He was fairly certain that she'd gotten in a few sucker punches at his face as well.</p><p>\"I would not wish to attend you in such a condition. I'll go wash and change - \"</p><p>\"No, we know you are eager to get back to her for the remains of the night.\" Kristoff appeared proud. \"Congratulations, Wroth. You've now been blooded and claimed your Bride.\" He studied him. \"Recently. Though it appears as if she didn't acquiesce to you.\"</p><p>Wroth stood, uncomfortable, reminding himself that she'd kicked him like she would spur a horse when he'd stopped.</p><p>\"I'd like to meet her.\"</p><p>\"She is resting.\"</p><p>\"I suppose she would be. In fact, we'd wonder if she wasn't.\" A couple of snickers. Wroth shot them a look and they quieted. \"And you drank her blood this night?\"</p><p>His eyes narrowed. How had he thought this would escape Kristoff's notice?</p><p>\"Did you take her flesh as you did so?\"</p><p>He could do nothing but admit to the most heinous crime among their order. Shoulders back, he said, \"I did.\"</p><p>\"Take off your shirt.\"</p><p>Murdoch caught his glance, tensing to fight, but Kristoff waved him down, saying, \"Stand down, Murdoch, no one's dying tonight.\"</p><p>Perhaps Kristoff would only flail his skin from his back. Wroth removed the shirt, hoping. For the first time in his life, he had his wife waiting for him and for the first time he truly cared if he lived or died.</p><p>\"Toss it on the table.\"</p><p>Frowning, he did. The elders' eyes widened, their hands going white on the table. Kristoff had scented Myst's blood, and now the others did as well.</p><p>\"And what was it like, Wroth?\" Murdoch asked, his voice hoarse.</p><p>Wroth didn't answer. Then Kristoff raised his eyebrow in a silent order.</p><p>After a moment, Wroth grated, \"There is no description strong enough.\"</p><p>\"And how did she feel about your bite?\" Kristoff asked.</p><p>He didn't want them to know how she reacted to that, how it had made her come with an intensity that had staggered him.</p><p>Kristoff's stare was unflinching. \"You resist answering your king on the heels of confessing to our most reviled crime?\"</p><p>This was his Bride they spoke of. He wanted to lie, to say he wasn't sure, didn't know, and he couldn't. Answering this wouldn't be breaking his vow to her, and if Kristoff ordered him killed, he couldn't protect Myst from Ivo. Though it disgusted him, he bit out, \"She found extreme pleasure from it.\"</p><p>Kristoff appeared pleased. Or even relieved. \"Do you think I should forgive Wroth his transgression? For which one of us could have resisted the temptation when she was our Bride and her exquisite blood called?\"</p><p>Wroth hid his shocked expression. Kristoff would've normally called for him to be chained in an open field until the sun burned him to ash.</p><p>\"Continue as you were, but if your eyes turn, know that we will destroy you.\" He was still staring at the shredded garment marked by a Valkyrie's blood.</p><p>Wroth recovered enough to say, \"I was coming to Oblak tonight to tell you that Ivo was spotted in New Orleans. He's looking for someone - and I suspect it could be Myst. I need to - \"</p><p>\"We'll take care of it,\" Murdoch interrupted sharply. \"For God's sake, you stay here and...enjoy...everything.\"</p><p>\"Find out as much as you can from her.\" Kristoff eyed him shrewdly as he stood to leave. \"And you will tell us if the memories follow the blood.\"</p><p>A short, quick nod. As Wroth left the room, stunned from the events, he heard Kristoff say, \"Now which one of you will volunteer to accompany Murdoch to New Orleans where this coven full of Valkyrie is located?\" Wroth heard every chair scrape the floor as they shot to their feet.</p><p>Like a cat licking her wounds, Myst sat in the large bath, replaying the fight.</p><p>Since she'd pulled her punches, she wondered if she could've won, wondered if she'd truly been bested. But then she flexed the fingers of the fist he'd caught. They were sore. They were not broken. He'd held back as well.</p><p>She sighed, unable to work up the outrage that should be exploding within her or even concern over the possible threat downstairs. Wroth would take care of it. He was strong. She shrugged, her mind easily returning to tonight's stunning developments. Now her sisters knew her chain was gone and that she'd been claimed by a vampire.</p><p>What they couldn't know was how much she'd loved it. His bite had turned her inside out, made her toes curl. Even now she shivered to think of it, knowing something was woefully wrong with her for craving it. It might be twisted, but she yearned for him to do it to her again. And again.</p><p>In addition to that, Wroth had taken her as no other had before. Though she acted as if she'd had tons of lovers, she'd actually had only a couple of steady partners. She'd dated a wonderful warlock for centuries, but it was long-distance - in those days, it took a half a year to reach each other - and they'd parted ways amicably. She'd only slept with two others, both long-term, and they'd been fun and enjoyable. But she'd seen a lot, and knew a lot, and she knew Wroth moved and used his body on hers - in hers - in a way that was nothing short of divine. And she believed it would only get better. She shivered again, unable to imagine how she could feel more pleasure without dying. Then there was a very compelling fact...</p><p>He'd unchained her where none other could.</p><p>Did that mean he was supposed to have it? To have her? Was he supposed to possess her, to command her like a genie with a bottle? She'd always pitied the plight of genies until once when she'd freed one from a young berserker. Instead of thanks, the chit had laid into her, screaming, \"To each her own, lightning whore!\"</p><p>After Myst dried off, she dressed in an emerald-green, understated nightgown that said neither \"do me\" nor \"don't do me.\" She lay back in his bed, realizing she was just so relaxed about everything. Strange, but she felt so at home here in this cold, bare mansion.</p><p>Less than half an hour later he returned and showered. There'd been no threat? Probably his brother visiting just in time to see Wroth looking like she'd fought him for her life. He should see when she didn't pull her punches.</p><p>When Wroth joined her, she wondered if he was going to make love to her again. Their time in the field had only set a fire for her - lit a pilot light, so to speak, as it had never been lit before. She was sore, but if he commanded her not to hurt again...yet he only clasped her into his arms to rest on his chest. She saw he was hard, but he made no advance.</p><p>Finally, he curled a finger under her chin and raised her face to his. He drew her hair back to reveal his bites. He let her hair fall, then stared at the ceiling, rumbling the words, \"I regret hurting you. The number of bites, the lack of care before...\"</p><p>She knew what he meant by the latter - he regretted not taking time to prepare her body and ease into her. When she thought about how he'd learned to do this, or thought about the first time he'd ever realized that he would even need to, she felt a scorching flare of...jealousy - so strong it rocked her. Jealous? When he could never want another but her for the rest of his life?</p><p>\"I can't believe I lost control like that. I am unused to being blooded. I am unused to being a husband. But I vow to you that things will be different - I will be gentler.\"</p><p>That statement was the first thing to threaten her lackadaisical mood since she'd returned here. She didn't want their sex to be different. Their sex. Great Freya, was she thinking about keeping him? She would get used to his size, and then she would demand that he be anything but gentle. She couldn't have ordered up a better match for her in bed and she'd be damned if she let him hold back all that magnificent strength.</p><p>He was everything she could ever dream of physically. His scars alone...she stifled a moan but her claws were curling. He was a warrior, with a warrior's mentality, which she appreciated. None of her lovers before had been warriors. No, they'd been the warlock, an immortal sultan and an architect. Perhaps that was why she was so attracted to Wroth.</p><p>She and Wroth were kindred.</p><p>\"Speak to me,\" he commanded, then immediately amended, \"Will you not speak to me?\"</p><p>\"I want my chain back. I want to choose.\" If he gave it to her, she would stay awhile. Her sisters had already seen her screwing a vampire - she might as well enjoy the pleasure for a time.</p><p>He moved to his side, pressing her to hers as well. There they lay, gazes locked. Dawn was nearing and she didn't want this to end for some reason. He put his hand on her shoulder and stroked her. His palm was rough from hardships and the grip of his sword, and she relished the feel of it. \"I can't lose you. The very thought makes me crazed. I can't even allow myself to imagine you leaving me.\" His hand squeezed her now.</p><p>\"Are you so certain I would?\"</p><p>\"Yes. I am,\" he rasped. His tone wasn't blaming, but more like he was explaining something regrettable but inevitable.</p><p>She didn't deny it, because he was probably right. He called himself her husband, but she didn't recognize him as such. She didn't recognize him as the one whose arms she would forever run to get within. She might stay for a time, but in the end she would always go. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The harsh light of day. Or night, Myst mused. The harsh light of waking was upon her.</p><p>Instead of the shame and disgust she should be feeling, she was treated to big, warm hands massaging her back until she was a boneless heap of bliss. She moaned, her mind dimly registering that vampire lovers might be vastly misunderstood. Perhaps she was in the know and enjoying early-adapter status.</p><p>\"I have to go meet with my brother for a couple of hours. Can you content yourself here?\"</p><p>\"Uh-huh,\" she mumbled.</p> <p>\"Don't leave.\"</p><p>Huh? She wasn't going anywhere. She was too at home and relaxed here.</p><p>He bent down to murmur in her ear. \"I've left clothes laid out. Will you dress for me, milaya?\" And then he disappeared.</p><p>Strangely lazy, it took her another hour before she finally got up. She raised an eyebrow at what he'd set out for her - a stiff satin bustier fringed with transparent lace that just covered her nipples, intricate garters, fishnet hose and thong - all in jet black. She shivered. General Wroth had a wicked streak.</p><p>He wanted her to dress for him, and she didn't have a problem with that - she was pleased that someone would finally enjoy her fabulous silks and lace. And it made a huge difference that he'd asked when he could have commanded. But as she soaked in a bath, she mused that she was still in a position where she had to depend that he would continue to show the same consideration. Which was intolerable for a creature like her.</p> <p>She'd half-expected her sisters to have arrived already - N&amp;iuml;x often could find her - but knew if they hadn't come by now, she would have to win her freedom with her own tools and talents. He'd said he would return the chain when he was confident she would never leave. How hard would it be to act as though she wanted to stay forever?</p><p>She dried off, tilting her head at the lingerie laid out. Why not use seduction to let him think she desired him above all others for all time? Play at love and act at surrender. As she smoothed the hose up her legs, she wondered if deception had ever sounded so delicious.</p><p>She began trembling as she donned the bustier, and the material at the top skimmed over her hard nipples so sweetly. She was already wet with anticipation.</p><p>After dressing, she lay on the bed, fantasizing about him inside her as his big hands worked her body. Would he drink her? She pictured him driving into her from behind, the length of his body stretched over hers to take her neck as well.</p><p>Her fingers found their way down her belly and into her panties. He was supposed to be back soon, but did she really care if he caught her? She'd already done it for his pleasure, and what would he do if he found her like this and didn't like it - break up with her?</p><p>A stroke on her clitoris had her back arching. Had she ever been so wet? No, not until she'd impatiently waited in a vampire's lair in tight black satin to seduce a warlord.</p> <p>Her eyes closed and her legs fell wide as she ran her finger lower. When she opened her eyes, half-lidded, she found Wroth staring at her from the foot of the bed.</p><p>\"Couldn't wait?\" His voice was husky, his eyes dark. He was already ripping off his clothes, his shaft bulging against the material of his pants.</p><p>She shook her head.</p><p>Wroth had known his Myst was a pagan, but she'd never truly looked it until he found her pleasuring herself in his bed in black hose, garters and satin, legs spread with abandon. Her glorious red hair haloed out along the pillow and her hand was in her panties delicately stroking her sex.</p><p>She hadn't stopped at his arrival.</p><p>\"I couldn't have dreamed you'd be like this. I believe I'm dreaming now.\"</p><p>She arched her back.</p><p>\"Were you thinking of me?\" Say yes... He didn't think he'd ever wanted to hear anything so badly.</p> <p>Her whiskey voice was as sexy as her body. \"Yes, Wroth.\"</p><p>He groaned. \"What were you thinking of?\"</p><p>\"Of you drinking me while you were inside me,\" she said, moaning the last words.</p><p>Craving his bite too? \"A dream.\"</p><p>She licked her lips. \"In your dream do you make me wait for you much longer?\"</p><p>\"You want this freely?\" He reached to unbuckle his belt, surprised to find how difficult it had become. Finally, he just tore it apart. Her hips rolled in reaction.</p><p>\"Yes.\"</p><p>\"No games?\"</p><p>\"No,\" she panted, \"just need you inside me.\"</p><p>\"Your body wants to be fucked?\"</p><p>She gasped, her fingers teasing quicker. \"Yes.\"</p><p>\"By me?\"</p><p>\"Yes,\" she moaned.</p><p>He'd anticipated it would take months of planning to wear her down, until she truly wanted him, and they wouldn't have to play at commands and power.</p><p>Yet here she was stroking herself in his bed as she awaited his return. In his bed, waiting. It was too impossible, and he grew suspicious. \"Convince me.\"</p><p>Her gaze flickered over his face, her eyelids heavy as she slowly, sensuously drew her fingers away from herself. She rose, sauntered to the wall, then tugged aside the flimsy string of her wisp of underwear.</p><p>Without a word, she simply spread her legs and leaned forward until her forearms rested against the wall. When the position raised her ass and bared her lush sex, he rasped, \"You make a compelling argument.\" He was overwhelmed by the sight of her flesh waiting to be filled and by the fact that she began this, had masturbated to thoughts of him fucking her...</p><p>He kicked his boots off, ripping his clothing away, then stood behind her. He slipped his thumb into her tightness, briefly closing his eyes to find her so luscious and slick. Her entire body was trembling, which affected him so much. With a groan he replaced his thumb with one, then two fingers. \"In my dream I do fuck you. But I start slowly, feeding my cock into you inch by inch. When you're dripping wet and ready, I fuck you with all the strength in my body.\"</p><p>With a little cry, she bent down more, raising her ass up higher. \"What do I do?\" she breathed.</p><p>\"You come again and again from no command, just from pleasure.\"</p><p>He spread her, grasped himself, then fought not to plunge into her when the head touched her dewy heat. He shuddered violently from the battle, but wouldn't reward this gift from her by hurting her tight little sheath.</p><p>Yet the head was barely inside her when lightning exploded outside - because she was already coming, clawing furrows into the wall, gasping, \"Wroth, now...please!\"</p><p>\"I am...\" he groaned, clutching her hips, straining his every muscle to enter her slowly, to make this good for her -</p><p>His eyes widened when he felt her claws sink into his ass to yank him into her.</p><p>\"Hard,\" she growled in a throaty voice.</p><p>\"Don't hurt,\" he choked out, then with an answering growl, he thrust into her, forcing his cock through the squeezing spasms of her orgasm as though through a tightened fist. Even when he was seated deeply, she continued to climax around him. He could have stilled and let her body milk him.</p><p>But he wanted to fuck her. To take her so fiercely she would forget other men. To brand her as his own. He clenched her hips, withdrew, then rocked into her, hitting the end of her sex.</p><p>\"Yes!\" she cried.</p><p>\"Can you know what that does to me?\" he rasped, grinding his hips, stirring her. She moaned, hanging on to the wall. \"To see you finger yourself to thoughts of me?\" He withdrew completely then fell into her with another brutal thrust.</p><p>\"Ah Wroth...yes, oh, God...\" She came again suddenly, the manor shaking from the lightning. \"Drink,\" she sobbed to his disbelief. \"Oh, God, please drink from me.\"</p><p>He ripped the lace to bare her breasts, then covered them with his hands, fingers pinching and tugging her nipples as he pulled her to his chest.</p><p>\"You want my bite?\"</p><p>\"Yes,\" she moaned.</p><p>\"As much as you want my cock?\"</p><p>\"Yes! Wroth, put everything in me, yes, yes, yes,\" she repeated, panting between her words, shoving and circling her hips back into him. His fangs pierced her skin just as he thrust.</p><p>She cupped his head to her neck hard so he wouldn't stop - then came again, moaning his name so that he felt her words as he bit her. He didn't stop, just snarled into her skin as he ejaculated, mindlessly grinding against her, hands squeezing her heavy breasts. Her blood scorched him inside as he pumped his come into her in wave after wave.</p><p>Afterward, when thought returned, he caught her up to his chest because she was unsteady, but then so was he. He withdrew slowly, then scooped her into his arms, crossing to the bed.</p><p>When he gazed down at her, he saw her eyes were silver and her lips were curling into a smile.</p><p>He stared, still disbelieving. \"Like that, did you?\"</p><p>She nodded.</p><p>\"Want more?\" he asked as he tossed her on the bed.</p><p>In answer, she went to her knees, pulled aside her hair and offered him the unbitten side of her neck.</p><p>His voice was ragged with lust. \"That wasn't quite what I meant, but we can work something out...\"</p><p>The more hours toward dawn that they spent licking, fucking and both of them biting, the more overwhelming the mind-boggling pleasure - the less he could believe that this was his Bride, happily - no, aggressively - partaking.</p><p>And at the end of the night, he stared down at her in puzzlement. He didn't know which facet of her he liked better. The siren in black satin that made his cock and fangs ache or this angel with her bright red hair spread across his pillow - who made his chest ache.</p><p>She brushed the backs of her fingers along his face. \"Wroth, I want this to grow naturally between us without the chain,\" she whispered up to him. \"Vow you'll give it back in two weeks time. Just give us a chance, give me a chance to want this freely.\"</p><p>He wanted to believe in her - and in himself, that he could convince her to stay. He'd already wanted to command her to close her eyes and open her palms, and then see her face once he'd poured the chain into them.</p><p>Two weeks to win her. \"Yes, milaya, I vow it.\"</p><p>Nothing in his human life or his vampire existence had prepared him for living with a Valkyrie.</p><p>Myst had boundless energy, she was powerful, and she exuded an almost otherworldly sensuality that set his blood on fire. Each night he traced her to different locations to make love to her. He'd had her against the foot of a pyramid, gazed in awe as she rode him on a moonlit beach in Greece, licked her sex beneath a redwood until she begged for mercy...</p><p>Throughout those nights, once he and Myst had worked the edge off their need, they talked for hours and he learned more about her and her kind. He'd given her the cross she'd admired at Oblak, but when the jewels glinted in their room's gaslight, she'd seemed to go into a trance. Finally, he'd covered it, and once she'd shaken herself, she'd admitted, \"We all inherited Freya's acquisitiveness. Shining things, jewels and gems...We can't tear our gaze away without training for years and sudden glittering is sometimes irresistible.\"</p><p>Wroth had inwardly cursed that she had this vulnerability. He'd thought the Valkyrie were an almost perfect creature - no need to eat, immortal, strengthening with age - but he'd since learned that they were one of the few species of the Lore that could die of sorrow. And if one was weakened the others suffered since they were all connected with a \"collective\" power.</p><p>He couldn't always be there to protect her. Though he'd tried to use the chain as little as possible, he'd whispered to her as she slept that she would no longer have these weaknesses.</p><p>Wroth would have been content to hear only about her, but she'd been surprisingly curious about his past. He found himself revealing things he never had to anyone, yet feeling unburdened from it.</p><p>He'd told her of the pain he and Murdoch had felt to return home and see their other six siblings and their father dying of plague. Myst's eyes had watered as he'd spoken of the gut-wrenching decision to make them drink. Then came the agonizing vigil as they wondered if their family would be reborn, any of them. In the end, they'd lost their father and sisters, but regained their two brothers.</p><p>The night he himself had \"died\" seemed to fascinate her, and she repeatedly asked him to tell her the story of how he'd made demands of Kristoff. She never failed to tell him how proud she was of him. That comment had made him feel particularly uneasy. These days there wasn't much he was proud about. He avoided Kristoff, telling him little when they did meet. He was coercing his Bride to stay with him, and he suspected that if, at the end of the two weeks, she wanted to leave him, he'd break his vow to her in a heartbeat's time.</p><p>He sought any hint that might tell him how she felt and what she might decide. At times he was optimistic. When they fought mock battles with a game based on military strategy, she seemed to enjoy herself - and to like the fact that he always beat her. She wasn't a strategist, she'd explained to him. She was \"front-line badassness\" but she appreciated his talent. One time she had stood and sidled over to straddle him, placing his hands on her breasts. As she slid down his shaft, she whispered in his ear, \"My wise warlord. You make my toes curl you're so good.\" He'd shuddered violently and had to fight not to come in an instant.</p><p>In fact she seemed to delight in every reminder that he'd fought and warred. She'd admired his sword, eyes widening at the considerable weight of it, only to narrow on him and grow silver with want. Her eyes had only to flicker silver and he went hard as iron.</p><p>And last night, as they lay spent in bed, he'd finally asked her, \"What do you find attractive about me?\" That could possibly compete against a demigod with a \"mind-shattering kiss.\"</p><p>Without hesitation, she answered, \"Your scars.\"</p><p>His brows drew together in surprise. \"What? Why?\"</p><p>\"They're evidence of the pain you've survived. Pain survived builds strength.\" She traced down his stomach. \"This is the one that killed you?\"</p><p>\"Yes.\"</p><p>\"Then this one I admire the most.\" She brushed her lips so tenderly over it. \"It brought you to me.\"</p><p>But his contentment was never whole. He'd never been in love, didn't believe he'd even slept with the same woman twice, yet now he wanted everything from this pagan immortal, was sick with wanting her. He wanted to strip her soul bare and make her give all of herself, all of what she'd been in the beginning before time twisted her.</p><p>His dreams reminded him of her past, preventing him from falling for her completely. Though he'd thankfully never seen her making love to another - and for some reason, he believed he never would - he drove himself mad with the mere idea of the lovers she'd taken into her body. He made himself crazed wondering how he compared to them. Each wicked thing she did to him that had him staring at the ceiling in an agony of pleasure and shock had him wondering later where she'd learned it.</p><p>How many had she had? She was two thousand years old. One bedmate a year? Two a year? One lover a month...?</p><p>And how could he compete with gods for her? She was a creature so passionate and beautiful, it was clear she'd been made to be loved by them alone.</p><p>The dreams kept him from believing and falling into the life they could share - the life he wanted so badly he could taste it.</p><p>He dreaded sleep and took no succor from it, growing weary with each day though her blood built his muscle, making him physically stronger than he'd ever imagined. Each sunset, he treated her coldly, so she asked about his dreams. But he lied.</p><p>She would accept his reassurance, smiling over at him from her window seat. Her smile could bring down an army. Probably had.</p><p>How had he thought he was a match for it?</p><p>My apologies, Myst thought as she gazed down at Wroth, rolling her hips on him, but she was enjoying the hell out of her vampire.</p><p>His eyes were so fierce, his gorgeous, sculpted muscles rigid beneath her claws as she leaned forward to cup her breast to his mouth. He suckled and groaned around her nipple as he tensed to come, and when she exploded, he shot hotly inside her. She fell limp on top of him, loving it when he put his arms around her and clenched her into his chest as he shuddered for long moments afterward.</p><p>When he finally let her go with a kiss so he could dress and leave for Oblak, she said, \"Okay. I'm down with being your dirty little secret out here - for now. But I can't just sit in this room for hours when you leave.\"</p><p>\"What do you need, love?\" he asked, piling her curls atop her head. He seemed fascinated by her hair, always touching it.</p><p>Wait, he'd called her love? Cool. \"Do you know what an Xbox is? No? Well, your Bride has a teeny little addiction to it...\"</p><p>She wrote down the model of the console and the games she wanted as he showered and dressed. Just before he traced, she took his hands and gazed up at him solemnly. \"Bring this back and you might as well have slayed a dragon for me.\"</p><p>As she waited, she painted her toenails - Valkyrie loved painting their nails since it was the only way they could semi-permanently alter their appearance - and reflected on how easily she'd settled in here.</p><p>In fact, there were only three things that prevented her from being truly comfortable in this situation. The first? Though they traveled most nights, he wouldn't take her to meet his friends and family and wouldn't let her see hers either. He'd explained that he wanted her undivided attention for these two weeks.</p><p>She suspected he was waiting until their relationship was cemented, which he believed would be in three days - the end of what she called the two-week vampire demo. Had it resulted in a sale? She knew it would mean pariah-hood in the Lore and having to give up her family. She could just imagine bringing Wroth to the coven. Her sisters would thank her for the surprise then pounce on him, swords and claws flying with glee.</p><p>As twin sister to Furie, Cara alone would fight him to the death simply for what he was. And though Wroth was incredibly powerful, Cara was quick, with thousands of years more experience and the boiling hatred of a separated twin. The two of them together would be like Godzilla versus Mothra, or some serious epic shite.</p><p>Her second concern was her worry for him. He often traced to Oblak, and each time she wondered if he would face some faction of the Lore intent on killing him just for being a vampire. She believed him when he told her of Kristoff's agenda and saw no conflict of interest with her covens, so call her an awful person, but she'd turned informant, teaching him how to protect himself.</p><p>Her third beef was that each sunset when they woke he was unbearably surly and curt with her. She feared he'd seen memories of her flirting or even making love - though N&amp;iuml;x had once told her that recipients of visions never saw things they couldn't recover from and usually only witnessed major, life-changing events. He'd assured her again and again that it was nothing, but Myst had suspicions. Yet she could tolerate his moods because he spent the rest of the night treating her like a queen.</p><p>Just when her toenails had dried, he returned with the slayed dragon and its attendant games and set them at her feet. He looked at her with his brows drawn like he'd missed her, and her heart did funky twisty things in her chest. The impulse came to jump him, so she did.</p><p>Only after he'd squeezed her up in his arms did she realize she'd run to get within them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Wroth shot up in bed, feeling nauseated, physically ill from his nightmares.</p><p>He'd been lashed by the usual dreams of her gloating at a gravesite, then the Roman stroking himself as she slowly dragged her skirt up her thighs. \"I'll possess Myst the Coveted...\"</p><p>But details of the memories became more evident each time. This time he'd heard Myst's amused thoughts at his words - No one possesses me, but in their fantasies. I'll kill you as easily as kiss you... \"And I'll be yours, only yours,\" she purred, though she detested him.</p><p>Now he'd seen something new. A different, more recent memory. Myst was smoothing on hose, her foot daintily placed on his bed, as she made a decision to...trick him? To act as though she'd capitulated easily in order to get her chain back.</p> <p>Play at love and act at surrender.</p><p>He gripped his forehead in his hand. Irrationally, he waited for the soft touch of her hand on his back. She was his Bride, his wife, and she offered him no comfort.</p><p>Even had she truly had that urge, she couldn't, since he was still secretly commanding her to sleep throughout the day. So she wouldn't run away from him and leave him in torment again.</p><p>Kill you as easily as kiss you...</p><p>He'd thought they'd had a place to start from, to move forward from, but he'd been fooled by her beauty and abandon. She'd seduced him, made sure he \"caught\" her working her body that same night, knowing he would lose his mind at the sight.</p> <p>He was as much a fool as the Roman, besotted with a fantasy that didn't exist. At least that long-dead Roman had suffered no delusions that she could care for him. He'd known that she was incapable of feeling and had wanted possession only.</p><p>Wroth had been falling for a fantasy, one that easily manipulated him.</p><p>She desired her freedom and she would use whatever means she had available to get it, leaving him as soon as she'd succeeded.</p><p>Fool.</p><p>When Myst woke, she burrowed down into the covers, feeling relaxed and content to her toes.</p><p>Today was D-day - delivery day for the chain - the end of the demo that she realized had resulted in a sale.</p> <p>She snuggled into his pillow, loving his scent, and considered her new feelings. She'd feared her life as she'd known it had ended the minute he'd vowed to give her the chain back. It was a leap of faith on his part and she'd responded to it. Responded in kind. It was a bit ironic that she'd smugly planned to punk him only to get snared in her own machinations. She'd lasted only a few days playing easy till she went easy, her femme fatale plans culminating in the oh-sonefarious leap into his arms.</p><p>She grinned into the pillow. She'd take back her chain, but only because it looked so damned sassy on her.</p><p>When she rose and stretched, she found him watching her. Her grin widened, but he didn't return her smile, just glanced at her bare breasts and snapped, \"Put on some clothes.\"</p><p>She drew her head back, frowning. \"Are you angry with me?\" He was usually brusque when they woke, but she could tell this was much worse. She was baffled by what could have happened since she'd gone to sleep, tucked against his chest, secure under his heavy arm. His eyes were somehow crazed and bleak at the same time, his face exhausted. Alarm began to build inside her.</p><p>\"We have a lot to discuss tonight.\" He tossed her a robe. \"Put it on and sit here.\"</p><p>She had no choice but to comply. He traced away and was back seconds later, holding the chain fisted in his whitened grip. \"Tonight we're going to make some adjustments between us - or more accurately, in you.\"</p><p>Her eyes widened. \"Wroth, what are you doing?\" she asked slowly. \"You vowed to give it back today.\"</p><p>\"A woman like you should understand broken vows.\"</p> <p>\"What are you talking about? How can you do this to me now?\" The evening she'd decided to stay.</p><p>His face was crueler than she'd ever seen it. \"You mean after the last two weeks? Just because you wanted to be fucked and I complied doesn't mean I won't treat you as you deserve.\"</p><p>She put the back of her hand to her face as if she'd been struck. He didn't say \"treat you as a whore,\" didn't call her that, but somehow he made her feel it. \"As I deserve,\" she repeated dumbly.</p><p>He grasped her arm, squeezing it hard. \"I can't live like this, Myst. With this.\" At her confused expression, he said, \"I've seen your past. I know what you were, what you are.\"</p><p>\"What I was?\" Her frown deepened. She hadn't lived her life perfectly - there'd been missteps and misjudgments - but she'd done little to be ashamed of. Was the killing too much for him to handle? He'd been a freaking warlord! \"If you find me lacking, know that I regret very few of my actions over my long life.\"</p><p>That seemed to enrage him. \"No? What about playing at love and acting at surrender?\"</p><p>\"Wroth, that was - \"</p><p>\"Silence.\" He kissed her roughly, harshly, though she struggled against him before he pulled back. \"I've realized you are heartless.\" His eyes appeared tortured, his entire body tight with tension. \"But what if I just ordered you to be kinder, then made you forget all the men that came before me? Made you forget all that, forget your vicious sisters who kill without remorse?\"</p><p>She gasped, eyes watering, but she couldn't speak after his command. Her hands clenched. She'd never wanted to scream more in her life, and yet her lips parted silently in shock when he said, \"I believe I'll just order you to want me so fiercely that you can't think of anything or anyone else - \"</p><p>A voice interrupted from downstairs. \"General Wroth, you're needed at Oblak immediately.\"</p><p>\"What?\" he bellowed. She felt his eyes on her as she staggered to the window seat, tears beginning to fall. She curled up, leaning her forehead against the glass.</p><p>\"Your brother's been badly injured.\"</p><p>He pointed at her. \"Stay here,\" he bit out, then disappeared. She heard him downstairs, locking away her freedom again, then he was gone once more. Stay here? In the room or the manor? He'd been so thrown by the news that he hadn't elaborated.</p><p>So stumbling, clutching at the wall as energy funneled out of her, she finally made her way to his study. She pulled aside the cabinet, finding the safe behind it. When she reached for the lock, her hand veered off course as though pushed by an unseen force. She bit her lip and tried again, fighting to simply brush the metal.</p><p>Commanded not to touch it. Just like he would command her to forget who she was, that she even had a family. Lightning cracked outside in time with a sob. He'd been about to do it.</p><p>It was true then. Vampires couldn't be trusted - he'd seemed out of his mind with rage. Why had she gone against all she'd ever learned to be with him?</p><p>The years had been weighing on her and she'd been overwhelmed by the yearning to simply lean on someone, just for a while, to have a partner to watch her back and hold her when she needed it. Surely she'd convinced herself to accept him because he was strong and she had grown so weak. No longer.</p><p>There were ways she could get around his orders - nimble thinking, creative reasoning. As tears poured from her eyes and the lightning grew to constant furious bolts, she tore at the wall, at the very stone that housed it.</p><p>So he would use her? Like a toy. A mindless slave. Adjustments?</p><p>Toy, bait, whore...Just because you wanted to be fucked, he'd sneered.</p><p>Two millennia of people thinking they could use her. Always using her.</p><p>She'd take this safe with her teeth if she had to.</p><p>\"You should see the other guy,\" Murdoch grated from his bed when Wroth traced into his room.</p><p>Wroth shuddered to see his brother's face torn and limbs broken like this even while knowing he couldn't die from anything short of a beheading or sunlight. He shook himself. \"What has happened to you?\" he asked, his voice a rasp.</p><p>\"About to ask you the same. My God, Nikolai, you look worse than I do.\"</p><p>He thought about how he'd left Myst at the window, crying, staring out at the lightning storm that came from within her. It pained him so much to think of her hurting alone... \"We'll talk of my problems later. Who has done this to you?\"</p><p>\"Ivo has demons. Demons turned vampires. They are strong - you can't imagine it. He is looking for someone, but I don't think it's your Bride - they mentioned something about a 'halfling'.\"</p><p>\"How many?\"</p><p>\"There were three in his party - other vampires as well. We took down two of the demons but one remains.\" He glanced behind him. \"Where's your Bride?\"</p><p>After a hesitation, he explained everything, seeking the same unburdening he felt when he spoke with Myst. His brother's expression grew stark.</p><p>Long moments of silence passed before he said incredulously, \"Wroth, you took away the free will of a creature that has had it for two thousand years. A good wager says she's going to want it back.\"</p><p>\"No, you don't understand. She's callous. Incapable of love. It eats at me, her deception, because it's the only thing that makes sense.\" More to himself, he muttered, \"Why else would she want me?\"</p><p>Murdoch weakly grabbed Wroth's wrist. \"For all these years I've seen you continually choose the best, most rational course, even if it's the most difficult. I've been proud to follow your leadership because you've acted with courage and always - always - with rationality. I never thought I would have to inform you that your reason and judgment have failed you, Nikolai. If she's as bad as you say then you have to...I don't know, just help her change, but you can't order this. Get back to her. Explain your fears to her.\"</p><p>\"I don't think I can. You saw her, Murdoch. Why would she so quickly acquiesce?\"</p><p>\"Why don't you just ask her?\"</p><p>Because I don't want to show her again how craven I've become with wanting her.</p><p>\"And about the other men - this isn't the sixteen hundreds anymore,\" Murdoch said. \"This isn't even the same plane. She's immortal, not an eighteen-year-old blushing bride straight from a convent. She can't change these things, so if you want her, you have to adjust.\"</p><p>Wroth ran a hand over his face and snapped, \"When did you get so bloody understanding?\"</p><p>Murdoch shrugged. \"I had someone explain a few rules of the Lore to me and learned we can't apply our human expectations to the beings within it.\"</p><p>\"Who told you this?\" When he didn't answer, Wroth didn't press, not with all the secrets he'd been keeping. \"Will you be all right?\" he asked.</p><p>\"That's the thing about being immortal. It'll always look worse than it is.\"</p><p>Wroth attempted a grin and failed.</p><p>\"Good luck, Nikolai.\"</p><p>Outside of the room, he spoke with those watching over Murdoch and emphasized what would happen to them should his brother worsen, then contemplated tracing back. He was almost glad when Kristoff called a meeting about this newest threat, grateful for the time to cool off before he faced Myst again.</p><p>Kristoff didn't hesitate to ask, \"Why didn't your wife tell you about the turned demons?\"</p><p>\"I don't know. I will ask her when I return.\" He wondered as well. Had she known? No, she'd been teaching him everything she knew - teaching him constantly.</p><p>Why would she do that if she only planned to leave him?</p><p>When he cringed, he realized Kristoff was still studying him.</p><p>\"Something to add?\"</p><p>He owed Kristoff his life and the life of his brothers. Three brothers and for Myst herself, he owed his king. He would withhold information on Myst's kind but relate the rest. \"I've learned a good deal about the Lore from her and want to discuss it with you, but I left my wife feeling poorly. I'd like to get back to her.\"</p><p>\"By all means,\" Kristoff said, his face unreadable. \"But tomorrow we'll talk of this.\"</p><p>Wroth nodded, then traced back to Myst, frowning as a hazy idea surfaced in the turmoil of his mind. Had his brother's heart been beating earlier? But before he could contemplate this further, Wroth's attention was distracted by Myst's sleeping form. He gazed down at her, chest aching as usual. Sometimes he damned his beating heart because of the pain that seemed to follow it.</p><p>Murdoch was right. She couldn't change what she was, and he'd wronged her today. If only he could think more clearly where she was concerned instead of reacting viscerally. Primitively. Before, he'd never understood when men talked of madness and love in the same breath. Now he understood.</p><p>He only hoped that when he asked her to forgive him his weakness, she could.</p><p>After undressing, he climbed into bed with her. He pulled her close to him, running his hand down her arm, burying his face in her hair and smelling her soft, sweet scent. Finally at dawn, he passed out with exhaustion. When he dreamed, he opened his mind to her memories, to what had become his nightmares. They superseded all his other visions of battle and famine because these hurt him the most. See her in a sordid light. Punish yourself.</p><p>See them all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The dream of the Roman appeared first. Wroth impatiently waited through the usual scene, seeking to see more. Did he truly want to? Could he ever turn back from this?</p><p>Too late, it was done. He knew that he'd unlocked the floodgates and that these dreams were going to play out, each spinning to their gruesome, perverted endings.</p><p>Myst slowly lifted her skirt up. Yet then Wroth felt something new - chills crawling up her spine as she peered down at the Roman with his wet lips and furious stroking.</p><p>She was ashamed at her disgust and closed her mind off it. She was the bait. She'd be whatever it took to free her sister.</p> <p>\"I'll possess Myst the Coveted...\"</p><p>No one possesses me but in their fantasies. I'll kill you as easily as kiss you... The Roman sought to make her his plaything just as he had Daniela for these past six months.</p><p>Suddenly Myst glanced up and Wroth saw through her eyes. Lucia had Daniela in her covered arms, the girl's body limp and burned over most of her icy skin. Daniela had been tortured, Myst realized, by this animal at her feet, by his very touch. The familiar rage erupted within her. Control it... Just a moment longer... \"And I'll be yours, only yours,\" she somehow purred.</p><p>When Lucia signaled, Myst nodded, extracting her foot, his lips producing a loud sucking sound that made her cringe. She tapped the man's bulbous nose with her big toe. In a tone dripping with sexuality, she said, \"You probably won't live through what I'm about to do\" - her voice had gone to a breathy whisper belying the words and confusing the man - \"but if you survive, learn and tell others that you should never\" - a tap with the toe - \"ever\" - tap - \"harm a Valkyrie.\"</p><p>Then she punted him across the room -</p> <p>Another scene began - the one with the raiding party, the one he'd always dreaded seeing the most. The men were nearing; he could hear her feigning heavy breathing, a stumble. All a part of the game.</p><p>One tackled her hard into the snow. The others pinned her arms. She was pretending fear, weakly struggling. While others cheered, a burly Viking knelt between her legs and told her, \"I hope you live longer than the last ones did.\"</p><p>Lightning streaked behind the man's head and the wind seemed to follow it - a few looked around uneasily with nervous laughter.</p><p>\"The last ones' names were Angritte and her daughter Carin,\" Myst informed him. Carin, so young, simple in the mind, had for some reason immediately recognized Myst for what she was. \"Swan maiden,\" the girl had whispered, uttering one of the Valkyries' more beautiful names.</p><p>Both the careless mother and her innocent daughter had been killed, smothered under the weight of these men as they brutalized them. \"I will live longer than them - and you.\" A change came over her, like a bloodlust, thoughts turned feral, the rage...</p><p>The frown on the attacker's face was the last expression he'd ever make. She rose up, easily shaking off the powerful men. She had loved Carin for her very innocence and joy, and these beasts had stolen these things from Myst, from the world, which was poorer from the loss...</p> <p>As lightning painted the sky, she mindlessly slashed her way through them. When all but one were felled, she told the one she allowed to live, \"Any time you think to hunt down a woman or to force her, wonder if she's not like me. I've spared you, but my sisters would unman you with a flick of their claws, their wrath unimaginable.\" She wiped her arm over her face, found it was wet.</p><p>She crouched over the man and could see her reflection in his eyes. \"There are thousands of us out there. Lining these coasts, waiting.\" Her eyes were silver, and blood marked the side of her face. He was frozen in terror. \"And I'm the gentle one.\"</p><p>She turned from him, dusting off her hands and said to herself, \"This is how rumors get started.\" But her swagger disappeared at the site of the rough gravestones atop the hill by the sea - Carin's beside her mother's. \"You stupid human,\" she hissed at the mother's. \"I've cursed you to your hell.\"</p><p>\"Why did you disobey me? I told you to take Carin inland in the spring when they come down. Stay far from the coasts,\" she said, her voice breaking on a sob as she flew to the girl's tombstone. She curled up against it, her face resting against the crude inscription. Then she hit it, her blood trickling along the new jagged fracture.</p><p>She stayed like that, unmoving for days, as villagers held a vigil at the base of the hill, offering up tributes fit for a goddess for her protection and benevolence. Wroth shuddered at the physical pain Myst didn't seem to feel - her hand frozen in blood to the stone, her muscles knotted, and skin raw from cold. On the third day, her sister N&amp;iuml;x found her and lifted her from the snow as easily as a pillow. Tears were ice on her face.</p><p>\"Shhh, Myst,\" N&amp;iuml;x murmured. \"We've already heard the tales of your revenge. They'll never harm another maid. In fact, I doubt that league of men will ever trouble this coast again.\"</p><p>\"But...the girl,\" Myst whispered, awash in confusion, tears streaming anew, \"is simply gone.\" The last word was a sob.</p><p>\"Yes, dearling,\" N&amp;iuml;x said. \"Never to return.\"</p> <p>Myst was weeping. \"But...but it hurts when they die.\"</p><p>N&amp;iuml;x pressed her lips to Myst's forehead, murmuring, \"And they always do.\"</p><p>Wroth's chest ached with Myst's sorrow as no physical wound had ever hurt him. She'd run from the men because the ones who would chase a \"helpless\" maiden were the ones who would die. Wroth wanted to stay with that memory, to make sure she recovered from this hellish pain, but another familiar dream began. Snow outside, packed so high it covered half of the window. The meeting around the hearth. \"...teach her to be all that was good and honorable about the Valkyrie...\"</p><p>Myst closed her eyes against a memory - the one he'd struggled to see - that she could never erase, never alleviate. She remembered and she vowed again that she would be worthy.</p><p>She was in the middle of her first field of battle, there as a chooser of the slain. She'd been sent young, barely fifteen, because she'd been born of a brave Pict who'd plunged a dagger into her own heart. Myst was supposed to be like that.</p><p>But she wasn't. Not yet. She was sick with terror.</p><p>One hundred thousand men, cut to pieces, blood like a river up to her ankles. \"They were all brave,\" she said, peering around her, dizzily turning in circles as electricity rolled from her in waves. Sounding lost, she whispered, \"How am I to choose? A beggar handing out coins...\" She began trembling uncontrollably with fear.</p><p>He wanted to be there to protect her, comfort her.</p><p>Another memory. New to him. Could he withstand another?</p><p>Myst ran to him when he returned to Blachmount from some errand, and as he'd squeezed her up into his arms and kissed her, she'd thought, \"I just ran to get in his arms. I just...Whoa. Whoa. Uhn-uh.\"</p><p>Wroth remembered she'd clambered down from him, looking flushed and panicky, joking about the Xbox, saying she felt \"a little like Bobby Brown\" for introducing him to the addictive game.</p><p>Now he knew why she'd panicked. Myst, along with all her sisters, had been taught that she would know her true partner when he opened his arms and she realized she'd forever run to get within them.</p><p>Wroth woke to his own yelling, thrashing over, clutching for her. Everything he'd thought about her was wrong. His chest hurt with the loss and anguish she'd experienced. \"You're free. Myst...\"</p><p>The bed was empty.</p><p>He shot to his feet, scanning the room, finding a bloody note on the table by the bed, under the cross. A heart for a heart...</p><p>Dread settled over him, numbing his mind, even as panic was sharp, stabbing at his body like a blade. He half-staggered, half-traced into the study, eyes falling on the safe wall. To his horror, he saw no safe, but as he neared, growing more sickened, he found blood on the stone that had housed it, clawed away in a frenzy. She'd dug through it to get to her chain, to her freedom.</p><p>Wroth fell to his knees, head bowed as a guttural sound of pain erupted from his chest. At the first opportunity, he'd offered her torture, only to follow it by stealing her freedom from her.</p><p>And then...</p><p>A heart for a heart. She'd made his beat. Had he broken hers?</p><p>He'd lost her. And he'd deserved to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The coven met around the safe, all of them waiting for Regin to swing the Sword of Woden to cut through the vampire's mojo-protected metal. Woden's sword cut through anything. Well, anything but the chain, as Myst and Regin could attest to after one scary experiment that nearly made Myst a good deal shorter.</p><p>The sisters were still debating who would accept the responsibility of the chain because Myst was no longer allowed, not as long as Wroth lived. But no one wanted the thing, and killing Wroth seemed a bingo solution to them.</p><p>Regin raised the sword above her, and even the wraiths flying outside that they'd hired to guard Val Hall against intruders - like Wroth - seemed to slow their circling to catch a window. With a dramatic breath, Regin sliced through the safe as easily as powder, though sparks flew. When all was clear, Myst wearily reached forward to collect her torment.</p><p>She frowned to find a small, ornate box of wood inside as well. All of her sisters seemed to realize at the same time that it was about the size of those velvet jewelry boxes - because the room went quiet, then they dove for it like a wedding bouquet. \"Shiny, in the box, shiny,\" one of the younger sisters whimpered. Myst was closest and snagged it and even if she hadn't been able to she would've bitch-slapped anyone who made a run with it.</p> <p>\"Open it, then,\" Regin cried, out of breath.</p><p>Myst did.</p><p>And light seemed to blaze from it.</p><p>\"Great Freya,\" someone breathed. \"Diamond. Big. Glittery.\"</p><p>Another said, \"That's not a rock, that's real estate. When did vampires start coming off with the bling? No. Really.\"</p> <p>Myst closed her fingers over what had to be a perfect four-karat diamond, so she could look at the actual ring. It was inscribed with her name.</p><p>Suddenly feeling exhausted, she rose, dragging her feet to her room away from the excitement, though they booed her for taking away \"My Precious.\" The chain was heavy and cold in her other hand. N&amp;iuml;x followed her up. She was a good listener and even though her lucidity came in erratic spurts, she'd been a boon to talk to.</p><p>Myst eyed her sister as she raised the ring. \"You didn't look surprised about this.\" N&amp;iuml;x's pupils enlarged at it before Myst tucked it and the chain in her jewelry case. \"You knew what was in the safe?\"</p><p>\"I'm not predeterminationally-abled for nothing,\" she said as she dug two bottles of fingernail polish and some cotton from her pocket. She hopped on the bed and set them up to paint each other's toenails, patting the bed for Myst to come sit. Myst had missed this little ritual, but she had no interest just now. Instead she crossed to the window and said, \"N&amp;iuml;x, why didn't you come for me? You knew how to find me.\"</p><p>\"You were fated to spend that time with Wroth.\"</p><p>Wroth. Who had found her so lacking that he'd needed to change her.</p> <p>What had he seen that disgusted him so much? She'd wracked her brain for the last three days, but found nothing she'd be truly ashamed of, certainly nothing that would make a vampire lose his freaking mind. \"He's out there right now.\" Myst stared out into the fog-shrouded yard. \"Watching this house, waiting for a chance to take me again. But if I stay behind the wraiths, then I'm just as contained here as I was there.\"</p><p>\"Without the weakness of the chain, you could fight him, yes?\" N&amp;iuml;x asked. \"I even imagine kicking some vampire tail might be good for you.\"</p><p>A few moments later, Regin popped her head in. \"Cara and I are going out to canoodle ghouls. You in?\"</p><p>Myst frowned, then turned to N&amp;iuml;x. \"Any reason I shouldn't?\"</p><p>She bit her lip, staring at the ceiling as if trying to recall a memory when it was just the opposite. \"No, I think it would be just the thing.\"</p><p>Myst nodded slowly. \"Yeah, I think I could use a little goo.\"</p><p>Regin beamed, then bounded across the landing to scream downstairs, \"Myst is back online!\"</p><p>Ready to fight, needing it, she quickly dressed as N&amp;iuml;x did a buff-job on her neglected sword. Myst had no doubt Wroth would be out there watching her and that she would sense him every hour. How long would he follow his \"tarnished\" Bride? she wondered, but she knew the answer, had felt the wild emotion roiling within him. He'd follow forever.</p> <p>Wroth crept among the shadows as Myst split up from Regin and Cara at a sprawling cemetery. Myst easily vaulted to the top of a mausoleum to observe the field below her, where ghouls snapped and clashed against each other or lazed in the dampness of the night.</p><p>He was spellbound, watching as she rested on the edge of the roof, perched down as a gargoyle might. Her eyes swirled silver and her claws curled into the clay tile. She was clearly eager for the kill but waited, studying them. This was the first time he'd seen her in days.</p><p>After Wroth had found her gone from Blachmount, he'd traced to her eerie home, but found it had just gotten eerier. Ghostly, howling creatures in ragged red cloth circled the manor like a tornado. He'd shrugged and traced to her room, but the things caught him. They had a grip he couldn't have imagined, and when he'd finally landed, his lesson had been learned. He rotated his arm, pleased he'd finally been able to force it back into its socket.</p><p>Those beings circled the house to protect it, and did so without cease and without fail, as he could well attest to. But the sentinel that protected Myst from threats like Ivo kept Wroth from her as well. Myst stayed behind them for night upon night, yet now he'd finally found her outside of their protection, no doubt waiting for her sisters to return so they could attack.</p><p>But dawn was coming soon and he needed to -</p><p>She leapt from the roof, drawing her sword from her back sheath as she dropped into the middle of the group of ghouls. There were at least fifty of them.</p><p>\"What the fuck are you doing?\" he bellowed, tracing to her side, unsheathing his own sword.</p><p>\"This isn't happening,\" she said to herself. \"You're not going to ruin my personal life and my fast-track career, Wroth.\"</p><p>\"But in the middle?\"</p><p>\"I'm enraged enough to do this. You have no idea\" - she struck out, slicing a ghoul from crotch to neck - \"how much I need this.\"</p><p>\"I do have an idea.\" A perfect one. He'd felt her rage and her need to fight from inside him. And yet he'd told her that as his wife she would never again fight.</p><p>\"You had better leave, because once I finish with them, I won't stop there.\"</p><p>\"I deserve your anger. I've wronged you and seek to make amends.\" He wasn't optimistic about his chances for that. She couldn't be all things to him already and then forgiving on top of that.</p><p>\"You think?\" When one ghoul's claw came close to his neck, he leapt back and she snapped, \"Don't let them scratch you!\"</p><p>\"Concerned for me, Myst?\" He didn't dare hope.</p><p>\"Of course I don't want you to get scratched.\" She eyed him. \"Vampires are easier to kill.\"</p><p>\"If I help you will you speak with me?\"</p><p>\"Don't need your help.\" And she didn't. She was merrily felling them one after another with a skill that awed him, her sword flying so fast it was barely visible.</p><p>\"Then you'll have to listen here,\" he grated, digging into the fight with her. \"I'd had five years of torment. I'd had a hell of wanting you and feared you would leave me at the first opportunity. Then I had dreams of your memories.\" These ghouls were irritating him, especially when they got between him and Myst while he was trying to convince her about something so critical. He began killing them more quickly. \"In each one you were evil...a seductress.\"</p><p>\"Still am, Wroth.\" She kicked a ghoul in the belly, freeing her sword from his chest.</p><p>\"No, you're not - \"</p><p>\"Duck!\" Her sword whistled over his head to decapitate a ghoul behind him. \"Yeah, well, as I recall, every sunset I asked you about your dreams and you brushed away my concerns.\"</p><p>He slew two with one sword thrust. \"I know. I should have asked you, because all those excruciating scenes of you...doing things were all out of context.\" When the largest ghoul out there howled and attacked him, Wroth stabbed the thing in the face, dropping it. She raised her eyebrows as if impressed, then scowled, remembering herself.</p><p>\"Myst, even then I was still falling for you.\"</p><p>That at least got her to pause. She blew a curl out of her eyes and just when he tensed to trace behind her, she took two hands and plunged her sword back along her side to kill the ghoul at her back.</p><p>Now he raised his eyebrows, but continued, \"I was angry when I saw your plan to trick me, but I finally understand that you rightly wanted your freedom back. I know what and who you are now. I saw all the memories, clearly at last. Not out of context.\" Goddamn it, more ghouls? \"Myst, can we not just speak about this? Away from here? Dawn nears and all I ask is for a chance to - \"</p><p>\"I gave you a chance. Freely. And you threw it away. You were about to brainwash me.\"</p><p>With one hand, he carved at a ghoul. \"I couldn't have lived with myself for that. I was wrong in many ways. I took your freedom when you needed it, and I hurt you just when you'd given yourself to me.\" Never had he regretted his actions so much.</p><p>He could have won her. A heart for a heart.</p><p>\"I wanted you so badly I resorted to anything I could and treated you ill when you didn't deserve it.\" He looked around. He'd been so intent on her, he'd scarcely noticed they'd cut such a swath that the others had run. \"If you give me a chance, I will make it up to you.\"</p><p>\"Oh, you got it, Wroth. Just let me go gift wrap my chain for you.\"</p><p>Wroth's eyes flickered black and his voice went low. \"I'd destroy the thing if I saw it.\"</p><p>His reaction surprised her. \"You'll certainly never get within arm's reach of it.\"</p><p>\"Myst, I felt your feelings for me, felt you struggling against them. I know you care for me.\" Long moments passed as they stared into each other's eyes.</p><p>She was weak, undeserving of her family, she knew, especially when her heart had leapt at the sight of him. But she shook her head. \"I can't. It's just too late. I have a lot to lose from this. I won't hurt my family by accepting you.\"</p><p>\"Kristoff seeks peace. He would fight the Horde with you. There would be no conflict with them. And I would...make an effort with your sisters, Myst. I know how important they are to you now. Believe me, I know.\"</p><p>She tapped her chin. \"So you can see why the idea of being forced to forget them made me cranky? Huh? And what if you saw more out of context? This would just happen again and again.\"</p><p>\"I would not drink from you.\"</p><p>She rolled her eyes. \"Yeah, just like I'm going to finally beat my Xbox addiction.\"</p><p>\"I'm pleased you feel the same about that option. I've already vowed never to use the information to harm the Valkyrie in any way. And I would have to tell you everything I was thinking as if you could read my mind as well. We are wed. We should know each other's secrets. Myst, we are kindred.\"</p><p>That made her hesitate. She'd felt that way too. Kindred.</p><p>What the hell was she thinking? He'd been about to brainwash her.</p><p>Making her voice firm, she said, \"Wroth, I'm sorry, but I could never trust you - \" Her words were cut off by a massive arm squeezing the breath from her throat. Not a ghoul. A demon? she thought wildly. A turned demon?</p><p>Wroth raised his sword, a savage, killing look in his eyes, but the arm tightened and he froze.</p><p>\"I wouldn't do that if I were you,\" Ivo said as he sauntered to the front of his gang of vampires. \"He'll snap her head right from her neck.\" Ivo's red gaze flickered over her. \"Now Myst, I thought I told you to wait in my dungeon.\" To the demon, he said, \"She's not the one.\"</p><p>He narrowed his eyes at Wroth. \"So you're the turned human who took my castle from me. Grenades? Guns? I'll kill you just for bastardizing our war.\" He glanced from Wroth to Myst, then back again, smiling to see Wroth's body seeming to vibrate with tension. \"I believe I have something he wants very badly indeed. I'll take his life in exchange.\"</p><p>The demon held her neck tight in his grip. She struggled against him until she could breathe, but he was unbelievably powerful. He was a turned demon, supposed to be a true myth. Apparently, the Horde had just upped their game. She'd known he'd been up to something...</p><p>Wroth could trace away in a heartbeat. They couldn't get him, unless they had her. Wroth's eyes were assessing, and she could see him studying the situation.</p><p>\"You walk into the sun, and I'll vow to the Lore that I'll free her. I'll hunt her again, but for this dawn I vow that she'll live. If you trace instead, I'll take her back to Helvita and dine on her perfect flesh every night for eternity.\"</p><p>\"Fight me, coward,\" Wroth bit out, his eyes black with rage, his muscles tense and knotted with it.</p><p>\"Why would I do that?\" Ivo sounded confused. \"Fight you for the cards I already hold?\"</p><p>Wroth was so big and powerful and yet that strength was useless to him now because they wouldn't fight. She could feel his frustration roiling from his body in waves.</p><p>\"You know we've got the power here. And you know my vow will compel me to release her.\"</p><p>She'd seen Wroth examining the situation, and she saw the exact moment that he determined his options. A calm seemed to wash over him.</p><p>\"Her life or yours.\"</p><p>One tight nod. \"Done.\" No hesitation. \"It is done.\"</p><p>\"Catch and release?\" Myst sneered to Ivo as he and his gang traced with her back into the shade to ready for the dawn. Birdsong had begun. \"Are you kidding me?\" To Wroth, she said, \"Are you eager to be ash?\"</p><p>The sunlight hit the tops of the trees, descending inch by torturing inch. He stood sure and so brave, as if he was proud to give his life for hers.</p><p>The morning breeze blew his hair from his face. His eyes were riveted to hers.</p><p>The sunlight was inches away from him, almost reaching the moss of the great oaks that buckled the feet of the mausoleums. Now she felt frustration as she'd never known. \"Wroth, don't be stupid.\"</p><p>In a low, steady tone, he said, \"I love you, Myst.\"</p><p>Feeling erupted in her chest to answer his words. Yes, he'd wronged her, and yes, he was a vampire, but...</p><p>The light hit him. He did not close his eyes to the extreme brightness that would have hurt even her eyes.</p><p>And she knew it was because he wanted to see her longer.</p><p>Soon the intensity of the sun was too great; he fell to his knees, his hands curling in agonizing pain. He opened his eyes once more. Glowing, bare. A last look.</p><p>He's going to die.</p><p>They always do.</p><p>Just...gone.</p><p>\"No.\" Saying the word out loud was like blasting a mountain to free an avalanche. An immortal like him didn't have to die. He could stay with her. \"No, no, no.\"</p><p>\"Milaya, don't fight,\" he bit out. \"It is done.\"</p><p>The demon holding her smelled of rotting flesh. The cowardly gang of vampires smirked at Wroth's death when Wroth was so much greater than they. How dare they?</p><p>She'd waited millennia to love - she'd waited for him - and they dared take him from her. From Myst the Coveted. She screamed long and loud with the shriek her kind was known for. The one that preceded death. The demon cursed and fought to snap her neck, but her muscles had lain in perfect concert and alignment to prevent it.</p><p>Wroth struggled toward her, trying to get to her even as he burned as though from the inside. Battling to save her as he died.</p><p>He was hers.</p><p>She freed her arms and raised them up. Lightning leapt to enter her grasp and filled her body. That they would dare...</p><p>The two holding her were blown from her, percussive thunder exploding them from within. Her hand shot down to collect one's sword just as he was cast into the light.</p><p>She struck out, slashing and clawing at the others with the rare gift of direct lightning from the sleeping ones pouring strength into her. She cut through the number, barely flinching when her arm was broken and the butt of a sword cracked her cheekbone. Don't look through that eye, switch hands. She cut a swath to Ivo, who alone remained.</p><p>\"And here I thought you were merely the pretty one.\" With a mock bow, the coward traced.</p><p>Arm shattered, face beaten to a pulp, she flew to Wroth. She vainly attempted to cover his body, dragging him into the cool shade even as she bit her wrist open for him to drink. He was unconscious, his body twisting in pain, his skin looking like lava burned within him.</p><p>\"Seems like we missed the party,\" Regin said as she and Cara strolled over to Myst. \"Why does Myst get to kill all the vampires? No. Really. This was just supposed to be ghouls.\"</p><p>\"Myst, what are you doing? We heard your scream and thought it was something important,\" Cara said. She waved a dismissive hand at Wroth's writhing form, clearly unable to comprehend why Myst was frantically dragging him with one arm while shoving her gashed wrist at his lips. \"The being dies. Leave him.\"</p><p>Regin added, \"Oh, for Freya's sake, Myst. He's a vampire. Let him fricassee.\"</p><p>Myst shrieked and snapped her teeth at her sisters. Then she screamed two words she'd never uttered in her entire life -</p><p>\"Help me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Wroth woke to wetness on his chest.</p><p>Her silky hair tumbled over his arm. When he opened his eyes he realized she was crying over him. Impossible. \"Myst?\" he rasped.</p><p>Her head shot up and she gave him a watery smile that quickly faded. She slapped him, a hard, cracking blow. Then she leapt on him, nuzzling, squeezing, as if she couldn't get close enough to him, as if she wanted in him.</p><p>\"Don't you ever do anything so stupid again.\" She slapped at his chest, which he was surprised to find was healed.</p> <p>He flexed and tensed his muscles throughout. He was bandaged in places, but he had all his limbs. This was good. Now if he could just get his wife to cease slapping him. \"If you do not stop, milaya, we will have words.\"</p><p>So she turned to kissing him again with whispers in his ear and tears dropping to his face, each one like a gift. \"You've been out for five nights. And you wouldn't wake the hell up.\"</p><p>\"Where are we?\"</p><p>\"In Val Hall.\"</p><p>He stiffened.</p> <p>\"No, you're safe.\" She leaned back and raised an eyebrow. \"Do you think I would just let my sisters fall on you like a carcass?\"</p><p>He winced at the image. \"Can't wait to meet them all. How did you get away?\"</p><p>\"Ivo traced, but Cara and Regin are on his trail.\"</p><p>\"I'm just glad I was there to save you,\" Wroth said solemnly, making her grin. \"Did you kill the turned demon?\"</p><p>\"The lightning and I did.\"</p><p>He remembered then. She'd been hit directly, hair whipping, eyes silver, the most awing sight he'd ever witnessed. \"I saw you get struck.\" His voice went low. \"You smiled.\"</p> <p>\"It feels good. It's very rare to get a direct hit - \"</p><p>Outside, something, some male, howled with fury. Wroth tensed to trace her away.</p><p>\"Oh, don't worry. Just another crazy day at the manor.\" She waved away his tension. \"A Lykae nabbed little Emmaline and took her back to Scotland - thinks she's his werewolf queen or something.\"</p><p>\"Werewolf queen?\"</p><p>\"Uh-huh. So Lucia trapped the Lykae's brother for leverage, but apparently he's proving most uncooperative. Anyway, if you knew Em you'd see how ridiculous the idea is. She's terrified of her own shadow, much less a roaring Lykae's unique...appetites.\"</p><p>He'd have to ask her about that later. \"She's the halfling - the one that's part vampire.\" When her brows drew together he rushed to assure her, \"I will never tell Kristoff about her, but I suspect that Ivo's searching for her.\"</p><p>\"They know. They'd already sent a retrieval party after her, and once they bring her back, she'll be safe here. The wraiths will shut out any threat.\" One flew by the window at that moment cackling to punctuate her statement.</p><p>He raised his eyebrows and when she grinned, he cupped her face with a bandaged hand. \"I love you.\"</p> <p>\"I know.\"</p><p>\"Could you...could you feel the same way? Before you answer, I want you to know that I meant what I said. I am sorry for forcing you to stay and for losing my head. I will always be shamed by my actions.\"</p><p>\"Wroth, I wanted to stay with you after, oh - about a day! I'd planned to play you, but realized early that I was falling in love with you.\"</p><p>He hadn't heard her correctly. Yes, she'd been upset over his injuries, but that didn't mean she loved him. \"You're saying you love me too?\"</p><p>She nibbled her lip and nodded. \"I'd always had a crush on you, you know.\"</p><p>When he frowned, she said, \"I used to adore hearing tales about you. And was saddened when we'd heard you'd died. Then to meet you in person?\" She blushed a little. \"I found that you lived up to my fantasy of you.\"</p><p>He was bewildered to hear this from his fierce, stunningly beautiful wife. In a gravelly voice, he spoke an utter understatement, \"That gives my ego a bit of a boost coming from you.\"</p><p>Her lips curled. \"Among other things, the uncommon gift of a direct strike of lightning, and the fact that you were the only man able to free me from my chain, and the fact that you were so sodding eager to give up your life for mine - though mind you, if you try that again, I'm going to kill you - have all convinced me that we should be together.\"</p><p>\"Always, Myst. I'd do it easily.\" When she was about to protest, he asked, \"What about your family? I will try if they will.\"</p><p>\"For all the reasons I just listed, a couple of my sisters have decided they'll try to overcome their repugnance of you.\"</p><p>He scowled at that. \"Big-minded of them.\"</p><p>\"Yet they want nothing to do with Kristoff or any among your order. You're the exception because they felt like they knew you as a human and because of what has happened between us. But if, say, your brother showed up here, they'd...it would be...bad.\"</p><p>\"I understand.\"</p><p>\"If you can make a genuine effort, I believe they will all come to accept you in time.\"</p><p>He wanted to be clear on this. \"Accept you as my wife and me as your husband?\" He wanted everything from her. Not just a few decades. He wanted eternity. And as long as she was in a giving mood...</p><p>She nodded, a smile playing about her pink lips. \"We still have a lot to muddle through, mind you. Our families and our factions, and who controls the remote, and living logistics - because Blachmount needs TLC and lightning rods in a bad way...But I suppose I have to take possession of you, since I've already taken possession of my engagement ring.\"</p><p>He grinned. \"You liked that, did you?\"</p><p>\"I couldn't take my eyes off of it,\" she said with a saucy smile.</p><p>He clasped her to him and pulled her close, knowing she craved being wrapped tight and secure in his arms as much as he needed her soft and trusting within them. \"I can't quite believe this. Even after everything?\" If she could give him another chance, Wroth thought they could do anything together.</p><p>\"Yes. But...\" She stroked the smooth backs of her claws down his arm. \"You'll have to spend eternity making it up to me.\"</p><p>He released her to lever himself above her, cupping the back of her neck. His gaze flickered over her face, then met the eyes of his wife as she smiled up at him. Feeling love for her so strong it hurt him, his voice ragged with it, he rasped, \"Milaya, it is done.\" </p> </body></html>"]