["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>MAGIC BITES</p><p>I was in Unicorn Lane at night. A bad time to be in a bad place. Anything can happen there, but it's never something good.</p><p>No one was in charge of Unicorn Lane. None of Atlanta's many supernatural factions could claim dominion over it. It was populated by those once human and those who had never been, and they hid in the dark ruins, feeding on each other and making visitors unwelcome. Thus the Unicorn Lane is recognized by all as neutral territory, a no-man's land you entered at your own risk. The scared hovered at the edge the stupid died not far from it. I was here to meet someone, and if she made it far enough to find me, I would know she was neither.</p><p>I leaned back, feeling the cold stone of the abandoned building with my spine. Moonlight seeped through the holes in the roof, illuminating a gap in the wall. She would come through there. The night shadows hid me, so I'd have plenty of time to look her over.</p> <p>The Unicorn lay quiet. The night is never truly silent, but right now the monsters minded their manners. None of them knew why I was here, but all of them recognized they didn't want to be the reason for my visit.</p><p>What I did know of the merc came from Jim, my chief of security. He'd worked with her in the Mercenary Guild. That gave me pause. Jim was a cat and preferred the solitary hunt. It was rare for him to let anyone outside the Pack watch his back. He said she was fast, for a human, and good with a blade. He also said she had a big mouth and fought when she should run. None of this endeared her to me. Mercs were bottom feeders. No honor, no integrity, no loyalty. They didn't stand for anything. I wasn't in the habit of personally meeting low life thugs who wanted to be tough guys. I had people for that.</p><p>However, I was willing to take a chance this time, since Jim had vouched for her. He'd seen her come out of situations that should have ended her. Jim didn't believe all of her cards were on that table. She was likely hiding strong magic, which meant she came with baggage. That was fine if it made her useful. Something was hunting my people, the Free People of Atlanta. We had the best trackers in the City, but we had yet to catch it.</p><p>Normally we solved our own problems. We kept it in the family. Humans saw us as freaks, and I saw no need to give them more ammunition. But the murders had been too numerous and some of the vampires were destroyed as well, no big loss, and the Order of Merciful Aid got involved. The only human I trusted in that organization of fanatics, a Knight Diviner of the Order, had been investigating the case and killed for it, presumably by the same creature. I have little love and less use for humans, but Greg Feldman had died helping us and that counted for something. Incredibly this merc was his estranged ward and had inherited the case along with a temporary position with the Order.</p><p>I would find this thing that murdered my people. I would stand over it and taste his blood as the light faded from its eyes. Nothing would change that. But with Order's help, I would find it faster. If Greg's ward was looking for revenge, all the better. It would mean she was willing to take risks that could help me get my teeth on this creature's throat.</p> <p>I smelled her, before I heard her approach Jim outside. The night wind brought a mixture of scents to my tongue. Leather – old boots. A touch of sweat, clean and unmistakably feminine. A mix of rosemary, chamomile, lavender – shampoo, an herbal fragrance foreign to this dank and moldy place, nice. A very faint trace of cloves and steel – oil for the sword.</p><p>She was quiet, nearly soundless for a human. Interesting. What was she?</p><p>Finally the faint sound of a step. Come closer, little mouse, you're almost there.</p><p>The night shadows swallowed me. She would come in right across from me – it was the only way – and I would see her before she saw me, if I choose to let myself be seen. Perhaps if she looked as good as she smelled I would give her that privilege.</p><p>A slight scratch of a foot sliding on stone. I leaned forward to get a better look.</p><p>Moonlight from gaps in the ceiling illuminated the scene as she put first a foot through the gap. She came in sideways, slowly and carefully, carrying a sword. An odd looking blade, pale. She held it like she what she was doing, but her faith in its ability to protect her was misplaced. The tips of my claws itched the inside of my skin, wanting to come out. She had one sword, but I had ten claws.</p> <p>She scanned the area, stopped to listen, then moved forward stealthily like a dancer, hiding in the nearest shadow before I caught a glimpse of her face. The draft brought another whiff of her scent. She paused and I knew she was peering into the gloom, vainly trying to find me. I liked the way she moved, balanced and light, neither tiptoeing nor stiff. Nice body. Come to me mouse, don't be scared.</p><p>She took a step forward and I saw her in profile. Exotic, strong features, not pretty, but I liked what I saw.</p><p>I drew my fingers through the dirt, scraping the floor a little.</p><p>She pivoted on one foot, turning her sword. Fast. Her head snapped toward me. Dark eyes stared straight at me. I detected no fear. Instead it was a look of challenge. So not a mouse after all, but something more. This could be interesting. I'd let her dance in the dirt a bit more. She was fun to watch.</p><p>She crouched with her hand out. What the hell was she doing...</p><p>\"Here, kitty, kitty, kitty.\"</p><p>Oh my God, she was retarded and I was going to kill Jim.</p><p>She blinked and stared at me. She'd seen my eyes glow.</p> <p>I let go, shifting in the dark into my true form in the dark. If you want a Kitty, little girl, I'll give you one you'll never forget.</p><p>I stepped into the moonlight. She froze.</p><p>That's right. No sudden moves. I padded toward her slowly and circled her allowing her take it all in. Do you like the kitty now? I could smell her surprise and fear. Our gazes met. Her eyes went wide and then she fell on her ass.</p><p>Heh. A bow would have been sufficient.</p><p>I retreated into the shadows of the corner. I was not sure what affect a laughing lion would have on her and I did not want her to faint. I reverted to human form and changed into sweats and a tee. Any other time, I might have walked out to her as is, but this was a business meeting. Best to keep it that way.</p><p>I gave her a few seconds to recover. She was dusting off her jeans.</p><p>\"Kitty, Kitty?\"</p><p>She jumped a bit. Smart girl. Most shapeshifters can't switch back and forth like that. I'm not most shapeshifters. I am the Beast Lord.</p><p>\"Yeah,\" she managed weakly. \"You caught me by unprepared. Next time I'll bring cream and catnip toys.\"</p><p>Toys wouldn't be necessary. \"There may not be a next time.\"</p><p>I stepped out and she turned toward me. She seemed almost relieved that I wasn't naked. Most women had the opposite reaction. Her loss.</p><p>I hit her with my hard stare. She met my gaze and did not look away or cringe. Points for her. She was tall for a woman, maybe two or three inches shorter than me. Young, maybe early or mid-twenties. She looked strong and lithe, like an athlete or martial artist.</p><p>\"What kind of woman greets the Beast Lord with 'here, kitty kitty'?\"</p><p>\"One of a kind.\"</p><p>She continued to hold my stare. She may not have been as funny as she thought she was, but she wasn't a coward. Good. I could work with brave.</p><p>I took a step toward her. \"I am the Lord of the Free People.\"</p><p>MAGIC BURNS</p><p>When I broke through Kate's front door, the first things I smelled were blood and poison. Then smoke and something else, salty, bitter. Like a fish tank. What the hell had happened here?</p><p>The little girl was hysterical, crying that Kate was dying. She was almost right. I expected it to be bad, but the sight of her stopped me cold. Kate lay on her stomach in her bathroom, her pale skin in stark contrast to the dark blood that seemed to be everywhere. Her back had been ripped open by something with savage strength. In that moment I realized I could lose her. I'd seen humans die from less.</p><p>The Keep was out of the question. Too far. That's why I'd ordered Doolittle to the South East Office before I went to rescue the idiot.</p><p>I scooped her up off the floor and ran. Her skin was on fire, and I ran as fast as I could. Her heartbeat was fading and I had this dumb idea that if I let her go of her, she would die. I had to get her to Doolittle</p><p>I burst into the office with Kate still in my arms, roaring for Doolitte. There was little need, he was standing by. I lowered her gently onto a waiting gurney and fixed him with a stare.</p><p>\"Can you save her?\"</p><p>He took in her condition with a glance. \"My Lord, her wounds are extensive and her kind are..\"</p><p>I cut him off, \"Try.\"</p><p>He rushed off with her and all I could do was stand there and watch her go.</p><p>I found my way to the study, pulled a battered copy of White's Once and Future King off the shelf and ordered a beer to be brought to me. Ten pages in I knew it was useless. I closed my eyes, leaned back and waited for the call.</p><p>Sometime later phone rang and Doolittle informed me that she seemed to be stabilizing. He had purged her system of the poison, and her fever was coming down.</p><p>Somebody once said it's better to be lucky than good. He or she must have had Kate in mind. With the flare so strong, the good doctor's already considerable medmage powers had been augmented enough to heal the slashes on her back and neutralize the poison coursing through her body. I don't know why but when he told me that she would, in all likelihood, live, I let out a breath I hadn't known I was holding. I should have known she was too stubborn or stupid to die.</p><p>The real question was why had I been so worried. Why did I care so much if this idiot girl lived or died? She wasn't pack, not quite human but not one of us either. Whenever she blundered into my life waving that toothpick of hers around, I knew there would be trouble, the kind that usually ended with one or both of us badly wounded. She was arrogant, impulsive, and failed to recognize my authority or respect my position. She challenged me in front of my people. If anyone else ever....</p><p>But she was funny sometimes, and never boring. God, it would almost be worth it to see her face when she realized that I had saved her ass again.</p><p>Actually it was quite a nice ass, come to think of it. In fact, my memory of the ass and its owner seemed to be remarkably clear. I got up. That way lay dragons. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>What I needed was a shower and some shut eye. I'd be damned if she saw me looking tired or disheveled. When she finally did wake up, feeling like half a mile of bad road, I wanted to stroll in looking fresh and clean as if I hadn't a care in the world</p><p>I needn't have worried. Almost a day passed before Doolittle called to tell me that his patient seemed to be coming around.</p><p>\"How will she feel?\"</p> <p>\"Sore as hell and probably....\"</p><p>\"Hungry\" I guessed.</p><p>\"Yes I should think so. Accelerated healing burns the body's resources. I do belive she will be ravenous.\"</p><p>I smiled, \"Doctor, do you think she might enjoy some nice hot chicken soup?\"</p><p>There was a tiny pause before Doolittle answered. \"My Lord I think she should like that very much.\"</p> <p>Oh yes, she would sit in bed and eat the soup I got for her like a good little girl. The best thing would be watching her gulp it down clueless as usual to the consequences of her actions.</p><p>As I strode into the room, with one of the cooks behind me carrying the soup on a tray, I caught the tail end of a conversation.</p><p>\"How did I get here?\"</p><p>\"His Majesty carried you.\"</p><p>\"Is he burned to a crisp or sliced in half this time?\"</p><p>Her concern was touching. \"Neither,\" I answered.</p> <p>Her eyes grew wide. I can walk quietly if I wish to, I am a cat after all. I gestured for the cook to put the soup down. Doolittle bowed and both he and the cook left the room.</p><p>I took a moment to look Kate over. I had not seen her since bringing her in. Her appearence had improved, but not much. Her face was bloodless. Dark circles puffed under her eyes, and the skin stretched tight over her face. She looked like a ghost of herself. Almost frail.</p><p>I was not used to seeing her like this. It scared me a little bit.</p><p>\"You look like shit.\" Honesty is important in any relationship.</p><p>She cleared her throat. \"Thanks, I try.\"</p><p>Frail and weak, but still Kate.</p><p>I picked up a bowl soup and thought about what it would mean here in this place if I offered it to her and she accepted. She might not know what it meant, but I would. This was it. Nothing ventured...</p><p>I held the bowl out to her so she could smell it. Before I could warn her, she grasped it with both hands, and burned herself.</p> <p>\"Idiot.\" I sat the soup in front of her with a spoon.</p><p>\"Thanks.\"</p><p>She actually thanked me. This was going well. I had half expected her to throw the soup at me.</p><p>Kate grabbed the spoon and went at it. That's right, eat it.</p><p>\"Did you get the surveys? They were...\"</p><p>\"On the dresser. Shut up and eat your soup.\"</p><p>I pulled up Doolittle's chair and watched her while she ate. This was nice, we were together and so far had not tried to kill each other. Maybe if I could just keep her quiet... Maybe if I kept feeding her.</p><p>\"So that's the secret.\"</p><p>She looked slightly shocked. No witty comeback. Maybe I scared her. Naw not the ass-kicker.</p><p>\"You okay? Gone a bit pale there.\"</p><p>\"Secret to what?\"</p><p>\"Secret to shutting you up.\" I smiled. \"All I have to do is beat you till you half dead, then give you chicken soup and blessed silence.\"</p><p>She made a face and went back to the soup.</p><p>\"What did you think I meant?\"</p><p>\"I don't know. The ways of the Beast Lord are a mystery to a humble merc like me.\"</p><p>\"You don't do humble.\" Smart ass was more her speed.</p><p>Her bowl was empty, so I handed her another. This time our fingers brushed together. I held still and looked into her eyes. Our faces were very close. Her lips parted slightly. I leaned in toward her and ... She grabbed the bowl pulled away and it was as if a spell was broken. Funny little mouse.</p><p>\"Why did you save me?\"</p><p>\"I picked up a phone and there was a hysterical child on the other end, crying that you were dying and that the undead were coming. I thought it might be an interesting conclusion to a boring evening.\" That and I fucking hate the undead.</p><p>She looked puzzled. \"How did Julie know to call here?\"</p><p>\"Hit redial from what I understand. Smart kid. You're going to tell me what you've blundered into.\" I wasn't asking. My people had crawled over her place, sniffing every inch. There had been three assailants, none human. No bodies, but some evidence of a fire and dents and stains on the wall. The best they could figure out, she'd killed something in the kitchen, set the second attacke on fire, and rammed the third one into the wall. Derek had brought Julie to the Keep. He was working on her, but she was a street kid. She trusted no one and so far didn't talk.</p><p>Dark eyes looked at me from Kate's pale face. \"No.\"</p><p>Maybe she had misunderstood. She had been through a lot.</p><p>\"No?\" Give her a chance.</p><p>\"No.\"</p><p>God fucking damnit, not this shit again. I crossed my arms and gave her my displeased look and meant it. She stared back. This was too much.</p><p>I leaned back. \"You know what I like about you? You have know sense. You sit here in my house, you can barely pick up a spoon and you're telling me 'no'. You'd pull on Death's whiskers if you could reach them.\" She did not know it, but at this moment she was close. Damn close. \"I'll ask one more time, what were you doing?\"</p><p>\"I see. I retrieve the surveys the Pack let slip through its fingers, and in return you bring me here against my will, interrogate me, and threaten me with bodily harm. I'm sure the Order will be amused to learn the Pack kidnapped its representative.\"</p><p>\"Aha. Who is going to tell them?\" Yes, the Pack greatly regrets being unable to save the Orders representative, her injuries were extensive. It would be so easy. Windpibe and larynx crushed? Like someone strangled her? You don't say.</p><p>She looked at me as if to gauge my intent. Would I do it?</p><p>Try me.</p><p>\"I guess I'll just have to kick your ass and break out of here.\"</p><p>Hahaha. Maybe if I had a seizure or a blood vessel burst in my brain.</p><p>She shot me her crazy smile.</p><p>I showed her the edge of my teeth. \"In your dreams.\"</p><p>\"We've never had our rematch. I might win.\"</p><p>Yeah and on that day we'd get together with the People and put on a show in the old barn.</p><p>She grimaced. \"Bathroom?\"</p><p>I gestured toward it and she carefully got out of bed, like she was not sure if she could stand on her own. I almost felt sorry for her. Then I saw the rest of her and could not help smiling.</p><p>\"What's so funny?\" she demanded.</p><p>\"Your panties have a bow.\"</p><p>She looked down. She wore a little tank top and blue panties with a silky bow. Her face went white, then red. Hahaha.</p><p>\"What's wrong with bows?\"</p><p>\"Nothing, I expected barbed wire or something with chains.\"</p><p>She stuck her nose in the air. \"I'm secure enough in myself to wear panties with bows on them. Besides they're comfy and soft.\"</p><p>You don't say. \"I bet.\"</p><p>Big eyes again. She hesitated. \"I don't suppose you'd mind giving me a bit of privacy for the trip.\"</p><p>And miss the panty parade? \"Not a chance.\"</p><p>She made a valiant effort to get out of bed but her legs betrayed her. I was barely able to catch her before she hit the floor. I held her tightly for a moment, enjoying the closeness. She smelled like Kate. I could get used to her scent.</p><p>\"Need some help ass-kicker?</p><p>\"I'm fine, thanks.\" She tensed, I held her for a moment longer and then released her. She carefully made her way to the closest door.</p><p>\"That is the closet.\" I pointed out helpfully.</p><p>She looked like she was going to cry and staggered into the bathroom.</p><p>MAGIC STRIKES</p><p>Nearly half a dozen of my best people had gone rogue, among them my Chief of Security, our Head of Medicine, a young wolf, and the Scion of Clan Bouda. They had broken my first law. They had chosen to participate in the Midnight Games and had refused direct orders to appear before me and explain their actions.</p><p>I had never before questioned Jim's loyalty; he was Alpha of Clan Cat and for all intents and purposes my Second. Doolittle despised pack politics and had saved my life more often than I liked to think about. Derek had become a member of the Pack after his father had gone Loup and slaughtered his mother and sisters. When this happens, and it happens more often than humans think, SOP is to kill male survivors, especially adolescents as they were believed to have a genetic predisposition to going Loup. Jim had been in favor of putting Derek down. I had overruled him, which I rarely do. The kid had been through a lot and I decided he deserved a chance. Had I made a mistake? That Raphael was involved in this surprised me not at all. If Bea's little peacock thought I wouldn't mess up his pretty face he was as dumb as those girls who followed him around like dogs in heat.</p><p>What could possibly cause a cat, a wolf, a hyena, and a middle-aged medmage honey badger to risk my wrath? I couldn't figure out the what or the why, but I had a damn good idea of the who. Kate Daniels, professional fuck-up. Kate worked for the Order, humans who despised my kind. Yeah, she was employed by the Order and did jobs for the Guild, but I swear her mission in life was to make mine miserable. She defied me publicly, challenged me privately, and God help me, she bounced around inside my head like a bull in a china shop.</p><p>As soon as I had gotten wind that something was amiss, I had called her. In her usual charming and diplomatic way she had both denied any and all knowledge as well as politely declining to assist me in any way. Of course, she was in this mess up to that nice ass of hers. Later as I started to put the pieces together, she had called to tell me that she and Jim were running off together and even offered me an erotic dinner if I could find them in three days. Kate short-circuits my brain. In my head we always have these clear coherent exchanges, but once we meet, what comes out it is, \"Kate, do what I say or I'll kill you.\" Her default reply is, \"Fuck you!\" and we go downhill from there.</p><p>Once I shook the idea of naked Kate out of my head, the big picture made no sense. Jim and Kate had worked together on odd jobs for the Guild but there had never been a hint of anything more than a friendship built on mutual respect. I knew for a fact that Jim liked that half-blind vegetarian tiger. Who the hell ever heard of such a thing? She gave the big cats a bad name and she kept trying to kill herself by driving too fast. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jim had a high opinion of Kate's abilities, which was a rare thing. Kate was skilled with that sword of hers, almost as good as she thought she was. I kept trying to puzzle it out: even if they had decided to run away together, how did the Games figure into it? I knew Kate would fight for the fun of it, or the money. Did they need the money for their new life together? How had they gotten the others involved? Derek worked for Jim, almost worshiped Kate. If they had used him.... That I could not forgive.</p><p>I also knew that Raphael's mate was Kate's best friend. He would do anything for her or just to piss me off. Perhaps he thought his Mommy could intervene on his behalf if he got caught. I had almost hoped B did interfere and got tangled up in it. After all she has been a thorn in my paw as long as I can remember. It would feel good to remove it. Since Mahon was not mixed up in this nonsense, I could give him that honor. I know he would enjoy it and faithfulness should not go unrewarded. None of this of course explained Doolittle's involvement. Had they forced him to help? Possibly, but he is a tough old bastard and you don't cross a badger without a good reason.</p><p>I had to know, and so I tracked Kate to one of Jim's safe houses. She was alone but I could smell the others, they had been there recently. Derek was hurt, I could sense it. That had driven me over the edge and I had leaped at her without looking. Right into a Loup cage.</p> <p>When I had stopped roaring, Kate explained it all. I now knew about the Wolf Diamond and the Rakshasas. I understood why Kate felt compelled to do these things. It made sense; she was trying to help her friends and the Pack. What I could not condone or comprehend was how she did these things. Some people go about things in a roundabout way. Kate blows things up and then tries to glue the pieces together with spit. If she had only come to me in the beginning, but now it might be too late.</p><p>As I sat at the bottom of the Loupe cage, waiting for the skin on my palms to heal enough to try the silver bars again, I slowed my breathing and went over my options. None were great. I could wait for them to let me out of this cage or for someone else to find me. No, that was unacceptable.</p><p>I am the Beastlord, I will not be crated and let out like a puppy.</p><p>I could break out of this, but it would hurt, a lot, and in that rage I would slaughter not only Kate and cohorts but anyone who tried to stop me. As angry as I was, I had to admit I did not want to do that either.</p><p>By now they would already be in the Arena. Short of slaughtering the entire Red Guard, I could not get in there to stop them before the entire audience of sick fucks saw members of the Pack take part in the Games. After that too many people would know and I could not let that pass. If they survived I would have to kill them. By myself in front of the rest of the Pack.</p> <p>Kate had finished her spiel and left. I forced myself to relax and try to find a way out of this mess. I assumed I was alone with my thoughts when I heard something move down the hallway. The smell was familiar but I could not place it, definitely not Kate but...</p><p>Julie. Her kitten. All I had to do was to convince her to let me out.</p><p>I closed my eyes and listened to her sneaking through the house. Close by, almost close enough. Here, kitty, kitty, kitty.</p><p>I closed my eyes and concentrated on the sound of the footsteps approaching my cage. Julie showed potential, moving well for a human child, quiet and careful despite the dim and unfamiliar surroundings. Kate would have stormed into the dark stabbing at shadows. I wondered briefly where or from whom Julie had learned to sneak. She had not survived on the streets by being slow or stupid. Derek seemed fond of her and it was obvious she was smitten with the kid. To her, he was older and good looking.</p><p>Damaged Derek, laying somewhere now with his good-looking young face forever ruined. Would she even look at him the same way?</p><p>A fresh wave of rage and grief almost overcame me, and I had to fight the urge to roar in frustration. No, hold it together. There will be a time for fur and fury, for the rending of flesh and the taste of blood on the tongue. Not the now. Take a deep breath, keep it together. Don't scare the kitten. Convince her to let you go.</p> <p>Come closer, Julie, that's it. You're almost there.</p><p>When she was near enough that I could hear her breathing, I called out to her in my best not crazy voice, \"Ok, Kate, you win, I could not break out, let me go, and I will give you that hundred bucks I owe you.\" Kids liked money right?</p><p>She walked into the room and sat on the floor. A tiny thing, skin and bones, narrow face, pale hair.</p><p>\"Nice try. You know I am not her, and you should know she's gone now where you can't get her.\"</p><p>Smart girl. \"Look kid, I don't want to get anybody. Just let me out of here please.\"</p><p>\"Julie. My name is Julie. Why?\"</p><p>\"Why what, Julie?\"</p><p>\"Why should I let you out?\"</p> <p>\"Because, I asked you nicely, and it would be better for you and your...\" – Psychotic guardian, terrible role model, bad influence- \"...Kate, if you release me.\"</p><p>\"Why do you do that?\"</p><p>Ok, I would play along but my patience was growing thin. \"Do what, exactly?\"</p><p>\"Bully people. Threaten them in that calm scary voice. They are all afraid of you.\"</p><p>Ridiculous. \"I don't threaten people. I am nice. I don't yell or scream.\" Keep going though and you will see how terrifying I can be.</p><p>\"Bullshit. They are all scared of you. Jim, Derek, even though he looks up to you. Kate too, and she is not afraid of anything.\"</p><p>That was interesting. \"First, watch your mouth, child. Second, what makes you think Kate is scared of me.\"</p><p>\"Screw you, I am not a child and you are not the boss of me. She said you broke into her house and stole things.\"</p><p>I crossed my arms on my chest. The last thing I wanted to do is to explain the mating rituals to a human girl. \"I am the Beast Lord, not a thief or burglar.\"</p><p>\"You took a pie. Why would you do that? Don't you have whatever, servants, who cook for you? Kate doesn't have a lot of money, why would you steal her food?\"</p><p>\"That is adult business; I will not explain myself to a child.\"</p><p>\"It was an asshole thing to do.\"</p><p>I choked back a snarl. \"Little girl, I am not going to warn you again, do not speak to me like that again...\"</p><p>\"Or what?\"</p><p>She had me there. As pissed off as I was, there were lines I would not cross. I would not harm a child. Ever.</p><p>I had to take a deep breath and step away from the ledge. Persuade her. Be reasonable. I could do reasonable.</p><p>\"Look, Julie, I am trying to be a nice guy. I've asked you nicely to release me. I could break out of here, but you would not like that, I promise you. That would be scary and loud, and nobody wants that sort of thing. This is the last time I am going to ask you. Please free me before I do get angry and do something we will both regret.\"</p><p>\"You're doing it right now. I'm not stupid. I know you are mad and I know that if I let you out you'll hurt me and try to make me tell you where Kate is.\"</p><p>\"No. I don't hurt little human kittens. Never have and never will. I give you my word.\"</p><p>She looked at me, thinking about it.</p><p>I leaned forward. \"I know where Kate is and why, but I don't know why she left me in this cage. I would not hurt her and she knows that.\"</p><p>I broke into her place, I kissed her, I've indulged her beyond what any of my people could get away with. Any sane woman at this point would know where we stood. I would never harm Kate. I might roar and threaten, and I might even pounce when occasion called for it, but she knew damn well that no violence would follow.</p><p>But then again, we were talking about Kate. Nothing was sane about Kate. That's why I was sitting in a loup cage, trying to reassure a frightened child that I would not rip her to pieces.</p><p>Julie drew her knees to her chest. The kid looked like she never ate. A stiff wind might knock her over. \"Kate thinks she has to save everybody, duh.\"</p><p>\"Who is she saving by keeping me in here, Julie?\"</p><p>\"Her friends and you from having to hurt them. She knows you will feel bad if you do.\"</p><p>\"What is that supposed to mean?\"</p><p>She paused for a moment and then continued slowly, \"She knows you're pissed and you will do your Lion King thing, punishing them for...\" She paused considering her words. \"Disobeying you. You will regret it when you calm down but then it will be too late. Dead is dead.\"</p><p>\"Why would she think that I would regret it?\" I was actually curious. Also what the hell was my \"Lion King thing?\"</p><p>\"Cause she likes you and believes that you're a good guy.\"</p><p>\"She said that?\" A good guy, huh.</p><p>\"No, but I can tell. The way she looks, when she talks about you.\"</p><p>Getting more interesting by the second. \"Looks like what?\"</p><p>\"She looked the way my mom used to when she talked about my dad. And they are dead now.\"</p><p>\"I know. I'm sorry.\"</p><p>\"Everybody always says that, but it doesn't mean anything. It's like saying hello or something.\"</p><p>\"It means something,\" I told her. \"My parents are dead too, and I was about your age when I lost them.\"</p><p>Julie looked like she was about to cry and waved her arms. \"Whatever. Look, I'm not stupid. I know things! Adult things.\"</p><p>\"Like what?\"</p><p>\"Like sex. I know about sex.\"</p><p>I just stared at her. I wasn't opening that can of worms.</p><p>\"The point is, she likes you. She likes you – likes you. She was going to kill Derek for you, if he went loup, so you didn't have to do it.\"</p><p>Now it started to make sense. So that was what all of this was about, Derek was Jim's responsibility and both Jim and Derek fucked up royally. Now Kate was caught up in this mess. In her mind she was as accountable for the boy as we were. Derek had come to her for help and she had been unable to refuse. Unfortunately it had all gone to hell as things tend to in our world and the kid had gotten hurt bad. Now she blamed herself and the only thing she could do was to go all in and hope for the best. She took it all on herself, as an alpha would do. I had to give her credit for trying to see this thing through to the end, but it should have been me. It was my job to know what was going on, to save, to protect, and to kill when there was no other way, and I dropped the ball. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I couldn't undo the damage but I could step up and take charge. I could make sure that while there was breath in my body, not another of my people would be harmed. Whether or not she knew it, Kate was mine now and I would save her or die trying. That is what I do, I am the Beast Lord. I stood and locked eyes with the girl.</p><p>\"Julie, if you release me, I swear that I will not harm you, Kate, or any of my people.\"</p><p>\"Will you help them, in the games?\"</p> <p>\"Yes, I will.\"</p><p>\"Even Derek?\"</p><p>\"What?\" What could I do for him that Doolittle could not?</p><p>\"He is with them, fighting the creatures who hurt him. He is very brave.\"</p><p>Damn idiot. \"Yes, but foolish as well.\" I wonder if she knows the whole story?</p> <p>Julie grimaced. \"Yeah, I know. It's about the girl. I will take care of her later, but I need you to promise about the others.\"</p><p>\"Julie, I give you my word, I will do everything in my power to help our friends and punish our enemies.\"</p><p>She let out a breath she had been holding and smiled finally.</p><p>\"Ok, deal.\"</p><p>MAGIC BLEEDS</p><p>I have been the Beast Lord of Atlanta for half of my life. I am responsible for the lives of several hundred Free People of the Code. Some people will tell you that being in charge means telling other people what to do. That is only a part of it. Leadership means doing what you know is the right thing. In my experience it rarely involves doing what you want or like.</p> <p>Tonight was no exception. I was attending a meeting between the Pack Council, the alphas of all the clans, and the People, necromancers who piloted the dead. Bernard's was neutral ground, a sanctuary where all of Atlanta's players came to be seen and feel important.</p><p>Violence was strictly forbidden. No problem we could dress up and play nice with Nataraja's corpse fuckers. For now there was no need for open conflict between the Pack and the People. The peace would not last forever and one day I would watch the light go out of his eyes while the Casino burned down around him.</p><p>Pushing that pleasant thought aside, I entered the main floor. Jim was waiting there with the other alphas, I nodded to him and he led the group upstairs. I started to follow them when I detected a familiar scent. It couldn't be. Why would she be here?</p><p>She had broken into my place, messed up my weights, and even put catnip into my bed. In retaliation I had glued that cute butt of hers into her office chair. In short we were doing the mating dance.</p><p>For a while I thought I had lost her for good, but in our own fucked up way we had swallowed our pride and reached out to one another. We both knew it would never be easy, but we were willing to try. I knew that Kate wasn't universally loved by the Pack, but they owed me. I bled for them, I fixed their petty squabbles. I had given them everything, they would give me this one thing. Or I would break it all apart.</p><p>As I reached the top of the stairs I saw Jim chewing one of his crew a new asshole. What the fuck? Maybe she was here. Kate was trouble and I wondered what she had done to piss Jim off. Maybe tonight would not be completely boring after all. I just hoped I wouldn't walk into the room full of my alphas with their asses glued to their seats.</p><p>I stepped into the room and looked for her. She stood by a table on the left and for a moment I think I forgot to breathe. Kate looked amazing, her hair was down, she was wearing make-up and that dress. It was cut low in the front and fit like it was made for her.</p><p>She stood next to Saiman.</p> <p>She was here with him. She wore that dress for him. She looked like that for him.</p><p>It was like something hit me in the gut. The rest of the room ceased to exist. There was only me and him and the distance between us. Why him, why here? Did she want to hurt me in the most public way possible?</p><p>Jim was at my side, trying to tell me something. I stared at them, trying to make some sense of it. The son of a bitch smiled at me and said something to her that I could not make out. I strained and picked his smug voice out of the noise \"..would mean war. He can't move a finger out of line.\"</p><p>I almost smiled then. He thought he was safe.</p><p>Jim's voice broke my concentration. \"Not here.\"</p><p>I knew he was right but it didn't matter.</p><p>\"I can make him disappear,\" Jim said next to me. \"No one will ever find him. I can bring him to you in chains, or in pieces. Just wait. Don't do it in front of her. We can do it any time. We've got nothing but time.\"</p><p>I turned my gaze to her and she stared right back. The look was challenging. No, it was going to be right here and right now. She could try and stop me, hell they all could , but she was going to watch me tear him apart. I would paint the floors and walls with his blood before he died.</p><p>The freak laughed. \"We aren't without similarities, Curran and I.\"</p><p>Oh, I had to hear this.</p><p>\"We both fall prey to lust. We both guard our pride and suffer from jealousy. We both employ our resources to get what we want: I use my wealth and my body and he uses his position of power. You say I want you only because you refused me. He wants you for the same reason. I remember when he became Beast Lord. The boy king, the perpetual adolescent, suddenly at the head of the food chain, granted access to hundreds of women who can't say no. Do you think he forces them into his bed? He had to have done it at least a few times.\"</p><p>What? That slimy cocksucker was telling her I was a rapist. The guy who would fuck a snake if he could find someone to hold it still. I never, ever.</p><p>Kate, tell him it isn't true. Tell him you don't believe it. Tell him.</p><p>She said nothing.</p><p>I had wanted her, and I thought she wanted me. I was good, I waited. She was in the Keep, weak and wounded, but I never touched her. He would say or do anything. He would use her and throw her away when he tired of her. I had almost died during the games for her.</p><p>He leaned to her.</p><p>I could clear the distance between us in three leaps. Two seconds and I could twist his head off his shoulders and throw it at her feet.</p><p>He raised his voice. \"You're all mine tonight. Kiss me, Kate\"</p><p>No.</p><p>He reached for her. She stepped away.</p><p>Something inside me snapped and then I was moving toward him. He would not leave this place alive. I couldn't make her love me, but she didn't want his hands on her. That sick fuck would never touch her again.</p><p>She stepped in front of him. He was so drunk or stupid that he still did not know what was happening.</p><p>\"...won't hurt me. Not here.\"</p><p>I was almost there, I could smell the alcohol in his sweat. She swiped a bottle off a nearby table and moved toward me. Nice, but it would not be enough. Maybe if she had her sword...</p><p>\"The People greet the Beast Lord.\"</p><p>Nataraja. It took everything I had but I stopped. If I killed him now, it would be war. In that moment I would have thrown my life away to feel Saiman's skull snap between my jaws, but he was not worth the lives of my Alphas. Saiman would never know it but that bald headed prick had saved his life. For the moment..</p><p>I stared at Kate and mouthed a single word. Later.</p><p>She stared back at me, her eyes clear. Any time.</p><p>I took a deep breath, turned my back on her and in a calm voice called out \"The Beast Lord greets the People.\"</p><p>MAGIC STRIKES TEASER</p><p>Chapter 1</p><p>Some days my job was harder than others.</p><p>I tapped the ladder with my hand. \"See? It's very sturdy, Mrs. McSweeney. You can come down now.\"</p><p>Mrs. McSweeney looked at me from the top of the telephone pole, having obvious doubts about the ladder's and my reliability. Thin, bird-boned, she had to be past seventy. The wind stirred the nimbus of fine white hair around her head and blew open her nightgown, presenting me with sights better left unseen.</p><p>\"Mrs. McSweeney, I wish you would come down.\"</p><p>She arched her back and sucked in a deep breath. Not again. I sat on the ground and clamped my hands over my ears.</p><p>The wail cut through the stillness of the night, sharp like a knife. It hammered the windows of the apartment buildings, wringing a high-pitched hum from the glass. Down the street dogs yowled as one, matching the cry with unnatural harmony. The lament built, swelling like an avalanche, until I could hear nothing but its complex, layered chorus: the lonely howl of a wolf, the forlorn shriek of a bird, the heart-wrenching cry of child. She wailed and wailed, as if her heart was being torn out of her chest, filling me with despair.</p><p>The magic crashed. One moment it filled the world, giving potency to Mrs. McSweeney's cry, and the next it vanished from the world without warning, gone like a line drawn in the sand just before the surf licked it. The technology reasserted itself. The blue fey lantern hanging from the top of the pole went dark, as the magic charged air lost its potency. Electric lights came on in the apartment building.</p><p>It was called post-Shift resonance: magic drowned the world in a wave, snuffing out anything complex and technological, smothering car engines, jamming automatic weapons, and eroding tall buildings. Mages fired ice bolts, skyscrapers fell, and wards flared into life, keeping undesirables from my house. And then, just like that, the magic would vanish, leaving monsters in its wake. Nobody could predict when it would reappear and nobody could prevent it. All we could do was cope with an insane tarantella of magic and technology. That's why I carried a sword. It always worked.</p><p>The last echoes of the cry bounced from the brick walls and died.</p><p>Mrs. McSweeney stared at me with sad eyes. I picked myself off the ground and waved at her. \"I'll be right back.\"</p><p>I trotted into the dark entrance to the apartment, where five members of the McSweeney family crouched in the gloom. \"Tell me again why you can't come out and help me?\"</p><p>Robert McSweeney, a middle-aged, dark-eyed man with thinning brown hair, shook his head. \"Mom thinks we don't know she's a banshee. Look, Ms. Daniels, can you get her down or not? You're the knight of the Order, for Christ's sake.\"</p><p>First, I wasn't a knight; I just worked for the Order of Merciful Aid. Second, negotiation wasn't my forte. I killed things. Quickly and with much bloodshed. Getting elderly banshees in denial off of telephone poles wasn't something I did often. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Can you think of anything that might help me?</p><p>Robert's wife Melinda sighed. \"I don't... I mean she always kept it so under wraps. We've heard her wail before but she was so discreet about it. This isn't normal for her.\"</p><p>An elderly black woman in a mumu descended the staircase. \"Has that girl gotten Margie down yet?\"</p> <p>\"I'm working on it,\" I told her.</p><p>\"You tell her, she better not miss our bingo tomorrow night.\"</p><p>\"Thanks.\"</p><p>I headed to the pole. Part of me sympathized with Mrs. McSweeney. The three law enforcement agencies that regulated life in US post-Shift, the Military Supernatural Defense Unit or MSDU, the Paranormal Activity Division, PAD, and my illustrious employer, the Order of Merciful Aid, all certified banshees as harmless. Nobody has yet been able to link their wails to any deaths or natural disasters. But folklore blamed banshees for all sorts of nefarious things. They were rumored to drive people mad with their scream and kill children with a mere look. Plenty of people would be nervous about living next to a banshee and I could understand why Mrs. McSweeney went to great length to hide who she was. She didn't want her friends to shun her or her family.</p><p>Unfortunately, no matter how well you hide, sooner or later your big secret will bite you in the behind, and you might find yourself standing on a telephone pole, not sure why or how you had gotten there, while the neighborhood pretends not to hear your piercing screeches.</p> <p>Yeah. I was the one to talk. When it came to hiding one's identity, I was an expert. I burned my bloody bandages, so nobody could identify me by magic in my blood. I hid my power. I tried very hard not to make friends and mostly succeeded. Because when my secret came to life, I wouldn't end up on top of the pole. I would be dead and all my friends would be dead with me.</p><p>I approached the pole and looked at Mrs. McSweeney. \"Alright. I'm going to count to three and then you have to come down.\"</p><p>She shook her head.</p><p>\"Mrs. McSweeney! You're making a spectacle out of yourself. Your family is worried about you and you have bingo tomorrow night. You don't want to miss it, do you?\"</p><p>She bit her lip.</p><p>\"We will do it together.\" I climbed three steps up the ladder. \"On three. One, two, three, step!\"</p> <p>I took a step down and watched her do the same. Thank you, whoever you are upstairs.</p><p>\"One more. One, two, three, step.\"</p><p>We took another step, and then she took one by herself. I jumped to the ground. \"That's it.\"</p><p>Mrs. McSweeney paused. Oh no.</p><p>She looked at me with her sad eyes and asked, \"You won't tell anyone, will you?\"</p><p>I glanced at the windows of the apartment building. She had wailed loud enough to wake the dead and make them call the cops. But in this day and age, people banded together. One couldn't rely on tech or on magic, only on your family and neighbors. They were willing to keep her secret, no matter how absurd it seemed, and so was I.</p><p>\"I won't tell anyone,\" I promised.</p><p>Two minutes later she was heading to her apartment, and I was wrestling with the ladder, trying to make it fit into the space under the stairs, from which the super had gotten it for me.</p> <p>My day had started at five with a frantic man running through the hallway of the Atlanta Chapter of the Order of Merciful Aid and screaming that a dragon with a cat head had gotten into New Hope School and would devour the children. The dragon turned out to be a small tatzelwyrm, which I unfortunately, was unable to subdue without cutting its head off. That was the first time I got sprayed with blood today.</p><p>Then I had to help Mauro get a two-headed fresh water serpent out of an artificial pond at the ruins of One Atlantic Center in Buckhead. It took me and the huge Samoan knight almost an hour, and by the end of the ordeal we were both swearing like a couple of sailors on shore leave, who got kicked out of the bar midway through the ladies night.</p><p>The day went downhill from there. It was past midnight now. I was dirty, tired, hungry, smeared with four different types of blood, and I wanted to go home. Also my boots stank because the serpent had vomited a half-eaten cat corpse on my feet.</p><p>I finally managed to stuff the ladder in its place and left the apartment building for the parking lot, where my female mule Marigold was tied to a metal rack set up there for precisely that purpose. I had gotten within ten feet of her when I saw a half-finished swastika drawn on her rump in green paint. The paint stick lay broken on the ground. There was also some blood and what looked like a tooth. I looked closer. Yep, definitely a tooth.</p><p>\"Had an adventure, did we?\"</p><p>Marigold didn't say anything, but I knew from experience that approaching her from behind was Not a Good Idea. She kicked like a mule, probably because she was one.</p><p>If not for the Order's brand on her other butt cheek, Marigold might have been stolen tonight. Fortunately, the knights of the Order had a nasty habit of magically tracking the thieves and coming down on them like a ton of bricks.</p><p>I untied her, mounted and we braved the night.</p><p>Typically technology and magic switched at least once every couple of days, usually more often than that. But two months ago we had been hit with a flare, a wave so potent, it drowned the city like a magic tsunami, making impossible things a reality. For three days demons and gods had walked the streets and human monsters had great difficulty controlling themselves. I had spent the flare on the battlefield, helping a handful of shapeshifters butcher a demonic horde.</p><p>It had been an epic occurrence all around. I still had vivid dreams about it, not exactly nightmares, but intoxicating, surreal visions of blood and gleaming blades and death.</p><p>The flare had burned out, leaving technology firmly in control of the world. For two months cars started without fail, electricity held the darkness at bay, and air conditioning made Georgia August blissful. We even had TV. On Monday night they had shown a movie, Terminator 2, hammering home the point: it could always be worse.</p><p>Then, on Wednesday right around noon, the magic hit. And Atlanta went to hell.</p><p>I wasn't sure if people had deluded themselves into thinking the magic wouldn't come back or if they had been caught unprepared, but we've never had so many calls for help since I had started with the Order. Unlike the Mercenary Guild, for which I also worked, the knights of the Order of Merciful Aid helped anyone and everyone regardless of their ability to pay. They charged only what you could afford and a lot of times nothing at all. We had been flooded with pleas. I managed to catch four hours of sleep on Wednesday night and then it was up and running again. Technically it was Friday now, I was plagued by persistent fantasies of hot shower, food, and soft sheets. I had made an apple pie a couple of days ago and I still had a slice left for tonight.</p><p>\"Kate?\" Maxine's stern voice echoed through my head, distant but clear.</p><p>I didn't jump. After the marathon of the last forty eight hours hearing the Order's telepathic secretary in my head seemed perfectly normal. Sad but true.</p><p>\"I'm sorry, dear, but the pie might have to wait.\"</p><p>What else is new? Maxine didn't read thoughts on purpose but if I concentrated on something hard enough, she couldn't help but catch a hint of it.</p><p>\"I have a green seven, called in by a civilian.\"</p><p>Dead shapeshifter. Anything shapeshifter-related was mine. The shapeshifters distrusted the outsiders, and I was the only employee of the Atlanta chapter of the Order who enjoyed Friend of the Pack status. Enjoyed being a relative term. Mostly my status meant that the shapeshifters might let me say a couple of words before deciding to fillet me. They took paranoid to a new level.</p><p>\"Where is it?\"</p><p>\"Corner of Ponce de Leon and Dead Cat.\"</p><p>Twenty minutes by mule. Chances were, the Pack knew the death took place already. Ugh. I turned Marigold and headed north. \"I'm on it.\" </p> </body></html>"]