["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER ONE</p><p>“Tess, you coming to my party?” It was her father’s voice on her answering machine that finally roused her from sleep. “You better be here, girl. I’m tired of you staying away. You call me back.”</p><p>The line disconnected. Tess sighed as she opened her eyes. She would have preferred the dream to the stark loneliness that awaited her when she opened her eyes. At least there, even in the dark, frightening abyss of desires too dark to name, she had a purpose, rather than her fears.</p><p>She stared down at the large stuffed gorilla she clutched to her chest in her sleep. A present from her father when she left with her mother. Something to keep the bad dreams away, he had said sadly, even though she had been an adult. Tess often had bad dreams.</p><p>Perhaps she shouldn’t have left as well, Tess often thought. She was just entering college at the time, and could have made her own choice. But her mother had needed her. Or Tess had thought she did. Now she wasn’t certain if her mother needed her, or merely needed to control her.</p><p>“Tess, you awake now?” Her mother, Ella James called from the bottom of the downstairs hallway, her voice barely penetrating the distance.</p><p>Tess had installed her own phone line straight out of college and moved her bedroom to the upper floor where her mother rarely ventured. She needed her privacy, and her mother was prone to butt in wherever she could. The stairs kept her from venturing into Tess’s privacy very often.</p><p>“Yeah, Mom. I’m awake,” she yelled back, rising from bed, imagining her mother’s moue of distaste. It was Saturday, for God’s sake. She was entitled to sleep in. She could just imagine her mother’s expression if she knew it was her father’s call that woke her.</p><p>Resigned, Tess got of bed and headed for the shower.</p><p>Tess was well aware of her mother’s disgust for her father’s lifestyle. Jason Delacourte didn’t stay home or keep regular hours or play the nine to five game. He owned a national electronics corporation and lived the lifestyle he chose. He gave dinners, attended charities and threw yearly parties. Ella preferred her books and her quiet and anything that didn’t involve a man. She had done her best to raise her daughter the same way.</p><p>Tess did hate parties. She always had and she knew she always would. She invariably ended up going alone. Always ended up leaving alone. Parties jinxed her. Men jinxed her, they had for years. But she was committed to this party. She had promised. What could she do but get ready to go?</p><p>She grimaced, confused as she pondered her lack of a love life. Or perhaps sex life. She wasn’t a great believer in love or the happily ever after stuff. She had rarely seen it work, her own parents were an example of that one. And her father’s second marriage seemed more rocky than solid.</p><p>She frowned as she usually did when she thought of her father’s new wife. Well, perhaps not new. Jason Delacourte, her father, had been married for nearly three years now to Melissa. The woman still insisted that everyone call her Missy. As though she were still a teenager. Tess snarled with distaste. Of course, the woman was barely thirty-five, ten years younger than her father, and nearly ten years older then Tess. The least he could have done, she sniped silently, was marry a woman closer to his own age.</p><p>She could barely tolerate being in the same room with ‘Missy’. The woman gave dumb blonde a new meaning. How she managed to be related to a man touted as a genius, Tess had no idea. But she was. Cole Andrews was Missy’s brother, and Tess’s father swore Cole had moved Delacourte Electronics into the financial sphere it now enjoyed as one of the leading electronic manufacturers.</p><p>The thought of him caused mixed reactions in Tess, though.</p><p>Cole was six feet three inches of hard packed muscle and dark, brooding good looks with a cynical, mocking attitude that drove her crazy. His kisses were the stuff dreams were made of. His fingers were wicked instruments of torturous pleasure; his lips were capable of throwing her into a hypnotic trance when they touched her.</p><p>She suppressed a sigh. No man kissed as good as Cole Andrews. It should be a crime that one man should ooze so much sex appeal, and be such an asshole to boot. And it was really a crime that she couldn’t get past that one stolen kiss long enough to enjoy any others.</p><p>After showering, she quickly blow dried her hair, sighing as she swiped the brush through her shoulder-length black hair one last time before turning back to the open doors of her large closet. She had enough clothes. One thing her father had always done was made certain she was well provided for.</p><p>Elementary school teachers didn’t make a lot in terms of money, and it wasn’t the glamorous job Jason Delacourte had always thought his daughter should hold, but it was what she wanted to do. Besides, it kept her out of the social sphere her stepmother and Cole Andrews moved in. That was a big enough plus to keep her there.</p><p>But, she had promised her father she would stay with him for this one week. That she would take the time off work and return to the large family home she had grown up in before his divorce from her mother, and she would try to be his daughter.</p><p>It wasn’t that she didn’t love him, she thought as she packed her suitcase. She did. She loved her father terribly, but Cole was at the house. He stayed there often, and it was Cole she needed to avoid.</p><p>After packing the more casual clothes she would need and her treasured, hidden vibrator, Tess moved back to her closet to choose what she would wear for the yearly Valentine’s Day party her father gave. It was also the third year anniversary of his marriage to Missy. Yeah, she really wanted to celebrate that one.</p><p>She pulled a short, black, silk sheath from the closet and hung it on the doorknob. From her dresser she pulled out a black thong, a lacy matching bra, and smoky silk stockings. The dark colors suited her mood. Valentine’s Day was for lovers, and Tess didn’t have one. She still didn’t understand why she was going to this stupid party.</p> <p>It wasn’t like her father would really miss her. The house would be packed. They didn’t need her there. She hadn’t attended one of Missy’s parties in well over a year now. They were loud, bustling and often turned out a bit too wild for her tastes. Besides, Cole always ended up bringing his latest flame, and pissing her off the first hour into it.</p><p>His dark blue eyes would watch her, faintly cynical, always glittering with interest while the bimbos at his side simpered adoringly. She snorted. If she had to simper to hold him, well then—</p><p>She sighed desolately. She would probably simper if she thought it would help. If she could learn how. Her mouth always seemed to get the better of her though. His general air of superiority just grated on her. Ever since that first kiss, his hard body holding her captive against the wall as he whispered what he wanted in her ear. Her body had sung in agreement, her mind, shocked and dazed from the images, had kicked in with an instant defense: her smart mouth.</p><p>It had been over two years.</p><p>She sat down on the bed, still naked, her cunt wet, throbbing at the memory.</p><p>“Can you take the heat, baby?” he had whispered to her, holding her against the wall as he ground his cock between her thighs. “I won’t lie to you, Tess. I want you bad. But I’m not one of your little college boys that you can mess with. I want you tied to my bed, screaming, begging for me. I want to pump my dick in that tight little ass of yours, I want to hear your cries while I’m buried there and fuck you with a dildo bought just for that tight cunt of yours.”</p><p>She shook now in remembered arousal and hot desperate need.</p><p>“Sure,” she had bit out. “And then I can fuck your ass next!”</p><p>He had had the nerve to laugh at her. Laugh at her as his fingers sank into the wet, tight grip of her pussy and her orgasm rippled over her body. She’d gasped, feeling the slick heat as it pulsed through her vagina, washing over his fingers. Then he had slid them down to the tight little hole he had promised to fuck, one finger sinking in to its first knuckle, sending a flare of pain through her body that she had enjoyed too much to be comfortable with.</p><p>Tess remembered her fear, throbbing as hot as her lust. She had pushed him away, trembling, unfamiliar with the hot pulse of hunger that had flared in her, unlike anything she had known before. And he had watched her, his cock a thick, hard outline beneath his pants, his eyes dark as she stood before him trembling.</p><p>“Pervert!” she had accused him.</p><p>His lips had quirked, his eyes flaring in anger.</p><p>“And you?” he asked her. “What does that make you, baby? Because sooner or later, you’ll have to admit you want it.”</p><p>“What, raped?” she had bit out.</p><p>His eyes suddenly softened, a strange smile quirking his lips.</p><p>“Never rape, Tess. You’ll beg me for it. Because we both know you want it as much as I do. My cock sliding up your tight ass while you scream for me to stop, then screaming for me to never stop. You’re mine Tess, and I know what it takes to give you what you need. When you’re ready to accept that, let me know.”</p><p>Tess shook her head. Wanting it and accepting it were two different things. She had dreamed of it ever since, too humiliated to ask him for it, and he refused to offer a second time.</p><p>She touched her smooth, waxed pussy, her eyes closing as she lay back on the bed. The thought of what he wanted terrified her, yet it aroused her to the point of pain. The thought of his cock, so thick and hard, easing into her ass as he penetrated her wet, pleading cunt with a dildo, her tied down, unable to fight, unable to escape whatever he desired, had her soaked with need. He wouldn’t hurt her. She knew enough about Cole to know he would never hurt her, but he could show her things she wasn’t sure she was ready to know about herself. He could show her a part of herself that she wasn’t certain she could handle. That was a frightening thought.</p><p>Her fingers eased through the shallow, narrow crease of her cunt, circled her clit. He had promised to eat her there. To run his tongue around her clit, suck it, eat her like honey, a lick at a time. She shuddered, moaning, imagining her finger was his tongue, licking at her cunt, lapping at the slick heat that soaked her pussy. She circled her clit, whispering his name, then moved her fingers back down to the desperate ache in her vagina. She penetrated the tight channel with two of her fingers, biting her lip, wondering how thick and long Cole’s fingers would be inside her. He had such a big hands, he would fill her, make her scream for more.</p><p>He had whispered the dark promise that he would fuck her ass, take her there, make her scream for him. She bit her lips, her fingers moving, one inserting into that tiny, dark hole while she wished she hadn’t packed her vibrator so quickly. As her finger passed the tight entrance, she allowed two fingers of her other hand to sink into her vagina. She could hear his voice in the back of her mind, feel his finger, thicker than hers, spearing a dart of pleasurable pain through her as he pierced her ass. And he had told her, warned her he would fuck her there.</p><p>Her knees bent, her hips thrusting harder against her own fingers as she imagined Cole between her thighs, licking her, fucking her with his fingers, driving her over the edge as they fucked into her; her cunt, her ass, until—</p><p>She cried out as the soft ripples of release washed over her. Her vagina clenched on her fingers, her womb trembling with pleasure. It wasn’t the release she had experienced with Cole’s fingers or her vibrator, but it took the edge off the lust that seemed to only grow over time.</p><p>CHAPTER TWO</p><p>It wasn’t enough. An hour and a cold shower later, Tess’s body still simmered with need. Stretched on her bed, her body sheened with sweat as she fought for orgasm, she cursed the phone when it rang at her side. Grimacing when it refused to stop, Tess reached over, grabbing the receiver.</p><p>“Hello.” She tried to clear her throat, to still her rapid breaths, and hoped she could explain it away if it was her father. She didn’t want him to know his daughter was a raging mass of horny hormones ready to explode.</p><p>There was a brief silence, as though the caller were weighing his words. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Feeling better?” A trace of knowing mockery, a deep, sensually husky voice whispered the words.</p><p>Tess flushed at Cole’s voice. Damn him.</p><p>“I haven’t been sick,” she bit out, her eyes closing as her vagina pulsed. She smoothed her fingers over her clit, feeling the increased stimulation there. Damn, she could get off with just his voice.</p><p>“No, just trying to get off,” he said lazily. “I would help. All you have to do is ask.”</p><p>Ask, ask, her inner voice begged.</p><p>“In your dreams.” She winced as the words burst from her mouth. Damn him, he put her on the defensive faster than anyone she knew.</p><p>“It would appear in yours as well,” he said, his mockery suddenly gone. “I know how you sound when you’re aroused, Tess. Don’t try to lie to me. Let me hear you. Touch yourself for me.”</p><p>Tess felt her breath strangle in her throat.</p><p>“You’re a pervert, Cole.” She fought for her own control at the sound of that sexy voice. “Isn’t phone sex illegal?”</p><p>“I’m sure most of what I want to do with you could be termed illegal,” he chuckled. “Let’s talk about it, Tess. Come on, tell me what you were doing to yourself. Are you using your fingers or a vibrator?”</p><p>“I do not have a vibrator.” She clenched her teeth over the lie.</p><p>“Dildo?” he whispered the words heatedly. “Are you fucking yourself, Tess? Thinking about me, how much I want you?”</p><p>“No!” She clenched the receiver in her hand, shaking her head despite the fact that her fingers had returned to her suddenly pulsing cunt.</p><p>“I’d like to see you in my bed, Tess, your legs spread, your hands touching your pretty cunt, fucking yourself. Did I ever tell you I bought that dildo I promised you? It’s nice and thick, Tess. Almost as large as my cock. I want to watch you use it. See you fuck yourself with it.”</p><p>“God, Cole,” she gasped. “We’re on the phone. This is indecent.” But her fingers were sinking into her cunt.</p><p>“What were you doing before I called, Tess?” His voice was dark, hot. “I know you were touching yourself. I know the sound of your voice when you’re ready to come, and you’re ready to come, baby.”</p><p>“No—” She tried to deny the obvious truth, but she couldn’t keep her breath from catching as her fingers grazed her clit once again.</p><p>“Son of a bitch, Tess,” he growled. “Are you close, baby?” His voice deepened. “If I were there, I’d make you scream for it. I’d fuck you so deep and hard you wouldn’t be able to stop it. You’d cum for me, Tess. Come for me now, baby. Let me hear you.”</p><p>His voice was so deep, so sensual and aroused it caused her womb to contract almost painfully. Her body bowed, her breath catching on a near sob. He brought all her darkest desires, her deepest fantasies to the forefront of her mind. It terrified her.</p><p>“Cole,” she whispered his name, wanting to deny him, but her fingers weren’t listening as they stroked her clit, sank into her vagina, then moved back to repeat the action.</p><p>She was so hot she could barely stand it. So horny she was on the verge of screaming for relief.</p><p>“I’m stroking my cock, Tess, listening to you lay there, imagining you touching your juicy cunt, wishing I were with you, watching you fuck yourself with the dildo I bought you.” His words caused her to gasp, her womb to contract painfully, her hips to surge into her plunging fingers.</p> <p>“No.” She tossed her head. She couldn’t do this.</p><p>“Damn, Tess, I want to fuck you,” he growled, his voice rough. “I want to be buried so deep and hard inside you you’ll never forget it or deny me again. Come for me, damn you. At least let me hear what I can’t have. Fuck yourself Tess, give this to me. Those aren’t your fingers buried in your pussy, it’s my cock. Mine, and I’m going to fuck you until you scream.”</p><p>Tess’s orgasm ripped through her. She shuddered, whimpered, her body tightening to the point of pain before she felt her vagina explode.</p><p>“Oh God, Cole,” she cried his name, then heard his hard exclamation of pleasure, knew he was coming, knew her climax had triggered his own as well.</p><p>“Tess,” he groaned. “Damn you, when I get hold of you I’ll fuck you until you can’t walk.”</p><p>Tess trembled at the erotic promise in his voice, the dark sensuality that terrified her, made her want to give him whatever he wanted.</p><p>“No,” she whispered, fighting for breath, fighting for sanity. “I asked you to stay away.”</p><p>She wanted to whimper, she wanted to beg.</p><p>There was silence over the line.</p><p>“Stay away?” he asked her carefully. “I don’t think so, baby. I’ve stayed away too long as it is. You’re mine Tess, and I’m going to prove it to you. All mine. In every way mine, and I’ll be damned if I’ll let you deny it any longer.”</p><p>CHAPTER THREE</p><p>Her mother was waiting on her when she came down the stairs, her suitcase in hand. Ella Delacourte was a small, spare woman, with dark brown hair and sharp hazel eyes. There were few things she missed, and even less that she was tolerant of.</p><p>“So you’re still going,” she snapped out as she eyed the suitcase Tess set by the front door. “I thought you would have more pride than that, Tess.”</p><p>Tess pressed her lips together as she fought to keep her sarcastic reply in check.</p><p>“This has nothing to do with pride, Mother,” she told her quietly. “He’s still my father.”</p><p>“The same father who destroyed your family. Who ensured you lost the home you were raised in,” Ella reminded her bitterly. “The same father that married the whore who meant more to him than you did.”</p><p>Tess’s chest clenched with pain, and with anger. She wasn’t a child anymore, and there were times when she could clearly see why her father had been unable to get along with her mother. Ella saw only one view, and that was hers.</p><p>“He took care of us, Mother,” she pointed out. “Even after the divorce.”</p><p>“As though he had a choice.” Ella crossed her arms over her breasts as she stared at Tess in anger.</p><p>“Yes, Mother, he had a choice after I reached eighteen,” Tess reminded her bleakly. “But I believe he still sends you money and provides whatever you need, just as he does me. He doesn’t have to do this.”</p><p>“Conscience money,” Ella spat out, her pretty face twisting into lines of anger and bitter fury. “He knows he did us wrong, Tess. He threw us out—“</p><p>“No, you elected to leave, if I remember correctly.” Tess wanted to scream in frustration.</p><p>The argument never ended. It was never over. She felt as though she continually paid for her father’s choices because her mother had no way of making him pay.</p><p>“He’s depraved. As though you need to spend a week in his house.” Ella was shaking now with fury, contempt lacing each word out of her mouth. “Those parties he throws are excuses for orgies, and that wife of his—“</p><p>“I don’t want to hear it, Mother—“</p><p>“You think your father and his new family are so respectable and kind,” she sneered. “You think I don’t know how you watched that brother of hers. That I didn’t know about the flowers he sent you last year. They’re monsters, Tess.” She pointed a thin, accusing finger at Tess. “Depraved and conscienceless. He’ll turn you into a tramp.”</p><p>Tess felt her face flame. She had fought for years to hide her attraction to Cole. She had heard all the rumors, knew his sexual exploits were often gossiped about. He had more or less admitted them to her on several occasions.</p><p>“No one can turn me into a tramp, Mother,” she bit out. “Just as there’s no way you can change the fact that I have a father. I can’t ignore him or pretend he doesn’t exist, and I don’t want to.”</p><p>Tess faced her parent, feeling the same, horrible fear that always filled her at the thought of making her too angry. Of disappointing her in any way. But as she faced her fear, she felt her own anger festering inside her. For so many years she had tried to make up for the divorce her father had somehow forced. She knew he took the blame for it. Just as her mother vowed complete innocence. She was beginning to wonder if either of them would ever tell her the truth.</p><p>“You’ll end up just like him,” Ella accused, her eyes narrowing hatefully.</p><p>Tess could only shake her head.</p><p>“I’ll be home in a week, Mother,” she said, picking up her luggage.</p><p>In the back of her mind, she knew she would not be returning though. She had stayed out of guilt and out of fear of failing somehow in her mother’s eyes. She was only now realizing, she could never succeed in her mother’s opinion though. She was fighting a losing battle. A battle she didn’t want to win to begin with.</p><p>Tess was still trembling when she pulled into the large circular driveway of her father’s home. The shadows of evening were washing over his stately Virginia mansion, spilling long shadows over the three-story house and the tree shrouded yard. The drive from New York wasn’t a hard one, but her nervousness left her feeling exhausted. She definitely wasn’t up to facing Cole. Her face flushed at the thought. She had tried not to think about the phone call that morning, or the core of heat it had left lingering inside her.</p><p>It had nearly been enough to have her turning around several times and heading back to her safe, comfortable life in her mother’s home. She would have too, until she thought of her mother. Ella was too frightened of the world to draw her head out of her books and see the things she was missing. She had lost her husband years before their divorce because of her distaste of his sexual demands. She told Tess often how disgusting, how shameful she found sex to be.</p><p>Tess didn’t want to grow old, knowing she had passed up the exciting things in life. She didn’t want to ache all her life for the one thing she needed the most and passed up. But she didn’t want her heart broken. And Tess had a feeling Cole could break her heart.</p><p>She wanted him too badly. She had realized that in the past months. The dreams were driving her crazy. Dreams of Cole tying her to his bed, teasing her, touching her, his dark voice whispering his sexual promises to her. She was awaking more and more often, her cunt soaked, her breathing ragged, a plea on her lips.</p><p>Tess had known he was bad news even before her father married his sister. His eyes were too wicked, his looks too sensual. He was wickedly sexy, sinfully sensuous. She moaned in rising excitement and fear.</p><p>Leaving her keys in the ignition for the butler to park it, Tess jumped from the car. Night was already rolling in, and she would be damned if she would sit out in that car because she was too scared to walk into the house. Hopefully, Cole wouldn’t be there. He wasn’t always there.</p><p>“Good evening, Miss Delacourte.” The butler, a large, burly ex-bouncer opened the door for her as she stepped up to it.</p><p>Thomas was well over fifty, Tess knew, but he didn’t look a day over thirty-five. He was six feet tall, heavily muscled and sported a crooked nose and several small scars on his broad face. He was Irish, he said, with a mix of Cherokee Indian and German ancestry. His thick, brown hair was in a crew cut, his large face creased with a smile.</p><p>“Good evening, Thomas. Is Father in?” She stepped into the house, more uncomfortable than she had thought she would be.</p><p>This was the home she had grown up in, the one she had raced through with the puppy her father had once bought her, but her mother had gotten rid of. The home where her father had once patched skinned knees and a bruised heart. The home her mother had taken her out of when her father demanded his rights as a husband, or a divorce.</p><p>“Your father and Mrs. Delacourte are out for the evening, Miss,” he told her as she stepped into the house. “Will you be staying for a while?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes.” She took a deep breath. “My luggage is outside. Is my room still available?”</p><p>There was an edge of pain as she asked the question. She had learned that Missy had opened her room for guests, rather than keeping it up for Tess’s infrequent returns.</p><p>“I’m sorry, Miss Tess,” Thomas said softly. “The room is being redecorated. But the turret room is available. I prepared it myself this morning.”</p><p>The turret room was the furthest away from the guest or family bedrooms. At the back of the house, on the third floor. The turret had been added decades ago by her grandfather and she had loved it as a child. Now she resented the fact that it was not a family room, but the one she knew Missy used for those visitors she could barely tolerate. Evidently, Tess thought, she had slipped a few notches in her stepmother’s graces.</p><p>Tess breathed in deeply. Those weren’t tears clogging her throat, she assured herself. Her chest was tight from exhaustion, not pain.</p><p>“Fine.” She swallowed tightly. “Could you have my luggage brought up? I need a shower and some sleep. I’ll see Father in the morning.”</p><p>“Of course, Miss Tess.” Thomas’ voice was gentle. He had been with the family for as long as she could remember and she knew she wasn’t hiding her pain from him.</p><p>“Is Father happy, Thomas?” she asked him as she paused before going down the hall to the hidden staircase that led to the turret room. “Does Missy take care of him?”</p><p>“Your father seems very happy to me, Miss Tess,” Thomas assured her. “Happier than I’ve seen since Mrs. Ella left.”</p><p>Tess nodded abruptly. That was all that mattered. She moved quickly down the hall, turning toward the kitchen then entering the staircase to the right. The staircase led to one place. The turret room.</p><p>It was a beautiful room. Rounded and spacious, the furniture had been made to fit the room exactly. The bed was large with a heavy, rounded walnut headboard that sat perfectly against the wall. Heavy matching drawers slid into the stone wall for a dresser, with a mantle above it to the side of the bed. Across the room was a small fireplace, the wood was gas logs, but it was pretty enough.</p><p>She felt like Cinderella before the Prince rescued her. Tess sat down heavily on the quilt that covered the bed. This sucked. She should get back in her car and head straight back home where she belonged. She didn’t belong here anymore, and she was beginning to wonder if she ever had.</p><p>Taking a deep breath, she ran her hands through her hair and listened to Thomas coming up the stairs. He stepped into the room with a friendly smile, but his brown eyes were somber as they met hers.</p><p>“Will you be okay here, Miss Tess?” he asked her as he set the large suitcase and matching overnight bag on the luggage rack beside the door. “I could quickly freshen another room.”</p><p>“No. I’m fine, Thomas.” She shook her head. What was the point? She had come back, mainly to find something that didn’t exist. It was best she learn that now, before it went any further.</p><p>Thomas nodded before going to the fireplace. With practiced moves he lit the gas fire, then pulled back and nodded in satisfaction at the even heat coming off the ceramic logs.</p><p>“Would you like me to announce dinner for you, Miss Tess?” he asked.</p><p>Her father and stepmother were away. Tess knew the servants would only be preparing their own food. She shook her head. They were all most likely anticipating a night to relax, she wouldn’t deprive them of that. What hurt the most was her father’s absence. He had known she was coming, and he wasn’t here. It was the first time he had ever left, knowing she was coming home. The first time Tess had ever felt as though she were a stranger in her own home.</p><p>One thing Tess really liked about the turret room was the bathroom. The huge room was situated to the right of the bed, and held a large sunken tub big enough for three and a fully mirrored wall. Thomas had stocked the small refrigerator unit against her objections. One of his little surprises was a bottle of her favorite white wine. Tess opened it, poured a full glass and sipped at it as the water ran into the large ceramic tub. Steam rose around the room, creating an ethereal effect with the glow of the candles she had lit.</p><p>She stripped out of her jeans and T-shirt and setting the wineglass and bottle on a small shelf, sank into the bubbled liquid. Exquisite. She leaned back against the hand fashioned back of the tub and rested her head on the pillowed headrest. It was hedonistic. A wicked, sinful extravagance, as her mother would have said.</p><p>She closed her eyes and took a deep breath. She had expected her father to be home, had expected some sort of greeting. She didn’t expect to be left on her own. But the sinful richness of the bathtub eased a bit of the hurt. She could enjoy this. This one last time.</p><p>She hadn’t come home without ulterior motives, she knew. Perhaps this was her payment for it. It wasn’t her father that had drawn her so much as the man that she knew would arrive sooner or later.</p> <p>Cole. She took a deep breath, flushing once again at the memory of the phone conversation. She could handle a little sex with him. It wasn’t like she was a virgin. It was the rest of it. Cole didn’t go for just sex. Cole was wild and kinky and liked to spice things up, she had heard. Heard. She whimpered, remembering his promise to tie her to his bed and what he would do there.</p><p>She had never had rough sex, though she admitted, she had never had satisfying sex either. It had never been intense enough, strong enough. The hardest climax of her life had been in that damned hallway, with Cole’s fingers thrusting inside her cunt. She had been so slick, so wet, that even her thighs had been coated with it.</p><p>Lifting the wineglass from the shelf, Tess sipped at it a bit greedily. Her skin was sensitive, her breasts swollen with arousal, her cunt clenching in need. Dammit, she should have found a nice, tame principal or teacher to satisfy her lusts with. Cole was bad news. She knew he was bad news. Had always known it.</p><p>She had known Cole before her father had married his sister. She had heard about his sexual practices, his pleasures. He was hedonistic, wicked. And sometimes, he liked to dominate. He wasn’t a bully outside the bedroom. Confident, superior, but not a bully. But she had heard rumors. Tales of Cole’s preferences, his insistence on submission from his women. The comments he had made to her over the years only backed up the rumors she had heard.</p><p>Tess trembled at the thought of being dominated by Cole. Equal parts fear and excitement thrummed through her veins, her cunt, swelling her breasts, making her nipples hard. She didn’t need this. Didn’t need the desire for him that she was feeling. Didn’t need the broken heart she knew he could deal her. She drained the wine from her glass then poured another, realizing the effects of the drink were already beginning to travel through her system. She felt more relaxed, finally. She hadn’t been this relaxed in months. Enjoying the sensations, she poured another, hoping she would at least manage a few hours of sleep tonight without dreaming of Cole.</p><p>CHAPTER FOUR</p><p>Tess came downstairs the next morning expecting to be greeted by her father. She had dressed in the dove gray sweater dress he had sent her the month before. Tiny pearl buttons closed it from the hem to just above her breasts. On her feet she wore matching pumps and pearls at her neck. Confident and sure of herself, Tess felt able to field her father’s questions, his urgings that she move back home for a while. When she walked into the dimly lit family room, it was Cole she found instead.</p><p>She stood still, silent as she faced him across the room. His eyes, a brilliant blue and filled with wicked secrets, watched her narrowly. Thick, black lashes framed the brilliant orbs, just as his thick, black hair framed the savage features of his face. His cheekbones were high, sharp, his nose an arrogant slash down his face. His lips were wide, and could be full and sensual or thin with anger. Now, he seemed merely curious.</p><p>His arms were crossed over his wide, muscular chest, his ankles crossed as he stood propped against the back of a sectional couch that faced away from her.</p><p>“Where’s Father?” Tess asked him, fighting her excitement, her own unruly desires.</p><p>“He was held up. He expects, perhaps, to be home tomorrow,” he told her quietly.</p><p>“Perhaps?” She barely stilled the tremble in her voice.</p><p>“Perhaps.” He straightened from his lazy stance, watching her with a narrow-eyed intensity that had her breasts and her cunt throbbing. Damn him for the effect he had on her.</p><p>“So he couldn’t tell me himself?” she questioned him nervously, watching him advance on her, determined to stand her ground.</p><p>“I’m sure he’ll call, eventually.” His voice was a slow, lazy drawl, thick with tension and arousal. It was all she could do to keep her eyes on his face, rather than allowing them to lower to see how thick the bulge in his pants had grown. She knew for certain the throb in her vagina had intensified.</p><p>“So you volunteered as the welcome wagon?” She was breathless, and knew he could hear it in her voice. His eyes darkened with the knowledge, causing her heartbeat to intensify.</p><p>He moved steadily nearer, until he was only inches from her. She could feel the warmth of his body, and it tingled over her nerve endings. He was tall, so much broader than she. She felt at once threatened and secure. The alternating emotions had her caught, unable to move, unwilling to run.</p><p>The blood raced through her veins as she attempted to make sense of the powerful feelings racing through her body and her mind. Two years she had thought about him, fought the temptation he represented and the heat he inspired.</p><p>“I’m always here to welcome you, Tess.” He smiled, that slow quirk of his lips that made the muscles in her stomach tighten. “But I have to admit, I was more than eager after talking to you yesterday.”</p><p>Her face flamed. Echoes of her whimpers, her fight to breathe through her climax whispered through her mind. Cole’s voice, husky and deep, urging her on, rough from his own arousal, then his own climax.</p><p>Tess swallowed hard as she caught her lip between her teeth in nervous indecision. Did she reach out for him? Should she run from him?</p><p>“Hound dog,” she muttered, more angry at herself than she was at him.</p><p>He chuckled, his hand reaching out to touch the bare flesh at her neck.</p><p>“Prickly as ever I see,” he said with a vein of amusement as his eyes darkened. “Would you be as hot in bed, Tess?”</p><p>“Like I would tell you!” she bit out.</p><p>She fought the instinct to lean closer to him, to inhale the spicy scent of aroused, determined male.</p><p>“Hmm, maybe you would show me,” he suggested, his voice silky smooth, heated.</p><p>Tess trembled at the low, seductive quality of his voice. It traveled through her body, tightening her cunt, making her breasts swell, the nipples bead in anticipation. Her entire body felt flushed, hot. Then the breath became trapped in her throat. His hand moved, the backs of his fingers caressing a trail of fire to the upper mounds of her heaving breasts.</p><p>He looked into her eyes, his own slumberous now, heavy lidded.</p><p>“Mine,” he whispered.</p><p>Her eyes widened at the possessive note in his voice.</p><p>“I don’t think so.” She wanted to wince at the raspy, rough quality of her voice. “I belong to no man, Cole. Least of all you.”</p><p>So why was her body screaming out in denial? She could feel the bare lips of her cunt moistening as her body prepared itself for his possession. Her skin tingled, her mouth watered at the thought of his kiss.</p><p>“All mine,” he growled as a single button slid free of its fragile mooring over her heaving breasts. “You knew there was no way I would stay away after hearing you climax to the sound of my voice, Tess. You knew I wouldn’t let you go.”</p><p>She shrugged, fighting for her composure, an independence that seemed more ingrained than needed at the moment.</p><p>“You don’t have a choice but to let me go,” she informed him, feeling trepidation dart through her at the sudden intensity in his eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His fingers stroked over the rounded curve of her breast, his expression thoughtful as he stared down at her.</p><p>“Why are you fighting me, Tess?” he suddenly asked her softly. “For two years I’ve done everything but tie you down and make you admit to wanting me. And I know you do. So why are you fighting it?”</p><p>“Maybe I want to be tied down and forced to admit it,” she said flippantly, ignoring the flare of excitement in her vagina at the thought. She had heard the rumors, knew the accusations her mother had heaped on her father’s brother-in-law for years. “Yeah, Cole, me tied down, just waiting for you and one of your best buds. Hey hon, the possibilities are limitless here.”</p><p>Her mouth was the bane of her existence. She mentally rolled her eyes at the sharp, mocking declaration.</p><p>“My best bud, huh?” He tilted his head, watching her with a slight smile.</p><p>“The more the merrier.” She moved away from him, denying herself the touch she wanted above all others. “You know how it is. A girl has to have some kind of excitement in her life. May as well go all the way.”</p><p>She was going to cut her own tongue out. Tess felt more possessed than in possession of any common sense at the moment. Tempting Cole, pushing him, was never a good idea. She knew that from experience. Yet it seemed she knew how to do little else.</p><p>“Tess, be careful what you wish for.” He was openly laughing at her. “Have you ever had two men at once, baby?”</p><p>The endearment, softly spoken in that dark, wicked voice sent her pulse racing harder than before.</p><p>“Does it matter?” She turned back to him, some demonic imp urging her to tease, to tempt in return.</p><p>She flashed him a look from beneath her lashes, touching at his hips, suppressing her groan at the size of the erection beneath his jeans. Damn, he was going to bust the zipper any minute now.</p><p>“Doesn’t matter.” He crossed his arms over his chest. “I can give you whatever you want, Sugar. If you really want it. I’m flexible.”</p><p>Cole felt his dick throb. Damn her, he knew she had no idea how far she truly was pushing him. He could see the excitement in her eyes, a glimmer of sexual heat, of determination. Did she think she could turn him off by giving him carte blanche to do his worse? She had no idea how sexual he could get. The thought of tying her down, forcing her to admit the needs of her body, or his needs, was nearly more than his self-control could bear. The thought of introducing her to the pleasures of a ménage a trois, hearing her screams of pleasure echo in his ears, had his cock so hard it was a physical ache.</p><p>He wanted Tess to have every touch, every sexual experience she could ever imagine wanting to try. He wanted her hot, wet, and begging for his cock. He wanted her to admit to her needs, just as he finally admitted to his own. He wanted Tess, now, tomorrow, forever. However he could get her, every way she would let him have her.</p><p>Cole watched the flush that mounted her cheekbones, the flare of interest in her eyes that she quickly doused. She thought it a game, a sexual repartee that she could easily brush aside later. But it didn’t change the fact that Tess had given such ideas more than a passing thought. He could see it in the hard rise and fall of her breasts, the swollen curve of them, the hard points of her nipples. They were nearly as hard as his cock.</p><p>She couldn’t know, he thought with a thread of amusement, just how much he would enjoy doing both things with her. The dominance level he possessed was incredibly high. Introducing her to being tied down, teased, tormented, or sandwiching her between his body and Jesse’s—</p><p>He had to forcibly tamp down his lust. Not that sharing her would be easy, or would happen often, but there was a particular pleasure in it that could be found in no other sexual act. The thought of total control of her body, her desires and her lusts was an aphrodisiac nearly impossible to resist.</p><p>“Tess, you shouldn’t dare me,” he warned her carefully. “You don’t know what you could be asking for, baby.”</p><p>He felt honor bound to give her one chance, and one chance only, to still the raging desires building inside him. She didn’t know, couldn’t know the sexuality that was so much a part of him. A sexuality and dark desire he had been willing to dampen for her. But her bold declaration that she could handle them was more than he could resist.</p><p>“Maybe I do know.” He loved the breathless quality in her voice, the edge of fear and lust in her voice was a heady combination.</p><p>“I would fuck your ass, Tess,” he growled advancing on her once again. “Is that what you want? My best bud sinking in that tight pussy while I push inside your back hole. You would scream, baby.”</p><p>The idea of it was making him so hot he could barely stand the heat himself.</p> <p>“Hmm...” Her pink lips pouted into a moue of thoughtfulness. “Sounds interesting, Cole. But you know, I couldn’t allow just anyone such privileges.” She sighed regretfully. “Sorry, darling, but it appears you’re out of luck.”</p><p>Oh, she was in trouble. Cole kept his expression only slightly amused, allowing his sweet Tess to dig her own grave.</p><p>“And what qualities must a man have to be so lucky?” he asked her as he deliberately maneuvered her against the wall, his body pressing against hers, not forcing her, but holding her, warming her.</p><p>For a moment, an endearing vulnerability flashed in her eyes. His heart softened at what he read there. Mingled hope and need, a flash of uncertainty.</p><p>“Something you don’t have.” He wondered if she heard the regret in her voice.</p><p>“And what would that be, baby?” He wanted to pull her to his chest, hold her, assure her that anything she needed, anything she wanted, was hers for the asking.</p><p>She pushed away from him, her natural defensiveness taking over again, that flash of pain in her eyes overriding her need to play, to tease and tempt.</p><p>“Heart, Cole. It takes a heart,” she bit out. “And I really don’t think you have one.”</p><p>Tess walked away quickly, anger enveloping her. It did little to tamp the desire or the raging cauldron of emotions that threatened to swamp her. Damn. Double damn. She couldn’t love him. She couldn’t need his love. Two years of sparring with him, fighting his advances and his heated looks couldn’t have caused this.</p><p>She felt her body trembling, her chest tightening with tears. Loving Cole was hopeless. She didn’t stand a chance against the sophisticated, experienced women he often slept with. She had seen them, hated them. Knowing he took them to his bed, made them scream for his touch was more than she could bear. Surely she didn’t love him. But Tess had a very bad feeling she did.</p><p>CHAPTER FIVE</p><p>Tess came awake hours later, a sense of being watched, studied, breaking through the erotic dream of Cole teasing her, tempting her with a kiss that never came. On the verge of screaming out for it, the presence in her room began to make itself felt.</p><p>She blinked her eyes open, frowning at the soft light of a candle on the small half moon table by her bed. Her head turned, her heart began to race. Cole was sitting on the side of the bed watching her, his blue eyes narrowed, his muscular chest bare except for the light covering of black hair that angled down his stomach and disappeared into— Her eyes widened, then flew back to his. He was naked. Sweet God, he was naked and sporting a hard on that terrified her. Thick and long, the head purpled, the flesh heavily veined.</p><p>Tess was suddenly more than aware of her nakedness beneath the heavy quilt. When she had gone to bed, she had thought nothing of it. Now she could feel her breasts swelling, her nipples hardening. Between her legs, she felt the slow, heated moistening of her fevered flesh. She felt something else, too. Her arms were tied to the curved headboard, stretched out, the same as her legs, with very little play in the rope. Son of a bitch, he had tied her on her bed like some damned virginal sacrifice.</p><p>“What have you done?” She cleared the drowsiness from her voice as he sat still, watching her with those wicked, sensually charged eyes. “Untie me, Cole. What are you doing here?”</p><p>“First lesson,” he told her, his voice soft as his lips quirked in a sexy grin. “Are you ready for it?”</p><p>“Lesson?” She shook her head, her voice filled with her surging anger. How dare the son of a bitch tie her up? “What the hell are you talking about, Cole?”</p><p>His hand lifted. Tess thought he would touch her, grab her, instead, those long fingers wrapped around his cock absently, stroking it. She swallowed tightly, her mouth watering, aching to feel that bulging head in it. She may have even considered giving into the impulse, if she could have moved her body.</p><p>“Your first lesson in being my woman, Tess,” he told her, his voice cool, determined. “I told you I was tired of waiting on you. Tonight, your first lesson begins.”</p><p>Tess rolled her eyes as she breathed out in irritation.</p><p>“Are you a secret psycho or something, Cole?” she bit out. “Did you just pay attention to what you said? Now let me go and stop acting so weird. Dammit, if you wanted to fuck, you should have just said so.”</p><p>He smiled at her. The bastard just smiled that slow, wicked grin of his.</p><p>“But, Tess, I don’t want to just fuck,” he said, his voice amused. “I want you know who controls your body, your lusts. I want you to know, all the way to your soul, who owns that pretty pussy, that tempting little ass and hot mouth. I want you to admit they’re mine, and mine alone to fuck however I please.”</p><p>Damn. She knew Cole was into kink, but rape?</p><p>“Cole.” She fought to keep her voice reasonable. “This is no way to go about getting a woman, hon. Really. You know, flowers, courtship, that’s the way to a woman’s heart.”</p><p>“Really?” He was openly laughing at her now. “I sent you flowers, darling—”</p><p>Her eyes widened.</p><p>“Oh yeah, with a card telling me what size butt plug to buy so you could fuck my ass,” she bit out as she jerked at the ropes binding her ankles. “Real romantic, Cole.”</p><p>She remembered her sense of horror, the shameful excitement when she read the card. She had dumped flowers and all in the trash, but kept the card. Why, she wasn’t certain.</p><p>He shrugged easily. “Practical,” he told her. “I wanted you prepared. But since you were unwilling to prepare yourself, then you’ll just have to accept the pain.”</p><p>Pain? No. No pain.</p><p>“Now look, Cole,” she warned him reasonably. “Father will be really pissed with you. And you know I’ll tell—”</p><p>“I asked your father’s permission first, Tess,” he told her softly, his expression patient now. “Why do you think your mother finally left your father? She refused to accept who he was and what he needed. I will not make that mistake with you. You will know, and you will accept to your soul, your needs as well as my own. You won’t run from me. Your father understands this, and he’s giving me the time I need to help you understand.”</p><p>Tess stared up at Cole, fury welling inside her as her arms jerked at the ropes that held her. Damn him, they weren’t tight, but there wasn’t a chance she could smack that damned superior expression off his face.</p><p>“You’re lying to me,” she accused him. “Father would never let you hurt me.”</p><p>“Ask him in the morning.” He shrugged lazily. “You’ll be free by then.”</p><p>A sense of impotency filled her. Damn him, he thought he had all the damned answers and all the damned plans. She wasn’t a toy for him to play with, and she would show him that.</p><p>“I’ll have you arrested,” she promised him. “I swear, if it’s the last thing I do I’ll have you locked up.”</p><p>He was quiet for long moments, his eyes glittering with lust, with cool knowledge.</p><p>“I wouldn’t do that if I were you. And I think come morning, perhaps you will have changed your mind.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tess breathed in hard, watching him with a sense of fear, and hating the arousal that it brought her.</p><p>“What are you talking about?” she bit out.</p><p>His hand ceased the lazy stroking of his cock, then moved to her stomach. Her muscles clenched involuntarily at the heat and calloused roughness of his flesh.</p><p>“Tonight, I’ll give you a taste of what’s coming,” he promised her. “You’ll learn, Tess, who your master is, slowly. A step at a time. Nothing too hard, baby, I promise.”</p><p>Tess shivered. He didn’t sound cruel, but he was determined. His voice was soft, immeasurably gentle, but filled with purpose. He would have her now, and he would have her on his terms.</p><p>“This isn’t what I want, Cole,” she said, fighting for breath, for a sense of control.</p><p>His hand moved lazily from her stomach, his eyes tracking each move, his fingers trailing between her thighs until one ran through the thick, slick cream that proved her words false. She trembled, biting back a moan of pleasure as the thick length of his finger dipped into her vagina.</p><p>“Isn’t it?” he whispered. “I think you’re lying, Tess. You shouldn’t lie to me, baby.”</p><p>Before Tess knew what was coming, his hand moved, then the flat of his palm delivered a stinging blow to the bare flesh of her cunt.</p><p>Tess jerked at the heat. “You son of a bitch,” she screamed, jerking against her bond, ignoring the lash of pleasure that made her clit swell further. “I’ll kick your ass when I get out of here.”</p><p>Cole grinned, then moved from her side to position himself between her spread thighs.</p><p>“Let me go, you bastard!” she bit out, fighting to ignore the shameful pleasure and anticipation rising inside her.</p><p>“Naughty Tess,” he whispered, his hand smoothing over her cunt, sliding over the moisture that lay thick and heavy on her pussy lips. “You’re tight, Tess. How long has it been since you had a lover?”</p><p>“Kiss my ass!” she cried out, then jerked in surprise as his palm landed on the upper curve of her cunt. She fought the ropes, terrified of the shocking vibrations of pleasure in her clit that radiated from the heat of the blow. “Damn you!”</p><p>Her body arched as his finger slid inside her vagina once again. It was a slow stroke, the hard digit separating her muscles, making the flesh tremble in building ecstasy. She fought the need to whimper, to beg at the slow penetration.</p><p>“How long, Tess, since you’ve had a lover?” he asked her again.</p><p>Tess realized she was panting now, primed, ready to climax. God, if he would just let her get off.</p><p>“I hate you,” she growled.</p><p>His finger stopped. Halfway inside her, her muscles clenching desperately in need, and he stopped.</p><p>“You aren’t being nice, Tess,” he whispered. “I could leave you tied here, hot and hurting for relief, or I could give you what you need, eventually. Now, answer my question. How long?”</p><p>The threat was clear. His finger was still inside her as he watched her, his expression hard now, though his eyes retained that lazy, gentle humor. The contrast was almost frightening.</p><p>“Four years. Satisfied—Oh God!” Her back arched, her head digging into the pillows as his finger slid home with a smooth, forceful plunge.</p> <p>Tess was shuddering, her climax so close she could feel it pulsing in desperation.</p><p>“Damn you’re tight, Tess.” His fingertip curved, stroking the sensitive depths as she writhed against her bonds. “As tight as a virgin. I bet your ass is even tighter.”</p><p>Tess stilled, quivering, seeing the lust, the excitement filling Cole’s face. His cock was huge, thick and long, and she knew it would stretch her pussy until she was screaming for relief. But her ass? No way. From the look on Cole’s face though, he had figured out the way of it, exactly.</p><p>CHAPTER SIX</p><p>“Cole, let’s be reasonable,” Tess panted, her cunt clenching over the finger lodged inside it, quivering from the deep, gentle strokes his fingertip was administering. “Your cock will not fit there. Stop trying to scare me.”</p><p>But she had a feeling it wasn’t an idle threat.</p><p>He smiled. She knew better than to trust that smile. It was a slow curve of his lips, a crinkle at the corners of his eyes. Watching her carefully, he slid his finger from the soaked depths of her hot channel and then moved to lie down beside her.</p><p>Tess watched him carefully, like a wild beast as he propped his head on his arm and watched her through narrowed eyes. Then his gaze shifted, angling to her thighs, her eyes following as his hand moved.</p><p>“No—” she cried out helplessly as his hand raised.</p><p>She jerked. His head moved, his lips latching on a hard, pointed nipple a second before he delivered another stinging blow to the wet lips of her cunt.</p><p>She cried out, pleasure and pain dragging a helpless sound of confused desire from her lips as her body bowed and she jerked against him. His tongue rasped her nipple as he suckled her, and the next blow to her cunt was delivered to the flesh that shielded her swollen clit. Her cry was louder, her body jerking, arching, fighting both pain and pleasure as she struggled to separate the two. She was on fire, her head reeling from the confusing morass of sensations. She wanted to beg for more, beg for mercy.</p><p>Another blow struck her, his palm angled to deliver the blow from her clit to her vagina as he pinched her nipple between his teeth. The stinging pain, hot and fierce had her clit throbbing as she screamed from a near climax.</p><p>“ Please,” she begged, her head thrashing against the pillow as she felt his arm rise again. “Please, Cole—“</p><p>A strangled scream left her throat as the hardest blow landed, striking with force and fire, sending her clit blazing, her orgasm peaking against her will. It shuddered through her body as his palm ground into her clit with just enough pressure to trigger her release.</p><p>Then his lips covered hers with a groan, his tongue spearing into her mouth with greed and hunger. Tess fought to get closer, her arms and legs protesting their confinement as she met his kiss with equal voraciousness, her tongue tangling with his, her moans a harsh rasp against her throat as she felt her cunt throb, her vagina ache for more.</p><p>Tess shuddered with the throbbing intensity of her climax, a distant part of her was shocked, amazed that she could respond in such a way. Fiery tingles of sensation coursed over her body, licked at her womb, left her greedy, hungry for more. Her cunt was empty, a gnawing ache of arousal tormenting it now. It wasn’t enough. She needed more. So much more.</p><p>“Do you need more, Tess??” he growled as he pulled back and stared down at her.</p><p>His eyes were no longer patient, they were hot and hungry, watching her intently.</p><p>“More. Please, Cole. I need you,” she moaned staring up at him as her body moved restlessly, needing him, wanting his cock until she could barely breathe, her arousal was so intense.</p><p>He moved back, his hand going between her thighs, a ravenous groan coming from his throat as he felt the thick layer of cream that now coated her flesh.</p><p>“Your pussy’s so hot, Tess.” His voice sounded tortured. “So hot and sweet, I could make a meal of you now.”</p><p>“Yes.” She twisted against him, needing him to touch her, to fuck her, to relieve the yawning pit of exquisite need throbbing inside her.</p><p>“Not yet,” he denied her, making her whimper. “Not yet, baby. But soon. Real soon.”</p><p>She watched as he moved from her, going to his knees then propping her pillows beneath her shoulders and head.</p><p>“You know what I want, Tess,” he told her, his voice rough, his cock aiming for her lips. “Open your mouth, baby, give me what I want.”</p><p>Anything. Anything to convince him to relieve the ache that throbbed clear to her stomach. Her lips opened, and she moaned as the thick head pushed past them, stretching them wider. He was huge, so long and thick she wanted to cry out in fear, scream at him to hurry and fuck her with it.</p><p>“Oh yeah, such a hot little mouth,” he groaned, wrapping his fingers around the base as he penetrated her mouth, stopping only when her eyes began to widen with the fear he would choke her. “Relax your throat, Tess,” he urged her. “Just one more inch, baby. Take one more inch for me and I’ll show you how good I can make you feel next.”</p><p>Her pussy throbbed out her answer. Yes, take more, bitch. Take it all so he’ll fuck me. The ravenous creature that was her cunt demanded her obedience as fiercely as Cole did. Breathing through her nose, her eyes on his, she slowly relaxed the muscles of her throat, feeling him by slow increments give her the final inch he demanded she take.</p><p>His hand tightened on his cock, his finger brushing her mouth as he marked her limit, and still there was so much more. He pulled back as Tess suckled the thick length, her tongue washing over it, rasping the underside of his dick as he nearly pulled free of her mouth until she was slurping on nothing but the engorged head, and loving it.</p><p>Then he began to penetrate again. A slow measured thrust that sank his cock to the depth he marked, his expression tightening with such extreme pleasure that she fought to caress the broad head that attempted to choke her. She let her throat make a swallowing motion, a tentative movement to test her ability to do it.</p><p>Cole groaned, his dick jerking in her mouth as he pulled back, thrust home again. She repeated the movement, watching his face, never letting go of his expression as he began to fuck her mouth. He was panting, his teeth clenched, his hard stomach clenching.</p><p>“Yes, swallow it,” he growled when she repeated the motion. “Swallow it, baby. Show me you want my cock.”</p><p>He was fucking her mouth harder now, her lips stretched so wide they felt bruised, but Tess loved the feeling, loved watching the excitement, the extreme lust that crossed his face each time her throat caressed the head of his cock. His hips were bucking against her, his voice a rumbled growl as he fucked her lips, pushing his cock as deep as it could go, groaning as the flesh tensed, tightened further.</p><p>“Yes. I’m going to cum now, Tess. I’m going to cum in your hot little mouth just like I’m going to cum up that tight little ass. Take it, baby, take my cock.” He speared in, she swallowed, his hips jerked, then Tess felt the first hard, hot blast of his semen rocket against the back of her throat. It was followed by more. Thick hard pulses of creamy cum spurted down her throat as he cried out above her.</p><p>Tess was ecstatic, quivering with anticipation as she felt his cock, still hard, pull out of her mouth. He would fuck her now. Surely, he would fuck her now.</p><p>“You’re so beautiful, Tess,” he whispered as he moved away from her, staring down at her, his eyes gentle once again. “So damned hot and beautiful, you make me crazy.”</p><p>“Good,” she moaned. “Fuck me now, Cole. Please.”</p><p>He smiled, and her eyes widened as he shook his head.</p><p>“What?” she bit out, incredulously. “Damn you, Cole, you can’t leave me like this.”</p><p>“Did I say I was leaving you?” he asked her, arching his brow in question. “No, Tess, I’ll be here with you, all night, every night. But you’re not ready to be fucked yet.”</p><p>“I promise I am,” she bit out. “I really am, Cole.” If she got any more ready, she would go up in flames.</p><p>He chuckled, though the sound was strained.</p><p>“Not yet, Tess,” he whispered. “But soon.”</p><p>He moved across the room, and then Tess noticed the small tray that sat on the mantle of her wall-enclosed dresser. He picked it up and as he turned back to her, Tess’s eyes widened in apprehension.</p><p>There were several sexual aids laying on the silver tray, as well as a large tube of lubrication. The one that frightened her most, was the thick butt plug that sat on its wide base. Tess trembled at the sight of it, shaking her head in fear as he neared her. If only she was frightened enough, she thought distantly. God help her, her cunt was on fire, her body so sensitive she thought a soft breeze would send her into climax. And seeing those toys, the thick butt plug and the large dildo, had her trembling, not just in fear, but in excitement. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He set the tray on her nightstand, then sat on her bed, staring at it.</p><p>“If you don’t stay aroused, needing me and what I’ll give you, then I’ll walk away,” he said, his voice so soft she had to strain to hear it. “But I’ll push you, Tess, see what you like, see what you can take. Not just tonight, but all week. You’re mine until the night of your father’s party. No matter what, no matter when, as long as what I’m doing arouses you.”</p><p>“And if it doesn’t?” she asked angrily. “What are you going to do, hurt me until I can’t take it anymore?”</p><p>He turned to her, his eyes blazing.</p><p>“Only I can give you what you want, what you need,” he bit out. “You’re so damned hot to be dominated you can’t stand it. Do you think I don’t know that? Did you think you were told the rumors of my preferences needlessly? If you weren’t excited by it, Tess, you wouldn’t have been so wet you soaked my hand two years ago when I caught you in the hall. You’re just scared of it. And I want you too damned bad to let you stay frightened of what we both need any longer.”</p><p>“I won’t do it!” But excitement was electrifying her body, making every cell throb in anticipation.</p><p>“Won’t you?” he growled. “I know about the books your mother found in your room when you went to college, Tess. The stories you read, to satisfy that craving you couldn’t explain.”</p><p>Her face flushed. Her mother had been enraged over the naughty books she had found in Tess’s room that year.</p><p>“Captives, dominated by their lovers. Submissive, loving every stroke of the sensual pleasure they received.</p><p>Tess could feel her flush of mortification staining her entire body.</p><p>“Did you ever fuck your ass, Tess?” he asked her softly, leaning toward her, watching her closely. “As you stroked your cunt, fighting for orgasm, did your finger ever steal into that hot, dark little passage, just to see what it felt like?”</p><p>She had. Tess moaned in humiliation. But it hadn’t been her finger, rather it had been the rounded, slender vibrator she kept hidden. The dark surge of pleasure that had spread through her had been terrifying. Even worse had been the hard, shocking quake of an orgasm that had her nearly screaming, ripping through her body, and making her cunt gush its slick, sticky fluid. The remembered pain of the penetration, the humiliation of that rushing liquid squirting from her had caused her to never try such a thing again except with her fingers. Even now, years later, the thought of that one act was enough to leave her flushing with shame.</p><p>“Did it hurt, Tess?” And of course, those wicked eyes knew the flush of admission on her skin. “Did it make you want more?”</p><p>“No,” she bit out, shaking with nerves, with arousal.</p><p>“I think it did.” He touched her cheek, his fingers caressing her flesh, his voice gentle. “I think I left you aching, needing, and too damned scared to try to reach for it. I think, Tess, that you need me just as much as I need you.”</p><p>“And I think you’re crazy,” she bit out, refusing him, wondering why she was when she needed it so damned bad.</p><p>His thumb stroked over her swollen lips, his eyes dark, glittering in the light of the candle.</p><p>“Am I?” he asked her softly. “Let’s see, Tess, just how crazy I am.”</p><p>CHAPTER SEVEN</p><p>Tess watched Cole, trying to still the hard, rough breaths that shook her body. She couldn’t seem to get enough oxygen, couldn’t seem to settle the hard shudder of her pounding heart.</p><p>“There’s a fine line that divides pleasure and pain,” he told her as he removed the butt plug from the tray, and the tube of lubricant. “It’s so slim, that if went about the right way, the pain adds to the pleasure, in a dark erotic manner.”</p><p>He moved to the bottom of the bed. He loosened the ropes attached to the footboard, then grabbed her legs quickly before she could kick out at him. Ignoring her struggles and heated curses, within minutes he had her entire body flipped over, the ropes once again holding her in position as he tucked several pillows beneath her hips.</p> <p>“You bastard.” Her voice was strangled as crazed excitement shot through her body.</p><p>Her buttocks were arched to him now. She was spread, open to him, and the flares of fear and excitement traveling through her body had her terrified.</p><p>“God, Tess, you’re beautiful,” he growled from behind her, his voice rough, filled with lust. “Your little ass so pink and pretty. And I like how you keep your pussy waxed so soft and smooth. But I would have preferred to do it myself. &gt;From now on, I’ll take care of it for you.”</p><p>Tess trembled, crying out. She should hate this. She should be screaming, begging him to stop, instead her body pulsed in need and desire, in anticipation.</p><p>“You shouldn’t have waited so long to come back, Tess,” he whispered as he kissed one full cheek of her ass. “You shouldn’t have made me wait so long, baby, because I won’t be able to be as gentle as I would have been.”</p><p>Her cunt pulsed at his words.</p><p>“And I’ll have to punish you.” She whimpered at the rising excitement in his voice. “But I would have anyway, Tess. Because I need to see that pretty ass all red and hot from my hand.”</p><p>“No—“ Despite her instinctive cry, his hand fell to the rounded cheek of her ass.</p><p>Heat flared across her flesh, then she screamed as his finger sank into her pussy a second later. She twisted, writhed against her bonds.</p><p>“You’re so wet,” he groaned. “So tight and hot, Tess. But by the time my cock sinks into your pretty pussy, you’ll be tighter.”</p><p>His hand struck again as the broad finger retreated from her quaking vagina. As the heat built in the flesh of her buttocks, his finger sank in again. Tess was crying out in fear and a wash of dark, erotic excitement. The blows weren’t cruel, rather sharp and stinging, building a steady heat in her flesh.</p><p>“So pretty.” He whacked the other side, then his finger thrust into her again.</p><p>She was so wet she was dripping. He alternated mild and stinging blows that kept her flinching in anticipation. Kept her flesh heated, the pain flaring through her body. A pain she hated, hated because the pleasure from it was driving her crazy. She could feel her juices rolling from her cunt, hear her cries echoing with needs she didn’t want to name.</p><p>By the time he finished, her ass felt on fire, her hips were rolling, her cunt throbbing. She was dying of need. If he didn’t fuck her soon, she would go crazy. She was burning, inside and out, a wave of fiery lust tormenting her loins as she fought the depraved pleasures of the spanking.</p><p>“Your ass is so pretty and red now,” he groaned. “Damn, Tess, I like you like this, baby, all tied up for me, reddening, your cunt hot and tight and so wet it soaks my fingers.” Two fingers plunged inside her.</p><p>“Cole—” Her cry was hoarse and desperate as her orgasm teetered her on an edge of agonized excitement.</p><p>“I’m going to put this butt plug up your ass now, Tess,” he warned her as he drew his fingers from her body. “Then I’ll fuck you, baby. I’ll fuck you so deep and hard you won’t ever leave me again.”</p><p>Tess’s head ground into her pillow as his hand separated her buttocks. She flinched at the feel of cold lubricant, then cried out again as his finger sank fully into the tight hole. It pinched, sent a flare of heat through her muscles that had her bucking into the thrust.</p><p>“Oh, Tess, your ass is so tight.” He twisted his finger inside her, spreading the lubrication, stretching the muscles as she whimpered in distress. “It doesn’t want to stretch, Tess. Such a pretty virgin hole.”</p><p>As full as his finger filled her, how would she ever take more? She tightened on him in fear, then moaned as the heated pain made her cunt throb hotter. She was depraved. She should be terrified, fighting him, instead her whimpers were begging for more.</p><p>He repeated the lubrication several times as Tess fought to breathe past the pleasure and pain. She was ready to scream, to beg for more. She wanted to whisper the forbidden words. She bit her lip, panted, cried out as his finger finally withdrew.</p><p>“Tess, I want you to take a deep breath,” he finally instructed her heatedly. “Relax when the plug starts in, it will ease the pain if it’s too much for you at first.”</p><p>“You’re torturing me,” she cried out, bucking against her ropes. She didn’t want this now. She was too scared. The dark lust rolling over her was too intense, too frightening. “Stop, Cole. Let me go!”</p><p>“It’s okay, Tess.” His hand smoothed over her bottom then his fingers clenched, separating her again. “It’s okay, baby. It’s normal to be scared. Just relax.”</p><p>“Cole—” She didn’t know if her cry was in protest or in need as she felt the tapered head of the thick plug nestle against her tiny hole.</p><p>“It’s going to hurt, Tess.” His voice was dark, excited. “You’re going to scream for me, and you’re going to love it. I know you will, baby.”</p><p>“Oh God.” She tossed her head on the pillow but couldn’t help allowing her body to relax marginally.</p><p>She felt the device begin to penetrate the tight hole. At first, the piercing sensation was mild, but as the length and thickness increased, the steady, building fire began to shoot through her body.</p><p>She tensed, but Cole didn’t ease up. She cried out as it grew brighter, then began begging as pain bloomed in her anus. But she wasn’t begging him to stop.</p><p>“It hurts,” she screamed out. “Oh God, Cole. Cole please—”</p><p>He didn’t relent, instead, the fingers of his other hand moved to her pulsing cunt. There, they stroked and petted her clit until she was thrusting, pushing into his hand, crying out as the movement pushed the plug deeper into her ass.</p><p>She could feel her muscles stretching, protesting but eventually giving way to the thick intruder invading it. She bucked against her ropes, rearing back, writhing under the lash of burning pain, and equally burning pleasure.</p><p>“Damn you!” Her voice was hoarse, enraged from the building kaleidoscope of sensations rushing through her body.</p><p>The fiery heat of the invasion, the slow steady buildup of pain, the resulting agonizing pleasure so overwhelmed her senses that she felt dazed with it, awash in a darkly sensual reality where nothing existed except the slow, steady invasion of her ass, and the soft, too light caresses to her throbbing clit.</p><p>Long minutes later she jerked harshly as the last inch of the plug passed the tight anal ring, leaving seven inches of hard thick dildo lodged inside her. She squirmed, fighting to accustom herself to the sensation. Cole chose that moment to land his hand heavily on her ass again. Tess screamed, her muscles tightening around the plug, inflicting a disastrous form of ecstasy.</p><p>“Now, Tess,” Cole growled. “Now, I get to eat that pretty pussy.”</p><p>CHAPTER EIGHT</p><p>Tess’s cries were echoing in his head, throbbing in his cock. Cole couldn’t remember a time he had been so turned on, so hot and ready to fuck. He wanted to plunge his cock as deep, as hard up her tight cunt as he could. He wanted to slam it inside her, master her with the brutality of a fucking so lustful that she would find it impossible to leave the only man who could give it to her.</p><p>But he knew, the longer he could keep her hanging on the edge of the sensations ripping through her, the more she would crave it later. He was a slave to the need to be the one who pleasured her.</p><p>The piercing of her ass with that plug had been the most erotic, satisfying thing he had done in his life. He wondered if she was even aware of how loud she had begged for more. How many times she had pleaded with him to push it hard inside her, to take her. He doubted it. Submissives rarely remembered that first time, those first long minutes that the plug, or a hot, thick cock invaded their ass. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was the pain and pleasure combined. The needs, so shocking, so consuming that they dazed the mind to the point that the submissive rarely remembered begging for it.</p><p>“Fuck me,” Tess still begged, her voice was thick and desperate as her cunt leaked the honeyed cream of her need. And he would fuck her. Soon.</p><p>He lifted a small, oblong metal device from the tray. It was attached to a long cord with a control box at the end. A silver bullet it was called. So tiny it appeared harmless, but the effects of its internal vibrations would send Tess into such a haze of rapture that she would never forget it.</p><p>He inserted the three-inch long device into her cunt. His cock clenched at the closed fist tightness he encountered as he pressed it past the fullness of the plug lodged in her ass and moved it to the back of her cunt. He positioned the little device for maximum vibration against her G-spot then withdrew. He set the control on low, a gentle, stroking vibration that nonetheless caused her to flinch. Then he set about feeding himself from her cunt.</p><p>He lapped at her pussy, just as he had once promised her he would. Gentle strokes into her vagina with his tongue that had her bucking against his mouth, begging for more. Her body was sheened with sweat, her breathing harsh, her cries desperate as he tongued her, stroked her. And she tasted so damned good he couldn’t help himself but to thrust his tongue as deep inside her as he could go, and draw more of her into his mouth.</p><p>Cole was on fire for her. He knew his control was slipping, something that never happened, something he had never had to fight to keep before. But he had to prepare her, he couldn’t allow himself to unwittingly hurt her. Tess was everything to him. His heart, his soul, the happiness he had always believed he would never find. She teetered between erotic pain and the pain that could irrevocably damage her sexuality forever. If he wasn’t careful, extremely careful, then he would destroy both of them. Because Cole knew he couldn’t go much longer without her.</p><p>So he tamped down his own lusts, stroked her gently, gauged her need and advanced the speed of the vibrator accordingly. She was bucking in his hands now, nearing that point of no return. Reluctantly, he moved back from her dripping vagina, licked back, circled her clit with his tongue. Then he turned, laying on his back, positioning himself to suck the swollen, engorged bud into his mouth as he edged the speed of the vibrator higher.</p><p>She exploded, her body tensed. Her scream was strangled, breathless as her body bowed, jerked, then began a repeated shudder that signaled the beginning of her orgasm. He tightened his lips on her clit, flicked it with his tongue and held her hips with easy strength when the hot, volcanic rush of her release began to rush through her body.</p><p>Tess was dying. She knew she was dying and she eagerly embraced the exquisite rush of painful pleasure that threw her over the brink. Her body was jerking uncontrollably, her orgasm filling her body, pumping through her blood, spasming her uterus as it tore through her. She could feel the hard vibration inside her, Cole’s lips at her clit, blending into a raging storm she knew she wouldn’t survive. Hard shudders rushed over her, pleasure, unlike anything she could have conceived tore her apart. And in a distant part of her mind, she wondered if she would ever be the same again. If she survived it.</p><p>She screamed against the torrent, but couldn’t fight it. She could feel her fluids gushing through her pussy as it spasmed, and Cole’s mouth moving to catch them with a hard, male groan. His tongue speared inside her tortured cunt, triggering another hard shudder, another gush of fluids until finally, she collapsed mindlessly against her ropes, dazed, stripped of strength.</p><p>Small tremors still assaulted her boneless body. The never-ending pulse of her climax didn’t go away easily. She could hear Cole, a hard, brutal male groan echoing through the room as his body jerked against her. Had he come? Had he been inside her and she didn’t know it? It didn’t matter. She was drifting on a haze of pleasure so weak, so astounding that she couldn’t think, and didn’t want to.</p><p>“Tess?” Cole’s voice was tender, warm as he moved behind her. “Are you okay, baby?”</p><p>She felt the ropes loosening, his hands calloused and gentle on her skin as he untied her, helped her to stretch out on the bed. She lay boneless, so satiated she could barely move. She was aware of Cole moving along the bed beside her, turning her over to her back, his expression, when she looked up at him, was concerned, gentle.</p><p>“Sleepy,” she whispered. And she was. So tired, so emotionally and physically drained she could barely stay awake.</p><p>“Sleep, Tess.” He kissed her cheek gently. “Rest, baby. We start again tomorrow.”</p><p>Cole lay down beside her, drawing the quilt over them, ignoring the pulse of his still throbbing cock. He had climaxed with Tess, but it wasn’t enough. He needed to be buried inside her, feeling her, tight and hot, enclosing him with her satin heat.</p><p>And he knew the fight wasn’t finished. Accepting the pain-filled pleasure would be the easy part for Tess. Submitting to him would be the hard part. Giving in to him, no matter what he asked of her, no matter what he demanded for her sexual pleasure, would be the fight. One he looked forward to. He knew Tess better than she knew herself. He knew from her father’s admission of the books her mother had found, what turned her on. It wasn’t the pain, it was the domination, the submission into the sexual extremes that she craved. She wanted to fight. She wanted to be vanquished, and he wanted to give it to her.</p><p>He pulled her against him, luxuriating in the warmth of her body, her very presence. He had dreamed of this for two years. He knew the moment he met Tess that she held a part of him that no other woman ever could. The thought of it had tormented him, racked him with lust. In the past months, it had grown worse. He lived and breathed daily with the need for her. It was like a fever burning his loins that he couldn’t escape.</p><p>And now he had her. By Valentine’s night, her final lesson, her final erotic dream fulfilled, she would know who mastered her body and her heart.</p><p>CHAPTER NINE</p><p>Tess was sore. Her entire body throbbed, protesting her wakefulness. The muscles of her legs were stiff and burning, her arms and even her breasts were sore.</p><p>“Open your eyes, Tess. We have to remove the plug and you need a hot bath.” Cole’s voice was firm, brooking no refusal.</p> <p>Her eyes snapped open, her head turning to him, her eyes focusing on the savage features of his face.</p><p>“You left that thing in me?” she bit out incredulously.</p><p>He arched a single brow.</p><p>“Your ass was tight, Tess. It needs to accustom itself to stretching before you’ll ever be able to take my cock there.”</p><p>Her heart slammed into her ribs.</p><p>“Go to the bathroom, then come back here. If you try to remove it yourself, I’ll tie you back down and leave you there the rest of the day.”</p><p>He meant it. She saw his determination in the hard lines of his face.</p><p>“Take it out first,” she said instead.</p><p>He shook his head. “Do as I say, Tess. I have a reason for my demands, baby.”</p><p>Tess frowned, but she knew she did not want to experience the torture of being tied down and frothing with need. And she knew he would make her froth. He would torture her, then leave her to suffer in her arousal. She wasn’t ready to take that chance yet, not after last night.</p><p>So she rose from the bed, walking gingerly to the bathroom. After relieving her most pressing need, she brushed her teeth and washed her face then returned to the bedroom. Her stomach rolled with nerves, wondering how Cole planned to continue the sensual torture he had started last night.</p><p>“On your knees.” He nodded to the bed, standing beside it, naked and sporting an erection that resembled a weapon.</p><p>His cock was the largest she had ever seen, nearly as thick as her wrist, with a bulging, flared head that made her mouth water at the sight.</p><p>Tess went to the bed, assuming the position she knew he wanted. She trembled as his hand caressed the cheeks of her rear. His fingers ran down the crease of her ass until he gripped the plug, pulling it slowly, gently, free of her bottom.</p><p>“Stay still,” he ordered her before she could move. “Under your cabinet are some personal supplies I bought for you. From now on you will use them whenever I tell you to do so. Understood?”</p><p>“Yes,” she whispered, feeling her cunt burn, moisten as he ran his hands over her ass.</p><p>“I’m not going to fuck you now because to be honest, I don’t think I can keep my cock out of your ass. But I need relief, baby.”</p><p>He moved around the bed then, turning her as he faced her, his cock aiming at her mouth. Tess licked her lips. She opened them as the purpled head nudged against them. She heard his hard groan as she closed her lips around his cock, taking him, opening her throat to take that last inch possible.</p><p>One of his hands gripped his cock, to assure he didn’t give her more than she could take, the other twisted in her hair. The sharp bite of pain had her mouth tightening around his cock, her throat working on the head as he cried out in pleasure. He wasn’t willing to prolong his own pleasure this morning though. His thrust in and out of her mouth with deep, hard strokes, holding her still as he groaned repeatedly at the pleasure she was bringing him. Then, she felt his cock jerk, throb, and the pulse of his sperm filling her mouth as he cried out his release.</p><p>Cole was breathing hard when he pulled back from her, his cock was still engorged, still ready for her, but he did nothing more.</p><p>“Go bathe, Tess, before I do something neither of us is ready for. Come down to breakfast when you’re finished.”</p><p>Tess stood up, watching him fight for control.</p><p>“Is Father home?” she asked</p><p>“Not yet.” He shook his head. “He’ll be back the night before the party. You’re mine until then, Tess. Can you handle it?”</p><p>Her eyes narrowed at his tone of voice, the suggestion that she couldn’t.</p><p>“I can handle you any day of the week.” Damn her mouth, she groaned as the words poured from her lips.</p><p>His lips quirked. They both knew better.</p><p>“We’ll see.” He nodded. “Go bathe. I’ll lay out what I want you to wear this morning. The servants have been given the rest of the week off as well, so there’s just you and me for a while.”</p><p>Tess bit her lip. She wasn’t certain if that was a good thing or not.</p><p>“Go.” He indicated the bathroom door. “Come downstairs when you’re ready.”</p><p>An hour later Tess walked down the spiraling stairs, barefoot and wearing more clothes than she thought he would lay out for her but decidedly less than she wanted to wear. The long, silk negligee made her feel sexy, feminine. It covered her breasts but was cut low enough that if he wanted them out, he would have no problems. There were no panties included, but the black silk shielded that fact. She would have been uncomfortable in something he could have seen right through.</p><p>His note had stated that he would await her in the kitchen, and there he was. Dressed in sweat pants and nothing else, his thick black hair still damp, looking sexier than any man had a right to look. And he was smiling at her. Even his eyes were filled with a lazy, comfortable expression as he set two plates of eggs, bacon and toast beside full coffee cups.</p><p>“Breakfast is ready, you’re right on time.” He pulled her chair out, indicating that she should sit.</p><p>Tess took her seat gingerly, the soreness of her muscles was much better, but her thighs and rear were still tender.</p><p>“Sore?” He brushed a kiss over her bare shoulder, causing her to jerk in startled reaction.</p><p>She turned her head, looking up at him as he straightened and moved to his own chair.</p><p>“A little.” She cleared her throat.</p><p>“It will get easier,” he promised. “Now eat. We’ll talk later, after you’ve been fed.”</p><p>Breakfast, despite her initial misgivings, was filled with laughter. Cole was comfortable and his easy humor began to show. His dry wit kept her chuckling and the wicked sparkle in his eyes kept her body sizzling, kept her anticipating later, praying he would fuck her. The longer he waited, the hotter she got. She didn’t know if she would survive it much longer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Finally, after the dishes were finished, he drew her through the house into the comfortable living room. A fire crackled in the corner of the room where a large, thick pillow mattress had been laid.</p><p>“Sit down, we need to talk.” He drew her down on the mattress, then onto her back as he lay beside her.</p><p>“Look, I don’t much feel like talking,” she finally said in frustration. “Let’s just cut to the chase here, Cole. There are things I evidently like, that you enjoy doing. I don’t want to talk about them. Just do them.”</p><p>She stared up at him, narrowing her eyes, warning him that she too had her limits.</p><p>He propped his head on his hand, regarding her with a curious expression.</p><p>“I expected more of a fight,” he said, a vague question in his voice.</p><p>Tess sighed, sitting up staring into the fire as she ran the fingers of one hand through her hair.</p><p>“How extreme do you intend to get?” she finally asked him, glancing at him as he still reclined beside her.</p><p>He reached over, his fingers trailing down her hair. “How extreme do you want me to get, Tess?” he asked instead. “I can give you whatever you want, anything you want. But I have my own needs, and they will have to be satisfied as well.”</p><p>“Such as?” she asked him, keeping her voice low, stilling the tremor that threatened to shake it.</p><p>“I like the toys, Tess. I like using them, and I’m dying to use them on you. I like spanking you. I like watching your pretty pussy and the rounded cheeks of your ass turning red. I like hearing you scream because you don’t know if it hurts or if it’s the pleasure killing you. I want to see your eyes filled with dazed pleasure as I push your limits.” He laid it out for her pretty well, she thought with an edge of silent mockery, and still didn’t answer a damned thing.</p><p>“How far will you go?” she asked him.</p><p>“How far will you let me go?” he countered her.</p><p>Tess had a feeling she would have few limits, but she wasn’t willing to tell him that.</p><p>“You evidently have plans. I’d like to know what they are.”</p><p>Cole sighed. “Some things are better left up to the pleasure of the moment. Let’s wait and see what happens.”</p><p>Tess licked her lips in nervousness. Evidently her father had told him about the debacle with the books her mother had found. He wouldn’t have known about them otherwise. She took a deep, hard breath.</p><p>“Does it concern other men?” she finally asked.</p><p>His eyes lit up in arousal. Tess lowered her head to her knees. God, she didn’t know if she could.</p><p>“You want it, Tess.” He moved behind her, sitting up to pull her against him as he whispered the words in her ear. “You’ve wanted it for a long time, baby, everything I have planned. Just settle down, and we’ll take it step by step.”</p><p>Tess was fighting to control her breathing, her heart rate. She was terrified of him, and of herself.</p><p>“I can’t, if Father found out—”</p> <p>“Tess, your father knows,” he said gently. “Why do you think your mother divorced him? She didn’t want sex, let alone what he needed. Your father knew when those books were found what you needed. Just as he knows what I need.”</p><p>Embarrassment coursed through her body. She remembered coming home from college, her mother raging at her, the humiliation of the accusations she had thrown at Tess. It was one of the few times her father had put his foot down. Then he had pulled her into his study and uncomfortably informed her that sexuality was a personal thing, and none of his or her mother’s business.</p><p>“Your sister—?” She left the question hanging.</p><p>“Knows what he wants and enjoys it. That’s the key point, Tess. You have to enjoy it, otherwise, it brings me no pleasure. Your pleasure is most important, Tess. What you want, what you need.”</p><p>His hands were at her abdomen, softly stroking the nervous muscles there. His lips brushed over her shoulder, her neck.</p><p>“I don’t want a toy, Tess,” he promised her. “Or a woman who doesn’t know her mind and speak up accordingly. But in the bedroom, that is where I want the woman I know you are. If you want to fight me, then fight. If you want to submit, then do so. If you want to be tied down and raped, let me know. All of it, I can give you and enjoy. But if you ever reach a limit, you have to tell me. If I ever suggest something you don’t want or can’t handle, then you have to speak up. And after that, unless you ask for it, it will never be approached again. So be very careful in the pleasures you deny yourself.”</p><p>She lifted her head from her knees.</p><p>“And when you’re tired of me?” she asked him.</p><p>“What if you grow tired of me first?” he asked her then. “It goes both ways, Tess. If we can’t give the other what they need, then there’s no point in going on. Do you agree?”</p><p>Her hands clenched at her knees. “I agree,” she whispered.</p><p>“There are no rules, Tess. But from this point on, no means no. If you don’t want it, then you say the word. Understand?”</p><p>She nodded nervously.</p><p>“Each night, I’ll push you further. Each night, you’ll learn something new about yourself.” His hands moved to her arms, caressing the tight muscles, easing the nervousness locking them up. “Don’t be frightened of me, Tess. Or of yourself.”</p><p>“No other women.” She wanted it clear from the beginning. “I don’t know if I can even handle another man. But you can have no other women.”</p><p>“I don’t want another woman, Tess,” he assured her. “And there will be no other men, unless it’s something I decide.” His voice hardened. “There is a particular pleasure in sharing your woman that you may never understand. But not just any man would be worthy of the privilege, baby, trust me.”</p><p>“If you don’t fuck me now, I’ll walk out of this house and I won’t come back,” she finally breathed roughly. “I’m tired of waiting, Cole.”</p><p>She had turned the tables on him then, she moved before he could stop her, turning and pressing against his shoulders until he lay back on the mattress. He was already hard, and she was already wet. His cock tented the front of his pants, hiding him from her. Hooking her hands in the waistband she pulled them down, lifting them over the thick erection and jerking them from his legs.</p><p>“I wondered when you would get tired of waiting,” he said with a smile, though his gaze was hot, wickedly lustful.</p><p>Tess jerked the gown over her head, then moved up his body. She heard his hard breath when her damp cunt grazed his cock, but she continued on. She wanted his kiss. She was dying for it.</p><p>As her lips touched his, his arms went around her, turning her, flipping her onto her back as he rose above her. His tongue pierced her mouth, his lips slanting over hers as he turned the caress into a carnal feast. Tess moaned brokenly, feeling the tenderness, the utter warmth of his touch, his body above hers, the easy strength of his muscles as he kept her close against him.</p><p>“My dick is so hard I won’t last five minutes inside you,” he bit out. “Are you on the pill, or do I need a condom?”</p><p>“Pill,” she gasped. She didn’t want anything between them. She wanted to feel him when he came, feel his seed spurting hard inside her.</p><p>“Damn, Tess, I’m almost scared to fuck you, you’re so damned tight,” he growled as his hand smoothed over her cunt, his finger testing her vagina.</p><p>Tess arched into the penetration, her hungry moan shocking her as her body begged for more.</p><p>His lips trailed along her neck, moving steadily down, down to the hard, sensitive tips of her breasts. When his mouth covered one, her womb contracted painfully. Oh yeah. That was good. SO good. His tongue rasped over the tip, his mouth suckling at her with a strong motion that left her quivering. Then he nibbled at the small bud, the slight pinch driving her arousal higher with the edge of pain.</p><p>“Damn, you’re so hot you’re burning me alive,” he growled, moving back to her lips, searing them with his kiss.</p><p>“Burn more then,” she panted. “Please, Cole. Take me now.”</p><p>He rose above her moving between her thighs, spreading them wide, as she watched his cock pulse.</p><p>“It might hurt,” he warned her, breathing heavy. “Damn, Tess, I’ve never had a pussy so tight it burned my finger before.”</p><p>She rolled her hips, tormented by the tip of his cock as it nudged against her vagina.</p><p>“That’s okay,” she whimpered. “ You can handle it.”</p><p>He surged inside her.</p><p>The breath left Tess’s body as it bowed, a strangled scream tearing from her throat at the forced separation of her sensitive vaginal muscles. The burning pleasure/pain consumed her, traveling through her as she twisted against the thick cock lodged in her cunt.</p><p>“Sweet mercy, Tess,” Cole cried out as he came over her heavily, his elbows bracing to take his weight. His hips rolled in a smooth motion between her thighs that sent sharp darts of ecstasy traveling through her body.</p><p>He wasn’t going to last long. Cole knew he didn’t have a prayer of it. The best he could hope for was that Tess wouldn’t either. He grabbed her hips, his face buried in the damp curve of her neck as he began a strong steady motion inside her body.</p><p>Her cunt was so tight it burned, so slick and sweet he could stay inside her forever if only he could hold his release back that long. There wasn’t a chance. She twisted against him, her hips lifting for him, her legs wrapping around his waist as she took him deeper, screaming out with the sensations his hard thrusts sent through her.</p><p>Cole groaned at her heat. He pushed into her harder, his thrusts gaining in speed, spearing inside her, sliding through sensitive tissue that gripped him, fought to hold him. Her body tightened further until finally, her pussy began to quake around him as she cried out, jerking in his arms, her orgasm slamming into her at the same time he lost control.</p><p>Cole heard his howl of ecstasy, her strangled scream of release as he began spurting inside her. Heat enveloped him, seared him, filled his body and soul as her hold on him tightened.</p><p>“Tess. God, Tess, baby—” He didn’t think the hard flares of pleasure would ever end. Prayed they never did. They shot up his spine, through his dick, and dissolved the hard, lonely core to his heart. This woman was his. And before the week was over, he would prove it to her.</p><p>CHAPTER TEN</p><p>For Tess, the days continued in a haze of pleasure. Cole was alternately gentle and masterful, seductive and surprising. He pushed her as he warned he would. He tied her down and tormented her with his skillful tongue and a variety of sexual toys meant to both tease and torment. Throughout the day she wore the silky gowns he laid out for her, and roamed the house with him. They talked and laughed, made love and lust in a variety of rooms and positions. But more importantly, Tess learned about the man.</p><p>The privileged, driven man whose incredible intelligence often hid a man of intense emotions. She would catch glimpses of it during certain conversations or after a session of intense, almost brutal lovemaking. His expression would be concerned, loving, as though despite his needs, his desires, he feared hurting her.</p><p>He still made her wear the butt plug for several hours daily. Before it was time to remove it, he would fuck her slow and easy, his cock sliding forcefully inside the ultra tight passage of her vagina. The sensation was incredible. Tess would scream for him, beg, plead for mercy as the streaking pain and pleasure assaulted her body. Her climaxes tore her body apart with the sensations, leaving her heaving against him, her juices exploding around his cock and triggering his own climax.</p><p>Their time was slowly coming to a close, though. On the sixth day, Tess dressed in yet another gown. The new one was a Grecian design that fell to her feet, with small golden silken ropes crossing over the front from her abdomen to beneath her breasts. She was barefoot again, but she knew that Cole would be as well. He wore clothes easy to remove. She grinned. For the most part, they went naked through the house anyway. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They went through breakfast quickly. Tess knew Cole had something planned for the day, but she wasn’t certain what. She learned quickly a bit later, though. As she lay on the mattress in front of the fire Cole pulled four massively heavy weights from the corner of the room. He placed one at each corner of the mattress, then gave her that dark, commanding look that set her blood on fire.</p><p>“Last lesson,” he whispered, tying a length of silken rope on the metal rings wielded to them.</p><p>“Take off your gown and lay on your stomach.”</p><p>A tremor of arousal shook her body as she pulled the gown from her body. Cole then buckled a leather band at each ankle and wrist before attaching the ropes to them. It left her spread, defenseless, with just enough play in the rope for him to place large, wide pillows beneath her body, levering her several inches above the mattress. Under her hips he placed yet another, leaving her ass defenseless, open to his gaze.</p><p>“Who owns your body?” he whispered, running his finger along the flaming crease of her cunt as his other hand stroked her buttocks.</p><p>“I do.” Her voice was rough. She was in the right position for punishment; she didn’t want to waste it.</p><p>His hand landed on her ass with stinging force. She flinched, cried out at the flare of heat in her flesh and deep within her cunt.</p><p>“Who owns your body, Tess?” he asked her again.</p><p>“Not you,” she cried out. She needed more, again. She wanted him to set her ass to burning, because she knew what it would do to the rest of her body. Her breasts were swollen, her nipples hard and hurting.</p><p>He slapped her again.</p><p>“Who owns your body?”</p><p>“Me.” The haze of arousal was dulling reality now. His hand landed again.</p><p>“Need any help, Cole?” For a moment, Tess thought she imagined the smooth, cultured voice coming from the doorway.</p><p>She opened her eyes, her head turning, her eyes widening in mortification at the man leaning casually against the doorframe.</p><p>Jesse Wyman was one of the vice presidents at her father’s company, answerable only to Cole and her father. He was as darkly handsome as Cole was, but more refined, not as large or savage looking. His green eyes were dark now, filled with lust rather than calculation, and the bulge in his pants looked more than impressive.</p><p>“Cole?” Was this part of his plan, if not, her suddenly dripping pussy may just get her into trouble.</p><p>“Say no and he walks away.” Cole’s voice was hot, suggestive. “Do you remember the book your mother threw the biggest fit over, Tess?” he whispered hotly. “The woman was tied down, her ass raised, her cunt, her mouth and her ass at the mercy of the hero and his best friend? Meet my best friend, baby.”</p><p>Tess quivered. She could feel Cole’s hand stroking over her heated bottom, Jesse’s eyes following the caress. Her heart labored heavily in excitement, the blood thundering through her veins. She had always wondered what it would feel like. Wondered if she could handle two men at once.</p><p>“Cole—?” She was frightened too. The unfamiliar longings were shuttling through her body, making her shake in indecision.</p><p>“Tess, “ he whispered. “It won’t be the last time I ask it of you. I promise you, baby, you’ll love it.”</p><p>She could hear the excitement in his voice, the arousal as Jesse started into the room, his hands going to the buttons of his white dress shirt.</p><p>“God, you two do this all the time?” she gasped.</p> <p>“Just sometimes. Just when it’s important, Tess. When we know it’s needed. And baby, you need it.” His finger dipped into her pussy, pushing through the frothing juice that dripped from it.</p><p>Tess groaned, pushing back into his finger as Jesse dropped his shirt to the floor. His chest was muscular and deeply tanned. His green eyes glittering with rising lust. Tess watched, mesmerized as his hand went to the fastening of his slacks.</p><p>“She’s beautiful,” Jesse growled as he kicked his shoes off then disposed of his slacks and boxers. “Has she been a good girl for you, Cole?” His voice was suggestive, searing her with the implication that she needed to be punished.</p><p>His hands tested the restraints at her wrists, then his fingers feathered over her cheek. Tess shuddered at the caress.</p><p>“Tess usually finds a way to be naughty, don’t you, baby?” Cole’s hand landed on her bottom in a light smack.</p><p>She jerked, whimpering. Dear God, they were both going to punish her, pleasure her? She felt faint from excitement, her body tingling. She nearly climaxed when Jesse came to his knees beside her, his erection not as large as Cole’s, but nearly. It was thick, pulsing, the head throbbing. His hand touched her hair, his eyes locked with hers, and then Tess understood why Cole had propped pillows beneath her whole body. To raise her high enough to keep her arms stretched wide, and still in position for any cock sucking required. Her mouth watered at the thought, then opened in a cry of surprise when Cole’s hand struck her ass again.</p><p>“Naughty Tess.” His voice was filled with amusement.</p><p>“Beautiful Tess,” Jesse’s voice was a low growl of pleasure. “Her butt pinkens so well. Does it stretch as easily?”</p><p>“My ass,” Cole grunted. “I haven’t fucked it yet, so you can’t either.”</p><p>Jesse grunted but said nothing more. A second later, Tess felt his lips at her shoulder, his teeth scraping over her skin as his hands reached beneath her on either side to cup her full, swollen breasts. His fingers gripped her nipples, pinching lightly as she groaned at the hot little flare of pain. She jerked at the caress, fighting to breathe as she felt Cole’s hand descend on her ass once again. She was bucking at each blow, crying out as Jesse alternately soothed and inflamed her nipples, his mouth on her neck, nibbling, licking at her, keeping her poised on a pinnacle of arousal so sharp it was agony.</p><p>It was then that Tess felt Cole move away from her for a second. When he returned, his finger, thickly lubricated, began to work its way up her still tight anus. He slid the first in easily, though her muscles pinched at the entrance. He pulled back slowly, then two broad fingers were working up the tight channel, spreading her, thrusting lightly inside as she cried out, begging for more.</p><p>Jesse’s fingers tightened on her nipples, then caressed them, tightened again, caressed again. Cole’s fingers, three now, worked slowly up her small back entrance, his voice hot and encouraging as she opened to him, her muscles stretching as it sent fire flaring through her body.</p><p>“I’m going to fuck your ass today, Tess,” he growled. “I’m going to lubricate you real good, baby, then I’m going to work my cock up your tight ass and listen to you scream for me. Will you scream for me, baby?”</p><p>Scream? She couldn’t breathe. She was gasping for breath as Jesse pulled the pillows from beneath her body, lying down beside her, his strong arms holding her up as he pushed his head under her to catch a hard, turgid nipple in his mouth.</p><p>There was enough slack to the ropes holding her wrists now that she could partially prop herself up with her hands. Jesse helped her hold her weight, splayed as she was, with his hard hands beneath her breasts. But did little for her strength. The strong suction, strong nips and rasping tongue on her tender nipples were driving her crazy.</p><p>Her head tossed as she panted for breath. Cole’s fingers were working further up her ass now, spilling fire and hot, dark rapture as he slowly stretched her, his fingers spreading inside her to part the heated passage.</p><p>“Jesse is going to fuck your tight pussy for me, Tess,” Cole promised her, his voice rough from his lust. “After I work my cock up your sweet ass, he’s going to take that tight cunt. You’ll be stretched and full baby, both of us working you, fucking you.”</p><p>His explicit words caused her womb to spasm painfully, her body to bow involuntarily as she pushed against his fingers.</p><p>“Oh yes, baby, you want it, don’t you?” Pleasure filled his voice. “You want to be taken, filled and fucked like the sweet treasure you are.”</p><p>His voice was awed, enraptured, as though it were she giving him a gift, rather than the other way around. As Cole spoke, Jesse pushed his body beneath hers, sliding easily in the space the cushions had once taken until she was draped over him, his cock nestling at the soaked lips of her bare cunt.</p><p>“Tess, I wish you could see how beautiful you look,” Cole groaned as he moved back until Jesse could get into position. “Your sweet cunt is dripping all over his cock, soaking it. Your ass raised and ready for me. Are you ready for me, baby?”</p><p>Tess whimpered. Was she ready? The thought of his cock, so thick and hard pushing up her ass was at once terrifying and exhilarating.</p><p>“I think you’re ready.” She felt him move into position as Jesse reached around, pulling the cheeks of her ass apart.</p><p>“Relax for me, Tess,” Cole groaned. “I promise, it’s gonna be so good.”</p><p>She felt the head of his cock begin its entrance inside her. Slowly, easing inside her, stretching her until she was screaming out at the shocking pain of the entrance. Pain and pleasure, it seared her, held her immobile as he worked his cock inside her, inch by inch.</p><p>Jesse held her flesh apart, but his lips caressed her face, whispering encouragement, dark, naughty words that made her need for the sexual pain flare higher, hotter. His voice was approving, tender.</p><p>“It’s okay, Tess,” he soothed her as she bucked, her eyes tearing from the pain, though she didn’t want it to stop. She never wanted it to stop. “Don’t fight it, Tess,” he urged. “Cole’s cock is thick, baby, but not too thick. You can take it.” He pulled her flesh apart further, easing the shocking pain as Cole continued to tunnel inside her.</p><p>“Tess, are you okay, baby?” She could hear the strain in his voice, the hot vibrating vein of lust and possession, caring and tenderness.</p><p>“Please—” she gasped as he halted the slow, gliding entrance.</p><p>The head of his cock had just passed the tight ring of muscles, the flared tip stretching it wide as she fought to accustom herself to his large cock filling her there.</p><p>“More, baby?” he asked her, his hand smoothing down her back.</p><p>“More,” she cried, her hips easing back on the burning lance. “More. Please, Cole. More.”</p><p>He began to ease further inside her as the tip of Jesse’s cock throbbed at the entrance to her cunt. A slow, steady stroke had Cole filling her ass completely, his hard groan as he sank into her to his balls echoed in the room.</p><p>Tess was crying out repeatedly now, her muscles clenching on him, her body accepting the pain as a torturous pleasure she couldn’t deny any longer. Her hips moved against him, driving him deeper, lodging the pulsing head of Jesse’s cock just inside her vaginal entrance as Cole pulled back, then pushed forward again.</p><p>“Yes,” she screamed out as he began an easy thrusting motion inside her ass. “Oh God, Cole. Fuck me. Please fuck me!”</p><p>He pushed harder inside her. Once. Twice. Then stilled. Tess would have protested, but she lost her breath. Beneath her, Jesse began to push his hard cock into the tiny, tiny entrance of her vagina. Cole’s cock filled her ass to bursting, leaving little room in her snug pussy. But Jesse didn’t let that hinder him. Groaning, praising the ultra tight fit, he sank slowly into the heated depths until he was lodged in to the hilt.</p><p>Reality ceased to exist. She didn’t even know when Jesse had reached up to release the leather manacles or when Cole had released those at her ankles. But she was on her hands and knees, sandwiched between them, begging for more. Pleading for the hard thrusts of their cocks inside her as they set up a slow, rhythmic thrusting motion that threatened to drown her in pleasure. She was insane with the burning ecstasy spearing her body. She moved against them, taking them, urging them on until their building thrusts were powerful strokes inside her. They were fucking her hard and fast now, each man groaning, praising her, crying out as she tightened on them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Cole,” she screamed out his name as she felt her orgasm building. “Oh God, Cole, I can’t stand it.”</p><p>“You can, Tess,” he groaned, levering over her body as his hips powered inside her. “You can, baby. Take it. Take it, Tess. Cum for me, baby. Cum for me now.” He surged inside her as she tightened around him.</p><p>Beneath her, Jesse had clasped her waist hard, his hips slamming into hers, and despite their speed, both men kept in perfect synchronization with the hard thrusts of their cocks inside her body.</p><p>Tess couldn’t stop her screams, couldn’t stop the sensations that tightened her body, the boiling pressure, the hard, piercing pleasure/pain was too much for her untutored body to take for long. When she climaxed, she wailed out at the explosion, tightening on them further, her ass, her cunt milking the cocks possessing her until she heard their shattered male groans and felt the hard, spurting jets of their sperm filling each hole.</p><p>Her orgasm shuddered through her body, over and over. Her muscles clenched on their cocks as they exploded inside her, making them cry out around her, jerk against her as her cunt and her ass drew on their flesh, shuddered around it, burned them with her release until she fell against Jesse gasping, boneless.</p><p>“Son of a bitch, Cole,” Jesse’s voice was harsh, weary now. “She’s drained me.”</p><p>Cole pulled free of her and collapsed on the mattress, helping Jesse to lower Tess between them. Once there, he pulled her against his body, his hands running over her back, his lips caressing her temple as she fought to regain her breath.</p><p>“You’re mine, Tess,” he whispered, stopping her heart with the emotion she heard in his voice. “Taken by me. Held by me. I won’t let you escape me again.”</p><p>She would have answered him, but shock held her immobile when she heard the enraged scream of her mother from the doorway.</p><p>“You dirty whore! Just like your father. You’re just like your father—!”</p><p>CHAPTER ELEVEN</p><p>“Oh my God!” Humiliation sped through Tess’s system seconds later as Cole and Jesse jumped to hide her from sight.</p><p>They jerked their pants from the floor, shielding Tess as they dressed quickly. Cole’s body was tight with fury as Tess fumbled with her gown, her fingers shaking so badly she could barely get it over her head.</p><p>Turning to her, still shielding her, Cole helped her untangle the material and ease it over her head.</p><p>“I’m sorry, baby,” he whispered, his lips feathering over her hair as he straightened the gown.</p><p>Tess shook her head, feeling the heat that traveled over her face. With a final touch of his fingertips to her cheek, he turned to her mother.</p><p>“How the hell did you get in?” His voice was furious as he faced Ella Delacourte, dark and warning.</p><p>“I didn’t come here to talk to you, perverted bastard that you are. Look how you corrupted my daughter. You’re just like that trashy, home wrecking sister of yours.” Ella was screeching now.</p><p>Tess felt her face flame in shame as she stood to her feet, her legs shaking from her exertions and her fear. Dear God, how had her mother got into the house?</p><p>“Mother, why are you here?” Tess’s voice was thick with tears and confusion.</p><p>She wasn’t ashamed that she had experienced the sexuality of the act. But being caught in it was mortifying. And by her mother!</p><p>“I came to see why you were here after I found out your father and his tramp were away for the week,” she sneered. “You haven’t even called me. I was worried.”</p> <p>The classic guilt trip from her mother any time Tess spent time with her father.</p><p>“Ella, control your tongue,” Jesse’s voice was hard and laced with warning.</p><p>Tess looked at him in surprise. She had no idea Jesse knew her mother.</p><p>Ella cast the other man a look that should have withered him with shame. Jesse stood before her, his shoulders squared, his dark face furious.</p><p>“Tess, go shower or something.” Cole drew her into his arms, kissing her head softly, his hands soothing on her back. “Let me take care of this.”</p><p>Tess shook her head.</p><p>“I haven’t needed you to fight my battles before this, Cole. I don’t need you to do it now,” she said. “I haven’t done anything wrong—”</p><p>“Wrong?” Ella’s voice was piercing. “You think fucking your perverted lover and his friend isn’t wrong, Tess? I raised you better than to whore for some depraved bastard.”</p><p>Tess trembled at the fury in her mother’s voice.</p><p>“Ella!” Jesse’s voice was a lash of cold, hard fury now. “Get the hell out of here before I escort you out. And I don’t think you want me to have to do that.”</p><p>The heated edge of fury in Jesse’s voice surprised Tess.</p><p>“Get her the hell out of here,” Cole muttered to his friend.</p><p>“Would you guys just stop this?” Tess ran her fingers through her hair, hating the tremble in her hands as she faced her mother.</p><p>Years of being made to feel ashamed of her sexuality, of her needs as a woman washed over her. She remembered the lectures from the time she was a child, on the depravities of sex and the sins of the flesh.</p><p>“Mother, I told you I’d be back after the party,” she sighed, leaning against Cole for support, thankful in a way that she didn’t have to hide from her mother now.</p><p>“How could you do this, Tess?” Ella’s expression was livid, her gray eyes glittering with fury. “How could you have become so depraved?”</p><p>“Depraved?” Tess shook her head, sighing. “I’m just different from you. I’m sorry.”</p><p>A tear escaped her eyes. She hated having her mother angry with her, just as she had hated leaving her father so long ago.</p><p>As she finished speaking, a movement behind her mother caught Tess’s attention. Her father, tall and strong, his face coldly furious, moved into the room.</p><p>“Well, I guess you’re satisfied,” Ella sneered when she saw him. “She’s just like you and that whore you married.”</p><p>Missy was with her father, and for once, Tess saw anger lining the beautiful blonde’s face.</p><p>“You’re in my home, Ella,” Missy reminded her, her slender body tense and lined with anger. “I suggest you leave it and consider what you’re losing in this display you seem intent on. Tess isn’t a child. She’s a woman. Her lifestyle is none of your concern.”</p><p>Fury pulsed through the room, nearly choking Tess.</p><p>“I can’t believe you did this. That a child of mine would lower herself to the same games her father plays.” Tess flinched under the cold, unrelenting judgment her mother was meting out.</p><p>“Ella!” Missy’s voice was a lash of hot fury. “I will have you escorted from my home if you cannot speak to your daughter decently. What she does is no business of yours. She’s a grown woman.”</p><p>“And I don’t need anyone fighting my battles for me,” Tess bit out, more than surprised at the confident edge of power in her stepmother’s voice. Missy with a backbone? She wouldn’t have believed it.</p><p>“Do you know what she was doing here, Jason?” Ella screamed out at her ex-husband. “This had gone even further than the games you practice—”</p><p>“For God’s sake, Ella!” Jason cursed furiously. “Listen to you. Do you think our daughter wants to hear this? Our problems don’t involve her.” Her father’s face was ruddy with his own embarrassment. “I don’t care what she was doing. I trust Cole to protect her, that’s all I needed to know.”</p><p>“Well had you shown up a moment sooner—”</p><p>“Then I would have warned them of my arrival before entering the house,” he growled in disgust as he cast Tess an apologetic look. “For pity’s sake, stop humiliating Tess because of your own bitterness. This has gone too far.”</p><p>Ella turned to Tess, her eyes hard, resentful. “Leave your belongings, Tess. You’re going home with me. Now!”</p><p>When had she ever given her mother permission to order her around in such a manner? Tess watched her in growing confusion and pain. She had never known how angry, how bitter her mother had become. And for what reason? She had often stated how her life was more secure without a man interfering in it.</p><p>“I won’t leave, Mother.” She felt Cole’s hands tighten at her shoulders, the way his body tensed expectantly behind her.</p><p>Shock filled her mother’s expression.</p><p>“What did you say?” She seemed to gasp.</p><p>“I won’t leave—”</p><p>“He’s using you, Tess,” Ella said furiously. “You’ll be nothing but his whore. He proved that today.”</p><p>Tess shook her head. “I love him, Mother. I have for years and I was too scared to admit to it. But I’m even more frightened of being alone and bitter, without at least having this time with him.”</p><p>Silence held the room. She thought she heard Cole whisper a reverent “Thank God.” But she wasn’t certain.</p><p>“You will,” Ella screamed furiously, her fists clenching at her side, her eyes glittering wildly. “You won’t stay with these monsters.”</p><p>“Perhaps it’s where I belong.” Tess wanted to cry out at the hurt that flashed in her mother’s eyes. “I love Cole, Mother, and I’m not ashamed of that, or what I’ve done. I enjoyed it.”</p><p>Ella opened her mouth to say more.</p><p>“Don’t speak, Ella,” Jason snapped. “Keep your mouth shut and leave her the hell alone.”</p><p>“You don’t control me, Jason,” Ella bit out, her body trembling. “You didn’t while we were married and you don’t now.”</p><p>“Probably what her problem is,” Cole whispered at Tess’s ear.</p><p>Her eyes widened for a moment before she put her elbow in his hard stomach. He only chuckled.</p><p>“I will if you don’t keep that viperous tongue quiet,” he growled. “And trust me, Ella, you better be careful. You may find out the monsters you hate so much are more a part of you than you know.”</p><p>“I’m not part of this,” Jesse finally sighed as he finished dressing. “I’m heading out of here, boys and girls. See you at the office, Cole.”</p><p>He slapped Cole on the shoulder before leaving the room.</p><p>Ella’s eyes followed him, narrowed, furious.</p><p>“Mother, perhaps you should leave as well.” Tess took a hard, deep breath. “We’ll discuss this later, when we’re both calmer.”</p><p>Ella turned back to her. The perfectly groomed cap of auburn hair framed a surprisingly young face. At forty-two, Ella Delacourte looked nearly a decade younger. But she was more bitter and vengeful than any woman twice her age, with a much harder life. “Come with me now, Tess, or I won’t allow you back in my home.” Ella’s lips thinned as she stared at her daughter, ice coating her voice. “You’ll no longer be a daughter of mine.”</p><p>Tess trembled. She had never seen her mother so angry.</p><p>“I’m sorry, Mother.” She shook her head. “I can’t.”</p><p>Ella drew herself erect. She cast her ex-husband a dark look then turned and stalked from the house. Tess flinched as the front door slammed closed behind her.</p><p>“She’ll settle down, Tess,” Jason said gently. “You know how your mother gets.”</p><p>Tess ran her fingers through her hair as she took a hard, deep breath.</p><p>“She won’t forgive me, Father,” she said, her voice low, thick with tears. “Not ever. No more than she ever forgave you.”</p><p>“Tess,” Cole’s voice was soft, gentle as his arms wrapped around her, holding her.</p><p>What a perfect feeling, she thought, to be held so tight, so warm against him. But how long would it last? How long could it last? She loved him, but how could he love her? Had her own desires, her unnatural needs lost her the love of the only man she had ever truly wanted? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER TWELVE</p><p>The question followed Tess through the rest of that night. Cole didn’t come to her bed. For the first time in six nights, he wasn’t beside her, tempting her, teasing her with his body, his lust. She lay in the middle of the big bed, staring silently up at the vaulted ceiling, the loneliness of the room smothering her. God help her, if she couldn’t get through one night without him, how would she handle the rest of her life?</p><p>What had she done? Had her desire to experience with him everything his other women had been her downfall? Had her envy, her depravity, ruined the only chance she had to make him love her? She swallowed the tight knot of fear in her throat. Realistically, she had known that her chances of capturing his heart were slim. She just hadn’t expected it to be over so soon.</p><p>Realizing she wouldn’t be sleeping any time soon, Tess got up, pulling on the bronzed silk robe that lay at the bottom of the bed and belting it firmly. She slipped her feet into soft, matching slippers and left the room. She would prefer to sit in the kitchen, drowning her sorrows in the chocolate mint ice cream her father kept on hand, rather than wallowing in them.</p><p>As she stepped into the hallway, she followed the bright light spilling from the kitchen further up the hall. She halted in surprise at the doorway. Dressed in a thick robe, her blonde hair attractively mussed, her surprisingly pretty face free of makeup, sat Missy, digging into a bowl of the mint flavored chocolate, the box sitting temptingly in front of her.</p><p>“Great minds think alike?” Missy flashed her a smile as she looked up, waving the spoon in her hand at the cabinet. “Grab a bowl.”</p><p>Tess walked to the cabinet and did just that, then sat down at the other side of the rounded table and began to spoon in a large portion.</p><p>“Nothing settles the nerves like Chocolate Mint,” Missy sighed. “And I guess today rates as definitely that.”</p><p>“I’m sorry,” Tess apologized, genuinely regretful that she had caused her stepmother any pain. “I didn’t expect Mother to show up.”</p><p>Missy paused, her spoon suspended above her bowl as she flashed Tess a frown.</p><p>“Tess, I’m not upset for me,” she said sincerely. “I’m upset for you and Cole. Your private choices should not be aired in such a manner. Cole was furious, of course, that she hurt you. But I was angry for your sake.”</p><p>“Why?” Tess frowned. “We’ve never been close. We barely get along.”</p><p>A knowing smile tipped Missy’s pale lips.</p><p>“Tess, you fight with someone when you feel threatened, and when you care without a safety net, an assurance that you are cared for as well. I know that. I used to be the same way, until I met Jace.”</p><p>Tess hunched her shoulders. Missy’s assessment was much too close to the truth.</p><p>“That’s how I knew you loved Cole.” Missy dropped her next bombshell. “At first, it was just general sniping, but as he teased and flirted and pushed you, it became outright fighting on your side. I knew then your heart was involved.”</p><p>Tess nearly choked on the spoonful of ice cream she was attempting to swallow. How could anyone, especially airhead Missy, who wasn’t such an airhead after all, know her better than she knew herself?</p><p>“Have I lost him?” Tess couldn’t keep the longing, the fear from her voice as she stared back at the other woman.</p><p>“Lost Cole?” Missy laughed in surprising amusement. “Tess, Cole has been fighting for your attention for over two years now. What the future will bring, I don’t know. But I sincerely doubt you have anything to worry about for the present.”</p><p>This did little ease to her worry.</p><p>“He hasn’t returned.” She shrugged, dropping her eyes to her bowl. “Maybe I disgusted him. Maybe I was supposed to refuse when Jesse came in?”</p><p>When Missy didn’t answer, Tess risked a quick look.</p> <p>The other woman watched her sympathetically, warmly.</p><p>“Cole is different from other men,” she said as Tess watched her worriedly. “How different, is up to you to discover. But I’ve known him all his life, and I know Cole doesn’t play games. If he invited Jesse, then he wanted it too. He wouldn’t try to trap you, Tess, or hurt you. You have to trust him that far.”</p><p>“I’m scared,” Tess admitted, her eyes going back to the melting ice cream. “I don’t know how to handle what I feel and what I want.”</p><p>“Do any of us?” Missy’s chuckle was self-mocking. “It takes meeting the man who can give us what we need, who knows, because it’s what they need. I know, Tess, because that’s what your father and I have. A relationship that fulfills what both of us need.”</p><p>“Mother never loved him.” Tess knew that, had known it for a long time.</p><p>“Your mother has to love herself first.” Missy shrugged. “Now finish your ice cream. I’m sure Cole will be back before the party tomorrow, and he’ll show you then how much he’s missed you. I know he didn’t want to leave and he hated going before talking to you first, but in this case, he assured me it was necessary.”</p><p>What, Tess wondered, could have been so important that he couldn’t even see her before leaving?</p><p>Tess waited, and she waited. All through the next day, while she was dressing for the party, and halfway through the boisterous, noisy affair she waited, and held onto the hope that he would be back that night. She gave up at nine. She set aside her glass of champagne, put away her hope and walked regally from the noisy ballroom and up the narrow steps that led to the Turret Room. She would pack and leave in the morning. She wasn’t certain where she would go, but she was certain she couldn’t risk staying here, or begging him to forgive her for something she didn’t know if she would change.</p><p>The sexual dominance of the act had thrilled her. The utter thick, hot pleasure in Cole’s voice had only spurred her on. She didn’t know if it was something she would ever want again, but she knew experiencing it would be a memory she would always hold onto.</p><p>She kept her head down as she entered the room, going straight for the suitcase stored in the large walk-in closet just inside the room. She placed it on the luggage rack, opened it and re-entered the closet to collect the few things she had brought with her.</p><p>As she folded the articles of clothing, the tears began to fall. They were hot, blistering with pain, and shook her body as she tried to console herself that at least she had tried. For one time in her life, a very brief time, she was free.</p><p>She wiped at the tears, her breath hitching as she moved to the stone dresser and collect the clothing there, then she went to her bed and picked up her robe. The last article Cole had given her. It was then she saw the small, black velvet jewelers box. She stopped, clutching the silk robe to her chest</p><p>It was a ring. The diamond glittered with shards of blue and orange, intensifying the gold of the thick, simple band. Her hands shook, her body trembled. Her head raised, her eyes going to the shadows of the opened bathroom door.</p><p>“Shame on you, Tess,” Cole chided her gently as he walked from the room where he waited. “To think I wouldn’t come back. I’ll have to punish you for that.”</p><p>His chest was bare, his jeans rode low on his hips and fitted tightly over the bulge beneath the material.</p><p>Tess took a deep, hard breath.</p><p>“You didn’t call,” she whispered as she saw the mask of cool determination on his face, the sparkle of warmth in his eyes that was so at odds with his expression. “You didn’t say goodbye.”</p><p>“If I had seen you, I wouldn’t have left. And I had to leave or miss the jeweler before he left. You should have known I had a reason.”</p><p>Cole’s voice was cool, disapproving. His eyes were patient, wicked and warm. God, she could feel her cunt heating to lava temperature.</p><p>“You knew I would worry,” she snapped out, ignoring the hope, the happiness surging inside her.</p><p>“Worry, not have so little faith in me.” There was an edge of hurt in his voice now, as though her tears, and the cause for them, pricked at his emotions. “After taking you, did you think I would let you go easily?”</p><p>A sob broke in her chest, another tear fell.</p><p>“I enjoyed it,” she whispered brokenly. “You shouldn’t love me.”</p><p>“Tess,” he whispered her name gently. “Don’t you think I want it too? That I didn’t enjoy your pleasure as well? It was the first time, baby, and it won’t be the last time. I love hearing your cries, feeling your pleasure, knowing you’re dominated, submitting to me, no matter what I want. Tess, I love you more for it, not less.”</p><p>“How?” she whispered brokenly, shaking her head. “How could you?”</p><p>“Do you want Jesse alone, Tess?” he asked her carefully. “Would you let him touch you, hold you, if I didn’t ask you to do so?”</p><p>“No!” she burst out, realizing the idea was abhorrent to her. What she had done with Cole could never have been done without him.</p><p>He came closer to her, standing within inches of her, staring down at her with heated arousal, and something more. Something she was terrified to admit to seeing. What if she was wrong? What if it wasn’t love she saw in his eyes?</p><p>Rather than taking her in his arms, he indicated to her to sit on the bed. Tess did so slowly as he reached around her and retrieved the box on the bed. As her eyes rounded in shock, he went to one knee before her, holding the box in front of her as he stared up at her in adoration.</p><p>“You’re mine.” He wasn’t asking her anything. “Taken by me, Tess. Mine to hold and mine to love now.”</p><p>He took the ring from the box, picked up her hand and slid the diamond over her finger firmly.</p><p>“Is this a proposal?” she asked huskily, incredulously.</p><p>“Hell no. I’m not asking you anything,” he grunted. “With that smart assed mouth of yours, you’d have me tying you down rather than loving you the way I want to.”</p><p>“Loving me?” she whispered as he pushed her down on the bed, following her with his heated, hard body.</p><p>“Loving you, Tess,” he promised. “With everything I have. With all I am, I love you.”</p><p>His lips covered hers, his tongue pushing past her lips with a determination, a heat she couldn’t deny. Her hands grasped his shoulders, her body arching to him as she groaned into the kiss. His lips ate at hers, his tongue plundering her mouth wickedly as his hands worked behind her back at the zipper of her dress, then stripped it quickly from her body.</p><p>He never broke the kiss, or lost the heat of his arousal as he stripped his pants from his hips, kicking them from his muscular legs. He didn’t miss a beat as he ripped the silk of her panties from her body.</p><p>“Mine,” he growled as his head finally raised, only to rake down her neck in a fiery caress, his tongue licking at her skin, his hands lifting her against him as they arrowed to her breast. There, his lips covered a hard, engorged nipple, sucking it into his mouth with a groan of arousal.</p><p>Tess arched to him, crying out brokenly at the fierce thrust of pleasure that clenched her womb and her vagina at the same time. Like a punch of heated ecstasy, her body bowed as he nibbled at the hard little point, his hand smoothing down her abdomen, his fingers parting the lips of her sex.</p><p>“Cole. Cole, please.” She was on fire, needing his touch now more than she ever had.</p><p>“Say yes,” he growled as his lips moved down her body, his tongue licking sensually, then his teeth nibbling with fierce, hot nips as he parted her thighs.</p><p>“Yes,” she moaned, arching against him. “Yes, Cole. Anything. Just please don’t stop.”</p><p>He licked a slow, long stroke through the shallow valley of her cunt, his appreciation voiced in a low, long rumbling moan. His fingers parted her, his lips covered her clit with a heated suction that had her hips jerking sharply, arching to his mouth. Her knees bent, her thighs clenching around his head as he sucked and licked at the little pearl of nerves that throbbed almost painfully. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So good,” he growled, licking at her. “Delicious, Tess. But I need more, baby. Come for me. Come for me so I can love you the way I need to.”</p><p>A finger, thick and long slid deep into her vagina, his mouth covered her clit, his tongue flickering in a wicked dance of pleasure as his finger filled her, retreated, then thrust inside her again. Tess bucked against him, her legs tightening around his head, her body heaving. Fire struck her loins, swelled her clit further, clenched her womb. The blood rushed through her body, carrying ecstasy, rapture, until she felt every particle of her being erupt against his mouth.</p><p>She was still crying, arching when he jerked her thighs apart and moved between them quickly.</p><p>“I love you, Tess,” he whispered as he lowered himself against her, his cock, sliding against the lips of her sex, nudging inside them, then parting the tight muscles of her vagina.</p><p>“I love you,” she whispered in return as the head of his cock parted her, slid in inch by inch, easing past the sensitive tissue, allowing her to feel every hard, hot, throbbing inch he was giving her. “Oh God, Cole, you’ll kill me.”</p><p>It was too much. He was too slow. The exquisite stretching, the slow stroke across nerve endings so sensitive, so desperate for relief, was taking her breath. Her head tossed on the bed, her hands slid across his sweat-dampened shoulders, then clenched in the silk of his hair.</p><p>“I’m loving you,” he groaned. “Enjoy it, baby, it may not happen like this again for a while.”</p><p>Torturous pleasure raged through her body. She could feel the clench of her vagina on the thick, hot shaft working gently inside her, the slow stretching, the hot brand of possession as he slid in to the hilt, then paused.</p><p>“Tess, baby,” he whispered as he filled her, burying his face in her neck, his lips stroking her heatedly as he groaned.</p><p>She tightened the muscles of her vagina around his cock, whimpering at the heat, the searing sensations of near orgasm.</p><p>“I love you,” she cried out again, holding him close, holding him tight. “I love you Cole, but I swear to God, if you don’t fuck me right now, I’ll kill you.”</p><p>He didn’t need a second urging. Bracing his knees on the mattress, he pulled back then slammed inside her. Tess screamed out at the rocketing, agonizing pleasure. Her back bowed, her legs curled around his hips, enclosing him in a vice as she fought to make him move harder, faster. She didn’t have to urge him much.</p><p>With a harsh male cry of victory he began to thrust heatedly, heavily inside the slick heat of her body. Tess trembled at the onslaught of fiery sensations. Her vagina was stretched, filled, repeatedly stroked in hard, long thrusts that drove her higher, closer, strangling the breath in her throat as her release began to tear through her.</p><p>Like an orgasmic quake it rushed over her body, tightened her muscles and flung her from a precipice of agonizing need. Her cry echoed around her, distant, dazed as Cole gave one more gasping thrust then groaned out his release. She felt the hot, thick jets of his semen spurting inside her, filling her, completing her until she collapsed, boneless in his arms.</p><p>“Mine,” he growled breathlessly as he fought to breath. “Now that I’ve taken you Tess, I won’t let you go.”</p><p>“Mm,” she smiled tiredly. “Give me a minute and you can take again.”</p><p>Cole chuckled tiredly, rolled from her and gathered her against his sweat-dampened chest.</p><p>“Sleep first,” he grunted. “Then I’ll dominate you some more.”</p><p>“Or I could dominate you,” she suggested with a smile. “Wake you up tied down. Torture you a little.”</p><p>He gave her a worried look.</p><p>“Don’t worry, baby,” she imitated his slow, sexy drawl. “You’ll love it.”</p><p>The End</p>  </body></html>"]