["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>“She’s hot.”</p><p>Aidan Hunter looked up at the skinny blonde with perfect features and the too-tight sweater dress. She perused the enormous ten-foot spruce tree as if imagining how many perfect decorations she’d squeeze on the branches. Aidan shook his head and continued lifting Christmas trees out of the truck. “Too high maintenance,” he said.</p><p>His best friend apparently disagreed. “You’re crazy. What’s wrong with high maintenance if she looks like that?”</p> <p>“I just want a nice girl, Vin. Someone normal.”</p><p>Vin let out an impatient breath and leaned against the truck. “No one’s normal nowadays. Besides, you’re not normal either. What guy who’s worth millions goes undercover to work on a Christmas tree farm? What are you trying to prove?”</p><p>Aidan stifled his impatience and tried to explain himself again. “I told you. I’m tired of women after my money and the family fortune. I want to find someone who likes who I am—no strings attached. I need a break from the spotlight.”</p><p>Vin stretched his hands out to encompass the miles of unending farm country covered with trees. “So you come here? I didn’t even know you had a cabin out in the boondocks.”</p><p>“We’ve had it for years. Dad used to go on hunting expeditions back in the day. For now, I have four weeks over the holidays to be a regular guy.”</p> <p>Vin wrinkled his nose. “I hate manual labor. Listen, I only came up for the weekend. A friend of mine is having a holiday party and I want you to come with me. It’ll be fun.”</p><p>“No, thanks.”</p><p>“You’re coming. Saturday night in Rhinebeck. Maybe you can find your normal woman there.”</p><p>“Vin, I don’t want—”</p><p>“Great, I’ll call you with the address. You’re coming.” Aidan didn’t have time to respond because his friend walked off the farm, carefully treading on the moss as if he couldn’t recognize ground after living on concrete his whole life. Aidan held back a laugh.</p><p>Born and bred in Manhattan, Aidan had grown up comfortable, living in penthouse apartments and taking cabs around the city. It was only lately he’d been pulled to upstate New York, as if the fresh air cleansed both his body and soul. He pulled off his gloves and glanced around the tree farm.</p> <p>Damn, he was tired. Tired of the jet-setting life he’d built for himself. Tired of the demands of money and the expectations of society. Tired of being shadowed by his father’s famous name—The Pasta King. But how could he complain when half the country struggled for work?</p><p>If his father could see him now. Aidan only intended to lay low and scope out the local social scene in an effort to clear his head. But too many hours alone in the woods gave him a bit of cabin fever. When he’d seen the sign on the local road looking for workers to help on the tree farm, he’d pulled in without hesitation, and secured the job within minutes.</p><p>The labor gave him blisters, sore muscles, and a cold nose. Yet, an inner calm settled over him, surrounded by the fresh scent of pine and the chatter of people involved in the excitement of the holidays. Still, he needed time to find his own way and decide what path he wanted to follow. He craved to build something for himself on his own terms, and ached for a woman by his side who wanted him, not his company. So here he found himself—doing manual labor in an upstate town no one had heard of, dreaming of Mrs. Right.</p><p>Poor little rich boy.</p><p>The inner taunt made him chuckle, shake off his thoughts, and return to work.</p><p>Isabella Summers walked through the rows of trees and pulled her coat tight around her. The wind whipped high and fast, and her cheeks burned. This was stupid. Why was she getting a tree when she was alone for the holiday? Would this really make her feel better about spending another year alone?</p><p>She fought back a sigh and kept looking. No, she was going to do this. Her home looked sad and pitiful. Being alone did not mean missing out on all the holiday merriment. She’d always loved Christmas; it was a time of hope. The end of a year and the beginning of new possibilities stretched before her. She was going to get a gorgeous tree and decorate it with lights and tinsel and drink eggnog in the dark. Maybe she’d try writing in a journal and list all her goals for the new year. She’d read the suggestion in one of her self-help books and felt ready to take the plunge.</p><p>She picked her way past giant, perfect trees—the sharp scent of pine mixing with the wind. At the end of the row, tucked in the back, completely isolated from the other trees, she found it.</p> <p>The perfect tree.</p><p>It was horrible. Sparse branches stuck out at odd angles and bent sadly downward. The trunk was crooked, like an old woman who turned the wrong way and got stuck. This tree symbolized everything the holiday did not speak about: the lonely, the isolated, the hopeless. A tree trapped among the beauties, waiting for someone to love it and bring it back to life.</p><p>She walked over and gently touched one of the branches, wondering how she was going to get it in her car without damaging anymore of the twigs. Then came a voice.</p><p>“You’re not taking that tree, are you?”</p><p>She turned. Her gaze met and locked with a pair of gorgeous golden eyes that reminded her of one of the big jungle cats she’d seen at the Bronx Zoo. One brow arched in question at her selection. Isabella immediately grew defensive.</p><p>“Why? Does someone else want it?”</p><p>A slight smile played about carved, sculpted lips. A shiver ran down her spine that had nothing to do with the cold. “Don’t think so. Couldn’t give that one away. Was going to put the tree back on the truck and take it back from wherever it came from.”</p><p>She decided she didn’t like him, even though he was pretty much male perfection in the making. “Well, I’m buying it.” She straightened her spine and gave him her cold, disciplinary teacher look. “How much?”</p><p>The man took stock of her and the tree. Then pulled off one work glove to scratch his head. A stubborn blond curl fell across his forehead, reminding her of Robert Redford in her favorite movie, The Way We Were. She pushed the annoying thought away. “Hmm, let’s see. I’d say $100.”</p><p>Her mouth fell open. “A hundred dollars? That’s highway robbery. You were going to get rid of it. You should give it to me for free.”</p><p>He crossed his arms. The red plaid flannel shirt stretched to accommodate lean muscle. Worn, faded jeans clung to his thighs. Isabella cursed herself for even wondering about his butt. He spoke in a fake drawl that seemed to mask a city accent. “Well, seeing you’re interested in the tree, I need to charge you. And I work on commission. How about seventy- five?”</p><p>She stuck out her chin and stepped in front of the tree like she was guarding a little pig from the Big Bad Wolf. “Absolutely not. If you were going to dump it, anything you get is extra. I’ll give you twenty.”</p><p>He seemed to consider the offer, then sadly shook his head. “Sorry, just can’t do it. Can’t take less than fifty.”</p><p>Isabella simmered with temper. This nasty male model was arrogant; she’d be damned she give him what he wanted. He probably thought she couldn’t bargain as a woman. She pulled on her internet resources for buying cars and decided she had to be willing to walk away. “Twenty dollars. No more or I’m walking.”</p><p>Mischief lit amber eyes and something else she couldn’t name. Some simmering sexual tension that caught and held her in his spell. “I’m truly sorry, ma’am. Can’t do it for under fifty.”</p><p>“No deal.”</p><p>Her fists clenched in temper. There was no way she was paying $50 for a sad tree that could fall apart once she got it home. He deserved to get nothing for the tree. What did she care if he threw it back on the truck? He was mean spirited and she refused to argue.</p><p>Isabella turned and walked away. She waited for him to call out, “Wait,” but he never did. She made it five steps, turned the corner, and stopped.</p><p>Damn him.</p><p>She needed that tree.</p><p>Isabella mentally calculated the odds of pride against emotion. As usual, in her life, emotion won. She yanked her knit hat tighter around her head and marched back.</p><p>He stood exactly where she left him, a grin on his face as he watched her. “Back again, so soon?” he asked in evident amusement. His voice was a mixture of gravelly sand and smooth caramel that caressed her ears.</p><p>She tried to be reasonable. “It’s Christmas. Why won’t you let me give you twenty dollars and take the tree home? You make some money, and you make someone happy.”</p><p>He motioned toward the Charlie Brown Christmas tree. “This tree will make you happy?” His amusement faded to something sharper, and his eyes probed hers. “Why?”</p><p>Isabella let out an impatient huff. “Because it’s lonely.”</p><p>The words fell between them. She fought embarrassment at the ridiculous statement but held her ground. The man took three steps and closed the distance between them. Her heart stopped, then pounded like a racing Thoroughbred out of the gate. His face was more perfect up close—his nose a bit crooked, to keep him from looking too pretty. He smelled of spruce and coffee, a delicious scent that mixed in the air. He gazed at her for a few moments in silence, then spoke in a husky whisper. “I know how it feels.”</p><p>Her lips parted almost subconsciously. As if she had dropped down the rabbit hole, Isabella felt if this stranger leaned in and kissed her, she’d kiss him back. The connection hummed, pulsed, then settled. She took a step back and he gave her the distance.</p><p>“Sold,” he said. “For twenty dollars.”</p><p>Isabella nodded, still wary of the weird feelings jumping in the pit of her belly. She still didn’t like him, but something pulled her. She took out the bill and handed it to him. His bare fingers brushed against the buttery leather of her glove and she briefly wished she’d removed them, just to feel what it was like to touch his bare skin. He pocketed the money, and carefully lifted the tree. “I’ll take it to your car.”</p><p>She followed him through the endless rows to her practical sedan. He laid it gently in the back seat. “Too small to tie it to the roof, but you should be okay. Go easy on the turns. Do you live far?”</p><p>Isabella shook her head. “No.” She reached in her pocket and pulled out a five-dollar bill. “Here you go. Thanks for your help.”</p><p>He went to take the bill, but instead of pulling it out of her hand, his thumb found the edge of her glove and pressed against her bare pulse point. The shock of his touch made her catch her breath. His gaze flew to hers with the full knowledge of her reaction. Then he smiled.</p><p>“Keep it. Merry Christmas.”</p><p>Her tongue stumbled on the words. “Merry Christmas.” Then she turned and got into her car as fast she could. She pulled away and noticed he watched her the whole time, his gaze following the tire tracks until her car disappeared around the bend.</p><p>Chapter Two</p><p>“Vin, I’m not in the mood to go to this party.”</p><p>“You’re going. I already told Rick to expect us, and there’s going to be lots of single ladies. Normal, nice single ladies for you. Bad, naughty, single women for me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aidan laughed into the cell phone. “You can go without me, you don’t need a wingman. It’s supposed to snow tonight and I just want to read a good book and go to bed early. Manual labor is kicking my ass.”</p><p>“Now you sound like an old person. I’ll meet you at eight. Come on, A, I probably won’t see you again before the holiday. We’ll hang out, meet some women and have some laughs. Okay?”</p><p>Aidan refilled his coffee mug and leaned his hip against the kitchen counter. “Fine. See you at eight.”</p><p>He clicked off the cell phone and drank his coffee. Then glanced down at the ledger paper with a license plate number scrawled on the page. Her license number. The mysterious stranger who’d haunted his dreams for the last few nights. Aidan almost groaned. He was officially a stalker.</p> <p>He had contacts. All he had to do was give them the number, and they’d get him a name and address. Yes, illegal, but he wasn’t going to do anything. He just wanted a name. If she was local, he could find a way to ask around to see where she hung out, or if she was married. God, what if she was married? The thought made his gut clench. No, her glove didn’t show a bump over her ring finger. He was positive she wore no ring.</p><p>Aidan didn’t feel like going to a party to meet another woman, not when he dreamed of her—a woman whose gorgeous blue eyes reminded him of the Caribbean ocean, and could be as chilly as the Atlantic when she raised her chin and tried to look down to him, even though he towered over her. This woman had guts and heart. Yet, he hadn’t asked for her number or her name. For the first time in his life, his smooth social skills held no match for his emotions. He’d been tongue tied, reminding him of his first crush. And when she stumbled back from his touch, obviously feeling their connection...well, he hadn’t known what to do. She disappeared so fast.</p><p>Aidan needed to find her.</p><p>He set down his coffee mug and went to get changed for the party he didn’t want to go to.</p><p>“I don’t want to go.” Isabella hated the whine in her voice as she stood outside the door and turned to her friend. “I told you I just wanted to stay home and read.”</p> <p>Her best friend, Liz, gave a deep suffering sigh. “We’re here. You’ve complained the whole drive over and now you will stop. I set you up on an awesome blind date. You’re going to love this guy.”</p><p>“I hate blind dates,” she grumbled. “They’re always a disaster.”</p><p>“He makes a lot of money. He’s charming and good looking.”</p><p>“I hate rich guys. They’re spoiled brats.”</p><p>“Don’t judge. Come on.” Liz hustled her into the house, decorated for the holiday. The Christmas tree loomed huge in the foyer, over ten feet of sheer perfection and glory, with lights and decorations and tinsel. Crowds of beautifully dressed people clad in bright reds and greens mingled around the large wooden bar and buffet. Carols hummed from strategically placed speakers as they made their way through the room and got rid of their coats. Liz leaned over to whisper in her ear. “Go to the bar and get yourself some wine. I’ll find your date and bring him over.”</p><p>“Liz—”</p> <p>“Go.”</p><p>Isabella obeyed and found a space at the bar. She ordered a Pinot Grigio and sipped it while she took in her surroundings. Then she saw him.</p><p>Christmas tree guy.</p><p>Isabella froze and watched him make his way across the room. Powerful, masculine energy hummed off of him in waves, and the crowd parted automatically to let him through. He looked dressed to please himself rather than the crowd—a black button down shirt, khaki pants, and work boots completed the outfit. In a room sporting Calvin Klein and Prada, she guessed he didn’t have the money to run with this crowd, but maybe he was with someone who did. Like a woman. The thought bit hard and hurt more than it should since she didn’t even know his name.</p><p>He looked up as if hearing her thoughts and their gazes locked.</p><p>He said something to the guy next to him and made his way across the room, his gaze never leaving her face. “Hi.”</p><p>Isabella couldn’t stop the smile that bloomed over her face. “Hi, right back. What are you doing here?”</p><p>He shrugged. “Friend invited me. You?”</p> <p>“Same thing.” Isabella felt silly at the pleasure of being near him again, like a teenager in high school getting to talk to the football star. “Did you supply the tree out front?”</p><p>He laughed. “No, they bought it at one of my competitors. Lost out on that sale.”</p><p>“Big commission. Sorry.”</p><p>“That’s okay, your sale made up for it. How is Charlie Brown?” he asked.</p><p>“Doing much better. You’d be impressed.”</p><p>“I am already.”</p><p>The words hung in the air between them. The sounds and sights of the party faded away under the golden gleam in his eyes. She cleared her throat. “I never got your name.”</p><p>“Aidan. Aidan Hunter. And you?”</p><p>“Isabella Summers.”</p><p>“Nice to meet you Isabella Summers.” With that, he reached out and interlaced his fingers with hers. The shock of skin on skin skittered through her. His hands were warm and strong. She imagined his touch on her naked body, over her tight nipples and lower. Heat tinged her cheeks. What was wrong with her? She based attraction to a man on his personality and kindness. Suddenly, the thought of ripping off his clothes took precedence over sparkling conversation.</p><p>As if he knew, Aidan leaned forward. His warm breath struck her lips. “Now that must have been an interesting thought,” he murmured.</p><p>She shifted as an achy heat settled between her thighs. Her blush deepened. Slowly, he reached out and ran one finger down her flaming cheek. The connection lit and burned like an electric fuse underwater. Her body jumped to life and demanded attention. His eyes darkened. She opened her mouth and—</p><p>“Isabella.” Her name cut through the fog like a razor. Liz stood beside her with a very good-looking man, her face evidently shocked at having to interrupt with her date. Aidan dropped his hand and stepped back. His face closed up and he looked distantly polite. Isabella’s tummy clenched, but she forced herself to turn with a welcoming smile to the man beside Liz.</p><p>Liz made the introductions and quickly exited, staring curiously at Aidan who nodded at the new man, Robert, and politely made his excuses, disappearing into the crowd. Isabella turned to her date and forced herself to initiate a conversation while her thoughts remained on Aidan Hunter.</p><p>Aidan moodily watched the couple converse while he sipped his drink. Evidently, it was a blind date set up from her friend’s introductions. Still, Aidan didn’t like it. Fate had stepped in and allowed him to find her. He certainly didn’t want to lose her to another man this early in the game.</p><p>She was more riveting than he remembered. Those eyes burned with blue fire, but with her knit cap and coat off, Aidan admitted she was a knockout. Honey strands of hair fell in artful disarray around her face, setting off high arched brows, and full, pouty lips. Her Christmasy red sweater accentuated high lush breasts. Long legs were clad in black pants, emphasized by thigh high leather boots that were all the rage and sexy as hell.</p><p>He dated beautiful women all the time. Isabella seemed different from them. Her face reflected an open honesty and strength of character he rarely spotted anymore, evident in her rescuing a tree that was ugly on the outside. She glimpsed more underneath the surface and took the precious time to look. The people Aidan knew rarely wasted effort to investigate. They craved bigger, better, shinier, and demanded it yesterday. Isabella’s loyalty toward something ugly intrigued him, until he followed his instinct to make the deal difficult for her. No one would pay money for something that didn’t fit. Something that wasn’t beautiful.</p><p>Isabella proved him wrong.</p><p>When she refused to walk away from her tree, Aidan knew he needed to know this woman.</p><p>He tried not to let his impatience show as the hour slipped by. The party could have been his opportunity to know her better. He heard her blind date was a dentist. His gut twisted. Was she a woman who’d never involve herself with a man who worked on a tree farm? Perhaps, the idea of dating a stable, moneymaking dentist would trump their attraction? The thought depressed him.</p><p>The crowd began oohing and aahing and made their way out to the large deck. The snow had begun and a storm threatened. Aidan watched the couple finish their plates from the buffet, and then Robert disappeared.</p><p>Aidan hadn’t made his fortune by standing around waiting for opportunity. He learned to go out and take it. He put down his drink and strode to Isabella, determined not to lose his lady to a local dentist.</p><p>Her eyes lit up; she seemed clearly glad to see him. An answering warmth pumped through his blood at the sight of her smile. “Hi again,” he said. “How’s your date going?”</p><p>Her face fell and he was sorry he made her uncomfortable. In just two conversations, he felt more connected to this woman than he ever had to anyone else. “Aidan, my girlfriend set me up on this blind date and I—”</p><p>“No, don’t apologize. I didn’t mean to make you uncomfortable.” He looked around and offered his hand to her. “Do you think your date would mind if I stole some time with you? There’s a blizzard outside. Want to take a look?”</p><p>“Yes.” She took his hand. Her fingers slid around his with a natural ease that caused a strange emotion to grab him in a chokehold.</p><p>Home.</p><p>He pushed the ridiculous thought away and led her outside. The crowd had thinned and they settled in the corner by a large wooden beam. A quiet hush blanketed the sloping lawns set high off the mountain road. The high cliffs dominated the skyline with godlike power. Thick pieces of snow fell down and covered the majestic trees with a veil of white. The air rushed cold and fresh, and their breath caused puffs of smoke as they breathed deep and watched the scene in companionable silence.</p><p>“I love it here,” she said quietly. “When I was young, I craved city life. More excitement, more opportunities. Then I ended up right back where I started and realized it’s home.”</p><p>“What do you do?” he asked.</p><p>“I teach third grade at the local elementary school.” When he laughed, she looked up in question. “Why are you laughing?”</p><p>“Because I pegged you as a teacher from the gate. The way you looked at me on the tree farm gave me goosebumps. Reminded me of my own third grade teacher.”</p><p>Isabella laughed with him. “Try running a brigade of eight year olds that outnumber you by 25 to 1. You learn fast.”</p><p>“No wonder I was scared.”</p><p>“And you? What do you do when you’re not working on a tree farm?”</p><p>Aidan took a moment before answering. He wasn’t ready to tell her yet. Admitting to being the king of chain restaurants across the country distorted a woman’s perspective. In his experience, the women he dated changed. Right now, with her hand in his, and the delicious scent of strawberry shampoo from her hair, and the warmth in her face, he wanted nothing to change. He decided to buy himself a bit more time. “I’m sort of a handy man,” he said. “Odd jobs here and there. Tree farms in the winter. Landscaping in the summer. I make my way.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She nodded. “I respect that. I think too many people are scared to find their true niche in life, so they settle for some limiting job that pays well, but find themselves miserable in a mid-life crisis. Nothing’s worth regret.”</p><p>And in that moment, after a few hours in her company, Aidan fell in love with Isabella Summers.</p><p>The sudden, shocking realization was cut short when Liz appeared beside them. “Izzy, Robert’s looking for you. I’m sorry, I don’t think we met?” Isabella quickly made introductions, while Liz gazed at him curiously.</p><p>Isabella spoke up in the awkward silence. “Liz, I’m sorry, but I have to get home. My car will never make the drive.”</p> <p>“Just stay over. A lot of people are. Plenty of space.”</p><p>Izzy shook her head. “No, I really want to get home. I have a long list of things to do tomorrow and I’m exhausted.”</p><p>“Iz, your car is old as dirt. It’s not safe.” Liz bit down on her bottom lip, her dark eyes worried. “I’ll take you home. I can crash at your place tonight—it’ll be like a slumber party.”</p><p>“No way!” Isabella leaned over and hissed near her friend’s ear. “You’ve been staking out Nick Parker for months and he’s bunking down for the night. This is your perfect opportunity. I will not let you ruin it to babysit me.”</p><p>Aidan became fascinated by the push and pull of female conversation. Lots of stubbornness. Emotion. And heat. His presence didn’t even disarm them, as if they were past such boundaries within their perfect circle of friendship.</p> <p>Liz shrugged with fake nonchalance “Big deal. They’ll be other times. I rather watch old movies with you.”</p><p>“Bull. You’re staying.”</p><p>“I’m driving you home. I have four wheel drive.”</p><p>“Liz, there’s no way on the face of this earth I’m letting you out of this house tonight.”</p><p>“I’ll drive you home,” he interrupted.</p><p>The words fell onto sharp silence. Isabella turned and looked at him questioningly. “What about you? Maybe you shouldn’t be driving in this either.”</p> <p>Aidan pointed to the line of cars in the winding driveway and off the side of the road. “I have a Hummer. Can cut through anything.”</p><p>Liz’s mouth dropped open. Isabella looked surprised that a man who did odd jobs for a living had a Hummer, but she didn’t pause. “Okay, if it wouldn’t be any trouble.”</p><p>Liz shot out her hand and grabbed her friend’s arm. “Umm, Iz, I don’t feel comfortable with this. Maybe Robert can drive you home?” she suggested. “I know he’s safe.”</p><p>Aidan gave Liz a reassuring smile. “I swear I’m not a serial killer. I’ll give you my cell phone number so you have it. You can write down my license plate number too. And my friend is here who can vouch for me.”</p><p>“But—”</p><p>Isabella squeezed her friend’s arm in reassurance. “He’s okay, Liz. I’ll speak with Robert in a minute and say good-bye.”</p><p>Liz turned to him with the fierceness of a lioness protecting her cub. “If you do anything funny, I promise to find you.”</p><p>Aidan laughed. He respected Liz as much as Izzy in that moment, noticing the strong bond of friendship. “I’ll keep her safe. Come on, let me introduce you to my friend, who can vouch for my honor. Then I’ll give you my actual cell phone so you can confirm my number.”</p> <p>They spent the last minutes saying good-byes and making sure Liz felt comfortable. Aidan fought back laughter when she dragged over her other girlfriend and he faced more threats on retribution if he touched Izzy out of her comfortable boundaries. The heat on Izzy’s cheeks at the overprotectiveness warmed him. This was a woman who was obviously well loved. Then Aidan finally settled Izzy into the passenger seat, cranked up the heat, and pulled carefully away from the house.</p><p>“How did Robert take it?” he asked.</p><p>Izzy shrugged. “Wasn’t thrilled but I explained you were an old friend. Took the sting out of it. He’s a lovely man.”</p><p>“Hmmm. A dentist, huh?”</p><p>She swung her head around to look at him in surprise. Her silky blonde curls slid over her shoulder. “How did you know?”</p><p>“Word travels.”</p><p>Isabella looked amused. “Yes, a local dentist.”</p><p>“Sounds like a great guy. Stable. Nice. Solid career.” He paused. “So, why are you with me and not him?</p><p>He gave her credit. She took the jab nicely and thrust right back. “Well, that’s right to the point. I’m not crazy about dentists.”</p><p>“They make good money.”</p><p>“Hmm, you seem to be obsessed over the money part. I’m not looking for a man with money. Most rich men I know are too arrogant. I want a man who knows who he is and doesn’t apologize for it. And I don’t like anyone examining my teeth.”</p><p>Aidan burst out laughing. “Looks like you have perfect teeth to me.”</p><p>“I have a junk food habit. He wouldn’t approve.”</p><p>“I knew you were the perfect woman for me.”</p><p>They rode in comfortable silence, easing through snow banks and slick country roads. Her home was located on a small residential block, with a postage stamp lawn and pretty colored yellow shingles. He pulled in her driveway and turned to her. “I can pick you up tomorrow, if you’d like, so you can get your car.”</p><p>“That’d be nice.” The silence grew with an unnamed finely tuned sexual tension, spinning its way around them in a tight web. Aidan tried like hell not to focus on the edge of those thigh high leather boots. Tried not to think of how snug they wrapped around her legs, and how she’d look if he knelt before her to peel the boots off one by one. Would her naked skin quiver against his tongue? Would she taste like strawberries and be as sweet? The erotic image hit him square in the face. He hardened immediately and prayed she wouldn’t notice.</p><p>“Would you like to come in for a cup of coffee? And see Charlie Brown?”</p><p>The invitation caused his heart to pound like a teenager with his first woman. “I’d love to.”</p><p>Maybe she was crazy.</p><p>Isabella busied herself with brewing coffee and peeked through the kitchen to study the man prowling through her living room. She’d just met him a few days ago. They’d had one previous conversation, which ended in her certainty she didn’t like him. Now he was in her house, had held her hand, and called her the perfect woman.</p><p>Why did it feel so right?</p><p>Isabella pushed away her uneasy thoughts and decided to trust her gut. She’d seen the movie Serendipity a million times. She certainly didn’t want to end up constantly wondering why she’d let her soul mate go and spend the rest of her life trying to meet him again. Fate had stepped in and given her one chance. She wasn’t stupid enough to waste it.</p><p>She brought in two steaming mugs and stood behind him. Feet propped apart in a wide legged stance, he symbolized a mass of hard, lean muscle towering over six feet. He stared at her tiny Christmas tree, strung with delicate colored lights, pieces of silver tinsel, and a tiny star on top. The branches were pruned back, and the trunk was wrapped tight in a flannel holiday blanket. The tree looked tired, but happier, as if it could now rest in its forever home.</p><p>“What do you think?” she asked, setting the mugs down on the table.</p><p>“You saved it.” He turned to look at her. Those amber eyes glowed with a fierce intent as his gaze roved carefully over her face. “I knew you would.”</p><p>She tilted her chin up in a slight challenge. “If you wanted me to save the tree, why did you give me such a hard time about the price?”</p><p>Aidan took a step forward. “I needed to know how badly you wanted it.”</p><p>The sexual current between them lit and fused. “A test?” she asked.</p><p>“Sort of.”</p><p>“I don’t like tests.”</p><p>“You’re a teacher. You must have a knack for them because you keep passing.”</p><p>Temper, and a hot, sensual awareness simmered through her. “Well, you failed yours. I thought you were a chauvinistic, bad-tempered Scrooge.”</p><p>“Maybe I’ll pass the second test.”</p><p>“What second test?”</p><p>He stopped before her. Reached out to wrap a wayward curl tightly around his finger. His breath rushed over her lips as he leaned in and spoke. “To see if my kiss lives up to your expectations. I already know you’ll pass.”</p><p>A beat went by. She didn’t move. Then he lowered his mouth. His lips moved sweetly over hers, gentle and firm as he learned her texture and taste with a leisurely motion that relaxed her immediately. His hands cupped her cheeks to hold her still, sipping, nibbling, tempting her lips to open for him. Isabella swallowed a moan of pure lust. Aidan dove in.</p><p>His tongue thrust against hers in hot male hunger. She clung to his shoulders as she hung on for the ride. The raw tension between them pulled and burned. Her head spun as she let go, giving it all back to him, everything she had, everything she was, and everything she’d been holding back.</p><p>He pulled away, whispered her name, then seized her mouth again. He drank deeply until she shook with the need for more.</p><p>Aidan stepped back, looking equally shaken. The knowledge he felt the same made a strangled laugh rise to her lips. “Wow,” she said.</p><p>Her tongue snaked out to lick her swollen bottom lip. Tiger eyes darkened with need and hunger as he watched the movement.</p><p>“I’m glad you came up with something because that left me speechless.”</p><p>“Yeah, I’m a real Shakespeare.”</p><p>He laughed and took his mug of coffee. “I’m going to hang on to this cup a while so I can keep my hands off of you. Wouldn’t want to piss off Liz. I’m afraid of her.”</p><p>She laughed back and settled with him on the overstuffed cream color couch. “You should see the kids. And she teaches kindergarten.”</p><p>He winced in mock horror. “Now I am scared.” He took a sip of the brew and murmured his approval. “Did you always know you wanted to teach?”</p><p>Isabella considered the question. “I tried a couple of other careers on for size before I settled. I lived in Manhattan for a while. I liked the idea of being in the fast lane. But after a while, I burnt out. I lived in a studio with a bunch of roommates, partied at the clubs, and worked low end jobs.” The memory of her betrayal flashed before her vision, but the accompanying cut of pain barely registered now. “Something happened that made me reconsider my options. I realized I wanted more, so I went back to school. Teaching was a good fit. I missed the mountains and small town life.”</p><p>His gaze sharpened as he snagged on her brief hesitation. “What made you reconsider?”</p><p>A smile tugged at her lips. “You don’t miss a thing, do you?” she murmured. “Do you really want to hear my backstory on our first night?”</p><p>“Yes.”</p><p>His simple admission and the gleam in his eyes urged her forward. Isabella took a sip of the hot brew and let herself go back. “Remember your questions in the car regarding my interest in men with money?” He nodded. “Well, let’s just say I got a firsthand experience of that lifestyle, and I’ll never go back. I met someone at a bar while I was waitressing one night. Seemed like a nice guy, well dressed, polite. We had a connection so when he asked me out, I agreed.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aidan remained quiet, but his fingers reached out to snag hers. The comforting warmth settled the memories and she pushed on. “We began to seriously date. His name was Mike, and I fell pretty hard for him. I was fine with taking it slow for the first few months, but then I realized he still hadn’t introduced me to his family. Kept me away from most of his friends. He’d whisk me away for romantic weekends, or late evening dinners, but we never did the ordinary things that couples usually do when they’re building a relationship. So, I began getting suspicious. Thought maybe he was cheating on me. Even asked if he had a wife.”</p><p>Isabella shook her head. “He denied it all. One evening, he made excuses why he couldn’t go out and said he was sick. Said he didn’t want me to come over, just wanted to sleep. I decided to drive over to his house. Imagine my surprise when he came out dressed in a tuxedo.”</p><p>Aidan winced. “This doesn’t sound very good.”</p><p>“Gets better. I followed him to an extremely lush country club. Hell, I couldn’t even get through the gates. I ended up spying through the bushes like a cheap tramp while I watched him mingle with his family and close friends. When I left, I realized there was a huge part of him I hadn’t even known existed.”</p> <p>“What happened?”</p><p>Isabella sighed. “I confronted him the next day with the truth. He looked devastated, and finally confessed. He was an up-and-coming executive in his father’s business, and his family owned half of Wall Street. Seems there were only certain women good enough to be his wife. Women of breeding, power, elegance, money.” She fought the dark spot on her heart that still ached at not being good enough for someone she loved. “But not me. My family was poor and I didn’t even have a real job.” She shrugged. “I just wasn’t worth the fight to him. My heart was broken, and in a way, I understood. So, I came home.”</p><p>The comforting warmth of his hand on hers suddenly turned. Fire simmered along her nerve endings as his grip tightened. She caught her breath as her belly dipped, then his hands slid into the heavy length of her hair to gently tug her head back. Her neck arched. The delicious scents of coffee and male hunger rose to her nostrils, and Isabella realized she wanted him.</p><p>“He was an asshole,” he growled against her lips. “I’d fight for you.”</p><p>Then his lips took hers.</p> <p>This time, he claimed her mouth like a marauding warrior bent on capture. His tongue swept in and took over, stroking every dark, wet crevice. The hard length of him pressed against her thigh, and his obvious arousal caused a fierce satisfaction to course through her, urging her on. She met him stroke for stroke as her arms wrapped around his shoulders and hung on. Her nipples rose and tightened against her sweater, and with a low groan, he slipped one hand out of her hair and under the soft fabric.</p><p>The breath hissed through her lips as his fingers tugged down her bra to cup her bare breast, his thumb urging her nipple to tighten further. Isabella fought the drowning waves of heat and dug her nails into his shoulders. Mindless pleasure drove her on, and she offered herself up to him, moaning as he stroked her breast with knowledgeable fingers.</p><p>His teeth nipped at her swollen lower lip as his thumb teased the turgid nub. Round and round he circled her nipple, then carefully grasped the peak between his fingers.</p><p>And tugged.</p><p>Fire speared straight down to, and burned between, her thighs. “Aidan!”</p><p>He shuddered in her arms. Then with slow, deliberate movements, he removed his hand and eased down her sweater. Amber eyes burned with lust and determination as he stared into her face. “I want you, Isabella. But it’s too soon. I want you to trust me.”</p> <p>She realized in that moment she would have regret sleeping with him this first night. Who was this incredible man who knew more about her in a few hours than most men she dated? He could have swept her into the bedroom and she wouldn’t have denied him. Instead, he delayed his own pleasure for her trust.</p><p>Isabella reached up and traced the strong line of his jaw. The words ripped from her throat. “Thank you.”</p><p>A smile touched carved lips. “Welcome. But I don’t think I could do it again.”</p><p>She laughed and tried to change the subject. “You heard my sob story. What about you? Where did you grow up?”</p><p>His face drained of emotion. She blinked at the sudden change and he shifted in discomfort. “I grew up in the city,” he said carefully. “I never had a choice, though. I finished college and went straight into the family business.”</p><p>“What does your family do?”</p><p>Another uncomfortable pause. “They own a restaurant.”</p><p>Isabella wondered why he seemed a bit nervous. “There’s much more pressure on kids when their parents already have their life set up for them.” Her gaze probed his, searching for answers. “Did you leave the business? Is that why you’re now doing odd jobs, trying to find what you really want?”</p> <p>He opened his mouth and Isabella felt like he was going to say something important. Instead, a flash of grief shone in his eyes, then was quickly gone. “I can never leave the business. I’m only taking a break for a while.”</p><p>She let his words settle, then reached out and took his hand again. His warm skin closed around hers and chased away the cold. For some reason, he battled some demons and needed time. Isabella went with her gut that told her he’d tell her the truth when he was ready. “Then you’ll just find your way.”</p><p>He pulled her close. Tucking her body against his, he put his arm around her and they watched the lights on Charlie Brown twinkle as the snow fell outside.</p><p>Isabella knew something had happened tonight. Something wonderful.</p><p>She hugged the thought tight and gave herself up to his embrace.</p><p>Isabella glanced at the door nervously, then chastised herself for even thinking he’d come. The few men she’d dated in her past steered clear of anything to do with her classroom or extracurricular activities. This included, but was not limited to, tricky trays, penny auctions, and recitals. But the number one event to avoid at all costs occurred once a year. Tonight.</p><p>The Christmas pageant.</p><p>A tiny part of her completely agreed it was almost masochistic for a man to actually attend when he had no children on the stage, but Izzy believed this was a precursor to a good father. Also a great excuse to end a relationship that bordered on the line of boring. Like she’d done twice before.</p><p>Nope. Aidan Hunter probably talked a good game, but he’d never appear. He’d cite work, family emergency, or a hair washing, then maybe offer dinner at a later date. She couldn’t even blame him. Heck, if she wasn’t friends with Liz, there’d be no way she’d volunteer to corral sixty five-year-olds to put on some form of a decent production.</p><p>“Miss Summers, my wings broke!” Ava broke into tears and showed a torn wing. Izzy grabbed the ever present box of tissues and mopped up her face, then whipped out a safety pin.</p><p>“All fixed, sweetie. Now go with Mrs. Johnson, we’re lining up.”</p><p>She brushed the sweat from her forehead, grabbed two small stragglers, and urged them up to the stage. A shepherd’s staff rammed into her head, and she tripped on a fallen angel. Izzy grit her teeth, fought past the pain, and got them all lined up in a halfcocked way.</p><p>Liz gave her a thumbs-up signal. Izzy looked around and quickly flashed her the finger.</p><p>Her best friend hooted with laughter, and Izzy climbed down the stage to block the right corner. Her job now consisted of pulling off crying kids, whispering forgotten lines, and making sure no children made a break for it.</p><p>God, she needed a drink.</p><p>She turned the corner and rammed into a solid wall of carved muscle. Hard hands grabbed her upper arms and righted her. She opened her mouth to firmly chide the straggling father, but the words died on her lips.</p><p>Amber eyes speared hers. Thick blond hair fell over his brow and she reached up without thinking to push it back. Her fingers tingled at the silky feel of the curl, and she yanked her hand back as if burned.</p><p>He smiled down at her, took in her disheveled appearance, and God bless him, still looked interested. “Hi,” he said. “Were you gonna yell at me?”</p><p>Izzy grinned back. “Yep. What are you doing here?”</p><p>He frowned and looked adorably confused. “I’m sorry. Didn’t you invite me to the play?”</p><p>“Yeah. You said you’d try to make it, but that’s always code for you had to cut your toenails tonight.”</p><p>His eyes sparkled with humor. And heat. “Damn, that’s sexy.”</p><p>She pursed her lips and lowered her voice. “I got much more in my arsenal. Watch out.” A tiny toddler waddled over, diaper hanging, and she scooped him up without blinking. “Ooops, a runaway. Where’s Mama?”</p><p>The toddler stuck a drooly hand and grasped a loose curl. “Eeeee!”</p><p>Izzy sighed and wished for a wet wipe. Damn, that was sticky. His mother flashed in front of her and she handed him off without pause. “I can’t believe you came,” she said again. Izzy blushed. God, she was lame. Now she sounded as if she was so desperately happy that a man showed up. Not cool. “I mean, it didn’t matter, but I’m happy to see you.”</p><p>“Didn’t matter?”</p><p>Her blush deepened. “I mean—”</p><p>Aidan grabbed the sticky curl. “I’m just teasing you, Ms. Summers. I had such a good time the other night, I wanted the chance to check out your school. See you in action. As long as you promise not to yell at me again.”</p><p>Giddiness skipped through her body. She actually believed him. Her gut screamed he wasn’t coming to the play just to sleep with her, but that would’ve been fine too. Because she wanted to sleep with him. Eventually.</p><p>“Thanks,” she said softly.</p><p>“Can I take you for something to eat afterward?”</p><p>Izzy nodded. “Yes. On one condition.”</p><p>“Name it.”</p><p>“The restaurant must supply wine. I’m going to need it after this.”</p><p>On cue, the auditorium darkened and the spotlight focused on the stage. Aidan bent toward her. The delicious scent of lemon and soap teased her nostrils.</p><p>“Done,” he whispered in her ear. “I have one condition myself.”</p><p>“I’m a flexible woman.”</p><p>“Dessert must be included. Hopefully something chocolate.”</p><p>In that moment, her heart melted.</p><p>A man who loved sweets was at the top of her list in qualities needed in a mate.</p><p>She nodded her assent, and turned toward the stage.</p><p>As the children began to sing “Silent Night,” and the energy of love in the crowd pulled to her, Izzy clasped her fingers within his and felt as if she was finally home.</p><p>Chapter Three</p><p>Two weeks later, they stood together and took in the scene before them. “Are you sure about this?”</p><p>Aidan looked down at her face and fought back his instinct to throw her in the snow and ravish her. Cheeks pink from the cold, aqua eyes bright, a frown marred her brow as she took in the giant hill before them. The sounds of screams and laughter echoed through the air.</p><p>Instead, he chucked her under the chin and issued his challenge. “You’re not scared, are you?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>On cue, she narrowed her gaze and slipped into teacher mode. “Of course not. Eat my dust, Hunter.”</p><p>She slammed her butt onto the sleigh and pushed off. Aidan laughed and grabbed his own sled, doing a belly flop as he landed hard and took off down the hill. Cold wind ripped at his face as the sled picked up speed, and a shot of adrenalin warmed his blood as he zigzagged, hit a bump, and then went airborne.</p><p>His landing was indelicate, but fun as hell. He rolled a few times in the fluffy mounds of white and came to rest on his back, staring up at the endless blue sky that reminded him of Isabella’s eyes.</p><p>“Oh, my God, are you okay?” She bent over him, her gloved hand pushing wet strands of hair from his forehead. Aidan couldn’t resist. He closed his eyes and gave a moan of pain. “Aidan, look at me. Where are you hurt?”</p> <p>He knew a specific part on his body that ached, but it wasn’t from the fall. Tawny locks teased his cheek and he caught the scent of fresh strawberries. The hell with it. He was no saint. He muttered something deliberately low so she couldn’t hear.</p><p>“What?” Her hands coasted lightly over his down jacket and snow pants but burned through the material like he wore nothing. She bent, and her mouth stopped inches from his. Aidan fought a grin.</p><p>Score.</p><p>He reached out and lifted her up and over so she sprawled on top of him. Isabella squeaked in feminine outrage and tried to wiggle away, but he moved fast and rolled her over to pin her neatly beneath him.</p><p>“Faker!” she yelled.</p> <p>He parted her legs and pressed against her. Her eyes widened at his full, throbbing length, then darkened in sensual response. That was all he needed. His voice came out husky with desire. “No, not about this. Not about us.” Then he dove in.</p><p>His tongue pushed through the seam of her lips with a raw hunger he didn’t want to hide. Her cold lips were a delicious contrast to her wet heat. Her sweet taste swamped his senses, and he swallowed her throaty moan, urging her to give it all back to him.</p><p>She did. Her tongue tangled and pushed back, her hands thrust into his hair and dislodged his cap, and her hips arched up to meet him. Aidan muttered a curse, desperate to slip his fingers between her thighs and send her over the edge. Instead, he eased back, realizing the crowds of laughing kids weren’t the best surroundings for their first time. He pressed one last tender kiss against those plump lips and broke the embrace.</p><p>Isabella gazed back at him, punch drunk, and obviously confused. Possession shuddered through him at her raw response. He needed to claim her.</p><p>Two weeks and a dozen cold showers later, he needed to make this woman completely his.</p><p>And tell her the truth.</p> <p>The more time passed, the harder it may be for her to understand why he kept his past a secret. When he heard her story and realized what was at stake, his words dried up and withered on his tongue. How could he tell her he was the son of the Pasta King? She’d refuse to see him, imagining the same historic hell repeating itself in her life. He needed more time. Time to convince her to look past his money and crap, and see the man he was. Hell, wasn’t that his whole goal to his undercover operation? To find a woman who loved him for nothing but his soul?</p><p>A humorless laugh strangled against his lips. His plan had backfired. He wasn’t afraid Isabella craved his money. Instead, terror choked him at the possibility of her rejection because he was rich. Michael, the dickhead, ruined her. Now Aidan had three strikes. He owned money, fame and came from the city.</p><p>Of course, the question would never be if Isabella was good enough for him and his family. Aidan already knew the real question. Would she think he was good enough for her?</p><p>His father nipped at his heels to make a decision. He had little time left.</p><p>“Aidan?” His name cut through the frigid air and caressed his ears like Beethoven. She smiled at him and placed a kiss on his lips. “Where did you go?”</p><p>“Come home with me, Isabella.”</p><p>Her voice trembled. “Yes.”</p><p>Triumph coursed through him. He stroked her cheek, determined to make tonight the best evening she ever had. “I’ll cook you dinner. But first we need to lay here a while.”</p> <p>She frowned. “Did you really get hurt?”</p><p>“No, I don’t want to give the kids a shock.”</p><p>She glanced down at the hardened bulge in his pants and let out a loud, clear laugh that rang down the mountain. “Good idea.” Her eyes sparkled with mischief. “You’re definitely a city boy. You suck at sledding.”</p><p>He winked. “Maybe. Or maybe I just enjoyed the view.” His slipped his hand under her jacket and squeezed her buttocks, which sent her into another fit of laughter. She slapped his grabbing fingers away, glancing around to see if they’d been noticed. He grinned, rolled over and stood up. Fat flakes of snow clung to her stylish knit hat and nestled their way in between silky strands of hair peeking out from the edges. Her lips were bright pink, swollen, and glistened wetly. The thought of those lips on other parts of his anatomy surged, and the uncomfortable cold and dampness suddenly eased. God, he couldn’t wait to get her alone, naked, and underneath him, open and—</p><p>“Look out below!”</p><p>The war chant echoed down the slopes in warning but it was too late. Aidan stumbled back as several hard-launched snowballs hit him in the face and chest. His breath cut out at the icy sharpness as snow exploded in his mouth, up his nostrils, and in the gap of his jacket.</p><p>“What the hell?” His yell barely registered under the sudden shock as three teenage boys came into view. Piles of snowballs held in their hands like machine gun artillery, they stared at him with disrespect and impatience.</p><p>“Sorry, man, you got caught in the crossfire.”</p><p>“Yeah, dude, hope you weren’t hurt.” The second teen’s words ended in a snicker, obviously disgusted at the idea of a grown man not able to take a few snowballs.</p><p>Aidan opened his mouth to defend his wimpy actions but five feet of bristling feminine fury jumped in front of him.</p><p>“How dare you hit Mr. Hunter?” Isabella spit out, her finger jabbing at each of them. “Peter, Mark, Tommy, you should be ashamed of yourselves. You know the rules about snowball fights. Before you fire, you look for innocent bystanders.”</p><p>Aidan’s mouth dropped open. He waited for the gangly, testosterone tempered teens to bitchily complain to her, or make fun of her tirade, but to his astonishment, they all looked abashed. “Sorry, Ms. Summers.” Mark dropped his head. “Didn’t see you.”</p><p>“Who was your target?” Isabella demanded.</p><p>Tommy raised a finger to point to another group of boys behind a large spruce. The group bent over in hysterics, obviously loving the idea of an elementary teacher giving their friends hell.</p><p>“Well, you could have hurt him. Next time watch what you’re doing.”</p><p>“Yes, Ms. Summers.”</p><p>Aidan huffed with indignation. Hurt? She actually thought a few snowballs would hurt? He gazed at her in astonishment, but her glance confirmed his suspicions. She actually thought he was pissed off. Aidan almost laughed out loud. What type of men did she date anyway? Did she really think he was a stuffy city boy afraid of a bit of snow and some teens? Maybe it was time to show her how loud he could roar...</p><p>While she was distracted still disciplining her charges, Aidan ducked and made a few icy balls in the next few seconds. Then hid them under his jacket as he stood up.</p><p>“Now, apologize to Mr. Hunter.”</p><p>The three boys literally rolled their eyes at him. Mutters of “sorry” hit the air.</p><p>“It’s okay,” he said gruffly. “Just watch it next time.”</p><p>They began walking away. “Aidan, are you okay?” she asked gently.</p><p>“Baby, you ain’t seen nothing yet.” He spun on his heel. “Hey, boys!”</p><p>The three teens turned.</p><p>With rapid fire, he clocked each of them in the face with three perfectly launched pitches. Isabella sucked in her breath. He watched with satisfaction as Mark, Tommy and Peter spit out snow and blinked in pure astonishment at the maneuver.</p><p>“Good enough to be on your team, man?” Aidan asked.</p><p>Tommy grinned. The other two gave the thumbs up signal.</p><p>“Aidan, what are you doing?” she cried.</p><p>Aidan pressed a quick kiss to her lips and let out a whooping war cry. “Don’t worry, honey, I’ll be fine. I’m charging into battle and we’re gonna kick a little ass!”</p><p>The teens yelled out in agreement and Aidan raced toward the spruce, already mentally forming his attack.</p><p>As he joined in the energetic snowball fight, he realized he’d never been happier in his entire life.</p><p>Isabella watched Aidan jump out and pummel a teen boy who held out his arms in a fake shield, then fell back in defeat. Her boyfriend roared his victory and high-fived Mark in an all male ritual she never truly understood.</p><p>Boyfriend?</p><p>The term flashed insistently in neon color. Was Aidan Hunter her boyfriend? They’d only been together for two weeks. Two wonderful, snowy, cozy, perfect weeks, but much too limited a period to throw the word around so casually. She winced at the awful adolescent phrase, yet her heart beat like a galloping stampede of wild horses.</p><p>They hadn’t discussed the future, but Isabella sensed his emotions were real. After her huge mistake in Manhattan, she’d been careful of letting a man sneak past her barriers. Aidan may not talk about his past, and she sensed he struggled with some identity issues, but his heart rang true. The naked gleam of desire mingled with an open happiness and connection she never experienced before.</p><p>Tonight she needed to take the next step in their relationship.</p><p>A shiver raced down her spine. She’d ached to feel his warm hands on her naked flesh, to give herself entirely to him. Snuggled in the comfort of his embrace in the snowbank, his kiss gave her the answers she sought. His hot tongue and hard body fueled her need for more of him, but she’d finally crossed the invisible barrier of trust. His kiss promised no lies.</p><p>Isabella trusted this man enough to take the leap from friend to lover.</p><p>Images of a sheer black nightie and a romantic evening by the fireplace danced behind her lids. Tonight, everything would change between them. And she was ready.</p><p>As if he guessed her thoughts, Aidan turned his head and gave a naughty wink.</p><p>She hoped the gesture was not a precursor of their evening. The moment of distraction cost him as a ball of ice and snow cracked against his jaw and he staggered back. His team deftly protected him, but Isabella couldn’t control her giggles as he shook his head and frozen flakes flew around his head in a burst.</p><p>When she recovered from her hysterical fit, he stood a few feet in front of her. His eyes gleamed wickedly. Droplets of water slid from his soaked hair and traveled over the carved lines of his face. And his hands were full of snowballs.</p><p>She sucked in her breath. “Don’t you dare!”</p><p>“Think something’s funny, Isabella?” he asked calmly, one brow raised.</p><p>She stuck both arms in front of her. “Aidan! Stay away from me.”</p><p>Then he grinned. “Never.”</p><p>As he charged, Izzy let out a shriek and raced for her life.</p><p>Chapter Four </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aidan finished putting the final touches on dinner and set out a bottle of wine. The kitchen filled with the tantalizing aromas of fresh tomatoes and garlic. He sliced crusty Italian bread and placed chunks of mozzarella on the plate, then stepped back to admire his handiwork.</p><p>Perfect. He needed everything to be perfect tonight.</p><p>Because tonight he was telling her the truth.</p><p>Aidan fought off the nervous tug in his gut and poured the wine. For the past two weeks, they’d been together every evening. Each time he tried to confess, she turned those sparkling umbrella blue eyes on his, and her smile lit up her face, until he told himself he needed more time.</p> <p>But time was running out.</p><p>He was due to return to the city and his responsibilities after Christmas. The Pasta King restaurant chain was a demanding business, and as second in command, he needed to be his father’s eyes and ears. But he was tired of working in the city under his father’s reign. He’d wanted this time upstate at the cabin to really discover what he wanted. Now he knew, but had no idea how to get it.</p><p>He wanted Isabella.</p><p>But would she want him when she learned his true identity?</p><p>The question had no time to be answered. The doorbell rang.</p> <p>He opened it and his breath caught. Her honey colored curls tumbled over her shoulders, and her face was open and happy, her heart literally worn on her sleeve for him to see. Aidan had never met a woman who gave herself so freely and unselfishly, not asking for anything back. She was truthful, headstrong, and passionate. She was the woman he’d been spending his whole life looking for, and tonight he wanted no more secrets between them.</p><p>“I brought pastries from the bakery.” She held up a small box.</p><p>She wore a fuchsia pink turtleneck, hip hugging jeans, and low heeled boots. Golden hoops flirted with her hair as she turned her head. Her lips were painted in bright pink to match her shirt.</p><p>“Did you sneak any before you came?” he asked, studying her with narrowed eyes.</p><p>Isabella looked shocked. “Of course not!”</p><p>“We’ll see about that.” He pulled her close and kissed her. Like old lovers, her body peaked and responded to his with unconscious ardor, as his tongue thrust into her mouth to taste and stroke. His hands came around her body to grab her buttocks and arch her closer. He swallowed her moans with masculine pleasure. “Hmm, you’re right, you weren’t lying.”</p> <p>She pushed him away in mock outrage and made her way into the cabin. “Very cute. You better feed me, buster. I’m starving.”</p><p>They feasted on the meal and drank wine under the mistletoe. After two heaping plates of pasta, she leaned back in her chair with a satisfied groan. Her sated expression tempted him to satisfy her in a whole lot of other ways. Most involved her being stripped naked and lying open for him. He fought a shudder and reached for patience.</p><p>“How did you learn to cook so well?” she asked.</p><p>Aidan sipped his wine and smiled at the memory. “God, I hate to say I was a mama’s boy. But I kind of was.” She laughed. “Since I was an only child, I grew up in the kitchen. My mother cooked night and day. Homemade pasta cranked by hand. Hunks of sausage and meatballs simmering in gravy for hours. I learned how to pick a fresh vegetable and the best way to carve meat before I even hit a baseball.” He shook his head. “Cooking made her happy. She’d invite cousins, neighbors, friends to the table. Most of my memories centered around meals.”</p><p>Isabella propped her face in her hands with a dreamy expression. “That sounds so wonderful. I’d love to meet your mom.”</p><p>Pain cut through him like a dull edged knife. “She died a few years back.”</p><p>She immediately reached for his hand. “I’m so sorry, Aidan, I didn’t know. That must have been hard on you, especially so young.”</p><p>“Yeah, it pretty much sucked. My father was more of the workaholic, disciplinarian. I love him, of course, but my mother always caught the big picture. My dad looked at life with more of a narrow view, so we clashed.”</p> <p>“Is this why you don’t want to be involved with his business?”</p><p>Aidan closed his eyes. He needed to tell her. Everything. His heart pounded with nervous anticipation. Would she understand? Would she forgive him for keeping the truth from her? “I want to tell you more about the business, Isabella. Why don’t I set out the pastries, put more wood on the fire, and we’ll talk?”</p><p>“Sounds like a plan.” They cleaned up together and Aidan put on a pot of coffee while she sang “A Holly Jolly Christmas” in an uneven melody that made him laugh.</p><p>“Let me use the bathroom. I’ll be right back,” she said.</p><p>“Okay, I’ll put another log on the fire.” He walked to the woodpile and reminded himself they had deep feelings for one another. This was more than a one-night stand. He wanted a permanent relationship with Isabella, and he’d bet she felt the same. The way she looked at him with her heart in her eyes couldn’t lie.</p><p>He closed the door, stoked the fire, and turned.</p><p>Then froze.</p><p>Isabella stood in the doorway. She wore a tiny black lace slip that cupped her full breasts, skimmed her curvy hips, and halted mid-thigh. Her hair tumbled around her shoulders in full burnished glory, and a faint blush touched her cheekbones as she shifted her bare feet and stared at him.</p><p>“Aidan?”</p><p>His name floated to his ears in a breathy whisper, rich with promise, husky with desire. Every thought he’d ever had, every emotion he ever experienced, all fled in the midst of the woman across the room, waiting for him to answer her.</p><p>He closed the distance between them in three quick strides and took her in his arms.</p><p>His fingers met silky, warm skin, and soft, full curves. He twisted his fingers in the thick waves of hair and tugged, exposing the delicate line of her throat and rapidly beating pulse. She moaned low in her throat and Aidan drank in her scent, punch drunk like a vampire about to feast. Her arousal drifted to his nostrils, and he bent his head to run his tongue down the vulnerable curve of her neck, nibbling, then sank his teeth gently into her skin.</p><p>She cried out and arched in his arms. With a low murmur of satisfaction, he scooped her into his arms, walked into the bedroom, and laid her on the bed.</p><p>His head pounded with an urgency he rarely felt when claiming a woman, and he shed his clothes in minutes to join her on the bed. Aidan took her mouth for a deep hungry kiss, while he tugged the delicate straps of her slip down over her shoulders. Bared to the waist, he stared at her ripe curves with delight, and she squirmed under his gaze, obviously uncomfortable at such rapt attention. Aidan bent his head, grasped one ruby nipple between his lips and sucked. The contrast between her soft skin and the hardness of her nipple made him crazy, and he rubbed his five o’clock shadow between her breasts as he kept up a steady suction. Her head tossed back and forth on the pillow as he pleasured her. Her breasts gleamed wetly in the moonlight, and he muttered his approval as he gently took one rigid tip between his teeth and tugged.</p><p>Her body shot up as sensation grabbed her. He laughed low in his throat and worked his way downward, pulling the slip inch by inch to reveal more of her body.</p><p>He kissed the flat curve of her belly and nipped at the sensitive skin of her inner thighs. The delicious scents of vanilla and spice drifted to his nostrils. Halfway drunk on her scent and taste, he tossed the slip on the floor and sucked in his breath.</p><p>She wore no panties.</p><p>“You’re so frikkin’ beautiful,” he rasped. “Look at how perfect you are for me. So ready.” Tight golden curls hid her sex, but he deliberately pushed her thighs open. After a brief hesitation, she allowed him full access, and he spread her wide, glimpsing pink swollen lips. He slipped one finger into her tight, wet heat and shuddered with the intensity of her response. Aidan realized he wouldn’t be able to wait much longer to claim her. She gasped for breath, and her arousal eased the passage of his fingers as he stroked her deep. One finger. Two. Then—</p><p>“Aidan!”</p><p>“Not yet, baby. I have to taste you first, I’ve waited too long.” He dipped his head between her spread thighs and pressed his tongue against her swollen nub.</p><p>Liquid heat rushed over him. He drowned in her sweet taste as he allowed himself to explore her most intimate folds, his tongue stroking while his thumb rotated with teasing motions around her clit. She paused on the edge of release but he kept her there, refusing to give her the strong pressure she needed to climax. His name sang in his ears as she thrashed beneath him. When his own arousal became too much, he reached over to the table and grabbed a condom. He sheathed himself quickly and paused at her entrance. “Look at me, Isabella.”</p><p>Her eyes flew open. Deep blue eyes pierced his. Foggy with need. Dazed with passion.</p><p>He surged forward and claimed her.</p><p>Home.</p><p>His whole body shuddered with pleasure as her channel squeezed him and held him tight. He pulled out inch by inch, teasing the tight bud, then lifted her thighs and plunged.</p><p>Isabella cried out and spasmed around him. He milked her orgasm and savored every nuance of her expression as she let go, but soon he neared the edge and with one last thrust he climaxed. Every muscle tightened and released in a sweet agony he never experienced. He tucked her into his body and rolled to the side, his lips buried in her hair.</p><p>They lay together in the shadows of his bedroom, her heart beating under the palm of his hand. And slept.</p><p>Isabella stretched her muscles in luxurious satisfaction and watched the man sleeping beside her. In her wildest fantasies, she never believed she’d have a man make love to her with so much intensity. Usually a bit hesitant, she didn’t want Aidan to think she’d be a quick roll in the hay for a holiday affair. But after two weeks in his company, she knew they had much more.</p><p>She’d fallen in love with him.</p><p>He slept with as much intensity as he worked and played. One errant blond curl rested on his forehead, and she smoothed it back, caressing the slope of his brow, his crooked nose, the hard line of his jaw. Her thumb pressed over carved, sculpted lips, and her body quickened when she thought of that mouth tasting every inch of her skin.</p><p>His body was lean and hard, his hands able to grip her and hold her still as waves of pleasure bucked through her. He filled every inch of her and fought for more space, until she felt completely invaded, her body no longer just hers. No, he’d claimed more than her body in their lovemaking session.</p><p>He claimed her heart.</p><p>His eyes flew open. The golden depths burned like the sun, then turned warm like a half-lit summer afternoon. “Hi.”</p><p>Isabella smiled back. “Hi.”</p><p>“What time is it?”</p><p>“We only slept for an hour, it’s still early. I want dessert.”</p><p>A laugh rumbled through his chest. “I didn’t sate you enough, huh?”</p><p>She fought past a blush and knew she’d lost. “You did such a good job I need sustenance. Sugar specifically.”</p><p>“Then let’s rip into those pastries.”</p><p>She grabbed his shirt and buttoned it halfway, then strode ahead of him. His lusty whistle made her giggle, and she figured she’d be ready for round two sooner than originally planned. Isabella settled herself at the table and had just secured a chocolate croissant when her phone buzzed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aidan munched on a cannoli while she punched the numbers in her BlackBerry. Then frowned. “It’s Liz. She marked the text urgent and wants me to call.”</p><p>“Probably wants to talk to you about her date last night. Don’t worry.”</p><p>“Yeah, but, do you mind if I give her a quick ring?”</p><p>He smiled and pressed a kiss on her lips. He smelled deliciously of chocolate chips. “Of course not. But I may eat all the pastries.”</p> <p>She punched in Liz’s number and drifted into the kitchen. Her friend answered on the second ring. “Hi, what’s up? Is anything wrong?”</p><p>Liz sounded wary. “Where are you?”</p><p>“At Aidan’s.” Silence. “Liz, you’re freaking me out. What’s going on?”</p><p>“Did you have sex?”</p><p>“Liz!”</p> <p>“What? We tell each other everything and this is important.”</p><p>Isabella glanced at her lover happily munching pastries and lowered her voice. “Yes. But I’m not discussing details.”</p><p>Her friend let out a relieved breath. “Thank God. Then he must have told you the truth and you know who he really is.”</p><p>A sliver of ice trickled down her spine. “What are you talking about?”</p><p>“The Pasta King, Izzy. Aidan Hunter is the son of the Pasta King. The most eligible bachelor in New York City.”</p><p>The room spun and she clutched the kitchen counter for balance. Her mind worked sluggishly to keep up with the information dump. “How do you know this?” she asked dimly.</p> <p>“I googled him. Right after you started seeing him, I wanted to make sure I could trust him. I didn’t tell you because I figured if it got serious he’d tell you himself. Holy crap, you didn’t know? That bastard! Why is he still pretending to work on a tree farm when he’s one of the richest men in the state?”</p><p>Isabella heard her friend droning on with a variety of insults she knew well. Finally, she fought herself back to composure. The silly joy drained out of her body and left an empty void. Her tone was wooden when she managed to speak. “I’ve gotta go, Liz. I’ll be okay. I need to talk to him.”</p><p>She pressed the button and ended the call. The past hovered and crashed around her. What game was he playing? My God, had he been leading her on the whole time, slumming with the elementary teacher upstate? Did he plan to return to the gorgeous, poised, city women able to properly handle the heir to an empire? Nausea slammed her stomach and she fought for control. Then slowly walked out to the dining room.</p><p>“Well?” Aidan asked. “How bad was the date? Did she—” he trailed off, taking in her expression with concern. “Iz? Are you okay?”</p><p>The man she loved had lied to her. She felt horribly exposed in his shirt and bare feet. Isabella wrapped her arms around her middle and squeezed. “I guess that’s how you know how to cook so well,” she said quietly. “After all, The Pasta King is known worldwide as the best Italian restaurant chain to surpass Olive Garden.”</p><p>The truth hit him full force and was reflected in his face. He rose from the chair and took a step toward her. “Isabella, please sit down. I’ll explain everything.”</p><p>“No thank you, I’d rather stand.” Her polite, chilly words hit the mark. Her teacher demeanor wrapped around her like a cloak. “Why don’t you start with who you really are?”</p><p>“I am Aidan Hunter. My father built the restaurants, and he’s known as the Pasta King. The stupid name stuck to me when I was born and began training to take over the business.”</p> <p>She kept her expression neutral. “Funny I didn’t recognize you from your photo. Voted most eligible bachelor by Cosmopolitan magazine. Congratulations.”</p><p>He winced. “I hate those damn magazines. I’m the same person I showed you, Izzy. Everything I told you was the truth. I just left out my actual business.”</p><p>Her voice hissed. “Truth? You haven’t told me the real truth since we met. What are you doing here? Escaping for a holiday break in the mountains? Bored of your city women so you decided to have a hot affair with a country teacher? Needed to mix things up a bit? You son of a bitch—you knew what happened to me with my ex! And you still kept the truth from me. I feel so stupid!”</p><p>She watched him grab at his temper. He raked his fingers through his hair, then clenched his fists. “Don’t you dare say that. You’re more than a holiday affair and everything you said isn’t true. I was drowning. I’ve been unhappy and feeling overwhelmed by life. I needed a break, so I took a month to stay in our upstate cabin so I could figure out what I really want. I took some odd jobs on the side to fill the time and give me an opportunity to meet new people.”</p><p>“Was I some kind of experiment?” she asked bitterly, pacing back and forth. Ice prickled her spine as humiliation settled over her. “I get it. I’m good enough to sleep with, but not good enough to bring home to daddy. Right?”</p><p>“Don’t.” He grabbed her by the shoulders and yanked her into his arms. Isabella fought him but he held her in an implacable grip as his mouth took hers. Her body betrayed her, opening under his carved lips, meeting each thrust of his tongue in an intimate battle. Her breasts swelled and peaked, demanding his attention. She grew wet, and Isabella dug her nails fiercely into his shoulders, giving him back all of her rage and lust and need.</p><p>He tore his mouth from her, breathing hard. “You’re not some half assed affair, Isabella,” he said softly. “You’re the woman I fell in love with.”</p><p>Silence shattered the room. Her eyes filled with unshed tears as she stared at him. Her voice tore out in a ragged whisper. “Don’t play games with me.”</p><p>“I’m not. I know it’s only been a short time but I know. I just want to be with you.”</p><p>She shook her head hard. “No, you’re running away from a life you don’t want anymore. And I don’t want to be that excuse. You’re a millionaire with a family legacy and your photo in celebrity magazines. You live a different life, and you just can’t throw it away because things get rough.”</p><p>“That’s not what I’m doing.”</p><p>“Are you sure?” She tilted her head up and locked her gaze with his. “You were looking for a distraction because you’re not happy. I come along and suddenly you seem to have the answers. But you don’t.” Her heart splintered in her chest and the pain buried in deep. She ached to believe he loved her and they could make it work. But he was running away, and until he realized what he wanted in life, she would always wonder if she was enough. “You didn’t tell me for a reason, Aidan. Because you don’t know what you want yet. “</p><p>He gripped her hands. “Izzy, since I met you I realized I was missing a piece of myself. Damnit, I was going to tell you the truth tonight—I told you I needed to talk. I don’t want to go back to the city. I want to stay here with you.”</p><p>“I won’t let you.” She dropped his hands and moved away. “I’m sorry, Aidan. You need to figure things out on your own. Some part of you didn’t trust me not to walk away once I knew the truth. And you were right. Because you’re not ready yet. I can’t be an excuse to leave an empire behind on a whim. I need more than that.”</p><p>“I’ll work it out.”</p><p>She paused in the hallway. “I promised I’d never put myself in a position where I felt lacking. If you stay now, I’ll always wonder when I’ve stopped being good enough.”</p><p>“That won’t happen.”</p><p>She shook her head. “Go back home, Aidan. Find out what you want.”</p><p>Isabella kept her hands steady as she put on her clothes, grabbed her purse and walked out the door. He said her name once. The sweet sound caressed her ears, and she hung on to it, knowing it would be the last time she heard his voice.</p><p>Then she turned the knob and left him standing in the middle of the cabin, alone.</p><p>She’d left him.</p><p>Aidan stared at the closed door in shock. The truth of her words hit hard, and he stumbled to the liquor cabinet to pour two fingers of Scotch. His fingers trembled around the glass but the liquid burned hot in his tightening throat.</p><p>What had he done?</p><p>His mind grasped for answers. Aidan assumed once he explained the truth about his identity, she’d understand. That they’d work out a plan. But he began to realize the responsibility wasn’t Isabella’s. She knew who she was. She knew what she wanted.</p><p>He didn’t have a clue.</p><p>His gut twisted with his own lies. No, that wasn’t true. His father knew what he wanted his son to be: a clone. He wanted him to rule New York City and their restaurants on his terms. But Aidan had other ideas—ideas that pulsed deep inside but ones he was too afraid to fight for—too afraid to admit he wanted.</p><p>Aidan thought the hoax was a way to protect himself and find what he really wanted.</p><p>It had worked. He’d found Isabella Summers. But the same hoax had caused him to lose her.</p><p>Aidan gazed at the closed door and wondered what the hell he was going to do.</p><p>Isabella propped her slipper-clad feet on the tabletop and reached for another handful of popcorn. Jimmy Stewart slid through the snow-slick streets in It’s A Wonderful Life, screaming Mary’s name. She’d already cried a few times though she knew the movie by heart. Of course, since Aidan had left two weeks ago, she’d been weepy all the time.</p><p>Izzy sighed and her gaze flickered to Charlie Brown. The lights flickered cheerily in memory of the man she’d met over a month ago on a Christmas tree farm. The Pasta King. The richest, most eligible bachelor in the city. Interested in a small town elementary school teacher.</p><p>What a joke.</p><p>The inner taunting voice couldn’t seem to shake her belief their time together hadn’t been a lie. When Aidan kissed her and looked in her eyes, she knew the man he was. He’d shared stories of his family, his upbringing, and she could see how he’d screened carefully to keep his identity hidden. Still, something told her he’d revealed more to her than he had with women before him.</p><p>Not that it mattered. She’d discovered he returned to New York without a word. Probably would forget about her as soon as New Years hit, surrounded by gorgeous society women who catered to his every need.</p><p>Jerk.</p><p>She stuffed another handful of popcorn in her mouth when the doorbell rang.</p><p>Isabella looked down at her ratty robe, bunny slippers and old T-shirt with sweatpants. Who could that be? Liz would be out on a hot date—her family was all gathering for Christmas dinner tomorrow. She went to the door and peered out the curtain.</p><p>Aidan Hunter stood on her doorstep.</p><p>Izzy wiped her mouth on the sleeve of her robe, raked her fingers through her knotted hair, and groaned. Oh for God’s sake, what was he doing here on Christmas Eve? The bell rang again and she knew he’d spotted her. With a deep breath, she opened the door.</p><p>“Aidan.”</p><p>His gaze raked over her evening attire. Amusement gleamed within golden eyes, and his mouth curved upward in that sexy grin that made her want to rip his clothes off. “Can I come in?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She motioned him in and wondered if she could escape to put on some make-up. Then pulled back her feminine instincts, reminding herself a relationship could never work between them.</p><p>“My favorite movie.” He pointed to the television. “Wouldn’t everyone want the opportunity to have a do over?”</p><p>“Aidan, what do you want? It’s Christmas Eve. Did you drive up from the city?”</p><p>“I needed to ask you an important question,” he said.</p> <p>“You could have called.”</p><p>“Not with this question.”</p><p>Isabella squirmed in her bunny slippers, wishing she had on a sexy cocktail dress with heels. She stalked back over to the couch and sat down stubbornly, refusing to stand in front of him. “Fine. Ask your question, then.”</p><p>“Now that you know I’m the Pasta King, does it change your feelings for me?”</p><p>Her mouth fell open like a guppy. “That’s ridiculous.”</p> <p>“You didn’t answer the question. I lied to you because I was afraid. And you were right—I didn’t know what I wanted. But now I figured things out. But do you know what you want?”</p><p>“I didn’t pretend to be someone I wasn’t.”</p><p>“Yes, but are you willing to love someone even if he doesn’t fit your perfect image?” Aidan paced back and forth, seeming to seek the right words. “I’m not a small town dentist, Izzy. The papers write messy articles and reporters sometimes hound me. I love my father, but he’s domineering and sometimes controlling, so I’m always standing up to him to be my own man. All this time I was so afraid I’d find a woman who wouldn’t see me for who I really was. I thought she’d want my money, my image, my family. I never imagined she wouldn’t want me. I assumed, like an ass, that I was the prize. Until you. Now I’m terrified I’m not good enough to be in your life.”</p><p>He paused in front of her, his face naked and vulnerable as he spoke. “I fell for you the moment you saved that damn Charlie Brown tree. I love this small town. And I do love the restaurant business. That’s what I’ve been missing. I spoke with my father and told him the truth. I’m moving out of the city. I’m going to open up my own Pasta King restaurant right here in Poughkeepsie. I’m branching out for myself and cutting the ties with my father. I want to do the work I love but in a place I can make a home for myself.” He paused. “I love you, Isabella Summers. And I want to make a home with you. If you want me.”</p><p>Isabella stared up at the man before her. A low humming rang in her ears. Slowly, she rose from the couch and walked toward him. Her hands cupped his beloved face and her heart squeezed, then bloomed to monstrous proportions, threatening to compete with the Grinch after the Christmas spirit invaded his soul.</p><p>Her voice came out husky with emotion. “You had me the moment you haggled over the price of that tree. I don’t care if you’re rich or poor and I don’t care what anyone calls you. Because you’re the man I love. I can deal with nosy reporters and a dynamic father-in-law as long as I have you.” She leaned her forehead against his and caressed a stray golden curl off his brow. “I needed to know I was what you really wanted.”</p> <p>His mouth came down on hers, claiming her with possessive, long thrusts of his tongue. She buried her fingers in his hair, her hips arching upward to meet his, the delicious taste of hot male hunger swamping her senses. “I never knew bunny slippers could be so damn sexy,” he murmured, lifting her high in his arms and pressing her deep into the couch cushions.</p><p>Isabella laughed and worked on the buttons of his shirt, tugging off the fabric. She bit the slope of his shoulder in gentle punishment and felt his answering shudder. “I’m glad you like them. The matching robe is on my Christmas list.”</p><p>“I may never recover.” His lips traced down the sensitive curve of her neck to her breasts. Her breath came in short, choppy gasps. “I think this is the best Christmas present I’ve ever unwrapped. You taste so sweet.”</p><p>Clothes dropped away and he held her tight. His lean, muscled body pressed against every lush curve. “Aidan.” His name broke from her lips and he took her mouth with possession as he claimed her. The night grew darker and the twinkling tree lights cast shadows over the wall. “I love you,” she whispered.</p><p>“I love you, too. Merry Christmas, baby.”</p><p>And Isabella knew it would be a very good year. </p> </body></html>"]