["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>6-2</p><p>All of my senses engage as I wait in line and stare through the clear glass—the fragrance in the air from the foil wrapped treats wafts under my nose, the beauty of the lines of shelves decorated with tiny dots and colored sprinkles mesmerizes me, and the anticipation of the taste makes my mouth water. Mmmm . . . just thinking of the first bite of bittersweet Belgian chocolate complementing the flavor of the Madagascar bourbon vanilla that oozes from its inside has me trembling. The black-and-white cupcake—it’s simply perfection.</p><p>Amidst the skyscrapers in Los Angeles’ South Park neighborhood, Sprinkles is a gem tucked away for those of us who seek out a small piece of heaven. I don’t come here often, but when I do it’s for that one special treat. The menu describes it as “Yin and Yang.” There’s an ancient proverb that simply put says complementary opposites give rise to the other, and it’s true—opposites attract. Without the vanilla inside, one would not crave the chocolate as much, but looking at the two parts united has me drooling.</p> <p>“You know what they say about staring through the glass,” a deep husky voice says from behind me.</p><p>His words tingle across my skin and my gaze snaps up. “Excuse me?” I stop short, in a daze, not even sure exactly what he just said I was so lost in my thoughts.</p><p>He chuckles. “You know what they say about staring through the glass,” he repeats.</p><p>My eyes blink and come into focus on the upward tilt of his full lips. Then I notice his smooth pale skin flecked with a light stubble, his sculpted nose even with a slight imperfection in its slope, large eyes with the most unusual gray color swirling from within, and chocolate brown colored hair framing his face—I’m not sure if he has just rolled out of bed or if product molds it just so. Either way, he is utterly beautiful.</p><p>“I’m sorry, I don’t know what you’re talking about.”</p> <p>“Just be careful so you don’t fall in like Alice.” He smiles, displaying his bright white teeth.</p><p>“I have no idea what you’re talking about.” I notice his eyes sweep over me and my heart starts pounding.</p><p>“Through the Looking Glass,” he responds in a dangerously husky voice.</p><p>This time when he speaks I catch a New York accent, ever so slight but extremely sexy. It reminds me of how Robert De Niro talks, just not as loud or fast. I continue to stare, unable to respond. I notice that his physique is long and lean. He’s dressed in worn jeans that fit him perfectly. His orange laced hiking boots scream “I don’t conform.” A pair of tortoiseshell sunglasses hang from the V of his gray sweater, which clings to his body perfectly. And an outdoor vest tops the outfit. It throws me off. It makes him look more like an Abercrombie model than a James Dean type. It’s navy blue down and quilted with a silver zipper. I don’t know why, but something about his outfit, about this man, captivates me.</p><p>“Number 98,” calls the girl from behind the counter.</p><p>He steps closer. His warm breath whispers across my neck. “Through the Looking Glass is the sequel to Alice in Wonderland. When Alice gets too close to the glass, she falls in and starts on a crazy journey,” he tells me as his arm waves in the air with a green ticket on display. Stepping closer, his gaze cuts from mine to the glass case as he hands his number to the clerk, who’s wearing a cute brown apron with the word Sprinkles scripted across it.</p> <p>“Can I have a dozen of the black-and-white cupcakes?” he asks.</p><p>Suddenly alarmed, my eyes dart to the case as I watch the single remaining row of beautifully crafted cupcakes diminish until there are none left. My irritation flares as I glance at my number—97.</p><p>The beautiful stranger hands the clerk his credit card and waits to sign the slip.</p><p>“I was number 97, my number was before yours,” I announce as he’s handed the bag that holds his treasure.</p><p>“Oh, I’m sorry. Here let me get the sales clerk’s attention so you don’t have to take another number,” he says.</p><p>I want to stomp my feet. I want to scream. I don’t want her attention. I don’t want another number. I want the cupcakes that he stole from me.</p><p>“Miss,” he calls draping his perfectly fit body over the case. She looks his way and with a charming grin, he says, “Can you help this lovely lady? She missed her number being called.”</p><p>“Of course, I’m so sorry. How can I help you?” the girl asks, averting her eyes from the man who looks like he should be on the cover of GQ magazine, over to me.</p> <p>He smiles at me with a face that belongs on a billboard. “Don’t fall in.”</p><p>I swear he’s goading me. But then he tips his chin and a sexy, smoldering grin passes over his lips and I’m not so sure anymore. He turns to look at me one more time before he exits, and excitement flushes over my face. I nod a slight cursory acknowledgement, then he disappears and disappointment washes over me—he’s gone. Crap. The cupcakes are also gone. Double crap. And now I’m left wondering if he saw me staring at that flavor? Did he distract me on purpose so he could purchase them first? Urrr . . . I’m so angry right now I consider walking out, but when the clerk asks me what I’d like I settle for the vanilla milk chocolate cakes—they are the mirror reflection of the black and whites, with vanilla cake and chocolate frosting, but they are not nearly as good.</p><p>As twilight approaches during my drive, the sky reminds me of his eyes—the stormy gray color. My Audi can’t accelerate fast enough for me to erase the image from my mind. I concentrate on moving through the traffic, changing lanes in an effort to think of anything else because the cupcake thief will not capture any more of my attention.</p><p>My phone rings and the sound jars me from my thoughts. I reach across the passenger seat and slip my hand into the front pouch of my purse where my BlackBerry can always be found. I check the display and smile. It’s my best friend, Dahlia London. Well, Dahlia Wilde now. She’s the girl who accepted me as her roommate in college despite my obsessive-compulsive habits, and ever since then we have remained friends. We’ve seen each other through so much and I can honestly say that I love her like no one else in my life.</p><p>“Hi, Dahlia girl.”</p><p>“Hello, Aerie, just checking on you.”</p><p>“I’m on my way. I got delayed, but I’ll be there shortly.”</p><p>“Oh, don’t rush. I was just worried. It’s not like you to not be punctual.”</p><p>“I know. I’m so sorry. The cupcake thief sabotaged my schedule.”</p><p>“The what?” she asks.</p><p>“Never mind. I’ll explain when I get there.”</p><p>“Okay,” she laughs. “Oh and, Aerie, River’s cousin is joining us for dinner,” she adds.</p><p>“The more the merrier,” I chime.</p><p>“See you soon,” she replies.</p><p>“Bye.” I hit the END button and concentrate on sidestepping the traffic.</p><p>After college Dahlia and I both moved to Laguna Beach. She had grown up there and returned to live with her fiancé, Ben Covington. Living in Laguna Beach has been a godsend. If I had to live in LA and deal with bumper-to-bumper cars every day, I would go out of my mind. I don’t know how Dahlia stands it. I’ve never heard her complain, but it must drive her insane. The traffic is so much heavier here than in Laguna and even more so than in Chicago.</p><p>Lincoln Park, Chicago, is where I grew up. It was the quaintest of neighborhoods with miles of greenery and tons of old fashion charm. My parents had me late in life and I was an only child. We lived near the shore of Lake Michigan in an old gray stone walk-up. My father was the marketing director and my mother the publications manager at the Cinema/Chicago. Their life revolved around preparing for the annual Chicago International Film Festival. As workaholics, they often towed me along on the weekends when they went to the theater. But I didn’t mind, I loved going to work with them. Come to think of it, walking through the props room of the theater often made me feel like I was Alice in Wonderland . . . why is the cupcake thief still on my mind?</p><p>Pushing him aside, the drive over to Dahlia and River’s makes me reflective, thinking about what brought me here. My uncle was diagnosed with cancer shortly before I graduated high school. I wanted to be close to him for as long as he had left, so at the last minute I chose the University of Southern California for college. My parents had already planned to retire to Florida after I graduated, so when they got the call, together we went to help my uncle through his illness. Sadly, he died before I finished my freshman year. After that, my parents decided to move to Florida, but I stayed. I was already entrenched in life at school. And once I finished there, I had no reason to return to the windy city, so I made Laguna my new home base. Actually, I chose to follow Dahlia, which in turn led me back to Laguna. And it all worked out wonderfully.</p><p>I was extremely lucky to get a job at Sound Music right after graduation. My uncle had forged an amazing relationship with the owner of the magazine, Josh Wolf, and he hired me as a columnist fresh out of school. By the time Dahlia completed her MBA, I was managing the new releases department and she came to work for me. But then tragedy struck and we thought Dahlia lost her fiancé. With her grief paralyzing her, she wasn’t able to work there anymore. But her fiancé hadn’t actually died. He returned three years later. By then she was already in love with someone else. I was actually the catalyst behind her new relationship. She had met a man years ago in college and I knew she was interested in him. So when River Wilde, the lead singer of the Wilde Ones, agreed to be interviewed by Sound Music Magazine, I knew just the person to conduct the interview. And now, almost two years later, I’m headed to Dahlia and her husband River’s house in the Hollywood Hills for dinner.</p><p>We actually haven’t seen each other since the chaos of the holidays and I haven’t gotten to see the wedding pictures or the pictures from their honeymoon in Paris either. I’m looking forward to catching up. Work has been so crazy that I haven’t been around much. The boss’s son has assumed the management role at the magazine and he has me running from city to city in a million different directions . . . interview this person, no wait I’m dumping that label so instead see if this person has a comment. It never ends. I’ve always loved my job, but right now, not so much. Especially since he told me he’s expanding from music to music and entertainment. He even hired some Pulitzer Prize-winning journalist from the New York Times to manage the entertainment side. I guess she worked for E Magazine previously so she has an entertainment background. Then he had the nerve to tell me in not so many words that I should be relieved I got to keep the music side. Geeez . . . thank you for that. I’ve only poured my life into my job.</p><p>I start to slow down as I approach the cul-de-sac where Dahlia and River live. Their late 1940s–style ranch is suspended high above the city with a large modern circular staircase leading to a beautiful pair of Art Deco double doors. The landscaping is beautifully kept with wildflowers peeking out in between eclectic rocks, and every corner is anchored with palm trees. The house is breathtaking, but Dahlia’s favorite part is the view of the Hollywood sign from her backyard. I have to agree—it’s pretty cool.</p><p>Dahlia has always been a lover of the outdoors. She runs, hikes, and swims. Me, I’m a lover of the indoors. I jog on the treadmill, work out with my trainer each morning at five a.m., and go to yoga class every Monday and Wednesday night. Dahlia says I have a type A personality and I definitely do. One reason we get along so well is because she’s a free spirit and my quirks don’t bother her. Although living together in college was a challenge. She’s anything but neat, but she made an attempt for my sake. She’d stuff everything away either inside the closet or in her drawers so I didn’t have to see the mess. I just tried not to look on her side of the room. Honestly, it made me a little anxious to see the disarray. Even going to her house gives me anxiety sometimes. It’s just that I believe everything has a place, and let me put it this way—she doesn’t. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As I pull into the driveway, my eyes dart first to the garage. The door is open and bottles, buckets, and rags are all over the place. Then I see the burnt orange RX-7 parked behind Dahlia’s car. I thought Dahlia had said River’s cousin was coming to dinner, but now I wonder if she hadn’t meant to say her nephew. Maybe Trent traded in his uncle’s car for that thing. Come to think of it, I didn’t even know River had a cousin.</p><p>My patent leather heels hit the pavement and I turn to retrieve the clear Sprinkles bag. The thought of the white, not chocolate cupcakes is still making me seethe with anger when I feel myself sliding across the driveway. I lose my balance and my purse flies in one direction as the bag travels in the other, and I land on my knees. Yuck . . . Oh my God, what am I sitting in?</p><p>I slowly stand up and survey the damage. My palms, as well as my knees, are covered in black goo. I glance down at my cropped red jacket, the one I bought to wear next month on Valentine’s Day, which seems to be fine, but the matching sheath dress has a slight tear at the kick pleat. And my shoes, my favorite Kate Spades, are scratched and the patent leather is torn off one of the toes. I blow a piece of hair out of my eyes that must have freed itself from my headband and carefully gather my things, using only my fingertips.</p><p>I trudge up the endless flight of stairs as my chunky glass necklace flaps against my collarbone. I ring the bell with my pinky finger.</p> <p>“You made it,” Dahlia calls out cheerfully as she swings the door open.</p><p>She looks beautiful as always. An ivory colored sweater hangs off her shoulder, her jeans have a slight tattered look above her black converse sneakers, and her hair is draped over to one side. I have to say I envy her. It takes me three times longer than her to get ready, and she always looks perfect.</p><p>“Holy shit, what happened to you, Aerie?”</p><p>Frowning, I try not to cry as I hand her the bag of cupcakes with the box now turned upside down. “I slipped in the driveway.”</p><p>She takes the bag and drops it on the floor in the foyer.</p> <p>I’m sure the dessert is beyond repair at this point.</p><p>Her eyes sweep over me. “Aerie?”</p><p>I take a deep breath and let it out. She knows me; she knows how upset I am about my filthy outfit.</p><p>She grabs my purse and sets it down next to the clear bag then reaches for my hand. “Come on, let’s get you cleaned up.”</p><p>I clench my fist so the grease doesn’t get on her, but not fast enough. When our palms touch, she yanks hers away and scrutinizes her hand. “Oh my God! River!” she yells out as she takes a firmer hold of my hand, and tugs me from the entryway. We cross through the family room and into the kitchen where she pushes a chair near the sink. “Sit here. I’ll be right back. Let me just go get something to clean the grease off you.”</p><p>Alone in the room, I look around the kitchen. It’s modern, but not stark. The twelve-light ultramodern fixture that hangs from the ceiling must be at least eight feet long and lights the area well. And where you would normally find cupboards, there are thick glass shelves filled with cups, plates, and bowls of all different colors, shapes, and sizes—so shabby chic, so Dahlia. The floor is a mix of black and white swirled together—almost gray, like his eyes. Again he’s in my thoughts.</p> <p>My eyes rest on the counters as I try to distract myself. They are surprisingly clear of clutter. And the jet-black granite with white pearl splashed throughout adds a sparkle of light to what might otherwise appear dull. The high bar, complete with curvy black stools, bridges the kitchen to the living room. Her house is definitely a home.</p><p>A noise from the stove catches my attention. Suddenly, I smell garlic and hints of basil. I turn to look and see two giant pots bubbling over—one with spaghetti sauce and another thumping from the sound of boiling water. I hop up and rush to stir their contents. Natalie, the housekeeper, must have cooked and I’m so excited because her pasta sauce is the best I’ve ever tasted. I grab the pot holder and stir the sauce with the wooden spoon that was resting beside it. I try my best to avoid getting the black oil all over everything.</p><p>Then I walk back over to the sink and set the pot holder next to it. I pump soap in my hands and try not to laugh at the sight of the grease. Really, how did I not see the giant puddle in the driveway? I rub and rub, but it won’t come off, so I wipe my hands with the pot holder already covered in it, and then survey myself for further damage. Really, nothing to speak of—no scrapes or blood. I’m fine. I remove my jacket gingerly and kick my shoes to the side and sigh.</p><p>“Here we go,” Dahlia says coming back into the kitchen. She sets down a pile of fluffy white towels and a few bars of soap near the sink. “River!” she calls again. “I need some help.”</p><p>“Hey, I’m right here. What’s going on?” He appears in the staircase that leads down to the office, guestroom, and laundry room. Its opening freaks me out every time I come over. It’s a square cutout that sits between the kitchen and the family room. You just step down, no doorway, nothing to brace yourself against, and the railing doesn’t present itself for a few steps. I call it the infinity staircase and avoid it at all costs.</p><p>Once he sees me, he freezes. “Aerie, what happened to you? Are you okay?” he asks, clearly concerned.</p><p>“I fell, but I’m fine. Just a little dirty.”</p><p>Dahlia’s hands go to her h*ps and she clears her throat. “She slipped in oil,” she tells him, stressing the last word.</p> <p>I look up at her. She has a look of stern reprimand on her face.</p><p>“She’s okay?” he asks again, this time to Dahlia.</p><p>“Yes.”</p><p>He looks over to me, “I’m so sorry, Aerie. Let me get you something to get that off. I’ll be right back.” He quickly moves through the kitchen toward the door leading to the garage.</p><p>Dahlia shakes her head at him.</p><p>He turns back and mouths, “Sorry.”</p><p>She turns toward me and pulls my headband off my head to smooth the stray pieces back that have come loose from my French braid. “I am so sorry.”</p><p>“Stop apologizing. I’m fine. Really I am. And what am I missing here?”</p><p>She sighs and lets out a small giggle. “River and Jagger decided to change the oil in Jagger’s car this afternoon. I suggested they take it to a service center, but they insisted they were ‘real’ men and could do it themselves. River has never changed the oil in his car . . .”</p><p>There’s the sound of someone clearing his throat from the doorway as River strides in and hands me a container with the lid already off. It smells like oranges. “Here, this is a degreaser. It should take the oil right off,” he says.</p><p>I take the jar and rub some on my knees as Dahlia turns on the water and hands me a towel. I assume Jagger is River’s cousin. So Trent is not the one joining us for dinner.</p><p>“Where did you get that?” Dahlia asks River.</p><p>He moves closer to her. “Baby, I can’t tell you all my secrets.”</p><p>She swats his behind. “Don’t think I don’t know you two ended up at Jiffy Lube this afternoon.”</p><p>I bop my head up and continue to rub the grease from my knees. This story is getting interesting.</p><p>River grins and cranes his neck toward her lips. “Now, how did you find out that little piece of information?”</p><p>“The receipt you left on the kitchen counter next to your wallet. Busted!” she smirks.</p><p>I have to laugh. River has got to be one of the funniest, most down-to-earth guys I know and he and Dahlia couldn’t be more perfect for each other. They both look at me.</p><p>“What?” I ask. “I can’t find the story funny?”</p><p>“Well, at least let me explain before you laugh at me?” he jokes.</p><p>“Oh, I think we got this one,” Dahlia responds.</p><p>I finish with my knees and Dahlia takes the dirty towel and wets another, handing it to me. I stand up at the sink and spread the cool white liquid between my palms and scrub them. “I needed a good laugh after the day I’ve had.”</p><p>“Glad to be of assistance,” River chuckles.</p><p>Dahlia pulls River to her and clasps his cheeks. “I think it’s sexy that you tried to be an auto mechanic.”</p><p>He buries his head in the crook of her neck and with the water running I can’t hear what he whispers, but I can only imagine.</p><p>Now I clear my throat. “Excuse me. I’m right here. Remember, I’m the one who fell.”</p><p>River leans over and kisses my cheek. “I’m sorry you slipped. We should have done a better job cleaning up. You sure you’re okay?”</p><p>“I’m fine. My ego is bruised more than anything else.”</p><p>He pats my shoulder. “Now, finish getting cleaned up and I’ll go grab the oil spill culprit. He’s dying to meet you.”</p><p>Turning off the water, I twist to set the towel down on the counter. “Really? Why?”</p><p>“I’ll let him explain.”</p><p>“How old is your cousin? Sixteen?” I ask.</p><p>The sizzling sound of liquid meeting flame erupts behind us and all of our heads snap toward it. The spaghetti sauce is boiling over again.</p><p>“Shit!” Dahlia calls and runs over to the stove. The mitt is not there so she lifts the lid with her bare hand and immediately drops it. “Shit!” she calls again waving her hand in the air.</p><p>River grabs one of the towels on the counter near the sink and is by her side in a moment. He takes the lid off and lowers the gas, then turns to Dahlia. “Let me see that,” he says, taking her hand in his.</p><p>I tune out the rest of their conversation because in the midst of all the chaos, a shadow rises from the staircase. A long, lean body appears out of nowhere and stormy gray eyes sweep over me. My mouth falls open at the same time that my pulse begins to race. There stands the cupcake thief, right in the middle of River and Dahlia’s family room.</p><p>Chapter 2</p><p>Wake Me Up</p><p>Now here’s the question—when Alice falls down the rabbit hole, does she tumble or plummet? I couldn’t remember. Or should I really be asking if, when she falls through the looking glass, does she stumble or crash?</p><p>The corners of the cupcake thief’s mouth lift up when he looks in my direction and a low chuckle leaves his throat. “Alice?”</p><p>I can feel heat rising up my body and would venture to guess that my skin color almost matches my dress. At the same moment that the flush is creeping up my throat, his pure steady gaze somehow sets me at ease.</p><p>In the next moment, his eyes dart to the stove. “Fuck, I thought I turned the gas down.”</p><p>His light accent sends a shiver down my spine as I follow his movements. He dashes over to the stove and settles the flame like he knows his way around the kitchen. Then I finally break out of my trance as I see River holding an ice cube to Dahlia’s hand.</p><p>I blast the cold water. “Come over here, Dahlia.”</p><p>“I’m fine,” she says.</p><p>River’s cousin takes her hand and looks it over. “What the hell did you do? It’s blistering. You need to soak it in cool water.”</p><p>He knocks River’s shoulder. “Don’t you know anything about burns?”</p><p>River looks at him quizzically.</p><p>“You never put ice on a burn. Cool water only.”</p><p>“Dahlia, come over here now,” I order as I nonchalantly adjust the water temperature from cold to cool.</p><p>River shakes his head at his cousin. “Where the hell did you learn the things you know—chef, maintenance man, now paramedic?”</p><p>Dahlia laughs and winces as she crosses the kitchen to the sink. “Too bad auto mechanic didn’t fit in the repertoire.”</p><p>“Hey, you haven’t let me explain how your husband duped me into thinking he knew what he was doing,” the beautiful stranger says.</p><p>River rubs his hand on the back of his head. “Yeah, about that. Come to think of it, it was Xander who my dad taught to change the oil in his old corvette. I’m pretty sure I just watched.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chuckles from the guys fill the room as I prop Dahlia’s hand under the flowing water. I suddenly become keenly aware of two bodies shadowing us—River stands behind Dahlia and his cousin next to me. My heart starts beating so fast, I swear it’s pounding in my ears. River takes Dahlia’s hand and I shake the water from mine. As I twist to grab a towel, I can’t help but notice how close the cupcake thief is to me. He’s leaning back against the cabinets with his long, lean body stretched before me. His jeans are slung so low around his narrow h*ps that I wonder how they manage to stay up with no belt.</p><p>“Hi,” he says, handing me the towel. “I’m River’s sixteen-year-old cousin.” A slight chuckle echoes from his throat as his Johnny Depp jawline drops. But even with his head down, his eyes stay pinned to mine.</p><p>“You’re River’s cousin?” I dumbly ask.</p><p>He nods his head. “I’m Jagger. River and Dahlia are letting me crash here.”</p> <p>“Jagger,” I echo back. Nothing else comes out.</p><p>Dahlia turns the water off and I hand the towel to her. River moves towards his cousin. “Jagger, this is Dahlia’s best friend, Aerie, Aerie Daniels, and she’s the girl who’s going to have your ass served on a platter for the mess you made.”</p><p>His brows furrow as his eyes cut to his cousin.</p><p>“She fell in the Exxon oil spill you left in my driveway,” River coyly says.</p><p>Jagger’s head rises and dimples unlike any I’ve ever seen appear on his cheeks.</p> <p>“Right, I left it there. Just remember we both know I might have been the wayward sailor steering the Exxon Valdez, but you were Captain Hazelwood commanding the vessel.”</p><p>With a loud chuckle River says, “Again man, the things you know.” Then he looks at Dahlia. “Come on, baby, let’s get this wrapped up.”</p><p>They both leave the room and Dahlia calls over her shoulder, “Jagger, can you stir the sauce one more time so it doesn’t burn?”</p><p>“I got it, Dahlia. Don’t worry,” he responds.</p><p>His gaze swivels back to me and I suddenly become aware of how disheveled I am. I pat my hair, pull my jacket back on, and straighten the hem of my dress.</p><p>“Are you sure you’re all right? I’m sorry about the mess in the driveway,” he asks.</p> <p>“Yes, really I’m fine. Everyone just needs to stop asking me that. I slipped. No big deal.”</p><p>“Okay, Alice, just checking.”</p><p>“You know my name is Aerie, not Alice?”</p><p>“I know,” he says, amused, as he opens a drawer and pulls another pot holder out before heading back over to the stove.</p><p>Wet towels cover the counter and I gather them all in a pile.</p><p>“Do you think we should throw those in the washer?” he asks as if reading my mind.</p><p>“Ummm . . . yeah,” I answer.</p><p>He taps the spoon on the pot and sets it down before putting the cover back on. “Everything okay?”</p> <p>“Ummm . . . ,” I say again. “I don’t go downstairs.”</p><p>He cocks an eyebrow. “May I ask why? Is there something I should know since I’m sleeping down there? Demons, goblins, or maybe dead bodies?”</p><p>Just then Dahlia enters the room with her hand wrapped in gauze. She giggles. “She’s afraid of the staircase. It freaks her out.”</p><p>“I’m not afraid of it,” I counter. “I just don’t get why someone would cut a hole in the middle of the room and call it a staircase.”</p><p>“It’s more like a batcave, now that you mention it,” Jagger jokes.</p><p>“It’s design aesthetics,” River says, entering the room on Dahlia’s heels.</p><p>Jagger’s mouth quirks. “That’s up for debate, but I’ll let you have that one. It does fit perfectly with the architecture of the house.”</p><p>I feel a little at a loss. I know nothing about this cousin, but he seems to have become close to them. I know I’ve been busy with work, but I begin to wonder if I’m letting work get too much in the way of my friendships.</p><p>Jagger strides toward me with an ease only a man full of confidence could possibly carry. He takes the pile of towels under one arm. And with his smile wide again, he extends his other hand. “Come on, I’ll show you the trick. It’s in the descent.”</p><p>Without thinking, I take his hand and a shiver runs straight through me. He drops my hand as he hits the staircase and goes first. Once he’s about five stairs down, he turns, as I stand frozen at the top, my bare feet at his waist.</p><p>“You like red?”</p><p>I’m confused.</p><p>“Red dress, red nail polish. Sometimes a red face.”</p><p>He’s teasing.</p><p>“I guess I do. But my face doesn’t turn red.”</p><p>“Okay, if you say so. Now give me your hand,” he says, as if he thinks I’ll just do as he says. And I do. I take a deep breath and stand on my toes. I close my eyes, willing away my fear of heights.</p><p>“Hey, look at me.”</p><p>Again, his tone is commanding and again I don’t hesitate to do what he says, which is so not like me. But there’s something in the way his voice dips low that urges me to follow.</p><p>“Now keep your back straight and step down. Don’t lean forward. That’s the trick.”</p><p>I do as he says and before I know it, my hand drops from his grip and I’m clutching the railing. I did it, and without falling.</p><p>He grins. “See, nothing to it.”</p><p>I smile. “You’re right. Nothing to it.”</p><p>The color of his stormy gray eyes seems to intensify. He turns and takes the rest of the stairs, then waits for me at the bottom. “And your face didn’t even turn red this time.”</p><p>“My face does not turn red.”</p><p>“But it does. And you want to know something?” he says, leaning forward like he has a secret to tell.</p><p>“I’m not sure,” I whisper back.</p><p>“I know it turns red when you’re upset, I’m just not sure when else.”</p><p>My eyes flicker over his face.</p><p>“What?” He smirks. “Don’t be mad. I think it’s cute.”</p><p>I roll my eyes. “Go!” I order. “Let’s put these towels in the washing machine and get back upstairs before Dahlia burns the house down.”</p><p>The Hollywood sign is clearly visible in the star-filled night sky from where we sit. Heat lamps keep us warm and votive candles flicker around us on the top pool deck. Half-drunk glasses of Chianti, a large bowl of leftover spaghetti carbonara, a dish of lime wedges, and crumbs from the basket of garlic bread litter the table.</p><p>I grin as I watch Jagger squeeze a lime into his beer. I’d seen him do the same with his glass of water earlier and my curiosity peaks.</p><p>“Do you put lime in everything?”</p><p>He smirks, lifting one side of his mouth. “Yeah, I guess I do. Anything liquid, anyway. I’m not sure why.”</p><p>I shrug. “Maybe just because you like the taste?”</p><p>“Maybe. Funny thing is I’m not sure I can taste it. It’s just a habit.”</p><p>“That makes sense. I put ground pepper on all my food.”</p><p>He raises a brow. “All your food?”</p><p>“Well except for sweets.”</p><p>He nods and his eyes focus on me.</p><p>Needing to escape his scrutiny, I push my plate aside. “Natalie really outdid herself this time. That has to be the best pasta dish I’ve ever had.”</p><p>Dahlia turns to me. “Oh, Natalie didn’t cook.”</p><p>“You did?” I question.</p><p>She laughs. “Aerie, you know me better than that. No matter how hard I try I can’t even make grilled cheese without burning it.”</p><p>I laugh. It’s so true. I lift an eyebrow and c**k my head toward River.</p><p>He puts his hands up in surrender. “Takeout and the microwave, that’s my idea of cooking. You know that.”</p><p>Fingers tap on the table as my head twists. My heart pounds steadily. Wavy hair, a sexy, slender frame, broad shoulders, and those dimples blaring full force, baring a grin that says it all are staring at me.</p><p>“You made the spaghetti sauce?”</p><p>“Yes I did,” Jagger proudly answers.</p><p>I blink. “Tell me again where you came from?”</p><p>“In my house you either learned to cook or ate PB&amp;J every night.”</p><p>During dinner I was brought up to speed on how River’s cousin came to stay at their house. Jagger Kennedy grew up in New York City with his father. His mother, Celeste, and River’s mother, Charlotte, are sisters. Celeste lives in Paris and works for Hermès. I knew the orange laces of his boots looked familiar. Celeste visited Jagger whenever she traveled to the city on business and he visited her, but he was never in France when River and his family visited. Jagger’s father works for Tom Ford and his parents met while his father was in Paris for fashion week many years ago. A short-lived affair led to an unexpected pregnancy and neither his mother nor his father wanted to give up their jobs. Celeste’s career was very demanding and so she was okay with allowing Jagger’s father to raise him in the states. He seems to not harbor any animosity about the situation.</p><p>River and Dahlia met Jagger when they were on their honeymoon in Paris and he was visiting his mother. What brought him to LA we haven’t gotten to yet. But I have learned he is fluent in French, and since I took four years of it in high school, we conversed a little in the language of love. Well, to be honest, very little—my French is really rusty.</p><p>Dahlia stands up. “I’m going to make some coffee, and Aerie I bought a new flavor of tea for you.”</p><p>I smile and then look at her hand mitted in thick white bandages. “Let me do it.”</p><p>River rises. “No, let me. This could be fun. I see a lot of trading in our future,” he says grinning at his wife.</p><p>When she steps into him, she’s almost as tall as he is. She wraps her arm around his neck and whispers into his ear. The grin that slides across his face does not leave me wondering what was said. When she drops her hold, her voice takes on a seductive tone. “Come on, lover boy.”</p><p>He nips at her lip and I swear he growls as he circles around her. “Your wish is my command.”</p><p>Jagger lazily stretches back in his chair, throwing his arms behind his head in a way that places his long, lean body even more on display. He doesn’t comment on the abundance of cuteness shown by those two, so he must be immune to it, just like me.</p><p>The dishes are scattered around the table in front of us and I start to gather them. His hand reaches for mine and a slight laugh escapes his mouth. “Sit down. Let’s have dessert and then we’ll clean up. Do you think you can do that?”</p><p>I stare openmouthed at him. Then, raising a brow, I answer, “Yes, I can do that.”</p><p>“Good,” he says.</p><p>“So you’re a chef?”</p><p>He laughs. “No. I can cook maybe three dishes well. All compliments of watching my grandmother in her kitchen.”</p><p>“So what do you do?”</p><p>He brings his arms to the table and leans his elbows on it. “I’ve been modeling.”</p><p>My mouth falls open again. So I wasn’t wrong. Because he’s gorgeous, and of course a man with looks and a stance like his is a model. I can just tell he has to have a natural ease in front of the camera.</p><p>“Have you always modeled? Since both of your parents worked in fashion?”</p><p>“Fuck, no. I stayed as far away from their world as I could when I was growing up.”</p><p>“So how did you become a model?”</p><p>He slides his chair closer to mine and my pulse starts throbbing again. “The opportunity just kind of fell into my lap. I went to the New York School of Film thinking someday I’d move to California and work for a movie studio. Then after I graduated college I was waiting tables in the city trying to figure out what I should do—stay in New York or move to LA—when a woman I was serving asked me if I had ever thought about being a model. I laughed. But she was serious and asked if she could snap a few pictures of me. I figured what the hell. Why not? She left me her card. I glanced at it and tossed it away—I didn’t think I’d ever hear from her again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But you did I take it. Who was she?”</p><p>He shrugs with a hint of a smile. “She was an agent for Witham Modeling Agency. She submitted the test shots she took of me into their male search competition. And wouldn’t you know—I won. That year I appeared on the cover of E Magazine, shot by none other than Lourdes Madrid.”</p><p>“Lourdes Madrid? Wow, she’s a legend.”</p><p>“I know. I got really lucky. She saw something in me and for whatever reason took me under her wing. Everything just catapulted from there. One minute I was learning how to do quarter turns toward the camera, the next I was in a Calvin Klein ad, and then before I knew it I was walking the runway in Paris at Fashion Week.”</p> <p>“So you came to LA to model?”</p><p>“Well, actually no. I decided family connections might not be so bad, so I asked my dad to see what he could do to get me in touch with Tom Ford himself. He pulled a few strings and before I knew it I had a small part in his film project A Single Man.”</p><p>My mouth drops. “You’re in that movie? It was nominated for an Oscar.”</p><p>He laughs. “They cut me before it hit the screen. But it paved my way to hopefully play some good parts in the future.”</p><p>“Here we go,” Dahlia says, opening up the glass doors for River, who’s carrying a tray in his hands.</p> <p>Jagger bobs his chin toward River. “I don’t know if it’s cute that you’re so domestic, or if you look like the barista at Starbucks.”</p><p>“Fuck you, man,” River responds instantly setting the tray down.</p><p>“No f**k you, twice,” Jagger says.</p><p>The two of them go at it and I look at Dahlia who just rolls her eyes. She places a teacup in front of me. “These two hit it off from the minute they were introduced. You would never know they just met a few months ago and that they haven’t been friends their whole lives.”</p><p>“That’s kind of sweet,” I say.</p><p>“Yes, it is,” she answers, pouring something in my cup from her cute clear teapot. “Chocolate Chai,” she announces, and the scent makes my stomach curl. Dahlia is definitely adventurous. She’ll try anything—new coffee creamer flavors, new drinks at Starbucks, new entrees at our favorite restaurant in Laguna. Me, I stick with what I know I like—chamomile teas and grilled salmon.</p> <p>“Oh, I almost forgot dessert,” I announce, rising from the table.</p><p>“Oh, that’s right,” Dahlia says.</p><p>Jagger stands and looks at me. “Yes, dessert. I think we both brought cupcakes.”</p><p>“Yes, we did,” I respond curtly.</p><p>The thought of my white cupcakes turned upside down causes my anger to bare its nasty little face.</p><p>A sly grin appears on Jagger’s lips.</p><p>I avert my eyes. “Stay put,” I tell Dahlia. “We’ll do it.”</p><p>Jagger follows me. He reaches for the door first and slides it open. I tilt my head to look at the chaos in the kitchen. At least I’m comfortably dressed so I am ready to attack this mess the minute we are done. I changed my clothes before dinner since I felt disheveled after the fall. Luckily, I always keep an extra set of yoga clothes in my trunk in case I run late and can’t go home before class.</p> <p>“Alice? Did you hear me?”</p><p>I turned. “No, I’m sorry. What?”</p><p>“You turned red again.”</p><p>I look at him. His lips are so close to mine. All I’d have to do is stand on my toes to kiss him. What? Why am I even thinking that? “Why do you keep saying that? And please stop calling me Alice.”</p><p>“You don’t like it? I find it endearing.”</p><p>My hands go to my hips. “Well, I don’t.”</p><p>“It’s happening again you know.”</p><p>And it is. I turn away because I can feel the flush creeping up my body and I really want it to stop. I open a lower cupboard and pull out a dessert plate. The cupcakes I bought are still in the bag on the counter, but I don’t see his bag anywhere. Just as I’m about to ask where it is, Jagger opens the refrigerator and pulls out his beautiful pristine box of black and white cupcakes and hands it to me. “Here, put these on the plate. You should always keep cakes in the refrigerator. It keeps the icing set and makes the cake’s flavor come alive.”</p><p>I look at him skeptically.</p><p>“It does,” he says. “I promise.”</p><p>“Sounds plausible,” I answer.</p><p>He chuckles at me. “You’re so serious.”</p><p>I shrug with a small, self-conscious laugh but agree. “Yes, I am.” I set the box down on the table.</p><p>He puts his hand over mine and again I shiver. “Hey, I didn’t know when I bought those that you were upset, but I know now. So, Alice, please forgive me for stealing your cupcakes.”</p><p>Oh my God. The things his touch does to me. I don’t know if I should melt away out of embarrassment or jump for joy out of elation.</p><p>By the end of the evening, I’ve almost chewed my thumb raw out of nervousness, my jaw aches from laughter, and I think I’ve spent more time socializing in this one evening than I have in months—and I’ve actually enjoyed myself. Jagger makes me nervous and makes me laugh at the same time. I have to say he’s unlike any guy I’ve ever met—witty, smart, and so good looking. I can’t get over how he can look like he does and still come across as all guy.</p><p>It’s just the two of us sitting outside now. I’m sipping on the chocolate chai tea and I’m rather enjoying it. Xander called River and he and Dahlia stepped inside to take the call. River decided to quit the band just before they got married and Xander is on the road without him. I’m sure it must be strange. The two of them worked together for a long time. From what I overheard, the tour has kicked off with a bang and things are going well. I raise my head and breathe in the cool winter nighttime air.</p><p>“The weather is gorgeous in California. I don’t know how anyone could move away after living here,” he says.</p><p>“I agree. Did you always live in New York City?”</p><p>“Yes. I grew up in Manhattan with my father and once I was on my own I lived in a shithole and then a place that felt more like a frat house,” he says.</p><p>I raise an eyebrow and wonder why he chose to live that way.</p><p>“It wasn’t that bad, but let’s just say living on my own wasn’t as easy as I thought. And moving home wasn’t an option.”</p><p>“Did your dad move away? My parents retired to Florida once I left for college and moving there wasn’t as appealing as staying in California.”</p><p>“No, he didn’t. Once I left, I didn’t want to ask my parents for money and I couldn’t afford to get my own place, so I lived with roommates.”</p><p>He pours a small amount of tea in his coffee cup. “Smells like chocolate.”</p><p>“It is. Chocolate Chai.”</p><p>His lips tilt up as he sets the cup down.</p><p>“You’re not going to try it?” I ask.</p><p>His gaze brightens as he picks up one of the cupcakes that we were all too full to eat. “I think I’ll stick to this kind of chocolate.” He cuts it in half, then edges his chair closer to mine. “I picked these because the menu said it was made with Madagascar Bourbon vanilla.”</p><p>I take from his comment that it’s the alcohol, not the actual vanilla, that persuaded him to make his purchase and that makes me laugh.</p><p>“Try it.” He lifts half of it and hands it to me.</p><p>“Oh, I love those cupcakes. But, really, I’m just too full right now.”</p><p>I watch as he eats his piece and feel my breathing pick up speed. I swear I can almost taste the creamy center as he swallows.</p><p>He smiles at me as he takes his next bite.</p><p>I feel an ache that centers itself right between my legs and I need to focus on something else. “So, tell me, what was so bad about where you lived?”</p><p>He leans back in his chair. “Like I said, after college I didn’t have a lot of money. So I lived in a huge old Brooklyn warehouse with five other guys for $2,400 a month. The place was cheap with six of us splitting the rent, but it always felt like six families lived there and quickly had to evacuate—clothes were all over the floor, pizza boxes and Chinese takeout containers littered the counters, and empty beer cans were arranged in a triangle on the kitchen table.”</p><p>“Why is that?” I ask, trying not to focus on his body.</p><p>“It was our pool table,” he shrugs.</p><p>I laugh. “That’s innovative. Where did you move after that?”</p><p>“Once I took the modeling contract, I moved into the Windham Modeling Agency’s apartment. It was much nicer—a high-rise just outside of Chinatown. It was much cleaner and had maid service, but dudes were floating in and out constantly. It was six bedrooms and a central room with a large kitchen and living room. We had to bunk together, usually only two of us, sometimes three, to a room. A model signed by the agency years before was the super—but he was really our house manager. He was a little over the top with keeping the apartment in order. That place was the complete opposite of my apartment in Brooklyn. But it worked at the time.”</p><p>I raise a brow. “That’s an awful lot of roommates.” The thought of that many people living together horrifies me.</p><p>He nods. “It was. Do you have a roommate?”</p><p>I laugh. “No, I’m not exactly the easiest person to live with.”</p><p>“No?”</p><p>I laugh again. “Just ask Dahlia about me.”</p><p>An almost sneaky smile forms on his lips. “I think I might just have to do that.”</p><p>Wrapping my yoga jacket around me, I reluctantly stand. “Well, I really need to get going. It’s late and I still have to drive back.”</p><p>Jagger looks at the watch on his right wrist. It has a battered large black rubber band with all kinds of buttons and displays. He raises a brow. “It’s almost midnight. You’re not going to turn into a pumpkin are you?”</p><p>I smirk and having caught a rhythm with his humor, I give it right back. “Wrong fairy tale. That’s Cinderella, not Alice in Wonderland.”</p><p>“Shit, you’re right.” He brings his palm to his forehead. “What am I thinking? What about you? Where do you live? Not the rabbit’s hole and not a carriage, I assume.”</p><p>I giggle. Yes, Aerie Daniels, the girl who doesn’t have a funny bone in her body, giggles. What’s wrong with me? “No, I don’t live in a hole or a carriage, but I live in Laguna Beach and it’s like wonderland.”</p><p>“So do you recommend the beach over LA? I need to start looking for a place.”</p><p>“Well not so much the beach, just the town.”</p><p>“You don’t like the beach?”</p><p>“No, not really.”</p><p>“Hmmm . . .” He’s quiet and it seems as if he’s trying to process what I just said.</p><p>“The town is just so full of life. It’s quaint with so many art galleries and boutiques. The bars and restaurants are nice too. The hills have great views and the homes on the bluffs over the ocean on the south side are incredible. I live near town and it’s a short drive to work. Sometimes the traffic is bad, but nothing like if I had to drive to LA. And Laguna is just a really artsy and very liberal place to live.”</p><p>“So it’s your l’endroit que vous aimez?”</p><p>I pause for a moment, lost in his eyes. “Yes, I never thought of it that way, but I guess it is.”</p><p>He sips a beer, having moved on from coffee, and I watch the way the cool liquid flows down his throat. I’ve never noticed how sexy a man can look lifting a Heineken to his lips. “I’ll have to check Laguna out,” he says lowering his bottle.</p><p>“Yes, you should. I just can’t stand it here. It’s too crazy.”</p><p>“That makes sense.”</p><p>“What does?”</p><p>“That you wouldn’t like hectic city living.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I push my chair in. “I’ll have you know, I grew up in Chicago.”</p><p>He scratches his head. “Now, that surprises me.”</p><p>“You know what surprises me?”</p><p>He rises from his chair and steps toward me, twirling a piece of hair that has fallen lose from my braid around his finger before tucking it behind my ear. His mouth quirks up into an insanely smoldering grin. “No. Please tell me though.”</p> <p>My stomach flutters and I don’t know why. I try to ignore it, but it won’t stop. “That you drive Orange Julius.”</p><p>He laughs, tilting his head back and forth—only making him all the sexier. And in this moment, right here, watching this beautiful man, I can tell that he’s a free spirit, very much like my best friend. I can see why River, Dahlia, and Jagger, get along so well. They are all so much alike. I’m definitely the odd man out.</p><p>“Orange Julius?” he questions.</p><p>“That was what they named the car like yours in The Fast and the Furious once it got a makeover.”</p><p>“How do you know that?” he asks still laughing.</p> <p>“I have a thing for those movies and happened to read a number of articles about the cars.”</p><p>“I’m sorry. But that is the funniest thing I’ve heard in a while. I love that name. Do the other cars have names?”</p><p>“What’s so funny?” River calls from the door.</p><p>Jagger holds his stomach. “My need for speed.” He guffaws.</p><p>River raises a brow.</p><p>“Nothing, nothing,” he says. “What are you two up to in there?”</p> <p>“Dahlia’s hand is throbbing so I gave her some Tylenol and she’s sitting at the counter willing the pills to be absorbed through osmosis.”</p><p>“I was just going in to say goodbye. I’ll see what I can do.” I hurry past Jagger as I feel the heat rising up my throat, but this time it’s not from anger.</p><p>Once I’ve convinced Dahlia that she can’t break apart capsules and she’s going to have to put on her big girl panties and swallow them whole, I say my goodbyes to her and River and leave them near the sink, where she’s waiting to see if she’s going to throw up from swallowing the pills. It’s not that I’m heartless, but I lived with her for four years—I’ve experienced her phobia of pill swallowing many times and I’m confident she’ll be fine.</p><p>Jagger walks me to the door, opening it and ushering me forward. For the first time all night I notice his eyes scanning my silhouette and my heart pitter-patters. I spin around, stopping a little too close, and attempt to extend my arm. “Jagger Kennedy, it was a pleasure meeting you.”</p><p>He takes my hand, brings it to his lips and kisses it. “Alice, I assure you the pleasure was all mine.”</p><p>The tilt of his head, the look in his eyes, the feel of his lips on my skin—it all makes my stomach flutter and I can’t stop the wide grin from spreading across my face. A buzzing hums within me and I think it’s my heart beating way too fast. I clutch the railing and take the steps cautiously, slowly. I get to my car and notice the oil slick is gone. When I turn around to ask about it, he’s not there. I click my key fob and just as I’m about to open my door, he calls from the top of the stairs. “Alice, wait, you forgot something.” He strides down the stairs and extends his left arm, handing me a brown lunch bag. I realize he must be a lefty like me.</p><p>“Do I want to know what’s in it?”</p><p>He’s standing close enough that I can smell him, and he smells like lavender and sage. It’s better than anything I’ve ever smelled.</p> <p>I am rewarded with his bright white smile. “How about you open it when you get home and tell me if you do?”</p><p>I nod. He doesn’t move away. He’s standing so close. Moments of silence pass until he steps back and opens my door for me. Once I’m settled in my seat he hands me my seat belt and I buckle myself in. He steps back and shoves his hands in his pockets and I notice he’s biting his lip. I also realize I’m doing the same. With the car in reverse, I roll my window down and point to his car in front of me. “I really do think your car is cool.”</p><p>The lights from the driveway hit him, highlighting his good looks, but my gaze is drawn to his eyes. “What?” I ask, catching his stare. His head drops, but his eyes lift. The look can only be described as hot. And I never, ever, call a guy hot. Well, on occasion I have, but only when I’ve been drinking.</p><p>“For a sixteen year old. You forgot to say I think your car is cool for a sixteen year old.”</p><p>“No, I didn’t forget. It really is just cool.”</p><p>I start to roll my window up and he steps forward. “Aerie, wait. I completely forgot why I was so excited to meet you.” And I don’t fail to notice it’s the first time he’s used my real name all night.</p><p>“Oh, that’s right. River did say that.”</p><p>He leans down and braces his hands on the door. Again he is so close. I can smell his unbelievable scent. I can see how his dark hair shines in the moonlight. I notice the fullness of his lips—I could kiss him if I wanted.</p><p>“Do you think I could take you out to lunch tomorrow? Later next month I’ll be auditioning for the role of your uncle in the movie No Led Zeppelin and I’d love to pick your brain.”</p><p>And just like that my stomach somersaults. But this time it’s not fluttering, it’s falling.</p><p>Chapter 3</p><p>Story of My Life</p><p>In a hopeless effort to will the memories away, my fingers grip the steering wheel so tightly my knuckles turn white. Although the sky is clear, my mind is anything but. And, tonight of all nights, the traffic is light and I exit the 405 in no time. However, instead of taking my usual right, I go left and head south. I’m not in a hurry to get home and be alone, but why I head this way—I don’t know. As I drive through this small sliver of California that I usually avoid, I can’t help but allow Levi James to seize my mind. He was the first boy I ever loved, the boy I gave my virginity to, the boy who took away my faith in men, and the one who stole the precious window of time I had left with my uncle.</p><p>Tonight was unlike anything I’ve felt for a long time, if ever. But Jagger Kennedy wasn’t interested in me—he wanted something from me. When he asked if I would have lunch with him, I should have said no, but I couldn’t. A small part of me wanted to believe he was sincere. So I said I’d think about it and took my foot off the brake. I needed to leave. I glanced at him as he walked back up the steps. He stopped on the landing and with his hands in his pockets he watched me. He looked sincere—or maybe that is just what I wanted to believe.</p><p>Pulling over near the shore on the south bluff, I stare out into the water thinking about how I dislike the beach—and yet I never used to mind it. Why do things bother me so much now—how the sand that gets in my clothes is annoying, the wind that batters my hair is always distracting, and the jellyfish I have to sidestep are no longer wonders of beauty but hideous creatures. When I was younger I loved all of those things. Even before I followed Dahlia to Laguna, I had spent many days here. My uncle’s house was hidden away on the bluff and summer after summer this beach had been our playground. My uncle wasn’t married and he didn’t have any children, so I was like the daughter he never had. My parents didn’t go on vacation—they wouldn’t ever leave work long enough—but my uncle did, and he took me with him. We frolicked on the beach, he took me into LA, and he showed me all of California. And then before returning to Chicago, he’d fly us anywhere I wanted to go—Hawaii, London, Milan, and even Greece.</p><p>But after the heartbreak of that last summer I’d spent in Laguna with Levi, I didn’t return until it was too late. For the longest time I felt like Levi took the few years I had left with my uncle from me. Now I know it was me who robbed myself of those years, because I didn’t want to go back. I wish I had made different decisions and often feel guilty that I didn’t.</p><p>I loved my Uncle Ian. Maybe more than I loved my parents. What wasn’t to love—he was fun, full of adventure, had no rules. And he was unbelievably famous. As the lead bassist for the band Dazed, he lived the life of a rock star. Rolling Stone once said Dazed was the only band ever to have more influence on music than Led Zeppelin. And I believe that my uncle was the only musician to ever command a magazine cover more confidently than Robert Plant. Dazed may never have sold as many records as Led Zeppelin, and they might not have attracted as many concertgoers, but their sound will never be forgotten. But Uncle Ian’s death put an end to his legacy—or so I thought initially.</p><p>He was diagnosed with lung cancer just before my high school graduation and only lived six more months. The cancer was ravaging his body and when we’d spoken on the phone, his optimism always made me feel that he would get through it, but I should have recognized how sick he was. When my parents told me we were all going to Laguna for the summer, I knew then that we were nearing the end and I didn’t even wince at the thought of seeing Levi. I knew my uncle needed me.</p><p>By the time we arrived, his health had deteriorated so much from when I had last seen him a few months previously. Madeline, Levi’s mother and my uncle’s next-door neighbor, had been helping him out. But when we arrived, she no longer had to. I spent every minute I could with him. A hospital bed was set up in his study and I slept on the couch beside him.</p><p>He didn’t want to die but he tried to prepare me for it. Nurses came every day, and he only got weaker. By the time the end of summer neared, he was sleeping more and more and had stopped eating solid foods. He had to talk in whispers to conserve energy. Sometimes he would hallucinate, sometimes he would cry, and sometimes he would laugh. He would pick at the sheets and I’d hold his hands to stop him. I’d stay with him for hours and just sit and talk—to take his mind off the pain.</p><p>Then summer ended and I begged my parents to let me hold off on starting school until the second semester, but they refused. So I went to USC during the week and went back to my uncle’s on the weekends. And then it happened, when I was there. On a Friday night he asked me for a sip of water and coughed it up. We both noticed it was black. I told him I was sorry I gave him coke, so as not to worry him. But that night he couldn’t swallow his pills, so the nurse gave him some kind of shot in addition to extra doses of mor**ine through the pump. The next morning he was awake and grabbed my hand and tears spilled from his eyes.</p><p>“My little darling, I’m dying,” he whispered.</p><p>“I know,” I cried.</p><p>After the nurses left that morning, my parents begged me to go back to school. But I couldn’t. I knew he would be gone before I got back. So instead I stayed by his side. I kept my hand in his as his breathing quickened and grew shallow. Tears leaked down the side of his face and I’d wipe them. His eyes glazed over, but I knew he saw me. When his top lip turned bluish in color, his breathing slowed even further and he was staring. I thought he was staring at me until I noticed his breathing had stopped completely. And just like that, he was gone from my life.</p><p>And now Warner Bros. was making a movie about him. I’d already met with the executives last year and agreed to consult on the movie script. I wasn’t privy to all the information about my uncle’s life, but I was confident I knew enough. I was the keeper of his belongings—awards, albums, documents, and his guitars.</p><p>The first meeting with the film producers was both a classic rock love-fest and a contentious boxing match between the biographers and the scriptwriters. The movie manuscript took over a year to come to fruition—but I read it last month and couldn’t be prouder. Rather than be involved in the day-to-day workings of producing a movie, I released my rights and decided to let them do what they do best. I felt comfortable with the direction the movie was taking and work had grown crazy with so many new demands now that Damon was overseeing Sound Music, I just didn’t have the time to dedicate to it. My attorney wanted me to add an addendum that any major re-writes had to be approved by me, but I didn’t think that was necessary. Last I heard Brett Hildebrandt had been named the director, and I was happy to know they had hired one of the best. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I have to admit the idea of Jagger playing the role of my uncle intrigues me. Jagger is taller, much thinner, has darker hair, and honestly, better looking, but he does exude a similar confidence to my uncle. His looks could be downplayed. And for some reason I felt a certainty that beneath his lean, long body was a tower of strength—the same strength my uncle exuded. Shoving my own insecurities aside I decide that I’ll help him.</p><p>The beach parking lot is deserted and just as I put the car in reverse, I get a text message from a New York number.</p><p>Are we on for lunch tomorrow?</p><p>Assuming it’s Jagger, I respond quickly: I haven’t decided yet.</p> <p>How can I persuade you?</p><p>Let me pick the place.</p><p>Done. So I’ll pick you up at noon?</p><p>No. I’ll meet you.</p><p>That’s not how dates work.</p> <p>I didn’t think this was a date.</p><p>Time seems suspended as I wait for a reply. Staring at my illuminated phone, I jump, startled when my phone rings from the same number that just texted me. The thunder in my pulse makes my finger shake as I slide it across the screen.</p><p>“Hello,” I answer.</p><p>“I would have called you to begin with, but I wasn’t sure if you’d still be awake,” a low sultry voice says through the line.</p><p>“I’m not even home yet,” I answer, looking at the small silver watch on my right wrist.</p><p>“It’s almost 1:30. I thought it was an hour drive? Is everything okay?”</p> <p>“Yes.” I laugh. “I just had a stop to make. I’m heading home now.” I ease my foot off the brake and start to pull out of the parking lot.</p><p>“An oil change?” he jokes.</p><p>“No, definitely not an oil change.”</p><p>“Well, when you’re in need—you let me know. I just might be able to hook you up with an excellent service center.”</p><p>“I’ll keep that in mind.”</p><p>“So about lunch tomorrow. I thought you should know—I really want to see you again. It’s not just about your uncle.”</p><p>“Oh, okay,” I say, sounding incredibly stupid, but not knowing how else to respond. I’ve never been asked out on an afternoon date. Then, I hear voices in the background.</p><p>“Is that Dahlia?”</p> <p>“No. She and River went to bed. It’s just me, the TV, and the dead bodies.”</p><p>We both laugh and the sound of his laugh makes me laugh harder. Once our laughter fades he asks, “So I’ll pick you up then?”</p><p>“No, let’s meet at the Loft in Laguna. Say one.”</p><p>“Do you not want to ride in my car?”</p><p>“How’d you guess?” I tease.</p><p>“I knew it.”</p><p>“No really, it’s just easier that way.”</p><p>“Okay, for this time. You need to get your comfort level up. I get it.”</p><p>And he did. What could I say to that?</p><p>“Hey, can I ask you something?” he asks.</p><p>“I’m not sure. What is it?” I manage to sound relaxed when I’m anything but.</p><p>“Do you ever take the top down?”</p><p>I’m not the joking kind but I know exactly how to answer. “No. Never. In fact I’m not even sure I know how.”</p><p>A beat. A pause. I can tell he’s thinking. He’s been doing this all night—asking me a question and then quietly processing my answer.</p><p>“Jagger, I’m pulling into my neighborhood, but I’ll see you tomorrow.”</p><p>“I hope so, Alice,” he responds before the line goes dead.</p><p>There’s a line from Alice in Wonderland that tugs at my thoughts. The quote says something about being different yesterday than you are today and it strikes me as overly philosophical to have come from a fairy tale written in the 1800s, and yet it’s completely on the mark. Signaling, I take a right and head toward my house tucked deep away in Laguna Canyon. Easing past the community pool and the tennis courts, I come to a stop in front of the attached garage of my cape cod–style townhouse. My home backs up to a wooded hill and has a beautiful private patio where in the mornings I could sip my tea and listen to the birds sing while the sunlight filters through the large trees—I could, but I never have.</p><p>The garage door lifts and my car fits perfectly in its immaculately clean space. After walking into the house, I flick on the overhead lights in the kitchen. I set the brown bag on the counter and peer inside. A single cupcake sits with a Post-it note stuck to the side of the bag that says, “I really am sorry I stole your cupcakes. Please forgive me.” Closing the bag, I remember Jagger’s advice and put it in the refrigerator with a grin. Then I look around at my kitchen—striking espresso hardwood cabinetry trimmed in brass, shiny old world black appliances, and beautiful marble counters top it . . . the look is one of old Hollywood elegance. I passed on purchasing this place after my initial walk-through because the all-white walls and nautical theme was more than I could bear. But nothing else I looked at compared to the location and layout of this place. So two years ago I made the decision to buy it. But before I moved in, I planned out every detail of the remodel with my designer and I must say the results were fabulous. Yet, sadly, I realize, as I look at my Herman Miller barstools, that the only person to have ever seen it is Dahlia. I have allowed work to occupy my life and socializing has lost its place.</p><p>I walk into the living room and just admire it. Cameron, my designer, steered me toward using hues of burnished metals and lustrous minerals—malachite, onyx, rose gold, silver, and copper. A metallic swivel armchair is strategically set by the large picture window showcasing the wooden hills behind it. A Murano glass chandelier rests above the polished travertine cocktail table flanked by twin velveteen sofas of which I’ve only ever sat on one. A gas fireplace centers the room and a TV hangs above it, neither of which I can recall the last time I switched on. Finally, an old speakeasy bar I’ve never had a drink at burdens one corner. Everything is perfectly coordinated.</p><p>The staircase is fitted with a very safe iron railing and I take the steps one at a time, a glass of water in one hand and my purse on my shoulder. Upstairs are the master suite and guest bedroom, which I’ve turned into my office and furnished with a marble and brass desk, two plush burnt orange chairs with brushed nail heads placed perfectly in front of a floor to ceiling window, and an old wooden file cabinet that belonged to my uncle. This is the room where I spend most of my time. Glancing around I think it would probably be good for me to go through my uncle’s things. I’d moved them from a storage unit I’d had since college into this room’s closet and file cabinet. But I’ve never really gone through them.</p><p>The lamps cast a soft glow around my bedroom as I enter. The custom rose-petal colored wallpaper reflecting off the mirrored wall that includes the sliding doors of my closet makes the room look like a silk lined jewelry box and it’s my favorite place in the house.</p><p>Once I’ve pulled out a pair of soft pajama bottoms and a tank top from my drawer, I consider skipping my nighttime routine of washing my face and brushing my teeth. It’s late and I’m tired, but I just can’t do it. Walking into the room that reminds me most of my grandmother, a starlet who graced the silver screen, I admire the surroundings. It’s sheathed in glass tiles that remind me of her golden colored hair. The light fixtures of mottled glass and hammered metal punctuate the double sinks and the artful bronze knobs. My grandmother was a collector of costume jewelry. Her collection, now mine, was vast and I used some of the pieces to decorate this room. Her favorite broach holds back the shower curtain and glass beads sewn onto panels of silk stream down the window.</p><p>Looking into one of the large oval bathroom mirrors, I pull my yoga clothes off and stare. My uncle always said I looked like my grandmother and judging from pictures, I do. My prominent cheekbones are the same as hers, but my overbite was taken care of with braces where hers only leant to her offbeat beauty. I have a few curves that I work hard to keep from getting bigger. I tug my burnished golden hair down and let it flow over my shoulders in waves. It’s long enough to cover my br**sts. I never wear it down but in every picture I’ve seen of my grandmother, her hair is always down and draped to one side.</p><p>A yawn overtakes me and I hurry through my nighttime routine until I’m finally lying under the silken coverlet of my bed. Before shutting off the light, I pick up the picture on my night table—Ava Daniels, my grandmother, was a striking woman. She was born in Brooklyn to wealthy parents. She attended finishing school in Switzerland and met my grandfather there. He was much older than she and passed away shortly after my uncle was born. After he died she brought her boys back to the United States and embarked on a career on Broadway before she was signed to a contract with 20th Century Fox.</p><p>Like the roles she played, she battled a troubled emotional life . . . one that often included hospitalization and shock treatment for depression. She found her career hard to manage and eventually gave it up. My father and my uncle were raised by nannies. My father never talks about my grandmother, but my uncle always did. He too fought all his life against the encroaching darkness—but unlike her, I think he managed it much better. Unfortunately, my grandmother died of uterine cancer when I was five years old, before I ever really got to know her.</p><p>Setting the picture down, I notice the red light blinking on my phone and glance at it.</p><p>Just wanted to say bonsoir.</p><p>The metal of the lamp reflects on the screen and with a grin across my lips, I snatch it from the table and assign the number a name—Jagger Kennedy. He’s now an official contact in my list.</p><p>Goodnight and thank you for the cupcake</p><p>After running three miles on my treadmill in the morning and showering, I stand in front of my closet in my thick terry cloth robe and just stare at its contents. It’s a showcase of clothes, but staring at the right side, I can’t decide what to wear. I’m a shopper. I love the thrill of finding the perfect pieces that complement one another. I never buy just one piece—always an ensemble. My outfits are perfectly coordinated—pants hang with their perspective matching tops, but today nothing seems to suit the occasion. I untwist my wet hair from the clip on top of my head and decide to check the weather. Pulling open the French door, I step outside on my balcony and breathe in the cool air. I haven’t been on a date in months and that one didn’t go so well.</p><p>Zane Perry, the new lead singer of the Wilde Ones, and I met at River and Dahlia’s wedding. He had a smile that made me look twice and when he asked me out, I said yes. I met him at a movie theater in LA. It was the most awkward date I’d been on in a while because we hardly knew each other and the movie had many over the top sex scenes—sitting there listening to the woman’s moaning made me want to slide down my chair and fade into the darkness. Once the movie ended we went to dinner. That part of the date went much better, but not great. We ate and talked, but the conversation was forced. So when he invited me back to his place, I was surprised, but wanting to give him a chance, I went. After a few glasses of wine, he moved closer to me and I asked him to turn the lights off. Once he did, he kissed me, but there was no spark. I was used to that, as it seemed to be the norm for me. When his hands slid inside my blouse, I allowed it. When his fingers trailed up the inside of my thigh, I encouraged it. When he unzipped his pants and hovered over me on the couch, I craved the human contact. But as his c**k slid inside me, and he thrust over and over, I failed to feel even a hint of desire stirring. I made the noises I needed to make and he assumed I was just as into it as he was. That’s why I prefer the dark. It’s easier to fake it. Once we were done, I got dressed and told him I had to leave. He called me a few times after that, but I was busy with work. Sometime later, I’d heard from Dahlia that he and the label’s representative for the band had been having a thing on and off and that was all I needed to know—we wouldn’t be going on anymore dates. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Shivering, I step back inside and decide on denim. I pair my favorite skinny jeans with red high-heeled booties and a tight white sweater. I decide to leave my hair down— I’m not sure why, but I did like the way Jagger wrapped his finger around a stray strand yesterday. Next I decide on an Art Deco 1930s-style necklace from my grandmother’s collection. Its red glass pieces tilt back like butterfly wings. Clasping it and selecting simple gold earrings, I’m ready to go.</p><p>Butterflies swarm my stomach as I pull into the restaurant parking lot. I see him instantly—the wayfarers cover his gray eyes, the tattered jeans fit snuggly on his narrow hips, the scuffed boots with the orange laces, the messy but somehow perfect dark hair, and that blue vest. He’s got one leg canted against the brick wall of the building and the other planted on the ground. His head is bowed, and he’s got earphones in his ears. God, he’s sexy. My pulse races and I smile as I park my car next to his.</p><p>Guys don’t have this kind of impact on me—ever. Men have actually always been a bit of a struggle in my life—not that I’m into girls. It’s just I fell in love for the first time when I was sixteen and that ill-fated relationship kept me away from other guys until my freshman year of college. Then for the next four years I dated a handful of men each year. But I was always subconsciously looking for a reason to break up and easily found one. Sex is also something that’s always been a struggle for me. I don’t see what it is that women find so enticing about it. I’ve been with probably a dozen men, so it’s not like I don’t know what I’m doing. I get the mechanics; I just don’t understand what it is I’m supposed to be feeling.</p><p>He opens my door before I even grab my purse and stretches out his hand. I take it and he tugs me out of the car. “Hi.”</p> <p>“Hi,” I say back. My fingers are tingling from where they were wrapped around his hand.</p><p>“I’m glad you didn’t stand me up.” His mouth stretches into a slow grin.</p><p>“I thought about it, but decided I couldn’t do that to River,” I joke.</p><p>He bites his lip and the sight takes my breath away. “That makes me one lucky bastard to be his cousin.” He’s teasing me back. I’m already catching his stride.</p><p>“Yes it does.”</p> <p>Looking around over the top of his sunglasses, he glances toward the restaurant. “Ready to go in?”</p><p>I nod and he puts his hand on the small of my back, guiding me toward the door. The Loft is a casual bistro-style place with spectacular panoramic views. It has the best food around with a six-foot rotisserie and the most extensive cheese selection in all of California. We enter and he removes his sunglasses and tucks them in the slight V of his sweater. I watch his eyes as he evaluates the place. Today they’re like gray storm clouds—deep, rich, slow moving, even languid.</p><p>His gaze swivels to mine. Those eyes sweep over me in a now familiar way and send a shiver through me. “You look beautiful. Red really is your color,” he says fingering the faceted glass squares around my neck.</p><p>“Thank you. It’s a piece from my grandmother’s collection.”</p><p>“May I help you sir?” a voice says from behind me.</p><p>His hand drops from my neck, but finds its spot on the small of my back. I like it there.</p> <p>“Table for two?” the hostess asks.</p><p>“Yes,” he answers.</p><p>“Would you like to sit inside or out?”</p><p>I say “inside” at the same time that he says “outside.”</p><p>He leans forward. “It’s a beautiful day. What do you say we enjoy it?”</p><p>“Sure, why not,” I answer, although I’m thinking I never eat outside. The noise and the wind are just too distracting. The hostess leads us up to the second floor and we’re seated at a round table with four chairs circling it with a beautiful view of the beach. Jagger pulls a chair out for me and I sit. He selects the one next to mine, facing the ocean.</p><p>The hostess hands us our menus. “Your waiter will be right with you,” she says before leaving us alone. We’re the only people sitting outside and I notice it is actually really peaceful. We sit close and look over our menus.</p><p>Jagger leans forward. “So what’s good?”</p> <p>“I always order the grilled salmon. But I hear the flatbreads are amazing. Dahlia gets them sometimes when we eat here.”</p><p>“The vodka infused halibut on parmesan flat bread it is then. What about you?”</p><p>“The grilled salmon.”</p><p>“Maybe you should try something different today?”</p><p>I look at him trying to figure out if he’s making fun of me or maybe teasing me, but his expression stays neutral and his eyes remain focused on mine.</p><p>I sit up straight. “Sure, why not. Live a little. Right?” I’m not sure why I say yes, but I think it has something to do the sexy, smoldering smirk I knew it would put on his face.</p><p>He leans even further toward me and an incredulous smile plays around his lips. “Right!” And there it is—it makes my stomach somersault and my pulse race.</p><p>“Are you ready to order?” the waiter asks.</p><p>“Yes,” Jagger replies. “The lady will have,” he pauses and looks at me.</p><p>“A sparkling water and the grilled flank steak sandwich,” I say.</p><p>With a grin on his face he orders a sparkling water with lime and the flatbread. Then he inclines his head toward the sun. The view from the table is amazing. The water crashes against the rocks, the sky is bright, the clouds are fluffy and serene, and the wind stirs around us at just the right speed.</p><p>“What made you decide to change from modeling to acting?” I ask.</p><p>He chuckles. “That still sounds so strange, almost pretentious.” He runs his hand through his hair and bows his head then looks up with a crease in his brow. “I never had supercharged aspirations to be a model and since there’s an expiration date on that career, I thought it was time to start down the path I’d paved.”</p><p>I look at him quizzically.</p><p>“What I went to college for—film.”</p><p>“That’s right—The New York Film Academy.”</p><p>He nods. “Don’t get me wrong, I loved modeling and if I don’t succeed in Hollywood, I’ll go back to it. It’s just I’ve toyed with the idea of acting for a while and when I heard Tom Ford was directing a movie, I went for it. Now that I’ve had a little taste, I’d say I’ve been bitten.”</p><p>“I have no doubts you’ll be a success. You’re motivated to go the extra mile. In Hollywood that will carry you far,” I tell him.</p><p>“Yeah, I hope so. The decision wasn’t easy, but it was the right time.”</p><p>“What do you mean, the right time?”</p><p>“You know what, that’s a long story for another day, but I can say it just felt right.”</p><p>“Here we go.” The waitress arrives with a long thin plate in one hand and a sandwich in a bamboo basket in the other. She sets our food down. “Anything else?”</p><p>Jagger looks at me. “Some ground pepper.”</p><p>I’m touched that he remembered and can’t wipe the smile from my face. The waitress brings a large wooden grinder and adds pepper to both our dishes.</p><p>“Anything else you need?” she asks.</p><p>I swear she bats her eyelashes at Jagger. He looks at me and I shake my head.</p><p>“I think we’re good for now,” he replies.</p><p>I pick up a sweet potato fry and smile sheepishly. “I have a feeling these just might be addicting. Would you like to try one?”</p><p>“Absolutely,” he responds.</p><p>I don’t know what comes over me. I’m not the flirty kind, but I lean forward and dangle the fry near his face. He opens his mouth and I slowly feed it to him.</p><p>He makes a low purring sound. “Mmmm . . . those are definitely addicting.”</p><p>My fingers were on his lips and although the air is cold, I feel warm, almost feverish. I sip my sparkling water and lift my eyes to watch him eat. He pauses and looks up. His hair isn’t as styled today as it was yesterday, but it’s still equally attractive with pieces falling over his ears and eyebrows. “So what about you? Your career?”</p><p>I laugh, shaking my head. “Your profession is much more interesting. Tell me what Fashion Week is like.”</p><p>He reaches for his napkin and wipes his hands. “Nothing like you’d think. A typical day would start with me riding the train to the studio to take a test shot for any new campaigns, and then I’d hurry to a fashion show, and then hurry from that show to the next, then to a fitting. By the end of the day I’d be exhausted and fall asleep in the cab back to my apartment.”</p><p>Picking up a piece of flatbread, he offers it to me. “Try this.”</p><p>I open my mouth automatically and take a bite. “Mmmm . . . that’s really delicious.”</p><p>His grin makes my toes curl and then he pins me with his gaze. “Your turn now. Tell me about you.”</p><p>“Well, it’s really not that . . .”</p><p>The crash of glass breaking grabs our attention as both of us twist our heads toward the noise. A waitress dropped a bunch of plates. Jagger rushes toward her and helps her pick up the pieces.</p><p>When he sits back down he leans toward me and I can smell his scent of lavender and sage combined. “Sorry about that, you were saying?”</p><p>I breathe him in and then exhale before deciding to share the basic details of my life with him. I start by telling him about my grandmother the actress, my parents the film advocates, my college years with Dahlia, and that it was the impression my uncle left on Josh Wolf that got me my job at Sound Music Magazine.</p><p>Our conversation flows easily and time flies by. When Jagger glances at his watch, I do the same. It’s after five and I look around realizing the waiter must have long ago cleared our plates. Jagger flags the waiter and gestures that he’s ready to pay the bill.</p><p>As the sun starts to hang low, he stands and extends his hand. With a slightly sly smile he says, “Come with me. There’s something I’ve been dying to do.”</p><p>I give him my hand and at the touch of our skin that flutter in my stomach turns into a pounding.</p><p>“Give me your keys.”</p><p>I blink at him over and over. “Why?”</p><p>“We’re going to do something.”</p><p>I hand him my keys, again not sure why, but his commanding tone just mesmerizes me. He clicks the key fob then ushers me into the passenger side of my own car. He darts around to the driver side and he unclips the handle above his window and then reaches across me to do the same.</p><p>“I don’t think this is a good—” I start to say, but he cuts me off by placing his finger over my lips. I think about how my insurance policy doesn’t cover other drivers, but decide not to fret over that.</p><p>“It’ll be fun. I promise.” He winks.</p><p>He hits a button and, just like that, the top of my Audi is down. I twist my hair and knot it into a bun, and before I know it we are cruising onto the Pacific Coast Highway. He takes the dizzying twists and turns with the same ease he displays in his confident walk. I take the time to appreciate the view.</p><p>“Did you know this road took fifteen years to build?” he asks.</p><p>I glance over at him and can barely hide my amusement. “No, I have to say that is not a fact I have stored away.”</p><p>“Well, it did. It opened during Franklin Roosevelt’s tenure.”</p><p>“Interesting, since it has been many years since Mr. Roosevelt was in office and this road is still in a state of construction.”</p><p>A gentle glow over the horizon signals the sun will be setting soon. Jagger pulls up to a small grocery by the side of the highway that’s caught his attention. “Come on, let’s go in and try the artichoke bread.”</p><p>“That sounds really disgusting.”</p><p>“Alice, the sign says it’s the best around and you have to try things to see if you like them. Come on.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Walking out of the store, we are both puckering our mouths. The bread was absolutely disgusting.</p><p>“Well, they say some things are an acquired taste and I would have to say artichokes must be one of them,” he laughs.</p><p>“It tasted like mashed up Brussels sprouts,” I comment.</p><p>He shrugs. “Yeah, it kind of did.”</p> <p>We drive for another hour. He puts the windows up and turns the heat on, but leaves the top down. Again we talk with an easy familiarity I don’t remember having with any guy, ever. Time passes quickly and I’m surprised by the darkness. Looking at the inky blackness of the night sky, I stare out into it. It’s deep and pristine with hundreds of diamonds, not clear but rather with a hint of color—faint yellows and even a twinkling blue. I tip my head back farther and just stare in wonder.</p><p>“It’s beautiful up there, isn’t it,” he says in a husky whisper.</p><p>I reach my arm up to the sky and clasp my hand as if trying to catch one of the stars. “It is. It’s like you can connect with the universe.”</p><p>He reaches his arm up to do the same and our hands meet. Sparks shoot through me like an electrical shock and my stomach somersaults. I quickly my hand and busy myself with putting my hair back into a knot.</p><p>“We should turn around. It’s getting late,” I tell him over the wind as my car careens around the winding road.</p> <p>He turns to look at me. The escaped strands of my hair whip across my face. He tucks a chunk of it behind my ear. “Sure, if that’s what you want.”</p><p>Do I? I have no idea what I want, but it’s getting late and I have to work tomorrow. The water roars in the distance as he heads back to the restaurant. When he parks the car he closes the top and first fastens his side, then crosses over me to do the same. My breathing is hard and I shiver.</p><p>“You’re cold. Why didn’t you tell me?” His voice is full of concern.</p><p>“I really wasn’t cold and I was enjoying the ride.”</p><p>His lips are so close to mine as he fastens the lock in place and I really want to kiss him, and for a moment I think he wants the same, but he doesn’t move any closer. He sits back in his seat and smiles over at me. “There, now when someone asks you if you’ve taken the top down, you can say you have.”</p><p>His silhouette is strong against the backdrop of the night as he circles the car and opens my door. His fingers skim the small of my back again as he leads the way to the driver’s side. Before he opens the door for me, he surrounds me with his arms and my pulse races at the closeness of his smoldering sexy grin. His eyes gleam in the moonlight and his warm breath whispers across my neck. “Thank you for spending the day with me.”</p> <p>“I had the most amazing time.” Then suddenly, it hits me. “Jagger, we didn’t talk about my uncle. Oh my God, I’m so sorry. When is your audition?”</p><p>His hand moves up to my face and his thumb moves back and forth across my cheek. “You have nothing to be sorry about. It just gives me another reason to ask you out again.” He pulls back to look at me. “Aerie, will you go out with me again tomorrow night?”</p><p>“Oh, Jagger. I’m sorry, but I have to leave for Louisville in the morning for work and don’t get back until late next Sunday night.” I wish I didn’t have to go because I really want to go out with him again.</p><p>His smile fades, but his eyes beam. “Then next Monday night.”</p><p>“Okay, but I’m not sure I’ll be home early enough since that will be my first day back in the office.” I intentionally don’t say I have yoga as well. Normally that always works as an excuse to get out of a date—but I’m not trying to get out of this one.</p><p>“Then I’ll bring over dinner and we can make the evening a productive work one—eat and discuss your uncle. You do eat dinner, don’t you?”</p><p>I nod. “Yes.” I giggle.</p><p>Our bodies are aligned in such a way that I swear I can feel the beat of his heart and the throbbing of his pulse, or maybe it’s mine. His eyes seem to be swirling again, like he’s thinking about something. I’m staring at the curve of his mouth when my tongue flicks out to lick my lips and before I know it his hands move to tangle in my hair and his lips are on mine. I gasp at the contact as he pulls me close. His soft lips move aggressively once our mouths finally meet, and I don’t want them to leave. I open wider, inviting in his tongue. Just like our conversations, this kiss falls into an easy rhythm immediately. Our lips connect, our tongues intertwine, and by the time he pulls away we are both breathless. He tips my head back and slides his lips down my neck and I think I whimper. The heat of his hand against my neck flares within me and a strange urge runs through my body. It’s not a need for human contact; it’s a need for him, for his body to meld to mine. But before I can press my body to his, he pulls away. His hand moves to the door handle of my car and he opens it as I step aside. Ushering me in, I sit in my seat and just stare at him—lost in his swirling gray eyes.</p> <p>“Goodnight, Aerie. I’ll see you next week,” he says, closing my door.</p><p>“Goodnight,” I whisper back. I shake in silence in my car as I turn the ignition on and try to figure out what this is I’m feeling.</p><p>As I drive away, he stands in place, not moving, just watching me the same way he did last night.</p><p>Chapter 4</p><p>Hold On, We’re Going Home</p><p>On Monday, a light morning breeze ruffles the leaves of the palm trees surrounding the Sound Music building. I can see the serene Pacific framed in the distance through the large window in my office. The magazine headquarters is thankfully located at the Jamboree Business Center in Irvine, a quick hop on CA-133 to I-5N and I’m here. But I’ve been in a daze the last week and I’ve had a hard time focusing on work.</p><p>I avert my eyes from the gorgeous view and look over my desk. The surface is uncluttered. My eyes settle on the photo of Dahlia and me at her wedding. It’s hard to believe that just a few short years ago I was so worried about her. My heart broke as I watched her battle depression. It’s a feeling I know all too well. For a while I feared her falling back into the blackness when Ben resurfaced, but she didn’t. She was much stronger and thankfully proved my fears wrong. Nothing in the world makes me happier than knowing she survived her struggle and emerged with a full happy life in front of her.</p><p>Jagger has my mind wandering and I know I can’t let that happen. My mind never rests. It stays busy all the time. It’s who I am. Type A personality. I know it’s not proven that depression is hereditary, but I often think it might be. I prefer to take precautions and keep my body healthy and my mind busy.</p><p>But while I was away, Jagger and I spent at least three hours every night on the phone with each other. We discussed the band I was in Kentucky interviewing—Whisky Row. They were there to take publicity shots along Main Street and kick off their tour. The Wilde Ones were stopping there as well, so I had already arranged to stay the weekend to catch their concert. Zane and I moved past our tryst and although I didn’t see a blooming friendship there, I still wanted to support the band. I got the feeling Jagger would have flown out if I had asked him. I’m not sure why I didn’t. Now, I wished I had.</p><p>I laughed when he told me all about how corn whiskey had coursed through the state starting with judges sampling from barrels to whiskey warehouses anchoring ports along the Ohio Trail. River was right—Jagger knows the most random facts. I even told Xander some words of wisdom Jagger had shared with me—to order whiskey with a branch. Xander had looked at me with skepticism. But once he swirled, sniffed, and sipped his fine bourbon with the added drop of water, he agreed it did make it taste better.</p><p>Jagger and I became well acquainted over the phone. We flirted and danced around seductive statements. We talked about everything from our favorite movies, to pets we had as kids, to places we had visited around the world. We discussed my uncle—who he was and how important his career was to him.</p><p>“Two things to always keep in mind,” I told Jagger. “My uncle was tough, but charming and he called every man ‘brother’ and every woman ‘darling’.”</p><p>I also told him about the close relationship my uncle and I had shared. And swallowing back tears, I even managed to tell him about my uncle’s battle with cancer. He shared with me what spurred his move to LA—a breakup with a girlfriend.</p><p>Feeling restless, I look over my desk again—a silver pen, my computer, a Filofax, Post-it notes. Everything was neat and in its proper place, but for some reason I wanted to open the window and let the wind in. Let it blow across everything—shake it up a little. I laugh—the feeling is so unlike me.</p><p>My phone rings and takes me from my thoughts.</p><p>“Hello.”</p><p>“Hey, how about lunch today?” Dahlia asks.</p><p>“Oh, I’d love to but . . .”</p><p>“No buts. I’m almost to your office. I have to drop off some artwork changes for The Wilde Ones album re-release.”</p><p>“Okay, okay but only if we eat here. My other half starts today. Her plane is delayed, but I’m supposed to meet her when she arrives.”</p><p>“Your other half?” Dahlia questions.</p><p>“I’ll explain later.”</p><p>“Okay. Can’t wait to hear the latest. See you at Bowls in fifteen minutes.”</p><p>I place the receiver back on its cradle and push my chair back, surveying my toes. Even though I got back late last night, I canceled my workout for this morning. Instead, after a quick run on the treadmill, I painted my nails and took an extra long shower, making sure to shave my legs and under my arms twice. I’m restless and my mind constantly drifts to Jagger. I pat my hair and make sure the bun in the back of my neck is in place before I leave my office.</p><p>By the time I arrive at the restaurant, Dahlia’s already in line. She looks up and waves at me as a huge smile crosses her face. She’s wearing dark jeans with a sweater over a geometric-printed top that looks like it could be pieces of a guitar scattered across it and her tall black boots.</p><p>I approach her and her large hazel eyes pop.</p><p>Her eyes scan me with unabashed humor. “Aerie Daniels, you said you were working today.”</p><p>“I am.”</p><p>“It doesn’t look like you are.”</p><p>I roll my eyes.</p><p>“Next,” the girl calls from behind the counter.</p><p>We approach the register together. “Two salmon apple Fiji salads please,” Dahlia says.</p><p>“Oh, I think I’ll have the chicken Asian flatbread today,” I tell her.</p><p>She looks at me puzzled. “Sorry make that one salmon apple Fiji salad and one chicken Asian flatbread,” she tells the girl. We select our drinks and the clerk slides us a number.</p><p>Dahlia puts her hand on my forehead. “Are you feeling okay?”</p><p>I purse my lips together and scrunch my brows. “Yes, I feel fine. Why are you asking?”</p><p>She slings her arm around my shoulder. “Oh my friend, we have so much to talk about.”</p><p>She finds a table near a window and I point to the outdoor patio. “Let’s sit there today.”</p><p>“Okay now you’re worrying me. You’ve ordered the same salad for lunch since you started working at Sound Music and you never, I repeat never, want to eat outside. So spill it, now.”</p><p>“I don’t know what you’re talking about. There’s nothing to spill.”</p><p>We make our way outside and sit under the bright yellow sun. She sets the number stand on the table. “Don’t sit down yet,” she waves her finger at me as she takes a seat.</p><p>I look at her and try not to laugh. I already knew this was coming.</p><p>“Since when do you wear the clothes from the wrong side of your closet to work? If you’ve told me once, you’ve told me a million times,” and she air quotes, “‘My work clothes are on the left and my play clothes are on the right.’ And, Aerie, I know that purple suede dress is from the right side.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I laugh. “I told you I’m meeting the woman who is going to share the managerial title of the magazine with me today.”</p><p>A cute boy brings our food and I sit down with an exaggerated roll of my eyes and push her bottle of water her way.</p><p>“I’m not done.” She grins, tucking her hair behind her ears.</p><p>I unroll my silverware. “Please continue. This is very entertaining.”</p> <p>“Oh, I plan to. You’re wearing snakeskin sandals to work and not pumps, you have on your grandmother’s jewelry that you only ever wear on the weekends, and did I mention—you’re wearing snakeskin sandals to work?”</p><p>“They’re cute, aren’t they?” I push my foot to the side to admire my shoes again. She’s right. I have two sides to my closet and honestly I hardly ever wear anything from the play side to work.</p><p>“Might your clothing choices have anything to do with a certain guy who happens to be living at my house?”</p><p>“Oh, Dahlia, I wouldn’t pull out the violet card for River,” I say pointing to my dress. Then with a shrug I add, “It just might.”</p><p>Since Jagger is coming over tonight and I wasn’t sure if I’d have time to change before he arrives—I decided to select my clothes for tonight this morning.</p> <p>“I want to hear all about it,” she says stabbing her fork into the salmon lying on top of a bed of fresh greens.</p><p>We eat our food as I fill her in on what’s been going on with Jagger and me.</p><p>“I like him. He’s different from anyone I’ve ever gone out with.”</p><p>“Like how?” she asks fondly.</p><p>“Not like Zane,” I joke.</p><p>She almost spits her water out and her eyes dance with hysteria. “God, I hope so. I mean, Aerie, the fact that you could tell me you liked his ceiling fans told me he wasn’t the one for you.”</p> <p>“To his defense, they were really funky. Twin fans turned sideways and connected by an industrial sized rod.”</p><p>We clear our area and deposit our trash in the can near the door. She pulls me in for a hug. “Just have fun with him.”</p><p>“That’s what I’m doing.”</p><p>“Aerie, you forget how well I know you. You look for a guy’s flaws before he even asks you out and find them before you finish your date.”</p><p>“I’ll have you know, we’ve gone out on one date and I’m seeing him again tonight and still haven’t found a reason not to date him.”</p><p>She smiles. “Well, that’s progress. And I’m proud of you that the ex-girlfriend thing didn’t bother you.”</p><p>I look at her and there must be confusion and jealousy written all across my face.</p><p>“Jules, his ex . . .”</p> <p>“Oh, Dahlia, you know how much I despise talking about other women,” I say before she has a chance to say any more.</p><p>As we walk back to my office, Dahlia talks about a new band she and River are signing, but my mind is trying to recreate the conversation Jagger and I had about his ex. He never mentioned her name. Should I have asked him more questions about her? We arrive at my office building quickly and I realize it’s late. I have to get back to my office—and besides, jealousy is never a becoming quality.</p><p>“So what do you think? You’ll interview them?” Dahlia asks.</p><p>“Yes, sure. Of course. What was their name again?”</p><p>She laughs and puts her hands on her hips. “Aerie Daniels, you weren’t even listening to me. It’s Look Again.”</p><p>“Look Again. Yes. Okay, I’ll get in touch with them and see what we can work out.”</p><p>We part ways with a giant hug, and when I enter my office, I find a note on my desk. It reads, “I stopped by to introduce you to Ms. Hudson but you were out to lunch. We are out of the office the rest of the day. I arranged a meeting with your secretary for eight a.m. tomorrow morning. Please plan to be there. ~Damon.”</p><p>I stare at the note. The penmanship is exquisite, but the man rubs me the wrong way. Something about him irks me, but I can’t pinpoint it. I feel bad that I missed meeting Kimberly though and look forward to meeting her in the morning. I twirl around in my chair and stare at my sandals again before I settle at my desk to read through the copy for this month’s columns. I manage to get through half of them when my phone beeps. I pull it out and see a text from Jagger.</p><p>Just making sure we’re still on? Should I bring Indian or Mexican?</p><p>I’m actually going to be able to leave work early. So I was wondering if you’d like to pick me up and go out instead?</p><p>Time seems to stand still as I wait for his reply. Staring at the screen, I smile when my phone rings.</p><p>“Hello,” I answer.</p><p>“Hi, Alice.” His voice is low, but deep and I feel that now familiar flip in my stomach. “I had to call to make sure I was reading my screen correctly. I can pick you up? Like a real date? You know that means you have to ride in my car?”</p><p>“Yes, you can pick me up and yes, I know I’ll be riding in your car,” I say. Then I add, “Do I have to wear a crash helmet?”</p><p>He chuckles. “I’ll be on my best behavior. I’ll pick you up at seven.”</p><p>I like his laugh. “See you then,” I say, glancing at my watch thinking three hours seems like forever away.</p><p>When the doorbell rings, my heart practically storms out of my chest. I stop in front of the antique hall table to glance in the mirror one last time. I smile when I see the bottle of bourbon I brought back for him. I quickly flatten any flyaway pieces of hair, which I have fastened loosely behind my neck, and take a deep breath. I had left work shortly after my phone conversation with Jagger and headed home. Even though I had selected what I thought was the perfect outfit for this evening, I began to rethink my choice. I thought about Dahlia’s natural style and how I think she always looks sexy without even trying. And on a whim, I decided I wanted to look sexy as well, not professional, not uppity, but simply sexy.</p><p>So I called Dahlia as I pulled into the mall and asked for her help. I walked through the store describing the clothes and sent her a few photos. Within twenty minutes she had helped me select a pair of tight, ankle-length black skinny jeans and a slightly oversized shimmery gold blouse with a deep neckline. I know that if I bend down my red lace bra will be on full display. I added my own leather jacket and red studded high-heeled pumps to finish off the look.</p><p>Once I got home I decided to strip down and soak in a lavender scented bath. As I lay in the tub, soaking in it for the first time since I had moved in, I smelled the fragrance that reminded me of him and remembered how my body goes on alert whenever I see him or hear his voice. And when an ache erupted between my thighs, I squeezed my legs together and closed my eyes. I tried to push it away, but to be honest . . . it’s been there since I first saw the cupcake thief.</p><p>As I swing open the door, a nervousness overtakes me. He stands in front of me looking like sin on a stick. God, he’s beautiful. His hair is styled the same way as the first time I saw him. He’s wearing jeans, and the orange laces of his now-familiar boots put a huge grin on my face. His blue quilted vest is absent and replaced with the most handsome black pea coat.</p><p>His eyes swirl like impending storm clouds as he looks me over, head to toe. “Hi,” he says, his voice as smooth as molasses. His tone sends electricity through me in bolts.</p><p>“Hello,” I say back. My voice sounds high, almost squeaky.</p><p>He doesn’t move. He doesn’t say another word and neither do I. Hours of flirting and dancing around this seduction have left me unprepared to face him now. My pulse races out of control as he steps toward me. I take a deep breath and the moment his lavender and sage scent graces my senses, I begin to tremble. Our eyes share a silent conversation and then his mouth is on mine in a heartbeat. And this, our second kiss, is just as satisfying as the first. No, it’s so much more. His hands grip my hips, graze my ass, run down the sides of my thighs. My body tingles with every touch. I push myself into him and when I feel the hardness between his legs that must match the ache between mine, I let all my inhibitions go.</p><p>I have never wanted a man like I want him. I’ve never wondered what any guy looks like naked, what he feels like—but I want to do nothing more than explore the man in front of me. The harder he presses into me the more I can’t wait. He kicks the door closed and slams me up against the wall. I gasp, returning his hungry kiss. When he stops kissing me, he pulls back to look into my eyes. His hands are still on my ass and his gaze is bright, full of promise, but nervousness makes my words tumble out without thought.</p><p>“We should probably get going if we’re going to make our dinner reservation,” I say in a broken whisper.</p><p>“Is that . . . what you want?”</p><p>My pulse is beating rapidly in every hollow of my body, but I manage a coherent answer. “No, that’s not what I want.”</p><p>A single hand slides to my hip, then he wedges his knee between my legs, and his other hand lifts my chin and his lips attack mine. “Good.”</p><p>My hands flit under his coat to untuck his shirt. He stiffens at the touch. I move my palms under the thin fabric and revel in the smoothness of his skin. He gasps. I trace the lines of his body and feel nothing but sculpted muscle. My palms rest over his heart and I can feel it racing just as fast as mine. Next I move my fingers to the buttons of his coat and I undo them as quickly as I can. He groans, shrugging out of it, and when it lands on the floor, I think I should pick it up. When he tugs his scarf off and it too falls to the ground, I again think I should pick that up. But when his hands slip under my blouse, his touch sets me on fire and all I can think about is laying down on the pile of his clothes with him above me.</p><p>He pulls the elastic from my hair and it falls forward, grazing my shoulders. He walks me backward and then pauses to look around. His hands glide up my back and tangle in my hair. When my calves brush against the wool of the carpet runner on the staircase, I’m surprised by how close it is and I fall back. His strong hands catch me and ease me down. I didn’t even realize we were in motion. I feel drunk, dizzy, lost in the moment.</p><p>“Do you have any idea how much I want you right now!” he growls not meaning for it to be a question.</p><p>“I want you, too,” I respond shakily.</p><p>With one hand braced beside my head, his other finds my hip again. Electricity shoots through me. And this time when he slides his fingers down, he moves even closer to the inside of my thigh and heat flares under my skin. When he grazes my sex he touches that ache that won’t go away and the sensation is unlike anything I’ve ever felt. Then in a move of utter boldness I cup his c**k through his denim and stroke it.</p><p>He groans again and that noise floods me with a kind of desire I’ve never felt before. Raw is the only way I can describe it. His hand finds my bra and when his fingers slip inside it, I moan. And this isn’t like a When Harry Met Sally moan. This is the real thing—true and authentic. I feel his smile around our kisses and then a moment later, he pulls back and tugs my shirt over my head.</p><p>I rest both my elbows on the stairs and his eyes go immediately to my red lace bra. His control is unexpected as he admires me for the longest time. “Fuck, Aerie. You’re so beautiful.”</p><p>Our gazes lock as he finds my eyes and I get lost in his, lost in watching him, lost in wanting him. His hands cup my br**sts, which fit perfectly in his palms. He unsnaps the front closure of my bra and my br**sts spring free. He’s fast and before I can register the look in his eyes, his knee is pressing into my side and his long, lean body is draped over me. God, he’s so handsome. When his mouth closes around one of my ni**les, I moan even louder. He moves to the other side and I kick my shoes off. I press one of my knees into his crotch and move it up and down over the hardness of his erection.</p><p>His mouth nips at the soft skin of my shoulder and I breathe in his scent as he kisses his way up my neck, alternating between licking and sucking. I’ve never liked a man to lick me. It always reminded me of a dog or a cat, but I more than like it now. His hands are on my zipper before long and he’s tugging the tight denim down. I know this is the point of no return. But honestly I think I hit that point the moment he called me Alice. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He tugs my jeans off one leg at a time. I’m breathing hard, trying not to pant as his fingertips glide down my legs. I sit up before he even has my foot out of the second leg and skim his shirt off. I sit here on the steps of my house, the house that has never seen a male visitor, in my underwear and just stare at the guy before me. I feel connected to him in a way I’ve never experienced. And my desire for him soars unlike anything I have ever felt.</p><p>“What do you like?” he asks.</p><p>I stop breathing. “I don’t know.”</p><p>I can feel the corners of his mouth curve upwards as he moves to kiss my stomach.</p> <p>“Well let’s find out,” he smirks.</p><p>His lips course their way down my body and I start to quiver. When his wet mouth moves over the lace of my panties, I can feel his hot breath on me and I shake harder. His hands cover my ass and my pu**y and in a flash my panties are off. My legs spread apart and when his tongue circles my clit, it starts throbbing in a way that I’ve never felt before. His touch is hot. His breath is warm. His lips are wet. And I’m pulsating everywhere.</p><p>“Let go, Aerie,” he says lifting his mouth from between my legs for only a few short seconds.</p><p>And when his lips touch my soft flesh again, I cry out and let myself go. Let him rid me of the aching pain I’ve been feeling for days. My head falls and I arch my back as he licks, sucks, and kisses all of me. My toes curl as an exquisite sensation overcomes me, rocks me unlike anything I’ve ever felt before. And in this single moment of ecstasy, my body trembles as it comes alive and I cry out louder than I ever have with what can only be described as pure pleasure.</p><p>Our conversations have been full of laughter, interesting topics, and in-depth discussions, but right now there is nothing I want to talk about. All I want to do is feel. The nerves within my body are alive wherever he touches me. And when his lips rejoin mine and he runs his hand up my stomach, my muscles jump. My fingers unbutton his jeans and I mutter around his lips, “Do you want to go to my room?”</p> <p>His mouth opens to answer, but all that comes out is the word f**k, which sounds more like a groan. Before I can slide my fingers inside his pants, he is on his feet with his hand extended. “Lead the way.”</p><p>With his lips on my neck, I lead him to my room and he flicks the lights on. My first instinct is to turn them off, but I have an overwhelming urge to see him completely naked, and that outweighs any issues I have about the lights being on.</p><p>He stops and again looks around, but only long enough to untie his boots and kick them off one at a time. Any rules I have about not wearing shoes in the house are completely tossed out the window. I chew my thumbnail as I watch the orange laces come undone. Once they are he comes at me without hesitation. He walks us backward, and when my thighs graze the silk coverlet of my high mattress, I find his pants by touch and I unzip them. He shoves them down. He stands before me in his white boxer briefs and my arousal escalates to an alarming level. It’s unlike me to swear, my parents strictly forbade it, but, f**k, he is beautiful.</p><p>My fingers graze along the outside of the fabric—he is long and full. I have to see him. With a prowess I’ve never possessed in the bedroom, I push him onto the bed and ease off those Calvin Kleins. Now it’s my turn to admire him. The leanness of his body doesn’t reflect the fullness of his cock—it’s beautiful, just like him. And when he looks at me with those stormy gray eyes, my stomach flutters again. Sure, there’s no doubt this man is model material, but it’s not only his looks that have me in a daze—it’s everything I’ve gotten to know about him. But right then there’s only one thing I want and since I’m not a patient person, I don’t hesitate with my exploration. I don’t even care that we’re lying on the silk of my bedspread.</p><p>My hands move without thought, stroking up and back down. He’s hard and hot and my hands move to the rhythm we seem to have established as our own—not too fast, but not too slow. When my fingers close around him, loosely at first, then more tightly, he makes that sound that sets me on fire. I watch his eyes close and notice his breath quicken and words flow from my mouth unlike anything I have ever said to a man. “You’re so beautiful,” I tell him as I stand between his legs stroking him.</p><p>He laughs from deep in his throat and pulls me down to him. “That’s my line,” he breathes and rolls us over. I writhe under him, impatient, and wanting so much to feel him inside me. I’ve craved human contact, but never have I felt a guttural need for a man to f**k me like I do now.</p> <p>We roll to our sides so we’re lying face to face and study each other. I watch as his fingers find my cl*t and move slow and smooth. He watches as my palm follows the same beat, pumping his cock. When he inserts a finger inside me, he asks, “Do you like this?”</p><p>No one I’ve been with ever has asked me such a question, but then no one has ever succeeded in making me orgasm, either. Although I doubt what Dahlia has told me about having multiple orgasms applies to me, I’m willing to let him try. “Yes,” I answer in a low, shaky voice.</p><p>He inserts another finger and I let go of the grip I have on him.</p><p>“Yes!” I yell out, pushing my h*ps into his hand. His touch is immediately satisfying, electric, heady.</p><p>I roll on top of him and steady myself on his shoulders. I stare into his eyes and know what we are about to do is going to, without a doubt, rock my world. Time freezes in the few seconds we gaze at each other, but then his face goes blank. He cups my head, tangling his fingers in my hair, and pulls me down to him. I try to figure out what is going on. His breath whispers across my neck, tickling it, but then he reaches my ear and says, “I don’t have any condoms.”</p><p>I kiss him hard. But my laughter falls between our mouths, causing my kiss to be sloppy and maybe even out of synch.</p><p>He rolls on top me and pushes up on his elbows. He moves the hair out of my eyes. “Why is that funny?”</p><p>“Because you were so serious. I thought maybe you didn’t want to do this,” I grin playing with the wisps of hair around his ear. “I am nothing if not religious about getting my shot.” I nip his lip and reach my hand down between his legs.</p> <p>But when his fingers find their way back to my clit, my laughter tapers off into small moans. “Are you sure?”</p><p>“I’m sure.”</p><p>I bite down on my bottom lip and almost draw blood when one of his palms hits the mattress near my shoulder and the other takes his c**k in his hand to guide himself inside me. I close my eyes as he eases in. The gasp that leaves me echoes throughout the room. As I stretch to accommodate him he teases me, pulling back out and re-entering and again I automatically gasp in pleasure. As he pushes farther into me, I inhale a breath as more pangs of pleasure ripple through my body.</p><p>I’ve never had an active libido, but right now I can’t imagine not wanting to feel this over and over. He fills me completely with his next movement and the sensations from every nerve in my body that touches his body become amplified. His mouth finds mine, and as he pushes into me, I press my h*ps forward. His c**k throbs and my cl*t pulses—again there’s a rhythm we seem to find in everything that exists between the two of us. His movements become faster as my need increases. A feeling of pure sensation spreading through me, not just around my clit, has my body shaking.</p><p>“Fuck, you feel so good,” he growls around our kiss.</p><p>Our lips crash together at the same pace as our f**king—now hard and fast. He grabs my waist with one hand and my ass with the other and just like that he’s so deep inside me and I’m so incredibly turned on that when pings of pleasure engulf me, I scream out his name over and over. The ache that’s been building within me now peaks and pleasure radiates in waves that roll from one to the next. This feels so different from the orgasm he gave me with his mouth, but equally as satisfying—instead, the pulsing radiates from everywhere.</p><p>Jagger groans my name as he comes with me and together we ride out our pleasure. He rolls over next to me and pulls me to his chest. I’m not sure how much time passes before either of us is able to move—maybe fifteen minutes. But when he sits up he looks around again. “You have a really nice place,” he remarks.</p><p>“Thank you.” I sit up next to him.</p><p>He strokes his hand down my back. “It’s beautiful, like you.”</p><p>Now I’m not the kind of girl to get stars in her eyes, but I swear my blue eyes have to be twinkling. He pulls me off the bed. “Come on, I still have to feed you.”</p><p>I look at him and run a hand down the smooth skin of his chest. “What do you say we order in?”</p><p>His lips fight back a smile and his arms wrap around my waist. “As long as we can eat in your room,” he says seductively.</p><p>“Only if you we can pull the bedspread back,” I say, and we both laugh.</p><p>Chapter 5</p><p>Here’s To Us</p><p>Sunlight filters through the honeycomb shades in my room and I curse myself for choosing ambiance over practicality. I throw my hand over my eyes and then suddenly smile when I hear the faint noise of someone sleeping next to me.</p><p>We ordered pizza last night and ate in my bed—I never eat in my room. While we talked, I picked the pepperoni off my slice and fed it to him. As he licked the grease from my fingers one thing led to another. And two orgasms later, I felt like I was on top of the world. I actually still do. There was never a question about him sleeping over, and once we settled against each other for the night, our topic of discussion turned to sex. It started in a way that actually made me laugh. He apologized for being quick to climax. I hadn’t thought that at all. He told me he hadn’t had sex in a while—not since his breakup in the fall. I pushed aside the twinge of jealousy I felt toward the other woman.</p><p>And then I told him everything—including how Levi had taken my virginity in a lie. I even told him I had never experienced anything like I had with him. That put a huge smug smile on his face. And before we fell asleep, we both agreed that practice makes perfect.</p><p>Now I’m awake before him and I have to resist the urge to skim my fingers down his chest and over the ridges of his ribs. His dark hair is sticking up everywhere, and there is more stubble on his jaw than usual. He’s utterly beautiful and I want to pinch myself to make sure this is real. An eye cracks open and a smile splays across his full lips. “Good morning,” he says groggily.</p><p>“Good morning,” I say back with a grin.</p><p>In a blink he’s on top of me and when our eyes pin each other, he returns my grin—but his is sly, and full of promise. I like it—a lot. Rolling to his side, he skims my n*ked flesh with his fingertips and the ache between my legs is back. But this time I know it will be eased in the best way possible. My hands are on him as his soft lips find mine. I have to confess, although I’ve spent the night with men, I’ve never had sex in the morning. The thought of two mouths connecting without brushed teeth and two unshowered bodies covered in the smell of sex from the previous night had been a complete turnoff. But right now, I couldn’t be more turned on.</p><p>I run my palms down his back and back up. Then finally my hands roam between his thighs—he is already hard. My lips trail down the taut flesh of his chest and a green blinking light catches my attention. I want to ignore it, but suddenly I sit up in horror. My alarm clock is flashing. The power must have gone out. The early morning light should have alerted me, but I’m not thinking straight. Crap. I missed my training session—I owe my trainer a huge apology.</p><p>“Hey, where are you going?” he asks grabbing my wrist as I jump out of bed.</p><p>“I didn’t realize the time. I’m going to be late for work!”</p><p>He glances toward the clock and down to the tent his c**k is making in the sheet. “If I drive you, does that give you an extra ten minutes?”</p><p>Throwing caution to the wind, I nod and decide to start my day in a way I never have. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It’s a cloudy, colder than normal, winter day in California. But the blah day isn’t bothering me. Even though the sun stays hidden behind the clouds, I have a ray of sunshine sitting beside me. I know he can barely contain his excitement that I’m finally sitting in his car. Today I’m getting a chauffeured ride, not only to work, but also home.</p><p>He drives fast, really fast, and I really like it. I can see why he chose this car—it handles a lot like him. He parts his full lips to ask me a question as we discuss his career and his time in Paris, when thoughts of kissing them overtake me. He stops at a light and that’s just what I do. Honking behind us warns us the light has turned and I pull away, touching my fingers to my lips to still feel his.</p><p>A sneaky grin crosses his mouth.</p><p>“So do you have a runway walk?”</p> <p>He lowers the sunglasses he doesn’t need to be wearing and looks over to me. Raising an eyebrow he asks, “Do I look like I walk with runway swagger?”</p><p>I giggle. Okay the giggling needs to get checked.</p><p>“I’ll tell you the funniest advice I ever got about male runway walks,” he says. “I was doing a show and Vera Wang’s assistant showed up. She was a friendly older woman and she treated us like we were eighth-grade boys and girls. She gathered us all together and introduced us to modeling 101.” He smirks at the thought. “If that was my first show, I’d have gotten a hard-on that Vera Wang’s assistant was giving me pointers, but I’d been doing shows for two years by then.” His voice goes low and my guess is that he’s doing his best impersonation of the woman as he says, “ ‘Look at where the cameras are while you walk. Don’t cut the walls. Come out center. And please don’t forget to make a clean turn.’ ” He pauses. “We were all restless and when us guys practiced walking, it was with a normal, nothing walk. But the girls, they brought it. Their elbows were up, they leaned back, and clomped down the runway. She brought us back together after and said,” his voice goes low again, “ ‘Now men, stop walking like you were caught thinking about the vanilla sex you had last night.’ ”</p><p>Jagger’s depiction of the woman and the story itself has me in stitches as he pulls up to my office building. I think to myself there’s nothing vanilla about him as I lean over and grab his face to kiss him goodbye. I don’t even care that my lipstick is smearing. I want him to think about me today the way I know I’ll be thinking about him.</p><p>“Stay there,” he says taking my umbrella from my hand.</p> <p>Getting out of the car, he pops my umbrella, and proceeds to walk me to the door.</p><p>“You can’t just leave your car there.”</p><p>“I think it will be fine,” he winks. “And besides, I’m right here, what’s going to happen?”</p><p>The look on his face melts me and what else can I do but get up on my toes and wrap my arms around him. I want to give him another unforgettable kiss. But when his hands clutch my h*ps and his body aligns with mine, I get lost in his hypnotic stare. But he doesn’t falter like me. His lips touch mine and a thrill runs down my spine. He uses his tongue to part my lips and I open my mouth with greed. Our tongues dance and when he pulls back—we are both breathless.</p><p>“Wow,” I say lost in the moment, left completely dazed.</p><p>He give me a breathtaking smile and turns back toward the car and I remember I wanted to be the one to leave him with a kiss to remember all day. With my heart pounding, I step inside and pause a moment near the glass to watch him as he heads back to the car. I’m looking for any sign of runway swagger. The thought of him getting paid in “trade” for his runway gigs intrigues me. A free sweater, sneakers, jeans, credit at a trendy store—payments that have all lent to his amazing wardrobe. I told him how much I would love that. He laughed and said the clothes were cool, but it was hard to pay the rent with a wool coat. Then I told him that I really liked that coat and he just grinned at me.</p> <p>I hit the elevator button just as he nears his illegally parked car, and notice a woman using her purse as a shield over her head is approaching him. He stiffens, as they seem to have an animated conversation. I wonder if she’s yelling at him for parking there. A few moments later, she scurries through the rain and in the door. The elevator arrives and just as I hit my floor, the same tall, slender woman who looks about my age yells, “Hold the elevator, please.”</p><p>I catch a glimpse of her through the closing door. Her hair is an understated red—a cross between a copper and a strawberry blonde. It’s curled in loose waves, she has high cheekbones, and piercing blue eyes. I quickly press the open button. As the doors begin to reopen, I see my reflection in them. I’m off my game today, but I don’t care. My makeup is in my bag and so are my heels, I didn’t want the calfskin to get wet from the rain. I straighten my gray pencil skirt as the woman enters.</p><p>I look at her, intrigued. She has one of those haunting faces that look like it should be gracing magazine covers. She’s wearing black lace-up pants, a completely sheer blouse, and a killer raspberry leather jacket with raindrops dripping from it. The raspberry color of her coat accentuates the red highlights in her blonde hair. I feel like I’ve seen her before, but can’t place where. A pang of jealousy hits as I glance down at my corporate attire. She exits the elevator on the ninth floor and I stay put riding to the tenth.</p><p>As I exit the elevator, Shelly rushes up behind me. “Ms. Daniels, Mr. Wolf is waiting for you in the conference room.”</p><p>I look at my watch—8:05. Crap, I completely forgot about the summons he left me yesterday afternoon. I hand off my things to Shelly. “Will you put these in my office?”</p><p>She nods and as she walks away I call, “Shelly, wait. My shoes are in there.” I put my hand on her shoulder and remove my flats, replacing them with my wedges. Shelly looks at me with admiration. “Ms. Daniels, you have the coolest wardrobe.”</p><p>I beam at her. “Thank you.” A compliment is just what I needed.</p><p>Shelly’s an intern working for us full-time while Megan, my assistant, is out on maternity leave. She’s doing a fabulous job and I hope to hire her full-time when she graduates this summer.</p> <p>The conference room is on the eleventh floor and by the time I enter it, it’s almost 8:15. Damon is sitting in there looking through some ads I know I have already approved for this month. He glances up, and in a deep voice he says, “Ms. Daniels, you’re late.”</p><p>I see that Kimberly Hudson hasn’t arrived yet but rather than be on the defensive, I apologize. He sips his coffee and I cross the room toward the credenza and place a teabag in a porcelain cup. As I pour the hot water I say, “Damon, please call me Aerie. Ms. Daniels isn’t necessary.”</p><p>“Of course, Aerie.”</p><p>The door opens and a woman carefully carrying a tray of coffees enters. “Oh, Damon, I’m so sorry I’m late,” she says placing the tray on the table. “My sister unexpectedly stopped by. She’s meeting with a director to discuss a role she’s dying to play and wanted to make sure she looked the part. She moved to LA with me and we’re both loving it.” She hands him a coffee cup. “With sugar,” she says smiling. “And then I decided to take the stairs up the two flights. Not a smart move with a tray of hot liquids in hand.”</p><p>He waves his hand in the air. “Relax, K, it’s fine. Ms. Daniels only just arrived herself. And if I can help your sister in any way, you let me know.”</p><p>Now I have to wonder if he will call me A or if he doesn’t remember her name. I want so much to assist him but I’ll let “K” have that privilege. Her outfit—black lace dress, leather biker jacket, and heavy dark eye makeup—seems very cosmopolitan.</p><p>“Aerie, I assume,” she says extending her hand. “It’s such a pleasure to finally meet you.”</p><p>The word finally bites, but I choose not to assume she’s insulting me. She is stunning—her hair is shoulder length, pin straight, and dirty blonde.</p><p>“Kimberly.” I stress the word. “The pleasure is all mine. I’m so happy to have you aboard and look forward to growing the magazine circulation with you.”</p><p>She passes a coffee my way. “Oh, call me Kay. Kimberly is so formal and I think a pen name is in order. Although I’d love to ride my previous successes from the New York Times, I explained to Damon I think I’ll be more successful without the bar set so high.” She looks at him. “And he agreed.”</p><p>He nods.</p><p>I smile, and put a hand out to the coffee. “I’m fine with tea, but thank you anyway.”</p><p>She shrugs. “I’ll get to know all of your habits. Next time I’ll bring you tea.”</p><p>“Well, ladies, I don’t want to take too much of your time this morning, but I thought it would be worth discussing a training schedule. As you know, Aerie, Sound Entertainment won’t launch until the summer, but I’d like you to get Kay up to speed in the meantime. In fact I’d like you,” he says to Kay, “to interview my fiancé, Ivy Taylor. She’s preparing a new album that won’t release until next year, but I’d like to see your brilliance applied toward growing her career.”</p><p>I don’t let this ruffle my feathers. I’m sure there will be plenty of opportunities for me to meet with Ivy once her album releases. The meeting seems to go on for hours, and my mind wanders back to Jagger at every opportunity. I get lost in the memory of our night together.</p><p>Damon’s deep voice rattles me from my thoughts. “Ms. Daniels, you’re in agreement then?”</p><p>When I don’t answer at first, Kay jumps in. “Aerie and I will be the perfect workmates.”</p><p>I glance her way, silently thanking her for cluing me in. I guess she’ll be sharing my office. “Yes, of course, Damon. Anything she needs,” I answer, turning to meet his glare.</p><p>“Great then. Kay the construction will begin on the ninth floor immediately and by summer’s start we should have a state of the art newsroom and studio.” I swear I could practically see him rubbing his hands together as he speaks.</p><p>Damon rises and I say my goodbyes, scurrying to my office and wondering when Kay will be moving in. Once I sit in my chair, I grab for my purse and remove my BlackBerry. No messages. I go about the rest of my day, trying to make up for lost time and when I look at my BlackBerry again it’s four o’clock. Still no messages. I had told him I’d leave work at six today so I guess there was need to call me. I just thought . . . I’m not sure what I thought.</p><p>Time passes slowly after that. I twirl in my chair and pop my legs up on my desk. I’ve always prided myself on never being one of those needy girls, well not never—once and only once. But I learned my lesson quickly, and not since Levi have I sat around and waited for a guy to call me. So why is it I’m thinking it would have been nice if Jagger called me today? In fact, why isn’t he calling me? Oh God, what if he doesn’t pick me up? Was he really just using me?</p><p>My phone rings and I jump.</p><p>Reaching to pick up the receiver on my desk, I hug it to my ear. “Hello?”</p><p>“Aerieee, I’ve been waiting for you to call me all day.” It’s Dahlia.</p><p>“Dahlia girl, how am I supposed to know you’ve been waiting for a call? I did just see you yesterday.”</p><p>“Fess up now. Don’t make me squeeze it out of you.”</p><p>I laugh. “Jagger spent the night.”</p><p>“I know that. I figured that out when he didn’t come home. So . . .”</p><p>“So we had sex,” I say it as fast as I can.</p><p>“And?”</p><p>I bite my lip just thinking about it and the ache between my legs is back. “And, I think I had my first orgasm.”</p><p>A scream explodes through the line. “You think?”</p><p>“No, I did. I know I did. More than one by the way.” I can’t believe I’m having this conversation at work. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So you still like him then?”</p><p>“Yes, Dahlia, I still like him. Actually, I really like him.”</p><p>For the longest time silence fills the line.</p><p>“Dahlia?”</p> <p>“Sorry, Aerie. I am trying not to cry right now.”</p><p>“Dahlia! It’s not like I’ll be getting married tomorrow. I like him. I enjoy his company.”</p><p>There’s a knock on the door and before I say, “Come in,” it opens. Kay stands there. I kick my feet down and straighten myself.</p><p>“Hey, Dahlia, I’ll need to call you back later, but—really quick—is he there?”</p><p>“He stopped by long enough this morning to shower and then took off. I haven’t seen him since then. Is everything okay?”</p> <p>“Yes, Dahlia girl. Just curious. I’ll call you later.”</p><p>I hang up the receiver.</p><p>“Aerie, I’m so sorry to interrupt. I just wanted to stop by and make sure you were really okay about sharing your office with me until mine is ready.”</p><p>I roll my chair toward her. “It’s fine. When did you want to move your stuff up?”</p><p>“Friday should work. Damon said construction wouldn’t begin before Monday.”</p><p>“Tomorrow I’ll ask Shelly to arrange the move then.”</p> <p>“Thanks so much. I look forward to learning the ropes from you.”</p><p>I fold my hands on my desk and give her a friendly smile.</p><p>As soon as the door clicks shut, I pull my BlackBerry from the pocket in my purse—6:05. Finally! Time to leave. Anticipation at seeing him again burns through me, but fear that he won’t be there worries me. As I walk out of the office, I convince myself that he’s not using me. That playing the role of my uncle in the movie isn’t why he’s spending time with me. But old ghosts haunt me and I remember what happened with Levi—how one minute he had me under him n*ked and the next he was kissing another girl.</p><p>The automatic doors open and through the light drizzle I can see his car isn’t parked where he dropped me off this morning and my heart sinks. But then I glance sideways. Under the awning, leaning against the wall, I spot him—the wayfarers that cover his gray eyes, the faded jeans that fit snuggly on his narrow hips, the scuffed boots with the orange laces, the messy but somehow perfect dark hair, and the wool coat—the one I told him I liked. He appears deep in thought, but then suddenly glances up.</p><p>He walks toward me and tucks his glasses into the opening of his coat before reaching me. I stand there, unable to move. I’m so elated that he’s here. His hands curl behind my neck as he pulls the clip from my hair out with one hand and sticks it in his coat pocket, tangling his fingers though my hair with the other. Before I can study his expression, his lips are on mine. Soft, full, kissing me with burning passion. He pulls back, leaving me breathless and completely aroused.</p><p>“How was your day, Alice?” he asks with a grin.</p><p>I press against his chest, not caring that this is a very public display of affection. Then I lean back to look into his eyes. “Better now that work is over.”</p><p>His hands run down my arms and lace in my fingers, and my stomach dances with excitement.</p> <p>“And how was yours?” I ask.</p><p>As he speaks I notice sadness in his eyes. “Mine was—”</p><p>“Have a great night, Ms. Daniels,” Shelly calls from behind me.</p><p>I turn toward her voice. “You, too. See you tomorrow.” I wave.</p><p>Before I can turn back to him, his lips are near my ear. “I missed you.”</p><p>I can almost feel his beating heart against my back. I flip around and reach up on my toes to find his mouth. “I thought about you today.”</p><p>He dips his head and finds my lips, brushing them lightly. “What exactly did you think about?”</p><p>I normally wouldn’t want to say what I’m thinking, but it’s the truth, so I say, “How you could make me come like no one ever has. How you felt inside me.”</p><p>His lips curve into that smug grin and his stormy eyes dance with pleasure. “Good, because that’s all I thought about, too. So what do you say we get out of this rain and I feed you, so we can go practice?”</p><p>“Where’d you park?”</p><p>As he pulls me closer he lets the umbrella drop to the ground. He wraps one around my waist. Then with his sexy smoldering grin, he points toward the parking lot. “Where I’m supposed to park.”</p><p>I don’t care that I’m getting wet, I don’t care that my shoes might be ruined, I stop right there and step in front of him. “What do you say we order in again?”</p><p>Chapter 6</p><p>Unconditionally</p><p>The past six weeks have passed by in a whirlwind. Jagger and I have been spending more than just a lot of time together. We have seamlessly combined our lives. He’s joined my evening yoga classes and sometimes he comes to my morning training sessions. He’s not a morning person though—it’s cute how much he dislikes getting up. He stays with me almost every night, and I have never had sex as much or as often as I do with him—I love every minute of it.</p><p>The movie audition has been delayed because of script issues. But regardless, Jagger has kept busy. He picked up a few small modeling jobs and last week he went for a second round of shots to do print for a big fashion house. He’s pretty excited about that. He’s also gone on numerous casting calls. He was offered a small part in a movie that he turned down because he was filming overseas and it would interfere with his audition for No Led Zeppelin. And although I’d like to say I’ve been the one helping him, he’s been helping me as well. Having someone to talk to while I go through my uncle’s belongings has been therapeutic. I’ve found photos, cards, and his complete vinyl. We also found a bunch of old sales reports, some from when Uncle Ian was Avery Wilde’s silent partner and some from Nick Wilde’s days under the Little Red label. I know Avery was very involved in his son’s career so I assume the items just got mixed up in their offices.</p><p>Once I told him about Damon and my other half, I stopped talking about work. It wasn’t as interesting as other topics. And sharing an office with Kay has been much more pleasant than I thought it would be. She’s actually really nice and doesn’t seem to have any hidden agendas. She keeps to herself and sometimes even seems nervous. I don’t ask—it’s not my business. But I have shown her all the facets of my job and she seems very appreciative. In fact, with her at the magazine, I’ve been able to come in a little bit later and leave slightly earlier—a win/win for both of us. And a bonus—Damon was really happy with the article we co-wrote about Ivy Taylor and I think he feels comfortable that the magazine is running smoothly—so he hasn’t been around as much.</p><p>This year’s Valentine’s Day was the first in a long time I actually had someone to share it with. Jagger bought me two movies. Alice in Wonderland and Through the Looking Glass, and he made me dinner—chicken cacciatore. It was delicious. And over my candlelit table, he also formally asked me if I would be his girlfriend. My pulse raced at the idea of us being exclusive and we never made it to watching the movies that night. But rather, before we had even cleaned up the table, I did something right in my dining room I had done a handful of times in the bedroom with other men, but hated each and every attempt—I took his c**k in my mouth. And there was nothing I disliked about it, especially after witnessing his reaction.</p><p>Despite the rumor that nobody walks in Los Angeles in the winter, today Jagger and I spent this first Saturday of March roaming the city. And now I’m coming home with a beautiful red-and-gray-checked scarf around my neck and a monogram bracelet with a snowflake hanging from it. I selected the scarf because it reminded me of him, and Jagger surprised me with the bracelet—telling me it reminded him of the beginning of the movie Through the Looking Glass and the first time we met. When he clasped the bracelet around my wrist, I knew—I knew I loved him.</p><p>When we finally pull in the driveway at River and Dahlia’s house, we are both exhausted. They’ve gone for the night to a Lakers game so we decided to hang out here.</p><p>He opens my door and just as I clear it, he slams me up against his car. “You look incredibly sexy today,” he murmurs.</p><p>My body tingles in every place possible, as the warmth of his breath passes over my mouth. I look down at what I’m wearing. Skinny denim jeans like the ones Dahlia helped me pick out a while ago, a tight gray sweater with one of my grandmother’s glass pendants hanging from my neck, and low, black ankle boots. “Really? In this outfit?”</p><p>He cages me in and I can feel his hard c**k against my stomach. “It’s not the clothes, it’s the way you move in them.”</p><p>I push his hair from his eyes. “Thank you,” I say, not sure how else to answer.</p><p>I have to look away to not get lost in his eyes. Of the dozen or so relationships I’ve had so far in my life, no one has ever made me feel as wanted as he does. The sexual chemistry between us frightens me. I’ve never had this kind of connection with anyone. And sometimes, like now, I have to try to get some control.</p><p>With my breathing embarrassingly fast, I duck under his arm and head toward the trunk. “Come on. We have a car to unload and dinner to make.”</p><p>He gives me a sly smile. “Is that what you want?”</p><p>Trying really hard not to run back to him and jump him, I say, “Yes.”</p><p>He shrugs and moves my way. “Okay, then use me for my cooking skills, but I expect proper compensation later.”</p><p>I swing the totes into his arms and lean in to nip his lip. “You can count on it.”</p><p>With bags of groceries in his arms and a huge grin on his face, he waits for me to hit the keypad next to the garage door. As the door rolls open, I study the lean lines of his body and appreciate the way his muscles move holding the bags. Tonight we’re making Fettuccini Alfredo and I know I’ll have to work out extra hard this week after this meal. I don’t get how Jagger stays so thin with what he eats, but he seems to have a good routine down that I have slowly adopted—eat healthy during the week and work out heavily. Then on the weekends eat what you want. We head toward the stairs in the corner of the garage and before we reach them he motions with his chin toward the door that opens into the lower level.</p><p>“Why don’t you grab us both a sweatshirt and we’ll watch the sunset before we cook?”</p><p>“Sure, I can do that,” I nod and reach above the door to remove the key from the ledge. River and Dahlia keep one above this door and another one on top of the door that leads to the kitchen. I’ve always told them it’s not very safe, but they insist it’s fine.</p><p>“I’m not sure where they are, but I think maybe in the closet. And don’t roll your eyes at the mess.”</p><p>“I wouldn’t think of it,” I laugh.</p><p>“And don’t straighten anything out.”</p><p>This time I don’t laugh. “How did you know I was thinking that?”</p><p>He steps up to the landing and I have to crane my neck to see him. “I can see the gears turning from here,” he says, shooting me a wink that makes my pulse start to race. The sunlight is peaking through a small round window behind him, highlighting the smile he shoots me, and the ache that only subsides from time to time is back. I wonder how much time we have before the Lakers game is over.</p><p>Jagger’s things are placed haphazardly around the room, but somehow appear neat. The closet is just about empty. A few dress shirts and slacks hang from it, but nothing else. I spot a bottle of cologne on the dresser—its silver cap and clear liquid draw my attention immediately. I pick it up—Creed Royal Scottish Lavender. I knew his scent included lavender. I squirt a little on my wrist and sniff it. God, it smells of him.</p><p>Setting it down, I go about the task of finding sweatshirts. I spot one on the chair in the corner, but I’m not sure if it’s clean or dirty. If I have to, I’ll spray it with cologne and it will be fine. I open a drawer, starting at the bottom because that’s where I keep my own sweatshirts and I find a gray one. Opening the drawer next to it, when I spot something red and thick on the bottom, I remove the t-shirts to get at it. I know he likes it when I wear red, so this will be perfect. But when I see a small square black velvet box lying on top of it, my heart stops. I pick it up with trembling fingers and open it. I quickly close it and just stare. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Either you’re straightening up or didn’t want to climb the stairs alone,” his smooth voice says from behind me.</p><p>The room is closing in on me—his scent is everywhere, his voice is at a distance, his body is so near, but my mind is in freefall. I feel like Alice tumbling through the glass.</p><p>“What is this?” I say twisting around. Wondering if it’s for me, but knowing it can’t possibly be. We haven’t even said those three little words to each other yet.</p><p>He doesn’t move, doesn’t look at the box, but his eyes convey a sadness that tell its own story. Something cold rushes through my veins as silence fills the room and I start to lose my mind. “Jagger, what is this?”</p> <p>When he still doesn’t answer, tears blur my eyes. I set the elegant box back down where I found it and without closing the drawer, I stand up and head toward the stairs. Passing him, I leave the room in a daze.</p><p>He catches up with me, fast as lightning. He grabs my elbow and turns me around before my foot even hits the hardwood beneath it. “Aerie, let me explain,” he swallows.</p><p>I blink at the wistfulness in his eyes and, with my throat having closed up, all I can do is nod. With his hand on my back, my heart beats at an uncontrollable speed, but this time it’s not out of want, it’s out of fear. Fear that the ring is a threat to our relationship. Once we cross the threshold to his room he closes the door. My eyes flicker to the drawer, but it’s no longer open.</p><p>He lowers his head to mine. “That box has nothing to do with us.”</p><p>“Then tell me why you have an engagement ring in your bottom drawer.”</p> <p>Pain flashes across his face and he sits down with his hands cradled around his head. When I sit next to him, keeping some distance between us, his eyes snap to mine. “I told you I had a girlfriend when I lived in New York City,” he says.</p><p>“Yes, you did. But having a girlfriend is completely different from having a fiancé.”</p><p>“She wasn’t my fiancé.”</p><p>I knew he had broken up with a girl just before he met River, but he didn’t tell me they were that serious. I feel the red creeping up my neck and spreading across my face as anger courses through me. “But you wanted her to be?”</p><p>“Marriage seemed like the next logical step, so I bought the ring. But I never asked her to marry me.”</p><p>I close my eyes, trying to suppress that flare of jealousy I know will be ablaze by the time this conversation ends. “Why did the two of you break up if you had plans to ask her to be your wife?”</p> <p>He clears his throat and tries to take my hand, but I pull it away. “She cheated on me and I broke up with her. I left for Paris shortly after that.”</p><p>“So you moved here because of her?”</p><p>“Only partly. I moved here for a lot of reasons—life was out of control for me, I felt like I was rushing everywhere, but, yes, she was part of the reason.”</p><p>I say nothing as I feel the red spreading up my neck.</p><p>“Alice, please don’t be mad over nothing. Because it is nothing.”</p><p>Those same tears from earlier prickle my eyes, so I quickly stand up and swipe them away before they can fall.</p><p>He bolts up and follows me. Standing near, but not nearly close enough, I can feel his eyes penetrating mine. He tilts my chin to meet his gaze. “Hey, did you hear me? That—” he kicks the drawer “—has nothing to do with us. Nothing.”</p><p>I cup his cheeks and look into his eyes. “I know it doesn’t. But why are you holding on to it? Why is it tucked away in your drawer?” And here it is—the flaw I knew he had to have—the imperfection I’ve been waiting to surface.</p> <p>He twirls his finger around a strand of my hair and something like a magnetic force pulls me to him. “Aerie, I’m not holding onto it for any reason and it’s nothing like you’re thinking. I left New York City in a rush. Then I was staying with my mother before I headed out here. It had become baggage that I had no idea what to do with until now. That’s all it is.”</p><p>I’m pretty sure a look of skepticism crosses my face, but I try to crush it. “It must mean something to you—she must mean something to you.”</p><p>He steps back and opens the closed drawer, takes the ring out of the box and dashes out of the room. I chase him, trying to keep up. He swings open the door that leads to the lower pool deck and strides across to the railing that overlooks the canyon. The sky is cloudy, but the sun peaks out and casts shadows over his face, masking his expression. He winds his arm like a pitcher and throws the diamond into the dark night yelling, “This is how much she means to me!”</p><p>“Stop, are you crazy?” I yell, but by the time I reach him, it’s too late.</p><p>“Yes, crazy for you,” he says, pulling me toward him.</p><p>And for the second time today I know that I love him. “You didn’t have to do that,” I say in a shaky voice.</p><p>“Yes, I did.” He kisses my forehead. “Now can we go make dinner?” He extends his hand and I take it. We head upstairs to the kitchen, opting to eat inside and I make a conscious effort to put the ring out of my mind. But the nagging question of why he was still holding onto it still presses me.</p><p>Once we clean up, he rubs his hands together. “Are you ready to watch one of the greatest movies ever made?”</p><p>I laugh. “Believe it or not I much prefer romantic comedies to action packed chasers.”</p><p>He raises a brow. “Name five romantic comedies that you can’t live without.”</p><p>“That’s easy—Along Came Polly, How to Lose a Guy in 10 Days, Because I Said So, Knocked Up, and Jerry Maguire.”</p><p>“Well, I’ve seen one: Jerry Maguire.”</p><p>“Oh, I can’t wait for you to experience the others.”</p><p>He grins at me and pulls me to his chest as he aims the remote toward the TV and hits play. The studio logo fills the screen as we begin our escape into the world of fast cars. Just as the Eclipse tops out and it spins out of control, Jagger bolts up and pauses the movie. I sit up quickly too.</p><p>“Did you see that? You know a car never spins out at top speed,” he says.</p><p>I blink my eyes and smile. “No, I had no idea.”</p><p>“It either reaches a drag limit or hits the engine’s fuel cut off, but never spins out.”</p><p>“Why do I think you have an arsenal of mistakes that have been made in films that you could share?”</p><p>The front door flies open and Dahlia goes running across the room toward her bedroom.</p><p>“Hey, man, everything okay?” Jagger asks River, whose following close behind.</p><p>“I think Dahlia ate too many hot dogs at the game,” he calls from the hall.</p><p>Jagger looks at me.</p><p>I snort and shrug. “She has a tendency to overindulge.”</p><p>He hovers over me and softly kisses my lips.</p><p>“Do you like going to the games?”</p><p>“Me? No. I don’t really like spor—”</p><p>He puts his finger to my lips, “Don’t say that. Let me take you to a game and then let’s see what you think. I bet you’ll like it before it’s over.”</p><p>My lips curve into a smile. “Okay, sure, why not. But good luck getting me to change my mind.”</p><p>He pulls me to my feet. “Come on, let’s go to bed.”</p><p>Chapter 7</p><p>Burn</p><p>When I think of Silicon Valley, Apple and Microsoft come to mind, or Google and Facebook. Not cattle, olive trees, and grapevines, which is what I’m staring at now.</p><p>The day started with a plan to apartment hunt for Jagger. He has decided he’s staying in California, even if he doesn’t get the movie part, so finding his own place is the next logical step—or that’s what I think. For him, this is a means toward no longer invading River and Dahlia’s space. But I know Dahlia doesn’t care—she’s told me she likes having him there. I’d like to think he’s staying partly because of me, but I can’t help but think that it’s because he’s running away from his ex. There seems to be a distance between us since I found the ring. I’m not exactly sure why, but I can’t shake the thought that I’m a rebound.</p><p>Last night was the first time since we started dating that we slept together, but didn’t have sex. This morning when we woke up, we lay in bed and talked for a long while. He talked about his parents and I realized that even though I thought the unconventional way in which he was raised didn’t bother him, I might have been wrong. A resentment toward his mother bled through his words, and he quickly changed the subject to my grandmother. Jagger still hadn’t seen her movies and for some reason he wanted to watch them tonight. As we continued to talk, I let yesterday’s events fade away from my thoughts.</p><p>Eventually, we rolled out of bed to start our day. Once I was ready, I went upstairs to check on Dahlia, but all was quiet. I left her a note to call me later and told her I hoped she was feeling better. Jagger and I stopped for breakfast, and while Jagger was circling a few apartments to check out in the paper, an ad for a winery caught my eye.</p><p>Noticing, he asked, “Have you ever been?”</p><p>I shook my head.</p><p>And just like that, the apartment hunt was postponed.</p><p>“Did you know the term Silicon Valley was coined by a business man in the early nineteen seventies but it wasn’t until the eighties that the term became widely used?”</p><p>I purse my lips and shake my head. I love how he is full of random information. “Please tell me how you know all this stuff—were you a child prodigy?”</p><p>His mouth twists. “Nah, when I was younger I had a slight stutter and my therapist recommended reading out loud. So my dad bought this giant set of encyclopedias, and every night I’d randomly flip one open and read out loud to him the two pages it fell open to. I just remember what I read.”</p><p>“What else do you know about this part of California?”</p><p>He shrugs. “I know the computer companies wiped out the area’s natural vegetation when they invaded it, but have slowly replaced it with new orchards. I know the word silicon comes from the fact that silicon is used in the parts needed to manufacture computers. I know valley refers to the Santa Clara Valley. And that’s about all. But I think I picked all that information up from watching the movie about Bill Gates.” He smirks.</p><p>Buzzards circle low overhead as we drive through this majestic part of California. Grapevines meander in the breeze, arcs of water shoot from sprinklers onto fields of crops, and old towns with beautiful churches rush by.</p><p>“Are you feeling hungry? Should we stop?” He points to a sign that reads, “Olives and Grapes This Way.”</p><p>“Only if you don’t make me try any artichoke bread,” I joke, knocking his knee.</p><p>His eyes dart to my hand and he grabs it fast as sin. He brings it to his lips and kisses the back of it. “Fortunately for you, I found it to be just as disgusting as you did, so I can promise you we won’t be tasting that again. Now, olive pâté, that’s fair game.”</p><p>I wrinkle my nose and he settles my hand on his thigh—I like it there.</p><p>“I saw that,” he says with a grin, as he turns the car to the right and slows down.</p><p>“I may stick with the wine half of the sign,” I say in a raspy voice.</p><p>The deserted winding canyon road seems to go on for miles before he suddenly pulls the car off to the side.</p><p>“Everything okay?” I ask, somewhat alarmed.</p><p>With the car in park, he leans over the console and presses his hard body against mine. His soft lips kiss along the tender skin of my neck and once they find my lips, our tongues entwine in the most erotic dance. Breathless, he sits back in his seat. “Everything is fine. I just realized I hadn’t kissed you in a while.”</p><p>I touch my fingers to my burning lips as the ache that erupted in my body moments ago centralizes in one place. I look around at the vast nothingness that surrounds us and wonder if it’s really possible to have sex in a car. But he’s back on the road before I can suggest the possibility. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The town is quaint—bed and breakfasts, boutiques, and restaurants line the street. He parallel parks between an old dented pickup truck and a shiny black Mercedes. The flower-and-cactus-filled Spanish-style patio of the restaurant is full, but we decide to wait for an outdoor table. Once we’re seated, we order margaritas—one classic and one apricot. After a quick glance at the menu, he looks up.</p><p>“The Puebla-style chicken is cooked over a red oak fire. What do you say we both try that?”</p><p>My eyes zero in on it and the words sausage and bananas make my stomach turn. “Did you read what it’s made with?”</p><p>“Yes, the splash of sherry sold me.”</p> <p>I roll my eyes. “You are attracted to the foods with alcohol with them.”</p><p>“No, I’m attracted to what’s good,” he growls in my ear, setting my already heated body aflame.</p><p>Since grilled salmon isn’t on the menu, I concede and decide to try it.</p><p>Once we’ve eaten, we spend the afternoon browsing the shops. One shop sells intensely flavored, Tuscan-style oils. Jagger lifts a small piece of bread dipped in oil to my mouth. “Just try this. I promise it’s delicious.”</p><p>I take a very small bite and the pepper infused in it has a bite that only leaves me wanting more. I take the cup from his hand and a small piece of bread from the basket on the table. “I’ll finish that,” I say.</p> <p>His sly grin curves up wider. “I told you you’d like it. I know what you like.”</p><p>His words grab me and again that feeling overtakes me—the feeling that I know I love this man.</p><p>At the end of the old-fashioned street is a small winery—like the one I saw in the ad. A sign above the door reads, “Rhônes.” A bell jingles as Jagger swings open the door. I look up at the scruff on his face and graze my hand down it as I pass by. The small room is filled with people and wine—red at one end and white at the other. Upon passing through the second door, we approach a long narrow set of rickety stairs. Jagger laces his fingers in mine and keeps hold of me with his strong grip, as his orange shoelaces guide our way down. When we enter the wine cellar, Jagger pays the admission and is handed a small clipboard with a list of wines and a pencil. I’m immediately drawn to the word organic and stop at the table labeled “Côtes de Tablas.” Open bottles of wine line the table with small, already poured glasses surrounding them. We each take a glass and sip it. The wine is a dark red, rich, balanced, and delicious.</p><p>I crane my head back as he stands beside me. “Rhône style wines are my favorite.”</p><p>He tastes his sample again. “It’s not bad.”</p><p>“Not bad?” I say in mock exasperation.</p> <p>Impersonating the customer who was just minutes ago standing in front of us, he describes the attributes he likes about it in a deep stern voice. “It’s extremely juicy and the taste reflects the lime-stone rich soil . . .”</p><p>I kick his shin with the heel of my shoe. “Stop it,” I whisper.</p><p>He sets his cup down and his hands are on my hips. “What? I’m just commenting on the wine. I thought you liked it when I recite random facts.”</p><p>His warm breath cascades down my cheek and I lean my head against his shoulder. “I do, but only when they’re yours.”</p><p>Clutching my hip bones tighter, he says, “I don’t know any random facts about wines.”</p><p>I escape his embrace, as my need for him turns painful, and grab his hand. “Come on, then, let’s go learn some.”</p><p>Two hours and way too much wine later, we are at our final tasting. Our clipboard is loaded with at least a dozen selections for purchase and we are sampling the whitest of whites.</p><p>“Mmmm . . . sweet and delicious,” I say, maybe a little too provocatively for being in a public place.</p> <p>His hands are around my waist, and when he doesn’t drop his grip to taste it, I swivel my h*ps and put the glass to his lips. He bends down, “Mmmm . . . sweet and delicious just like you.”</p><p>His accent is much more noticeable with alcohol in his system. When he dips the tip of his tongue in my ear and pulls me against him, I gasp. His hard c**k presses into my back. The room is dark and crowded and I wish we were alone.</p><p>“Pour another glass,” he commands, as he pulls out the clip holding my hair up. His accent is so sexy right now, my body quivers.</p><p>His hand skims the front of my pants and my eyes instantly pop open. I look around but no one is paying any attention to us. His fingers tease the inside of my thighs and it feels incredible. As he starts to move up, closer to my clit, I push away.</p><p>“I have to use the restroom,” I whisper, my pulse throbbing at all points in my body, and I rush away, knowing that if I hadn’t, I would have come here, in the middle of a wine cellar.</p><p>When I return, he has paid for the wine and is thanking the sales clerk for having the items delivered.</p><p>As we make our way up the creaky staircase, my heart is still pounding from his touch and I know I’m going to ask him if it’s even possible to consider h**ing s*x in his small car. But it turns out I don’t have to say anything. As soon as we open the door and walk into the blinding light, he has me caged against the cool brick building. I feel the wool of my sweater snag, but don’t care once his mouth finds mine. Soft, cool, sweet, I can’t help but lick the flavor from his lips.</p><p>When we pull away, he has the look on his face that he wore yesterday when I left him in the doorway to his bedroom. I notice his jaw tighten before it relaxes.</p><p>“What’s the matter?” I ask.</p><p>He cups both my cheeks. “I love you, Aerie.”</p><p>I take a deep breath and my heart pounds in my ears. There’s a slight possibility I may be hyperventilating. I exhale and fasten my eyes to his. “I love you, too.”</p><p>Never have I known what real love is—until now.</p><p>He leans his forehead to mine and we stay like this for a long while. Then he pulls back and the corners of his mouth tip up and his hooded eyes sparkle.</p><p>“How far away is your car?” I ask, still breathless.</p><p>“Why?” he says, his eyes gleaming.</p><p>“Because I want you right now.”</p><p>“Are you sure that’s what you want? To have sex in a car?”</p><p>“What I’m sure of is that I want you to make love to me.”</p><p>He slides his hands down my arms and circles my wrists with his fingers. “Well good thing I asked the sales clerk downstairs to call and get us a room right down the road.”</p><p>He laces his fingers through mine as we dash in the direction of the hotel. Close to the shaded town square, it’s a stone building with vines creeping up it. As we walk under the sign that reads, “Hotel Cheval,” we enter a sophisticated room. Jagger checks us in and I glance around—an outdoor stone fireplace, a library, a Parisian-inspired bar—all alluring and intimate. I can’t help but wonder what it would be like to be n*ked on those surfaces with his c**k or his tongue bringing me to orgasm.</p><p>“Alice, are you in wonderland?” He chuckles stroking his thumb over my cheek.</p><p>I blink myself out of my daze. “What?”</p><p>“Come with me.” He grins and takes my hand to lead us down the hall to our room. Opening the door, the space is stylish and classic at the same time. Light colored linens in corals and tans adorn it—it’s clean looking with an edge. But that’s not why I’m not preoccupied with the idea of bed bugs like I usually am at a hotel. No, it’s because he’s here with me and there is nothing that can distract me from him.</p><p>I rarely drink, so the wine has left me feeling really good and uninhibited. I know he’s also had a good amount of wine and his senses are just as impaired, or rather, heightened. I walk ahead of him. “Stay there.”</p><p>I pull my sweater off and let it fall to the ground. I can feel his eyes on me as I move toward the bed and seconds later drop my bra. When I kick my red heels off and unzip my pants he watches me intently.</p><p>“Put those back on once you’re undressed,” he breathes.</p><p>I smile to myself as I pull my legs out of my jeans, but leave on my white silk panties. I wedge my foot back in my shoe and bend backward to hook my heel into it.</p><p>“Everything first.” His deep voice sends a shiver through me.</p><p>I still can’t see him, which makes this so much easier. I turn around as I step out of my shoe for the second time. He’s leaning against the wall and as I turn he licks his lips. He has lust and want written all over his face and that’s all I need to see to set my soul on fire. There’s something so empowering about knowing he wants me as much as I want him. And I want tonight to be a night he’ll never forget.</p><p>His eyes pin me as I slide my panties over my thighs and let them drop before stepping out of them and back into my shoes.</p><p>“Fuck,” he mutters.</p><p>Sauntering up to him, I notice his lips are slightly parted and his eyes hooded. He smells incredibly sexy and I can’t help but run my nose down his neck, stopping to suck in a few places along the way. I’ve never given anyone a hickey and right now I really want to. He doesn’t say I can’t so I give it a try. His hands are at my h*ps and his fingers are splayed across my ass. I run my hands under his shirt and it bunches at the top as my lips follow the same path. I notice he’s watching me with a predatory look as I pull his plain, white long-sleeved tee over his head.</p><p>He pulls me tight against him and my ni**les harden instantly at the contact.</p><p>His teeth skim the shell of my ear. “Tell me what you want first.”</p><p>My stomach flutters. “Whatever you want,” I say, trying not to sound too breathy.</p><p>“I want you to tell me what you want me to do to you right now. What were you thinking about in the lobby?”</p><p>I lean back and look at him—the connection we share is so powerful, I am not the least bit ashamed to tell him what my thoughts were. “About you making me come, about your face between my legs and your c**k inside me.”</p><p>He tilts my chin to look at him. “I can’t wait to f**k you with my tongue and my cock. But can you do something for me?”</p><p>I nod, completely turned on by his words and the thought of what’s to come—I think I’d agree to anything.</p><p>“Can you let your need for control go, for just this one night?”</p><p>I swallow and stare back into his eyes for the longest time before answering. “Yes.”</p><p>He grins. “And leave your shoes on.”</p><p>I smirk.</p><p>“I’m not kidding.”</p><p>“I know,” I answer, as my hands move to his pants and unbutton them. I’ve been waiting to hold his full, thick c**k in my hand for way too long.</p><p>He kicks his boots off and I quickly help him slide the denim down his legs and then follow with his boxers. He stands gloriously n*ked before me and the minute his c**k springs free, I wrap my palm around it. With my other hand roaming his body, and both of his roaming mine, he moves us toward the bed. He tugs the bedspread off and pats his hand against the pillow.</p><p>“Lay here and keep your hands gripped to this,” he says pointing to the top of the wooden headboard.</p><p>As I lie on the bed and grip the headboard, I place my legs as wide apart as I can in anticipation of what’s to come. When his lips find my mouth and slide down my neck, he sucks in one spot for a few short moments. When he stops I can feel the vibration of laughter dance across my skin. “Now we can have matching hickeys,” he murmurs and my body begins to shake with laughter as well, but it quickly stops when his teeth graze my nipple.</p><p>His descent is slow and torturous, but so good. He circles my br**sts and licks my ni**les into hard peaks as his hand slides down my body. His fingertips trail down my hip bone to my inner thigh and work their way up again.</p><p>“You’re so wet.”</p><p>With his mouth on my br**sts, his fingers circle my cl*t and I’m sure he can tell how much I want him—no more words are necessary because my body is speaking on its own. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His tongue flicks in and out of my belly button as he slips a finger inside me. I can feel the centralized pulsing starting to build as every nerve comes alive. I reach down to tangle my fingers through his hair, and just as his tongue hits right where I want it the most—the place where the ache radiates most strongly, he lifts his head.</p><p>“Put your hands back over your head or I’ll have to start all over.”</p><p>I quickly do as he says—needing the release that I know will come. With my hands back in place, but itching so badly to touch him, I look back down at him. His hands spread my folds and he dips his tongue inside me and then moves it up to circle my clit.</p><p>“Do you like this?” he asks.</p> <p>I can only moan.</p><p>“Or this?” he asks.</p><p>And then I figure it out; he wants to know which place will set me off. Which place brings the most pleasure.</p><p>“There, right there,” I call out as my orgasm swells inside me.</p><p>He circles his tongue in just the right spot and my orgasm builds to new heights and I can’t stop myself.</p> <p>“Oh God, yes. Right there. Don’t stop. Please, don’t stop. Oh God, yes.” I repeat these words over and over.</p><p>“Let go, Aerie, just let go,” he tells me.</p><p>And I do. I let everything I am and everything I know fade away as I look into his stormy grey eyes and scream his name over and over as that single wave of pleasure consumes my entire being.</p><p>He moves up my body staying pressed against me and when his head is aligned with mine he weaves his hands in mine. His hard c**k throbs against my leg and he kisses me with the sweetest of kisses—soft, gentle, loving.</p><p>“Let’s do that again, but this time I’m going to be inside you.”</p><p>I want to push his hair from his eyes, but his hands hold mine tightly.</p> <p>“I don’t know if I can,” I breathe.</p><p>“You can,” he says confidently.</p><p>He positions himself on top of me and, letting go of my hands, guides himself in. He moves slowly, stopping occasionally to assess my reaction. I moan when he pulls out and re-enters and again slowly slides in. He buries his face in my neck and instead of sucking on the spot he had more than likely bruised, he kisses it gently. I raise my h*ps and his c**k moves deeper, but I want even more. Pressing my heels into the mattress, I try to engulf him. I want to feel all of him.</p><p>“What do you want, Aerie?” he whispers.</p><p>“More of you. All of you.”</p><p>But instead of giving me more, he pulls out. His eyes are intense and focused. “Do you trust me?”</p><p>I nod.</p><p>“Get on top of me.”</p> <p>My heart pounds, but I do as he says, and as I straddle his thighs, his c**k rubs against my stomach. He takes it his hand and my stomach flutters.</p><p>“Lift yourself on top of me,” he whispers.</p><p>I want to laugh at myself for not having figured that out to begin with.</p><p>As I lower myself down, he grabs my hands and pushes against my palms. That’s all the support I need, and before long, we find a rhythm. He arches his back as I rise up and I can see the pleasure he’s feeling at the same time I feel it. He lets go of my hands to cup my br**sts. I look down at him and my hair tumbles forward. He pushes it away. His h*ps rise off the bed, his hands move to my clit. I watch it all. Erotic, beautiful, different, new—everything I’ve never known and nothing I ever want to live without.</p><p>I lean back slightly and sensations sweep through my body everywhere.</p><p>“Fuck,” he groans.</p><p>And in unison, the two of us become one and small ripples of pleasure race through me over and over, one after the other in continuous waves.</p><p>For the rest of the night, we didn’t say we loved each other again . . . we didn’t have to. We took the time to learn each other’s body. What we liked, where we liked it. I let go and let him in—and he showed me how.</p><p>Chapter 8</p><p>Everything Changes</p><p>Jagger had promised to get me to work on time, but I took the morning off anyway. I had tons of personal hours saved up that I hadn’t used in years. He dropped me off at my house with plenty of time for me to shower and get to work by noon.</p><p>The sight of two huge white envelopes, at least six inches thick, sitting on my desk greets me the moment I walk in my office. I approach it with curiosity.</p><p>Kay looks at me. “I hope that’s not your severance package,” she jokes.</p><p>I raised a brow. “At least it would be a big one.”</p><p>Laughing, she taps her pencil on her desk. “Well, what is it?” she asks.</p><p>Pride rushes through me as I see Warner Bros. stamped across the thick packages.</p><p>“It must be the script changes for my uncle’s movie,” I beam.</p><p>She purses her lips. “What movie? I didn’t know your uncle made movies.”</p><p>I sit down and roll my chair to open the side drawer. “He doesn’t. My uncle was a musician and Warner Bros. is making a movie about his life.”</p><p>“Don’t tell me your uncle is Ian Daniels,” she remarks in shock.</p><p>Slitting the envelopes open with the letter opener, I pull the contents out of the first one. “None other.”</p><p>She stares at me, seemingly unable to speak.</p><p>“What?” I ask, glancing down at the two-page memorandum from the director addressed to me.</p><p>“My sister is doing her first screen test today for the role of Madeline in that movie.”</p><p>“In the movie, No Led Zeppelin?” I ask.</p><p>“Yes.” She beams.</p><p>“Are you sure?”</p><p>“Positive,” she answers.</p><p>My eyes scan the words before me.</p><p>Ms. Daniels,</p><p>As you know screenplays are instruments that transform words on a page and bring stories to life. They should snap, crackle, and pop from page one. And although I find your uncle’s life fascinating, I believe the integral element of romance is needed to make this movie all it can be. I want to grab the audience’s attention from page 1, from the very first scene. And when it ends, I want to leave the audience grieving with the most profound emotional impact I possibly can.</p><p>So with that being said, attached are the changes I’ve made to the script. The biographers stumbled across your uncle’s on again off again romance and I have taken a few liberties to expand upon it. The romance your uncle shared with Madeline Grayson through the years and even up until the two years before his death is inspiring . . .</p><p>My heart sinks and I lift my eyes from the paper. Madeline Grayson? That’s Levi’s mother. I had no idea my uncle ever dated her. She was married to Levi’s father for years. But they divorced that last summer I spent at the beach with my uncle. The summer before Levi broke my heart and I couldn’t bring myself to go back until it was too late. Until my uncle was dying.</p><p>I glance over at Kay. “When did you say your sister was doing the screen test?”</p><p>“She got a call about an hour ago and was told to be there at two.”</p><p>“Who’s your sister?” I ask as I try to glance at the script changes that will take days to go through.</p><p>“Jules Atwood. We’re half-sisters, actually.”</p><p>The name rings in my head, but I can’t place it. I know I’ve heard of her.</p><p>“Aerie?” she asks.</p><p>I look up. “I’m sorry. What?”</p><p>“My sister. Do you think she’d be good for the role of your uncle’s girlfriend?”</p><p>I click my computer keyboard and Google Jules Atwood. “I’m not really sure, to be honest with you.”</p><p>My mouth drops as I stare at the face of the woman I saw in the elevator that morning. The one with the raspberry leather jacket, the one with the haunting face, the one Jagger spoke to by his car, and—Kay’s sister. Zooming in on one of the pictures on the screen, she’s dressed in a long tight skirt, showing off her narrow h*ps and tall, slender figure—and that’s all she’s wearing. She’s topless with her hair in front of her br**sts and her heavy-looking earrings sparkle in the reflection of the water she’s standing in. She’s absolutely stunning and the thought of her cast against Jagger makes my stomach turn.</p><p>I quickly close the computer window and take a deep calming breath. “Excuse me a minute.” I grab my phone and head out to the lobby. Dialing my attorney, he comes on the line and reminds me that I declined my rights to review script changes. He says we can fight them but they’d probably win. However, it would tie up production for a long time and maybe long enough that the execs would just shelve the project.</p><p>I hold back my tears as I sit down and lean against the cool glass. Why did I never know my uncle had an affair with his neighbor? She was at all his summer parties with her husband. Did he have a love affair with a married woman? But I loved him, and who he loved would never have made a difference to me—married woman or not, I wouldn’t have cared. But I would have liked to have known—to have seen him happy with her. I would have liked someone who loved him to talk to about him once he was gone.</p><p>Colored vases adorn the shiny granite topped reception area and soft music beats through the speakers. It’s quiet in the lobby and I stay out here for a long while with my head in my hands, just trying to think about nothing.</p><p>“Aerie, there you are,” Kay says, rushing my way. “My friend over at the Warner Bros. lot told me to come by on the pretense of an interview for the first issue of Sound Entertainment Magazine and I could grab a peak at the casting table. Come with me. I want you to meet my sister,” she implores.</p><p>I’m reluctant, but my curiosity wins out. “Sure, I’ll come. Let me just check in with Shelly and make sure the layouts I gave her on Friday have been accepted.”</p><p>“Judging by the nine-story-high billboards, I guess they tape Conan there.” Kay snorts as she pulls up to the Warner Bros. gate.</p><p>The guard directs her to a large parking structure across the street. I’m pretty sure if I had called Brett, we would have given me a drive-on. When she parks her Mercedes SLS, I notice we are the only car in this lot with California plates.</p><p>We cross the street and go through an airport-like security check where we have to show our IDs. Once we walk onto the lot, it’s clear we’re in Hollywood. Each soundstage has a sign indicating what movies are being filmed in them.</p><p>“We’re looking for Soundstage 5. My friend told me to look for Casablanca on the plaque.” Kay’s New York accent is more prominent than Jagger’s and it’s hard to miss the more excited she gets.</p><p>The building is a charming old structure with a tile roof. We pull open the door and there are two more doors to follow. We turn to the right where we can hear voices and stop in the open doorway. Peeking in the room, I make out Styrofoam lunch containers littering the surrounding area and a number of people sitting around a table. Cameramen are spread throughout the space and they move around cues I don’t understand.</p><p>“They’re doing a read through with my sister,” Kay gushes.</p><p>My eyes are drawn to the raspberry leather jacket, but cut to the blue quilted vest on the guy sitting beside her. I didn’t even know he was going to be here—did he? Chewing my thumbnail, I try to hear what they’re discussing.</p><p>“What are they doing?” I ask Kay.</p><p>“A read-through of sorts. No blocking though. My friend told me this morning that they’re going to take a number of couple pair ups and team them in different scenes to see who they want to invite back.”</p><p>Whoever her friend is, she’s well informed. The air blower overhead dies down and I can hear much better now.</p><p>Jagger as Ian: Look, for the last time I don’t give a f**k what you do anymore. I’m done.</p><p>Jules as Madeline: Don’t say that. I told you I’m going to leave him. Just give me some time.</p><p>His accent is completely gone. He has the part down. He even says “fuck” the way I told him my uncle used to say it. I remember my uncle saying it so clearly. It always sounded more like fck, than f**k. My parents never swore and my uncle stayed on his best behavior around them. But he’d slip every now and then around me. I never swore—I went to an all-girls school where the nuns would have crucified us if we said “heck.” I still don’t. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Considering the baggage between them, I have to say their chemistry is amazing.”</p><p>My head snaps toward Kay. “What do you mean ‘baggage’?”</p><p>“They dated for almost two years and then one day he just broke up with her and moved away.”</p><p>My heart seems to fail, my breathing stalls, and my mind wanders. I can’t see Jagger’s expression, but I really wish I could. Between the lines being recited and the thought of him with another woman—the gorgeous girl who has turned out to be his old girlfriend—everything around me fades away. Flashes of that morning in the rain come to mind. He saw her and never told me anything about it. He spoke to her. What else has he been doing with her? Red creeps up my face and spreads like fire through my body.</p> <p>Jules as Madeline: I love you. Don’t say that.</p><p>Jagger as Ian: Madeline, I love you. You know that, but this is over.</p><p>His first words ring in my ears. The same three words he said to me yesterday, and it doesn’t seem like he’s acting. Oh my God, I really am the rebound girl.</p><p>“I wonder if she’ll pull a Carey Mulligan.”</p><p>All I can do is stare at her. The lump in my throat grows larger as I try to hold back my tears.</p> <p>“Carey Mulligan as Daisy. They say she got that coveted role in The Great Gatsby because during her audition she just up and kissed Leonardo.”</p><p>My hand flies to my mouth. “Oh God.” My voice comes out almost unrecognizable to myself.</p><p>“Aerie, what’s the matter? I thought you’d be excited to see your uncle’s movie in the works. Who knows, those two,” she points to the table where raspberry jacket and blue vest are turned to us, “just might be the stars of No Led Zeppelin.”</p><p>“You know what, we should get back. Lunch is long over and we have work to do,” I say in a no-nonsense tone.</p><p>“I just want to see if they kiss.”</p><p>I can’t watch anymore. I don’t want to listen. I’m not even able to breathe. This morning’s revelations have been too much for me. I just found out that my uncle had a secret relationship that is being sensationalized for a movie, and now I find out Jagger and his ex-girlfriend are auditioning for those parts. “I’ll wait outside. I’m not sure we should be in here.”</p> <p>Opening the door to the beautiful blue sky, I can finally breathe normally. Avon Street, the water tower, all the familiar landmarks are here, but I suddenly feel so incredibly lost. Sitting on the curb, I put my head between my legs and can’t stop the memory from pushing itself forward.</p><p>I was sixteen. Levi James was seventeen. I’d spent every summer with him for as long as I could remember—he lived next door to my uncle. His father was the co-host for Entertainment Today and was never home. His mother came from old money; she kept her maiden name, and occupied herself with charity work. We all spent a lot of time together. But the summer before, Levi had a girlfriend, and I didn’t care for her so I avoided him.</p><p>That last summer I was there, he had just broken up with her and I saw him in a way I never had. He seemed taller, more filled out. And when we spent time together, we both flirted, we gawked at each other—seeing him both thrilled me and terrified me.</p><p>He asked me to a concert, just the two of us. It was nothing unusual; we’d done things together many times. But this time he wanted to pick me up—it was a real date. My parents would have forbidden it, but Uncle Ian always said yes to anything I asked.</p><p>Levi and I shared a passion for music and that brought us closer. His band had just cut their first demo. That night he let me listen to it. He even gave me a copy of it before he leaned in to kiss me. He was my first kiss and I was on top of the world.</p><p>The next day Levi asked if I’d listened to his CD again. I told him I had. I told him I’d even let my uncle listen. He liked that. I told him my uncle was impressed. He liked that, too. Over the next week, we’d sneak out and our kissing turned into full-blown make out sessions. I even let him put his hands on my br**sts and eventually inside my bathing suit top. Before I knew it, his hands wandered inside my pants. He would whisper words to me I hadn’t ever heard or used—make me horny, hot pu**y, suckable tits. I have to admit—I liked it.</p><p>Then one night his parents were out and we skipped the movie we told my uncle we were going to. I hadn’t touched him ever, but that night he begged me to. I didn’t know how and I didn’t want to tell him that. We were on his couch watching MTV and our cuddling had turned into him groping me. For the first time, I let him take my clothes off. When he pressed my hand against the hardness sticking out of his shorts, it scared me. But then he guided my hand the way he wanted me to move it and my fears eased. When he told me how good it felt, I kept doing it.</p><p>Then he took his jeans off. It was dark and I couldn’t see him. We were both n*ked under a blanket and his fingers entered me. I wasn’t sure I liked it. He moved them and I wasn’t sure what to do. He was breathing hard and telling me how much he loved me. And when he asked me if I loved him, I nodded. I guessed I did. Then he asked me if I trusted him. I said I did. Before I knew it he was supporting himself with his left arm, kissing me softly, and his right hand was down at my pu**y with his c**k in it. He guided himself in without asking, but I’d have let him if he had. I liked the sounds he was making and knew my virginity would have to be taken eventually anyway. His thrusts felt awkward. The whole thing hurt and was uncomfortable. But I lay there and let him move in and out of me for what seemed like forever. He didn’t say a word. I wished he would reassure me. He didn’t wear a condom and I wasn’t on birth control—thank God I didn’t get pregnant.</p> <p>He shoved the blanket off and moved faster. My br**sts lay bare and I wanted to cover them. Then he made a noise I’d never heard him make and warmth spread everywhere. He lightly pecked my neck and stood up, leaving his sperm on me. I was disgusted.</p><p>I never told him he was my first, but he had to have known. When he pulled his pants back on, he handed me my clothes. “You better get dressed in case my parents come home early.”</p><p>For the next month, I let him do that same thing at least a dozen more times. Each time it was the same. I didn’t care that I didn’t feel anything. It didn’t hurt anymore and he really liked it. By then, Levi had a few paying gigs in LA and he was so happy. And that made me happy.</p><p>Time flew by and before I knew it, it was the night before I was scheduled to leave. We had said our goodbyes the day before knowing he wouldn’t be home until late. He was playing a gig somewhere. But I wanted to see him one last time, so I stayed up all night waiting for him. When the light finally went on in his room, I knew his parents would be asleep. His room was on the top floor, so I took the deck stairs and entered through the balcony door that he never locked. I had visions of a passionate goodbye, tears, and vows of love, but what I got was an image that I’ve never been able to forget—another girl sitting on his lap, facing away from him, both of them naked, his hands on her br**sts, her knees bent sliding up and down over his cock. As if the picture wasn’t enough to break my heart, his words only hit me deeper. “That’s it. Don’t stop. I love it when you move like that. Fuck, I’m coming.”</p><p>She was the girl from the summer before—his ex-girlfriend—and just as his words were being said like a prayer, she looked toward the door where I stood motionless, watching the whole thing.</p><p>“What the f**k?” she screamed when she saw me staring at them. I’d never felt more stupid, more naïve than I did in that moment. The pleasure that radiated from his face instantly turned when he saw me. I ran as fast as I could, but he caught up with me on the beach. His pants were partially zipped and he wore nothing else.</p><p>“Aerie, let me explain!”</p><p>I blinked at him, unable to speak.</p><p>“She’s in the band. We’ve been spending a lot of time together and it just happened. I didn’t mean it to. I love you.”</p><p>I stared at him. I wanted to say it was okay. I wanted to tell him it didn’t matter because I loved him, but I couldn’t. Something happened to me in that moment. Something shielded me from the pain that threatened to tear me apart. Whatever it was, it formed a nice hard shell around my heart so that it could never be broken again.</p><p>“Are you sick?” Kay asks, bringing me back to reality.</p><p>I shield my hand from the sun as I glance up at her. “You know I’m not sure. I really think I just need to go home.”</p><p>She frowns. “Of course. Let’s go. They didn’t kiss anyway.”</p><p>We’re both quiet on the drive back to work. I close my eyes and lean against the cool window and try not to think. Before I know it, we’re at the office. I step inside to tell Shelly I’m taking the rest of the day off, but stop to approve photos for next month’s issue.</p><p>By the time I get in my car, I’m completely worn out. I drive home and try not to think about how I let the same thing happen to me all over again. My last conversation with Levi comes to mind and I can’t stop my tears from spilling.</p><p>“Hey, honey, talk to me. I love you,” he said. He’d never called me honey and I knew he didn’t love me.</p><p>I backed away with my hands out. My spine straightened and I bite out ugly words that weren’t me. “I just wanted to say goodbye. Thanks for the fun, but my boyfriend is waiting for me back home.” I didn’t have a boyfriend, but he didn’t know that because he’d never asked.</p><p>“Cold. But, yeah, it was fun,” he called as he turned and headed back to his house. But not before his final words stung me like venom. “Hey,” he said. “Thanks for hooking me up with your uncle, my parents forbade me to talk to him. They said it would seem like I was using him. But they never said I couldn’t use you.”</p><p>His words rang in my ears as I ran as fast I could down the beach. I ran for miles, until I hated the sand beneath my feet. I collapsed and when I finally stood up, sand clung to every pore of my body. I hated the beach. I hated Levi. I even hated my uncle. I left that summer with nothing but hatred in my heart.</p><p>God, I thought I was harder now, more mistrusting than that naïve girl—I’d worked on developing those qualities. But somehow Jagger had broken down my defenses within minutes of our first meeting. Was I still so naïve? He fed me a line about not falling in, and that was just what I had done—fallen hard, fallen fast. How had I let that happen? I was a woman in control—I am Aerie Daniels of Sound Music Magazine, not Alice in f**king Wonderland, for God’s sake.</p><p>Chapter 9</p><p>Dark Side</p><p>The birds sing all around me while the sunlight filters through the large trees that surround my stone patio. As I rock in my comfortable padded chair, I sip my tea and stare at the wooded hills that lead to trails I have only walked with him. I’ve done so many things with Jagger I’d never done before.</p><p>I’m trying to ignore the tears leaking from my eyes as I move back and forth. My insatiable appetite for Jagger Kennedy has blurred my judgment, but not any longer. I can’t go on like this. I’m sure he’ll be here shortly, and once he arrives, I’ll be mature and break things off in a respectable way. I want to seem unbreakable, like the girl I’ve been so many times who broke up with her boyfriend because he just wasn’t right for her. But this time I’m anything but—my heart has already been shredded into a million tiny pieces.</p><p>“Hey, I’ve been calling you all afternoon.” His voice is warm, velvety, and smooth.</p><p>I take a slow, calm breath as I lean my head toward him and away from the sun. “Can you sit down?”</p><p>He’s standing in the doorway. “What’s wrong?</p><p>“We need to talk.” I can’t believe how calm I’m being.</p><p>“Why haven’t you answered your phone?” He places his arms on either side of my chair and leans forward. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I allow this last bit of closeness. One last sniff of his delicious scent that now seems marred by her scent. “Jagger, please sit down.”</p><p>He tips my chin. “I don’t want to sit down. I want to know what is going on.”</p><p>I want to turn my cheek and let his fingers skim my face, but I pull away. “I saw the two of you together today.”</p><p>He brings my gaze back to his. “Who are you talking about?”</p> <p>“Jules. I saw you and Jules.” Her name burns my throat.</p><p>“That’s why I was calling you, to tell you Brett had called me at the last minute. Wait, how did you know I was there?” Panic flashes across his face, I see it clear as day.</p><p>I straighten my stance. My heart feels like it’s trying to break out of my chest. “Jagger, let’s not drag this out. You got what you wanted. You were amazing today. I’m sure you’ll get the role.”</p><p>He finally sits down. Stunned into silence, he just stares at me. “What are you talking about?”</p><p>I gesture between us. “You and I, this farce you’ve been playing all the while seeing her.”</p> <p>“Aerie,” he says tightly. “What the hell is going on? How can you think that?”</p><p>I breathe in a breath that I don’t want to let out. Finally, releasing it, I spill it all. “I saw you with her weeks ago when you drove me to work. Then you disappeared that day. Now I see the two of you auditioning for lead romantic roles opposite each other. Did I leave anything out? Oh, yeah, Kay claims you just up and left Jules without any reason. Did she really even cheat on you?”</p><p>Alarm fills his face. “First of all, who the f**k is Kay?”</p><p>“Kay Hudson. Jules’ sister,” I hiss.</p><p>His jaw drops, but again silence surrounds us for the longest time. “Kimberly is in California?”</p><p>I guess he calls Kay, Kimberly. “Yes, she’s my other half at the magazine.”</p> <p>He scrubs his head with his fingers and his hair sticks up everywhere. “Kimberly doesn’t have a f**king clue why we broke up. And, yes, I saw Jules that morning I dropped you off. It was pouring rain and she didn’t have an umbrella so I walked her to the door. She told me she moved to LA, and I don’t even think I said hello. I was shocked she was here. I haven’t seen her since that day, until this afternoon.”</p><p>His voice is low and my heart is so full of pain that I don’t say a word in response. I just let him talk. “The day I saw her I drove around LA trying to decide if I should stay. Trying to determine if I could stay with her in the same town. Then I saw you walking out of the office and I had no doubt—I wasn’t going to leave California because of her. I didn’t have to. I felt nothing for her. But I knew I was going to stay because of you.”</p><p>“Jagger, I can’t do this. I don’t want to be the rebound girl,” I say in a low, squeaky voice.</p><p>“You are not a rebound. I love you,” he says stressing every word.</p><p>“But, Jagger, by definition, I am. Don’t you see? Jump out of one serious relationship into another—that’s the definition.”</p><p>“Jules and I had a different kind of relationship. It’s not in the least bit comparable to what you and I have.”</p><p>“Jagger, come on. We haven’t known each other long enough for you to know that.”</p><p>He scrubs his eyes. “You’re wrong. It’s not about the length of time, it’s about the way we feel when we’re together.”</p> <p>“That makes no sense. You wanted to marry her. You obviously felt something profound for her.”</p><p>“Aerie, yes, I loved her, but all I’m trying to say is it was different. I did buy a ring, but I never asked her to marry me. I just couldn’t do it. Something about it didn’t feel right.” He takes a deep breath. “All she ever cared about was herself. It just took me a while to see it. She was going on more and more auditions. She’d become preoccupied with getting the next big role, but I never knew at what cost. She was up for a lead that she really wanted. She flew out here for a few days and when she came back she was a wreck. She didn’t get the part. I had to work late but got to her as soon as I could. When I did, she was a drunken mess. And, f**k, you want to know what she was upset about?”</p><p>I shake my head. His gray eyes are stormy and the pain on his face is excruciating. “That she’d let the director f**k her and didn’t get the part.</p><p>“I was done the minute she told me, but she wouldn’t let it end that easy. She pleaded forgiveness for what she called a momentary indiscretion. When I looked into her eyes that night all I saw was how selfish she really was. She had betrayed me and there was no taking that back.”</p><p>My heart aches for him but despite that I now know for sure what I am—I’m the rebound girl, and I have to get out. “Jagger, we’re over. I can’t do this.”</p><p>He rises to his feet. His jaw, his entire body, even his stance tightens. “Are you sure that’s what you want, Aerie?”</p><p>I nod, unable to talk.</p><p>“I haven’t been seeing her. Fuck, I told you I didn’t know she would even be there.”</p><p>I stand up and put my hands on his chest. I can feel his heart beating. Willing the tears to stay tucked away, I take a deep breath and know I have to let him go. “I’ll never be sure about us anymore, I don’t even think you can be sure, and I can’t live with that.”</p><p>His body tenses even more beneath my fingertips. His eyes start to swirl—stormy gray again as he stares at me maybe waiting for me to take it back, but I can’t. It’s true. It’s how I feel.</p><p>There’s a deep sadness flowing in waves between the two of us. Then, he turns and walks up the steps without another word leaving me feeling numb and alone. I finally let the tears I’ve been holding back fall like rain. And as the flickering of his orange shoelaces slapping against the floor begins to fade away, I’m left standing there staring at his disappearing image through the glass.</p><p>Chapter 10</p><p>Echo</p><p>“You know what they say about staring through the glass.” I keep hearing his voice, deep and sexy. I fluff my pillow and drop my head to it for the hundredth time. Inhaling deeply, I try to catch a whiff of him on my sheets. Even as exhaustion overtook me, sleep wouldn’t come, and daylight arrived way too soon.</p><p>As the sun rises, I lie beneath my silk coverlet and close my eyes. Not wanting to start another day, I make myself sit up . . . I have to make myself do this. I have to continue my life as it was before I met him. But everywhere I look, he’s there. I hear his voice, smell the lavender scent of his skin, taste the lime he always added to his drinks. I can see him coming out of the shower—his dark hair wet, his body damp, his arms strong enough to lift me onto the counter in one swoop.</p><p>The picture of my grandmother sits in a crystal frame beside my bed with one of my uncle next to it. I pick it up. He has deep tan lines and burnished blonde hair. He wears a look of optimism that doesn’t appear in all my memories of him. I considered how he fought depression his whole life, and wondered if it had to do with Madeline. I hadn’t seen his manic side, but I’d heard my parents talk about it and then I read about it in the movie script. He worked in fits and bursts—writing and recording non-stop for days without sleep. His band members were attuned to his personality and accommodated his needs.</p><p>Setting the photo down, I glance at the two twin frames—two people plagued by depression, but who led completely different lives. My grandmother lived in the shadows of her depression, letting it control her. My uncle fought it, only giving in when he could no longer fend it off. But they both died young. Would I end up like them? All alone?</p><p>I’d told Jagger about Levi, but not the whole story. The only person who knows everything is Dahlia and maybe that’s why she’s always so accepting of my quirks. It’s not a time in my life I ever want to relive. The summer after I returned from Laguna, the summer after I lost my virginity to Levi, I spent a lot of time dwelling on the events of that summer. I had withdrawn even further into my own shell and my parents were concerned. My mood swings got worse, my anger spilled over into our conversations, and all I wanted was to be left alone. I pretended to be sick as often as I could. My grades were dropping because I just couldn’t focus. I had lost control of my life. This went on for about six months until my parents became so worried they took me to a therapist. With medication and many hours of therapy, I found myself. After six months of sitting in my psychiatrist’s office twice a week, I rebuilt a life I could control. Routines that I didn’t deviate from—ever.</p><p>I knew I needed structure and stability. That was who I was—until Jagger. I let him in, I let him alter my behavior—change how I approached life, and I found I liked who I had become. I liked living in the moment, having fun, departing from the predictable and mundane. But I shouldn’t have let it happen. I knew what worked for me. So as I set my feet on the rug beneath me, I am determined that today Alice is gone and Aerie is back—not because she wants to be, but because she has to be.</p><p>The traffic is ridiculous this morning. When I’m finally a few blocks away from the office, I glance at my watch and wonder if it’s too early to call Dahlia. I reach across to the passenger seat and pull my BlackBerry from its case. The screen doesn’t light up. I never even used it yesterday and it must have died. It’s so unlike me to let that happen. Dahlia is the one either with a dead phone or without one. Plugging my phone into the power cord connected through my console, it flashes and finally lights up. Two missed calls and a text from Jagger.</p><p>I listen to the first call and the sound of his voice affects me immediately. “Hey, Alice, guess what? Brett just called and he’s doing a round table casting at two. I guess one of the potential leads dropped out and he wants me to come in. Wish me luck. Oh, and it looks like I’ll be wearing a turtleneck because I’m not sure how well that hickey you gave me will go over.”</p><p>I touch my neck where he sucked on it. Then I scroll down to the second call as the tears I promised myself I wouldn’t cry prickle my eyes.</p><p>“Hey, baby, the audition was amazing. But listen I’m on my way over. There’s something I wasn’t expecting and I want to tell you about it person. Don’t worry that pretty little head of yours—it’s not really that big of a deal, although I think you’ll . . . you know what, never mind. I’ll just tell you about it when I get there. And, Aerie, I love you.”</p><p>Oh God, my cries turn into sobs—he really didn’t know. The traffic starts to move and I wipe the tears from my eyes. Taking a deep breath, I call Dahlia.</p><p>“Hello?” she says not sounding well at all.</p><p>“Dahlia girl, it’s me. Are you still sick?”</p><p>“Hey, Aerie, I don’t feel that great. I threw up again this morning.”</p><p>“Have you taken anything?”</p><p>“River just went to the store to get something to settle my stomach. Is everything okay?” Her voice is soft and as I listen to her, it hits me.</p><p>“Dahlia, are you pregnant?”</p><p>“No! God, no! I’m on birth control,” she laughs.</p><p>“That doesn’t mean you can’t get pregnant,” I say matter-of-factly.</p><p>“Don’t be ridiculous, I think I just ate too much junk food at the game the other night or, who knows, maybe I have food poisoning.”</p><p>“Well if I were you I’d call that husband of yours and ask him to pick up an EPT test instead of Pepto-Bismol.”</p><p>“Right,” she laughs. “Did you call for a reason or just to harass me about overeating?”</p><p>As I pull into the parking lot of the business center, I push my reasons for calling aside. “Just wanted to say hi, but I’ll call you later today. I just got to work and I’m late.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s not like you. What’s going on?”</p><p>“I’ll call you later, okay?”</p><p>“Okay, but please do.”</p><p>“Oh, and Dahlia, call River.”</p> <p>She hangs up without a goodbye and I just stare at the blank screen. Then I notice the text.</p><p>At 1:53 a.m. from Jagger:</p><p>I’m going to give you some time, but we’re by no means over.</p><p>Sitting alone in my car, I contemplate texting him back to tell him how much I miss him. But I promised myself I would get out of this relationship before I was in too deep and I know I need to stick to my promise.</p><p>The elevator door dings on the tenth floor and as I exit I realize how exhausted I am. Feeling preoccupied, I don’t even notice Shelly approaching me.</p> <p>“Good morning, Ms. Daniels,” she says, stopping to look at me.</p><p>“Good morning, Shelly. Any messages?”</p><p>“Yes, a few.” She hands me the newspaper and a handful of pink colored rectangular pieces of paper.</p><p>“Thank you. Anything urgent?”</p><p>“Umm . . . I’m not sure. Are you okay?”</p><p>“Yes, why do you ask?” I manage a small smile.</p> <p>“You’re wearing jeans. You never wear jeans to work.”</p><p>I shrug. “I didn’t feel like dressing up today.”</p><p>“Well, you look incredible as always. And I love your scarf,” she remarks.</p><p>I nod a thank you. With my head pounding, the lack of sleep quickly catching up with me, I hustle down the hallway so I can sit down. Through the open door, I see Kay packing up some boxes. She’s wearing a loose fitting canary yellow dress with matching shoes. Her hair is down and the color of her outfit makes it look even redder.</p><p>“Moving day?” I ask.</p><p>“Not quite, but soon. Damon tells me everything should be ready by the end of the day. Not that I haven’t enjoyed rooming with you,” she jokes, “but I’m ready to get my own place.”</p><p>I laugh. “I understand.”</p><p>“Oh, by the way, Jules got a call early this morning. Final screen tests are today. She’s on her way now. I’m just so excited for her. I really think she’s going to get the part. And she thinks her old boyfriend, you know the guy she was auditioning with yesterday, is a shoo-in for the lead as well. Maybe my little sis will find true love with him again.”</p> <p>Setting my things on my desk, I blink at her without saying a word.</p><p>“Are you alright?” she asks.</p><p>“Yes, I just have a headache.”</p><p>“Oh, I’m so sorry. Do you want some Tylenol?”</p><p>“No, thanks. I’m good.”</p><p>“Well, I’m sneaking back over to the WB this morning. Want to come?”</p><p>“No, thank you. I have a lot of work to do.”</p><p>“Okay, I’ll be back shortly. I really think I should have held out for a job in Hollywood. I just love movie sets and movie stars,” she says with a wave of her hand.</p><p>I furrow my brows wondering for the first time why she took this job and if she’s planning on sticking around.</p><p>I spend the morning keeping busy with small easy tasks that, once complete, give me a sense of accomplishment. My hand keeps flitting to my neck—to the scarf he bought for me and the spot it covers that he marked as his own. I just can’t stop thinking about him. When I grab the newspaper, my messages fall out. I quickly look through them, stopping on the one from Madeline Grayson. It says, “She’d like to talk to you if you could give her a call.”</p><p>Without even thinking, I reach for the receiver and dial the number on the message slip.</p><p>“Oh, that was so much fun,” Kay says, slamming her purse on her desk as she enters the office.</p><p>I set my phone back in its cradle and calmly ask, “Did she get the part?”</p><p>With a smile she says, “Well, I don’t know for certain, but I’d say that director would be crazy not to cast her.”</p><p>Resentment runs through me, but it’s not her fault. I know I should have told her yesterday that I knew Jagger. Well know isn’t even the right word, that I was dating him—dated him? That I love him—loved him? I don’t know why I didn’t tell her anything.</p><p>Falling into her chair, she sighs. “Even auditioning with someone she didn’t know, she was so believable. It’s too bad her ex-boyfriend wasn’t there for the final casting. They would have been amazing both on and off screen. Oh, well.” She shrugs. “True love comes and true love goes. Isn’t that what they say?”</p><p>“I think so.” I swallow the bile down.</p><p>“Back to work,” she smiles.</p><p>My head is spinning. Why didn’t Jagger go to that audition? What does Madeline want? I push away from my desk and stand up. “Kay, I’m running out. If Damon asks where I am tell him I had some things to take care of out of the office.”</p><p>“He’s off somewhere with Ivy so don’t worry about him,” she says with a scowl.</p><p>I swear I hear her mutter “asshole” under her breath and wonder why she has a sudden dislike for him, but then again maybe she finally realized what he’s like. I shrug the thought off. “Call me if anything pressing comes up.”</p><p>She chews the tip of her pencil. “Of course. And, Aerie, if I were you I’d go home and get some rest. You really do look flushed.”</p><p>I decide to go see Madeleine in person, and drive up to her house at lightning speed, entering the neighborhood where my uncle used to live. Memories flood my mind of the times we spent together and again the tears that won’t stop flowing down my cheeks.</p><p>Drying my face, I grab my purse and walk up the driveway. I had heard Madeline and her husband divorced a few years ago and I also know that Levi hit the road earlier this year with his band. He’s running small circuits—clubs mostly, but doing okay from what I’ve heard.</p><p>My heart thumps uncontrollably as I ring the bell. The door swings open and there she stands. She looks as beautiful as she always did.</p><p>“Mrs. Grayson,” I smile.</p><p>Her eyes widen as soon as recognition crosses her face. “Aerie, oh, Aerie, my dear. I’m so glad you decided to stop by. Come in.”</p><p>I step inside and a shiver runs through me when I see the same couch I so easily gave myself up on.</p><p>“How are you, Mrs. Grayson?”</p><p>“Aerie, please call me Madeline.”</p><p>I nod.</p><p>“Would you care for some coffee or tea?” she asks.</p><p>“Tea, please.”</p><p>We make small talk while she prepares a pot of tea and then we sit outside on the deck. The cool breeze sweeps over us and I let it wrap itself around me, breathing life into any otherwise lifeless day. I chew my thumbnail, not sure of where to start.</p><p>Pouring the hot water into a small white porcelain cup, she says, “I know you’ve been contacted about the script changes. Brett told me he was sending them on to you.”</p><p>“Yes. I have. Is it true?”</p><p>She takes a shaky breath. “Yes it is. I loved your uncle very much and we would have been together if it weren’t for the fact that he was afraid of his mental health.”</p><p>I select a teabag from the tray in front of me. “Madeline, I’d love to hear about your relationship with him, if you don’t mind sharing.”</p><p>Sipping our tea as the ocean dances before us, we sit for hours and she tells me how she fell in love with my uncle the first time she met him. How she and her husband, although married on paper, lived separate lives. How she wanted to divorce him and be with my uncle, but my uncle forbade her from doing that. She told me it wasn’t until he was diagnosed with cancer that he told her why. She had always thought he loved being a bachelor, the freedom to go wherever he wanted and be with whomever he wanted, but that wasn’t it at all. He was afraid his depression would take a turn, like his mother’s had, and that she’d be stuck taking care of him.</p><p>Another wave of tears escaped me and I gave up trying to stop them. I was able to see my uncle through her eyes as a man who loved a woman he was afraid to have. A man who distanced himself from her out of fear of what he might become. Her words tore at me—I had done everything my whole life to avoid ending up like my grandmother and now it was those very same decisions that were sending me down that same path.</p><p>When Madeline excused herself to refill the teapot, I quickly pull out my phone and type a text to Jagger.</p><p>I really need to talk to you. Tell me where I can meet you.</p><p>I wait for a response, since he usually answers immediately. But there is none.</p><p>“Here we go,” Madeline says, setting the silver tray down.</p><p>We talk a little while longer as I listen for the text that never comes. She tells me why she and my uncle never told me about their affair. She explains that my uncle didn’t want me to think badly of him for being involved with a married woman and he was afraid that my parents might not let me spend my summers with him if they knew.</p><p>She also tells me how hard it was for her when he died—how she’d lost her best friend and wanted so much to talk to me. But she promised my uncle she wouldn’t. She finally divorced her husband and has refused to move because she feels close to my uncle here.</p><p>“The only reason I called you today is because I knew the biographers over at Warner Bros. were writing me into their movie. They promised to change my name and alter the details if I’d share the story with them.”</p><p>I look at her stunned. “Did you?”</p><p>“Fuck, no. I told them to go f**k themselves.”</p><p>My tears turn into laughter—she says f**k like my uncle used to. I grab her hand. “Madeline, I think you should share your story. It’s a true love story, not the one they’re fabricating and I’d be proud for the world to see it.”</p><p>With both of us sobbing, she nods her head and agrees.</p><p>Shortly after the sun set my phone beeped. I stole a glance. A text from Dahlia—I’d read it later. I give Madeline my full attention as she tells even more stories about my uncle. But when her voice starts to get shaky, I know we are both emotionally drained. As I stand to leave, she pulls me to her and hugs me tightly. “You’re a beautiful woman, Aerie. Your uncle would be so proud.”</p><p>“Thank you,” I manage, staring out into the ocean I haven’t swum in since that last summer.</p><p>She studies me. “Aerie, this isn’t my business, but I want you to know that after your uncle died, Levi had a tough time as well. He grew up with your uncle. And he told me what happened between the two of you.”</p><p>My pulse pounds as embarrassment rushes to my cheeks.</p><p>“I’m only telling you this because I know he feels so much regret for having hurt your feelings. He told me he told you he used you. Aerie, I didn’t ask for details. But it wasn’t true. There are some things a mother doesn’t want to know, but he did tell me what he said to you. Your uncle helped him every chance he could, but Levi wanted to make it on his own. He loved it when your uncle would sing his praises, but would never take his help. I urged him to often; after all, everyone needs a helping hand, but Levi was stubborn . . .”</p><p>I stop listening as I try to remember that summer. How much he worked and how odd I thought it was that my uncle could only help him get gigs at small functions. It all made sense now and, not that it should matter anymore, but knowing that he refused my uncle’s help does matter.</p><p>After spending the day with Madeline, I drive away from the south bluff feeling a sense of peace I’ve never felt before. I think it comes from knowing my uncle was happy—that he had found true love. His version may not have been like in the movies, but it was the way he chose to live his life and I can accept that.</p><p>It’s dark as I drive down US 1. I glance over at the ocean and up to study the stars, shining like little diamonds. Suddenly, I remember my grandmother reading me a book and after closing it glancing up at the sky, “See those shining lights?” she asked. “Whenever you’re sad, wear something that sparkles and think of the stars and the sadness will be gone.” My hand moves to clutch the colored glass necklace that hangs around my neck, one of hers, and I suddenly understand why she had such a vast collection—she was looking for happiness with them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But I don’t have to look for happiness in her costume jewelry collections; I have someone who makes me happy. I just have to make it right with him. I’m not sure I can fix what I’ve broken between Jagger and me, but I know I can help him. So I pick up my phone and select Brett Hildebrandt from my list of contacts.</p><p>“Hello?” he answers on the second ring.</p><p>“Brett, it’s Aerie Daniels. I got your package yesterday.”</p><p>I explain that I won’t hold the script up in court as long as he does two things for me. First is to tell the real love story that my uncle and Madeline Grayson shared and second to allow Jagger Kennedy to come back in and audition for the role before he makes his final selection. Of course, he agrees to both.</p> <p>When I pull onto my street, I see small flickers of light lining the walkway to my front door. I park in the driveway, curious about what they are. When I get out, my heart stops. Cupcakes are on both sides, but not just any cupcakes—Sprinkles black-and-white cupcakes with candles in them. I follow the glow up to my front door where a sign reads, “Alice, I take full responsibility for what happened.”</p><p>I enter the house cautiously as my pulse races. His boots are on the mat that he never uses and when I glance up I see his blue quilted vest on the hook. On the first step is a cupcake with a small note—“Eat me.”</p><p>I can’t help but giggle—in the movie Alice grows larger than the house when she eats the cake.</p><p>One step at a time, I move forward. Once I reach the top I see a bottle of water, and another sign—“Drink me.”</p><p>Again I giggle and I don’t care that I do—Alice shrinking so small that she fits perfectly in the house is giggable stuff. He has the eat me and drink me reversed, but I don’t care. I have to find him. I see a glow from under the door to my room and when I open it, he comes into focus. With his arm wedged against the frame, the first thing I see is the upward tilt of his full lips and without a moment of hesitation, I crash my mouth into his. I’ve missed him, everything about him, and if he can forgive me for my actions, I want him back in my life.</p> <p>He pulls away. Breathless, he asks, “Did you miss me?” like I was on an overnight trip and just got back.</p><p>I know I couldn’t possibly love him more than I already do. More tears fall from my eyes and I just don’t care. I trail my fingers over his smooth pale skin flecked with slight stubble, up his sculpted nose, and through his dark brown hair that always looks like he just rolled out of bed. Staring at him, I think: This man is my version of perfect.</p><p>“Yes, Jagger Kennedy, I missed you.”</p><p>“How much?”</p><p>“Very, very much.”</p><p>“Are you sure?” he asks with that a smoldering grin that I can’t resist.</p> <p>“Yes, I’m sure,” I answer.</p><p>“Good.”</p><p>He places small gentle kisses on my lips, my jaw, my neck. In turn, I kiss his mouth, his stubble, and the spot I marked just a few days ago. Passion and desire pool within me. He pulls away and his eyes sweep me. Then he pulls me to the bed and onto his lap.</p><p>“We need to discuss a few things,” he mutters in between his kisses.</p><p>“I know,” I answer kissing him back.</p><p>“First, I love you.”</p><p>“I love you, too,” I say my voice breaking on the words.</p><p>“Second, I love you.”</p> <p>I giggle. “Is there a third?”</p><p>“Yes, I love you. Do you get it?”</p><p>“I get it.”</p><p>“Are you sure?”</p><p>“I’m sure.”</p><p>“Listen, Aerie, I talked to Dahlia and she told me . . .”</p><p>He tells me he told Dahlia and River about what happened between us and that Dahlia told him what happened to me after that summer with Levi. I tell him about Madeline, about my call to Brett, about my fears concerning him and his ex-girlfriend, and about my fear of things I can’t control sending me into a state of depression. We talk for almost an hour and he eases my fears. Jagger has a way that calms me.</p><p>“Why didn’t you go for your final test today?” I finally ask.</p><p>“You know why.”</p><p>“I do and I want you to play that role so I got you a second chance.”</p><p>He shrugs off my attempt to reschedule his audition, but I insist that when Brett calls him, he go in.</p><p>“Shh . . . no more talking about the movie,” he says. Then he slides his hands down my arms to lace in my fingers. “I think we have other things we can talk about.”</p><p>“Like what?” I breathe over his lips, my body already flushing in anticipation of what’s to come.</p><p>With a sexy smoldering grin, he says, “Tell me what you want.” Even before I answer, his fingers move under my silk blouse and make their way to my br**sts.</p><p>Without any hesitation I tell him. “I want you to make love to me.”</p><p>“What else?” he asks.</p><p>“I want you to make me come over and over.”</p><p>“I can do that,” he says with an upward tilt of his lips.</p><p>Once we’re both naked, his mouth finds my slick flesh and he proceeds to do just that. We spend the night making love. And with our rhythm never faltering . . . we find our own perfect harmony.</p><p>Epilogue</p><p>Where the Story Ends</p><p>“Let’s keep this game moving!” River yells to Jagger.</p><p>“I’m trying, brother, but you have to stop passing the f**king ball to Dahlia. She’s not on our team.” Jagger bends with his hands on his knees and pauses to regain his breath. I grin at his adoption of my uncle’s terminology and when he notices my stare he shoots me a wink.</p><p>It’s a beautiful breezy Sunday morning at Pan Pacific Park in LA. Concrete pathways stretch all around us like gray ribbons that can only lead to more exciting places to explore. Tying my shoelace, I glance around—a playground with children shouting and running, trees that go on forever, providing miles of shade in case the sun gets too hot, flowers blooming with their heady scent filling the air. As I stand, I breathe in deeply, enjoying the beauty that surrounds me on this glorious spring day and try not to laugh at myself about the situation I have agreed to.</p><p>When Jagger promised to take me to a basketball game, what he didn’t tell me was that it wouldn’t be indoors and that I’d be playing in it. I knew River and Dahlia came to the park every now and then to shoot hoops. They had planned on it today, but almost canceled because Dahlia woke up not feeling well again. I’m not worried about her—morning sickness passes quickly.</p><p>Jagger was beyond excited when River called back and said the game was on, that Dahlia was feeling better. He looked over at me and said, “It’s time to introduce you to a game I grew up with.”</p><p>He had moved in with me instead of getting his own place, since he stayed at my house all the time anyway, it made sense. He also got the lead role in the movie No Led Zeppelin. Unfortunately, Jules landed the female lead. Jagger wanted to turn the role down when he learned who was playing Victoria, but I insisted he take it. I’m mature enough to know I can handle the fact that what I see is fiction, not reality—or at least I hope I’m mature enough to not slip an “eat me” cake or “drink me” poison into her dressing room.</p><p>A tall woman with long dark hair singles me out and pulls my mind back into the game. “Do you have next?”</p><p>I shrug my shoulders, having no idea what she’s talking about.</p><p>Dahlia calls out. “Yeah.” Then she draws a circle around the five of us standing near what I now know is called the foul line. “We all do.”</p><p>“No problem,” she says, and I sense a bit of rejection as she walks away.</p><p>River and Dahlia are both captains so they are on opposite teams. Dahlia selected her players first and she stupidly picked me. River snatched up Jagger immediately. The two of them are so competitive it makes me laugh. I don’t know any of the other people here and I don’t think River and Dahlia do, either, but they’re all here for a friendly co-ed game of what I now know as pickup basketball.</p><p>Jagger ran through the basics on our way here. I got the gist of it, but instead of watching the ball, I’ve been gawking at him. Right now as he strips his faded black hoody off and cocks his baseball hat to the side, he couldn’t look more disheveled. And with his black track pants hanging low and his thin white T-shirt rumpling in the wind, I couldn’t be more turned on.</p><p>“Watch out, man,” Jagger calls when a guy with multiple tattoos runs into me.</p><p>I have no idea what I’m doing on the court. I’ve been watching Dahlia, who has this thing down. She was guarding some girl who must be at least six foot tall and called out something about the 3-point line and other words I didn’t know, when I run into my teammate and we both fall to the ground.</p><p>“Hey, man, lace’em up or get off the blacktop,” Jagger mutters, pointing at the guy’s sneakers. He lends a hand and hoists me to my feet. My cute black sweatsuit isn’t any worse for the wear and I brush my hands against the soft velour of the pants.</p><p>“You okay?” he asks while shooting a dirty look at the guy who has apologized to me twice already.</p><p>“I’m fine.” I giggle. “This is actually fun.”</p><p>Then he looks at the guy next to me and extends his hand, giving him a hoist up—all’s good.</p><p>Jagger twists back toward me and his gray eyes swirl as they zero in on me. “I knew I’d get you to like basketball.”</p><p>Popping up on my toes, I kiss him softly. “You were right.”</p><p>“You didn’t just seriously stop play for that,” River yells.</p><p>“Je t’aime,” Jagger whispers in my ear. He shrugs at River and kisses me one last time before sprinting toward the goal line.</p><p>I love you, too, I think to myself. And as he steals the ball from River and dribbles down the court, I watch him in the same dazed state I’ve been in since the first time I laid eyes on him and think . . . if Alice hadn’t been curious she’d have never fallen, so I’ll lean forward every time because I know he’s the one who will be there to catch me.</p>  </body></html>"]