["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> Prologue</p><p>Andrew</p><p>New York City is nothing more than a shit-filled wasteland, a dump where failures are forced to drop all their broken dreams and leave them far behind. The flashing lights that shined brightly years ago have lost their luster, and that fresh feeling that once permeated the air—that hopefulness, is long gone.</p><p>Every person I once considered a friend is now an enemy, and the word “trust” has been ripped from my vocabulary. My name and reputation are tarnished thanks to the press, and after reading the headline that The New York Times ran this morning, I’ve decided that tonight will be the last night I ever spend here.</p> <p>I can’t deal with the cold sweats and nightmares that jerk me out of my sleep anymore, and as hard as I try to pretend like my heart hasn’t been obliterated, I doubt that the agonizing ache in my chest will ever go away.</p><p>To properly say goodbye, I’ve ordered the best entrées from all my favorite restaurants, watched Death of a Salesman on Broadway, and smoked a Cuban cigar on the Brooklyn Bridge. I’ve also booked the penthouse suite at the Waldorf Astoria, where I’m now leaning back on the bed and threading my fingers through a woman’s hair—groaning as she slides her mouth over my cock.</p><p>Teasingly darting her tongue around my tip, she whispers, “Do you like this?” as she looks up at me.</p><p>I don’t answer. I push her head down and exhale as she presses her lips against my balls, as she covers my c**k with her hands and moves them up and down.</p><p>Over the past two hours, I’ve f**ked her against the wall, forced her to bend over a chair, and pinned her legs to the mattress while I devoured her pu**y.</p> <p>It’s been quite fulfilling—fun, but I know this feeling will only last for so long; it never stays. In less than a week, I’ll have to find someone else.</p><p>As she takes me deeper and deeper into her mouth, I tightly tug her hair—tensing as she bobs her head up and down. Pleasure begins to course its way through me, and the muscles in my legs stiffen—forcing me to let go and warn her to pull away.</p><p>She ignores me.</p><p>She grips my knees and sucks faster, letting my c**k touch the back of her throat. I give her one last chance to move away, but since her lips remain wrapped around me, she leaves me no choice but to cum in her mouth.</p><p>And then she swallows.</p><p>Every. Last. Drop.</p> <p>Impressive...</p><p>Finally pulling away, she licks her lips and leans back against the floor.</p><p>“That was my first time swallowing,” she says. “I did that just for you.”</p><p>“You shouldn’t have.” I stand and zip my pants. “You should’ve saved it for someone else.”</p><p>“Right. Well, um...Do you want to order some dinner? Maybe we could eat it over HBO and go at it again afterwards?”</p><p>I raise my eyebrow, confused.</p><p>This is always the most annoying part, the part when the woman who previously agreed to “One dinner. One night. No repeats.” wants to establish some type of imaginary connection. For whatever reason, she feels like there needs to be some type of closure conversation, some bland reassurance that’ll confirm that what just happened was ‘more than sex,’ and we’ll become friends.</p><p>But it was just sex, and I’m not in need of any friends. Not now, not ever.</p> <p>“No, thank you.” I walk over to the mirror on the other side of the room. “I have someplace to be.”</p><p>“At three in the morning? I mean, if you just want to skip the HBO and go for another round instead, I can...”</p><p>I tune out her irritating voice and begin to button my shirt. I’ve never spent the night with a woman I met online, and she isn’t going to be the first.</p><p>As I adjust my tie, I look down and spot a tattered pink wallet on the dresser. Picking it up, I flip it open and run my fingers across the name that’s printed onto her license: Sarah Tate.</p><p>Even though I’ve only known this woman for a week, she’s always answered to “Samantha.” She’s also told me—repeatedly, that she works as a nurse at Grace Hospital. Judging by the Wal-Mart employee card that’s hiding behind her license, I’m assuming that part isn’t true either.</p><p>I look over my shoulder, where she’s now sprawled across the bed’s silk sheets. Her creamy colored skin is unmarred and smooth; her bow shaped lips are slightly swollen and puffy.</p><p>Her green eyes meet mine and she slowly sits up, spreading her legs further apart, whispering, “You know you want to stay. Stay...”</p><p>My c**k starts to harden—it’s definitely up for another round, but seeing her real name has ruined any chance of that for me. I can’t stand to be around anyone who’s lied to me, even if she does have double D tits and a mouth from heaven.</p><p>I toss the wallet into her lap. “You told me your name was Samantha.”</p><p>“Okay. And?”</p><p>“Your name is Sarah.”</p><p>“So what?” She shrugs, beckoning me with her hand. “I never give my real name to men I meet on the internet.”</p><p>“You just f**k them in five star hotel suites?”</p><p>“Why do you suddenly care about my real name?”</p><p>“I don’t.” I glance at my watch. “Are you spending the night in this room or do I need to give you cab money to get home?”</p><p>“What?”</p><p>“Was my question unclear?”</p><p>“Wow...Just, wow...” She shakes her head. “How much longer do you think you’ll be able to keep doing this?”</p><p>“Keep doing what?”</p><p>“Chatting someone up for a week, f**king her, and moving on to the next. How much longer?”</p><p>“Until my dick stops working.” I put on my jacket. “Do you need cab fare or are you staying? Check out is at noon.”</p><p>“Do you know that men like you—relationship avoiders, are the type that typically fall the hardest?”</p><p>“Did they teach you that at Wal-Mart?”</p><p>“Just because someone from your past hurt you doesn’t mean that every woman after her will.” She purses her lips. “That’s probably why you are the way you are. Maybe if you tried to actually date someone you’d be a lot happier. You should take her out for dinner and actually listen, see her to her door without expecting an invitation inside, and maybe bypass the whole ‘let’s go f**k’ in the hotel suite thing at the end.”</p><p>Where are my keys? I need to go. Now.</p><p>“I can see it now...” She can’t seem to shut up. “You’re going to want more than sex one day, and the person you want it from is going to be someone you least expect. Someone who will force you to give in.”</p><p>I pull my keys from underneath her crumpled dress and sigh. “Do you need cab money?”</p><p>“I have my own car, dick-face.” She rolls her eyes. “Are you really this incapable of having a regular conversation? Would it kill you to talk to me for a few minutes after sex?”</p><p>“We have nothing more to discuss.” I put my room key on the nightstand and walk toward the door. “It was very nice meeting you, Samantha, Sarah. Whatever the hell your name is. Have a great night.”</p><p>“Screw you!”</p><p>“Three times was more than enough. No, thank you.”</p><p>“Things are going to catch up to you one day, ass**le!” She yells as I step into the hallway. “Karma is one hell of a bitch!”</p><p>“I know.” I toss back. “I f**ked her two weeks ago...”</p><p>Contract (n.):</p><p>An agreement between two people that creates an obligation to do or not do a particular action.</p><p>Andrew</p><p>Six years later...</p><p>Durham, North Carolina</p><p>The woman who was currently sitting across from me was a f**king liar.</p><p>Dressed in an ugly ass grey sweater and a red plaid skirt, her hair looked as if it’d been dyed with a box of crayons. She looked nothing like the woman in the picture online, nothing like the smiling blonde with C-cup br**sts, butterfly tattoos, and plump, pink lips.</p><p>Before I’d agreed to this date, I’d specifically asked for three separate proof of truth pictures: one of her holding a newspaper with the most recent date on it, one of her biting her lip, and one of her holding up a sign with her name on it. When I requested these things, she’d laughed and said that I was “the most paranoid person ever,” but she’d done them. Or so I thought. With the exception of telling her my real name—I stopped giving out my real name years ago, I’d been completely honest and I expected that in return.</p><p>“Well, now that we’re alone...” She suddenly smiled, revealing a mouth full of metal and rubber bands. “It’s nice to finally meet you in person, Thoreau. How are you today?”</p><p>I didn’t have time for this. “Who’s the girl in your profile picture?” I asked.</p><p>“What?”</p><p>“Who is the girl in your profile picture?”</p><p>“Oh...Well, that isn’t me.”</p><p>“No shit it isn’t you.” I rolled my eyes. “Did you hire a model? Buy a bunch of stock images and use Photoshop?”</p><p>“Not exactly.” She lowered her voice. “I just thought you’d be more likely to talk to me if I used that photo instead of my own.”</p><p>I looked her over again, now noticing the strange unicorn tattoo across her knuckles and the “Love is blind” quote that was inked onto her wrist.</p><p>“What were you expecting to happen when we actually met?” This shit was boggling my mind. “Did you think about what would happen when that day came? When I realized that you weren’t who you said you were?”</p><p>“I was kind of expecting for you to have lied about your picture too,” she said. “I didn’t know that you would really look like you, you know? This is the first time a guy on Date-Match has told the truth. I think it’s a sign.”</p><p>“It’s not.” I shook my head. “And the model? How did you get someone to take all those pictures?”</p><p>“It wasn’t a model. It was my roommate.” Her eyes widened as I stood up. “Wait a second! All the things I said to you on the phone were absolutely true. I am interested in politics, and I do love studying the law and keeping up with high profile cases.”</p><p>“What law school did you go to?”</p><p>“Law school?” She raised her eyebrow. “No, not law school type of law. Law like, I’ve watched every episode of SVU and I’ve read all of John Grisham’s books.”</p><p>I sighed and pulled a few bills out of my wallet, putting them on the table. I’d wasted enough time with her.</p><p>“Goodbye, Charlotte.” I walked away, ignoring the rest of her apology.</p><p>The moment the valet pulled my car around, I slipped inside and sped off.</p><p>This shit is getting ridiculous...</p><p>This was the sixth time this had happened to me this month, and I didn’t understand why someone would willingly lie with a potential face to face meeting on the line. It didn’t make any f**king sense.</p><p>Annoyed, I picked up a bottle of scotch from the store across the street, and made a mental note to block this latest liar from my page. I was starting to feel like I’d run out of available women to sleep with in Durham. I was also starting to feel like I needed to switch cities and start all over again; the cold sweats from years ago had returned, and I knew the nightmares were coming next.</p><p>As soon as I stepped into my condo, I poured myself three shots and tossed them back. Then I poured three more.</p><p>I scrolled through my phone and checked my emails for the day—client referrals, more requests to chat from Date-Match, and a message from the sexy blonde I was supposed to meet this Saturday.</p><p>The subject-line read, “Honesty is Key, right?”</p><p>I tossed back another shot before opening it, hoping it was an invitation to meet tonight instead.</p><p>It wasn’t. It was a goddamn essay.</p><p>“Hey, Thoreau. I know we’re supposed to meet each other this Saturday and trust me, I was sooo looking forward to it, but I need to know that you’re interested in me for me and not my looks. I’ve met a lot of creepy guys on here because they just like my picture, and when we meet, they just want to have sex. I can assure you that I am who I say I am, but I’m looking for something a little more fulfilling than casual sex. We don’t have to have a full blown relationship, or engage in an intense affair, but we could at least build a friendship first, you know? I’m looking forward to seeing you, so let me know if you’re still interested in meeting me—Liz.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I immediately clicked on my profile and opened the “What I’m Looking For” box, making sure that it still read the same: “Casual sex. Nothing more. Nothing Less.”</p><p>That line wasn’t there for decoration, and it was in bold print for a reason.</p><p>I returned to the woman’s message and responded. “I am no longer interested in meeting you. Best of luck finding whatever you’re looking for –Thoreau.”</p><p>“Are you for real?” She replied instantly. “You can’t use another friend? We can’t be ‘just friends’?—Liz.”</p> <p>“Hell no—Thoreau.” I signed off and blocked her address.</p><p>Another shot made its way down my throat, and I scrolled through the remaining emails—immediately opening the one that came from the only person I considered a friend in this city. Alyssa.</p><p>Subject: Desert Dick</p><p>So, I’m emailing you right now because I just thought about how much pain you’re in currently...We haven’t talked about you getting laid in quite a while, and that concerns me. Greatly. Like, I’ve CRIED about your lack of pu**y...I’m very sorry that so many women have sent you fraudulent pictures and given you a severe case of blue balls. I’m attaching the links to a top of the line lotion that I think you should invest in for the weeks to come.</p><p>Your dick is in my prayers,</p> <p>—Alyssa.</p><p>I smiled and typed a response.</p><p>Subject: Re: Desert Dick</p><p>Thank you for your concerns about my dick. Although, seeing as though you’ve NEVER discussed getting laid, I think having Cobweb Pussy is a far more serious illness. Yes, it is true that so many women have sent me pictures, but it’s quite sad that you’ve never sent me yours, isn’t it? I’m more than willing to send you mine, and eventually help you cure your sad and unfortunate disease.</p><p>Thank you for telling me that my dick is in your prayers.</p><p>I’d prefer if it was in your mouth.</p> <p>—Thoreau.</p><p>Just like that, my night was now ten times better. Even though I’d never met Alyssa in person and our conversations were restricted to phone calls, emails, and text messages, I felt a strong connection to her.</p><p>We’d met through an anonymous and exclusive social network—LawyerChat. There were no profile pictures, no newsfeed activity, only message boards. There was a small profile box where information could be placed (first name only, age, number of years practiced, high or low profile status), and a logo on each user’s profile that revealed his or her sex.</p><p>Every user was “guaranteed” to be a lawyer who’d been personally invited via email. According to the site’s developers, they’d “cross-referenced every practicing lawyer in the state of North Carolina against the board’s licensing records to ensure a unique and one of a kind support system.”</p><p>I honestly thought the network was bullshit, and if it weren’t for the fact that I’d f**ked a few of the women I’d met on there, I would’ve cancelled my account after the first month.</p><p>Nonetheless, when I saw a new “Need Some Advice” message from an “Alyssa,” I couldn’t resist trying to replicate my previous results. I read through her profile first—twenty seven, one year out of law school, book lover—and decided to go for it.</p><p>My intent was to answer her legal questions, slowly steer the conversation to more personal things, and then ask her to join Date-Match so I could see what she looked like. But she wasn’t like the other women.</p><p>She sent me constant messages, and she always kept the topic of conversation professional. Since she was such a young and inexperienced lawyer, she asked for advice on the simplest topics: legal brief editing, claim filing, and exhibition of evidence. After we’d chatted five times and I’d grown tired of having three hour long info-dump sessions, I asked for her phone number.</p> <p>She said no.</p><p>“Why not?” I’d typed.</p><p>“Because it’s against the rules.”</p><p>“I’ve never met a lawyer that hasn’t broken at least one.”</p><p>“Then you’re not a very good lawyer. I’ll find someone else to chat with now. Thanks.”</p><p>“You’re going to lose that case tomorrow.” I typed before she could end our session. “You have no idea what you’re doing.”</p><p>“Are you really that upset about me not giving you my phone number? What are you, twelve?”</p><p>“Thirty two, and I don’t give a f**k about your phone number. I was only asking for it so I could call and tell you that the brief you sent me is littered with typos, and the closing argument reads like a first year law student wrote it. There are too many mistakes for me to sit here and type them all.”</p><p>“My brief isn’t that bad.”</p><p>“It’s not that good either.” Before I could sign out of our chat, her phone number appeared on the screen, and underneath it was a short paragraph: “If you’re going to call and help me, fine. If you’re using my number to talk me into joining a dating site later, then forget it. I joined this network for career support, that’s it.”</p><p>I stared at her message long and hard—debating whether I should help her with no chance of getting anything out of it, but something made me call her anyway. I walked her through every mistake she’d made, insisted that she clear up a few sentences, and even re-formatted her brief.</p><p>Just when I was about to tell her goodbye and hang up, the strangest thing happened. She asked, “How was your day today?”</p><p>“That’s not in your brief.” I said. “You only want to talk about lawyer shit, remember?”</p><p>“I can’t change my mind?”</p><p>“No. Hang up.” I waited to hear a beep, but the only thing I heard was laughter. If it wasn’t for the fact that it was such a raspy and sexy sound, I would’ve hung up myself, but I couldn’t put the phone down.</p><p>“I’m sorry,” she said, still laughing. “I didn’t mean to offend you.”</p><p>“You didn’t. Hang up.”</p><p>“I don’t want to.” She finally stopped laughing. “I apologize for that hostile message I sent you...You’re actually the only guy I’ve met on here who answers all my questions. Are you busy right now? Can you talk?”</p><p>“About what?”</p><p>“About yourself, your life...I’ve been asking you boring legal questions every day, and you’ve been very patient so...It’s only fair that we talk about something less boring for once if we’re going to be friends, right?”</p><p>Friends?</p><p>I was hesitant to respond—especially since it didn’t seem like the ‘less boring’ topics would involve sex, and she’d said the word “friends” so easily. Yet, I was in the middle of another sex-less night already, so I began to have a regular conversation with her. Until five in the morning, she and I discussed the most mundane things—our daily lives, favorite books, her dream of becoming a late, professional ballerina.</p><p>A few days later, we spoke again, and after a month, I was talking to her every other day.</p><p>Tossing back another shot, I pressed the call button on my phone and waited to hear her soft voice.</p><p>No answer. I considered sending her a text, but then I realized it was nine o’ clock on a Wednesday and we wouldn’t be able to talk at all tonight.</p><p>Practice...Wednesday nights are always ballet practice...</p><p>“Mr. Hamilton?” My secretary stepped into my office the next morning.</p><p>“Yes, Jessica?”</p><p>“Mr. Greenwood and Mr. Bach would like to know if you want to participate in the next round of intern interviews today.”</p><p>“I don’t.”</p><p>“Okay...” She looked down and scribbled something onto her notepad. “Did you at least look over the resumes then? They have to narrow it down to fifteen today.”</p><p>I sighed and pulled out the stack of resumes she’d given me last week. I’d read through them all and written notes, mostly—“Pass” “Double Pass” and “I don’t feel like reading this.” All the remaining applicants were from Duke University, and to my knowledge, we were the only firm in the city who accepted pre-law and law school applicants for paid internships.</p><p>“I wasn’t impressed with any of the applicants.” I slid the papers across my desk. “Was that the entire selection pool?”</p><p>“No, sir.” She walked over and placed an even larger stack in front of me. “This is the entire selection pool. Do you need me to do anything else for you this morning?”</p><p>“Besides getting my coffee?” I pointed to the empty mug at the edge of my desk. I hated that I always had to remind her to bring it; I couldn’t function in the morning without a fresh cup.</p><p>“I’m so sorry. I’ll get that right away.”</p><p>I turned on my computer and scrolled through my emails, sorting them all by importance. Of course, Alyssa’s latest email was pushed straight to the top.</p><p>Subject: Get Over Yourself.</p><p>Thank you for the childish picture text of the white dust that was outside your condo this morning. I really appreciated it, but I can assure you that that is NOT what the inside of my vagina looks like right now.</p><p>Not that it’s any of your business, but I don’t need to get laid every other day to satisfy my needs. They are WELL taken care of with a VARIETY of tools.</p><p>—Alyssa</p><p>Subject: Re: Get Over Yourself.</p><p>I sent you two pictures. One of the white dust and one of a dried up lake with dying animals. Was the second picture more accurate?</p><p>The only tool your pu**y needs is my tongue. It’s here whenever you want it, and it works in a “VARIETY” of ways.</p><p>—Thoreau</p><p>“Here you are, Mr. Hamilton.” Jessica suddenly set my coffee on the desk. “Can I ask you something?”</p><p>“No, you may not.”</p><p>“I thought so,” she said, lowering her voice and looking into my eyes. “I know this is a bit unprofessional, but I need a date for the gala next month.</p><p>“Then find a date for the gala next month.”</p><p>“That was my way of asking you to be my date...”</p><p>I blinked. I needed to find a way to word this “Hell no” very carefully.</p><p>Jessica was fresh out of college—way too damn young for me, working here because her grandfather started this firm, and looking for much more than I’d ever be willing to give. I’d overheard her several times on her lunch breaks, talking about how she wanted to be married before she turned twenty five. She also apparently wanted to be a stay-at-home mom with six kids, and live in a house in the suburbs.</p><p>In other words, she was completely out of her f**king mind.</p><p>“So, what do you say?” She smiled.</p><p>I tried not to roll my eyes. “Jessica...”</p><p>“Yes?” Her eyes were full of hope.</p><p>“Look, sweetheart. Not only would it be highly inappropriate for the two of us to ever engage in any type of relationship outside of this office, but I’m not the man you’re looking for. At all. Trust me.”</p><p>“Not even for one night?”</p><p>“The words ‘one night’ in my book hold certain expectations that you couldn’t possibly meet. So, no. Go do some work.”</p><p>“Is ‘one night’ a code for sex?”</p><p>“Why are you still in my office?”</p><p>“I wouldn’t tell anyone if we had sex,” she whispered. “I’ve actually fantasized about it since we first met. And, since you never have any calls on the books from a girlfriend, I’m assuming you’re available.”</p><p>“I’m not.”</p><p>“I walked in on you while you were in the restroom once... You’re at least nine inches I think.”</p><p>What the f**k?!</p><p>I was five seconds away from recording this conversation on my phone and emailing it to her grandfather. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m really good at giving blowjobs,” she said. “I’ve been doing it since high school. All the guys I’ve blown have said my mouth is amazing.” She bit her lip.</p><p>“Is there super-glue on my floor? Is that why you’re still standing there?”</p><p>“If you were my date to the gala and we ended up having a good time, you’d be the first man I’d actually went all the way with.” She blurted out, blushing. “I’m still a virgin, down there.”</p><p>“Then I’m definitely not the man for you.” I rolled my eyes. “Now, leave before I call Mr. Greenwood and tell him that his precious granddaughter is offering to suck my dick over morning coffee.”</p> <p>Shocked, her cheeks tinged red and she quickly walked to the door. Then she looked over her shoulder and winked at me—fucking winked at me, before stepping out.</p><p>I immediately typed a note into my planner: Find a new secretary—an older, married one...</p><p>Before I could finish organizing my inbox, my cell phone rang. Alyssa.</p><p>“I’m busy,” I answered.</p><p>“Then why did you pick up the phone?”</p> <p>“Because the sound of my voice makes you wet.”</p><p>“Funny.” She laughed. “How’s your morning?”</p><p>“Typical. My secretary just came onto me for the third time this month.”</p><p>“She sent you another ‘You and me belong together’ note with chocolates?”</p><p>“No, she offered to suck my dick.”</p><p>“What?” She gasped. ”You’re kidding!”</p> <p>“Unfortunately not. After that, she told me she was willing to give me her virginity. Needless to say, I’ll be posting a replacement ad pretty soon. Anyone from your office want to work for a better firm? I’ll double the salary.”</p><p>“How do you know that my firm isn’t better than yours?”</p><p>“Because you call and ask me for advice on cases all the time—silly cases at that. If your firm was better, you’d never have to ask.”</p><p>“Whatever.” She groaned. “Have you bucked off the online dating wagon yet?”</p><p>“Bucked? Wagon?” I could never understand her little Southern metaphors. “What the hell does that mean?”</p><p>“Ugh, god...” She sighed. “It means you didn’t update me about your date last night so I guess it was a bust, which means you haven’t slept with anyone in over a month. That has to be a record for you.”</p><p>“It is.”</p><p>“Do you want some advice?”</p> <p>“Not unless you want to come to my office and tell me in person.” I smiled.</p><p>“No, thanks. Speaking of advice, I’ll need your help Friday night.”</p><p>“With what?”</p><p>“I just landed a pretty big case. I haven’t gone through all the documents yet, but I already know I’m in over my head.”</p><p>I leaned back in my chair. “If it’s that big of a case, you could bring the documents to my condo tonight. I’d be happy to help you sort through them. Categorization has always been my specialty.”</p><p>“Ha! Nice try, but I don’t think so.” She continued to talk about her case, but I was only halfway listening. It still struck me as odd that she didn’t want to meet me in person, that she shut down the very thought any time I brought it up.</p><p>“Also...” She was still rambling. “I’ll probably have to do some research on those changes. I’m not sure if—”</p><p>“Tell me the real reason why I can’t meet you in person.” I cut her off.</p><p>“What?”</p><p>“We’ve known each other for six months now. Why don’t you want to meet?”</p><p>Silence.</p><p>“Do I need to repeat the question?” I stood up and walked over to my door, locking it. “Did you not understand me?”</p><p>“It’s against the LawyerChat rules...”</p><p>“Fuck LawyerChat.” I rolled my eyes. “It’s against the rules for you and me to have each other’s phone numbers in the first place, for us to act like f**king teenagers and make each other cum over the phone at night, but you’ve never complained about that.”</p><p>“You’ve never made me cum...”</p><p>“Don’t lie to me.”</p><p>“You haven’t.”</p><p>“So, last week when I said that I wanted you to ride my mouth so I could eat your pu**y until you came all over my lips, you were pretending to breathe hard?”</p><p>She sucked in a breath. “No, but—”</p><p>“I thought so. Why can’t we meet in person?”</p><p>“Because it would ruin our friendship and you know it.”</p><p>“I don’t.”</p><p>“You’ve told me that you never sleep with the same woman twice, that after you sleep with someone you’re done with her.”</p><p>“I’ve never f**ked one of my friends before.”</p><p>“That’s because I’m your only one.”</p><p>“I’m aware, but—” I stopped. I had no defense for that.</p><p>Silence lingered over the line, and I tried to think of another argument.</p><p>She spoke up first. “I honestly don’t want to ruin our friendship over one senseless f**k.”</p><p>“I guarantee we’ll have more than one senseless f**k.”</p><p>Her light, airy laugh drifted over the line, and I sighed—attempting to envision what she looked like. I wasn’t sure why, but over the past few weeks, I’d been longing to experience her laughter face to face.</p><p>“You know,” she went on, “for a high profile lawyer, you have a pretty dirty mouth.”</p><p>“You’d be surprised how much filthier it can get.”</p><p>“Filthier than what I’ve already experienced?”</p><p>“Much filthier.” I’d been treading the waters since we began this friendship—still hopeful that we’d meet in person someday, but now that we weren’t, there was no point in holding back. “I guess I’ll talk to you tonight.”</p><p>“Not unless you find another date between now and then. I know you’ll be searching.”</p><p>“Of course I’ll be searching.” I scoffed. “Is Alyssa your real name?”</p><p>“Yes, but I’m sure Thoreau isn’t yours. Do you care to finally give it to me?”</p><p>“I’ll give it to you when you come to your f**king senses and let me see you.”</p><p>“You just won’t let that go, will you?” She laughed again. “What if the real reason I don’t want to meet you is because I’m ugly?”</p><p>“I have a good feeling that you’re not.”</p><p>“But if I was?”</p><p>“I’d f**k you with the lights off.”</p><p>“I prefer the lights on.”</p><p>“Then I’d make you wear a paper bag over your head.”</p><p>“WHAT?!” She burst into giggles. “You’re ridiculous! Ugh, there’s a client at my door right now. I have to go. Can I call you later?”</p><p>“Always.” I hung up, smiling. Then it hit me.</p><p>Fuck...She always finds a way out of that line of questioning...</p><p>Perjury (n.):</p><p>The willful giving of false testimony under oath.</p><p>Alyssa (Well, my real name is “Aubrey”...)</p><p>“Lies always catch up to people in the end. Why don’t people understand that?” That’s what Thoreau’s text message said this morning.</p><p>“You don’t think some lies are justifiable?” I texted back.</p><p>“No. Never.”</p><p>I hesitated. “So, you’ve never lied to me?”</p><p>“Why would I?”</p><p>“Because we barely know each other...”</p><p>“Only because you keep me at a distance.” He sent me another text before I could respond. “Would you like to know my real name and where I work?”</p><p>“I prefer our anonymous arrangement.”</p><p>“Of course you do, and I’ve never lied to you. I trust you for some strange reason.”</p><p>“Some strange reason?”</p><p>“Very strange. I’ll talk to you later.”</p><p>I tossed my phone into my purse and sighed, letting that familiar feeling of guilt wash over me. I’d never meant to continue talking to him, to become his friend outside of LawyerChat, but I was in too deep, and I didn’t want to let him go.</p><p>Months ago, when I’d spotted the invitation to the exclusive network on my mother’s desk, I swore to only use it when I needed to ask questions for my pre-law classes. I’d used her access code to log in, built a fake profile, and made sure all the questions I asked were weaved in a way that no one would know that they were for homework assignments.</p><p>Unfortunately for me, the pre-law program at Duke was unlike any other program in the country. It consisted of more hands-on classes, one-on-one mentoring from practicing lawyers, and it was mandated that each student find an internship for the final four semesters. In addition to that, they expected us to read through and interpret case files like we were already lawyers.</p><p>If I had known that asking Thoreau for so much homework advice would lead to an actual friendship, I might have stopped talking to him sooner. Then again, just like I was his only friend, he was my only friend, too.</p><p>He was open and honest every time we spoke, and I only wished that I could be the same—especially since he seemed to have a habit of saying, “I hate f**king liars” whenever one of his dates deceived him.</p><p>Damnit...</p><p>Smoothing the tulle fabric of my tutu, I took several deep breaths; I could think about my friendship with Thoreau later, right now I needed to focus.</p><p>Today was audition day for a production of Swan Lake and I was a nervous wreck; I’d barely slept the night before, skipped breakfast, and showed up to the theater five hours early.</p><p>“Please clear the stage, ladies and gentlemen!” The director shouted from below. “The official auditions will begin in thirty minutes! Please clear the stage and make your way to the wings!”</p><p>Before heading backstage, I looked out into the audience. Most of the faces were familiar—my classmates, instructors, a few directors from the ballet company I’d worked for last summer, but the faces I needed to see weren’t there.</p><p>They never were.</p><p>Hurt, I found a corner in the dressing room and called my mother.</p><p>“Hello?” she answered on the first ring.</p><p>“Why aren’t you here?”</p><p>“Why aren’t I where, Aubrey? What are you talking about now?” She let out an exasperated sigh.</p><p>“My open audition for Swan Lake. You promised that you and dad were coming.”</p><p>“It’s Aubrey, honey!” She yelled to my dad in the background. “Your recital was today?”</p><p>“I haven’t been in a recital since I was thirteen.” I gritted my teeth. “This is an audition, a once in a lifetime audition, and you’re supposed to be here.”</p><p>“I guess my secretary forgot to tell me about it this morning,” she said. “Have you landed any internships for your major yet?”</p><p>“I have two majors.”</p><p>“Pre-law, Aubrey.”</p><p>“No.” I sighed.</p><p>“Well, why not? Do you think one is just going to fall from the sky and land in your lap? Is that it?”</p><p>“I had an interview yesterday at Blaine and Associates,” I said, feeling my heart grow heavier by the second, “and I have another one next week at Greenwood, Bach, and Hamilton. I’m also about to audition for the role of a lifetime if you’d like to pretend to give a f**k for five seconds.”</p><p>“Excuse me, young lady?”</p><p>“You’re not here.” There were tears in my eyes. “You’re not here...Do you know how huge this production is going to be?”</p><p>“Are you getting paid? Is the New York Ballet Company running it?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s not the point. I’ve told you over and over how important this audition is to me. I called and reminded you last night, and it would be really nice if my parents showed up and believed in me for a change.”</p><p>“Aubrey...” She sighed. “I do believe in you. I always have, but I’m in the middle of a huge hearing right now and you know that because it’s all over the papers. You also know that becoming a professional ballerina is not a stable career choice, and as much as I would love to leave my high-paying client to watch you tiptoe around on stage—”</p><p>“It’s called dancing en pointe.”</p><p>“Same thing,” she said. “Regardless, it’s just an audition. I’m sure your father and I won’t be the only parents who couldn’t make it today. Once you graduate from college and get into law school, you’ll see ballet for what it really is—a hobby, and you’ll be grateful that we pushed you into double majoring.”</p> <p>“Ballet is my dream, mother.”</p><p>“It’s a phase, and you’re way past the prime age for becoming a professional last time I checked. Remember how you suddenly up and quit at sixteen? You’ll quit again, and it’ll be for the best. As a matter of fact—”</p><p>I hung up.</p><p>I didn’t want to listen to another one of her dream-killing speeches, and it angered me that she’d called ballet a “phase” when I’d been dancing since I was six years old. When she and my dad had poured countless dollars into private classes, costumes, and competitions.</p><p>The only reason why I’d “quit” at sixteen was because I’d broken my foot and couldn’t audition for any of the dance schools anymore. And the only reason I started to show the faintest interest in law was because I couldn’t do much outside of my rehab sessions except read.</p> <p>My heart had always belonged in pointe slippers, and that fact would never change.</p><p>“Aubrey Everhart?” A man suddenly called my name from the theater door. “Is that you?”</p><p>“Yes.”</p><p>“You’re next to take the stage. Got about five minutes.”</p><p>“Be right there...” I stuffed my bag into a locker. Before I could close it, my phone rang.</p><p>Knowing it was my mother calling to offer a half-assed apology, I tried my best not to scream. “Please spare me your apologies.” I immediately picked up. “They don’t mean anything to me anymore.”</p> <p>“I was calling to tell you good luck,” a deep voice said.</p><p>“Two minutes!” A stagehand glared at me and motioned for me to head onto the stage.</p><p>“Thoreau?” I turned my back to the stagehand. “What are you telling me good luck for?”</p><p>“You mentioned having some type of audition weeks ago. It’s today, right?”</p><p>“Yes, thank you...”</p><p>“You don’t sound too excited about your dream right now.”</p><p>“How can I be when my own parents don’t believe in it?”</p><p>“You’re twenty seven years old.” He scoffed. “Fuck your parents.”</p> <p>I laughed, guiltily. “I wish it was that simple...”</p><p>“It really is. You make your own money, and despite the fact that you don’t really know shit about the law, you seem to be a pretty decent lawyer. Fuck them.”</p><p>“I’ll keep that in mind,” I said, trying to steer that subject away. “I’m shocked you remembered that my audition was today.”</p><p>“I didn’t.” He hung up, and I knew he was smiling as he did that.</p><p>“Fifteen seconds, Miss Everhart!” The stagehand grabbed my arm and practically pulled me onto the stage.</p><p>I smiled at the judges and stood in fifth position—arms over my head, and waited for the first note of Tchaikovsky’s composition to play.</p><p>There was a rustling of papers, a few coughs from someone in the audience, and then the music began.</p><p>I was supposed to demonstrate an arabesque, a pirouette, and then perform the routine that I’d been rehearsing in class for the past month and a half. I didn’t feel like it, though, and since this was one of my last opportunities to make an impression, I decided to dance how I wanted.</p><p>I shut my eyes and completed pirouette after pirouette, fouette turn after fouette turn. I wasn’t even on beat with the music, and I could tell the pianist was confused and trying to keep up with me.</p><p>I demonstrated every jump I knew, perfectly landing each one of them, and when the pianist gave up and struck the last note, I returned to fifth position—smiling.</p><p>There was no applause, no cheers, nothing. I tried to read the judges’ faces to see if they looked mildly impressed, but they were stoic.</p><p>“That will be all, Miss Everhart,” one of them said. “Will Miss Leighton Reynolds please take the stage?”</p><p>I murmured “Thank you” before stepping off and rushing out of the theater. I didn’t bother watching the rest of the auditions.</p><p>For the remainder of the afternoon, I walked around campus and tried not to cry. When I was sure that no tears would fall, I sent emails to Thoreau; that was the only thing that could possibly make me feel better.</p><p>Subject: Thinking...</p><p>“One dinner. One night. No repeats.” Do you pick a cheap or expensive restaurant? Do you pay for the dinner and the hotel room? Or do you make the woman split it with you?</p><p>—Alyssa.</p><p>Subject: Re: Thinking...</p><p>Expensive dinner. Five star hotel suite. I pay for everything.</p><p>Would you like me to book a few reservations for us so I can show you?</p><p>—Thoreau.</p><p>Subject: Re: Re: Thinking...</p><p>Of course not. And a “few” reservations? What happened to just one?</p><p>Subject: Re: Re: Re: Thinking...</p><p>I told you I’d make an exception in your case. I invested in a box of paper bags today.</p><p>—Thoreau</p><p>I laughed and looked at my watch. It was five o’ clock and I was sure the results for the production had been posted hours ago, but I was too scared to look. All I wanted was a chance to be a member of the swan corps, or even an understudy for the lead.</p><p>Why did I f**k up that routine? What the hell was I thinking?</p><p>After driving myself crazy with questions, I forced myself to make the trek back to the dance theater to look at the final cast posting. When I arrived, there was a huge crowd in front of the sign, and I could hear the usual “I’m in! I’m in!” and “How could they not pick me?” revelations.</p><p>I squeezed my way through everyone and squinted at the sheet, looking for my name on the minor cast sheet but it wasn’t there.</p><p>It was on the major cast sheet, and right next to the lead role of Odette/Odile, the white and black swan, was my full name in bold.</p><p>I burst into tears, jumping up and down in disbelief. I wanted to call my mom and tell her the good news, but my heart suddenly sank at the thought.</p><p>I knew that at this very moment, she was probably telling my father that I’d hung up in her face, and that he needed to make sure I knew the strings behind them paying for my education: “If you drop pre-law, we’ll stop writing the checks...Pre-law pays for your classes, ballet doesn’t.”</p><p>I lifted my aching feet out of a bucket of ice and patted them dry with a towel. I wasn’t sure how I was going to juggle a leading role, classes, and a potential internship, but I didn’t have a choice.</p><p>Sighing, I glanced at the calendar on my desk where I’d scribbled “Interview prep day” in today’s slot.</p><p>My upcoming interview with Greenwood, Bach, and Hamilton—one of the most prestigious firms in the state, was more than just an interview. It was a process, and every intern-seeking student knew that landing an internship at that firm could do wonders for a resume.</p><p>The firm was so selective that they conducted four rounds of phone interviews, three online tests, and required each applicant to complete several essays before the final interview with the partners.</p><p>I’d soared through the phone interviews and the exams, but the essays— regarding hundred paged case files, were something that I hadn’t expected. I’d even thought they’d sent me the wrong packet so I called to say, “I believe my packet was switched with the law-school level intern application.” The secretary simply laughed at me.</p><p>She’d said the firm expected all of its interns—law school level and undergraduate level, to fill out the same packet to the best of their ability.</p><p>“Don’t worry,” she’d said. “We’re not expecting perfection from you. We just want to see how your mind works.”</p><p>I grabbed the case file that was giving me the most trouble and placed it into my lap. Then I went to the GBH firm’s website and familiarized myself with the three partners who would be interviewing me.</p><p>Greenwood, the founder of the firm, was a salt and pepper haired man with wiry framed glasses. He touted Harvard as his reason for being so demanding and thorough, and boasted that in his thirty years of practicing the law, he’d attained one of the highest victory rates in the country.</p><p>Bach, partner of the firm for over ten years, was a bald man in his early forties, though he looked a bit older. He’d worked his way up through the firm, and since he was “such a hardworking individual with unparalleled passion,” Greenwood had no choice but to make him his first partner. He had one of the second highest victory rates in the country.</p><p>Last was Hamilton—Andrew Hamilton, and he was...He was sexy as f**k. I tried to focus on his biography and ignore his picture, but I couldn’t help it. His deep and piercing blue eyes were staring right at me, and his short, dark brown hair was begging my hands to run through it.</p><p>He had the face of a Greek God—evenly tanned, perfectly symmetrical, strong and chiseled jawline, and his full lips were curved into a slight smirk.</p><p>Even though the picture only showed the top part of his body, I imagined that by the way he filled out his navy blue suit that there were hard and defined muscles underneath it.</p><p>I was getting wet just looking at him.</p><p>Focus, Aubrey...Focus...</p><p>Strangely, his bio was the shortest one of them all. It didn’t list his education, his background, or the year he became partner. It was just a bunch of filler words about how “the firm was so honored to have such an esteemed and proven lawyer” on their team. Oh, and he enjoyed eating chocolate.</p><p>How informative...</p><p>I copied and pasted all of their bios into a word document, and then I called Thoreau.</p><p>“Good evening, Alyssa,” he answered, making me melt with his voice as usual. I swore he could talk me into doing anything—almost anything.</p><p>“Hey, um...”</p><p>“Yes?”</p><p>God, I loved his f**king voice... He hadn’t said much of anything and I was already turned on.</p><p>“You called so I could listen to you breathe?” He had to be smiling.</p><p>“I did, actually.” I rolled my eyes. “Are you enjoying my sounds?”</p><p>“I’d enjoy them a lot better if you were underneath me.”</p><p>I blushed. “Um...”</p><p>“The case, Alyssa.” He laughed. “Tell me about your latest case.”</p><p>“Right, um...” I cleared my throat. “Long story short: My client carried a gun into a federal bank and forgot to turn on the safety lock. Someone bumped into him and his hands instinctively went to his pocket, and the gun fired—shooting him in the leg.”</p><p>“Since when do you practice criminal law? I thought your specialty was corporate.”</p><p>Shit... “It is, it is. I’m taking this case for a friend, pro bono.”</p><p>“Hmmm. Well, your friend is looking at two to five years in a federal prison if he doesn’t have any priors. What part of this do you need help with exactly?”</p><p>“The pleading part. He didn’t hurt anyone but himself.”</p><p>“Did he have a license to carry?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No...” I looked through my notes.</p><p>“Then I’m sure the prosecution will convince the jury that he carried that gun into the bank with the intent to harm someone other than himself. Take whatever deal they offer.”</p><p>“Well, I...” I looked at what the assignment sheet said. “What if I already rejected that deal?”</p><p>He sighed. “Call the prosecution and try to get it back. If they say no, plead no contest.”</p> <p>“No contest? Are you out of your mind?”</p><p>“Are you? What type of corporate lawyer agrees to take an open and shut criminal case? A fairly inexperienced one at that...”</p><p>“For your information, it’s an assign—” I coughed. “Never mind. Telling me to plead no contest is pretty much the same thing as telling me to plead guilty.”</p><p>“If that was the case, I would have said plead guilty.” He sounded annoyed. “No contest is your client’s best option, and any real lawyer would know that. Are you sure you passed the bar exam?”</p><p>“I wouldn’t have been invited to join LawyerChat if I hadn’t, would I?” I felt my heart ache with that lie. “I’m just trying to avoid my client being sentenced to prison.”</p> <p>“Then you really should stick to corporate law.” There was a smile in his voice. “Your client is going to prison and there’s nothing you can do about it. The only negotiable thing about his case is how long he’ll spend there. Anything else I can help you with? Do I need to lecture you on the difference between guilty and not guilty?”</p><p>I rolled my eyes and put the file away. “Thank you for your condescending help as always.”</p><p>“My pleasure,” he said. “I need to ask you something important.”</p><p>“About my case?”</p><p>“No.” He let out a low laugh. “What do you look like?”</p><p>“What?” I could barely hear my voice. “What did you say?”</p> <p>“You heard me. Since I may never get a chance to see you, I’d like to know. What do you look like?”</p><p>I stood up and walked over to my mirror, letting my eyes roam over my reflection. “I’m not sure how I’m supposed to answer that...” I needed to change the subject, fast. From everything he’d told me about his dates over the past few months, he definitely had a type he liked best, a type that intrigued him like no other: Blonde, slightly curvy, full lips...</p><p>Me.</p><p>I’d tried to envision what he looked like plenty of times. Dark haired, maybe? Dirty blond? A mouth made for kissing with deep green eyes? Six pack, no, eight pack that leads down to a lick-able V?</p><p>He does mention working out every day...</p><p>I was more than certain that he was attractive—he had to be if so many women put up with him on those dating sites, but each time my mind drew a picture, I’d convince myself that I had him all wrong.</p><p>“You know what?” I said, snapping out of my thoughts. “I’ve never been good at describing things. What do you look like?”</p><p>“I look like a man who wants to f**k you.”</p> <p>Tingles ran up and down my spine. “That’s not a description...”</p><p>“What color is your hair?” He didn’t sound amused, and I knew he wasn’t going to let me direct the conversation tonight.</p><p>“Red.” I yanked the band from around my bun and let the blond strands fall to my shoulders.</p><p>“How long is it?”</p><p>“It’s short...”</p><p>“Hmmm. What about your eyes?”</p><p>I stared at my blue and grey irises. “Green, light green.”</p><p>“Do you have freckles?”</p><p>“No.” At least that part was true.</p><p>“And your lips?”</p><p>“You want to know how thin or thick they are?”</p><p>“I want to know how they’d look wrapped around my cock.”</p><p>I gasped.</p><p>“Are you playing shy tonight?” Ice cubes clinked against a glass in his background. “How much of my c**k do you think you could take into your mouth?”</p><p>I remained silent, and my breathing began to slow.</p><p>“Alyssa?” His voice was soft. “Are you going to answer me?”</p><p>“It’s hard to make a prediction about something you’ve never done.” I heard him inhale a deep breath, and the line went completely silent.</p><p>I thought he’d ask me how I’d managed to have sex with boyfriends in the past without ever giving a blowjob, but he didn’t.</p><p>“Hmmm. Are you a natural redhead?”</p><p>“What does it matter?” I moved over to my bed. “I’m clearly not your type.”</p><p>“I have a preference, not a type, and a smart mouthed redhead who’s never had another man’s c**k in her mouth is more than worthy of an exception.”</p><p>I hooked a thumb underneath my panties and peeled them off before slipping under the sheets. “Too bad I’m not a full blown virgin, huh?”</p><p>“I don’t f**k virgins.” He paused. “But considering the fact that you and I have never f**ked, you might as well be one.”</p><p>Wetness slipped down my thighs, and I felt my ni**les hardening. “I highly doubt—”</p><p>“I’m tired of only being able to talk to you on the phone, Alyssa...”</p><p>Silence.</p><p>“I need to see you...” His voice was strained. “I need to f**k you...”</p><p>“Thoreau...”</p><p>“No, listen to me.” His tone was a warning. “I need to be buried deep inside of you, feeling your pu**y throb around my c**k as you scream my name—my real name.”</p><p>A hand trailed down past my stomach and between my thighs, and my fingers began to strum my clit. Slow at first, then faster, faster with every sound of his heavy breaths in my ear.</p><p>“I’ve been very patient with you...” His voice trailed off. “Don’t you think?”</p><p>“No...”</p><p>“I have,” he said. “I’m tired of imagining how wet your pu**y can get, how loudly you’ll scream when I suck your tits as you ride me...How hard I’ll pull your hair when I bend you over my desk and f**k you until you can’t breathe...Tired.”</p><p>I shut my eyes, letting my other hand squeeze my breast, letting my thumb pinch my nipple.</p><p>“I’m giving you two weeks to come to your f**king senses...”</p><p>“What?”</p><p>“Two weeks,” he whispered. “That’s when you and I are going to meet face to face, and I’m going to claim every inch of you.”</p><p>“I can’t...I can’t agree to...that.”</p><p>“You will.” His breathing was now in sync with mine. “And the second you do, you’re going to invite me over and I’m going to remind you of everything you’ve teased me with over the past six months.”</p><p>I was speechless. My clit was swelling with each rub of my finger, and my breaths were getting shorter and shorter.</p><p>“I’ll be gentle at first,” he whispered, “especially when I slide my c**k into your mouth and pull on your hair, showing you exactly how I like it to be sucked.”</p><p>“Stop...” I was panting. “Please...Stop...”</p><p>“Trust me, I won’t.”</p><p>“Thoreau...” My legs were trembling.</p><p>“I can’t just talk to you anymore. I need to feel you, I need to taste you. Say yes to two weeks...”</p><p>I bit my lip, knowing that if he said it again, if he asked me one more time, I would say yes.</p><p>“Alyssa...” He was begging.</p><p>I was seconds away from coming, seconds away from screaming “Yes! Yes! Yes!”</p><p>“Promise me you’ll let me f**k you in two weeks...”</p><p>As if my mouth was under his command, it freed my bottom lip and prepared to say yes, but I hung up.</p><p>Keeping my eyes shut, I lay in bed and let the waves of an orgasm roll through me as I screamed the three yeses he couldn’t hear. When I finally stopped shaking, I rolled over and grabbed a pillow, pulling it to my chest.</p><p>Before I could force myself to sleep, I heard my phone ringing beneath me.</p><p>It was a text from Thoreau. “I’ll take that as a yes. Fourteen days.”</p><p>Burden of Proof (n.):</p><p>The obligation to prove or disprove a disputed fact.</p><p>Andrew</p><p>“Did I tell you that I landed the leading role for that ballet I auditioned for?” Alyssa said to me the next morning.</p><p>I’d been talking to her since I arrived at work, but I’d made no mention of the fact that she’d hung up in my face last night; I was going to punish her for that later. Severely.</p><p>Thirteen days...</p><p>“Did I tell you about it?” she asked again.</p><p>“No, and if you’re not going to tell me when and where the show is, then I don’t care.”</p><p>“Oh, wow.” She laughed. “You’re mad about last night, aren’t you?”</p><p>“Furious.”</p><p>“Because I hung up?”</p><p>“Because I know you screamed yes when you came, and you hung up because you didn’t want me to hear it.”</p><p>She was silent, and I was about to say something else, but Jessica suddenly stepped into my office, smiling at me.</p><p>“Hold on one second.” I put my phone against my chest. “Yes, Jessica?”</p><p>“The final interviews are going to start in twenty minutes. They need you in the conference room now.”</p><p>“I’ll get there when I get there.” I acted as if the kiss she was now blowing me wasn’t happening, and waited until she closed the door. “I’ll have to call you back later, Alyssa. I have a meeting.”</p><p>“Must be bad timing for both of us. I have a meeting, too.”</p><p>“Your doomed gunshot client?”</p><p>“No, something much worse. An intern interview.”</p><p>“Must be in the air then.” I sighed as I slipped into my jacket. “I have to sit through a few of them myself, unfortunately.”</p><p>“Any advice you want to share?”</p><p>“Try to look like you’re actually paying attention while they answer the questions, and make sure your cell phone is fully charged so you can get on the internet.”</p><p>“Not for me.” She laughed. “For the interns. Something I should say if one of them is nervous.”</p><p>“Oh.” I shrugged. “Tell them my motto.”</p><p>“And what motto would that be?”</p><p>“It is what it is.”</p><p>“Why do I ever ask you anything?”</p><p>“Because I always tell you the truth.” I hung up.</p><p>“Mr. Hamilton?” Jessica stepped into my office again. “They want you to look over the files before they begin.”</p><p>“I’m right behind you.” I followed her into the conference room, where Will Greenwood and George Bach were waiting, and I sat next to them.</p><p>“Good to see you out of your office today, Andrew.” Will laughed.</p><p>“Yeah,” George added. “Thank you for bestowing your presence upon us this afternoon. We know how much you love being sociable.”</p><p>I rolled my eyes. “Why do the three of us need to conduct intern interviews? What’s the purpose of having an HR department if the partners do their job for them?”</p><p>“This is a family, Andrew.” Mr. Greenwood spoke sternly. “Whether it’s an intern, the secretary, or the young man who stays overnight and cleans this office, I want everyone to feel like they’re a part of a huge family. Don’t you?”</p><p>“I’m not answering that,” I said. “How many are we picking this year?”</p><p>“Not too many.” Will slid me a folder. “We have our top five picks. We just need to narrow it down to three. Two from law school, one from pre-law. We’ll add two more next semester.”</p><p>“Hmmm.” I pulled out the applications and pretended to pay attention as the two of them went over each applicant’s achievements. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Okay, Jessica!” Will pressed the intercom button. “You can send in the first applicant!”</p><p>When the door opened, I expected to see the usual plainly dressed stiff with a wooden smile, but the woman who stepped inside was far from that. Dressed in a light grey dress that clung to her hips and a pair of nude high heels, she was one of the sexiest women I’d ever seen; I couldn’t take my eyes off her.</p><p>Her eyes were a deep ocean blue that matched the sapphire necklace hanging around her neck. Her hair was pulled into a low ponytail—the loose strands slightly grazed her br**sts, and her lips—her bright pink, f**k-able lips, seemed to be mouthing words of some kind.</p><p>I have no idea what you’re saying...</p> <p>As I was noticing the pink bra strap that had slipped from underneath her dress and onto her bare shoulder, her stunning eyes met mine. I raised my eyebrow and she blushed. Then she immediately turned away, looking at my partners.</p><p>“Welcome to GBH, Miss Everhart,” George said. “We’re happy that you’re here for an interview, but as you know we can only select one undergraduate intern for our program at this time.”</p><p>“I understand, sir.” Her eyes met mine again, and my c**k twitched.</p><p>I tried to stop the images that were flooding my brain, images of me bending this woman over the table, f**king her against my office wall, and tying her hands above her head and torturing her with my tongue all night, but they wouldn’t stop. Each image dissolved into another one, and before I knew it, I’d visually undressed her and there was no one in this room but the two of us.</p><p>What the hell is wrong with me? Attracted to a prospective intern? An UNDERGRADUATE intern?</p> <p>“Well, let’s get started then.” George interrupted my thoughts. “Mr. Hamilton, would you care to start with the first question?”</p><p>“Not particularly,” I said, trying to ignore the fact that Miss Everhart was smoothing her dress over her thighs.</p><p>He nudged me under the table and whispered under his breath, “Family, Andrew...Family.”</p><p>I rolled my eyes. “Why do you want to be a lawyer, Miss Everhart?”</p><p>“I enjoy screwing people over,” she said. “I figure I might as well get paid for it.”</p><p>My lips curved into a smile, and George and Will laughed.</p> <p>“In all seriousness, gentlemen,” she continued, “I come from a large family of lawyers and judges; it’s what I’ve known my whole life. I know the justice system is far from perfect, but nothing makes me happier than seeing it at its best. There’s no greater feeling than working for the good of society.”</p><p>“Good answer,” Will said. “Now, we’re going to ask you a series of questions regarding the real-world case study packets that we mailed you. Were you able to complete everything?”</p><p>“Yes, sir.”</p><p>“Great. Question number one: Your client walks into a federal bank with a loaded gun in his pocket. Upon being brushed by a stranger, the gun fires—shooting him in the leg. Regarding the charges that the prosecution filed, how would you have your client plead?”</p><p>“What?” I looked over at him. “Could you repeat that question, Will?”</p><p>“The prompt?”</p><p>“Whatever you just asked.”</p><p>He nodded and happily repeated it, putting extra emphasis on the crime of walking into a bank with a loaded firearm.</p> <p>My mind immediately flashed back to the conversation I’d had with Alyssa last night.</p><p>I smiled, thinking that maybe Alyssa’s “friend” was a headline story in the local news, that maybe I could figure out who she was without her telling me. I pulled out my phone and held it underneath the conference table, googling “Man shoots himself in federal bank. North Carolina.”</p><p>Nothing relevant appeared.</p><p>Hmmm...</p><p>“How would you make him plead, Miss Everhart?” Will asked again.</p><p>“No contest,” she said quickly.</p><p>“No contest?” He sounded slightly impressed. “Why so?”</p><p>“He doesn’t have a license to carry, so I’m sure the prosecution will try to make it seem like he carried that gun into the bank for a reason. Regardless of if he only hurt himself, he’s looking at a prison sentence, so we could bypass the trial and try to limit it to the lowest terms possible.”</p><p>I blinked, refusing to believe that her answer was anything more than a coincidence. As a matter of fact, as soon as she started to further explain her logic, I knew that it was; only a student would start talking about “emotional appeal” right after a no contest plea.</p><p>As Will and George continued to pepper her with questions, I googled variations of that federal gun case. “Man fires gun in bank.” “No contest plea in federal bank case.” “Man injures himself in bank shooting.”</p><p>Still, nothing.</p><p>“Miss Everhart, are there any lawyers that you wish to model your own career after?” Greg asked.</p><p>“Yes, actually,” she said. “I’ve always admired the career of Liam Henderson.”</p><p>“Liam Henderson?” I raised my eyebrow. “Who is that?” Usually, interviewees named a federal judge, a well-known prosecutor, or a familiar district attorney. But an unknown? Never.</p><p>“Well, he made history as the youngest lawyer to ever uncover a government conspiracy, and he—”</p><p>I tuned out her answer. I’d just thought of another phrase to google.</p><p>“Interesting choice, Miss Everhart,” Will said. “Do you have any current mentors in the law profession besides your family members?”</p><p>“I do.”</p><p>“Are you in close contact with this mentor? If so, how often?”</p><p>“We talk almost every day, so I’d like to think that we’re close.”</p><p>Why isn’t this case popping up? If it’s a “federal” bank shooting, it should be plastered all over the papers...</p><p>“Would your mentor be able to speak to us, or send a letter regarding your character?” Will was definitely impressed with this woman, and she had this job. The second set of questions he had yet to ask weren’t really necessary.</p><p>“I’m sure I could ask him to do that if need be,” she said just as I was starting a new web search.</p><p>“Great. So, tell us, what’s the last bit of advice that your mentor gave you?”</p><p>I looked at my watch. As soon as today’s interviews were over, I was going to call Alyssa about this case. Maybe she’d fudged some of the details to continue shrouding her identity.</p><p>“When I told him I was nervous about my interview today,” Miss Everhart said softly, “he told me, it is what it is.”</p><p>My head immediately shot up.</p><p>“Did he now?” George clutched his chest, laughing. “That sounds like something our Andrew would say!” He patted me on the shoulder. “Isn’t that right, Andrew?”</p><p>“Yes.” I narrowed my eyes at ‘Miss Everhart.’ “That sounds exactly like something I would say...”</p><p>She tucked a loose strand of hair behind her ear. “I’ll be sure to tell my mentor that someone actually enjoys his odd sense of humor.”</p><p>“Please do.” I watched as she answered the next questions with ease, as she barely blinked her big blue eyes when the questions became tougher. And the more I heard her talk, the more I heard the familiarities of her speech pattern, I had to force myself not to f**king lose it.</p><p>One coincidence was fine, but two? Damn near unfathomable.</p><p>As they asked her about her favorite inspirational quotes, I scrolled down to Alyssa’s number and dialed. I knew for a fact that she never silenced her phone for some strange reason, and I had to know if what I was thinking was true, or if my mind was playing a cruel joke on me.</p><p>I could see the rings on my phone’s screen, see the seconds as they passed, and when it rang three times, I let out a huge sigh of relief. But then the sound of bell chimes filled the room.</p><p>“I am so sorry.” Miss Everhart’s cheeks turned pink and she picked up her purse. “I have a weird thing about never putting this on silent...I really meant to leave it in my car.” She pulled out her phone, slightly smiling once she looked at the screen, and then she hit ignore.</p><p>WHAT. THE. FUCK!</p><p>“Happens all the time.” Will laughed. “We were going on and on anyway. It’s a good thing it went off so we can close out with the final questions. Anything from you, Andrew?”</p><p>I glared at ‘Alyssa’. I was confused, pissed, and unfortunately aroused all at once.</p><p>“Andrew?”</p><p>“No,” I said, noticing that she was blushing again. “I have absolutely nothing to say.”</p><p>Will and Greg both stood up and smiled, reaching out to shake her hand, but I remained seated.</p><p>I couldn’t believe this shit.</p><p>She wasn’t a green-eyed redhead like she’d said over the phone, far from being a licensed lawyer, and she was a f**king liar...</p><p>“Mr. Hamilton?” She was standing in front of me with her hand outstretched. “Thank you for interviewing me today. It was an absolute pleasure meeting you.”</p><p>“The pleasure’s all mine.” I shook her hand, trying my best to ignore the smooth softness of her touch. “Good luck.”</p><p>She nodded, said goodbye to the three of us once more, and then she left the room.</p><p>As Will and George discussed how impressed they were with her interview, I forced myself to look through her file.</p><p>Double major student at Duke: Pre-law and Ballet. Perfect 4.0 GPA. Recently cast as the lead of Swan Lake, recently listed in the top ten percent of her class. There were ten letters of recommendation in her folder—all from impeccable lawyers; there was even one from the newly appointed assistant district attorney.</p><p>As amazing as her personal accomplishments were, it was her birthdate that stood out to me the most. She was twenty two.</p><p>Twenty f**king two.</p><p>And, even though she was the most accomplished out of all the undergraduates, she wasn’t even a senior.</p><p>She was a junior...</p><p>I ignored Alyssa’s text tonight, the one that read, “If you haven’t found another unfortunate date for tonight, call me when you see this.”</p><p>I was too angry to say anything to her. After all the hours we’d spent on the phone, all the times that I’d told her that I hated liars, she’d lied to me. Repeatedly.</p><p>I’d wanted to vote no for her employment, but I couldn’t bring myself to do it. Once we’d finished with the last interview of the day, the decision on the top pick was unanimous: Aubrey Everhart.</p><p>Yet, while they frenziedly weighed the pros and cons of the other applicants, I sat there in a daze—angry with myself for not seeing through all of Aubrey’s lies earlier.</p><p>In the six months that we’d spoken, she’d always asked questions that were a little too simple, questions that sometimes made me wonder, but I never thought twice about it. She’d mentioned Duke University a few times, but she never talked about it for long and she always made it seem as if she’d graduated from there. But her constant talk of how she wanted her parents’ approval and had conflicted feelings between choosing dance and the law should have been a dead ass giveaway.</p><p>At this point, I wasn’t sure which lie to be more upset about: The fact that she wasn’t a lawyer, the fact that she was still in college, or the fact that she’d lied about her physical appearance.</p><p>Pouring my sixth shot of the night, I realized that that last lie—although irrelevant in the grand scheme of things, was the one that hit me the hardest. She was definitely my ‘type,’ and the second she walked into that interview I wanted her, before I found out who she really was, before I found out her age.</p><p>Tossing back a shot, I heard my phone ringing. Her.</p><p>I rolled my eyes and let it sit on the table. I grabbed one of my last Cuban cigars and stepped out onto my balcony. I needed to think. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sky was starless tonight—nearly pitch black, and the moon was hiding underneath a curtain of dark clouds. As much as I didn’t want to admit it, tonight’s sky bore a horrid resemblance to a certain night that occurred six years ago.</p><p>It was the night my life changed forever, the night that left me broken, shattered, and numb. All because of lies—a series of heartbreaking and inconceivable lies.</p><p>I tried hard to prevent myself from picturing the memories, but I could still hear that strained, ragged voice in my head: “Andrew...You have to help me...You have to get me out of here...Please... Save me, Andrew...”</p><p>I shook my head and blocked out the rest of that memory. Unlike six years ago, I was in control of this situation, and “Alyssa” lying to me meant that our friendship was over, done.</p> <p>There was no justification for what she’d done, but before I cut her off, I needed to make her pay for lying to me, and I needed to figure out how.</p><p>Conviction (n.):</p><p>A judgment of guilt against a criminal defendant.</p><p>Andrew</p><p>“Mr. Hamilton?” Aubrey set my coffee down on my desk two weeks later. I’d personally insisted that she work as my intern, even though looking at her made me angry.</p> <p>I’d made a point not to say too much around her, to refrain from staring at her too long, and I couldn’t help being crueler than ever—dismissive even. I made her responsible for my daily coffee, demanded that she re-do every assignment at least three times, and whenever she asked for my help, I answered her with a detached “Figure it out yourself.”</p><p>She never seemed upset or offended by my harshness, which made me even angrier. I’d thought that by having her work for me and seeing her crack under pressure that my attraction to her would fade, but it only intensified each time I saw her face.</p><p>Especially today.</p><p>As I pulled my coffee closer, I noticed that her ni**les were poking through her thin, beige dress, and it was so tight that I could see the imprint of lace panties.</p><p>Fuck...</p><p>“Mr. Hamilton?” she asked again.</p> <p>“Yes, Miss Everhart?”</p><p>“I have an important rehearsal for a ballet I’m a part of, so I was wondering...” She looked absolutely nervous. “Can I go home early today?”</p><p>“No.”</p><p>She sighed. “I really need to be at this rehearsal...It’s at the Grand Hall.”</p><p>“So?”</p><p>“So,” she said, clearing her throat, “with all due respect, Mr. Hamilton, this is a pretty big deal for me. The Grand Hall is usually reserved for performances, so for them to open it and let us use it for a rehearsal is—”</p><p>I wasn’t listening, and as much as I wanted to look at my work again and make it clear that she was being ignored, I couldn’t. I was too busy staring at the contours of her mouth.</p><p>“That’s a fact.” She was still talking for some reason. “I think I’ve made very valid points, and since I’m not asking for too much, you should agree to let me go.”</p> <p>“Get back to work, Miss Everhart.”</p><p>“Mr. Hamilton, please—”</p><p>“Get. Back. To. Work.” I glared at her, daring her to let another word slip out of her seductive mouth. “I don’t care about your personal life. I pay you for twenty five hours a week, so you’ll work twenty five hours a week, and you’ll work them when I say you’ll work them. So, get back to your cubicle.”</p><p>She stared at me for a few seconds, and I couldn’t help but notice tears welling in her eyes.</p><p>“You can take that box of Kleenex with you on your way out,” I said.</p><p>Shaking her head, she stepped back and headed for the door. “I’m going to ask Mr. Bach if I can leave early. No disrespect to you.”</p><p>“Excuse me?” I stood up. “What did you just say?”</p><p>She continued to walk toward the door, the sound of her heels clicking faster and faster. Before she could turn the knob, I spun her around and slammed my hand against the door.</p><p>“I’m not a fan of insubordination, Miss Everhart.”</p><p>“You won’t have to worry about that anymore.” Her face was red, twisted in anger. ““I’m going to ask Mr. Bach to move me with someone else because I refuse to work with you anymore.”</p><p>“Good luck with that. No one else wanted you. Only me.”</p><p>“I highly doubt that.” She tried to move away, but I grabbed her hands and pinned them above her head.</p><p>“I was the best interviewee and you f**king know it.” She hissed. “And since we both know that’s a fact, I don’t have to put up with your shit anymore.” She looked as if she wanted to spit in my face. “You are a cruel, cold, and condescending ass**le, and I haven’t learned shit from you; I doubt I ever will.”</p><p>“Watch your goddamn mouth. I’m still your boss.”</p><p>“You were my boss.”</p><p>I tightened my grasp around her wrists and looked directly into her eyes, pressing my chest against her br**sts. “Let me tell you what’s about to happen, Aubrey. You’re going to go back to your cubicle and you’re going to stay there until you’re done for the day—only getting up to bring me a new cup of coffee. You will tell your ballet director that you’ll come after you get your work done, and you will not go to Mr. Bach and say anything, because we don’t reassign interns just because they cry.”</p><p>“Then I guess there’s a first time for everything.” She threw my glares right back at me, narrowing her eyes as her chest heaved up and down.</p><p>“Aubrey—”</p><p>“Let me go before I scream, Mr. Hamilton. I wasn’t listening to a thing you just said so I highly suggest—”</p><p>I crashed my lips against hers, effectively making her shut the hell up. I kept my hands tightly clamped around her wrists, pressing her body against the door with my hips.</p><p>She murmured as I slipped my tongue into her mouth, as I bit her bottom lip as hard as I could. Without thinking, I let her hands go and gripped her waist—pulling her taut against me as my hand found its way underneath her skirt.</p><p>I slid my hand across the crotch of her panties, tapping my fingers against the lace, and then I slowly pushed them to the side and plunged a finger deep into her pu**y.</p><p>“Ahhh...” she moaned, making me bite her lip again, making me use two fingers instead of one.</p><p>She was wet—soaking wet, and as much as I wanted to f**k her senseless against my door and make her forget her name, I tore my mouth away from her.</p><p>“Get the hell out of my office.”</p><p>“What?” She asked breathlessly, her eyes widening in surprise.</p><p>“Go to your important rehearsal.”</p><p>“Mr. Ham—”</p><p>“Hurry up before I change my mind.” I reached around her and opened the door. “Go.”</p><p>She didn’t hesitate to walk past me, and as soon as she was gone I knew damn well this arrangement wasn’t going to work for too much longer. Either she was going to be reassigned or I was going to have to fire her, fast.</p><p>Hours later, when I was halfway through my work for the day, I noticed I’d received a new text from Alyssa. I rolled my eyes and changed her name to Aubrey before reading it.</p><p>“Where have you been for the past two weeks?” it said. “Are you okay? I’ve called and texted you and you haven’t said anything. I’m really concerned...If you get this, say something, anything. ”</p><p>I didn’t want to respond, but with the taste of her mouth still lingering on my lips, I gave in. “I’m fine. Just made a major discovery not too long ago and I’ve been trying to figure out how to deal with it.”</p><p>“Is it something serious?”</p><p>“VERY serious.”</p><p>“I’m sorry...Want to know something that will make you feel better?”</p><p>“I doubt anything you say can do that right now.”</p><p>“Want to bet?”</p><p>“Try me.”</p><p>“My boss just kissed the shit out of me. I think that’s why he’s so damn mean to me; he wants to f**k me...”</p><p>“I really don’t think your ‘boss’ wants to f**k you...”</p><p>“He definitely does. His c**k was rock hard when he was kissing me, and he was biting my lips and gripping me like he wanted to own me... I’ve never been so wet in my life...”</p><p>I hesitated. “How exactly is this supposed to make me feel better?”</p><p>“I was pretending he was you the whole time. I miss you.”</p><p>I immediately turned off my phone. I didn’t know what type of shit she was trying to pull, but I wasn’t falling for it.</p><p>“I was pretending it was you? I miss you?” Bullshit.</p><p>I wasn’t going to answer her calls or her messages for a long time. Sexy ass mouth or not.</p><p>Cross Examination (n.):</p><p>The interrogation of a witness called by one’s opponent.</p><p>Aubrey</p><p>I couldn’t stop thinking about the way Mr. Hamilton kissed me the other day, the way he pulled me against his chest and f**ked my lips with his mouth.</p><p>Thoughts of him kissing me had been invading my mind all day, and even now, when I was setting down his latest cup of coffee, I was tempted to walk behind his desk and dare him to kiss me again. Ever since I’d become his intern, he’d been quite mean to me—reckless, but I thought it was a training technique, a way to see if I’d quit under pressure.</p><p>Until he kissed me that day.</p><p>There was something intangible in his kiss; unspoken words, a repressed desire. It made me think that the glances he often tossed my way, those looks of scorn that were laced with wanting, meant a little more.</p><p>I placed a plastic stirrer into his cup and cleared my throat. “Do you need anything else, Mr. Hamilton?”</p><p>No answer.</p><p>I stood my ground and waited for him to look up at me; I wanted to see his face.</p><p>The suit he was wearing today—a dark grey three piece with a silver silk tie, made him look even more devastatingly beautiful than he normally did.</p><p>“Is there a problem, Miss Everhart?” He clenched his fists above the desk, trying his best to act like my presence wasn’t bothering him. But it was, I could tell.</p><p>I knew he would look up at any moment, so I stepped back, making sure the light blue dress I wore specifically for him would be in full view, but he kept his gaze lowered.</p><p>“No, sir.”</p><p>“Then get out of my office. I’ll need your Brownstein report with my next cup of coffee. Four o’ clock.”</p><p>“You just gave me that report yesterday. You said I could take all the time I needed.”</p><p>“You must’ve misheard me. You can take all the time you need today. Things change instantly around here, and that’s the exact reason why some of us never leave early. Four o’ clock.”</p><p>I stood there completely speechless. There was no way I’d be able to read and summarize a three hundred paged report by the end of the day.</p><p>“Did you lose some of your hearing between today and yesterday?” He finally looked up, his perfect face expressionless. “I need complete silence when I work and I can’t focus with your heavy breathing.” He narrowed his eyes at me. “Get out, finish the report, and bring it back to me with my coffee. If you don’t, you’re fired.”</p><p>I quickly decided that he was bipolar, and that our seemingly connected kiss was just a mistake. I turned around and left his office, rushing straight to the break room.</p><p>There was no way I was going to get that Brownstein report done by the end of the day.</p><p>I pulled out my phone and scrolled through my messages—realizing that Thoreau hadn’t responded to my morning texts. Sighing, I decided to call him. I needed someone to tell me that my life wouldn’t end today when I was fired.</p><p>It rang once.</p><p>It rang twice.</p><p>It went to voicemail.</p><p>He hit ignore?! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sent him a text. “What the hell is wrong with you lately? Is your lack of sex forcing you to act like a jerk toward me? Is the withdrawal THAT BAD? Talk to me.”</p><p>I waited for a response, but none came, so I slumped onto the couch. There was no point in even attempting to finish that report. I was just going to sit here, relax, and when it was five o’ clock I was going to collect all of my things and leave.</p><p>I could find another internship in two weeks, or worst case, ask the department chair if I could shadow my mother and father around their stuffy firm for credit.</p><p>Ugh...God...</p> <p>I shut my eyes and lay back against the cushion, wishing I could fall asleep.</p><p>“Aubrey?” Someone shook my shoulder just as I was drifting away.</p><p>“Yes?” I opened my eyes. It was Jessica.</p><p>“I’ve been looking for you forever. Mr. Hamilton wants to speak with you.”</p><p>I raised my eyebrow. “More coffee?”</p> <p>“Probably.” She shrugged. “He’s been a bit off lately. Just come on, you don’t want to make him angry.” She held the door open and I stood up, making my way past her.</p><p>I debated whether I should even go to his office. Then again, seeing the look on his face as I said, “Fuck you. I quit.” was too good of an experience to pass up. I forced a smile and knocked on his door.</p><p>“Come in.” His voice was stern.</p><p>I slipped inside, expecting to see him holding an empty coffee cup, but he was sitting at his desk–glaring at me.</p><p>“Have a seat,” he said.</p><p>I sat in front of his desk, waiting for him to scold me about something, to unleash more of his seemingly bipolar tendencies, but he didn’t. He just kept staring at me.</p> <p>I hated the effect he was having on my body right now, and as much as I wanted to ask him what the hell he wanted, I couldn’t get my mouth to say a thing.</p><p>Without addressing me, he suddenly stood up and walked around his desk, sitting on the edge of it, letting his knees touch mine.</p><p>“Lawyers are supposed to be people with integrity, are they not?” he whispered.</p><p>“Yes.”</p><p>“Do you think you have integrity, Miss Everhart?” He emphasized every syllable of my name.</p><p>“Yes.”</p><p>“Hmmm.” He leaned forward. “So, would you ever willingly withhold the truth from someone you supposedly cared about?”</p><p>“It depends...” My breath hitched in my throat; my heart was racing a mile a minute.</p> <p>“It depends?” He sat back a bit. “It depends on what?”</p><p>“If the truth would damage anything or hurt someone unnecessarily, then I believe I have a right to withhold it.”</p><p>“But what if someone blatantly asked you for the truth, several times? What if he said, I want you to tell me the truth no matter how much it hurts, or how angry it may make me?”</p><p>Where is he going with this? “Are you referring to a potential witness changing his testimony on the stand, Mr. Hamilton?”</p><p>“No...” He trailed his fingers across my collarbone, setting my nerves on fire. “This is a personal inquiry. I’m just in need of an outside opinion. Answer the question.”</p><p>“Well, I think—” I sucked in a breath as he placed his hand on my thigh and strummed his fingers against my skirt. “I think certain lies have to be told, and certain truths have to be withheld. The ultimate conviction is up to those who can discern which is which.”</p><p>“So, you believe in reasonable doubt?”</p><p>“In certain cases, yes...”</p><p>“What about in our case?” His hand was slowly slipping underneath my skirt, traveling further and further up my thigh.</p><p>“Our case?”</p><p>“Yes,” he said. “I believe you and I are currently in an unfortunate web of deceit.”</p><p>“No...” I said, breathless and confused. “We’re not in a web of deceit...”</p><p>“We definitely are, Alyssa—\" He pulled me forward by the strand of pearls around my neck. \"It’s the case of a woman who befriended me online, but she turned out to be someone completely different than who she told me she was. So, in this case—our case, how do you feel about reasonable doubt?”</p><p>Gasping, I could feel all the color draining from my face. My heart wasn’t racing anymore; it was flailing around wildly—ready to jump out of my chest, and my eyes were as wide as they could go.</p><p>“You were very good at covering your tracks for such a long time, so I’ll give you that,” he said. “But I thought we thoroughly discussed how I felt about liars. Did we not?”</p><p>I murmured as he tightened his grip on my pearls, as he pulled me so close that we were lip to lip.</p><p>\"Do you plan on answering me, Aubrey? Are you tired of this f**king charade?\"</p><p>“I never thought that...” I was stuttering, trying to look away from him, but his grip prevented me from moving. \"I am so sorry...\"</p><p>He didn't say anything further. He stared into my eyes, searching for something that wasn't there. Then he lowered his voice, and leaned back. \"Once someone lies to me they're dead to me forever. Do you remember me saying that?\"</p><p>\"Yes...\"</p><p>\"So, you’ve always been willing to lose our friendship over lies?\"</p><p>\"I never wanted to meet you in person...”</p><p>“I can see that.” He hissed.</p><p>“If I had known who you really were...” I was breaking down in front of him. This was too much for one day. “I would’ve never—”</p><p>“Save it.” He cut me off. “I’ve heard enough about your thoughts on lying. Seeing as though we don’t share the same views, you’re not worthy of being my intern. You’ll be serving as my secretary’s assistant until further notice.”</p><p>“You’re demoting me?”</p><p>“It’s not a demotion. It’s a way to keep you out of my sight.”</p><p>My heart dropped.</p><p>“Our online relationship—whatever the hell that was anyway,” he said, “is over. I don’t want to hear from you outside of these walls again.”</p><p>“Thoreau...”</p><p>“It’s Mr. Hamilton, Miss Everhart.” He glared at me. “Mr. f**king Hamilton.”</p><p>“You have to believe that I’m sorry...I never thought that this would happen.”</p><p>“Take however much time you need on the Brownstein account.” He disregarded my apology and released his hold on my necklace. “You have until the end of next week. And from now on, you can just set my coffee on my bookcase. I don’t need you coming anywhere near my desk.”</p><p>“Andrew—”</p><p>“We are definitely not on a first name basis. Do not ever call me that.”</p><p>“Just let me explain...”</p><p>“There’s nothing to explain. You lied to me and you no longer exist. Get out. Now.”</p><p>I felt tears welling in my eyes. “I was serious about you being my only friend...Friends are supposed to give each other a chance to make things right. Just let me tell you why I had to lie to you...”</p><p>“I don’t deal with liars. Ever. And seeing that that’s exactly what you are, I don’t care why you felt the need to deceive me. Get out of my office, stay out of my sight as much as possible, and do your damn job.”</p><p>I stood up and looked into his eyes, pleading for him to simply hear me out, to let me explain, but he turned away from me. Then he picked up his phone.</p><p>“Jessica?” he said. “Could you help Miss Everhart find her way out of my office? And could you please have the janitor check my floors for f**king superglue?”</p><p>I stood underneath the scalding hot streams of my shower, crying. Right after I’d left Andrew’s office, I’d told HR that I wasn’t feeling well and needed to leave for the rest of the day.</p><p>I’d driven straight for the dance hall—locking myself into a private room and dancing until I couldn’t feel my feet anymore. I knew I must’ve looked crazy to my classmates, sobbing in between every twirl, but I didn’t care; I needed to clear my mind of all thoughts of Andrew, Thoreau, and Alyssa.</p><p>As the water continued to lash against my skin, I shut my eyes and murmured, “How long has he known?” I thought about the past couple weeks, how “Thoreau” had been less talkative than normal, how he’d ignored me, and then it hit me.</p><p>My interview...</p><p>I still remembered it because seeing Andrew in person made me realize that no picture could ever accurately capture how sexy he really looked, and I’d blushed the second his eyes met mine. He didn’t seem to act any differently throughout the questioning, but then I remembered that random phone call...</p><p>I wasn’t sure why I was just remembering it now, but while Mr. Bach and Mr. Greenwood had simply laughed that intrusive phone call away, Andrew had stared at me. As if he was in complete and utter shock. And at the end of the interview, when I’d reached for his hand, his gaze wasn’t intrigued anymore, it was heated.</p><p>Wiping away my tears, I turned off the water and stepped out. I wrapped myself in a towel and did what I always did when I felt sad: ordered a sandwich and made myself a couple of stiff martinis.</p><p>Just as I was downing the first one, there was a knock on my door. I noticed the pink Barbie keys on the counter—courtesy of my forgetful and “never here” roommate and knew it was her.</p><p>She always leaves something...</p><p>“Would it kill you to double check for these before you—” I stopped when I opened the door.</p><p>It was Andrew, and the look on his face was one of pure anger. He wasn’t dressed in a suit anymore, just a simple, thin white T-shirt that slightly clung to his chiseled abs and a pair of faded blue jeans.</p><p>I tried to slam the door in his face, but he held it open and forced himself inside my apartment. I started to step backwards and he matched me step for step, backing me against my living room wall.</p><p>“We need to talk.” His voice was flat, emotionless.</p><p>“No, we don’t. You said plenty earlier.” I looked down at the floor. “Don’t worry, I’ll be resigning in the morning. Please leave.”</p><p>He tilted my chin up and looked into my eyes. “You’re not quitting.”</p><p>“Watch me.” I swallowed. “I want you to leave...”</p><p>“I would believe that, but you say things you don’t mean all the time.”</p><p>The tension between us was damn near palpable, and I could feel my blood heating every second he stood there staring at me. I tried to move away, but he gripped my hips.</p><p>“You told me you were a lawyer, Aubrey...” he said, his voice dripping with malice. “You told me you were twenty seven years old.”</p><p>“I never said I was twenty seven. You assumed.”</p><p>“It was on your f**king profile!” He pushed my back against the wall. “You never thought to correct me whenever I said I was only five years older than you...I’m ten years older than you.”</p><p>“I didn’t think I would ever meet you in person,” I barely managed to say as he pressed his chest against mine.</p><p>“That excuses your lies?”</p><p>“I said I was sorry, and it was clearly a huge mistake to ever befriend you. You didn’t even give me a chance to completely explain.”</p><p>“Do you not understand how f**ked up this situation is?”</p><p>“No...” I murmured as our lips touched.</p><p>“I’ve been looking forward to f**king the woman who teased me every night for nearly six months,” he whispered, sliding his fingers underneath my towel. “I wanted her to ride me.” He trailed his hand up my thigh and rubbed his thumb against my clit. “On my c**k and my mouth. And I wanted to teach her how to taste me...Don’t you think this woman f**ked all of that up?”</p><p>I shook my head in response; I couldn’t handle the way he was looking at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You said you weren’t my type when I asked what you looked like.” He pulled away from my mouth, but he kept his thumb against my clit. “But you clearly are. Why did you lie about something as simple as that?””</p><p>“You didn’t tell me what you looked like, so—”</p><p>“Stop deflecting.” He hissed, and took a step back. “Tell me the reasoning. I’ve already figured out your reasoning for the other bullshit lies. By the way, no self-respecting lawyer would ever let another lawyer do their work for them.”</p><p>“Only a self-absorbed ass**le who wants to seem deeper than he really is would call himself Thoreau.”</p><p>“Good to finally see the version of you that I remember.” He took another step back and crossed his arms. “Answer my question.”</p><p>“Fuck you.” I scoffed. “I told you I was sorry, begged you to listen to me, and now when you feel like talking, you think you can barge into my apartment and make me?”</p><p>“I haven’t made you do anything.” He smirked. “Yet.”</p><p>Silence.</p><p>He leaned against the wall, waiting for me to speak, but I couldn’t get a word out.</p><p>Look away from him...Look away from him...</p><p>As if he knew the power his gaze was having on me, he grinned and picked up one of my makeshift martinis.</p><p>Lifting one of the cherries from the liquor, he placed it against his lips. “Do you plan on standing there all night and looking at me, or are you going to answer my question?”</p><p>“No,” I said, finally looking away from him. “After the way you treated me in your office today, I don’t owe you a goddamn thing. You can stand there all night for all I care.” I walked towards my room. “There’s even a sandwich delivery coming if you decide to—”</p><p>My breath caught in my throat as he grabbed me from behind and pulled me against his chest. He quickly spun me around so we were face to face, and then he ripped my towel from around my body, letting it fall to the floor.</p><p>The cherry he’d picked up was in his mouth, and he was pressing it on my lips—silently commanding me to open up and eat it.</p><p>I stuck out my tongue to take it, but before sliding it to me, he whispered, “Don’t chew...I want to see how capable you are of swallowing.”</p><p>My gasping did all the swallowing for me.</p><p>“Good girl,” he said, loosening his grip around my waist. “Now, step back and hold the wall.”</p><p>“What?”</p><p>He pushed me against the wall before I could take another breath, grabbing my hands and lifting them above my head. “Hold the wall...”</p><p>I nodded, pressing my hands against the cool surface.</p><p>With a ‘don’t-fuck-with-me’ look on his face, he sucked my bottom lip into his mouth, and spoke softly, “I’ll make you regret it if you let go.”</p><p>“Yes...”</p> <p>“That wasn’t a question.” The look on his face softened, and I was sure he could hear the loud beating in my chest.</p><p>I shut my eyes as he ran his hands up and down my sides.</p><p>I could feel his c**k hardening through his pants as he lowered his kisses to my br**sts and swirled his tongue around my ni**les.</p><p>His mouth trailed down my stomach, and his hands caressed every inch of me as he made his way down.</p><p>“Thoreau...” I gasped as his tongue skimmed the inside of my thighs.</p><p>“My name is Andrew.” He got down on his knees. “We’re done playing that game.” He trapped my legs with his hands and pressed his mouth against my pu**y. Licking me gently, he massaged my clit with his thumb.</p><p>I tried not to moan too loudly, tried to keep it all in, but each time he swirled his tongue, my mouth let another sound escape.</p><p>“You’re so f**king wet...” He groaned. “So f**king wet...” He slipped two thick fingers inside of me, pushing them as far as they could go.</p><p>My eyes fluttered open as he added a third finger, as he whispered, “So tight...”</p><p>“Ahhh...Andrew...” I gave up trying to be quiet.</p><p>“Yes?” He slowly pulled his fingers out of me and looked up, waiting for me to say something, but I couldn’t focus when he looked at me liked that.</p><p>With no lead-in kisses whatsoever, he buried his head in my pu**y and f**king devoured me.</p><p>“Ohhh...” I cried out in indescribable pleasure. “Ohhh godddd, Andrewww....Waitttt...Slow down...”</p><p>He ignored me, plunging his tongue deeper and deeper.</p><p>I couldn’t help but let go of the wall. I dropped my hands to his head, grabbing fistfuls of his hair to keep my balance. The harder I pulled his hair, the more his tongue lashed against me with no mercy.</p><p>Suddenly, there was a loud knock at the door, but Andrew didn’t bother stopping. Instead, he lifted my right leg up and draped it over his shoulder. He grasped my thigh so I couldn’t move, and then he slid his tongue into me a little deeper—licking every corner of my walls.</p><p>On the verge of coming, I grabbed his shoulders as my pu**y throbbed against his mouth. But he stopped abruptly.</p><p>He moved my leg and kissed his way back up my body, stopping when he reached my br**sts. He palmed them with one hand and roughly twisted my ni**les.</p><p>“I told you not to let go of that wall,” he said, looking down at me as he unzipped his pants.</p><p>I stared back into his eyes, nearly breathless.</p><p>“I did tell you that, didn’t I?” He clasped my hand and pressed it against his chest, slowly moving it lower and lower.</p><p>When my hand finally reached his dick, I looked down in utter shock. He was huge, massively thick, and my jaw was hanging wide open.</p><p>“You don’t like it?” He tilted my chin up and smirked.</p><p>I was utterly speechless, but I couldn’t deny how horny I felt right now. Remembering what he’d said on the phone, I lowered my head to taste him, but he stopped me.</p><p>“Not tonight.” He pulled a condom out of his pocket, and kept his eyes on me as he put it on.</p><p>Leading me to the couch, he sat down and pulled me into his lap.</p><p>I leaned forward to kiss his lips, but he quickly repositioned me so I was facing away from him. Then he teased me with the head of his cock—rubbing it against my slit. Again and again.</p><p>“Remember how you said you wanted to ride me until I came inside of you?” he whispered into my ear. “How you wanted to grind on me until I begged you to stop?”</p><p>“Yes...” I moaned.</p><p>He pushed me down by my shoulders and sank me onto his cock, burying himself to the hilt inch by inch. The further I slipped onto him, the more he groaned. The more he said my name.</p><p>When he was completely inside of me, he held me still and pressed his lips against the back of my neck, letting me adjust to his length.</p><p>The feel of him was like nothing I’d ever felt before. It was intense, powerful, addictive.</p><p>“Ride me, Aubrey...” He pushed me forward. “Fucking ride me...”</p><p>I took a deep breath and rocked against him, slowly stretching my insides further and further. I could barely maintain a rhythm; the fullness of him was almost too much, and he was rubbing my clit with his thumb—driving me insane.</p><p>“You feel so f**king good right now...” He yanked me back by my hair. “Don’t f**king stop.”</p><p>I held onto his legs to steady myself, slightly lifting my body up and down. I tried to finally establish a tempo, to finally take control.</p><p>“Andrewww...” I couldn’t handle his c**k anymore. “I’m...I’m about to cum...”</p><p>“No.” He gripped my hips harder than ever. “Not yet.”</p><p>He suddenly stood up, with me still impaled on his cock, and bent me over. “Grab that table and don’t let go.”</p><p>My fingers clutched the edge of the coffee table and he pounded into me again and again, smacking my ass each time I cried out.</p><p>“I told you I was going to own your pu**y,” he whispered harshly. “Don’t cum until I tell you to f**king cum...” His c**k was throbbing inside of me, and my muscles were clenching with his every stroke.</p><p>“Fuck....Fuckkkk!” My legs were starting to give out as an intense pressure built inside of me, as he f**ked me relentlessly. “Andrewwwww...”</p><p>“Don’t let go.” He warned, but I couldn’t help it.</p><p>My orgasm took ahold of me in a rush and I collapsed, falling forward. Before I could land face first onto the coffee table, he pulled me back and continued pounding into me until he reached his own release.</p><p>I shut my eyes and leaned back against him, panting heavily as we both tried to catch our breath. Several minutes later, Andrew gently lifted my hips and pulled out of me.</p><p>He stood up, and I watched him as he walked into the kitchen and threw the condom away. He picked my fallen towel up from the floor and walked back over to me.</p><p>I made no move to get up, but I re-wrapped the towel around myself.</p><p>“Is there anything you didn’t lie to me about?” His voice was a whisper.</p><p>“Yes...”</p><p>“And what would that be?”</p><p>“I did miss you...”</p><p>He raised his eyebrow, keeping the rest of his face stoic. Expressionless. He started to buckle his pants, not taking his eyes off mine.</p><p>I was hoping that he would say something, anything, but he didn’t.</p><p>He smoothed his shirt with his hands and walked to the door. All of a sudden, he stopped and glanced over his shoulder. Then he walked over to me and lightly kissed my lips—brushing his thumb against my cheek.</p><p>I wanted to speak, to ask what he was thinking, but he pulled away and left.</p><p>This time he was gone.</p><p>Recess (n.):</p><p>Temporary withdrawal or cessation from the usual work or activity.</p><p>Andrew</p><p>I’d broken a lot of rules in my life, but sleeping with an intern was probably one of the worst ones. There was no precedent for this, and that terrified me.</p><p>The second I left Aubrey’s apartment, I did what I normally did after f**king someone I met online: I went home, showered, poured a glass of my favorite scotch, and pulled out my laptop—preparing to search for the next.</p><p>Except this time, I didn’t want to search for a next. I wanted to f**k Aubrey, again and again. I wanted to hear her scream a little louder, feel her body wrapped against mine, and see her face as I buried myself deep inside of her.</p><p>Damn...</p><p>I couldn’t believe this. I could count on one hand the number of women I’d thought about after I left a hotel, and it wasn’t because any of them were memorable in a good way. And the ones that were good, were just “good”—never amazing, like Aubrey.</p><p>A part of me felt bad for leaving her right after we finished, for not saying a word, but I had to leave.</p><p>I didn’t do pillow talk conversations after sex. Ever.</p><p>Even though I was more than tempted to drive back over there right now and claim her again, I had to make myself accept a very harsh fact: I was never going to sleep with her again. It was against my rules.</p><p>“Where is my coffee, Jessica?” I called her desk. “Why hasn’t Miss Everhart brought it to me yet? Is she late today?”</p><p>“No, sir.” She sounded confused. “It’s only seven thirty...”</p><p>I looked at the clock on my wall and sighed before ending the call. I was on edge for some reason, and I didn’t like it.</p><p>I’d failed to get any sleep the night before and I’d purposely ignored Aubrey’s midnight text. It’d read, “Can’t sleep...Can we talk about what just happened between us?”</p><p>The answer was no.</p><p>Our conversations were long over. There was nothing more we had to discuss.</p><p>We talked. We f**ked. That was the end of us.</p><p>I pulled up the Dating-Match website, determined to get her out of my mind. All I needed to do was find someone else, and she would become a drop in the sea of other endless women—a fleeting memory that I would halfway remember whenever I saw her gorgeous face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There were hundreds of new women on the site now, but very few of them caught my eye. The ones that did seemed too good to be true, so I didn’t bother clicking on their full profiles.</p><p>Just as I was reading about a math professor, a cup of coffee was set on my desk.</p><p>“Good morning,” Aubrey whispered.</p><p>I didn’t answer. I continued to scroll through online profiles; she’d get the point eventually.</p> <p>She sighed. “Andrew—”</p><p>“It’s Mr. Hamilton.” I looked up, immediately wishing that I hadn’t. She looked even more stunning today than she did yesterday. She was wearing the same grey dress she’d worn to her interview, and it was tighter today than it was on that day. Her hair was falling in soft curls that fell past her shoulders, and her blue eyes were bright, hopeful.</p><p>“Can I talk to you for a second?” she asked.</p><p>“Is it about your work?”</p><p>“No...”</p> <p>“Is it about my work?”</p><p>“No...”</p><p>“Then no. Get out.”</p><p>“It’s about yesterday.” She stood still, making my c**k stiffen as she bit her lip.</p><p>“Yesterday was a mistake, a regrettable moment in both of our careers, and I assure you that it won’t be happening again.”</p><p>“That’s not what I was going to say.”</p> <p>“Miss Everhart,” I said, standing up from my desk and walking over to her, “you and I work together professionally. If I had known the truth behind all of your ridiculous lies earlier, I would’ve immediately stopped talking to you. And then I would’ve reported you for stealing someone else’s information and using it as your own. The fact that you are a liar remains, and unfortunately—given those circumstances and the fact that I’ve already f**ked you, there’s nothing more that needs to be said between us.”</p><p>She opened her mouth to say something, but I pressed my finger against her lips.</p><p>“Nothing more,” I whispered, bringing my face close to hers. “Understood?”</p><p>“You are...” Her bottom lip quivered as she jerked away from me. “You are such an ass**le! I can’t believe that I slept with you!”</p><p>“Believe it. I’m sure it’ll be a very good memory for you since you hardly ever have sex.”</p><p>She shook her head. “Were you pretending on the phone, too? You’re nothing like the man I talked to at night, nothing like—”</p><p>“Please spare me the emotional appeal bullshit, Miss Everhart. I’ll have my next cup of coffee at noon. Thanks.”</p><p>“You’ll be waiting.” She rolled her eyes. “I’ll get it when I feel like it.”</p> <p>“You’re going to make me fire you over a cup of coffee?”</p><p>“To be honest, you might not want me to make your coffee, Mr. Hamilton.” She narrowed her eyes at me. “There’s no telling what I’ll put in it.”</p><p>“I f**king dare you...” I stepped closer.</p><p>“Is that a threat?” She shrugged.</p><p>“It’s a f**king promise.” I pushed her against the wall and pressed my lips against hers, lifting her leg around my waist.</p><p>My c**k had been hard ever since she set down my coffee, and she was rubbing her hand against it through my pants right now, murmuring.</p><p>I pulled a condom out of my pocket and pressed it into her hand as I devoured her mouth—biting her soft lips, teasing her tongue with mine. If I could, I would f**k her mouth all day.</p><p>As she unzipped my pants, I slipped a hand underneath her dress and pushed her panties to the side, groaning once I felt how wet she was.</p><p>“Andrew...” She was taking too long with the condom, so I did it myself. The second I had it on, I slid into her deeply, biting her lips so she wouldn’t scream.</p><p>I grabbed her hands and placed them around my neck. “Always wet...” I felt her trying to move her leg from around my waist but I held it still. “Say my name again...”</p><p>“Yes...” She gasped as I pounded into her, over and over and over. “Yes...”</p><p>“Say it.” I squeezed her ass.</p><p>Her murmurs were becoming louder and louder.</p><p>“My name, Aubrey...” I kissed her mouth. “Say my name...”</p><p>Her pu**y was gripping my c**k tighter and tighter, and her nails were clawing my neck. “I...I’m about to...”</p><p>I immediately stopped mid thrust and whispered harshly into her ear. “Say my f**king name, Aubrey...”</p><p>Her nails dug into my skin. “Andrew...”</p><p>At the sound of my name on her lips, I slid into her again and she came, so perfectly. I felt my own release seconds later, and could feel her burying her head in my chest to stifle her moans, but I tilted her head up.</p><p>“Stop that...”</p><p>Panting, she kept her eyes on mine. “Stop, what?”</p><p>“Hiding your voice from me...” I kissed her lips again, making no move to slide out of her, and we stood there entwined in each other for what felt like forever.</p><p>As much as I wanted to tell her to leave and get the hell out of my office, I couldn’t bring myself to do it. Instead, I kissed her forehead and slowly pulled out, readjusting her dress.</p><p>After throwing away the condom, I picked up one of her heels that had fallen off and held it out for her.</p><p>Her curls were tousled all over her head, so I smoothed them back into place. As if she was returning the favor, she refastened my zipper and fixed the collar of my shirt.</p><p>Then the two of us stood staring at one another. I had no idea what the f**k just happened, and only a part of me liked it. The other half loved it.</p><p>“You need to get back to work.” I tugged at the ballet slipper charm around her neck. “You still owe me that Brownstein report, demotion or not.”</p><p>“You told me it wasn’t a demotion.”</p><p>“I took a page out of your book and lied.” I rolled my eyes and stepped back. “Get back to work.”</p><p>“Fine, Mr. Hamilton.” She smiled and headed for the door.</p><p>“And when you come back,” I added, “just leave my afternoon coffee on that bookshelf and walk out. Don’t come anywhere near my desk and don’t say anything to me.”</p><p>“Why not?”</p><p>“Because I’ll f**k you again if you do.”</p><p>She blushed and stepped out of the room.</p><p>The second she was gone, I fell back into my chair and shook my head.</p><p>Twice in less than twenty four hours? Jesus...</p><p>I pulled up my latest case file, but I couldn’t bring myself to read it. All I could think about was Aubrey.</p><p>I’d felt something like this before, and I knew it would lead to nothing but despair. What I felt was nothing deep, nothing all-encompassing—yet, but it was real, and there was nothing I could do to stop it.</p><p>I’d built the last six years of my life detaching myself from any chance of having feelings for someone else, refusing to build any friendships, but Aubrey had snuck by my impenetrable doors somehow. And not only had she snuck by, she’d done it with lies, something I would never allow from anyone else. Something that would make me immediately discard her and never think of her again.</p><p>I had absolutely no idea how to handle this. This was uncharted territory and I had no idea where to sail next.</p><p>Sighing, I picked up my case file and forced myself to read the first few pages so I could get a grip on myself. Before I knew it, I was lost in my work, and the only thing on my mind was how I was going to convince a jury to believe my latest client’s bullshit.</p><p>Before I could call the lead prosecutor and ask what he was offering in exchange for a plea deal, I felt something hot splashing into my lap.</p><p>My goddamn coffee.</p><p>“What the hell do you think you’re doing?” I dropped my papers to the desk, glaring at a red-faced Aubrey. “Did you just throw that into my lap on purpose?”</p><p>“I did.” She nodded, and I realized there were tears in her eyes. “Bringing you your coffee is my job, right?”</p><p>“Are you f**king bipolar?”</p><p>“No, I’m just a liar like you said. I’m actually just like you, but at least I can admit when I haven’t told you the truth, at least I have a reason.”</p><p>“Excuse me?”</p><p>Tears fell down her cheeks. “You have a visitor at the front desk.”</p><p>“Is it your replacement?” I asked dryly. “Because I swear to God, if these stains don’t come out of my pants—”</p><p>“It’s your wife.”</p><p>***END OF EPISODE ONE*** </p> </body></html>"]