["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>2255 A.D. Nikolai leaned back in the captain’s chair with a sigh. It had been a long journey, and he was glad to be nearing their destination. His brother Kyle was asleep in the chair next to him, looking so peaceful that Nikolai hated to wake him to do the necessary checks on the loading bays below decks before their final approach to the planet below.</p><p>He and his brother Kyle were Voyagers, from the planet Lycanus 3. They delivered the bauxite from the mines on their small home planet all over the galaxy and on occasion helped their cousin, Blayde, an independent bounty hunter. In fact, Nikolai had been wounded during the last trip with his cousin, and was still recovering, though his Lycan metabolism had mostly taken care of his healing. He’d only agreed to take this trip because of Kyle’s inability to find a replacement at the last minute for Blayde on this contracted delivery. Blayde had only recently found his mate, a handsome young man named Ryan, and they were off on their first voyage together, a kind of honeymoon for the newlyjoined couple. Blayde was training Ryan to help him fly the ship, so he could act as co-pilot on their journeys around the galaxy.</p><p>Nikolai smiled to think of how much in love his older cousin Blayde was these days and how much it had changed him. Blayde used to be such a player, really, much like Nikolai himself. Blayde seemed truly happy, but Nikolai still fervently hoped the gods would be kind and wait a very long time before revealing his own mate. He wasn’t ready to settle down with just one person for the rest of his very long existence, and wouldn’t be for a while. He was at the mercy of the gods, though, and if they decided to be capricious and bring his mate to him, he would have little choice but to be with that mate because of the family curse. Once his mate was found, he would fall wildly, irrevocably in love with the person, and have to be with them no matter what. The mate could be either male or a female, old or young, fat or thin, it didn’t matter. Once the blood lust came over him, he was trapped.</p> <p>Blayde’s unexpected mate had actually been one of his bounties, a former fugitive wanted on a murder charge, yet Blayde was determined to have him, no matter what. Luckily for Blayde, it turned out that the charges were false, and Blayde and his cousins had worked together to clear Ryan’s name. However, things could have easily turned out the other way, leaving Blayde himself a fugitive for harboring and protecting a prisoner. It seemed to Nikolai that the gods had an ironic, even bizarre sense of humor when it came to picking their mates for his branch of the family.</p><p>Nikolai shifted in his chair, trying to ease the slight ache in his chest where the bullet had lodged near his heart. If not for the quick actions of his brother, Kyle, he might have succumbed to the wound he received while trying to rescue Blayde’s mate from kidnappers. Nikolai’s body had mostly healed, except for a few twinges here and there, but he still wasn’t a hundred percent.</p><p>Nikolai and his family, the ancient Balanescus, were Lycans, commonly referred to as werewolves, though there were significant differences. Lycans had supernaturally strong metabolisms and lived a long time, but weren’t immortal, by any means. They weren’t ravening beasts when they shifted, but were quite capable of intellectual reasoning, and in fact kept their man’s shape, except for their heads, when they shifted, though their bodies sprouted extra hair and became even more muscular. Able to shift whenever they needed to in order to defend themselves and not just at the full moon, their beasts were large and formidable with wolf-like snouts and teeth. Their nails elongated into claws, and they presented a fearsome appearance. Their society was partially based on pack mentality, and each family group had an alpha male who was in charge. In the Balanescu family, due to an old curse, most of the children born into the family were male—and alpha.</p><p>Luckily, his family had worked out a solution, with his oldest cousin, Lucas, becoming the pack alpha, and Lucas’s brother Blayde, along with the other four male alpha cousins in their family group, all working jobs that kept them off-planet most of the time, as Voyagers or bounty hunters. Thus, they’d managed to avoid the in-fighting a group of alphas would always be prone to. Each of the alpha males in the family had sworn allegiance to Lucas, and each was able to maintain their pledge by simply not being around much and avoiding the inevitable challenges close proximity would bring.</p><p>“Kyle,” he called softly, “Wake up. Time to go down and do a landing check.” Kyle stirred and sat up, rubbing his eyes. “How long till we land?”</p> <p>“Only about thirty minutes or so. I’d like to get in and out as fast as we can. I can’t say I greatly</p><p>admire the Jayronians’ choice of a landing site.” The planet of Jayron was largely marshy and wet, and there were few places on this underdeveloped planet to land a star cruiser. The site the Jayronians had chosen was outside their small capital city of Lithos, in the country of Artoria. Artoria was the only really civilized country on the planet, and the only one to boast any kind of governing body. They had a king who had brought his country a long way toward modernization, though their technology was still a couple of centuries behind most of the Alliance planets.</p><p>The problem Nikolai had with the king of this planet and his council was the blind eye they seemed to turn to the space pirates known as Jolly Rogers, so called for the pirate flags they affected on the sides of their ships. Apparently the Rogers thought the flag insignia gave them some kind of glamour. Nikolai considered them to be cutthroats and thieves, and couldn’t understand why the Jayronians allowed them to hide out on their planet. Some kind of close association must exist between the king and the outlaws, though Nikolai had never heard exactly what the connection was. Many refused to continue to trade with the Jayronians, but recently the king had made extravagant promises to keep the trade routes safe and open. Since they were also willing to pay well for goods delivered to the planet, a few of the bolder traders, like those in his family, had decided to take a chance.</p><p>The Rogers made their living preying on the ships up and down the space corridors. Usually piloting small, fast ships, they used docking technology that could latch onto a larger starship, and, once docked, the thieves would enter by force, rob and terrorize the crew before taking off and losing themselves in the vastness of space, at times even taking hostages or prisoners to be sold on the slave markets. Often, out-of-the-way planets like Jayron, with little or no modern technology, were used as their bases of operation, though Jayron had become more and more the sole base of operations for the Rogers in this part of the galaxy. The pirates were mostly from a race called the Nilaniums, an ancient culture, dating back thousands of cycles. Their home planet was destroyed when their sun went supernova a century before, and rather than find a home on another planet, the survivors became nomads, traveling the galaxy in their ships. They were warlike and unfriendly to outsiders, considering themselves superior to most other races. Nikolai thought them to be a handsome people, but untrustworthy and arrogant.</p><p>Kyle levered himself up from the seat and grabbed a cup of coffee before going below, as Nikolai made the final landing preparations. Landing at the small, temporary docking station just barely large enough for the ship made maneuvering tricky and required all Nikolai’s attention for the next little while. By the time Kyle finally slipped back into the seat next to him and gave him a thumbs-up, they’d entered Jayron’s atmosphere and descended rapidly until the ship was hovering over the landing area, which consisted of a few docks, a warehouse, and some assorted outbuildings. Nikolai could just make out the Jayronian traders waiting for him below. Nikolai had dealt with these traders before and found them trustworthy enough, though the fact that the Jayron king allowed the Nilaniums to set up their hideouts on his planet was still troubling. Whenever they traded with the planet, they liked to get in and out as quickly as they could, but today something still felt off. A strange sense of foreboding came over him, but as he surveyed the scene below, he could see nothing out of the ordinary.</p><p>About ten of their workers, along with the old-style petroleum powered forklifts used on Jayron, waited on the dock, ready to unload the bauxite into a large truck once Nikolai and Kyle received their payment. The truck looked old-style too, and Nikolai was reminded of the poverty of the planet, partially due to the king’s stubborn refusal to join the Alliance. The area was fairly flat and open, with no place nearby for the pirates to hide in ambush. Besides that, the bauxite they were receiving was a necessary element in Jayron’s emerging economy, necessary to make aluminum, a cheaper alternative to some of the other metals currently in use to make their land and spacecraft. Bauxite was rare and in high demand throughout the galaxy. Surely they wouldn’t be so short-sighted as to allow the Rogers to attack a shipment, especially one from the powerful planet of Lycanus 3. The Balanescus, who made up a large part of the entire population of the small planet, were known to be fierce and dangerous to anyone foolish enough to become their enemy.</p> <p>Nikolai came in for a landing, and he and Kyle went below to meet with the traders. Just as they were about to step out onto the dock, Kyle snapped his fingers. “I left the bills of lading on the comm deck. I’ll go get them while you direct the unloading.”</p><p>Nikolai nodded and the hatch opened. He stepped out as the chief Jayronian trader came toward him with a big smile on his face. Beside him, one of the workers wearing the long, hooded cloaks favored by the people of Jayron, started inside the ship. Nikolai got a sudden whiff of some delectable odor that he’d never smelled before. It was both musky and sweet, causing his nose to twitch and his cock to harden. He was so surprised he held out a hand to stop the man. “Wait a minute, friend. I have to get payment first. Don’t be in such a hurry.” He pulled on the arm a little harder than he’d meant to, needing to see who the man was, and the Jayronian glanced up to look directly into Nikolai’s eyes.</p><p>When his dark blue gaze met Nikolai’s, the jolt was so unexpected, it almost knocked Nikolai off his feet. His brain screamed Mate! and he felt his wolf leap inside him, wanting desperately to come out and rut with this man beside him. Shocked and acting instinctively, Nikolai reacted as if to a threat, yelling out, reeling backward, and reaching for the stock of the short-barreled phaser-gun he kept at his side. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The reaction was immediate. All ten of the “workers” threw off their cloaks and charged him. The one closest to him, his newfound mate, leaped on top of him, taking him to the ground and knocking the gun from his hand. The man was much smaller than Nikolai, but the moment he touched him, Nikolai was flooded with dizzying sensations he’d never felt before, and he allowed himself to be taken down. His fangs and claws descended, not to hurt the man, but to lay claim to him. Nikolai had imprinted on the young man the minute he touched him and the unbreakable connection had been formed. Powerless now to hurt him, he could only lie back unresistingly and let the Jayronian do what he would with him.</p><p>The young man looked down at him in surprise when he made no move to fight back and laughed, showing strong, white teeth in a handsome face. Nikolai could only speak a smattering of Jayronian, but he was pretty sure the words he said were, “The wolf has no teeth!” He sat up, straddling Nikolai, and reached for a curved sword strapped to his back. As he pulled it out, Nikolai braced for imminent death, but instinctively grabbed the device he had tucked inside his pocket, jamming his finger down on the button. The hatch closed up almost instantly, trapping two of the attackers inside. The young man on top of him leaped to his feet in stunned surprise, banging on the closed door and shouting instructions to the men trapped within in some language that sounded like Jayronian. Nikolai was surprised—he’d thought they must be Rogers. Were the Jayronians, themselves, trying to steal his shipment?</p><p>In only minutes, the craft’s engines powered up and Kyle took the craft straight up in a rapid emergency ascent, as Nikolai knew he would. The device was a safeguard his cousin Larsson had developed a long time ago, to be used only in desperate situations like this one. It had set off alarms inside the ship that warned Kyle things had gone badly wrong. It was standard operating procedure for the hatch to automatically close, and all safety doors to slam shut and seal between the loading deck and the comm deck. Nikolai knew the men unfortunate enough to be inside would die quickly, deprived of the oxygen they needed to survive as the ship quickly left Jayron’s atmosphere. This was also standard operating procedure, to leave the area of the danger and achieve an orbit, unfortunately leaving behind any of the family trapped outside, in this case, Nikolai.</p> <p>It wasn’t intended to be heartless or cruel, only practical, and all of the cousins knew what they were getting themselves into when they became Voyagers, an often dangerous, if lucrative job. Kyle wouldn’t have gone far, only into an orbit around the planet. Nikolai knew that Kyle would already be on the communicator notifying the lead alpha, his cousin, Lucas, back on Lycanus 3, of the situation. A rescue attempt would be made as quickly as possible, and in the meantime, Kyle would stay in orbit, trying to negotiate a release. Powerful demands would be made on the king of Jayron, both by his own Balanescu family and by the large, greatly feared home planet of Lycanus. Nikolai knew all this, but wondered if any of it would do him any good. He first had to stay alive long enough to be rescued.</p><p>The handsome young man whirled around to face him, sword still drawn and an angry, vicious look on his face. He glared down at Nikolai, who was still lying on his back on the dock. His face was contemptuous, and he yelled out something in the strangely musical language of the Jayronians. It was too rapid for Nikolai to understand and he shook his head. Impatiently, the man repeated himself in Earthonian, an Alliance language that had become a universal one throughout the galaxy. “Tell the pilot to come back now, or we’ll kill you!” Nikolai thought his accent was charming. In fact, everything about the young man was absolutely delicious.</p><p>Nikolai raised up on one elbow and shrugged, answering him in the same language. “I don’t have a communicator with me, and it wouldn’t do any good, even if I did. He has his orders, and we never give in to the demands of thieves and murderers...like you.” The young man’s eyes darkened, and he almost flinched at the words, looking offended. Nikolai felt a tug at his heart for insulting his mate and wished he could call back the words.</p><p>The seven men still on the dock with the young man all bristled and came forward with their swords upraised, but the man, obviously their leader, held up a hand and barked something at them that caused them to stop. Nikolai wondered who this young man was to command such instant obedience. He looked very young, maybe just barely out of his teens. The young man gazed down at Nikolai, a sneer on his lips. Nikolai wondered how those full lips would taste on his. He actually put out his tongue to lick his own lips in anticipation.</p><p>“Surely they would not leave one of their own to be executed.” He leaned over Nikolai, putting the curved blade at his throat, just nicking the skin there and drawing blood. Again the young man’s scent assailed Nikolai’s nostrils, and he sniffed the air. He was unable to resist a huge grin. The young man regarded him oddly and straightened up, pulling back the sword.</p> <p>He wrinkled his brow. “What is so funny, Lycan? You think I will not kill you?” “I have no doubt that you would—you seem very fierce and brave.” Nikolai could hear the proud note in his voice and saw that the young Jayronian heard it too. His eyes narrowed, thinking perhaps that Nikolai mocked him. Nikolai was still having a problem wiping the smile off his face. Realizing he needed to start negotiating before his fiery little mate totally lost his temper, he leaned forward just a little and held out one hand in a conciliatory gesture. “My family will pay to get me back. I’m worth nothing to you dead. If you harm me, I can promise you they’ll hunt you down wherever you might try to hide.”</p><p>The Jayronian blew out a short, dismissive breath, but his eyes had sharpened at the idea of ransom. “And will they give me my men back as well?”</p><p>Nikolai shook his head. “Sorry, but they’re already dead. The alarm signal I sent to my brother closes all the hatches and cuts off oxygen to all decks except the command deck.”</p><p>A shocked and angry murmur swept through the men on the dock and several made quick moves toward Nikolai, but again, the young man beside him held up a warning hand and spoke a rapid phrase in his musical sounding language. Whatever he said stopped them in their tracks, and Nikolai was once more impressed with his command of the others, who were all older than the young man. Who was this little beauty? He was a good looking young man with the long, silky, navy blue hair common on Jayron and startlingly blue eyes. He was probably six or seven inches shorter than Nikolai, who was almost six-foot-five, and he had a slim, yet muscular build and lovely goldenbrown skin that made Nikolai ache to touch him.</p><p>“We will wait to see if your family will pay for your return. However,” he leaned in close, his sweet breath assailing Nikolai’s nostrils. He was probably trying to intimidate Nikolai, but only succeeded in making his cock thicken in his pants, “I can’t guarantee what condition they will find you in when you are returned.” His blue eyed gaze fixed on Nikolai and he looked him up and down contemptuously. “You will pay the price of my men with your own body, wolf, and when your family decides to pay your ransom, they may find I have tamed their wolf for them.” He straightened back up and looked down at him with a sneer. “Although you already seem pretty tame to me. The stories I’ve heard about your people must all be gross exaggerations, but then perhaps you are more of a cub than a wolf.”</p><p>He laughed and turned his back contemptuously, barking another order to his men, who came forward and roughly brought Nikolai to his feet, pulling his arms behind him and securing his wrists with rope. Nikolai felt his fangs sting his gums as they descended in response to the harsh treatment, and he forced them back up. He would pretend to be meek and docile for the moment. He knew he could easily take down all the men on the deck, but his mate would attack if he tried that, and he didn’t want to risk his safety. Until he had a clear avenue of escape, he would bide his time. His mate had assumed he was frightened when he’d jumped on top of him, so he would allow him to continue thinking that. It might lull them all into a false sense of security. If he displayed any of his real power, they would take extra measures to contain him, and he didn’t want that. For now, he would pretend, and allow them to think they had nothing to fear from him.</p> <p>Once his hands were bound behind him, and his ankles had been hobbled with a short rope tying them together, his mate came back to him with a piece of black cloth in his hands, a hood that he thrust over Nikolai’s head. He bared his white teeth with slightly elongated incisors to Nikolai before the hood came down over his face. Nikolai smiled beneath the cloth, knowing his mate had intended to frighten and humiliate him. Nikolai was pushed roughly forward, and almost stumbled, if not for a strong hand on his arm, steadying him, preventing him from falling. He knew the touch immediately as his mate’s.</p><p>Ah, not quite as cruel as you would have me believe, are you, little one?</p><p>Pushed and shoved forward, Nikolai soon felt his mate’s hand urging him to step up onto what felt like the bumper of the truck. He was hauled up by several pairs of hands into what must have been the back of it. He fell onto a hard surface, not a seat, and some kind of door slammed behind him. Soon they were off, picking up speed and bouncing him around on the metal floor of the truck. Nikolai jammed his legs against the other side of the truck bed to keep from being tossed around and endured the trip as best as he could until they came to a halt some twenty minutes later. As they pulled him from the truck, he picked up the sounds and scents of many people around him before he was pulled into a cool interior.</p><p>The sounds there were muffled and distant, and he smelled strong incense in the air. His captors seemed to lead him a long way, possibly through long corridors in the building before he heard the sound of a door opening. He was pulled forward again and suddenly he was falling forward. With his hands tied behind his back, he braced for an impact with the floor, but instead hit what felt like a soft mattress on a bed, with his legs still hanging over the side. He tried to raise his head, but a firm hand on the back of his neck pushed him back down. He heard the musical sounds again of his mate speaking to someone behind him, and then suddenly his shirt was pushed up and a hand grabbed the waistband of his pants, giving them a sharp downward tug. Before he could even get out a startled exclamation, a needle pierced his skin, and he hissed in a surprised breath. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What are you doing?” he tried to say, but a warm, languid feeling was spreading over his body, and his limbs felt heavy and weak. He tried to speak again, but the words came out a garbled mumble as he sank deeper into the mattress, the darkness falling over him like a shroud.</p><p>* * * Prince Jagger looked down at the big, beautifully muscled body of the Lycan with satisfaction. The sedative the doctor injected into his backside would keep him asleep for a few hours, long enough for Jagger to get some much-needed rest while he figured out what to do with his captive. Jagger hadn’t expected to take a hostage, but he hadn’t been able to bring himself to kill the goodlooking man. He was so big, and, Jagger suspected, very strong, though he had yet to show his strength. Was it some kind of trick? He’d never heard before of a Lycan being so docile and unresisting, and he couldn’t help but think there was some kind of deception going on. The man was gorgeous, that was for sure. Jagger had had a hard time keeping his hands off him, feeling an almost instant and powerful attraction, one reason why he’d come to the decision he had about him. He’d take care of the situation later, though. While his big Lycan was knocked out, he would take some time for himself.</p><p>Jagger had arrived back at the palace only hours earlier that morning, and he’d had no chance to bathe or even change clothes since they arrived. He’d been on training maneuvers with his army a few hours outside the city when the urgent message had arrived from his father. King Larius had told him of the shipment of bauxite, due to arrive later that day, with no money left in the country’s coffers to pay the traders for the shipment. Despairingly, the king had turned to his son to handle the situation for him. Since Jagger’s mother, the queen, had been taken by the Rogers six months before, his father had aged considerably, leaving more and more of his responsibilities and decisions to his son. Jagger was happy to help him, but hated the way grief over his mother had drained his father of his great former reasoning and strength. As long as they held her as a bargaining chip, his father gave in to any and all of the Rogers’ demands. The country had been practically beggared, paying the never-ending extortion money her kidnappers demanded.</p> <p>Jagger longed to lead the Jayronian armies to attack them, but they’d threatened his mother with immediate and painful death should any such attempt be made. Still, something had to be done about the situation soon. His country was being bled to death by the kidnappers’ demands. Now the Jayronians themselves had stooped to becoming thieves and kidnappers to get the Rogers what they asked for, this shipment of bauxite. Jagger tightened his lips as he looked down on the prone figure on the bed. He hated this, but what choice did he have? Jayron had never been a member of the Alliance, and he doubted they would come to their aid now. His planet was poor and had no resources the Alliance needed. No, they were on their own, and Jagger felt the weight of the situation on his own shoulders.</p><p>Turning to the servants, he gave them their orders and strolled into the adjoining room. The death of his men weighed heavily on him, even though they’d disobeyed his command to keep back and let him take the lead. Still, the fault was his own, and he grieved for them and their families. Had the big Lycan not taken Jagger’s arm, he might have been the one trapped within the ship when it took off.</p><p>Unbuckling his belt and stripping off his clothes, he went to the adjoining marble-tiled room and stepped into the large bathing pool. The hot water soothed his tired muscles as he sank onto a bench on the side, laid his head back on the edge of the pool, and thought about his captive. Would he be able to control the man? He was so big and muscular. So far, he’d been surprisingly meek for a Lycan. Rumors abounded of the fierce Balanescu family and the Lycans’ ability to change their shapes into that of a wolf. Jagger thought the stories to be myths, but the family was powerful and still to be feared. That they would attack to regain their man, he had no doubt. First he thought they would negotiate, though, and he had to be ready. He needed to come up with a plan to hold off an attack and perhaps acquire the ransom money the Lycan had mentioned.</p><p>The Balanescus were a wealthy family and would no doubt be able to pay any amount to retrieve their own family member, but that might not be enough. After paying the ransom and regaining the man, would they not then take their revenge on his planet? And even if they didn’t, surely the word would be put out that the Jayronians were not to be trusted, and all shipments of goods to his planet would be cut off. That word would go out soon anyway, if it hadn’t already, and since the last devastating drought, his people were dependent on trade to obtain a large portion of their food sources. His father had made a terrible mistake in trying to steal the shipment from the Lycans in the first place, one he surely never would have made had he been thinking clearly. Now Jagger had to figure a way out, one that would save face for them, and perhaps assure them a continuing source of income for however long it took them to regain his mother. Once they had her safely in their hands again, he could figure out the next move.</p><p>In many ways, the Rogers had the perfect plan. Gain a valuable hostage and keep that hostage as insurance and as a source of revenue from the family. Could he do something similar with his captive? At the moment, he didn’t see many other options. That left only the question of what to do with him. Keeping him in a prison cell was an option, but seemed cruel—the man had been unresisting and had done nothing to warrant that so far. Jagger was already feeling guilty for the deception and attempted theft. The death of his soldiers was really Jagger’s fault—the Lycan had acted only to save his ship. No, to close the Lycan up in a dungeon cell would only serve to make Jagger feel worse.</p> <p>One other option remained. For centuries, the royal family members on Jayron had owned slaves they called concubines, a personal servant who saw to their every need, including their sexual needs. In some societies, concubines were strictly sexual partners, but not on Jayron. On this planet, there was no particular preference for either male or female, and males were even said to make the best concubines, once properly trained. They could act not only as valets and sexual partners, but bodyguards. Concubines in his country’s war-like past often came from other worlds and were usually high-born males.</p><p>His father and mother had foregone the use of body slaves because of their personal attachment to each other, but he still remembered his grandfather being attended by a beautiful and exotic slave he had captured in a long-ago skirmish with the Tygerian planet. The man was large, like his Lycan, with lovely golden skin marked with black stripes. His grandfather, they said, had a hard time taming the Tygerian, and kept him always on a silver leash attached to a shock collar, sitting by his feet. The golden-haired Tygerian had acted as his grandfather’s protector, and was quite fierce, it was said. He would allow no one except his grandfather to touch him, and it was further said that the sounds of their lovemaking were legendary. They must have had real love between them, though, because when his grandfather died, the Tygerian was inconsolable. He was given his freedom, per his grandfather’s wishes, and was sent back home to his own people.</p><p>If Jagger could make this Lycan his own concubine, it would serve a two-fold purpose. It would keep him close, so Jagger could watch him, and it would be humiliating enough for the Lycans that they may keep it quiet, and not allow word to get out. Jagger could use him as a safeguard against an attack, like the Rogers were doing with his mother, and the Lycans could pay for the captive’s continuing survival, thus relieving the monetary burden on his own people. Besides that, the Lycan was very handsome. The thought of him wearing a shock collar and being led around on a leash made Jagger’s cock rise. The only problem was Jagger wasn’t sure he could pull it off. Shock collars were cruel, and he had no wish to hurt his captive, though he would have to find some way to control him. The Lycan was huge and powerful, though his demeanor so far had been meek. He wondered if there was something wrong with him—if so, his family may not want him back at all. On the other hand, it could all be a trick.</p><p>The prince sat up and reached for the soap by the edge of the pool. He needed to bathe and then get some sleep so he could think clearly about all this. Something told Jagger the Lycan may not be as biddable as he seemed. He certainly hadn’t seemed frightened, even when Jagger had his sword at his throat. Instead he’d seemed quite calm—almost too calm. Jagger thought he might just have his work cut out for him in the days to come.</p><p>Chapter Two</p><p>The softness under Nikolai’s body made him snuggle closer into the covers for a moment before the memory of where he was came back to him with a sudden jolt. He sat up, rubbing his forehead. What the hell had been in that shot they gave him? It had knocked him on his ass and left him with a nagging headache, whatever it was. He looked down at himself in dismay. The hood and the ropes had been removed, thank the gods, right along with his clothing. He looked around for it, but it was nowhere to be seen. He was in a huge bed right in the center of a large, luxuriously appointed room. There was dark red carpeting on the floor and rich, velvet wall hangings on every wall. A large window let in sunlight on the far wall, so either it was still daylight outside or he’d slept the clock around. From the way he felt, the latter was more than likely the case, and the light filtering in was the pale sunlight of early morning.</p> <p>He felt a pressure on his left ankle and threw back the covers to see it circled with a heavy silver cuff. The chain attached to the cuff led over to the nearby wall, leaving him just enough slack that he could roll over in bed, but that was about it. He tested the chain, finding it stronger than it looked, but he thought he could break it without much difficulty. He also had something around his neck, and as his fingers moved up to touch it, he felt a metal collar, about an inch wide and padlocked with a tiny lock.</p><p>Chained naked to a bed, wearing a slave collar—it seemed he found himself in an interesting situation, especially if his pretty little mate was the one who held the keys. Nikolai lay back down and smiled. Now if only he weren’t so blasted hungry, he might be able to enjoy this. As if his thoughts conjured them up, the door opened and several servants came in carrying trays of food. The smells made his stomach growl, and he sat up and watched them with interest. They seemed to all be Jayronian, with their long, straight blue hair and the same tunic-style clothing. They barely glanced over at Nikolai, placing the food on a table near the window, just out of reach of his chain. Without a word, they turned and walked to the door. Nikolai narrowed his eyes. What kind of game was this? Were they planning on starving him, torturing him first with what looked like a feast just barely out of his reach? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The door opened again, and his beautiful mate stepped in and walked confidently over to the bed, but again, just out of reach on the far side. He stood regarding Nikolai for a long moment, while Nikolai took the opportunity to look him over as well. The mere sight of the young man caused his instant arousal, and Nikolai leaned up and placed his forearms on his lap, bending over to hide the tenting of the sheets. He didn’t want to give away too much to his mate until he was surer of him. So far all he knew was that he was beautiful and fierce. Hell, he didn’t even know his mate’s name.</p><p>He was dressed in dark blue leggings and a short white tunic, both made of rich-looking materials. His dark blue hair looked clean and shiny and hung like a silky curtain halfway down his back. Nikolai wondered again just who the man was. He seemed to be very much at home in all this luxury.</p><p>“What’s your name, Lycan?” His musical voice sounded so sweet, it took Nikolai a moment to answer him. One beautiful eyebrow quirked up at his hesitation.</p> <p>“Your name?” he repeated. “Has the sedative not worn off enough for you to speak?”</p><p>Nikolai nodded and cleared his throat. “Nikolai Balanescu,” he said softly, watching his face closely to see if he’d heard the family name before.</p><p>If he did, he showed no recognition on his face. “What a mouthful. Nikolai...I shall call you Niki.”</p><p>Nikolai smiled at him. “You can call me anything you like, sweetheart.”</p><p>The young man’s back stiffened at the use of the endearment, and he pulled his eyebrows down into a deep frown. “My name is Prince Jagger, but you will address me as ‘Master.’ You will give me proper respect from this time forward or I’ll beat you. Do you understand?”</p> <p>“Yes, I understand. You want me to call you master.”</p><p>The young man watched his face carefully for any sign of mockery, but Nikolai kept his features blank.</p><p>“Well?”</p><p>“Well what?”</p><p>Prince Jagger blew out an impatient breath. “Address me as Master.”</p><p>“Yes, little Master.”</p> <p>“Are you obtuse or arrogant?” He waited for a long moment for Nikolai to answer, and when he didn’t he put his hands on his hips impatiently. “Answer me!”</p><p>“Um...I’m not sure...”</p><p>“Oh, for the gods’ sake! Are you hungry? Can you at least tell me that?” his mate asked sharply. Nikolai nodded, allowing him the next move.</p><p>“Please answer me when I speak to you.”</p><p>“Yes, I’m hungry. Little Master.” Nikolai couldn’t keep the corners of his mouth from turning up. He could see both the use of the word little and the hesitation before the words was noticed by the young man, but he merely chose not to comment and slanted his eyes over to the table.</p><p>“I will feed you, if you can behave. From now on, you will do as I command. If you disobey or cause me any problems, you’ll be punished. If you’re good, and obey my commands, you’ll be well treated. Do you understand?”</p><p>Again, Nikolai nodded, dropping his eyes, so his mate wouldn’t see the desire raging in them. He had a powerful urge to break the chain and pull his mate down beside him in the bed, and it was taking everything in him not to act on those urges.</p><p>“Do you understand?”</p> <p>Nikolai raised his eyes and caught his gaze. “Yes...Master.”</p><p>The man nodded and then walked over to the wall and bent over, giving Nikolai a view of his delectable ass, clearly outlined in the dark blue cloth. Using a key hung around his neck, Jagger unlocked the chain from the wall. He walked back to the bed and held out a hand, palm up. Nikolai took his hand, wincing only slightly at the warm touch of the hand sending pleasurable little shock waves throughout his body. He swung his legs over the side and stood up beside his mate. The young man looked him up and down, his gaze lingering for a moment on Nikolai’s huge erection. He cast a surprised glance up at Nikolai, but Nikolai kept his gaze down on the floor. Nikolai managed to banish the smile from his face and tried his best to look chastened and depressed. There wasn’t much he could do about his rigid cock, however. It was bouncing eagerly around in front of him with his every move. He tried to stand perfectly still so as not to bring any more attention to it.</p><p>His mate took a small device from his pocket and held it where Nikolai could see it. “If you give me any problems, I have only to touch a button and the collar on your neck will deliver a powerful and painful shock. Do you understand?”</p><p>“Yes,” Nikolai replied.</p><p>“What did you say?”</p><p>Nikolai tried very hard to stop the grin that threatened to blossom on his face. By biting his lower lip really hard, he just managed to do it. “Yes, Master,” he managed to choke out.</p><p>“Good,” his mate replied, with a somewhat suspicious expression. Nikolai suspected he thought he would meet with more resistance from a Lycan who stood at least six inches taller. “Do you have any questions for me?”</p><p>“My...uh...my family? Have they been notified?”</p><p>“They have. I have informed them that you now belong to me, and will serve me as my personal concubine. If they wish to ensure your continuing good health they will pay a monthly fee. In other words, you are now my hostage. In exchange for your family’s money, I’ll keep you alive and treat you well. Your only duties will be to me, personally.”</p><p>“Your concubine?” This time Nikolai couldn’t keep the shock off his face. “As in—your love slave?” He could hardly believe his good fortune. His eyebrows rose almost to his hairline, and his voice trembled with the effort not to laugh out loud. He kept imagining his brother Kyle’s face when he heard the news.</p><p>“The term indicates a body slave. You will attend me in bathing, dressing and so forth. Possibly, if things work out well, as my bodyguard.” He hesitated and narrowed his eyes, keeping them trained on Nikolai’s face. “And yes, you will also see to my sexual needs.”</p><p>The little prince took what was probably an involuntary step back as Nikolai shivered and shuffled his feet. His sexual needs. Gods! If he wasn’t careful, he’d come from the words alone.</p><p>His mate stepped forward again, his tone louder and more aggressive now, apparently thinking Nikolai was upset and humiliated over his new role. “It will do you no good to resist, Niki. This may not be a role you’re used to, but you will not resist me, do you understand?”</p><p>“Uh...I...”</p><p>“Do you understand, Niki? You belong to me now, and you will obey me.”</p><p>Nikolai could hardly believe his ears. This beautiful young man—his mate—wanted to make him his love slave. The irony alone was priceless. He felt a huge grin tugging at the corners of his mouth. What better way to pass the time until his family came for him? He needed to hide his enthusiasm, though, in case his little prince was under the impression this was some kind of punishment for Nikolai. If so, he hated to disappoint him by giving him a high five.</p><p>“So you wish to enslave me and hold me hostage, is that it?”</p><p>“You will address me always as master, and yes, that’s it, as you say.”</p><p>“May I ask why me, in particular? Master?”</p><p>Jagger hesitated, looking uncomfortable. “We need your family to bring back the bauxite shipment immediately. We have to have it. Unfortunately, we don’t have enough diamond certificates in our coffers at the moment, and your family has refused us credit. We were left with no choice but to take what we needed.”</p><p>“Oh yes,” Nikolai answered, “no choice at all. I can see the entire affair was my family’s fault.”</p><p>The prince blushed and tightened his lips further. “I-I’m sorry you got in the way of things, but you are now my captive, and I consider you to be spoils of war.”</p><p>“Spoils of war? Is my family at war with your country? I hadn’t noticed.”</p><p>Jagger made an impatient gesture. “I won’t stand here and argue with you. You are spoils of war and my hostage and my slave, and that’s an end to it. As my captive, I can do with you what I choose, and I choose to use you as my concubine. If you resist, I’ll shock you and punish you. It would go much easier on you if you’d cooperate and stop being so impudent!”</p><p>Nikolai decided to remain silent. Keeping his head lowered, he decided he didn’t want to fight with his little mate, or force him into a show of strength. For now it was best to just be quiet and learn as much as he could about his new situation. After all, being a sex slave to his own mate wasn’t exactly an onerous task.</p><p>After a moment, Jagger spoke again, this time with a softer tone. “There’s no use resisting, Niki. I’ll be a kind master, so long as you obey me.” He tried to peer into Nikolai’s eyes, but Nikolai kept his head determinedly down. The prince sighed and tugged on his hand. “Come with me, then, and I’ll feed you.”</p><p>Jagger pulled him over to the table and dropped his hand. He sat down and indicated a large pillow on the floor by his chair. “Kneel on the pillow beside me and take the food from my hand.”</p><p>Nikolai dropped to his knees, keeping his face lowered. His erection was huge and his balls were drawn up tight to his body. The idea of eating from his little mate’s hand was not at all embarrassing to him. Rather, it was exciting to be so close to him, and to have his mate’s scent on every bite that went into his mouth would be beyond exquisite. He was greatly enjoying this little game. Perhaps if Nikolai had truly been a slave, the situation wouldn’t have been at all pleasurable. With anyone other than his beautiful mate, he would already have torn their head off. As it was, knowing this was temporary until his family came for him, and knowing he could snap the collar off his neck with a twist of his fingers any time he chose made this all seem more like an amusing distraction. It helped to know it was a game he would ultimately win. Someday soon, he’d have his little mate sitting naked, not on the floor, but on his lap, while he fed him every bite and made him lick his fingers too. The idea made him moan a bit, and caused Jagger to look questioningly down at him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Are you all right?”</p><p>“I’m hungry, Master,” Nikolai said innocently, and Jagger nodded. He picked up a medium-sized morsel of Moringian beef and held it next to Nikolai’s lips. Nikolai engulfed his fingers with his lips, licking at the underside with his tongue and then sat innocently back on his heels, gazing up at his little prince from under his long eyelashes.</p><p>Jagger looked down at him with alarm, then wiped his hand on his napkin. “It’s not necessary to take such large bites, Niki. There is plenty of food here, and I’ll give you what you need.”</p><p>Nikolai certainly hoped he’d give him what he needed, and soon. It was getting harder and harder to kneel by his feet and not turn him around in the chair, rip his leggings off and swallow his cock down in one gulp. He clenched his hands tightly and opened his mouth for the next morsel.</p><p>This time, Jagger gave him a larger bite of meat, wrapped in a piece of soft, brown bread. When he opened his mouth even wider to take it, Jagger pulled his hand back and gave him a little tap on the cheek with the other hand. “Not such large bites. It’s not necessary to take my whole hand in your mouth. Now sit up straight and take a smaller bite.” Nikolai nodded obediently, straightening his back and opened his mouth just a tiny bit, leaning forward so Jagger could place the bite on his tongue. As soon the morsel touched his lips though, he quickly opened his mouth wide and took in the morsel and Jagger’s fingers all the way to the knuckles, licking them thoroughly as he pulled them away.</p><p>Jagger jumped to his feet and stood over him with his fists clenched. “You did that on purpose! I know it! Are you being insolent, Niki?” His voice was low, but Nikolai could hear the underlying menace.</p><p>He shook his head and looked back up at the prince deferentially. “No, Master. I’m just so hungry.”</p><p>Jagger stood staring down at him for a long moment, finally blowing out a breath in irritation. “Sit at the table, then, and fill your plate. I’m hungry too, and this will take forever at the rate we’re going. I can’t figure out if you’re impudent or just plain stupid. I’m not so sure your family will pay anything for you. I may have to pay them to take you back!”</p><p>“Yes, Master,” Nikolai said, “Uh...I mean, no Master. They’ll pay you, I’m sure.” He got quickly to his feet, sitting on the empty chair next to his mate. Grabbing a plate, he took a little of everything. Actually, he took a lot of everything, but he was very hungry, and it all looked delicious. When he’d helped himself to the food, he sat back and looked down at it with satisfaction until he noticed the amazed look on his little mate’s face at the mounds of food on his plate. He smiled and shrugged. “As I said, I’m very hungry.”</p><p>“Yes, I can see that. Well, eat your fill and then we can talk.”</p><p>For the next few minutes, Nikolai addressed himself to his plate, finding the Jayronian food good, if a little bland for his taste. There were a few vegetables he didn’t recognize, but he ate them anyway, not knowing how long it might be until he was offered food again. He washed it all down with a large goblet of water sitting by his plate and then sat back, rubbing his stomach. He looked up and found the prince’s fascinated gaze on him.</p><p>Nikolai smiled and shrugged, then quickly lowered his head again at Jagger’s increasingly suspicious look.</p><p>The prince sat forward, leaning his elbows on the table. “I don’t believe I’ve ever seen anyone eat that much food at one sitting. I may have to include a food allowance in your family’s monthly tribute.” He shook his head and stared at Nikolai. “Do you have any more questions for me, Niki? Anything about me or about your new life here?”</p><p>Nikolai shrugged. He had plenty of questions, but the prince would no doubt think they were insolent and refuse to answer. He decided that if he were to pull this off, if he were to make the prince think he was not a threat, the less he said the better. He shook his head, keeping his eyes downcast.</p><p>Jagger sighed and rubbed a hand over his face. Nikolai stole a look at him while he did, and wondered what it was besides Nikolai’s teasing that bothered his mate so much. He looked as if he hadn’t slept well, and he had shadows under his pretty eyes. Perhaps it had something to do with the reason the Jayronians had tried to steal their shipment. He knew the planet was poor, but not this desperate. Why were the planet coffers so empty the king had to resort to theft? Nikolai had never heard of the Jayronians being so treacherous before, and now they had gone so far as to take a hostage. They were digging themselves a very deep hole.</p><p>The young prince stood up and held out his hand again. “Come with me then.” Nikolai took his hand and meekly followed him. He led him out of the room they were in, the chain dragging behind Nikolai and into a tiled bathing room.</p><p>“Bend down. I’ll remove your collar for bathing since you’ve behaved so far, but if you give me a problem, I can assure you I’m more than capable of taking care of you. You might be a little larger than I am, but make no mistake, I am a trained warrior.”</p><p>Nikolai nodded and bent his head humbly down, amused but trying not to show it. If he wished to, he could easily break his little man in half. Of course, he wouldn’t harm a hair on his baby’s head. Deciding to play along—after all, he was exactly where he wanted to be—he pretended to be quite impressed and cowed down by his mate’s strength and fierceness.</p><p>Jagger unlocked the little padlock and laid the collar aside. He bent down and did the same to the cuff and chain around Nikolai’s ankle. Straightening up, he began to take his own clothes off, keeping eye contact with Nikolai as he stripped. If this was supposed to make him uncomfortable, Nikolai thought, it was having quite the opposite effect. His mouth went dry as the prince removed his shirt and threw it on the marble floor. Jagger’s upper body was just as Nikolai pictured it. Deeply cut muscles on his chest and abs tapered down to a small waist. Jagger had little hair on his body, only a small, dark blue treasure trail leading down to his groin. As he stripped off his leggings, Nikolai saw that his erect cock stood out in front of him, thick and perfect, and his pubic hair was as deeply blue as the hair on his head, exotic and beautiful. It would be almost a shame to shave it off, but once Jagger was his, he would take care of it. Lycans had surprisingly little body hair in their human-like form and found it unattractive in their mates.</p><p>Nikolai’s attention shifted to his erect penis, a deep red color, with a blue vein running along the length. His balls were a good size too, and Nikolai felt his fingers itch to reach out and touch him. Instead Jagger turned and walked over to the bathing pool, motioning for Nikolai to follow him. His ass was delectable, round little globes that would perfectly fit into Nikolai’s hands.</p><p>Nikolai followed his mate into the shallow end of the pool and sank down on a marble bench across from Jagger. The water was warm and came up to his waist, but on Jagger, the level was higher, hitting him mid-chest.</p><p>Naked. He’s naked and so close to me. All I’d have to do is reach out my hand and...</p> <p>“Niki,” Jagger said. “Come here.”</p><p>Trembling and scarcely able to believe his good fortune, Nikolai got to his feet and slowly approached his mate. Jagger held out a hand to him and when he got closer, he pulled him to stand between his thighs. Nikolai took in a sharp breath and closed his eyes so Jagger wouldn’t see the leap of hot desire. His legs were shaking so hard from trying to hold himself in check he could barely stand. Jagger must have taken it for alarm, because he smoothed his hand across Nikolai’s thigh, whispering, “Shhh. Don’t be frightened.”</p><p>Jagger tugged down on Nikolai’s arms. “Kneel, please.” Nikolai fell to his knees in front of his mate. He couldn’t have stood much longer anyway. Jagger put one finger under Nikolai’s chin and tipped his face up to gaze in his eyes. “Have you ever been with a man before, Niki?”</p><p>Nikolai nodded, not trusting himself to speak. He wondered what his mate would think if he knew just how many men Nikolai had been with in the past few cycles. The Balanescu males were notorious for their sexual exploits in some parts of the galaxy. Apparently the news hadn’t quite made it to this little planet.</p><p>“Then you know what you’re about to do. Take me in your hand and pleasure me, Niki.”</p><p>Since Nikolai had been a little boy, he had firmly believed that there were gods in the heavens who directed the fate of men, and who, if you were very good, would reward you with all treasures beyond imagining. But never, in his wildest flights of imagination, did he conjure up anything like this. His beautiful mate was spread out wantonly before him, his head back against the pool, his legs open wide, offering up his thick, gorgeous cock to Nikolai. Nikolai touched it reverently. His mate’s cock was not as large as his own, but well-shaped with velvety skin. It was pointed arrogantly upward and rigid as steel. Nikolai ran his hand gently over the length of the shaft, getting used to the sweet heft of it in his hands. He planned to get to know this cock very well in the future, just as his mate would become very familiar with his own, so he greeted it now as a long-lost friend. As he ran his hand over the shaft and reached down to weigh each ball carefully in his hands, kneading and massaging them, Jagger put his head back and moaned softly.</p><p>Oh, not good enough, sweetheart. I want you to scream before I’m done.</p><p>He moved his hand up and down the shaft, slowly at first, while his other hand continued to knead Jagger’s balls. He soon fell into a rhythm, enjoying watching Jagger’s back slowly arching up as his head fell back. His hair spread out around him in the water, and his eyes were tightly closed. Nikolai increased the pressure and the speed of his hand and now on each upward sweep, he ran his thumb over the sensitive head, dipping gently into his slit before continuing down. His mate began to gasp for breath, and tried to thrust upward. Nikolai took his hand off Jagger’s balls and moved to his hip, holding him down with easy strength. Jagger opened his eyes in surprise and looked directly into Nikolai’s.</p><p>“N-Niki...” he said, groaning, and Nikolai smiled at him, holding his gaze. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Shhh, little Prince, relax and let me pleasure you.”</p><p>Jagger nodded, his eyes glazing over, and his hands moved to Nikolai’s shoulders, holding on tightly, clenching and unclenching his hands. Again, Nikolai dipped his thumb into the prince’s slit, farther this time, and his hips came up off the bench as he made a loud gasping sound. Nikolai slipped his free hand under his hips and pushed one finger up inside his mate, crooking it, looking for the little bundle of nerves he knew would finish this. As he found it and swept his long finger over it, the prince jerked his hips and gave a loud shout of pleasure/pain and began to come uncontrollably, spurting out into the water surrounding them. Nikolai milked him to his completion, and then, as Jagger’s head fell back against the side of the pool, his eyes still tightly closed, Nikolai moved over him and kissed his lips, nudging them open with his tongue and boldly sweeping inside. His mate tried to jerk backward at first in surprise, but Nikolai put a hand on the back of his neck to hold him in place. Jagger struggled a little, but as Nikolai’s other hand went back down to his balls, massaging them gently, Jagger relaxed and gave himself to the kiss with a soft sigh that again went straight to Nikolai’s cock, and met Nikolai’s tongue with his own.</p><p>When breathing finally became necessary again, Nikolai reluctantly pulled away, biting gently at the prince’s lower lip as he went, then giving his lips a lick. He sat back on his heels and lowered his head again, trying to catch his breath, his own cock aching for release. He began to fear he wouldn’t have the strength to control himself with his mate. He wanted badly to turn him around and fuck him until he screamed, but if he did that, he wouldn’t be able to prevent himself from biting and claiming him. His wolf was leaping inside him now, and he felt his incisors drop from his gums and his claws extend. He gripped his hands tightly into fists to hide them and kept them out of sight in the water of the pool, fighting desperately for control.</p><p>Jagger seemed to be fighting something too as he sat stunned against the side of the pool. He took several deep breaths and his voice, when it came, was shaky and hoarse. “Niki, please go sit over there.” He pointed to the bench Nikolai had recently vacated and Nikolai nodded. He needed to get some distance between himself and his little prince too. It was becoming harder and harder to pretend to be submissive and passive around his mate, when everything in him raged at him to claim him. He was, after all, an alpha male.</p><p>Nikolai settled himself back on the bench and concentrated on forcing his fangs back up into his gum and his claws to retract. Several minutes passed while both men were quiet, the only sound that of their rapid breathing. The prince stood up then and moved slowly across the pool to stand in front of Nikolai. His wet body gleamed in the soft light coming from the wall sconces and Nikolai was fascinated to see his mate’s cock was fully erect again.</p><p>“Stand up and turn around, Niki,” the prince said softly, and Nikolai did as he asked, bending over and clutching the side of the pool. He felt Jagger’s soft finger run down his crease and he fought to keep from throwing back his head and howling. When that finger dipped inside, he stiffened and straightened his back. No, this wasn’t how this was supposed to work.</p><p>Jagger kept his finger where it was, running his other hand across Nikolai’s back. “Shh, sweet one. Relax for me and let me in.” He pushed gently on Nikolai’s back and he bent over again, hesitating only a little.</p><p>Nikolai hadn’t ever bottomed and had no idea how he felt about it. It would be a way to have him inside me and not have to worry about biting him and claiming my mate. Nikolai smiled to himself. Hell, it’s all good. Maybe I should just relax and enjoy it. His mind made up, Nikolai repositioned himself, spreading his legs out farther and bending lower.</p><p>“Good boy,” Jagger said soothingly, and caressed his backside with his hand. “Is this your first time, Niki?”</p><p>Nikolai nodded, not trusting himself to speak.</p><p>“I’ll be gentle, sweetheart. I promise. Just trust me and relax.”</p><p>Nikolai nodded again and felt another finger slip inside him, while at the same time, Jagger finally took Nikolai’s aching shaft in his hand and began to slide up and down. Nikolai heard himself make a whimpering noise he’d never made before and relaxed into his grip. Another finger slipped in and Nikolai moaned at the burn. Jagger increased the speed on his shaft though and since the fingers in his ass weren’t moving for the moment, he allowed himself to relax again and concentrate on his cock and the incredible things Jagger was doing to it. When the fingers inside him began to move again, nerve endings Nikolai didn’t know he had sprang into life. Nikolai shifted his feet again, moving even farther apart. The fingers moved deep inside him, touching his prostate and Nikolai gasped at the sensation. He’d given pleasure to others by touching that place, but never imagined how it would actually feel. Gods, it made him see stars and make mewling sounds he’d previously only heard from the wildcats on Konar 4.</p><p>The fingers pulled out, and Nikolai glanced around in disappointment, his hole clenching and unclenching at the loss. Almost immediately though, Jagger pressed against him, his cock taking the place of the fingers. He eased himself inside, pushing past the strong ring of muscles. It hurt, but Nikolai bit his lip, too proud to let his mate see it. Somehow Jagger knew though, and the hand on his cock moved faster, a soft kiss dropped on Nikolai’s shoulder and he heard Jagger murmuring something to him. Pleasure came flooding back, and Nikolai thrust up into the hand that held him and then back, causing his backside to burn again.</p><p>“Hurts,” Nikolai whispered and soft kisses rained down on his shoulders and back.</p><p>“Relax, sweet one, and it’ll hurt less. I want to make this good for you.” Jagger began moving with slow thrusts, pulling out and pushing in. He angled his hips so that Nikolai’s sweet spot was being caressed with each stroke, and Nikolai pushed backward into it, then forward again to meet Jagger’s hand. The sensations were coming too fast for him to process them, and he gave himself over to the pleasure completely. He still wanted to be inside his mate, but until he could this was a fine substitute. He might even allow his mate to pleasure him this way in the long cycles to come. His little mate was really quite good at it.</p><p>Jagger moved the hand on Nikolai’s cock in a similar motion as Nikolai had done to him, slipping his thumb into Nikolai’s slit, and Nikolai arched his back and climaxed at the same time he felt a wet explosion deep inside him. Jagger strained against him and shouted his name as Nikolai sagged down to his knees on the bench, taking the prince with him. After a moment, Jagger pulled out and fell over on the bench. Nikolai could hear his soft panting as he tried to catch his breath.</p><p>Nikolai moved to his knees on the floor of the pool and put his head against Jagger’s chest, nuzzling his nose into his wet skin, unable to let him go. Jagger started in surprise at first, and then his hand fell onto Nikolai’s head, caressing him. They remained quietly together for a long while. Nikolai thought that neither of them wanted to move. Finally, Jagger pushed at him gently and stood up, again extending a hand to Nikolai. He gave it to him and followed his prince from the pool. Jagger took some towels from a cabinet on the wall and tossed one to Nikolai. They dried off their bodies without talking, and Nikolai followed Jagger’s lead in tossing the towels to the floor when they were both dry. Falling onto the bed, Jagger nudged Nikolai to turn on his side and then came up behind him, spooning him and rubbing the muscles of his abs gently and soothingly. Soon his exhausted little prince was breathing deeply behind him, his lips close to Nikolai’s ear, and Nikolai allowed himself to relax into sleep.</p><p>Chapter Three</p><p>Jagger woke up with his legs tangled up with other, longer legs, and for a moment he was amazed to find himself in bed with someone. Memories of the night before came flooding back to him. The big Lycan—Niki—had been amazing, far exceeding his expectations. Jagger moved his arm from around his lover’s waist and lay on his back, staring at the ceiling. He still didn’t know what to make of him. Why had he given in so easily to the idea of becoming his concubine? Was he planning some kind of trick or escape?</p><p>The night before, he’d been subdued enough, even humble at first, if a little dense, and that didn’t ring true to what Jagger knew of Lycans, and of the Balanescu family in particular. They were all rumored to be highly intelligent, fierce, and dangerous to cross. Jagger knew his father had been receiving furious messages from the family since yesterday, and the Lycanus ambassador had been in contact as well, all demanding his Lycan’s immediate release. A delegation from Lycanus 3, Niki’s home planet, was supposedly already on the way to negotiate his release and would land sometime the next day. His father had been frightened when he’d reported all this to Jagger, wringing his hands and telling him they would have to capitulate. But after last night, Jagger was determined not to let his Lycan go. It wasn’t only because of his value as a hostage, though keeping him would ensure a steady source of income they could use to pay off the Rogers until Jagger could figure out a way to secure his mother’s release. He also wanted the man for himself, and he didn’t want to look at his motives too closely.</p><p>The Lycan had been full of surprises from the very beginning. At first, Jagger had thought he was mocking him when he called him ‘sweetheart’ and ‘little Master’ and licked his fingers at dinner. And though he later called him ‘Master,’ he also seemed amused, as if at some private joke. Jagger knew he had great strength—he’d proven that in the bathing pool when he effortlessly held him down with one hand, yet he hadn’t chosen to use that strength to hurt him in any way. Why not?</p><p>Niki made a soft little sound in his sleep and rolled toward him, reaching for him. When he found Jagger, he cuddled closer, throwing an arm over his waist and then sighing contentedly and settling back down. Jagger put a hand on the back of his head and rested it there. His hair was soft and a lovely shade of reddish brown, filled with golden highlights. His strange garnet-colored eyes should have clashed but they didn’t. They were an intriguing and lovely match. He’d never seen such eyes before, but they were most compelling. They seemed to get darker when he was angry or surprised or in the heat of passion. The night before in the pool, they’d been almost black.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In actual fact, Jagger hadn’t had many lovers before. In the past, he’d simply been too busy with his studies and his military training. He’d always preferred males when he did take a lover, though his parents had been disappointed he wouldn’t give them an heir. Jagger wasn’t interested in settling down and raising a family, and really would have preferred his father to name one of his many first cousins as the heir to the throne and title. He had little interest in it, and wanted to travel and see the universe instead of being tied down by responsibilities and duties to his country. Up until six months ago, he thought he had plenty of time to decide about such things, but his father’s health had greatly deteriorated since his mother’s capture by the Rogers, and now he wasn’t so sure.</p><p>Nikolai stirred again and opened his beautiful eyes. For a moment, he seemed disoriented until he saw Jagger. A big smile lit up his face, and he scooted closer, latching his mouth onto the closest nipple to him. As his hot tongue encircled it, Jagger hissed in a sharp breath. “Well, good morning to you too, Niki.”</p><p>Nikolai looked up at him with a wicked smile. “Good morning, little Master.” He gave Jagger’s nipple a gentle tug with his teeth, and apparently there was a direct line from it to Jagger’s cock, because it stood up immediately and took notice.</p> <p>“Just Master,” Jagger corrected, pulling away to sit up and tugging Niki up to sit beside him. “Now stop, because I need to ask you something.”</p><p>Niki sat beside him, an arm around his shoulders as he leaned back against the headboard. “Sure, go ahead.”</p><p>“Why have you been so...agreeable since you woke up yesterday? I told you that you were my hostage and my concubine, and I expected you to be angry. Instead you seemed downright happy about it. Are you trying to trick me, Niki? Is this all some kind of plan to make me think you’re content so you can escape? Because I can assure you escape is impossible. I have this room heavily guarded, and I would never let you get away from me, anyway.”</p><p>Nikolai dropped his gaze, a slight smile playing around his lips, but answered quickly enough. “Oh, no, Princeling. I...uh...I’m happy to be here with you.”</p><p>Jagger turned in his arms to face him, fixing him with a hard stare. “That’s just it—why? How could you possibly be happy about being captured and taken away from your family? I mean I could understand it if you’d been mistreated, or...”</p> <p>“That’s it. I was mistreated.”</p><p>Jagger turned a suspicious gaze on him. “In what way? You said the Balanescus were your family.”</p><p>“They are, sort of. My...uh...my mother died and my father married a woman who had some sons. They never really liked me, so they were mean to me. Really, really mean. Made me do all the work around the house while they did nothing. And if I didn’t get it all done, they’d beat me.” Nikolai sighed heavily, glancing at him out of the corner of his eye. “They wouldn’t even let me sleep in a real bed. I had to sleep on the floor near the fireplace...in the cinders to keep warm.”</p><p>“But that’s outrageous! Didn’t your father try to stop it?”</p><p>“Well, uh, he died too. So then I was left with my wicked stepmother and my wicked stepbrothers.” He sighed heavily again, and Jagger put a hand over his and squeezed his hand.</p><p>“Then why do they want you back so badly?”</p> <p>Nikolai shrugged. “To do all their work, I guess. Then too, they have a lot of pride. They won’t like the idea that you tried to steal from them.”</p><p>Jagger leaned over and kissed his cheek. “Well, you don’t have to worry about any of them ever again. I’ll take care of you now, and if they try to take you away from me, they’ll soon learn what a Jayronian warrior is capable of.”</p><p>“Thank you, little Master,” Nikolai said softly, his hand sneaking out to squeeze Jagger’s cock through the sheet.</p><p>“Not...little Master,” Jagger managed to say, and tried to frown at him. “Just Master!”</p><p>Nikolai lowered his lashes and moved his head down to lick and suck at Jagger’s nipple. “Oh, sorry, Master.”</p><p>“I don’t think you’re sorry at all, and what do you mean by ‘little’? I’m quite tall for a Jayronian! Oh, Niki...” He squirmed as Nikolai blew across his sensitized nipple.</p><p>“Ah, but not on my planet. On my planet you’d be considered petite.”</p><p>“Petite!”</p> <p>“Mmm...” Nikolai teased, licking at his nipple and with each word. “Little. Dainty. Cute. And very tasty.”</p><p>Jagger tried to bat him off, but Nikolai caught hold of his hand and pulled it above his head, holding it there with ease. Jagger squirmed, uncomfortable with this reversal of roles. He tried to get away until he realized Nikolai was only holding him, not trying to hurt him. He relaxed then, pleased his big Lycan felt comfortable enough with him to tease, and strangely, he had no fear at all of the man. He knew instinctively that he would never hurt him.</p><p>“Maybe it’s because on your planet, you’re all big, overgrown, freakishly large...clodhoppers!” This would have been a fine comeback, he decided, if not for the girlish squeal he gave out right after as Niki buried his face in his armpit. He’d always been a bit ticklish and now that the big ox knew it, he was torturing him unmercifully. “No, please! I surrender!” He threw back his head and laughed until Nikolai released his hands and moved further down his body, going for his nether regions. “Oh gods, Niki!”</p><p>A knock on the door interrupted their play and Jagger sat up, pushing Nikolai away, and pulling the cover over both of them. “Come in,” he called out, and the door opened to reveal a servant, who quickly averted his eyes.</p><p>“Sorry to interrupt you, your Highness, but your father is asking for you. He’d like for you to come right away.”</p><p>Jagger blew out a long suffering breath. “Did he say why, Higgins?”</p><p>“I believe it has something to do with the Rogers, your Highness.”</p><p>Jagger sighed impatiently again. “Tell my father I’ll be there shortly.” The servant bowed his way out, and Jagger swung his legs over the side of the bed. He went over to his clothes cabinet and bent over looking through things, while Nikolai lay on his back, being very quiet all of a sudden.</p><p>“The Rogers? What’s that about, Princeling?”</p><p>“Huh?” Jagger turned around to regard him. “The Rogers? My father has business with them, that’s all.” Jagger frowned at him, unsure how much to tell him. He’d already decided he wanted to keep Niki. Maybe it was fast—well, gods, of course it was fast. Jagger knew that, but the feelings he had for the Lycan were strong, even though they were so new. He’d never been as terribly attracted this fast to anyone before, and the fact that Niki seemed to return his feelings were thrilling to Jagger. Niki didn’t even seem to mind the fact that he was now Jagger’s concubine, and if his stepbrothers were truly cruel to him, then perhaps he had rescued Niki, in a way. That certainly made him feel better about the situation.</p><p>Even though Lycans were said to be fierce and dangerous, all Niki seemed to want to do was cuddle and play with him. Still he decided not to confide in him yet about the Rogers and his mother. There would be time later for that.</p><p>“What kind of business?” Niki asked.</p><p>“Nothing for you to worry about. Now hush and let me find something for you to wear. I can’t find anything large enough to cover you,” Jagger said, standing up with his hands on his hips, glaring at Nikolai as if it were his fault.</p><p>“Why not just give me my own clothes back? Where are they anyway?”</p><p>Jagger shook his head. “They’re ruined. The servants cut them off you while you were unconscious yesterday.” He looked back toward the bed and shrugged at Nikolai’s raised eyebrow. “It was the only way they could undress you. You’re quite large, Niki.” He thought for a moment and snapped his fingers. “I have it!” He rang a bell next to the door and in only seconds, a servant appeared.</p><p>“Go up to the attic and find my grandfather’s trunks. Quickly! There are some clothes in it that will fit my concubine. Hurry back—the king is waiting for us.” He turned from the door and began pulling on his own clothing, casting a glance over at the bed where Nikolai still lounged. “You could be helping me dress, you know. That is part of your new duties.”</p><p>“If I helped you dress, I’m afraid we wouldn’t get too far,” Nikolai said lazily, his gaze on the prince’s every move. “I’d have to stop every few minutes to touch, and it might be a slow process.”</p><p>Jagger gave a decidedly un-princely snort and sat down on a chair with his socks and boots. “I have all my...uh...erogenous zones covered up now, so you can come help me with my boots.”</p><p>Nikolai got up and walked over to him, bending down in front of him. “Oh, but Princeling, that’s where you’re wrong. All of your parts are erogenous. For example, take this little foot.” Smiling, Nikolai took it in his hand. “This little foot is very sexy.” He bent over it and his tongue licked all the way up the arch to the big toe, which he took in his mouth and sucked with a loud slurping noise.</p><p>Jagger laughed and tried to pull his foot from Nikolai’s hand but couldn’t budge it. He stuck his other foot against his chest to push him back and only succeeded in aiding its capture by Nikolai’s other hand. This foot got the same treatment, and soon the prince was laughing and squirming as he tried to get away, landing on his ass on the floor beside Nikolai.</p><p>The door opened and Higgins stood breathlessly in the doorway, clutching the clothing, his eyes open wide in alarm. “Your Highness? Are you...is everything...?”</p><p>Jagger looked up at him from the floor, still trying to tug his feet away from Nikolai. “Everything is perfectly fine. Just put the clothing down and leave, please. Tell my father I’ll be out in just a moment.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Niki, please!” Jagger said, turning back to his new concubine. “Release my feet immediately!”</p><p>Nikolai gave his toes one final lick and released them, sitting back on his heels and smiling. “Yes, Master. Anything you say.”</p><p>“Humph!” Jagger got to his feet, pulling down his tunic and tossing back his hair. “I wish I believed you meant that. Please dress yourself, Niki.” Nikolai stood up and walked over to the pile of clothing the servant had brought in and held up a pair of trousers with raised eyebrows.</p> <p>“You seriously expect me to wear these?” The trousers were black, and of a loose, flowing material, with very wide legs and a drawstring waist.</p><p>“I think you would look quite nice in them. There’s a tunic, too, I believe.”</p><p>“A tunic? Looks like a dress.” Nikolai pulled the trousers on and then held out the sleeveless tunic, which was made of a diaphanous material that came down to his knees and showed off every aspect of his upper body. He shook his head, smiling, and pulled the tunic over his head. “How do I look?” He twirled in front of the prince, who smiled at him affectionately and slapped him on the ass.</p><p>“Quite edible, actually. Now come over here and let me put your collar on you.”</p><p>Nikolai’s face assumed a mutinous expression. “No fucking way.” He crossed his arms and glared at Jagger.</p> <p>“Niki!”</p><p>“No. You can come over here and try to make me if you like.” He sat down on the bed and grinned evilly.</p><p>“Niki,” Jagger said in his firmest tone. “We don’t have time for this. My father is waiting for us.”</p><p>“If you’re pressed for time, I’d suggest you put that collar away. Otherwise we’ll be here a while.”</p><p>Jagger blew out an impatient breath. “Fine then. But this isn’t over, and we’ll discuss it when we return. If you continue to be so obstinate, I’ll have to spank you.”</p><p>Nikolai raised his eyebrows. “Really? Can you do it now?”</p> <p>Jagger made an impatient noise and stamped his foot. “Niki, please cooperate.”</p><p>Nikolai got to his feet again and came forward to offer Jagger his arm. “I’m sorry, little Master. Shall I escort you to your father?”</p><p>Jagger laid his hand on top of Nikolai’s forearm and regally inclined his head.</p><p>* * * Nikolai looked down on his little prince with pride. He really was such a beauty. Jagger sat regally beside him in the open transporter, staring straight ahead, his silky hair blowing around his face. His eyes looked brighter in the sunshine and they were fairly snapping with the anticipation of the coming confrontation. When the king told Jagger the Rogers were demanding that a Jayronian delegation come to speak to them, he’d bristled with anger.</p><p>“How dare they?” he’d asked in outrage. “They’ve always come to the palace in the past. What’s on their minds, father?”</p><p>“I don’t know,” King Larius said, rubbing his forehead. “Their representative said they needed</p><p>the bauxite shipment and are angry we let it slip through our hands.” The king glanced at Nikolai and</p><p>back to Jagger. “They made certain threats.”</p> <p>“Bastards!” Jagger began to pace angrily up and down the throne room while Nikolai watched</p><p>him quietly, his eyes alive with speculation. What the hell was this about? What could they possibly</p><p>have on the Jayronians to make them bow to their demands?</p><p>His father shook his head. Nikolai could see that he was a handsome man of middle age, though</p><p>his eyes were deeply shadowed and lined. He looked exhausted. “It does no good to be angry, son.</p><p>We must find a way to give them what they want.”</p><p>Jagger seemed to be filled with rage, but he nodded. “I’ll go and speak to them and do what I</p><p>can. They must listen to reason!”</p><p>“Be careful, Jagger. I can’t lose you too! I know how your temper can make you lose control</p><p>sometimes.”</p><p>Jagger waved the idea away and kept pacing. “They’re going to give me some answers this time,</p><p>damn them, if they know what’s good for them.” He stopped and stared at Nikolai. “You will</p><p>accompany me.”</p><p>Damn right I will. “Yes, Prince Jagger,” he said respectfully. Jagger turned back to his father.</p><p>“I’ll talk to them, and report back to you. In the meantime, contact the Lycans. Tell them they must</p><p>bring us the shipment of bauxite back if they want to see their family member alive again.” He strode</p><p>rapidly from the room, calling over his shoulder, “Come with me, Niki.” Nikolai followed him to the</p><p>door where he waited impatiently with his hand outstretched to take Nikolai’s arm. Nikolai stepped</p><p>up next to him and extended his arm so the prince could be escorted from the room. As they walked down the long corridor, Nikolai bent down to whisper in his ear. “Planning to</p><p>kill me, little Prince?”</p><p>“What? Oh, of course not, but your stepbrothers won’t know that. It’s just a bluff, Niki.” He</p><p>looked up at him with affection. “Of course, I do still owe you that spanking.”</p><p>Nikolai grinned down at him. “Your wish is my command, Princeling. Do we have time before</p><p>we leave?”</p><p>“Stop. Don’t distract me. I have to prepare myself to meet with these people, and I want to keep</p><p>my anger. There’ll be time to play with you later on.”</p><p>“I certainly hope so,” Nikolai murmured. The prince shot him a quelling glance and led him back</p><p>to their rooms so he could retrieve his weapons. “Put your boots on too, Niki. They didn’t cut those</p><p>off, thank goodness. I never would have found anything to cover those big feet of yours. I need to get</p><p>my sword and my dagger.”</p><p>“I need one too, little Prince, if you want me to defend you,” Nikolai said, sitting down to pull</p><p>on the boots. He glanced up at Jagger when he hesitated. “Princeling, I have no wish to harm you.</p><p>Surely you realize that by now.”</p><p>“Yes,” the prince said slowly. “But we’re still getting to know each other, Niki. I’ll give you a</p><p>small dagger to defend yourself, if necessary, but no sword yet. I’ll take care of you, should they</p><p>prove treacherous.”</p><p>The idea of his little prince taking care of him warmed his heart, but at the same time, it alarmed</p><p>Nikolai a little. Jagger was way too over-confident about his abilities, even cocky. No matter how</p><p>well-trained he might be, he was still young and couldn’t be all that experienced. His body was</p><p>beautifully muscled, but still small and slim. Up against the Rogers, he might not fare as well as he</p><p>seemed to think. The Rogers may be thieves, but they had a well-deserved reputation for being</p><p>ruthless and malevolent. It wouldn’t do for his prince to underestimate them. Nikolai didn’t really</p><p>need a weapon to defend his mate—his teeth and claws would be more than enough if he shifted. But</p><p>with men like the Rogers, a show of force was important. For now though, he would agree. Nikolai stuffed his voluminous pants legs into the tops of his boots, and looked down at himself.</p><p>He thought he looked a little like the ancient, swashbuckling pirates himself. All he needed was a tricornered pirate hat to complete his look. He stuck the little dagger his prince handed him into his boot</p><p>and stood up to offer Jagger his arm.</p><p>Jagger looked him up and down approvingly. “You look quite dashing in this outfit, Niki. When</p><p>we get back to the palace, it will be my pleasure to strip it off you.”</p><p>Nikolai felt his cock fill out. He’d always been the dominant partner in his relationships up to</p><p>now, and it was odd but thrilling to have his little prince be so bold and flirtatious with him. He was</p><p>a little embarrassed to feel a blush staining his cheeks, and Jagger laughed and put a proprietary hand</p><p>over the tenting in his pants. He leaned in and gave Nikolai a quick kiss, and it took a great effort for</p><p>Nikolai to resist taking Jagger to the floor.</p><p>Instead he straightened his back as Jagger took his arm and escorted his mate to the transport that</p><p>awaited them outside. Ten of Jagger’s best men accompanied them on their journey, and they rode in</p><p>the transports behind them. Not enough to defend their prince from any real attack, but Nikolai</p><p>doubted the Nilaniums would try anything at this point. They’d asked for a parley, and that’s what</p><p>they were getting. If anyone tried to touch his mate, he wouldn’t live to tell the tale. In a little under an hour, they reached their destination. The pirates’ stronghold was a jumble of</p><p>metal buildings, behind what was probably an electrified fence. A guard at the gate swung it wide for</p><p>them as they approached and parked outside the largest building. Jagger jumped out as soon as they</p><p>came to a stop and waited for his men to gather around him. He was frowning and biting his lower</p><p>lip, looking around them nervously. Nikolai touched his shoulder and he relaxed a bit, smiling over at</p><p>him. “I’m all right. Just a little anxious.”</p><p>Nikolai nodded. “I’m right behind you, Princeling.”</p><p>“Good,” Jagger said and reached behind him to squeeze Nikolai’s arm. He squared his</p><p>shoulders and motioned for his men to follow him to the front door. The interior was dim and cool.</p><p>Nikolai’s senses were on high alert, and he could smell the Nilaniums ahead about a hundred yards. Jagger walked unflinchingly ahead of them, and Nikolai once again felt pride in his brave little mate. He just hoped it was bravery and not foolhardiness, and he wouldn’t have to kill every Roger in the</p><p>building to protect him.</p><p>They rounded a corner in the long corridor and came to an open door with the Rogers within. It</p><p>was a throne room, of sorts, with a large chair sitting at the back wall, and a long table on either side</p><p>of it. Lounging at the tables was a motley crew of Nilaniums, all armed to the teeth and glaring </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>sullenly at them. In the throne chair sat a big man with a black, untrimmed beard. He was of middle</p><p>age, tall and heavy set. He glared as the prince and his party approached, and Nikolai felt his eyes</p><p>roam over him before coming back to rest on Prince Jagger.</p> <p>“Prince Jagger. Nice to see you again. How’s your father?”</p><p>“This isn’t a friendly visit, Captain Garth, so stop pretending it is,” Jagger said sharply. “Why</p><p>have you asked us to come? Is something wrong with...”</p><p>“My hostage? No, she continues in good health. She’ll remain that way as long as you cooperate.</p><p>I must say the bitch complains a lot, though. I think she’s been quite spoiled.”</p> <p>Jagger stiffened and would have leaped forward if Nikolai hadn’t caught him around the waist</p><p>and restrained him. “You dare insult her to my face!” he shouted furiously. “I’ll kill you!” The Nilanium, who had jumped to his feet and drawn his sword when he saw Jagger’s reaction,</p><p>lowered it to his side again and sat back down. “It’s a good thing your man stopped you, Prince</p><p>Jagger. It would have been a shame to run you through with my sword.”</p><p>“And it would be a shame to rip off your head and stuff it up your ass, but that won’t stop me</p><p>from doing it if you speak to him that way again,” Nikolai said, stepping in front of Jagger. Garth’s eyes grew wide and he gave a nervous, scoffing laugh until he saw what Jagger couldn’t</p> <p>see from his vantage point, Nikolai’s wicked, sharp fangs sprouting instantly from his gums. Jagger pushed his way back in front of Nikolai, not even sparing him a glance as he squared off</p><p>with the Nilanium chief. “Speak of her again that way, and I’ll kill you.”</p><p>Garth opened his mouth to answer and then glanced at Nikolai’s face as he stood protectively</p><p>behind Jagger. “Uh, yes...sorry, Prince Jagger.”</p><p>“Can I see her?” Jagger asked.</p><p>“No, not this time. Perhaps next time when you bring us the bauxite shipment. Have you made</p><p>any progress in procuring it for us?”</p><p>Nikolai fought to keep his face from registering the surprise he felt. So this was why the</p> <p>Jayronians had tried to steal his shipment. The Rogers held someone as hostage—some female Jagger</p><p>apparently had strong feelings for. Nikolai felt a raging jealousy for whoever the bitch was surge</p><p>through him. He would not share his mate with anyone. The sooner his mate realized that, the better</p><p>off he would be. Nikolai forced his attention back on the conversation going on between his mate and</p><p>the chief.</p><p>“I’m working on the bauxite situation now. We should have it for you in a few days if things go</p><p>as planned.”</p><p>“I hope so, Prince Jagger. If not, we may have to start giving our hostage back to you—in</p><p>pieces.”</p><p>This time, Nikolai was barely quick enough to catch Jagger as he drew his dagger with lightning</p><p>speed and leaped forward to plunge it into the chief, snarling and cursing. Grabbing Jagger by the</p><p>scruff of his neck Nikolai threw him behind him to the other soldiers and growled, “Hold him!” He</p><p>turned and faced the chief. “Harm one hair on the lady’s head, and you’ll answer to me.” Garth turned pale and nodded. He had seen the red eyes glowing in Nikolai’s face and from his many confrontations over the cycles with Lycans, he knew exactly what they were capable of doing.</p><p>“Sh-she’ll come to no harm.”</p><p>“Good. You’ll get your shipment in a few days.” He turned on his heel, taking Jagger by the arm</p><p>and dragging him from the room. His prince was spitting mad, and fought him all the way outside to</p><p>the waiting transport. The other Jayronians followed uneasily, not sure if they should go to their</p><p>prince’s aid or not. Some of them, too, had gotten a glimpse of Nikolai’s face as he turned back to</p><p>them.</p><p>Once he got Jagger back in the transport and headed out the gate, he released him from the</p><p>headlock he had on him. Jagger sat up and would have struck him, if Nikolai hadn’t grabbed his arm. “Settle down, Princeling. If I hadn’t gotten you out of there when I did, they’d have attacked all</p><p>of us. You really need to watch that temper of yours.”</p><p>Jagger pulled his arm back and sat back in the seat with a huff, contenting himself with a furious</p><p>glare at Niki, one that promised retribution later on. He crossed his arms and refused to look at</p><p>Nikolai all the way home. Nikolai knew he was still upset about the chief’s words and decided to</p><p>leave him alone. By the time they reached the castle, Jagger seemed to have calmed down some, and</p><p>when he got out of the transport, he held out his hand for Nikolai’s arm.</p><p>“I’m still furious with you for laying hands on my person like that. I may decide to beat you after</p><p>all.”</p><p>Nikolai tried valiantly to hide his smile. “Yes, little Master. Whatever you say.”</p><p>Chapter Four</p><p>Jagger was quite irritated at his concubine and when he got him to their room, he’d told him to wait there for him the rest of the afternoon. Really, Niki had overstepped himself by throwing him back to his men and telling them to hold him while Niki himself faced Jagger’s enemy. He admired his loyalty, but he needed to learn his place. He did inform the servants to bring Niki a big midday meal. He didn’t want him to go hungry, even if he was angry with him. With his huge appetite, he knew Niki wouldn’t be able to go long without food.</p><p>Jagger stayed away all afternoon, busying himself with the accounts, trying to make sense of the mess their finances were in. It seemed as if the country was virtually bankrupt. If something weren’t done soon to mitigate this appalling mess, their people would revolt and remove his father from the throne by force. Late in the afternoon, he finally stood up and stretched, ready for his supper and a long hot bath, preferably one that included his big, handsome concubine. He was tempted to give him a sound spanking after all, if he hadn’t thought Niki would enjoy it too much. Instead, he had plans to let Niki make things up to him in bed later on.</p><p>Jagger left orders for his supper to be delivered to his rooms and went down the hall to deal with Niki. He wasn’t exactly sure what he was going to do yet, but he was determined to force his submission to him. His stepbrothers would be coming for him soon, and he needed Niki to know that he belonged to him and that he would protect him. They needed to forge a strong, unbreakable bond between them before the group arrived. When he got to his rooms, there was no sign of Niki, either in the bedroom or in his bathing chamber. He was about to become alarmed when he heard a noise coming from his private balcony. Jagger’s room was on the second floor of the castle, right at the back, so his balcony had a lovely view of the snow-capped mountains in the distance. Niki was standing by the rail, looking out at these mountains as Jagger stepped out.</p><p>Nikolai turned to smile at him. “Still mad, baby?” “Master,” he said, frowning. “And yes, I am. I can take care of myself, Niki. I don’t need your interference.”</p><p>“Well, Princeling, you did say I was to act as your bodyguard.”</p><p>“Yes, but only if I need backup. I could have taken care of that fool without your help.”</p><p>“To what end, Princeling? If you had managed to kill him, all twenty or thirty of his men would have jumped on us, probably killing most of your men in the process when they tried to protect you. A leader needs to have better control.”</p><p>“Don’t lecture me, Niki,” Jagger said coldly. “You forget your place.” Jagger turned and walked back into the bedroom, furious because he knew Nikolai was right, but when the chief had threatened his mother, he’d totally lost control. Partly he was embarrassed because he’d really wanted to impress Niki, and he’d probably only managed to make Niki lose respect for him. Sometimes he felt so out of his depth, with people expecting him to be strong and in control at all times. Even his father was leaning on him more and more since his mother’s capture. He wished sometimes he could let it all go, and let someone else take over for a while.</p><p>He pulled off his boots and threw them halfway across the room in frustration. Standing by his clothes cabinet, he began to tear at the buttons on his shirt. All he wanted at this point was to sink into the warm water of the bathing pool and let the water soak away his stress and despair. A hard arm came around him and pulled his body close. Jagger knew that touch. He twisted in Niki’s arms, but was turned firmly back around.</p><p>“Stay still.” The deep, honeyed voice seemed to purr in his ear. “Let me do it, love.” He shivered at Niki’s touch and closed his eyes, wanting to pull away from the hardness pressed against his ass, but finding that he couldn’t seem to move. Niki’s strong fingers finished with his buttons and slipped the shirt from his shoulders. Pulling him back firmly against his body, Niki moved his strong fingers over Jagger’s chest, teasing his nipples and tugging on them gently. Jagger closed his eyes and let the sensations sweep over him. He relaxed into Niki’s hard chest, only to jerk in shock a moment later as Niki’s hands moved down to unlace his trousers. A warm hand plunged inside, grasping his half-hard shaft and bringing it out.</p><p>“Niki, no...” Was that him whimpering? He tried to pull away, but the hand on his waist kept him trapped. Gods, Niki was so strong.</p><p>“Shh...be quiet, Princeling.” His hand began to move, warm and strong over his cock, rubbing his thumb over the head of his shaft again, making his knees go weak. Pre cum leaked from his cock, spilling onto Niki’s hand, but his hand only moved faster, feeling like silk against his shaft. Jagger felt more and more excited, unable to be still.</p><p>“Ahh, Niki. I’m coming...”</p><p>“No, sweetheart. You won’t come until I tell you to.”</p><p>Jagger’s head fell back onto Nikolai’s shoulder. He heard himself making a sound that was like a low keening. His breathing was coming faster, and he thrashed his head back and forth, “Niki, please!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He heard a soft chuckle in his ear. “Come, baby. Come in my hand.”</p><p>With a soft, guttural noise, Jagger’s orgasm ripped through him, leaving him shaken and dazed, barely able to stand. Niki gathered him in his arms and carried him to bed. He jerked off the pants that had slid to his ankles and threw them on the floor. Keeping his gaze on Jagger, he removed his own clothing and then quirked an eyebrow at Jagger. “Do you have lubricant?”</p><p>Jagger nodded and pointed toward a low cabinet by the bed. His mouth went dry at the sight of Niki’s magnificent body. He was purely masculine, with broad shoulders and slim hips, his entire body rippling with muscles. His cock was long and thick, with blue veins coursing up the shaft. The tip was pearled with pre cum.</p><p>“There’s a bottle of oil in there, b-but n-not now, Niki, please. I’m too...I-I can’t again. I’ll take care of you later, I promise.”</p><p>Niki smiled down at him. “Oh you can, love, and you will. But it’s not you who’ll be taking care of things—it’s me.”</p><p>Jagger scooted up to the head of the bed at the predatory gaze Nikolai had fixed on him. Niki grabbed his foot and pulled him back down to his back in one swift move, while at the same time moving his body over his. Niki’s gorgeous cock rubbed against Jagger’s and Jagger closed his eyes again and turned his head away, a deep moan escaping his throat. He felt Niki’s fingers in his hair, tugging his head back around. “Open your eyes, little one. I want you to see who’s fucking you.”</p><p>Jagger raised his eyebrows. “N-No! Niki, I’ve never...no!”</p><p>“Oh, yes, baby, I’m going to claim you. I’ve waited as long as I can. You’re mine, love, don’t you see?”</p><p>He lowered his head and took Jagger’s lips with his, licking at them until Jagger’s mouth fell open and let him in. His tongue stroked the inside of Jagger’s mouth, their breath mingling as if they were one. Jagger gave in with a little cry and tentatively thrust his tongue back to meet Niki’s. Niki made an approving sound in his throat, and as the kiss deepened, he ground his groin against Jagger’s until Jagger thought he’d lose his mind.</p><p>With a final little nip on Jagger’s bottom lip, he pulled back his head and gazed down into Jagger’s eyes. “I want to claim you as my mate, sweetheart. Once I do, you’ll belong to me forever— there’ll be no going back for you. Do you want this? Do you understand what it means?”</p><p>Jagger nodded. He was almost mindless with wanting, needing this man, and he would have agreed to anything he asked. Niki smiled down at him and gave him another little bite on his bottom lip. “I’m not sure you really understand, darling. You’ll be a Lycan mate. Do you know what that means?”</p><p>“Of course,” Jagger murmured, nodding his head and tilting it up for more kisses. “Don’t be presumptuous, Niki. Of course, I know what it means to be your mate. I’m a prince of the kingdom, after all. And I want to be yours. Make me yours.”</p><p>Nikolai moaned and buried his face in Jagger’s neck. “Gods, you smell so sweet.”</p><p>He got to his knees and slowly rolled Jagger over, lifting his hips to pull pillows under them. His hard fingers massaged oil gently into his crease and ghosted over his hole. Jagger tensed, and Niki put a hand on the cheek of his ass. “Open to me, love. I won’t hurt you.”</p><p>Jagger nodded and tried to relax his body, opening his legs even further. Niki stroked his back and with an oiled finger gently probed around Jagger’s hole. No one had ever touched him there, but it felt right with Niki. The finger slowly pressed inside and when Jagger tensed against the burn, Niki leaned over him and kissed his ear, licking at the nape of his neck until he relaxed again. He whispered wickedly in his ear as he slowly moved the finger in and out. “Has anyone ever touched you here, love?”</p><p>Jagger shook his head, and Niki gave a soft chuckle as he nibbled at his ear. “Good. This is mine, and you’ll never feel anyone else’s fingers here again.” Those whispers in his ear were driving him crazy. He arched his back and couldn’t decide whether to lean into them or pull away. He felt another finger go inside him and he groaned at the stretch of those fingers deep within. They only moved in farther and Jagger cried out, trying to get away until they suddenly brushed against the spot he’d touched for others, but had no idea of how it felt for himself. So this is why some men liked this so much, and wanted only to bottom. It was incredible. The fingers brushed over the spot again and again until Jagger was mindless, thrashing his head wantonly and pushing his ass up into the air to get more of the feeling.</p><p>Suddenly the fingers pulled away and Jagger almost sobbed in frustration and need. Then he felt something else nudging his hole, something larger, and he felt a moment of panic. Before he could move away, Niki’s hand pushed under him and closed around his cock, pulling down and back up hard several times in a row. He couldn’t decide whether to arch forward or back—he needed more pressure, more sensation. Niki thrust into him again and again, his large member going over and over that spot until Jagger screamed out again.</p><p>“That’s right, baby. Sing for me. Tell me how it feels.”</p><p>Jagger’s whole body seemed to convulse around him, tightening on his shaft, and he heard Niki grunt, as if in pain. He began to thrust harder and harder, going deeper with each stroke. Jagger gasped at the burn he felt, but Niki’s hands continued to work his cock until he thought he’d lose his mind. He couldn’t decide if he should beg him to stop or beg for more.</p><p>“I’m going to give you the mating bite, little one. I can’t hold back. It will hurt for just a moment, but I’m here. I’m taking care of you. I’ll always take care of you.”</p><p>Jagger nodded and Niki bit deeply into the side of his neck. It felt like twin needles boring into him, and he screamed in pain. Right away he felt something different inside him, something hard and unyielding, filling him uncomfortably full. Nikolai had thrust himself into him and gave a wordless cry as he strained against him. The next instant, feelings like he’d never had before surged through him, filling him with pleasure. He began to spurt his orgasm uncontrollably, while at the same time, he felt Niki’s hot seed flooding into him. Instead of dissipating, the feelings only got stronger and he was flying, stars moving past his eyes at an alarming rate. Vaguely, in some other part of his mind, it registered that Niki was licking his neck, bathing the bite in saliva, and it felt—wonderful. He leaned into it, and felt the stars rushing at him till the blackness came down around him like a curtain.</p><p>* * * Nikolai lay inside his lover for a long time. He’d knotted Jagger, and he was unable to pull away for almost an hour. He’d never knotted anyone before, of course, and never wanted to, but once he bit into his mate’s sweet neck, his wolf came forward, strong and bestial and out of control. His gland swelled, locking them together. The venom in his cum when the knot came out was causing the change to come over Jagger even now. It wouldn’t kill him, of course, but it would initiate the change. Jagger would become stronger and faster, even better-looking. He would now live a long life, like Nikolai, and Jagger would be unable to be parted from his wolf without causing himself extreme emotional pain. Jagger would never again be attracted to another man, and would be unable to sustain an erection unless it was for Nikolai, thus ensuring his faithfulness and devotion.</p> <p>Nikolai pulled out of his lover slowly, hating to leave his body. He pulled Jagger into his arms, gently stroking over his side and hip, calming and soothing him as his body jerked and trembled. Jagger was deeply asleep, another aftereffect of the mating bite. His cheeks were pink already with the fever that was taking his body temperature higher and higher. It wouldn’t last long, only a few hours, but when he awoke, he’d be a Lycan mate.</p><p>He hoped Jagger really did understand what he’d agreed to. Sometimes it was hard to tell with his little mate. His little prince was so arrogant and downright cocky at times, wanting everyone to believe he was wise beyond his years, but surely everyone knew the nature of the Lycans, even in this backwater. His family had been trading with the Jayronians for many cycles. Yes, certainly he wasn’t just pretending to be knowledgeable. His little mate must know what he had agreed to. The mating pull usually worked both ways, with the mate of the wolf just as unable to resist it as the Lycan. The pull was certainly strong for Nikolai with this little one. He could never leave him now, not for anything or anyone, and he’d felt that way since he first laid eyes on him.</p><p>Nikolai gathered him closer and kissed the back of his neck over the bite. He couldn’t have held off another minute to make him his. Being around him all day, making love to him the night before, and breathing in his scent had finally overcome his efforts to wait. The mating pull had been urgent. His wolf approved of his decision and was finally lying asleep inside him after raging at him for two days. Snuggling into Jagger’s hot little body, he relaxed all the tension he’d been feeling, all the effort it had taken him for the past two days not to claim his mate. Feeling sleep stealing over him, he whispered in his mate’s ear, “I love you, sweetheart. Only you, forever.”</p><p>As if his words reached him in his dream, Jagger sighed softly and pushed his bottom back against Nikolai. Incredibly, Nikolai felt his cock thickening. Gods, could he ever get enough of this sweet boy? Nikolai pressed his cock into Jagger’s crease, and allowed sleep to take him away.</p><p>A loud knocking on the door a few hours later woke him up with a start. “Your Highness? Your Highness, the delegation from Lycanus 3 has arrived more quickly than we anticipated. They’re waiting in the throne room and your father asked me to come get you—both of you—right away.” His little prince woke up beside him and looked around him in confusion. He’d been deeply asleep. Nikolai reached for him and drew him back down into his arms. His fever was almost gone now, and he hated to see him disturbed. The prince frowned and bit his bottom lip.</p><p>“They’re here so soon? What time is it?” Nikolai glanced over at the clock on the wall. “Almost midnight, love. My...uh...stepbrothers have always been an impatient bunch. I wish they’d waited until morning, at least.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jagger struggled to sit up again, and this time, Nikolai let him. He was frowning and shaking with anger. “I won’t give you up! I won’t! I’ll allow them to see you, but only under heavy guard. If those bastards think they can come in here and take you from me, they have another think coming!” He turned to Nikolai and scowled at him. “You’re not leaving with your family, Niki. You’re my family now. You belong to me, and I won’t give you up. You’re mine, and you and your family will just have to get used to that idea.”</p><p>“Calm down, baby,” Nikolai said, stroking and petting his back. “I’m not leaving you.”</p><p>“No, you’re not,” Jagger said firmly, his hand gripping Nikolai’s thigh. “If they try to force the issue, I’m prepared to defend myself and my property. Where’s my sword?”</p> <p>“No,” Nikolai said firmly. “No fighting or trying to show them what a little savage you are. If you pull a sword on them, my brothers would attack you the minute they saw it, and I don’t want to have to hurt any of them to protect you.”</p><p>Jagger looked at him in amazement. “Y-you would do that?”</p><p>“Of course I would,” he said with a shrug.</p><p>“B-but against your own family?”</p><p>“If I had to...” He kissed the side of his neck. “You belong to me too, baby, and I don’t have any intention of giving you up either.”</p> <p>“Oh...well...all right then. Stall them for a few more minutes until we can—until I can dress, please.”</p><p>Nikolai strode to the door and opened it, surprising the king’s aide, whose eyes grew wide at the sight of Nikolai’s naked body. “Tell the king we’ll be there in a few minutes.” The aide nodded and scurried out, while Jagger climbed from the bed. He went over to his clothes cabinet and bent over looking through his things, while Nikolai went back over to the bed and began pulling on his clothes that were scattered nearby.</p><p>“We have to hurry. Your family is probably giving my father a hard time.”</p><p>“No doubt,” Nikolai said with a grin.</p><p>Nikolai finished dressing and came closer to him, dropping a kiss on his forehead. “Settle down, baby, nothing bad is going to happen.”</p><p>The door flew open and the same aide as before stood wild-eyed in the doorway. “I’m sorry, Your Highness, but the Lycan delegation is becoming quite...uh...restless. They’re demanding to see your concubine, and they said if we don’t produce him immediately—”</p> <p>“Yes, yes. We’re coming.” Jagger turned to Nikolai. “May I have your arm then, to escort me?”</p><p>Nikolai grinned and bowed. “Of course, little Master.” He held out his arm and Jagger placed his hand on top, just barely touching it, and giving him a quelling look. “Don’t call me that,” he snapped and Nikolai grinned as he inclined his head.</p><p>* * * Nikolai was having an interesting night. He had accompanied his little prince down the seemingly endless corridors to the throne room, the breeze blowing through the thin material of his ridiculous wide trousers, his feet bare on the cold marble tile. He hadn’t taken the time to pull on his boots or even the tunic. The tunic was see-through anyway, so he figured, why bother? It was just his brother and cousins, after all.</p><p>When they walked into the throne room, he saw his family right away—Lucas, his cousin and his alpha, Kyle, his brother, and Larsson and Konnor, two of the other alpha cousins who made up his closest male relatives. Only his cousin, Blayde, still on his honeymoon, was absent, but Nikolai had no doubt he’d been sent for as well. When he walked in, he saw both relief and outrage on their faces, as they took in what must seem to them his outlandish appearance. Lucas’s mouth dropped open, and he sputtered a few times in outrage. He whirled around to glare at the king.</p><p>“What the fuck is he wearing—is that a dress?” His voice became so loud and high-pitched at the last words that an old dog lying beside the throne jumped up and howled in alarm.</p><p>Nikolai looked down in confusion. The wide legs of the harem pants must look a lot like a skirt. He grinned and stepped forward to take his cousin’s arm and explain. Instantly, it seemed, Jayronian guards stepped between them with guns drawn. Nikolai stopped, but growled menacingly at them, his red eyes glowing. He tensed his muscles, ready to shift and attack if they moved against his cousin. It was one thing for his little mate to be a pain in the ass, but quite another for the guards.</p><p>When Lucas and the others heard his growl, they joined in, until a whole chorus of menacing rumbles filled the hall. Sensing imminent trouble, Nikolai grabbed his prince’s hand and pushed him against the wall. He pointed a finger at him. “Stay right there,” he said, and turned around, holding out a hand to Lucas to try making peace. “No, Lucas, it’s all right. I’m fine, really. I haven’t been harmed at all.”</p><p>Lucas hesitated, his outraged gaze going straight to his bare chest, the wide harem pants, and then traveling further down to inspect Nikolai’s bare feet. His eyes blazed again, and Nikolai spoke to him in a calming voice. “Yes, they made me a kind of harem slave, but it’s not exactly how it looks, Lucas. Really, I’m fine.”</p> <p>The red glow began to fade a bit until Jagger stepped around Nikolai with a princely swagger to stand in front of him with his sword drawn. He literally growled back at the big Lycan. “How dare you come here and threaten my father and our court? Maybe you need reminding that we hold your stepbrother as a hostage, and he’s in my power. This slave belongs to me! You’d do well to remember that fact and show some fucking courtesy. You’ll never get your cruel hands on him again, if I have anything to say about it!”</p><p>“Cruel?” Lucas asked incredulously. “What the hell are you talking about?”</p><p>“Niki has told me how wickedly you all treated him. He told me how hard you made him work and how you made him sleep in the cinders of the fireplace to keep warm. He told me how mean you all were to him because of your jealousy, and because he was just your poor stepbrother. All that is over now, because he has me to protect him! Go back to your ship and count yourself lucky that I let you live to tell the tale.”</p><p>Lucas’s eyebrows rose and his mouth fell open. Before Nikolai could intervene, he removed the two guards with a sweep of his hands and picked Jagger up by his tunic, ripping the sword from his hand and holding him up in the air, snarling in his face. He shook him so hard Jagger’s head snapped back. Nikolai reacted instinctively, grabbing Jagger around the waist with one hand and pushing Lucas back from him with the other. Nikolai shifted before he even thought about it and thrust Jagger behind him. “Mine!” he snarled. In a low, bestial voice, he rasped, “Don’t touch him!”</p><p>Lucas and the rest of his family gaped at Nikolai in amazement. Kyle and the cousins rushed over to help Lucas to his feet and all four of them stared at Nikolai with both surprise and dawning awareness.</p><p>Nikolai struggled to calm himself and shift back to his human form, aware that all around him the Jayronians, including the king, were screaming and crawling all over each other to get away. He glanced back at Jagger and found him pressed against the wall, his eyes round with fear and shock. Lucas came forward quickly and embraced Nikolai, whispering in his ear. “Your mate? This arrogant young pup is your mate?”</p><p>Nikolai nodded, still unable to talk plainly with a mouthful of extra teeth.</p><p>Lucas grinned at him. “Take him then, and let’s get the hell out of here before they recover. Since these are your mate’s people, we’ll try not to kill any more than is absolutely necessary.” Lucas gave him another feral grin and turned to the rest of the family. “Okay boys, show ’em what you got.”</p><p>All of the Lycans shifted, and the few guards who had bravely remained behind to protect their prince scattered like fallen leaves. Nikolai turned and crossed over to the wall where Jagger was still pinned. Jagger looked up at him with abject fear evident in his eyes. Nikolai tried to smile at him to reassure him, but it must have seemed to Jagger as if he were baring his teeth, because his eyes rolled back in his head, and he fainted dead away.</p><p>Nikolai caught him, slung his limp form carefully over his shoulder, and followed his family as they left the castle. Encountering no one, except a few servants, who mostly ran screaming from the group, who were still in their bestial forms, they made their way outside to their waiting land transport. The keys were still in the ignition so they drove off at a high rate of speed, with Nikolai holding a still unconscious Jagger carefully in his lap, pulled up close to his chest. The ship was docked at the same landing site as Nikolai remembered, and they all ran inside and secured the hatches, although by this time, they were certain no one was following.</p><p>Nikolai carried Jagger to his quarters and laid him gently on the bed. Catching a glimpse of himself in the full-length mirror on the back of the door, he shook his head ruefully, realizing just what his little prince had seen. Looming about seven feet tall in his Lycan wolf form, his upper body was covered in stiff black hair and his head was that of a wolf with glowing red eyes. He was still wearing the flimsy black harem pants Jagger had given him to wear, though they now hung mostly in tatters. He took all the weapons from his mate and pulled the covers over him before grabbing some clothes and boots from the closet and locking the boy inside. Jagger was already stirring, and the next time Nikolai saw him, he needed to be completely back to his human form.</p><p>Leaning against one of the interior walls, he took a couple of deep breaths and forced himself to change back to his human form. When he felt like himself again, he pulled on the clothes and boots and made his way to the comm deck where he knew his family would be waiting.</p><p>As the door opened, Kyle stood and came over to give him a rough hug. “You scared the shit out of me, little bro! When you sent your emergency signal, I didn’t know whether you were alive or dead out there.”</p><p>“Well, hell, Kyle, I couldn’t have sent it if I’d been dead, now could I?’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle cuffed him on the side of the head. “You know what I mean, damn it. I was worried about you.”</p><p>Larsson laughed. “I only wish I had a picture of you in that dress!”</p><p>“Damn it, it wasn’t a dress! It was harem pants. They didn’t have anything else in my size, so I said I’d wear them. I didn’t know Lucas was going to blow a gasket when he saw them.”</p><p>Lucas smiled and shook his head. “Harem pants...leave it to you to be kidnapped and wind up in a harem!”</p><p>Nikolai grinned back at him and came over to lean against the rail. “It wasn’t a harem exactly— just me and my mate, and I was his concubine—it’s kind of a long story.”</p><p>Lucas regarded him fondly, a look of relaxed relief on his face now that they had him back. “You just couldn’t stand to be outdone by Blayde, could you? You had to go and get yourself a prince.”</p><p>“Prince Charming at that!” Konnor said, bent over laughing. “I thought I’d bust a gut when your handsome prince was talking about you sleeping in the cinders! I remember that old fairy tale Nanna used to tell us.” Nanna had been the human concubine of their Lycan great-grandmother, purchased for her by their notorious great-grandfather to help distract her from his sexual exploits. She had been a sweet woman with a wide, comfortable lap, and she would tell the cousins stories for hours. The story of Cinderella had been one of their favorites when they were all quite small.</p><p>Kyle and the others joined in the general laughter, and Nikolai shrugged. “Well, he wondered why I wasn’t fighting him about being his love slave. I had to come up with something. Thank goodness he’d never heard the story of Cinderella before.”</p><p>“Cinderella...” Lucas shook his head, still grinning. “With me as the wicked stepmother, I guess.”</p><p>Nikolai returned his grin. “Yep—and all the rest of you as wicked stepsisters.”</p><p>Lucas shook his head. “I guess the wicked stepmother role is marginally better than being the fairy godmother.”</p><p>The on-board computer interrupted then, the monotone female voice reporting calmly. “Attention, please. Disturbance on deck two, cabin four.”</p><p>Nikolai recognized his room location with a sinking feeling in the pit of his stomach. “What kind of disturbance, computer?”</p><p>“The life form inside the room is trying to break down the door, sir.”</p><p>“How in all the hells is he doing that?”</p><p>“By kicking it, sir.”</p><p>Nikolai stood up and sighed. “Shit. Only Jagger would try to kick down a steel door. I better go check on him before he hurts himself. I hoped he’d stay asleep for a little while. Guess not.” He waved a hand at his family as he walked toward the lift. “Be back as soon as I can.”</p><p>Nikolai could hear the banging sounds as he entered the corridor, and the noise grew louder as he came up to the door of his room, a loud, rhythmic thumping on the other side of the door. Nikolai could barely fit the key in the lock for the strength of the vibrations on the door. Managing to get the key in and swing the door wide open, he was just in time to see Jagger’s boot come toward him. Nikolai caught it in his hand and glowered at his mate. “Damn, baby. It’s a solid steel door. I admire the effort, but did you really think you could kick it down?”</p><p>Jagger reeled away from him, pulling his boot back so forcefully he fell on his ass and scooted backward toward the far wall. “S-stay away from me! Don’t come any closer! Don’t touch me!”</p><p>Nikolai raised one eyebrow and leaned against the door frame. “Settle down, sweetheart. It’s just me. You slept naked in my arms the past two nights. A little late to play the outraged virgin, isn’t it?”</p><p>Ignoring his words, Jagger got to his feet and backed slowly to the wall, his eyes darting around the room, trying to gain an advantage.</p><p>Nikolai stepped further into the room, holding out his hand. “Sweetheart...?”</p> <p>“Stay away! Y-you’re a monster! I-I saw what you did! I saw you ch-change!”</p><p>Nikolai continued to walk slowly toward him, holding his hands out, palms up. “Baby, calm down. I’m Lycan. You know that—you know it’s what we do, right?”</p><p>“Stay away from me!” Jagger broke and tried to run around Nikolai, but Nikolai caught him around the waist and pulled his backside up to his body, wrapping both arms around him and holding him tight. Jagger went crazy, kicking and squirming out of control. He was fighting so hard, Nikolai feared he would hurt himself, so he threw him on the bed and lay down full out on top of him, holding his hands over his head and keeping his kicking legs tightly confined with his own. It took about five minutes of struggling for all he was worth, but finally Jagger exhausted himself, sagging down and trying hard to catch his breath.</p><p>Nikolai pressed his lips to Jagger’s ear, murmuring endearments to him, assuring him he was safe. Finally, his body relaxed, though he kept his face turned stubbornly away, biting his lower lip so hard he brought a few drops of blood to the surface.</p><p>Nikolai licked the drops away and drew back, staring down at his mate. “Better?”</p><p>Obstinately, Jagger refused to look at him. Instead, he said, “Let me up,” in a firm tone.</p><p>“Not until I’m sure you’re not going to hurt yourself freaking out.”</p><p>Jagger made a little snorting sound and cut his eyes resentfully over to Nikolai. “Hurt myself? Damn it, I’m not a child. Please remove yourself from my person. You’re going to take me back home. Right now!”</p><p>The corners of Nikolai’s mouth quirked, but he stayed where he was. “You’ve got it all wrong, love. You don’t make the rules anymore. You’re—what was it you called it? Spoils of war, that’s it. You belong to me now, and I think I’ll keep you.”</p><p>Jagger hissed in a sharp breath and cast Nikolai a furious glance. “No!” he said. “Niki, let me go. Don’t do this!”</p><p>“I think it’s only fair, Princeling. You captured me. Now you’re my captive—it has a nice symmetry to it, don’t you think?”</p><p>Jagger snarled and drew back his fist to hit him, but Nikolai caught his fist in his hand. “Stop it. You’re not back on Jayron. You’re on my ship and subject to my rules.”</p><p>Jagger glared back at him for long moment, his eyes flashing fire and promising retribution. He began to struggle wildly again, swearing and kicking out at Nikolai, who threw him on his back and straddled him, looking down into his face. His mate was being rebellious and defiant, and his wolf reared up in righteous anger. Glaring down at his little mate, Nikolai felt his fangs drop from his gums.</p><p>Chapter Five</p><p>Jagger knew almost immediately he’d made a very big mistake. As he took in Niki’s normally handsome face twisted into a snarl, his ruby eyes grown dark with fury, he stopped his thrashing, breathing hard, his chest heaving up and down. Terrified, he saw Niki bare his teeth at him again, and the sharp, white fangs that had descended from his gums. Despite himself, he shivered, remembering the incredible shift of the wolves earlier in the evening. It had truly been terrifying to see those creatures suddenly emerge in his father’s throne room. He knew Niki wouldn’t hurt him in his human form, but he wasn’t sure about this bestial creature. Survival instinct stirred within him, telling him to be quiet. He knew somehow that any further struggling would simply incite Niki to even stronger shows of domination.</p><p>This same strong instinct made him lie completely still and turn his eyes downward. He twisted his head to the side to present his throat. It was difficult to do it, when every natural feeling inside him told him to protect his neck, not bare it, but some primal instinct deep within told him this was the only way to avoid an even stronger show of domination. Niki continued to growl and snarl at him for another moment and then he lowered his mouth to Jagger’s throat, licking a hot, wet tongue along the entire length to his jaw. He made a different kind of growl now, half whine, half rumble deep in his chest. If he’d been a cat, Jagger would have called it a purr. Niki’s hands began to tug impatiently at Jagger’s clothes, soon divesting him of everything and leaving him shivering and naked on the bed.</p><p>The sight of his golden-brown flesh seemed to incite Nikolai even further, and he flipped Jagger over to his stomach with one strong, rough motion. Jagger knew he was about to get fucked into the mattress, but instead of being frightened, he found himself strangely excited. He was aware of Nikolai pulling at his own clothes, and then a large hand went under his stomach and pulled him up to meet a hot, wet mouth. Niki’s tongue probed his hole relentlessly, laving him with moisture as Niki got him ready. Jagger grabbed the blankets with both hands, gasping in shock. No one had ever put their mouth there before, not in his most intimate spot. He couldn’t hold back his startled gasps and screams, but the animal-like sounds he was making only seemed to increase Nikolai’s lust.</p><p>He began to suck and nip at his hole, sticking his tongue further inside. Jagger found he was losing himself to mindless pleasure. Wantonly, he thrust his ass upward again to meet Niki’s mouth, craving more and more contact. He could feel his balls drawing up tight against his body, so very close to losing their load. He felt Nikolai’s cock nudge his hole, and with a wordless cry, Nikolai thrust his shaft up inside him. Jagger arched his back, tightening up and instantly a hard slap came down on his ass. “Don’t fight me! Open yourself to me,” a deep, growly voice said in his ear, and Jagger parted his legs wider, obediently pushing his ass up toward him in invitation.</p><p>A kiss dropped on his back as reward, and Nikolai thrust deep inside him again and again. Niki’s hot breath fanned his ear as he lay across his back, and Jagger cried out as Niki’s huge cock pulsed over that one spot inside him that caused him to lose his mind. Nikolai thrust once more, finally taking Jagger’s throbbing shaft in his hand, pumping it hard once and then again, and Jagger lost all control, spurting uncontrollably. Nikolai joined him a moment later, filling him with his hot cum and straining against him, his breathing harsh and fast. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In another moment, he shifted off his back, pulling out, and Jagger could breathe easier, but he found he missed the feeling of his mate being deep inside him. The next moment, he heard the word mate in his head, and wondered weakly where it came from. He’d never used such a word before, though he’d heard Niki use it. Niki pulled him up closer to him then, and he went willingly, wanting the closeness, needing it. He closed his eyes, just for a moment, and felt sleep stealing over him. He was so tired, so overwhelmed with all that had happened to him. Just for now, he would sleep a while, and try to reason with Niki when he awoke. He buried his face in the pillow and allowed the exhaustion to take him under.</p><p>When he awoke, he was alone again, and a feeling of abandonment filled him before he shook it off and sat up in bed, looking around him. He saw his clothing now folded and placed on a chair next to the bed, but his boots were nowhere in sight. Jagger’s lips drew together in a firm line as he rose and pulled on his trousers and tunic. If the big bastard thought removing his boots would keep him from kicking in the door, he had another think coming.</p><p>He went over and tried the lock, not expecting to find it open, and indeed it seemed firmly bolted from the outside. He began to hurl himself against the door, again with no expectations that he would be able to knock it down, but hoping for some attention from Nikolai, and within a few minutes, he heard someone at the door.</p> <p>Jagger backed away as the door swung open, and Nikolai stepped in, shaking his head. “Really, Princeling? This is becoming monotonous.”</p><p>“Take me back.”</p><p>“No.”</p><p>Jagger bit down hard on the inside of his mouth to stay quiet as they faced off. He wanted to rail against him, but he knew Niki would only throw him back on the bed and humiliate him again. He had to try to reason with him.</p><p>“Why did you take me? Why didn’t your stepbrothers simply take you and leave us in peace? Was it for revenge?”</p> <p>“You’re my mate, Princeling. You know that—you agreed to mate with me.”</p><p>“I agreed to let you fuck me, yes. What has that to do with anything?”</p><p>Nikolai looked at him in outrage. “What are you talking about? Are you trying to say you didn’t know what mating with a Lycan meant? I asked you if you knew and you replied you did—rather arrogantly, I might add.”</p><p>Jagger flushed. “You changed into a...a...monster. I saw you. I had no idea about that.”</p><p>“Jagger, I’m Lycan. What you saw was my wolf form. I changed when Lucas attacked you—to stop him. We can change our form whenever someone threatens us or our mates.”</p><p>“But I thought the stories about Lycans changing into wolf creatures was just a myth. I never knew it was true!”</p> <p>“It’s true,” he said quietly. “We shift.” Nikolai took a deep breath. “Jagger...”</p><p>Jagger made a move to jump to his feet and was pulled back down by Nikolai. He puffed out a breath and folded his arms across his chest. “Just stop talking! I can’t stay here! Wherever this is! You have to take me back. My father needs me, Niki. I can’t just leave him. He must be beside himself right now!”</p><p>“Your father is a grown man, Princeling. He’ll be fine.”</p><p>“No, you don’t understand,” Jagger said, shaking his head.</p><p>“Then suppose you explain it to me. And I mean everything—from the theft of our shipment to the whole hostage thing. And speaking of hostages, exactly who is being held by the Nilaniums?”</p><p>Jagger dropped his gaze and sighed. “They have my mother.”</p><p>“Your mother?”</p><p>Jagger nodded. “My mother is a healer. She’s skilled at nursing and using natural elements to cure diseases. She has a reputation for her cures. About six months ago, the Nilaniums came to the castle while my father was away on a hunting trip. They told my mother that one of their men had contracted some kind of disease and asked for her help. She could never turn down anyone in need, so she agreed to let them bring him in. If my father or I had been there, we never would have allowed her to consort with any of them. Of course, when they all came in, they overpowered her guards and took her out of the castle with them. They have kept her prisoner ever since. The bastards ask for more and more tribute to be paid to them every week to ensure her safety.”</p> <p>Nikolai shook his head disbelievingly. “And you never notified the Alliance? Never asked for help?”</p><p>“We don’t belong to the Alliance of Planets—never have. They wouldn’t have helped us. No, we were on our own, and that’s probably why the Rogers targeted us to start with.”</p><p>“So who made the decision to steal from us to get the tribute?”</p><p>“My father.” Jagger’s head came up at Nikolai’s sound of disapproval, and he clenched his fists. “You don’t understand! This has been hard on him—he’s not himself. My mother is...everything to him. When he told me he’d promised a shipment of bauxite to the Rogers and had no money to pay for it, I agreed to help him. I know it wasn’t right, but what could I do? We would have paid you back eventually.”</p><p>Nikolai didn’t say anything, but the look on his face said he didn’t believe a word. Once again, Jagger tried to jump to his feet in anger and once again, Nikolai jerked him back onto the bed. Jagger lost his temper again and took another swing at Nikolai. Nikolai caught his fist in his hand and took him down to his back, pulling his wrists over his head. “Let me up! Let me up, damn you or I’ll...”</p><p>“Stop trying to fight me. You need to learn pack discipline, and there’s no time like the present. I’m an alpha, and your mate. That means you submit to me, and make no mistake, you will submit. Lower your gaze and expose your throat. Do it now!”</p><p>Jagger trembled in his arms, his gaze shooting daggers at Nikolai for a long, tense moment. Finally, he dropped his eyes and turned his head. Nikolai’s voice was quiet but firm. “I’m going to let you sit up again, but you will remain calm and stop jumping to your feet to run away. Do you understand?”</p><p>Jagger cast him a sullen glance, and muttered something under his breath.</p><p>“What did you say?”</p><p>“I said, I understand. But I hate you for this!” The minute he said the words, he felt a hard twinge in his stomach. A quick flash of anger flitted across Nikolai’s face, but it was quickly gone. He gave him a steady regard.</p><p>Nikolai’s lips twitched and he bent to whisper in his ear. “You can hate me all you want to, but you will do as I say. Sit up, love.”</p><p>“Don’t call me that,” Jagger mumbled.</p><p>He took his mate by the shoulders and made him look at him. “I’ll call you anything I want to, and you will stop being so disrespectful.” He shook him very gently, seemingly aware of his much greater strength. “Taking our shipment was wrong. Taking me hostage and trying to extort money from my family was wrong. Allowing me to believe you knew who I was and what being my mate meant was wrong! And if you don’t know right from wrong, it will be my duty as your mate to teach it to you. I will spank this ass every day if I have to. Now straighten up and stop acting like a spoiled child.”</p><p>Jagger’s mouth fell open and he could feel a deep flush travel up to his face. No one spoke to him that way! He kept his gaze on Nikolai’s, never flinching, and though he was not showing proper respect by challenging him with his direct gaze, Nikolai nodded his approval.</p><p>“Good. I’m glad to see you listen to reason. Jagger, we have a little problem. I asked you if you understood what it meant to be my mate and you said you did. I can see now that you actually had no idea. You’re my mate now, and that means what happened last evening changed you irrevocably. I’m not sure what to do about it. I think we should take a little time to think this through.”</p><p>“There’s nothing to think through. Take me back immediately! I don’t want to be your mate! I never wanted such a thing! I don’t want to stay with a bunch of...of...monsters!”</p><p>Nikolai’s tightened his lips, and his eyes turned dark and dangerous looking. “Be very careful, Jagger. I might just take you up on your demand.”</p><p>“Take me up on it!” Jagger said defiantly. “I want to go back home. Now!”</p><p>“Tell me you don’t love me then. Say you don’t love me as much as I love you and I’ll send you home.”</p><p>Jagger narrowed his eyes and folded his arms across his chest. “I don’t love you. I never loved you and I never will! Now take me home!”</p><p>Nikolai stared down at him with cold fury for another moment before turning on his heel and leaving the room without another word. Furious, Jagger hurled himself against the door again and again until his shoulder was aching, and he was exhausted. His stomach was cramping with intense pain. Every time Nikolai was angry with him, he felt this same cramping. What had he done to him? Finally, he slumped down on the bed and tried to catch his breath, wondering how he could convince Niki to take him back to his planet. His father would be distraught by now. From down the corridor outside his room, he thought he heard footsteps.</p><p>The door opened with a bang against the wall of the room and two of the huge Lycans he’d seen earlier stepped inside to stare at him. Jagger stood up nervously and backed toward the far wall. “Where’s Niki? What do you want?”</p><p>One of the two, the leader who’d practically attacked Jagger before, stepped closer to him, a frown on his handsome face. “Come with us now, Prince Jagger.”</p><p>“No!” Jagger held his hands out in front of him as if to ward them off. “Where’s my...where’s Niki? I want to see Niki!”</p><p>The two big Lycans glanced at each other and then stepped forward calmly, but decisively, each one taking one of Jagger’s arms to hold him between them. “No one will hurt you, Prince Jagger, but you’re coming with us.”</p><p>“No!” Jagger cried, trying to pull back, but he soon discovered it was useless to struggle. The powerful grip they had on his arms was unbreakable, and they pulled him to the door and down the corridor outside almost effortlessly. Jagger glanced around wildly for Nikolai, but he was nowhere to be seen, and he was becoming more and more uneasy. Where could they be taking him? Were they going to hurt him? Had he gone too far with what he said to Niki? Why wasn’t Niki here with him? He knew he’d made him angry, but surely he wasn’t so furious that he would just abandon him to these huge creatures. Pulling him into a huge bay area, the Lycans finally released him, and Jagger saw a small, sleek transport. He turned a surprised glance to the taller of the Lycans, the one who seemed to be the leader. “What is this? Tell me where you’re taking me!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We’re taking you back to your planet, Prince Jagger. Isn’t that what you’ve been demanding?”</p><p>Jagger felt stunned. Was it possible? “I thought...Niki said I was his mate, and I couldn’t go home.”</p><p>“We’re not kidnappers, Prince. You agreed to be Nikolai’s mate, and now you say you didn’t know what that meant. You said you wished to return to your family and reject Nikolai. He’s giving you what you want.”</p> <p>Stunned into speechlessness, he allowed them to push him into a passenger seat and strap him in. His stomach ached abominably. Leaving was what he wanted, wasn’t it? This was what he’d asked Niki to do, and it seemed Niki had given him what he wanted. Why wasn’t he here to speak to him though? To explain or to at least say goodbye? Why had he left it to these others? Did he hate him now? If he could have just one more minute to speak to Niki, explain to him...but perhaps Niki didn’t want to see him again.</p><p>Surprised a little at the sharp pain this thought caused him, he slumped in the seat, preparing for the takeoff, his eyes still searching behind him even as the door of the transport closed behind him. He still half expected it to open back up and see Niki look in at him with his cocky, confident smile. Jagger straightened in the seat, closed his eyes and laid his head against the seatback as the Lycans opened the space port and piloted the small craft quickly down to the planet’s surface.</p><p>In what seemed like only a few minutes, the craft landed and the Lycans grimly took him from his seat and escorted him to the hatch. As Jagger climbed out, he saw his father rushing toward him and he clasped him in his arms, glancing over his shoulder at the Lycans. The big one stood cold and grim by the hatch door and addressed his father, completely ignoring Jagger.</p><p>“The Alliance has been notified of your situation, King Larius. I have no idea what actions, if any, they’ll take, but I’m sure sanctions will be put in place. You should prepare yourself and your people. No more trading will take place between your people and the planets of the Alliance.” The Lycan paused to let the full import of his words sink in. No more trade would be utterly disastrous for their planet. Jagger’s father hung his head in despair. Clenching his fists, Jagger stepped in front of him protectively.</p><p>“Surely you understand we were desperate. The Rogers have my mother.”</p> <p>“I understand that, Prince Jagger. But taking our relative and our shipment was a criminal act. You should have asked us for our help instead of trying to just take what you needed. You intended to keep Nikolai as a hostage, so in my opinion, you’re really little better than the Rogers. We wouldn’t normally forgive such grievous acts of aggression against us, but Nikolai has asked us not to retaliate, so we’ll respect his wishes.” His cold glare encompassed the king, Jagger and the soldiers standing nervously around them. “Consider yourselves fortunate.”</p><p>Turning on his heel, he climbed back into the transport. In seconds, the craft lifted up and sped off, climbing rapidly until Jagger lost it in the thick clouds over Jayron. As it pulled away, a tearing pain ripped through his body, taking him to his knees, and he felt a crushing despair. This was what he wanted—wasn’t it? Then why did it feel as if he were dying?</p><p>* * * As Jagger read the message in his hand, the blood rushed from his face, and he had to sit down suddenly. It had been three days since Jagger had arrived back on his planet—three long days of stress and worry and unrelenting pain in his stomach, pain so bad he could barely function. Three long days of listening to the King’s council rage at both him and his father for their mishandling of the entire Lycan affair. And three interminable days of worry that the people would rise up and cast both the King and his son from the throne. In all that time, no matter how much else was wrong, Jagger could think only of Niki. The sight of his own room was unappealing to him now, because his big Lycan wasn’t there, teasing and making love to him. The memory of the things Jagger said to Niki on the ship haunted Jagger now. How could he have told him he didn’t love him? It had been his pride and his anger talking, and he bitterly regretted his words. He went over and over those things in his head, wishing he hadn’t been so harsh, so unforgiving. He wished he hadn’t lied when he said he didn’t love Niki. Because it had been a lie, an awful lie, but Niki had believed him and sent him home.</p><p>Then later that morning, out of the blue, a message had arrived from the Lycans. The message had come in on their diplomatic channels, not from Nikolai, but from his leader, Lucas. It was simple and straightforward.</p><p>King Larius, we are prepared to offer you a deal. We will rescue your queen and deliver her to you unharmed, while at the same time, ending the threat from the Nilaniums from this time forward. In addition, we will arrange for trade shipments to begin again with your world, and offer you a no-interest loan of a quarter million diamond standards to aid your people in setting up trade agreements. In return for these more than generous considerations, Prince Jagger will surrender himself to our cousin Nikolai until such time as Nikolai should tire of him. After that time, he will be allowed to go free. We are awaiting your decision.</p><p>Surrender himself! “I’ll tell them no, son. Don’t worry, please. I’ll tell them it’s out of the question.” His father put a comforting hand on his shoulder.</p> <p>“No,” Jagger said quietly. “I’ll do it.”</p><p>“It’s insupportable!” King Larius cried. “How can I trade my wife and my people for my son? No, no, I can’t do this to you, Jagger.”</p><p>“You’re not doing it, father. I’m a grown man now, and I can make my own decisions. This is the only way, and it’s a very good plan. More than we could have hoped for. The Lycans are right. They’re offering extremely generous terms, and we must get my mother away from the Rogers. I can’t stand to think of what she must be going through. Besides all of that, it will save our people.” Jagger stood up and squared his shoulders. “Go back to the council and tell them to reply in the affirmative. I’ll pack my things and be ready when they come for me.”</p><p>“Oh son,” his father said sorrowfully, holding his head in his hand. “Perhaps they won’t be able to do as they’ve promised. Your mother is heavily guarded—what if she should be hurt in the attempt?”</p><p>“Not with Nikolai and his family,” Jagger said, surprised to hear a hint of pride in his voice. “You saw them in the throne room the last time when they came for Nikolai. They are the fiercest people I have ever known. No, if they say they can do it, I have no doubt. Let’s go now and tell them we’ll agree to their terms. I don’t want my mother to have to spend one more night than she has to in that place.”</p><p>The council members were ecstatic when they heard Jagger’s decision. The king’s head advisor, Herren, came forward and bowed from the waist. “Prince Jagger, thank you for your sacrifice.”</p><p>Jagger inclined his head. “I would like you to open a channel with the Lycans please. I have one stipulation.”</p><p>“B-but Prince Jagger. Surely they have been more than generous. Couldn’t you...”</p> <p>“I said open a channel, Herren. I’m still your prince. Do it immediately.”</p><p>The advisor dropped his gaze and hurried over to the Communicator screen to hail the Lycan ship. Within a few minutes, Herren nodded to Jagger. “Prince Jagger, I have the Lycan ship.”</p><p>Jagger walked to the screen and nodded solemnly into the cameras. He could see Lucas, the alpha, sitting in his command chair, with several figures behind him. He saw Nikolai standing behind Lucas and to the right, with his arms crossed and a belligerent look on his handsome face. “We agree to your terms, Alpha,” Jagger said, “with one provision.”</p><p>Before Lucas could speak, Nikolai stepped forward angrily. “The terms were quite generous, Jagger. What possible leverage do you think you might have?”</p><p>Jagger was surprised at the level of anger he saw on Nikolai’s face and his own face grew warm and heated. Soon he would be under this man’s control, and little better than his slave. He would have to face that anger head on, and could he do it? Did he really have a choice?</p><p>He raised his chin and stared straight back at Nikolai. “I don’t have to agree to this at all.”</p><p>Nikolai scoffed. “Ha! That’s right, Prince, you and your father can show your usual level of intelligence and diplomacy and tell us to take our offer to save your asses and go to hell. Of course, meanwhile your mother is still captive and your people are probably ready to throw you both in the dungeons. Perhaps we should just wait a few days and save ourselves the trouble of a negotiation with the two of you.”</p><p>On the screen, Lucas stepped over to Nikolai and put a cautioning hand on his arm. “Let him speak, Nikolai. Let’s at least hear what he has to say.”</p><p>Nikolai made a dismissive gesture and turned his back on Jagger, but Lucas inclined his head. “Go ahead, Prince. What is your provision?”</p><p>Jagger cleared his throat. Nikolai had rattled him, but he tried hard not to show how intimidated he was. He lifted his chin even higher and squared his shoulders. “I want to go with you to get my mother. I’m a warrior, and I can be of service.”</p><p>Before Lucas could reply, Nikolai turned around and roared at him. “Absolutely not! It’s out of the question!”</p><p>“But Niki, it’s my mother! Please!” Jagger instinctively used his pet name for Nikolai and held out a hand in appeal, but Nikolai actually snarled at him. Jagger took an involuntary step backward, and right away both Lucas and another Lycan who Jagger thought was Nikolai’s brother, Kyle, came forward, speaking urgently in his ear. Nikolai shook his head, but after a few minutes, he finally stepped to the rear of the command chair and out of range of the cameras. Lucas faced Jagger instead.</p><p>“We accept your provision, Prince Jagger, with one of our own. You may go with us, but you will stay in the rear, and follow our commands to the letter. Is that clear?”</p><p>“Yes, thank you. I’ll do as you say.” From somewhere off camera, Jagger and the entire council heard Nikolai make a rude, profane comment in response, but Jagger held onto his composure with rigid control. Lucas kept his eyes straight ahead and pretended not to have heard. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We’ll begin our attack in the morning, Prince. Please make yourself ready and pack your personal belongings. Have your guard bring you to meet us at the landing zone at first light. After we secure your mother, and get rid of the Nilaniums, we will be leaving for our home planet right away.”</p><p>“Yes, certainly. I’ll be there.”</p><p>Lucas nodded and the transmission winked out. Jagger sagged to the floor. In the last few minutes the pain in his stomach had become almost unbearable. He took several deep breaths and forced himself to his feet. Then he turned to go to his rooms and ready his things for the journey. He had no idea what kind of life was waiting for him on board the Lycan ship. Once Nikolai had called him his mate, and told him he loved him. Now it seemed that his love had turned to hatred. Nikolai could barely look at him without frowning and snarling at him. He must only want him back on board the ship to torture and humiliate him. The contract the Lycans wanted said that he would be under their control until Nikolai tired of him. From the look on Nikolai’s face, that wouldn’t be too long.</p> <p>Chapter Six</p><p>Nikolai waited with his family for the door of the transport to open. He held himself rigidly erect, knowing Jagger was on the other side of the door. After four days, his need for his mate was an almost physical ache that was making him ill. No matter how angry he was, he still needed to see him. And he’d been very angry indeed when he found out Jagger had lied to him about knowing what it meant to be a Lycan mate and then compounded it by calling him and his family monsters and stubbornly demanding to be taken home. He’d even said he didn’t love Nikolai, and though he didn’t really believe it, the words had hurt and angered him. Stubborn little bastard. At first Nikolai had been so hurt and outraged he’d told Lucas to turn the ship for home, but Lucas had only looked at him and shook his head.</p><p>“You’re being as foolish and stubborn as your little prince, Nikolai. The curse is strong with our family, and you won’t be able to stand it for long. If you’re honest, you’ll admit you’re already dying to get your hands on him.”</p><p>“The hell with him!” Nikolai yelled, throwing himself down into a chair on the comm deck. “I’d like to wring his little neck.”</p><p>“Well, if that‘s how you really feel, I can probably arrange for the Alliance to pick him up and put him in one of their prisons. Kidnapping you and holding you for ransom is a capital two offense. It would no doubt mean a long prison sentence for the prince and his father.”</p> <p>“No! He’s mine!” Nikolai jumped up and started pacing again. “If anyone holds him prisoner, it’ll be me. I’m the one he wronged.”</p><p>“Would you like me to arrange that then?” Lucas asked quietly.</p><p>“What do you mean?”</p><p>“I can make a deal for him, a deal they can’t refuse. He can become your prisoner and you can do whatever you like with him.”</p><p>At Nikolai’s hopeful, yearning look, he smiled. “You really have it bad for this young man, don’t you?”</p><p>“Yes, damn it,” Nikolai said moodily. “No use in denying it—I love him so much I think I’ll die from it.”</p> <p>Lucas smiled again and clapped his shoulder. “Well, we can’t have that. Leave it to me, Nikolai. I’ll get your prince back for you. But we can’t hold him indefinitely. We’re not criminals. You’re going to have to make him want to stay with you, so you need to lose that giant chip on your shoulder and get over all this anger. Then if he still wants to go, you’ll have to let him leave.”</p><p>“I know. It’s just the idea that he said he didn’t love me—didn’t want me as much as I wanted him.” He took a deep breath. “Maybe this time I can convince him to admit how much he loves me. Because he does love me, the stubborn little sod!”</p><p>Now as the door was about to open on the transport, his palms were sweating. He schooled his face to be blank and expressionless. He saw Jagger right away, standing by the door, looking jumpy and solemn and goddamn beautiful, the sun casting a bright sheen over his dark blue hair. He was shifting his feet nervously, his grip white on the hilt of his sword. He looked absolutely miserable. Good, damn him. Let him feel some of what I’ve been going through. But at the same time, his protective instincts hammered at him to go to the prince and find out what was causing that look of pain on his face.</p><p>Behind him on the ground was a large contingent of Jayronian soldiers in formation. Several large transport trucks were pulled up behind them. Jagger stepped forward beside his father and bowed from the waist, his gaze darting up toward Nikolai and then skittering away.</p><p>Nikolai tried to concentrate on what King Larius and Lucas were saying, but it was impossible. All he could concentrate on was that smell radiating off Jagger, sweet and sultry and musky all at the same time. God it was driving him crazy and all he wanted to do was peel those stupid leggings off him, bend him over and...</p><p>Jagger stepped forward. He was asking Nikolai something and Nikolai shook his head to clear it. “What? What did you say?”</p><p>“I said my men want to go with us, with your permission, of course. It’s their queen, Nikolai, and they want to help.”</p><p>Nikolai made a sound of irritation and glanced over at Lucas, who shrugged and gave him a sardonic little smile. Nikolai turned back to his prince and fixed him with a cold stare. “There can be only one commander, Prince Jagger.”</p> <p>Jagger nodded, his face darkening. He inclined his head respectfully though, and then turned to walk a few steps to the edge of the platform to address his troops. “Comrades, from this time forward, I surrender my command to the Lycan, Nikolai. He is my new lord and m-master. That makes him yours as well. Do as he tells you without question, and we will be victorious this day and bring our queen home where she belongs.”</p><p>An instant quiet fell over the assembled men and they shifted their gaze to Nikolai, who hadn’t moved since he left the ship. The prince walked over to him and knelt on one knee in front of him, lowering his head. “We are yours to command, sir.”</p><p>Nikolai felt stunned at this reversal and was at a loss. He glanced up at Lucas, who was smiling over at him. “Well, Nik? You seem to have a large group of men, not to mention a prince, at your disposal. What are you going to do with them?”</p><p>Nikolai growled deep in his throat at the sight of Jagger kneeling in front of him. With hands that trembled only slightly, he took Jagger by the shoulders and pulled him to his feet. “Tell your men to get in the trucks.”</p><p>Jagger nodded and turned to issue the orders, while Kyle and the others came over to him. “Since your prince has put you in charge, what would you like us to do, commander?”</p><p>Nikolai glanced at Lucas, who simply shrugged. “Go ahead. This is all for you, anyway, cousin. Do you want to keep an eye on Jagger or should he go with me?”</p><p>Nikolai shot Jagger a look and muttered under his breath. Raising his voice a little louder, he said, “He’s with me, Lucas.”</p><p>He turned his gaze back to Jagger and saw him practically vibrating with tension. He stepped forward and took his arm maybe a little more roughly than he’d intended. “Come on,” he said tersely. “Let’s get this over with.”</p><p>The small dock was so crowded with Jayronians and the much larger Lycans, it was getting hard to move. Nikolai nudged Jagger’s shoulder and pushed him in front of him to the waiting land transports. They were big trucks, like the one he’d first ridden in blindfolded when he’d arrived on the planet and been kidnapped by his little prince. Nikolai jumped up in the back of the first one in line and held out a hand to Jagger, who took it tentatively, like he was afraid to touch him. He jerked him up effortlessly and kept holding onto him, taking him to the back of the truck before pushing him down and dropping beside him.</p><p>He could see Jagger’s chest rising and falling quickly, but he didn’t think he was afraid of the mission against the Nilaniums, but rather he was reacting to Nikolai’s proximity. Still, he turned to Jagger and spoke quietly. “This is stupid. You shouldn’t even fucking be here. It’s not too late to get out of this. I can’t watch you and kill Nilaniums at the same time.”</p><p>“I haven’t asked you to watch me,” Jagger said sharply. “I can take care of myself.”</p><p>Nikolai gave a little snort. “Bullshit.”</p><p>The other Lycans were piling into the back of the truck and good-naturedly jostling with each other, keyed up and ready to go. Lycans, especially alpha males, loved a good fight, particularly against the Rogers, who were an almost constant harassment and threat in this part of the galaxy. Kyle, who was sitting across from Nikolai, grinned at him and flexed his muscles. “Good day to kick a little Nilanium ass, right brother?”</p><p>“Good as any!” Nikolai grinned back at him, still hyper aware of Jagger sitting so close beside him. His thigh was burning a hole through Nikolai’s pants as it rubbed against his. Damn him. Konnor, who also sat across from them, smiled over at Jagger politely, his eyes moving to the prince’s tight leggings and the noticeable bulge at his groin. Nikolai felt a low growl starting in his throat. Konnor looked up in surprise at Nikolai and smiled, holding up a hand in mock surrender and shaking his head.</p><p>“Sorry, cuz. Force of habit,” Konnor said in their Lycan language. “Damn, he’s beautiful.”</p><p>“And mine,” Nikolai answered shortly, putting a possessive hand on Jagger’s knee. Jagger, who spoke no Lycan at all, jumped at the touch and looked up at him in surprise.</p><p>Kyle regarded Nikolai with concern. He also spoke to him in Lycan. “How in the hell are you going to do this? You’re going to get yourself hurt if you’re not careful. If one of the Rogers comes after him...look, let me watch him. I can be more objective than you can, and you know I’ll be careful with him.”</p><p>“Hell, no. He stays with me,” Nikolai answered, still speaking in their own language. “Don’t worry about me. I can take care of both of us. I’ll probably let you guys have all the fun and just take him in to find his mother and then get them both back out to the truck.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kyle looked over at Jagger dubiously. “He wants to fight, brother. Maybe you should let him do what he needs to do.”</p><p>Nikolai glared at him. “When you have your own mate, I’ll remind you of what you just said. I can’t risk him, Kyle. I won’t. But there’s no sense in letting him know that—he’s disagreeable enough as it is.”</p><p>Kyle laughed and Nikolai glanced down at Jagger, who sat quietly in his corner of the truck, his eyes straight ahead. The only sign of his nervousness was his continued white-knuckled grip on the hilt of his sword.</p> <p>The journey was quick, and soon they were pulling up to the gates of the Nilanium compound. Captain Garth himself came out of the doors of the compound, followed by several of his men. Lucas was the first one out of the truck, quickly followed by the other Lycans. When Jagger started to jump down beside him, Nikolai put a hand on his chest. “Not so fast. Let me check it out first.”</p><p>Jagger snorted and jumped down beside him anyway. He took one step forward before Nikolai grabbed Jagger’s arm and put his lips to his ear. “You’re not in charge, anymore, Princeling, and you’d better start remembering that. Now get behind me and stay there.”</p><p>Jagger’s eyes flashed at him, and he pulled his arm roughly away, but he fell back behind Nikolai as he’d told him to, dropping his gaze to the ground. Nikolai strode over to stand in front of the Nilanium chief. “We’ve returned, Garth, as you can see.”</p><p>Garth shifted uneasily. “We have no quarrel with you, Lycan.”</p><p>“Yes, but we have a quarrel with you. You’re holding a hostage, I believe, who is quite important to us and to our allies, the Jayronians.” Jagger put deliberate emphasis on the word ‘allies’, watching Garth’s face closely. “And I think it’s safe to say your presence here on Jayron is no longer desired.”</p> <p>Behind him, Nikolai was aware of the other Lycans spreading out in a solid line, flanking him. Garth’s eyes darted toward them and back to Nikolai and then traveled insolently over Prince Jagger. Nikolai shifted his body slightly to completely hide his mate behind him.</p><p>“Suppose we give you the lady?” Garth said.</p><p>“Yes,” Nikolai purred, his eyes glowing deep red. “Suppose you do...”</p><p>“Will you leave then?”</p><p>Nikolai felt his fangs drop down and allowed it. He bared his teeth at the captain, letting him get a good look at what was coming for him and his men. “You first,” he replied, his voice now rough and hoarse as the shift came over him.</p><p>Captain Garth backed up, his eyes round with horror. “Go get the queen,” he yelled at the men standing behind him. His eyes traveled down the line of Lycans standing behind Nikolai. Without turning his head, Nikolai knew they must have shifted as well. He could hear their rapid breathing just behind him.</p> <p>“You’re finished here, Garth. You and your men have twenty minutes to clear out before we pull this shithole down around your ears.”</p><p>Garth’s eyes darted around desperately, his tongue spearing out to wet his lips. Behind him, a small figure emerged, her hair falling around her face and her tiny frame trembling. From behind him, Jagger cried out, “Mother!” Before Nikolai could stop him, he flew around him to her side and gathered her in his arms. The captain’s meaty arm wrapped itself around Jagger’s throat and pulled him back against his body, while with his other hand, the pirate pulled his weapon.</p><p>Nikolai stood frozen in fear as Garth pointed the gun directly at his mate’s temple. “I’ll kill him, Lycan—don’t think I won’t!”</p><p>The threat to his mate was enough to push Nikolai over the edge. He shifted completely, his loud roar of rage reverberating around the compound. Garth’s mouth fell open as he faced his imminent death, and at the same time, Jagger elbowed him sharply in his gut, while knocking the gun away from his head. Nikolai leaped, one arm pushing Jagger to the side as he took the captain down, ripping away his throat with one sharp jerk of his teeth. A red haze dropped over Nikolai’s eyes as he heard the sounds of men screaming as the Lycans tore them apart.</p><p>Out of the corner of his eye, Nikolai saw Jagger huddling protectively over his mother’s prone form, before the sounds of the other Nilaniums pouring out of the building to meet them took over his senses. The combat was hand-to-hand at such close quarters, and the Nilaniums, though no match for the huge, fierce Lycans, still had a well-deserved reputation for fighting. Greatly outnumbering the Lycans, they fought in these close quarters with their sharp, curved blades, piling on five or six men to each Lycan, and though none were able to seriously hurt any of the Lycans, they gave a good accounting of themselves. Konnor was bleeding from a wound to his forehead and Nikolai saw his cousin Larsson go down under what looked like ten Nilaniums. Fighting his way over to him, he managed to pull him back to his feet, dispatching six or seven of the Nilaniums as he went.</p><p>Still, despite their fierceness they were badly outnumbered. Suddenly, Nikolai heard a loud battle cry behind him and saw Jagger, now on his feet, his sword in the air, with what looked like the full company of his soldiers behind him. Some of the Nilaniums surged toward them, ready to fight, but most retreated, running away while they still had the chance.</p><p>Nikolai ran toward his prince, who was engaged in a savage skirmish with a large, bearded Nilanium. Nikolai grabbed the Roger from behind and half tore off his head with one swipe of his powerful claws. Before Jagger could react, he’d picked him up and thrown him across his shoulder, striding with him toward the truck. When he reached it, he saw the queen cowering inside, and he threw Jagger none too gently up beside her. He pointed one huge claw at the prince and snarled at him. “Stay there! Guard your mother!”</p><p>Turning on his heel he rushed back into the battle, which was mostly over by now. Nikolai ran over to his brother and his cousins to check on them and found them almost unharmed, other than a few cuts and scratches that their rapid wolf metabolism would soon heal. Together, they went through the compound, making sure none of the Nilaniums were left alive. The Rogers were a pack of murderers, rapists and thieves, who had long been a scourge in the area, so they showed them no quarter, nor did the few remaining men they met ask for any.</p> <p>When it was over, Nikolai made his way back to the truck, anxious to check on his prince and not at all certain he’d obeyed his order to stay in the truck. Sure enough, he found him outside near the front of the compound, standing behind his mother as she used her healing skills on several soldiers stretched out in the grass.</p><p>Nikolai went over to him and turned him around roughly, scanning his body for any wounds. A long, bloody scratch on his cheek brought a harsh growl to Nikolai’s lips. Jagger flinched away, still apparently frightened of him in his wolf form, but Nikolai ignored him and pulled him back to his side possessively. He bent to sweep his long tongue over the scratch, again and again, while holding Jagger around his waist. At last he pulled back and saw it was already beginning to heal, and he grunted in satisfaction. Leaving him then, he turned on his heel and headed back toward the compound to finish the clean-up. He didn’t see Jagger fall to his knees as he released him and clutch himself tightly around the waist.</p><p>* * * “My son, are you all right?” Queen Niada rushed to his side, pulling his head up so she could look at his face. Jagger nodded, his eyes and throat clogged with tears, and not wishing to let any of them spill out in front of his mother.</p><p>Niada smoothed the hair from his forehead. Her son looked a great deal like his mother, with the same navy-colored hair and deep blue eyes. She was proud both of his beauty and his bravery in facing the Nilaniums. She’d seen the face of the Lycan when he’d thrown her son back on the transport with her earlier, and she knew he was very much in love with her son. She’d also seen Jagger’s face when the Lycan was handling him just then and knew the feelings were deeply reciprocated. She only worried that Jagger’s immense pride would come between them.</p><p>“I’m not hurt, Miama,” Jagger said, using the intimate address for his mother that reflected the closeness of their relationship. It also reflected his distress. Jagger hadn’t called her by that name since he was a small child. “Not really. I have a terrible pain in my stomach. It’s worse whenever the Lycan comes near me. He’s angry with me, and it physically hurts me. It’s been almost four days of it now.” Jagger groaned and rolled to his side, still holding tightly to his middle. His mother made a soft sound and jumped to her feet, striding quickly after Nikolai, who had almost made it inside the compound. She pulled sharply on his arm, and he whirled around in surprise.</p><p>“What are you doing to my son, Lycan?”</p><p>Nikolai gazed down at her in confusion and then his gaze fell on Jagger, still lying on his side. “What do you mean? What’s wrong with him?” he asked sharply, pulling away to go to him. Refusing to be shaken off, the queen clung to him, looking up into his face defiantly. “You should know! He told me he’s been in almost constant pain with his stomach since he left your ship. Did you poison him?”</p><p>“Poison him?” Nikolai gave her a furious glare. “Of course not! He’s my mate!” The queen took a surprised step backward. “Your mate?” She glanced back at her son. “I see. So you’re punishing him with your anger.”</p><p>“No! I mean...I’ve been angry with him, yes, but I didn’t mean to hurt him. I wasn’t thinking...I forgot what happens to mates when we’re angry with them.”</p><p>Queen Niada kept her hand on his arm and forced him with her will to look down at her. “Do you love my son?”</p><p>Nikolai returned her regard, his gaze sweeping over her, perhaps impressed that this small person could face his Lycan wolf form so fiercely, without flinching. “Yes,” he answered simply. “I love him more than anything.”</p><p>She held his gaze a few seconds longer before nodding and releasing him. “Go to him then. I know a thing or two about Lycans, and I can see that your pride is standing in the way. Control your wolf, so you don’t frighten him any more than you have to. Jagger can be difficult. I know this. He’s headstrong and proud at times. He’s also loyal and kind, and his soul is beautiful.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nikolai nodded impatiently, wanting to go to Jagger and take him in his arms. “Believe me, I’m familiar with all of this. I told you, he belongs to me now.”</p><p>“Yes,” she replied. “But Jagger also belongs to himself. If you break his spirit, you will lose something quite precious.”</p><p>“I love him. I have no intention of breaking his spirit,” he replied solemnly, and the queen got the feeling he was making her a vow. “But he has to learn to let himself be guided by me at times. He must allow me to teach him pack discipline. I’m a Voyager and he’s my family now. He’ll travel with me all over the galaxy and there’ll be times he will have to obey my commands without question. His safety depends on that, and I won’t allow him to endanger himself, no matter what.”</p><p>The queen smiled gently. “Gods, you’re an alpha, aren’t you?” She laughed softly. “Poor Jagger.” She shook her head. “Poor alpha.” She turned him loose and glanced back at her son. “Go to him then, Alpha, and teach him well. But also love him well, or you will answer to me.”</p><p>Nikolai glanced down at the tiny form whose head came to a point just above his waist, and she saw that he didn’t doubt that she meant every word. “Yes, ma’am,” he replied, and turned to go to his mate.</p><p>* * * As Nikolai walked toward Jagger, he forced his wolf down, trying hard to change back into his human form. Only a few steps away from where Jagger lay on his side, he stopped and took several deep, calming breaths, reassuring his wolf that his mate was safe now and he would take care of him. Finally, satisfied, his wolf subsided and Nikolai came back to his human form. He knelt beside Jagger and put his hand on his shoulder. Jagger looked up in surprise and sat up quickly, but not before Nikolai noticed him wince. Nikolai pushed him on his back, and he hugged his stomach protectively, “Take your hands away, Princeling.”</p><p>“No, it’s okay,” he said quickly, still trying to sit up. “No it’s not. Why didn’t you tell me you were in pain, Jagger? From now on, you keep nothing from me, is that understood?”</p><p>Biting his lip, Jagger turned his head away, but gently, Nikolai turned it back. “Say yes, Niki, I understand.”</p><p>Sullenly, his eyes never once meeting Nikolai’s, the prince murmured, “Yes, Niki.”</p><p>“Good. Those two words are all you need to know.” He pulled up Jagger’s tunic, exposing his slim, sculpted abdominal muscles, and began to rub his hands gently over the skin. “Does that feel better, Princeling? I’m not angry with you anymore. I don’t want you to be in pain.”</p><p>Jagger stuck his lips out into a pout. “I don’t care if you’re angry with me or not.” Immediately, he drew his legs up to his chest in distress, and Nikolai couldn’t resist twisting him around so he could give his ass a whack.</p><p>“Stop it. You’re only making it worse. If you think I’m mad at you, your stomach will hurt—it happens all the time at home with our pets.”</p><p>“With your pets? Is that what I’ll be to you?” He looked horror stricken. “Like-like a lapdog?”</p><p>“Absolutely,” Nikolai said solemnly, enjoying the chance to tease him. “My pet lapdog. And if you’re very good, I’ll let you lick my hand. Or other places. You can sleep on the foot of the bed, and I’ll brush your hair for you every night. Maybe scratch your little belly.”</p><p>“I’d rather die! I’ll kill myself! No, I’ll kill you.”</p><p>“No, you won’t, baby. I won’t let you. Now settle down like a good pup.”</p><p>Jagger swung at him, but Nikolai caught his fist in his hand and kissed it, then pulled him up into his lap, and up to his chest. Bending his head, he took his mouth, sweeping his tongue over his lips, licking at the seam until they fell open to him. His tongue stroked the inside of Jagger’s mouth, their breath mingling as one. Nikolai moved his tongue over Jagger’s, teasing, coaxing until he felt a tentative response. Making an encouraging hum deep in his throat, Nikolai moved his hands down Jagger’s arms, and then up under his tunic to caress his nipples. Putting his thumb over each one in its turn, he massaged and pulled at them to make them stand up. He moved his lips to kiss Jagger’s cheeks, his chin, his eyes, his throat. Jagger made a whimpering sound and let his head fall back, turning his head and exposing his throat in unconscious surrender.</p><p>One of Nikolai’s hands moved to Jagger’s cock, rubbing its hardness through his tight leggings.</p><p>“Oh,” Jagger cried softly, and Nikolai slipped his hand inside the leggings to cup his balls and gently knead them, while he kissed his lips again, whispering Lycan love words against his mouth.</p><p>A sudden voice beside him made Nikolai jump and clutch his prince close to his chest. “When you get through there, Nikolai, maybe you can take your mate to the truck. We’re about ready to load up.” Nikolai stood up abruptly, picking Jagger up in his arms as he rose, taking him with him. Embarrassed, Jagger hid his face against Nikolai’s chest. Nikolai turned furiously to face a grinning Kyle.</p><p>“Sorry, brother, but Lucas said to make you come and get on the truck. He said to tell you’ll have time for your mate later on.”</p><p>Walking stiffly to the truck around his aching erection, he hoisted Jagger up and watched as he crawled to the back to sit near his mother, pulling his knees up to hide his own stiff cock. Unable to bear being away from him and needing to touch him, Nikolai crawled up next to him and pulled Jagger close to his side. Jagger gazed at him in surprise, and Nikolai shrugged.</p> <p>Jagger’s face blazed red, and he turned his face determinedly away, perhaps embarrassed by his excitement. Beside them, Queen Niada smiled gently and patted her son’s knee, before leaning around to give Nikolai a significant look. “I understand the Lycans made a ‘deal’ for my son, Alpha. Is that correct?”</p><p>“My name is Nikolai, and that’s correct. Prince Jagger has agreed to leave with us as soon as we take you home to your people. The deal we had was to recover you and get rid of the Nilaniums. In return, he will go with me.”</p><p>“The exact words of the message were to the effect that I would ‘surrender myself’ until such time as you grow tired of me.” Jagger said stiffly, still not looking in Nikolai’s direction.</p><p>“Your son kidnapped me, madam, and stole my family’s shipment of bauxite. Your husband and your son then held me hostage and enslaved me while trying to extort money from my family.”</p><p>“Oh, Jagger,” the queen said gently. “Is this true?”</p><p>Jagger nodded shortly, not raising his gaze.</p><p>“So you want revenge on my son—is that it, Nikolai?”</p><p>“No!” Nikolai said sharply. “I wanted your son for my mate, and he agreed. Then when my family rescued me and took us both to my ship, he claimed he didn’t know what he agreed to and demanded to return home. I sent him home, but...”</p><p>“But Lycans mate for life, isn’t that right? Do you really think you’ll tire of my son in a few months or even a few cycles?”</p><p>A long silence stretched out, and Nikolai became aware of everyone in the back of the transport listening to them avidly, including Jagger, of course, who had lifted his gaze to stare directly at Nikolai.</p><p>“No,” Nikolai admitted tersely. “I don’t expect to ever tire of him, ma’am.”</p><p>Jagger took a sharp hiss of breath, clenching his hands still wrapped tightly around his knees, and Nikolai shifted uncomfortably.</p><p>Queen Niada leaned back and patted her son’s knee again. “Then we must have a wedding, Nikolai, and stop all this foolishness between you.”</p><p>“But mother...”</p><p>“No buts, Jagger. Did you say yes to Nikolai when he asked you to be his mate?”</p><p>“Well, yes, but...”</p><p>“No ‘buts,’ darling. You agreed to an honorable offer of marriage, and you must uphold the honor of your family and your position. It’s not as if you’re not in love with the Lycan. Isn’t that right?”</p><p>It was Jagger’s turn to squirm. He dropped his gaze to his knees and nodded.</p><p>“Speak up, child, so everyone may hear you.”</p><p>Jagger glared at his mother. “Yes, Mother. I love him.”</p><p>“Wonderful.” She turned to the Lycans, holding up a hand to ward off any protests that might come from them. “And you must allow me to give my only child a proper wedding. Surely you would not deny an old woman this one joy in her final days?”</p><p>Nikolai and the other Lycans looked at her and then back at each other. The beautiful little queen didn’t look a day over forty. Lucas grinned and shrugged, before he gave her a really creditable bow, considering he was sitting in the back of a bouncing truck.</p><p>“Whatever you wish, madam. If things can be arranged quickly? I have been away from my own people with this unfortunate business for some days now.”</p><p>“Of course, of course,” Niada agreed with a wolfish smile of her own. “And you will all be our guests at the palace until things are arranged.” Niada took her son’s hand in her own and leaned her head on his shoulder.</p><p>Nikolai looked over at Lucas and shook his head. He was beginning to see more every minute why his little prince was such a beautiful, arrogant, complicated and absolutely infuriating man.</p><p>Chapter Seven</p><p>“Stand still, Jagger,” Queen Niada said. “Please stop fidgeting.” The queen was critically observing while servants wrapped Jagger’s torso in a beautiful length of red silk. Beneath it he wore tight black leggings and his black ceremonial boots that came up to his knees. His shoulder length hair was braided and pinned on one side, with the other side hanging free and brushed to a silky, shining curtain. Jagger looked at himself in the mirror and thought he was way overdressed for this hasty ceremony his mother had pulled together.</p><p>It was the morning after they’d arrived back at the palace. Almost as soon as they’d arrived back at the palace the evening before, the queen had been fussed over and welcomed by her people. Prince Jagger, his men, and the Lycans had been heaped with praise and hailed as saviors for getting rid of the Nilaniums. Despite the fanfare, Jagger’s mother had almost immediately begun to arrange the ceremony that would take place early the next morning. She had cajoled and bullied the Lycans into staying the night at the palace, even talking Niki into relinquishing his hold on the prince for the night. Despite his growls and dark, sinister looks, she’d managed it, and Jagger had spent the night alone, though he hadn’t slept a wink. Now he was being prepared for the ceremony, and trying desperately not to think about what was going to happen afterward. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He knew Niki had been teasing him the day before about being his pet, trying to get his mind off his pain, but he really had no idea what his new life as Niki’s mate would be like. He knew it would be exciting, and passionate, and probably contentious, but he didn’t know exactly what to expect and the not knowing was taking its toll on his nerves. He loved Niki—his mother had made him admit it— but he wasn’t sure if he wanted Niki to know how much he loved him. He thought that Niki might use it against him in some way. Still, he yearned for him. He should never have allowed his mother to keep them apart the night before. His balls were aching at the thought of the big Lycan. He needed to speak to Niki and have him tell him it would be all right.</p><p>“Enough, mother, please!” Jagger said, pulling away and standing with his hands on his hips. “It’s almost time.”</p><p>“All right, darling. Let’s go. I believe your Niki is waiting for you in the throne room.”</p> <p>Jagger took a deep breath, trying to calm his nerves. He gave his mother his arm and they walked slowly together down the corridors to the great hall. Jagger saw Niki right away, standing by the throne. He was wearing much the same clothing he’d worn the day before—black pants, boots and sweater, though the clothing he wore was clean, and his boots looked shiny and freshly polished. He’d taken pains with his hair as well, and it was pulled back neatly. He looked devastatingly handsome, and made Jagger a little weak in the knees.</p><p>Jagger escorted his mother to her seat and then turned, squaring his shoulders to walk to Niki. When he got to within a few steps of him, Niki held out his hand. Jagger gratefully clutched the lifeline and allowed Niki to pull him to his side. Glancing up at his mate, he saw Niki’s normally wine-colored eyes almost black as he regarded him, and Jagger nervously dropped his gaze.</p><p>The minister came forward and the ceremony began. Through it all, Jagger clung to Niki’s hand, but couldn’t get the courage to look directly up at him. When it came time for the vows, Niki spoke in a clear, firm voice, but Jagger’s voice was soft and low. When it was over, Niki squeezed his hand and they turned to face their families. Konnor jumped to his feet and reached them first, clapping Niki on the back. “Am I allowed to kiss him and welcome him to the family?”</p><p>Niki grabbed Jagger around the waist and hauled him to his side. “What do you think?” he snarled at his cousin, who only laughed good-naturedly and settled for a handshake.</p><p>The next hour or so passed quickly and soon they were preparing to climb aboard the transport that would take them to the ship. His mother cried and patted his cheek, and his father shook hands with Nikolai solemnly as the servants followed with his trunks.</p> <p>“Four trunks, Nikolai?” Lucas said with a grin. “You’ll have to add on a room for his clothes.”</p><p>“If Nikolai ever lets him wear any...” Larsson said, laughing.</p><p>Once on the transport, Jagger sat quietly looking out the window at the last glimpses he might have of his homeland for a long time. Nikolai had promised his mother he’d bring him home for regular visits, but he didn’t know when he’d see his homeland again. He’d been flinching a little all morning at the Lycans’ jokes and innuendos. Actually, he wasn’t altogether certain they were joking. Niki’s solid bulk next to him should have comforted him, but he had to admit to being frightened. What if Niki decided to punish him for the way he’d treated Niki when he first arrived on the planet? And despite the fact that his mother insisted on marriage between them, what was there to prevent Niki from sending him home in a few months? After he tired of him? Niki said he wouldn’t, but maybe he’d only said all that to appease Jagger’s mother. Jagger didn’t even realize he was wringing his fingers until Niki put a big hand over his to stop him. Jagger looked up at him in surprise, and then quickly dropped his gaze as he saw an unreadable expression on his face.</p><p>“When we get on board, take what you need for a few days, and put it in one trunk. We can leave the rest below decks.”</p><p>Jagger nodded. “The big black one has my clothes and most of my things I use every day in it,” he said softly. Niki nodded. When they got to the docks he hoisted it to his shoulders, turning to go down the corridor, while his brother Kyle directed the men to leave the others in the cargo hold. Niki’s other family members had gone ahead, giving them some privacy, and Niki and Jagger were both being very careful with each other and speaking only of practical matters. Once Niki put the trunk inside his rooms he turned to Jagger and smiled politely, with no trace of his former rancor, but no trace of his former cockiness and playfulness either. “I’ll leave you to get settled in, while I go check on everything with Lucas. I’ll be back soon and bring you something to eat—you must be starving.”</p><p>“All right,” Jagger agreed and wandered over to sit on the bed, looking down forlornly at his trunk. Niki hesitated only a second or two longer, seeming as if he wanted to say something, but changing his mind and taking off down the hall.</p> <p>Jagger sat on the bed and thought about what had happened in his life in so short a time. He was a Lycan mate, and he knew very well now what that entailed. What he didn’t know was whether or not Niki was happy he was mated to him. There were times over the past few days when he didn’t seem so sure—much different from the beginning, when he had been so loving and so playful. He wanted that Niki back. What had changed? Why did he seem so different? Was it possible that Niki hadn’t changed at all, but that Jagger himself had created this new, colder version of Niki? If so, he had to find a way to undo it. He had to find a way to bring that old Niki back. An idea occurred to him and for the first time in that long day, a little smile lit his face. Niki would return soon with dinner, and he had to be ready for him. He got up off the bed and began to unwind the length of cloth from his body.</p><p>* * * Nikolai carefully opened the door and backed inside the room, carrying Jagger’s dinner tray. He had forced himself to give Jagger plenty of time to get used to things, when all he’d wanted to do was take him to bed. He didn’t want to frighten him anymore than he was already. He’d seen him wringing his hands in the transport, and it had torn at his heart. Ever since he’d seen him walking down the aisle toward him, looking nervous and beautiful and scared to death, his protective nature had been on high alert. He had his mate now and he would never let him go—but first he had to win him over and make him want to be his mate. Forcing him to stay, no matter what the agreement said, would be intolerable.</p><p>Putting the tray down by the door, he turned and froze in his tracks. Jagger was kneeling by the foot of the bed, stark naked, his beautiful skin gleaming in the lamplight, a silver collar wrapped around his neck.</p><p>“Uh...Jagger...?”</p><p>“You will please address me by my proper name. It is Prince Jagger Evanolite Goolrick of the Jayronian Kingdom, mate of Nikolai Balanescu of Lycanus 3.” Nikolai leaned against the door frame, afraid his legs wouldn’t hold him up properly. Remembering their exchange that first night they’d been together—recalling every word they’d said to each other, he cleared his throat. “What a mouthful...I think I shall call you Princeling.”</p><p>Jagger smiled shyly at him. “You can call me anything you like...sweetheart.” Nikolai caught his breath, knowing he was echoing his own words to Jagger the first night he’d spent with his prince. Reversing their roles, he smiled softly. “My name is Nikolai, but you will address me as ‘Master.’ You will give me proper respect from this time forward or I’ll beat you. Do you understand?”</p><p>“Yes, I understand. You want me to call you master.”</p><p>“Well?”</p> <p>“Well what?”</p><p>Nikolai’s voice was low and soft. “Address me as master.”</p><p>“Master...I am very hungry. Can you feed me?”</p><p>“I’ll feed you, if you can behave. From now on, you’ll do as I command. If you disobey or cause me any problems, you’ll be punished. If you’re good, and obey my commands, you’ll be well treated. Do you understand?”</p><p>Jagger nodded, raising his eyes so his mate could see the desire raging in them. Nikolai had a powerful urge to pull his mate up in his arms, and it was taking everything in him not to act on it. Jagger raised his eyes and caught Nikolai’s gaze. “Yes...Master.”</p><p>Nikolai walked back to the bed on shaky legs and held out a hand, palm up. Jagger took his hand, and rose gracefully to stand beside his mate. “There’s no use resisting, Princeling.” Nikolai said. “I’ll be a kind master, so long as you obey me. Come with me, Princeling, and I’ll feed you.”</p><p>Nikolai pulled him over to the table where he’d left the food. The prince’s erection bobbed and bounced against his stomach, almost driving Nikolai mad. “Kneel beside me and I’ll feed you.”</p><p>Jagger dropped to his knees, keeping his face lowered. His erection was rigid and his balls were drawn up tight to his body.</p><p>“Are you all right?” Nikolai asked.</p><p>“I’m hungry, Master,” Jagger said quietly. Nikolai picked up a small morsel from the plate and held it next to Jagger’s lips. Jagger looked up at him with a wicked smile and engulfed his fingers with his lips, licking at the underside with his tongue and then sitting innocently back on his heels, gazing up at Nikolai from under his long eyelashes.</p><p>Barely able to speak, Nikolai took a deep breath and managed to choke out the words. “Are you being insolent, Princeling?”</p><p>Jagger looked up at him and smiled. “No, Master. I’m just so hungry. For you...”</p><p>Nikolai bent over and picked him up in his arms, making it to the bed in one or two long strides. He put Jagger on the bed and stopped long enough to tear his own clothes off before diving in on top of him, and covering his lips with his own. The Lycan howling in his mind intensified as he pinned his mate in place with his arms over his head. He bent his head to Jagger’s throat, intent on claiming him again, needing to mark him as his own after so many days apart. His fangs, needle sharp, sank deeply into Jagger’s neck as he writhed beneath him, his excitement obvious from the rock hard erection digging into Nikolai’s stomach. Jagger squirmed beneath him as he drew his sweet tasting blood into his mouth, and Jagger moaned loudly, only spurring Nikolai on. He could feel Jagger coming beneath him, the hard pulsing of his seed plastering their bodies together, but he was a long way from being finished with his sweet mate. He turned him over, frantic with his need, he scooped up Jagger’s cum from his stomach to spread on Jagger’s hole and Nikolai’s own cock. Unable to wait any longer, he thrust his cock inside, impaling him hard and deep with each thrust of his hips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nikolai began moving in his lover—long, slow movements that raked his cock over Jagger’s sweet spot with every thrust. Jagger cried out with each thrust, but Nikolai could show him no mercy. His hips began to snap in a forceful rhythm that left Jagger clutching the sheet beneath him and grunting with each thrust. Nikolai reached beneath Jagger and found his cock, already half hard again. He pulled and stroked it without mercy, forcing Jagger’s orgasm, making him come again.</p><p>“Do you feel me inside you, Princeling? Can you feel my heart beating deep inside your body? You’re mine, baby. Sweet baby...”</p><p>Jagger leaned his head back against Nikolai’s chest, and Nikolai stuck his tongue deep in his ear, making him arch and twist under him, causing Nikolai’s shaft to press even deeper inside him. “Mine,” he growled in Jagger’s ear. “My mate.”</p><p>Jagger turned his face toward Nikolai and gasped out one word that filled Jagger with joy. “Yours,” he said. That word made Nikolai lose all control and he came so hard it left him boneless and sated, sagging against his little prince. Jagger was his and he’d never let him go.</p><p>Jagger turned his face into Nikolai’s chest and he mumbled something Nikolai couldn’t understand. “What baby? What did you say?”</p><p>“I said—” He looked up at Nikolai. “That I-I love you.”</p><p>Nikolai felt his heart flutter a little in his chest. Well, damn. “God, baby, I love you too. So much I thought it might kill me.”</p><p>Jagger smiled shyly. “You kept it to yourself pretty well. My mother told me you did, but I thought it was just, you know, that you wanted to control me and tell me what to do. Maybe even make me suffer for what I did to you at first.”</p><p>Nikolai pulled him closer and crushed his lips into Jagger’s. When they were both nearly breathless, Nikolai whispered against Jagger’s mouth. “Are you suffering yet?”</p><p>Looking up from under his eyelashes, Jagger gazed at Nikolai with speculation. “You kind of deserved punishment, you know. All those lies about your ‘stepbrothers.’”</p><p>“Sorry about that, Princeling, but I didn’t think you were ready to hear that you were my mate just yet, and I never expected my family to bust in there and try to rescue me like that.” Nikolai chuckled. “My cousin Blayde’s new mate is a human who’s been in some porn flicks. I remembered one of them in particular, ‘Some Day My Prince Will Come.’ It gave me the idea. That and the fact that my old Nanna used to tell us the story.”</p><p>“Hmm,” Jagger said with a little frown. “Yes, I looked it up later on the compnet—an ancient human fairy tale. Very funny. Maybe when you came in just now I should have had a glass slipper waiting for you. Isn’t that what Cinderella’s prince gave her?”</p><p>“Probably not a good look for me,” Nikolai laughed. “My family already thought you tried to put me in a dress. High heels would make Lucas lose his mind completely.”</p><p>“In the story I read, the prince rescued Cinderella.”</p><p>“That’s right, sweetheart. Just like when you agreed to that crazy contract Lucas came up with. You saved my life by saying yes. I couldn’t have stood it if you’d refused.”</p><p>“So in a way, I did rescue you?”</p><p>“Yes, baby,” Nikolai said tenderly, pulling him closer in his arms. “And I rescued you right back. And I always will—forever after.”</p><p>THE END </p> </body></html>"]