["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"So, Bella looks good.\"</p><p>At the counter of the Brotherhood's kitchen, Zsadist picked up a knife, squeezed a head of romaine lettuce together, and started drawing the blade through at one-inch intervals. \"Yeah, she does.\"</p><p>He liked Doc Jane. Hell, he owed her. But he had to remind himself of his manners: It would be damn tacky to bite the head off a female who was not only your brother's shellan, but who had saved the love of your life from bleeding out on the birth table.</p><p>\"She's recovered beautifully in the last two months.\" Doc Jane watched him from the table across the way, her Marcus Welby, M.D., bag beside her ghostly hand. \"And Nalla's thriving. Man, vampire young progress so much faster than human babies. Cognitively, it's like she's nine months old.\"</p> <p>\"They're doing great.\" He kept slicing, moving his hand down and through, down and through. On the far side of the blade, the leaves sprang free in curly green ribbons like they were clapping at having been liberated.</p><p>\"And how are you doing with the whole dad thing--\"</p><p>\"Fuck!\"</p><p>Dropping the knife, he cursed and brought up the hand that had been on the lettuce. The cut was deep, down to the bone, and his blood was red as it welled up and dripped off his skin.</p><p>Doc Jane came over to him. \"Okay, let's get you to the sink.\"</p> <p>To her credit, she didn't touch him on the arm or try to lead him with a push on his shoulder blade; she just loomed and pointed the way to Kohlerland.</p><p>He still didn't like anyone but Bella putting their hands on his body, although he had made some progress. Now, if the contact was unexpected, his first move wasn't going for a concealed weapon and capping whoever had let their palms do the walking.</p><p>When they were in front of the sink, Doc Jane cranked the thing's throttle over and fired it back so that there was a warm rush landing in the deep porcelain belly.</p><p>\"Under,\" she said.</p><p>He extended his arm and put his thumb into the hot water. The slice burned like a bitch, but he didn't wince. \"Let me guess. Bella asked you to come talk to me just now.\"</p><p>\"Nope.\" When he shot her a look, the good doctor shook her head. \"I examined her and the baby. That was it.\"</p> <p>\"Well, good. Because I'm fine.\"</p><p>\"Had a feeling you'd say that.\" Doc Jane crossed her arms over her chest and regarded him with a stare that made him want to build a brick wall between the two of them. Whether in a solid state or translucent as she was at the moment, it didn't matter. When you got eyeballed by the female like this, it was as if you'd been sandblasted. No wonder she and V got along.</p><p>\"She did mention you won't feed from her.\"</p><p>Z shrugged. \"Nalla needs what her body can provide more than I do.\"</p><p>\"It's not an either-or situation, though. Bella's young and healthy and she has great eating habits. And you've let her feed.\"</p><p>\"Of course. Anything for her. Her and her baby.\"</p><p>There was a long silence. Then, \"Maybe you want to talk to Mary?\"</p><p>\"About what.\" He shut the water off and shook his palm out over the sink. \"Just because I'm respectful of the demands on my shellan, you think I need a shrink? What the hell?\"</p> <p>He snapped a paper towel free from the roll mounted under the cabinets and dried his hand.</p><p>\"Who's the salad for, Z?\" the doctor asked.</p><p>\"What?\"</p><p>\"The salad. Who's it for?\"</p><p>He pulled out the trash bin and pitched the towel inside. \"Bella. It's for Bella. Look, no offense, but--\"</p><p>\"And when's the last time you ate?\"</p><p>He put his hands up, all \"Stop! In the Name of Love.\" \"Enough. I know you mean well, but I'm a short fuse, and the last thing any of us needs is Vishous coming after me because I snapped at you. I get your point--\"</p><p>\"Look at your hand.\"</p><p>He glanced down. Blood was running from the pad of his thumb onto his wrist and his forearm. If he hadn't had a short-sleeved T-shirt on, the shit would have been pooling at his elbow. Instead, it was trickling onto the terra-cotta tile.</p><p>Doc Jane's voice was annoyingly level, her logic offensively sound. \"You are in a dangerous line of work where you rely on your body to do things that keep you from getting killed. You don't want to talk to Mary? Fine. But you need to make some concessions physically. That cut should have closed by now. It hasn't, and I'm willing to bet it bleeds for the next hour or so.\" She shook her head. \"Here's my deal. Wrath's appointed me as the Brotherhood's personal physician. You screw around with eating and feeding and sleeping such that it impairs your performance, I will bench your ass.\"</p><p>Z stared at the glossy red droplets seeping up from the wound. The river of them went straight over the inch-wide black slave band that had been tattooed on his wrist nearly two hundred years ago. He had one on his other arm and another around his neck.</p><p>Reaching forward, he peeled off another section of paper towel. The blood wiped off just fine, but there was no getting rid of what his sick bitch Mistress had marked him with. The ink was imbedded in his tissue, put there to show that he was property to be used, not an inpidual to live.</p><p>For no good reason, he thought of Nalla's infant skin, so incredibly smooth and completely unmarred. Everyone remarked on how soft it was. Bella. All his brothers. All the shellans of the house. It was one of the first things they commented on when they held her. That and how she was like a down pillow, she was so huggable.</p><p>\"Have you ever tried to get those removed?\" Doc Jane said softly.</p><p>\"They can't be removed,\" he said briskly, dropping his hand. \"The ink has salt in it. It's permanent.\"</p><p>\"But have you ever tried? There are lasers now that--\"</p><p>\"I'd better go take care of this cut so I can finish here.\" He grabbed another paper towel. \"I'll need some gauze and tape--\" \"I have that in my bag.\" She turned to go over to the table. \"I have everything--\"</p><p>\"No, thanks, I'll take care of it myself.\"</p><p>Doc Jane stared up at him, her eyes clear. \"I don't care if you're independent. But stupidity I won't stand for. We clear? That bench has your name on it.\"</p><p>If she'd been one of his brothers, he would have bared his fangs and hissed at her. But he couldn't do that to Doc Jane, and not just because she was a female. Thing was, there was nothing to push back at with her. She was just objective medical opinion.</p><p>\"We clear?\" she prompted, utterly unimpressed by how fierce he had to be looking.</p><p>\"Yeah. I hear you.\"</p><p>\"Good.\"</p><p>\"He has these nightmares. . . . God, the nightmares.\"</p><p>Bella leaned down and stuffed the dirty diaper into the bin. On the way back up, she snagged another Huggies from under the dressing table and brought out the talc and the baby wipes. Palming Nalla's ankles, she hipped up her daughter's little butt, did a fast-and-dash sweep with the cloth, sprinkled some powder, then slid the fresh diaper into place.</p><p>From across the nursery, Phury's voice was low. \"Nightmares about being a blood slave?\"</p><p>\"Has to be it.\" She put Nalla's clean bottom down and taped up the sides of the Huggies. \"Because he won't talk to me about it.\"</p><p>\"Has he been eating? Feeding?\"</p><p>Bella shook her head as she did up the snaps on Nalla's onesie. The thing was pastel pink and had a white skull and crossbones appliqu?d on it. \"Not much on the food and no on feeding. It's like . . . I don't know, the day she was born, he seemed so amazed and engaged and happy. But then some kind of switch was triggered and he just closed up. It's almost as bad as it was in the beginning.\" She stared down at Nalla, who was patting at the pattern on her little chest. \"I'm sorry I asked you to come down here. . . . I just don't know what else to do.\"</p><p>\"I'm glad you did. I'm always there for you both, you know that.\"</p><p>Cradling Nalla on her shoulder, she turned around. Phury was leaning against the creamy wall of the nursery, his huge body breaking up the pattern of hand-painted bunnies and squirrels and fawns.</p><p>\"I don't want to put you in an awkward position. Or take you away from Cormia unnecessarily.\"</p><p>\"You haven't.\" He shook his head, his multicolored hair gleaming. \"If I'm quiet, it's because I'm trying to think of what the best thing to do is. Talking with him isn't always the solution.\"</p><p>\"True. But I'm running out of both ideas and patience.\" Bella went over and sat in the rocker, repositioning the young in her arms.</p><p>Nalla's brilliant yellow eyes stared up out of her angelic little face, and recognition was in her stare. She knew exactly who was with her . . . and who wasn't. The awareness had come in the last week or so. And changed everything.</p><p>\"He won't hold her, Phury. He won't even pick her up.\"</p><p>\"Are you serious?\"</p><p>Bella's tears made her daughter's face wavy. \"Damn it, when is this post-partum depression going to lift? I well up at almost nothing.\"</p><p>\"Wait, not even once? He hasn't gotten her out of the crib or--\"</p><p>\"He won't touch her. Crap, will you hand me a frickin' tissue.\" When the Kleenex box got in range, she snapped one free and pressed it to her eyes. \"I'm such a mess. All I can think about is Nalla going through her whole life wondering why her father doesn't love her.\" She cursed softly as more tears came. \"Okay, this is ridiculous.\"</p><p>\"It's not ridiculous,\" he said. \"It's really not.\"</p><p>Phury knelt down, keeping the tissues front and center. Absurdly, Bella noticed that the box had the picture of an alley of leafy trees with a lovely dirt road stretching off into the distance. On either side, flowering bushes with magenta blooms made the maples look like they were wearing tulle ballet skirts.</p><p>She imagined walking down the dirt road . . . to a place that was far better than where she was now.</p><p>She took another tissue. \"The thing is, I grew up without a father, but at least I had Rehvenge. I can't imagine what it would be like to have a dad who was alive but dead to you.\" With a little cooing sound, Nalla yawned wide and snuffled, rubbing her face with the back of her fist. \"Look at her. She's so innocent. And she responds to love so well . . . I mean . . . Oh, for God's sake, I'm going to buy stock in Kleenex.\"</p><p>With a disgusted noise she flipped another tissue free. To avoid looking at Phury as she blotted, she let her eyes wander around the cheery room that had been a walk-in closet before the birth. Now it was all about the young, all about family, with the pine rocker Fritz had hand-made, and the matching dressing table, and the crib that was still festooned with multicolored bows.</p><p>When her stare landed on the low-slung bookcase with all its big, flat books, she felt even worse. She and the other Brothers were the ones who read to Nalla, who settled the young on a lap and unfolded shiny covers and spoke rhyming words.</p><p>It was never her father, even though Z had learned to read almost a year ago.</p><p>\"He doesn't refer to her as his daughter. It's my daughter. To him, she's mine, not ours.\"</p><p>Phury made a disgusted sound. \"FYI, I'm trying to resist the urge to pound him out right now.\"</p><p>\"It's not his fault. I mean, after all he went through . . . I should have expected this, I guess.\" She cleared her throat. \"I mean, this whole pregnancy thing wasn't planned, and I wonder . . . maybe he resents me and regrets her?\"</p><p>\"You're his miracle. You know you are.\"</p><p>She took more tissues and shook her head. \"But it's not just me anymore. And I won't raise her here if he can't come to terms with the two of us. . . . I will leave him.\"</p><p>\"Whoa, I think that's a little premature--\"</p><p>\"She's beginning to recognize folks, Phury. She's starting to understand she's being shut out. And he's had three months to get used to the idea. Over time, he's gotten worse, not better.\"</p><p>As Phury cursed, she lifted her eyes to the brilliant yellow stare of her hellren's twin. God, that citrine color was what shone out of her daughter's face as well, so there was no looking at Nalla without thinking of her father. And yet . . .</p><p>\"Seriously,\" she said, \"what's this all going to be like a year from now? There is nothing more lonely than sleeping next to someone you're missing as if they were gone. Or having that as a father.\"</p><p>Nalla reached up with her fat hand and grabbed onto one of the tissues.</p><p>\"I didn't know you were here.\"</p><p>Bella's eyes shot to the doorway. Zsadist was standing in it, a tray in his hands bearing salad and a pitcher of lemonade. There was a white bandage on his left hand and a whole lot of don't-ask on his face.</p><p>Looming there, on the verge of the nursery, he was exactly as she had fallen in love and mated him: a gigantic male with a skull trim and a scar down his face and slave bands at his wrists and neck and nipple rings that showed through his tight black T-shirt.</p><p>She thought of him the first time she'd seen him, punching a bag down in the training center's gym. He'd been viciously fast on his feet, his fists flying faster than her eye could track, the bag being driven back from the beating. And then, without even a pause, he'd unsheathed a black dagger from his chest holster and stabbed the thing he'd been pounding, ripping the blade through the bag's leather flesh, the stuffing falling free like the internal organs of a lesser.</p><p>She'd come to learn that the fierce fighter wasn't all there was to him. Those hands of his had great kindness in them as well. And that ruined face with its distorted upper lip had smiled and looked at her with love.</p><p>\"I came down to see Wrath,\" Phury said, getting to his feet.</p><p>Z's eyes flicked to the Kleenex box his twin held, then went to the wad of tissues in Bella's hand. \"Did you.\"</p><p>As he came in and put the tray down on the bureau where Nalla's clothes were kept, he didn't look at his daughter. She, however, knew he was in the room. The young turned her face in his direction, her unfocused eyes pleading, her chubby little arms reaching for him.</p><p>Z stepped back out into the hall. \"Have a good meeting. I'm going out hunting.\"</p><p>\"I'll walk you to the door,\" Phury said.</p><p>\"No time. Later.\" Z's eyes met Bella's for a moment. \"I love you.\"</p><p>Bella hugged Nalla closer to her heart. \"I love you, too. Be safe.\"</p><p>He nodded once and then he was gone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As Zsadist came awake in a panic, he tried to calm his breathing and figure out where he was, but his eyes weren't much help. Everything was dark . . . he was enveloped in a dense, cold blackness that, no matter how hard he strained his vision, he couldn't see through. He could have been in a bedroom, out in a field . . . in a cell.</p><p>He'd come out of sleep like this many, many times. For a hundred years as a blood slave, he'd woken up in a panicked blindness and wondered what was going to be done to him and by whom. After he was free? Nightmares caused him to do the same thing.</p><p>In both cases it was such bullshit. When he'd been the Mistress's property, worrying about the who and the what and the when hadn't helped him. The abuse was inevitable whether he was faceup or facedown on the bedding platform: He was used until she and her studs were sated; then he was left to lie degraded and leaking, alone in his prison.</p><p>And now, with the bad dreams? Waking up in the same terror he'd been in as a slave just validated the past horrors his subconscious insisted on burping up.</p> <p>At least . . . he thought he was dreaming.</p><p>True panic hit him as he wondered which dark owned him. Was it the dark of the cell? Or the dark of his bedroom with Bella? He didn't know. Both looked the same when there were no visual clues to decipher and only the sound of his pounding heart in his ears.</p><p>Solution? He'd try to move his arms and legs. If they were unchained, if they were not shackled, it was just a case of being caught in his mind's choke hold once again, the past reaching out through the graveyard dirt of his memories and grabbing him with bony hands. As long as he could shift his arms and legs through clean sheets, he was okay.</p><p>Right. Move his arms and legs.</p><p>His arms. His legs. Needed to move.</p> <p>Move.</p><p>Oh, God . . . damn you, move.</p><p>His limbs didn't budge, and in the paralysis of his body the clawed truth ripped through him. He was in the damp darkness of the Mistress's cell, chained on his back, thick iron cuffs keeping him on the bedding platform. She and her lovers would be coming for him again, and they would do to him whatever they wanted, staining his skin, soiling the inside of him.</p><p>He moaned, the pathetic sound vibrating up from his chest and breaching his mouth like it was relieved to be free of him. Bella was the dream. He lived in the nightmare.</p><p>Bella was the dream. . . .</p><p>The footsteps approached from the hidden stairwell that ran down from the Mistress's bedroom, the sound echoing, getting louder. And there were more than one set on the stone steps.</p> <p>With an animal's horror, his muscles grabbed and pulled against his skeleton, fighting desperately to get loose from the dirty binding of flesh that was about to be fondled and invaded and used. Sweat broke out on his face, and his stomach seized, bile marshaling an assault up his esophagus to the base of his tongue--</p><p>Someone was crying.</p><p>No . . . wailing.</p><p>A young's cry sounded out from the far corner of the cell.</p><p>His fight stalled while he wondered what an infant was doing in this place. The Mistress had no offspring, nor had she been pregnant during the years he had been owned by her--</p><p>No . . . wait . . . he had brought the young here. It was his young who cried--and the Mistress was going to find the infant. She was going to find the infant and . . . Oh, God.</p><p>This was his fault. He had brought the young here.</p><p>Get the young out. Get the young--</p> <p>Z curled his fists and punched his elbows into the bedding platform, heaving with every ounce of strength he had. The power came from more than his body; it was born of his will. With a massive surge, he . . .</p><p>. . . got absolutely nowhere. The shackles cut through his wrists and his ankles down to his bones, slicing through his skin so that blood mixed with his cold sweat. As the door opened, the young was crying and he couldn't save her. The Mistress was going to--</p><p>Light poured over him, rocketing him into true consciousness.</p><p>He was off his mated bed like he'd been bootlicked by a Chevy, landing in a fighting stance with fists up at his chest, shoulders drawn in steel knots, thighs ready to spring.</p><p>Bella slowly eased back from the lamp she'd turned on, as if she didn't want to spook him.</p><p>He looked around the bedroom. There was, as usual, no one to fight, but he'd woken everyone up. In the corner, Nalla was in her crib crying, and he'd scared the ever-loving shit out of his shellan. Again.</p><p>There was no Mistress. None of her consorts. No cell or chains stretching him out on a bedding platform.</p><p>No young in his cell with him.</p><p>Bella slipped out of bed and went over to the crib, scooping up a red-faced and screaming Nalla. The daughter, however, would have nothing of the comfort offered. The young held its little chubby arms straight out for Zsadist, wailing for its father, tears streaming.</p><p>Bella waited for a moment, as if she were hoping this time would be different and he would go over and take the child into his arms and comfort the infant who so clearly wanted him.</p><p>Z backed away until his shoulder blades hit the far wall, tucking his arms around his chest.</p><p>Bella turned and whispered to her darling one as she went into the adjoining nursery. The door muffled the daughter's whimpering as it slid shut.</p><p>Z let himself slide down until his ass hit the floor. \"Fuck.\"</p><p>He rubbed his skull trim back and forth, then let both hands hang off his knees. After a moment, he realized he was sitting as he had back in the cell, his back against the corner facing the door, his knees up, his naked body shivering.</p><p>He looked at the slave bands around his wrists. The black was so dense in his skin, so solid, it was like the iron cuffs he'd once worn.</p><p>After God only knew how long, the door to the nursery slid open and Bella came back with the young. Nalla was asleep again, but as Bella laid her out in the crib, it was with care, as if a bomb were about to go off at any moment.</p><p>\"I'm sorry,\" he said softly, rubbing his wrists.</p><p>Bella put on a dressing gown and went to the door that led out into the hall. With her hand on the knob, she looked back at him, her eyes remote. \"I can't say this is okay anymore.\"</p><p>\"I'm really sorry about the dreams--\"</p><p>\"I'm talking about Nalla. I can't say that your shunning her is all right . . . that I understand, that it's going to get better and I'll be patient. The fact is, she is your child as well as mine, and it kills me to see you pulling away from her. I know what you went through, and I don't want to be callous, but . . . everything's different for me now. I need to think in terms of what's good for her, and having a father who won't even touch her? That's not it.\"</p><p>Z flexed open both his hands and stared at his palms, trying to imagine picking the young up.</p><p>The slave bands seemed huge to him. Huge . . . and contagious.</p><p>The word wasn't won't, he thought. It was can't.</p><p>The thing was if he did comfort Nalla and play with her and read to her, it would mean she had him for a father, and his legacy was nothing you wanted to saddle a young with. Bella's born daughter deserved better than that.</p><p>\"I need you to decide what you want to do,\" Bella said. \"If you can't be her father, I'm leaving you. I know that sounds harsh, but . . . I have to think of what's best for her. I love you and I will always love you, but it's not about me anymore.\"</p><p>For a moment, he didn't think he'd heard right. Leaving him?</p><p>Bella stepped out into the hall of statues. \"I'm going to go grab something to eat. Don't worry about her--I'll be right back.\"</p><p>She closed the door behind her without a sound.</p><p>When night fell about two hours later, the way that door had shut so quietly was still banging around Z's head.</p><p>Standing in front of his closet full of black shirts and leathers and shitkickers, he sought his inner intentions, chasing them around the maze of his emotions. Sure, he wanted to overcome the head fuck with his daughter. Of course he did.</p><p>It was just insurmountable: What had been done to him might have been in the past, but all he had to do was look at his wrists to see that he was still dirtied by it all--and he didn't want that kind of shit anywhere near Nalla. He'd had the same problem with Bella in the beginning of their relationship, and had managed to get over it with his shellan, but the implications were more grave with the young: Z was the corporeal embodiment of the kind of cruelty that existed in the world. He didn't want his daughter to know that such depths of depravity existed, much less expose her to their aftereffects.</p><p>Fuck.</p><p>What the hell was he going to do when she got to be old enough to look up into his face and ask him why he was scarred and how he'd gotten that way? What would he do when she wanted to know why he had black bands on his skin? What was her uncle Phury going to reply when she asked him why he was missing a leg?</p><p>Z dragged on a shirt and a pair of leathers, then pulled on his chest holster of daggers and opened the gun closet. As he took out a pair of SIG Sauer forties, he checked them quickly. He used to palm nines--shit, he used to fight with nothing but his bare hands. Ever since Bella had come into his life, however, he'd been more careful.</p><p>And this, of course, was the other part of his brain twist. He killed for a living. That was his job. Nalla was going to have to grow up worrying about him every night. How could she not? Bella did.</p><p>He shut the gun closet and relocked it, then tucked the muzzles into his hip holster, checked his daggers, and pulled on his leather jacket.</p><p>He glanced over to the crib where Nalla was still sleeping.</p><p>Guns. Blades. Throwing stars. Christ, the infant needed to be surrounded by rattles and plush teddy bears.</p><p>Bottom line was, he wasn't cut out to be a father. Never had been. Biology, however, had jacked him into the role, and now they were all chained to his past: As much as he couldn't imagine living without Bella, there was no fathoming how he could be the dad Nalla deserved.</p><p>With a frown, he pictured Nalla's coming-out party, something all females of the glymera had one year after their transitions. The daughter always had the first dance with her father, and he saw Nalla dressed in a flowing red gown, her multicolored hair up, rubies at her throat . . . and himself with his fucked-up face and his slave bands peeking out of the cuffs of his tuxedo.</p><p>Great. Helluva picture.</p><p>Cursing, Z went to the bathroom, where Bella was getting ready for the evening. He was going to tell her that he was heading out on a follow-up from the night before and that as soon as he was finished, he'd come home and they would talk. As he looked around the corner, though, he stopped dead.</p><p>In the mist that lingered from her shower, Bella was drying off her body. Her hair was wrapped in a towel, her long neck exposed, her creamy shoulders working this way and that as she made quick work with the terry cloth across her back. Her breasts swayed, catching his eyes, hardening him.</p><p>Fuck him, but as he watched her, all he could think about was sex. God, she was beautiful. He'd liked her rounded by the pregnancy, and he liked her as she was now, too. She'd thinned out quickly after Nalla's birth, her stomach as tight as it had been before, her hips regaining their lean contours. Her breasts were bigger, though, the nipples a deeper pink, the swells heavier.</p><p>His cock punched into his leathers, a criminal wanting out of jail.</p><p>As he rearranged himself, he realized he and Bella hadn't been together since well before the birth. The pregnancy had been difficult, and afterward Bella had needed time to heal and had been rightfully consumed with taking care of her infant.</p><p>He missed her. Wanted her. Thought she was still the most spectacularly erotic female on the face of the planet.</p><p>Bella dropped her robe on the counter, faced the mirror, and stared at herself. With a grimace, she leaned forward and prodded at her cheekbones, her jawline, under her chin. Straightening, she frowned and turned to the side, sucking in her stomach.</p><p>He cleared his throat to get her attention. \"I'm about to go out now.\"</p><p>At the sound of his voice, Bella scrambled to get her robe. Pulling it on quickly, she tied the sash and dragged the lapels in close to her throat. \"I didn't know you were there.\"</p><p>\"Well . . .\" His erection deflated. \"I am.\"</p><p>\"Are you leaving?\" she said as she unwrapped her hair.</p><p>She hadn't even heard his words, he thought. \"Yeah, I'm about to go out now. I'm going to be reachable, though, as always--\"</p><p>\"We'll be fine.\" She bent over and started rubbing her hair dry, the towel's flapping loud to his ear. Even though she was only ten feet away, he couldn't reach her. Couldn't ask her why she hid herself from him. Was too afraid of what the answer might be.</p><p>\"Have a good evening,\" he said roughly. He waited a moment, praying that she would look up at him, smile at him a little, give him a kiss on his way out into the war.</p><p>\"You, too.\" She flipped her hair up and reached for the hair dryer. \"Be safe.\"</p><p>\"I will.\"</p><p>Bella flicked on the hair dryer and picked up her brush to look busy as Z turned and walked out. When she was sure he had to be gone, she stopped the pretense, turning off the dryer and letting it fall to the marble counter.</p><p>Her heart ached so badly, she was sick to her stomach, and as she stared at her reflection, she wanted to throw something at the glass.</p><p>The two of them hadn't been together, as in been together, since . . . God, it must have been four or five months ago, before she'd started spotting.</p><p>He didn't think of her sexually anymore. Not since Nalla had come. It was as if the birth had turned off that part of their relationship for him. When he touched her now, it was as a brother would--gently, with compassion.</p><p>Never with passion.</p><p>At first, she'd thought it was maybe because she wasn't as thin as she'd been, but in the last four weeks her body had bounced back.</p><p>At least, she thought it had. Maybe she was fooling herself?</p><p>Loosening the robe, she parted the two halves, turned to the side, and measured her stomach. Back when her father had been around, back when she'd been growing up, the importance of females in the glymera being thin had been drilled into her, and even after his death all those years ago, those stern warnings about being fat stuck with her.</p><p>Bella wound herself back up, tying the sash tight.</p><p>Yes, she wanted Nalla to have her father, and that was the primary concern. But she missed her hellren. The pregnancy had happened so quickly that they hadn't had the chance to enjoy a lovebird period where they just reveled in each other's company.</p><p>As she picked up the dryer and flicked on the switch again, she tried not to count the number of days since he'd last reached for her as a male would. It had been so long since he'd fished through the sheets with his big, warm hands and woken her up with lips on the back of her neck and a hard arousal pressing into her hip.</p><p>She hadn't reached for him, either, true. But she wasn't taking for granted the kind of reception she'd receive. The last thing she needed now was to be turned down because he wasn't attracted to her anymore. She was already an emotional wreck as a mother, thank you very much. Failure on the female front was too much to handle.</p><p>When her hair was dry, she gave it a quick brush and then went out to check on Nalla. Standing over the crib, looking at their daughter, she couldn't believe things had come down to ultimatums. She'd always known that Z would have continuing issues after what he'd been put through, but it had never dawned on her that they couldn't bridge his past.</p><p>Their love had seemed like it would be enough to get them through everything.</p><p>Maybe it wasn't. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The house was set back from the dirt road and crowded by overgrown bushes and shaggy trees with brown leaves. The design of the thing was a hodgepodge of various architectural styles, with the only unifying element being that they'd all been repro'd badly: It had a roof like a Cape Cod, but was on one story like a ranch; it had pillars on the front porch like a colonial, but was sided in plastic like a trailer; it was set up on its lot like a castle and yet had the nobility of a busted trash bin.</p><p>Oh, and it was painted green. Like, Jolly Green Giant green.</p><p>Twenty years ago the place had probably been built by a city guy with bad taste looking to start life over as a gentleman farmer. Now everything about it was run down, except for one thing: The door was made out of shiny, fresh-as-a-daisy stainless steel and reinforced like something you'd find in a psych hospital or a jail.</p><p>And the windows were boarded up with rows of two-by-sixes.</p> <p>Z crouched behind the rotted shell of what had been a '92 Trans Am and waited for the clouds above to pull together and cover the moon so he could move in. Across the weedy lawn and gravel driveway, Rhage was behind an oak.</p><p>Which was really the only tree big enough to hide the mofo.</p><p>The Brotherhood had found the site the night before by stroke of luck. Z had been downtown patrolling the needle park under Caldwell's bridges when he'd caught a pair of thugs dumping a body into the Hudson River. The disposal had been quick and professional: Nondescript sedan drove up, two guys in black hoodies got out and went to the trunk, body was head-and-footed, remains were tossed into the current.</p><p>Splish-splash, taking a bath.</p><p>Z had been downstream by about ten yards, so when the dead guy floated by, he saw from its grimacing mouth that it was a human male. Normally this would have been cause for doing absolutely nothing at all. If some man had been God-father 'd, that was not his biz.</p> <p>But the wind changed directions and brought him a whiff of something cotton-candy sweet.</p><p>There were only two things Z knew of that smelled like that and walked upright: old ladies and his race's enemy. Considering it was unlikely that Betty White and Bea Arthur were under those hoods channeling their inner Tony Soprano, that meant there were two lessers up ahead. So the sitch was very much on Z's list of things to do.</p><p>With perfect timing, the pair of slayers got into an argument. While they went nose-to-nose and did a couple punch-shoves, Z dematerialized to the pylon nearest the sedan. The license plate on the Impala junker read 818 NPA, and there didn't appear to be any other passenger of either the stiff or the quick variety.</p><p>In the blink of an eye, he dematerialized again, this time to the roof of the warehouse that flanked the bridge. From his crow's- eye view, he waited with his phone to his ear and a line open to Qhuinn, bracing himself against the rush of wind coming up the building's ass.</p><p>Lessers didn't ordinarily kill humans. It was a waste of time, for one thing, because it didn't gain you points with the Omega, and a lot of hassle if you got caught, for another. That being said, if some guy saw something he shouldn't have, the slayers wouldn't hesitate to cash-and-carry him to his royal reward.</p><p>When the Impala finally came out from under the bridge, it took a right and headed away from downtown. Z spoke into his phone, and a moment later a black Hummer emerged right where the Impala had come out.</p> <p>Qhuinn and John Matthew had been taking the night off with Blay at ZeroSum, but those boys were always ready for action. As soon as Z had called, the three raced for Qhuinn's brand-new wheels, which had been parked a block and a half away.</p><p>At Z's direction, the boys floored it to catch up with the sedan. While they closed in, Z kept an eye on the lessers, dematerializing from building top to building top as their POS made its way down the river's edge. Thank fuck the slayers didn't highway it or they might have gotten away.</p><p>Qhuinn had skills behind the wheel and once his Hummer was tailing the SUV reliably, Z stopped his Spidey shit and let the boys do the work. About ten miles later, Rhage took over from them in his GTO just to mix it up and reduce the chance the lessers would catch on that they were being tracked.</p><p>Just before dawn, Rhage had followed them to this place, but it had been too close to daylight to do any kind of infiltration.</p><p>Tonight was follow-up. Big time.</p><p>And what do you know, the Impala was sitting pretty in the driveway.</p><p>As the clouds finally got their act together, Z gave the nod to Hollywood, and the two of them dematerialized to either side of the front door. A quick listen revealed arguing, the voices the same ones Z had heard by the Hudson the night before. Evidently the pair of slayers were still oil-and-watering it.</p><p>Three, two . . . one--</p> <p>Rhage kicked the door to the house open, bootlicking the bitch so hard his shitkicker left a dent in the metal panel.</p><p>The two lessers in the hall swung around, and Z didn't give them a chance to respond. Leading with his SIG's muzzle, he popped both right in the chest, the bullets sending the pair pinwheeling backward.</p><p>Rhage went on dagger duty, leaping forward, stabbing first one and then the other. As the flashes of white light and the sharp sounds faded, the brother leaped to his feet and froze like a boulder.</p><p>Neither Z nor Rhage moved. Using their senses, they sifted through the house's silence, searching for anything that suggested further inhabitation.</p><p>The moan that bubbled up into all the quiet came from the back, and Z walked swiftly toward the sound, muzzle first. In the kitchen the cellar door was open, and he dematerialized to the left of it. A quick head jab and he took a look-see down the stairs. A bald lightbulb hung from a red-and-black wire at the bottom, but the pool of light showed nothing but stained floorboards.</p><p>Z willed the light off down below and Rhage provided cover from upstairs as Z bypassed the rickety steps and dematerialized into the darkness.</p><p>On the lower level he smelled fresh blood and heard the staccato click of rattling teeth from the left.</p><p>He willed the cellar light back on . . . and lost his breath.</p><p>A male civilian vampire was tied by the arms and legs to a table. He was naked and covered with bruises, and instead of looking at Z, he squeezed his eyes shut, as if he couldn't bear to know what was coming at him.</p><p>For a moment Z couldn't move. It was his own nightmare in living color, and reality blurred such that he wasn't sure whether he was the one tied down or the guy who was coming to the rescue.</p><p>\"Z?\" Rhage said from above. \" Anything there?\"</p><p>Z snapped to attention and cleared his throat. \"I'm on it.\"</p><p>As he approached the civilian, he said softly in the Old Language, \"Be of ease.\"</p><p>The vampire's eyes flipped open and his head jerked up on his spine. There was a look of disbelief, then astonishment.</p><p>\"Be of ease.\" Z double-checked the corners of the basement, his eyesight penetrating the shadows, seeking signs of a security system. All he saw was a lot of concrete walls and wooden flooring, along with old piping and wiring snaking around the ceiling. No electric eyes or sparkling new power supplies.</p><p>They were alone and unsupervised, but God only knew for how long. \"Rhage, still clear?\" he shouted up the stairwell.</p><p>\"Clear!\"</p><p>\"One civilian.\" Z assessed the male's body. He'd been beaten, and though he didn't seem to have any open wounds, there was no telling whether he could dematerialize. \"Call the boys in case we need transport.\"</p><p>\"Already have.\"</p><p>Z took a step forward--</p><p>The floor broke apart beneath his feet, splintering right out from under him.</p><p>As gravity grabbed him hard with greedy hands and he went into a free fall, all he could think about was Bella. Depending on what lay at the bottom, this could be--</p><p>He landed on something that shattered on impact, shards of whatever it was slicing at his leathers and his hands before bouncing up to cut into his face and neck. He kept hold of his gun because he'd been trained to, and because the jolt of pain tightened him up from head to foot.</p><p>It took some deep breathing before he could reboot his brain and try to assess any damage.</p><p>As he sat up slowly, the chiming sound of bits of glass falling to a stone floor echoed around him. In the circle of light that fell from the cellar above, he saw that he was sitting in the midst of a brilliant shimmer of crystals. . . .</p><p>He'd fallen on a chandelier the size of a bed.</p><p>And his left boot was facing backward.</p><p>\"Fuck. Me.\"</p><p>His broken lower leg started to pound with pain, making him think that if only he hadn't looked at the damn thing, maybe he would have kept on not feeling it.</p><p>Rhage's face popped over the rim of the ragged hole above. \"You okay?\"</p><p>\"Free the civilian.\"</p><p>\"Are you all right?\"</p><p>\"Leg's shot.\"</p><p>\"How shot?\"</p><p>\"Well, I'm looking at the heel of my shitkicker and the front of my knee at the same time. And there's a high probability I'm going to throw up.\" He swallowed hard, trying to convince his gag reflex to pipe down. \"Get the civilian loose and then we'll see about getting me out of here. Oh, and stick to the rows of nails on the floor. Clearly the boards are weak.\"</p><p>Rhage nodded, then disappeared. As massive footsteps above caused drifts of dust to powder down, Z went into his jacket and took out a Maglite. The thing was about the size of a finger but could throw a beam as strong as the headlight on a car.</p><p>As he panned the thing around, his leg problem bothered him a little less. \"What . . . the hell?\"</p><p>It was like being in an Egyptian tomb. The forty-by-forty-foot room was stocked with objects that gleamed, from oil paintings in gilt frames to silver candelabra to bejeweled statuary to whole mounds of sterling flatware. And across the way there were stacked boxes that probably contained jewelry, as well as a lineup of fifteen or so metal briefcases that must have had money in them.</p><p>This was a looting repository, filled with what had been taken during the raids this past summer. All of this shit had belonged to the glymera--he even recognized the faces in some of the portraits.</p><p>Lot of value down here. And what do you know. Over to the right, close to the packed dirt floor, a red light started blinking. His fall had triggered the alarm system.</p><p>Rhage's head popped back into view. \"Civilian is free, but unable to dematerialize. Qhuinn's less than a half mile away. What the fuck are you on?\"</p><p>\"A chandelier, and that's not the half of it. Listen, we're going to have company. This place is wired and I tripped it.\"</p><p>\"There a staircase to you?\"</p><p>Z wiped the pain sweat off his brow, the shit cold and greasy on the back of his bleeding hand. As he moved the flashlight around, he shook his head. \"Can't see one, but they had to have gotten the loot in here somehow, and sure as hell it wasn't through that floor.\"</p><p>Rhage's head flipped up and the brother frowned. The sound of him unsheathing his dagger was a metal-on-metal gasp of anticipation. \"That's either Qhuinn or a slayer. Drag yourself out of the light while I sort this.\"</p><p>Hollywood disappeared from the hole in the floor, his footsteps now whisper quiet.</p><p>Z holstered his gun because he had to, and cleared some of the crystal fragments out of the way. Palming his ass off the ground, he braced his good foot and spidered away into the darkness, heading for the security beacon. After backing his ass right up to the damn thing, as it was the only break he could find in the piles of art and silver, he settled against the wall.</p><p>When upstairs stayed way too quiet, he knew it wasn't Qhuinn and the boys. And yet there wasn't any fighting.</p><p>And then shit went from bad to worse.</p><p>The \"wall\" he was leaning against slid away and he fell flat on his back . . . at the feet of a pair of white-haired, pissed-off lessers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There were many great things about being a mom.</p><p>Holding your young in your arms and rocking them to sleep was definitely one of them. So was folding their little clothes. And feeding them. And watching them look up at you in happiness and wonder when they first came awake.</p><p>Bella repositioned herself in the nursery's rocker, tucked the blanket under her daughter's chin, and gave Nalla's cheek a little stroke.</p><p>A not-so-hot corollary to momdom, however, was that the whole female-intuition thing was totally heightened.</p> <p>Sitting in the safety of the Brotherhood's mansion, Bella knew there was something wrong. Even though she was safe and sound, and in a nursery that was right out of an article entitled \"The Perfect Family Lives Here,\" it was as if there were a draft going through the room that smelled like dead skunk. And Nalla had picked up on the vibe as well. The young was preternaturally quiet and tense, her yellow eyes focused on some middle ground as if she were waiting for a big noise to go off.</p><p>Of course, the problem with intuition, whether tied to the mother thing or not, was that it was a story with no words and no time line. Although it got you prepared for bad news, there were no nouns or verbs to go with the anxiety, no time/date stamp, either. So as you sat with the ambient dread clamped on the back of your neck like a cold, wet cloth, your mind got to rationalizing because that was the best anyone could do. Maybe it was just First Meal not sitting well. Maybe it was just free floating anxiety.</p><p>Maybe . . .</p><p>Hell, maybe what was churning in her gut wasn't intuition at all. Maybe it was because she'd reached a decision that didn't sit well.</p><p>Yeah, that was more likely the case. After having stewed and hoped and worried and tried to think her way out of the problems with Z, she had to be realistic. She'd confronted him . . . and there had been no real response from him. Not I want you two to stay. Not even I'll work on it.</p> <p>All she'd gotten from him was that he was going out to fight.</p><p>Which was a reply of sorts, wasn't it.</p><p>Looking around the nursery, she cataloged what she would have to pack up . . . not much, just an overnight bag for Nalla and a duffle for herself. She could get another diaper pail and crib and changing table set up easily enough--</p><p>Where would she go?</p><p>The easiest solution was one of her brother's houses. Rehvenge had a number of them, and all she'd have to do was ask. Man, how ironic was that? After having fought to get away from him, now she was contemplating going back.</p><p>Not contemplating. Deciding.</p> <p>Bella leaned to the side, took her cell phone out of the pocket of her jeans, and hit Rehv's number.</p><p>After two rings a deep, familiar voice answered, \"Bella?\"</p><p>There was a roar of music and people talking in the background, the various sounds like a crowd competing for space.</p><p>\"Hi.\"</p><p>\"Hello? Bella? Hold on, let me get into my office.\" After a long, noisy pause, the din was cut off sharply. \"Hey, how are you and your little miracle doing?\"</p><p>\"I need a place to stay.\"</p><p>Total silence. Then her brother said, \"Would that be for three or for two?\"</p><p>\"Two.\"</p> <p>Another long pause. \"Do I need to kill that fool bastard?\"</p><p>The cold, vicious tone scared her a little, reminding her that her beloved brother was not a male you wanted to screw with. \"God, no.\"</p><p>\"Talk, sister mine. Tell me what's going on.\"</p><p>Death was a black parcel that came in a lot of different shapes and weights and sizes. Still, it was the kind of thing that when it hit your front doorstep, you knew the sender without checking the return address or even opening the thing up.</p><p>You just knew.</p><p>As Z back-flatted into the path of those two lessers, he knew that his FedEx-tinction package had arrived, and the only thing that went through his mind was that he wasn't ready to take delivery.</p><p>Course, it wasn't the kind of thing you could refuse to sign for.</p><p>Above him, cast in a dim glow from some kind of light, the lessers froze as if he were the last thing they expected to see. Then they took out their guns.</p><p>Z didn't have a last word; he had a last image, one that totally eclipsed the double-barreled action that was at point-blank range of his head. In his mind he saw Bella and Nalla together in that rocker back in the nursery. It was not a picture from the night before when there had been Kleenexes and red-rimmed eyes and his twin looking grave. It was from a couple of weeks ago, when Bella had been staring down at the young in her arms with such tenderness and love. As if she'd sensed him in the doorway, she'd lifted her eyes, and for a moment the love that was in her face had wrapped around him as well.</p><p>The two gunshots rang out, and the weirdest thing was that the only pain he felt was the sting of the sound in his ears.</p><p>Two flopping thunchs followed, echoing around the stolen riches.</p><p>Z lifted his head. Qhuinn and Rhage were standing right behind where the lessers had been, their guns just lowering. Blay and John Matthew were with them, their guns drawn as well.</p><p>\"You okay?\" Rhage asked.</p><p>No. That would be one big fat hairy fuck-no. \"Yeah. Yeah, I'm tight.\"</p><p>\"Blay, back into the tunnel with me,\" Rhage said. \"John and Qhuinn, you stay with him.\"</p><p>Z let his head fall back and listened as two sets of shitkickers headed off in the distance. In the eerie silence that followed, a wave of nausea rolled over him and every inch of him started to shake, his hands flapping like flags in a brisk wind as he brought them up to feel his face. John's hand touched his arm and he jumped. \"I'm okay . . . I'm okay. . . .\"</p><p>John signed, We're going to get you out of here.</p><p>\"How--\" He cleared his throat. \"How do I know this is happening?\"</p><p>I'm sorry? How do you know . . . ?</p><p>Zsadist's fingers skipped along his forehead as he tried to prod where the slayers had aimed their guns. \"How do I know this is real? And not a . . . How do I know I didn't just die?\"</p><p>John glanced over his shoulder at Qhuinn like he had no idea how to respond and was looking for backup. Then he pounded on his own chest with a solid thumping. I know I'm here.</p><p>Qhuinn leaned down and did the same, a heavy bass sound rising from his chest. \"Me, too.\"</p><p>Zsadist let his head fall back again, his body scrambling in its own skin so badly his feet tap-danced on the hard-packed floor. \"I don't know . . . if this is real . . . oh, shit . . .\"</p><p>John stared at him as if measuring his increasing agitation and trying to figure out what the hell to do.</p><p>Abruptly the guy reached down to Z's broken leg and gave his turned-around shitkicker a quick tug.</p><p>Z shot upright and barked, \"Motherfucker!\"</p><p>But it was good. The pain acted like a great broom sweep of his brain, clearing out the web of delusions and replacing them with a focused, pounding clarity. He was very much alive. He really was.</p><p>Right on the heels of that realization he thought of Bella. And Nalla.</p><p>He had to reach them.</p><p>Z shifted to the side to get his phone, but his vision went furry from what was doing with his leg. \"Shit. Can you get me my cell? In my back pocket?\"</p><p>John carefully rolled him over, took out the RAZR, and handed it to him.</p><p>\"So you don't think there's any working this out?\" Rehv said.</p><p>Bella shook her head in answer to her brother's question, then remembered he couldn't see her. \"No, I don't think so. At least not in the short term.\"</p><p>\"Shit. Well, I'm always here for you, you know that. You want to stay with mahmen?\"</p><p>\"No. I mean, I'm happy to have her come visit during the night, but I need my own space.\"</p><p>\"Because you're hoping he comes after you.\"</p><p>\"He's not going to. This time is different. Nalla . . . has made everything different.\"</p><p>The young snuffled and burrowed in closer to her favorite nook between upper arm and breast. Bella propped the cell phone against her shoulder and stroked the downy-soft hair that was growing in. The waves, when they grew out, were going to be multicolored, with blondes and reds and browns mixed together, just as her father's would be if he didn't trim it so tightly.</p><p>As Rehv laughed awkwardly, she said, \"What?\"</p><p>\"After all these years fighting to keep you on my property, now I don't want you leaving the Brotherhood mansion. For real, nothing is safer than that compound . . . but I do have a house on the Hudson River that's tight. It's next to a friend of mine's, and it's nothing fancy, but there's a tunnel linkup between them. She'll keep you safe.\"</p><p>After he gave her the address, Bella murmured, \"Thank you. I'm going to pack a few things up and have Fritz take me there in an hour.\"</p><p>\"I'll get the fridge stocked for you right now.\"</p><p>The phone made a beeping noise as a text came through. \"Thank you.\"</p><p>\"Have you told him?\"</p><p>\"Z knows it's coming. And no, I'm not going to keep him from seeing Nalla if he wants, but he's going to have to choose to come and see her.\"</p><p>\"What about you?\"</p><p>\"I love him . . . but this has been really hard on me.\" They ended the call shortly thereafter, and as Bella took the phone away from her ear, she saw that a text had come through from Zsadist:</p><p>I'M SO SORRY. I LOVE YOU. PLEASE FORGIVE ME--CAN'T LIVE WITHOUT YOU.</p><p>She bit her lip and blinked hard. And texted back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Z stared at the screen of his phone, praying for a response from Bella. He would have called, but his voice was so shaky he didn't want to alarm her. Plus getting into a huge emotional thing wasn't a great idea, considering he had a broken leg on lesser real estate.</p><p>Rhage and Blay came back through the tunnel.</p><p>\". . . is why they didn't come into the house,\" Rhage was saying. \"The entrance to this storage unit is through the shed out back. They were checking on the security system first, clearly less concerned that the house had been infiltrated.\"</p><p>Z cleared his throat and warbled, \"The alarm is still blinking. If it doesn't get shut off, more will--\"</p> <p>Rhage leveled his gun at the red light, pulled the trigger, and dusted the thing. \"Maybe that'll work.\"</p><p>\"You are such a techie, Hollywood,\" Z muttered. \"Right up there with Bill Gates.\"</p><p>\"Whatever. We need to get you and the civilian out--\"</p><p>Z's phone vibrated and he opened the text from Bella, holding his breath. After he read it twice, he shut his eyes hard and clipped the phone shut. Oh, God . . . no.</p><p>Propping his upper body off the dirt floor, he made a lurch to get on his feet. The shot of agony that ran up his leg helped to distract him from the sight of all the blood that had pooled underneath him.</p> <p>\"What the . . .\"</p><p>\". . . fuck are . . .\"</p><p>\". . . you doing . . .\"</p><p>John signed what the other three were saying: What are you doing?</p><p>\"I need to get home.\" Dematerializing wasn't an option because of his leg--which was making him want to throw up as it flopped around. \"I need to--\"</p><p>Hollywood shoved his perfectly beautiful face right in Z's grille. \"Will you just relax? You're in shock--\"</p> <p>Z grabbed the male's upper arm and squeezed to shut the brother up. He spoke softly, and when he was done, Rhage could only blink.</p><p>After a moment Hollywood said quietly, \"Here's the issue, though. You have a compound fracture, my brother. I promise we'll get you back, but we need to take you to a doctor. Dead is not where you want to be, feel me?\"</p><p>As a wave of light-headedness came swooping in from out of nowhere, Z had a feeling his brother had a point. But fuck it. \"Home. I want--.\"</p><p>His body collapsed. Just folded on him like a house of cards.</p><p>Rhage caught his weight and turned to the boys. \"You two, carry him out of the tunnel. Move it. I'll cover.\"</p><p>Zsadist grunted as he changed hands and was hauled off like a deer carcass found in the middle of a road. The pain was a stunner, making his heart palpitate and his skin shiver, but it was good. He need the physical manifestation of the emotion trapped in the center of his chest.</p><p>The tunnel was about fifty yards in length and tall enough so that only a hob-bit could have any headroom--so the trip out was about as much fun as being born. Qhuinn and John were cranked over, scrambling to hold on to him while hauling ass, two grown- ups in a kid-scaled model. As Z's body jangled and his fucked-up foot rang like a bell, the only thing that kept him conscious was the text from Bella:</p><p>I'M SORRY. I LOVE YOU, BUT SHE AND I HAVE TO GO. I'LL GIVE YOU THE ADDRESS WHEN WE'RE SETTLED LATER TONIGHT.</p> <p>Outside the air was cool, and Z dragged the shit into his lungs in hopes of calming his stomach. He was taken directly to the Hummer and settled in the back, along with the civilian who had passed out cold. John, Blay, and Qhuinn piled in, and then there was a stretch of hurry-up-and-wait.</p><p>Finally Rhage bolted from the house, flashed three fingers and a fist, and dove into the shotgun seat. While the brother started texting on his phone, Qhuinn hit the gas and once again proved he had half a brain: The guy had been smart enough to back in so he had a straight shot down the driveway, and he took the way out with a vengeance.</p><p>Rhage looked at his watch as they bumped along. \"Four . . . three . . . two . . .\"</p><p>The house behind them exploded into a fireball, the aftershocks sending waves of buffering energy through the air--</p><p>Just as a minivan full of the enemy pulled into the end of the driveway, blocking the way onto Route 9.</p><p>Bella double-checked the two L.L. Bean bags and was pretty sure she had everything she needed for the short term. In the one with the green handles she had some clothes for herself, along with her cell phone charger, her toothbrush, and two thousand dollars in cash. The blue-handled one had Nalla's clothes, bottles and diapers, along with wet wipes, rash cream, blankies, a teddy bear, and Oh, the Places You'll Go! by Dr. Seuss.</p><p>The title of Nalla's favorite book was a shitkicker on a night like tonight. It really was.</p><p>When there was a knock on the nursery door, Bella called out, \"Come in.\"</p><p>Mary, Rhage's shellan, popped her head in. Her face was tight, her gray eyes grim even before she looked down at the bags.</p><p>\"Rhage texted me. Z's been injured. I know you're going to leave, and the why is none of my business, but you might consider waiting. From what Rhage said, Z is desperately going to need to feed.\"</p><p>Bella slowly straightened. \"How . . . how badly injured? What--\"</p><p>\"I don't have any more details other than that they'll be home as soon as they can.\"</p><p>Oh . . . God. It was the news she had always dreaded. Z injured out in the field.</p><p>\"What's their ETA?\"</p><p>\"Rhage didn't say. I know they have to drop off an injured civilian at Havers's new clinic, but that's on the way. I'm not sure whether Z's getting treated here or there.\"</p><p>Bella shut her eyes. Zsadist had sent her that text while injured. He'd been reaching out to her when he was in pain . . . and she'd slapped him back with the fact that she was abandoning him to his demons.</p><p>\"What have I done,\" she said softly.</p><p>\"I'm sorry?\" Mary asked.</p><p>Bella shook her head as much at herself as in response to the female.</p><p>Going over to the crib, she looked at their daughter. Nalla was sleeping with the hard, dense exhaustion of the young, her little chest pumping up and down with purpose, her pink hands curled into fists, her brows bunched together as if she were concentrating on growing.</p><p>\"Will you stay with her?\" Bella asked.</p><p>\"Absolutely.\"</p><p>\"There's milk in the fridge over there.\"</p><p>\"I'll be right here. I won't go anywhere.\"</p><p>Back in the driveway of the Jolly Green Giant house in the sticks, Z felt the heavy-duty lurch of Qhuinn slamming on the Hummer's brakes. The SUV held steady as the laws of physics gripped its mass hard, putting an end to its acceleration just before the vehicle crushed the frontal lobe of the minivan in its path.</p><p>Gun muzzles came out of the windows of the Lessening Society's soccer-mom special like the bitch was a stagecoach, and bullets went ape shit, pinging the Hummer's reinforced-steel body and ricocheting off its inch-thick Plexiglas windows.</p><p>\"Second night out with my ride,\" Qhuinn spat. \"And these fuckers are Swiss-cheesing me? Hell, no. Hold on.\"</p><p>Qhuinn threw them into reverse, jumped the SUV back fifteen feet, then punched the engine into first gear and nailed his foot to the floor. Wrenching the wheel to the left, he dodged around the Town &amp; Country, chunks of earth clumping up and clapping against both cars.</p><p>As they bounced around like a boat in bad weather, Rhage reached into his jacket and took out a hand grenade. Opening his bulletproof window just far enough, he popped the pin with his teeth and tossed the fist-size explosive out. By the grace of God the damn thing tripped off the minivan's roof and rolled under the vehicle.</p><p>The three lessers leaped out of that fucker like the thing was on fire.</p><p>And ten seconds later it was, its flames lighting up the night.</p><p>Fuuuuuck, if Z thought the trip through the tunnel had been bad on his leg, it was nothing compared to the bump-and-shatter act it took to get away from those slayers. By the time the Hummer burst out onto Route 9 after having clipped at least one of the lessers on its hood, Zsadist was on the verge of blacking out.</p><p>\"Shit, he's going into shock.\"</p><p>Z realized with little interest that Rhage had turned around and was looking at him, not at the civilian.</p><p>\"Am not,\" he mumbled as his eyes rolled back in his head. \"Just taking a little break.\"</p><p>Rhage's spectacular Bahama-blue stare narrowed. \"Compound. Fracture. Motherfucker. You're bleeding out as we speak.\"</p><p>Z lifted his eyes to Qhuinn's in the rearview mirror. \"Sorry `bout the carpet.\"</p><p>The male shook his head. \"Not to worry. You, I will abso trash my ride for.\"</p><p>Rhage put his hand on Z's neck. \"Damn it, you're white as snow and about as warm. You're going to have to get treated at the clinic.\"</p><p>\"Home.\"</p><p>In a low voice Rhage said, \"I texted Mary not to let her go, okay? Bella's still going to be there no matter how long it takes us to get back to the mansion. She's not leaving you before you get home.\"</p><p>A whole lot of resounding quiet settled in the Hummer, like everyone was busy pretending they didn't hear any of Rhage's newsflash.</p><p>Z opened his mouth to argue.</p><p>But fainted dead away before he could marshal any more objections. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bella paced around the PT room in the training center, orbiting the examination table on shaky legs. She stopped regularly to check the clock.</p><p>Where were they? What else had gone wrong? It had been over an hour. . . .</p><p>Oh, God, please let Zsadist be alive. Please let them bring him back alive.</p><p>Pacing, more pacing. Eventually she paused at the head of the gurney and looked down its length. Putting her hand on its padded top, she found herself thinking of when she had been on the thing as a patient. Three months ago. For Nalla's birth.</p> <p>God, what a nightmare that had been.</p><p>And God, what a nightmare this was . . . waiting for her hellren to be rolled in injured, bleeding, in pain. And that was the best- case scenario. The worst case was a body with a sheet over it, something she couldn't even contemplate.</p><p>To keep herself from going crazy, she thought about the birth, about that moment when both her and Z's lives had changed forever. Like a lot of dramatic things, the big event had been anticipated, but when it arrived had nonetheless been a shock. She'd been in her ninth month out of the usual eighteen and it had been a Monday night.</p><p>Helluva way to start the workweek.</p><p>She'd had a craving for chili, and Fritz had indulged her, whipping up a batch that was spicy as a blowtorch. When the beloved butler had brought the steaming bowl to her, though, she'd abruptly been unable to stomach the smell or the sight of it. Nauseous and sweaty, she'd gone to take a cool shower, and as she'd lumbered into the bathroom, she'd wondered how in the hell she could fit another seven months of the young getting larger in her belly.</p> <p>Nalla, evidently, had taken the random thought to heart. For the first time in weeks she moved strongly--and, with a sharp kick, broke her water. Bella had lifted her robe and looked down at the wetness, wondering for a moment whether she'd lost control of her bladder. Then light had dawned. Although she'd followed Doc Jane's advice and avoided reading the vampire version of What to Expect When You're Expecting, she had enough background to know that once your water breaks, the bus has left the station.</p><p>Ten minutes later she'd been flat on this gurney, with Doc Jane moving quickly, but thoroughly, through an exam. The conclusion was that Bella's body didn't seem ready to get with the program, but Nalla had to be taken out. Pitocin, which was used frequently to induce labor in human women, was administered, and shortly thereafter Bella learned that there was a difference between pain and labor.</p><p>Pain got your attention. Labor got all your attention.</p><p>Zsadist had been out in the field, and when he'd arrived he was so frantic that what little hair was left from his skull trim was standing straight up. As soon as he got through the door, he'd ditched his weapons, the pile growing to the size of a love seat, and rushed to stand at her side.</p><p>She'd never seen him so scared. Not even when he woke up from his dreams of that sadistic Mistress he'd had. His eyes had been black, not from anger but from fear, and his lips drawn so tightly they were a pair of white slashes.</p><p>Having him there had helped her get through the pain. And she'd needed him. Doc Jane had advised against an epidural, as vampires could experience alarming decreases in blood pressure with them. So there had been no buffering at all.</p> <p>And no time to move her to Havers's clinic. Once the Pitocin had fired up her body, the labor had progressed too fast for her to be taken anywhere--although it wouldn't have mattered because dawn was near. Which meant there was no way to get the race's physician to the training center, either.</p><p>Bella came back to the present, smoothing her hand over the thin pillow that rested on the gurney. She could remember holding on to Z's hand hard enough to break his bones as she'd strained until her teeth hurt and she felt as if she were getting ripped in half.</p><p>And then her vitals had crashed.</p><p>\"Bella?\"</p><p>She wheeled around. Wrath was in the PT room's doorway, the king's huge body filling the jambs. With his hip-length black hair and his wraparound sunglasses and his black leathers, he seemed in his silent arrival like a modern-day version of the Grim Reaper.</p><p>\"Oh, please, no,\" she said, gripping onto the gurney. \"Please--\"</p><p>\"No, it's okay. He's okay.\" Wrath came forward and took her arm, holding her up. \"He's been stabilized.\"</p><p>\"Stabilized?\"</p> <p>\"He has a compound fracture of his lower leg and it's caused some bleeding.\"</p><p>Some being massive, no doubt. \"Where is he?\"</p><p>\"He's coming home from Havers's right now. I figured you'd be worried, so I wanted to let you know.\"</p><p>\"Thank you. Thank you . . .\" Even with the problems they'd been having lately, the idea of losing her hellren was catastrophic.</p><p>\"Whoa, easy, there.\" The king wrapped her in his huge arms and held her gently. \"Let the shakes go through you. You'll breathe more that way, believe it or not.\"</p><p>She did as he suggested, loosening the rigid control she'd clamped onto her muscles. Her body shimmied from shoulder to calf and she relied on the king's strength to keep standing. He was right, though. Even as she trembled, she was able to take a deep breath or two.</p><p>When she'd become more stable, she pulled back. As she caught sight of the gurney she frowned and had to start walking around again.</p><p>\"Wrath, may I ask you something?\"</p><p>\"Absolutely.\"</p><p>She had to pace a little more before she could frame the question properly. \"If Beth had a baby, would you love the child as much as you love her?\"</p><p>The king looked surprised. \"Ah . . .\"</p><p>\"I'm sorry,\" she said, shaking her head. \"That's none of my business--\"</p><p>\"No, it's not that. I'm trying to figure out the answer.\" He reached up and lifted the sunglasses from his brilliant, pale green eyes. Though they were unfocused, his stare nonetheless was utterly arresting. \"Here's the thing . . . and I believe this is true for all bonded males. Your shellan is the beating heart in your chest. More than that, even. She's your body and your skin and your mind . . . everything you ever were and ever will be. So a male can never feel more for anyone than he does his mate. It's just not possible--and I think there's some evolution at work. The deeper you love, the more you protect, and keeping your female alive at all costs means she can care for whatever young she has. That being said, of course you love your children. I think of Darius with Beth . . . I mean, he was desperate for her to be safe. And Tohr with John . . . and . . . yeah, I mean, you feel deeply for them, sure.\"</p><p>It was logical, but not much of a relief, considering Zsadist wouldn't even pick Nalla up--</p><p>The double doors of the PT room bounced open as Z was wheeled in. He was dressed in a hospital johnny, probably because his clothes had had to be cut off him at Havers's clinic, and there was no color in his face at all. Both his hands were bandaged, and there was a cast on his lower leg.</p><p>He was out cold.</p><p>She rushed to his side and took his hand. \"Zsadist? Zsadist?\"</p><p>Sometimes IVs and pills weren't always the best course of treatment for the injured. Sometimes all you needed was the touch of the one you loved and the sound of their voice and the knowledge that you were home, and that was enough to drag you back from the brink.</p><p>Z opened his eyes. The sapphire blue stare he met brought a tangle of tears to his lashes. Bella was leaning over him, her thick mahogany hair trailing off one shoulder, her classically boned face drawn in lines of worry.</p><p>\"Hi,\" he said, because it was the best he could do.</p><p>He'd refused any pain meds at the clinic, because the sluggish effect they had always reminded him of the way he'd been drugged at the hands of the Mistress--so he'd been fully conscious as his leg had been opened up and pinned back together by Doc Jane. Well, he'd been with it for part of the time, at any rate. He'd passed out for a while. Upshot was, he felt like death. No doubt looked like it, as well. And there was just too much to say.</p><p>\"Hi.\" Bella smoothed her hand over his skull trim. \"Hi . . .\"</p><p>\"Hi . . .\" Before he broke down and made an ass of himself, he glanced around her to see who else was in the PT suite. Wrath was talking to Rhage in the corner next to the whirlpool bath, and Qhuinn, John, and Blay were standing in front of the banks of steel-and-glass cabinetry.</p><p>Witnesses. Shit. He needed to pull it together.</p><p>As he blinked hard, the details of the room came into clear focus, and he thought of the last time he'd been in it.</p><p>The birth.</p><p>\"Shhh . . .\" Bella murmured, clearly mistaking the reason for his wince. \"Just close your eyes and relax.\"</p><p>He did as he was told, because he was back on the brink, and not because of how badly his leg and his hands were hurting.</p><p>God, that night when Nalla had been born . . . when he'd nearly lost his shellan . . .</p><p>Z squeezed his lids shut, not wanting to relive the past . . . or look too closely at the present. He was in danger of losing Bella. Again.</p><p>\"I love you . . .\" he whispered. \"Please don't leave me.\"</p><p>\"I'm right here.\"</p><p>Yeah, but for how long.</p><p>The panic he felt now took him back to the night of the birth . . . he'd been out in the field with Vishous, investigating a civilian abduction downtown. When the call had come from Doc Jane, he'd dumped V like a bad habit and dematerialized to the mansion's courtyard, plowing through the foyer and into the tunnel. Everyone, shellans and doggens and Wrath alike, had gotten the hell out of his way to avoid becoming bowling pins.</p><p>Down in the training center, in this very room, he'd found Bella stretched out on the gurney he now lay upon. He'd come in right in the middle of a contraction and had had to watch as Bella's body became locked into place as if a giant hand were crushing her around the middle. When the pain eased off she'd taken a deep inhale, then looked at him and offered him a weak smile. As she reached out for him, he'd peeled his weapons off, dropping them on the linoleum.</p><p>\"Hands,\" Doc Jane barked. \"You wash your hands before you come over here.\"</p><p>He'd nodded and gone directly to the deep bucket sinks with the foot pedals. He'd worked a lather all the way up his arms until his skin glowed Barbie pink then he'd dried with a blue surgical cloth and rushed to Bella's side. Their palms had just made contact when the next contraction came roaring through. Bella had squeezed his hand until it was crushed in her grip, but he didn't care. Holding her stare as she'd strained, he would have done anything to take the pain from her . . . and at that moment he would have cheerfully cut his own balls off. He couldn't believe he'd put her through that kind of suffering.</p><p>It got worse. The labor was like a locomotive gathering speed, and its tracks were all over Bella's body. Harder, longer, faster. Harder, longer, faster. He didn't know how she could stand it. And then she couldn't.</p><p>She'd crashed, all her vital signs dropping--heart rate, blood pressure, everything going into the shitter. He'd known how serious it was by how fast Doc Jane had moved. He remembered the drugs going into the IV, and Vishous coming forward with . . . shit, surgical tools and a fetal incubator.</p><p>Doc Jane snapped on a fresh pair of latex gloves, looking first at Bella, then at him. \"We're going to have to go in and get the baby, okay? She's in distress as well.\"</p><p>Nodding. He'd done some nodding at that point on both his and Bella's parts. The Betadine had been a rusty orange as V had rubbed it all over Bella's swollen abdomen.</p><p>\"Is she going to be okay?\" Bella mumbled desperately. \"Is our young going to be--\"</p><p>Doc Jane had leaned down. \"Look at me.\"</p><p>The two females had locked eyes. \"I'm going to do everything I can to get both of you through this. I want you to calm yourself, that's your job. Calm yourself and let me do what I'm best at it. Deep breath now.\"</p><p>Zsadist had taken one along with his shellan . . . and then he'd watched as Bella's eyelids suddenly flared and her stare focused on the ceiling with an odd fixation. Before he could ask her what she was looking at, she'd closed her eyes.</p><p>He'd had a moment of terror that he would never see them open again.</p><p>Then she'd said, \"Just make sure the young is okay.\"</p><p>He'd gone cold at that point, utterly cold, because it was clear Bella didn't think she was coming out of it alive. And the only thing she cared about was the young.</p><p>\"Please stay with me,\" he'd groaned as the incision was made.</p><p>Bella hadn't heard him. She'd drifted away from consciousness, sure as if she were on a boat that had left its mooring and floated off over calm waters.</p><p>Nalla had been born at six twenty-four a.m.</p><p>\"Is it alive?\" he'd asked.</p><p>Though it shamed him to admit it now, the only reason he'd wanted to know was because God forbid Bella had to come around and learn that her daughter had been stillborn.</p><p>While Doc Jane stitched up Bella, Vishous had worked fast with a suction balloon over the young's mouth and nose, then he'd fired up a tiny IV and done something with the hands and feet. Fast. He'd been as fast as his shellan at that point.</p><p>\"Is she alive?\"</p><p>\"Zsadist?\"</p><p>His eyes popped open and he came back to the present.</p><p>\"Do you need more painkillers?\" Bella asked. \"You look as if you're in agony.\"</p><p>\"I can't believe she lived. She was so small.\"</p><p>As the words came out of Zsadist's mouth, Bella was confused, but only for a split second. The birth . . . he was thinking about the birth.</p><p>She stroked the fine, short hair on his head, trying to ease him in some small way. \"Yes . . . yes, she was.\"</p><p>His yellow eyes shifted to the other folks in the room and his voice got quiet. \"Can I be honest?\"</p><p>Oh, shit, she thought. \"Yes, please.\"</p><p>\"The only reason I cared whether she was alive was because I didn't want you to be told she wasn't. She was the only thing you were worried about . . . and I couldn't bear for you to lose her.\"</p><p>Bella frowned. \"You mean at the end?\"</p><p>\"Yes . . . you said you just wanted to make sure she was okay. Those were your last words.\" Bella reached out and put her palm on his cheek. \"I thought I was dying and I didn't want you to be left all alone. I . . . I saw the light of the Fade. It was all around me, bathing me. I was worried about you . . . about what would happen if I weren't living.\"</p><p>His face blanched even further, proving that there was a color paler than white on the spectrum. \"I thought that's what had been happening. Oh . . . God, I can't believe how close it was.\"</p><p>Doc Jane came up to the gurney. \"Sorry to interrupt. I just want to do a quick check on his vitals?\"</p><p>\"Of course.\"</p><p>As Bella watched the doctor make fast work of the examination, she thought of the way those ghostly hands had helped her daughter come into the world.</p><p>\"Good,\" Doc Jane said, linking her stethoscope around her neck. \"This is good. He's stabilized and should be able to get up and move around in another hour or so.\"</p><p>\"Thank you,\" Bella murmured as Z did the same.</p><p>\"My pleasure. Believe me. Now, how about the rest of us take off and let you two have some time alone.\"</p><p>The crowd dispersed amid offers of help and food and anything else that might be needed. As Wrath went over to the door, he paused and looked at Bella.</p><p>Her grip tightened on Z's shoulder as the king bowed his head a little and then shut the door.</p><p>She cleared her throat. \"May I get you something to--\"</p><p>\"We need to talk.\"</p><p>\"It can wait--\"</p><p>\"Until you leave here?\" Z shook his head. \"No. It has to be now.\"</p><p>Bella pulled a rolling stool over and sat down, stroking his forearm because she couldn't hold his bandaged hands. \"I'm scared. If we don't . . . can't bridge this gap . . .\"</p><p>\"Me too.\"</p><p>As their words hung in the quiet of the tiled, clinical room, Bella remembered waking up from the C-section that day of the birth. Zsadist's eyes had been the first thing she'd seen. He'd been in agony as he'd stared down at her, but slowly his pain had lifted, revealing disbelief and then hope.</p><p>\"Show her the young,\" Z had called out sharply. \"Quickly.\"</p><p>Vishous had rolled the fetal incubator over, and Bella had gotten her first look at their daughter. Dragging with her the IV line that was in her arm, she'd put her fingertips on the Plexiglas shell. The instant her touch fell upon the clear shield, the young had turned her head.</p><p>Bella had looked at Zsadist. \"Can we call her Nalla?\"</p><p>His eyes had watered. \"Yes. Absolutely. Anything you want.\"</p><p>He had kissed her and given her his vein and been everything you could want in an attentive, caring mate.</p><p>Coming back to the present she shook her head. \"You seemed so happy. Right after the birth. You were rejoicing with the others. You were there for the ribboning of her crib . . . You went to Phury and you sang to him. . . . \"</p><p>\"Because you were alive and you didn't have to suffer the loss of your young. My worst fears hadn't come to pass.\" Zsadist lifted one of his hands as if he wanted to rub his eyes, but he frowned, clearly realizing he couldn't because of the bandages. \"I was happy for you.\"</p><p>\"But after you fed me, you sat by the incubator and reached out to her. You even smiled as she looked your way. There was love in your face, not just relief. What changed?\" As he hesitated, she said, \"I'm willing to give you more time if that's what it takes, but I can't be shut out of the process. What happened?\"</p><p>Z stared up at the cage of medical lighting hanging above him and there was a long silence, one so long that Bella thought maybe they'd hit an insurmountable wall.</p><p>But then a single fat tear had formed at the corner of his left eye. \"She's in the dream with me.\"</p><p>The words were so soft, Bella had to make sure she'd heard him right. \"I'm sorry?\"</p><p>\"The dream I have of still being with the Mistress. Nalla . . . she's in the cell. I can hear her crying as the Mistress comes for me. I strain at the shackles to get free . . . so I can protect her . . . get her out . . . stop what's going to happen. But I can't move. The Mistress is going to find the young.\" His haunted eyes shifted over. \"The Mistress is going to find her, and it's my fault Nalla's in the cell.\"</p><p>\"Oh . . . my love . . . oh, Z.\" Bella stood up and draped herself carefully over his upper body, hugging him lightly. \"Oh . . . God . . . and you're afraid the Mistress will kill her--\"</p><p>\"No.\" Z cleared his throat once. And again. And again. His chest started to pump up and down. \"She's going to . . . make Nalla watch . . . what they do to me. Nalla has to watch. . . .\"</p><p>Zsadist struggled to keep his emotions in, then lost the fight, weeping in the hard, powerful bursts of a male. \"She's going to have . . . to watch her . . . father get . . .\"</p><p>All Bella could do was hold on tight and wet his hospital gown with her own tears. She'd known whatever it was was bad. But she'd had no idea how bad.</p><p>\"Oh, my love,\" she said, as his arms came around her and his head lifted so that his face was buried in her hair. \"Oh, my darling love . . .\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was about five the following afternoon when Zsadist finally woke up properly. It was good to be in his own bed. It was not so great having a cast on his lower leg.</p><p>Rolling over, he opened his eyes and looked at Bella. She was awake and staring back at him.</p><p>\"How are you feeling?\" she asked.</p><p>\"Okay.\" Physically speaking, at least. The rest of him, his mind and his emotions, were open to question.</p> <p>\"Would you like something to eat?\"</p><p>\"Yeah. In a little bit.\" What he really wanted was to just lie around and stare into his shellan's eyes for a while.</p><p>Bella eased over onto her back and looked up to the ceiling.</p><p>\"I'm glad we talked,\" he said. As much as he hated the past, he'd do anything to keep her from leaving, and if that meant conversation, he'd blabber on until his voice box bit it.</p><p>\"Me too.\"</p> <p>He frowned, feeling the distance. \"What's on your mind?\"</p><p>After a moment she said softly, \"Do you still want me?\"</p><p>He actually had to shake himself. She couldn't possibly be asking . . . \"Good Lord, of course I want you as my shellan. The idea of you leaving is just--\"</p><p>\"Sexually, I mean.\"</p><p>He blinked, thinking about the hardcore arousal he'd gotten the night before--just from watching her towel off. \"How could I not?\"</p><p>She turned her head to him. \"You don't feed and you haven't reached for me . . . well, I haven't either, but I mean--\"</p> <p>\"Nalla needs you most right now.\"</p><p>\"But you do, too . . . at least for my vein.\" She nodded down his body. \"Would your leg have broken if you'd been fed properly? Probably not.\"</p><p>\"I don't know. I fell through a floor . . . onto glass.\"</p><p>\"Glass?\"</p><p>\"A chandelier.\"</p><p>\"God . . .\"</p><p>There was a long silence, and he wondered what she wanted him to do. Was she opening the door to . . . ?</p><p>At even the prospect of sex, his body woke up sure as if it were a gong she'd banged with one hell of an over-the-shoulder shot.</p> <p>Except Bella stayed where she was. And he stayed where he was.</p><p>As silence stretched, he thought about how close to the edge of no return they were. If they didn't take steps to reconnect . . .</p><p>He reached through the sheets, took her hand, and brought it forward to his body.</p><p>\"I want you,\" he said as he placed it on his erection. At the contact, he let out a groan and rolled his hips, pushing himself into her palm. \"Oh . . . man . . . I've missed you.\"</p><p>The fact that Bella seemed surprised shamed him and made him think about her in the bathroom with that towel. When she'd stopped and looked at herself in the mirror, she'd been inspecting her body, he realized now--looking for flaws that weren't there. And she'd covered herself when she'd seen him not because she didn't want to attract his attention, but because she was sure she didn't have it anymore.</p><p>He moved her hand up and down on his shaft. \"I'm desperate to touch you again. All over.\"</p><p>She came closer to him, moving through the sheets. \"You are?\"</p><p>\"How could I not be? You're the most perfect female I've ever seen.\"</p><p>\"Even after--\"</p><p>He shot forward and pressed his lips to hers. \"Especially after.\" He pulled back so she could read his eyes. \"You are just as beautiful as the first time I saw you in the gym all those nights and days ago. You stopped my heart then--just froze it in my chest. And you stop it now.\"</p><p>She blinked quickly, and he kissed her tears away. \"Bella . . . if I had known, I would have said something . . . done something. I just assumed you knew that nothing had changed for me.\"</p><p>\"Since Nalla's come around, everything is different. The rhythm of my nights and days. My body. You and me. So I just assumed--\"</p><p>\"Feel me,\" he groaned, arching into her. \"Feel me and know--Oh, God.\"</p><p>She felt him, all right. Wrapped both her hands around him and stroked him up and down, riding his hard length.</p><p>\"Is this good for you?\" she whispered.</p><p>All he could do was nod and moan. With her gripping him like that, surrounding him with her palms, working him, his brain had pretty much shorted out. \"Bella . . .\" He reached for her with his bandaged hands, then stopped. \"Damn gauze--\"</p><p>\"I'll take it off for you.\" She pressed her lips to his. \"And then you can put your hands wherever you like--\"</p><p>\"Fuck.\"</p><p>He came. Right then and there. But instead of feeling let down, Bella just laughed in the deep, throaty way of a female who knows she's about to get sex from her male.</p><p>He recognized the sound. Loved it. Missed it. Needed to hear--</p><p>From across the room Nalla let out a warm-up wail that quickly escalated into a full-blown, carrier jet-launching, I-need-my- mahmen-NOW cry.</p><p>Bella felt Z's erection deflate and was well aware it wasn't because he'd just had a release. He was capable of going four or five orgasms at a clip--and that was on an average night, not after a dry spell of months and months.</p><p>\"I'm so sorry,\" she said, looking over her shoulder at the crib, feeling torn as to which one she tended to.</p><p>Zsadist took her face in his bandaged palms and turned her to him. \"Go take care of the young. I'll be fine.\"</p><p>There was absolutely no censure in his eyes or his tone. But then, there never had been. He'd never been resentful of Nalla; if anything he'd been too self-sacrificing.</p><p>\"I'll just be--\"</p><p>\"Take your time.\"</p><p>She got off the bed and went to the crib. Nalla reached her little hands out and calmed some--especially as she was picked up.</p><p>Right. Wet diaper and hungry.</p><p>\"I won't be long.\"</p><p>\"Not to worry.\" Z lay back against the black satin sheets, his scarred face no longer pulled in hungry lines, his body still, not straining.</p><p>She hoped it was because the orgasm had relaxed him. Feared it was because he didn't think she'd be back anytime soon.</p><p>Bella nipped into the nursery, executed a fast diaper swap, then went to the rocker and gave Nalla what she needed. As she held her young and rocked, she realized how true it was that having a baby changed everything.</p><p>Including the concept of time. What she'd meant to be a quick fifteen-minute feeding turned into a two-hour fuss, throw-up, fuss, feed, throw-up, burp, cry, diaper-change, fuss, feed marathon.</p><p>When Nalla finally settled, Bella let her head fall back against the rocker in a familiar state of exhaustion and satisfaction.</p><p>The mother business was amazing, transformative, and a little addictive--and she could now understand how females got way overfocused on their offspring. You were fed by taking care of and doing right by them. You were also all-powerful as The Mother. Anything she said went when it came to Nalla.</p><p>Thing was, though, she missed being Z's shellan. Missed waking up with him moving on top of her, hot and hungry. Missed the feel of his fangs going deep into her throat. Missed the way that scarred face of his looked after they'd made love, all flushed and soft and full of reverence and love.</p><p>The fact that he was so hard with everyone else, even his Brothers, made his sweetness with her even more special. Always had.</p><p>God, that dream of his. She wasn't willing to say it changed everything between them, but it changed enough so that she wouldn't leave him now. What she wasn't sure of was what came next. Z required more help than she could provide him. He needed professional intervention, not just loving support from his mate.</p><p>Maybe there was a way Mary could step in. She had a counseling background and had been the one to teach him to read and write. There was no way he would talk to a stranger, but Mary . . .</p><p>Ah, hell, there was no way he'd talk to Rhage's shellan about the ins and outs of his past. The experiences were too horrific and the pain went too deep. Plus he hated getting emotional in front of anybody.</p><p>Bella got up and put Nalla in the smaller crib in the nursery--on the off chance Zsadist was still in bed, naked and in the mood.</p><p>He wasn't. He was in the bathroom, and going by the whirring sound and the spray of water, he was trimming his hair in the shower. On the bedside table there was a pair of scissors and the bandages that had been on his hands, and all she could think of was that she wished she had done it for him. No doubt he'd waited and waited and waited for her, and then given up, not just about the sex but about the help. He must have struggled to get the scissors to work with just the top half of his fingers showing . . . but given what time it was, he either stripped off the gauze himself or had no shower before he went out to fight.</p><p>Bella sat on the bed and found herself arranging the split in her robe so that when she crossed her legs they'd stay covered. This was a familiar ritual, she realized, her waiting for him outside of the bath. When Z finished showering and emerged in a towel, they would talk about nothing at all while he dressed in his closet. Then after he went down for First Meal, she would bathe and dress with equal privacy.</p><p>God, she felt small. Small compared to the problems they had and the demands of their daughter and the fact that she wanted a lover for a hellren, not a polite roommate.</p><p>The knock on the door made her jump. \"Hello?\"</p><p>\"It's Doc Jane.\"</p><p>\"Come on in.\"</p><p>The doctor poked her head around the door. \"Hey, is himself around? I thought I'd remove his bandages--Okay, clearly you two have covered that part.\"</p><p>As the doctor jumped to the wrong conclusion, Bella kept her mouth shut. \"He should be out of the bathroom soon. Can his cast come off?\"</p><p>\"I believe so. Why don't you tell him to meet me down in the PT suite when he's ready? I'm working on the medical facility expansion, so I'll just be puttering around with my tool belt.\"</p><p>\"Will do.\"</p><p>There was a long moment with just the buzzing razor and the shower running in the background.</p><p>Doc Jane frowned. \"Are you okay, Bella?\"</p><p>Forcing a smile, she put both hands up in ward-off mode. \"I'm perfectly healthy. I don't need another examination. Ever.\"</p><p>\"That I believe.\" Jane smiled, then glanced at the bathroom's doorway. \"Listen . . . maybe you should go wash his back, if you know what I mean.\"</p><p>\"I'll wait.\"</p><p>Another silence. \"May I make a suggestion that is completely intrusive?\"</p><p>\"Hard to imagine you can be more intrusive than you already have,\" Bella said with a wink. \"I'm serious.\"</p><p>\"All right.\"</p><p>\"Keep Nalla's main crib in the nursery and leave the door mostly closed as she sleeps in there. Get a baby monitor so you can hear her.\" Doc Jane swept her eyes around. \"This is the room you and your husband share . . . you need to be something more than mommy, and he needs you to himself for a little bit each day. Nalla will be fine and it's important she get used to sleeping on her own.\"</p><p>Bella looked at the crib. The idea of moving it out was oddly and irrationally terrifying. As if she were throwing their daughter to the wolves. Except if she wanted more than a roommate, they needed the kind of space that had nothing to do with square footage.</p><p>\"That might be a good idea.\"</p><p>\"I've worked with a lot of people who have had babies. Doctors like to procreate. What can I say. After the first one comes along, there's always an adjustment period. It doesn't mean there's anything wrong with the marriage, it just means that new boundaries have to be established.\"</p><p>\"Thank you . . . really, I appreciate it.\"</p><p>Doc Jane nodded. \"I'm always here if you need me.\"</p><p>When the door shut, Bella went over to the crib and smoothed the multicolored satin ribbons that hung from its rails. As the cool lengths slid through her fingers, she thought of the pledging ceremony and all the love that had been shared. Nalla would always be adored in this house, cared for, protected.</p><p>She had a moment of panic as she released the brakes and started rolling the infant's bed toward the nursery--but she was going to get over that. Had to. And she would buy a baby monitor right away.</p><p>She parked the crib next to the one that was there, the one Nalla never slept as well in. Even now the young's forehead was crinkled, and she was pinwheeling her arms and legs, a sure sign she was going to wake up soon.</p><p>\"Shhh, mahmen's got you.\" Bella lifted the young up and put her down in her preferred place. The young snuffled and positively cooed as she snuggled into herself and put her little hand through the slats, grabbing onto Wrath and Beth's red-and-black bow.</p><p>This was promising. Deep breathing and a full belly meant a nice long sleep.</p><p>At least Nalla didn't feel as though she'd been kicked to the curb.</p><p>Bella went back into the bedroom. The bath was quiet, and as she put her head through the doorway, she saw the fine humidity left in the air from the shower and caught the lingering scent of cedar shampoo.</p><p>He was gone.</p><p>\"You moved the crib?\"</p><p>She turned around. Z was standing in the double doors of his closet, his boot-cut leathers on and his black shirt hanging from his hand. His chest, with its marking of the Brotherhood and its nipple rings, gleamed in the light thrown over his shoulders.</p><p>Bella glanced over to where Nalla had always slept. \"Well, this is . . . you know, our space. And, ah, she's fine in the other room.\"</p><p>\"You sure you're going to be okay with this?\"</p><p>If it meant she could be with him as his shellan? \"Nalla will be fine. She's just next door if she needs me, and she's started to sleep through big hunks of the day so . . . yes, I feel all right about it.\"</p><p>\"You're . . . sure?\"</p><p>Bella looked up at him. \"Yes. Absolutely sure--\"</p><p>Z threw down his shirt, dematerialized right at her, and took her down on the bed, all but tackling her. His bonding scent went crazy as his mouth ground into hers and his hard, heavy weight pushed her down into the mattress. His hands were rough with her nightgown, ripping it as he wrenched the two sides apart. As her breasts were bared, he growled deep and low.</p><p>\"Oh, yes . . .\" she moaned, frantic as he was.</p><p>She shoved her hands between their hips and broke a nail flipping his fly open and unzipping it--</p><p>Z let out another animal sound as his erection popped out into her hand. Rearing back, he nearly shredded his leathers trying to get them down his legs and off the cast. After struggling, he left them around his knees with a \"Fuck it.\"</p><p>He leaped back on her, finished tearing apart her nightgown, and split her thighs wide. Except then he paused, a worried look threatening to overtake the passion in his face. He opened his mouth, clearly about to ask her if she was okay with-- \"Shut up and get inside of me,\" she barked, grabbing the back of his neck and pulling him down to her lips.</p><p>He roared and punched into her core, the penetration a bomb that went off in her body, sparks shooting through her, igniting her blood. She gripped his ass hard as his hips jackhammered until he followed where she was, coming in a massive, full-torso contraction.</p><p>The instant it passed he threw his head back, bared his fangs, and hissed like a great cat. Arching back into the pillow, she put her face to the side, giving him her throat so that he--</p><p>As Zsadist struck hard and deep, she orgasmed again, and while he drew on her vein the sex pounded on. He was even better than she'd remembered, his muscles and bones churning on top of her, his skin so smooth, his bonding scent blanketing her in that special dark spice.</p><p>When he finished feeding and orgasmed for . . . God only knew how many times he'd come . . . his body stilled and he lapped at her throat to close the bite wound. The lingering, luscious strokes of his tongue made her want him again, and as if he read her mind, he rolled over onto his back and took her with him, keeping them joined.</p><p>\"Do me,\" he demanded, his wild yellow eyes locking on her full breasts.</p><p>She cupped herself where his stare was fixated and pinched her own nipples as she rode him nice and slow. His moans and the way his hands tightened on her knees made her feel more beautiful than any words he could have spoken.</p><p>\"God . . . I've missed you,\" he said.</p><p>\"Me too.\" Dropping her hands to his shoulders, she leaned into him and swung her hips more freely.</p><p>\"Oh, fuck, Bella--take my vein--\"</p><p>The invitation was accepted before he finished issuing it and she was no more gentle than he had been. His taste was spectacular, and more intense than it had been. Ever since the birth, when she'd fed it had been . . . courteous. But this was raw, a champagne cocktail of power and sex, not just nutrition.</p><p>\"I love you,\" he sighed as she took from him.</p><p>They made love four more times.</p><p>Once more on the bed.</p><p>Twice on the floor halfway to the bathroom.</p><p>Once again in the shower.</p><p>Afterward they wrapped themselves in thick white towels and climbed back into bed.</p><p>Zsadist tucked her into his side and kissed her forehead. \"Is the whole issue as to whether I'm still attracted to you settled?\"</p><p>She laughed, trailing her hand over the pads of his pecs and down onto his six-pack. She swore she could feel his muscles strengthening under her palm, his body drawing on what he'd gotten from his feeding. The fact that she was making him strong made her proud . . . but more than that, it made her feel connected to him.</p><p>The Scribe Virgin had been a smart one when she'd created a race that needed to feed from itself.</p><p>\"Well? Has it?\" Z rolled over on top of her, his scarred face breaking into an I-am-the-man smile. \"Or do I need to prove it again?\"</p><p>She ran her hands up his heavy arms. \"No, I think we're--Z!\"</p><p>\"What?\" he drawled as he nestled his way in between her legs again. \"I'm sorry. I can't help it. I'm still hungry.\" He put his mouth to hers as gentle as a breath. \"Mmmm . . .\"</p><p>His lips went down to her neck and he gave his bite mark a little nuzzle, as if he were saying thank-you.</p><p>\"Mmm . . . mine,\" he growled.</p><p>So slow, so soft . . . his mouth went down farther, to her breast. He paused at the nipple.</p><p>\"Are they sensitive?\" he asked, rubbing the tip of his nose over her crest, then licking her.</p><p>\"Yes . . .\" She shivered as he blew a stream of air over where his tongue had been.</p><p>\"They look it. All red and pouty and pretty.\" He was ever so careful with her breasts, caressing them with his hands and kissing them lightly.</p><p>When he moved down to her stomach she started to get hot and restless again, and he smiled up at her. \"Have you missed my kisses, darling mate? The ones I like to give you between your thighs?\" \"Yes,\" she choked out while anticipation shivered through her. Given the erotic little grin on his face and the evil cast to his yellow stare, he was once again a male with plans and a wide-open schedule.</p><p>He rose up on his knees. \"Open your legs for me. I like to watch you--Oh . . . shit . . . yeah.\" He rubbed at his mouth like he was warming the thing up. \"That's what I'm talking about.\"</p><p>His shoulders bunched up hard as he leaned down and made like a cat to a bowl of milk--while she made like an ehros, giving herself up to him and his warm wet mouth.</p><p>\"I want to go slowly,\" he murmured against her core as she groaned his name. \"I don't want to finish my treat too quickly.\"</p><p>That wasn't going to be a problem, she thought. For him, she was a pool with no bottom . . .</p><p>His tongue slipped inside of her, in a hot penetration, then went back to its sweet, dragging strokes. Looking down her body, she saw him staring up at her with glowing citrine eyes . . . and as if he'd waited for her gaze to meet his, he flicked the top of her sex back and forth.</p><p>Watching his pink flesh work hers threw her over the edge again.</p><p>\"Zsadist . . .\" she groaned, palming his head and pushing her hips up.</p><p>There was nothing more delicious than being between your shellan's legs.</p><p>It wasn't just the taste; it was the sounds and the scents and the way she looked at you with her head cocked to the side and her rosy lips open so she could breathe. It was the soft, welling center of everything that made her female against your mouth and the trust she had in letting you get this close. It was everything private and sensual and special. . . .</p><p>And the kind of thing you could do forever.</p><p>As his shellan let out the most incredible moan and started to orgasm, Zsadist moved up her body and put himself inside so he could feel the contractions along his shaft.</p><p>He put his mouth to her ear as he came into her. \"You are everything to me.\"</p><p>When they rested together afterward, he stared down her full breasts to her abdomen and thought of how amazing her body was compared to his. Her curves and feminine strength had created a whole new person, had provided the protective place for the alchemy of them coming together and making life.</p><p>The two of them.</p><p>\"Nalla . . .\" he whispered. \"Nalla has . . .\"</p><p>He felt her tense up. \"Has what?\"</p><p>\"Nalla has my eyes. Doesn't she.\"</p><p>His shellan's voice became soft and careful, like she didn't want to spook him. \"Yes, she does.\"</p><p>Z put his hand on Bella's stomach and rubbed circles over the taut skin, as she had done so many times while pregnant. He was ashamed of himself now . . . ashamed that he hadn't touched her belly once. He'd been so worried about the birth that the looming roundness had seemed like a threat to both their lives, not something to rejoice in.</p><p>\"I'm sorry,\" he said abruptly.</p><p>\"What for?\"</p><p>\"You've had to do all this on your own, haven't you. Not just these last three months, but before. When you were pregnant.\"</p><p>\"You were always there for me--\"</p><p>\"But not for Nalla, and she was a part of you. Is a part of you.\"</p><p>Bella propped her head up. \"She's a part of you, too.\"</p><p>He thought of the wide, bright yellow eyes of the young. \"Sometimes I think she might look a little like me as well.\"</p><p>\"She looks almost identical to you. She has your chin and your eyebrows. And her hair . . .\" Bella's voice started to get excited, as if she had wanted to talk with him about all the ins and outs of the young's makeup for a while. \"Her hair is going to be exactly like yours and Phury's. And have you seen her hands? Her forefingers are longer than her ring fingers, just like yours.\"</p><p>\"Really?\" Man, what kind of father was he that he didn't know all this.</p><p>Well, that was easy. He hadn't been any sort of father at all.</p><p>Bella extended her hand. \"Let's shower, and then come with me. Let me introduce you to your daughter.\" Z took a deep breath. Then nodded.</p><p>\"I'd like that,\" he said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As Zsadist breached the doorway of the nursery, he actually double-checked to make sure his shirt was properly tucked into his leathers.</p><p>Man, he loved the smell of the room. Lemon-scented innocence was what he called it in his mind. Sweet like a flower, but not cloying. Clean.</p><p>Bella squeezed his hand and led him over to the crib. Surrounded by satin bows that were bigger than she was, Nalla was curled up on her side, her arms and legs tucked in tight, her eyes shut hard as if she were working really, really, really diligently at being asleep.</p><p>The instant Z looked over the lip of the crib, she stirred. Made a little noise. In her sleep her hand reached out, not toward her mother, but to him.</p> <p>\"What does she want?\" he asked like an idiot.</p><p>\"She wants you to touch her.\" When he didn't move, Bella murmured, \"She does this in her sleep . . . she seems to know who's around and she likes a little pat.\"</p><p>To his shellan's absolute credit, she didn't force him to do anything.</p><p>But Nalla wasn't happy. Her little hand and arm strained for him.</p><p>Z wiped his palm on the front of his shirt, then rubbed it up and down a couple of times on his hip. As he reached forward, his fingers trembled.</p> <p>Nalla made the connection. His daughter took his thumb and held it with such strength he felt a spear of pure, undiluted pride shoot through his chest.</p><p>\"She's strong,\" he pronounced, his approval positively dripping off the words.</p><p>Bella made a little noise beside him.</p><p>\"Nalla?\" he whispered as he bent down. His daughter pursed her little lips and held on even stronger.</p><p>\"I can't believe that grip of hers.\" He let his forefinger brush lightly on his daughter's wrist. \"Soft . . . oh, my God, she's so soft-- \"</p><p>Nalla's eyes flipped open. And as he looked into a stare the exact golden color of his own, his heart stopped. \"Hi . . .\"</p> <p>Nalla blinked and waved his finger and transformed him: Everything stopped as she moved not just his hand, but his heart.</p><p>\"You're like your mahmen,\" he whispered. \"You make the world go away for me. . . .\"</p><p>Nalla kept wagging his hand and let out a coo.</p><p>\"I can't believe her grip. . . .\" He glanced up at Bella. \"She's so--\"</p><p>Tears were streaming down Bella's face, and her arms were locked around her chest as if she were trying not to shatter apart.</p><p>His heart moved again, but for a different reason.</p><p>\"Come here, nalla,\" he said, reaching out to his shellan, tucking her in against him with his free hand. \"Come here to your male.\"</p><p>Bella buried her face into his chest and her palm found his.</p> <p>As Z stood there, with a hold on both his daughter and his mate, he felt eight thousand feet tall, and faster than his Carrera and stronger than an army.</p><p>His chest swelled with renewed purpose. They were both his, these two. His and his alone, and he had to take care of them. One was his heart and the other a piece of himself, and they completed him by filling voids he didn't know he had.</p><p>Nalla looked up at her parents and the most adorable sound came out of her button mouth, a kind of, Well, isn't this lovely, the way things have sorted out.</p><p>But then his daughter reached up with her other hand . . . and touched the slave band on his wrist.</p><p>Z stiffened. He couldn't help it.</p><p>\"She doesn't know what they are,\" Bella said softly. He took a hard breath. \"She will. Someday she will know exactly what they are.\"</p><p>Before Z went down to see Doc Jane, he spent more time with his ladies. He ordered some food for Bella, and while it was being prepared he watched for the first time as his daughter was fed. Nalla zonked right out afterward, which was perfect timing, as Fritz arrived with the food. Z fed his shellan from his own hand, taking special satisfaction in choosing the very best parts of the chicken breast and the homemade rolls and the broccoli spears for her.</p><p>When the plate was clean and the wineglass empty, he wiped Bella's mouth with a damask napkin as her lids fluttered down. Tucking her in, he kissed her, picked up the tray and his right shitkicker, and stepped out.</p><p>As he closed the door quietly and heard the knob click, a glow of contentment bathed him. His females were fed and sleeping and safe. He'd done his job well.</p><p>Job? Try mission in life.</p><p>He glanced toward the nursery door and wondered whether, as a male, you bonded with your children or not. He'd always heard it was only with your shellan . . . but he was starting to have some serious protective instincts over Nalla. And he hadn't even picked her up yet. Give him two weeks of getting familiar with her? He was liable to become an H-bomb if anything threatened her.</p><p>Was that what being a father was like? He didn't know. None of his brothers had young and there was no one else he could think of to ask.</p><p>Heading for the stairs, he limped down the hall of statues, boot, cast, boot, cast, boot, cast. . . . and he looked at his wrists as he went along.</p><p>Downstairs he took the dishes into the kitchen and thanked Fritz, then went into the tunnel that led to the training center. If Doc Jane had given up waiting on him, he was going to cut the cast off himself.</p><p>Stepping out through the closet in the office, he heard the high whining sound of a table saw and followed the scream to the gym. On the way he was looking forward to seeing how Jane's new clinic was coming along. The three treatment bays, which were being constructed out of one of the facility's audience halls, were designed to function as either surgical suites or patient bays, and the equipment was going to be state of the art. Doc Jane was investing in a CAT scan, digital X-ray imaging, and ultrasound technology, along with an electronic medical records system and a host of hi-tech surgical tools. With a supply room worthy of a fully functioning emergency department, the goal was to circumvent the Brotherhood's use of Havers's clinic.</p><p>Which was safer for everybody. The Brotherhood's compound was surrounded by mhis, thanks to V, but the same couldn't be said for where Havers practiced--as had been proven when the clinic was sacked over the summer. Considering that the Brothers could be tailed at any time, it was smart to keep as many things having to do with them in-house.</p><p>Z cracked one of the gym's metal doors open and paused. Yeah, whoa. Doc Jane evidently had some serious Extreme Home Makeover in her.</p><p>Last night, when Z had been rolled in, everything had been as it always was. Now, less than twenty-four hours later, a six-foot- by-twelve-foot hole had been busted out of the cinder-block wall across the way. The opening exposed the audience hall that was going to be converted, and right in front of the chasm, V's mate was taking a two-by-four and feeding it into a table saw, her hands solid, the rest of her ghostly transparent.</p><p>When she caught sight of Z, she finished with the board and turned the machine off. \"Hey!\" she called out as the din faded. \"You ready to have that cast removed?\"</p><p>\"Yeah. And clearly you're good with a saw.\"</p><p>\"You better believe it.\" She grinned and gestured toward the hole. \"So, you like my interior decorating?\"</p><p>\"You don't fool around.\"</p><p>\"Masonry hammers rock, what can I say?\"</p><p>\"I'm ready for the next board,\" V hollered from the lecture hall.</p><p>\"It's ready.\"</p><p>V came out wearing a tool belt hung with a hammer and several chisels. As he went over to his female, he said, \"Hey, Z, how's your leg?\"</p><p>\"Gonna be better once Doc Jane takes this deadweight off.\" Z nodded across the way. \"Man, you guys are going to town.\"</p><p>\"Yeah, we should be able to take care of the framing tonight.\" Doc Jane handed her male the board and gave him a quick kiss, her face becoming solid as contact was made. \"I'll be right back. Just going to take off his cast.\"</p><p>\"Don't rush.\" V nodded at Zsadist. \"You look tight. I'm glad.\"</p><p>\"Your female's a miracle worker.\"</p><p>\"That she is.\"</p><p>\"Okay, enough with the ego stroking, boys.\" She smiled and kissed her mate again. \"Come on, Z. Let's do it.\"</p><p>As she turned away, V's eyes followed her body . . . which no doubt meant that as soon as Zsadist was out of their hair, the new clinic wasn't the only thing that was going to get worked on.</p><p>When Doc Jane and Z got to the PT suite, he went over and hopped up onto the gurney. \"Thought maybe you'd want to use that table saw on me.\"</p><p>\"Nah. You already have one person in your bloodline missing a leg. Two would be overkill.\" Her smile was gentle. \"Any pain?\"</p><p>\"Nope.\"</p><p>She rolled over a portable X-ray machine. \"Put your leg up--perfect. Thanks.\"</p><p>As she came back at him with a lead drape, he took it from her and settled it over himself.</p><p>\"Can I ask you something?\" he said.</p><p>\"Yup. Let me get this done first, though.\" She arranged the eye of the machine and took a picture, a short, humming burst rising up into the room. After checking a computer screen across the way, she said, \"On your side, please.\"</p><p>He rolled over and she moved his leg around. After another quick hum and a check of the monitor, she said, \"Okay, you can sit up. Leg looks great, so I'm just going to get rid of this outstanding plaster job I did.\"</p><p>She handed him a blanket and turned her back as he shucked his leathers. Then she brought over a stainless-steel saw and carefully went to work on his cast.</p><p>\"So what's your question?\" she said over the buzzing as she worked.</p><p>Z rubbed the slave band on his left wrist, then extended his arm toward her. \"Do you really think I could get these taken off?\"</p><p>Jane paused with the saw still running, no doubt collecting her thoughts not only from a medical standpoint but a personal one. She made a noise, a little huh, and quickly finished shucking the cast.</p><p>\"You want to clean your leg up?\" she asked, bringing over a damp washcloth.</p><p>\"Yeah. Thanks.\"</p><p>After he made quick work with the tidy business, she gave him something to dry off with.</p><p>\"Mind if I take a closer look at the skin?\" she said, nodding to his wrist. When he shook his head, she bent over his arm.</p><p>\"Laser removal of tattoos in humans is quite common. I don't have the technology here, but with your help, I have an idea how we could give it a shot. And who could do it for you.\"</p><p>He stared down at the black band and thought of his daughter's little hand on that dense black ink.</p><p>\"I think . . . yeah, I think I want to try.\"</p><p>When Bella woke up and stretched in her mated bed, she felt like she'd been on vacation for a month. Her body was refreshed and strong . . . as well as sore in all the right places. And in spite of her earlier shower, Z's scent remained all over her, and wasn't that just perfect.</p><p>Going by the clock on the bedside table, she'd been out like a light for about two hours, so she got up, put on her robe, and brushed her teeth, thinking a check on Nalla and maybe a snack was a good thing. She was on her way into the nursery when Z came through the door.</p><p>She couldn't help beaming at him. \"Your cast is off.\"</p><p>\"Mmm-hmmm . . . come here, female.\" He walked over to her, wrapped his arms around her, and bent her backward so she had to grab onto his arms to stay upright. He kissed her long and slow, rubbing his lower body and his huge erection into the juncture of her thighs.</p><p>\"I missed you,\" he purred against her throat.</p><p>\"You just had me only two hour--\" His tongue in her mouth silenced her, as did his hands, which ended up on her butt. He carried her over to one of the windowsills, propped her up on the molding, unzipped himself, and--</p><p>\"Oh . . . God,\" she groaned with a smile.</p><p>Now this . . . this was the male she knew and loved. Always hungry for her. Always wanting to be close. As he started to move slowly inside of her, she remembered back in the beginning, after he'd finally opened himself up to her. She'd been surprised by how much he wanted to be cozied against her, whether it was during meals or when they were hanging with the Brothers or during the day when they slept. It was as if he'd been making up for centuries of not having warm, nurturing contact.</p><p>Bella wrapped her arms around his neck and put her cheek to his ear, the baby-soft brush of his skull trim caressing her face as he moved.</p><p>\"I'm going to . . . need your help,\" he said as he surged forward and slid back.</p><p>\"Anything . . . just don't stop. . . .\"</p><p>\"Wouldn't . . . dream . . . of it--\" The rest of what he said was lost as the sex took control. \"Oh, God . . . Bella!\"</p><p>After they were finished, her male pulled back a little, his citrine eyes sparkling like champagne. \"By the way . . . hi. I forgot to say that when I walked in.\"</p><p>\"Oh, I think you greeted me just fine, thank you very much.\" She kissed his mouth. \"Now . . . help?\"</p><p>\"Let's get you tidied up,\" he drawled, the light in that yellow stare of his telling her that the cleaning might well lead to more messiness.</p><p>Which it certainly did.</p><p>When they were both satiated and she'd had yet a third shower, she wrapped herself up in her robe and started toweling her hair. \"Now, what do you need my help with?\"</p><p>Z propped himself against the marble counter next to the sinks, rubbed his palm over his skull trim, and got dead serious.</p><p>Bella stopped what she was doing. As he stayed quiet, she backed up and sat down on the edge of the Jacuzzi to give him some space. She waited, hands clenching and releasing in her lap.</p><p>For some reason, as he sat there collecting his thoughts, she realized that they had done a lot in this bathroom. It was here that she'd found him throwing up after he'd aroused her for the very first time at that party. And then . . . after he'd rescued her from the lessers, he'd bathed her in this tub. And in the shower across the way she'd fed from him for the first time.</p><p>She thought of that rough period in their lives, her just out of her abduction, him struggling with his attraction to her. Glancing over to the right, she recalled finding him on the tile beneath an ice-cold spray, scrubbing at his wrists, believing himself unclean and unable to feed her.</p><p>He'd shown a lot of courage. Getting over what had been done to him enough to trust her had taken a lot of courage.</p><p>Bella's eyes went back to him, and when she realized he was staring at his wrists, she said, \"You're going to try to get them removed, aren't you.\"</p><p>His mouth twitched into a half smile, the side distorted by the tail of his facial scar lifting. \"You know me so well.\"</p><p>\"How will you get it done?\" When he finished telling her, she nodded. \"Excellent plan. And I'll go with you.\"</p><p>He looked up at her. \"Good. Thank you. I don't think I could do it without you.\"</p><p>She stood up and went over to him. \"You're not going to have to worry about that.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Dr. Thomas Wolcott Franklin III had the second-best office in the St. Francis Hospital complex.</p><p>When it came to quality administrative real estate, the pecking order was determined by your revenues, and as chief of dermatology, T.W. was behind only one other department head.</p><p>Of course, the fact that his department was such a good earner was because he'd \"sold out,\" as some of the academic stalwarts maintained. Under his leadership, dermatology not only handled lesions and cancers and burns in addition to chronic skin conditions such as psoriasis, eczema, and acne, but there was a whole subpision that did only cosmetic procedures.</p><p>Face-lifts. Brow-lifts. Breast enhancements. Lipo. Botox. Restylane. A hundred other improvements. The health care model was private-practice service delivered in an academic setting, and wealthy clients loved the concept. The bulk of them came up from the Big Apple--at first making the trip for the anonymity of getting first-class treatment out of the tight-knit plastics community in Manhattan, but then, perversely, for the status. Getting \"work\" done in Caldwell was the chic thing to do, and, courtesy of the trend, only the chief of surgery, Manny Manello, had a better office view.</p> <p>Well, Manello's private bathroom also had marble in the shower, not just on the counters and walls, but really, who was counting.</p><p>T.W. liked his view. Liked his office. Loved his work.</p><p>Which was a good thing, as his days started at seven and ended at--he checked his watch--nearly seven.</p><p>Tonight, though, he should have already been gone by now. T.W. had a standing racquetball game every Monday night at seven p.m. at the Caldwell Country Club . . . so he was a little confused as to why he'd agreed to see a patient now. Somehow he'd said yes and had his secretary find a replacement for him on the courts, but he couldn't for the life of him remember the whys or whos of it all.</p><p>He took his printed schedule out of the breast pocket of his white coat and shook his head. Right next to seven o'clock was the name B. Nalla and the words laser cosmetics. Man, he had no recollection how the appointment had been made or who it was or who'd given the referral . . . but nothing got onto that grid of hours without his permission.</p> <p>So it must be someone important. Or the patient of someone important.</p><p>Clearly he was working too hard.</p><p>T.W. logged on to the electronic medical records system and ran a search, again, for B. Nalla. Closest match was Belinda Nalda. Typo? Could be. But his assistant had left at six, and it seemed rude to interrupt her while she was having dinner with her family with just a what-the-hell-is-this?</p><p>He stood up, checked his tie and buttoned his white coat, then picked up some work to review while he waited downstairs for B. Nalla or Nalda to show.</p><p>As he headed out of the department's top-floor stretch of offices and treatment areas, he thought about the difference between up here and down in the private clinic. Night and day. Here the decor was done in hospital non-chic: low-napped dark carpet, cream walls, lots of plain cream doors. The prints that were hung had spare stainless-steel frames, and the plants were few and far between.</p><p>Downstairs? Top-tier spa land with concierge services delivered in the kind of luxury the very rich expected: the treatment rooms had HD flat-screen TVs, DVDs, couches, chairs, tiny Sub-Zero refrigerators with rare fruit juices, food that could be ordered from restaurants, and wireless Internet for laptops. The clinic even had a reciprocal agreement with Caldwell's Stillwell Hotel, the five- star grande dame of lodging in all of upstate New York, so that patients could rest overnight after receiving care.</p> <p>Over-the-top? Yes. And was there a surcharge? Absolutely. But the reality was, reimbursements from the federal government were down, insurers were denying medically necessary procedures left and right, and T.W. needed funds to fulfill his mission.</p><p>Catering to the rich was the way to do it.</p><p>Thing was, T.W. had two rules for his doctors and nurses. One, offer the best damn care on the planet with a compassionate hand. And two, never turn a patient away. Ever. Especially the burn victims.</p><p>No matter how expensive or how long the course of treatment for a burn was, he never said no. Especially to the children.</p><p>If he was seen as a sellout to commercial demand? Fine. No problem. He didn't make a big deal about what he did on the free- care side of things, and if his colleagues in other cities wanted to portray him as a money-grubber, he'd take the hit.</p><p>When he got to the elevators, he reached out with his left hand, the one that was scarred, the one that was missing a pinkie and had mottled skin, and pressed the button for down.</p><p>He was going to do whatever he had to to make sure folks got the help they needed. Someone had done it for him, and it had made all the difference in his life.</p><p>Down on the first floor he hung a right and walked along a stretch of corridor until he came to the mahogany-paneled entrance of the cosmetics clinic. In discreet lettering that was frosted into the glass were his name and the names of seven of his colleagues. There was no mention of what kind of medicine was practiced inside.</p> <p>Patients had told him they loved the exclusive, members-only-club vibe.</p><p>Using a pass card, he let himself in. The reception room was dim, and not because the lighting had been turned off after main business hours were through: Bright lights were not becoming on people of a certain age, either pre- or postoperatively, and besides, the calming, soothing atmosphere was part of the spa environment they were trying to create. The floor was tiled in soft sandstone, the walls were a comforting deep red, and a fountain made from cream and white and tan rocks twinkled in the center of the area. \"Marcia?\" he called out, pronouncing the name MAR-see-uh, in the European fashion.</p><p>\"'Allo, Dr. Franklin,\" came a smooth voice from the back where the office was.</p><p>When Marcia came around the corner, T.W. put his left hand in his pocket. As usual, she looked right out of Vogue with her coiffed black hair and her tailored black suit.</p><p>\"Your patient is not here yet,\" she said with a serene smile. \"But I have the second lasering bay set up for you.\"</p><p>Marcia was a perfectly touched up forty-year-old who was married to one of the plastics guys and was, as far as T.W. knew, the only woman on the planet except for Ava Gardner who could wear bloodred lipstick and still look classy. Her wardrobe was by Chanel, and she'd been hired and was paid well to be a walking testimonial to the outstanding work performed by the staff.</p><p>And the fact that she had an aristocratic French accent was a bonus. Particularly with the nouveau riche types.</p><p>\"Thanks,\" T.W. said. \"Hopefully the patient will be here soon and you can go.\"</p><p>\"So you do not need an assistant, no?\"</p><p>This was the other great thing about Marcia: She was not just decorative; she was useful, a fully trained nurse who was always happy to assist.</p><p>\"I appreciate the offer, but just send the patient back and I'll take care of everything.\"</p><p>\"Even the registering?\"</p><p>He smiled. \"I'm sure you want to get home to Phillippe.\"</p><p>\"Ah, oui. It is our anniversary.\"</p><p>He winked at her. \"Heard something about that.\"</p><p>Her cheeks reddened a little, which was one of the charming things about her. She might be classy but she was real, too. \"My husband, he says I am to meet him at the front door. He says he has a surprise for his wife.\"</p><p>\"I know what it is. You're going to love it.\" But what woman wouldn't like a pair of flashers from Harry Winston?</p><p>Marcia brought her hand up to her mouth, hiding her smile and her sudden flusters. \"He is too good to me.\"</p><p>T.W. felt a momentary pang, wondering when the last time was that he'd bought something frivolous and fancy for his wife. It had been . . . well, he'd gotten her a Volvo last year.</p><p>Wow.</p><p>\"You deserve it,\" he said roughly, thinking for some reason about the number of nights his wife ate alone. \"So please go home and celebrate.\"</p><p>\"I will, Doctor. Merci mille fois.\" Marcia bowed and went over to the receiving desk--which was really nothing more than an antique table with a phone hidden in the side drawer and a laptop you accessed by flipping open a mahogany panel. \"I shall just sign out of the system and wait to welcome your patient.\"</p><p>\"Have a great night.\"</p><p>As T.W. turned away and left her to her glow, he took his ruined hand back out of his pocket. He always hid it from her, part of the leftover from having been a teenager with the damn thing. It was so ridiculous. He was happily married and not even attracted to Marcia, so it shouldn't have mattered at all. Scars, though, left wounds on the inside of you, and as with skin that didn't heal right, you still felt the rough spots from time to time.</p><p>The three lasers in the clinic's facility were used to treat spider veins in legs, port-wine-stain birthmarks, and red dermal imperfections, as well as provide resurfacing treatments for the face, and the removal of the guiding tattoo marks of cancer patients who'd received radiation.</p><p>B. Nalla might need any one of those things done--but if he were a betting man, he would go with cosmetic resurfacing. Just seemed to fit . . . after hours, in the downstairs clinic, with a mysterious name. No doubt another one of the very wealthy, with a paralytic need for confidentiality.</p><p>Still, you had to respect your cash cows.</p><p>Going into the second laser suite, which he preferred for no good reason, he took a seat behind the mahogany desk and logged on to the computer, reviewing the patients who were coming in the morning and then focusing on the dermatology fellows' reports he'd brought with him.</p><p>As the minutes ticked by, he started to get annoyed at these rich people and their demands and their self-important view of their place in the world. Sure . . . some of them were fine, and all of them helped support his efforts, but man, sometimes he wanted to choke the entitlement right out of them--</p><p>A six-foot-tall woman appeared in the doorway of the exam room, and he froze solid. What she was wearing was simple, just a crisp white button-down shirt tucked into a pair of ultraslim blue jeans, but she had Christian Louboutin's red-soled stillies on her feet and Prada hanging off her shoulder.</p><p>She was exactly his kind of private clientele, and not just because she was wearing about three grand's worth of accessories. She was . . . indescribably beautiful, with deep brown hair and sapphire eyes and a face that was the sort of thing other women asked to be surgically altered to resemble.</p><p>T.W. slowly stood up, shoving his left hand deep into his pocket. \"Belinda? Belinda Nalda?\"</p><p>Unlike a lot of women of her class, which was clearly stratospheric, she didn't waltz in like she owned the place. She took just one step past the doorway.</p><p>\"Actually, it's Bella.\" Her voice made his eyes want to roll back into his head. Deep, husky . . . but kind.</p><p>\"I, ah . . .\" T.W. cleared his throat. \"I'm Dr. Franklin.\"</p><p>He extended his good hand and she took it. As they shook he knew he was staring, and not in a professional way, but he couldn't help himself. He'd seen a lot of beautiful women in his day, but nothing like her. It was almost as if she were from another planet.</p><p>\"Please . . . please come and have a seat.\" He indicated the silk-covered club chair next to the desk. \"We'll get your history and--\"</p><p>\"I'm not the one being treated. My hell--husband is.\" She took a deep breath and looked over her shoulder. \"Darling?\"</p><p>T.W. scrambled back and hit the wall so hard the framed watercolor next to him bounced. His first thought as he looked at what walked in was that maybe he should get closer to the phone so he could call security.</p><p>The man had a scarred face and serial-killer black eyes, and as he came in, he filled the entire room: He was big enough and broad enough to classify as a heavyweight boxer, or maybe two of them put together, but Christ, that was the least of your problems as he stared at you. He was dead inside. Absolutely without affect. Which made him capable of anything.</p><p>And T.W. could have sworn the temperature of the room actually went down as the man came to stand next to his wife.</p><p>The woman spoke calmly and quietly. \"We're here to see if his tattoos can be removed.\"</p><p>T.W. swallowed and told himself to get a grip. Okay, maybe this thug was just your garden-variety punk-rock star. T.W.'s own taste in music ran more toward jazz, so there was no reason he'd recognize this guy in the leathers and the black turtleneck and the gauge in his ear, but it could explain things. Including why the wife was model gorgeous. Most singers had beautiful women, didn't they?</p><p>Yeah . . . the only problem with that theory was the black stare. That was no manufactured, commercially viable, hard-ass front. There was real violence in there. True depravity.</p><p>\"Doctor?\" the woman said. \"Is there going to be a problem?\"</p><p>He swallowed again, wishing he hadn't told Marcia to go. Then again, women and children and all that. Probably safer for her not to be here.</p><p>\"Doctor?\"</p><p>He just kept looking at the guy--who made no move other than breathing.</p><p>Hell, if the big bastard wanted to, he could have busted up the place twelve times over by now. Instead? He was just standing there.</p><p>And standing there.</p><p>And . . . standing there.</p><p>Eventually, T.W. cleared his throat and decided that if there was going to be trouble, it would have happened already. \"No, there's no problem. I'm going to sit down. Now.\"</p><p>He planted it in the desk's chair and bent to the side, pulling open a refrigerated drawer that had a variety of sparkling waters in it. \"May I offer you anything to drink?\"</p><p>When they both said no, he cracked open a Perrier with lemon and downed half of it like it was Scotch.</p><p>\"Right. I'll need to take a medical history.\"</p><p>The wife took a seat and the husband loomed over her, eyes locked on T.W. Odd, though. They were holding hands and T.W. got the impression that the wife was the husband's tether in some way.</p><p>Calling on his training, he took out his Waterman pen and asked the usual questions. The wife did the answering: No known allergies. No surgical procedures. No health problems.</p><p>\"Ah . . . where are the tattoos?\" Please, God, let them not be below the waist.</p><p>\"On his wrists and his neck.\" She looked up at her husband, her eyes luminous. \"Show him, darling.\"</p><p>The man reached to one side and pulled up his sleeve. T.W. frowned, medical curiosity taking over. The black band was incredibly dense, and though he wasn't an expert on tattooing by a long shot, he could safely say he'd never seen such deep coloration before.</p><p>\"That is very dark,\" he said, leaning in. Something told him not to touch the man unless he had to, and he followed the instinct, keeping his hands to himself. \"That is very, very dark.\"</p><p>They were almost like shackles, he thought.</p><p>T.W. eased back into the chair. \"I'm not sure whether you're a good candidate for laser removal. The ink appears to be so dense that at a minimum it's going to require multiple sessions to make even a dent in the pigmentation.\"</p><p>\"Will you try, though?\" the wife asked. \"Please?\"</p><p>T.W.'s eyebrows popped. Please was not a word in the vocabulary of most of the patients down here. And her tone was equally foreign to the locale, its quiet desperation more what you would find in families of patients treated upstairs--those with medical issues that affected their lives, not just their crow's-feet and laugh lines.</p><p>\"I can try,\" he said, well aware that if she used that tone on him again, she could get him to eat his own legs just to please her.</p><p>He looked at the husband. \"Would you remove your shirt and get up on the table?\"</p><p>The wife squeezed the big hand in hers. \"It's okay.\"</p><p>The husband's hollow-cheeked, hard-jawed face turned to her, and he seemed to draw tangible strength from her eyes. After a moment he went over to the table, got his huge body up on the thing, and removed his turtleneck.</p><p>T.W. left his chair and walked around--</p><p>He froze. The man's back was covered with scars. Scars . . . that looked like they had been left by whips.</p><p>In his entire medical career he had seen nothing even resembling this--and knew it must have been left by some kind of torture.</p><p>\"My tats, Doc,\" the husband said in a nasty tone. \"You're supposed to be eyeballing my tats, thank you very much.\"</p><p>As T.W. blinked, the husband shook his head. \"This isn't going to work--\"</p><p>The wife rushed forward. \"No, it will. It--\"</p><p>\"Let's find someone else.\"</p><p>T.W. came around to face the man, blocking the way to the door. And then he deliberately took his left hand out of his pocket. That black stare dipped down and fixated on the mottled skin and the ruined pinkie.</p><p>The patient looked up in surprise; then his eyes narrowed like he was wondering how far up the burn went.</p><p>\"All the way to my shoulder and down my back,\" T.W. said. \"House fire when I was ten. Got trapped in my room. I was conscious while I was burned . . . the entire time. Spent eight weeks in the hospital afterward. Have had seventeen surgeries.\"</p><p>There was a beat of silence, as if the husband were running through the implications in his head: If you were conscious, you'd have smelled the flesh cook and felt every lick of pain. And the hospital time . . . the surgeries . . .</p><p>Abruptly the man's whole body eased up, the tension flowing out of him as if a valve had been released.</p><p>T.W. had seen it happen time and time again with his burn patients. If your doctor knew what it was like to be where you were, not because they had been taught about it at medical school but because they had lived it, you felt safer with them: The two of you were members of the same exclusive hard-core club.</p><p>\"So can you do anything for these things, Doc?\" the man asked, laying his forearms out on his thighs.</p><p>\"Is it okay to touch you?\"</p><p>The man's scarred lip lifted slightly, as if he'd just given T.W. another point in the good category. \"Yup.\"</p><p>T.W. deliberately used both his hands on the patient's wrists so the guy could have plenty of time to look at the scars of his doctor and relax even more.</p><p>When he was through, he stepped back. \"Well, I'm not sure how this is going to go, but let's give it a shot--\" T.W. looked up and stopped. The man's irises . . . were yellow now. Not black anymore.</p><p>\"Don't you worry 'bout my eyes, Doc.\"</p><p>From out of nowhere, the idea that everything was fine with what he'd seen flooded into his brain. Right. No. Big. Deal. \"Where was I . . . Oh, yes. Well, let's give the laser a shot.\" He turned to the wife. \"Perhaps you'd like to pull up a chair and hold his hand? I think he'll feel more comfortable that way. I'm going to start on one wrist and we'll see how it goes.\"</p><p>\"Do I have to lie down?\" the patient said darkly. \" 'Cause I don't think . . . yeah, I might not be cool with that.\"</p><p>\"Not at all. You can stay sitting up, even when we do the neck, and for that part I'll get you a mirror so you can watch me. At all times I'll tell you exactly what I'm doing, what you're likely to feel, and we can always stop. You just say the word and it's over. This is your body. You are in control. Okay?\"</p><p>There was a moment of silence as both of them stared at him. And then the wife said in a broken tone, \"You, Dr. Franklin, are a total peach.\"</p><p>The patient had an incredible pain tolerance, T.W. thought an hour later as he tapped the floor toggle and the laser snapped out yet another thin red beam onto the inked skin of that thick wrist. An incredible pain tolerance. Each zap was like getting hit with a rubber band, which was not a big deal if it was done only once or twice. But after a couple of minutes of those strikes, most patients needed to rest. This guy? Never flinched, not even once. So T.W. just kept going and going. . . .</p><p>Of course, with his nipples pierced as they were and his gauge and all his scars, he'd obviously been intimately familiar with agony, both by choice and without it.</p><p>Unfortunately his tattoos were utterly resistant to the laser.</p><p>T.W. let out his breath on a curse and shook his right hand, which was getting tired.</p><p>\"It's okay, Doc,\" the patient said softly. \"You gave it your best shot.\"</p><p>\"I just don't understand.\" He whipped off his eye protection and glanced over at the machine. For a moment he wondered whether the thing was working properly. But he'd seen the laser. \"There's no change in coloration at all.\"</p><p>\"Doc, for real, it's cool.\" The patient took off his goggles and smiled a little. \"I appreciate your taking this as seriously as you have.\"</p><p>\"Goddamn it.\" T.W. sat back on his stool and glared at the ink.</p><p>From out of nowhere words jumped out of his mouth, even though they were arguably unprofessional. \"You didn't volunteer for those, did you.\"</p><p>The wife fidgeted as if she were worried about the answer. But the husband just shook his head. \"No, Doc. I didn't.\"</p><p>\"Goddamn it.\" He crossed his arms and refiled through his encyclopedic knowledge of the human skin. \"I just don't understand why . . . and I'm trying to think of other options. I don't think a chemical removal would be any more efficacious. I mean, you took everything that laser could give you.\"</p><p>The husband ran his curiously elegant fingers over his wrist. \"Could we cut them out?\"</p><p>The wife shook her head. \"I don't think that's a good idea.\"</p><p>\"She's right,\" T.W. murmured. He leaned forward and prodded at the dermis. \"You have excellent elasticity, but then again, as you're in your mid-twenties, that's expected. I mean, it would have to be done in strips and the skin stitched closed. You'd get scarring. And I wouldn't recommend it around the neck. Too many risks with the arteries.\"</p><p>\"What if scarring wasn't a problem?\"</p><p>He wasn't going to touch that question. Scarring was obviously an issue, given the man's back. \"I couldn't recommend it.\"</p><p>There was a long silence while he continued to think things over and they gave him space. When he got to the end of all the options, he just stared at the two of them. The gorgeous wife was seated next to the scary-looking husband, one hand on his free arm, the other on his mutilated back, stroking.</p><p>It was obvious that his scars didn't affect his worth in her eyes. He was whole and beautiful to her in spite of the condition of his skin.</p><p>T.W. thought of his own wife. Who was just like that.</p><p>\"Out of ideas, Doc?\" the husband asked. \"I am so sorry.\" He shifted his eyes around, hating how helpless he felt. As a doctor he was trained to do something. As a human with a heart, he needed to do something. \"I am so very sorry.\"</p><p>The husband smiled that little smile of his again. \"You treat a lot of people with burns, don't you.\"</p><p>\"It's my specialty. Kids, mostly. You know, because of . . .\"</p><p>\"Yeah, I know. Betcha you're good to them.\"</p><p>\"How could I not be?\"</p><p>The patient leaned forward and put his huge hand on T.W.'s shoulder. \"We're going to take off now, Doc. But my shellan's going to leave the payment on the desk over there.\"</p><p>T.W. glanced at the wife, who was bent over a checkbook, then shook his head. \"Why don't we just call it even. This really didn't help you.\"</p><p>\"Nah, we took your time. We'll pay.\"</p><p>T.W. cursed under his breath a couple of times. Then just spat out, \"Damn it.\"</p><p>\"Doc? Look at me now?\"</p><p>T.W. glanced up at the guy. Man, that yellow stare was positively hypnotic. \"Wow. You have incredible eyes.\"</p><p>The patient smiled more widely, flashing teeth that were . . . not normal. \"Thank you, Doc. Now listen up. You're probably going to have dreams about this, and I want you to remember I left here tight, 'kay?\"</p><p>T.W. frowned. \"Why would I dream--\"</p><p>\"Just remember, I'm okay with what happened. Knowing you, that's what's going to bother you most.\"</p><p>\"I still don't understand why I would h--\"</p><p>T.W. blinked and looked around the examination room. He was sitting on the little rolling stool he used when he treated patients, and there was a chair pulled over next to the patient table, and he had his eye protection in his hand . . . except there was no one in the room but him.</p><p>Odd. He could have sworn he was just talking to the most amazing--</p><p>As a headache came on he rubbed his temples and became suddenly exhausted . . . exhausted and curiously depressed, as if he'd failed at something that had been important to him.</p><p>And worried. Worried about a m--</p><p>The headache got worse, and with a groan he stood up and went over to the desk. There was an envelope on it, a plain creamy envelope with flowing cursive script that read, In gratitude to T.W. Franklin, M.D., to be applied at his direction in favor of his department's good works.</p><p>He turned it over, ripped open the flap, and took out a check.</p><p>His jaw hit the floor.</p><p>One hundred thousand dollars. Made out to the Department of Dermatology, St. Francis Hospital.</p><p>The name of the person listed was Fritz Perlmutter, and there was no address at the upper left, just a discreet notation: Caldwell National Bank, Private Client Group.</p><p>One hundred thousand dollars.</p><p>An image of a scarred husband and a gorgeous wife flickered in his mind, then was buried by his headache.</p><p>T.W. took the check and slipped it inside his shirt pocket, then shut down the laser machine and the computer and made his way to the back clinic exit, turning lights off as he went.</p><p>On his way home he found himself thinking of his wife, of the way she'd been when she'd first seen him after the fire all those decades ago. She'd been eleven and had come to visit him with her parents. He'd been absolutely mortified when she'd walked through the door because he'd already had a crush on her at that point, and there he'd been, stuck in a hospital bed, one side of him covered with bandages.</p><p>She'd smiled at him and taken his good hand and told him no matter what his arm looked like, she still wanted to be his friend.</p><p>She'd meant it. And then, proved it over and over again.</p><p>Even liked him as more than a friend. Sometimes, T.W. thought, the fact that the one you cared about didn't care how you looked was the best healing there was.</p><p>As he drove along, he passed by a jewelry store that was locked up tight for the night, and then a florist and then an antique shop that he knew his wife liked to browse in.</p><p>She'd given him three children. Nearly twenty years of marriage. And space to work this career of his.</p><p>He'd given her a lot of lonely nights. Dinners with just the kids. Vacations that were limited to a day or two tacked onto dermatology conferences.</p><p>And a Volvo.</p><p>It took T.W. twenty minutes to get to a Hannaford that was open all night, and he jogged into the supermarket even though there was no closing time to worry about.</p><p>The flower section was to the left, just as he walked in through the automatic doors. As he saw the roses and the chrysanthemums and the lilies, he thought about backing up his Lexus and filling the trunk with bouquets. And the backseat.</p><p>In the end though, he chose one single flower, and he held it carefully between his thumb and forefinger all the way home.</p><p>He parked in the garage, but didn't go in through the kitchen. Instead he went to the front door and rang the bell.</p><p>His wife's familiar, lovely face peeked out of the long, thin windows that framed their colonial's entryway. She looked confused as she opened the door.</p><p>\"Did you forget your--\"</p><p>T.W. held the flower out in his burned hand.</p><p>It was a lowly little daisy. Exactly the kind she'd brought to him once a week in the hospital. For two months straight.</p><p>\"I don't say thank-you enough,\" T.W. murmured. \"Or I love you. Or that I still think you're as beautiful as the day I married you.\"</p><p>His wife's hand trembled as she took the flower. \"T.W. . . . are you okay?\"</p><p>\"God . . . the fact that you have to ask that just because I bring you a flower . . .\" He shook his head and hugged her into his arms, holding her tight. \"I'm sorry.\"</p><p>Their teenage daughter walked by them and rolled her eyes before heading up the stairs. \"Get a room.\"</p><p>T.W. pulled back and tucked his wife's salt-and-pepper hair back behind her ears. \"I think we should take her advice, what do you say? And by the way, we're going somewhere for our anniversary--and not to a conference.\"</p><p>His wife smiled and then outright beamed. \"What has gotten into you?\"</p><p>\"I saw this patient and his wife tonight. . . .\" He winced and rubbed his temple. \"I mean . . . what was I saying?\"</p><p>\"How about dinner?\" his wife said, fitting herself into his side. \"And then we'll see about that room?\"</p><p>T.W. leaned into his wife as he shut the door. As they went down the hall to the kitchen together, he kissed her. \"That sounds perfect. Just perfect.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Back at the Brotherhood's mansion, Z stood at one of the windows in his and Bella's bedroom and looked down over the terrace and the back gardens. His wrist burned from where the laser had been applied, but the pain wasn't bad.</p><p>\"I'm not surprised by the whole thing,\" he said. \"Well, other than the fact that I liked the doc.\"</p><p>Bella came up behind him and put her arms around his waist. \"He was a good guy, wasn't he.\"</p><p>As they stood together, there was a whole lot of what-now floating around the room. Unfortunately he didn't have any answers. He'd kind of banked on the bands being removed, like that would somehow make everything better.</p> <p>Although it wasn't as if there weren't still scars on his face.</p><p>From the nursery Nalla let out a burble and then a hiccup. A cry was next.</p><p>\"I just fed her and changed her,\" Bella said, pulling away. \"I'm not sure what this is about--\"</p><p>\"Let me go to her,\" he said in a tight voice. \"Let me see if I can . . .\"</p><p>Bella's eyebrows lifted, but then she nodded. \"Okay. I'll stay here.\"</p> <p>\"I won't drop her. I promise.\" \"I know you won't. Just make sure you support her head.\"</p><p>\"Right. Got it.\"</p><p>Z felt like he was going unarmed into a field of lessers when he walked into the nursery.</p><p>As if sensing him, Nalla let out a whiffle.</p><p>\"It's your father. Dad. Papa.\" What would she call him?</p><p>He went over and peered down at his daughter. She was dressed in a Red Sox onesie, no doubt a gift from V and/or Butch, and her lower lip was quivering like it wanted to leap off the tip of her chin but was afraid of the drop.</p> <p>\"Why are you crying, little one?\" he said softly.</p><p>When she lifted her arms up to him, he checked the doorway. Bella wasn't in it, and he was glad. He didn't want anyone seeing how awkward he was as he reached into the crib and . . .</p><p>Nalla fit between his hands perfectly, her butt in one of his palms, her head cradled in the other. As he straightened and brought her up, she was surprisingly sturdy and warm and--</p><p>She grabbed onto his turtleneck and pulled into him, demanding closeness . . . and obliging her seemed shockingly easy. As he held her against his chest, she settled immediately, turning herself flush into his body.</p><p>Having her in his arms was so natural. And so was heading for the rocker and sitting down and using one of his feet to make them go back and forth.</p><p>Staring at her lashes and her plump little cheeks and her death grip on his turtleneck, he realized just how much she needed him--and not just to protect her. She needed him to love her, too.</p><p>\"Looks like you are getting along,\" Bella said quietly from the doorway.</p><p>He glanced up. \"She seems to like me.\"</p> <p>\"How could she not?\"</p><p>Looking back down at his daughter, he said after a while, \"It would have been great to get them removed. The tats. But she'd still ask about my face.\"</p><p>\"She's going to love you anyway. She already does.\"</p><p>He ran his forefinger over Nalla's arm, stroking her as she snuggled even deeper against his heart and played patty-cake on the back of his free hand.</p><p>From out of nowhere, he said, \"You didn't talk to me much about your abduction.\"</p><p>\"I . . . ah, I didn't want to upset you.\"</p><p>\"Do you find yourself protecting me from things that might upset me a lot?\"</p><p>\"No.\"</p><p>\"You sure about that?\"</p><p>\"Zsadist, if I do, it's because--\"</p><p>\"I'm not much of a male if I can't be there when you need me.\"</p><p>\"You are always there for me. And we did talk about it some.\"</p><p>\"Some.\"</p><p>God, he felt like shit for all she had had to do alone, just because of his head fuck.</p><p>And yet her voice was strong and sure as she said, \"When it comes to the abduction, I don't want you to know every little thing that happened. Not because you can't handle it, but because I don't want to give that bastard any more influence over my life than he's already had.\" She shook her head. \"I'm not going to give him the power to upset you if I can avoid it. Not going to happen-- and that would be true whether or not you had been through anything traumatic.\"</p><p>Z made a noise to acknowledge that she'd spoken, but he didn't agree with her. He wanted to give her everything she needed. She deserved nothing less. And his past had impacted them. Still did. Christ, the way he'd been about Nalla had been--</p><p>\"May I tell you something in confidence?\" she said.</p><p>\"Of course.\"</p><p>\"Mary wants a baby.\" Z's eyes shot up. \"She does? That's great--\"</p><p>\"A biological one.\"</p><p>\"Oh.\"</p><p>\"Yeah. She can't have one of her own, so Rhage would have to lay with a Chosen.\"</p><p>Z shook his head. \"He would never do that. He won't be with anyone but Mary.\"</p><p>\"That's what she says. But if he doesn't, she can't hold a piece of him in her arms.\"</p><p>Yeah, because IVF didn't work on vampires. \"Shit.\"</p><p>\"She hasn't talked to Rhage about it yet because she's sorting her own feelings out first. She talks to me so she can ride the peaks and valleys of her emotions without putting him through the wringer. Some days she wants a young so badly, she thinks she can handle it. Other days she simply can't bear the idea on any level and considers adoption. My point is, you can't work out all your stuff with your partner. And you shouldn't. You were there for me afterward. You're there for me now. I never question that. But that doesn't mean I have to drag you into the nitty-gritty. Healing is a multifaceted kind of thing.\"</p><p>He tried to picture himself telling Bella all the ins and outs of the abuse he'd been subjected to. . . . No. . . . no way would he want her to break her heart over the fucked up nightmare he'd been put through.</p><p>\"Did you talk to someone?\" he asked.</p><p>\"Yes, at Havers's. And I talked to Mary.\" There was a pause. \"And I went back . . . to where I'd been held.\"</p><p>His eyes flipped up and bored into hers. \"You did?\"</p><p>She nodded. \"I had to.\"</p><p>\"You never told me.\" Fuck, she'd been back there? Without him?</p><p>\"I needed to go. For me. And I needed to go alone and I didn't want to argue. I made sure Wrath knew when I was leaving and I told him right when I got back.\"</p><p>\"Damn . . . I wish I'd known. Makes me feel like a shitty hellren.\"</p><p>\"You're anything but that. Especially now that you're holding your daughter like you are.\"</p><p>There was a long silence.</p><p>\"Look,\" she said, \"if it helps any, I've never felt like I couldn't tell you something. I've never doubted that you would man up and support me. But just because we're mated doesn't mean I'm not my own person.\"</p><p>\"I know. . . .\" He thought for a minute. \"I didn't want to go back to where I . . . To that castle. If it hadn't been for the fact that she'd imprisoned another male down in that cell . . . I never would have gone back.\"</p><p>And he couldn't now. The place where he'd been held in the Old Country had long ago been sold to humans, eventually ending up in England's National Trust.</p><p>\"Did you feel better?\" he asked abruptly. \"After you went to see where you'd been?\"</p><p>\"Yes, because Vishous had ashed the place. The closure was more complete that way.\"</p><p>Z rubbed Nalla's little round belly absently while staring across at his shellan. \"I wonder why we haven't talked about it before now.\"</p><p>Bella smiled and nodded at the young. \"We've had something else get our attention.\"</p><p>\"Can I be honest? The steakhead in me needs to believe that if you'd wanted me to go with you to that place, you know I would have done it in a heartbeat and stayed tight for you.\"</p><p>\"I absolutely know that. But I still wanted to go alone. I can't explain it . . . it was just something I needed to do. A courage thing.\"</p><p>Nalla glanced in the direction of her mother and made a squirming reach that was accompanied by a little burble of demand.</p><p>\"I think she wants something only you can give her,\" Z said with a smile as he got up from the rocker.</p><p>He and Bella met in the middle of the room. As they made the handoff, he kissed his shellan and lingered a bit, with both of them holding on to their daughter.</p><p>\"I'm going out, okay?\" he said. \"I won't be long.\"</p><p>\"Be safe.\" \"I promise. I've got to take care of my girls.\"</p><p>Zsadist armed himself and dematerialized out west of the city, to a stretch of forest dead in the thick of farm country.</p><p>The bald clearing was fifty feet ahead, right by a stream, but instead of seeing an empty stretch among the pines, he pictured a single-room building with a plywood exterior and a tin roof.</p><p>What was in his mind was clear as the trees around him and the stars in the night sky up above: The facility had been constructed by the Lessening Society quickly and with an eye toward the temporary. What had been done inside, though, had been the stuff of permanence.</p><p>He walked over to the clearing, the twigs of the forest floor cracking under his boots, reminding him of a quiet fire in the fireplace.</p><p>His thoughts were anything but calming and homey.</p><p>When you went through the place's door, there had been a stall shower and a drywall bucket with a toilet seat on it. For six weeks Bella had washed in the four-by-four-foot cubicle, and he knew she hadn't been alone. That bastard lesser had watched her. Had probably helped.</p><p>Shit, the idea of anything like that happening made him want to hunt the fucker down all over again. But Bella had taken care of the slayer's death, hadn't she. She'd been the one who had shot him in the head while the bastard had stood before her, captivated by his sick love for her. . . .</p><p>Fuck.</p><p>Shaking himself, Z imagined he was standing once again in the main room of the place. To the left there had been a wall of shelving with tools of the torture trade laid out on flimsy wooden boards held aloft by crude brackets. Chisels, knives, handsaws . . . he could remember how shiny they had been.</p><p>There had been a fireproof closet as well, one that he'd ripped the doors off of.</p><p>And a stainless-steel autopsy table with fresh blood on it.</p><p>Which he'd tossed into the corner like litter.</p><p>He could totally remember busting into the facility. He'd been looking for Bella for weeks after that lesser had broken into her house and taken her. Everyone thought she was dead, but he'd refused to believe it. He'd been tortured by the need to get her free . . . a need he hadn't then understood but couldn't deny.</p><p>The break had come when a civilian vampire had escaped from this \"persuasion center,\" as the Lessening Society called them, and tracked his location by dematerializing out from the clearing at hundred-yard clips through the forest. From the map he'd drawn for the Brotherhood, Z had come here looking for his female.</p><p>The first thing he'd found had been a scorched circle of earth right outside the door, and he'd thought it had been Bella, left for the sun. He'd bent at the knees and put his hand to the ashed circle, and when his sight had gone blurry he hadn't known why.</p><p>Tears. There had been tears in his eyes. And it had been so long since he'd cried, he hadn't recognized what they were.</p><p>Coming back to the present, Z braced himself and stepped forward, his boots crossing over low-napped, weedy grass. Usually, after Vishous used his hand on a place, there was nothing left but ash and small bits of metal, and that was true here. With the forest undergrowth already grabbing hold, soon the clearing would be filled in again.</p><p>The three pipes that were set in the ground had survived, though. And would continue to exist no matter how many sapling pines sprang up.</p><p>Kneeling down, Z took out his Maglite and angled the beam into the hole Bella had been in. Pine needles and water had filled it in part of the way.</p><p>It had been December when he'd found her in the earth, and he could only imagine the cold that had surrounded her down there . . . the cold and the darkness and the tight squeeze of the ribbed metal.</p><p>He'd almost missed these earthbound prisons. After he'd thrown the autopsy table across the room, he'd heard a whimper, and that was what had brought him over here, to these three pipes. As he'd popped the mesh cover off the one the noise came from, he'd known he'd found her.</p><p>Except he hadn't. When he'd pulled on the ropes that had led into the hole, a civilian male had emerged, a male who was shivering like a child.</p><p>Bella had been unconscious in the one she'd been in. Z had gotten shot in the leg as he'd worked to get her free, thanks to a security system that Rhage had only partially disarmed. Even with the bullet tearing into his leg, though, he hadn't felt a thing as he'd bent down and grabbed onto the ropes and slowly pulled. He'd seen his love's mahogany-colored hair first, and the dizzying relief had been like getting blanketed by a warm cloud. But then her face had become visible.</p><p>Her eyes had been sewn shut.</p><p>Z got to his feet, his body revolting against that memory, his stomach churning, his throat getting tight. He'd nursed her afterward. Bathed her. Let her feed from him even though giving her the corroded shit in his veins had brought him to the edge of hysteria.</p><p>And he'd serviced her in her needing as well. Which was how Nalla had come to be.</p><p>In return? Bella had given him back the world.</p><p>Zsadist took a last look around, seeing not the landscape but the truth. Bella might be smaller than him and might weigh a hundred pounds less and might be untrained in the martial arts and might not know how to shoot guns . . . but she was stronger than he was.</p><p>She had gotten through what had been done to her.</p><p>Could the past be like this, he wondered, looking around at the empty clearing. A structure in your mind that you could burn down and get free of?</p><p>He moved his foot back and forth over the forest floor. The weeds that had poked up through the skin of the earth were like green whiskers, and they were concentrated in the area that got the most sunlight.</p><p>From the ashes came new life.</p><p>Z took out his phone and composed a text that he never thought he'd write.</p><p>It took him four tries to get it right. And when he hit send, he knew on some level he changed the course of his life.</p><p>And you could do that, couldn't you, he thought as he put the RAZR back in his pocket. You could choose some paths and not others. Not always, of course. At times destiny just drove you to a destination and dropped your ass off and that was that.</p><p>But on occaision you were able to pick the address. And if you had half a brain, no matter how hard it was or how weird it felt, you went into the house.</p><p>And found yourself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>An hour later Zsadist was in the cellar at the Brotherhood's mansion, sitting in front of the old coal-burning furnace in the basement. The damn thing was a relic from the 1900s, but it worked so well there was no reason to upgrade.</p><p>Plus, it took effort to keep the coal burning, and doggen loved regular duties. The more chores, the better.</p><p>The great iron furnace's belly had a little window in the front, one made from inch-thick tempered glass, and on the other side flames rolled, lazy and hot.</p><p>\"Zsadist?\"</p> <p>He rubbed his face and didn't turn around at the sound of the familiar female voice. On some level he couldn't believe he was going to do what he was about to, and the urge to bolt was ripping him up.</p><p>He cleared his throat. \"Hi.\"</p><p>\"Hi.\" There was a pause, and then Mary said, \"Is that empty chair next to you for me?\"</p><p>Now he twisted around. Mary was standing at the bottom of the cellar stairs, dressed as she usually was, in khakis and a Polo sweater. On her left wrist was an enormous gold Rolex, and she had small pearls in each of her earlobes.</p><p>\"Yeah,\" he said. \"Yeah, it is . . . thanks for coming.\"</p> <p>Mary walked over, her loafers making a little clipping noise on the concrete floor. When she sat down on the lawn chair, she repositioned it so it faced him and not the furnace.</p><p>He rubbed his skull trim.</p><p>As silence meandered around, a blower came on across the way . . . and upstairs someone turned on the dishwasher . . . and the phone rang in the back of the kitchen.</p><p>Eventually, because he felt like a fool for not saying anything, he held up one of his wrists. \"I need to practice what I'm going to say to Nalla when she asks about these. I just . . . I need to have something ready to say to her. Something that . . . is the right thing, you know?\"</p><p>Mary nodded slowly. \"Yes, I do.\"</p><p>He turned back to the furnace and remembered burning the Mistress's skull in it. Abruptly he realized that was the equivalent of V's ashing the place Bella had been hurt in, wasn't it. You couldn't burn a castle down . . . but there had been a kind of cleansing by fire nonetheless.</p> <p>What he hadn't done was the other half of the healing stuff.</p><p>After a while Mary said, \"Zsadist?\"</p><p>\"Yeah?\"</p><p>\"What are those markings?\"</p><p>His frowned and flicked his eyes over to her, thinking, as if she didn't know? But then . . . well, she had been a human. Maybe she didn't. \"They're slave bands. I was . . . a slave.\"</p><p>\"Did it hurt when they were put on you?\"</p><p>\"Yes.\"</p><p>\"Did the same person who cut your face give them to you?\"</p> <p>\"No, my owner's hellren did that. My owner . . . she put the bands on me. He was the one who cut my face.\"</p><p>\"How long were you a slave?\"</p><p>\"A hundred years.\"</p><p>\"How did you get free?\"</p><p>\"Phury. Phury got me out. That's how he lost his leg.\"</p><p>\"Were you hurt while you were a slave?\"</p><p>Z swallowed hard. \"Yes.\"</p><p>\"Do you still think about it?\"</p><p>\"Yes.\" He looked down at his hands, which suddenly were in pain for some reason. Oh, right. He'd made two fists and was squeezing them so tightly his fingers were about to snap off at the knuckles.</p><p>\"Does slavery still happen?\"</p><p>\"No. Wrath outlawed it. As a mating gift to me and Bella.\"</p><p>\"What kind of slave were you?\"</p><p>Zsadist shut his eyes. Ah, yes, the question he didn't want to answer.</p><p>For a while it was all he could do to force himself to stay in the chair. But then, in a falsely level voice, he said, \"I was a blood slave. I was used by a female for blood.\"</p><p>The quiet after he spoke bore down on him, a tangible weight.</p><p>\"Zsadist? Can I put my hand on your back?\"</p><p>His head did something that was evidently a nod, because Mary's gentle palm came down lightly on his shoulder blade. She moved it in a slow, easy circle.</p><p>\"Those are the right answers,\" she said. \"All of them.\"</p><p>He had to blink fast as the fire in the furnace's window became blurry. \"You think?\" he said hoarsely.</p><p>\"No. I know.\"</p><p>Epilogue Six months later . . .</p><p>\"And what is going on in here with all this noise, precious one?\"</p><p>Bella walked into the nursery and found Nalla standing up in her crib, hands locked on the rail, little face red and bunched tight from crying. Everything had been pitched out onto the floor: the pillow, the stuffed toys, the blanket.</p><p>\"Sounds like your world is ending again,\" Bella said as she scooped up her wailing daughter and looked at the debris. \"Was it something they said?\"</p><p>Attention just made the tears come faster and harder.</p><p>\"Now, now, try to breathe--it'll give you more volume. . . . Okay, you just ate, so I know you're not hungry. And you're dry.\" More howling. \"I have a feeling I know what this is about. . . .\"</p><p>Bella checked her watch. \"Look, we can give it a try, but I don't know if it's time yet.\"</p><p>Bending down, she picked Nalla's favorite pink blankie off the floor, wrapped the young in it, and headed for the door. Nalla calmed a little as they left the nursery and went down the hall of statues to the grand staircase, and the trip through the tunnel to the training center was likewise relatively quiet--but when they stepped out into the office and the place was empty, the crying started up again.</p><p>\"Hold on, we'll just see if--\"</p><p>Outside, in the corridor, a group of pretrans left the locker room and walked off in the direction of the center's parking area. It was good to see them, and not just because it meant Nalla was probably going to get what she was after: following the raids on the glymera, the classes for future soldiers had been halted. Now, though, the Brotherhood was back in business with the next generation--only this time not all of them were aristocrats.</p><p>Bella entered the gym through a back door, and she flushed at what she saw. Zsadist was up ahead, working out on a punching bag, his powerful fists driving the thing back until it hung at a stiff angle. His shirtless torso was stunning under the caged lights, his muscles viciously cut, his nipple rings gleaming, his fighting form perfect even to her untrained eyes.</p><p>Off to one side, a trainee stood utterly transfixed, a sweatshirt hanging limp in his little hand. His face showed a combination of fear and awe as he watched Zsadist work out, the kid's eyes wide, his mouth open in a little O from his jaw going loose.</p><p>The second Nalla's cries echoed up into the vast space, Z spun around.</p><p>\"Sorry to bother you,\" Bella said over the wailing. \"But she wants her daddy.\"</p><p>Z's face melted into an absolute glow of love, the fierce concentration draining from his eyes and being replaced with what Bella liked to call his Nalla-vision. He met them halfway across the blue mats, dropping a kiss on Bella's mouth as he took the young into his arms.</p><p>Nalla settled instantly in her father's hold, the young wrapping her arms around his thick neck and cuddling into his massive chest.</p><p>Z looked back across the gym to the trainee. In a deep voice, he said, \"Bus is coming soon, son. You better hurry.\"</p><p>When he turned around again, Bella felt her hellren's arm come around her waist, and she was pulled tight to his side. As he kissed her on the mouth once more, he murmured, \"I need a shower. You want to help?\"</p><p>\"Oh, yes.\"</p><p>The three of them left the gym and went back to the mansion. Halfway through the trip, Nalla conked out, so when they got up to their bedroom, they went into the nursery, put her down in her crib, and enjoyed a shower that was very hot--and not just because of the temperature of the water.</p><p>When they were through, Nalla was awake again, just in time for story hour.</p><p>While Bella dried her hair with a towel, Z went in, got the young, and father and daughter settled into the big bed. Bella came out a moment later and just leaned back against the doorway and stared at the two of them. The pair were cozied up together so close they were like one person. Z had on a pair of pajama bottoms that were Black Watch plaid, and a muscle shirt. Nalla was in a pale pink onesie that read Daddy's Girl on it in white.</p><p>\"Oh, the Places You'll Go,\" Zsadist read from the book in his lap. \"By Dr. Seuss.\"</p><p>As Z read along, Nalla patted the pages with her palm every once in a while.</p><p>This was the new routine. At the end of every night, when Z came home from patrol or teaching, he would usually take a shower as Bella fed Nalla, and then he and his daughter got in bed together and he read to her until she fell asleep.</p><p>Whereupon he carefully took her to the nursery . . . and returned for mahmen-and-papa time, as he referred to it.</p><p>Both the reading and the way he'd grown comfortable holding Nalla were miracles, and Mary had had a hand in both. Z and the female met once a week in the basement by the furnace. The two of them had told Bella about the sessions and sometimes Z would talk a little about what was covered, but for the most part what got discussed stayed in the basement--although Bella was aware that some of what was shared was gruesome: She knew because, afterward, Mary would frequently go into her bedroom with Rhage and not come out for a long, long while. But it was working. Z was easing in a different way, a new way.</p><p>It showed with Nalla. When the young grabbed at his wrists he didn't pull away, but let her pat him or kiss him on the bands. He let her crawl over his ruined back and rub her face against his, too. And he'd had his daughter's name added to his skin, carved lovingly below Bella's by his Brothers.</p><p>It also showed because the bad dreams had dried up. In fact, months had gone by since the last time he'd shot upright in bed in a fear-sweat.</p><p>And it also showed in his smile. Which was broader and more frequent than ever.</p><p>Abruptly, the sight of him holding his daughter got a little wavy, and as if he sensed the tears, Z's eyes flipped up to her. He kept reading but frowned with worry.</p><p>Bella blew him a kiss, and in response he patted the mattress next to him.</p><p>\" `So. . . get on your way!' \" he finished as Bella cuddled up close.</p><p>Nalla let out a happy coo and patted the book cover he'd closed.</p><p>\"Are you okay?\" he whispered in Bella's ear.</p><p>She put her hand on his cheek and brought his mouth to hers. \"Yes. Very much so.\"</p><p>As they kissed, Nalla patted the book again.</p><p>\"You sure you're all right?\" Z asked.</p><p>\"Oh, yes.\"</p><p>Nalla grabbed at the book and Z grinned, tugging it back gently. \"Hey, what are you doing, little one? You want more? You are just too much . . . you . . . oh, no . . . not the quivering lip . . . oh, no.\" Nalla let out a giggle. \"Outrageous! You want more, and you know you're going to get what you want because of The Lip. Jeez, you've got your father wrapped around your little finger, don't you.\"</p><p>Nalla cooed as her dad opened the book again and the story started to roll out of Z's mouth once more, his voice resonant. \" `Congratulations! Today is your day. . . .' \"</p><p>Bella closed her eyes, put her head on her hellren's shoulder, and listened to the story.</p><p>Of all the places she'd ever been, this was the best one. Right here. With the two of them.</p><p>And she knew Zsadist felt the same way. It was in all the hours he spent with Nalla and all the days he reached through the sheets for Bella when they were alone. It was in the fact that he'd started singing again, and that he'd begun to roughhouse with his Brothers, not for training, but for fun. It was in his new smile, the one she'd never seen before and couldn't wait to see again.</p><p>It was the light in his eyes and in his heart.</p><p>He was . . . happy with his life. And getting happier.</p><p>As if he'd read her mind, Z took her hand in his larger one and gave her a squeeze.</p><p>Yes, he felt exactly the same. This was his favorite place, too.</p><p>Bella listened to the story and let herself drift off, just as her daughter did, safe in the knowledge that all was where it should be.</p><p>Their male had come back to them . . . and was here to stay.</p><p>THE END </p> </body></html>"]