["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>1955, Las Vegas, Nevada</p><p>Angeline swayed on her feet, twirling in circles as the lights of Sin City spun around her, her head thrown back in a giddy laugh. When she stopped, the lights kept spinning, turning into long, wispy snakes hissing and flying around her head. She made her own hissing sound back at the apparition and giggled as her fangs snicked back into her gums.</p><p>The woman now lying at her feet had been on mescaline and the trip had made it all the way to the vampiress. Her gaze was caught by a church, glittering in psychedelic glory in the distance. It rose out of the ground like a sign to Angeline, glowing and shaking and warping and moving, asking her to join the dance.</p><p>The drug expanded her awareness, and she felt there was nothing she couldn’t know. Her future mate was in that building. He was there, waiting for her to turn him and open his world to all the possibilities she held in her hands. She held the world in her hands. Or maybe that was the mescaline talking.</p> <p>Angeline stumbled over the body in the alley, then righted herself, straightening her black, Victorian-style dress. Her manner of dressing occasionally drew stares in other cities, but she didn’t care. Here in Vegas, people assumed she was some type of performer and didn’t look twice. She could blend while keeping in use a wardrobe from her last favorite era.</p><p>She grabbed a sober man off the street and pulled him into the alley, drinking deeply of his blood to rid herself of the effects of her last victim. Then she made her way to the formerly glowing church that now stood austere in simple gray stone.</p><p>It had been centuries since she’d been inside a church. Would she burst into flames when she crossed the threshold? She imagined walking through the door and catching on fire to the shock and fright of all the assembled faithful. Of course she was being silly, she’d risen inside a church in the arms of her sire. She hadn’t combusted back then. As long as she didn’t touch any crosses or holy water, she’d be fine.</p><p>If I have any humanity left, I’ll be fine. She was well aware it was only her human side that could keep her safe, a side she’d spent the better part of the last several centuries suppressing.</p><p>She’d just reached the steps when the church clock began chiming out the midnight hour in ominous greeting. She jumped when the door swung open.</p> <p>“Miss, are you here for the midnight service?”</p><p>A deep, graceful baritone. Angeline’s heart almost stopped. He was so damn beautiful. So tall—at least six foot five, and broad. He filled the entire double doorway with his presence. He was the one. She could feel it. Still she just stood there, unable to speak and partially afraid to go in.</p><p>He extended his hand to take hers. “I’m Father Hadrian. We’re just about to start. You’re welcome here.” His hands wrapped around hers were so warm.</p><p>The invitation took away the last of her fear of the place. Although vampires didn’t need invitations to get into human homes, a church felt more dangerous, as if the demon half of her could condemn her. Surely his invitation as well as her partial humanity would protect her. She glanced up at him through a fringe of lashes, overtaken with a sudden bit of shyness as she stepped inside the church.</p><p>What was wrong with her? She didn’t get shy around men. She moved to an empty pew and sat, her gaze moving back to him, tracking his every movement. She couldn’t help it, he was the most interesting thing she’d ever seen. Hadrian. She rolled his name over in her mind. She was a great fan of etymology. Her name, of course, no longer fit—she was far from an angel. Hadrian meant dark one.</p><p>His looks matched. In addition to being tall and broad, he was swarthy, with dark hair and eyes black as coal. Everything in his image screamed danger, but the kindness he projected was warmth and light. The contrast fascinated her. She wanted to tease out the dark edges, to have a partner in crime, but she also wanted someone she could trust.</p> <p>In its own way, the church was a welcome retreat—familiar. It was dark—almost sinister—illuminated only by candles. The ornate Our Lady of Guadalupe statue glowed in the candlelight, as did the crucifix over the altar. In the dark it looked like a scene from a horror film rather than a symbol of hope and forgiveness.</p><p>Angeline reached absently inside her bag, clutching the beads of the old rosary inside. She let out a sharp hiss as her hand accidentally brushed the cross, leaving a condemning burn in its wake. She quickly composed herself, looking around to see if anyone had noticed a visible change in her demeanor. Had her eyes glowed? Had her fangs popped out? If either of those things had happened, no one noticed before her human mask fell back into place.</p><p>She looked at her hand as the red mark faded and the cross-shaped scar disappeared completely, the healing process completed in a matter of seconds, since she’d just consumed so much fresh human blood.</p><p>God didn’t want her anymore. Well fine, fuck him anyway. She’d carried this anger for a long time now, and yet, she stubbornly kept the rosary, carrying it around with her like a tarnished ticket into heaven.</p><p>Every time it burned her skin it was a reminder the ticket was no longer valid. It was of little consequence how faithful she’d been in her human life. It was that faithfulness that had ultimately killed her. If she hadn’t been at church that night...</p><p>Angeline brushed the stray tear off her cheek, pulling the wall up high around herself. It was easier to be the monster than the woman. The woman was still too vulnerable. She turned her attention back to the priest and the liturgy that was so familiar and yet so alien now.</p><p>She didn’t participate; she merely sat and observed the standing, sitting, kneeling—rote repetition that carried her off into another experience more quiet, but no less profound than the drugs that had moved within her earlier in the evening. The priest’s voice held a trace of an accent, but she couldn’t place it.</p><p>Occasionally his eyes drifted to hers. It took everything in her not to enthrall him, not to put suggestions into his head. She wanted to observe him in his natural state, like a researcher in the savannah watching a wild animal. She wanted to know who he was, not who she would mold him to be. That would come later.</p> <p>His hands were mesmerizing, strong, and sure. Compared with her strength he was feeble right now, but he would become an awesome force of nature, like a tornado that couldn’t be contained. Her shyness had evaporated inside the cocoon of the church. Now she was only a predator watching her prey.</p><p>She licked her lips almost unconsciously.</p><p>The congregants began to stand and form a line to receive the bread and wine. She felt Father Hadrian’s eyes burn through her and looked away. He must have noticed she didn’t take part in the service. She felt exposed, and wanted to leave. She wouldn’t turn him tonight, but she remained in her seat. Angeline wanted to feel his warm hands over hers again and didn’t want to wait a week for the experience.</p><p>Hadrian had tried to keep his focus on the Mass, yet he couldn’t stop looking at the woman he kept thinking of as the dark angel. He’d seen human nature in all its intriguing, delightful, and disappointing forms, but this woman was a study in contrasts he couldn’t quite unravel.</p><p>His gaze lingered on her lips, which were painted a lush red that invited him to taste her. Her skin was a smooth, milky white that contrasted sharply against her long dark hair. Her glittering blue eyes offered an additional contrast to her shiny brown locks.</p><p>Given the style of her clothing and the smallness of her waist, Hadrian wouldn’t be surprised if she was wearing a corset underneath the dress, a corset painstakingly laced and tied by the hands of another. A lover perhaps? He imagined her flushed after a hurried coupling, leaning against the bedpost, sucking in a breath so the corset could be cinched just a little tighter.</p><p>She seemed barely real, and he feared she might disappear into the dark, cold night from whence she came, never to be heard from again. As he moved to the next parishioner kneeling at the bench, he glanced again at the dark angel.</p><p>Don’t leave.</p><p>Her eyes rose to his immediately as if she’d heard his thought. Her face was a mixture of hope, pain, and longing. He quickly dropped his gaze. He knew that look. With his face and physique he’d been the object of many female sexual desires. This woman was fire.</p><p>He tried to ignore her and focus on the rite, the guilt curling inside him that he wasn’t fully present for what was supposed to be Holy Communion. Hadrian passed through the rest of the service by habit, the part of his brain familiar with the exercise taking control while he waited for it to be over.</p><p>The midnight service was lonely. There was no choir or other participants, just him, offering a scaled-down version of the Mass for those who felt more comfortable in the dark. These were the people who needed him the most, and yet he didn’t know who was worth saving, who could change and find redemption and who couldn’t.</p><p>He’d grown weary of having faith in people, praying for them and hoping they’d change, only to see them fall further, many dying in despair, leaving the world worse than when they’d entered it. It was wrong to think such things, but he couldn’t help it. He’d seen too much—both human and otherworldly. He could no longer look at the world as the fresh-faced youth entering the priesthood. That had only been five years ago when he’d had a brief mystical experience, his own Damascus Road. But it felt like forever, like he’d aged centuries. He was far too jaded for thirty-five. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Like every priest initiated into the mysteries of the Catholic Church, he knew the score about demons. He knew they were out there, flesh and blood beings who could compel and work their dark magic. At times, as he looked out at the assembled congregants at the midnight service, wondering if there might be one hiding among the flock. But no, they couldn’t get inside a church—not standard demons anyway. Whatever else may lurk out there amongst the shadows, Hadrian wasn’t sure of the rules for them. He didn’t know where they could go or how they could hide, and felt ill-prepared to deal with realities he hadn’t been taught to handle.</p><p>Beyond exorcisms and the knowledge of reincarnation, dimensions, and the awareness he was in hell—literally—there wasn’t much else they were encouraged to explore or know a lot about. They’d been charged with keeping the flock in the dark about these matters and guiding them to do the best they could in life. Hadrian often wondered what other secrets were hidden in the higher levels of the Church. What did bishops and archbishops know? What did the Holy See know?</p><p>Hadrian blinked. The assembled were watching from their pews with rapt attention, waiting for him to close with the benediction and blessings of peace upon them. He hurried through the remainder of the service, then escaped to the back of the church to greet each individual as they left. He wasn’t surprised to see the dark angel at the back of the group. Of course temptation would only visit when all other distractions had exited the building. Life would be too easy otherwise.</p><p>He turned his attention back to the front of the line. A red-headed woman in her early twenties stood before him, a batch of freckles dancing along her cheeks, skipping her nose altogether. The innocence in her appearance was a deep deception.</p> <p>“Mary, it’s good to see you. I’m glad you could make it tonight.”</p><p>The guilt was plain in her eyes. She danced for men in a club on the Strip. He hadn’t been there, of course, but he didn’t doubt some of the other late night parishioners had seen far more of Mary than he ever would.</p><p>“You know how it is,” was all she would offer him in return.</p><p>He nodded and tried to give her the benefit of the doubt. She’d spoken to him in confession on many occasions, but still she repeated the same mistakes. It wasn’t charitable, but he wondered if she was worth saving at all. Would she forever remain trapped in this loop of confession and regression? Would she ever transcend it? Did she even want to?</p><p>She pulled her hand from his and made her way out the door. She’d be back in a few months maybe. He sighed and worked his way through the line, feeling increasing guilt over his pattern of thought this evening.</p> <p>He greeted them all: Winos, prostitutes, drug runners, crime family members, until the line dwindled to nothing.</p><p>The heavy church door echoed as it shut, leaving Father Hadrian alone with the dark angel. He took her hand, overwhelmed by how cool it still was after being in the warm church so long.</p><p>“I’m glad you could join us tonight.”</p><p>“Thank you for having me,” she said, a brief bit of color coming into her cheeks. How could one woman seem so dark and so vulnerable all at once? He simultaneously wanted to hold her in an embrace and fling her out of the church with an admonition never to return. Finally, realizing he was still holding her hand, he let it drop.</p><p>“I didn’t catch your name earlier?” His voice rose at the end, hoping she’d acknowledge the question therein.</p><p>She smiled, the shyness leaving her all at once. “I didn’t throw it.”</p> <p>Before his eyes she transformed from an uncertain, vulnerable creature into a femme fatale who could certainly be his undoing, given time. He pushed that thought away.</p><p>The woman laughed. “I’m Angeline.”</p><p>So his instincts had been correct on that one. Dark angel indeed.</p><p>“There is a pamphlet on the table beside the front door with our hours. If you ever need to come to confession or... ” He faltered. What was he even trying to say? “If you’d like to know about catechism classes or have any questions about the Church, I’d be happy to... ” I’d be happy to continue to stand here, grasping for vocabulary like a bumbling idiot.</p><p>Her finger pressed against his lips to stop his babbling. He swallowed. Danger. Danger. Danger. The inappropriate action ended as quickly as it had begun. She was no longer touching him, but he could still feel her finger there, pressed against his mouth.</p><p>For the briefest moment, he’d wanted to suck it between his lips to taste her skin. Suddenly an image of the dark angel sprawled across the altar with him on top of her bloomed in his mind. He took a physical step back to shake the thoughts free.</p><p>“I really must go,” she said after a beat. “You’re too much temptation.”</p><p>He should have called her on her forwardness, but he couldn’t bring himself to take the light out of her eyes. Her confidence was mesmerizing; watching it crumble in shame at her behavior wasn’t something he could bring himself to do. Not after observing how timid she’d seemed upon entering the church. It was as if her brief visit had breathed new life into her even though she’d remained an observer.</p> <p>“I hope you can stand a new regular,” she said, “because I’ll be here every week indefinitely.”</p><p>God help me. Perhaps another of Our Lady of Mercy’s priests could take over the midnight Mass—someone of stronger constitution. Hadrian found his eyes raking over her cleavage, pushed up by an old-fashioned evening gown of sorts. A heavy antique pendant nestled there between her breasts, drawing his eye. He imagined the heavy weight pressing there against her chest and wished that weight was his hand, or his mouth.</p><p>When he collected himself and looked up, her eyes were sharp. Her perception seemed clear and precise, as if she could read each thought as it tumbled from his mind even before he could line them up into sentences, ideas, and longings.</p><p>Her fingers ran along the edge of the pendant, the backs of them slowly dragging across her skin. Hadrian struggled for breath.</p><p>She sighed. “All right, I’ll stop tormenting you for now. You might need the full week to recover. Pick your jaw up off the floor like a good boy.”</p><p>She turned then, her skirts whispering around her as she glided out of the church, leaving Hadrian speechless, without even the ability to stop her or chastise her for her behavior.</p><p>Six Months Later</p><p>Hadrian stood tense with his back to the door; it was five minutes til midnight. His dark angel didn’t show up every week. Occasionally she’d skip one. On those nights when she was absent, he both missed her, and breathed a sigh of relief. When she was gone, he was more present for the Mass, his mind not constantly on her, his eyes not distracted by the milky-white skin on display over the top of her dress.</p><p>Hadrian turned suddenly, pulled by the unmistakable scent of Angeline’s perfume. He took a deep, steadying breath as she passed him with a knowing smile and made her way to her usual seat three rows from the front on the left. She’d been gone a few weeks now. He’d thought—maybe even hoped—she’d left for good.</p><p>The woman could turn an angel into a demon with just the glint in her eyes and the sultry downturn of her mouth. The temptation to do something stupid grew each time he saw her, the part of his anatomy that hadn’t consented to a vow of chastity nudging him to find fulfillment. He was only human, after all.</p><p>Remember your vows.</p><p>Angeline only attended church at night. Hadrian always found himself enthralled by her eerie, blue eyes that nearly glowed with their brightness, always-painted red lips, and dark brown hair that fell halfway down her back. She was usually dressed in slinky black, looking like she’d just left work in a Victorian brothel and had made a quick pit stop at a funeral on the way to Mass.</p><p>He knew nothing of her life or what she did. He could only guess at her sins. She’d never been to confession, not on his watch, at least. Our Lady of Mercy was a sizable church, practically a cathedral, with more than one priest available to hear confession on any given day. Father Hadrian suspected she never went to confession, that her sins had been mounting ever higher for quite some time now.</p><p>The tell-all was that she never came up for the Holy Eucharist. She merely sat on her usual bench, watching Hadrian, unnerving him with that potent stare. Sometimes they spoke briefly before or after Mass. Always small talk, always some innuendo or subtext she was throwing his way, which he always pretended not to notice. It was like she was feeling him out, planting a seed of something she intended to harvest later. If she didn’t make her move soon, the priest worried he’d actually succumb to her charms when she finally played her hand.</p><p>He tried to regain his focus as he gave the benediction, feeling guilty that he’d been obsessing about Angeline the entire service. The parishioners stated their rote response and got up to leave. A shuffling of hymnals, purses, and scuffling of shoes signaled the beginning of their next shift of regular life, where they’d no doubt do more impure things they’d have to confess before partaking in the ritual of bread and wine the following week.</p><p>Angeline took her time putting her hymnal away, searching through her purse for something that most likely didn’t exist, and then stood and smoothed her dress down. Hadrian tried not to watch her, instead working to keep his focus on the aging wino standing in front of him. The alcohol on the man’s breath wasn’t from the small amount he’d just partaken of. A stench that strong required dedication and commitment to the drink that wasn’t possible from a mere sip with a bit of bread. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Those was good words, Father. They really touched me right here,” the drunk said, pointing to the center of his chest.</p><p>Hadrian forced a smile and shook the old man’s hand, allowing the unpleasant smell to destroy his memory of Angeline’s perfume and the arousal that had come with it. He greeted and made small talk with each person who had come to Mass, and one by one, they filed out, slowly wearing away at the buffer between him and sexual immorality.</p><p>He looked up to find Angeline still rooted to the same spot. She could have been standing there staring at him for fifteen minutes, but he didn’t think so. He would have felt her eyes on him. The heat from her gaze would have turned his head again in her direction, even while he was trying so hard to ignore her.</p><p>The door shut with a loud thud, the same loud thud that had greeted them each week as she’d lingered to be alone with him in the empty sanctuary.</p> <p>“Father Hadrian.”</p><p>Her voice was soft, lyrical. She hadn’t been misnamed, though her dark hair and beguiling nature suggested quite the opposite kind of creature.</p><p>“A-Angeline. I haven’t seen you here in awhile.” Could he not get that schoolboy stutter out of his voice?</p><p>“I was fighting temptation,” she replied coyly.</p><p>Hadrian cleared his throat. “And did you succeed?”</p> <p>“No.”</p><p>She glided closer—or floated. The length of her dress made it impossible to tell which. She stopped mere inches in front of him. He should have taken a step back, should have excused himself, but her strange eyes locked with his. They drew him in, hypnotizing him.</p><p>If he were another type of man, he would have proclaimed she was a witch putting him under a spell, but it was just as much his responsibility as hers for not moving away. It was his fault for not finding a replacement for midnight Mass. His mind became fuzzy.</p><p>What was I just thinking about?</p><p>Her eyes pulled him in, making the rest of the room swirl around him in a slow blur. If he’d looked down to find them both floating and spinning in the air, he wouldn’t have been surprised. He was dizzy from the delicious scent emanating from her.</p><p>Her voice was a siren’s song when she spoke again. “Forgive me, Father, for I’m about to sin.”</p> <p>Angeline’s mouth tasted like hot cinnamon candy as her lips descended on his. Her lip gloss left his mouth tingling. She might burn him alive with a single kiss. She chuckled as she continued her exploration of his mouth, as if he’d stated his thought aloud and she found it amusing.</p><p>Somewhere deep inside him was the place that was screaming that this must not happen, but it sounded like it was shouting from far away down a long, dark hallway, disappearing into a tinny echo. Quickly overtaking that voice was one penetrating thought that refused to release him.</p><p>I want her. I want her. I want her. I want her. The thought happened in rhythm to the beat of his heart.</p><p>Her lips left his mouth and made a burning trail over his cheek and up to the lobe of his ear. “Father Hadrian.” It was a breathy pant that held all the promise of a new universe unfolding.</p><p>He couldn’t remember what she said after that or even if she said something after that. The pounding of his own blood rushing through his ears—and other blood racing south in response to her nearness—had drowned out his ability to think or hear anything else but the lilting magic of her voice calling his name.</p><p>“Father Hadrian... ”</p><p>Her tone had gone from that of an angel to a writhing serpent as she rubbed her sinewy body against him. This was wrong. The thinking part of him clawed to get out. Something was all wrong about this, beyond the breaking of a vow. But he couldn’t form a coherent thought.</p><p>I want her. I want her. I want her.</p> <p>“And you shall have me. Forever,” she said.</p><p>Had he spoken out loud? He wasn’t sure.</p><p>“I don’t know what’s wrong with me right now,” he said, as her fingers slid under the Roman collar.</p><p>It startled him. His collar. Where were his vestments? There were more layers of clothing, or there had been a few moments ago. He glanced down to find the vestments somehow on the floor of the sanctuary. He started to pull away.</p><p>“No, Father. Eyes right here on mine. Stay with me.”</p><p>His gaze shifted back to her eyes and his will merged with her again. He didn’t realize his shirt was off until the air from the chilly room hit his bare chest.</p><p>“Oh, what a surprise. You must work out. Don’t be shy, Father Hadrian. It’s a crime you never get to be inside a woman with this body.”</p><p>She swayed in time to a music likely occurring only inside her head. Something earthy and sensuous, no doubt. The dress ended in a heap on the floor, and he learned he was right about the corset. Delicate black lace panties barely covered her most intimate area. His gaze panned down to see black leather boots that ended just at her thighs.</p><p>Angeline crooked a finger, her gaze heating. “Come with me, Father.”</p><p>She was still addressing him by his formal title, but they both knew it was just a dirty game she was playing. Why couldn’t he resist her? Like an obedient puppy, tail wagging, he followed her to the front of the church. She braced herself with one hand against the altar, leaning away from him, giving him a lovely view as she removed first one boot, then the other.</p><p>Then she was standing in front of him. Her skin, usually cold, seemed to burn him as her hand caressed his cheek. “Help me out of this, will you?”</p><p>She turned away from him and he was faced with the back of the corset all laced up. His hands shook as he fumbled with the ribbons. I want her. I want her. I want her.</p><p>The corset was tossed on top of the boots, and she turned to face him. Her eyes never left his as she hooked her fingers underneath the fabric of the panties, pressing them down over her hips and gracefully stepping out of them when they hit the floor.</p><p>Even without a command to direct him, his hand closed over her breast and he found himself stroking the hardened nipple. Hadrian came back to himself, pulling his hand away as if he’d been scalded.</p><p>She laughed. It was a laugh that seemed to fill up the entire church, that seemed to taint it somehow and make it unfit for its intended purpose.</p><p>“Someone will come in,” he said. It was unlikely at one in the morning, even in this city. But the fear still pressed on him. It was bad enough that God should see this, but he’d lose his post if anyone else found out. His mind had already moved beyond the idea that he could bring himself to stop her. He couldn’t find enough motivation even with the threat of getting caught.</p><p>“It would be the last thing they ever did,” came her cryptic response.</p><p>Her hand felt cool in his as she led him up onto the platform beside the altar. Moments later, the goblet of wine rang out like a gong as it clattered to the ground along with the tray that had held the bread. The tray made a reverberating sound as it tried to settle out flat like a coin that had fallen on its edge. It was the greatest sacrilege, the body and blood of Christ being carelessly tossed aside, but he couldn’t focus on that right now. There wasn’t room in his brain because of the one repeating thought that crowded everything else out.</p><p>I want her. I want her. I want her.</p><p>His own voice chanting in his mind wouldn’t let up for even a second to clear the path for any other, more sane thoughts. Her hand was down his pants now, stroking his bare flesh, causing him to harden impossibly further. Moments later, she divested him of the rest of his clothing. He was her toy. His body and mind were both fully committed as she pressed him back against the altar and mounted him.</p><p>She felt like silk. It had been so long since he’d been inside a woman. He’d forgotten the exquisite warmth, muscles tightening around him to take his pleasure deeper. Mystical experiences aside, how could he have stopped doing this?</p><p>You could have been doing this for years instead of denying yourself. What good has any of that denial done? How many people have you really helped? How many have better lives than they had because of you? How many keep turning back to their evil while you are left to deny, deny, deny that you’re human and have needs and... Holy Virgin Mary.</p><p>For a moment, he wasn’t sure if the voice in his head was his own or hers. Until the last thought. That had been decidedly his. He’d forgotten the power of orgasm, its own sacred ritual. Perhaps that voice was right. He shouldn’t have denied himself. How many priests really did?</p><p>Angeline arched her back and rode him a few more seconds before collapsing on his chest in a fit of giggles, her conquest finally accomplished.</p><p>Hadrian looked around, becoming aware of his surroundings again. He’d had plenty of rationalizations, but now, in the quiet aftermath, the guilt weighed on his conscience. Not only had he broken his vows, but he’d done it in the most lewd way imaginable. If they didn’t strip him of his post and duties, he would do it himself. He couldn’t stand behind this altar again and pretend he was a good man.</p><p>“Get off me.” He didn’t even recognize his voice. It was cold, hard, everything he’d fought not to be in spite of a fucked-up world that never seemed to get any better or brighter. But right now, he just wanted to kill the woman draped over him. He wouldn’t feel an ounce of remorse for it. He wanted to kill her, because if he could, maybe he could also kill the sin he’d just committed, erase it while he erased her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He quickly wiped that thought from his mind. Murder was obviously worse than sex—at least a little worse.</p><p>She raised herself, and he tried not to stare at her breasts as they dangled free in easy reach. As disgusted as he was with himself and with her, part of him wanted to do it again.</p><p>“And we will,” she said. “I just had to take you for a test drive before I made a full commitment.”</p><p>Hadrian narrowed his eyes. He knew he hadn’t just spoken out loud. He may be feeling out of sorts, but he knew that much. She was responding to things he hadn’t yet verbalized. How was that even possible? He pushed her away and scrambled off the altar, searching for his clothes, trying to get a clear thought to pulse through his muddled brain.</p> <p>As the fog cleared further, he entertained the idea that there was something preternatural about Angeline’s seduction. She couldn’t be a demon, but she was something. She must be. It was the last thing he was holding on to, reassuring himself that this wasn’t something he’d do of his own free will.</p><p>“What are you?” He’d known something was off from the beginning, but now he was sure. She wasn’t a normal woman. Perhaps she was a witch. Maybe he should have taken such a threat more seriously rather than treating it like a joke.</p><p>“I am your maker,” she said.</p><p>“My maker is God.”</p><p>“Originally, perhaps. But I’m about to upgrade you, elevate you to something truly remarkable.”</p> <p>Hadrian’s eyes widened as Angeline’s lovely face transformed. Her eyes went from brilliant, hypnotic blue to a fiery red in the blink of an eye.</p><p>She’s a demon. Of course. But how?</p><p>“Actually, half-demon. Vampire, in fact. But good guess.” Fangs descended, and then she moved impossibly fast.</p><p>He jumped back, thinking surely he was about to die, but she was only playing with him, showing off.</p><p>“How are you able to be in a church? Have you worked magic to breech the protections?”</p><p>“Half demon,” she said with exasperation. “The other half is human. And if you think you are stupidly optimistic about people’s ability to change, you’ve got nothing on the man upstairs. If I was full demon, I wouldn’t get past the threshold of a church, but that human half gives me an in.”</p> <p>Hadrian had been backing away an inch at a time. When he bumped against the altar, he took down a crucifix that had been hanging on the side on a small nail. She advanced toward him, not having seen the danger.</p><p>When she was close enough, he pressed it against her face. It wasn’t right that she should be able to get inside a church. Once he got rid of her, he’d find a way to ban her from entering ever again. She let out a horrified shriek and leapt back as smoke rose off her flesh, leaving behind a bright burn mark.</p><p>“I see I was still left with some weapons to defend myself,” he said, “thanks to the man upstairs.”</p><p>The mark began to fade, leaving her perfect, creamy complexion behind.</p><p>“That was stupid. When I’ve turned you and you are mine, you will pay for that. We’re alike, you and I. In more ways than you know.”</p><p>“I will never be yours.” He gripped the crucifix more tightly.</p><p>A dark smile. “You’ll be my little bitch begging for a bone when I’m done with you. You have NO idea the power I have.”</p><p>Since the revelation of Angeline’s true nature, Hadrian had been going through each bit of vampire lore he’d ever heard. He wasn’t sure which parts were true and which were untrue. He hadn’t made eye contact with her since the word vampire had passed through her lips, and he hoped it was enough to keep her from enthralling him further. He had a plan, but it required keeping control of his own mind.</p> <p>She moved like a viper and struck. Father Hadrian took in a sharp breath at the sting of her fangs, but a moment later he got his bearings and began to chant.</p><p>“Exorcizo te, immundissime spiritus, omnis incursio adversarii, omne phantasma, omnis legio... ”</p><p>Angeline pulled away from his throat. Her face was gruesome, her lips painted with his blood. “Ooooh baby, talk Latin to me some more.” She laughed maniacally as if she were the author of the best joke ever told, then went back to feeding.</p><p>Father Hadrian could feel himself weakening, but he continued the chant until he lost consciousness.</p><p>Angeline picked up the priest and laid his body out over the altar like a human sacrifice. He’d lost consciousness only a few moments before. He truly was a beautiful specimen. She allowed her fingers to run over the contours of his face, down his chest to more intimate areas.</p><p>She’d sealed the wound on his neck from her bite, but there was still a trail of blood down his neck and shoulder, and a bit on the upper part of his chest. She’d always been a messy eater. Angeline trailed her tongue over the remaining bits of blood to clean him up.</p><p>Maybe it was the long time he’d gone without a woman, but she’d felt him, been inside his head as he’d been inside her. It had been everything she’d hoped. He looked so peaceful in the in-between place.</p><p>She could still let him die. Until her own blood was inside him, he was on borrowed time. She could almost hear the imaginary clock ticking, counting down to the moment when she couldn’t bring him back and he’d cross over for good into the next world.</p><p>She nuzzled Hadrian’s throat, soaking in the last bit of warmth from his skin. She’d miss it. Perhaps she should have kept him alive longer. Human pets were common enough. It was nothing to be ashamed of, but she’d already closed the door to that option by drinking too much. She’d been too greedy. The taste of him had burst across her tongue, a unique blend of despair, guilt, goodness, and a kernel of something darker. Something she recognized. Something she could work with.</p><p>His emotions had been a sophisticated blend meant for a discerning palette. After druggies, drunks, whores, and the random simpletons on the street, Hadrian had been the one intoxicating agent she couldn’t get enough of. It had been hard to stop in time. She still felt herself spinning with it. Her skin hummed and buzzed with the euphoria of flavors so passionate and complex, so much repressed power and desire and darkness.</p><p>Hadrian’s pulse slowed; time was running out. For the briefest moment, Angeline thought about letting him go. What if he wasn’t the right priest for her? He’d seemed almost resistant, even with all of her hypnotic powers thrown into the mix. He might be hard to tame. But she’d been searching for so long already.</p><p>It would be a waste to let a fine specimen like Father Hadrian die and decompose. Worse than a mortal sin, even.</p><p>Angeline winced as she tore into her own flesh with fangs. She held the priest’s mouth open and allowed the blood to flow into him. It was so poetic. Only moments ago he’d been inside her. Now she was inside him. It would link them forever and give her power over him—at least for a time. She vowed that by the time she was finished with him, by the time he got old enough and strong enough to break free, he wouldn’t want to. He’d want to be hers forever.</p><p>Her own sire had only wanted a toy to play with, someone to abuse and break, but Angeline wanted a mate. Surely Hadrian would see that in time. He’d come to understand that it was all for a greater purpose. He’d love her and she’d find a way to love him. That ability had to still be in there. She just hadn’t used it in awhile.</p><p>It took only a few moments for her blood to revive him enough for his throat to start working of its own accord. She breathed a sigh of relief as his mouth formed a suction around the wound, and he drank with the desperation of a man who wanted to live.</p><p>That had to be a good sign.</p><p>Hadrian found himself bathed in a bright, yellow light. It was a light of judgment, the kind no evil could pass through. No one had to spell this out, he just knew. It was knowledge like the sun is bright and people breathe air—self-evident. A short man stood behind a golden podium in a white robe. In order to see over the top, he had to stand on a small ladder.</p><p>Hadrian looked down to find himself wearing his clerical clothing. It was the only normal thing in a sea of pure weirdness. He spun in a slow circle, taking in the vast, circular golden room with the many doors; he moved curiously toward one of them. His hand wrapped around a doorknob, ready to explore the environment further when a throat cleared behind him.</p><p>“Father Hadrian? I’m afraid you can’t venture beyond this waiting area.”</p><p>“Am I dead or am I dreaming?” They were the only two options he could think of.</p><p>“Neither. You’re transitioning into something else.”</p><p>The balding man didn’t have to say anymore. The fuzzy memory was becoming sharper. Angeline. Hadrian winced as memories of what they’d done—what she’d done to him—drifted through his mind. He had the vaguest sense of having drunk her blood, as well as the vaguest sense that it had been the best thing he’d ever tasted. Something was wrong with that thought.</p><p>“So this is where you go when you die?” He knew how things worked, of course, but his training hadn’t included an afterlife diagram or map. He only knew of reincarnation and the many dimensions and the demons, and that earth was hell. It was more than the laity knew, but not much more.</p><p>“It’s a sorting area, so to speak,” the man said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hadrian thought that was an odd reply. “Then why am I the only one in here? Don’t hundreds of thousands of people die every day? Where are they?”</p><p>“You humans all think the same way. You’re so used to being bound in place and time, you have no idea the vastness of what is out there. Yes, many others are just dying and are encountering their own version of this room. Do you think we’re so poorly organized around here that we’d have you all in the same place, waiting some indefinite amount of time to be dealt with? Besides, this could all be happening in your mind, couldn’t it?” The man stepped down from the podium, collecting a large book that had been resting open upon it.</p><p>As he passed by, Hadrian could see the book had his name on it, and he wondered if the stories inside were mostly good or bad.</p><p>“There’s nothing for me to do here, so I’ll be on my way. I might as well take a break before my next assignment.” The short man grimaced. “It’s such a waste of time when they do this to me, but you know... for a little while, it can go either way. But the choice has been made, and there’s nothing I can do for you.”</p> <p>His gait was uneven as he shuffled across the floor to one of the golden doors and slipped a key inside the lock. As he pushed the door open he turned back to Hadrian. “Don’t try any of the doors. We have a better security system than it might appear on the surface. Oh and... when you get back there, try not to think you’re too invincible. Some day we’ll be having another conversation, and it would be a shame to have your evolution slowed unnecessarily by this little detour.”</p><p>“Wait!” Hadrian’s voice echoed off the walls. His plea was useless. The door shut and the lock turned back into place, and he was left alone in the room. Was this all happening in his mind? It must be.</p><p>Most likely his body was somewhere in or near the church, waiting for this transition to complete and his essence to come back. So where was he? Locked inside his head, while he thought he was locked inside this too-bright room? Or was he somewhere else entirely?</p><p>Only a few moments passed in existential crisis before a thick, black smoke started to form in the center of the room near the podium. As the smoke grew thicker it made a hissing sound, then it started to spin like a cyclone until it transformed into something that looked solid enough—a demon.</p><p>The demon was a large, shiny black, and strangely dressed like Father Hadrian. The beast was larger than him by almost a foot in height and who knew how much in breadth? His eyes glowed a fiery red, and inside his mouth were the nastiest, sharpest teeth Hadrian had ever seen.</p> <p>The priest felt around in his pockets for a cross, to no avail. He held a hand up to the demon and started to chant.</p><p>“Exorcizo te, immundissime spiritus, omnis incursio adversarii, omne phantasma, omnis legio... ”</p><p>The demon laughed. “That won’t work on me. I’m you.”</p><p>What? Father Hadrian was beginning to lean toward dream. Perhaps he’d eaten something very strange, a bad burrito from the Strip. Maybe the part where Angeline had revealed herself as a vampire and bitten him had been a dream as well. And the sex. The sex had been a dream. It was just one long dream. None of this could be real.</p><p>The hulking monster moved toward him at a swift pace, his footsteps echoing much as Hadrian’s voice had only moments before. Ordinarily Father Hadrian wasn’t the type to run from a fight. Even as a priest, he could and had stood his ground. Not that most had wanted to mess with him having both an intimidating presence and God on his side. But he had no weapons, and the one demon-fighting ritual he knew appeared to have no effect, so he ran.</p><p>The doors seemed to go on forever even though that couldn’t be true since the room was a circle. He could see the whole thing and yet it expanded as he moved through it, growing bigger and more impossible to travel the whole circumference with each stride he took.</p> <p>Each door he encountered was locked. He banged on a few, yelling for the old man to let him in. He was like a gladiator left alone in an amphitheater with an angry lion. But the demon didn’t look angry. He looked amused. In fact, he was no longer chasing him, just standing near the podium with his arms crossed over his chest.</p><p>“I could chase you down, but it’s too schizophrenic for me. You’re smart. You’ll figure this out and get tired of trying to bust down the gates. The rules won’t be ignored or changed for you. You aren’t that special.”</p><p>Hadrian paid him no heed and continued to go from door to door praying someone might have accidentally left one unlocked. It could happen. There were an uncountable number of doors, growing ever more uncountable by the minute. One had to be unlocked. It was a statistical certainty.</p><p>“Okay. I changed my mind. I am chasing you down. I’m not spending three days in here like this with you. It’s like watching a tiny puppy chasing his tail.”</p><p>Hadrian turned in time to see the demon charging toward him. He felt himself slammed against the door he’d just been trying to get through. The priest had expected the demon to tear him apart, but he was still standing, and the demon was gone.</p><p>Guess again.</p><p>It was his own thought in his own mental voice but sounded suspiciously like something the demon would say. Hadrian looked down at his hands and could see his human hands, but also the coal black hands with dark gray claws. Both seemed merged into one being, one laid on top of the other like a holographic image.</p><p>For a moment, Father Hadrian feared possession and wondered why the exorcism ritual had no effect. Then he almost seemed to feel a sarcastic eye-roll inside himself.</p> <p>I’m YOU. Don’t you get it yet? This is the infection. You’ve been infected, not possessed. This is just how a human mind processes the change.</p><p>Then, something turned over and clicked, and new information was suddenly available to him.</p><p>Vampires can’t be in the sunlight. Regular glass needs to be blacked out, but a dark hole or windowless room is preferable during the day. Stakes kill. Holy water and crosses are problematic but not fatal. Garlic: myth. Mirrors: reflection, yes, but you want to avoid them; it shows the demon, too.</p><p>Vampire fact after vampire fact filled his head, until, exhausted from the overload, he curled into the fetal position on the floor and closed his eyes, shutting out the vision of the doors and the yellow light.</p><p>One more night before Hadrian rises.</p><p>Angeline had been careful to avoid drunks and druggies while feeding. It was important she keep her wits about her if she was to find a good first meal for her mate. She felt the warmth still in her cheeks from her last meal as she wandered the Strip.</p><p>She’d considered a few showgirls. With her dark one’s recent religious repression, a showgirl might please him very much. Then her jealousy had won out. No, she couldn’t be that generous. Besides, she had her heart set on a witch, but how would she find one?</p><p>It wasn’t as if witches were listed in the yellow pages. The closest thing to a witch that one could easily find in Las Vegas was a fortune teller. Many of them were fakes, but some truly had the gift and other gifts as well. It was the kind of power she wanted to give Hadrian to make sure he started out strong. She wanted him in her power, of course, but she hadn’t created a minion or a servant. She’d made someone to love.</p><p>Angeline looked up. Madame Tam’s Fortunes flashed in neon pink, giving off a humming noise like the light was about to go. She pushed a blue-beaded curtain aside and moved into the warmth of the little shop.</p><p>A raven gave her a dirty, beady-eyed look and began to get upset from inside his cage. A familiar perhaps? Surely a therian wouldn’t allow himself to be kept in a cage, unless it was for show and he could really come and go as he pleased.</p><p>As if on cue, the bird unlatched the door and flew out, landing on top of Angeline’s head, making clicking sounds and a deep, throaty rattle. Whether a shapeshifter with a human form or just a common bird, the thing gave her the creeps.</p><p>“Get off!” Angeline said, trying to knock the bird off her head.</p><p>Another beaded curtain in the back parted, and a young blonde woman walked in. “Henry, enough! That’s not how we treat patrons, here.”</p><p>The bird swooped back to the top of the cage where he perched, giving Angeline the evil eye and raising a fuss and squawking angrily before settling.</p><p>“I’m sorry about him. He can be a very trying bird, I’m afraid. I’m Tamara.” The woman held out a bejeweled hand. There was a ring on every finger. When Angeline took it, Madame Tam flinched visibly, then tried to cover her reaction. A look passed between the raven and the woman—some type of private conversation, perhaps?</p><p>“Would you like your fortune told?”</p><p>Angeline nodded, absently. She tried to get inside the other woman’s mind, but a solid shield was in place. This one had power—quite a lot of it. Maybe she was playing with fire. As old as Angeline was, she wasn’t completely sure she could enthrall the girl, though the blonde couldn’t be older than twenty-two. How much power could such a young thing have? Angeline just hadn’t been in the company of a witch in a while, that was all.</p><p>“Well, then won’t you have a seat?” Madame Tam gestured to a large, high-backed chair. The chair was an awful lime green with the stuffing coming out of it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Angeline settled herself in the offered seat. The table between them was a round glass-topped table with cream, antique lace fabric and a gleaming crystal ball.</p><p>“I can scry, read your palm... or I could do your cards.” Tam was draped in multi-colored shawls that covered a much simpler white dress. Without the accessories, the simple shift would no doubt make her look like some sort of medieval peasant. Once Angeline had her enthralled, she’d get rid of the shawls and jewelry and have her scrub her face clean of cosmetics.</p><p>“Cards would be fine,” Angeline said, becoming increasingly unnerved by the woman.</p><p>“Good choice. It’s what I’m best at.”</p> <p>The vampire watched as the girl sat across from her and retrieved a small, wooden box from a shelf behind her. The box had esoteric carvings on it, and Angeline could feel the power coming off it. She watched the woman, noting her delicate, elfin features. She was far too pretty, and Angeline was glad Hadrian, being new, would lose control and kill her. The last thing she wanted was to compete with a pet for attention.</p><p>Tamara looked at her for a moment, and Angeline forced a sweet and unassuming smile to her lips. The raven started making the creepy gurgling sound again in the back of his throat. Fucking birds.</p><p>The crystal ball was carefully placed on the shelf, and the box with the cards inside were put in its place. The cards were wrapped in red silk and seemed quite old. “I’ve had these since time began, it seems,” the woman said.</p><p>“You’re little more than a child,” the vampire replied.</p><p>A knowing grin teased the corners of the woman’s mouth as she unwrapped and shuffled the deck. “Here. Cut them any way you like, then hand them back.”</p> <p>Angeline took the deck, made a few cuts in it, then passed the cards back to the fortune teller.</p><p>Tam laid them in a pattern on the table face down, then one by one flipped them up. In the center of the spread was a card with a skeleton on it that said “death” across the bottom.</p><p>The women’s eyes met, and Angeline tried to keep the guilt off her face. Wasn’t the reading supposed to be about her? There was no way the witch could know what she had planned.</p><p>“Don’t worry. The death card almost never means death. It’s more a card about change, usually.”</p><p>The dread bird started making a fuss on top of his cage again.</p><p>“Henry, I said that was enough.”</p> <p>What will she do if I can’t enthrall her? It had been awhile since Angeline had faced off with a witch, back around the turn of the century. She’d barely escaped alive. Her hair had been singed by one of those electric purple fireballs some of them could conjure.</p><p>So start with something small, something you can back out of if she’s onto you.</p><p>The vampire took a deep breath. “Maybe I would be more comfortable having my palm read, instead.” She held her hand out, hoping the woman would take the bait. If they were touching and she could establish eye contact, she’d stand the best chance.</p><p>Tamara looked down at the cards, divining their meaning, no doubt unmasking her for what she was, then she looked up. “All right. If that’s what you prefer.” She gathered the cards, wrapped them in the silk, then placed them back inside the box.</p><p>Angeline extended her hand, and Tam took it, skin pressing against skin.</p><p>“You have an unusually long lifeline,” Tam said. She looked up, smiling. “See? Maybe you shouldn’t have worried so much about that card.”</p><p>Angeline stared deeply into her eyes. “You should put the bird away in his cage. It makes me nervous.”</p><p>The woman’s nose crinkled slightly, her eyes drawn in confusion and Angeline thought she was caught, but then the woman’s face seemed to blank out, her eyes staring but not really seeing anything. “Yes. I should put the bird away in his cage.”</p> <p>The raven squawked and flew around the room.</p><p>“Henry! Get in the cage.”</p><p>An argumentative squawk. Then she spoke something to the bird in a language Angeline didn’t understand, perhaps a spell, because the bird looked irritated, but then finally went inside and settled on his perch. Tam covered the cage with a dark blue piece of fabric, then turned back to Angeline looking blank as ever.</p><p>“You’re going to come with me now.” Angeline held out her hand, and the girl took it and followed her out of the shop, the perfect, pliant doll.</p><p>Hadrian’s eyes snapped open to darkness. A shroud or blanket wrapped around him—and the rich scent of damp earth. Suffocating. I’m suffocating. He let out a howl as he struggled in the shroud. Then he remembered: he didn’t have a true need for air. Something different animated him now.</p><p>Relax. Everything is fine.</p><p>His soul hadn’t been able to move on. It had been trapped, waiting to reanimate his body, waiting for his body to be able to house it again. But it wasn’t just his soul. There was something else. A darkness that had tainted him. Demonic instincts and abilities had knit themselves around his soul. And knowledge, so much knowledge.</p><p>He knew that the link between a vampire and his or her creation was based upon a control of the demon side, not the human.</p><p>Father Hadrian hadn’t been sure what would happen if he tried to exorcise a demon while being turned. He wasn’t even sure which demon he’d been trying to exorcise: his own or Angeline’s. He didn’t know if the way his human soul and demon soul had merged and blended were the normal way of things, or if his ritual had somehow caused it. He suspected the latter.</p><p>He felt like one whole thing. Not evil, not good, but something that could go either way at any time. He’d been... awakened, like he could see reality for the first time. Good and evil were passing shadows in the face of the greater whole. He just hoped his chanting had done what he’d believed it would. It wasn’t the standard use of the exorcism ritual, but the spirit of his intention had been the same—to gain power to protect himself from a demon.</p><p>Angeline was getting impatient up on the surface. He could feel it. Her blood was now part of him, but he didn’t have the mindless compulsion he knew he was supposed to feel toward her. So far, so good.</p><p>Hadrian ripped through the fabric wrapped around him, and tunneled up through the dirt with a strength and fluidity that surprised him. When he broke the surface of the ground, and fresh, clean air filled his lungs, he coughed, overwhelmed by how sharp and loud and crisp everything was. His senses were so heightened, he wanted to go away and be in a plain, quiet room for a few days, just to get his bearings. But he couldn’t afford to do that right now; his freedom was on the line.</p><p>He looked down to find Angeline had redressed him in his clerics, and he couldn’t decide how he felt about that. Was she mocking him? Why would she dress him back in this? To rub in his face what she’d so callously taken from him?</p><p>What’s that smell? It was like the heaven he hadn’t been allowed into, a smell as pure and clean as the light he’d spent three days in. He was crushed suddenly by that thought. The light had been even more brilliant than the sun; it had teased him with something he couldn’t have. Darkness had become his companion instead.</p><p>If this works, you can make a choice. You can go back there. He was unsure if the mental voice was his human side or his demon side. Infection or no, it had called forth something unique. The demon may also be him, but it was a new addition to who he was. At least that was what he wanted to believe.</p><p>His eyes darted to the source of the delicious smell. His nostrils flared when he saw an attractive blonde woman wearing a simple white dress. She’d been bound and gagged. Strange. He couldn’t read her mind. Shouldn’t he be able to do that? Even without that skill, he sensed she was an innocent, and something in him rebelled against the notion of hurting her.</p><p>“There you are, my dear. I was worried you’d overslept,” Angeline cooed at him. “She’s a witch, so you won’t be able to read her. Some of them are well-shielded from that sort of intrusion. Try not to let it trouble you.”</p><p>Angeline’s voice was like fingernails on a chalkboard. Not nearly the seductive purr that had fooled him before. Her human face wasn’t ugly, but it wasn’t quite the level of perfection he’d seen as a human. It wouldn’t have been enough to cause him to break his vow of chastity.</p><p>As her fangs descended, he could see the demon ripple over her image, not just the small bits he’d seen as a human with glowing eyes and fangs, but the full demon, smiling out at him. A moment later, the ripple was gone and she looked as she had before as her eyes changed back to normal and her fangs went back to their hiding place inside her gums.</p><p>He turned his attention back to the hand-delivered meal. He was like a tiger in a cage being fed a prey animal in an enclosed space. He should feel the thrill of the hunt as he stalked his prey. But this one was already complacent, already enthralled and willing to offer her vein to him. She watched him, without a trace of fear, more curious than anything.</p><p>Before Hadrian could think about what wasn’t lining up here, Angeline’s voice screeched at him again. “Feed,” she ordered.</p><p>Even under normal circumstances as a human, Hadrian hadn’t been the type of man who took orders well. Perhaps it was why he’d courted a position of authority himself. But if his human side didn’t like to be commanded like a misbehaving puppy, his demon side definitely did not. Oh, she did not know the Pandora’s box she’d just opened. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She will rue the day she ever set foot inside my church.</p><p>He was thankful she could only control him—or so she thought—and not read his mind. He appreciated the element of surprise.</p><p>Hadrian moved toward the blonde. She was pretty, with delicate pixie features. Her hair came to just her shoulders, and she appeared wise beyond her years.</p><p>“She’s young, but she feels very powerful to me, for some reason,” he said to no one in particular.</p> <p>Father Hadrian looked skeptically at the woman. There was no fear there, but there also was no anger or duplicity or really anything extreme at all. Maybe hope? Hope for what? It couldn’t be redemption. The puzzle piece that wouldn’t quite line up only a moment before clicked into space. If she were really enthralled, she shouldn’t have any feelings or opinions at all. She should be blank, save for whatever suggestion or desire had been put in her head.</p><p>He allowed his fangs to drop for the girl’s benefit, just so she was clear about which side of the good/evil fence he was technically on now. But nothing changed in her gaze. For some bizarre reason she seemed to want this. He wondered again if she was enthralled.</p><p>“Why is she bound and gagged?”</p><p>“You can never be too careful with witches. This one is strong. I’m surprised she hasn’t broken the thrall. If she does, we wouldn’t want her to have access to her magic. Now feed. You’ll feel better.”</p><p>His back was to Angeline, still trying to figure out his meal. The self-control he’d practiced as a human would become very useful to him, he had no doubt. But right now he had to give the impression Angeline was the one in control, at least until he’d fed and held all the aces.</p> <p>Hadrian picked the girl up, and held her in an embrace as he turned to face the other vampire. No way was he turning his back on that nut for long. He sank his fangs into the girl’s delicate throat and drank. Her whimper caused his grip to tighten involuntarily on her arm. If Angeline hadn’t been standing there, he would have thrown her down on the grass and done more than just drink her blood.</p><p>Nothing tasted this good. Relief was what he tasted as he drank her. This girl had a death wish. In another time and place he would have tried to help her, but that was a different Father Hadrian, this one was happy their desires meshed so well. She wanted to die and he wanted to kill her. She wanted to lose herself in oblivion and he wanted to lose himself in the power of her blood.</p><p>Such power for someone so young. His demon instincts told him it was the kind of strength he should only expect to find in a very old vampire. Not a human. Not even a witch. And certainly not a witch no older than this one. For the second time since all this started, the thought, something is off, drifted through his mind. He only hoped it was off in a way that wouldn’t bite him in the end.</p><p>“Drain the little bitch dry.”</p><p>Jealous?</p><p>Hadrian, licked and sealed the witch’s wound, then spun her to face him. He removed the gag, his mouth capturing hers in a kiss. She was too weak from blood loss to even protest, and he had no interest in doing anything more than screw with his sire for a moment. Let her see how fickle his attentions would be after being brought into this life unwillingly. The little gasp of dismay that came from Angeline served to take the edge off his anger. He went back to feeding.</p> <p>“Drain her, then I’m going to fuck my new plaything.”</p><p>The former priest worked hard to keep the grimace off his face. A normal fledge would have been so under the power of his sire that the idea of sleeping with her would have sounded lovely to him. Either way, she didn’t have to tell Hadrian twice. As curious as he was about the witch in his arms, and as much as he knew the girl probably didn’t deserve a death like this, his survival—and freedom—came first. Where before his mercy had always overridden his pragmatism, now it was the opposite, courtesy of the demon part of him.</p><p>When the last of the life slipped from the girl, Hadrian dropped her on the ground. The power surged through him, and he looked up at his maker and revealed bloody fangs.</p><p>Angeline, misreading the meaning of his smile, returned one of her own. “Come here. I can take my time with you, now.” She crooked a finger at him, somehow adding a little seductive glint to her eyes.</p><p>Hadrian very much doubted she’d ever turned a vampire before. If she had, she might have known that though there was a connection of power between them, it did not flow in the direction she thought it did.</p><p>“No,” he said.</p><p>The vampire’s eyes widened, then her mouth turned down in the pout he’d once thought was incredibly attractive but now could see as nothing more than childish nonsense she should have outgrown long before now.</p><p>“What did you say to me?” she demanded, her voice turning obnoxious and screechy. Without any true power over him, it seemed her only weapon was the tried and true temper tantrum.</p> <p>“I said, NO. Have you never heard that word before? Or was it so long ago you can no longer remember its meaning? You come here.” He pointed at the upturned clumps of dirt in front of him where he intended her to stand.</p><p>Her face went even more white than usual as she found her feet moving against her will to obey his order. “How? This can’t happen. I-I’m your maker. I’m the boss. What I say goes. This isn’t fair!” With each clipped statement from her mouth, her voice became more shrill.</p><p>“Life isn’t fair, sweetheart. The Latin I spoke to you wasn’t sweet nothings. It was the Church’s exorcism ritual. I used it while you were performing your own ritual to bind us together. It reversed which one of us had control over which demon. It was an experiment, I’ll admit. I wasn’t sure it would work, but my intention must have been very strong. It might not have been wise to let someone chant a language you couldn’t decipher while your own magic was going.”</p><p>She was crying now. Crying. What right did she have to cry after what she’d done? She’d desecrated his church, used her dark, vampiric magic against him, and in a sense had raped him. It wasn’t an idea he was comfortable thinking for too long. He’d wanted her, and even without the thrall he may have wanted her still, but his vow had meant something to him, and he’d always respected it. If she’d only been human, he would have turned her down.</p><p>The confidence left her face, her lip visibly trembled, and a surge of excitement went through Hadrian at the feeling of power.</p><p>“Are you scared of me now because you finally have to take responsibility for your actions?”</p><p>Her lip trembled, but her glare came back in full force. “Fuck you. You’re like me. Why can’t you see you’re like me?”</p><p>Hadrian crossed his arms over his chest. This should be good. “In what way am I possibly like you?”</p><p>“You were a priest. I was training to become a nun. I thought you’d understand me. We could be together and... and somebody would understand me... ”</p><p>“Stop.”</p><p>She wanted to keep talking, he could tell, but her mouth shut automatically because of the link between them. If she’d been a prospective nun—a sweet innocent—and had transformed into the manipulative beast in front of him, her sire must have been truly horrible. He’d made her this way.</p><p>Part of Hadrian wanted to keep her with him and fix her. But how did one fix a vampire with centuries of emotional damage and moral decay? Besides, his right and wrong compass was no longer anymore sound. It wasn’t the solid thing that had always pointed him to true north. There was enough darkness that had come to him through her blood that it would be like the blind helping the blind. After all, he’d killed an innocent woman for the sake of pragmatism without much guilt only a few minutes ago. He wasn’t confident in his ability to help someone such as Angeline.</p><p>No, in the morning she would meet her real maker. But that was hours off, still.</p><p>“Pick up the witch and bring her inside,” he said. He couldn’t very well leave a corpse out in the cemetery. Although there was a gate and trees that shielded the place, you never knew who might wander through.</p><p>They could have just dropped the girl in the hole Hadrian had crawled out of and put the dirt on top of her, but he couldn’t bring himself to do it yet.</p><p>“Are you going to hurt me?” Angeline asked as she hefted the witch’s body in her arms.</p><p>“Do you deserve it?”</p><p>“Fuck you.”</p><p>“That’s what I thought.”</p><p>Once they were inside the church, he directed Angeline to lay the witch on the altar. He’d have to do something with her later. For now, he unbound her wrists and smoothed her dress. It wasn’t as if she was going anywhere. He hoped she’d found whatever peace she’d seemed to be looking for, at least.</p><p>Hadrian brushed blonde strands of hair away from the girl’s face and traced the small smile lines around her mouth, then he picked the ropes that had bound the witch and coiled and uncoiled them in his hands.</p><p>“Is this really the life you’ve enjoyed?” he asked his sire.</p><p>“What?”</p><p>He waved an arm around himself at the evidence of her most recent train wreck. “This. Controlling everyone and everything. Having pet zombies. That’s what I was the other night to you. It’s what you are with me right now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Angeline stared at the witch on the altar, looking back every few moments with trepidation at the ropes in Hadrian’s hands. “You’re a vampire, too, now. Don’t act like you’re too good for it. Your line to God has been shut off. You’ll do the same things. You’ll control people. Some day you’ll get lonely and you’ll make a vampire. You’ll want someone you can shape and mold to your liking. You have it in you. I saw it. Why do you think I turned you? I watched you long enough to know.” She sounded desperate with the need for him to hear her, understand her.</p><p>Father Hadrian nodded. “Oh, I believe you. But that doesn’t make it a good way to live. I think the only way I can help you now is to let you go.”</p><p>Her eyes widened at the implication. “No!”</p><p>“Oh. You know the word and its meaning. Excellent. I had thought earlier that maybe no wasn’t a part of your vocabulary.”</p> <p>Tears welled in her eyes again. “You’re a monster. I’m centuries older than you. You can’t keep this hold on me. I will kill you. Do you hear me, you bastard? I will kill you! Whatever magic you did will wear off soon enough. Nothing can break or twist the bond between a sire and her creation, not even your two-bit exorcism ritual.”</p><p>“Be wise, Angeline. Your theories, though quaint, may not play out as you’d like. In which case, you’ll still be at my mercy.”</p><p>The wind seemed to go out of her sails. Hadrian took her by the arm and led her outside to a covered stone porch. There was an old rocking chair he’d enjoyed sitting in to read his Bible. The morning sunlight had always been on his face while he prayed. He gritted his teeth, trying to hold back the anger that he’d never sit in that rocking chair in the bright morning again. Angeline had stolen that from him.</p><p>Was he killing her to release her from her own hell, to protect himself, or out of vengeance? And if he truly believed he was trapped in hell, shouldn’t he greet the morning with her? Without the demon influencing him, he would have met the sun. But the demon’s pragmatism along with his own human curiosity was a damning combination. What would life be like as a vampire? And should he miss the opportunity to find out? The old man’s warning from the in-between place seemed like a distant wisp of a dream now. Hardly worth heeding.</p><p>“Sit,” he said.</p> <p>Angeline collapsed in the chair, and he used the ropes to bind her. He met her eyes, keeping her gaze in his, his hand holding her chin firm. “You will not try to escape. Do you understand?” He wasn’t sure if the force of his power was strong enough to override her survival instinct, but that plus ropes should be enough.</p><p>“This is cruel. Why are you doing this? I’m sorry. Okay? Just let me go and I’ll leave you alone. You can have your freedom. Just let me have mine.”</p><p>“Remember, Angeline, I’ve heard thousands of confessions. I know when one is truly sorry. I’ll be back to talk with you, but first I need to hunt and think.” He went back to the cemetery and retrieved the gag, not that he thought anyone would hear her anyway. After he’d gagged her, he stalked off into the night to explore his new powers.</p><p>An exciting idea was forming, and he was intoxicated with it: now he’d know who was worth saving.</p><p>Angeline blinked back the tears that clouded her vision. Didn’t Father Hadrian know what she’d given him? She’d freed him! She’d made him into a god, young and beautiful and strong for eternity. And this was how he repaid her?</p><p>She’d been foolish for not paying more attention to what he’d been chanting. Although her Latin was weak, at least one of those words should have tipped her off. Exorcizo.</p> <p>She’d been so drunk on his blood, the purity and sweetness of it. Father Hadrian had been a good man. Good like she’d been once—so long ago she could barely remember it. She didn’t know what she’d expected, but him being able to fight back hadn’t been on the list. She hadn’t been able to fight back. It wasn’t fair. Nothing about any of it was fair.</p><p>Surely there was enough good in him left to let her go. But then, if he had goodness in him it would rebel against the darkness in her. Who was she kidding? She was in trouble either way. Deep trouble.</p><p>The vampire who’d turned her had been vicious beyond imagining. His name was Linus, a name of Greek origin which means flax. Not a name that strikes terror—until you meet him.</p><p>Angeline tried to shut out the memory, but it surrounded her, a three-dimensional vision that wouldn’t go away.</p><p>She was sitting in a dank cell that had been built by her sire. They were deep in the bowels of an opera house. Angeline suspected he kept her here so she could hear the voices of angels while she was trapped in hell. Why would God let this happen to her? How could she be abandoned like this to a demon?</p><p>She hadn’t fed in two weeks. She was weak, emaciated, seeing things. Unfortunately what she was seeing in front of her right now, was real. Linus paced outside her cell, lecturing her as if she were a small child in need of basic survival instruction.</p><p>“The next human I give you to feed from, you’ll drain them and you’ll like it. Keep feeling this guilt, my little angel, and see where it gets you.” He stopped and faced her, his expression dark. “Or maybe you do see now. I’ve never encountered a vampire quite like you. I think I should like to start a menagerie with such little oddities. It would entertain me greatly.”</p><p>He’d left her there for an hour, then returned with a formally dressed noblewoman who had come to see the opera. She was shaking, her face streaked with tears. Linus hadn’t bothered to put her under.</p> <p>“Angeline, dear? Pay attention. This is how a real vampire feeds.” The woman struggled in his arms, her screams so loud surely someone would hear.</p><p>But he’d timed the feeding to the climax of the opera when the voices above were far louder than the screams below, drowning out the woman’s cries. He let her body drop when he’d finished feeding. She wasn’t quite gone yet, but she was weak, crying, staring up at Angeline with wide, terrified eyes.</p><p>“P-please,” she said.</p><p>As if Angeline could help. There was nothing she could do, standing inside the makeshift cell, gripping the bars, her knuckles going whiter than normal at the smell of the fresh blood.</p><p>The woman was bleeding to death on the stone ground less than a foot away, her wrist within easy reach. The vampire eased herself down to the ground and pulled the woman’s wrist through the bars, her fangs descending.</p><p>Then the woman was against the opposite wall where she’d been flung, dead.</p><p>“I didn’t say you could eat yet. You can eat when you’re ready to be a proper vampire.” He’d left her there and she’d screamed for hours, but no one ever heard her.</p><p>Angeline shook herself out of the memory, her gaze darting around the dark cemetery as she renewed her struggle. What if Linus was near? What if he found her here somehow before Hadrian returned? He’d take her back.</p><p>She tried to calm herself. The last she’d heard, Linus was on the other side of the Atlantic. He rarely came to the states. He couldn’t know where she was, and he’d left her alone for well over a century when she’d escaped him.</p><p>Although she’d finally broken free of him, there was no saving the woman she’d been. That person was gone. Linus had poisoned her.</p><p>She kept her human half locked away because that part of her couldn’t take all the horror. She’d had to become the horror to survive. If she was the villain, she could never be the victim again. Only, her calculations on that score had been a bit off, because here she was, the victim again.</p><p>I thought I could trust Hadrian. How could he turn on me like this?</p><p>Had she been wrong about him? The many months she’d come to Mass watching him, waiting for those brief moments to feel his hand grasping hers, to talk with him and dream about the day they’d be together. That first night, the drug-induced vision had felt like something real, like a sign that he was hers. How could it have been wrong? The universe had opened to her that night and shown her everything.</p><p>She wondered if she’d approached the priest differently if things would have still gone this way. Maybe if she’d slowly introduced him to what she was—if she’d given him a choice. She hadn’t been given a choice. How could she make the same mistake? If only he hadn’t done that stupid chant, things would be different.</p><p>Angeline was so lost in her pity and self-recriminations that she didn’t hear the small, quiet footsteps until they were in front of her. The first thing she noticed when her vision cleared from the tears were delicate, bare feet.</p><p>She startled as her gaze rose to take in the girl in front of her. She couldn’t have been older than twelve. The vampire licked her lips. It had been awhile since she’d had a good veal. The girl still had the tiniest bit of baby fat around her face. If only Angeline could get the gag out of her mouth and the ropes off.</p><p>She wanted to struggle to escape, but she couldn’t make her body obey. Oh yes. Father Hadrian’s order. Damn him! If not for him—for that voice of his—ropes never could have held her. Had he sent some child out here to taunt her? Was that part of the punishment he was cultivating for her sins? Was it some sort of penance? Whatever happened to the Hail Mary? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Can you kill me?” the little girl said as if she were asking someone to pass the butter.</p><p>Now Angeline knew the priest was messing with her. And with the gag still in her mouth, she couldn’t even yell at the stupid child.</p><p>“Can you?” the child persisted. “Your priest was too young. I knew he was, but figured it was worth a try anyway. If you’re older, maybe it will work this time.”</p><p>Angeline’s eyes widened as she looked more closely at the girl. Blonde, shoulder-length hair, delicate pixie features. The white shift dress she was wearing swallowed her, but would have perfectly fit the adult witch the vampire had brought for Hadrian’s first feeding.</p> <p>But she was dead. Angeline had seen it. She’d heard her heartbeat slow and stop like butterfly wings on their last flap. She’d carried the lifeless body and laid it on the altar.</p><p>“I’d hoped that death card was for me,” Tam said. “It has to be for me.” The girl pulled the gag from Angeline’s mouth and spoke to her as if she were the child. “I want you to try, all right?”</p><p>The vampire looked around. This had to be some kind of trick, a test. If she bit the girl, Hadrian would be upset. Or would he? He’d killed the girl the first time around, after all.</p><p>“What are you?”</p><p>The witch rolled her eyes. “Something far older than you. But I’m so tired and very hard to kill. And I’m tired of running. My power needs to die with me. It can’t get into his hands.”</p> <p>“Hadrian?” Angeline hated when people spoke in riddles.</p><p>The girl laughed. “No, silly. Someone else.” Madame Tam gave her an assessing once-over. “How old are you?”</p><p>Angeline balked at giving the girl her age. It was such a personal question for a vampire, filled with so much nuance. It was so much more than just a number. It was the evidence of how much you’d survived, how much history you’d seen and lived. But she relented, curious over where the witch was going with her line of questioning. “two hundred and twenty.”</p><p>“Hmmm.” She paced a bit, looking lost in thought. It was strange seeing such a grown-up look on such a young girl. “My kind can only be killed, truly killed, by another of our kind, or a very old and very strong being. I know because one of us has been killed that way, by a 3,000-year-old vampire. As you can imagine, those are hard to find, and they tend to be gruesomely creative with the way they kill, something I’m not too keen on. I don’t think you’re nearly old enough, but we can try.”</p><p>The girl sat across Angeline’s lap and pulled her hair back. The vampire was going mad. She had to be. None of this was really happening. It was a dream. Some crazy daymare. Perhaps Hadrian hadn’t woken up yet. Maybe she was still in her resting place below ground, dreaming. It was all too unreal and strange. Although the promise of the girl’s blood was intoxicating, Angeline hoped it was a dream and that she could start this night all over without making the same mistakes. Maybe she’d stake Hadrian before he even arose, just in case the chanting was a genuine threat and not just paranoia.</p><p>The girl cleared her throat. “This is the most formal invitation you’re getting. I know my blood is delicious. I’ve been fed on by vampires a few times before. They went on about me like I was a royal feast or something.”</p> <p>Angeline knew just by the smell of the girl that it was true. She wanted to know more: who the girl was, why she wanted to die so much. “How long have you had this death wish?” she asked instead.</p><p>“Off and on for about a thousand years, more frequently since he’s started hunting more deliberately and the others of my kind have been picked off. If he kills me, he’ll take all my power. He’s a far greater evil than you’ve ever thought about being. I have to break the cycle, and I won’t contribute to the things he wants to do by dying at his hands.”</p><p>“You little... ” Who the hell did this girl think she was? She didn’t know how evil Angeline was or wasn’t.</p><p>The girl tilted her head again, trailing her index finger up and down the column of her throat. “Eat up. From the looks of things, this will be your last meal. At least it’ll be a good one.”</p><p>Well, if the girl wanted to die so very badly, Angeline would oblige her. All the talking in riddles as well as the creepiness of an adult woman dying and then coming back a child all in the same night was enough incentive anyway. Who needed a formal invitation to shut up that nonsense?</p><p>“Untie me,” Angeline said, locking eyes with the girl.</p><p>The little blonde giggled. “Oh, nice try. Remember you’re only two hundred and twenty.”</p><p>Angeline had suspected the witch hadn’t really been enthralled. Now she knew. She growled, but leaned forward, sinking her fangs into the girl’s neck. The angle was awkward. This was no way to enjoy a meal. It was humiliating in the extreme, but she intended to suck every drop out of the child, far past the point of death, so the obnoxious little brat didn’t rise again. She still didn’t know how that worked, nor did she care.</p> <p>She closed her eyes as she fed. The blood was like fine wine, aged to perfection. But it was also the youth and excitement of childhood. It was the best of both worlds, the rarest thing the vampire had ever tasted. If by some miracle, Hadrian let her go, she could see keeping this girl as a blood doll—if she couldn’t permanently kill her, that is. Because she really wanted to kill her.</p><p>The girl’s pulse grew thready and then slowed and stopped. Angeline continued to drink, squeezing every last drop of blood out. The girl was a corpse for the second time that night, still draped across her killer.</p><p>Angeline snarled in frustration, unable to move her. But then she smiled. She’d just fed from the strongest blood she’d ever tasted. Probably not more than Hadrian had consumed, since the smaller, younger body held less blood than her former larger size, but still. She’d had at least as much as he’d had.</p><p>With the magic he’d performed, she knew he would hold power over her in person, but he wasn’t here, now. If she focused all of her energy and will, she might be able to get her arms to obey her will instead of his, so she could free herself from the ropes and escape.</p><p>A long time passed before she got her arm to move a barely perceptible amount against her restraints, but it was at least proof it could be done. This might not be her final night on the earth.</p><p>Hadrian thought taking control of Angeline had been easy enough, but being barely risen, one human, no matter how powerful her blood, just hadn’t been enough. He’d need a few more pints before he was ready to deal with his sire fully. There was still a chance she could break his hold, then he really would be her bitch. He shuddered at the idea.</p><p>The city was noisier than he remembered. With his new senses, voices, thoughts, traffic, heartbeats, the buzzing of the neon signs, everything combined to create a din that stuffed his head and threatened to squeeze his sanity out through his eye sockets. As he paced the streets, trying to find balance, to get his sensibilities under control, he observed as much as he could, using the concentration to maintain his focus on controlling his own mind.</p><p>He remembered what Angeline had said about witches being better shielded. Perhaps the ability to shield one’s mind from a vampire varied from person to person, because some people seemed to throw their thoughts out at him, almost begging him to hear them, while others faded into the background in quiet whispers. Still others required him to focus intently and specifically on them to get direct thoughts. A few were blank slates that he couldn’t read at all.</p><p>The few he wasn’t able to read looked up at him sharply, suspicion in their eyes like they knew he’d tried to penetrate the privacy of their mind. He smiled at one such man apologetically and moved on. There was no telling what he was.</p><p>It wasn’t hard to find sinners in a place like Las Vegas. Hadrian couldn’t move two steps without tripping over one. But he was looking for dinner, too. He didn’t just want to find guilty souls—he wanted pretty ones who smelled nice. He wasn’t about to sink his fangs into a man.</p><p>Perhaps other vampires felt differently, but Hadrian’s previous chastity caused him to see a subtextual sexuality in nearly everything, especially the ritual of feeding. He wanted to gorge on the experience in all its sensual hedonism. There was little time for a tryst tonight, but feeding was like foreplay. Had Angeline brought him a man for dinner, he might have turned his nose up at the meal, not quite prepared to be that adventurous yet.</p><p>He rounded a corner and bumped into a woman leaving a strip club. Her thoughts told him her shift had just ended and she was tired of waiting on the bouncer to escort her to her car.</p><p>She looked up. “Oh, Father Hadrian. Would you mind walking me to my car?” A blush tinged her cheeks at being caught out like this.</p><p>He looked at her a little more closely. “Mary? Is that you?” She hadn’t been to Mass or confession in months.</p><p>“I can’t believe you remember me.”</p><p>An awkwardness descended between them until finally Father Hadrian held his arm out for her to loop her hand through—like a gentleman. His gentlemanly scruples were one thing that had died the night he had, but he hadn’t yet fallen out of practice. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mary started to babble. “I keep meaning to come back to church. They just always have me working all these odd hours, and when I am off, it’s hard to get a sitter for my boy. And it’s just too late at night to bring him to church.”</p><p>“I understand,” he said. As they walked and she chattered on, Hadrian was only half listening to what she was saying. He was more interested in what she wasn’t saying, what she really thought. He was interested in the file after file of information on her true feelings, desires, and intentions hidden inside her mind. He sorted through these files as they walked, gleaning everything he needed or wanted to know. The thing that shined brightest, though, was her love for her son and her need to care for him no matter the personal cost to herself.</p><p>A few doors in Mary’s mind seemed locked to him, perhaps thoughts and feelings even she didn’t have access to, but what he’d seen was more than enough.</p><p>“Thanks for walking me and listening to me chatter. It’s almost like confession except that I’m dressed like I am, and we’re not in church.”</p> <p>“Indeed.”</p><p>When they reached the car, Hadrian lingered, his hand moving to brush her hair away and to touch the soft, vulnerable skin of her throat. He licked his lips.</p><p>She sensed the undercurrents, and her mood shifted to uncomfortable. “W-what are you doing?”</p><p>“Absolving you.” He smirked at how creepy that must sound, what she must think he expected her penance to be out here in this dark and deserted parking lot. But he didn’t let her wonder for long. His fangs descended.</p><p>She opened her mouth to scream but he locked his gaze on hers and said: “Shhhh. I’m not going to hurt you. You’re worth saving, but I want you to change your ways. Understand? No more of this stripping and going home with strange men for extra money. You’re smart. You should have a real job somewhere. Or find a good man at church.”</p> <p>She smiled and nodded.</p><p>“Good girl.” Father Hadrian struck then, his fangs penetrating the column of her throat to get to the warm, rich blood beneath. Honest guilt. Somehow he knew this would be his favorite flavor. As he fed, he drew her guilt and pain out along with her blood. He stopped before her pulse began to slow and sealed the wound.</p><p>“Remember what I told you to do, but forget you saw me tonight.”</p><p>She nodded, glassy-eyed as he helped her get into her car.</p><p>“Drive safely.”</p><p>She seemed lighter and happier as she started the car and drove away.</p> <p>Hadrian felt high, both on the blood and on the power he now possessed, the ability to finally make a difference in lives even if it wasn’t with sunshine and rainbows. A little while later, he came across a con artist in the Bellagio casino. She was a femme fatale type, all black stockings and dark red lips.</p><p>She held a cigarette to her mouth beside the roulette table, and Hadrian slid in, lighter in hand. He’d always kept one in his pocket for lighting candles around the church before Mass started. She smiled indulgently at him, sizing him up as she leaned into the flame. She appeared to like what she saw.</p><p>“So, how’s tricks?” he asked.</p><p>“Pardon me?” She drew her head back as if she’d been slapped. “I’m not a prostitute.”</p><p>“Of course not. That would be somewhat honest work compared to the cons you’ve been pulling.” He’d taken her by the elbow and slowly eased her away from people as he spoke, his tone low.</p><p>“Are you a Fed?” she whispered, looking around to see if anyone was eavesdropping on their conversation.</p><p>He pointed to the Roman collar. “No. I’m a priest. Did the outfit not give me away?” It was clear she’d thought he was dressed like that as part of an undercover operation of some sort.</p><p>She rolled her eyes. “You’ve got to be kidding me.”</p> <p>“Come with me,” he said, unfazed by her tantrum.</p><p>“No. Get your hands off me. If you aren’t a cop I don’t have to talk to you.”</p><p>Hadrian gripped her chin, forcing her eyes to meet his. “Come. With. Me.”</p><p>Her expression was sweet and open. “All right. Whatever you say, Father.”</p><p>Leading her outside, he took an inventory of her mind. Her list of crimes was quite impressive. Small cons, long cons, a couple of jewelry heists and a murder under her belt—someone who had gotten in her way. She didn’t seem to feel guilty for any of it. But he needed to be sure.</p><p>In a deserted alleyway, far away from witnesses, he interrogated her. “If you’d like to confess your sins, I’m open to hearing them.” Even though he already knew. He was careful with his wording to be sure he wasn’t coercing her to do anything she wouldn’t have done anyway.</p><p>Her eyes lit with condescending mirth. “That’s all right, Father. Why don’t you go back to church where it’s safer? This area seems a little dangerous for you.”</p><p>“Does it? Don’t worry about me. I can take care of myself. I’m more concerned about you. I’m only trying to save you. Do you feel bad for any of your crimes?” He was holding her gaze now, peering inside her mind. Whatever she said out loud wasn’t what mattered. It was what was inside that counted. But she didn’t even bother lying.</p><p>“No. Not a bit. I sleep like a baby.”</p><p>“What about the murder?”</p><p>Her eyes widened. “How did you know about that? Who the hell did you say you were?”</p><p>“My name is Father Hadrian,” he said, his face growing more menacing by the minute. “Tell me, do you feel bad about the murder?”</p><p>The woman’s anger was growing, flowing off her like hissing electricity. “The dumb bitch shouldn’t have gotten in my way.”</p><p>“That’s all I needed to hear. I’m afraid you aren’t worth saving.”</p><p>Hadrian let his fangs flash in the lamplight. He didn’t bother adding any suggestions for how she should react to him. He wasn’t seducing her. He was separating the wheat from the chaff, cleaning up the streets. As a human, he never would have played God in this way, but the demon half of him refused to follow such quaint moral rules. After all, those methods hadn’t been nearly as effective as the ones he now employed.</p><p>She started to cry and began to back away from him, her hands held up in the air. Her tone turned placating. “Okay. Okay. I’m sorry. I’ll do better. Will you hear my confession? I promise I’ll change. I’ll come to church every week.”</p><p>“Too late for that now.” Hadrian pulled her toward him and sank his fangs into her throat. She tasted of rage and fear with an added dash of sociopathic spice. A little rich for day-to-day feeding, but not bad for a treat.</p><p>She struggled in his arms, beating uselessly against his chest as he drank in her essence. Eventually the fight went out of her; her breathing became more labored and then stopped, along with her heartbeat. Father Hadrian healed the mark on her throat and let her drop to the ground.</p><p>On his way back to the casino, he enthralled a passing thug with a gun, planting the suggestion that the woman was alive and he should go shoot her. With a bullet hole in her head, no one would think anything else about the issue. He whistled on his way back to church, thinking that man was lucky Hadrian would only feed from women, because the sins pouring off him were monumental. And Hadrian doubted he was any more remorseful.</p><p>Now it was Angeline’s turn.</p><p>Hadrian returned with a spring in his step, his sadness over what he’d lost replaced with excitement over his new mission. But his happiness was cut short when he caught his sire standing in the middle of the church, a guilty and panicked look on her face. He’d been seconds away from losing her.</p><p>He didn’t think, he just commanded. Even a second of contemplation would be enough for her to get away from him. “Stop right there.”</p><p>She’d looked away as if that would stop his order from stealing her will, but it didn’t matter. When she stopped, he knew his power over her still worked. They were linked by blood. He didn’t need eye contact.</p><p>Instinctively he strode toward her, grabbed her wrist, and put it to his mouth. He drank more of her blood to strengthen the connection between them. Whatever had weakened it, he wouldn’t take the chance again.</p><p>He growled as he tasted the new power in her blood. Familiar power. The witch. Was that how she’d broken his hold? But that was impossible. There had been many yards and a solid oak door between the witch’s corpse and where Angeline had been tied up. Something wasn’t right. He’d known that witch was trouble. Maybe Angeline had a taste before he’d risen. That had to be it.</p><p>“Just let me go.” Her voice was weary and defeated, not really believing he would stoop to releasing her. It was simply what she was supposed to say in this situation.</p><p>“You know I can’t do that.” He still wasn’t sure of his motives. Though he drank up his new powers as greedily as the wino had partaken of cheap alcohol, he was still angry at her. He was angry there was so much out there he hadn’t been equipped to fight and angry that becoming a priest and isolating himself from the rest of the world as much as he had still hadn’t worked to protect him from evil.</p><p>The most condemning part was that he wasn’t sure he could just blame the demon for making him as he was. There had been a sharp seed of darkness in him to begin with, something he’d always pushed down, hiding behind holy actions. He’d kept the darkness buried in the crevices of his soul, but the vampiric blood had flipped a switch and activated it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His grip on Angeline’s wrist was punishing, even though such show of force was unnecessary. His mere order for her to stop had been enough. He could feel the fear flowing off her. Whatever she’d done to momentarily gain the upper hand wasn’t going to come to her rescue again, and he could tell she knew it.</p><p>Before he could question her about the witch, a child walked in the back door. She was wearing a simple white dress that was far too big for her. The clothing was spattered with blood. There were fang marks on her throat, but they were disappearing before his eyes.</p><p>How was that possible? What human could self-heal like that?</p><p>“Angeline! What did you do?”</p> <p>She cowered at the anger in his tone. “She begged me. She put her vein right in my face. What was I supposed to do?”</p><p>Hadrian rolled his eyes. If she expected him to believe that...</p><p>“It’s true,” the girl said, sighing. “I hoped it would work this time, but it just started the cycle over again. She’s not strong enough or old enough, either.”</p><p>“You thought what would work? What cycle?” Hadrian said, growing more confused with each nonsensical phrase that passed through the girl’s lips. Something was tickling at the back of his mind, something he didn’t want to admit could be possible. But he knew that golden hair and those features, though they’d been on a grown woman, not a child. Hadn’t they?</p><p>No. He’d been lucid enough when he’d risen. He hadn’t just imagined it was a fully grown woman.</p> <p>“There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy,” she said.</p><p>“Hadrian,” he said dryly. “Father Hadrian to you.”</p><p>“You’re funny. I’m Tamara. I wasn’t able to introduce myself when we first met.” She turned serious. “You plan to kill her don’t you? Your sire?”</p><p>“I plan to set her free, yes,” Hadrian said, still trying to pretend it was just about doing something for Angeline’s greater benefit.</p><p>“And yet, you don’t want the same freedom for yourself? Interesting.”</p><p>Tamara was far too perceptive for her own good. At the moment, Hadrian sought a different type of freedom—one from responsibility and consequences. And the girl knew it.</p> <p>She frowned. “It’s a curse, you know. Immortality isn’t a gift. It’s a curse. Everything changes around you, and you’re trapped. You never get to forget or start over. You lose people... things. It’s all fun and games now, but one night you’ll wake up and realize it isn’t anymore. Just be glad you have an easy way out when you need it. The sun or the pointed end of a stake. I want to be free, and it annoys me that you don’t. You should greet the sun with your sire. It will save you a lot of pain and grief.”</p><p>Tamara began to walk past them, not a trace of fear on her face. When she reached the door, she turned back. She looked down at her hand and a purple ball of light appeared. It crackled, sounding like electricity. It made Father Hadrian jump a little and take a step back.</p><p>The girl met his eyes. “Are we going to have a problem? Will you hunt me? We both know you can’t kill me, but that doesn’t mean you can’t get greedy. You wouldn’t be the first to find out my secret and try to use that to your benefit. Because if you are, I’ll have to kill you now.”</p><p>“I wouldn’t feed off a child,” Hadrian said, increasingly disgusted that Angeline had.</p><p>Tamara laughed. “Oh, you are new to this world. This is just a vessel, part of the loop I’m trapped in. I’m far older and wiser than you. I’m happy to just walk away if I can have your word that you won’t come after me, that you’ll keep this secret. You do still have enough priest in you to honor the sanctity of a secret, don’t you?”</p><p>“Are you doing evil with your powers?” Hadrian asked, unable to let the issue drop.</p><p>“No. But if I don’t find a way out, and he captures me, you’ll see what evil truly is.”</p><p>“If who captures you?”</p> <p>“Another cycler, like me.”</p><p>“How do I know you’re telling the truth?” He didn’t bother asking what a cycler was or how such a creature had come to be. He already knew he didn’t want to get involved.</p><p>She shrugged. “We’re both at a disadvantage here, it seems. We’ll just have to trust each other.”</p><p>“Leave town,” Hadrian said, “and I won’t follow you or tell anyone about you.”</p><p>“Very well. There are too many lights and too much noise in this town, anyway. I thought I could get lost here for awhile.” The purple ball of energy shrunk and then sizzled out into nothing but a small string of smoke that dissipated into the church.</p><p>She opened the door and a raven flew in. The bird squawked angrily as he did a few swooping circles around the sanctuary.</p><p>“Henry! It’s fine. Stop it.” The bird flew to her and perched on the girl’s shoulder, ruffling his feathers and gurgling in his throat—only slightly mollified. “One more thing.” She pointed to Angeline. “You need to kill her. I do know she can’t be trusted. Her word is worthless. If you won’t do it, I will.”</p><p>“I’ll handle it.”</p><p>The girl nodded and left the church, pulling the door shut behind her. Hadrian was curious to know more about the stranger, but she wasn’t his concern. He had bigger business to deal with right now.</p><p>He pushed Angeline back out toward the porch. “Move.” When he’d tied her back up, he pulled a second rocker in front of her and sat, regarding her calmly.</p><p>“Why did you go back inside the church? Why didn’t you just leave through the courtyard when you had the chance?”</p><p>Angeline avoided his eyes. “I went back for my cloak and bag.”</p><p>“I hope it was worth your life.”</p><p>“Hadrian, please, you know me. You can let me go. I won’t bother you. And I won’t bother that girl, either. You’ve made your point. Would you really kill one of your own kind? Humans are food, but I’m like you.”</p><p>He arched a brow. “Father Hadrian. And I haven’t been your kind long enough to feel much loyalty. As for knowing you, you’ve never let me in enough. You’ve just come to Mass, watched me, and flirted. I’ve never known anything of substance about you. I still don’t.”</p><p>“What do you want to know? That I was turned two hundred and twenty years ago by a sadistic psycho named Linus? That I finally got strong enough to escape him after a couple of decades? That anytime I can barely feel his presence, I uproot and move myself? The things in that bag are all I’ve got that can travel with me. I just wanted someone like me. Is that so bad?”</p><p>It was unsettling to watch the vampire cry and mean it.</p><p>Her voice was barely above a whisper when she spoke again. “We could be great together.”</p><p>Hadrian pushed his chair away and stood. He needed to move. He couldn’t stand to sit still absorbing her past traumas like a sponge. He had to remember why he was doing this. “You were going to turn me into your puppet, just like your maker did to you. I don’t know if the power I have over you can be maintained. Either way, I don’t want a constant struggle, nor do I want to be your babysitter. You took my old life from me and gave me this one instead, but I want it to be my life. I’m not your plaything, and I have no need for you to be mine.”</p><p>“I wouldn’t have been just like him.”</p><p>But Father Hadrian heard the change in her voice and knew it was at least a partial lie. “We still have a little time before the sun comes up. I’ll hear your confession if you want to give it to me.”</p><p>“For nearly two-and-a-half centuries of destruction? I can’t even remember most of it.”</p><p>He took her hand in his. “Then I’ll just pray for your soul.”</p><p>Hadrian stayed with her until he could see the pink edges of light as dawn climbed out of the night.</p><p>“I must go inside now,” he said, knowing Tamara was right that he should greet the sun with his sire, but he found himself unable to resist the siren song of power and what this new life could mean for him.</p><p>Angeline gripped his hand harder. “Take me with you. Just think about what you’re doing. You can always kill me later if I can’t change.”</p><p>Hadrian shook his head. “I don’t think so. You’re too dangerous to me. Letting you live another day would be the stupidest thing I could ever do. Plus I promised the girl. This isn’t the end, it’s a new beginning for you. You and I have both seen that room with the doors—all those possibilities are waiting. You can start over in a new human life and not have all of this follow you. Aren’t you a little tired of the life you’ve led?”</p><p>She looked away, a tear sliding down her cheek. “I’m scared. I haven’t died in a really long time.”</p><p>He squeezed her hand. “I know.”</p><p>“You could have been a great vampire,” she said, “but you had to go and turn out to be good.” She injected extra disgust into the word good as if even the smallest measure of moral fortitude was no better than a rash.</p><p>“Who says I’m good? Goodbye Angeline. May God have mercy on your soul.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>Hadrian moved inside and latched the door shut. On his way to his chambers, he spotted the cloak and bag the vampire had come back for. Curious, he crossed the creaking hardwood floors and untied the ropes on the black velvet handbag. There were only two things inside: a folded up piece of parchment with a hand-drawing of the virgin mother, and what must have been a centuries-old rosary. He wasn’t sure when she’d gotten or made the drawing, but he had no doubt the rosary had been hers when she was still human.</p><p>His gaze went back to the door with Angeline on the other side. He took a step toward it, having second thoughts, but then he stopped himself. It was a better life for her if she could start over and bury all this. He put the parchment and rosary back inside the bag, closed it up, and took it and the cloak back to his chambers. The last thing he heard before he fell dead for the day were the screams of his maker. </p>  </body></html>"]