["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>2258 C.E. Larsson blinked at the message on his computer screen a few times before the growl rumbled low in his throat, trying to rip its way free. His cousin Blayde, sitting next to him on the command deck, looked up, a little startled by the sound.</p><p>“Lars? Is everything okay?” “That no good, cat bastard. That motherfucking son of a bitch.” Larsson raised his gaze and glared over at Blayde.“He put out a bounty on me. On me!”</p><p>A little frown settled between Blayde’s eyes. “Someone put a bounty on you?”</p> <p>“Not someone! That asshole cat fucker!I’ll kill him this time, I swear to the gods.”</p><p>As Blayde leaned over to look at Larsson’s screen, Larsson started cursing again. Larsson may have been angrier and more outraged a time or two in his life, but just now he couldn’t remember when. He looked back down at the screen Blayde was looking at. On the screen was a picture of Larsson, grinning up at the camera. The picture looked like it came originally from a group shot, because apart of a guy’s head had been cut off next to him, and Larsson’s head had been carefully cut away from the others. Larsson thought he recognized the shot as the one from his graduating class at the Academy.</p><p>Beneath the enlarged picture was a one, with a long string of zeroes following it, and the words Wanted—Larsson Balenescu written beneath in bold letters. A warning appeared written in red under the heading.</p><p>Subject should be considered armed, dangerous and volatile. Use extreme caution in his apprehension. A strong cage is recommended, since the bounty is a Lycan shifter. Notify Tarr Bonnet for immediate pickup when apprehended.</p><p>Tarr Bonnet —the Tygerian outlaw who had been the bane of his existence since the moment they met, the most irritating, exasperating, maddening man it had ever been his misfortune to meet. The fact that he was also the sexiest just made his existence even more annoying.</p> <p>Blayde whistled low under his breath. “Tarr Bonnet? Look at the reward he’s offering. And in diamond standards too.”</p><p>“Yeah, thanks, Blayde, I see that. Whose side are you on anyway? This will bring out every fool bounty hunter in the galaxies looking for me. You realize that, right?”</p><p>Blayde shook his head.“Yes, it will. I’m even considering it myself. I think I have a goodsized cage around here somewhere.”</p><p>Larsson snarled at him, his incisors dropping down from his gums so fast they scratched his bottom lip. Blayde held out his hands in front of him.“Kidding! Damn, Lars, Tarr’s right about one thing.You are volatile.”</p><p>“He’s not right! There’s nothing right about that man. He’s insufferable, arrogant, conceited... I knew from the first moment I saw him he was trouble! I should have taken off running then.”</p><p>Blayde smiled sadly and put a comforting hand on his shoulder.“Except that you couldn’t. Because he’s also your mate, and believe me, I know how that is.”</p> <p>Larsson shot him a furious, disgusted glance.“You have no idea how it is. The gods gave you a beautiful little human—look what they saw fit to give me.”</p><p>Nodding, Blayde pulled his hand away and looked back down at his own screen. They were about to enter a wormhole in a few minutes, and navigating into it would require his close attention for a while. Larsson kept quiet beside him, still brooding over the bounty Tarr had put on his head. It was a good thing Blayde was piloting this trip—Larsson was way too furious and upset to navigate the tricky maneuvers it would take to launch into a wormhole.</p><p>Wormholes were space anomalies that were like rifts in space, connecting two separate locations. The particular wormhole they were about to travel through would propel them away from the Milky Way and into intergalactic space. Unlike stargates, the wormholes weren’t permanent. Their connections lasted only for a short time, usually sixteen to forty-eight hours, and they collapsed if too much mass passed through them. The transport they were traveling in was small and fast, though it still took almost a full day of travel time.</p><p>Once they passed through the wormhole, they’d be back in their own galaxy and on their way home to Lycanus 3.They’d been gone for over three weeks on this trip, delivering a prisoner to the authorities on Earth. Blayde had been bitching almost constantly the past few days, saying that he needed to get back home to ‘check on things.’</p><p>Larsson knew what he really wanted to check on—his mate, Ryan. Ryan had decided not to accompany him on this trip to Earth, because it brought up bad memories of the last time he’d been there, when Ryan and Nikolai were almost killed. Earth was, of course, Ryan’s home planet, and eventually he wanted to go home for a visit, but for now, he preferred to stay back on Lycanus 3 until Blayde returned.</p><p>Since Blayde pretty much denied his mate nothing, he’d agreed to let Ryan stay behind, even though it was literally painful for him to be away from his mate so long. Larsson was feeling the effects of not being with his own mate, Tarr Bonnet, for the last quarter cycle, even though they had only imprinted on each other and hadn’t yet officially mated. Still, his head ached and it was getting harder and harder to take a deep breath, especially on planets like Earth, where the oxygen levels were not as rich as on Lycanus 3.</p><p>Blayde executed the complicated maneuver that launched them into the wormhole and then sat back in his seat. For the next six to eight hours, there would be nothing much for him to do except monitor things occasionally. The computers had complete control of the ship. Blayde glanced back over at Larsson.</p><p>“Despite what you say, Tarr Bonnet is not exactlysomebody I’d kick out of my bed. You know, before Ryan came along, of course. I value my nuts too much to even think about another man now.”</p> <p>“Tarr’s gorgeous enough—the asshole,” Larssonagreed. “But doesn’t he just know it?” Along with his identical twin, Taz Bonnet, who had recently taken their cousin Kyle as his mate, Larsson grudgingly admitted that Tarr Bonnet was one of the best-looking men he’d ever seen. He was huge, of course—Tygerians stood an average of seven feet tall, and the gods only knew how much they weighed. Tarr was perhaps a few inches over seven feet tall, and built like a god. Larsson felt like a kid when he stood beside him.</p><p>Tarr’s chest and shoulders were broad and muscular, but not in an overly muscle bound way. He was graceful in his movements and he had a deadly charm, when he chose to exert it, that could win anyone over. Except for Larsson—he was far from being won over. He cursed the day their paths had crossed.</p><p>Like all Tygerians, Tarr had the sexy black tiger stripes running just under his golden brown skin, like some exotic full body tattoo. His hair was long and curly and a shade somewhere between red and gold. His eyes, like manyof his people’s, were catlike, slanted and a rich shade of emerald green. Oh, he was good-looking all right, sinfully so, and he knew how to use his looks to get most anything he wanted.</p><p>From the first moment Larsson had seen him, he’d fallen completely, irrevocably and resentfully in love with him. Now all Larsson had to do was find a way to hide it from the bastard, so he wouldn’t gleefully and with malice aforethought, break his heart into a thousand pieces. Their relationship had been contentious right from the start. Larssondidn’t want to be mated to a Tygerian, especially one like Tarr, who had a huge bounty on his head from trafficking in love slaves.He didn’t want to be mated to anybody, damn it.He’d seen how the mating curse on their family had affected his brother and his cousins. He had no wish to join their ranks. Really, he only wanted to be left alone.</p><p>Admittedly, the bounty on Tarr’s head was only from the Alliance of Planets. The Tygerians refused to accept their authority and always had. The troublesome thing for Larsson was that he suspected Tarr was an outlaw every bit as ruthless and out of control as his own grandfather had been.</p><p>Old Gunnar Balenescu had been a voyager, like Larsson. He had traveled across the galaxies transporting their planet’s primary export—bauxite. Bauxite was still used in the making of aluminum, and in the manufacture of the transports like the one Larsson and Blayde were on now. The mines on Lycanus 3 had become as valuable as the diamond mines on Tygeria. Gunnar had been one of these early voyagers, ferrying any kind of bauxite, as well as other cargo, including human slaves, to various destinations in the galaxy.</p><p>He had kidnapped his own lover to use as a love slave, a human from one of the moons of Jupiter. The man, Ivan, turned out to be a handsome young warlock. Eventually, Ivan had been cajoled and seduced into staying with Gunnar, even though the authorities had caught up with Gunnar and would have released Ivan and taken him back to his home.</p><p>Ivan refused, preferring to stay with his Lycan, but he cursed allGunnar’s offspring to fall madly in love with their mates, and be forever bound to them, unable to leave them for more than a few days at a time. This was probably a result of Ivan being left alone so often while Gunnar caroused his way around the galaxies. The story was passed along to the Balenescu cousins when they were children, and they all scoffed and thought it was only legend.It didn’t take long to find out it was all too painfully true.</p><p>Larsson dry-washed his face with his hands and stood up.“I’m going below to get a couple hours sleep.If you need me, just call.”</p><p>Blayde waved him away, already deeply engrossed in a compnet card game that looked way too intricate for Larsson to even think about as tired as he was. Larsson went down to his room, briefly considering getting something to eat before he lay down, but deciding he was too tired to eat at the moment. Promising his stomach a substantial meal after he slept, he crawled into his rack and stretched out on his back. He was asleep in minutes, dreaming about Tarr.</p><p>In his dream, Tarr climbed onto the rack behind him, turning on his side and wrapping a big, warm arm around Larsson’s waist. That settled it—this had to be a dream or their combined weight would have brought the rack crashing to the floor. Since it was only make-believe that his mind had conjured up, Larsson sighed and settled back into him, loving the feel ofTarr’s hard body against his.</p><p>“Why don’t you just surrender to me, sweetheart?” Tarr whispered wickedly in his ear. “You know you want to.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And become your concubine? Your nobyo?” He shook his head sleepily.“That may be okay for Kyle, but it would never work for me. I’d hate it and probably strangle you in your sleep.”</p><p>A nobyo was the term Tygerians used for their submissive love slaves. They were cherished and pampered and deeply loved, but expected to obey their mates without question. In addition, the nobyos raised the sons the Tygerians had with their females. Hundreds of cycles before, overpopulation had taken its toll on Tygeria, and in an effort to prevent it, males and females were separated into different quadrants on the planet, only mating through artificial insemination to have one or, at most, two children. To take care of their sexual needs, both males and females bought love slaves, always the same sex as their own to prevent unwanted pregnancies. They took these love slaves from all over the universe, with humans being the most popular.</p><p>His cousin Kyle had been kidnapped to be a slave by none other than Tarr Bonnet himself, almost a cycle before to be the nobyo of his twin brother Taz. Since Taz turned out to be Kyle’s mate—an extraordinary coincidence until you considered the true intricacy and evilness of the curse—he’d learned to live with it, and even acknowledge Taz as the more dominant mate. That was something Larssonknew he’d never be able to do, no matter how much he loved Tarr.</p> <p>The dream Tarr chuckled, and Larsson could feel the rumble in his chest vibrating on his back.“Are you sure about that? Surrender all that stubborn control and give yourself to me,” the dream Tarr murmured, burying his face in the side of Larsson’s neck. And shit, was that his tongue snaking its way into his ear? Larsson sighed and gave himself up to the pleasure, sinking deeper into sleep as Tarr rolled him on his back and licked and nibbled his way downward.</p><p>Tarr Bonnet smiled as he read the message from his crew, who were waiting just outside the exosphere of Lycanus 3 for the arrival of the transport carrying Larsson and his cousin, Blayde. Their computers had alerted them to the passage of Larsson’s ship through the wormhole that would soon empty into intergalactic space nearby. It would only be a short wait then until the Lycan ship made it into the exosphere of the planet, and his men would then latch onto the ship before any alarm they raised could summon them helpfrom their planet’s surface.</p><p>Tarr planned on letting Blayde go as soon as his men had secured his nobyo, Larsson. He had no wish to incur the wrath of the Balenescus again, and he hoped that his assurances of Larsson’s well-being would be enough to hold them off this time. They knew that Larsson considered Tarr to be his mate—perhaps this time they would back off and let them settle their differences. He just knew he’d be able to seduce Larsson if given the chance. Perhaps he would even take him as his nobyo. Hells, who was he kidding? His greatest desire was to have Larrson for his own.</p><p>His own nobyo—funny to think of the beautiful, prickly Lycan that way. The word stirred a fiercepossessiveness deep inside him, like nothing he’d ever felt before. He’d sensed right from the start that Larsson hated his attraction to Tarr, and would fight it every step of the way. His mind drifted back to the first time he’d ever seen him.</p><p>The Lycans had surprised him quite literally with his pants down. He’d been in the bar he owned in Leeria, minding his own business and fucking a handsome little Leerian bartender he’d only just hired the day before. When the door to his room burst open, the Leerian had been allowed to scamper away, but four big Lycans had crowded into the room, moving with preternaturally fast speed. They had fallen on him and stuck him with a hypodermic needle before he could summon up the adrenaline to shift into his tiger. As the drug crashed instantly and thoroughly through his system, he knew with sickeningcertainty that they’d given him a drug perfected on Lycanus to prevent him from completing his shift.</p> <p>The Lycans were an integral part of the Alliance of Planets, at war with Tygeria for over a hundred cycles. Because of their large size and fierce reputations, Lycanus had been designated as the prison planet for Tygerians. The guards at the prisoner of war camps there had complained so bitterly about the difficulty of keeping the Tygerians contained that the scientists of the Alliance had come up with this powerful drug that kept them in their humanoid forms, the drug working somehow to prevent them from having enough adrenaline to effect the change. When he woke up after the attack in his bar, Tarr was lying naked, in a large cage, on his way to Lycanus 3.</p><p>He knew why, of course. He was to be used as a bargaining tool to get what the Lycans wanted.He should have known they’d want revenge for the kidnapping of their relative. He’d taken the handsome young Lycan as a birthday present for his twin brother, Taz. Taz had told him some time before to find him a handsome nobyo, suitable to help him raise his new baby. His wife was expecting the child in only a quarter cycle,and he’d need time to train his new boy.</p><p>When Tarr had first seen the handsome, strong young Lycan, he’d been very attracted to him. Lycans had always held afascination for him. He’d never really liked the idea of human nobyos—oh, they were beautiful, true enough, but represented no real challenge. It didn’t take a lot of skill and finesse to bend a man to your will when you were twice his weight and so much taller. But a Lycan—now there was a challenge.</p><p>Lycans had a reputation as being fierce and wild. They were almost as large as a Tygerian and they could shift into a kind of man-wolf beast, complete with vicious claws and teeth. If you could manage to bend such a one as this to your will, then you could call yourself a real Tygerian warrior. And if you were lucky enough to find yourself an alpha....then the games could begin.</p><p>When he’d seen Kyle Balenescu then, he’d known right away he was perfect for his brother, Taz. He should have taken his crazy family, however, a bit more seriously.That’s what had put him in the mess he was in, and as he sat in the stiflingly hot cell, he regretted his impulsiveness.</p><p>Over the next few days, Tarr had been kept mostly unconscious, waking only briefly to find food and water inside his cage.They must have drugged that too, because once he’d drunk the water and eaten ravenously, he’d fallen back asleep again. He knew he shouldn’t eat any more, but he had no idea how long they’d keep him in this cage—he could tell he was still in space— and he had to keep himself hydrated.</p> <p>The last time he ’d awakened from his drug-induced slumber, he’d been removed from the cage and was instead chained naked to a wall in a small cell with bars surrounding it on three sides. Behind his back was what looked like a thick stone wall. There was one tiny window up near the ceiling, covered by bars to let in light and also a great deal of heat. From the nearroasting temperature in his cell, he figured out what some part of his mind had been suspecting during his brief moments of consciousness—he had been taken to the barren, desert-like planet of Lycanus 3, a captive of the Balenescus.</p><p>He wondered just what they had in mind for him. If it had been mere revenge, he’d already be dead. No, they must want him as a hostage—maybe a trade for their relative. Smart.He didn’t know why he didn’t think they’d do this and be on his guard against it. Maybe because he didn’t think Lycans were all that intelligent. Now he was trussed up here in their cell and was pretty well disgusted with himself for underestimating them.</p><p>Tarr’s head ached— probably an after-effect of the drugs—and he had a raging thirst. He closed his eyes, only opening them the merest slit when he heard the door to the cell room open. His first sight of Larsson was his boots. A dusty, well-worn brown, they came right up to the cell door and stopped abruptly. Tarr heard a sudden, sharp intake of breath and raised his head curiously.</p><p>Gods, the Lycan standing at the door of his cell, his hand gripping the bars so hard his knuckles were white, was the most gorgeous thing Tarr had seen in a long time. He was probably only about six-feet-four or so, almost a foot shorter than Tarr, but his body was well-built, lean and nicely muscled.</p><p>It was his face that was most striking, though. He was young, probably only about twentyone or two cycles, with the smooth, dewy complexion that only very young men had. He had a straight little nose, high cheekbones and full, luscious lips, and his eyes were the same deep red as all the Lycans, a shade almost like old blood. He made it look good, though. His mouth was hanging open a little in surprise, and Tarr wondered if the others had forgotten to tell him there was a Tygerian prisoner in here.</p><p>That couldn’t have been right either, because he was holding a bowl of some kind of food. Tarr could see the steam rising off it, and he had a bottle of water tucked under his arm.</p><p>The silence went on and began to be uncomfortable. Besides, Tarr wanted that water badly. He cleared his throat and spoke.“If that’s for me, I wish you’d give it to me.”</p><p>The young man, who must have been a Balenescu—he had the look of them, though Tarr was sure he’d never seen this one before—just kept staring at him. He looked surprised, and Tarr began to get a little angry.</p> <p>“What’s the matter? Haven’t you ever seen a Tygerian before? I’d change into my tiger for you and give you a little show, but you bastards have given me too manyof your damn drugs.”</p><p>Finally, the young Lycan seemed to shake himself out of it. He opened the door of the cell, still without saying anything, and brought the food and water over to where Tarr was chained to the wall. One big chain wrapped around Tarr’s waist, giving him enough leeway that he could make it—barely—to a waste bucket in the corner. In addition, his hands were chained in front of him, connected to another chain around his waist. There was just enough length to allow him to bring his hands near his mouth to eat. He had to pour the water into his bowl and lap at it like an animal, however, an oversight that he was sure was not an accident.</p><p>The Lycan placed the bowl of food and the water bottle within his reach and backed away, still staring at him. His body posture radiated extreme discomfort, and Tarr was curious about him. He seemed almost shy, and Tarr found it rather endearing.Shyness didn’t exist with his people, and he didn’t totally understand it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Cat got your tongue?” he said, and then smiled rakishly. “Or is that just wishful thinking on my part?”</p><p>“I-I, uh, brought your supper.”</p><p>“Yes, I see that,” Tarr said with an amused glance. He looked the young Lycan up and down again. Really quite good-looking. He actually got a little twinge just looking at him, and his dick swelled a bit. Almost like—but no, that wasn’t possible. Tarr remembered his brother’s almost instant reaction to the nobyohe’d brought him, this man’s cousin he supposed. Tarr had taken to the Lycan immediately, like he’d been his true mate, but that was just a fairy tale, surely. There was no such thing as a true mate, one person who could fulfill you like no other.He’d heard of other species, including these Lycans, who felt they had a fated mate, but he’d always considered that to be just mindless drivel. One good-looking, warm body was just like any other, surely.</p> <p>“Okay, so...if you need anything else, just um...I-I’ll be in the next room, so you know...I can hear you if you call.”</p><p>“I don’t remember you from before,” Tarr said, ignoring the Lycan’s stammering.“You weren’t with the ones who kidnapped me, were you?Who are you?”</p><p>The young man opened and closed his mouth, then closed his eyes and seemed to be trying to steady himself.Something was wrong, but Tarr couldn’t figure out what it was. He tried again.</p><p>“I said, who are you?”</p><p>“I’m LarssonBalenescu,” he said, straightening his shoulders and trying to glare down at Tarr, though it wasn’t a hundred percent successful. “And to answer your questions, no, you haven’t seen me before. I only arrived back on Lycanus 3 this morning. And youweren’t kidnapped. You were taken into lawful custody. You have a bounty on your head.”</p> <p>Tarr snorted.“Lawful custody? According to whose laws?The Alliance?” His tone turned scornful.“Tygeria doesn’t recognize that entity as having any authority at all and certainly none over Tygerian nationals.Fuck the Alliance.”</p><p>The young man—Larssonhe’d said—drew himself up and glared at him again.“Tygeria is a lawless planet—a cesspool of thugs and thieves.One day they’ll be brought to heel by the Alliance, and made to follow intergalactic law or face the consequences.”</p><p>Tarr made another rude noise.“One day, huh?And just who is this that’s going to ‘bring us to heel’? The Alliance? Ha!They’ve been trying for over a hundred cycles, and they’re no further along than the first day.” Tarr picked up the bowl of food, along with the ceramic spoon, and took it awkwardly up to his mouth. He took a bite, finding it to be some kind of stew with a flavor he didn’t recognize. He made a face, sat the bowl down beside him, and glanced back up at the boy.</p><p>“And for the record, I was kidnapped, no matter how you Balenescus try to spin it.”</p><p>Larsson growled menacingly deep in his throat and took a step closer to him, his fists clenched tightly by his sides. “You dare say that to me? You took my cousin, Kyle, against his will, and gave him to your piece of shit brother like he was an animal!He’s been raped and abused, and we’ll have our revenge! You can count on it.”</p><p>Though his words made Tarr furious, he refused to let him see how much they affected him. He lifted one shoulder negligently.“Your relative was in my bar to relieve me of my own freedom. He got what he deserved.He wasn’t touched by me or my men. As for my brother...” He fixed a savage glare on Larsson. “There was no rape of any kind. My brother took your relative as his nobyo—a great honor for the man, I might add.He hasn’t been abused in any way. If you knew anything about our culture, you’d know that.”</p> <p>Larsson took a few steps toward him, growing careless in his rage.“You’re a liar! We have a vidof him being beaten!”</p><p>Tarr looked startled and then lowered his brow.“Beaten? Then it’s a fake! My brother is too fond of his little nobyo. He would never hurt him or have any reason to abuse him. Everyone knows what sluts the Lycans are.”</p><p>With a loud growl, Larsson rushed him, falling on top of him and putting his hands around Tarr’s throat. Tarr’s hands were cuffed, so he could only push them up to break his hold, but before he could something very strange happened.</p><p>The second Larsson touched him, he let out a huge gasp and released all the tension from his hands. They moved up from his throat to cup Tarr’s face, and Larsson lowered his mouth to take Tarr’s in a fierce, possessive kiss that made Tarr’s hands drop uselessly back to his lap. Larsson thrust his tongue inside Tarr’s mouth and ravaged it with his own before pulling back and looking down at Tarr in a daze. By this time, he was practically straddling Tarr, sitting on his lap. The Lycan’s eyes were unfocused and the pupils were huge. Before Tarr could move or say a word, Larsson’s eyes rolled up in his head and he collapsed on top of Tarr, burying his face in Tarr’s neck.</p><p>Feeling alarmed, Tarr quickly pushed him away to check the pulse in his throat. He seemed to have a strong one, if the solid thumping was any indication. Tarr knew nothing about Lycan physiology, but he was hoping most humanoids were somewhat similar. He was at a loss as to what to do. He thought momentarily of trying to snag the keys, but even if he were able to get to them, he’d still have the chain around his waist to contend with, and the lock was currently digging into his back. Even if he found the right key, he wouldn’t be able to contort his body enough to unlock the chain.</p><p>Larsson gave a little sigh just then that Tarr found adorable, and he gazed down at him. This close, the young man’s long eyelashes smudged across his cheeks like little fans and his lips puffed out a bit with each breath. Unable to stop himself, Tarr bent to taste those lips. Larsson tasted a little like mints and tea, and his lips were warm and soft and lush. Tarr suddenly was overwhelmed by his nearness and bent to brush his lips over Larsson’s again and again.</p><p>Larsson started to stir and Tarr pulled quickly away, leaning his head back and looking down in amusement at Larsson when his eyes flew open. He straightened up immediately, pulling down his shirt and looking at Tarr in outrage.</p><p>“What-what did you do?” he shouted, scrambling back to his feet.</p> <p>Tarr smiled lazily.“Ididn’t do anything. You, on the other hand, suddenly grabbed me, kissed me on the lips and then fainted dead away.”</p><p>Larsson’s hair was a burnished brown, but his skin was as pale and translucent as a redhead’s, showing every emotion clearly. Color sprang to his cheeks and his eyebrows shot up. “I did not faint!”</p><p>Taz cocked his head. “Pretty sure you did.”</p><p>“Don’t be ridiculous!”</p><p>“It’s all right, baby. It’s not the first time I’ve had such a strong effect on a man—first time anyone ever fainted though.I’m kind of flattered.”</p><p>“I didn’t faint, I tell you! II just...I mean I...oh gods!” He turned on his heel and stormed from the cell, slamming the door behind him, casting back a glare that was so icy it should have frosted up the entire cell. Larsson pointed a finger back in through the bars at him.“I’m warning you.Try something like that again, and you’ll be shipped back to Tygeria in little pieces!”</p><p>Larsson turned and strode angrily from the room, slamming that door behind him too, leaving Tarr alone in the stifling little cell. Tarr picked up the water bottle and poured some in his bowl to take a cool drink. He was beginning to like this Lycanus 3 a bit more. Maybe the next few days wouldn’t be so boring after all.</p><p>The handsome young Lycandidn’t show up again until two days later. Every time the door to the cell room opened, Tarr found himself looking for him, but it was always one of the others. They dealt with him silently, their surly faces showing only their distaste for him, though no one actively abused him in any way. On the second day, the big one they called their leader came in, followed by the handsome Larsson. Larsson stayed outside the cell and refused to make eye contact with him.</p><p>Their so-called alpha came in, though and stared down at him grimly.“We’ve contacted your brother on Tygeria and asked him for an exchange of prisoners.”</p><p>Tarr snorted.“You can forget it. We don’t negotiate, and besides, he’d never give up his own nobyo.It would be unthinkable.”</p><p>“Kyle is not his fucking nobyo.” Clenching his fists, he took an aggressive step toward Tarr. “And you better hope he negotiates, because we told him that soon we’ll start sending little pieces of you back to Tygeria as an incentive.”</p><p>Though he wasn’t focused on Larsson, Tarr was almost sure he saw him visibly flinch at the words.Tarr’s lips twisted into a smirk. “Yeah, I’ve heard that before. Bring it on, dog. My brother is a warrior, like all Tygerians.He won’t be swayed by your stupid threats.”</p><p>The big alpha gave him a feral smile, pulling a huge knife from a scabbard on his side.“Oh, it’s not just an idle threat.I’ll take great pleasure in carving you up myself. We can start right now.”</p><p>“No!” Tarr and the alpha both looked in surprise toward Larsson. The word had been spoken in a loud, harsh growl, and the younger Lycan almost leaped forward to stand between Tarr and his alpha.“Don’t touch him!”</p><p>The words were garbled and barely comprehensible because Larsson’s face was already partially transformed into his wolf. The lower half of his face was pushing out with a popping and cracking of the bones, and extra teeth were sprouting from his gums. Thick hair sprang up from his skin and sharp claws pushed out of his elongated hands. His body was growing much larger and more muscular right in front of them. Tarr caught only a glimpse of Larsson’s face as he’d leaped forward to take his belligerent stance between him and the Lycan, but what Tarr had seen caused a shiver of alarm to spear down his spine. At the same time he glimpsed a look of horror on the face of his alpha.</p><p>“Larsson!” the big Lycan exclaimed, his eyes huge in his face.“What’s wrong with you?” He took a step toward him, and Larsson backed up to stand directly in front of Tarr, his arms slightly outstretched in an obviously protective stance. He growled again low in his throat and seemed ready to spring on top of the alpha. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Get away from him! Mine!” he snarled through gritted teeth. Larsson had lowered his head and was snarling up at the other man, who suddenly got a strange and slightly horrified expression on his face.</p><p>“Oh gods, Larsson! No! Not Tarr Bonnet!”</p><p>Larssonreplied with a low, sinister growl that made the hairs on the back of Tarr’s neck stand up. The other Lycan must have been affected as well, because he quickly put his knife away, held up both hands in a conciliatory gesture and backed up a few steps.“All right, Larsson. Calm down.I won’t hurt him.”</p> <p>Tarr was still reeling from what just happened, so he kept quiet as the still-transformed Lycan turned back toward him. Tarr looked deeply up into his eyes and saw something in their depths that gave him a twinge of alarm. The Lycan showed him his teeth and looked as though he wanted to devour him.</p><p>“Don’t move,” the alpha said softly. “And don’t stare directly at him—he may take it as a challenge and show even more dominance. Lower your eyesand show him your throat.”</p><p>Tarr bristled and yelled back toward the alpha.“What? And have him tear it out?”</p><p>“He won’t do that. Hehe thinks you’re his mate. He wants your submission. Show him your throat, damn it!”</p><p>With one more grudging glance up at Larsson, Tarr dropped his gaze and tilted his head up and to the side.“Don’t get any ideas, Lycan. I submit to no one,” he muttered. “I’m only doing this because my hands are chained.”</p> <p>Larsson dropped down suddenly beside him, responding to his actions and not his words, he crouched over him and sniffed at him, making a sound deep in his own throat like a soft whine. His long, rough tongue came out and licked Tarr up the side of his neck and nipped his earlobe none too gently. Tarr grimaced as the Lycan whirled back around then to face his alpha.He’d obviously calmed down some, now that he’d seen the other Lycan wasn’t making any more threatening moves toward Tarr, but he was still crouching over him. Larsson’s wolf-like ears fell back along his head and he stared off to the side, though a low growling sound continued in his throat.</p><p>“Now what?” Tarr asked softly, and the alpha shook his head.</p><p>“I’ll step outside so he’ll calm down. Don’t make any sudden moves.”</p><p>“Easy for you to say,” Tarr said softly, his voice strained.“You don’t have a three hundred pound wolf on your lap.”</p><p>The alpha ignored him and backed out the door to the cell. Larsson’s posture changed almost immediately after the door closed behind him. He slumped forward and lowered his head, and Tarr watched in fascination as a transformation came over him. His body shrank down to its normal size, or at least the one he’d had before, and the extra hair and fur seemed to melt away and be reabsorbed into his body as Tarr watched. Larssonremained slumped over Tarr’s legs for a moment longer before he stumbled to his feet and stood looking down at Tarr, his breathing still rapid and irregular. He looked a little dazed and disoriented before he turned and began striding rapidly for the door. Tarr’s voice stopped him with his hand already on the doorknob.</p><p>“What the hells? Don’t think you’re leaving here until you tell me what just happened.”</p> <p>Larsson whirled around to glare at him.“You don’t give the orders here, Tygerian. And what just happened is my problem,and I’ll take care of it.”</p><p>“Really? Just how do you propose to do that? From what I know about Lycans, and I admit it’s not all that much, but you justclaimed me as your mate.” Tarr quirked up an eyebrow at the young Lycan, enjoying the red blush that was lightingup his face. “And Lycans mate for life, as I recall.That does pose some interesting questions, doesn’t it?”</p><p>“Shut up. You may be my mate, butthat doesn’t mean I have to like it or even do anything about it.I can conquer this damn thing, and I’ll find a way!”</p><p>“How? By staying celibate the rest of your very long life? When all you’ll ever want—” He paused, looking down at himself,“—is me.” He grinned broadly.“Come back in here, Lycan, and get me out of these chains.I’ll give you all you want.”</p><p>Larsson made a rude, choking noise,turned on his heel and stormed out the door, Tarr’s soft laughter following him.</p><p>He hadn’t returned until later that evening. Tarr had been dozing, having stretched his chains out far enough to allow him to stretch out his legs in relative comfort. As soon as the sun went down on Lycanus 3, the winds started up, and they had come through his barred window high on the wall and cooled his cell to the point that he was almost shivering. He heard the door open and cast a glance at the door. Larsson stood inside with a blanket in his hands.</p><p>He unlocked the cell and came in, stopping about three feet away and tossing the blanket down beside him.“Here,” he said. “I could see you shivering.” He nodded up at the camera in the corner of the room.“You should have asked for a blanket if you were cold. We’re not cruel—we would have given you one.”</p><p>Tarr picked up the blanket with his cuffed hands and tried to shake it enough to open it up. “Maybe you’re not, but I’m not so sure about the rest of your family.”</p> <p>Larsson made a little sound of impatience, snatched the blanket away and shook out its length. He spread it over Tarr and even tucked it around and under his legs before he started to turn away.Tarr’s voice stopped him.</p><p>“Don’t go. Not just yet. Talk to me for a few minutes.Explain to me why you think I’m your mate.”</p><p>Larsson turned back around and made an impatient move with his hand.“Stop worrying about that.It’s nothing.”</p><p>“Nothing? No one ever called me their mate before.I think it’s...nice.”</p><p>“Nice?” Larsson said, his voice incredulous.“You have no idea what you’re talking about. It’s damn near tearing me apart! How can I be so attracted—and to you, of all people? What I should be doing is choking the damn life out of you, and all I want to do is...”</p><p>He fell down beside Tarr, who had raised his head to look at him. Tearing the blanket away from his body, Larsson shoved Tarr against the wall and his gaze raked over the length of his body, naked and exposed in the cool, night air of the cell. It came torest on Tarr’s impressive cock, which had swollen rapidly to its full girth under his regard. Larsson bent over his prize and Tarr raised his cuffed hands to clutch at Larsson’s soft hair.</p><p>Larsson’s lips fastened around Tarr’s cock and took him in, deep throating him like he was only a few inches instead of the more than respectable size that he was. Tygerians were somewhat famous for their long, thick cocks, and Tarr was justifiably proud of his own, but Larsson had no trouble taking it deeply into his throat. And the boy was talented—Tarr had to hand him that. Larsson’s throat caressed the length of his shaft as Larsson’s lips kept up a steady pressure.He moved back and Tarr’s cock slid from his throat, but his slightly roughened tongue slid up and down Tarr’s shaft, making him shiver and groan. Sometimes Larsson stopped at the head to nibble with his teeth or slip his tongue down into Tarr’s slit. Gods, if this kept up, Tarr was going to embarrass himself by coming in minutes.</p><p>Tarr gasped for breath as Larsson reared back a little to look directly at him and fan his hands down his thighs and between his legs, his tongue darting out to still lick greedily at his cock. His hands moved up to fondle his balls, and Tarr shifted his legs to open them wider and give him access. Larsson looked up at him and slowly and deliberately wet his index finger. A soft touch on his hole made Tarr widen his eyes and clench around the burn from the finger that had slipped up inside him.</p><p>The Lycan’s spit wasn’t enough to lubricate him, so Tarr groaned and squirmed at the invasion. Larsson unerringly reached up his finger to find his prostate and rubbed his finger across it, making Tarr’s eyes roll back in his head. He brushed over it again and Tarr bucked his hips and cried out through the burn.</p><p>Before the sounds of his voice had a chance to even echo around the room, Larsson had pulled his finger away. Hepulled Tarr’s bound wrists over his head andpressed himself to Tarr’s chest, angling his head up to takeTarr’s mouth. He thrust his tongue inside to taste him and explore him, effectively muffling any of Tarr’s groans. With one hand, he pushed his own pants down and ground his naked cock againstTarr’s. One big hand went around both of them and Larsson began to move quickly and firmly up and down their shafts, the friction of his cock and his hand driving Tarr half-insane with pleasure. In seconds, Tarr was arching his back and crying out into Larsson’s mouth. Larssonswallowed his cries, whispering, “Come on,” against his lips once, and keeping up the slow, steady movement of his hand.</p><p>Tarr came hard, banging his head back onto the rough wall behind him and straining his hips toward the Lycan.Larsson came too and lay on Tarr’s chest afterward, panting for breath as his cock softened.</p><p>Finally, Larssonslid down Tarr’s body, taking his time kissing and biting his way down. He wiped at the mess on Tarr’s stomach with the edge of the blanket, staggered to his feet, and stood looking down at Tarr for a long moment. Then he dropped the dry part of the blanket back over him, pulled up his pants and strode from the room.</p><p>That had been the last time Tarr had been alone with Larsson, for all practical purposes. He’d seen him once more when the prisoner exchange had finally been made. Kyle had heard about what was happening and had tricked his Tygerian lover so he could get away. On the morning of the exchange, Larsson’s beautiful red eyes had been almost black with some strong emotion, but he made no move to stop Tarr from leaving. It took some time, but Tarr had eventually put together the whole story.</p><p>Taz had been planning a military action to rescue his brother, even though it would have escalated the already violent war between Tygeria and the Alliance and possibly killed or at least injured his nobyo’s relatives in the process. Kyle hadn’t been willing for anyone to get hurt, so he’d taken matters into his own hands. As it turned out, Kyle had bribed an old friend of Tarr’s, a Nilanium named Robosium Jex, to help him sneak away from his lover and bring him back to his family so he could explain the truth of the situation to them in person. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jex had helped Kyle escape his brotherTaz’s home, after Kyle Balenescu had promised Jex he would return as soon as he was able to convince his family he was in no danger and truly wanted to be with his mate.</p><p>Predictably, Taz wanted to go after Kyle right away and Tarr had agreed to help. Tarr even had some vague notion of capturing Larsson to explore the issues between them. Try as he might, he hadn’t been able to forget that one night in his cell with Larsson and no one else had satisfied him since—and he’d tried plenty.</p><p>The attempt to take Kyle and Larssonsimply hadn’t worked out as planned. The Lycans had been expecting them. Taz was captured and Tarr had barely escaped, but not before sending Larsson a message through the compnet, telling him he would be back for him. At the time he’d meant it as bravado, a taunt, or a simple thumbing of his nose at the Lycans. But as time wore on, taking Larsson became all he could think about, even long after his brother and Kyle happily returned to Tygeria together to resume their lives there.</p> <p>Now as Tarr waited impatiently for his men to intercept Larsson’s transport, he received a subspace message telling him the Lycan ship had been spotted, and the Rogers were using their cloaking mechanisms to hide from the Lycan ship in order to intercept and board it. Taz sent back a message reminding them that Larsson was not to be harmed in any way. They were to incapacitate the two Lycans, leave Blayde on the ship, and bring Larsson to him.</p><p>He wasn’t sure what he’d do with Larsson once he got his hands on him again—he just knew he had to have him.He’d never yearnedfor anyone like he did for the Lycan, though he’d have to be careful not to let him know just how much he wanted him. That could be a weapon for the Lycan to use against him, and whatever happened, Tarr had to protect himself. After all, he’d never loved anyone before,and he wasn’t about to start now. He’d have his fill of this Lycan and then perhaps keep him as his nobyo or even send him on his way. It would be easy enough—he was almost sure of it.</p><p>Chapter Two</p><p>Larsson was sleeping when the alarm sounded. The noise went right through him, shocking him awake with a harsh, blaring sound that made his heart race. He jumped to his feet, biting down so hard on his lip that it brought blood. Racing to the door, he flung it open and was met by the sight of three huge Jolly Rogers coming down the corridor toward him. Before he had time to shift to his wolf, before he even had time to figure out what he was seeing, one of them lifted a hand-held disruptor and fired.</p><p>The disruptors, mostly used by the Nilaniums, caused damage by exciting the molecular bonds of targets—this one must have been set to stun its victim, not kill him, and Larsson dropped to the floor in a twitching heap. His mind wasstill working perfectly, and there wasn’t even a great deal of pain—at least not yet. He knew that laterhis chest would feel like he’d been kicked by a Leerian mule, and he’d have a bruise the size of his fist.</p> <p>Larsson wanted to shout at them, to ask them about his cousin Blayde, but they gave him no chance to recover. Hewas hauled up and slung over the biggest one’s shoulder like a sack of Ionian coffee beans. TheRogers’ shoulder was bony, and hanging upside down over it was painful. His position stole what little breath he had away. Partially blacking out, he was only vaguely aware of being carried off his ship and onto theirs. They threw him face down on their deck and trussed his arms and legs up tightly, but made no move to harm him any further.</p><p>He could hear their shouts and laughter close by as he lay there. They were Nilaniums, all right, the bastards. Commonly known as Jolly Rogers from the skull and crossbones they painted on the sides of their ships, they’d been given the name by humans in the Alliance who said the logo was like the old Earthen pirates of ancient times. They were ruthless outlaws whose home planet had been destroyed long ago and who roamed the galaxies now in their huge ships. Larsson knew Tarr frequently worked with the bastards and some of them were his best friends and made up his crew.</p><p>Larsson was gradually coming out of the disruptor-induced paralysis. None of the Rogers came any closer to him, though hewondered how long they’d leave him alone. One of them approached him and he tensed, but the man merely rolled him half over with the tip of his boot, as if checking his breathing. When Larsson snarled up at him and tried to spit on his boots, the man laughed and walked away again.</p><p>Within another thirty minutes or so, Larsson felt the bump and vibration on the deck beneath him, letting him know they’d docked with a larger ship. Almost immediately, they came back, hauling him to his feet. Two of the larger men took him under each arm and dragged him between them over onto the new ship. From the looks and size of it, it was a transport, much like his own. Though this one was a Roger ship from the markings he saw on the walls of the corridor they were dragging him through, it was cleaner and more stowed away than most of the ones he’d boarded in the past.</p><p>They hauled him onto what looked like a command deck and over to a man who sat with his back turned, working some kind of controls on a console that was unfamiliar to Larsson. When the man heard them enter, he turned around quickly, a huge smile lighting his face. It was Tarr Bonnet.</p><p>“Larsson, how good of you to drop by.” Larsson snarled at him, struggling in his bonds. The men holding him tightened their grip and Tarr made a tsking sound with his tongue.“Settle down, nobyo.I don’t like hurting you like this.”</p> <p>“Is that why you’re having them do it?” Larsson asked, snarling at him. All he wanted at that moment was to feel his hands around that gorgeous neck of his. “Bonnet, you son of a bitch! If you’ve harmed Blayde in any way, I’ll...”</p><p>“Temper, temper,” Tarr broke in. “You cousin is fine and probably already home by now on your ugly little planet. And as I promised you that you would be, you arehere with me.” His complacent, self-satisfied smile faded a bit as he leaned in closer, noticing for the first time the cut on Larsson’s lip where he’d bitten it when the ship alarm sounded.</p><p>His face turned dusky red, making the usually barely noticeable stripes on his face stand out in sharp relief. He glared at the men holding Larsson, his face full of rage.“Who did this to him? I said he wasn’t to be touched!” He reached out to trace the cut with his fingers, and Larsson jerked his head away. Impatiently, Tarr grasped his chin and turned his head back around.</p><p>“I’ll touch you whenever I want to, Lycan, so get used to it. Youbelong to me now.” “Like hells I do!” Larsson glared up at him, glad for the first time that the men on either side of him were holding him up.He thought he’d grown immune to the weakness Tarr’s touch always brought him, but at the first touch of his hand, his knees buckled, and he would have fallen to the floor if they hadn’t been holding him up.</p><p>“No one touched him, sir, I swear it!” one of the men holding him said. “Maybe it happened when he fell, I don’t know. But none of us so much as harmed a hair on his head, just like you said.”</p><p>Tarr seemed to calm down some, but still held Larsson’s chin in his hand, as if he didn’t want to stop touching him. Finally, he nodded and stepped back.“Untie him.”</p><p>The two Rogers looked at each other over Larsson’s head and blanched visibly. They obviously knew what Lycans were capable of.</p><p>“But sir...”</p> <p>“You heard me. Release him. Hewon’t hurt me, will you, Larsson? Afterall, I’m your mate, isn’t that right?”</p><p>Larsson only glared at him, and the men on his sides shuffled nervously.“You may be, sir, but we’re not! Idon’t like the looks of this one.”</p><p>“Really?” Tarr said, rubbing one finger over Larsson’s jaw. “I like his looks very much indeed.” He peered down into Larsson’s face. Larsson forgot how much taller Tarr was—he stood well over seven feet tall, so he was a good eight inches taller than Larsson.“Will you promise to be good and not hurt my men if I untie you?”</p><p>Larsson gave him a feral grin and a sly look.“Sure.”</p><p>Tarr tilted his head to the side.“Somehow I don’t believe you. How about this? Swear it on your Lycan honor. On your love for me.”</p><p>“Who said I love you, asshole?”</p><p>“Don’t you?” Tarr smiled down at him, daring him to deny it, and he desperately wanted to. But his wolf wouldn’t allow it, already leaping around inside him at the first touch of its mate in so long. Larsson shifted his eyes away stubbornly instead. Tarr laughed and dropped a kiss on his lips.</p><p>“Uther, come over here by me.”</p><p>One of the huge Nilaniums holding him dropped his arm and quickly moved to stand beside Tarr.</p><p>Tarr grinned.“Now twist my arm behind my back until my mate agrees to behave himself.”</p><p>All three of the other men looked at Tarr as if he’d gone completely mad, but he only smiled confidently.“Do it. Push it up until it hurts.”</p><p>With a shrug, Uther pulled Tarr’s arm around behind his back and pushed upward until Tarr winced in pain. He gave Larsson a soulful look.</p><p>“Help me, baby,” Tarr said softly. “Promise you’ll be good so he’ll stop hurting me.”</p><p>Larsson shook his head.“This is fucking ridiculous.”</p><p>The Nilanium grinned and pushed up harder, making Tarr hiss in a sharp breath. Larsson cursed silently under his breath.The bastard knew his wolf couldn’t stand by and see him hurt, even if the idiot had asked for it himself. The Nilanium gave another sharp twist and Larsson gave in.</p><p>“All right! Stop it, you gods damn fool,” he said, not meaning the Nilanium.“Untie me and I won’t hurt anyone. Where in the hells am I going to go anyway?”</p><p>Tarr gave a broad smile and the Nilanium instantly released him. Larsson shook his head. “Stupid asshole. I knew you were crazy, but I underestimated just how crazy. I should have let him break your arm.”</p><p>Tarr chuckled and sat back down in his chair rubbing his shoulder, while his men released Larsson’s hands and feet. “Take him down to my room and lock him in,” he said to his men. “And you,” he said, pointing a long finger at Larsson.“Remember your promise. We’ll see if Lycans have any honor.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Larsson lifted one corner of his lip.“As if a Tygerian pirate knowsanything of honor.”</p><p>One of the Rogers made as if to take his arm and lead him away but stopped his hand in mid-air at the look on Larsson’s face.</p><p>“No, don’t touch him,” Tarr said. “Let’s not poke the beast any more than we have to. Darling, please follow my men to your new quarters.” He quirked up an eyebrow at the vicious look Larsson turned on him.</p> <p>“What? I said please.”</p><p>Larsson gave him an evil glare,turned stiffly and followed the Rogers from the room, Tarr’s soft laughter followed him down the corridor.</p><p>Damn him! Larsson had never felt so furious, so helpless in a situation. When Kyle had come home, Larsson had listened to his explanations of falling in love with Taz Bonnet with incredulity, and it must be said, a bit of contempt. By that time, he knew Tarr was his mate, but he was determined to overcome his own feelings. He refused to be trapped by some kind of crazy physical obsession with someone like Tarr Bonnet.</p><p>Unlike his cousin, Kyle, Larsson was positive he could overcome this obsession he had with Tarr Bonnet.He didn’t want to feel this way about him and he wouldn’t. It was as simple as that. He just had to work on his feelings a little harder.</p><p>When he’d snarled at his own alpha the night Lucas had threatened Tarr with the knife, he knew then he was out of control. Later, talking it over with Lucas, after apologizing over and over again, he’d told Lucas he thought he could get a handle on these outrageous feelings. Lucas had heard him out, but he shook his head when Larsson was finished.</p> <p>“Larsson, you know I just mated too, and I’ll tell you, this curse of ours is a powerful thing. I don’t pretend to know how it works myself, but I can tell you that once it gets you by the throat, it never lets go.I’d do anything for Kai—I love him far more than I ever thought possible.”</p><p>“Well, Kai is lovable. I mean, look at him—he’s beautiful, innocent, and so sweet. However, I’ve imprinted on fucking Tarr Bonnet. The biggest reprobate in the galaxy! I can get over this, Lucas. Iknow I can.”</p><p>“Tarr is gorgeous too, in case you’ve forgotten, and he has a lot of charm when he chooses to exert it.” Lucas shook his head sadly.“I think you may find this a lot harder than you think.”</p><p>“No,” he’d insisted. “I’ve seen what the curse has done to Kyle.He’s claiming to be happy with his Tygerian, but he’s little better than his love slave. How can he be content with a life like that?I’m not Kyle, and I never could be happy with that situation.If Tarr Bonnet thinks he’ll make me aslave, he’s got another think coming.”</p><p>Lucas shrugged.“Kyle’s happy. He convinced me of that before he left, but ultimately this is his life and his choice, not yours or mine. And Taz is crazy about him—I don’t think Kyle’s any kind of slave at all. Maybe you should push some of those male hormones of yours aside along with your pride and just let this happen. Fighting it will only make it worse.”</p><p>Had that conversation been only a few short months ago? Hard to believe.He’d finally accepted his feelings for Tarr as irrevocable, but that didn’t mean he had to pursue the man. They hadn’t made love—not exactly, anyway, and he hadn’t given Tarr a mating bite. There was still hope.At least that’s what he kept telling himself.</p> <p>The two Nilaniums took him to a door and gestured for him to go inside. He opened the door to a large room that was surprisingly neat. The door slammed behind him as he entered and he heard the lock snick shut. Assholes. He sat on the bed and found it fairly comfortable. He stretched out on his back, deciding to close his eyes for just a few minutes and decide how he was going to get out of this shit. If Bonnet thought he was going to meekly accept being his little love slave, he had another think coming.</p><p>He must have gone to sleep after all because he came slowly awake to a hand rubbing slowly over his naked stomach. He blinked his eyes open and found himself looking up into a pair of bottle green ones, fringed with thick red eyelashes. Bonnet! Larsson made an attempt to sit up and found himself pinned down by Tarr’s big hand on his stomach. Tarr had pushed up Larsson’s shirt and was tracing a circular pattern on his skin.</p><p>Larsson glared up at him and pushed roughly at his hand.“What the fuck do you think you’re doing?”</p><p>Tarr smiled down at him and circled his nipple with one finger.“I’m just enjoying my latest acquisition.”</p><p>Larsson snorted.“Acquisitionmy ass!”</p><p>“Mmm...your ass is a nice change of subject.” he replied, running one hand down to caress his hip as he slid his tongue over Larsson’s nipple.</p><p>Larsson jerked away, but Tarr simply grabbed his flailing hands in one of his and stretched them over his head, holding them there. Damn it, how could he be so fucking strong!</p><p>“Let me go, damn you!”</p> <p>“No, nobyo, I don’t think I will. You’re too tense.Just relax and I’ll do all the work.”</p><p>Larsson blew out an angry breath and stopped struggling.It just wasn’t dignified. He turned his face to the wall and refused to give Tarr the satisfaction of struggling with him.He couldn’t resist jerking up a knee to try for his groin, though. Tarr easily blocked it with his own and wrapped a leg around Larsson’s to hold him down.</p><p>“Temper, temper, darling. So much hostility...”</p><p>“Why are you doing this, Tarr? Is it revenge against my family? Is that what this is about?”</p><p>Tarr pulled back his head to stare down at him, a little smile playing around his lips.“Don’t pretend you don’t know why you’re here, nobyo.”</p><p>Larsson huffed out a breath and glared at him.“You can’t do this!”</p><p>“All evidence to the contrary,” he purred, licking up the side of Larsson’s face.</p><p>Larsson shivered and leaned into him.He couldn’t help it, damn it. Blindly, he turned his face toward Tarr, giving in to the powerful feelings that came over him every time he was near. This was his mate, thanks to the gods damned curse, and though the idea of a relationship with Tarr was impossible, and he knew it was doomed to failure, he could take some small moments for himself, surely. He lifted his lips and Tarr took them with a low growl, releasing Larsson’s hands and pulling him underneath him even further.</p><p>“You smell so good, nobyo,” he murmured. “Why can’t I ever get enough of you?”</p><p>One of Tarr’s hands slid down Larsson’s stomach to unfasten his pants so he could slide his hand in. He dragged his fingersslowly up and down Larsson’s aching shaft. “Does this pleasure you, darling?”</p><p>“W-What?” Larsson said, unable to even think when his mate was stroking him. “Yes, yes, it ppleasures me.”</p><p>“Would you like me to suck it for you, baby? Suck your beautiful cock? Ask me, nobyo. Ask me to suck it for you.”</p><p>Larsson’s cock grew even harder at his words. Tarr stared down at him, holding his gaze and refusing to let it go. “Ask me, nobyo.”</p><p>Larsson looked at his beautiful mouth, imagining those lips wrapped around his shaft. He shivered. “W-Will you...will you...oh hells...”</p><p>Tarr rubbed his thumb over the slit, sinking his fingernail in ever so slightly, and Larsson almost came off the bed. Chuckling softly, Tarr held him down with one hand on his abs.</p><p>“Okay, okay! Will you suck my cock, damn it?”</p><p>“Yes, Larsson, I will. Just as soon as you agree to be my nobyo, my own sweet little warrior. Admit that you love me—only me, and that I’m your master.”</p><p>“Fuck you!” Larsson yelled angrily. Damn the man! Larsson’s face burned and he tried to pull away, heaving his body up, but Tarr simply slid back over to lie on top of him, holding him down.</p><p>Larsson struggled, even with Tarr pushing his wrists up by his head again as he nuzzled and nipped at his throat and his ears. Larsson tried to head butt him, but Tarr buried his face in Larsson’s neck and held on to ride him until Larsson sagged with exhaustion. As he lay there, his chest heaving up and down as he struggled for breath, he realized his damn cock was still hard. His struggles had only succeeded in dragging his pants down even further, a fact Tarr was taking advantage of by humping him shamelessly.</p><p>Seeing that Larsson was somewhat subdued, he took one hand to shove his own pants down so he could slide his cock against Larsson’s. The velvety skin against his own made Larsson gasp even more for breath. He realized that Tarr was murmuring softly to him, calling him silly names as he kissed and nuzzled and stroked him, as if he were some pet. The worst thing was, Larsson was actually responding to it, or rather his wolf was responding, curling up with contentment inside him, happy to be so close to its mate.</p><p>Larsson breathed out a tired sigh and Tarr kissed his sweet lips, gently, taking great care with him and saying his name over and over. He wrapped his hand around both their cocks, slowly moving his hand up and down their lengths. It felt incredible to him, and Larsson seemed to be giving into it too. Tarr stroked them together for a long time, not trying to climax, just keeping Larsson—and himself—on the edge.</p><p>Larsson’s body felt so good in his arms, and he knew that this was his true mate, his own sweet nobyo—now he just had to convince Larsson of the fact. Hecould feel Larsson’s body relaxing under him, releasing that rigid control of his and finally allowing his body to rest against him.</p><p>Larsson was so defiant, so resistant to mating with him. Tarr knew he had his work cut out for him if he planned to seduce this Lycan. He was also very aware that Larsson was more than a little attracted to him. From time to time, that control of his would slip, waver just a little, and he succumbed to his feelings. He was doing that now, and Tarr reveled in it.</p><p>Larsson was a true alpha, and Tarr knew he’d never make him a good nobyo if what he wanted was a submissive little lover. On the other hand, it would always be exciting with Larsson, a constant challenge to tame him or to at least quiet him and love him enough to make him decide to submit. It would always beLarsson’s decision, Tarr knew that about him already. He also knew that from time to time, Larsson would win this game they played between them, and he would have to allow him to be the dominant partner. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was a sexy game, and one Larsson played well. It was a relationship that would never be dull, that’s for sure. If Tarr could gain his trust, get Larsson to realize how much he was attracted to him, they just might have a chance—a slim one, but still a chance. And if he could gain his trust, he might even be able to gain his affection. He realized he wanted that now more than anything. Not just his grudging admission that he was attracted to him against his will, but his affection, even someday his love.</p><p>Larsson moved beneath him and whimpered, the little sound going directly to Ta rr’s cock. His hand moved faster, coaxing a deeper response. He wanted Larsson to make that sound again. “Kiss me,” Tar whispered against his lips and Larsson turned his mouth toward him, blindly searching for his kiss.</p><p>He gave it to him, licking at the corners of his lips before thrusting his tongue inside his mouth and tasting him. He moved his hand up to the sensitive head and swept his thumb around them both in a circular pattern, smearing their pre-cum together.“Come on,” he urged again. “Give it to me. Come in my hand, baby.”</p> <p>Larsson’s breath came faster he arched up into him, thrusting his chest against Tarr’s. Tarr moved to bite his ear just as he dipped his thumb into his slit again and a deep, guttural moan came from his nobyo’s throat. He strained against him as his orgasm swept over him and Tarr joined him, milking them both through it.</p><p>When his touch became almost painful, he fell back beside Larsson, his hand sticky with their cum. Too spent to move, he lay there for a few moments, the smell of their seed heavy in the air around them. Easing off the bed, he stumbled to the bathroom to clean up. Leaning against the sink, Tarr stared at himself in the mirror.He didn’t look any different, yet the world had subtly shifted for him. Larsson belonged to him now, whether he wanted to admit it or not, and he would take him home to Tygeria with him and never let him go. Their life together would be volatile, but Tarr expected to enjoy every moment of it. Heheard Larsson’s soft snores coming from the other room and felt an almost overwhelming rush of tenderness.</p><p>It was too soon to love him, surely, but whatever this was, it was powerful. He wanted the time and space to explore this thing, and one way or the other, he would get it. He wet a cloth with warm water to take it back to the bed to clean his nobyo, although he rather liked the idea of making him wear the scent of his cum to let everyone know exactly who owned him.</p><p>When Larsson awoke, Tarr was gone, and a quick glance at the door showed he’d locked him in again. Asshole.Larsson’s pants were still shoved down around his hips and he still felt sticky and messy, even though he vaguely remembered Tarr dabbing at him with a cloth. He was giving some thought to climbing into the shower in Tarr’s bathroom when a large boom shook the entire ship and he was thrown violently off the bed and onto the deck.</p><p>Shocked, he jumped to his feet, pulled wildly at his pants and ran to the door. It was locked, of course, so he pressed his ear to it in hopes of hearing what was going on. He heard muffled shouts and running, but then an ominous silence before another loud explosion rocked the ship. Larsson was knocked down on his ass again and could feel a strange, violent vibration through the deck. What the hells had happened? It felt like the ship was breaking apart. Alarms started up right away and the lights in his room began to flash rhythmically. Leaping to his feet, Larsson rushed to the door and saw with horror that black smoke was seeping under it and swirling around his feet. He banged on the door, calling loudly for help.</p> <p>Suddenly, the door flew open, knocking him backward, and Tarr was there reaching for him through thick swirls of choking black smoke.“Come on, baby, let’s get you out of here.”</p><p>His thick, curly hair was standing on end, like he’d been running his hands through it or trying to pull it out. His eyes were almost glowing with excitement, rather than alarm, and Larsson had never been so glad to see anyone in his life. Tarr wrapped his arms around Larsson and hugged him close, and Larsson let him do it. His arms felt warm and comforting, but now that the door was open, Larsson could hear the alarms shrieking even louder.</p><p>Tarr pulled Larsson out into the corridor. The smoke was so black and thick here that Larssoncouldn’t see a foot in front of him, so he let Tarr pull him along by an arm around his waist. Presumably he knew the ship a lot better than Larsson did, so he was glad to let him take the lead.</p><p>Larsson must not have been going fast enough to suit him, because Tarr suddenly turned and picked him up bodily around the waist. Larsson flailed his arms and legs, but Tarr ignored his struggles and took off down the corridor. He set him down after a minute and began pulling at a door that was supposed to slide open. Larsson put his shoulder to it, too, and together they managed to prise it open enough for both of them to slip inside. It was the launch deck and Tarr ran toward a small shuttle, climbing up on a wing and shoving back the hatch. He held out a hand to Larsson, who grabbed it and hauled himself up to clamber inside the tiny ship, just as the door they’d had so much trouble opening suddenly blew inward from a loud blast and fiery explosion.</p><p>Tarr jumped in beside him, ducking shrapnel and still coughing from the pall of smoke that hung over the deck. He lowered the hatch manually and took a seat at the controls. Larsson slid into the jump seat behind him. He barely had time to fasten himself in before Tarr took off from the deck, soaring through the opening and out into open space. Larsson twisted around to look behind them and saw the ship breaking apart.</p><p>“Y-your men...”</p> <p>“Most of the ones still alive got off on the bigger shuttle while I came back for you.” He turned to grin over his shoulder at him.“We cut it close, baby.”</p><p>“Stop calling me baby, damn it. Whatthe hells happened?”</p><p>“Hmm...good question. Right after I left you, I was attempting to launch into hyperdrive, when there was a minor glitch in the gravimetric field displacement manifold. I think I might have accelerated a bit too fast.”</p><p>“You think? Minor glitch!” Larsson waved his hands around rather than smack Tarr upside the head.“You idiot! Youcould have blown us all up!”</p><p>“Calm down, baby, you get too excited. Must be a dog thing. I have this all under control—I got you out, didn’t I? We’re all safe and sound.”</p><p>“Safe and sound? We’re on a fucking shuttlecraft in the middle of nowhere!”</p><p>Tarr executed a little maneuver to miss a bit of debris coming from the disintegration of his ship and turned his head to smile back at Larsson.“As I believe I’ve already mentioned, you worry too much.We’re in a planetary system—I don’t know exactly which one, but I’m working on it.We’ll find a nice little planet or moon to set down on and await rescue. I was able to send out a distress signal just before I came for you.I’m sure someone picked it up.”</p><p>“Oh gods,” Larsson put his head in his hands and sighed. His body had a lot of nerve betraying him like it had—he’d suspected for months that Tarr Bonnet would be the death of him, but he didn’t know his suspicions would turn out to be quite so literal.</p> <p>“Ah! Here we are,” Tarr said, his fingers skipping over the comp screen.“I’ve found a moon that has an atmosphere with oxygen. Admittedly, not a lot, but let me keep looking.”</p><p>“Let me have the damn thing and you fly this fucking shuttle without blowing us up again!” Larsson pulled the compnet from his hands and started looking through the map of the system he had pulled up. The system was called the Miracean system. It contained multiple confirmed planets with several in the habitable zone. A habitable zone was the region in the planetary system where a planet or moon could maintain water on its surface and potentially therefore, life.</p><p>It had to be the right distance from its sun, of course, neither too close nor too far away. It looked like his idiot mate had been lucky again, because this system had several likely candidates. The best one looked to be a moon called M10398.</p><p>“This one,” Larsson said, pointing toward the blip on the screen.“Navigate here. It might be a little warm, but it doesn’t look too bad and probably has water. No reports of any habitation.”</p><p>Tarr nodded and punched in the coordinates.“Uh...would this be a bad time to tell you we’re a lmost out of fuel?”</p><p>Larsson felt the blood drain from his face.“Damn it, Tarr!”</p><p>“Hang on, baby. I’ve got to take us down fast before we run out.”</p><p>The next few minutes were harrowing as they entered the moon’s atmosphere way too fast. Although the air resistance was helpful in slowing down the rate at which their spacecraft was being pulled down to the surface, the friction generated by their fast entry resulted in dangerously high temperatures to the outer hull of the ship.</p><p>Tarr maneuvered the shuttle to enter the atmosphere backward so the ship could slow itself down from its high-velocity orbit, turning its blunt side down so a shock wave was formed, keeping some of the heat away from the shuttlecraft. It also helped to slow their rate of descent.</p><p>Tarr took controls away from the on-board comps to pilot the ship the rest of the way down. They were still traveling at hypersonic speed, but their shields were holding and the craft was slowing enough that the moon’s gravity was pulling them to the surface. Tarr performed a series of ‘S’ turns, slowing it even further, along with the engines backward thrust, and the shuttle finally began to decelerate. Larsson glanced out the porthole next to him and saw the surface still coming toward them dangerously fast.</p><p>Tarr yelled back over his shoulder to Larsson.“I see a likely spot to put us down by that riverdown there. Brace yourself.”</p><p>They came in low for a couple of passes over the water, but the engines were stuttering, almost out of fuel. Tarr had to put the craft down and quickly before they simply fell from the sky. Larsson put his head between his knees and held on tight as the shuttle hit the ground with an incredible impact, bouncing along the moon’s surface like a ball before careening to a swerving, spiraling stop as Tarr pulled hard on the controls, turning the ship around and around and spinning like a top. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The shuttle lurched into something hard and massive on its left side and it was over in seconds, the craft coming to a shuddering stop. Larsson had slammed his head into the wall next to him, and he must have lost consciousness for a few minutes. When he awoke, Tarr was leaning over him, turned around in what was left of his seat and running his hands along both sides of Larsson’s head.</p><p>Larsson fought him off, pushing his hands away. He sputtered a few seconds and then lashed out at him. “What the hells kind of landing was that, Tarr? Gods, you almost killed us!”</p><p>Tarr drew back with an aggrieved look on his face.“That was an excellent landing. I got us down in one piece, didn’t I? Wewere out of fuel!”</p> <p>“And whose fault was that? What kind of crew leaves the shuttlecraft almost empty? No, don’t tell me! A halfassed, irresponsible, harebrained bunch of Rogers, that’s who!” Larsson was shaking, partly from anger, partly from the close call, and he wasn’t ready to calm down yet, despite the fact he knew they needed to get out of the wreckage before the damned thing blew up.</p><p>“Get me out of here, damn it!” He was struggling with the harness holding him in, as the controls had been crushed in the crash.“What the hells did we hit anyway?”</p><p>“A mountain,” Tarr said calmly, pulling out what looked like a wickedly sharp knife to slice through the harness, freeing him.“There’s a range that runs along the side of the river here, but the shore was the only halfway clear spot I could see to put us down. Hey, at least we found water.”</p><p>Larsson shot him a disgusted glare and began hauling himself out of his seat, not easy with the entire left side of the craft caved in. Tarr thrust open the hatch and boosted himself out, reaching back for Larsson, who ignored his outstretched hand and pulled himself up. Now that he was out of the shuttle, he could get a better view of where they landed.</p><p>The water in the river was a deep cerulean blue and ran along the side of sheer cliffs for as far as Larsson could see, before it twisted off to the east, following the curve of the mountains. They had landed on the narrow shore of this river. On the other side was a thick, verdant jungle. The heat was oppressive, but not intolerable, and big, dark clouds were boiling over the sky, promising a rain in the near future.</p> <p>“We need to find a shelter and soon, from the looks of it,” Larsson said and glanced over at Tarr, getting a good look at him for the first time since they landed. He was holding himself at an odd angle and looked as if he were close to collapsing.</p><p>Larsson grabbed his arm.“What’s wrong with you? Sit down for a minute—you’re hurt.”</p><p>“Just a scrape or two,” he replied with a negligent grin. He grimaced, though, as Larsson put an arm around him and eased him down to the sandy ground by the river.</p><p>“Lie back—let me see.” Larsson pulled up his shirt and was shocked to see the angry red marks along his ribs that would soon turn to nasty bruises.“You’ve broken some ribs,” Larsson said, his voice tight with disapproval. “And here,” he gently touched a huge spot on his abdomen that looked eminently painful.“You might have some internal bleeding.”</p><p>Tarr’s breathing was getting more difficult and more rapid. With a little cry, he suddenly turned his head and spit up bright red blood onto the sand. Larsson could see that he was in a lot of pain and tried not to show Tarr how concerned he was.</p><p>“Can you shift and heal yourself?” he asked, a crease forming between his eyes.</p> <p>Tarr shook his head.“Not with you here. Ourtigers don’t retain any of our reasoning when weshift. I’d simply see you as prey and try to kill you.”</p><p>“Why don’t you let me worry about that? You’re really hurt, damn it.”</p><p>Tarr shook his head stubbornly.“No. It’s too risky. Just get me somewhere I can lie down for a little while before this storm starts.” Larsson glanced up at the sky and indeed, the first drops were starting.</p><p>“Hardheaded ass,” Larsson mumbled, but helped him to stand and half-carried him over to the side of the cliff face nearest them. There was a slight overhang of rock that might keep him marginally dry until he could figure something out.“Rest here and let me look around.” Larsson stood and pointed a finger down at him.“Don’t move. Understood?”</p><p>Tarr nodded without comment, which alarmed Larsson more than anything he could have said or done. He went back to the shuttle and stood for a moment looking at it as if an answer might suddenly present itself. When nothing did, he moved around to the back of the craft and finally located what he’d been looking for—a piece of one of the heat shields that had sheared off the craft, but was still hanging on by one corner.</p><p>Even so, he had to partially shift to be able to tear it free, and by that time the rains had started in earnest, coming down from the sky in blinding sheets. At least the rain would thoroughly soak any remaining sparks in the wreckage, so he didn’t have to worry about it blowing up any second.</p><p>He dragged the big metal sheet over to cliff face and propped it against the side, then carefully pulled Tarr underneath, trying not to hurt him any more than he already was. Tarr was still conscious, but shivering and groggy from pain. Running back to the ship, Larsson clambered back inside the hatch and searched under the console for a first aid kit, sending up a silent prayer to the gods that someone had sense enough to put one there.</p><p>He found it finally, stuck up under a stack of what looked like old trip logs. He ran back over to Tarr with it under his arm, along with an old mylar blanket he’d found under the seat. The blanket was one used by the Alliance troops in the field, and he wondered briefly how Tarr got his hands on one, but then decided he probably didn’t want to know.</p> <p>He wrapped the blanket around Tarr, made him dry swallow some pain capsules he found in the first aid kit and then used the gauze strips from the kit to try to stop some of the slow bleeding on the back of his own head. Larsson’s partial shiftthat he’d done to be able to wrench the metal shield off had taken care of most of his bruises and cuts, but the one on his head had been a little deeper and was still seeping blood.His head didn’t hurt, though, and he figured he must have cut it on something during the rough landing, rather than knocking it against the hull.</p><p>Tarr was shivering still, so Larsson crawled under the blanket with him and wrapped an arm around him, scooting up close to spoon him. Tarr glanced over his shoulder at him, raising one eyebrow and Larsson bristled.“This is not cuddling, so don’t get any ideas. I’m simply trying to keep you warm because you’re going into shock. Soshut up.”</p><p>Tarr gave him the ghost of his old cheeky smile before he turned wearily away, and Larsson squeezed him even tighter, more worried than he wanted to admit, even to himself. He had no idea what time of day it was, or even how long the daylight lasted on this moon. From the position of the sun in the sky, it looked as if it were close to sunset. Tarr had fallen asleep when the rain stopped drumming so hard against the makeshift roof over his head, so Larsson slipped out to go in search of something to start a fire with.</p><p>He didn’t know if there were any animals to speak of on this planet but he didn’t want to take any chances. A big fire burning through the night would not only keep them warm, but hopefully keep any curious animals away.</p><p>He wandered down the riverbank to a copse of trees some fifty yards away, and found that the foliage was thick and abundant. Here there were exotic-looking trees with long branches drooping to the forest floor with spiny needles that nonetheless kept out the rain. Up under the trees, the ground was warm and dry. He quickly gathered some limbs that had fallen, along with a few he cut from the underside, using Tarr’s sharp blade. He also picked up some of the dried needles that had fallen to the ground as a fire starter.</p><p>He made three trips back and forth to the trees to get enough wood to last them through the night and spent some time carefully starting his fire. As a child, his father had taken Larsson and Konnor on camping trips in the mountains on Lycanus 3.He’d taught them some valuable woodcrafts and perhaps the one he remembered best was starting a fire, maybe because it was so hard and took so long. He foraged a piece of steel from panels inside the craft, so all he needed was a piece of flint. After scouring the rock face for an hour or so, he found some rock that wasn’t flint, but was hard enough and sat down to patiently make his spark, which he then transferred to his tinder.</p><p>It seemed to take forever, but fire made, he checked on Tarr again and found him deeply asleep and a little feverish. In the morning he would make him shift, that’s all there was to it. He crawled back under the mylar with him and tangled his arms and legs around him, listening to his soft snores. Tarr had to get better. Hewouldn’t think about any other possibility. Finally feeling warm, Larsson drifted down into a restless sleep.</p><p>Tarr woke up hours before dawn cold and uneasy. He couldn’t recall exactly the unsettling dream that woke him, but it was all mixed up with being unable to find Larsson in a burning building, running down one hallway after another and then falling helplessly into a void. He must have made a little sound of fright and pain, because Larsson came awake beside him and sat up.</p><p>“What is it?” he whispered loudly, scanning the space all around him. “What’s the matter?” “Nothing,” Tarr said.“Go back to sleep.”</p><p>“What do you mean nothing? You were whimpering in your sleep.”</p><p>Tarr turned an incredulous look on him. “I didn’t whimper. I’ve never whimpered in my</p><p>life.”</p><p>“Mm-hmm.Well, somebody did and it wasn’t me. Areyou in pain?”</p><p>“Not too bad,” he said, shifting uncomfortably.“My stomach hurts.”</p><p>“You need to shift, damn it.”</p><p>“I can’t, I told you. My tiger would kill you.”</p><p>“I’ll take my chances. “</p><p>“Well, I won’t.” He turned over resolutely and put his back to Larsson again, but a warm</p><p>hand ran down his bare arm.</p><p>“Stubborn ass.I can take care of myself.” Tarr made a non-committal little grunt, and </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>refused to turn back over.</p><p>“No wonderyou’re not sleeping—you’re frozen,” Larsson exclaimed and lay back down,</p><p>wrapping his arms around Tarr, rolling him back over to face him. Larsson moved his leg over</p> <p>Tarr as well and began to rub his hands up and down his body to create some friction. Tarr</p><p>looked up at him and suddenly Larsson seemed to realize what he was doing and froze. He gazed</p><p>intoTarr’s eyes with his own eyes wide and startled.</p><p>Tar grinned back at him, unable to help himself, despite the discomfort. Larsson looked so</p><p>guilty and worried that he might be showing his true feelings, like a little boy caught with his</p> <p>hand in the sweets jar. On impulse, Tarr put his hand around the back ofLarsson’s neck and</p><p>pulled him down for a kiss.</p><p>From the first moment he’d laid eyes on Larsson, when Tarr was locked in the Lycan jail,</p><p>Tarr felt the pull of this overwhelming attraction, no matter how hard he tried to fight it. Not only</p><p>was Larsson very good looking, with his thick, shiny hair, incredible eyes, and a face that on a</p><p>female might even be called pretty, but there was a strength and grace to his body that Tarr had rarely seen in other men. He had a strong will and an ugly temper, true enough, and at times he could be pushy, arrogant, and downright insulting. Still, he’d shown Tarr kindness and concern since they crashed, even if it was a little grudging. Despite their differences, despite the fact that they were totally unsuited to be together, here in this little space on an alien moon, they seemed almost outside of time. The differences between them—and they were vast—seemed not to matter quite so much, at least not to Tarr. He pulled Larsson back down for another taste of his</p> <p>Larsson’s lips were startlingly warm and soft, but for a moment he stiffened, pulling back a</p><p>bit, staring down into Tarr’s eyes. Then he sighed deeply, seeming to make up his mind about</p><p>something and lowered his head to kiss Tarr back passionately, deeply, takingTarr’s mouth with</p><p>a rough pleasure. His tongue teased Tarr’s as he deepened the kiss, and his hand moved down to</p><p>cup his balls through his clothing. Tarr moaned, moving up against his hand. Larsson was</p><p>breathless when he pulled his head back. He allowed Tarr no time to pull away. His hand threw</p><p>off the mylar blanket covering them, and he grinned and eased Tarr’s pants down, careful not to</p><p>hurt him.</p> <p>“You lie still—I don’t want to injure you any further.”</p><p>Tarr gazed down at him, noticing how his eyes caught the sparks of the fire, snapping and</p><p>sparkling with heat. He put one hand on Larsson’s head and twined his fingers through his hair. Larsson positioned himself between his legs, bent over and engulfed Tarr’s whole cock in</p><p>his mouth in one move. Tarr made a surprised, gasping sound, coming halfway up off the</p><p>ground, but Larsson pushed him back down and continued sucking his cock down, starting with</p><p>a soft, steady suction that he slowly increased as he moved one of his free hands to Tarr’s balls,</p><p>softly massaging the hot flesh in his hands. He began to add his teeth ever so gently to the</p><p>pressure on his cock, slowly skimming them up the shaft, deliberately manipulating his balls,</p><p>waiting for Tarr’s moans of pleasure.</p><p>He didn’t have long to wait. Tarr thrashed beneath him, his whole body rippling with need,</p><p>his hands buried now in Larsson’s hair. Probably afraid he’d hurt himself, Larsson pulled off and</p><p>gentled him with one hand on his stomach, soothing him until he quieted under his warm hand. He lowered his head again, once Tarr managed to calm back down, and hummed around</p><p>Tarr’s shaft as he pulled his rough tongue slowly up the length of it. When he came back up to</p><p>the head of Tarr’s cock and thrust his long tongue down into the slit, Tarr raised his hips off the</p><p>ground again and hoarsely yelled out Larsson’s name. He thrust his tongue into Tarr’s slit again</p><p>and again until Tarr came with another hoarse shout, and his spurts of cum sprayed into</p><p>Larsson’s mouth.</p><p>Larsson kept his cock in his mouth, gently sucking down his cum and then continuing to</p><p>suck on it until it began to become painful. He must have noticed Tarr wincing and shifting</p><p>under him because herelented with a grin, pushing up Tarr’s shirt and kissing his way up to his</p><p>chest, gently sucking at each nipple in turn. Finally, he pulled his shirt back down, tugged up</p><p>Tarr’s pants as he lay splayed out on the ground and fell down beside him, wrapping a leg over</p><p>him and pulling the blanket back up over both of them.</p><p>“There,” he whispered in Tarr’s ear. “That should warm you up and settle you down. Now</p><p>stop fidgeting and go back to sleep. Tomorrowwe’re going to find you someplace to shift.” Totally spent, Tarr huffed out a breath before closing his eyes and allowing himself to enjoy</p><p>being close to Larsson like this, without all the tension and anger between them. Taz had this all</p><p>the time with his nobyo. What would it be like to have Larsson belong to him? He slanted his</p><p>eyes over at his prickly little mate. All in good time, he thought as he drifted off to sleep. All in</p><p>good time.</p><p>Chapter Three</p><p>Larsson woke early the next morning, stiff and achy, both from his night on the ground and as a result of the crash the day before. If he felt this bad, he could only imagine how Tarr would be feeling. He was still sleeping at the moment, so Larsson eased himself out from under the blanket and looked around for something that would hold water. Larsson stoked the fire and looked back around the lean-to. His eyes lighted on the metal first aid kit, and he quickly emptied it on the ground and went over to the river to fill it.</p><p>Since he had no idea what kind of alien microorganisms could be floating in the water, the best notion he could come up with was to boil the water before they drank any of it, even though the water was fast moving and certainly seemed clear enough. He carried his water back to the fire and set it on the coals near the edge, then went for another armload of wood.</p><p>When he got back with the wood, Taz was sitting up, looking miserable. “Okay, time for you to shift, Tarr. You’re no good to me injured like this, and it’s going to take both of us to hunt up something to eat and keep this fire going.</p><p>“I told you...” “And I told you I can take care of myself. But if it will make you feel better and stop being such a stubborn ass, I’ll barricade myself inside the wreckageof the ship.”</p><p>Tarr looked up at him and then back over at the wreckage, some fifty feet away.“Can you do that? Isit in good enough shape?”</p><p>Larsson nodded.“I can get inside the hatch and lower it. The hull is banged all to hell, but mostly intact. The heat shields are pretty much fucked, but it’s still in one piece mostly.”</p><p>Tarr nodded.“If you’re sure. Getinside and stay quiet. If the tiger figures out he can’t get to you, he’ll probably lose interest and go try to find something else to eat. He’s pretty hungry.”</p><p>Smiling, Larsson looked down at him.“You talk about him like he’s not part of you.”</p><p>Tarr shrugged.“He’s part of me, I guess, but not the same as your wolf. When we shift, we become animals, and don’t retain any of our humanoid brain. I’ve heard stories that some people have a kind of sense memory of their families, even their nobyos, especially if the old stories are true and the nobyo is a true mate, but I don’t know, and I don’t want to take any chances with you.”</p><p>“With me?” Larsson tilted his head and stared down at Tarr, curious as to what he meant. Larsson thought of Tarr as his mate, but Tarr had never given any indication that he reciprocated the feeling. Oh, he flirted outrageously and had come after Larsson relentlessly, even putting that ridiculous bounty on his head, but that was more because he was a bastard than anything else, surely.</p><p>“Did you just imply that I’m your nobyo? Because let me tell you, I’m nobody’s love slave. Youcan just get that idea out of your head right now.”</p><p>“Yes, yes,” Tarr said tiredly, trying to stand up. “You’ve made it clear how you feel.” He’d made it to his feet and even though he looked ready to collapse again, a little twinkle sparkled up in his eyes as he gazed at Larsson.“Though last night, you were giving out some, shall we say, mixed signals?”</p><p>“Fuck you,” Larsson said, crossing his arms over his chest. “I was just trying to make you feel better.”</p><p>“Oh, it worked.” Tarr grinned at him.“Wonderful first aid technique. Can you show it to me again later?”</p><p>Larsson glared at him and stalked toward the wreckage.“If you’re finished acting like an ass, you need to shift. As soon as I get inside—you hear me?”</p><p>“Yes, darling,” Tarr said, grinning broadly at the filthy look Larsson threw at him before he climbed up onto the cockpit. Larson pulled back the hatch and lowered himself inside. Hedidn’t know how long he might have to stay inside here, but he was hoping Tarr’s tiger would sniff around a bit and then take off to hunt, or whatever it was that tigers did.Tarr’s seat was mostly intact, though hanging at an odd angle. He reached up and pulled the clear cockpit cover down and locked it in place, giving Tarr a thumbs-up sign. He had no idea if Tarr would know what that meant, but he’d learned it at the Alliance academy and hoped Tarr knew it meant he was good to go.</p><p>There wasn’t enough room to stand up inside the cockpit and once he sat down, he couldn’t see Tarr’s shift. He settled himself as comfortably as he could in Tarr’s seat and picked up the compnet.He had a vague memory of it flying off his lap during the wild ride down to the moon’s surface, so he didn’t have much hope that it was still working, and of course, it wasn’t. He had just put it back down on the floor behind him when he heard a loud thump on the fuselage and a huge shadow fell over him.</p><p>Looking down at him through the clear cover was a beautiful, exotic creature, a massive, beautiful tiger, perhaps sixteen feet long and powerfully built. Larsson had seen pictures of the Tygerian tigers, but they hadn’t done them justice. It was golden-orange in color with broad black stripes. Its big claws scratched at the clear cover on the cockpit as the beast gazed down at him, locking its eyes with Larsson’s. The golden-green gaze looked familiar to him, and he thought he would have known this was Tarr anywhere. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The beast frantically pawed at the cover again, and through the cover he could hear the low, rumbling growl comingfrom the creature’s chest. Larsson knew without a doubt that no matter how powerful his own beast was, it didn’t have half the strength of this massive animal. Tarr was right to have been worried, and Larsson was very glad of the barrier between them. The tiger threw back his head and roared, then jumped down off the cockpit. Larsson gave it a good thirty minutes, but eventually, the heat inside the cockpit and his own raging thirst and need to stoke the fire forced him to open the hatch and crawl out, looking around him for any sign of Tarr’s beast. He saw no sign of him, though, so he jumped down off the craft and went over to pull the water off the fire to cool.</p><p>While he was waiting, he found a longish branch in the load of wood he’d brought in earlier and skinned all the needles off it to make a fishing pole.He’d seen some small fish swimming in the eddies of the river by a big boulder, and he thought he might be able to catch a few of them to see if they were edible. He spent some time fashioning a hook out of a pin from the first aid kit and tore a strip of gauze as his fishing line. It was pretty sad-looking when he finished, but he hoped it might work if he could find any bait.</p><p>By this time the water had cooled enough for him to drink and he tipped the can back, drinking almost half of it before he lowered the can. He’d save the rest for Tarr. Hehadn’t seen any sign of him since he first shifted, and he wondered if he could shift back at will or if he had to stay in his tiger form for a certain period of time. Maybe he should have asked that question instead of allowing Tarr to taunt him into being angry again. What was there about the man that made him fly so easily into a rage?</p> <p>Tarr was at once the most disreputable, irritating man he’d ever met and the most fascinating—not to mention so damn sexy it took everything he had not to jump him every time he looked at him. Thenight before had been an aberration, and couldn’t be repeated. He just didn’t trust himself not to get carried away and give Tarr the mating bite. The only thing that prevented him from doing it then was the knowledge of how fragile he was with his injuries, but Larsson couldn’t trust himself not to forget about that next time.</p><p>There could be no next time. If he were truly and completely mated with Tarr, it would eventually mean his death. Larsson felt certain of that. Either Tarr would leave him and that would be the same as killing him, or he would only want him for his damned love slave and that would just as surely destroy him. No, he was better off keeping whatever distance he could from the man.</p><p>Having made his fishing pole, he went over to the base of the cliff and began turning over rocks, hoping to find some kind of insect he could use for bait. He was hopeful, since finding the fish that there might be a good deal of wildlife on the moon. If larger game was available, he and Tarr would need to hunt. His wolf was perfect for the job, and was strong enough and fast enough to easily pull down most small game.</p><p>And while water and food were the first priorities, they would need some kind of shelter a little more substantial than the lean to. His mind was busy with ideas as he crouched beside the small eddy at the edge of the shore, so he never heard the tiger coming up behind him until he was only a few feet away.</p><p>Hearing the soft pad of his feet behind him, Larsson knew what was coming for him. Freezing in place, Larsson slowly turned and saw the huge, beautiful creature not ten feet away from him, its eyes seeming to burn a hole through him with their intensity. It was crouching down, stalking him like prey.He thought briefly of running for the ship, but realized he’d never make it.</p> <p>Desperately, he tried to remember anything he’d learned in the Academy about these Tygerian tigers. He knew, for example, that tigers would attack most any animal that placed itself in a vulnerable position, like he was in right now. They depended on concealment and a stalk and ambush approach to capture their prey. Something told him that if he tried to run, it would be over quickly.</p><p>Larsson’s distraction had given it the chance it needed to approach. Larsson knew instinctively that as soon as it got close enough it would rush him, probably seizing his shoulder or neck to force him to theground. That’s where the lethal bite would come—to the back of his neck. Ironic that Larsson had been thinking about biting Tarr in the exact same spot just a short time ago, except his would have been a mating bite, and given in love and passion.</p><p>The tiger had stopped its approach when he turned to look at it and though it was still growling softly, it hadn’t rushed him yet. Larsson knew that if he suddenly stood up, it would be on him in seconds, so he did the only thing he could think of—he dropped down to his knees and covered his head with his arms, bending down as low to the ground as he could get.</p><p>The tiger was on him in an instant, and Larsson heard the loud snarl in his ear and felt the hot, moist breath on the backs of his hands. It stood over him, covering him completely with its body, its weight partially resting on his back, holding him down. His wolf was close, ready to spring out and fight, though Larsson knew it was useless. He forced it back down, and tried to make himself as small and limp as possible, playing dead. He could smell the overpowering scent of the wild beast and feel the soft fur that covered him. A steady, low rumble was coming from the beast’s chest, as a huge paw landed on his back and pushed him down flat.</p><p>Amazingly, its claws had been sheathed, and he could feel the hot, wet nose of the beast sniffing at his neck. He felt the beast’s saliva dripping down on his neck and imagined him opening his mouth to take a big bite out of the back of his head. Instead, the tiger chuffed out its breath and fell down beside him, keeping a paw on his back and pressing him facedown. He waited for the teeth to rip into his neck, but nothing happened. Larsson peered up from between his fingers and saw the tiger staring down at him with his beautiful golden eyes. The pupils were oval and though he had a flat expression, he didn’t look particularly savage at the moment. He simply gazed down at him and Larsson could have sworn he saw a kind of awareness in his eyes.</p><p>Did he recognize him then? If Tarr was coming out of it, he might be more aware. Still, Larsson lay there, afraid to move and test the theory. The big tiger lay beside him, not really threatening, but making no move to leave either. After what seemed like an interminable time, lying there waiting for his own imminent death, the adrenaline that had been coursing through his body drained off and incredibly he began to feel sleepy. His family had always teased him that he could fall asleep anywhere and apparently they’d been right. Hedecided he’d close his eyes, just for a minute or two.</p> <p>When he awoke, it could have been minutes or hours later. He was alone on the shore with no sign of either Tarr or the tiger. Hemight have thought he’d dreamed the whole thing, except for the saliva still pooled on the back of his neck and dripping down his shoulders. He sat up quickly and looked around the little clearing before getting warily to his feet. He made his way unsteadily back to the lean-to and fell down beside the still smoldering fire. A part of his mind registered that it was still burning, and he poked at it and added some wood from the pile. If the fire had gone out, that would have been all he needed at this point.</p><p>He finished off the water, thinking the tiger had probably made the decision to find its own water by now, and went wearily back to the river’s edge to fill the tin again and set it to boil. He was so damn hungry, he decided to go hunt on his own and not wait any longer for Tarr. He had no idea how long he’d stay in his beast, and Larsson needed food before he became too weak to find any. He was on his way to the edge of the forest when he heard a shout behind him. Coming around the bend in the river was Tarr, gloriously naked, and dragging an animal behind him that looked a little like a large gafin.</p><p>When he’d hunted in the field with the Alliance army, they’d called animals like these elk, saying they had similar animalsback on their home planet, but the gafin weren’t nearly as large, and didn’t have such heavy bodies, though they had the long horns or antlers like the elk. Larssonhad no idea how they’d come to be here on this moon, but the gafin ranged in forest and forest-edge habitats in Lycanus, and had been brought over to Lycanus 3 by early settlers. They fed on grasses, plants, leaves, and bark, and were generally harmless creatures, but as Tarr got closer with this one, Larsson could see long, curved teeth coming out of its mouth. Its snout was long and curved downward as well. Maybe some cousin of the gafins then.</p><p>“I got us something to eat,” Tarr said with a huge grin, and Larsson ran to meet him, trying to convince his wolf not to jump his gorgeous naked body. Even dirty and bloodstained, Tarr’s body was magnificent, the exotic stripes on his body outlandish, yet undeniably alluring.</p><p>Together they pulled the animal into their small camp. While Larsson stoked up the fire, Tarrpulled on the pants he’d apparently discarded before shifting and cheerfully set in skinning the animal with his knife. He cut off a huge chunk of meat and handed it over to Larsson, who put it down in the coals right away to cook a little. He was almost hungry enough to eat it raw, but he restrained himself and put it in the hot fire.</p><p>Tarr continued to cut the animal up and Larsson went back to the trees and broke off some long branches to stick in the sand. He strung up more of the gauze strips as a drying line and hung the meat over it in strips, as Tarr stuck more chunks of meat in the coals to cook. By the time they finished, some of the meat was ready and Larsson squatted down beside Tarr to eat. The meat was greasy and had a slightly gamey taste, but considering how hungry he was, it tasted delicious and they both ate until the grease was running down their chins.</p><p>“It’s good to see you feeling better,” Larsson said between mouthfuls.“Are you completely healed?”</p><p>Tarr stood up, looking up and down his body.“Yes, and needing a bath, I think.” He looked down at himself, even bloodier now that he’d butchered the gafin-like creature.“I think I’ll take a dip in the river.”</p> <p>Larsson shook his head.“We don’t know what kind of wildlife might be in there.”</p><p>Tarr looked at the blue water and the slow current and shrugged.“I’ll take my chances. I found a place downriver that’s not too deep. Come on. The sun will be setting soon, and this heat is awful. Wecan cool off and clean up at the same time.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He got up then and walked back in the directionhe’d come in dragging the gafin. Larsson followed him doubtfully. Hewasn’t really afraid of anything that might be lurking in the water. Hedidn’t want to see Tarr take off his clothes again, though. He might not be able to restrain himself this time. Still, he was finding it harder to let him out of his sight, so he trailed along behind him, keeping his distance.</p><p>Just as the river took a turn around the cliff face, Tarr disappeared around the bend and as Larsson increased his pace to keep up with him, he saw the place he was talking about. Here the water was much more shallow, mostly gravel and sand bars and the waters around them were almost calm. Larsson watched while Tarr waded out into the cool water, and sat down near a sand bar, so that the water came half way up his chest.“Come on, Larsson. Enjoy yourself for once and don’t worry about every little thing.”</p><p>“Somebody has to,” he muttered, but he sat down on the bank and started taking off his boots. Tarr had started floating on his back, his golden skin shimmering a little in the bright sunlight. Larsson stopped watching him, since he didn’t want to embarrass himself with a huge erection—something else for Tarr to tease him about, and he had enough ammunition as it was.</p> <p>He turned his back and took off his clothes, glancing over his shoulder to make sure Tarr wasn’t watching. He was angry at himself for acting like a prissy virgin—he’d been naked around other men for years, both when he was in the Academy, and even with his cousins when they traveled together. Casual nudity in such close quarters was inevitable and commonplace. No one thought much about it one way or the other. But with Tarr, right from the first time he saw him, it was different. Tarr was his mate, no matter how much he wished otherwise, and being around him was hard enough as it was. Being around him when they were both naked was almost more than he could stand.</p><p>He waded out in the water while Tarr was still floating and came over to sit down in the water near him. He was covered from the waist up, so he was surprised when Tarr glanced over at him and startled violently, almost sinking himself. He sat up, spitting out river water and pointed at a mark on Larsson’s chest.</p><p>“What. The hells.Is that?”</p><p>Larsson looked down at himself in confusion.“Oh, this bruise? That’s where your men hit me with the disruptor. Made a bruise—I thought it might.”</p><p>Tarr looked stunned. He stood up and walked slowly toward Larsson in all his naked glory, kneeling in front of him and touching the dark blackish-purple bruise with the tips of his fingers. “I’m so sorry, baby. I told them not to hurt you. I told them! Thoseidiots!” His face had turned an angry, mottled red and his eyes were blazing. “If I get my hands on them again...”</p> <p>“It’s all right,” Larsson said, trying to turn away, but Tarr grabbed his arm and pulled him up so that he was sitting on Tarr’s lap. His legs had nowhere to go but around his waist, bringing their wet bodies together. The feel ofTarr’s naked, wet skin, not to mention his stiff cock against Larsson’s ass made his wolf leap within him. He tried to push Tarr away, but he held him in a firm grip, bending his head to lick at the bruise gently, before raising his head and plunging that tongue into Larsson’s mouth, holding his hand at the napeof Larsson’s neckso he couldn’t get away.</p><p>After struggling for only a moment or two, Larsson found he no longer had the strength to move away. Tarr pulled back and looked down at him. He growled deep in his throat and bent again to brush his lips over the bruise with exquisite tenderness, before he moved over to each one of Larsson’s nipples. His tongue flicked out and traced over the areoles, causing Larsson to arch against him. “I’m so sorry, my little warrior. I should have known you’d fight them.”</p><p>Tarr’s words whispered over his flesh, and he shuddered at the sensation, unable to stop the small whimper that came from deep inside him. “Let me make it up to you, darling,” he whispered and one of his hands trailed down Larsson’s back and stroked gently at his entrance.</p><p>“No,” Larsson gasped and tried to pull away, but Tarr held him tightly. Larsson was shocked to find how much greater was his strength.“No, Tarr, please.”</p><p>Tarr held him by his biceps and gazed down into his eyes.“No? Don’t be frightened of me, darling. Iwould never force you, but I think...” he nibbled gently at Larsson’s ear. “I think you want this as much as I do.”</p><p>It was hard to deny the truth of that statement when Larsson’s cock was stiff with need and rubbing against Tarr’s stomach. Tarrran his hand down Larsson’s back again and massaged his lower back gently, his fingers dipping down to skim across his crease. Larsson’s body twisted into him with needs of its own and he fell down onto his chest, burying his face in the little nook between his shoulder and his neck. He needed to be close to his mate—he wanted it more than anything,and he’d waited so long to claim him.</p> <p>But what if Tarr meant to claim him? The thought caused unease to wash over him and he stiffened as Tarr’s fingers found his entrance again. One of his fingers slid deep inside him then, breaching his body so intimately it made him squirm. He cried out to protest when the finger suddenly slid over something inside him. Sensation overwhelmed him and he cried out again, but with surprise and pleasure this time and pushed his ass back on Tarr’s finger, seeking it again. He buried his face deeper in Tarr’s neck, embarrassed by how needy he felt, but when Tarr stroked over the spot again, Larsson almost screamed with pleasure.</p><p>He’d never bottomed before, not for anyone, and he suddenly wondered what he’d been missing all this time. He still yearned to bury himself deep in Tarr’s body, but this was a fine substitute. He flushed all over with pleasure and only squirmed harder when Tarr eased another finger deep inside. Hisbody was on fire with need and he couldn’t get enough of this feeling that was part pain and part pleasure.</p><p>Larsson almost cried out when the fingers were pulled away until Tarr shifted him slightly on his lap and he felt the hardness pressing insistently against his hole. He stiffened again and Tarr looked down at him with one raised brow, as if asking whether to continue. He tried to speak, to protest the intrusion, but hecouldn’t. He wanted this too much. Instead he ducked his head again and kissed the side of Tarr’s neck, holding tightly to his shoulders.</p><p>He’d braced himself for pain, for an overwhelming breach of his most intimate place, but as the head of Tarr’s cock pressed gently but insistently into him, there was only a feeling of discomfort and fullness, no real pain.Tarr’s kisses were making him weak, and he moaned as the thick, hot flesh throbbed at his entrance.Clenching his fingers on Tarr’s shoulders, he looked up to tell him he’d changed his mind. This wasn’t what he liked, wasn’t what he wanted. But the look on Tarr’s face stopped his protests.</p><p>The expression on his face was fierce and possessive. His lips were drawn back in a feral grin and his eyes were hard with urgent need. There was nothing of withdrawal or surrender in his face, and Larsson knew he was lost. His protests died on his lips as Tarr took him with a hungry need, whispering to him, murmuring something he couldn’t understand. He wrapped a hand around Larsson’s cock as he pulled him down hard on his cock and the muscles at his entrance gave way to his need. He soon set up a wild rhythm that drove Larsson out of his mind.</p><p>Tarr was inside him, taking him, claiming him, and nothing would ever be the same again. Even though his rational mind told him that this was intolerable, that he couldn’t be claimed like this, another part of him reveled in it, and wanted this more than anything. Tarr was so deeply inside Larsson that his heavy balls rested snugly against his ass. He could feel the throbbing of Tarr’s heartbeat deep inside and he pulled back to gaze into those fierce eyes once more.</p><p>“Mine,” Tarr said harshly.“Mine. My nobyo.Say it.”</p><p>When Larsson hesitated, Tarr took his arms and lifted him slightly before pulling him back down hard again on his impalement.“Say it. You’re mine.”</p> <p>Larsson winced and nodded, his mind overwhelmed.He’d never seen Tarr so out of control, so primal.</p><p>“Yours,” he finally agreed.“But you belong to me, too.”</p><p>Tarr moaned and began to thrust even harder, wild and passionate, his need calling to Larsson’s wolf. At the same time, Tarr’s hand tightened around Larsson’s shaft, dragging a response from him.Larsson’s claws appeared and his incisors dropped down as he fought with Tarr as if they were in a battle. Hegrabbed Tarr’s shoulders to lift himself and then slam himself back down, causing Tarr to grunt in pained pleasure. He lowered his face to Tarr’s neck again, but this time he bit deeply, burying his fangs in his flesh. As he did, Larsson came with a fierce intensity, his cum spurting out in the water between them. Tarr yelled out hoarsely as the venom from Larsson’s bite surged through his veins, and he, too, came with an intensity that was almost frightening.</p><p>Only afterward couldhe pull away and lick at the wound on the side of Tarr’s neck, which started to heal as soon as he put his tongue to it. It would heal over but leave a scar, marking Tarr as his mate. Larsson would have preferred the nape of his neck, but this would have to do. The mark would always show that Tarr was owned and off limits to any other lover. Between the mark and the fact that he would make damn sure Tarr would always have his scent all over him, no one would ever be foolish enough to touch his mate again.</p><p>Larsson sagged onto Tarr, clinging to him like a survivor of a storm. Larsson could imagine the venom racing through Tarr’s veins, changing him, making him his. He knew his skin must be glowing with fierce pride and triumph. Eventhough Tarr had claimed him thoroughly, he’d claimed Tarr right back, and neither of them would ever be the same again.</p><p>After a long time, Tarr raised his head and shook it, trying to clear his mind. Confusion and fever were aftereffects of the bite, and Larsson kissed his lips tenderly, sliding off his lap to sit beside him in the water and put an arm around him.</p><p>“Let’s go back—you need to lie down.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What did you do to me?” he muttered, looking at Larsson with an aggrieved expression. “I don’t feel right.”</p><p>Larsson stood up and pulled his mate to his feet, not an easy task considering Tarr’s size but he managed.“Come on. Lie down for a while. Thiswon’t last very long.”</p><p>“But what is it?Why do I feel so lightheaded?”</p> <p>Larsson wrapped an arm around his waist and led him out of the water. They got back up on shore and collapsed, their limbs tangling together. By this time, Tarr was only about half conscious, another repercussion of the bite. His skin was almost alarmingly warm to the touch. Larrson half-supported, half-carried him to the shelter and got him to lie down, then took the water tin to get cool water to bathe his forehead. He knew that new mates often ran a fever from the venom, but it was still alarming. If anything happened to Tarr, he wouldn’t be able to forgive himself.</p><p>The fever raged for at least an hour, with Larsson staying right by his side, drizzling cool water on his face and neck. Tarr seemed almost out of his head, mumbling nonsense and words in Tygerian that Larsson didn’t understand. Just when Larsson was considering taking him back into the water to cool his body temperature, the fever finally began to ease off, and Tarr slipped into what seemed to Larsson to be a natural sleep. Larsson stretched out beside him protectively and decided to close his eyes for a few minutes too.</p><p>Larsson awoke some time later when he felt a hard jab in his ribs.</p><p>“Wake up. What did you do to me, damn it? Why am I lying here naked and drenched in sweat?”</p><p>Larsson opened his eyes and yawned.“What do you remember?”</p> <p>“Not much, which is why I’m asking. Whatdid you do?”</p><p>Larsson couldn’t help the grin that spread over his face. “Well, I did give you the mating bite...that was just before you fainted.”</p><p>Tarr glared down at him.“I didn’t faint. You did something to me—wait a minute, you gave me the what?”</p><p>Larsson put his hands behind his head.“Faint...swoon...whatever. And I said I gave you the mating bite. You started it, you know. I was perfectly happy just to take a bath, but you practically attacked me.”</p><p>Tarr got an affronted look on his face.“I was simply concerned about the bruise on your chest.”</p><p>“Uh-huh. And then you hauled me up on your lap and attacked me.”</p> <p>“You didn’t exactly resist. Wait a minute—you bitme.” He put a hand to the side of his neck and rubbed it, grimacing.“Am I bleeding?”</p><p>“Oh for the gods’ sakes, no, you’re not bleeding. Such a baby.”</p><p>Tarr glared at him.“Well, then why do I feel so strange? Did I get a fever or something? Did you infect me?”</p><p>Larsson sat up and looked over at him.“In a way. I infected you with the venom from my bite. It’s what makes you my mate. I didn’t think I wanted you for a mate, because of who you are, but it really is kind of satisfyingnow that it’s done.” He grinned.“You know, realizing that from now on, there won’t be anybody else for you except me.”</p><p>Tarr gave him a sharp look.“What the hells are you talking about? And what do you mean, because of who I am?”</p><p>“You know, a slaver, a whore, an outlaw, a thieving, nogood Roger...in short, a Tygerian.”</p><p>Tarr cast him a furious glare.“I don’t remember you exactly pushing me away out there in the water. Me being such a no-good whore and all.”</p><p>“No,” Larsson said, smiling. “I decided to stop fighting it. The gods have seen fit to make you my mate, so I’ll just have to rehabilitate you.” He trailed a finger along Tarr’s jaw. “I think I can train you.”</p> <p>Tarr pushed his hand away, his eyes blazing.“I think you have it the other way around. It’s you who will betrained. I’ll beat you every day until you settle in and obey me like a good little nobyo.”</p><p>“You try to lay one hand on me and I’ll cut it off! No, I’ll cut you off! No sex until you straighten up!”</p><p>Tarr snorted.“If I want sex, I’ll take it elsewhere. There are plenty of men who would love to be my nobyo. You should be thanking me for making the offer!I’ll just find someone else who appreciates the honor of being my nobyo.”</p><p>“You can try...you won’t be successful, but you can try.”</p><p>“Oh, and why is that? Whatin hells are you talking about?”</p><p>“The uh...fever you had? It was from my venom.”</p><p>“Yes, so you said—so what?”</p><p>“So the Lycan venom makes certain changes in the bodies of our mates.”</p><p>Tarr’s eyebrows came together in a sharp frown. “What kind of changes?”</p><p>Larsson leaned back against the cliff wall behind him, really beginning to enjoy this.“Well, for one thing, you won’t be able to get hardfor anyone but me.”</p><p>Tarr’s mouth fell open in shock while his eyebrows almost reached his hairline.</p><p>He sputtered a few times, trying to speak, while Larsson smiled back at him benignly, enjoying his reaction.</p><p>“What the fuck are you talking about?” Tarr said hoarsely, finally finding his voice.</p><p>“You can’t get it up for anybody but me. I’m your mate, Tarr, so that shouldn’t pose a problem.” He grinned at Tarr again.“You’re all mine, baby.”</p><p>Tarr rubbed a big hand over his face.“I-I’ll kill you. That’s what I’ll do. I’ll fucking kill you.”</p><p>Larsson shrugged.“You can try...”</p><p>Tarr suddenly grabbed his stomach and doubled over with a sharp cramp. Larsson sat forward and rubbed a hand on his back, a self-satisfied smile on his lips.“Stomach cramp, Tarr? Oh yes, that’s another little side effect I forgot to mention. That’s from the venom in the mating bite.”</p><p>“What the hells do you mean? You mean when you bit me, it made me sick? Are you trying to kill me?”</p><p>“No, nothing like that. It’s what happens to the mate when he isn’t pleasing his alpha or when he’s misbehaving. It’s all part of learning to become a good mate. Like I said, it’s because of the venom.”</p><p>“What in hells are you talking about? I’m a Tygerian!I’m not in your fucking pack!”</p><p>“Well, technically you did become a member of our pack when we mated. All pack members have to learn discipline, and since I’m your alpha now, you have to obey me. When you don’t, you might get that stomach cramp.”</p><p>Tarr jumped to his feet in outrage and stomped off, kicking the blankets and the water tin out of his way as he went. He got as far as the fire when he whirled around and pointed a long finger at Larsson.“You’re notmy alpha. We don’t have alphas, for the gods’ sake. You take this off me right now! Whatever curse this is—take it off!”</p><p>Larsson shrugged, holding out his hands.“I can’t. There’s nothing you or I can do about it now. Unless, of course, you leave me. Or if I die. Then the effects should wear off—eventually.”</p><p>“What do you mean byeventually?”</p><p>“A few weeks...or months...depending on how strong the bond is. You seem pretty crazy about me, so it may take you longer.”</p><p>Tarr took a few steps back toward Larsson, his hands clenched into fists at his side.“I’m not joking, Lycan. Take it off or so help me, I’ll...”</p><p>Larsson scrambled to his feet and squared off against his mate.“You’ll do what? Bring it on, Tygerian.I think it’s about time we had it out once and for all.I’m sick of your threats.”</p><p>Tarr looked surprised, but a feral grin soon formed on his lips. Absently, he rubbed his belly, and Larsson knew he was having pain, but was just too damn stubborn to admit it or give in to it. Tarr took another step toward him.“If I fought you, I’d destroy you, you puny pup.”</p><p>Larsson took a step closer to him and grinned.“Then you have nothing to be afraid of, do you?” He crooked a finger at him.“Here, kitty, kitty, kitty.”</p><p>With a loud growl deep in his throat, Tarr dove for him, catching Larsson around the waist and slamming him into the ground, though he took much of the weight from the fall on himself. He rolled to his back, both arms around Larsson trying to trap him in a choke hold, but Larsson had seen it coming and had time to get one hand up between them before he crashed into him. He shoved this hand up and into the underside ofTarr’s chin, making him loosen his hold as he fell backward. Larsson rolled back to his feet and fell on top of Tarr, wrestling his arms up over his head and holding them there, leaning as much of his weight as he could on them.</p><p>Tarr grinned up at him and heaved his body over almost without effort, trapping Larsson under him. Larsson was momentarily shocked at this reminder of his strength. He tried to pull his hands away, but Tarr’s strength was too great. All he could do was turn his head to the side as Tarr pulled back his fist and smashedit into Larsson’s jaw.</p><p>The pain was blinding, even though Larsson knew he pulled his punch, trying only to subdue him rather than really hurt him. Still Larsson gave a little whimpering cry and went completely limp, letting his eyes roll back up in his head.</p><p>Tarr hesitated, staring down at him. Then he shook Larsson, gently at first and then harder. “Wake up! I barely touched you!”</p><p>Larsson continued to play dead, holding his breath. Tarr, sitting astride his chest, pulled him up into an embrace and shook him again.“Stop this Larsson. Stop it!Wake up, damn you!”</p><p>When Larsson ignored him, keeping his eyes closed and his mouth slightly parted, he could hear a hint of panic in Tarr’s voice. “Larsson! Baby! Nobyo, wake up.I’m sorry I hit you, nobyo. Please!”</p><p>Larsson let his eyelids flutter a bit, and Tarr kissed him soundly, then trailed kisses all down his face where he’d struck him.</p><p>Larsson fluttered his eyelashes again and allowed his eyes to drift slowly open. Tarr heaved a huge sigh of relief.“Are you all right?” he asked, kissing him again. “I didn’t mean to hurt you. I didn’t even hit you that hard.Speak to me, sweetheart.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Four</p><p>Larsson raised one hand weakly and let his fingers trail down the side of Tarr’s face. Without warning, Larsson grabbed his ear and twisted—hard.</p><p>“Ow!” Tarr surged backward, trying to get away and Larsson followed him down, still twisting the ear savagely.</p> <p>“You’re tearing my ear off!” Tarr yelped, and Larsson grinned down at him.</p><p>“Do you give up?”</p><p>“Yes, yes, damn you, I give up! Let go of my ear!”</p><p>Larsson let go and stood back on his feet, dusting himself off. Tarr sat up on the ground by his feet glaring up at him and holding a hand protectively over his ear.“You just pretended to be knocked out!” he said accusingly. “There was nothing wrong with you!”</p><p>Larsson tapped his forehead and smiled.“Brains, Tygerian. They win over brawn every time.”</p> <p>Tarr continued to glare up at him, just as a whizzing sound and a soft thud filled the air. Tarr glanced around in confusion and then back up at Larsson.</p><p>Larsson had a strange look on his face, and his eyes had glazed over. As Tarr watched, he slowly and gracefully collapsed forward, falling into Tarr’s arms. To his horror, Tarr saw a dart imbedded in his back. He pulled it out savagely and gathered his lover close to him. He was still breathing, thank the gods, but he seemed to be deeply unconscious. Backing away warily, with some half-formed idea of getting his back to the cliff wall and using the lean-to as a shield, Tarr saw movement in the trees. He growled deep in his throat, a fierce rumbling sound that was answered almost at once from more than one shadowy patch in the trees. One by one, figures stepped from the foliage and showed themselves.</p><p>There were at least six of them and they were tall, some as tall as Tarr himself. All had wild manes of hair in colors ranging from gold to an orangey red. Powerfully built, they wore animal skins around their waists, leaving their chests bare and displaying lean muscles and a wide expanse of golden brown skin, with black tiger stripes running just beneath the skin. As they stalked closer, Tarr saw they all had slanted eyes of gold-green. Tygerians! There was no mistaking their distinctive appearance, but what could they possibly be doing here? Dressed like this? Putting Larsson down carefully on the ground behind him, he stood to face them as they approached.</p><p>“Holayo,” one of the ones in the front of the group said, using an archaic form of Tygerian that once served as a greeting on Tarr’s home planet.</p><p>Tarr nodded, a slight inclination of his head. These men had injured his mate, and if Larsson was dying, he would take great pleasure in ripping out their throats. “Holayo,” he replied in Tygerian.“Who are you? What are you doing here?”</p><p>Their leader, or at least the one who seemed to be the spokesman for the group, tilted his head slightly.“You speak strangely. I understand your words, but your accent is odd. You are Tygerian, correct?”</p> <p>“I’m Tygerian. And if you think I speak oddly, you should hear yourself. Who the fuck are you? Why have you attacked us? Ifyou’ve injured my nobyo, I’ll take great pleasure in killing you.”</p><p>The man looked surprised, and several of the ones closest to him made a snarling sound and stepped closer in an uneasy fashion, darting savage looks at Tarr. The leader shook his head and held up a hand to stop them. They stopped where they were, but still glared at Tarr with undisguised hostility.</p><p>“I am Rabb Seneca.” He glanced down at Larsson briefly before gazing back into Tarr’s eyes.“Your nobyo? But he is Lycan, yes? We saw you struggling with him and thought he had injured you. The dart we shot into him is not lethal.It will only make him sleep.”</p><p>Tarr grunted a response and bent down to check Larsson again. He seemed to be breathing all right, but Tarr was still furious that the group had attacked his nobyo. He tried hard to swallow his anger and stood to face them again.“He seems to be all right for now. You should pray to your gods that he is.”</p><p>The man nodded carefully.“I apologize if I damaged your property, but he should be fine.”</p><p>“What are you doing here?” Tarr asked again. “Where are your ships?”</p><p>Rabb tilted his head again in that odd fashion.“We live here. Our ship wrecked on this moon many cycles ago, and we’ve lived here ever since.” He glanced over at the wreckage of the shuttle, still on the shoreline behind them.“I can see that you’ve had some difficulties of your own.”</p><p>“Yes, you might say that,” Tarr answered, as noncommittally as possible. He wasn’t sure if he believed the story of a shipwreck or anything else this man might have to say. They were undoubtedly Tygerian, and they did seem to speak in an older, archaic form of the language, but it was a form that hadn’t been spoken on his home planet for hundreds of cycles. Surely he wasn’t to believe that they’d been here all that time. Until he knew what and who these people were, he needed to be careful and tell them very little.</p> <p>“Are you with the other group? The ones who landed here four days ago?”</p><p>Tarr’s head came up sharply. “Other group? What other group?”</p><p>“They claimed to be Nilaniums. They said their planet was destroyed when their sun supernovaed a long time ago, and they’ve been voyaging ever since.”Rabb glanced back over at Tarr’s wrecked shuttle. Their ship had similar markings.”</p><p>“My crew?” Tarr said excitedly.“Yes, I think they must be a part of my group, as you say. Did you say they landed here?So their ship is intact?”</p><p>Rabb nodded carefully.“Yes, the ship is fine. We have, of course, confiscated it, and have them in custody.”</p><p>Tarr took an aggressive step forward, noting the bristling of the Tygerians standing behind Rabb. “You confiscated it? It’s my ship. And those are my men. You’ll release them immediately.”</p><p>Rabb never flinched, just looked serenely back at him.“You’ll need to speak to my father. He’s our commander, and the decision is his.You can make your case to him.”</p><p>Tarr nodded.“Where is he? Take me to him.”</p><p>Rabb inclined his head rather regally, Tarr thought and made a motion to his men.“My warriors will carry your nobyoback to our camp.”</p><p>Tarr stepped in front of the one closest to Larsson.“No, I don’t believe they will. I’ll take him.”</p><p>Rabb smiled at him.“As you wish. Follow us then.”</p><p>“I need my clothes—for my nobyotoo.”</p><p>When they’d been surprised, they’d both been naked, and though Tarr was comfortable unclothed, he didn’t like the way the others kept stealing glances at Larsson’s beautiful body.</p><p>“Your nobyowears clothes?” Rabb looked down at him and then back up at Tarr. “Why?”</p><p>Ignoring him, Tarr stalked back the few steps to the lean-to and slipped into his pants. He found Larsson’s as well and quickly pulled them on his still limp and unconscious body, then gathered Larsson in his arms and hoisted him over his shoulder.He didn’t like carrying him like this, and knew Larsson would hate it—which kind of made him want to do it—but his nobyo was too damn big to carry any other way. The idea of the others having their hands on him didn’t set well with him at all, so he had no choice in the matter.</p><p>Rabb started back toward the trees with Tarr following him and the others filing along behind. As they left the shore of the river and entered the forest, the trees seemed to close ranks around them. Dense and an intense shade of green, they grew close together, and at first, Tarr could make out no discernible path through the undergrowth.</p><p>Finally, as his eyes began to adjust to the gloom he could just make out a faint path. Rabb seemed to follow it unerringly, so he stayed close behind him. Going deeper into the forest was like traveling back to the earliest beginnings of time, when nothing but foliage rioted on the planets and the moons and the big trees were kings. It was silent all around them, sound seeming to be muffled by the dense vegetation. The air was warm, thick, and sluggish. From time to time, a slight break in the canopy of the trees let in a single slash of sunlight that penetrated the gloom like a spotlight.</p><p>But the stillness around them wasn’t peaceful or restful. It seemed almost alive, like some huge implacable force brooded in the silence around them, plotting their destruction. It was unnerving, and Tarr shifted Larsson’s body closer to him, holding onto him tightly.</p><p>After an interminable time, they came out of the dense forest onto a broad plain, filled with tall grass that was a strange shade of orange. It felt dry and burned up, rustling around them as they walked through it and tangling in Tarr’s legs as if trying to stop him. He could see a settlement of some sort just beyond the thick grass. It consisted mainly of small timber houses arranged in a circle, with a larger house in the middle. The roofs were thatched with the thick orange grasses, giving the small village a distinctive look. Children came out of the small houses and ran to meet them as they came into the settlement, and Tarr was surprised to see both boys and girls, mixing together.</p><p>On Tygeria, the sexes never mixed. Procreation was accomplished by artificial insemination. The females lived in their own sectors, and were only seen in the male sectors when they were there on business or to visit their male children who lived with their fathers and his nobyo.When a pregnant female emerged from one of the houses then and one of Rabb’s warriors went over to stand protectively by her, Tarr stared around him in amazement. Many of these warriors seemed to live with their females.</p><p>Another of the warriors with Rabb peeled off to go to stand in front of a small house and called out loudly to someone inside. A young human male emerged, naked except for a scrap of cloth over his groin and quickly took the Tygerian’s weapons from him, standing on tiptoe to kiss his cheek and then bowing submissively from the waist—his nobyo, then. Nobyos and female mates living side by side with each other—this definitely was something Tarr had never witnessed or heard of before.And what in the gods’ names was a human doing here?</p><p>He saw no sign of his men, though it seemed like everybody else in the village came to gawk at them. He felt Larsson squirming on his shoulder and stopped to ease him down to his feet. His knees buckled under him, so that Tarr had to wrap an arm around his waist, but he seemed to be waking up. His beautiful long lashes blinked furiously as he tried to open his eyes, and his breath came in quick little puffs.Tarr couldn’t resist dropping a quick kiss on his lips and then murmuring in his ear.“Quiet now, baby. Let me handle this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He felt Larsson’s hands snake around his neck as he held onto Tarr, steadying himself. He looked up into Tarr’s eyes, his pupils still blown. “Wha-whahappen?Whajudo?”</p><p>“Shh...it wasn’t me. Now keep quietfor once and let me handle this.” He began following Rabb again, half-dragging Larsson along with him as Larsson fought to get his feet firmly under him.He dropped one of the arms around Tarr’s neck but still held on tightly, probably to keep from face-planting. Tarr was aware ofLarsson’s head swiveling as he stared around him in wonder at the village full of huge Tygerians.</p><p>“W-wher’re we? What’s this?” he asked, still slurring his words.</p> <p>“We were attacked by the locals,” Tarr whispered to him. They look like my people, but they talk strangely.” They were being led toward the big structure in the center of the circle of houses.Tarr bent toward Larsson’s ear again. “Let me do the talking. I told them you’re my nobyo.”</p><p>Larsson turned those huge, dark red eyes up toward him, but they still had a glazed look and Tarrhoped he’d understood. It was imperative that he pretend to be submissive in front of these people and for Larsson, Tarr knew that would be a stretch, to say the least.</p><p>He followed Rabb through a small door they had to bend over to enter through, but when he straightened, the room inside was large with a great deal of light streaming in. Rabb led them up to a long table, the center position occupied by an older Tygerian male. He was tall and lean with a mane of white hair around his face. Rabb stopped in front of the man and bowed deeply. He motioned back toward Tarr.</p><p>“Father, we found this man in the forest, along with this Lycan, whom he says is his nobyo. He wouldn’t give us his name.”</p><p>Tarr looked up in surprise.“I never refused to give my name. You never asked me properly.”</p> <p>Rabb turned to look at Tarr in surprise and the older man waved at him to stand back.“Then please pardon our manners, sir. My name is Julan Seneca, and I am the leader of this settlement. Would you be so kind as to give us your name and tell us how you came to be here on Ravnia?”</p><p>“Ravnia?”Tarr grinned. “Is that what you call it? I thought it was just some numbers and letters.”</p><p>“Yes, but since we came, we decided to name our world. It helped us to feel more...at home.”</p><p>“And just how did this come to be your home?”</p><p>“I’ll be glad to tell you, but would you first honor me with your name?”</p><p>Tarr gave a brief bow. If the man wanted formality, he’d get it. “Of course, Julan Seneca. I’m Tarr Bonnet, and this is my nobyo. Your men shot him with a dart containing, they said, a sedative.If he suffers any ill effects, I’ll be most unhappy.”</p> <p>Julan nodded gravely. “Certainly. But he should be fine. I can have one of our physicians check him if you like.”</p><p>“Maybe later. Your son tells me you have my men as your prisoners. I need them to be released immediately.”</p><p>Julan frowned.“Your men?”</p><p>Rabb leaned over next to his father’s ear and whispered something to him. He nodded again and smiled at Tarr.“I see. There has been a bit of a misunderstanding. Your men landed here on Ravnia several days ago, but of course we had no idea they belonged to a Tygerian.”</p><p>“Well, now you do, and I’d like them to be released. Ineed their ship as well.”</p><p>“Unfortunately, that willpose a problem.”</p><p>Tarr took a deep breath.“What kind of problem?”</p><p>“We rarely get young men here on our world, and I’m afraid many of the young Tygerians have spoken for them to be their nobyos. So many, in fact, that we decided to have a bit of a competition to make it all more interesting.”</p> <p>“What in the fuck are you talking about? Theyaren’t love slaves! They’re all members of my crew!”</p><p>“Of course, I understand,” he said, with maddening patience.“But you have to understand our situation here as well. Once you know our history...You see, we originally came here from Tygeria many, many cycles ago. Back when Tygeria decided to separate the males and females into separate sectors.” He smiled over at his son.“But I don’t want to keep you standing here without refreshment. Please allow my son to show you to your room and once you settle in, he can bring you back here for a nice talk.”</p><p>“I prefer to talk now, if you don’t mind. Tellme about my men.”</p><p>Though his lips tightened with disapproval, Julan inclined his head graciously.“As you wish then. Come and sit beside me, and I’ll tell you about us.” He gestured to a bench next to him and Tarr moved over to it to sit down. He was still supporting a strangely quiet Larsson by an arm around his waist, but when he sat down, he pushed Larsson to a place by his feet. Larsson looked up at him in surprise and then in dawning outrage and scrambled to get up. Tarr pressed down hard on his shoulders and leaned over to whisper fiercely in his ear.</p><p>“Will you stop it and just be still? These people are Tygerian and seem to be pretty oldfashioned.You’re supposed to be my nobyo and nobyos sit by their master’s feet. Work with me.”</p><p>Larsson shot him a killing glance, so Tarr bent his head near his ear.“Please, baby,” he whispered, and Larsson finally subsided a bit, settling in next to his legs.</p><p>Larssondidn’t seem to know what to do with his feet, so he stuck them straight out in front of him, making the other warriors step over him to take their own seats. Tarr smothered a smile and sighed before turning his attention back to Julan.</p><p>Tarr was offered tea, which he declined, and shifted impatiently in his seat.“Please, Julan Seneca, explain to me about my men and theirship.”</p><p>“Of course. As I was saying, we first came to Ravnia when overpopulation became such a serious issue on Tygeria. We were told we had to give up our wives and take male lovers. Our wives would live in separate sectors. For some of us, this was intolerable. Of course, like all of our race at that time, we were poly-sexual, and liked both men and women. We loved our male nobyos, but some of us were quite attached to our female mates and children as well. We protested the new laws vociferously, but were overruled by the priests, who violently opposed birth control.Our religion, as I’m sure you know, forbids it. For the priests, abstinence was the only acceptable alternative. Inthe end, we weren’t left with any options. Those of us who still vehemently opposed the laws kept opposing and were finallybanished.”</p><p>Tarr shook his head unbelievingly.“I never heard any of this.”</p><p>“Because the government suppressed it. It’s one way to deal with dissension, you know...just sweep it away and bury it. We were sent to one of the sister planets of Tygeria.” He motioned up vaguely in the sky.</p><p>“We were given supplies to last for a year or so. But we were caught in a meteor storm as we entered the planet’s atmosphere and our ship was badly damaged. We were entering the outer atmosphere at extremely high speeds on parallel trajectories with the storm, and we simply got caught up in it all. We sent out a distress call that was never answered, but we managed to pull out of it and land here on this moon. We considered ourselves very lucky indeed to find a moon that was so hospitable, and we’ve been here ever since.”</p><p>“And you’ve survived all this time.”</p><p>“Yes, and we’ve thrived. We continued to have our females with us and our male lovers. We have no worries about overpopulation, of course, so we enjoy our females as we like. We also take male love slaves.”</p><p>Larsson shifted uneasily by his feet, and he put a hand on his shoulder.“I see.” He quirked up an eyebrow.“And is this how my men fit into the situation?”</p><p>Julan shrugged.“Over the years our male love slaves died out, of course, and there was no way to replenish our stock. We have had traders who stop by from time to time, usually about once a cycle or so. They bring us certain goods from other worlds, but we have little to trade, other than animal skins and some produce from our farms. On occasion, they bring in male love slaves, and as you can imagine, over the years, they have become quite a prize. We have our own females, naturally, but males suitable to be our love slaves are few and far between.”</p><p>“Like the little human I saw as I came in?”</p><p>“Oh yes, lovely, isn’t he? He belongs to my younger son, Ranon Seneca. Ranon is one of our very best warriors, second only to my son Rabb. He was able to win him, you see, in a competitionjust after Rabb had mated with his female and expressed no interest in the human.”</p><p>Tarr was beginning to get a very bad feeling about all this. “A competition?”</p><p>“Yes. A Game. Surely you still have them on Tygeria.That world couldn’t have changed so much. A competition among our warriors for their choice of a nobyo. We have one planned for your men. Your former men, I should say. They—along with your very beautiful nobyo—are now prizes to be won in our Games.”</p><p>The next few minutes were rather chaotic and Tarr never remembered afterward if it was he or Larsson who jumped up and took Julan Seneca to the ground. Possibly both of them. All he knew was that when the red haze over his vision cleared, he was locked in a cell in a small, stuffy, hut-like structure, and Larsson had been thrown into a cage nearby. By straining a bit, he could just make out the top of his curly brown hair thrust up against the bars of the cage.He’d tried calling to him earlier, but had gotten no response.He was afraid they’d knocked him out again with another dart.To the best of his knowledge, Larsson had still been fighting when he’d been dragged away by four or five or their warriors.</p><p>Just in front of Tarr was a cage holding one of his men.The hut wasn’t large enough to house more than the two cages and the cell, and he was thankful that he and Larsson had been put in the same hut at least.</p><p>The man in the cage nearest him was a young Rogernamed Jaxper, a cook in the ship’s galley, if his memory served him right. He was hunched up naked in a corner of the cage, a few big bruises staining his backside had faded to yellow at the edges. He was dirty, and their captors had shoved in a small pan of water for him that he was taking a drink from as Tarr regarded him. Using his hand to scoop it up, Jaxper turned and saw Tarr watching him, and his face turned red. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“They don’t feed us much, Captain, so the water helps a bit. I think they want us weak for the Games.”</p><p>Tarr was a little startled.“You know about the Games?”</p><p>“Oh yes. One of those big Tygerian took great pleasure in telling me all about it while he was whaling away on my ass.”</p> <p>Tarr shook his head.“Are you all right? That looks pretty painful.”</p><p>Jaxper shrugged.“I always bruise easy, and that big boy didn’t seem to know his own strength.He wouldn’t fight me like a man, though I’m sure if he did, I wouldn’t be around to tell the story,” he said with a chuckle. “He just pulled me down over his lap and blistered my ass for me. He called me his ‘little nobyo.’”</p><p>Tarr had the good grace to feel embarrassed at this, and he felt his cheeks heat up.“Well, that’s what Tygerians call their, uh...male lovers,” he explained.</p><p>“Oh yes, sir, I know. I tried to tell him I like the women. I mean, naturally a man has to take his pleasure wherever he can, and there have been times on long voyages that I...” He shrugged and smiled.“Mostly I like the women.”</p><p>“Hmm...” Tarr replied, as noncommittally as he could. If these people had their way, Jaxper wouldn’t get a chance at ‘the women’ ever again.</p> <p>“’Course it don’t matter what I prefer, I guess. Not any more, anyway. I’ve about made up my mind not to fight it any more. That little human comes in sometimes to feed us, and he says the Tygerians here are good to their nobyos. Treat them well.”</p><p>“Oh—well—good.”</p><p>“I was sort of hoping, though, sir, since I saw them bring you in, that you might be able to get us out of here.”</p><p>“I’ll try my best, Jaxper. I promise you that. Can you tell me what happened to your shuttlecraft?”</p><p>“I don’t exactly know. They took it away, of course. I overheard one of them talking about using it for spare parts.I understand a little Tygerian, though these folks don’t talk it like you do.”</p><p>“They’ve been here a very long time—it’s an old form of our language.”</p> <p>“Oh. Well, that’s all I could understand, anyway.”</p><p>“I’ll do what I can for you, Jaxper. I hope you know that.”</p><p>“I do, Captain. Maybe it won’t be so bad. That Tygerian is good-looking enough.I just don’t like the idea of being anybody’s slave.”</p><p>Tarr nodded, but before he could say more, the door to the room opened and Rabb Seneca, the Tygerian he’d first met—the one who’d attacked his nobyo—strode confidently in and up to his cell.</p><p>“Tarr Bonnet,” he said, addressing him by his full name in the old style. “We regret having to put you in thiscell, but we couldn’t seem to get you and your nobyo to stop any other way. We actually had to shoot him with our darts. He is very badly behaved, you know.”</p><p>Tarr nodded.“Yes,” he replied shortly.</p><p>“We have no wish to hold you here, of course, and as soonas the trader comes again, we’ll send you on your way.”</p><p>Tarr looked Rabb up and down and gave him a dangerous little smile.“Without my nobyo and my men, of course.”</p> <p>Rabb lifted one shoulder.“Your so-called men belong to us now. We lay claim to the ship and the men as salvage. There are two or three we might allow you to purchase back from us— the ones past their prime. The others will remain here.” He glanced over his shoulder toward Larsson’s cage. He still wasn’t moving and Tarr was getting increasingly worried about him. He must have made a low growling noise because Rabb looked back at him with a grin.</p><p>“He’ll stay here too, of course. He’s quite beautiful for a Lycan. An unusual choice for a nobyo.I imagine he’s been a handful for you.”</p><p>It took everything in Tarr to keep his voice on an even level.“He’s mine. Are your people thieves, then?If you were worthy of the name Tygerian, you wouldn’t poach on another man’s nobyo.It would be unthinkable.”</p><p>Rabb smiled at him, but something flickered in his eyes.“I told you we consider your property to be salvage.You’re Tygerian, so we have no claim on you, of course. But your belongings are fair game.”</p><p>“My nobyoand my men are not ‘belongings.’ What kind of people are you?”</p><p>“I might ask you the same. Your people—Tygerians—kicked us off our own planet and abandoned us many cycles ago. We owe them no allegiance, no consideration. Consider yourself fortunate we show you any mercy. Our trader would no doubt take you on as well. He might get a good price for you, since you’re not so bad looking yourself. ”</p><p>Tarr felt a slight burn in his stomach, but he’d lived by his wits long enough to have mastered the poker face.</p><p>“What about honor then? Do you owe none of that either? At least give me the chance to fight for my nobyoin the Games.” He glanced up at Rabb in time to see a flicker of something in his eyes.“Or do you have an eye on him yourself? Are you afraid you can’t beat me in a fair competition?”</p><p>Rabb showed him his teeth in what could have been a smile, but didn’t feel like one.</p><p>“Your father said you were the best warrior on this world. Surely you’re not afraid of me.”</p><p>“I’m afraid of nothing, Tarr Bonnet.”</p><p>“Then accept my challenge. Fight me in the ring for him. If you win, I’ll go with the trader and leave him with you.If I win, you’ll give him to me and we’ll both leave when the trader comes.” Of course, he was lying. Either way, if Tarrsurvived, he’d be back for this son of a bitch, and while he was at it, he’d destroy this place and rescue his people. He tried to keep all this off his face though, as he faced Rabb.</p><p>Crossing his arms, he waited rather impatiently for Rabb to take the bait. As the son of the leader, this young man was used to being a big fish in a very small pond. He radiated attitude. His hair was a cap of curly blonde hair, and he had skin that was tanned and smooth. He was younger than Tarr had first thought, and he was trying hard to keep his expression neutral— trying and not succeeding very well.</p><p>Tarr decided to prod him a bit more.“Of course, your training must be limited at best. Perhaps you’re afraid a real Tygerian warrior, trained in the ring, will only show you up. Allow your people to see you for what you really are—an amateur trying to pose as a warrior.”</p><p>Rabb tried on the ghost of a smile that didn’t quite reach his eyes. “I know you’re trying to bait me.”</p><p>Tarr fixed him with a fierce look intended to let him know his patience was wearing thin. “Well, what will it be? Will you hide behind your father and steal my nobyo or will you face me in the ring and fight me for him like a man?”</p><p>A nerve twitched in the other man’s jaw as Tarr stared steadily back at him, waiting for his answer.“I’ll fight you, Tarr Bonnet,” he said, his voice low and dangerous.“And when I leave you bloody and beaten in the ring, I’ll fuck your former nobyo right in front of you and let you see how he reacts to being taken by a real man.As you listen to his cries of pleasure, I’ll decide whether or not to let you live or simply put you out of your misery.”</p><p>“You can try, cub. You can try. In the meantime, let me out of this damned cell. Or are you too afraid of me?”</p><p>Rabb snorted with contempt and pulled a key from a pouch tied with a thin leather strip around his waist. He unlocked the cell and glared at him before stepping aside.“If you attack my father again or any of our people, youwon’t live to see the ring.Don’t try to release any of your men, either.We’ll be watching you closely.”</p><p>Tarr gave him a sarcastic little salute and stepped out, crowding him backwards. Rabb motioned toward the door, but Tarr shook his head.“I’m going to check on my nobyo. And if he’s been injured or messed with in any way, you’ll never live to see the ring.”</p><p>Rabb didn’t reply, but Tarr could feel his glare boring a hole in his back all the way down the aisle. Whenhe reached Larrson’s cage, he squatted down in front of it to look him over closely. He seemed to be sleeping, his chest rising and falling rhythmically, neither too fast nor too slow. He’d been stripped naked again, so they’d had their hands on him, a fact that made Tarr’s gorge rise. He took off his shirt and wrapped it around Larsson’s hips as best he could through the bars.</p><p>Hedidn’t appear to be injured, other than a bruise on his forehead, which could have happened in the crash—it was already changing colors a bit. Tarr caressed his face and cursed himself for taking Larsson the way he did in the first place and getting him into all this. Tarr should have come to him in the proper way and made an honorable offer tohim, but he hadn’t been able to resist putting a price on his head to taunt him and make him angry. It all seemed so foolish now and he regretted it deeply.</p><p>Tarr stood back up and allowed Rabb to lead him from the room. He smiled down at Jaxper as he left, and nodded at him solemnly, hoping the young man would remember his earlier promise to him. Before he left, he turned back toward the cages and glared at Rabb.“I’ll come back tonight to feed them all myself. Fornow at least, they’re still my men and I’ll take responsibility for them.”</p><p>Rabb stared at him for a long moment before shrugging.“If you like. There are three other huts with the captives inside.It’s menial work, but perhaps that’s what Tygerians do now on the home planet.”</p><p>Deciding to ignore him, Tarr followed him out of the hut, and Rabb led him to a little shack of a house near the outskirts of the tiny settlement. It had no doors or windows and the interior was therefore dark and musty, but Tarr nodded. “Fine. This will do until the trader comes. When will that be, anyway?”</p><p>“We expect him any time. The Games are scheduled for tomorrow.You’ll be given your weapons then.Since you’ve challenged me, I’ll choose the first weapon to be used.”</p><p>“Knock yourself out. And I mean that literally,” he said with a grin. The younger man glared suspiciously back at him. Tarrknew he didn’t understand much of what he said. Tarr had lived with the Rogers for a many cycles and had picked up a lot of their slang, which they’d gathered from every corner of the galaxies.“I mean, that’ll be fine. I can beat you with any weapon you choose.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grinned at Rabb again, unable to resist taunting him. Rabb stiffened his spine and turned on his heel, casting one last remark over his shoulder.“I’ll send a servant with food later. You should eat well, Tarr Bonnet,and gather your strength. You’ll need it.”</p><p>“Asshole,” Tarr muttered as he sank down on the front step of the tiny shack. The lingering effects of the sleeping dart, along with the warm sunshine streaming down on him began to relax him enough that he put his head back to rest it on the doorframe. He had a few hours left before the evening meal, he figured, so he might as well try to get a little rest. Larsson and his men were safe enough for now, though he had to figure a way out of this for all of them.</p><p>He was looking forward to seeing Larsson again in a few hours, and hopeful that he’d be awake, or else he’d demand one of their so-called physicians to check him out. Of course, when he did wake up to find himself in a cage with Tarr’s shirt wrapped around him, Tarr knew there’d be hell to pay. Well, they hadn’t had a good argument in a few hours now. It was well past due.</p> <p>Chapter Five</p><p>Tarr awoke later to a feeling of unease. He was hot and sweaty and felt a little disoriented. He could tell from the light and the length of the shadows that it was late afternoon or early evening, just before their sun set. He saw what looked like a public well near the little center of the settlement and walked over to it. A large dipper was hanging from the structure built over the top of the well, so he drew a small bucket to wash his face and took a dipperful to drink. The water had a sweetish aftertaste but it refreshed him enough that he felt a little stronger.</p><p>He wandered back to sit down and wait for the servant who would bring the food for the evening meal. Determined to see Larsson and his men tonight, no matter what, he waited impatiently for the servant to arrive. Jaxper had said it was the little human love slave that belonged to Julan Seneca’s second son.</p><p>Tarr was having a hard time getting Jaxper out of his mind. His words when he was talking about his captivity kept coming back to haunt Tarr.’Course it don’t matter what I prefer, I guess. Not anymore, anyway.</p><p>For several years, Tarr had traded and transported love slaves to the farthest reaches of the galaxies. He had never before given them much thought, other than their value and what he could get for them. He hated the idea now, but they had been more or less livestock to him.</p> <p>Like all Tygerians, he had a contempt for other races. Not so much for the ones he lived and worked alongside, of course. They were always somehow different in his mind. He considered them to be exceptions, and he was only just realizing what an incredibly selfish bastard he was. These people here on this little moon had brought that message home loud and clear.</p><p>It was little wonder the Alliance had such a large bounty on his head. His father’s nobyo, the man who reared Tarr and his brother Taz, was a handsome, intelligent human with soft, hazel eyes, who’d been captured during a battle with the Alliance. Tarr had loved the man probably more than anyone else during his childhood, and when he passed away when Tarr and Taz were teenagers, they’d both been heartbroken. Yet Tarr had no idea what his life had been like before he came to live with their father. Was he married back on his home planet? Did he have other children? With a feeling of horror at their egotism and selfishness, Tarr realized he had no idea. He sent up a sudden, fervent prayer to his gods that the man had found some portion of happiness with his family on Tygeria.</p><p>Dashing away the hot tears that had sprung to his eyes, he sat down hard on the step of his little shack, overwhelmed at the idea of all the nobyos on his massive home planet who were there unwillingly, having been captured or even in some cases, kidnapped away from their homes. He, himself, had brought Kyle Balenescu there for his brother with absolutely no qualms at all. It was only because of the sheerest, most incredible luck that Taz had turned out to be Kyle’s mate. Or was it the infamous curse at work—the one the Balenescus kept talking about? It still didn’t take away his own culpability, and it made him feel sick.</p><p>He’d planned to do the same thing to Larsson, even though he knew now that he was in love with him and probably had been for a long time. He realized that fact when he saw him in the cage and knew without a shadow of a doubt that he’d willingly give up his own life to free him. He just wasn’t sure where to sign up for that. He’d do everything he could to win the contest between him and Rabb Seneca, but what if he were killed? Had he condemned Larsson to a life of sexual servitude?</p><p>Hearing the human love slave approach, he looked up and saw the little human weighed down with two large buckets of what smelled like stew. Tarr went over to help him, taking one of the large buckets and the boy looked up at Tarr in surprise.</p><p>“I can get it, sir.” The young human wouldn’t look him directly in the eye, but gazed somewhere over his left shoulder.“My master said you wanted to go with me while I fed the men?”</p> <p>“Yes,” he said. “Thank you.” He looked the young human up and down, noticing the small codpiece he wore as his only clothing.“What’s your name?” Tarr asked.</p><p>The human looked startled.“Uh...my master doesn’t like me to say my old name. He says I need to forget my past.”</p><p>Tarr nodded.“I promise I won’t tell him. What is it?”</p><p>“Billy Morris,” he replied. “I was taken from an Earthen settlement a year ago.” “And how old are you, Billy?”</p><p>“Nineteen, sir.” He glanced around behind him. “We should go now, sir. My master is jealous of you. He didn’t like it when Rabb Seneca told him you were going with me.”</p><p>Tarr nodded.“Lead the way then. Ihave no wish to cause you any difficulties.”</p><p>The young man turned and hurried back the way he’d come, taking Tarr to a group of huts just beyond the perimeter of the settlement. As he followed the young man, he tried hard to look at the back of his head and not at the muscles bunching in his pretty little backside as he walked. He felt enough of a pig as it was.</p><p>They went to each shack in turn and Tarr found that six of his men were still alive. They told him that two had died on board the ship and one from his injuries after they’d arrived. They were gratifyingly happy to see him, especially considering the fact he could do very little for them. The two older men were ecstatic to hear that he would be buying them back from the Ravnians, since they’d been given a very strong indication that they’d be disposed of since they had little value to them. Hemade assurances to the other four that he’d do what he could and that he’d come back for them if he managed to get off the moon with the trader.</p> <p>They went into the last hut and found Jaxper looking well enough. He noticed in passing that he was wearing a strip from his shirt wrapped around his genitals and knew that Larsson must have given it to him. Tarr gave him a pat on the shoulder and left the human to feed him while he hurried down to see Larsson.</p><p>His nobyo—he couldn’t seem to stop calling him that despite his earlier revelations because to Tarr, it meant beloved—was leaning against the back of the cage. He had fashioned himself a kind of diaper out of the shirt, though Tarr would have been boiled in oil before he would have called it that to his nobyo’s face. He could only imagine the scathing comments and the look he would get. It would take the skin right off him.</p><p>What was left of Tarr’s shirt was passed through Larsson’s legs and tied on each side at the waist, thus covering his groin and his rather delectable ass, a fact that Tarr was quite happy with, actually.</p><p>He opened his pretty red eyes and regarded Tarr with a narrow look.“What in the hells have you gotten me into?”</p><p>“Nobyo, I...”</p><p>He held up a hand to stop him.“Do not—under any circumstances—call me that stupid name again. Those, those—barbarians—pawed all over me with their hands when they pulled off my clothes and put me in here. Iwas stunned by their stupid dart and couldn’t shift to stop them.”</p><p>“You may not have been able to anyway if there were a lot of them and only one of you. I...”</p><p>“Stop. Stoptalking. I’m sick of Tygerians.”</p><p>Tarr was quiet for a long time as Larsson kept his eyes closed and heaved out one tired sigh after another. After several minutes, he opened one eye.“Damn it, you’re still here. Go ahead, talk.I can see it’s killing you.”</p><p>“Oh. Well...uh...what may I call you?”</p><p>He glared at Tarr.“I havea name.”</p><p>“Yes, of course. Larsson.They didn’t hurt you, did they? Or...mess with you in some way?”</p><p>“You mean rape me? No, but they put their damn hands all over me. One of them tried to kiss me.I almost bit his bottom lip off.”</p><p>“Good. I’m so sorry, nob—bab—Larsson.I’ll get you out of this, I promise.”</p><p>“And how do you propose to do that?” He glared at Tarr, pointing a finger in his face. “Don’t you dare do something stupid to make this even worse.”</p><p>“But bab—Larsson.I have to do something or Rabb Seneca will take you as his...you know.”</p><p>Larsson got a dangerous glint in his eye.“I’d kill him. The big, overgrown asshole. If not while he was raping me, then later. The man would have to sleep sometime.”</p><p>“I know, but I don’t want you to have to go through any of that. I got you intothis after all.”</p><p>“Yes,you did,” Larsson agreed bitterly.</p><p>“I admit it. So let me get you out. I’ve challenged Rabb to a fight in the arena. The winner gets you.”</p><p>“Do you have any idea how deeply humiliating that statement is to me? Or is that what you live for?”</p><p>“No! Nobyo, I mean Larsson.Please listen to me. I’d do anything to be able to trade places with you right now.” Tarr reached into the cage and tugged on his arm to urge him to move closer to the bars. “Please, baby.I love you.”</p><p>Larsson’s eyes widened at the words, but he softened a little and allowed Tarr to pull him toward the bars.Tarr reached through almost reverently and cupped Larsson’s face in his hands. “I love you. I have, for the longest time.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He pushed his face against the bars and pulled Larsson toward him, pressing his lips to Larsson’s, trying desperately to put all of his emotions, everything he was feeling into that one kiss. They were both breathless when he pulled back and whispered to him.</p><p>“I promise you I’ll do everything I can to get you out of this.Then I’ll take you home or wherever you want to go. If you still want me as your mate, I’ll do that too. I’ll do anything— anything to make this up to you.”</p><p>Larsson finally gave him the sweet smile he’d been hoping for. “Who are you and what have you done with Tarr Bonnet?” he asked with a grin.</p> <p>Tarr huffed out a laugh and kissed him again hungrily.“I mean it, sweetheart. I’ll get you out of this, I swear.”</p><p>A loud voice from the door startled Tarr and made him let go of Larsson’s face.</p><p>“What’s taking so long in here?” Standing in the doorway was Rabb Seneca’s brother, Ranon. He must have come to check on his human.</p><p>Tarr stood up and faced him angrily.“Who are you yelling at? I’m spending time with my nobyo and trying to comfort him after your stupid thugs had their filthy hands on him. Watch yourself, Ranon Seneca or else when I finish off your brother,I’ll come after you! I’m no little human you can boss around and pretend to be a big man with.You’ll find yourself bent over my knee out there in the ring with the flat of my sword across your ass.”</p><p>Ranon’s mouth dropped open and he made a choking noise as he bit back whatever words he wanted to say. He contented himself with one more murderous look as he pulled his nobyo furiously away and stormed out the door, slamming it behind him.</p> <p>Tarr knelt back down beside Larsson, who was doubled over in laughter. “That was fun. Are you really that good in the ring or do I have to worry about them hurting you now too?”</p><p>“I’m good enough to beat these fools.They’ve never been trained by real warriors like I was.”</p><p>“But they’re a little younger than you.”</p><p>Tarr shot Larsson a wounded glance, and Larsson smiled at him with affection.“Not nearly so pretty, of course, but maybe a few years younger.”</p><p>“It’s not age that counts.It’s skill, finesse, courage!”</p><p>“Yes, yes...but you’ll still be careful, won’t you? If my wolf sees them hurt you, you know I’ll shift right there in the ring. They’ll have to kill both of us.”</p> <p>“I know, baby, but let’s hope it won’t come to that.” He squeezed his hand through the bars and stood up.I’ll leave now and let you rest. If it’s any consolation, I’ll be sleeping on the floor of an old shack myself.I’ll probably toss and turn all night on the hard floor.”</p><p>Larsson nodded.“Thanks.That does help a little.” He smiled up at Tarr.“See you tomorrow. We’ll get out of this, one way or the other.”</p><p>“One way or the other,” Tarr agreed, and the words rang in the small room like a solemn vow.</p><p>“Holy hells, is that you over th ere, Tarr Bonnet? What the fuck are you doing here, boy? You’re about the last person I would’ve expected to see.”</p><p>The loud, familiar voice jarred Tarr from a restless sleep. He opened his eyes to peer through the dimness of the shack lit only by a small lantern and up into the beaming face of his old friend, Robosium Jex.</p><p>Jex was a Nilanium trader and had been a good friend of Tarr’s for years. Tarr had been instrumental in getting the Tygerian government to grant asylum to the Nilaniums a few years before, and Jex had been the Nilanium go-between. Jex was a trader, like many of the Nilaniums, also commonly known as the Rogers. Insteadof piracy, however, he’d decided, like many of the older Nilaniums, to become traders and voyagers—even something of a diplomat for his people after their home planet was destroyed.</p><p>Jex had been the man responsible for spiriting Kyle Balenescu off Tygeria and back to his family when Tarr had been captured by them and threatened. Jex had taken Tarr back home to Tygeria.</p><p>Knowinghe’d have to leave Tygeria for good after helping Kyle get away from Taz, however, he’d told Kyle that ‘A permanent home is not for me, anyway. Life here on Tygeria is making me soft. I’d rather be traveling through space, I suppose, like my people have done for centuries.’</p> <p>Taz had relayed the information to him only a few days before he’d gone back after Larsson. As soon as he’d picked Larsson up, he’d had plans to find Jex, thank him for his help, and assure him of Taz’s good will, so he could come back home if he wanted to. Knowing Jex the way he did, however, he knew he probably preferred his rambles through the galaxies and his estrangement from Tygeria was only a convenient excuse.</p><p>Jex enjoyed his trade routes, and had regular stops all through the galaxies. As he stood over Tarr with an armful of blankets and pillows, Tarr realized that Jex must be the trader the Ravnians had been expecting.</p><p>“Robosium Jex—I can’t believeit! I’ve never been so glad to see anyone in my entire life! How the hells are you?” Tarr jumped up and enveloped the trader in a huge bear hug that took the little man off his feet and caused the blankets and pillows in his arms to tumble to the floor. Heheld him at arm’s length and grinned at him. “What are you doing here?”</p><p>“I trade with the Ravnians—they’ve been my customers for years. Whenever I arrive, they give me this little house to sleep in, but this time they told me I’d have to share it with another visitor. When I saw that it was you, I couldn’t believe it.”</p><p>Tarr bent over to help him gather his blankets and pillows. “I see that you’re a much more honored guest than I am,” he said, smiling. “Theygave you pillows.”</p><p>“But how did you come to be here, Tarr? Like this?Where’s your ship? And your men?”</p><p>“We wrecked here,” Tarr said, plopping back down on the floor and propping up on one of Jex’s pillows.“Or at least most of us did. I lost a few men in the explosions, but most of us landed here on this moon with the shuttles.Now they’re holding my men against their will and refuse to let them go. They claim them as salvaged property and say they want the young ones for their nobyos.”</p><p>Jex shook his head in disbelief.“They’ve always been hard to deal with, but I’ve never heard of them doing anything like this before. Youknow I’ll help you any way I can—what do you need me to do?”</p><p>Tarr grinned at him.“A lot of it depends on how well I fight in the Games tomorrow. If things go as planned, I’ll need you on your ship, ready to get us the hellsout of here.”</p><p>“I can do that,” Jex said with an answering grin. “My crew can guard your rear when you take off out of here back to my ship too. We never comeunarmed to a world like this.” He pulled a small disruptor from his boot.“You might be able to use this if things don’t go well for you tomorrow.”</p><p>Tarr laughed and clapped him on the shoulder.“Things are looking up already.”</p><p>Blinded by the harsh sunlight, Larsson stumbled out into the ring, pushed roughly from behind by one of the Ravnians. He turned and snarled at him, but saved his strength for what was to come. He might need it. He could see the Ravnians, some fifty or sixty of them, ringed around the clearing surrounded by a stone wall that was perhaps eight feet tall, and topped by bleacherlike stands that were dotted here and there around the wall. This was the place where their socalled Games were to be played. He had been stripped naked again, like all the other survivors of what had been Tarr’s crew.</p><p>There were six of them in all, two having been rejected by the Ravnians as too old to be good love slaves. The huge Ravnian guards pushed the men into the dusty ring and made them walk around it a couple of times before herding them over to the side and lining them up against the warm stone wall. Two large Ravnians came toward Larsson and jerked his arms around behind his back before they wrapped ropes around his wrists, then secured the ropes to his ankles. They knew, then, that he was capable of great damage to them if he shifted, and they were trying to prevent it. The ropes would barely even slow him down, especially if his mate was in danger.</p><p>He was almost equal parts furious and frightened. Not for himself —he knew he couldn’t take all the Ravnians if he decided to shift, and they’d eventually kill him, but he also knew he’d take a few of them with him. No, he was frightened for his mate, even though he badly wanted to hurt him at the same time. They were in this stupid mess because of Tarr, and if they survived it, he was never going to let him forget it. He’d be making this up to him for a very long time.</p><p>He saw Tarr enter with the other Ravnians. The stupid bastard looked as effortlessly gorgeous and sexy as he always did, and even though the Ravnians were posturing and posing as they walked in, Larsson couldn’t see how anyone could keep their gaze off Tarr Bonnet. They were all dressed in gladiator-style gear, which consisted of tight animal skin leggings and boots with a loincloth and a vest over their naked chests. Each of them carried several weapons, all of which looked deadly to Larsson. Tarr was carrying a thick length of chain, a kind of club with a stone end and a short, lethal-looking sword.</p><p>Larsson’s eyes searched for Rabb and found him at the back of the line, probably so he could make a grand entrance. He carried the exact same weapons as Tarr, and Larsson wondered if their weapons matched because they would be fighting each other.</p><p>Two at a time, the Ravnian warriors stepped forward to face each other. They first paraded around in front of the crowd, their friends and family calling out to them as they held up their weapons and played to their audience.</p><p>Within minutes, though, they paired off and the first two stepped out in the arena and turned to face each other. One of the Ravnians stood up in the stands and called out what Larsson presumed to be their names. He rattled off a lot of other words in the archaic Tygerian language they spoke and the crowd cheered.</p><p>The first two warriors began fighting viciously, sometimes rolling around in the dirt of the arena, sometimes standing still and whaling away at each other with their clubs. Each of them carried a small round shield made of some metallic substance, but the stone clubs battered and dented them easily. Eventually, one of the warriors got the upper hand and the other bowed down on one knee and yelledout a word that sounded like “Viconus.” Larsson could only imagine that it meant they yielded. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When that happened, the victor sauntered over to take his pick of the men. The victorious Ravnian, a young man sporting a red beard—probably to make himself look older—walked up to his choice, bent him back over his arm and kissed the man ravenously. He then picked up the much smaller man and carried him from the arena.</p><p>The scene was repeated for each of the survivors, and though they all gazed over toward Larsson, no one approached him. Larsson saw Tarr stiffen each time they came anywhere near him.</p><p>When only he and Jaxper were left, the Ravnian who came in sometimes to whisper and poke at Jaxper strutted out in the ring and made short work of his opponent. He came over to Jaxper and smiled at him before picking him up and kissing the curve where his neck met his shoulder.His hand moved down to cup Jaxper’s bare ass and the Ravnian’s expression slackened with lust as he pushed his cock into Jaxper’s groin.</p> <p>He turned to grin at his friends and held Jaxper in front of him, his back to the Ravnian’s chest. Hewrapped a big hand over Jaxper’s flaccid cock and slid his hand rapidly over it, pulling the skin back and forth, laughing. He swung the young man over his shoulder then and walked with him from the ring, casually slapping his ass a few times as he walked out. Larsson could feel his wolf very close to the surface, but he held it in check. He might need all his strength soon, if things didn’t go as planned for his mate, but he promised himself he’d find a way to exact revenge on the man who took Jaxper, one way or another.</p><p>Those words were the ones he’d said to Tarr the night before, and his chest tightened at the memory.They’d get out of this together or not at all. He had no wish to live without his mate, and if things started to look bad for Tarr, he’d break these stupid, useless ropes they had on him and fight beside him to the death.</p><p>Rabb Seneca and Tarr were the only opponents left in the ring. Rabb turned toward Larsson, smiled at him, and then blew him a kiss. Larsson gave him a grin of such blinding intensity that Rabb blinked. He was already imagining how he would tear the Ravnian into tiny, bite-sized pieces.</p><p>Tarr stood watching the exchange, his fists clenched and his face deadly.</p><p>The Ravnian turned and came out in the middle of the ring, posturing to his father and his</p> <p>friends. Julan Seneca was there, of course, loudly cheering for his son and drinking from a large flagon of what must have been powerful liquor or wine. The men around him were drinking from similar flagons, and all were red-faced and reeling by this point, stomping their feet and howling with laughter.</p><p>Tarr watched silently as the huge young man posed and flexed his muscles. Then when he turned and faced Tarr, he bared his teeth in a sneer and stepped forward. He swung the chain at Tarr’s feet and Tarr jumped over it easily, landed on his feet and swung his huge club at Rabb’s head, almost in one motion. Rabb got the shield up just in time, but the impact caused him to stagger backward.</p><p>Yelling in rage, he swung his own club, but Tarr sidestepped the blow, ducking low and coming in at the Ravnian’s side to jab at him with his short sword.</p><p>Rather than pierce his flesh, Tarr simply poked him with the sword and sneered up into his face before dancing backward. As he must have known it would, it infuriated Rabb, and he roared with embarrassment and rage. Furious, he charged Tarr, who sidestepped him again like he was dodging an angry bull, and whacked him on his backside with the flat of the sword.</p><p>Larsson was beginning to have fun. Rabb was by this time so enraged, he threw down his own weapons and charged Tarr again. Tarr met him with a roundhouse blow to the chin, hitting the Ravnian hard—harder than Larsson had anticipated.Rabb’s head snapped back, his eyes rolled up in his head, and he fell back to the ground, unconscious.</p><p>Julan stood up and shouted something to the four guards still standing in the ring. They surged toward Tarr, who turned to face them and Larsson felt his wolf roar inside him. He felt his bones popping and cracking as he shifted faster than he’d ever done before, easily snapped the ropes holding him, and went rushing toward his mate.</p> <p>Grabbing up the sword Rabb dropped, he sliced through the neck of the first one like butter and stepped over his body as he fell to face the next one. The man swung a massive fist at his head, and Larsson countered with a huge claw to the side of his head, raking half the skin off it in one swipe. The Ravnian screamed, clutched his face, and stumbled from the ring. Larsson’s wolf was sorry to see him go. He had a taste for blood now and wanted more. He swiveled his head to see Tarr dispatching the last of his opponents, and they gravitated toward each other, back to back, ready to face whatever came next.</p><p>As the stands emptied, Tarr strode over to Rabb, pulling Larsson with him. He jerked up the half-conscious man by his vest and leaned over to sneer in his face.</p><p>“Told you I’d win.” Tarr sounded smug and self-satisfied and sexy as all hells. He held his blade against Rabb’s throat, the tip cutting into his neck and drawing a thin line of blood. Tarr looked up to see the crowd advancing on them, led by Julan himself. Tarr smiled an evil smile at him that stopped Julan in his tracks. He held out an arm to stop the ones beside him and yelled something at the others.</p><p>The crowd of some twenty or so men stopped behind Julan, some jostling to get near the front.</p><p>“What do you want?” Julan cried, his face strained and angry.</p><p>“What belongs to me! My nobyo. And my men.All of them. And you’ll make no move to stop us from leaving.”</p><p>A loud voice from behind them in the stands made the entire crowd swivel around.“I doubt there’s much chance of that!” Robosium Jex called out. He held a disruptor in his hand that was pointed at the head of Julan’s young female. Several of his men had seemed to materialize around him out of nowhere, and all were well-armed.“Just in case you need a little extra incentive,” Jex said, smiling.</p><p>“Yes,” the old man spat out angrily, his face red with fury.“Take what you want and go. Never come back here!”</p> <p>“Probably don’t have to worry about that,” Tarr said, smiling at him. He jerked Rabb to his feet, still holding his sword at his throat.“Get my men,” he said to Julan. “Take them all to the trader’s ship and be quick about it.”</p><p>Tersely, Julan ground out an order to the men next to him as Tarr and Larsson backed slowly from the ring with their hostage. By the time they got outside the arena and Jex and his crew joined them with Jex’s own hostage, Tarr’s surviving crew members had begun to arrive, looking dazed and tired.When they’d all assembled, Tarr called out to Julan Seneca.</p><p>“Don’t follow us and don’t try anything stupid. We’ll leave your people bythe ship’s landing site when we takeoff. They’ll both be unharmed as long as you cooperate.”</p><p>“We’ll cooperate,” Julan said through his teeth. “But if our paths ever cross again, I’ll...”</p><p>“Yes, yes, I’m suitably terrified.” He glanced over his shoulder at Jex.“Lead the way, Jex. Your men can bring up the rear.”</p><p>“With pleasure, Tarr,” he replied and began moving out toward his ship, docked on the outskirts of the settlement.</p><p>Tarr shrugged off his big vest and threw it over to Larsson, who was beginning to shift back to his humanoid form, though his mouth was still too full of teeth to talk clearly. “Put this on, baby.That ass looks too good to be on public display.”</p><p>Larsson shook his head at him, not liking the nicknames he seemed to be incapable of not using. He was grateful for the vest, though, and wrapped it around his waist. It was big enough that it covered him fairly well.</p><p>“I’d give you my pants too, but these boys of Jex’s have been on a long v oyage.I don’t want to distract them.After all, the Tygerians are known for their manly beauty.”</p><p>Larsson rolled his eyes, but couldn’t hold back a fond smile. His mate was so full of shit. He wondered briefly if he’d ever get used to his strange sense of humor. Probably not, but no one could ever say that life with Tarr would be dull.</p><p>Epilogue</p><p>Larsson sat in the galley of Jex’s ship, nursing a mug of tea and staring out a porthole into the blackness of space.Larsson had talked to people who didn’t travel in space who thought the view would be that of spectacular stars surrounding them on all sides. In reality, while there was some light reflected from planets or other bodies around, most of the so-called sky was just black. Light arrived at the observer’s position without being scattered by any kind of atmosphere, so mostly it was just endlessly dark.</p><p>He was bored and waiting for Tarr to come down from the comm deck. Not that he had any business up there, but the man had to have his hand in everything. Larsson could only hope Jex would keep him away from any unfamiliar controls.</p><p>The door to the galley opened and Tarr came in, looking nervous. It was such an unusual look on him that Larsson was instantly alarmed.“Oh shit, what did you do?” he asked.</p><p>Tarr looked surprised and a little wounded.“What? I didn’t do anything. I just needed to talk to you.”</p><p>“Oh,” Larsson said, wondering what this was about. They’d had almost no time alone together since they’d left the Ravnian moon, and so far they’d both been so exhausted from their ordeal they fell into bed at night, usually awakening sometime in the night with their limbs wrapped around each other, but too worn out to do much more.</p><p>Actually, it was past time for Larsson to claim his mate, and his wolf had been restless. He watched Tarr restlessly now as he poured himself a cup of some Nilanium brew that Larsson thought both smelled and tasted terrible. The clothes Jex had given him to wear were tight on him, just the way he liked, and Larsson was having a hard time not staring at the muscular chest revealed by the thin, tight shirt he was wearing. He stirred his tea a little impatiently, waiting to see what Tarr wanted.</p><p>He sighed as he sat down and smiled over at Larsson.“There’s no easy way to say this, so I guess I’ll just tell you. I know I...um...mated you when we were on Ravnia, just before we were captured, and you gave me the bite.But I won’t hold you to it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh,really?” Larsson said softly.</p><p>Tarr glanced up into Larsson’s strangely colored eyes and then quickly back down at his cup.“I know I’m not much of a bargain for a person like you, and considering the price the Alliance has on my head, it’s probably only a matter of time before I get caught anyway. I-I decided while we were on Ravnia that I don’t want to traffic in love slaves anymore. Even the ones who choose the life.After seeing...after talking to Jaxper and...well, I-I can’t do it anymore, I think.Which means I don’t have a job anymore, really. I can’t be a proper mate and take care of you, you see.” He glanced up at Larsson for his reaction, but Larsson just continued to stare at him.</p><p>“Don’t look at me that way, baby. II’m sorry, but this was just never going to work out. I have a lot to figure out, and I won’t saddle you with it all. Do you understand?”</p><p>“Understand?” Larsson knew his voice sounded dull and deadly quiet, but he was too angry to do anything about it. “I understand you think you’re trying to dump me. Is that what you mean?”</p><p>Tarr stole another quick, surprised look at his face and flinched at whatever he saw there. “Nobyo...I mean, Larsson, please...”</p><p>“Please what? Listen to more of this shit? Tell me what you see when you look at me, Tygerian. Do I look weak to you?I know you’re a little taller, but do you see me as some kind of half-assed wife? Because this little wifey can mop up the floor with you if I wanted to, and right now I really want to.”</p><p>“No, Larsson, you don’t...”</p><p>“I don’t what? Understand?I know exactly what you’re saying and you need to shut the fuck up. Do you really think I need you to take care of me? Or that the Alliance or anybody else is going to keep me away from youafter all I’ve been through with you? Fuck the Alliance and fuck you. As a matter of fact, that sounds like a fine idea right now.If you know what’s good for you, you’ll stand up and drop those trousers and bend yourself over the nearest table, before I do it for you.”</p><p>Tarr looked startled for a moment and then a slow grin came over his face.“Yes, nobyo,” he said, and got to his feet, unsnapping his pants.He was a little too slow for Larsson’s wolf, so Larssonjerked the trousers down around Tarr’s ankles and pushed him backward so he sat down hard on the table. His fat cock bounced in front of him, slapping his stomach and Larsson licked his lips.“That,” he said, pointing down to Tarr’s cock, “is only for me. You got that?”</p><p>“Yes, nobyo,” Tarr said, obviously enjoying this side of Larsson. “What...uh...what are you going to do?What if someone walks in on us?”</p><p>“Then they can either watch me fuck you or turn back around and walk out.I’m about to claim my mate, Tarr, and it’s been too long in coming. I’ve allowed you far too much leeway, and it’s caused nothing but trouble. It’s time to remind you who the alpha is in this relationship.”</p><p>Tarr looked up at him, beginning to get a little nervous.“Larsson, baby, you know I’ve never...”</p><p>Larsson wrapped a hand around his cock and stroked slowly up the shaft, making Tarr’s eyes roll back in his head a bit. “I know that.” Larsson pulled a small vial of oil from his pocket. “And I came prepared.”</p><p>Tarr’s eyes grew round as Larsson continued stroking him. A glistening drop of pre-cum appeared on the tip of Tarr’s beautiful cock and Larsson bent to catch it with his tongue. Tarr groaned aloud and Larsson bent to envelop his cock in his mouth. He managed to take most of it, swallowing him down as Tarr gasped and floundered on the table like a fish out of water. He pulled his rough tongue slowly up his shaft until he reached the head. He gave it a swirling lick as he fondled Tarr’s heavy balls and watched him with satisfaction.“Turn over, Tygerian,” Larsson said in a growly voice. Tarr slowly obeyed him, trembling as he looked over his shoulder at him.“Larsson, nobyo, I...”</p><p>“Hush,” Larsson said, and opened the vial of oil, spreading it overTarr’s crease and his very tight hole, already clenching and unclenching as he pushed his cock onto the table.</p><p>“Be still,” he ordered as he slapped each of his pretty ass cheeks and then ran his hand down his crease, rubbing in the oil. “Open up for me.Relax.”</p><p>“I’m trying,” Tarr said, his voice sounding high-pitched and scared to death.</p><p>Larsson bent over him and soothed him, kissing up the side of his face and licking at his neck. He eased one well-oiled finger up inside him, stretching him gently. Tarr grimaced at the burn, and held his breath until Larsson made him gasp by putting his tongue in his ear.“Breathe, Tarr. Relax.I want to make this good for you.”</p><p>“I-I’m trying...”</p><p>Larsson pushed his finger in farther and crooked it up to find what he hoped would be his prostate. He’d never studied Tygerian anatomy, but he thought it should be approximately...there.</p><p>Stroking over the small bundle of nerves, he smiled to see Tarr’s reaction. He bucked so hard off the table that he almost dislodged Larsson and he turned wildly to look over his shoulder at him.“Oh my gods, Larsson!”</p><p>Larsson grinned back at him.“I know.” He gave it another good rubdown and Tarr fell apart, groaning and pushing his cock hard onto the table beneath him. Larsson took the opportunity to push in another finger and stretch him even farther. “Feel good?”</p> <p>Tarr’s answer was a deep groan that was half growl, and Larsson knew he was ready. Splashing a bit more oil on Tarr’s hole, Larsson thrust into him and listened to his groans with a deep satisfaction. This was his mate and he had waited a long time to claim him properly. Carried away, he bit down on the back of Tarr’s neck again, causing him to moan harder, and he angled himself so that his cock rubbed over the spot he’d discovered inside Tarr.</p><p>It took only a few thrusts before Tarr convulsed helplessly, his velvety-smooth ass tightening almost painfully around Larsson’s cock. The added pressure brought Larsson’s climax and he came hard, shooting his cum deep inside his mate. He pulled out for the last few spurts and sprayed over Tarr’s ass and the backs of his thighs, marking his territory.</p><p>He collapsed on top of Tarr, almost completely spent, and enjoying the feel of his lover beneath him.“Are you okay?” he managed to say, and Tarr nodded, out of breath and gasping out the words.</p><p>“Yes, nobyo.”</p><p>“Do you want me to get a warm cloth to clean you up?”</p><p>“Yes, nobyo.”</p><p>Larsson chuckled and rubbed a possessive hand over Tarr’s ass as he got up and stumbled to the sink for a cloth. Coming back with it, he tenderly cleaned his mate and helped him to sit up so he could clean off his groin and the table underneath.</p><p>“Better get another cloth to clean this table or Jex will be all over us.”</p><p>“Yes, nobyo.” Tarr shook his head, dazed and confused as the venom raced through his body. It wouldn’t be so intense as the first time, but it was still making Tarr weak and dizzy.“I don’t know what’s wrong with me. I only seem to know how to say one thing—yes, nobyo.”</p><p>Larsson dropped a kiss on his lips and smiled.“And that’s all you’ll ever need to know.”</p><p>THE END </p> </body></html>"]