["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Los Angeles, 1993</p><p>He was a very old vampire, weary of living, weary of coming alive only in the darkness of the night.</p><p>For three hundred years he had wandered the unending road of his life alone, his existence maintained at the expense of unwary mortals, until the advent of blood banks made it possible to satisfy his unholy hunger without preying on the lives of the innocent and unsuspecting.</p><p>And yet there were times, as now, when the need to savor blood taken from a living, breathing soul was overwhelming. To feel his fangs sink into human flesh, to feel the warm rush of fresh blood flowing over his tongue. It was a high like no other; a craving he fought against, but didn't always win.</p> <p>Tonight, he stood in the dim shadows outside the Ahmanson, watching groups of happy, well-dressed people exit the theater. He listened to snatches of their conversation as they discussed the play. He had seen the show numerous times; perhaps, he thought wryly, because he could so easily sympathize with the plight of the Phantom of the Opera. Like Sir Andrew Lloyd Webber's tragic hero, he, too, was forced to live in the shadows, cursed to shun the light and warmth of the sun, unable to reveal his true identity.</p><p>And so he lurked on the outskirts of mortality, breathing in the fragrance of the warm-blooded creatures who passed him by. They hurried along, laughing and talking, blissfully unaware that a monster was watching. It took no effort at all to drink in the myriad smells of their humanity - a blend of perfume and sweat, shampoo and toothpaste, face powder and deodorant. He sensed their happiness, their sorrows, their deepest fears.</p><p>He waited until the crowds had thinned, and then he began to follow one of the numerous street beggars who had been hustling the theater patrons for money and cigarettes. There were hundreds of homeless men roaming the dark streets of the City of Angels. On any given night, you could find a dozen or more panhandlers lingering outside the Ahmanson, hoping to score a few dollars that would enable them to buy a bottle of cheap booze and a few hours of forgetfulness. If only he could drown his own past in a pint of whiskey.</p><p>Silent as a shadow, he ghosted up behind his prey.</p><p>After tonight, there would be one less beggar haunting Hope Street.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was there again, standing on the corner of Temple and Grand, his long angular face bathed in the hazy amber glow of the street light.</p><p>Leanne felt his hooded gaze move over her as she left the side entrance of the theater and made her way toward the parking lot across the street. Behind her, she could hear the excitement of the waiting crowd build as Davis Gaines, who many considered to be L. A.'s best Phantom, appeared at the stage door. She agreed with his fans. Davis had the most incredibly beautiful, powerful voice she had ever heard. It was easy to see why the people loved him. The role of the Phantom was physically demanding, yet he was always generous with his time, signing programs, answering questions, posing for pictures. It was Leanne's dream to one day be cast in a leading role, to hopefully make her mark upon the world. To have people shouting her name, clamoring for her autograph, a photo.</p><p>She was about to unlock her car door when she felt a hand on her shoulder. Startled, she whirled around.</p><p>It was the tall dark man she had seen on the corner. Up close, he was taller and more handsome than she had realized. And more forbidding. His face was made up of sharp planes and angles, totally masculine, totally mesmerizing. His hair was black as pitch. Straight as a string, it fell well past his broad shoulders. His eyes were an intense shade of blue, deep and dark.</p> <p>She stared into those fathomless eyes and had the ridiculous yet inescapable feeling that she had been waiting her whole lifetime for this moment.</p><p>This man.</p><p>\"I did not mean to frighten you,\" he said in a deep resonant voice. He held out a theater program. \"I was hoping you might sign this for me.\"</p><p>\"Why on earth would you want my autograph?\" she exclaimed. \"I'm only in the chorus.\"</p><p>\"Ah, but you have such a lovely voice.\"</p> <p>She laughed softly. \"You must have excellent hearing, to be able to pick mine out of all the others.\"</p><p>His smile was devastating. \"My hearing is quite good for a man my age.\"</p><p>Leanne's gaze moved over him curiously. She didn't know how old he was, of course, but he didn't look to be much more than twenty-five or twenty-six, thirty at the most.</p><p>He offered her a Sharpie, one brow raised in question.</p><p>\"Who should I make it out to?\"</p><p>\"Jason Blackthorne.\"</p> <p>\"Blackthorne.\" She gazed up at him intently. \"Why does that name sound so familiar to me?\"</p><p>\"Does it?\"</p><p>She nodded, then took the pen from his hand. \"This is my first autograph, you know.\"</p><p>\"The first of many, I'm sure.\" Looking over her shoulder, he read the words aloud as she wrote them. \"To Jason, may you always have someone to love, and someone to love you. Leanne\"</p><p>He felt a catch at his heart. Someone to love...ah, Jolene, forever lost to him. Leanne's resemblance to his first and only love was uncanny. It was that resemblance which sent him to the theater night after night.</p><p>He smiled his thanks as she returned the program, his gaze moving over her face, lingering on her lush lower lip before moving to the pulse beating in her throat. She was small, petite, with skin that looked as though it rarely saw the sun. Her hair was the color of sun-kissed earth; her eyes a deep, luminous green fringed with thick dark lashes. She wore a black tee shirt emblazoned with the Phantom logo, a pair of black tights that clung to her shapely legs like a second skin, and sneakers.</p><p>Jason clenched his hands at his sides as he fought the urge to draw her into his arms, to touch her lips with his own, to sip the warm, sweet crimson nectar that flowed through her veins.</p><p>She frowned up at him as she capped the pen and handed it to him. \"Is something wrong?\"</p> <p>\"No. I was just wondering if we might go somewhere for a drink.\"</p><p>She knew she should say no. There were a lot of crazy people running around these days, obsessive fans, stalkers and serial killers, and yet there was something in Jason Blackthorne's eyes that made her trust him implicitly.</p><p>\"I know a little place not far from here,\" she suggested with a tentative smile.</p><p>\"I'll follow you in my car,\" Jason said, somewhat surprised by her ready acceptance of his invitation. Didn't she read the papers? Muggings and rapes and murders were rampant in the city.</p><p>A faint grin tugged at his lips as he crossed the parking lot to his own car. Indeed, he mused as he slid behind the steering wheel, she would undoubtedly be far safer with one of the city's low life's than she was with him.</p><p>The bar she had suggested was located on a narrow side street. He knew a moment's hesitation as he followed her inside, and then sighed with relief. There were no mirrors in sight.</p><p>He led her to a booth in the rear, then slid in beside her. When the waitress came, Leanne ordered a glass of red wine, as did he.</p><p>\"So,\" Jason said, leaning back in his seat. \"Tell me about yourself.\"</p><p>\"What would you like to know?\"</p><p>His gaze moved over her face in a caress as soft as candlelight. \"Everything.\"</p><p>\"I'm twenty-three,\" Leanne said, mesmerized by the look in his eyes. \"I'm an only child. My parents live in Burbank, but I have a small apartment not far from the theater.\" She smiled at him, a shy, intimate smile. \"Someday I hope to make it to Broadway.\"</p><p>\"Have you a boyfriend?\"</p><p>\"No.\"</p><p>You have now.</p><p>Did he speak the words aloud, or was her mind playing tricks on her, supplying the words she wished to hear?</p><p>He draped one arm along the back of the booth, his hand dangling near her shoulder. \"How long have you been with the play?\"</p><p>\"A little over two years.\"</p><p>\"I hear it will be closing soon. What will you do then?\"</p><p>\"I'm not sure. I keep hoping it will be extended.\"</p><p>\"How long have you been acting?\"</p><p>\"Actually, this is my first role. I've always wanted to be on the stage and I decided, what the heck, why not go for it? So, I tried out for the chorus and they hired me.\" She propped her elbows on the table and rested her chin on her folded hands. \"What do you do?\"</p><p>\"I'm a cop.\" The lie rolled easily off his lips.</p><p>\"You're kidding!\" He didn't look like any police officer she had ever seen. Dressed in a white shirt, thigh-length black coat, black jeans, and cowboy boots, he looked more like a movie star or a model than a police officer.</p><p>One black brow lifted slightly. \"I take it you don't care for the police.\"</p><p>\"No, no, it's just that...\" She made a dismissive gesture with her hand. \"It's just that you don't look like a policeman.\"</p><p>\"How's that?\"</p><p>\"No moustache.\" Leaning forward, she ran the tip of one finger along his upper lip. \"Every cop I know has a moustache.\"</p><p>Jason grunted softly. \"And do you know a lot of cops?\"</p><p>\"Not really,\" she said, grinning. \"Where do you work?\"</p><p>\"Hollenbeck.\"</p><p>\"That's a rough area.\"</p><p>Jason shrugged. \"I like it.\" Their drinks had arrived during their conversation, but neither paid much attention. Now, Jason picked up his glass. \"What shall we drink to?\"</p><p>Leanne lifted her glass. \"Long life and happiness?\" she suggested.</p><p>\"Happiness,\" he repeated softly. \"I'll drink to that.\"</p><p>\"Not long life?\"</p><p>His gaze was drawn to her throat, to where her pulse beat strong and steady. \"Long life is not always a blessing,\" he said quietly, almost as though he were speaking to himself. \"Sometimes it can be a curse.\"</p><p>\"A curse!\" She shook her head, puzzled by his reply. Most people wanted to live forever. \"Why do you say that?\"</p><p>He dragged his gaze from her neck. \"I've seen too many people who have lived past their prime, people with nothing left to live for, nothing to hope for but a quick death, an end to pain.\"</p><p>\"No matter the circumstances, life is always precious.\"</p><p>He leaned forward, his gaze burning into hers. \"And do you think you would like to live forever?\"</p><p>\"I know I would.\"</p><p>\"No matter what?\"</p><p>\"No matter what. Life is a gift to be treasured, not wasted or thrown away.\" She sipped her wine, then said, \"I don't know about you, but this conversation is getting way too morbid for me. So, tell me about yourself. What do you do when you aren't making the streets of Los Angeles safe for the rest of us?\"</p><p>\"Nothing very exciting, I'm afraid. Read. Watch TV. Ride my horse.\"</p><p>Her eyes lit up with interest. \"You have a horse? Where do you keep it?\"</p><p>\"I have a small place up in the hills, nothing elaborate.\"</p><p>\"Oh. I've always loved horses. Do you think...do you think I might be able to ride yours sometime?\"</p><p>\"I sleep days, so I usually ride at night.\"</p><p>\"How romantic,\" she remarked, her voice suddenly low and husky. \"Perhaps we could go riding together some evening.\"</p><p>Jason swallowed hard. Was he imagining things, or was she suggesting more than she was saying? The thought of holding her close, of having his arms around her waist, of burying his face in the wealth of her thick dark hair, flooded him with desire. His gaze moved to the pulse throbbing in her throat once again and he glanced away lest she see the sudden heat, the hunger, he knew was burning in his eyes.</p><p>\"It's getting late,\" he said, tossing a handful of bills on the table. \"I'd better let you go home and get some sleep.\"</p><p>\"We don't have to go,\" Leanne replied, reluctant to see him leave. \"I'm a bit of a night owl myself.\"</p><p>\"Then we have more in common than a love of horses,\" Jason replied dryly. \"Perhaps we could go to a late movie tomorrow night?\"</p><p>\"Sounds good to me.\"</p><p>\"I'll pick you up at the stage door.\"</p><p>Leanne felt her cheeks grow warm as their eyes met. There was no mistaking the attraction that sparked between them, the sexual awareness. But it was more than that, as if an intangible bond had formed between them. As if their souls had found each other after wandering through years of darkness.</p><p>She had been born for this man.</p><p>It was a fanciful thought, yet it lingered in her mind, quiet and unwavering, like the answer to a prayer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He fed early the next night, his eyes closing in something akin to ecstasy as he emptied half a bag of whole blood into a glass, warmed it with his gaze, and slowly drained the contents, enjoying the rich, coppery, slightly salty taste of it on his tongue.</p><p>Only yesterday he had contemplated putting an end to his life. It would be so easy to terminate his existence, so easy to stand out on the terrace and watch the sun come up one last time.</p><p>So easy, he mused, but oh, so painful. He had felt the sting of the sun on his skin, known the agony of its touch on preternatural flesh. Now, as he dressed, he wondered, as he had so often in the past, if he truly possessed the courage he would need to face such an excruciating death.</p><p>But it was a moot point now. He no longer wished for an end to his existence. Life was new again, filled with excitement and anticipation, and all because of Leanne. Lovely Leanne, with the body of a temptress and the voice of an angel.</p> <p>During the long hours of the day, as he slept the sleep of the undead in the basement of his house, her image had drifted across his mind. That, in itself, was strange, he thought. Never before had his rest been disturbed by images of anyone, living or dead. Even during the heat of the day, when he usually slept the deepest, he had seen her face in fragmented dreams, heard the sound of her voice, yearned for the touch of her hand.</p><p>Restless, he wandered through the house, trying to see it through her eyes. She would no doubt find it strange that there was no food in the kitchen, that there were no mirrors to be found, not even in the bathrooms. He could easily explain the security bars on the doors and windows. After all, crime was prevalent in the area. The old paintings, the ancient books and scrolls, would not be so easy to account for, not on a cop's salary.</p><p>He had collected quite a few masterpieces in the last three hundred years. Paintings thought destroyed in the wars that had ravaged France and Spain resided in the bedroom, sculptures believed to have been lost centuries ago graced his library. He had one of Shakespeare's original plays, signed by the Bard himself. His basement was crowded with ancient scrolls, with furniture and clothing from ages long past.</p><p>Perhaps he should have told her he was a retired antique dealer. But it was far easier to tell the few people he interacted with that he was a police officer, to say that he worked the graveyard shift and slept days, that he worked weekends and holidays, and was therefore unable to attend the picnics and parties to which he was occasionally invited.</p><p>He paced the floor for an hour and then, unable to wait a moment longer to see her, he drove to the theater. He could have willed himself there with a thought, but he enjoyed driving, enjoyed being in control of a powerful machine. And he would need the car later.</p> <p>The performance was sold out, but it was an easy task to slip past the usher, to find a place in the shadows at the back of the theater.</p><p>The play mesmerized him, as always. He had lost count of how many times he had seen it, had long ago stopped wondering what there was about the production that he found so endlessly fascinating.</p><p>Lost in the dark, he became one with the Opera Ghost, lusting after the fair Christine, knowing in the depths of his aching heart that she could never be his.</p><p>He heard the anguish in the Phantom's voice as he watched Christine find comfort in the arms of the handsome Vicomte de Chagny, felt the deformed man's pain as he cursed her.</p><p>But Jason had eyes only for Leanne. Her presence called to him until he was blind to everyone else on stage, until his pulse beat in time with hers. He shared her excitement as she sang her lines during Don Juan Triumphant, sensed her pleasure when the crowd applauded.</p><p>As soon as the final curtain came down, he left the theater, eager to see her again, to discover if she was truly as beautiful, as desirable, as he remembered. Surely her eyes could not be as green as those he had seen in his dreams, her skin could not be as creamy and unblemished. No lips could be so pink and perfect; her hair could not be as thick and lustrous as he recalled.</p> <p>And then she was there, hurrying toward him, a smile of welcome lighting her face as if they had known each other for years instead of a few hours.</p><p>She was breathtakingly beautiful in a pair of slinky black pants and a green blouse made of some soft material that clung to her upper body, outlining every delectable curve, emphasizing the deep green of her eyes.</p><p>His mouth watered just looking at her.</p><p>\"Shall we go?\" she asked, tucking her arm through his.</p><p>\"My car's in the lot,\" he said, and for the first time since the dark curse had been bequeathed to him, he felt young. Alive.</p><p>Hand in hand, they ran across the street.</p><p>\"This is yours?\" Leanne exclaimed when he stopped beside his car.</p><p>Jason nodded. \"Like it?\"</p> <p>She hadn't noticed what he was driving the night before. Now, her gaze swept over the sleek curves of the black Porsche. \"What's not to like?\" He opened the passenger door and she slid into the seat, her hand stroking the soft leather. \"You're not a cop on the take, are you?\" she asked when he slid behind the wheel.</p><p>Jason shook his head as he turned the key in the ignition. Thinking quickly, he said, \"My grandfather left me quite well off.\"</p><p>\"Then why do you work?\"</p><p>\"A man has to do something with his time.\"</p><p>They made small talk on the way to Hollywood. She told him about some of the funny things that had happened on stage, like the time the Phantom's boat veered left when it should have gone right.</p><p>\"I remember that.\"</p><p>\"You were there?\"</p><p>He nodded.</p><p>\"And then there was the night during the banquet scene in Don Juan Triumphant when the apple fell out of the pig's mouth and rolled across the stage,\" she said, laughing. \"And one night, during the Masquerade number, the Phantom tossed the opera score to one of the managers, and he dropped it.\" She shook her head. \"I think that's what makes live theater so much fun, and why people come back again and again. You just never know when something will go wrong, like the night Davis forgot the lyrics to one of the songs and just sort of ad-libbed the words.\"</p><p>Jason nodded. He had been in the theater during all of those incidents.</p><p>\"Someone told me that one night Christine's double sprained her ankle, so Dale had to limp, but that was before my time with the show,\" Leanne said, laughing. \"I'm sorry, I'm monopolizing the conversation,\" Leanne said. \"So, tell me about your job. What do you like best about being a cop?\"</p><p>\"I guess because, like the theater, no two nights are ever the same. Of course, most of the time, the job is pretty boring. Just routine calls, mostly family squabbles.\" Or so he had heard.</p><p>When they reached the mall, Jason parked the car in the lot; then, hand-in-hand, they walked toward the movie theater.</p><p>Inside, they sat in the last row. Of its own volition, his hand found hers again. The touch of her fingers entwining with his sent a warm ripple of awareness surging through him, a jolt of such force that it took his breath away.</p><p>In the darkness, his gaze sought hers. She had felt it, too. He saw it in the slightly surprised expression in her eyes, heard it in the sudden intake of her breath. The attraction that hummed between them was electric, palpable.</p><p>Time and place were momentarily forgotten as his hand slid up her arm, across her shoulder. Cupping the back of her head, he drew her slowly toward him. She didn't resist, but came readily, her eyelids fluttering down as his mouth slanted over hers.</p><p>It was a kiss unlike any he had ever known - sweetly potent, volatile, explosive. His body's reaction to her nearness, to the taste of her lips, the scent of her life's essence, was instantaneous, almost painful in its intensity.</p><p>With the rise of his physical desire came another hunger, one that was more painful than unfulfilled passion, and far more deadly for the woman beside him. Unable to help himself, he pressed a kiss to her throat, let his tongue caress the pulse beating there. Her skin was warm, the whisper of the sweet nectar flowing through her veins tempting, so tempting...</p><p>With a low groan, he drew away.</p><p>\"Jason, what's wrong?\" Her voice was husky, drugged with desire.</p><p>\"Nothing.\" He raked a hand through his hair, conscious of the people around them. \"This isn't the time, or the place.\"</p><p>She smiled a knowing smile, her green eyes smoky with passion. \"Any time,\" she murmured in a breathless whisper. \"Any place.\"</p><p>\"Leanne...\"</p><p>\"I'm shameless, I know, but I can't help myself. I've never felt this way before. It's as though I've known you all my life.\" Her hand slid over his chest. \"As though I've waited for you all my life.\"</p><p>For a moment, he closed his eyes. Her words fell like sunshine on the blackness of his soul. And then he smiled at her through the darkness.</p><p>\"We have time, Leanne,\" he whispered hoarsely \"All the time in the world.\"</p><p>Later, driving her home, he couldn't remember what the movie was about, but it didn't matter. Nothing mattered but the connection between them, and the sure knowledge that he would see her again the following night.</p><p>And every night after that for as long as she lived. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jason sat on the sofa in the living room, his feet resting on a leather hassock, his gaze fixed on the dancing flames in the raised hearth. The fire served no purpose save that he found it pleasing to look upon. He had no need for its warmth; he felt neither the heat nor the cold, but sitting in front of a fire on a cool autumn night seemed a very human thing to do. Tonight, tormented by vivid memories of his past, he had a strong desire to feel mortal again.</p><p>He had been born in a time of great superstition, when a young woman with the gift to heal might be judged a witch and burned at the stake, when country folk believed that werewolves prowled the forests in the light of the full moon, when restless ghosts were thought to wander the rooms of castle and hovel alike.</p><p>He had never seen a ghost and he had never put much stock in werewolves, but he had come to believe in vampires. Oh, yes, he would never forget the night he had learned about vampires.</p><p>It had been a warm summer evening, just after supper. He'd had an argument with his wife, Jolene. He could not now remember what they quarreled about, but he had stormed out of the cottage and headed for the local tavern, determined to drown his troubles in a mug or two of golden ale. He had been working his way through his third tankard when Marguerite approached him. There had been something compelling in the way she looked at him, the way her hell-black eyes caressed him, that had chilled him to the very marrow of his bones. And yet it had been that same unsettling look which had drawn him inexplicably to her side.</p> <p>Mesmerized by her dark beauty, by the husky tremor in her voice and the 'come hither' expression in her eyes, he had followed her to the rooms upstairs. Never before had he been unfaithful to Jolene, but that night it was as if he'd had no control over either his body or his passion. Like a puppy at its master's heels, he had followed Marguerite up the narrow wooden stairway and into a life of eternal darkness.</p><p>She had drugged him with her kisses, aroused him until he had been mindless with need and then, in the midst of their love-making, she had buried her fangs in his throat, drained him to the point of death, and then given him her blood in return.</p><p>She had left him just before dawn, warning him that he must find a place to hide himself from the sun unless he wished that night to be his last.</p><p>He had not believed her. Until he stepped out into the bright light of a new day. The pain of the sun on his face had been excruciating. With a cry of alarm, he had bolted into the woods and taken refuge in a cave.</p><p>Trembling with pain and fear, his skin blistering, he had pressed himself against the wall, unable to move, only vaguely aware of the ghastly changes taking place in his body as Marguerite's accursed blood wrought the hideous transformation.</p> <p>Weak, helpless to resist, he had died that day, his body convulsing as it purged itself of useless fluids. And, as the sun climbed higher in the sky, he had lain as one dead until the setting of the sun.</p><p>When he awoke that night, he had known his old life was gone forever.</p><p>He had sought Marguerite when he left the cave, begging her to undo the evil she had wrought upon him, but she had only laughed softly as she caressed his cheek.</p><p>\"There is no going back, mon amour.\"</p><p>\"There must be a way!\"</p><p>\"None that I know of, except...\" She made a vague gesture with one hand.</p> <p>He grabbed her arms, his fingers biting deep into her cool white flesh. \"Except?\"</p><p>\"It is rumored among the ancient ones that there is a bloodline which has the power to transform a vampire into a mortal again, but I have no idea how it is done. I know only that the power is not in the blood.\" She shrugged, as if the whole conversation were unimportant. \"That is all I know.\"</p><p>\"Whose bloodline?\" he demanded, giving her a shake. \"Where do I find such a person?\"</p><p>\"I know not. I care not. I am happy as I am, and have no wish to be mortal again.\"</p><p>She had pried his fingers from her arm, then patted his cheek, much as a mother might comfort a weeping child. \"Give it time, cheri. One day you will bless me for what I have done.\"</p><p>Bless her! He would have killed her had he known how. Late that night, he had gone home to find Jolene frantic with worry, her beautiful face ravaged by tears.</p><p>She had been disbelieving when he told her what had happened, disbelieving until the sun came up and she had seen for herself the death-like lethargy that held him captive in its grip.</p><p>To Jolene's credit, she hadn't turned her back on him. Although she had been repulsed by his lust for blood, by the corpse-like figure that slept in the cellar by day, she had never stopped loving him. Blessed woman that she was, she had kept his secret until the day she died.</p> <p>And that had been the hardest thing of all to bear, watching his beloved wife grow old and feeble while he stayed forever young and strong. Her once unblemished skin grew wrinkled with the passing years, her hair, once as fine as black silk, had turned white. The joy of living had gone out of her eyes, those beautiful green eyes that had ever looked on him with love and tenderness. It had been torment of the worst kind, watching her body weaken and wither, ravaged by age and disease. In desperation, he had offered to save her, to transform her into the horror he had become, but she had refused. In the end, she had died in his arms, whispering his name.</p><p>In his youth, he had been zealously religious. Always, he had believed in a just and loving God. He had been faithful in his prayers, certain they were heard. But now, monster and murderer that he had become, he was cut off from the powers of heaven, unable to offer a prayer in behalf of his wife.</p><p>That night, for the first time since Marguerite had turned him into a monster, he had contemplated putting an end to his existence. Considered it and found he lacked the courage, for far worse than the thought of dying was the knowledge that, in death, he would come face to face with the Almighty and have to confess his sins.</p><p>In all the years since Jolene's death, he had kept a tight rein on his emotions, never letting himself care for anyone. He made no close friends, mortal or otherwise. Trusting one of the undead could be as dangerous to his existence as trusting the living, and so he had trusted no one, loved no one.</p><p>Until now.</p><p>He thought of Leanne, and her memory engulfed him with a warm, sustaining glow. She had brought light to his dark existence, given him a reason to live, pierced the protective wall he had erected around his heart. Fool that he was, he couldn't deny the fact that he had fallen in love again.</p><p>Fallen in love with a woman who looked enough like his beloved Jolene to be her sister.</p><p>A long slow sigh escaped Jason's lips. He could not endure the agony of watching another woman he loved grow old and die, nor could he be responsible for giving her the Dark Gift. Leanne was a creature of sunshine. He could not condemn her to a life spent in the shadows.</p><p>And yet he could not think of facing the future without her, not now, when he had glimpsed her goodness, felt the sweet magic that had flowed between them the moment their eyes met for the first time.</p><p>Jason soon grew tired of meeting Leanne after the theater, then spending the evening in a darkened movie house or some smoke-filled bar, and since he dared not go to her house, which no doubt contained several mirrors, he brought her home.</p><p>Never before had he brought a woman into his house. He bade her wait in the entry hall while he went inside and lit the candles. No doubt she would think it strange that he eschewed electric lights, but he much preferred the soft glow of candlelight to the harsh glare of modern electricity.</p><p>Returning to the entry hall, he bowed over her hand. \"Welcome to my humble home,\" he murmured, and kissed her hand in courtly fashion.</p><p>\"Do you mind if I look around?\" Leanne asked.</p><p>\"Please,\" he said. \"Make my home yours.\"</p><p>Leanne wandered through the house, enchanted by the works of art, the sculptures. Several of the paintings were signed J. Blackthorne. The signature was bold and distinctive.</p><p>\"Blackthorne!\" she exclaimed softly. \"Now I know why your name sounded so familiar. I saw one of his paintings in a museum.\" She turned to look at Jason, a question in her eyes.</p><p>\"An ancestor,\" Jason said. \"Prolific, but mostly unappreciated.\"</p><p>Leanne studied the largest of the paintings. It depicted a tall man with hair as black as midnight standing alone on a cliff overlooking a turbulent sea. A long black cape billowed out behind him, buffeted by the wind. Dark gray clouds hovered above storm-tossed waves. Just looking at the painting filled her with a sense of loneliness, of emptiness.</p><p>\"He was very good,\" she remarked.</p><p>Jason shrugged. \"For his time, perhaps.</p><p>With a nod, Leanne continued her tour, ever conscious that Jason was only a step or two behind her.</p><p>The rooms were sparsely furnished and she noticed he had only a few small table lamps, none of which he turned on, obviously preferring the softer, more romantic glow of the candles that lit every room, even the bathrooms.</p><p>The living room was decorated in earth tones. A brown leather sofa faced the fireplace; a pair of matching overstuffed chairs flanked the sofa. A book about ancient civilizations sat on a carved oak table in front of the couch. Heavy beige draperies covered the windows.</p><p>The master bedroom was decorated in muted shades of blue and white. Standing in the doorway, she had the oddest impression that the bed had never been slept in; indeed, she had the feeling the room had rarely been used at all. Adjoining the master bedroom was a large bathroom with a sunken tub and a skylight. There was an enormous den next to the bedroom. Two of the walls were lined with oak bookcases that reached from floor to ceiling. She paused in front of one of the bookshelves, her gaze perusing the titles. She saw Shakespeare and Homer, Louis L'Amour and Stephen King, Tom Clancy and Dean Koontz, a collection of Anne Rice's vampire books, as well as numerous volumes on history and geography, medicine, art, literature and folklore, many of which were written in foreign languages.</p><p>\"Have you read all of these?\" she asked, amazed by the quantity and variety of books. Judging by their fragile covers, many of the volumes appeared to be quite old.</p><p>\"Not all,\" Jason replied.</p><p>Leanne smiled, thinking it would take a hundred years to read all the books on the shelves.</p><p>Turning away from the bookcase, she glanced around the room. A beautiful black marble fireplace took up most of the third wall. The fourth wall contained a large window covered by heavy floor-to-ceiling drapes. A big, comfortable looking black leather chair and an ottoman stood in front of the hearth.</p><p>Leaving the den, she peered into the kitchen, noting it was stark and white. Again, she was overcome with the impression that, like the bedroom, the kitchen was rarely, if ever, used. But then maybe that wasn't so strange. Jason was a bachelor, after all. Maybe he ate all his meals out.</p><p>\"So,\" he said as they returned to the living room, \"what do you think?\"</p><p>\"It's very nice.\" She made a broad gesture with her hand. \"I think I like the den the best.\"</p><p>\"Yes, it's my favorite, too.\"</p><p>Leanne crossed the floor to the picture window that overlooked the backyard and pulled back the heavy curtains. A full moon hovered low in the sky, bathing the grass and the outbuildings in shimmering silver.</p><p>\"Is your horse here?\"</p><p>\"Yes.\"</p><p>\"Could I see it?\"</p><p>\"If you like.\"</p><p>Taking her hand, he led her out the back door and down a narrow flight of steps. They followed a winding path edged with ferns and willow trees until they reached a large corral.</p><p>Jason whistled softly, and a dark shape materialized out of the shadows.</p><p>\"Hello, Lucifer,\" he murmured, scratching the big black horse between its ears. \"I've brought someone to meet you.\"</p><p>Leanne held out her hand, and the stallion danced away, its nostrils flaring, its eyes showing white.</p><p>\"I don't think he likes me,\" she said, disappointment evident in her voice.</p><p>\"We don't get many visitors here,\" Jason remarked. Slipping through the rails, he walked up to the horse and stroked its neck.</p><p>Like all animals, the stallion had been wary of him in the beginning, but Jason had used his dark power to overcome the animal's instinctive fear.</p><p>Now, he vaulted lightly onto Lucifer's back and rode around the corral, guiding the stallion with the pressure of his knees.</p><p>Leanne clapped her hands in delight. \"That's wonderful!\" she exclaimed, charmed by the fluid grace of the horse and the sheer masculine beauty of the man. They looked as if they had been made for each other, the devil-black horse and the raven-haired man.</p><p>Jason rode effortlessly, his body in complete harmony with the stallion's. Like a dark angel cast out of the courts of heaven, he rode bareback in the pale light of the moon.</p><p>After a few moments, he rode toward the gate and slipped the latch. Riding up to Leanne, he held out his hand.</p><p>\"Don't you need a bridle or something to control him?\" she asked dubiously.</p><p>\"No. He responds to my voice and the pressure of my knees.\"</p><p>The stallion's ears twitched as Jason lifted Leanne, settling her in front of him, and then they were riding down a sloping path that led to a trail into the hills.</p><p>Jason breathed in Leanne's scent as they rode through the quiet night, the only sounds that of the horse's muffled hoof beats and the chirping of crickets.</p><p>His thighs cradled her buttocks, his arm circled her waist, the fall of her hair brushed his cheek. She leaned against him, her back pressing against his chest, her nearness sparking the embers of hunger and desire that were ever present when she was near.</p><p>He had only to lean forward to press a kiss to the side of her neck, and as he did so, the longing to sink his fangs into the soft skin just below her ear, to taste the warm rush of her blood over his tongue, rose up within him. One taste, he thought, just one small taste...</p><p>\"Jason?\"</p><p>He grunted in response, unable to speak past the loathsome need rising hotly within him, the desire to drink in her sweetness, to possess her fully.</p><p>\"Could we stop here for a while?\"</p><p>He glanced around. They were in a small glade surrounded by tall trees. Wordlessly, he slid over Lucifer's rump, then walked around to help Leanne dismount. His hands lingered at her waist and he drew her up against him, letting her feel the evidence of his desire, afraid she would refuse him, and even more afraid that she might not.</p><p>Leanne took a deep breath. It was all happening so quickly. She felt the pull of his gaze, felt herself falling hopelessly in love with a man she hardly knew. A man she wanted to know better.</p><p>\"Jason, tell me I'm not dreaming. Tell me the magic between us is real and not just something I've imagined because I want it so badly to be true.\"</p><p>\"It's real.\" His knuckles caressed her cheek. \"Never doubt that.\"</p><p>She sighed at his touch. His eyes were dark, the blue-black before a storm. A lock of hair, as black as ink, fell across his forehead. For a moment, it seemed as if he were a part of the night itself, a dark phantom who had clothed himself in one of her daydreams and stepped out of her imagination.</p><p>Compelled by a need she never thought to question, she reached up to brush the hair from his brow, to stroke his cheek with her fingertips. To assure herself that he was real.</p><p>\"Leanne.\"</p><p>He murmured her name, his voice low and husky and filled with such longing, she had no thought to deny him.</p><p>She tilted her head back, eager for his kiss, her eyelids fluttering down as he lowered his head toward hers.</p><p>He hesitated only a moment, battling the ancient urge to bury his fangs in her throat, to drink and drink until his damnable thirst was assuaged. Assuaged, but never quenched. Instead, he kissed her gently, careful not to bruise her tender flesh. As if she were made of fine crystal that might shatter at the slightest touch, he held her in his arms, his body basking in her warmth, in the essence of life that flowed through her.</p><p>Holding her close, he was keenly aware of the vast gulf between them. She was light and hope and innocence, children playing in the sun, lovers strolling hand-in-hand along the beach on a hot summer day, all the things that were forever lost to him. He was the essence of darkness. It permeated his life and shrouded his soul.</p><p>He groaned low in his throat, his arms tightening around her as if, by holding her closer, he might draw a part of her goodness into himself.</p><p>In the beginning, after he had resigned himself to Jolene's loss, to the fact that he was forever changed, forever cursed, he had gloried in being a vampire. His hearing was keen, his eyesight much improved. He could cover great distances with preternatural speed, pass unseen through a crowd, bend another's will to his own. He had thought the taste of blood would disgust him, but it was a part of what he had become and not repellent at all. Indeed, he craved it as some men craved whiskey.</p><p>In the beginning, he had not realized how long forever was. He had not understood how truly alienated he was from the rest of mankind. With the coming of awareness, he had lost himself in learning. Later, to his amazement, he had discovered that he had an aptitude for painting, and he had spent a century perfecting what talent he had. When he grew bored with painting, he had tried his hand at writing.</p><p>It had come easily to him, and he had written scores of novels, many of which he had sold. And when writing lost its appeal, he had turned into a vagabond, traveling from one end of the world to the other, but nowhere had he found a sense of home, of belonging, and so he had come to America, settling in Southern California where the bizarre was taken for granted, where a man who shunned the daylight and lived like a recluse was not considered strange at all, merely eccentric.</p><p>But now Leanne was here, in his arms, and for the first time in three hundred years he felt a sense of belonging, of hope. He stroked her hair, traced the curve of her cheek.</p><p>\"Leanne,\" he murmured. \"Can you save me, I wonder.\"</p><p>She drew back, a frown furrowing her brow. \"Save you?\"</p><p>Only then did he realize he had spoken the words aloud.</p><p>\"Save you from what?\" she asked.</p><p>\"Nothing.\" He looked away, knowing the hunger was glowing in his eyes. \"We'd better go back.\"</p><p>She didn't argue, only continued to stare up at him, her expression filled with concern and another emotion he could not quite fathom. Not fear. He knew fear when he saw it.</p><p>And then, to his surprise, she gently touched his cheek. \"Don't be afraid, Jason,\" she said quietly. \"You're not alone anymore.\"</p><p>Before he could absorb the meaning of her words, a dog came charging through the trees, saliva dripping from its massive jaws.</p><p>Instinctively, Jason thrust Leanne behind him, putting himself between her and the Rottweiler's slathering jaws. A sharp command kept Lucifer from bolting down the hill.</p><p>Summoning his dark power, Jason turned his preternatural power on the dog. As though it had slammed into a brick wall, the Rottweiler came to an abrupt halt. Whining softly, it eyed Jason for a moment, then turned and ran down the hill with its tail tucked between its legs.</p><p>Leanne blew out the breath she had been holding. Never had she seen anything like that in her life.</p><p>\"We'd best go,\" Jason said, and before she had time to argue, before she had time to ask what had just happened, he lifted her onto Lucifer's back. Vaulting up effortlessly behind her, he touched his heels to the stallion's flanks and the horse broke into a canter.</p><p>When they reached the yard, he dismounted. After lifting Leanne from Lucifer's back, he gave the stallion a pat on the rump. With a toss of its head, the horse trotted into the corral, then whinnied softly when Jason closed the gate.</p><p>\"Jason, that dog...\"</p><p>\"It's getting late.\" He drew her into his arms and kissed her deeply. \"Would you mind if I called a taxi to take you home tonight?\"</p><p>\"I don't mind,\" she murmured, all thought of the dog forgotten in the sweet afterglow of Jason's kiss.</p><p>He yearned to read her mind, to discover what she thought of him, but for the first time in his long existence, he could not bring himself to steal his way into another's thoughts.</p><p>After calling a cab, he walked her down the stairs that led to the street. \"Will I see you tomorrow night?\"</p><p>\"I'm counting on it.\"</p><p>He took her in his arms and held her, drinking in her nearness, her warmth.</p><p>The taxi arrived a short time later.</p><p>\"Goodnight, Jason. Sweet dreams.\"</p><p>He kissed her once more, briefly, sweetly, and then, reluctantly, he let her go. Already, he could sense the coming of dawn, feel the heavy lassitude stealing over his body, draining his strength, dragging him down, down, into darkness.</p><p>His steps were heavy as he made his way to his lair in the basement. Hollywood might insist that its vampires sleep in silk-lined coffins, but then Hollywood perpetuated a good many myths that had no basis in fact. He had no need to rest in a coffin; indeed, he found the mere idea macabre. Instead, he preferred to pass the long, lonely daylight hours resting in a corner of the cellar, his head and shoulders covered by a patchwork quilt similar to the one he had once shared with Jolene.</p><p>Jolene...he fell asleep with her name on his lips, but it was Leanne's image that kept him company until darkness spread her cloak over the land once more. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jason saw Leanne almost every night after that. She arrived at his house shortly after eleven and stayed until the early hours before sunrise.</p><p>It was a routine that fit his with remarkable precision. He never had to worry about offering her food because of the lateness of the hour. An occasional cup of coffee or a glass of wine were all she ever asked for.</p><p>Often, they went riding in the moonlight, sharing the quiet intimacy of the night.</p><p>Sometimes, as now, they sat on the sofa watching television. Tonight they were watching an old movie called Love at First Bite, which was an affectionate spoof of vampire films. A dashing George Hamilton starred as the infamous Count Dracula. Susan St. James played the lady of his dreams.</p> <p>\"He's a very romantic night creature,\" Leanne remarked. \"With you, never a quickie, always a longie...\" She grinned impishly as she quoted her favorite line from the movie.</p><p>Jason arched one brow as he watched George Hamilton hurrying down a dark New York street moments before the coming of dawn, his black cape swirling behind him like the devil's breath. Romantic, indeed.</p><p>He ran his finger along the side of neck. \"And would you let the Count bite you if you had the chance?\"</p><p>Leanne poked him playfully in the ribs. \"Oh, I think I'd let the sexy Mr. Hamilton nibble on anything he liked.\"</p><p>He captured her hand in his. \"Have you ever thought about what it would be like to be a vampire?\"</p> <p>\"Sure, who hasn't?\" She smiled at him, her deep green eyes dancing with amusement. \"I mean, except for the blood part, the thought of living forever is very appealing, although I'm not sure I'd want to turn into a bat.\"</p><p>The blood part. Jason's gaze moved to the pulse in her throat. He could hear the blood moving through her veins, smell the heat of it - imagine the warmth of it on his tongue. The thought of drinking from her sickened him even as it excited him.</p><p>\"And do you believe in vampires?\" he asked, his voice low and seductive.</p><p>Leanne's gaze met his, all humor gone from her expression. \"Yes, I do.\" She lifted one brow. \"You look surprised.\"</p><p>\"I am. Most people in this day and age don't believe in monsters.\"</p><p>\"There are all kinds of monsters.\"</p> <p>\"Indeed.\" He glanced at the screen, his stomach muscles tightening as George Hamilton enveloped Susan Saint James in the folds of his voluminous black cape to give her the final bite that would change her into a vampire.</p><p>He was aware of Leanne's hand resting on his thigh, felt his desire stir, his fangs lengthen at the thought of bestowing the Dark Gift upon her, of making her his bride. Forever.</p><p>\"Is something wrong, Jason?\"</p><p>He shook his head, and then, unable to keep from touching her, he drew her into his arms and kissed her.</p><p>His touch went through her like lightning, igniting every nerve ending, every sense of awareness. His tongue plundered her mouth, stealing her breath away, until she thought she might faint from the sheer pleasure of his touch. He whispered her name, his voice urgent, almost rough, as though he were in pain.</p><p>When his hands slid under her sweater to settle on her bare back, she felt the tremors that coursed through him as his fingertips caressed her quivering flesh. His kiss deepened, taking her to places she had never been, never dreamed of. His intensity frightened her even as it excited her. He seemed to know exactly what she liked, what she wanted. What she needed.</p><p>She gasped with pleasure as she felt his teeth nip at the lobe of her ear, then nibble the side of her neck. Desire shot through her, and with it an image of darkness that went beyond black.</p><p>\"Jason!\" Alarmed, she drew back.</p> <p>The light in his eyes burned brighter than any candle, hotter than any sun. His breathing was erratic, his lips slightly parted. She watched him draw several deep breaths, felt the effort it cost him to release her.</p><p>\"I'm sorry,\" he rasped. \"Forgive me.\"</p><p>\"It's all right. I'm as much to blame as you are.\"</p><p>\"No.\" He couldn't keep his hands from shaking, couldn't keep his gaze from returning time and again to the pulse now beating rapidly in her throat.</p><p>Rising, he extended his hand. \"Come, I'll walk you to your car.\"</p><p>She didn't want to go home, she wanted to stay here and spend what was left of the night in his arms, but leaving was definitely the smart thing to do. Things were moving too far, too fast. Another moment, and she would have lost all control. Another kiss like the last one, and she would have given him whatever he wanted.</p><p>Hand in hand, he walked her down the stairs to the driveway.</p><p>Jason opened the car door for her, kissed her cheek before she slid behind the wheel.</p><p>Leanne closed the door, then rolled down the window and leaned out for one more kiss.</p><p>He covered her mouth with his, drinking deeply of her innocence. \"Don't come here tomorrow night, or any other night,\" he said and before she could ask why, he turned away, taking the stairs two at a time.</p><p>From the window in the living room, he watched her drive away, wondering if she had any idea of the danger she had been in.</p><p>She called him the following night. At her request, he had bought an answering machine several days ago. Now, listening to the sound of her voice as she asked what she had done wrong, tugged at his heart.</p><p>She called several times the next day, and for three days thereafter, her voice filled with tears and confusion, and then she stopped calling.</p><p>Jason sat in his favorite chair in front of the fireplace in the den, his hands clenched into tight fists as he listened to the soundtrack from The Phantom of the Opera. The haunting words of the Phantom's plaintive cry as he pleaded for Christine's love filled the room, echoing the need in Jason's heart.</p><p>The Phantom's music of the night might be a ballad of love and longing, Jason thought, but his own song was a requiem of blood and death, of darkness as deep and wide as eternity, as bottomless as the bowels of an unforgiving hell.</p><p>The Phantom of the Opera lived in the darkness of life, Jason mused bitterly, but he was trapped in the everlasting darkness of his own soul.</p><p>He shuddered to think how close he had come to wrapping Leanne in his lethal embrace, to satisfying his unholy hunger by stealing the essence of life from a creature who was pure and undefiled.</p><p>He could not see her again. He loved her too much to put her life in danger, to risk turning her into the kind of monster he had become. He could not imagine her stalking the dark streets, preying on others to prolong her own life.</p><p>There was no hope for him, but he would not condemn Leanne to share his fate. She was a beautiful young woman with her whole life ahead of her. She had been born to walk in the light of the sun, to find love in the arms of a mortal man who could share her whole life, bear his children.</p><p>A hoarse cry rose in Jason's throat, a cry that became an anguished scream of denial as he imagined her in the arms of another man, one who could spend his days at her side, who could make love to her when the sun filled the sky. A man who didn't live his life in the shadows.</p><p>A man who didn't thirst for that which made him a thief of the worst kind, stealing the very essence of life, and sometimes life itself.</p><p>For the next week, he tormented himself by going to the theater, watching her perform on stage, hearing the sweet magic of her voice.</p><p>He listened to the Phantom's anguished cries with renewed pain. Just once, he thought, just once he wanted to see Christine turn her back on the handsome Vicomte de Chagny and give the Phantom of the Opera the love he yearned for, the love only she could give.</p><p>When the show was over, he lingered in the deep shadows to make sure Leanne made it safely to her car. It was the worst kind of torture, watching her from a distance, hungering for her touch, yearning to hear the sound of his name on her lips.</p><p>Each night, he watched her search the crowd waiting at the stage door, the hope in her eyes fading when she couldn't find him.</p><p>And now he stood in the shadows again, a tall figure dressed all in black. Couples strolled past him, never knowing he was there. Frustrated beyond reason, hating what he was because it kept him from the woman he loved, he needed every ounce of self-control he possessed to keep from destroying the innocent creatures who passed him by. He was torn by the desire to lash out, to hurt others as he was hurting.</p><p>A young couple passed by and it was all Jason could do to keep from sinking his fangs into the man's throat, to turn the man into a monster so that the woman at his side would look at him with fear and loathing instead of desire.</p><p>He fought down the growing lust for blood as he saw Leanne coming down the sidewalk. She was late tonight, and he wondered what, or who, had detained her at the theater. Jealousy swept through him, as bitter as bile at the thought of her with another man. A living, breathing mortal man.</p><p>His hands curled into tight fists as he watched her cross the street. More than anything, he wanted to go to her, to take her in his arms and hold her, for just a moment. But he stayed where he was, knowing it would only cause them both pain.</p><p>Jason's eyes narrowed when he saw three dark shadows disengage themselves from a doorway and follow Leanne into the parking lot.</p><p>He lost sight of her as she turned the corner. And then he heard her scream.</p><p>In an instant, he was across the street. He took in the scene at a glance - one of the men was fondling Leanne while the other two rummaged through her handbag. Silent as a shadow, Jason's hands closed around the throat of the thug holding Leanne. The man's choked cry alerted his companions and they whirled around to face him. One held a knife; the other a pistol.</p><p>Jason heard Leanne scream his name as the gunman fired three times in quick succession. Oblivious to the impact of the bullets, Jason tossed the first man aside, then lunged forward, a hand locking around the neck of each of the assailants. Slowly, so slowly, his fingers tightened around their throats. He would have broken their necks without a qualm if Leanne had not been there. The sound of her sobs penetrated the dark red mist that hovered in front of his eyes. With a muttered curse, he released the men. They fell in a soundless heap at his feet.</p><p>\"Jason!\" Leanne ran toward him, her face pale, her eyes wide with fright.</p><p>\"I'm all right.\" His gaze moved over her in a quick assessing glance. \"Did they hurt you?\"</p><p>\"No.\" She stared at the bullet holes in his coat. Unable to believe her eyes, she touched each one with her fingertips, then looked up at him, her face as pale as the moon.</p><p>Hating himself because he had to deceive her, he fixed her with his hypnotic gaze, willing her to forget that the man had fired his gun, to remember only that he had come to her rescue. He left her spellbound while he went to his car, removed his coat, and replaced it with a jacket he had left in the back seat.</p><p>Returning to her side, Jason released her from his spell.</p><p>\"Come,\" he said, taking the keys from her hand. \"I'll drive you home.\"</p><p>Leanne blinked up at him, then glanced at the three men sprawled on the pavement. \"What about them?\"</p><p>\"Leave them.\"</p><p>\"Aren't you going to arrest them?\"</p><p>\"No, I'm going to take you home.\"</p><p>\"But...\"</p><p>\"Very well. Let's go back to the theater. We can call from there.\"</p><p>Twenty minutes later, a black and white pulled into the parking lot. After the three suspects were handcuffed and tucked into the back seat of the patrol car, Leanne gave the officers her name and address and told them what had happened. Jason corroborated her story.</p><p>The police officer who took Jason's statement frowned as he examined the gun. \"This weapon's been fired,\" he remarked, opening the chamber. \"Three rounds.\"</p><p>\"I don't remember any gunshots,\" Leanne said, looking from the police officer to Jason. \"Do you?\"</p><p>Jason shook his head. \"No.\"</p><p>The cop scribbled something in his notebook, thanked Leanne for her time, advised her to be more careful in the future, assured her they would get in touch with her if they needed more information, and bid the two of them goodnight.</p><p>\"I've never been so scared,\" Leanne whispered, and as the knowledge of what could have happened hit her, she began to tremble uncontrollably.</p><p>\"It's over,\" Jason said, wrapping her in his arms. \"Don't think about it.\"</p><p>\"I can't help it. I know this kind of thing happens all the time, but I never thought it would happen to me.\"</p><p>He nodded. \"Come on, let's get out of here.\" Keeping one arm around her shoulders, he unlocked her car door and helped her inside, then went around to the driver's side.</p><p>\"What about your car?\" she asked.</p><p>\"I'll get it tomorrow.\"</p><p>After he pulled out of the parking lot, Jason took Leanne's hand in his and held it tight.</p><p>\"Jason, could I spend the night at your place? I don't want to be alone.\"</p><p>Not a good idea, he thought, but he didn't have the heart to refuse her. \"Sure.\"</p><p>\"We could go to my place, if you'd rather.\"</p><p>\"My place is fine.\"</p><p>Sighing, she rested her head against the back of the seat and closed her eyes.</p><p>When she opened them again, they were pulling into Jason's driveway.</p><p>She was still trembling when she got out of the car. \"Nerves, I guess,\" she murmured, then gasped as Jason swung her into his arms and carried her swiftly up the stairs and into the house.</p><p>Inside, he placed her on the sofa and poured her a glass of chardonnay, then went into the bathroom to fill the tub with hot water.</p><p>\"You'll feel better after you've had a bath,\" he said, taking the empty glass from her hand.</p><p>With a nod, she went into the bathroom and shut the door. A good hot soak was just what she needed. Undressing, she sank into the tub, willing herself to relax, to forget the terror that had engulfed her. She could have been robbed. She could have been killed.</p><p>Reaching for the soap, she washed vigorously, knowing she would never wash away the fear, or the vile memory of being touched by an unwanted hand. Thank God for Jason, she mused, and never thought to question what he had been doing in the parking lot.</p><p>Jason paced the floor in the living room, his keen hearing easily identifying the sounds Leanne made as she undressed, then stepped into the tub. It was so easy to picture her lying there, the water moving over her, caressing her, as he so longed to do...</p><p>With an oath, he threw his wine glass into the fireplace, feeling a sense of satisfaction as the glass shattered, falling onto the stone hearth in a shower of glittering crystal shards. If only he could destroy his accursed need with such ease.</p><p>He prowled the room, his fists shoved into the pockets of his jeans, his desire clawing at him with each step. So easy, he thought, so easy to take her, to make her his, to bind her to him forever, body and soul.</p><p>The sound of the bathroom door opening echoed in his mind like thunder.</p><p>Leanne gasped as Jason whirled around to face her. The heat in his eyes seemed to engulf her so that she felt suddenly hot all over, as though she were standing in front of a blazing fire.</p><p>\"Feeling better?\" he asked.</p><p>\"Yes, thank you.\" She smiled faintly, wondering if she had imagined the unnatural red glow in his eyes.</p><p>\"Would you care for more wine?\"</p><p>\"No. I...\"</p><p>\"What is it?\"</p><p>\"I'm awfully tired. Would you mind if I went to bed?\"</p><p>\"Of course not. You won't be comfortable sleeping in your clothes.\"</p><p>A faint flush brightened her cheeks. \"I don't have anything else.\"</p><p>\"I'll get you something.\"</p><p>He went into the bedroom, his gaze lingering on the bed. He had lived in this house for twenty years, he mused, and no one had ever slept in that bed. It pleased him to think of Leanne lying there, her hair spread on the pillow, her scent permeating the sheets, the very air he breathed.</p><p>Going to the dresser, he opened the bottom drawer and pulled out a green silk nightgown. He had bought it because the color reminded him of her eyes, because for one irrational moment, he had pretended he was an ordinary man buying a gift for the special lady in his life. He had bought it and put it away, as he had put away his dreams of sharing her life. Holding the gown in his hands, he was reminded of the silk of her hair, the softness of her satin-smooth skin.</p><p>\"Is that for me?\"</p><p>He turned to see that Leanne had followed him as far as the bedroom doorway.</p><p>He lifted one brow. \"Who else would it be for?\"</p><p>\"I thought...\" Lifting her chin, she took a deep breath. \"When you sent me away, I... You stopped coming to the theater, I thought you might have found someone else.\"</p><p>He shook his head. \"There will never be anyone else, Leanne.\"</p><p>\"Then why? Why did you send me away? Why haven't you come to see me? Did I do something wrong?\"</p><p>\"No.\" He thrust the gown into her hands, then left the room, firmly closing the door behind him. He never should have brought her here, never agreed to let her spend the night.</p><p>He stood in the living room in front of the fireplace, fighting the urge to go to her, to sweep her into his arms and satisfy the awful lust that was roaring through him, the lust to possess her, to drink and drink of her life-sustaining sweetness, and then give it back to her.</p><p>She was a beautiful woman. She would be even more stunning as a vampire. The Dark Gift would magnify the deep green of her eyes, add luster to her hair and skin.</p><p>He clenched his hands into tight fists, wondering if he had the strength to continue seeing her and not possess her. He knew, at the very core of his being, that their joining would be everything he dreamed of, everything he yearned for.</p><p>It would be so easy to take her blood, to bind her to him for all eternity, and end the awful loneliness of his existence, but he recoiled at the very idea of condemning her to the kind of life he led. To do so would be the worst kind of betrayal. Leanne was youth and beauty, a child of the light. She had brought laughter back into his life, had drawn him out of the depths of despair and given him a reason to rise in the evening. To condemn her to a life in the shadows would be the worst kind of cruelty.</p><p>He should send her away now, for her own good, before it became impossible to let her go, but even as the thought crossed his mind, he knew he would not do it. Soon, he thought, soon he would leave Los Angeles and never see her again, but not now, when he had just found her. He only hoped he was strong enough to keep his accursed hunger at bay, that there was enough humanity left in his soul to leave her when the time came.</p><p>His whole body tensed as the bedroom door opened. Without looking, he knew she was standing behind him, watching him. He could feel her gaze on his back, sense her confusion.</p><p>\"Jason?\"</p><p>\"Go to bed, Leanne.\" He had not meant the words to sound so harsh.</p><p>He sensed her hesitation, her hurt, and then, very quietly, she went back into the bedroom and closed the door.</p><p>With a sigh, Jason dropped into his favorite chair and buried his face in his hands, hands that trembled with the need to hold her close, to feel the warmth of her in his arms, to breathe in the scent of her hair and skin. She was so full of life, so vibrant, just holding her made him feel alive again. But it wasn't only her flesh which called to him, and that was why he had to let her go, before it was too late.</p><p>He didn't know how long he'd sat there, staring into nothingness, when he heard her cry out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bolting from the chair, Jason ran into the bedroom, ready to do battle with Satan himself if need be. But there was no one in the room except Leanne, tossing restlessly on the bed.</p><p>Her hair spread across the pillow like chocolate silk. She had thrown off the covers and the gown's full skirt pooled around her thighs, offering him a beguiling glimpse of shapely calves.</p><p>Another cry was torn from her throat and he saw a tear slip down her cheek.</p><p>Before he quite realized what he was doing, Jason was at her side, gathering her into his arms. \"Hush, love,\" he murmured. \"It was only a dream, a bad dream.\"</p> <p>\"Jason?\"</p><p>\"I'm here.\"</p><p>She wrapped her arms around his neck. \"It was awful,\" she said, her voice husky with sleep. \"I was dreaming about tonight, but it was worse, much worse.\" She drew back, her gaze seeking his. \"That horrible man shot you.\"</p><p>He shook his head. \"No.\"</p><p>\"Yes!\" She placed her hand on his chest, over his heart. \"I saw it so clearly. It couldn't have been a dream.\"</p> <p>\"But it was,\" he said reassuringly. \"Look.\" He lifted his shirt so she could see his chest. \"You see? No bullet holes.\"</p><p>\"But I saw it, I know I did. I heard the gunshots...\"</p><p>He settled her in his lap and rocked her gently. \"Go back to sleep, Leanne. Everything is all right.\"</p><p>\"Is it?\" Sighing, she rested her head against his chest and closed her eyes. \"You feel so cold.\"</p><p>Unable to help himself, he pressed a kiss to the top of her head, willing her to relax, to sleep, to forget.</p><p>\"I love you, Jason,\" she murmured drowsily. \"Please don't leave me again.\"</p> <p>He closed his eyes, her words pouring over him like hot August sunshine. She loved him.</p><p>It was a dream come true.</p><p>It was his worst nightmare.</p><p>\"Promise me,\" she whispered. \"Promise you'll never leave me.\"</p><p>Ah, Leanne, my love, if you only knew what you were asking of me. If you only knew how your nearness torments and tempts me. If you only knew how long, and how lonely, forever can be.</p><p>She pulled back a little so she could see his face, her eyes searching his. \"You don't love me, do you?\"</p><p>He looked away, unable to bear the sight of the pain shimmering in the depths of her eyes. Love her, he thought, if only he didn't!</p><p>A single tear slipped down her cheek. It was his undoing.</p> <p>\"I do love you, Leanne.\"</p><p>\"You mean it?\"</p><p>\"I swear it by all that I hold dear.\" The words were wrenched from the depths of his soul. \"Please, do not weep. I cannot bear the sight of your tears.\"</p><p>\"Oh, Jason!\" She threw her arms around his neck and kissed him, kissed him until they were both breathless.</p><p>She was fire and honey in his arms. All his senses came alive until he was drunk with the taste of her lips, the scent of her flesh, the sound of her whispered endearments. He trembled, his body hardening with desire. The need to nourish himself with the very essence of her life burned through him, as potent, as strong, as his desire for her flesh.</p><p>He groaned deep in his throat as her body molded itself to his. Her tongue laved the lobe of his ear, his neck; her hands explored the length and breadth of his back and shoulders, then boldly explored his thigh, her fingertips tracing the muscle there.</p><p>\"Leanne.\" He caught her hands in his and willed his body to relax, knowing that in another moment his desire and his lust for blood would be impossible to control.</p><p>\"It's all right,\" she said, her eyes shining with love and trust. \"I want you to make love to me.\"</p><p>\"I can't.\"</p><p>\"Why not?\"</p><p>Why not? What possible excuse could he give her? \"I don't have any... any...\" Hell's bells, what did they call those things? \"Any protection.\"</p><p>\"I don't care.\"</p><p>He summoned a tight smile. \"I do.\"</p><p>\"I don't have any diseases, Jason,\" she said quietly. \"I've never been with a man before.\"</p><p>He swore softly, his self-control hovering on the brink of collapse. \"All the more reason why we should wait.\"</p><p>Maybe he was right, she thought, though she couldn't help being disappointed. Her mother had always taught her that good girls didn't \"do it\" until they were married. Her father, a wise and sober man blessed with the gift of sight, had warned her that, if she let herself be defiled before marriage, her life would be in great danger. When Leanne asked him to explain, her father had taken her in his arms and told her that he'd had a most disturbing vision of her future - a vision in which he had seen her surrounded by darkness and danger, protected only by her innocence. And then he had warned her that if she gave herself to the wrong man, she risked the chance of being forever cursed.</p><p>Thinking of that now, she was ashamed of her own weakness and doubly grateful for Jason's self-control.</p><p>\"If I promise to behave, do you think you could stay with me until I fall asleep?\"</p><p>With a nod, he drew the covers up to her chin, his expression solemn, and then he sat beside her, one of her hands holding tight to his.</p><p>She smiled up at him and then, tucking his free hand under her cheek, she closed her eyes.</p><p>He sat there, listening to the soft sound of her breathing, aware of her fingers entwined with his, of her cheek nestled in the palm of his hand. Her warm womanly scent filled his nostrils. The steady beat of her heart made sweet music in his ears even as it teased his hunger.</p><p>It was both pain and pleasure to sit so close to her. He would have liked to stay until she woke, to be the first thing she saw when she opened her eyes, but all too soon he sensed the approach of a new day. Freeing his hands, he brushed a kiss across her lips and then, regretfully, left the room.</p><p>In the kitchen, he wrote her a note, saying he had been called to work early, and he would see her at the theater that night. He invited her to stay as long as she liked, to take Lucifer out for a ride if she was inclined to do so. He dropped the keys to her car on top of the note, and then, his steps growing heavier by the moment, he made his way down to the basement.</p><p>He closed the door behind him, slipped the bolt into place, and then wrapped himself in the quilt. Sighing, he closed his eyes.</p><p>The slow, steady beat of her heart lulled him to sleep.</p><p>Leanne woke with a smile on her face. Jason loved her. She stretched her arms over her head, feeling as contented as a well-fed cat. He loved her.</p><p>And she couldn't wait to see him. Bounding out of bed, she hurried out of the room. She had expected to find him in the kitchen and when he wasn't there, she checked the other bedroom. It, too, was empty.</p><p>Shrugging, she went back into the kitchen. She would fix herself something to eat, shower, and then go home. It was then that she saw the note.</p><p>She read it quickly and then, clutching the slip of paper in her hand, she glanced around the kitchen. She had been looking forward to cooking breakfast for Jason. It would have been the first time they had spent a day together, the first meal they had shared. She'd wanted to spend as much time as she could with him before it was time to go home and get ready for the theater.</p><p>With an effort, she shrugged off her disappointment. If she was going to be in love with a cop, she supposed this was the kind of thing she would have to get used to. Police officers worked irregular hours. They were on call twenty-four hours a day. They missed birthday parties, and Christmas mornings, and anniversaries. They worked long hours for little pay. And these days, when law officers were being maligned and criticized more than ever, a cop needed the support of his loved ones.</p><p>Crossing the floor, she opened one of the cupboards. It was empty. So was the next one, and the next. Frowning, she opened the refrigerator. Nothing.</p><p>Leanne shook her head. She could understand it if he never cooked, but she had expected him to at least have the basics in the house - coffee, sugar, salt and pepper. A loaf of bread. Margarine. A quart of milk.</p><p>Puzzled, she went into the bedroom and opened the closet. It was reassuring, somehow, to see his clothing hanging there, to see several pairs of shoes and boots in a neat row on the floor.</p><p>After getting dressed, she wandered through the house again. There were no personal items to be found; no photos of Jason, no souvenirs or personal mementos. Why had she never noticed that before? If not for his clothes and the hundreds of books in the den, she would have wondered if the place was really his.</p><p>With a shake of her head, she picked up her keys and left the house. He could answer her questions tonight; in the meantime, she had some shopping to do.</p><p>Jason felt Leanne stirring in the rooms above. Even though he was trapped in the daylight sleep of the undead, he could feel her presence as she moved from room to room, sense her confusion when she realized there was nothing to eat in the house. He should have thought of that, but then, he hadn't planned to see her again, or to bring her here again.</p><p>Leanne. Leanne. Her name whispered through the sluggishness of his mind. He yearned to go to her, but his body, held prisoner by the daylight, refused to obey.</p><p>Trapped in a web of darkness, he willed the sun to hurry across the sky.</p><p>Leanne stood in the wings, peeking out at the audience during intermission. She felt her heart skip a beat when she saw Jason. He was sitting in the fifth row, center section.</p><p>How handsome he was! His dark jacket complimented his hair, the dark blue shirt brought out the color of his eyes. Her gaze moved lovingly over his face, the width of his shoulders. He seemed to be in a world apart as he sat there. People milled around, waiting for the second act to begin, laughing and talking, making their way down front to look into the orchestra pit, which really did look like a pit. It was lined in black cloth; the musicians always wore black. She saw several girls talking to Andy, the bassoon player. He was a nice guy, funny and outgoing, and seemed to know everyone.</p><p>Leanne took her place backstage as the house lights dimmed and the orchestra began to play the Entr'acte. She was glad when the second act, shorter than the first, began. Soon, she thought, soon she would be with Jason again.</p><p>She was aware of his gaze as she moved onstage during \"Masquerade\". Of all the scenes she was in, this was her favorite. She loved the costumes and the music, the humor at the beginning, the sudden change in mood as the Phantom appeared in the guise of Red Death, the way he descended the staircase, each step, each nuance depicting power and mystery. Most of all, she loved the way he disappeared in a flash of smoke through a trap door in the floor of the stage.</p><p>She loved to hear Dale Kristen sing Wishing You Were Somehow Here Again. But of all the songs in the play, her favorite was Wandering Child. She wasn't sure why, only that the words and the pain in the Phantom's voice always made her cry.</p><p>Jason sat forward, lost in the depths of the Phantom's anguish as he told Christine she must choose between himself and Raoul.</p><p>And then Christine's voice, pure and beautiful, filled the auditorium, her words of pity and compassion melting the anger and hatred in the Phantom's heart.</p><p>He felt the aching loneliness that engulfed the Phantom as the Phantom watched Christine leave the underground lair with Raoul. What would Leanne do, Jason wondered, if she knew the man she loved was truly a creature of darkness. Would she look at him with pity, the way Christine looked at the Phantom, or would she back away from him, the love in her clear green eyes turning to revulsion? Would she flee from him in horror, disgusted by the memory of his kisses?</p><p>When he left his basement lair earlier that night, her scent had lingered in the air, filling the empty rooms of his house. Evidence of her presence had been everywhere - in the vases of fresh flowers on the mantle in the living room and on the table in the kitchen. There was food in the refrigerator, food that he couldn't eat, milk and soda he couldn't drink. She was fond of fruit, he noted. Melons and strawberries, apples, oranges, and peaches. He opened the cupboard, curious to see what else she had bought. He found a jar of instant coffee, a box of hot chocolate, three cans of chicken noodle soup, a box of crackers, a jar of boysenberry jam, another of peanut butter.</p><p>She had left her mark in the bathroom, as well - a bar of perfumed soap in the soap dish, a bottle of vanilla bubble bath on the edge of the tub, a lacy fern in a bright blue vase on the shelf. He noted a change of clothes on the bed in his bedroom, along with a note that said she would fix him a midnight snack after the show.</p><p>She had also rented a movie. A mirthless grin had curved his lips when he saw the title: Dracula starring Frank Langella. She seemed to have a fondness for vampire movies, he mused ruefully, and, though she didn't know it, a fondness for a vampire, as well.</p><p>Now, sitting in the theater, listening to the applause that thundered through the auditorium as Davis Gaines received a standing ovation, Jason forced himself to admit that, just as the Phantom had let Christine go because he loved her, so he would have to let Leanne go. He could not hide his identity from her forever, nor did he trust himself to go on seeing her without hurting her, without turning her into a creature as wretched as himself.</p><p>Just one more night, he thought. Just one more night to hold her and love her, and then he would let her go.</p><p>He lifted his gaze to the stage, focusing on her face as she stood in the background with the other chorus members. Her eyes were bright, her lips parted in a smile that was his and his alone.</p><p>Just one more night, he thought again, one night to last him for eternity.</p><p>Heavy-hearted, he left the theater and went to wait for her at the stage door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Leanne ran up to him, bubbling with excitement. \"Wasn't it great tonight?\" she exclaimed. \"Oh, I know, it's great every night, but sometimes it all seems so real, I forget it's just a play and find myself crying when the Phantom sends Christine away.\"</p><p>Jason nodded. He had often felt that way himself.</p><p>Leanne threw her arms around Jason and kissed him. \"Did you have a good day?\"</p><p>\"The same as always,\" he replied, and then, seeing the expectant look in her eyes, he smiled. \"Thank you for the flowers, and everything.\"</p> <p>\"I hope you don't mind.\"</p><p>\"No.\" He took her hand in his and gave it a squeeze. \"Let's go home.\"</p><p>Leanne hummed softly as they drove down the freeway, her hand resting on Jason's thigh, her gaze returning again and again to his profile. She loved the rugged masculine beauty of his face, the finely sculpted nose and lips, the strong square jaw. His brows were thick and black above deep blue eyes, his cheekbones pronounced.</p><p>How had she fallen in love so quickly, so completely, with this man who was still a mystery in so many ways? She hardly knew him, and yet she felt as if she had always known him, as if her life hadn't truly begun until the night they met.</p><p>\"Jason?\"</p> <p>He slid a glance in her direction. \"What?\"</p><p>\"My folks would like to meet you.\"</p><p>The silence that followed her remark was thick and absolute.</p><p>\"Jason?\"</p><p>\"One day, perhaps.\"</p><p>\"How about next Sunday?\"</p> <p>\"Leanne...\"</p><p>\"You don't want to, do you? Why not?\"</p><p>\"Surely you must have realized by now that I'm a bit of a recluse when I'm not working.\"</p><p>\"I know, but I'd really like for you to meet them. And for them to meet you.\"</p><p>\"I'll consider it.\"</p><p>\"I'm sorry.\" She took her hand from his thigh, then looked out the window. \"I didn't mean to push you, or make you think I was trying to...\"</p><p>He muttered an oath as he pulled into the driveway and turned off the ignition. Getting out of the car, he opened the door for her, then drew her into his arms.</p><p>\"I'm sorry, Leanne, I didn't mean to hurt your feelings. Please, just give me a little time.\" Just give me tonight. \"Come,\" he said, taking her by the hand. \"I have a surprise for you.\"</p> <p>\"What kind of surprise?\"</p><p>\"You'll see.\"</p><p>Inside the house, he lit a dozen long blue tapers. \"Sit down,\" he said, \"I'll only be a moment.\"</p><p>With a nod, Leanne sank down on the sofa. Kicking off her shoes, she stared at the candles flickering on the mantel. A surprise, she thought. What could it be?</p><p>A few minutes later, Jason returned. Kneeling in front of the hearth, he lit a fire and then joined her on the sofa.</p><p>\"Here,\" he said, handing her a long slender box. \"This is for you.\"</p><p>She opened the box with hands that trembled, uttered a gasp of astonishment as she stared at the contents. \"Oh, Jason, it's lovely.\"</p><p>\"You like it, then?\"</p><p>\"Oh, yes.\" She ran her fingertips over the heavy gold chain, then outlined the filigreed heart-shaped locket. \"But it must have cost a fortune.\"</p><p>\"Only a small one.\" He lifted the chain from the box and fastened it around her neck. The locket settled in the cleft between her breasts. \"I'm glad it pleases you.\"</p><p>\"I love it!\" she exclaimed. \"And I love you.\"</p><p>Her gaze met his, filled with such adoration that it made him want to shout, to sing. To weep. \"Leanne, beloved...\" He cupped her cheek in his hand and gently pressed his lips to hers.</p><p>\"More,\" she whispered, and twining her arms around his neck, she kissed him passionately, her body leaning into his, inviting him to come closer.</p><p>Her nearness, the wanting he read in her eyes, made his pulse race with desire. Too fast, he thought, they were moving too fast. If he was to have only this one night, he needed to savor every moment.</p><p>Leanne drew back, her eyes aglow. \"Tell me,\" she whispered. \"Tell me you love me.\"</p><p>\"I love you.\"</p><p>\"Have you loved many women?\"</p><p>\"No. Only one other.\"</p><p>\"Who?\"</p><p>\"A girl from my childhood. She is dead now.\"</p><p>\"Oh, I'm sorry.\"</p><p>\"It was a very long time ago.\"</p><p>He gazed into her eyes, longing to bury his hands in the wealth of her hair, to carry her to bed and sheathe himself deep within the velvet heat of her all the night long, but he dared not. He would make love to her only once, just before dawn, and then he would let her go.</p><p>It took every ounce of willpower he possessed to keep from touching her. \"Shall we watch your movie?\"</p><p>\"If you like. Have you seen it before?\"</p><p>\"No.\"</p><p>\"You'll love it.\"</p><p>Jumping up, she slipped the tape into the VCR, then snuggled up against Jason, her head pillowed on his shoulder.</p><p>Langella made a most convincing vampire, Jason thought. Indeed, the movie hit close to home. Too close. He felt his desire for Leanne surge through him, along with a ravening thirst, as he watched Count Dracula seduce his lady love amidst a shimmering crimson backdrop while a bat hovered in the background.</p><p>A bat. He grunted softly. He had never changed into a bat in all his three hundred years; indeed, he didn't know if it was even possible.</p><p>He felt his body tense as Dracula made a slit in his chest and offered Lucy a taste of his blood.</p><p>\"I think he's the most realistic vampire I've ever seen,\" Leanne remarked.</p><p>\"Indeed. Have you seen many?\"</p><p>\"I mean in the movies, silly. Everyone knows vampires don't really exist. I almost wish he didn't have to die in the end.\"</p><p>\"Good always triumphs over evil, eventually,\" Jason remarked.</p><p>\"I suppose, but he doesn't seem evil exactly,\" she mused. \"I mean, I guess he can't help being what he is.\"</p><p>\"No,\" Jason said, his voice strangely thick. \"He can't.\"</p><p>\"And he does seem to love her.\"</p><p>Jason gazed deeply into Leanne's eyes. \"Yes, he does.\"</p><p>\"I don't think I want to watch the end.\" She laughed self-consciously. \"I've already seen one sad ending tonight.\"</p><p>\"As you wish.\" Rising, Jason switched off the VCR. \"Tell me, how does this Dracula meet his death?\"</p><p>\"On a ship. Doctor Van Helsing catches him on a big hook of some kind and they hoist him into the sunlight.\" Leanne grimaced. \"I think he ages and disintegrates into ash, but I'm not really sure. I've never watched that part. All I remember is seeing his black cape slowly drifting away in the wind. It made me want to cry.\"</p><p>\"You have a tender heart, my sweet.\"</p><p>\"Enough about vampires and unhappy endings,\" Leanne murmured, reaching for him. \"Make love to me, Jason.\"</p><p>\"You are weeping now,\" he exclaimed softly. \"Why?\"</p><p>\"I don't know. I feel...I don't know, as if something awful is going to happen.\"</p><p>Kneeling on the floor, he drew her down into his arms. \"Nothing bad is going to happen, Leanne,\" he said, tucking a lock of hair behind her ear. \"You're going to have a long and happy life filled with sunshine and laughter.\"</p><p>\"I didn't know you told fortunes,\" she said with a sniff.</p><p>\"Only yours.\" He cupped her face in his hands, his thumbs wiping her tears away. \"You're going to marry and have half a dozen children and live happily ever after.\"</p><p>\"Am I?\"</p><p>\"I promise.\"</p><p>\"And will you be the father of my children, Jason?\"</p><p>\"I should like nothing better,\" he replied evasively, and then, to stop her from asking any more questions he couldn't answer, he kissed her.</p><p>The touch of his lips on hers, the sweet invasion of his tongue, drove all thought from Leanne's mind. She forgot her mother's admonition and her father's dark warning as Jason's lips feathered across her skin, hotter than the flames that burned in the hearth, until she felt as though she, too, were on fire. Perhaps the heat incinerated her clothing, for she was suddenly lying naked beside him while his lips and tongue drifted over her face and neck, exploring the hollow of her throat, the valley between her breasts, her navel, the sensitive skin of her inner thighs.</p><p>With a boldness she didn't know she possessed, she stripped him of his clothing, then let her hands wander over his hard-muscled flesh. He was a study in masculine perfection, from his broad shoulders and flat belly to his long, powerful legs. She felt him shudder with pleasure at her touch, heard a low groan that sounded oddly like pain as she rained kisses along his neck and down his chest.</p><p>And then he was rising over her, his dark eyes blazing with desire.</p><p>\"Tell me to stop if you're not sure,\" he said, his voice low and rough. \"Tell me to stop now, before it's too late.\"</p><p>\"Don't stop.\" She wrapped her arms around his neck and drew him closer. \"Don't ever stop.\"</p><p>With a strangled cry, he buried himself in her softness. She whimpered softly as he breached her maidenhead and he cursed himself for hurting her, but there was no help for it, and it was too late in any case.</p><p>Too late to stop.</p><p>Too late to think.</p><p>He was caught up in an inferno of desire and there was no turning back.</p><p>Leanne clutched at his shoulders, exhilarated by his mastery, frightened by the torrent of emotions that flooded through her. She felt as if she were drowning, being sucked into a swirling vortex from which there was no return. A soft gentle blackness engulfed her, and then she felt as if she were drowning in a warm red mist.</p><p>She moaned as she felt Jason moving deep within her. Her fingernails clawed at his back, drawing blood, and then she was reaching out, reaching for something that shimmered just beyond her grasp, something elusive and beautiful.</p><p>She cried Jason's name as he gifted her with that which she sought, cried with the joy of discovery, of wonder, as her body convulsed beneath his, flooding her with pleasure unlike anything she had ever imagined.</p><p>For a long while, they lay wrapped in each other's arms. She held him tighter when she felt him start to draw away. \"No. Don't go.\"</p><p>\"I must be heavy.\"</p><p>\"You are,\" she admitted, a smile in her voice, \"but I like it.\"</p><p>He shifted to the side a little so she wasn't bearing the full burden of his weight. \"Did I hurt you?\"</p><p>\"No.\"</p><p>He drew back so he could see her face. How lovely she was, her beautiful green eyes still aglow with passion, her lips pink and swollen from his kisses, her hair spread in wild disarray around her shoulders. He felt a ridiculous urge to thank her.</p><p>\"What are you thinking?\" Reaching up, she brushed a lock of hair from his brow.</p><p>\"How wonderful you are.\"</p><p>\"You are,\" she replied. \"Was it...?\" She bit down on her lower lip, suddenly shy. \"Did I please you?\"</p><p>\"Foolish girl, to ask such a question. No one has ever pleased me more.\"</p><p>\"I wish you'd never known anyone but me.\"</p><p>He saw the hurt in her eyes, the sudden flare of jealousy, and silently berated himself because the thought of her being jealous pleased him beyond words.</p><p>He stroked her cheek with his knuckles. \"After tonight, beloved, there will never be anyone else.\"</p><p>\"Truly?\"</p><p>\"Truly.\" Jason buried his face in her shoulder, knowing he had no wish to go on existing without her.</p><p>For three hundred years he had walked the earth, a man separate and apart, and only now, as he contemplated a future without her, did he realize the true meaning of loneliness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jason had promised himself he would make love to her only once, and then let her go, only to find it was a promise he could not keep.</p><p>Selfish monster that he was, he had been helpless to keep from sampling her sweetness again and yet again, and each time he possessed her only increased his appetite for more.</p><p>Holding Leanne in his arms, he wished he could keep the sun from rising in the morning, wished that her face, her beautiful green eyes filled with love, could be the last thing he saw before he surrendered to the dark sleep, that her smile would be the first thing he saw upon rising.</p><p>He had made love to her as tenderly as ever a man had loved a woman. Each moment he spent in her arms brought him the most exquisite pleasure he had ever known, and the most excruciating pain.</p> <p>The lust to possess her wholly, as only a vampire could possess a woman, pulsed through him. Only the love he had for her made it possible to keep his accursed blood lust at bay, to touch the living warmth of her skin, to kiss and caress her, and not bury his fangs in her throat and satisfy the awful hunger that plagued him.</p><p>Still buried deep within the warmth of her body, he held her close, listening as her breathing returned to normal. She whispered that she loved him and then, her eyelids fluttering down, she fell asleep in his arms.</p><p>So young, he thought. So trusting.</p><p>His fangs lengthened as he gazed at the pulse throbbing in the hollow of her throat. The scent of her blood filled his nostrils, teasing him, tempting him beyond endurance.</p><p>One bite. One taste. Just one. Slowly, he lowered his head to her neck, his tongue stroking her skin, tasting the salt of her perspiration.</p> <p>A growl rumbled in his throat. His whole body shook as he fought the need to sink his fangs into her flesh, to swallow a single drop of her blood. Just one small drop. She need never know that a monster had sipped her sweetness.</p><p>Hating himself for his lack of self-control, he bit into the tender skin just below her ear. Her blood was as warm and sweet as he had so often imagined and he hovered over her, a dark phantom torn by a driving need to take more. The darkness inside him urged him to stop fighting what he was and seize what he wanted, what he needed. She was his for the taking; she could be his for all eternity...</p><p>She moaned softly as he brushed a kiss over the curve of her neck, and then she whispered his name.</p><p>Filled with self-loathing for what he had almost done, for what he wanted so desperately, he drew back, surprised to find that he was weeping.</p><p>\"Sleep, beloved,\" he whispered brokenly. \"Dream your young girl's dreams. You're safe from the monster tonight.\"</p><p>She dreamed of darkness, a vast all-encompassing darkness that shut out the light for all time. And, in the heart of that darkness, she saw a man with hair as black as ebony and eyes as blue as a midnight sky. He was dressed in black from head to foot. A cloak the color of death billowed out behind him as he walked toward her, as graceful as a panther stalking its prey, but it was his gaze that captured her; mesmerizing, haunting, his deep blue eyes filled with pain and loneliness.</p> <p>She should have been afraid of him, afraid of the power in his eyes. Instead, she reached out toward him. Let me help you.</p><p>He shook his head, and she saw that he was crying, and his tears were the color of blood. No one can help me, he said, and the anguish in his voice was more than she could bear.</p><p>I'll do anything, she promised. Anything you ask, only let me ease your sorrow.</p><p>Anything? he asked.</p><p>Anything, she replied, and then he was on her, his arms like steel bands around her as he gathered her into the enveloping folds of his cloak. His eyes blazed with an unholy light as he lowered his head. She closed her eyes as his mouth covered hers in a searing kiss, and then she felt his teeth at her neck, a sharp pain, a sudden sense of lethargy.</p><p>A scream of primal terror rose in her throat, a scream that brought her awake with a start.</p><p>Heart pounding in her breast, she sat up, reaching for Jason, only to find herself alone in bed with no recollection of how she had gotten there. She glanced wildly around the room, but he was nowhere in sight. Through a crack in the drapes, she saw that it was dawn.</p><p>She sat there for a long moment and then, with a hand that trembled, she fingered the side of her neck. Was she imagining things, or did she really feel two small puncture wounds? Slipping out of bed, she started for the bathroom, only to stop when she remembered there was no mirror in the bathroom.</p> <p>There were no mirrors anywhere in the house.</p><p>She shook her head vigorously, refusing to even consider the bizarre possibility that came to mind as she climbed back into bed and drew the covers up to her chin.</p><p>She was just letting her imagination run wild.</p><p>\"Just a dream.\" She spoke the words aloud as she closed her eyes. \"Just a dream.\"</p><p>Leanne stared at her reflection in her bedroom mirror, but all she saw were the two small puncture wounds in her neck. For the fifth time in as many minutes, she pressed her fingertips to the twin holes. As before, heat seemed to flow from the wounds and Jason's image danced before her eyes.</p><p>She had looked at those marks in the rear view mirror time and again as she drove home that morning. Looked at them and shuddered. There had to be a rational explanation.</p><p>Now, still staring into the mirror above her dresser, she tried to laugh at the ridiculous image of Jason bending over her, his teeth turning into fangs, biting her neck. Drinking her blood. She had been watching too many vampire movies, she thought, reading too many books by Rice and Herter and Gideon. She was losing her grip on reality. The marks on her neck were probably nothing more menacing than a couple of mosquito bites.</p><p>Leaving the bedroom, she went into the kitchen, grabbed an old rag, and began dusting the living room furniture. Her apartment had been sadly neglected since she met Jason Blackthorne...</p><p>Jason. He had been gone when she woke up. A note informed her that he had been called to court to testify in a case, but promised that he would meet her that night after the show.</p><p>She had never seen him in the daytime.</p><p>Leanne thrust the thought away, plugged in the vacuum cleaner, and ran it over the living room rug. She vacuumed the bedroom, then put the vacuum away, and changed the sheets on her bed. She bundled up her laundry, carried it downstairs, and stuffed it into one of the machines, then went back upstairs to fix lunch.</p><p>She had never seen him eat.</p><p>Sitting at the table, she cradled her head in her hands. It couldn't be. There was no such thing as vampires. Everybody knew that. They were just myths, stories made popular in films and novels. There had to be a logical explanation for the oddities in Jason's life.</p><p>There just had to be.</p><p>She wondered if he was still in court and then, because she couldn't wait until after the show to see him, she grabbed her car keys and drove to his house, her laundry forgotten.</p><p>She had hidden his house key under a flower pot on the front porch. A sudden unease filled her as she unlocked the massive front door. Without thinking, she dropped the heavy brass key into the pocket of her jeans, then stepped into the entry hall. Never before had she noticed how still the house was.</p><p>\"Jason?\"</p><p>She tossed her car keys on the small table inside the front door and walked through the house, as if seeing it for the first time. The rooms were all dark, the sunlight held at bay by the heavy drapes that covered all the windows.</p><p>Remembering vampire movies she had seen, she explored every room, every closet, looking for the secret door that led to the hidden room where Jason slept during the day.</p><p>She shuddered at the thought of seeing him lying in a silk-lined casket, sleeping the dreamless sleep of the undead during the hours of daylight. Unbidden, unwanted, came a rush of images as she recalled every vampire book she had ever read, every horror movie she had ever seen. All had vividly portrayed vampires as the embodiment of evil, preying upon unsuspecting mortals. She felt a rush of nausea as she imagined Jason stalking some helpless woman, sinking his fangs into his victim's neck...</p><p>She pressed her fingers to the marks on her own neck, grimacing as she imagined Jason biting her, drinking her blood. The thought made her gag.</p><p>With an effort, she shook the image from her mind. In the den, she paused before one of the paintings signed J. Blackthorne. Jason had told her an ancestor had painted it. She ran her fingers over the distinctive signature, and then she went into the kitchen and picked up the note Jason had left her that morning.</p><p>Returning to the den, she compared the handwriting on the note to the signature on the painting. They were identical.</p><p>With growing certainty, she continued her search. There was a laundry room off the kitchen. And a door. A locked door. She stared at it for a long moment, and then she placed her hand against the wood and knew, without a doubt, that Jason was on the other side.</p><p>Getting a chair from the kitchen, she sat down to wait.</p><p>Jason felt her presence in the house as soon as he awoke. He had been aware of her nearness all day, aware of the turmoil in her mind. He knew he could use his preternatural power to put her at ease, to make her forget the questions and suspicions that troubled her. But he could not do such a thing. She deserved the truth, ugly as it was, and he would give it to her.</p><p>Rising, he shrugged the quilt off his shoulders. His feet felt weighted with lead as he climbed the narrow stairway and unlocked the door.</p><p>She would know the truth the minute she saw his face.</p><p>Leanne's heart climbed into her throat as she watched the doorknob turn and the door swing open. \"Jason?\"</p><p>A faintly mocking grin touched his lips when his eyes met hers. \"Sorry to keep you waiting so long, my sweet.\"</p><p>\"You knew I was here?\"</p><p>\"Of course.\"</p><p>She glanced past him to the darkness beyond the open door. \"What's...what's down there?\"</p><p>\"Nothing.\"</p><p>\"Nothing?\"</p><p>\"You don't believe me?\" He reached behind him and flipped on a light switch. \"Perhaps you would care to see for yourself?\"</p><p>The thought of going down those stairs filled her with dread, but she had to know, had to see for herself.</p><p>Summoning every ounce of courage she possessed, she stepped past Jason and walked slowly down the stairs, wondering, as she did so, if she was making the biggest mistake of her life. What if he followed her? If he was truly a vampire, he wouldn't want anyone to know where he rested during the day.</p><p>She paused at the foot of the stairs and looked around, but there was nothing to see, only a patchwork quilt on the floor.</p><p>And a small mound of earth. She swallowed hard. Wasn't there some kind of vampire edict that made it mandatory for the undead to rest on the soil of their native homeland?</p><p>\"What were you doing down there so long?\" she asked when she returned to the laundry room.</p><p>\"Sleeping.\"</p><p>There was no emotion in his voice, no inflection of any kind; it was merely a simple statement of fact.</p><p>\"I thought...\"</p><p>\"You thought you'd find a coffin.\" He gave a slight shrug. \"I tried sleeping in one once but I found it...\" He paused a moment. \"Confining.\"</p><p>\"How long have you been...been a...?\"</p><p>\"Three hundred years.\"</p><p>It couldn't be true. She glanced around, thinking how bizarre it was to be having such an outlandish conversation in a laundry room. And even as she tried to tell herself she must be dreaming, she knew that everything she had feared was true. She knew it in her heart, saw the truth of it in his eyes.</p><p>For the first time, she noticed how pale he was. His skin was drawn tight over the planes of his face, there was a burning intensity in his eyes as he stared, unblinking, at her throat.</p><p>Unconsciously, she lifted a hand to her neck. \"How could you keep such a secret from me?\"</p><p>\"How could I tell you?\"</p><p>\"But...we made love...\" She stared at him, the horror of what she had done making her sick inside. She had made love to a man who was a...a monster.</p><p>The revulsion in her eyes sliced through him and he silently cursed Marguerite for turning him into a vampire, cursed the insatiable hunger that clawed at his vitals even now, urging him to drink from her one more time, to drink and drink until there was nothing left.</p><p>For a moment, Jason closed his eyes. Her nearness, her goodness, reached out to him. She shouldn't be here, not now, when the urge to feed pounded relentlessly through him. The remembered taste of her blood on his lips, warm and sweet, drew a groan from deep in his throat. She was close. Too close. Needing to put some distance between them, he went into the living room. Standing in front of the fireplace, Jason braced one arm on the mantle and stared at the ashes in the hearth. A blink of his eye brought the cold embers to life.</p><p>A sigh rose from deep within him. She knew what he was now, knew where he rested during the day, something no mortal save Jolene had ever known before. With that knowledge, Leanne held the power to destroy him...but it didn't matter. Losing her would destroy him as surely as the touch of the sun.</p><p>She followed him into the living room, as he had known she would, though she stayed on the far side of the room. Foolish girl, he thought, didn't she realize the danger she was in? He could be at her side between one heartbeat and the next, bury his fangs in her throat before she realized he had moved.</p><p>Leanne rubbed her fingertips over the two small wounds in her neck. \"You did this, didn't you?\"</p><p>\"Yes.\"</p><p>A look of horror filled her eyes. \"Am I going to...?\"</p><p>\"No!\" He shoved his hands into his pants pockets, his fists clenching and unclenching as he fought to control the thirst raging through him. \"I may be a fiend of the worst kind, but I would never condemn you to a life of darkness.\"</p><p>She touched the wounds in her neck again. \"Then why?\"</p><p>\"Last night was to be our last night together.\" His gaze met hers, begging for her understanding, her forgiveness. \"I wanted to taste your sweetness just once.\"</p><p>Leanne stared up at him, the thought of never seeing him again suddenly more frightening than the realization that he was, indeed, a vampire.</p><p>\"Our last night?\" she repeated tremulously.</p><p>\"Yes.\"</p><p>His gaze lingered on the pulse throbbing in the hollow of her throat for a moment before returning to her face. \"You'd better go now.\"</p><p>Wordlessly, she continued to stare at him, her eyes filled with anguish and denial.</p><p>With preternatural speed, he crossed the floor until he was standing in front of her, his eyes blazing with an unholy light.</p><p>\"Go home, Leanne,\" he said, his voice harsh and uneven as he fought to control the rapacious hunger burning through him. \"You're not safe here.\"</p><p>\"Jason...\"</p><p>A low growl rose in his throat as he bared his fangs. \"Go home,\" he said again, his voice filled with pain and barely suppressed fury.</p><p>With a strangled cry, she turned and ran out of the house.</p><p>And out of his life. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jason slouched in his favorite chair in front of the fireplace in the den, staring, unseeing, at the flames. In his mind's eye, he saw the horror in Leanne's eyes when she thought he might have bequeathed her the Dark Gift and turned her into a loathsome creature such as himself. The sound of her footsteps running out of the house, running away from what he was, echoed like a death knell in his ears.</p><p>He stared at his hands. He had not eaten for several days; his skin looked like old parchment. He knew his eyes glowed with hell's own fury, knew that soon he would either have to go to ground and lose himself in sleep, or satisfy the awful craving that was eating him up inside.</p><p>An unquenchable thirst for blood.</p><p>A deep and never-ending hunger for Leanne.</p> <p>Had it been only two weeks since he held her in his arms, tasted her sweetness, heard the sound of her laughter? Only two weeks? It seemed a lifetime.</p><p>A lifetime, Jason mused with a bitter smile. He had walked the earth for three hundred years and never had the hours and the minutes passed so slowly.</p><p>During the long lonely hours of the night, as he prowled the alleys and dark streets of the city, he seemed to hear the wind taunting him with the sound of her name. Sometimes he paused outside a house, listening to the sounds of life inside: children crying, laughing. He watched people eating, talking, arguing, sleeping. And he thought of Leanne, always Leanne, of how wonderful it would be to be mortal again, to share her life, to sit across the breakfast table from her in the morning, to make love to her in the light of a new day, to father a child.</p><p>He haunted the shadows outside the Ahmanson, torturing himself with glimpses of her face. He read the lingering sadness in her eyes, and he was filled with bitter regret because he knew he was the cause of her sorrow. She didn't smile any more, and the world was the poorer because of it.</p><p>One night, driven by an uncontrollable need to hear her voice, he slipped through the crowd, past the ticket-takers, and made his way to the balcony. There were no empty seats, but it didn't matter. He stood against the wall, a part of the darkness, shielding his presence from the ushers.</p> <p>Oblivious to everything else, he had eyes only for Leanne. Silent tears tracked his cheeks as he listened to her sing. Her voice, while still hauntingly beautiful, lacked the enthusiasm, the joie de vive, that had once set her apart from the others in the chorus.</p><p>Leaving the theater that night, he had told himself she would soon forget him. She was young, so young, and they had spent such a short time together. Soon, she would find someone else...</p><p>Now, staring into the fire's dying embers, he gripped the arms of the chair, his nails gouging deep furrows in the wood as he visualized her in the arms of another man.</p><p>Rising, he went into the bedroom. Sitting on the edge of the mattress, he picked up the pillow she had slept on. Closing his eyes, he took a deep breath, letting her scent engulf him. In his mind, he saw her as she had been the night they made love, her beautiful body lightly sheened with perspiration, her incredible green eyes glowing and alive. He felt again the touch of her hands as she undressed him, recalled the way her fingers had trembled as she caressed him, bold yet innocent. He relived every moment, every touch, embracing the pain of remembering, the shattering sense of loss now that she was gone.</p><p>Into his mind came the last soulful cry of the Phantom as he stood alone in his underground lair, bidding a final farewell to the only woman he would ever love.</p><p>The urge to kill, to destroy, welled within Jason, growing until he could think of nothing else. Overcome with rage, he stalked out of the bedroom, his hands clenching and unclenching at his sides. With a strangled cry, he grabbed the fireplace poker, holding it so tightly it bent in his grasp as though it were made of straw.</p> <p>With an oath, he flung it against the wall, then stormed out of the house, the lust for blood, the need to hurt someone as he was hurting, driving him beyond all reason.</p><p>He found his prey in a dark alley. The vagrant struggled in vain, his red-rimmed eyes growing wide as he stared into the remorseless face of death. With a low growl, Jason lowered his head to the man's throat. He inhaled the malodorous stench of the drunk's unwashed body, felt the violent tremors that wracked the man as he realized he was about to die.</p><p>Unbidden, an image of Leanne rose in Jason's mind and he saw himself as she would see him, his eyes glittering with the insatiable lust for blood, his lips drawn back to expose his fangs as he prepared to drain this hapless creature of its life.</p><p>Filled with self-loathing, Jason shoved the man away and disappeared into the shadows of the night.</p><p>\"Do you want to talk about it?\"</p><p>Leanne glanced up, meeting Jennifer's face in the mirror. As always, Jennifer looked as if she had just stepped out of the pages of a fashion magazine. Her make-up was flawless. Her long, honey-blond hair framed her face like a golden halo. Unlike the rest of the cast, who usually arrived at the theater in jeans and a tee shirt, Jennifer invariably looked as if she were about to go to a Hollywood premiere. Look like a star, be a star, she always said.</p><p>Leanne forced a smile. \"Talk about what?\"</p><p>\"Whatever's been bothering you for the last two weeks.\"</p> <p>\"I don't know what you mean,\" Leanne said, and burst into tears.</p><p>Jennifer sat down on the stool beside Leanne and patted her shoulder.</p><p>\"It has to be man trouble,\" Jennifer murmured with the air of one who spoke from experience.</p><p>\"Oh, Jen, you don't know the half of it.\"</p><p>\"I've got time to listen.\"</p><p>Leanne plucked a tissue from the box on the dressing table and dabbed at her eyes. If only she could tell someone, she thought sadly, if only she could pour it all out, all the heartache, the hurt, the horror. If only...</p><p>\"There's nothing to tell, Jen. I met a...a man, and I thought...it doesn't matter what I thought. It's over.\"</p><p>\"But you don't want it to be over?\"</p><p>\"No.\"</p><p>\"Maybe he'll change his mind.\"</p><p>A rueful smile tugged at Leanne's lips. It wasn't Jason's mind that was keeping them apart. \"Maybe.\"</p><p>\"Come on,\" Jennifer said, gaining her feet. \"Let's go get a cup of coffee.\"</p><p>It was unusually crowded backstage as she followed Jen toward the exit. Some of the cast members were giving friends and family a behind-the-scenes tour, showing them the props: the huge painted elephant that was part of the first act, the boat which ferried Christine and the Phantom across the underground lake, the numerous candelabra that came up through openings in the stage floor to light the Phantom's lair, the enormous winding staircase, and the trap door the Phantom used during the Masquerade number. Later, they'd see Twin's Gym, where members of the cast and crew sometimes worked out between shows.</p><p>Near the stage door, Leanne saw Michael Piontek, who played the Vicomte de Chagny, signing autographs, and Dale Kristen, who had played the part of Christine Daae for over four years, a role Leanne secretly yearned to make her own.</p><p>When they reached the street, she couldn't help glancing at the corner where she had first seen Jason. There was no one there now, and she experienced anew the pain of their separation, the awful sense of loss that had filled her heart since the night she ran out of his house like a frightened child.</p><p>She blinked back the tears that threatened to fall.</p><p>\"Where shall we go?\" Jennifer asked.</p><p>\"I'm really not up to it, Jen,\" Leanne said. \"I think I'll just go home.\"</p><p>\"Leanne...\"</p><p>\"Please, Jen. I need to be alone.\"</p><p>Jennifer gave Leanne's arm a squeeze. \"All right, honey, but you call me if it gets too bad, okay? Any time, day or night. Promise?\"</p><p>\"I promise. And thanks, Jen.\"</p><p>\"I'll see you Tuesday.\"</p><p>Leanne groaned softly. Tomorrow was Monday and the theater was dark. What would she do all day, all night, with not even a performance to help fill the empty hours?</p><p>Shoulders sagging, she crossed the street to her car. All the magic had gone out of the play, all the joy had gone out of her singing. Jason was gone from her life, and he had taken her heart and soul with him.</p><p>Sliding behind the wheel, she drove out of the parking lot and turned down Temple Street toward the freeway.</p><p>At home, she kicked off her shoes and sank down on the sofa. For a time, she stared at nothing and then, because the silence was too much for her, she switched on the TV.</p><p>It took a moment for the black and white images to register on her mind, and then she didn't know whether to laugh or cry, for there, clad in funereal black clothes and cape, was Bela Lugosi in his most famous role, that of Count Dracula.</p><p>The tears came then, burning her eyes, making her throat ache. She sobbed uncontrollably, wishing that she had never gone to Jason's house that day, wishing she could have gone on loving him in blissful ignorance.</p><p>For a moment, she considered going to Jason, begging him to do whatever was necessary to change her into what he was so they could be together, but she knew she lacked the courage to face the enormity, the horror, of such a vile transformation. She didn't want to live forever if it meant never seeing the sun again, never jogging along the beach on a bright summer day, never experiencing the joy and wonder of motherhood. And what about matinees? How could she play a matinee if she was a vampire?</p><p>How could she live without Jason?</p><p>Tears washed down her cheeks as she watched the movie, but it wasn't Bela Lugosi she saw walking down the long stone stairway, a flickering candle in his hand. It was Jason; Jason enveloping Mina in his cloak. How many people had he killed in the last three hundred years? In the last two weeks? Or perhaps he no longer had to kill. She remembered watching Love at First Bite and wondered if Jason visited the local blood bank to satisfy his thirst.</p><p>A burst of hysterical laughter bubbled to her lips. She must be going insane, she thought, comparing the reality of what Jason was to Hollywood's celluloid illusions.</p><p>Jason, Jason. Why couldn't she forget him? Why didn't she hate him? But she couldn't think of him as an evil monster, not when she remembered how tenderly he had made love to her.</p><p>Sniffing back her tears, she thought of all the hours they had spent together. Never had he done anything to hurt her, never had he treated her with anything but kindness and affection.</p><p>She lifted her hand to her neck. The tiny wounds had all but disappeared. She recalled asking him why he had bitten her, remembered the sadness in his eyes when he told her that their night together was to have been the last. She knew now he had planned to leave her because he was afraid for her, afraid of what he might do.</p><p>I wanted to taste your sweetness just once.</p><p>Burying her face in her hands, she sobbed, \"Jason, help me. I can't go on like this. Please help me.\"</p><p>He paused in his headlong flight to nowhere as Leanne's soulful cry echoed in his ears. He felt her pain as if it were his own, felt her unhappiness, her anguish of spirit.</p><p>Closing his eyes, he pressed his forehead against the cool stone wall that ran along the alley.</p><p>Ah, Leanne, beloved, he thought, if it gives you any solace, be assured that your pain is no greater than mine.</p><p>Leanne. The need to see her burned strong and bright within him and before he quite realized what he was doing, he found himself at her door.</p><p>He hesitated for the space of a heartbeat, and then he placed his hand on the latch. It was locked, but nothing as insignificant as a locked door could keep him from his heart's desire.</p><p>A wave of his hand and the door swung open. Quiet as a shadow, he entered the apartment and closed the door behind him.</p><p>She was in the front room. Her life force guided him as surely as a beacon.</p><p>On silent feet, he followed her scent.</p><p>She was curled up in the corner of a high-backed sofa, her head pillowed on her arms, her cheeks wet with tears.</p><p>He watched her for a long moment, and then, unable to help himself, he crossed the room and knelt on the floor in front of her.</p><p>\"Leanne.\"</p><p>Her eyelids fluttered open and his breath caught in his throat as he waited - waited to see the horror and the loathing reflected in her eyes when she saw his face.</p><p>\"Jason?\" She reached out to him, her hand trembling. \"Tell me you're really here, that I'm not dreaming.\"</p><p>\"I'm here if you want me to be.\"</p><p>\"I do. Oh, I do!\"</p><p>Sitting up, she threw her arms around his neck and held him tight.</p><p>With a strangled sob, he drew her down into his arms and buried his face in her hair.</p><p>For a long while, they simply sat there holding each other close.</p><p>Leanne felt the sting of tears behind her eyes. He was here, really here. It didn't matter how or why or for how long, only that he was there, holding her as if he would never let her go.</p><p>\"I've missed you.\" She whispered the words, afraid to break the spell between them.</p><p>\"No more than I've missed you.\"</p><p>\"Truly?\"</p><p>\"Truly.\" He drew back so he could see her face. \"I've felt your sadness these past two weeks. I know how unhappy you've been.\" He brushed her cheek with his knuckles. \"I can help you, if you'll let me.\"</p><p>\"What do you mean?\"</p><p>He took a deep breath. \"I can make you forget we ever met.\"</p><p>Her eyes grew wide, and then narrowed. \"You mean hypnotize me?\"</p><p>He nodded. \"I've done it before.\"</p><p>\"When?\"</p><p>\"Do you remember the night those men attacked you in the parking lot?\"</p><p>\"Of course.\"</p><p>\"Do you remember the dream you had after that?\"</p><p>She nodded. How could she ever forget?</p><p>\"It wasn't a dream. The man with the gun, he shot me three times.\"</p><p>Leanne shook her head. \"That's impossible.\"</p><p>\"You saw it all. If I hadn't erased the memory from your mind, you would have started asking questions I couldn't answer.\" A faint smile curved his lips. \"I can show you the bullet holes in my coat if you don't believe me.\"</p><p>She didn't want to believe him, but she knew somehow that it was true. No wonder she'd had that nightmare.</p><p>\"Do you want me to erase your memories of us?\"</p><p>He would do it if she asked, he thought bleakly, though destroying her memories of their time together would be like destroying a part of himself. And yet, he would do anything she asked of him, anything that would wipe the soul-deep sadness from her eyes.</p><p>Slowly, Leanne shook her head. \"No, I don't want to forget a single moment. I want...I want us to go on as before.\"</p><p>\"Leanne, you don't know what you're saying.\"</p><p>\"Yes, I do.\"</p><p>Jason shook his head. \"No, beloved.\"</p><p>\"You don't want me?\"</p><p>\"You know that's not true.\"</p><p>\"Then why?\"</p><p>\"Leanne, you think you know what I am, but you don't. There's nothing romantic about being a vampire. It's a life against nature, a life against God. I could never forgive myself if I caused you harm.\"</p><p>\"You won't. I know you won't.\"</p><p>\"You don't know!\" Rising, he turned his back to her, his hands clenched at his sides. \"I never should have come here.\"</p><p>\"Why did you?\"</p><p>\"Because I needed to see you one more time. Because I heard you call me and I couldn't stay away.\"</p><p>Gaining her feet, she wrapped her arms around his waist and pressed her cheek against his back. \"I love you, Jason. I don't think I could bear it if you left me again.\"</p><p>Groaning softly, he turned to face her. \"Leanne, you don't know how hard it is for me to be this close to you and not make you mine. You don't know how many nights I've wanted to take you in my arms and drain you of every drop of life.\" His gaze seemed to probe the furthest reaches of her heart and soul. \"How will you feel about me if one night I can't control what I am? If I take you against your will and make you what I am?\"</p><p>His words gave her pause. He saw the doubt in her eyes, recognized the fear in the sudden sharp intake of her breath.</p><p>\"I never should have come here,\" he said again. \"I'm sorry.\"</p><p>\"Don't go, please. Stay the night with me. Just one more night.\"</p><p>\"Leanne...\"</p><p>\"Please?\"</p><p>He knew he should leave her, now, before it was too late, but when he opened his mouth to tell her he couldn't stay, the words wouldn't come. Instead, he bent his head and kissed her, kissed her with all the bittersweet longing that had tormented him for the past two weeks.</p><p>And when the kiss ended, she took him by the hand and led him into her bedroom.</p><p>He saw it all in a quick glance: the dresser and nightstand made of burnished oak, the large oval mirror that reflected her image, but not his, the double bed covered with a colorful cotton throw, the Broadway posters on the walls, the Phantom poster signed by the L.A. cast.</p><p>Leanne stood in the middle of the room, her heart pounding wildly in her breast as she waited for Jason to take her in his arms.</p><p>Instead, he pressed a kiss to her cheek, and when he looked at her, his eyes were filled with doubts. \"Are you sure?\"</p><p>She nodded, and then she reached under his shirt, letting her hand slide up and down the long line of his back. His skin was firm and cool beneath her fingertips.</p><p>With a suddenness that startled her, he swung her into his arms and covered her mouth with his, kissing her until she was breathless, weightless, until she wasn't aware of anything in all the world but the iron-hard arms that held her tight. His face blocked everything else from her vision, and she stared up into his eyes, eyes that burned with a bright blue flame.</p><p>\"Jason.\" She whispered his name, just his name, but it conveyed all the loneliness she had felt during their separation, her anguish at the thought of never seeing him again, the deep void his absence had left in her life.</p><p>\"I know,\" he said, his voice thick with unshed tears. \"I know.\"</p><p>Gently, he lowered her onto the bed, his hands moving over her face, lightly tracing the outline of her lips, her brows, the delicate curve of her cheek.</p><p>\"Leanne, beloved...\"</p><p>He bent to kiss her again and yet again, knowing he could never get enough of her, knowing that, if he existed for another three hundred years, he would never love like this again.</p><p>Leanne stroked his brow. It was so good to touch him again, to know that he still cared. Their separation had not been easy for him either, she thought. There was a dark, haunted look in his eyes that had not been there before, a pain so deep it made her want to weep.</p><p>\"Jason, please let us go on as before.\"</p><p>His expression mirrored his surprise. \"I told you why that won't work.\"</p><p>\"I don't care that you're a...a...it doesn't matter. I trust you.\"</p><p>\"You say you don't care,\" he remarked quietly, \"yet you cannot even say the word.\"</p><p>\"Vampire. Vampire! I don't care what you are, only say you won't leave me, that you'll be a part of my life again.\"</p><p>\"What kind of life can you have with me?\" he asked, his voice dripping with self-loathing. \"How long will you be content to be with a man, a monster, who can never share the daylight with you, who can come to you only at night, who feeds on the living? A man who can't always resist the urge to kill? A monster who can't always control his fiendish hunger, his rage?\"</p><p>\"I'll help you,\" she said fervently. \"I'll love you so completely you won't have to be angry anymore.\" She took a deep breath. \"And if you need to take someone's blood, you can take mine.\"</p><p>He stared into the depths of her eyes, bright green eyes filled with trust and hope, and for a timeless moment he let himself believe that such a life was possible.</p><p>Knowing it was wrong, knowing that to touch her now would only bring them both pain later, he kissed her.</p><p>Kissed her because he loved her so deeply.</p><p>Needed her so desperately.</p><p>He began to undress her then, his hands moving reverently over her as he reacquainted himself with the gentle contours of her body, the softness of her skin.</p><p>He closed his eyes, his joy so fierce it was almost agony as she rid him of his clothes. She explored his hard-muscled body freely, letting her hands glide over the width of his shoulders, down his hard flat belly, along the length of his thighs.</p><p>His response to her touch was instant, bringing a satisfied smile to her lips and a warm glow of pleasure to her eyes. He groaned softly as he drew her up against him, the lush curves of her body filling the emptiness in his.</p><p>His mouth covered hers again in a long hungry kiss, and he knew if he held her and kissed her until the end of time, it would not be long enough.</p><p>Trembling with the need to merge his flesh with hers, he rose over her, wondering what miracle had brought her into his life. Surely he had done nothing to deserve her love or her trust. He was a creature of the night, a man who had been cursed, but now felt blessed beyond belief.</p><p>Her arms wrapped around him as she lifted her hips in invitation, taking him deep within herself, cherishing him, loving him, until he wanted to weep with the wonder of it. She whispered that she adored him, and her words fell on his heart like sunshine, chasing the darkness from his soul, filling him with warmth and light, making him forget, for that moment, that he was more monster than man.</p><p>He held her tight as her body writhed beneath his, felt his self-control begin to slip as he watched the pulse that throbbed in her throat. A red mist veiled his eyes, reminding him that he wasn't a man, but a monster masquerading in human form, a fiend who had no right to love this woman or any other.</p><p>He gazed into the depths of her eyes, eyes so like Jolene's, and into his memory came an image of his wife, her beauty fading, her health deteriorating as time and disease ravaged her face and body while he stayed forever young. He could not endure the agony of watching Leanne grow old, he could not bear the thought that, after a few brief years, she would die and he would be alone again.</p><p>Neither could he bear the thought of being parted from her, and yet he knew that, if he stayed, it would be only a matter of time before he succumbed to the awful craving for her blood, a need that even now was raging through him, as hot and fierce as his desire for her flesh.</p><p>As surely as he knew that he must shun the sunlight or perish, he knew the day would come when he would force the Dark Gift on Leanne rather than watch her die. And he knew, just as surely, that she would forever hate him for it.</p><p>Painful as it would be, it would be better to leave her now, before he did something they would both regret, before her love turned to loathing.</p><p>He held her close, listening to the soft sound of her breathing as she fell asleep in his arms.</p><p>He had always feared dying, feared the prospect of an eternity writhing in the flames of hell, but he feared it no longer.</p><p>Hell was not a place awaiting his soul, he thought in despair.</p><p>Hell would be waiting for him when he kissed her goodbye.</p><p>He held her close until the last moment, until he felt the sunrise trembling on the brink of the horizon, felt the promised heat of it.</p><p>Leanne murmured sleepily as he drew the covers over her, then bent and kissed her one last time.</p><p>And still he lingered, imprinting her image on his mind so that he might carry it with him through all the endless days and nights of eternity.</p><p>Tomorrow night he would leave Los Angeles. It was the only way to keep from seeing her, the only way to keep her safe from the monster that dwelled within him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He had left her again. There was no note this time, no written words of farewell.</p><p>With grim certainty, Leanne knew he would never return.</p><p>With equal certainty, she knew she would not let him go.</p><p>It was Monday, and there were no performances scheduled. She straightened her apartment, wrote Jennifer a short letter which would account for her absence but explained nothing. Next, she penned a letter to her parents, telling them she loved them, saying she had met a man and they were on their way to Europe for an extended holiday.</p> <p>She took a long hot bubble bath, shaved her legs, washed her hair, and then she stood in front of the full-length mirror hung on the back of the bathroom door, studying her face and figure, knowing that, if her plans went as intended, she would never see her face in a mirror again. Wondering, in a distant part of her mind, how a woman applied eyeliner and mascara without the benefit of a looking glass.</p><p>In the kitchen, she filled a bowl with chocolate ice cream, added a banana, smothered both with hot fudge and whipped creme, and topped it off with a cherry. She ate it slowly, savoring every bite. Next, she drank a glass of cold milk, then dug out her hidden stash of See's candy and ate every last piece. Dark chocolate truffles, peppermint patties, Scotchmallows. Not everyone's idea of a last meal, she thought, but if she was never to have chocolate again, there was no point in being stingy about it now.</p><p>She brushed her teeth, carefully applied her lipstick and then, before her courage deserted her, she ran down the stairs to the garage, got into her car, and drove to Jason's house.</p><p>She lingered on the porch, watching the sun go down in a riotous blaze of pink and lavender, crimson and amber, imprinting the image on her mind.</p><p>And then, resolutely, she turned her back on the myriad colors splashed across the sky. Taking a deep breath, she took the big brass key from her pocket and opened the heavy front door.</p> <p>The inside of the house was as still as death.</p><p>Her footsteps made no sound as she made her way to the laundry room, but she was sure that the thudding of her heart could be heard as far away as Catalina.</p><p>As she had done once before, she sat down in front of the cellar door and waited for him to rise, wondering, as she did so, if there was some kind of vampire law that would prohibit them from sleeping together in a bed.</p><p>Her heart seemed to jump into her throat when the door swung open, and then she forgot everything else but her love for Jason, and her reason for being there.</p><p>So, he thought, he had not imagined her presence, after all.</p><p>\"Leanne,\" he said after a lengthy silence. \"Why are you here?\"</p> <p>\"You know why.\" She tilted her head back, baring her throat to his gaze. \"Do it, Jason, do it now.\"</p><p>\"No!\" He turned away from her, his hands knotted into fists.</p><p>He recoiled as if in pain when her hand caressed his back.</p><p>\"I love you, Jason. If you can't, or won't, try to live in my world, then I'll live in yours.\"</p><p>\"No. No. No!\" He whirled around, his eyes blazing. \"How can you even consider it?\"</p><p>\"Because I want to be with you!\" She placed her hands on his chest and gazed up at him, her eyes shining with love. \"I love you. I don't want to live without you.\"</p><p>He drew in a deep breath and exhaled it slowly, and then he took her hands in his.</p><p>\"Look at me, Leanne,\" he said quietly. \"Take a good look. Tell me what you see?\"</p> <p>\"I see the man I love, the man I've waited for my whole life.\"</p><p>\"No. I'm not a man, and I can't pretend to be one any longer, not even for you.\"</p><p>He saw the protest rise in her eyes, and he silenced her with a look. \"Face it, beloved. I'm a vampire, a monster.\"</p><p>\"No.\"</p><p>He lifted her hands to his mouth and kissed her palms, first one, then the other. \"Go home, Leanne.\"</p><p>\"I won't leave you, Jason. Nothing you can say will make me change my mind.\"</p><p>It was tempting, so tempting. He closed his eyes as he contemplated the ecstasy of bestowing the Dark Gift on her, of knowing that, as a creature of the night, she would be his forever. Never again would he be alone, his existence empty. She would bring him the sunlight he had not seen in three hundred years. He would know love and laughter, the taste of her kisses, the sound of her voice. They could travel the earth together. He could show her the wonders of the ancient world, take her to London, to Paris, to Rome. And perhaps, if he loved her enough, she would never miss the sunlight, never regret forfeiting the opportunity to bear children...</p><p>He held the image close, savoring it, even though he knew it would never happen, knew he could never condemn the woman he loved to such a wretched existence. He had cursed Marguerite every night since she had bestowed the Dark Gift upon him, cursed her for his lost mortality, for the life she had stolen from him. He would not selfishly bequeath the same horrible fate to the woman he loved.</p><p>Slowly, he opened his eyes, drinking in the sight of her face, knowing that, after this night, he would never see her again.</p><p>\"I love you, Jason.\" She spoke the words with the simple faith of a child, as if they could make everything all right.</p><p>\"And I love you,\" he replied fervently.</p><p>\"Then you'll stay with me forever?\"</p><p>Tenderly, he brushed his knuckles over her cheek. \"Only death will part us, beloved.\"</p><p>At his words, Leanne shivered violently, as if someone had filled her veins with ice water. She knew then what he meant to do, knew it as surely as she knew the sun would rise in the morning. \"No!\"</p><p>\"Yesterday, you asked me for one last night. Now I ask the same of you.\"</p><p>\"Jason, you can't mean to do it. I won't let you!\"</p><p>\"You cannot stop me.\"</p><p>\"I will not live without you!\" She pummeled his chest with her fists. \"Do you hear me, Jason Blackthorne, I will not live without you! If you kill yourself, you'll be killing me, too.\"</p><p>She looked up at him, her eyes awash with pain, though only a single tear trickled down her cheek.</p><p>He watched it for a moment, and then, compelled by an urge he could neither understand nor deny, he bent down and licked the tiny drop of moisture from her cheek.</p><p>For a moment, he gazed into her eyes, and then he reeled back, his whole body on fire.</p><p>\"Jason, what is it?\"</p><p>He couldn't answer; he could only stare at her, the warm salty taste of that single tear incinerating his tongue, burning through every fiber of his being like a shaft of liquid sunlight.</p><p>As from a great distance, he heard her voice sobbing his name, but he lacked the power to answer. He dropped to his hands and knees, his head hanging, his breath coming in ragged gasps.</p><p>\"Go.\" He forced the word between clenched teeth.</p><p>\"No, I won't leave you.\" She knelt beside him and placed her hand on his shoulder, only to jerk it away when the heat radiating from his flesh burned her palm. \"What is it? What's happening?\"</p><p>\"Go!\" With an effort, he raised his head and met her gaze. \"I'm dying.\"</p><p>\"No.\" She shook her head, her eyes filled with denial. \"That's impossible.\"</p><p>\"It's true.\" He groaned low in his throat as his body convulsed with agony. His blood was on fire, his skin seemed to be shrinking, melting. \"Leave me.\" He took a deep shuddering breath. \"Please, Leanne, if you love me, go from here.\"</p><p>She was sobbing now, her tears falling to the floor, splashing like liquid fire over his hands. It grieved her to see him in such pain, to know there was nothing she could do to help him.</p><p>\"Please,\" he implored her. \"I don't want you to see...\"</p><p>He collapsed on the floor, his body writhing in agony, folding in on itself until he lay in a fetal position, his whole body trembling uncontrollably.</p><p>Using the chair for support, she stood up. If he wanted her to go, she would go, but only as far as the other room.</p><p>\"I love you,\" she whispered as she backed toward the doorway. \"I'll always love you, Jason. For as long as I live. Jason...\"</p><p>But he was past hearing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Numb, Leanne stared down at him, unable to believe he was dead. A distant part of her mind, a morbid part she hadn't even known existed, wondered why his body hadn't aged and dissolved into dust, the way bodies of the undead always did in movies.</p><p>And then, with the force of a blow, reality struck home.</p><p>Jason was dead. Truly dead.</p><p>Slowly, she dropped to her knees beside him and cradled his head in her lap, the pain in her heart too deep for tears. Gently, she smoothed the long, dark hair from his brow. His skin felt warm and alive. Odd, she thought, when it had always felt cool before.</p> <p>The hours passed unnoticed as she relived every moment she had spent with Jason, remembering how she had found herself looking for him outside the theater long before he had introduced himself, remembering the instant attraction between them, the way she had known, that very first night, that she could trust him.</p><p>A faint smile touched her lips as she caressed his cheek. She would have liked to walk along a sandy beach in Maui with Jason at her side, watched the sun rise over the ocean, borne his children, grown old beside him.</p><p>She would have liked to make love to him one more time.</p><p>With a sigh, she kissed him, and then, very gently, she lowered his head to the floor and stood up.</p><p>Feeling empty and alone, she walked out of the house.</p> <p>She paused on the verandah, surprised to see that it was morning. She lingered there a moment, her gaze caught by the fiery splendor of the sun as it climbed over the tops of the hills, painting the vast sky canvas with broad slashes of orchid and crimson.</p><p>\"I love you, Jason Blackthorne,\" she murmured, her fingertips absently stroking the heart-shaped locket he had given her. \"I love you and I'll never forget you.\" Fresh tears welled in her eyes. \"Never.\"</p><p>\"Never is a very long time.\"</p><p>Leanne whirled around, her hand flying to her throat. \"Jason! You're alive!\"</p><p>He held out his arms, turned his hands this way and that, studying them as if he had never seen them before. \"So it would seem.\"</p><p>\"But...but how is it possible?\"</p> <p>\"I have no idea.\" A wry grin tugged at his lips. \"The love of a good woman, perhaps?\" With his finger, he captured a tear hovering in the corner of her eye and as he did so, Marguerite's words, spoken centuries ago, echoed in the back of his mind. Not in the blood, she had said.</p><p>Jason stared at Leanne's tear. Not in the blood. \"Perhaps it was the magic of a single tear shed for a monster who yearned to be a man.\"</p><p>They gazed at each other for stretched seconds, and then Leanne threw herself into his arms and hugged him tight.</p><p>\"You're alive.\" She rained kisses over his cheeks, his brow, then pressed one hand over his chest, above his heart. \"Alive,\" she whispered. \"Thank God.\"</p><p>Jason looked deep into her eyes, and then he smiled, a beautiful smile that went straight to her heart.</p><p>Lowering his head, he teased her lips with the tip of his tongue, and then he kissed her as gently as ever a man had kissed a woman, and it seemed he could taste the sunrise on her lips.</p><p>\"Leanne,\" he murmured. \"Do you think you could love this mortal man as much as you once loved the monster?\"</p><p>\"Oh, yes,\" she exclaimed softly, and the glow in her eyes was warmer and brighter than the sun he had thought never to see again.</p> <p>His smile grew wider. \"If I carried you to bed, do you think you could make love to me in the light of day?\"</p><p>Happiness bubbled up inside of her. \"I think so,\" she replied, her voice trembling with love and joy and excitement.</p><p>\"And will you spend the rest of your life with me? Bear my children if a merciful God permits?\" He took her hands in his. \"Grow old at my side?\"</p><p>\"Yes,\" she promised fervently. \"Oh yes.\"</p><p>Jason sighed as he wrapped his arm around Leanne's shoulders and drew her close to his side. Together, they watched the sun rise above the distant mountains, heralding the birth of a new day, a new beginning.</p><p>It was a day of miracles, he thought, and Leanne's love was the greatest miracle of all.</p><p>She had been the sun in his sky since the first night he had seen her emerge from the theater.</p><p>Standing beside her now, with the sun shining on his face and the warmth of her love glowing in the depths of her eyes, he knew he would never dwell in darkness again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Five years later</p><p>Jason leaned forward as his daughter made her entrance on stage. Facing the audience, Kristi Lynn began to sing, her voice pure and clear.</p><p>His daughter. Another miracle that Leanne had wrought in his life. And soon they would have a second child. And after that, a dozen more, if God - and his wife - were willing.</p><p>\"She's wonderful, isn't she?\" Leanne whispered.</p> <p>\"Indeed,\" he said. \"She has her mother's talent.\"</p><p>Leanne grinned at him. \"And her father's charm.\"</p><p>Jason took her hand in his and gave it a squeeze. The last five years had been the happiest he had ever known. He had stood beside Leanne and watched the sun rise over the Grand Canyon, sat beside her on a sandy white beach in Hawaii and watched the waves lap at the shore. He grinned at the memory. He had sat there so long he'd gotten one hell of a sunburn. But even that had felt good.</p><p>He had watched Leanne's body swell with new life, stood at her bedside the morning Kristi Lynn had been born, felt his heart swell with awe when the doctor had placed his daughter in his arms. He had been there when Kristi took her first wobbly steps, uttered her first word, run alongside her the day she had learned to ride a bike.</p><p>He had turned to writing again, surprised and pleased when he sold his first book in years, a novel about a vampire who yearned to be a man again. He had written three other books since then, each of which had received rave reviews. His favorite quote hung on the wall behind his desk. Jason Blackthorne's vampires are so realistic, so vividly drawn, one would think he wrote from personal experience.</p> <p>Jason stood, applauding loudly when Kristi Lynn finished her solo. When the recital was over, they went out for hot fudge sundaes to celebrate.</p><p>Later that night, standing beside Kristi's bed while Leanne tucked her in, he thanked a generous and forgiving God for granting him a second chance at life.</p><p>The End </p> </body></html>"]