["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Jax</p><p>It was always the same question: Who do you think you are? Why the hell did people always ask me that? Was it my appearance that immediately put people on the defensive? I was a nice guy deep down. I kept to myself for the most part – until someone pissed me off – but I really tried to stay out of other people’s business. I just didn’t really like people, if I was honest, so when that annoying question got thrown in my face, well, yeah it irritated the shit out of me.</p><p>I was used to it from older folks or perhaps a stranger I would accidentally bump into. They’d take one look at me and assume I was some punk trying to be an ass. But most of the time, I was just being me. Sure, I could be an ass – trust me on that one – but on a normal day, no. Couldn’t people just say “excuse me” – or how about nothing at all? Why always that stupid question?</p> <p>I wasn’t expecting it from her, though. Yeah, I’d seen her around; she and her snobby sorority girlfriends hung out at the Starbucks across from the university campus. I probably should have found another place to unwind, but I just didn’t want to. This particular Starbucks was close to my house and the Wi-Fi was always fast. Most of the people in here didn’t bother me, but today was the first time she’d spoken to me.</p><p>“Geez! Who do you think you are? Watch it!” she said as I turned around after grabbing my drink from the barista.</p><p>I honestly had not seen her at all. I just wanted to get back to my laptop and the game I was playing. I had two hours before I had to get to work and wanted some downtime.</p><p>I grumbled an apology and suppressed an eye roll before scooting around her, trying not to spill more coffee. I think some had gotten on her more-than-likely expensive shirt.</p><p>Good.</p> <p>I heard her huff behind me as she carried her chai tea back to her girlfriends. I could feel their glares on me. Screw them, I wasn’t gonna give them the satisfaction of looking in their direction. I sipped my black coffee and went back to my computer game. It was much more interesting than those little college girls anyway.</p><p>I mostly tuned them out, but after about fifteen minutes of obnoxious giggles and snorts, I finally looked up. She and two of her friends were looking right at me. I locked eyes with her for about five seconds until she finally looked away. I found myself staring at the side of her face. The sun from the window behind her gave her blonde hair a glow. I bit back a smile at the small amount of satisfaction I’d received from winning our stare-down contest. Her other two friends, another blonde, and a pretty black girl, were still giggling, and, I’m sure, talking about me. Whatev... I didn’t have the energy for childish girls. I cursed myself for forgetting my iPod so I wouldn’t have to listen to their shit. I shook my head and went back to my game.</p><p>My laptop popped up a message that my battery was getting low. I checked my phone and saw I had another hour before I had to be at work. I decided to go back to my house and pack up some food before heading to the mechanic’s shop where I worked. I snapped the laptop closed and picked up my backpack.</p><p>I walked past the girls, not giving them the satisfaction of a glance, when I heard, “Bye, Lucky,” followed by giggles.</p><p>Lucky? Ah... yeah, that’s not the first time I’d been called that. The huge shamrock tattooed on my left forearm had “Lucky” inked into the center of it.</p><p>Lucky I’m leaving, I thought. I went out to my motorcycle, shoved the laptop into my backpack, and fished my keys from my pocket. I slid the helmet on and rumbled down the street.</p> <p>As I put the key in the lock to my front door, I grew irritated at myself for even thinking about her. Yeah, she was pretty, but she knew it. I didn’t even know her name... and you know what? I didn’t want to know it. It was better that way. Easier. Then I wouldn’t have to think about her when I wasn’t at the coffee shop.</p><p>I plugged my laptop in at the kitchen counter and went into my bedroom to find my iPod. Now, where had I seen it last? That’s right, fell asleep listening to it. Sure enough, it was lying on the empty pillow next to mine. A smile found my face as I snatched it up and shoved it into my pocket. The last person to be lying on that pillow where the iPod had just been was a pretty brunette with a few tattoos of her own.</p><p>I’d picked her up in a bar last weekend. She had been eyeing me across the room, sipping on a beer as she shot pool. Or attempted to shoot pool, I should say. She totally sucked at it, but I could tell she was having fun bending over the pool table, sticking her ass in the air like a cat in heat.</p><p>She put out the bait, and like a dog, I took it.</p><p>We’d both had a few beers so I probably shouldn’t have driven my bike but I was okay – really – but she wasn’t. She was easy to get back to my house and her clothes came off even easier.</p><p>“Call me,” she’d called out as I dropped her at her apartment the next morning.</p><p>Yeah, sure.</p><p>Buttoning up my uniform shirt for the Volvo dealership where I worked, I smiled again thinking about that brunette (what was her name?), but then I thought about the pretty blonde at the coffee shop. Now she was trouble. I knew I’d better think of something else – fast.</p> <p>Chapter Two</p><p>Mina</p><p>His dark eyes were fixed center and I knew he was struggling not to glance at us. We’d been teasing him ever since he’d knocked into me at the barista. With a mushroom-shaped coffee stain on my shirt, I sat at the table with my friends and glared across the coffee shop at him.</p><p>“You should send the jerk the cleaning bill,” Mandy sniffed, passing me a napkin.</p><p>I patted the front of my shirt with it, watching the guy take his seat a few tables away from ours. He flipped open his laptop. The light from the screen lit up his strong-looking face. He looked to have at least two days’ worth of stubble shadowing the lower half of his face and a neatly trimmed goatee beard covered his chin.</p><p>“I’m surprised someone like him even knows what a Frappuccino is,” Evelyn said, sipping her own through a straw and watching him from beneath her long blonde fringe.</p><p>“He looks like he’d be more at home in the freaking ape house,” Mandy chimed in.</p><p>Hearing this, Evelyn sprayed laughter, sounding like something close to a donkey. I saw the guy flinch. He knew we were making fun of him. I liked the idea he was feeling uncomfortable. It made me tingle somehow – like a faint current of excitement passing through me. The coffee incident had been no accident. He hadn’t knocked into me, I had knocked into him. I had positioned myself in such a way as I stood at the barista that he would’ve had no choice other than to collide with me as he turned towards his table. But my girlfriends didn’t know that, and neither did he. Why had I done it? Because I could. Because I wanted to. Because I wanted to get a picture of him. He had seen me around and I’d seen him. He had a swagger that brimmed with arrogance, and I liked that. Not because it turned me on – but because I knew it to be a shield – a cloak of armor that was begging to be torn from him. I’d seen him saunter across campus, his finely sculpted arse clad in faded denims, tattooed forearms swinging loosely by his sides. He had enjoyed women looking at him, and he enjoyed it now. But I was interested in him for another reason. Casually, I slipped my iPhone from my pocket and switched it to video.</p><p>Evelyn made another comment, which I didn’t quite catch, but whatever it had been, it caused Mandy to spray laughter again. This time, he snapped his head around and met my stare. I stared back across the coffee shop at him, my cool blue eyes burning into his dark brown spheres. His stare was so intense I had to fight the urge to look away, but not just yet. Not until I had discreetly positioned my iPhone so I could get a clear recording of him.</p><p>When I was happy that I had him squarely in frame, I looked away, as if unbothered by him. The sun that poured through the window felt warm against the side of my face. I could feel his eyes burning into me for a few seconds more, and I kept the iPhone still in my hand, as I rested it against the table and secretly filmed him.</p><p>Mandy and Evelyn were still giggling like a couple of teenagers as the guy pushed his chair back from the table and stood up. I glanced sideways and watched as he snatched up his backpack and headed towards the door. To reach it, he had to pass by our table, and I slowly turned my wrist, training my iPhone on him as he came towards us. I glanced down at the small screen and my stomach tightened. This was the best footage I had of him yet. The other clips of video I had managed to gather had always been filmed from some way off and they had been blurry, at best. But this was wonderful. He was perfectly clear and in shot as he came towards us, then passed by.</p><p>“Bye, Lucky,” Evelyn giggled, and for the first time I noticed a huge shamrock tattooed on his left forearm. In it, the word Lucky had been written.</p><p>With a mean-looking scowl etched across his brow, he pulled open the glass door and stepped out into the sunlight. I switched off the camera on my iPhone and slipped it into my pocket.</p><p>Lucky, I smiled to myself. He had no idea.</p><p>Chapter Three</p><p>Jax</p><p>Work totally sucked. I had an SUV with transmission problems and I had to practically take apart the whole damn engine and put it back together. I put the ‘G’ in “grease monkey” today.</p><p>After a five hour shift that turned into eight, I washed my hands, grabbed my backpack, and headed to my house for a much-needed shower. Thankfully I lived fairly close to the dealership and I was home in a matter of minutes.</p><p>I opened the front door and noticed all the lights were on. My roommate, Austin, was sitting at the dining room table, studying. He was a computer science major and we were polar opposites. I was messy, tattooed, drove a motorcycle, and had a couple of secret piercings nobody knew about, while Austin was a clean-cut guy who drove a Honda and came from a nice family.</p><p>He looked up with green eyes, and I could tell his light auburn hair had just been freshly cut. “Hey, Jax. Long day?”</p><p>I nodded, tossing my backpack on the armchair. “Yeah. I had to stay late at work. What’s new, man?”</p><p>Austin shook his head. “Nothing. I have a huge test on Monday.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That blows. You eat yet?” I asked.</p><p>He again shook his head. “Nah.”</p><p>“Order a pizza. I need to hit the shower. Bad.” I secretly smelled under each arm when he wasn’t looking. Damn.</p> <p>Austin laughed and said, “Okay.” His eyes moved to the screen as he found the Domino’s website.</p><p>The shower felt fantastic. I could literally see the dirt and grime circling the drain as I soaped up every part of my body. I dried off, wrapping the white towel around my waist. I set about shaving the stubble off my face but left the goatee. I squirted some goop into my hands and tousled it into my thick, brown hair. Man, I needed a haircut – bad.</p><p>I braced both hands on the sink and leaned in towards the mirror. My brown eyes stood staring back at me in the reflection, and the image of the blonde in the coffee shop popped into my mind again. She was hot, but there was something about her I couldn’t put my finger on.</p><p>I had seen her on campus a few times, and even though her two friends were kinda hot, too, she was the one who always got my attention. Typical college girl, always had her phone in her hand. I used share a class with her – American History, I think – and I could swear one time I caught her snapping a picture of me with it. She had the camera up level, as one does when taking a photo, but she was probably just checking her makeup in its reflection. Yeah... it was probably just my ego wishing she wanted to take my picture. After all, if she wanted a picture of me, all she had to do was ask.</p><p>But of course, I’d ask for one in return. A devilish smile reflected back at me. I left the bathroom to find some clothes.</p> <p>I heard the doorbell chime just as I finished getting dressed. Plain jeans and a red and gold Florida State Seminoles tee – school colors – was all I was going to be wearing tonight.</p><p>Austin was just paying the Domino’s delivery guy as I walked out to the living room. I fished a ten dollar bill from my wallet and put it on his laptop.</p><p>I made my way to the kitchen and plucked some paper plates from the pantry and two Cokes from the fridge, setting it all on the dining room table. We both dug into the pizza.</p><p>I was on my third slice when my phone buzzed with an incoming text.</p><p>We’re going to Rowdy’s tonight – be there @ 10 p.m.</p><p>Trent, always the partier. My kneejerk reaction was to stay in tonight, tell my good buddy Trent that I was dog-tired, but it was Friday and I knew I’d never hear the end of it from him.</p> <p>I looked up from the phone. “Hey, Austin. Want to go to Rowdy’s with us tonight?”</p><p>Austin’s pencil froze in mid-scrawl. He looked up and smiled. “That sounds great, but no. I have a huge project due Monday. But thanks.”</p><p>“You sure, man? Hot cowgirls, drunk chicks, dudes in big-ass ten gallon hats we can make fun of... last chance, bro,” I said with a salacious grin.</p><p>He smiled and shook his head, then went back to what he was doing on his laptop.</p><p>On the way to my room to change into more appropriate club wear, I texted Trent back to tell him I’d be there. Shit, I’m gonna need some serious Red Bull to get me through the rest of the night.</p><p>I rolled my truck into the parking lot of Rowdy’s. I was going to take my bike, but the sky had clouded over and looked brooding, so I fired up my old ’75 Ford F150 instead.</p><p>Because of the impending rain, I knew no girl would get on my motorcycle if it was pouring. I did have an extra helmet, but still. They were usually apprehensive in the rain no matter how adventurous or drunk they were, and I wasn’t taking any chances. I was going home with someone tonight, period.</p><p>My dad had helped me restore the old beast right after I graduated high school. The thing was a wreck – rusted from the salty Florida air and had a completely useless engine. We replaced just about everything on it, right down to the door handles, then put Flow Masters on it just to make it sound extra badass. It was jacked up tall, painted candy-apple red, and the chicks dug it. It was hands-down the best memory I had of my dad. He was a genius with any type of automobile, even the newer ones with the “damned computerized engines” he complained about all the time. Still, cars were his hobby, too, and he taught me well.</p> <p>I looked at the interior of the truck and smiled, remembering how my father had helped me pick out all of these things. The radio. The seats. The floor mats. The steering wheel. The visors. The entire dash. My smile fell as I realized how much I missed him. It’s not that he was dead ... he was missing. Disappeared one day over a year ago – never came home from work. He had been distraught since my mom died of cancer three years ago, but he would never leave me like that. The police were looking into his disappearance, and I had done some digging of my own, but all my leads were dead ends. One day he was at work, and the next day he just wasn’t. Disappeared into thin air, it seemed. I missed him every day and prayed he would be found.</p><p>Dammit. I punched the steering wheel in frustration. “Get a grip,” I mumbled to myself. I shook free the memory and got out of the truck. I needed a beer. STAT.</p><p>The club was a huge converted warehouse with a large red and blue lighted sign that sat on the top and simply read: “Rowdy’s.” A cowboy boot complete with spur sat under the name and it flashed on and off. I wasn’t a huge country music fan but I had been known to listen to country rock like Blackberry Smoke and Kid Rock. I quickly located Trent and made my way over to him.</p><p>Chapter Four</p><p>Mina</p><p>I left Evelyn and Mandy to their coffee and cleared out of Starbucks. It didn’t seem to matter where you went in the world, the coffee bars were all the same. My personal favorite was the one on St. Pancras Railway Station, London. It seemed like another world away now. I had spent many hours sitting at that station, just beneath the ‘kissing’ statue, watching the world go by. I liked people watching. I liked to secretly film those people. It was amazing what I could see. I would try and figure out where these strangers were going or where they’d come from. Some were rushing to work, some late for an appointment, others were lovers who were secretly meeting. I watched them all. I filmed them, took their photos on my iPhone. I would study those pictures later. Some I would download and keep. Others didn’t interest me so they would be deleted. I had thousands of pictures of people – strangers.</p><p>Thinking of London made me feel homesick. Not that I missed anyone back there, but I missed the place – the vibe – that I had only ever felt back home. Christ, I even missed the wind and the rain and the constant grey skies. Orlando was like another world and one that, at first, felt strange to me. The first year had been difficult and I felt out of place. Not because the people were unfriendly – they were the complete opposite. I had found all of them to be warm and welcoming. I felt uncomfortable because I believed I had been banished here – sent to Orlando as a punishment. I’d had little choice in the matter.</p><p>I had gotten myself into trouble back home – the sort of trouble that most seventeen-year-old girls would want to run away from. I didn’t want to run away – I hadn’t done anything wrong. If only my mother had seen it that way. Perhaps then she wouldn’t have been so keen to send me packing to Florida to live with her brother.</p><p>As I had stood and cried at the airport, hoping that her anger might suddenly subside, she told me to grow up.</p><p>“For goodness sake, Willamina,” she had barked.</p><p>I’d hated it when mum called me that. I preferred Mina.</p><p>“I don’t want to go,” I’d sniffed back my tears.</p><p>“Consider yourself lucky I’m even speaking to you. What you did was unforgivable,” she said, trying to keep her voice low so as not to draw any unwanted attention from the other passengers. “Most girls your age would be grateful to be going to live in Florida. It will be like paradise – not that you deserve such a thing.”</p><p>“We did the whole Mickey Mouse thing when I was six – just before dad...” I started, but couldn’t finish. I knew if my dad were still alive, he wouldn’t be sending me away. Because that’s what she was doing. She was ashamed of me. She was ashamed of what I had done.</p><p>“I’m not talking about bloody Disneyworld!” my mother hissed, her face turning white with anger. “You’re going there to study. To start a new life!”</p><p>“But what about my friends...?” I sniffed.</p><p>“You haven’t got any friends,” she remarked, as if swallowing something foul.</p><p>“Please don’t make me go, mum, I don’t know anyone...” I tried to plead with her.</p><p>“Pull yourself together,” she snapped under her breath, looking sideways at a group of passengers who were now watching us. “You’re embarrassing me – and yourself for that matter.”</p><p>“Please...” I said, tears spilling onto my cheeks.</p><p>Then with a sigh of relief, she pointed up at the departure board and said, “Your flight is boarding.”</p><p>There was a long, uncomfortable silence as we looked at each other. If she was going to change her mind, it would be now.</p><p>“Well don’t just stand there,” she said. “Get going or the plane will leave without you.”</p><p>Knowing she wouldn’t be turned, I stepped slowly forward and kissed her gently on the cheek. “I’m sorry, mum,” I whispered in her ear. Then turning away, I headed for the departures lounge. With every step, I hoped she might call me back. She didn’t. Reaching the door of the lounge, a steward took my ticket from me. I glanced back over my shoulder. My mum had already gone.</p><p>Uncle Rob was waiting for me at Orlando airport. He was a stranger to me. The last time I’d set eyes on him was at my dad’s funeral more than ten years before. He looked like my mum. As he led me out of the airport, the heat hit me like a punch to the face and I knew I was here to stay. That was almost two years ago now. I was no longer the immature seventeen-year-old who had cried in front of her mum. I had grown up – become a woman. I had changed, although some of my bad habits had stayed the same.</p><p>Pulling onto my uncle’s drive, I climbed from my car and made my way inside. Both my uncle and aunt were out and I had the house to myself. I went to my room and closed the door, sliding the lock tight. Taking my iPhone from my pocket, I watched the footage I had filmed in Starbucks. It was better than I first thought. I could clearly see the guy – who I knew to be called Jax – as he came towards the table where I had been sitting with my friends. I played the footage again, delicately drawing my thumb over it. Hitting the share button, I emailed it to myself. Springing onto my bed, I flipped open my laptop and retrieved the email. I replayed the footage of Jax, my heart thumping every time he came into shot. I hit the pause icon at just the right place. I was right; he did look straight at me as he left. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I pulled the laptop onto my knees and bent closer to the screen. I was so close to the image, it was as if our noses – our lips – were almost touching. My stomach knotted. He had looked at me. That hadn’t happened before. Usually, the people in the photographs I secretly took didn’t look at me; it was like I wasn’t even there. They ignored me.</p><p>With the image still paused, I took a screenshot and saved the image into my picture folder. Then, hitting the print icon, the small printer on my desk on the other side of my bedroom started to hum. Placing the laptop to one side, I skipped across the room, snatching the picture of Jax from the printer. I held it up in the afternoon sun, which streamed in through my bay bedroom window. My heart sped up as I looked at him and he back at me. Then, taking a small tack from the desk, I headed back across my bedroom. I removed the large framed picture of the London skyscape I had on my wall. Carefully resting it against the door, I tacked the picture of Jax to the wall along with the others I had already hidden of him there. There were a hundred or more already. To look at it was like looking at a giant jigsaw. Picking up the framed picture again, I hung it back onto the wall, concealing my secret pictures of Jax.</p><p>After taking a shower and eating a light snack, I left home before my aunt and uncle got back from work. I climbed back into my car and headed across town. Pulling over, I parked the car a few houses down from the one Jax shared with his friend. I’d lost count of how many times I had sat here. But I had learnt a lot about Jax and his habits. I knew where he had gotten himself a job after flunking out of college, his shift pattern, the fact that he brought a constant stream of young women to and from his place. Most of them looked nothing more than hookers, with their gaudy makeup and their skirts which were little more than belts. They were often drunk as he helped them teeter up to his front door on their ridiculously high heels. And even as I sat in the dark and gripped my steering wheel, I knew they meant nothing to him. I had never seen the same girl twice. He was just passing time with them.</p> <p>Sinking low in my seat, I watched a pizza delivery guy arrive outside Jax’s place. Was he going out tonight or just crashing in front of the TV? If that was the case, I could be in for a very dull evening. I switched on the radio and strummed my fingers along to Coldplay. Then, when I was about to give up and go home, the front door swung open and Jax appeared. He wore black denims and a light blue shirt with the sleeves rolled up to show off his forearms and tattoos. He looked good. I glanced at the dashboard. 21:55. Where was he going so late? Partying, I guessed. He climbed into his truck. It rumbled to life like some kind of beast, and he drove away from the curb.</p><p>I followed at a healthy distance, always keeping a few vehicles between us. Reaching a stoplight, Jax sailed through and I had to wait.</p><p>“C’mon!” I hissed, glaring up at the red light and tapping my fingers impatiently against the wheel. I peered ahead, desperate to keep sight of his loud truck.</p><p>The light turned green and I shot forward. I scanned the road ahead, but he was nowhere to be seen.</p><p>“Shit!” I cried out, thumping the steering wheel with my fist. Then, with my heart almost stopping, I saw his truck parked outside Rowdy’s Bar. The chrome hubcaps twinkled in the neon lights of the bar. It was like the truck was somehow drawing my attention to it. Braking hard, I pulled into the parking lot and stopped. I peered over the steering wheel as he headed towards the bar. He opened the door and I could hear the sound of loud music punch its way out into the night.</p> <p>Not knowing what to do next, and unable to bear the thought of him leaving with something close to a hooker in a few hours’ time, I swung open my car door and climbed out. As I headed towards the bar, and with the music growing louder with each step, I didn’t know if I were doing the right thing or not. What if he saw me? He might suspect something. After all, that would’ve been twice in one day. Wouldn’t he wonder what I was doing in a bar all on my own? I became separated from my friend, I would tell him. She hooked up with some guy and left me all alone. Both sounded like good enough excuses. But who was I trying to kid. He probably wouldn’t even notice me, I thought to myself, pulling open the bar door, let alone speak to me. I looked inside to see Jax leaning against the bar, talking to some guy. I took a deep breath, swallowed hard, then stepped inside.</p><p>Chapter Five</p><p>Jax</p><p>Trent wore blue jeans, which covered his skinny frame. His button-up shirt was black and he had on some sort of worn-looking cowboy boots. He was holding a beer bottle in one hand and was using the other to prop himself up against the brass railing. He appeared to be talking to his friend Gabe, who I had only met once before at a Seminoles game.</p><p>I walked up and Trent put out a fist.</p><p>“You remember Gabe?” he asked.</p> <p>I give Gabe a half-smile as I bumped Trent’s fist with my own. “Yeah, what’s up, man?”</p><p>He looked right at me. “Nothing. It’s Jaxon, right?”</p><p>“Yes, but just call me Jax, everyone else does.”</p><p>Gabe nodded and took another pull on his beer.</p><p>“You guys want another?” I asked, pointing at them both.</p><p>They answered in unison, “Sure.”</p><p>I made my way to the bar and took a look around. It was a little after ten p.m. and the club was filling up quickly. I found an empty spot at the bar and waited for the bartender – an older chick in a tiny Rowdy’s T-shirt that showed off her huge cans – to finish with drinks she was pouring double-fisted out of two bottles.</p><p>The customer she was helping paid her and she fixed hazel eyes on me. She was chewing gum. “What can I get’cha, darlin’?”</p> <p>“Three Buds please,” I replied with my most charming smirk.</p><p>She dipped her head and turned around to grab three bottles out of a large metal bucket of ice behind the bar. She turned around, and with lightning speed, pried the tops off each with a hiss, and practically slammed them on the bar’s counter. She gave me my total and I paid her, leaving her a nice tip.</p><p>On my way back to the guys, I spotted a super-hot girl in a tiny pair of white cutoff jean shorts and pink cowboy boots. She was wearing a skimpy hot-pink tank top and a light pink cowboy hat over her mass of brown curls. I damn near tripped over the one step that led to the dance area while I was ogling her. Smooth. NOT. She made brief eye contact and winked at me. I gave her my most disarming smile, and then looked away. Couldn’t appear too desperate now.</p><p>I distributed the beers and listened to Gabe and Trent chat about school for a while. That was the last thing I wanted to talk about, so I tuned them out and nursed my beer, scanning the club for the hot brunette in the pink boots. I did a three-hundred-and-sixty-degree scan with my eyes and spotted her in the same place she’d been before.</p><p>Wait... before my eyes fell on miss pink boots, I saw something familiar. I flicked my eyes to the left of the bar and saw her. Oh, my God, it cannot be her. The blonde from the coffee shop. She was sitting alone in a lounge type area in an oversized chair. She had a glass of something in her hand. She was looking at me, well I think she was, as I was clear across the club, but she wasn’t smiling.</p><p>I looked away. What in the hell was she doing here?</p><p>Chapter Six</p><p>Mina</p><p>With my fingers gripping my glass of vodka and Coke, I took a seat at a table. I chose one which gave me a perfect view of Jax, who was with his friends on the other side of the bar. The country music playing wasn't really my thing and I wondered if it was really the sort of music Jax would normally listen to. He didn't look the cowboy type. Perhaps he liked the cowgirls? Since arriving at the bar, I'd noticed Jax eyeball at least three women wearing short, tight tops and even shorter skirts.</p><p>I slowly sipped my drink and once again glanced in Jax’s direction. He was looking straight back at me. My heart thumped like I'd been punched in the chest. Were we going to get into another staring competition? I wondered. This time I wouldn't back down. At some point I would have to make a move. I couldn't spend the rest of my life spying on him. Why had I come here tonight? Why had I followed him to this bar if I hadn't wanted to take this further than just a secret collection of pictures and film? But would the pictures get me into trouble again? I had made that mistake before, and it had cost me dearly. I had lost my mum because of those pictures. They had been the evidence which had buried me. But I knew in my heart that sooner or later, I would have to forget what had happened before. That had been over two years ago now. Things might be different with Jax, and I guessed I was soon to find out as Jax strode across the dance floor towards me, a bottle of beer swinging from between his fingers.</p><p>Oh, my God, I panicked. Was he still pissed because my friends and I had been laughing at him in the coffee bar? Then a horrible fear gripped me. Perhaps he knew I'd followed him here tonight. Maybe that's why he left me standing at the red light back along the road? Even worse, Jax might know that I'd been following him these last few months. Maybe he knew about my collection of photographs?</p><p>No, he couldn't know about any of that stuff. If he did, then wouldn't he have confronted me sooner – at the coffee bar? But I'd been with my friends, so perhaps he'd taken the decision to confront me when and if he got me alone.</p><p>Did I go? Did I stay? What should I do? All of a sudden, this really didn't seem like such a good idea anymore. I recognised that sinking feeling I'd felt before when I had been caught out. It was more than a sinking feeling... it was like freaking drowning. I suddenly felt like I couldn't breathe. I pushed my chair back from the table and stood up.</p><p>\"You haven't finished your drink,\" Jax said, reaching the table. He looked down at the half-empty glass then back at me.</p><p>\"Huh?\" I mumbled like a half-wit.</p><p>\"Lost for words now that you don't have your friends with you for backup?\" he said, eyes boring into mine.</p><p>\"I would hardly call them backup, would you?\" I shot back, regaining some of my confidence. \"You make us sound like a SWAT team or something.\"</p><p>\"Maybe it should've been me wearing the stab-proof vest, what, with the daggers you were giving me,\" he said, unsmiling. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He did come over to have a row. What did I expect? Hearts and flowers?</p><p>\"We'll perhaps if you hadn't been charging around Starbucks like some goddamn ape, you wouldn't have knocked into me and spilt...\" I started.</p><p>\"So sue me, sweetheart,” he sniped.</p> <p>\"I'm not your sweetheart,\" I hissed. This wasn't how I’d imagined our first encounter to play out. Like I said, nothing good had come of the pictures so far.</p><p>\"Aren't I the lucky one!\" he hit back.</p><p>\"So your tattoo says,\" I reminded him. All of a sudden, I just wanted to be back in my car heading home already. Looking at the pictures was way more fun than getting too close to the real thing, I’d decided.</p><p>He took a step forward, narrowing the gap between us. If I'd wanted to get past him now, I would've had to brush up against him. Like that was gonna happen.</p><p>\"So where are they now?\" he asked, glancing around the bar.</p> <p>\"Who?\" I asked.</p><p>\"The rest of the A-Team?\" he said with a cocky smile.</p><p>\"If you’re referring to my friends, very funny,\" I sighed. \"Did you write that joke yourself?\" I pushed past him, heading for the door.</p><p>\"I've got some more,\" he called after me over the beat of the music.</p><p>I stopped mid-step. \"More what?\" I asked, looking back over my shoulder at him.</p><p>\"Jokes, if you want to hear them?\" He half-smiled.</p> <p>How could I refuse that smile? It had an arrogance, but also a certain amount of charm.</p><p>I turned away from the door. Crossing my arms, I looked at him and said, \"If you make me laugh, I’ll stay – if you don't – then I'm out of here. Knock yourself out, cowboy.\"</p><p>Please be funny, I thought.</p><p>Looking straight back at me, he said, \"Why did the monkey fall out of the tree?\"</p><p>\"I don't know?\" I shrugged.</p><p>\"You're supposed to say, 'I don't know, why did the monkey fall out of the tree, Jax?'\" He smiled again, taking another step toward me as I stood by the exit.</p><p>He was within touching distance again. \"Why did the monkey fall out of the tree, Jax?\" I asked like he told me to.</p><p>\"Because it was dead,\" he said, his face as straight as a poker player.</p> <p>\"That's not funny,\" I said, trying to mask a smile.</p><p>\"So why are you smiling?\" he grinned back.</p><p>\"Because it was the dumbest joke I've ever heard,\" I told him.</p><p>\"Aren't all jokes dumb?\" he asked, so close now that I could smell the musky scent of his aftershave. My heart sped up just a little.</p><p>\"I guess it depends on who's telling the joke,\" I said, keeping a straight face this time around.</p><p>\"So if my joke was so unfunny, why isn't the door hitting you in the ass as you run for the hills?\" he said, looking into my eyes, then down at my mouth.</p><p>Was he checking to see if I were laughing, or was he wondering what it would be like to kiss me? I pushed the thought away.</p><p>\"So?\" he asked.</p><p>\"So what?\" I asked back.</p><p>\"So are you staying for a while longer?\" he smiled, cocksure he knew what my answer was going to be.</p><p>\"I'm leaving,\" I said, turning and opening the door. The warm Floridian night air brushed my hair from my shoulders. Then, looking back at him, I added, \"You can come, too, if you want.\"</p><p>Chapter Seven</p><p>Jax</p><p>I raised my eyebrows in surprise. As soon as she replied to my smartass comment, her voice hit me like a slap in the face. She had the coolest accent I had ever heard. What is that? English? Australian? Shit... I have to ask her... I know the English get pissed when you ask them if they’re Australian. And the Australians get even more pissed if you ask if their accent is English. I heard a couple get into it in Starbucks once. It was ugly. And quite amusing. We continued bantering back and forth, and just to keep her talking, I decided to tell her the lamest joke I knew. It wasn’t even funny; in fact, it was so very unfunny that I could see a smirk playing on her pretty puffy pink lips and I couldn’t stop staring at them as that voice bellowed out of them. God, that accent was so awesome. I wondered what it would sound like as she called out my name in the throes of...</p><p>She made to leave, and glancing over my shoulders, I saw Trent and Gabe watching me with amusement. I lifted my beer bottle in a wave. Trent saluted me, almost laughing, and I turned around and followed her out, tossing my beer into a nearby trash can. It was then I noticed what she was wearing. A plain pink T-shirt and some denim shorts and... were those sneakers? Wow, who dresses like that in a club?</p><p>Not that I cared... her ass looked damn fine in those shorts. Plus I couldn’t wait to see where this chick was taking me.</p><p>Holy freakin’ crap! I didn’t even get her name.</p><p>I jogged to catch up with her. “Uh... I’m Jax, by the way,” I said, grateful I’d thought of it so I wouldn’t have to flat-out ask her name.</p><p>“Mina,” she said plainly. “And I knew yours already. You said it during your lame monkey joke, Jax.”</p><p>I scratched my goatee. “So, Mina, where are you taking me?”</p><p>She stopped at her car, a small simple blue Mitsubishi sports car, and leaned against it with her arms folded, keys jangling from her long fingers.</p><p>“Well, Jax, what did you have in mind?” She was fixing me with an intense stare.</p><p>Oh, I think she knew what I had in mind. And it was at this stage of the game where I would normally throw the girl into my truck or onto the back of my bike and whisk her off to my place or hers, and have my way with her. I sound like a damn caveman, don’t I? Ladies love the cavemen...</p><p>Except this wasn’t just some girl. I saw this chick all the time; it would be way awkward if I just slept with her and then didn’t call her. And if I did think I’d want to call her again, then I certainly don’t want to go have her in my bed the very first night. As I’m sitting here contemplating this, she had this part hopeful, part amused look dancing in her gorgeous blue eyes. Then she started to bite her lip and I looked at her teeth and wished they were mine.</p><p>I cleared my throat and smiled. “How about coffee?”</p><p>Her face registered a small bit of shock, but then a smile lit up her pretty features. “Well I only drink tea, but sure, we could find someplace open late, if you want.”</p><p>I nodded and led her over to my truck. I had to help her in, as it was jacked up pretty high, but she managed fine. I noticed she didn’t have a purse.</p><p>“Did you lock your car, Mina? This place gets pretty rowdy when it’s late... no pun intended.” I smirked.</p><p>She looked at me confused, not getting my “Rowdy” joke so I cleared my throat. “I mean, you don’t have a handbag or anything...”</p><p>“Oh, I have this,” she said, pulling a small folding wallet from her back pocket. I noticed she had her phone in her hand.</p><p>“Uh, okay.”</p><p>I rumbled out of the parking lot and found a Denny’s Restaurant about five blocks from the club. I knew they stayed open as late as the bars did, so I pulled the Ford into the lot. I jumped out of the truck and she stayed in it. What in the hell was she doing?</p><p>Shit! She wants me to open her door. I truly am a damn caveman.</p><p>I rushed around and opened it, and she gave me a playful smile. “You American boys... no manners at all.” I could tell she was joking. And really, how could I argue with that?</p><p>Once we were seated and had menus and water, I looked up at her. She was staring at me, her hand resting on her iPhone. I looked down at it, then back up into her anxious face.</p><p>“Well, I think you should know that we American boys do have manners. My dad taught me well. I just don’t... date a lot.”</p><p>At that, she almost looked as if she wanted to laugh. Why was that funny? One night stands don’t count as dates. Not that she knew anything about those.</p><p>“Is that so?” she asked in that beautiful accent of hers.</p><p>I smiled. “So where are you from, Mina?”</p><p>“London.”</p><p>I had to keep her talking. “Really? Are you an exchange student or something?”</p><p>Her face grew more serious. “No. Just a student. No exchanging happening here.”</p><p>I thought her comment was very odd so I looked at my menu. I wasn’t hungry but thought maybe I should order something to eat so I could put something in my mouth instead of having stupid things coming out of it. I don’t know what it was about being this girl’s company, but she kinda had me all tongue-tied, which made me feel a little uneasy.</p><p>Chapter Eight</p><p>Mina</p><p>I don't know why, but Jax seemed a little nervous. Perhaps nervous was the wrong word. Edgy – that was the word I was looking for. He had looked down twice at my phone. Did he know that I had it on and was recording short snippets of him and our conversation? No, he didn't know, I was sure of that. He would have been more than just edgy if he knew I was recording him. He would’ve been as mad as hell – just like my mother had been. He ordered two shakes and I watched to see if he checked out the waitress’ arse as she flounced away. He didn't, he was looking at me. Good. It made filming him easier.</p><p>\"Expecting a call?\" he said, staring back at me from across the table.</p><p>\"Huh?\" I mumbled.</p><p>\"You haven't let go of your phone since we got here,\" he said glancing down at it then back at me. His dark eyes were like wells – easy enough to fall into. His little goatee was black and coarse-looking. I'd never kissed a guy with a beard before, and I couldn’t help wonder what it would feel like to be kissed by him. Would it feel rough? Would it make my skin tingle? I crossed my legs beneath the table and pushed the thoughts that were creeping around the edge of my mind away.</p><p>Cupping my hand around my phone, I placed it into the pocket of my denim cutoffs. I smiled at him, trying to hide my annoyance that I'd had to stop secretly filming him. But I couldn't risk getting caught. Not again – not ever. I'd been caught once before and ended up living five thousand miles away for home because of it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"So what's London like?\" he asked.</p><p>\"Wet,\" I said without thinking.</p><p>\"Now I could say something funny about you being wet,\" he said with a mischievous grin. \"Do you want to hear it?\"</p> <p>\"No thanks,\" I blushed, already regretting what I had said.</p><p>\"So what's London like when it's not wet?\" he smiled. The waitress arrived, placing the shakes on the table.</p><p>\"Busy, like any other city, I guess,\" I said, lifting the shake and slowly drinking through the straw.</p><p>He watched me suck some of the drink up into my mouth. He was watching my lips again. I shot him a stare and he looked from my mouth and up into my eyes. I thought I saw him blush – just a little – but it was there all the same. I knew what he was thinking. I knew what he was imagining my mouth doing. I didn't need a camera to see that.</p><p>\"I get the impression you don't want to talk about home much,\" he said, slurping up some of his shake and looking at me over the top of his glass.</p> <p>\"There's not a lot to say,\" I lied. I missed my home very much.</p><p>\"Running away from something?\" Jax asked.</p><p>\"Sent away,\" I said without thinking. I wish I could've taken that back already.</p><p>\"Sent away by whom?\" He didn't miss a trick.</p><p>\"Forget it,\" I said, sipping from my straw again.</p><p>\"You can't ask me to forget something like that,\" he said, sitting back in his seat and looking at me. \"You have me intrigued.\"</p> <p>\"I'd really rather not talk about it,\" I said, folding my arms across my chest.</p><p>\"Was it some kind of guy trouble?\" he smiled.</p><p>\"Why does it have to be guy trouble?\" I stared at him.</p><p>\"Is there any other kind?\" Jax asked with a grin.</p><p>\"I guess not,\" I half-smiled, not really wanting to. I was fast discovering that Jax had the habit of being able to make me smile when I least wanted to.</p><p>\"So it was a guy then?\"</p><p>\"Okay, so it was a guy,\" I sighed. \"Happy now?\"</p><p>\"Why would I be happy?\" Jax frowned.</p> <p>\"That you were right,\" I said back.</p><p>\"I didn't mean to pry.\"</p><p>\"Yeah, you did,\" I said, looking down at my shake.</p><p>\"Why would I want to pry?\"</p><p>\"Because if I'm hung up on a guy, that suggests I’m the clingy type.\" Then, thinking of the constant stream of women I'd seen him lead into his house as I'd sat and secretly watched him, I added, \"Guys like you don't like clingy.\"</p><p>\"How do you know what sort of girls I like?\" he asked, putting his shake down.</p><p>How did I answer that?</p><p>\"I sat and watched you check out at least six women during the short amount of time you were in that bar,\" I said, hoping that this was a reasonable enough explanation.</p><p>\"So you were watching me?\" he asked.</p><p>\"I didn't say that,\" I said.</p><p>\"Yeah you did – you definitely said you were watching me.\"</p><p>\"It might have been what I said, but it wasn't what I meant,\" I said, wanting to squirm in my seat. Jax was staring at me again with those dark eyes of his. Was he enjoying watching me look uncomfortable? I wish he would stop looking at me like that.</p><p>\"So what did you mean? You must have been watching me if you know exactly how many girls’ asses I looked at.\" He wouldn’t let it go.</p><p>\"Don't flatter yourself, Jax. I couldn't care how many girls you were mentally undressing,\" I said, trying to regain some ground. \"I recognised you from the coffee bar, and...\"</p><p>\"So what were you doing in Rowdy's anyhow?\" he cut in.</p><p>\"I was meeting a friend there...\" I started to lie again.</p><p>\"What? Wearing a pink T-shirt, denim hot pants and sneakers? Rowdy's isn't the kind of place you dress like that,\" he said.</p><p>Was he growing suspicious of why I was really in the bar?</p><p>\"I didn't know there was some kind of freaking dress code,\" I snipped back. Having a simple shake with Jax was starting to feel like some kind of interrogation.</p><p>\"Who was this friend anyway?” Jax asked.</p><p>\"Why do you want to know?\"</p><p>\"Won't he be just a little bit pissed that you've just got up and left...?\" he said, starting another line of questioning.</p><p>I pushed my shake aside and got up. \"Who said I was meeting a HE? Or are we back to the guy thing again?\" Before he had a chance to say anything, I added, \"Can you give me a ride back to my car now? I want to go home.\"</p><p>Reaching the door to the diner, I felt Jax grip my arm. \"Hey,\" he said. “I didn't mean to upset you.\"</p><p>\"So what did you mean?\" I said, pulling my arm free and gripping my phone in my hand. \"It felt like you were interrogating me.\"</p><p>Looking at me, Jax said, \"What I meant was, if I was the guy who had arranged to meet you at Rowdy's tonight, I would have been pretty pissed off to discover that you had left without me.”</p><p>His comment took me off guard and I wasn't sure how to respond. I looked away. \"Why?\" I asked.</p><p>\"Because you look good in those hot pants,\" he smiled.</p><p>\"They're denim shorts,\" I said, looking at him.</p><p>\"Yeah but you make them look hot,\" Jax grinned.</p><p>\"Give me a break,\" I said, both of us knowing that he had made me smile again.</p><p>Chapter Nine</p><p>Jax</p><p>Wow, this British chick had serious attitude – and I liked it. I mean, she was pissing me off for a bit, but I think she was testing me, playing hard to get. And anyone who knows me knows I love that. To a point, anyway.</p><p>I tossed a twenty on the table and led her back out to the truck. I made sure to open the door for her, knowing what she expected. She had a death grip on that iPhone of hers and I wondered if she maybe had another guy she was with or talking to, the way she was so protective of it. Some people are just glued to their phone I guess.</p><p>She didn’t say anything on the drive back to Rowdy’s, and when we arrived, the parking lot was still full and I felt a bit disappointed that we hadn’t spent much time together. I got out and opened her door, and offered her a hand to help her out. Her skin felt warm and soft under my calloused mechanic’s hands and it made me smile.</p><p>Being the gentleman I was trying to prove I was, I walked her to her little blue sports car, and as we reached it, she fumbled with her keys a bit, then hit the fob to disarm its alarm. The parking lights lit up as she did so, and I noticed one of them was out.</p><p>“You’re gonna need to replace the bulb on your left front parking lamp,” I said lamely.</p><p>Oh, my God why am I talking about her stupid car?</p><p>She grinned. “I’ll keep it under advisement.”</p><p>I stepped closer to her to test the waters. She didn’t shrink back from me, but I did notice she kept looking behind me. I had noticed her doing this in Denny’s, too. I didn’t want to turn around to see what she’d been looking at. I had to pretend I didn’t care.</p><p>I licked my lips and looked down at her. “So, uh, do you think I could get your number?”</p><p>She grinned up at me. “Hand me your phone and I’ll put my number in.”</p><p>I slipped it from my jeans pocket and placed the phone into her soft hands, purposely letting mine linger on hers a little too long. She held my gaze, then eventually flicked her eyes down to my phone. She seemed to have to fumble with it a bit, as it was an Android device and not an Apple. Mina eventually figured it out, and after a few smooth keystrokes with her long, tanned fingers, she smiled triumphantly and handed it back.</p><p>I glanced down at the phone and chuckled. “Just Mina, huh? No last name?”</p><p>She shook her head. “No... unless you know more than one Mina?”</p><p>Okay, I’ll play. “Maybe I do.”</p><p>“Well you don’t have any of their numbers in your contacts. I’m the only one,” she said playfully, biting her lip again.</p><p>Damn, I wish she’d stop doing that.</p><p>“So what is it?”</p><p>She looked confused. “What is what?”</p><p>“Your last name? Let me guess. Devonshire? Cambridge? Holmes? Cooper?”</p><p>She rolled her eyes then laughed. “I’ll never tell.”</p><p>I couldn’t take it anymore. I suddenly crushed my lips to hers. They were soft and warm, and pressing my body against hers, I felt her stiffen up. I lightly ran my hands along her bare arms and I could feel goose bumps pop up at my touch and it made me smile. I lightly snaked my tongue into her mouth and then felt her wrap her arms around my neck.</p><p>I turned my head slightly to the side, intent on devouring more of her mouth, when she made a noise in the back of her throat and began to shake. I pulled away, slightly alarmed, and looked at her. She was giggling.</p><p>“What?”</p><p>Reaching up to touch her mouth, she rubbed her lips. “Your goatee tickles.”</p><p>I raised an eyebrow at her. “Do you like being tickled?”</p><p>Ignoring my remark, Mina removed her arms from around my neck, slowly running them down my chest and over my shirt. As they came to rest at her sides, she jingled her keys again and said, “I’ll be seeing you later, Jax.”</p><p>She maintained eye contact with me as she got into her car. I watched her drive off.</p><p>I walked back to my truck. Climbing in, I looked at the flashing lights of the club. It was only eleven, and I still had my hand stamp and could probably go in and party some more, but then Trent and Gabe would know I struck out.</p><p>Can’t have that...</p><p>I wasn’t much in the mood anyway, so as I drove off towards home, I thought about Mina. She was quite different from any girl I’d met. She was a good kisser, even though my goatee tickled her. I’d like to know if she was ticklish anywhere else, I smiled to myself. I could certainly listen to her talk all day long with that wicked cool accent of hers. I had so many questions to ask her, but she seemed to get defensive with most of them. I figured I’d better tread lightly. It seemed she’d been screwed over by some guy in England. I briefly wondered at this, wishing she’d have given me more detail, but decided I probably shouldn’t bring it up again, as she seemed hurt by it. We all had stuff that hurt us. I knew that all too well. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>How long had Mina been in the States? Maybe she was here on some student visa and had to go back when she was done with college? That might work out for the both of us. We could have some fun and then both split without any of that “I love you” and “can’t live without you” crap. I didn’t need any emotional ties. Mina seemed to be hurting, even though she tried to hide that fact. But I had my own stuff to deal with so really didn’t want to be offloading hers. If I were honest, I just wanted to climb inside her panties – nothing more. What, with dad missing for almost a year now, I had my own problems, too. He had gone missing before – but that had been the drink. The booze had gotten to him real bad after mom had died. The women had gotten to him too. Since her death, my dad had pissed what little savings he had up the wall or spent it on women who climbed in and out of his bed. I was surprised he didn’t have a revolving door stuck in his bedroom. It had pissed me off to start with. I didn’t like the idea of him being with women so soon after my mom’s death. But I’d heard him crying one night. I couldn’t go to him. I wasn’t good at that tactile stuff, and neither was he, unless she was a brunette with her boobs hanging out. So I left him alone to cry into his bottle of J.D. I tried to talk to him about it as we had worked on my truck together – but I could never find the right words. They kind of lingered on my lips, but never formed into words. So I would just hand him another bottle of beer and we would work in silence. I wish I had that time back now. But he had gone. Where, I didn’t know, and neither did the cops. To be honest, I don’t think they were really interested. He was a forty-five-year-old male with a drinking problem. So what? I knew that’s what the cop was thinking as he’d filled out the missing person’s report. I tried my best to investigate myself, but without much luck. None of his so-called buddies had heard a word from him, and he’d already had his position filled at work. What did he have to come back to? No wife, no money, no job, no friends, and a son who had flunked out of college. No wonder he stayed away and hadn’t come back. But all the same, I missed him. He was my dad, despite his problems. If he did come back, I would talk to him this time around, even if I had to sit and watch him cry. But sometimes, when I looked at myself in the mirror, it was my dad I could see looking back at me. Maybe I should get a revolving door fitted in my bedroom, too.</p><p>The house I shared with Austin was in darkness. Guessing that he had gone to bed already, I took a beer from the fridge and went to my own bed. Staring up at the ceiling, I wondered where my dad was. Then clutching my beer to my chest and closing my eyes, I made a mental note to call Orlando P.D. tomorrow and ask if they had any leads in his disappearance.</p><p>Chapter Ten</p> <p>Mina</p><p>My lips were still tingling as I headed towards home. Jax’s kiss had been passionate but soft. I had been right, though – his goatee had tickled. But that had been the only soft thing about him. His body had felt hard and strong pressed against me. I’d liked that – a lot. I liked Jax. He wasn’t my usual type – but what was? I wasn’t sure I had a type. I’d been put off by the last. He had hurt me – more than he would ever know. But then again, he probably did know, and that’s what hurt the most. He let me take the blame. He let my mother push me away.</p><p>I slipped my iPhone into the dock on the dashboard and pressed play. Sailing on the Seven Seas by OMD started to play and I strummed my fingers along against the rim of the steering wheel. I still loved listening to British bands. It reminded me of home, just like the picture of the London skyscape I had on my bedroom wall at my uncle and aunt’s house. I would lie on my bed and stare at that picture for hours and imagine that I was still there, standing outside St. Pancras Railway Station in the drizzle, looking left along the Euston Road in the direction of Kings Cross and secretly take snaps of those who passed me by. The pictures weren’t as clear back home – that was the only difference. Perhaps it was the constant rain? Perhaps it acted like static somehow and made the pictures and film footage blurry. My first secret pictures of Jax had looked smudged somehow, like someone had rubbed Vaseline over the camera lens of my phone. But over the weeks and months I’d been following him, they had become clearer. They still weren’t perfect, but they were getting clearer the whole time.</p><p>Slowing, I steered my car towards the curb. I pulled up onto the drive, and parked. Both my uncle’s and aunt’s cars were outside the double fronted garage. I pressed the key fob and the headlamps flashed. Jax had been right; one of them was out. I let myself into the house, and taking a bottle of water from the fridge, I headed upstairs to my room.</p><p>“Hey, Mina,” someone said from the darkness at the top of the stairs.</p> <p>The landing light was switched on and I could see my uncle standing above me. With a hand pressed against my chest to slow my racing heart, I headed up the stairs towards him.</p><p>“Hi, Uncle Rob,” I said.</p><p>“What are you creeping around in the dark for?” he smiled.</p><p>“I didn’t want to wake you and Aunt Claire,” I explained, reaching the top of the stairs.</p><p>“You know I wouldn’t have gone to sleep until I knew you were home safe,” he said.</p><p>“You worry too much.” I gave him a fake scowl.</p> <p>“I’m sorry,” he said. “It’s just that...”</p><p>“I know,” I whispered. “It’s okay, Uncle Rob.”</p><p>Both he and my aunt had had a daughter who had died aged six. Run down outside her school. Her name had been Summer. The driver had never been caught. She had been a pretty girl – I had seen her in pictures. Memories were all my uncle and aunt had left. I think that’s why my uncle was so happy and willing to have me go live with them when my mum pushed me away. It was like they had a second chance. I knew they thought of me as a daughter. My uncle had often said I could drop the “Uncle” and just call him Rob – Dad if I wanted to. But I couldn’t. My dad was dead and he could never be replaced. But I loved my uncle and aunt very much. They had been very kind to me and given me a home. My mum had told them what I’d done, but they never spoke about it. That was fine by me. But still I hid the pictures I took. They might not be happy if they thought I was still doing such a thing.</p><p>“Have you been anywhere nice?” he smiled, his hair skewwhiff from where he had been lying in bed.</p><p>“Just had a milkshake with a friend,” I said.</p><p>“Anyone I know?” he winked.</p><p>“Just a friend,” I smiled, leaning forward and kissing him on the cheek. Then turning down the landing towards my room, I said, “Goodnight, Uncle Rob, and thanks.”</p><p>“Thanks for what?” he called after me.</p> <p>“For waiting up,” I said, pushing open my bedroom door and glancing back at him.</p><p>“Sleep tight,” he said with a flick of the wrist, as if it really was no bother. He headed back into his own room and shut the door.</p><p>I closed my bedroom door. It was a warm night, so, taking my phone from my shorts pocket, I kicked them off then removed my T-shirt. Crossing my legs, I sat on my bed in my bra and panties and hit the photo icon on my phone, then selected video.</p><p>“...Expecting a call?\" I heard Jax’s voice hiss through the tiny speaker on my iPhone as I replayed the footage I had recorded earlier.</p><p>\"Huh?\" I heard myself mumble.</p><p>Did everyone hate the sound of their own voice? I hated mine.</p><p>\"You haven't let go of your phone since we got here,\" his voice said.</p><p>That’s where I had ended my recording in the diner – afraid that Jax might figure out what I had been up to. I dragged my fingertip over the screen, taking the short video back to the beginning. I watched and listened again. It was like watching footage shot in one of those undercover stings you see on the TV. Jax was looking over the top of the camera and at me, totally unaware that he was being filmed. The film ended and I started it again. I raised the phone in front of my face and stared at the footage. I stared at Jax, then just past him, just like I had in the diner. I could see the waitress with the tight arse in the background leaning over another table and serving another customer. The footage ended, and I played it again, then again and then again until my eyes started to feel heavy.</p><p>Covering my mouth with the back of one hand, I yawned, and lay back on my bed. I switched off the lamp. The light from my phone made my bedroom glow an eerie blue and grey. I looked across the room at the picture of London. I could just make out the dome of St. Paul’s Cathedral. I thought of all those secret photographs of Jax hidden behind that picture. The first I’d taken because he was cute, but I saw something in that photograph that no one else could see. I saw what was making Jax so unhappy. Closing my eyes, I pressed the phone to the side of my head and I went to sleep listening to his voice... listening... always listening...</p><p>I woke with a start. Had I been dreaming? I couldn’t be sure. My phone lay on the pillow next to me and it was beeping. That’s what had jolted me from my sleep. The battery was almost dead and the bleeping sound was the warning, reminding me it was time for a recharge. Plugging the phone into the power socket, I hit the shower and got ready for college. I pulled my hair back into a ponytail, and dressed in a light sweater and jeans. My phone was only half charged when I unplugged it. That would have to do. I bounced down the stairs and into the kitchen. My aunt was squeezing the juice from several oranges and my uncle sat at the table with a mug of coffee, reading a copy of the Orlando Sentinel.</p><p>“Morning, sleepyhead,” Aunt Claire said, handing me a glass of her pressed orange juice. I looked at the mountain of orange peel on the breakfast counter, then at the half filled glass she had handed me.</p><p>“You know they sell this stuff in cartons for a reason, Aunt Claire,” I smiled.</p><p>“That’s not real orange juice,” she said, taking another orange from the pile and cutting it in half.</p><p>“You’re wasting your breath,” Uncle Rob said, not looking up from his newspaper. “It’s just another fad, it will soon pass.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Keeping healthy isn’t a fad,” Aunt Claire said. Then patting her behind, she said, “I just want to lose a few pounds for this weekend, that’s all.”</p><p>“Why, what’s happening this weekend?” I asked, then took a sip of the orange juice she had made.</p><p>“It’s our wedding anniversary,” Uncle Rob said, his nose still buried in the newspaper.</p> <p>“I thought you’d forgotten all about it,” Aunt Claire said, pressing another orange flat into the juicer.</p><p>“How could I forget?” Uncle Rob sighed, folding the newspaper in half and placing it on the table. “It’s all you’ve been talking about for the last six weeks. I’m surprised you don’t stick an ad in the paper.”</p><p>“Oh, stop being such a grouch,” Aunt Claire smiled, flicking a piece of orange skin at him.</p><p>He ducked out of the way. My aunt and uncle were always at each other, but not in bad way. It was like they were teasing each other the whole time. I could tell they loved each other a lot. My mother and uncle resembled each other, but that was where the likeness stopped. Uncle Rob was warm-hearted and kind, whereas my mother’s heart couldn’t be pierced with an ice pick. My uncle would have had a lot of love to give to his daughter if she had still been alive. It seemed kind of unfair that Uncle Rob lost his daughter in an accident, and my mother gave her daughter away.</p><p>“Will you be okay on your own this weekend?” my uncle asked, dragging me from my thoughts.</p> <p>“Huh?” I said, glancing at him. “Oh, yes, I’ll be fine.”</p><p>“Are you sure...?” he started again.</p><p>“Robert, leave the poor girl alone,” Aunt Claire said. “She’s nineteen years old. Of course she’ll be okay. Won’t you?” She smiled at me.</p><p>“Sure I will.” I smiled at my uncle. “Don’t worry about me.”</p><p>“I bet Mina’s already arranged to have her girlfriends over, haven’t you?” My aunt winked at me.</p><p>“Sure,” I shrugged. I hadn’t arranged any such thing. I had forgotten all about the fact they were going away. But now I’d been reminded of it, I could arrange a small gathering or I could... I could... invite Jax over?</p> <p>I pushed the thought away, but now that I had thought of Jax, it was like he wouldn’t leave my mind.</p><p>“Well, you have the number for the cabin up at the lake,” my uncle said. “So if there are any problems...”</p><p>“There won’t be any problems, Robert,” my aunt cut in. “Stop fussing. You’re just like an old woman at times.”</p><p>“I just care, that’s all,” Uncle Rob said, looking at my aunt, then at me.</p><p>“I know you do,” I smiled. “But I’ll be just fine. You two go and have a great time. Try and relive some of that old magic.”</p><p>“Hey, cheeky,” my aunt smiled. “Not so much of the old. I’ve still got it!” and she patted her butt again.</p><p>Laughing, I turned and headed towards the door. “Catch you later,” I said over my shoulder.</p><p>“Have fun!” my uncle called out.</p> <p>And I intended to that coming weekend.</p><p>I pressed the key fob for my car, and the lights flashed – all but one. I checked my wrist watch, wondering if I would have time to drop my car into that little auto shop near to the college campus. The auto shop where Jax worked.</p><p>Sure I had time.</p><p>Biting into my lower lip and smiling to myself, I headed away in search of Jax again.</p><p>Chapter Eleven</p><p>Jax</p><p>I wiped my hands on a filthy red oil rag and sighed in exasperation at the car in front of me. The damn distributor cap was stuck and not coming off and I wanted to take a sledgehammer to it. I used the rag to wipe the moisture from my forehead before my salty sweat dripped into my eyes and stung them again. It was so hot in this garage, even with the fans blowing on me.</p><p>I tossed the oil rag onto a nearby bench and wiped my hands once more on my blue coveralls before grabbing a water bottle from the break room’s fridge. I downed the contents in one gulp.</p><p>I heard the shop’s buzzer ding, indicating a customer. I paid it no mind; Jennifer, who worked in the front of the shop – in the nice, clean, air-conditioned part of the shop where the tidy, sparkling lobby was – was on duty. I’m sure she’d handle whoever it was.</p><p>I was tempted to go see for myself, only as an excuse to say something to Jennifer. She was uber-hot with long, straight brown hair and a super ass. But she had this boyfriend who was bigger than me and had more tattoos and owned a more expensive motorcycle than mine, so I didn’t mess with her. Even though she flirted with me incessantly. I looked down at myself and decided this grease-monkey look wasn’t my best and stayed in the shop.</p><p>I stared at the evil Volvo up on the lift and took a deep breath, determined to break it before it broke me.</p><p>I picked up my wrench with determination when I heard Jennifer’s voice over the intercom: “Jax, you’re needed up front.”</p><p>I was confused. Maybe Jennifer could read my mind. I laughed at the thought and again wiped my hands on my coveralls before turning the doorknob that led to the lobby. Not that it did much good, that doorknob was downright disgusting.</p><p>I walked in and eyed Jennifer from head to toe with appreciation. She had on a short denim skirt and a tight black tank top. Mmmmm. She grinned at me around the wad of gum she was chewing, her amber-coloured eyes sparkling. “You have a visitor.” She pointed in front of her and looked at the customer.</p><p>I followed her line of sight and shock hit me when I saw Mina standing there. She was scowling at me, and with the combination of her being there and the dirty look she was shooting me, it caused me to hold my breath.</p><p>When I finally found my voice, I plastered on a smile. “Hi, Mina. What... are you doing here?”</p><p>She seemed to regain her composure and smiled slightly. “Uh, I’d love it if you could replace the light on my... what did you call it? Headlamp?”</p><p>I smirked, then looked down at myself. Holy shit I looked like hell. Oh well, nothing I could do about it now. I just hope she couldn’t smell me.</p><p>“You know, you can get that light for about ten bucks at Auto Zone, and if you have a screwdriver, you could probably pry the cover off...”</p><p>“Jax!” I heard Jennifer snap.</p><p>Her hazel eyes were big, and she said through the side of her mouth, “The lady needs help with her car. Be a good boy and replace her light.”</p><p>I looked at Mina, who now looked thoroughly amused. “Pull your car into the open bay and I’ll meet you around.” Then I looked at Jennifer. “Go grab me an ELP-3-DP, will you, sweetheart?”</p><p>She rolled her eyes but smirked while chomping on gum. “Sure, Jax.” I watched appreciatively as her fine ass disappeared into the back stockroom. She came back with the part, plunking it into my dirty open palm.</p><p>I grinned at her. “Thanks.”</p><p>I went back through the greasy door and saw Mina standing next to her little blue car. She was leant against it with one foot propped up against the door, her arms folded over her nice chest. She again had the denim shorts on and her long, tanned legs looked downright lickable.</p><p>I looked at the Volvo on the rack that had been taunting me all afternoon and smirked, glad for the distraction.</p><p>“Hi,” I said, walking up to Mina.</p><p>“Hi,” she replied, meeting my stare. “I, uh, have to get to school so I hate to rush you, but I’m in a bit of a hurry.”</p><p>I smiled at her. Man, I loved hearing her talk. “It’s not a problem, this will only take a few minutes.”</p><p>I reached into my large red toolbox and removed a simple screwdriver and set about the task of removing her front parking light cover.</p><p>“So, uh, what are you majoring in?” I asked, uncomfortable with the silence.</p><p>“I’ve not decided yet,” she said. “But I should decide soon. My aunt and uncle are expecting me to pick a career.”</p><p>I finally got the cover off and set it on the ground. I peeled the packaging of the lamp apart with my teeth. I looked up at her a little confused. “Where are your parents?”</p><p>She measured me with a strange stare for a minute, then responded. “Dad’s gone. Mum’s in London.”</p><p>Again, with the clipped answers. I decided not to pry further. I got the little burned-out light from its casing and tossed it into a nearby trash can. “So you live with your aunt and uncle then?”</p><p>Wow, stupid question, didn’t she just say that?</p><p>She grinned. “Yes, they are good people.”</p><p>I screwed the new bulb into the casing. “Get into the car and start it up, please.”</p><p>She did as I asked.</p><p>“Flick the blinker,” I instructed.</p><p>Blink-blink... light worked great.</p><p>She killed the engine and got out. I picked up the cover and replaced it quickly.</p><p>“Thank you, Jax, really. I didn’t even realize it was out. I wish I had a fancy car with one of those computers that tells you when something is amiss on the car.”</p><p>“Well you can always bring it here. I’ll be happy to keep your car healthy. Even though we specialize in Volvos and this is a Mitsubishi.”</p><p>Again with the stupid small-talk. Why did this chick make me so nervous?</p><p>“So, ah, how much do I owe you?” she asked, swiping some of her straight blonde hair behind her ear nervously.</p><p>I wiped my hand on the oil rag that was hanging out of my coveralls pocket. “You can have dinner with me.”</p><p>She grinned. “A proper date then?”</p><p>I nodded and looked down at myself. “Of course. And I promise I’ll be much cleaner.”</p><p>“Okay then, it’s a date. You have my number, call me.” She got into her car, and starting it up, she smiled and waved at me, then backed out of the bay and took off down the street.</p><p>I went back to work on the mocking Volvo, and when I finally got the cap popped, I realized I needed a part for it, so I went back to the front.</p><p>“Jennifer, fetch me a cap, will ya?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She nodded and disappeared into the parts room again, returning a minute later, handing me the part. “So who was the British chick?”</p><p>How did I answer that? How should I explain to people how we met? I saw her in a coffee shop then she followed me to a club? Did she truly follow me, or was I imagining that? I just couldn’t help but wonder why she was dressed the way she was in a nightclub, by herself, watching me. I had to dismiss the thought that she actually knew I’d be there that night because that would border on creepy. It wasn’t as if she could have known I would be there. It had to have been coincidence.</p><p>“We met in a coffee shop near the college campus,” I finally replied.</p> <p>“Picking up foreign college chicks in coffee bars are we?” she smirked at me, scratching at the tattoo on her upper arm. It was still scabby-looking and covered in Vaseline.</p><p>“Don’t scratch at that, it’s supposed to scab over. It won’t heal right if you don’t leave it alone. In fact, go cover that shit up until it’s healed.”</p><p>She smiled at me, chomping her gum. “Okay, Jax.” Then she looked down at the magazine she’d been reading, totally ignoring my order.</p><p>I went back into the shop and tried to decide where I was going to take Mina on our first official date.</p><p>Chapter Twelve</p> <p>Mina</p><p>College passed in a blur. Each lesson seemed to draw out for an eternity. I was so distracted by the thought of going on a date with Jax that Evelyn dropped her usual carefree ways and took me to one side.</p><p>\"Are you okay, Mina?\" she asked, looping her arm through mine and guiding me to a quiet spot on the other side of the campus.</p><p>\"Sure,\" I said, stepping into the shade of a tree and sitting down on the grass.</p><p>\"It's like you have something worrying you,\" Evelyn said, unzipping her bag and taking a bottle of water from it. \"I know I can be a bit of a joker at times, but I can take stuff seriously. And I can keep a secret.\"</p><p>\"I don't have any secrets to tell,\" I said, watching her unscrew the cap of the bottle and taking a drink.</p> <p>It was hot, and at that moment I would have done anything to be standing in the cold, grey drizzle of London. I would've killed to feel the icy pinpricks of rain jabbing at my flesh. Would I ever feel that again? I didn't know.</p><p>\"See? This is what I mean,\" Evelyn said.</p><p>\"Huh?\" I said, turning from my memories and focusing on her.</p><p>\"It's like you've got something on your mind,\" she said, offering me the water bottle.</p><p>I looked at it and shook my head.</p><p>How could I tell her what was on my mind? It wasn't just Jax. There was other stuff, too, but how did I explain that other stuff if I didn't really understand it myself? I'd never really understood it. I didn't think I would ever find anyone who would. Evelyn, definitely not. She had a hard time picking out what clothes to wear when we partied on the weekend. No, I couldn't tell Evelyn my secrets.</p><p>\"Is it a guy?\" she asked, cocking a finely plucked eyebrow at me.</p><p>She was right about that. Jax was on my mind. But she wouldn't understand the reasons why. Evelyn wouldn't understand why I had felt the need to follow Jax for the last few months. She wouldn't be able to comprehend why I'd taken so many pictures of him. Why I studied them when I was alone in my room. No one would understand that – not even my own mother would’ve understood why.</p> <p>\"Well?\" she pushed again.</p><p>\"Well what?\" I knew exactly what she meant.</p><p>\"Is it a guy?\"</p><p>\"Yes,\" I nodded.</p><p>She smiled. \"I knew it! Who is it? What's his name?\"</p><p>How could I tell her that I was going on a date with the grease monkey from the coffee shop? It wasn't that I was worried about what she thought of him and me together – it was how I was going to explain the way in which we got together. Apart from the coffee shop, mine and Jax's worlds should've never collided. How would I even begin to explain how he had come to ask me on a date? I could tell her a half truth. So looking at her, I said, \"I noticed that one of my headlamps was out on my car. So before school this morning, I dropped by the little auto shop. The guy from the coffee shop the other day was working there... he fixed the light and...\"</p><p>\"Asked you on a date!\" she finished for me. \"I hope you told him where to get off.\"</p><p>I looked at her, then broke her stare.</p><p>\"You didn't say yes, did you?\" Evelyn gasped, her pretty face taking on a sudden look of shock and horror.</p><p>\"Why shouldn't I have said yes?\" I asked, sensing her disapproval. I'd heard that tone before. My mother had been very good at it.</p><p>\"He's a tattooed ape, that's one good reason for starters,\" she said, looking at me with more concern now than shock. \"He spilt coffee down your shirt!\"</p><p>Actually that was my fault, I wanted to tell her but couldn't. How could I confess that I deliberately walked into him that day in the coffee shop? I sat and looked at her in the shade beneath the tree. Evelyn was perfect in every way and wouldn’t be seen dead with a guy like Jax hanging off her arm. I couldn't even begin to imagine what her parents would say. There was no place for someone like Jax in that world.</p><p>\"You said yes, didn't you?\" she sighed.</p><p>\"Yes,\" I nodded and looked away.</p><p>\"Isn't being hurt once enough?\" she asked, her voice softer now.</p><p>\"What's that supposed to mean?\" I said, looking back at her.</p><p>Placing the bottle to one side, Evelyn gently took one of my hands in hers and said, \"Mina, you’ve always been a bit of a mystery to me... I know you have your secrets, and that's cool. You've never spoken much about your life back in England, but from the little you have said, I've figured out enough to know you got hurt real bad back there. And I know a guy was involved, so don't try and tell me different.\"</p><p>I didn’t say anything back right at once. Eventually, I said, \"What makes you so sure Jax is going to hurt me?\"</p><p>\"Jax!\" she exclaimed. \"What kind of name is that? Are you sure you heard right and his name isn't really carjack?\"</p><p>\"Very funny,\" I sighed. \"But you never answered my question.\"</p><p>\"Jax will hurt you because that's what guys like him do,\" she said, fixing me with her pale blue eyes. \"He’s a dropout and so was his father, I've heard.\"</p><p>\"I know about his father,\" I said.</p><p>\"You know about his father already?\" Evelyn frowned at me. \"What, did this Jax tell you his freaking life story while he was fixing your car?\"</p><p>Realising my mistake – how could I possibly know anything about Jax's father? I said, \"It's just rumours I've heard.\"</p><p>\"They're not rumours,\" Evelyn said. \"The guy was a drunken bum.\"</p><p>\"That doesn't mean Jax is the same,\" I said, wondering why I was defending him at all.</p><p>\"The guy just wants to get into your panties, Mina,\" she warned me. \"He'll use you, just like I'm suspecting that guy back home used you.\"</p><p>\"You don't know anything about that,\" I said, standing up.</p><p>\"Only because you won't tell me,\" Evelyn said, looking up at me. \"I'm your friend, Mina.\"</p><p>\"I know you are,\" I said, trying not to be mad at her. It wasn't her fault. What happened back home was my fault. It was the pictures I had taken of my mother’s lover that had gotten me into trouble.</p><p>Trying to force a smile, I held out my hand to Evelyn. \"C'mon,\" I said. \"We should be heading back. We'll be late for class. And if you're right about Jax, then I'm in enough trouble already.\"</p><p>Arm in arm, we headed back across campus. She didn't mention Jax again or what happened back home in England. I was grateful for that at least.</p><p>Chapter Thirteen</p><p>Jax</p><p>I used my hand to wipe the fog from the bathroom mirror and stared at my reflection. I really should lose the double earrings, even though they’re pretty small. I don’t even remember getting them. It really is kind of childish. I’m 22 now, I should think about growing up.</p><p>Thinking about Mina makes me want to be a better person. Not some greasy mechanic college dropout. I can do better... can’t I? These tattoos that sleeve my arms, the ones on my chest, my shoulders... they can’t be undone. But I can change the man inside. I can stop hiding behind my grief and loss.</p><p>I looked at my hair and realized I needed it cut. I grabbed some goop from the drawer and smeared some in it to maintain some semblance of control over its unruly dark brown waves. Should I lose the goatee? I kinda like the chin-only thing. It seems to be the fad now. I think I’ll keep it. I liked the way it tickled Mina’s lips when I kissed her.</p><p>Mina.</p><p>What was I doing dating someone so classy? So classy, yet so closed off. I was damned and determined to treat her right. What was it about her that was getting to me? Yes, her voice was sexy... that accent, God, when she wasn’t talking I wanted to devour her mouth. I wanted to run my hands down the sides of her body, cup my hands on her terrific ass.</p><p>I shook my head and padded into my room to find something to wear. I still wasn’t sure if the place I’d chosen for our date would be okay, but I couldn’t think of anywhere else to take her. I had assumed she hadn’t been to Disney since moving here so I hoped she would enjoy strolling in Downtown Disney. The place was away from the rowdy clubs and bars of downtown Orlando and I wanted somewhere that we could relax and talk without the constant thrum of rock music.</p><p>No, Disney wasn’t just for kids. Downtown Disney had tons of very adult locations to eat, shop, and stroll through. With all the lights up this time of year, it could be very fun and a nice break from the daytime heat. The nights were almost magical and I really hoped she would enjoy it.</p><p>The black button-up shirt and jeans will have to do. I’ll wear my boots, but I’m sure it’ll be hot. Oh well.</p><p>I grabbed my keys and wallet from the kitchen table and walked out the door. I didn’t see Austin, and hoped he was out having fun on a Saturday night. But probably not. Probably at his parents’ house. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Crap. Truck or bike? I didn’t think she’d appreciate the bike. Maybe on date number two. Or three. Here I am contemplating more dates with Mina. I shook my head. She’d really gotten into my head and under my skin.</p><p>I opened the truck door and started it up. I’d texted her earlier and asked directions to the house where she lived with her uncle and aunt. But hadn’t it been more than that? Wasn’t I really checking to see if she was still on for our date? She had texted back her address. With a smile I shoved my cell phone into my pants pocket. As I drove to her house, I wondered how the night would end. I really wanted her, but I wanted to savor her, too.</p><p>Before I knew it, I was in front of her aunt and uncle’s house, Mina’s little blue car was in the driveway. It was a pretty nice home in the suburbs, one story with fresh paint and an immaculate lawn. I killed the engine and walked up the pathway lined with flowers. When I stepped on the porch, a security light popped on and made me jump a little. Before I could ring the doorbell, the door opened.</p> <p>“Hi,” Mina said, standing there in a pretty light blue dress and white sandals. Man, she looked incredible. I cursed myself for not bringing her some flowers or something. I was such a Neanderthal.</p><p>I smiled at her. “Hi, beautiful.”</p><p>Her face flushed red and she pushed some hair behind her ear, looking down at herself. “Come in.”</p><p>I nodded and stepped inside. I followed her to a modest kitchen where two people were standing talking.</p><p>“Uncle Rob and Aunt Claire, this is Jax.”</p> <p>I walked to Rob and shook his hand. “Nice to meet you.”</p><p>He had a firm handshake and he kept eye contact. He seemed genuine and said, “Nice to meet you, too.”</p><p>I then shook Claire’s hand. She was a lovely woman with short blonde hair and fashionable clothes. “Hello, Jax.” She had no accent.</p><p>I nodded at her and then looked at Mina. “You ready to go?”</p><p>She smiled. “Yes.”</p><p>“Have fun, you two,” Uncle Rob called in the same accent as Mina’s.</p> <p>I opened my truck door and helped her in. Once we were on the road, I looked at Mina. “So your Uncle Rob, he’s your mom’s or dad’s brother?”</p><p>She nodded. “Yes, my mother’s brother. How did you guess?”</p><p>I laughed. “The accent. Duh.”</p><p>She also let out a nervous laugh. “Oh, I guess that did give it away a bit, I suppose.”</p><p>“Oh, totally,” I replied.</p><p>We were quiet for a bit, then she said, “So, where are you taking me, Jax?”</p><p>I grinned wickedly. “It’s a surprise.”</p><p>She looked down at the radio, then back up to me. “Do you have anything besides country music?”</p> <p>“What, you don’t like my music? It’s more country-rock than anything.”</p><p>She wrinkled her nose. “Yes, well it’s quite obnoxious.”</p><p>I faked insult. “Get the fuck outta here!”</p><p>With that she laughed, and I flipped the station to some top-40 crap and she seemed to be content with a P!nk song blaring through my speakers.</p><p>When we pulled up to Disneyworld, I looked over at Mina. Her eyes were big. “You’re taking me to Disney?”</p><p>Bam! Got the desired response. Sweet.</p><p>Without answering her, I went around and opened her door. “Since seeing the whole park would take at least two full days, no, we aren’t going inside. We’re going to Downtown Disney, it’s just outside the park, with lots of restaurants and shops.”</p><p>She smiled and almost seemed relieved, and I wondered what that meant. Maybe she didn’t like crowds? The heat? I would have to ask her.</p><p>So many questions.</p><p>I hit the button on the remote to lock the truck and ushered her by placing my hand on the small of her back towards the front of a very popular restaurant called the ‘Earl of Sandwich’. It wasn’t the sort of place that would’ve needed me to make a reservation. We got in line. A very leggy blonde woman stood behind the counter. Mina looked up at the large black menu board fixed to the wall behind the woman, who stood staring expectantly at us, waiting to take our order.</p><p>“I thought you might like this place,” I said, looking at the curve of her smooth neck as she read the menu board.</p><p>“How’s that?” she asked without glancing sideways at me.</p><p>“It was the Brits who invented the sandwich, wasn’t it? And don’t you guys have lots of earls and dukes and things?” I tried to sound knowledgeable.</p><p>“Things?” And this time she did glance at me. Her lips turned up at the corners as she smiled.</p><p>“You know what I mean,” I smiled back. “Princes and Princesses and Queens.”</p><p>“Just the one Queen,” she laughed softly.</p><p>“I knew that,” I said, fearing that she might think I was some kinda dumbass. “I just thought it might make you think of home – you know.”</p><p>“I know,” she smiled at me, her right hand gently brushing against mine. Was that accident? I hoped not. I let the back of my hand linger against hers until she moved her hand away and pointed up at the board. “I’ll have the grilled cheese sandwich and some crisps.”</p><p>“Crisps?” I asked. Was that English for something else?</p><p>“That’s what we call chips back home,” she said, glancing at me again.</p><p>“So what do you call fries?” I asked her.</p><p>“Chips,” she said with another teasing smile.</p><p>“But isn’t that what you just said?” I frowned.</p><p>“No,” she said with a gentle shake of her head. “Fries are chips in the UK, and chips are fries.”</p><p>I looked at her, my mind beginning to scramble. It was like trying to solve some freaking word game. Then with a shrug, I looked at the woman still waiting to take my order and said, “I’ll have the same.”</p><p>With a slight roll of her eyes at me, she turned and fetched our order. I paid, then plucked up the tray that our food had been placed on.</p><p>“It’s warm tonight,” Mina said, as she watched me peer through the throng of tourists in search of a table to sit at. “Let’s sit outside.”</p><p>“Sure,” I said, heading for the door.</p><p>Mina followed me outside, an easy breeze causing the hem of her light blue dress to whisper about her tanned thighs. God, they looked so freaking smooth. I pushed the thoughts of them locked tight around my back from my mind and sat down opposite her.</p><p>Mina reached for her sandwich and removed the wax paper it had been wrapped in. There was a wide, open space in front of the restaurant where a DJ had set up. He was playing cheesy pop music and encouraging those strolling past to stop and dance for a while. Some did, others just stood and watched, swaying from side to side in time with the music. There was a fun atmosphere in the air. I watched Mina take a small bite of her sandwich. Her eyes reflected the flashing neon lights attached to the front of the DJ’s decks. She chewed her sandwich slowly and thoughtfully as if there was something on her mind.</p><p>There was so much I wanted to ask her. But my mouth turned dust dry. God, I’ was behaving like I’d never been on a date before. I had, but they had always been uncomfortable, kinda like now. This is why I preferred casual hook-ups with the female form. All this prim and proper bullshit just wasn’t me. But yet here I was; I’d even instigated this date and I couldn’t form one coherent word.</p><p>Chapter Fourteen</p><p>Mina</p><p>“What are you thinking about?” I heard Jax ask.</p><p>“Huh?” I whispered, looking away from those dancing before the DJ. At least twenty people now, mainly kids, were dancing to the music being played. There was a party atmosphere.</p><p>“You look lost in thought,” Jax said, unscrewing the cap from the bottle of Coors he had bought with his sandwich.</p><p>“I’ve been here before,” I said, looking back at those who swayed and twirled before the DJ. They clapped their hands and laughed. They looked happy.</p><p>“On a date?” he asked, tilting his head back and gulping from the bottle. I watched his Adam’s apple bob up and down as he drank. He looked at me and armed beer from his goatee.</p><p>“I was with a guy, as it happens,” I said. Was Jax the possessive type? I doubted it very much, as I recalled the many girls I had seen him lead through his front door as I spied on him from the shadows.</p><p>“Anyone, I know?” he asked casually enough, but I sensed perhaps it bothered him.</p><p>“I doubt it,” I said thoughtfully, looking back at the dancers. Their number had grown. “He’s dead now.”</p><p>“Dead?” Jax said, nearly choking on a mouthful of sandwich.</p><p>“My father,” I told him. “He brought me here once when I was a girl. About nine, I think I was at the time. We came over to see my uncle. Summer holiday, that sort of thing. We only came once, but I’ll never forget.”</p><p>“I’m sorry,” Jax said, placing his half-eaten sandwich down onto the greasy-looking paper.</p><p>“Sorry?” I said, glancing across the table at him.</p><p>“You know, about your dad dying,” he said, looking uncomfortable. I could tell he was trying to be compassionate but struggling to find the right words. I sensed that beneath his tattooed and hard-looking exterior, he probably had a softer side. Perhaps I would find out.</p><p>“That’s okay,” I lied and looked back towards those dancing in the square. The fact that my father had died so early on in my life wasn’t okay. I had been left with my mother. She hadn’t waited long to start sharing my father’s bed with another. The bed she would catch me in with...</p><p>“Do you wanna talk about it?” Jax asked.</p><p>I looked into his dark eyes. There was a kindness in them or perhaps it was empathy? “No,” I said, picking up my sandwich again and taking a bite. I watched the dancers again, their cavorting forms cast long, tangled shadows on the concrete, they looked like black flames licking and writhing against one another.</p><p>“Perhaps bringing you here was a bad idea,” Jax said, pushing his chair back and standing up. “We can go someplace else.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His black leather boots made a creaking sound. “No, I’m glad you brought me here. The memories I have of my father are very special to me. I’ve thought about coming here once or twice before since returning to the States, but could never muster up the courage – if that makes sense?”</p><p>“Perfect sense,” he whispered, pulling up his chair and sitting down again.</p><p>“How?” I asked, although I already knew the answer. I knew a lot about Jax already.</p> <p>“How what?” he asked right back.</p><p>“How do you know it makes perfect sense?” I said, looking at him. It was then I saw that flicker – smudge – over his right shoulder. It was like someone had dragged a wet thumb over those holiday makers sitting and eating at tables behind Jax and blurred them out of existence. I blinked and then opened my eyes again. The blur had gone and those people were back in focus.</p><p>Instead of answering my question, he asked one of his own. “Why do you always seem so distracted, Mina?”</p><p>“Do I?” I said, reaching down and taking my phone from my handbag, which sat beneath the table between my feet.</p><p>“Yeah,” he said, glancing quickly over his right shoulder, then back at me. “It’s like you’re looking for someone the whole time.”</p> <p>“I’m sorry,” I said, my heart speeding up just a little.</p><p>“It’s like you’re scared you’re being watched,” he said, as if joking, but I knew he wasn’t. If only he knew it was me who was watching him.</p><p>Beneath the table, and out of Jax’s sight, I switched on my camera phone. My heart quickened. I couldn’t be caught by Jax, but I needed another picture of him. Curling my fingers around it, I inched my iPhone over the table edge and faced it towards Jax. I tried not to look down at my phone and to keep my eyes fixed on him. I gently pressed the record button with my thumb and prayed that he was not only in focus, but in shot, too.</p><p>“No one’s watching me,” I said with a smile, which I hoped didn’t look too fake. “I’m just nervous that’s all.”</p><p>The view over Jax’s shoulder blurred again, like I had a tear in my eye throwing everything out of focus.</p><p>“Nervous of what?” Jax frowned. “Of me?”</p> <p>“No,” I said with a shake of my head. “Not you.”</p><p>“Then what?” Jax asked, reaching across the table and taking my hand in his. His hands where rough and strong. He gripped the hand that held the phone.</p><p>“You’re trembling...” he started. Jax looked down at our joined hands.</p><p>I looked at him.</p><p>He slowly uncurled his fingers from around mine and the iPhone. “And you always have your phone in your hand,” he whispered.</p><p>Jax looked into my eyes and they looked kind of sad.</p><p>I slid my phone back beneath the table.</p><p>“Who are you waiting to call?” he asked, his eyes never leaving mine.</p> <p>“No one,” I whispered, secretly turning off the camera. I couldn’t risk him discovering I had been secretly filming him.</p><p>“The same person you keep looking out for?” he said.</p><p>“No...” I stared.</p><p>The music and dancing continued all around us, but it seemed muffled now, like someone or something had thrown a cloak over the world.</p><p>“That’s why someone like you is with someone like me tonight,” he said, and that sadness left his eyes and now darkened with a look of mistrust – like I had tricked him somehow.</p><p>“Is it your friends – the others you were with the other day in Starbucks?” he said, glancing back over his shoulder and into the throng of dancers. “Are they hiding in the crowd somewhere having a laugh at you with me?”</p><p>“No...” I tried again. He had the wrong idea about me and why I had the phone in my hand.</p><p>With his face hard-looking, and eyes so dark they shone black, he said, “Do I freaking amuse you, Mina? Is this why you’ve come out with me tonight? Is that why you were in Rowdy’s the other night? You followed me there with your friends...”</p><p>“Why would I do that?” I gasped out loud.</p><p>“To watch me make a fool of myself, that’s why,” he said, pushing his chair back and standing again. “Rich little bitches having a laugh at the grease-monkey who was dumb enough to believe that someone like you might really like me.”</p><p>“No...” I tried again, and at that moment the music stopped.</p><p>“I know what people like you think about my kind,” he said, pushing his chair back beneath the table. His half full bottle of Coors wobbled then fell over, spilling its frothing contents across the table. “You think I’m a dropout. Well, you’re right. I am a dropout, but I only dropped out ‘cause of people like you.”</p><p>“What’s that meant to mean?” I said, desperate to convince him he was wrong about me.</p><p>He stared at me, running one of his strong hands through his wild hair. Then, taking a deep breath, Jax said, “Tonight was a mistake, but I hope you and your friends have seen enough to get your kicks.”</p><p>The music started up again. This time it was slower as the DJ began to wind the crowd down. Turning his back on me, Jax headed away from the restaurant and through the dancers who had now taken partners in their arms and were swaying against each other to the song Beneath Your Beautiful by Labrinth.</p><p>“Jax,” I called after him. “Jax!”</p><p>He continued to walk away from me.</p><p>Sliding my iPhone back into my bag, I picked it up and raced through the crowds and after Jax. I weaved my way through those dancing all around me.</p><p>“Jax!” I called over him, my voice turning hoarse over the sound of the music.</p><p>He didn’t look back. Halfway across the square, I reached for him. I gripped his arm. With all my strength, I pulled him around to face me.</p><p>“Jax,” I gasped, trying to catch my breath.</p><p>“Go away, Mina,” he said, yanking his arm free.</p><p>“I can’t,” I breathed, leaning forward and pressing my lips against his.</p><p>Letting my bag drop from my shoulder to the ground, and with eyes closed, I wrapped my arms around Jax’s neck and pulled him close as I kissed him. I felt the rough of his goatee against my chin as his hands gripped my hips. He kissed me back and pulled me close as Beneath Your Beautiful played all around us.</p><p>Chapter Fifteen</p><p>Jax</p><p>I couldn’t breathe. The anger seething through my body seemed to start at my toes and explode out of my mouth. I could feel my face turning red. I was so angry as I’d stormed off. But now my face and hands were tingling with increased blood flow and heat, but not in anger – in excitement. The blood was flowing elsewhere, too, and I knew she could feel my excitement against her stomach.</p><p>But I didn’t care.</p><p>As the pain of fury started to melt into the hot pools of desire, the shock of her kissing me also began to dissipate into pure need. I couldn’t get enough of her soft mouth, her urgent tongue, her hands all over me. It was hot outside and I’m fairly sure we raised the temperature around us about ten more degrees. I dug my fingers into her hips and pulled her closer. I wanted to consume her.</p><p>The music continued to play all around us as she swayed against me, and my spinning head began to float back down to Earth. I slowly pulled away from her and stared into the pools of her blue eyes.</p><p>“Why did you do that? I’m mad at you,” I whispered, gasping for air.</p><p>“No, you’re not,” she insisted, and her eyes trailed down to my zipper as if to remind me.</p><p>I pulled my arms from her and slid them down her arms, grasping her hands. “Why can’t you just tell me what’s going on with you? What’s with all the secrets?” I couldn’t believe she had completely disarmed me with one kiss.</p><p>She gently removed herself from my grip and absently hugged herself, turning away from me. “I can’t.”</p><p>I slowly spun her back to face me and moved a strand of blonde hair from her eyes. “Yes, you can. C’mon, let’s go and finish our dinner. I think you still had some chips, uh, I mean crisps, or...”</p><p>She shook her head. “I’m not hungry anymore.”</p><p>I chuckled. “Can I at least go pay for it?”</p><p>She raised her eyebrows. “You paid for it at the counter.”</p><p>Damn. “Ok well let me at least tip the waitress.”</p><p>“We didn’t have a waitress.”</p><p>“Okay, I give up. I’ll take you home,” I said, calling her bluff, grabbing her hand to lead her toward my truck. I knew she didn’t want to go back into the restaurant – perhaps because of the memories it had instilled in her.</p><p>Smooth move, Jax. Definitely not taking her back there. Ever.</p><p>She shook her head and picked up her handbag from the ground. “I don’t want to go home. Let’s go someplace else.”</p><p>“Where?” I asked.</p><p>“Think of something,” her eyes smiled back at me. “It was you who asked me out on a date, remember?”</p><p>How could I forget? Was I now regretting asking her? I didn’t know. I liked Mina – I liked her a lot. But there was something – just something about her that didn’t feel right. Was that what I liked? Was it more than her cool accent, long blonde hair, and tight little ass that had me intrigued? My like for her was more than her pretty looks. If I’d really wanted to, I could give her the slip, head for Rowdy’s, and be up to my nuts in guts before closing time. But there was something else to Mina and I was hooked.</p><p>“So?” she said, eyeing me. “Where to next?”</p><p>Taking her by the hand, I led her towards the parking lot and my truck. “We’ll figure something out,” I said.</p><p>My truck had a mind of its own, I swear. It was like it took us back to my house without any choice of my own. I suppose I was on auto-pilot as Mina started to open up a little on the truck ride home. She stayed on her side of the bench. What she said was mostly small talk about school and her family in England, but it was a start. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Any brothers or sisters?” I asked, looking straight ahead.</p><p>“Nope,” she said, “just me.”</p><p>“And your mother...?” I gently pushed.</p><p>“What about you, Jax?” she suddenly turned the questions onto me.</p> <p>“What about me?” I shrugged behind the wheel.</p><p>“What about your family?” she asked, staring sideways at me in the gloom of the cab of my truck.</p><p>Being hit with such a straight question kinda put me on the back foot and part of me now appreciated why Mina had been so reluctant to talk about her own past. We all had ghosts hiding someplace, I guessed.</p><p>“My mother died when I was younger...” I started.</p><p>Without offering the usual sympathy that you might expect when telling someone that your mother had died, Mina seemed to skip over this as easily as brushing hair from her eyes and said, “What about your father?”</p> <p>I glanced at her, sitting beside me on the bench. The passing glare of headlamps and streetlights gave her face a warm orange glow in the dark. She was staring at me. “He’s missing,” I said, looking front again. I didn’t want to talk about him.</p><p>“What does that mean?” she asked, seeming to not want to let the subject drop.</p><p>“You know, gone...” I started.</p><p>“Gone where?” she jumped in.</p><p>“Does it matter?” I shot back, pressing my foot against the accelerator and speeding up.</p><p>“It would matter to me,” Mina said, her eyes watching me as if examining every one of my facial expressions, however slight.</p> <p>“He was a drunk, okay?” I said, my fingers tightening around the steering wheel – knuckles glowing white. “When my mother died, he hit the bottle – he hit it so damn hard that he ended up drowning in the stuff...”</p><p>“Drowning?” Mina whispered, then frowned.</p><p>“It’s a figure of speech,” I told her. “Anyway, it doesn’t matter now. He hit the road and hasn’t come back. The police aren’t interested... why should they be? He was just a bum.”</p><p>“Do you believe that?” Mina asked.</p><p>Taking a deep breath, I shook my head and slowed the truck. “No, I don’t believe that. He was just hurting, that’s all.”</p><p>I felt Mina’s hand settle lightly on my thigh. “I’m sorry,” she said.</p><p>“For what?” I asked, looking down at her hand, then back at her. I stopped the truck.</p><p>She looked at me, and said nothing at first. Then glancing over my shoulder again like she had so many times before, she smiled and said, “What are we doing back at your place, Jax?”</p> <p>I glanced back over my shoulder at the house I rented with Austin. “How do you know I live here?” I asked, looking back at Mina.</p><p>“I recognised that death trap you call a motorbike, parked in the drive,” she smiled at me.</p><p>I looked at her with an amused expression. “Do you want to come inside?”</p><p>She stared back at me as if she was fighting a war inside herself. I’d seen the expression before in other girls. They want to, but they don’t want to seem too eager or easy. Although in Mina’s case, I would never think that of her. After that kiss earlier, I definitely wanted to continue it in a more... private setting.</p><p>But did I really? Did I want to risk sleeping with this girl and then things going badly like what had happened with the other brief ‘relationships’ I’d had in the past?</p><p>I guess it was me who was fighting the internal war.</p><p>She finally smiled at me. “Sure, I’d love to.”</p><p>As I went around to open her door, as I was now used to doing, I set the alarm and led her up the path to my small house. My hand was almost shaking as I put the key in the lock and prayed to the gods that Austin was still out.</p><p>The house was in pitch darkness, and as I flipped on the light, I realized the house was empty. I let out a breath.</p><p>“Uh, do you want something to drink?” I asked her as she looked around the house. Thankfully it was clean today, which wasn’t always the case. Austin always picked up after himself. I was the one who had to be more disciplined.</p><p>“Do you have any wine?” she asked sincerely.</p><p>I wanted to laugh. Wine, was she joking?</p><p>I smiled at her, chagrined. “Ah, no, sorry. I’ve got beer and a few bottles of the hard stuff.”</p><p>“Oh,” she said, as if trying to decide.</p><p>I watched as she set her purse down on my couch, but grabbed her iPhone from it, holding it tightly in her fist.</p><p>“Here,” I said, going to the cabinet and pulling out some tequila. “Just have a shot, make it fast.”</p><p>She wrinkled her nose at me. “Tequila? Ew.”</p><p>This time I did laugh. “Or not...”</p><p>I pulled a Blue Moon beer from the fridge and popped the top off and took a swig. I could see she was watching me closely so I went over to her.</p><p>“You sure you don’t want some?” I whispered, pressing the bottle to her lips, swiping the tip of the bottle against first her top lip, then her bottom lip. She offered no resistance, but instead, stared up at me unblinking, refusing to break eye contact. I watched as her tongue snaked out and licked the round top. As I began to tip the bottle into her mouth, I had my other hand on her upper arm, gently rubbing my thumb along her soft skin. Just as the bitter, foamy liquid was about to slide into her mouth, she pushed the bottle away and kissed me again.</p><p>Chapter Sixteen</p><p>Mina</p><p>The bottle of beer that Jax had held to my lips fell from his hand and dropped onto the carpet. I could hear the glug-glug sound as the foamy contents poured from the neck of the bottle and onto the carpet. Jax either didn’t hear it or wasn’t bothered. He kissed me back. In fact, it was more than just a kiss – it was like he was devouring my mouth. He pressed his lips hard over mine and I gasped for breath as his goatee brushed against my chin and along the side of face. With his tongue exploring my mouth, I felt his strong hands work their way down the length of my spine and settle on my arse. His lips pulled away from mine as he kissed my neck and then took my right earlobe into his mouth. He nibbled the soft flesh with his teeth. I shuddered at the feeling of his hot breath against my neck. He worked his hands down over my arse. His fingers lifted the hem of my short blue dress and I felt his fingertips knead my buttocks. Snaking my arms around his neck, I pulled Jax close and caught the faint whiff of engine oil and grease mixed with the heady scent of aftershave leak from him. The odd mixture made my head spin as he forced me down onto the sofa. He leant over me, and I looked up into his dark eyes.</p><p>There was a long pause as we looked at each other. My heart raced in my chest and I felt giddy.</p><p>“Is this what you want?” he said, slipping one of his denim clad thighs between my mine and gently easing them apart. I offered no resistance.</p><p>I thought of the stream of other girls I’d seen him lead into his house over the last few months. I felt a sudden pang of jealousy. Why should I be jealous? Jax hadn’t been mine then. Was he even mine now? Was I just another one of the many girls he had bought back here? Would I be creeping out before dawn, carrying my shoes in one hand and my panties in the other?</p><p>“I want you,” he whispered, leaning close and tugging at his shirt.</p><p>I’d heard that before. That’s what the other had said to me as he had lowered me onto my mother’s bed.</p><p>I stared up at Jax as he reached up and pulled his shirt over his head. I gripped my phone tight in my fist as if it was some kind of a lifeline – something that would pull me to safety if it all went wrong like it had before. Jax leant over me, now stripped to the waist. His body was something close to one of those statues I’d seen in the art museums back home in London. The muscles covering his stomach looked as if they had been chiselled from stone. His left nipple was pierced, and the silver stud glinted in the dim light from the nearby table lamp. Jax’s sculptured chest and round shoulders were covered in a maze of crisscrossing tattoos. I could see what looked like black angel wings on his chest, snakes and serpents coiling around his muscular upper arms. The sight of his body turned me on and I did want him, but those lingering memories of what had happened to me before – the trouble it had caused – came flooding back in a wave. I closed my eyes, as I tried to push them back into the corners of my mind. Reaching out, I let my fingertips bump over the taut muscles covering Jax’s stomach. I felt him shudder at my touch. His hands were on my thighs as he ran his rough fingers up towards my panties. I ran my hands up the length of his back, pulling him over me. It was like I was using him as some kind of shield – protecting me. I felt his breath against my neck, and that musky smell of his seemed almost intoxicating. I felt one of his fingers hook aside my panties and slip between the soft silk of the fabric and my skin. His knuckle brushed gently against me, which sent my nerves tingling. I felt a sudden urge to give in to him – to let Jax take me and treat me as his own. But I wanted more than that. I wasn’t going to be another one of his quick fucks. I didn’t want him to tell me that he loved me or anything like that. My mother’s lover had once told me he’d loved me – but he hadn’t really. That had been a lie which I had been naive enough to believe. I just wanted Jax to respect me, but would he if I gave in so easily to him? I wanted something steady in my life for once. I didn’t want to make the same mistakes I had made before. That had cost me my relationship with my mother. But would Jax respect me if he knew my secrets? If he knew my past? If he knew my future? The secret I kept wasn’t just going to go away, and if Jax became a part of my life – my secret would become part of his, too.</p><p>“I’m so fucking hard for you,” Jax whispered in my ear, pulling down my panties.</p><p>I opened my eyes and could see the lust in his eyes as he watched my white panties slide slowly over my tanned knees. He was looking down between my open legs. I suddenly snapped them shut and grabbed hold of his wrists to stop him pulling down my panties any further.</p><p>“Stop,” I breathed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jax snapped his head up and looked at me.</p><p>“I do want you, Jax, but not now, not here... not yet... it’s too soon,” I said, pulling my panties up and swinging my legs over the side of the sofa.</p><p>“Did I do something wrong?” he asked, his voice more concerned than angry.</p> <p>“No, it’s not you,” I said, standing up and straightening my dress with the flats of my hands. “You haven’t done anything wrong.”</p><p>“Then why stop? We were having fun, weren’t we?” he asked, standing before me.</p><p>“I just... can’t,” I said, dropping my head so I didn’t have to look at him.</p><p>“Why?” he said. “Is it because we’re here? Are you worried that my roommate might come back? Because if it is, we can always head for the bedroom...”</p><p>“It’s not that,” I said. “I just don’t want to be used...”</p> <p>“I’m not gonna use you,” Jax said.</p><p>“No?” I said, lifting my head to look at him. How did I tell him that I knew about all the other girls he had brought back here? How could I tell him I had seen those other girls leave in the early hours of the morning, their panties poking from their jacket pockets? I didn’t want to be one of them. But if I told him, then he would know I’d been watching him. I couldn’t let him know that I’d been spying on him all this time. “How do I know you won’t just screw me then forget all about me?”</p><p>Picking up his shirt from off the floor and putting it back on, Jax looked at me and said, “Okay, so I’m not a monk and I’ve been known to fool around in the past, but that doesn’t mean that if I meet someone I really like, then I can’t have...”</p><p>“Like?” I cut in. “You just like me?”</p><p>“Look,” Jax sighed, reaching down and picking up the overturned bottle of beer. “I could say that I love you, but that would be just a bunch of bullshit. I like you enough not to feed you that crap. But I do know one thing for sure, and that’s if I didn’t like you, then I would have kicked your crazy arse down the street already.”</p><p>“So you think I’m crazy?” I said, feeling suddenly hurt.</p> <p>“I think you’ve lost your freaking mind,” he smiled, then swigged down what was left in the beer bottle.</p><p>“Just take me home,” I said, turning towards the door.</p><p>Before I’d gone two steps, Jax had taken hold of my arm and pulled me around to face him. “I like crazy,” he said. “You’re like no girl I’ve ever met before. I don’t know if all the girls in England are like you, but if they are, then it’s one fucked up place.”</p><p>“I’m not fucked up,” I said, pulling my arm free.</p><p>“No?” Jax asked.</p><p>I stopped at the door, my back to him.</p><p>“There is something crazy about you, Mina, and it drives me crazy, too,” he said. “I’m gonna find out what ever it is.”</p><p>“Is that why you’re hanging around?” I said, glancing back over my shoulder. “As soon as you find out my secret you’ll be gone?”</p> <p>“I love secrets,” he smiled, the empty bottle of beer swinging from his fists.</p><p>“You might not like this one,” I whispered, looking away.</p><p>“Why don’t you let me be the judge of that, Mina?” he said.</p><p>Turning back, I looked at him. “Will you take me home now?” I asked.</p><p>“Will I ever see you again?” he asked, placing the bottle down and coming towards me.</p><p>“My uncle and aunt are going to their lakeside cabin this weekend,” I said, looking at him. “I’ll cook you dinner if you like?”</p><p>“I like,” he smiled, pulling open the front door.</p><p>He led me down the front path, and smiling to myself, I suspected that I was the only girl he had ever driven home once they had been inside his house. I switched off the video camera on my phone and slipped it into my bag. I would watch Jax back at home, alone in my room.</p><p>Chapter Seventeen</p><p>Jax</p><p>This girl was making me crazy. I had to adjust myself several times and change the subject to get my pants back to a comfortable fit.</p><p>Down, boy.</p><p>I couldn’t believe she acted like she was game and then suddenly changed her mind like that. Doesn’t she know what that does to a dude?</p><p>But like I’d told her – she was crazy. Crazy and insane, but in a good way. I was tired of boring girls who drank too much, giggled and flirted with me in bars, then ran their perfectly manicured fingernails over all my tattoos and piercings, then just spread their legs without so much as a challenge.</p><p>This... thing I had with her... I couldn’t define it. She was stubborn and opinionated and held some seriously deep, dark secrets that I was damned and determined to get to the bottom of. Out of all the things I knew about her, I had concluded they had something to do with her mother. She never wanted to talk about her. She seemed to like her aunt and uncle okay, and she had no siblings to speak of, and her father was gone. She had barely been out of high school, or whatever they call it over there, when she came here to go to college, so this secret must have something to do with her mother.</p><p>And the way she’d pressed me about my father. What was up with that? I think Mina had some deep-seated issues and I was gonna get her to tell me. I was also bothered by that damn phone she couldn’t seem to let go of. Sometimes I wondered if she had a boyfriend on the side – or three – and didn’t want to miss any texts. She was way too pretty to not have a few male admirers. I wanted to be the only one, though.</p><p>I was determined to be the only one.</p><p>It was a long, silent ride back to her aunt and uncle’s house. Before I realized it, I was pulling up out front. The warm, quiet night cloaked us as I looked around the quaint, silent neighborhood then back at her.</p><p>“Well, thanks for a nice night,” she said, sliding some hair behind her ear, a nervous habit of hers I’d noticed she had.</p><p>I smiled slightly at her and memorized her pretty face. She batted big blue eyes at me and waited for a response.</p><p>Say something, stupid!</p><p>“Let me walk you up.” I jumped out and went around to open her door.</p><p>She smiled as I helped her out. “Thank you.”</p><p>I walked her to the dark porch and a security light popped on as it detected us. I was hoping for darkness to kiss her, but I guessed now the neighbors would get a show.</p><p>I wrapped her in my arms and inhaled her hair, which smelled like vanilla. When she looked up at me, there was something in her eyes I couldn’t quite decipher. Apologetic? Guilty?</p><p>“What’s wrong?” I asked.</p><p>“Do you really want to see me again?” she said after a moment’s hesitation.</p><p>I nodded. “Yes. I’m not that much of a dick, Mina. I can wait... if that’s what you’re comfortable with. You’re just so sexy...” I ran my hand down to her ass again.</p><p>She giggled. “Thank you, Jax.”</p><p>I leaned down and kissed her soft lips once again and felt her arms snake around my neck. She then ran her hands through my too-long hair and I groaned into her mouth and kissed her harder. When I pushed my tongue into her mouth, she did the same and I slid my hands up from her ass up her back, and then back down.</p><p>She pulled away from me, gasping. “See you next weekend, right? We’ll have the house to ourselves.”</p><p>I looked at her flushed cheeks and bright, hopeful eyes and nodded. “Absolutely.”</p><p>“Goodnight, Jaxon.”</p><p>I smirked at her. “Goodnight, Mina...”</p><p>And as I turned to leave, it dawned on me that I didn’t even know her last name... and I’d almost slept with her.</p><p>Half the girls I’d been with I didn’t even remember their first names, so I’m not sure why that thought even popped into my mind.</p><p>I smiled as I watched her front door close and I drove off, rumbling loudly through her quiet neighborhood, wondering what exactly she had in mind for next weekend in a big, quiet house we’d have all to ourselves.</p><p>Chapter Eighteen</p><p>Mina</p><p>I waited for Jax to drive away. When the sound of the engine faded into the distance like the rumble of thunder, I closed the front door. The hallway was in darkness. Not wanting to wake my uncle and aunt with the sound of me climbing the stairs, I kicked off my shoes. Picking them up, I made my way up to my room in darkness. I switched on the bedside lamp and pulled my phone from my bag. I slipped out of my dress, letting it flutter to the floor. In just my panties and bra, I sat crossed legged on my bed and retrieved the video footage of Jax.</p><p>It was barely visible, as it had been recorded in the lamplight in Jax's front room. But still, I could just make him out as he leaned over me. The shot then seemed to tip over onto its side as Jax kissed me. I could hear our heavy breathing on the soundtrack. I watched the shot of the back of Jax's head where I'd been clutching the phone as we kissed, my arms laced around the back of his neck. Jax then suddenly came back into shot and I flinched, nearly dropping the phone from my hand. It appeared that just for a fleeting moment, Jax looked right out of the camera at me. The image on the screen then shook as if Jax's house had been caught in some kind of storm. Then the ceiling came into shot. I realised this was when Jax had pushed me back down onto the sofa. He came back into shot again as he lent over me. My knees appeared and I could just make out in the gloom the sight of Jax pulling my panties down over my knees. I saw my knees clamp shut and heard myself say stop. I could see the look of disappointment etched on Jax's face. I turned off the camera. I didn't need to see any more. Had I been mean to Jax by stopping short? I had wanted him, too, but just couldn't. I needed to know that I could trust him. Not only for my own self-respect, but because of the secrets I would inevitably have to confide in him if I were ever to have a meaningful relationship with Jax.</p><p>When I had first set out to watch – spy – on Jax, I had no idea that I would develop any kind of feelings for him. That had never been my intention. At first I had been put off by the lifestyle he chose to lead. But as I continued to follow him – to watch him – I learnt that, like me, we all made mistakes in life. I got the feeling that Jax had gone looking for love but like me, I guess he had been looking in all the wrong places. Watching him, I had learnt that you find love when you least expected to. But whatever happened between me and Jax, I didn't want to get hurt again. Was that possible? From the moment you fell in love, weren’t you just opening yourself up to a world of pain at some point? That had been my experience. I could tell Jax was hurting, too. I could see it in the pictures and the secret recordings I had made of him. His pain hung about him like a shadow. Would it be possible for Jax and me to have a relationship where neither of us got hurt and both of us came out otherwise unscathed? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I guessed I would never know unless I found the courage to give myself to him. But first I would have to tell him my secrets. But to do that, I would have to know once and for all that I could really trust him.</p><p>Sitting on my bed in the moonlight that crept in through my open curtains, I emailed myself the pictures and video footage I had of my date with Jax. I would print the pictures out tomorrow before class and add them to the many others of him hidden behind the picture of London. With the last of them emailed to myself, I switched off the bedside lamp. Clutching my phone in my hand, I closed my eyes and rested my head against the pillow. As sleep took me, I had an idea of how I could prove once and for all that I could trust Jax with my heart and my secrets.</p><p>I was up early the next morning. After showering and sharing a brief breakfast with my uncle and aunt, I printed off the best pictures of Jax and tacked them to the wall with the others. The last of them I tucked into the pocket of my jeans and set off for college. It didn't take me long to find Heather Findley. She wasn't one of my closet friends, but we had hung out one or twice since my move to the States. Heather was one of those girls who was always up for anything and always in search of some fun. One reason why I had kept her at arm’s length – she was far too wild for me. I had left those days behind me back in the UK. When I caught up with Heather, she was staring into the restroom mirror, covering her pouting lips in bright red lipstick.</p> <p>\"What do you think?\" she asked, turning to face me with a smile.</p><p>I couldn’t help but notice her bleached white teeth had some of the lipstick smeared on them. I didn't want to point this out.</p><p>\"Very nice, Heather,\" I smiled.</p><p>She was a real pretty girl and I never understood why she felt the need to cover her natural good looks underneath a ton of makeup. Maybe I would take a photograph of her one day and find out.</p><p>\"Aw, you're such a sweetie, Mina,\" she beamed, turning back to the mirror where she continued to preen herself.</p> <p>I stood and watched her empty half a can of hairspray into her white-blonde hair. She backcombed her wild mane with a brush. Sensing that I was watching her, Heather turned to look at me again.</p><p>\"Are you okay, Mina?\" she asked with another bright red smile.</p><p>\"I was wondering if you could do me a favour, Heather?\" I asked.</p><p>\"If you want to copy my English paper then you're out of luck, I'm six papers behind already this year,\" she started to explain. \"I should be asking to copy yours.\"</p><p>\"No, it's nothing like that,\" I said, then explained how I had met this guy who I was kinda hung up on. At the mention of a guy, I had Heather’s full attention. I explained how I had been told by my own friends that Jax would use me like he had so many other girls. I told her how I hoped it would be different between me and Jax but I needed to know for sure. I confided in her how I was scared of making a fool of myself and getting hurt.</p><p>\"So how can I help?\" she asked, plucking a bottle of nail polish from her bag and working on the tips of her fingers.</p> <p>\"Jax works in that little auto repair shop on the other side of campus,\" I explained. I fished the picture I had taken of him from my pocket and handed it to her.</p><p>Heather eyed it briefly, then handed it back to me.</p><p>\"I was wondering if you would go to the auto shop, make out you have a problem with your car. Flirt with him a bit... offer him your phone number... see if he takes it... if he calls...\"</p><p>\"Set a honey trap you mean?\" she said, glancing up from her fingernails at me.</p><p>\"Yes,\" I said flatly. There was no point in denying it.</p><p>Heather looked at me, then said, \"Why me? Why not ask one of your other friends?\"</p><p>\"He knows them, or at least he has seen me with them in the coffee bar,\" I said. \"If he was to recognise one of them, he might suspect a trap.\"</p><p>\"And what if I do flirt with this guy, give him my number, and he takes it... he calls me?\" Heather asked, sounding more serious than I had ever heard her sound before.</p> <p>\"Then you would have saved me from a world of pain,\" I said.</p><p>Heather just stood and looked at me, hands on hips.</p><p>\"I just need to know that I can trust him,\" I almost pleaded with her, and hated the desperation in my voice.</p><p>\"What did you say this dude’s name was?\" she sighed, throwing the bottle of nail polish back into her bag.</p><p>\"Jax,\" I whispered.</p><p>\"What kind of name is that?\" she smirked, heading for the door.</p><p>\"Hey, Heather,\" I called after her.</p><p>\"Huh?\" she said, looking back.</p><p>\"Thank you,\" I said.</p><p>\"I should be thanking you,\" she smiled.</p><p>\"What for?\" I asked.</p><p>\"For letting me copy your English papers,\" she said. \"I’ll call you.\" Then she was gone.</p><p>Alone in the restroom, I went into one of the cubicles. Swinging the door shut, I sat down. Had I done the right thing setting a honey trap for Jax? I guessed I wouldn't know until Heather called me.</p><p>Chapter Nineteen</p><p>Jax</p><p>I thought about Mina all week at work. I could hardly keep things straight as I repaired car after car. Thankfully the work week was easy and I had just a bunch of tune-ups and general maintenance to do to these pain-in-the-ass Swedish cars. My dad would shake his head at me if he knew I was working on foreign cars and not good ol’ American cars without computers for engines, I thought to myself and smiled.</p><p>My father.</p><p>Where in the hell was he? The thought that he was dead somewhere was one I didn’t want to entertain. But what was the alternative? That he had abandoned me and took off to Canada or something and started a new life? James “Trick” McElvoy, despite his catchy nickname – earned in the boxing ring in high school by fighting dirty – was not that crafty. No, he worked, he came home, he drank ‘til he passed out, and then got up the next day and did the same thing. I don’t think he even knew how to log in to a computer or use the Internet. He eked out a meager, simple existence and me and that bottle of Jack Daniels were at the center of it.</p><p>So where in the hell was he?</p><p>“Jax, customer up front,” I heard Jennifer’s voice announce through the garage’s loudspeaker.</p><p>I banged my head on the hood of the SUV I was working on and swore. I released the latch and let the hood fall down hard with a satisfying slam.</p><p>I rubbed the top of my head and turned the greasy doorknob. I looked at Jennifer in her skin-tight frayed jean shorts and orange Harley Davidson tank top and smiled.</p><p>“Customer,” she smiled through her gum and pointed. She flicked her long dark hair behind her and went back to playing on her phone.</p><p>I looked over to see a very pretty blonde standing in the lobby. Her hair was so blonde, it was almost white, like one of those Playboy chicks from that TV show. She looked tall in a miniscule white skirt and her tanned legs were poured into a pair of very high-heeled silver sandals. She was showing more cleavage than should be legal, and she was smiling at me with perfect, white teeth.</p><p>“Are you Jax?” she asked, flicking her eyes to the stupid nametag patch on my greasy-ass uniform shirt.</p><p>“Yeah?” I answered, trying to play it cool.</p><p>She pointed behind her. “My car is making a noise, and I was told to ask for you.”</p><p>“Really? By who?” I asked.</p><p>“This guy Trent in my History class,” she replied.</p><p>I looked behind her to see a small gold Lexus sports car. We normally only work on Volvos here, but hey, I wasn’t going to be judgmental. The girl seemed like she really needed help.</p><p>I laughed to myself. “Pull it around to the bay and let’s take a look.”</p><p>She nodded and gave me the once-over, her eyes lingering a little too long on the tattoos on my arms, then turned on her heel and walked out.</p><p>I quickly grabbed a rag and scrubbed it over my dirty face and knew there was nothing I could do about the ripe smell I’m sure I was emitting.</p><p>She got out of the car and walked to where I was waiting. “So I’m Heather, by the way,” she said.</p><p>I nodded and swallowed. “Well, let’s take a look at your car, Heather. Pop the hood.”</p><p>It took longer than it should have for her to locate the hood switch, but she eventually did as ordered, then stepped out of the car.</p><p>I lifted the hood and looked into her lime-green colored eyes and asked, “What kind of noise is it making?”</p><p>She shrugged and looked at her nails. “I don’t know, it sounds like a clunk-grind-screech.”</p><p>“When the car is on or off?” I asked.</p><p>She looked up at the ceiling as if the answer was there somewhere. “On. When I press on the brake.”</p><p>“Every time?”</p><p>“Yes.”</p><p>I closed the hood and slid on my back under the car and laughed at what I saw. After sliding back out, I stood up. I looked at her and tried not to smile. “Sweetie, you need new brakes. You’re metal on metal there.” I pointed at her tires.</p><p>“Oh.” She didn’t seem the least bit embarrassed. What an airhead. I was gonna kill Trent. He probably thought I needed to get laid or something.</p><p>As if, I scoffed to myself.</p><p>She stared at me a couple more minutes. “Well, do you do that here?”</p><p>“No,” I said curtly. “I’ll be right back.”</p><p>I pulled a business card from the stack on the desk in the office and handed it to her. “This place does great brakes, especially on luxury cars.” I dipped my head toward the gold Lexus.</p><p>“I see.”</p><p>She pinched the card between her thumb and forefinger as if it might get her dirty and dropped it into her tiny purse.</p><p>Then she pulled out a card of her own. “Well, after I get my brakes done, maybe you could call me to see how it went?”</p><p>I looked down at the card, which read: Heather Findley and a local phone number. On it was also a small photo of her in a hot pink bikini wearing high heels and I suppressed the urge to roll my eyes.</p><p>I ignored her comment and said, “Gus over at that brakes place will take good care of you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She smiled and got into her car and left. I looked at her stupid business card and shoved it into the pocket of my jeans, glad the work day was over and desperate for a shower.</p><p>Chapter Twenty</p><p>Mina</p> <p>I hadn’t heard back from Heather. I’d tried calling her and sent several texts to her phone – but nothing. I’d even tried hunting her down at college. Eventually, I heard she had come down with a bad case of flu. I considered driving by her house just to make sure she was okay, but in my heart I knew I was only going to pay her a visit to find out if my honey trap had been set. That would have been selfish of me, and Heather would have thought the same, too. So, I decided to leave her in peace.</p><p>My uncle and aunt left for their lakeside cabin early on Saturday morning as they had planned. I wished them both a happy anniversary and they set off, leaving me alone in the house. Knowing that I had the place to myself, and hoping that I was going to throw some kinda party, both Evelyn and Mandy called me up to see if they could come over.</p><p>Whispering in the best croaky voice I could muster, I said into the phone, “I don’t feel great. Got myself a bad case of the flu.”</p><p>“You looked fine at school yesterday,” Evelyn sighed.</p><p>“I know,” I coughed and spluttered. “Apparently it’s going around. I heard that Heather Findley has it real bad and I was only chatting to her the other day.”</p> <p>“She probably passed you her germs,” Evelyn said.</p><p>“I guess,” I wheezed.</p><p>“Well go straight to bed and take some vitamin C,” she said, sounding concerned.</p><p>I felt bad for lying to my friends, but they would’ve never been able to understand why I was blowing them off so I could spend time with Jax instead of partying with them. Evelyn would’ve never been able to get her mind around that.</p><p>I hung up the phone and flounced from my bedroom, excited at the thought of seeing Jax that night. After I’d showered, and with a towel wrapped around my damp hair, I went to the wardrobes in my room and thumbed through the dresses hanging from the rails. I wanted to look nice for him, but not cheap – like I was giving myself away. Pulling dresses from the wardrobe, I held them against me, screwed up my nose and tossed them aside and onto my bed. I couldn’t find anything that I really liked and I was just about to give up when I saw the red little dress that I had brought over from England with me. It had been my favourite, but I hadn’t worn it since arriving in the U.S. and it had gradually been pushed to the back of my wardrobe. I held it up against me and looked into the mirror. It was sexy but didn’t make me look desperate or cheap. It hung just above my knees, just enough to give Jax a teasing glimpse of my tanned thighs. That was enough, I smiled to myself.</p><p>I slipped in my earphones and set about doing my hair while I listened to some Coldplay. I whacked the volume up. After drying my hair, I fixed it into two loose pigtails, which hung from either side of my head. Snatching up my iPod, I re-hung the clothes I had earlier discarded, and headed out of my room. In the kitchen, I set about fixing dinner for myself and Jax. I wasn’t a great cook, but then again, I wasn’t a bad one either. My mother hadn’t often been around when I was younger, so I was left to sort out my own meals on my arrival home from school. Microwave meals tasted of plastic, so I had soon learnt to search out recipes and download them from the Internet. I didn’t mind cooking; it was eating alone that bothered me. Most nights of the week I would sit in the kitchen back home looking at the four walls as I ate the meals I had cooked for myself. My phone was often my only source of company – but sometimes my phone could scare me. I would have to switch it off and tuck it under one of the sofa cushions.</p> <p>Sometimes I still did that, even though I was older and no longer lived in the UK. Uncle Rob once caught me hiding my phone under the sofa. He asked what I had been doing.</p><p>“I’ve found it,” I had lied, gripping it in my fist.</p><p>“It looked more like you were trying to hide it,” he said with a quirky smile.</p><p>“Why would I want to hide it?” I’d frowned back at him.</p><p>He just looked back at me and shrugged his broad shoulders.</p><p>“Well, I’ve found it now,” I said, breaking his stare and heading out of the living room.</p><p>At the door, he stopped me by placing a hand gently on my arm. “You know, if you ever need to talk about anything, I’m here. It can’t be easy coming to live in another country and being so far away from your friends and mother...”</p><p>“I’m okay,” I lied again. “Thanks anyway, Uncle Rob.” I left him alone in the room and he never caught me trying to hide my phone again. But sometimes my phone could be my friend, too – it helped me a lot. I’d also come to discover more recently that laptops and cameras of any kind could be of help to me.</p> <p>After covering the fish cakes I had made with breadcrumbs, I looked up at the wall, and could see that Jax would soon be knocking on the door and there was other stuff I needed to do before he arrived. Brushing breadcrumbs from my fingers, I went into my uncle’s study and picked up his laptop. I took it back to the kitchen. Standing by the table where I knew Jax and I would be eating dinner, I looked up across the kitchen. Perfect, I thought, heading back across the room with the laptop in my hands. I lifted the lid and switched on the video web camera and hit record. I went back and sat at the table where Jax would be eating. Sitting down, I glanced over at the laptop. I sat there for a few short minutes, then got back up and viewed what I had just recorded. I could clearly see myself sitting at the kitchen table where Jax would be seated in half an hour or so. I dimmed the screen so the laptop looked to be switched off.</p><p>Heading out of the kitchen, I went to the living room. My aunt kept a small digital video camera in one of the drawers there. I took it out and switched it on. The camera was easily concealed in my hand, but I couldn’t get away with holding a camera all night long in front of Jax. He’d already grown suspicious of my phone. I knelt down in front of the TV where the Blu-ray player sat. The camera had a little light on the front, which glowed red when it was in record mode. I tucked the camera down beside the Blu-ray player. Should Jax notice the red light, he would think it was a standby light and not a camera secretly recording him. With the camera in place and aimed at the sofa where we might be sitting later, I left the room.</p><p>Chapter Twenty-One</p><p>Jax</p><p>I was halfway to Mina’s house for dinner, when Buck Cherry’s screaming ringtone broke me out of my thoughts. I looked for the phone on the seat and answered.</p><p>“Hello?”</p><p>“Dude. Meet us at Rowdy’s tonight,” said Trent.</p><p>I shook my head. “No, can’t. Have a date.”</p><p>He laughed. “With that hot blonde?”</p><p>I went to respond when I realized something. “What blonde?” I asked, testing him.</p><p>“Damn, dude, how many blondes you got? Hello... that British chick with the nice ass.”</p><p>“You sure you don’t mean little miss platinum blonde Playboy bunny you sent into my shop?” There was silence on the other end so I continued, “I mean, you should have just kept her for yourself. She’s not my type.”</p><p>Trent finally spoke. “What are you talking about, man? I didn’t send no chick to your shop.”</p><p>“What? Yes you did, her name was Heather something or other. Blonde, drives a gold Lexus, total ditz. I kept expecting to see a little Chihuahua dog pop out of her purse.”</p><p>“Seriously, bro. I didn’t send no girl to your shop. Girls like that don’t talk to me.”</p><p>I huffed, still not sure I believed him. “She said you were in her History class or something.”</p><p>He laughed. “Well there you go. I don’t take History. I’m done with all those undergraduate bullshit classes. My degree is gonna be in Sports and Wellness so all my classes are those types of things. Don’t you listen to a word I tell you?” he joked.</p><p>“Huh. All right then... anyway, got a date, yes, with the hot British girl. So have fun at Rowdy’s and tell Gabe I said hey.”</p><p>“Catch ya later, man,” Trent said, then hung up.</p><p>I realized I was now sitting in front of Mina’s house. I was trying to think of where I put that damned business card that bimbo gave me, because I was so going to call her and ask her again who the hell sent her to my shop. It was just weird. I remember at the time getting the odd feeling like the girl was setting me up for something, but I couldn’t put my finger on it. After she had drove off in her shiny little car, I had chalked it up to Trent playing a joke on me. Trent’s a practical joker, but he always owns up to his jokes, so I believed him when he said he didn’t send her over. Maybe there was another Trent or maybe I heard her wrong. Did I care enough? Not sure. I’d decide later if, and when, I found that damn card.</p><p>I reached over and grabbed not only a bouquet of flowers, but a bottle of red wine, too. I liked to think I was becoming less of a Neanderthal.</p><p>I rang her doorbell, balancing the flowers in the crook of my tattooed arm, the bottle of wine in the fist of the same hand. Mina answered the door almost immediately, her big blue eyes smiling up at me.</p><p>She had on a short red dress and her straight blonde hair was in two low ponytails on either side of her head. She was barefoot and looked sexy as hell.</p><p>“For you,” I said, handing her the flowers.</p><p>She smiled wide and sniffed them. “Lovely, just lovely. Thank you, Jax.” She leaned up on her tiptoes and kissed me softly on the mouth and I almost dropped the wine. I wanted to kiss her back with everything I had, but that would be for later.</p><p>I stepped inside, and following her through to the kitchen, I said, “I brought you some wine. I don’t drink the shit myself, but the woman in the store said it was a good vintage or something.”</p><p>She took the bottle from me and set it on the kitchen counter. Then she began fussing with the flowers, filling a vase up with water and arranging them in it carefully. She looked very intent on her task, a small crease furrowing between her pretty eyes and I wondered what she was thinking about. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Something smells good,” I said, shoving my hands into my pockets.</p><p>Why was I nervous?</p><p>She put the clear, square vase on the dining room table, which was already set with nice dinner silverware and fancy plates, along with two long tapered candles in the center. They were lit and cast a warm glow on the white wall next to it.</p> <p>“Thanks,” she said. “It’s my attempt at some breadcrumbled fishcakes I used to make back home. However,” she said, and there was that little crease between her brow again, “I couldn’t really find the right ingredients. For instance, we like to use cod or haddock, but I could only find something called ‘mullet’ here in Florida. Not sure how it’s going to taste. I was going to call my aunt and ask her what type of fish I should use, but I didn’t want to disturb her on her holiday at the lake...”</p><p>I was laughing a little now. I walked over to her and cut her off, snaking my hands around her. “Mina. I don’t care what we eat. I’m sure it’ll be fine.”</p><p>She looked up at me. “Well, I just hope it’s good. I haven’t got to do much cooking since I moved here. My aunt is such a wonderful cook, I have just been spoiled.”</p><p>Since my arms were still wrapped around her small waist, I took advantage and leaned down and kissed her. She welcomed my kiss, giggling a little as my goatee tickled her lips and chin once again. I felt her tongue brush my lip and I slid my hand down to her perfect ass.</p><p>“As much as I’d love to continue this,” she said, slowly breaking away, “I need to get the meal out of the oven before I burn it and you either go hungry or have to take me out to eat once again.”</p> <p>I smiled and said, “Where is your wine opener?”</p><p>She looked at me confused for a second. “Oh, the corkscrew. It’s in the drawer there,” she pointed.</p><p>I opened it and fumbled with the odd contraption, finally figuring out how to pop the cork without looking like a total dumbass. I unscrewed it, and thank God for the clear glass cabinets above the microwave, because I could see wine glasses neatly stowed in there and grabbed two.</p><p>I poured the warm red wine into both glasses and handed her one. She set a steaming dish on the stovetop and took a sip. “Very good,” she said.</p><p>I also took a sip and had to resist the urge to gag. “Gah.”</p><p>She threw back her head and laughed. “There are beers in the fridge. You don’t have to drink wine just for me.”</p> <p>I set the glass down and said, “So when do we eat?”</p><p>“Now,” she replied, placing the last dish on the table. I looked at the spread of food and couldn’t believe she had cooked for me. In fact, I couldn’t remember the last time I’d had a home-cooked meal. Not since my mom was alive, probably.</p><p>As we sat down to eat, I looked over at Mina as she folded the cloth napkin on her lap and set her iPhone neatly on the table next to her shiny fork. She then spooned out some of the meal onto my plate for me. I didn’t even look it. All I wanted to do was stare at her.</p><p>I was so glad Mina’s uncle kept beer in the house. That wine was nasty and I needed to relax. I don’t get how anyone could drink that crap.</p><p>After dinner, she led me by the hand to the sofa, wineglass in her other hand, and we sat down. I put my now-empty beer bottle on the coffee table and she eyed it. “Would you like another?”</p><p>“No, I think I’m good. Did you like the wine?”</p><p>She nodded. “Oh, yes, I think I like it a bit too much. I better be careful or I may just drink the whole bottle.” She ended with a giggle.</p><p>I smiled at her. It was nice to see her happy, because it seemed like most of the time she was on edge. But there was something different about her tonight. Maybe it was the wine, or maybe she felt happy being alone in the house, or maybe she just liked to cook.</p> <p>“Thanks for dinner. It’s been a while since I’ve had anything other than takeout,” I smiled at her.</p><p>Mina nodded and said nothing else. Instead she just stared at me, occasionally flicking her eyes behind me like before.</p><p>I looked around the living room and spotted a TV and stood up. Mina grabbed my hand a little harder than necessary and pulled me back towards the couch. She suddenly kissed me.</p><p>I was taken by surprise. It was a pleasant surprise and I was definitely going to roll with it.</p><p>I wrapped one hand around her waist and put the other on her leg and slid it up under her dress. I lightly stroked her soft thigh and ran my hand down her back to her waist and then around to the front.</p><p>Her soft kisses soon turned more frantic and she had a hand around the back of my head, trying to grip my hair, but I’d just cut it so there wasn’t much back there. I could feel her short fingernails raking lines onto my scalp. I pushed her down onto her back on the soft sofa cushions and placed my knee between her already open legs and continued to run my hand up her thigh. I licked her mouth and tongue and she ran her hands down the hard planes of my back. She groaned into my mouth when my hand found her breast and I stroked the hard tip with my thumb. My other hand was on her face, caressing her jawline with my fingers. I felt her hands go up under my shirt. Moving one around to my front, she ran light fingertips down my stomach, causing the muscles there to go hard. I moaned as her hand moved lower and lingered on my belt buckle.</p><p>I continued kissing her, inhaling her sweet, delicious scent that made me want to consume her. I broke the kiss and could hear her panting in my ear as I ran light kisses down her face to her neck. I had a sudden desire to lick her everywhere. My jeans were becoming uncomfortably tight now and I wished she would just undo my belt buckle like I knew she wanted to. But I wasn’t going to push this time. If she wanted to take this farther, she’d have to make the move.</p><p>After a few more minutes of kissing, I decided to test the waters. When my mouth was right by her ear, I whispered, “Let’s take this to your room.”</p><p>She froze and looked up at me and blinked a few times. I couldn’t decipher the look on her face, but it made me have to suppress a laugh. I couldn’t tell if she was surprised or trying to make a decision. It was almost like the look she gave me the first night I asked if she wanted to come into my house. I just stared at her, waiting for an answer.</p><p>She glanced over toward the TV then back up at me and said, “I like it here.”</p><p>That was definitely an odd response, but who was I to argue?</p><p>I shrugged and continued kissing her, pushing her dress up farther and letting my fingers roam between her thighs and over her panties. I heard her gasp and I smiled into her mouth, running fingers along the very top of them and gently stroking her bikini line. I twisted my fingers around the thin strip of material near her hipbone and teased like I was going to pull them down. Her hand was still on my stomach, resting on my belt buckle, stroking the skin softly but not doing anything else.</p><p>She definitely was not aggressive, and that was okay, sometimes that can actually be a turnoff, but taking a little initiative never hurt anyone. Mina seemed strong-willed and stubborn in other areas of her life, but in situations like this, she seemed reserved; distracted maybe?</p><p>I also knew she was keeping a secret, and the thought of finding out what it was had been sitting in the back of my mind. I just had to figure out a way to get to the bottom of it without pushing her too hard, because I had a feeling she would push back.</p><p>I suddenly had a thought and froze. My fingers, my lips, my hands all stopped what they were doing and I felt Mina stiffen under me.</p><p>“What’s wrong, Jax?” She looked worried.</p><p>I pushed myself up off her and sat on the sofa. She also sat up and pushed her dress back down over her beautiful legs.</p><p>I ran a hand through my hair and looked right into her piercing blue eyes. “Mina, how many guys have you been with?”</p><p>She gasped. “That’s none of your business...”</p><p>“Are you a virgin, Mina?”</p><p>She stared at me again, like a deer caught in the headlights as I waited for her answer.</p><p>Chapter Twenty-Two</p><p>Mina</p><p>He asked me if I was a virgin. I wasn’t and sometimes I wished I still was. But I couldn’t change what had happened before, but I could change what happened next. I wanted Jax – that, I couldn’t deny. I had always felt that way. When I first started to follow Jax – to watch him – I had no idea that I would ever come close to feeling anything for the guy. But my feelings for him had changed. I no longer thought he was a macho shithead. As I got to see more of him – got to know him – I had come to understand that there was another layer to Jax hidden beneath his tattoos and piercings. They were nothing more than a mere mask for him to hide behind, and I knew all about hiding. I knew Jax wanted to go further with me, and I wanted to, too – but it was the camera I had set up. I wanted to film something that was emotionally charged – the results were better that way – but I didn’t want to film me and Jax giving ourselves to each other completely. I didn’t want to get caught, should anyone other than me see it – that’s what had got me into trouble before. But I didn’t want tonight to end between me and Jax like it had before. He had understood when I had withdrawn from him. He had been patient and understanding – and the fact that he had come back tonight suggested that he liked me. For weeks I had seen Jax parade a nightly stream of girls into his house. If sex was all he wanted, then he could be escorting another girl up his front garden path tonight, certain that he wasn’t going to be left feeling horny and frustrated. With my eyes closed, I thought of Heather and wished she had called or texted to let me know if Jax had taken her number. Had Heather even set the honey trap before she had fallen ill? I had no way of knowing. If I wanted Jax tonight, then I would have to put my trust in him. I would have to not only trust his feelings, but my own too. If I didn’t, then what happened before would ruin any future relationship – but more importantly, my relationship with Jax.</p><p>So sliding out from beneath Jax, I took him by the hand and led him up to my bedroom – where I hadn’t had time to fix up my camera in. If I was going to give myself to Jax, I wanted that to be private, just between the two of us. I didn’t want anyone else watching. Jax took my hand, curling his fingers around mine. Without saying a word, I led him into my room, closing the door behind us. No sooner had it closed, Jax pushed me back against it. With his eyes half-closed, he lowered his head towards mine, and with greed and something close to starvation, he devoured my mouth. I ran my tongue over his, coaxing him deeper into my mouth. I dug my fingernails into his jeans, digging at his perfectly formed arse. Jax ran his hands up my thighs and beneath the hem of my dress. I felt his fingers prise my legs apart and it made me feel delirious with lust. I could feel his hard, warm body as he pressed me against the door. As he ran his fingers up and down the inside of my thighs, I pulled at the front of his shirt. There was a popping sound as some of his buttons broke free. Jax’s shirt flapped open, and in the dim light of the bedside lamp, I saw the curve of his muscular chest and stomach. The stud in his nipple glinted as if winking at me. I dropped my head forward and covered it with my mouth, letting my tongue glide wetly over him. He shuddered before me, making a deep groan in the back of his throat. To hear this heightened my own desire, and I inched my thighs further apart for him. I could feel a growing warmth that radiated from my core and spread out between my legs as he began to stroke me there. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I gasped at his touch, running my fingers over the bumps of his stomach and to his belt. With hands that trembled with a nervous excitement, I worked his belt buckle free. I let my hands deliberately slide over him, and I could feel that he was straining to be free. I continued to cover his chest in gentle strokes of my tongue, as I tugged his jeans down over his solidly built hips and thighs. Almost at once, I felt him spring free and thump hard against my stomach. I squirmed against him. Jax eagerly kicked his jeans free, as I pulled his shirt from him. I eased him off me and looked at his naked body as he stood before me. It was taut with muscle and covered in an intricate array of tattoos. It was like his naked body told his life story in pictures stenciled in black ink.</p><p>“Like?” he said with a slanted smile, his strong hands by his sides.</p><p>“Very much,” I smiled back, unable to stop myself from glancing down at him. I could tell at once that he liked me.</p> <p>“Good,” he said, reaching out and untying the red scarf I had around my waist. I had used it to keep my dress closed, and when he pulled it off, he slung it around his own neck and proceeded to use his hands to push the rest of the dress off over my shoulders. It slid to the floor and pooled around my feet. With his eyes never leaving my body, I slowly drew my panties down over my hips and stepped out of them. We stood before each other stripped bare, my pigtails swinging about my shoulders. There was no going back.</p><p>“Like?” I whispered.</p><p>“Oh yeah,” he said, eyes wide and glazed with desire.</p><p>Stepping away from the door, I crossed the room to my bed. I made sure that I let my body brush against his as I passed, just like I had in the coffee bar. Reaching the bed, I glanced back over my shoulder and could see that he was staring at my arse. I liked the way he looked at me. I could see a hunger in his eyes and it turned me on. Dropping onto the bed, I lay on my back. With my eyes half open and heart racing, I looked up him. Over his shoulder I could see the picture of London hanging from my bedroom wall. I thought of the pictures of Jax hidden behind it. I didn’t want to think of them right now. That was my secret which I wasn’t ready to share – if ever.</p><p>Glancing back at Jax, I teasingly opened my legs. He glanced down between them, that look of hunger consuming his face again. His eyes clouded over with longing. I didn’t have to entice him anymore. Climbing onto the end of the bed, Jax sunk between my legs.</p> <p>Chapter Twenty-Three</p><p>Jax</p><p>I don’t think my eyes have ever rolled back in my head during foreplay before, but today, I’m sure they did. Mina pulled me down and when she put her mouth on my nipple piercing, I almost lost it right then and there. As her tongue was playing on my chest, I reached down and slowly pulled out both her ponytails, tossing the little rubber band things to the floor. She looked at me with amusement in her eyes. I reached down and tugged at her hair a little to allow it to fall over her bare, delicate shoulders. I sucked in a breath at the sight of her bare body... it was perfect in every way. I had been with lots of girls; some tatted up, some with just a couple of small tats, some with scars, some with piercings... but it had been a while since I’d been with a woman with nothing at all. Her body was a smooth, blank canvas and I wanted to draw a masterpiece all over it with my tongue and fingers.</p><p>Mina teased me by brushing one of her thighs against me, almost daring me to satisfy her. She never verbally answered my question about whether or not she was a virgin, but I got my answer by the seduction act she performed by lying on that bed and the look in her eyes. Virgins didn’t behave like that. Mina reached up and grabbed the scarf, using it to pull me down to her mouth. She kissed me hard and I propped myself up on my hands to keep from smothering her, even though I really wanted to. I wanted to consume her. She slithered the scarf off from around my neck and threw it to the floor.</p><p>As I lay on top of her, my arousal pushing into her thigh, I could feel her hips buck under me, begging me to fill up her body. But there was no way I was going to do this without protection. I got up off the bed and fished around in my pants pocket for a condom. I slipped it on, keeping eye contact with Mina, her blue orbs blazing with fiery desire, her lip turning white from the way she was biting it. I quickly made my way back to her and ran kisses and nips up her thighs, slowly swirling my tongue all the way up. I reached her core but didn’t touch it, as much as I wanted to. I heard her let out a soft moan as I went around to her hipbone and kissed her there. I could see goose bumps pebble her body, and I reached up and gently took hold of her breast. It felt soft but heavy in my hand. Her breasts were perfect and I wanted to stare at them forever.</p><p>When my fingers found the puckered tip, I slid them around it and she moaned once again. I soon replaced my fingers with my warm mouth and tongue, and she pawed at my hair until I thought she may pull it out.</p> <p>Removing my mouth from her beautiful pink nipple, I ran kisses up her neck and then found her mouth again.</p><p>“Jax, please, I need you,” she said in that hot British accent that made me even harder than I already was, if that was even possible.</p><p>I grinned and decided I was going to tease her some more. I was actually teasing myself if I’m honest, since I was ready to lose it before I had even touched her there. I pinned her arms to the bed, holding her hands down so she couldn’t move. I began nipping at her breast again with my teeth, licking and sucking, getting lost in the soft mewling sounds she was making.</p><p>I made my way back up to her mouth and kissed her some more, still pinning her hands to the bed as her hips continued to squirm under me. It felt so good to be wanted by such a beautiful girl. I could resist no longer.</p><p>As I slowly sunk into her hot, wet body, I groaned into her mouth and I’m fairly sure I heard her squeak. I began moving slowly while keeping both hands pinned to the bed, my fingers interlocking with hers. I was in complete control of her and she loved every second of it. I felt her wrap one long, creamy leg around my back and I had to do everything I could to maintain control, to not lose myself inside of her too quickly.</p><p>I let her hands go and she immediately wrapped them around my back and dug her short nails into the inked skin. I felt her body go still under mine as her nails dug harder into my back. Then she cried out a soft, throaty, breathy cry that told me she’d... arrived.</p><p>I smiled and continued to stroke myself in and out of her, hoping I could get her to moan like that again. Every one of my nerve endings felt like it was on fire. My heart was pounding in my chest. I was almost dizzy with lust. Her nails were still in my back, but they didn’t hurt; the sensation was hot... righteously viscous... erotic.</p><p>When she raised her hips again to meet mine, I felt her tense once more, this time her hands slid down and wrapped around both of my biceps, squeezing as she screwed her eyes shut and threw her head back. I watched her ride another sinful wave and it was my undoing.</p> <p>Without any more control left in me, I let myself go, arching my head back and gripping the sheets, balling them in my fists as I tried to keep from crying out at the sensations ripping through my body. It was like nothing I had ever experienced.</p><p>I dipped my head down, panting into her neck, her fingers playing gently with the hair on the back of my head.</p><p>She was breathing heavy in my ear. “Jax, that was...”</p><p>She didn’t finish her sentence. I lifted my head and looked into her face, waiting for her to continue. “Cat got your tongue?” I asked, amused.</p><p>“I’ll show you my tongue,” she teased back.</p><p>“You already did, but I’d like to see it again.”</p><p>She stuck her tongue out at me and I nipped at it with my teeth, capturing her mouth once again in another deep thank-you kiss that she seemed to happily return.</p><p>I wanted to lie with her like this and never leave the house.</p><p>But with a groan, I eventually rolled off of her to get rid of the evidence. Then I found my boxer briefs and slid them on. I climbed under the covers and held her soft body against mine. It was warm, almost hot. She was still flushed red, and when she laid her head on my chest, I closed my eyes and gripped her tighter, running my fingers lightly over her arm.</p><p>“You’re incredible, Mina,” I said.</p><p>She didn’t look up but I felt her nod against my chest. “I was just about to say the same thing to you.”</p><p>“Do you have any regrets?” I asked her.</p><p>She seemed to pause a lot longer than was comfortable and I began to regret asking her about regrets. I was about to say something else – anything to break up the silence, when she answered me.</p><p>“No, Jax. No regrets. Not a one. I’m glad you came over tonight. I’ve felt things tonight I haven’t been able to feel in a long time...”</p><p>I nodded as she trailed off, and kissed the top of her head. We lay like that for a while when I decided we needed some music. I spotted a small stereo on her dresser. I gently untangled myself from her, first needing to use the adjoining restroom. I left her beautiful glowing body lying on her queen-sized bed.</p><p>After I finished, I opened the bathroom door and must have let it swing a little too hard, because it smacked right into a large framed poster of London she had on the wall. I saw the poster come loose and fall, and I tried to catch it, hoping the glass it was encased in didn’t break.</p><p>I managed to catch it enough where my hand broke its fall. I eased it to the floor, breathing a sigh of relief, but feeling a little embarrassed, too. I shook my head.</p><p>Smooth, Jax. Real smooth.</p><p>Mina shot up out of the bed, a distressed look on her face as I lifted the poster, intent to get it back on the wall, hoping I wasn’t going to need some tools. As I faced the wall, I let out a gasp and almost dropped the poster again. Dozens and dozens of photos of me were plastered where the poster once was.</p><p>Me in the coffee shop. Me at work. Me going into Rowdy’s with my friends. Me in front of my house. Me sitting in my truck somewhere. Me on my bike.</p><p>I was stunned, confused, and horrified all at once. I couldn’t wrap my brain around what I was looking at. I slowly turned around and looked into Mina’s red and sheepish face. “What in the hell is this?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Twenty-Four</p><p>Mina</p><p>Pulling a sheet about me like a cape, I scrambled from the bed. With one of my feet getting caught up in the bedclothes, I dropped to the floor and clawed my way up again. I grabbed the picture of London from off the floor and tried to cover the mosaic of pictures Jax had discovered. Before I could cover them again, Jax had pushed me away. He stood, open-mouthed, and looked at the hundreds of pictures that had once been hidden.</p> <p>“What the hell?” he gasped, as if finding it hard to breathe. He glanced at me, then back at the wall again. His face had drained as white as soap. “These are all pictures of me...”</p><p>“Jax, you don’t understand,” I cut in.</p><p>“That’s a picture of me in Starbucks... the day you and your friends were laughing at me,” he whispered, like he was just waking from a nightmare or perhaps at the start of one. “These are pictures of me going in and out of my house... with girls...”</p><p>Jax,” I pleaded, trying to pull him away from the wall.</p><p>He shrugged me off with a grunt. Jax stepped closer to the wall, the tip of his nose almost brushing against it. His eyes grew wider as he inspected the pictures. My heart felt like it had stopped as I struggled to breathe. I had never intended for Jax to find out about the fact I had been spying on him – not yet and not like this. I covered my face with the sheet draped about my shoulders. I didn’t want him to see it and I didn’t want to see the look of horror on his. I felt humiliated and embarrassed that he had finally discovered what I had been up to. But I also felt a sense of panic and dread, not knowing how Jax was going to now react. I didn’t have to wait long to find out. I peeked at him through my fingers as I clutched the sheet to my face.</p> <p>As if in slow-mo, Jax turned to look at me. A mixture of distrust, horror, and bewilderment etched on his face. “You’ve been spying on me, Mina,” he whispered as if shock. “What are you... some kind of freaking stalker?” I watched as he fumbled around on the floor for his clothes and slid them on angrily.</p><p>“Please, Jax,” I said, burying my head in my hands and the sheet. I couldn’t bear to see that look of revulsion in his eyes. “It’s not what you think.”</p><p>“You don’t know what I’m thinking,” he hissed, now sounding angry. He pulled the sheet away, so I could no longer hide behind it. “Look! Look!” he cried, grabbing me by the arm and dragging me closer to the wall and the pictures. “That picture is of me at my place the other night. You were filming me as were making out...”</p><p>“No...” I mumbled, my mind racing. How did I explain?</p><p>“Is that how you get your kicks?” he said, his voice cold. “What do you do – film yourself with guys and go show your friends? Have a good laugh?”</p><p>“This has nothing to do with my friends,” I started, tears stinging the corners of my eyes. I still couldn’t bring myself to look at him – to look into his eyes. The sharpness of his voice told me how pissed off and angry he was.</p> <p>“So what does it have to do with?” he barked. “Fucking hell, Mina – I thought you were a little cranky at times – but I had no idea you were fucking dangerous.”</p><p>“I’m not dangerous,” and this time I did glance at him and wished I hadn’t. His face was twisted in a grimace of anger and hurt.</p><p>“This sorta shit isn’t normal,” he said, jabbing his thumb at the wall. Then as if something had come up and slapped him up the side of his head, he looked at me and added, “That’s why your cell phone never leaves your hand... you’ve been filming and photographing me the whole freaking time.”</p><p>He pulled the sheet from me. I stood naked again before him and covered my breasts with my arms. “Jax, what are you doing?” I gasped, as he seemed to be searching the folds of the sheet.</p><p>“Looking for your cell phone,” he snapped. “It’s got to be around here somewhere. It doesn’t leave your hands for very long.”</p><p>“I don’t have it,” I said.</p><p>“Where is it?” he demanded, throwing the sheet at me.</p><p>I wrapped it around me as Jax pulled on his jeans and shirt.</p> <p>“It’s in the kitchen,” I said. “I wouldn’t have filmed us up here together...”</p><p>“Liar,” he spat, heading for the door and charging down the stairs.</p><p>I raced after him, the white sheet flapping about my legs like a dress. “Jax!” I yelled after him. He was at the bottom of the stairs before I was even halfway down. Jax raced across the hall and into the kitchen. I followed.</p><p>In the kitchen, Jax stood and scanned the work tops and table for any sign of my phone. “Where is it?” he said, talking to himself more than me. Then spying it on the table, he raced across the kitchen. I got to my phone first and snatched it up. Jax gripped my wrist.</p><p>“Get off me,” I wailed. “You’re hurting me.”</p><p>“Give me the phone,” he warned. “I want to see what else you’ve been filming.”</p><p>“No,” I said, fighting back against him.</p><p>We struggled against each other as both of us fought over the phone. But it was impossible, as I was trying to grip the phone with one hand and keep the sheet wrapped around me with the other. Jax prised the phone from my fingers and staggered backwards. He hit the worktop where the laptop lay. I threw my hands to my face, fearing that it would clatter to the floor and smash. I couldn’t let that happen. I needed the footage I had been filming on it. Jax saw the fear in my eyes, then glanced at the laptop as it rocked back and forth over the edge of the worktop. I ran towards it, one hand outstretched.</p><p>“No!” I yelled as it tipped over the edge of the worktop and headed for the hard floor. With a rattlesnake-like reflex, Jax shot his free hand out and stopped the laptop from crashing into the floor. He held it in his hand. With a frown in his brow, he looked at it, then back at me.</p><p>“Why were you so scared this was gonna break, Mina?” he asked.</p><p>“It belongs to my uncle,” I said, drawing breath, relieved that he had saved it. “Just give it to me.” I held out a hand to take it.</p><p>Jax looked down at it again as if trying to figure something out. Slowly, he raised his head and looked back at me again. “You’ve been filming me on this tonight, haven’t you?”</p><p>I just looked at him, heart pounding in my ears. The moment of hesitation on my part told Jax everything. He knew.</p><p>“My God,” he breathed as if winded. “You’ve been filming me the whole time. That’s why you invited me here tonight... that’s why you had sex with me... you’ve been filming us...”</p><p>“No,” I said, taking a step forward.</p><p>“Keep away from me,” Jax said, holding out his hand as in warning for me to keep well back. He placed the laptop and the phone down, like he no longer wanted to touch them.</p><p>“Jax...” I started, but couldn’t find the right words, however hard I searched for them. “You don’t understand...”</p><p>“You sick bitch,” he grimaced, now he couldn’t bring himself to look at me.</p><p>“Jax...” I tried again. I couldn’t let it end like this.</p><p>“And to think that for the first time in my life I was prepared to take a relationship seriously,” he muttered, as if talking to himself again. He looked stunned at what he had discovered.</p><p>“I can explain...” I started.</p><p>As if he hadn’t heard me, Jax headed out of the kitchen, across the hall, and back towards the front door. He almost seemed to stagger, like he had just got up from some fight that had left him battered, bruised, and bleeding.</p><p>“Jax, please...” I called as I made my way after him. As he pulled open the front door, I grabbed his arm.</p><p>He shook me free. Then looking back over his shoulder at me, he said, “I hope you and your friends have a good time watching the video of us fucking.”</p><p>“No,” I said, shaking my head, unable to bear how he was now looking at me.</p><p>“You disgust me,” he whispered, then pulled the door closed behind him.</p><p>I stood alone in the hall, feeling for the second time in my life that I had lost everything. Dropping to my knees, I began to cry.</p><p>Chapter Twenty-Five</p><p>Jax</p><p>My blinding rage didn’t allow me to remember the drive home. My phone beeped several times with incoming texts and I had heard it ring at least four times but I didn’t even bother to look. I knew it was her and she could go to hell for all I cared.</p><p>I screeched into my driveway and didn’t even go into the house. I slammed the truck’s door closed and got on my motorcycle and roared out of the driveway, peeling off down the street, a black zag of smoking tire marks staining the concrete.</p><p>This was my life. This was what happened to me when I let someone in. When I finally did, she does this shit. Why did I attract the damn psychos? I thought I was a pretty nice guy. Was I too nice? I don’t know, but I do know this; no more Mr. Nice Guy. Screw everyone. If these girls want a bad boy... an asshole... then that’s what I’ll give them.</p><p>Mina had no right to film me like that. What a mental case. And she had the nerve to say she could explain. Really? Explain what? I’m obsessed with you and couldn’t stop filming you? Shaaa right. It made me want to throw a Molotov cocktail through the window and torch the entire house, just so she wouldn’t have any more photos of me.</p><p>But who was I trying to kid? They’re all digital, probably saved on some online account where she can access and print them anytime she wants.</p><p>The wind was whipping me fast and hard in the face. It was pitch dark out and I realized I had no destination at all. My bike had just taken me away from her... from my house, from hers; I wasn’t even in the same town any longer.</p><p>Where the hell was I?</p><p>I realized I was zooming down the interstate and saw an exit for a small town I had visited on one of the fishing trips I’d taken with my dad. I cut off three cars, who blasted their horns at me, and took the exit. I remembered a small rickety dive bar that sat on the edge of the swamp and tried my hardest to remember the way there. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Thankfully there wasn’t much around in this tiny town and I found it fairly quickly. The Marlin was the bar’s name. I almost smiled at the memory, but then I remembered that my dad was gone, probably dead, and Mina had just ripped my guts out. I didn’t need fond memories or smiles. I needed a stiff drink.</p><p>I wandered into the bar. It was pretty dark with torch lamps burning on the walls and round tables everywhere. It reminded me of something you’d see in a pirate movie. I walked over dusty planks of wood up to the bar and ordered a straight whiskey from the old timer who was wiping down the countertop there.</p><p>He nodded and threw the towel over his shoulder. Turning around, he poured a large measure of amber liquid into a thick scratched glass and set it down in front of me. I slammed it back in one swallow and signaled for another. He raised a bushy gray eyebrow at me and poured another. I paid the man and took it to a dark table in the corner to lick my wounds.</p> <p>The first shot had gone straight to my head quickly and I decided to nurse this next whiskey. A calming, numbing feeling began to spread throughout my body and my head began to get fuzzy. I could feel my body and brain begin to relax, but the anger still ebbed through me, buzzing around like an annoying bee. I had to take deep breaths to keep myself from punching a hole in the table with my fist.</p><p>As I sat and watched two couples slow dancing to some sappy country song on the small dance floor, I couldn’t help but let my mind drift to the events of the night. My brain ruthlessly replayed the entire erotic scene with Mina, starting at our flirtations over dinner to the very end when we were lying in bed together, sated and high on sex hormones. I began to get angry with myself for already mourning the loss of any future sexy romps with her.</p><p>I knew I could get laid pretty much whenever I wanted. But after being with Mina, I had realized that I wanted something more than a roll in the hay. I’d never had emotions like that during sex before and honestly, I didn’t even think it was possible. I’d heard people talk about it, and thought they were bullshitting.</p><p>I gritted my teeth together and forced myself to think of something else – anything else. Which of course led to me thinking about my dad again. It was like a punch to the gut every time I thought about him. I felt physically sick. If he was dead, at least I could bury him and move on. Maybe buy a boat and name it after him or drink myself into oblivion with grief. Go leave a six pack on his grave on a sunny Sunday afternoon and tell him how much I missed him. But there was no closure when you didn’t have answers. I needed to go talk to the cop in charge of his case... but that would probably lead to more frustrations and letdowns. If they had any leads, I’m sure they’d tell me. Obviously the case had gone cold and nobody cared anymore. Who gives a shit about an old drunk who disappeared? Apparently, only me.</p><p>I wondered what my mom would think about this whole situation. I wished she were here so I could talk to her. I thought about her short blonde hair and kind, smiling blue eyes and how badly I missed her. My dad probably wouldn’t be missing if she was still alive. I had always had a sneaking suspicion he had gone on a bender and had gotten in an accident of some sort that day. I never once believed he had just run away and left me here to cope without him. He may have been a drunk and a bastard sometimes, but I knew it was the alcohol and grief that caused those traits, and that he loved me, for whatever it was worth. I wished I had a brother or sister to talk to, but I had been my parents’ only kid, so now I was alone in the world. I had begun to think maybe I’d have Mina by my side as my lover and partner in life, but that was out the damn window now too.</p> <p>I looked down at the liquid in my glass and tapped my fingers against it. What the hell was I doing with my life? Maybe I should try to go back to school and make something of myself other than a frickin’ mechanic. The world will always need mechanics, my dad used to say, as if to justify not needing an education. Ain’t nothin’ wrong with a good, honest payin’ job, son.</p><p>I thought about the last time I’d seen him. It was a late Saturday afternoon and I was in the driveway tinkering with an old Harley we’d bought to fix up. He said he was running to the store for smokes and just never came back. I didn’t actually start worrying until the next morning when I woke up and he wasn’t there. I knew sometimes a cigarette run lasted hours. I never knew where he went, but I knew he would drink and not want me to see, which led to drinking and driving, something else I knew he hid from me.</p><p>I thought about the cigarettes and considered leaving this dump and going and buying a pack. Maybe the nicotine would calm my nerves and let me think straight. I’d quit over a year ago when dad went missing, but now sucking on a cancer stick sounded kind of enticing.</p><p>I threw back the last of the whiskey and walked out of the bar, my boots clacking on the hardwood floors, and went out to the parking lot. As I fished around in my pocket for my keys, I felt a small piece of paper and pulled it out and looked at it.</p><p>Heather’s business card.</p><p>I looked at the photo of her perfect bikini-clad body and the side of my mouth kicked up in a grin. Just because I’d once had feelings for Mina didn’t mean I couldn’t go find some hot piece of ass to make me forget about her for a while.</p> <p>Chapter Twenty-Six</p><p>Mina</p><p>I stood alone in the hallway, the sound of Jax's truck rolling away in the distance. My heart felt heavy, like a dead weight inside my chest. What did I do now? I didn't know. I had feelings for Jax, that was for sure, but was he ever going to be willing to listen to me? Would he ever make the time so I could give my side of the story? But even if he did, what would I say to him? How could I even begin to explain why I had been spying on him, watching him, making secret recordings of him? Who would understand that? I don't know if I would, had it been the other way around. How would I be feeling right now if I had discovered secret pictures of me on Jax’s phone? Images of me sharing intimate moments with him, leaving my home, in my car, at school, with my friends? I wouldn’t have understood, and it would’ve freaked me out – just like it had Jax.</p><p>Turning away from the door, I made my way up to my room. I needed to speak with Jax. I just couldn’t leave alone what had just happened – I couldn’t let us part like that. With the sheet still wrapped about me like a cloak, I dropped onto the bed. My phone was in my hand and I thumbed through the contact list. Hitting Jax’s number, I called him. With the phone pressed to the side of my head, and my heart thumping, I listened to the series of bleeps and clicks as the phoned tried to connect with Jax. But it just rang and rang and rang, then went dead. I quickly called Jax again. More rings and more ringing. Pressing the disconnect button, I sent Jax a text.</p><p>Call me. Please Jax, just give me a chance to explain.</p><p>Clutching my phone, I sat on the edge of the bed and sobbed. My body shook with regret and remorse. I had been here once before, and here I was again. Last time it had been different. That time, I had hurt my mum. I had betrayed her trust, and now I had betrayed the trust of another. It was at times like these when I really missed my dad. I missed him more than anything. That friendly smile and his green glittering eyes behind his black-rimmed glasses. I always knew that I could talk to him. But he was gone.</p><p>With my heart aching and feeling alone, I pulled on a pair of jeans and a sweater. I kicked the red dress and scarf under the bed. I crossed the room and sat by the window. The night breeze blowing in cooled the hot tears on my cheeks. Again and again, I looked down at the phone in my fist, hoping that Jax just might call me – hoping that he might’ve calmed down and had stopped feeling that anger and confusion which I knew he would be feeling. And how did I know he would be feeling like that? Because I had seen those emotions in my mother’s face, shining out of her eyes like black shadows of mistrust and despair. She had looked just like Jax had when she’d discovered the photographs I had taken before – when she had caught me with her lover.</p><p>The shock of seeing her that night as she stood in my bedroom doorway, John's arms wrapped around me as he lay on top of me on the bed. How she had looked as I peered over John’s shoulder, her face a white mask of contempt and hate for me. But it shouldn’t have turned out like that. I hadn't taken the pictures of him because I wanted him. I had taken them for another reason. But just like Jax now, my mother had never given me the chance to explain. She had seen only what she had wanted to see in the pictures. So she had sent me away. That had been my punishment. But what would my punishment be now? I couldn’t be sent away again. I was here to stay. And I didn’t want to go. I didn’t want to run again. I didn’t want to hide like some freak. I wanted to explain to Jax why I had behaved like I had. I wanted him to understand me – I needed that chance. Didn’t I deserve that at least? I had taken the pictures for him – just like I had taken them for John.</p> <p>Again I turned to my phone – that lifeline – that piece of shiny plastic I always held in my hand. The one thing that had brought me so much trouble and despair but I seemed unable to live without. Sliding the phone into my pocket, I just wanted to be free of its touch. I left my room and went back downstairs. In the kitchen I found the laptop lying on its side on the counter. Its screen was flickering, like a blinking eye. I righted the laptop and stopped the recording. Alone, I sat at the kitchen table and watched the secret recording I had made that evening. I could see myself entering the kitchen, Jax at my heels. We were talking. He poured me a glass of wine. We were sitting at the table, eating the fishcakes I had baked for us. It was like watching one of those reality shows. The conversation was mundane – natural – not scripted. We chatted and laughed, and it was then I saw the reason why I had been filming him. But this time it was different – different from the other times I secretly filmed Jax. It was different from all those other pictures I’d taken of him. Tonight there was something else; something I hadn’t been expecting. It confused me. It chilled me. My skin was turning prickly and hard with gooseflesh as it crawled up my back, over my shoulders, and down over my chest and arms. Over the flat of my stomach and legs. My teeth began to chatter as if stepping out of a warm bath and into the cold, as I stared at the screen. There was something there. Something I hadn’t seen before about Jax. Unable to watch the footage any longer, I snapped closed the lid of the laptop. I pushed it away from me to the other side of the table. Glancing around the kitchen, I pushed my chair back from the table and stood up. If only I could show Jax what I had seen. If only he would give me that chance. But where would I find him? Would he have gone home? Headed straight for Rowdy’s Bar? Was he already in the arms of another woman as he tried to forget? Trying to drown the feelings of hurt and anger I knew he would now be feeling towards me. And I couldn’t blame him. If I were him, wouldn’t I now be looking to fall into the arms of another, desperate to bury the feelings of betrayal and mistrust? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not wanting to be alone in the house any longer, I locked the front door behind me and headed down the drive towards my little car. I was going to go in search of Jax in the hope that I might be able to persuade him to listen to me – to perhaps watch some of those secret recordings. I would drive by his house first; see if his car was on the drive. I pressed the key fob and the sidelights flashed orange in the darkness. Once again I was reminded of Jax and how he had repaired one of those lights for me. And as I climbed into my car, I thought of my friend Heather and how I had arranged for her to visit Jax at the auto shop on the pretence that she too needed her car to be fixed. That now seemed like a really stupid idea, and if Jax were ever to find out, then I would certainly lose any chance of ever convincing him that I wasn’t some kind of bunny boiler. But had Heather even made it to the auto shop? I had no way of knowing, as she hadn’t been answering her phone. Had the flu got to her before she had gotten to Jax? I now hoped so. I no longer wanted to set that trap for Jax, but how could I stop it?</p><p>Turning the key in the ignition, I sped off the drive and headed across town to Heather’s house.</p><p>Chapter Twenty-Seven</p> <p>Jax</p><p>I rumbled to a stop in front of a small gas station with a decent sized mini-store in it. I grabbed a six-pack of beer and took it to the counter. My eyes raked over the selection of cigarettes and I felt a little twitchy thinking about how good it would feel to let a lungful of menthol course through my body. After showing the clerk ID for the beer, I asked her to fetch me a pack of the most expensive menthols they had, knowing it would probably be my only pack for a while, as I had no intention of making a habit out of this. Well, at least I hoped it wouldn’t be a habit, but we all knew what the road to hell was paved with.</p><p>I paid for the stuff and got out to my bike and swore. It was going to be an awkward ride home trying to fit a six-pack of beer on the bike. I briefly contemplated drinking two of them and putting the other four in my pockets but then that would make me no better than my old man, and decided a DUI would not be in my best interest. I had enough problems.</p><p>Somehow managing to get the beer on my bike without fear of it slipping off, I skidded out of the parking lot of the gas station and headed home. My head was still a little fuzzy from the whiskey but I needed to go home and get my shit together. I parked my bike next to my truck and went into the house, putting five beers in the fridge and popping the top off the sixth. I went to the dining room table and unloaded my pockets, setting my phone, some loose change, my wallet, and that business card with hot bikini-clad Heather on the front. She was staring up at me from the card, taunting me. If I stared at it hard enough, I could probably see her mouthing, “Call me.”</p><p>I shook my head and went to sit on the sofa and stared at a blank TV. I raised the beer can to my lips and flipped the still-sealed blue cigarette pack over and over and over between my fingers. I thought about Mina again, wondered how someone could be so brazen as to film someone like that and think it was okay. Didn’t she know she could be sued for something like that? Maybe she didn’t. She wasn’t from here after all.</p> <p>I started to unravel the plastic from the pack of smokes when I heard the front door open. I looked over my shoulder and saw Austin come in.</p><p>“Hi,” he said, smiling at me.</p><p>“What’s up, man?”</p><p>He came around to the other sofa to sit. His smile dropped and he looked at the cigarettes in my hand. “Um, you’re not going to smoke those in the house, are you?”</p><p>I chuckled. “No, you already told me your parents don’t want us smoking in here. I’ll go outside or in my truck.”</p><p>He seemed to visibly breathe a sigh of relief. “Good.” Then he looked confused. “I didn’t know you smoked.”</p> <p>I shook my head. “I don’t, not usually, but today’s been an awful day.”</p><p>He looked at the now-empty beer can next to me. “I see that. What happened?”</p><p>“Do you want a beer?” I asked him as he looked at my can. “There’s more in the fridge.”</p><p>“No thanks. I have a test tomorrow, I probably shouldn’t drink.”</p><p>I smiled, sort of wanted to laugh, but knew better. Why couldn’t I be more like Austin? Straight-laced, good student, responsible, took care of himself, ate healthy, didn’t drink. He came from a good family... and I didn’t. That’s why.</p><p>But how long could I use that excuse? It wasn’t that my family wasn’t good, they just weren’t there. I was an adult, I shouldn’t need them, but I did. I wished my dad were here so I could talk to him. I wished I could ask my mom for advice on this girl stuff. Austin had the best set of parents. They rented this house to us for next to nothing, as long as we followed their rules, and they helped him pay for college and his car. That’s how parents should be. Helping their kids out, and in return, the kids follow the rules. Even into adulthood. But instead, I was on my own in the world.</p><p>But wasn’t Mina alone in the world, too? I guessed I had finally got to the bottom of what Mina had been hiding. I just never thought it would be something like this. I thought maybe she had another boyfriend back in England or maybe she did drugs or something when I wasn’t around. I would have never in a million years thought it would be a secret fetish with filming me and taking my picture. She was a stalker, plain and simple. I shivered at the thought. Not out of fear – Mina didn’t scare me on a personal safety level – but out of the thought of how fast and hard I’d fallen for her. That had never happened to me before. I shuddered again, wondering how in the hell I was going to get over her and move past the thoughts of her beautiful face and body flitting through my damaged brain every five seconds.</p><p>“Jax, are you even listening to me?”</p> <p>I blinked twice and looked back up at Austin. He looked concerned. “I’m sorry, what was that?”</p><p>He sighed. “I was just saying I had a bad day, too.”</p><p>“I’m sorry, man. Tell me again.” I felt like such a crap-bag friend now for daydreaming while he was talking. Austin rarely said more than a few words, and here he was, telling me about his day and I couldn’t pay attention for two minutes. I sucked.</p><p>He smiled sadly. “It’s okay, it was nothing. Tell me what happened to you today.”</p><p>I leveled him with a long stare, debating on telling him about Mina. He didn’t seem to have much experience with girls, but maybe that would make him more objective. I shrugged, and started from the very beginning, from the day I met her, to the end of tonight. I did leave out a few dirty details I didn’t think he needed to know, but for the most part, I regurgitated the entire sordid tale. And incredibly, I actually felt better when I was done.</p><p>Austin had his hand to his mouth and he was staring off in space, his auburn hair catching the faint light from the dining room table across the room. He wiped his hands on his jeans and looked up at me. “So you never found out why she was filming you?”</p><p>I shook my head. “Nope, but I don’t know how a person can justify that. She’s obviously some chick who’s been stalking me for months, and I fell for her trap, hook, line, and sinker.” I used my dad’s old fishing cliché and frowned when it reminded me of him again.</p><p>Austin nodded. “It would sure seem that way. She didn’t even offer an excuse as to why?”</p><p>I barked out a humorless laugh. “Yeah, well she tried, but I just took off, man. I didn’t want to hear her mouth or any more lies that were about to come out of it.”</p><p>Austin got up and patted me on the shoulder. “I’m only going to say this because I’ve never seen one of your girlfriends more than once, but Mina seems to be more than a notch on your bedpost. I think you should let her explain one time, and if her excuse is weak and pathetic, then kick her to the curb.”</p><p>I laughed at his attempt at slang and thanked him. He grabbed his backpack and wandered into his room, probably to study.</p><p>I stared at his retreating figure and started to think about what I wanted to do. I was too restless to sit here and watch TV. Then I had an idea.</p><p>I got up to throw away the empty beer can and grabbed my keys off the table. I lit the cigarette on my way out to my truck. As I got in and headed toward Heather’s house, I wondered if I was making the right decision. I hit a stoplight and blew smoke out the window, then flicked the cigarette out, which was no more than a stub at this point. I didn’t realize I had smoked it so fast. I tapped my fingers on the steering wheel and wondered if Heather was going to think I was some stalker. That was the last thing I wanted. Yes, I had pulled her address from the form she had filled out at the shop, and yes I should have called or texted before coming over, but I just needed to talk to her.I knew Heather would think I was going over there for a bootie call but I wasn’t really, I just needed to talk to her. I wondered if I could get her to tell me the real reason she came into the shop, because I wasn’t buying the story about Trent telling her to see me. Trent had told me he didn’t send her over, and something about her ‘story’ was not sitting right with me. Plus it was a good distraction to keep my mind off of Mina. I couldn’t deal with that right now.</p><p>I rounded the corner to the small cul-de-sac she lived on and found her address easily, as there were only four houses on her street. As I pulled up, I saw a familiar little Mitsubishi parked out front next to the gold Lexus and swore.</p><p>Chapter Twenty-Eight</p><p>Mina</p><p>I pulled into Heather’s street and killed the engine. Was I doing the right thing or not by coming by her house? My need to speak to her and find out whether Jax had called her or not was eating away at my insides. But why was it so important now? He was never going to want to see me again. Not after discovering that I had been secretly taking photos and filming him. He wouldn’t want anything more to do with someone he thought was a psychotic freak with stalker issues. But we’d made love and that counted for something. It did to me, anyhow. So even if Jax never did want to speak to me again, I would still like to know if what had happened between us was real, or if it had just been a lie like it had been with John. The only way I would ever find out was if I spoke to Heather. At least then I would know if Jax had really liked me, or if I was just another one of those girls he so often snuck back to his house. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I reached for the car door handle and stopped. I had a sudden thought. What if Jax had never contacted Heather? What if he had ripped up her number and thrown it away? Then that would have meant that he had really liked me and I'd just screwed up probably the best thing that had come my way since arriving in the U.S. Whatever I discovered from Heather, I was opening myself up to a world of pain and I’d promised myself that I would never let that happen to me again. But then again, I had made a lot of promises to myself which I had recently broken. Biting my lower lip and praying that I was doing the right thing, I reached for the door handle. But once again I stopped. Not because my head was full of doubts, but because Jax's truck had just pulled into the street.</p><p>He killed the engine and I tried to quickly slink back in my seat.</p><p>But it was too late, Jax had seen me. His eyes bored right through the windshield of his truck and into mine. I had never felt so crushed before in my life. Not even when John had tricked me and my mother had sent me away. Jax had been in contact with Heather – he had seen her or how else would he have known where she lived? And why was he here now? Heather hadn't been ignoring my calls and texts because she had the flu; she hadn’t gotten in contact with me because she had betrayed a friend. Heather had betrayed me. I felt like a fool, just like I had before. Those feelings of humiliation I had felt back home in England welled up inside of me again. I made fists with my hands. My fingernails dug into my palms, but I was numb to the pain. My heart ached too much. Jax had had sex with me only a few hours ago and now he was here outside Heather’s house looking for more. Hadn't the sex we shared been enough? Hadn't I satisfied him? Evelyn had been right about Jax and I should have listened to her.</p> <p>Feeling angry at myself for being such a naive fool again, I pushed open the car door and climbed out. With hands still clenched into fists, I marched across the road to where Jax sat in his truck. He didn't take his eyes off of me once. I banged my fist against the window of his car and he dropped it an inch.</p><p>\"What do you want, Mina?\" he asked.</p><p>\"What are you doing here?\" I demanded, feeling my cheeks flush red with anger.</p><p>\"I could ask the same of you,\" he said, taking a pack of cigarettes from his pocket and lighting one. I didn't know Jax smoked, but why was I surprised by that? I really didn't know anything about him despite the hours I had spent watching, photographing, and filming him.</p><p>\"I've come to see my friend Heather,\" I said, not knowing if I should have confessed to knowing her. But I wasn't exactly thinking straight.</p> <p>\"Me too,\" he smiled and I wondered if he said that just to hurt me.</p><p>\"So you know her well then?\" I fished, placing my hands on my hips.</p><p>\"No, not really...\" he started.</p><p>\"So you always turn up late at night to see girls you don't know that well?\" I sneered at him through the window. He blew smoke from the corner of his mouth and it wafted through the gap. I swatted it out of my face.</p><p>\"If you must know, I hadn't met her until the other day when she showed up at work...\" Jax began to explain.</p><p>\"So you only met her a couple of days ago, and here you are already!\" I cried in disbelief. \"Me and you were only having... we were only sharing my bed together a couple of hours ago, and all the while you were planning on coming over to see...\"</p> <p>\"Just shut up a minute, will ya?\" Jax cut in. \"I didn't come over here tonight to get laid. This friend of yours told me that a buddy of mine had recommend I do some work on her car, but he had never heard of her... so I got to wondering... something didn't fit quite right....\" He broke off and stared at me.</p><p>\"What?\" I said, feeling uncomfortable now and wishing that I hadn't come out to Heather’s after all.</p><p>\"I came here tonight, Mina, because I think in my heart I knew it was you who got Heather to pay me a visit at the auto shop,” he breathed, as if the final piece of a jigsaw had been slotted into place.</p><p>\"You don't know what you're talking about,\" I said and turned away from the truck.</p><p>Before I'd even taken two steps, Jax had thrown open the truck door, leapt out, and grabbed me by the arm. He spun me around to face him.</p><p>\"My God, Mina, what is wrong with you?\" he said, searching my eyes as if looking for the answer to his question.</p><p>\"I don't know what you're talking about,\" I lied.</p><p>\"You know exactly what I'm talking about,\" he growled, gripping my arm tighter.</p> <p>\"Let go, you're hurting me,\" I said, trying to pull free of him, desperate to be back in my car. Not because I was scared of Jax, but because I knew he had figured out what I had done.</p><p>\"Heather was some kinda test you set for me,\" he said looking shocked and hurt. \"It was a trap.\"</p><p>\"I just wanted to be sure that I could trust you,\" I said, knowing that whatever excuse I gave, it would sound pathetic.</p><p>\"Trust me?!\" he said in disbelief. \"It's you, Mina, who can't be trusted. It's you who has been sneaking around, lying and setting traps. You're the liar and the fake, not me.\"</p><p>With the same look of hurt and mistrust I had seen in my mother’s eyes, Jax let go of my arm and headed back towards his truck.</p><p>\"You once said that you thought I had a secret and you found that exciting about me,\" I called after him. I didn't want him to leave, because if he did, he would never come back to me.</p><p>\"That's before I knew you were some kinda freak!\" he shouted without looking back.</p><p>To hear him call me that felt like a punch to my face. That's what I had always been called. I couldn’t hold back the tears which were now standing in my eyes. They spilled onto my cheeks. \"Didn't tonight mean anything to you?\" I said as he climbed behind the wheel of his truck.</p><p>Jax slammed the door shut.</p><p>\"I didn't mean to hurt you, Jax,\" I said, choking back my tears. \"I never meant to hurt anyone.\"</p><p>\"No wonder your mother couldn't wait to get rid of you,\" he said back, his voice sounding hard and unforgiving.</p><p>His words were like a blow to my body and I flinched backwards.</p><p>\"And you're just like my mum,\" I said. \"She never gave me a chance to explain. She didn't want to know the truth, because just like you, she wouldn't have been able to understand it.\"</p><p>Jax fired up the engine of the truck. He didn't seem interested in anything I had to say. And I couldn't blame him for feeling like that. I went to the window one last time.</p><p>\"Come back to my place, Jax...\" I blurted out.</p><p>\"What for? So you can make another one of your creepy movies?\" he sniped. \"No thanks.\"</p><p>\"Watch those films with me...\" I started.</p><p>\"This just keeps getting weirder and weirder,\" he groaned, steering the car away from the kerb.</p><p>I let go of the window. \"If I meant anything to you, Jax, just come back to my place so I can explain... so I can show you...\" I called out, watching his bright taillights head away up the street. With my heart sinking in my chest, I knew that it was over. Jax didn't want to know the truth, and he didn't want to know me. With my head down, I made my way back towards my car. As I yanked open the door, I heard the sound of an approaching engine. I looked up to see Jax's truck reversing back down the road towards me. Had he come back to call me a freak again?</p><p>Jax drew level with me. \"I'll give you five minutes,\" he said, eyes dark and face stern. \"I'll follow you back to your place. But I promise you one thing, Mina, if I think for one minute that you are filming me, taking pictures, or anything else remotely stalker-ish, then I'm gone.\"</p><p>\"I promise,\" I said.</p><p>\"Five minutes,\" he warned me again.</p><p>\"Okay,\" I nodded, wondering what I had done to deserve this second chance. I climbed into my car and steered away from the kerb, Jax following close behind in his truck.</p><p>Chapter Twenty-Nine</p><p>Jax</p><p>I was gonna do it. I was gonna drive off and leave her ass standing there crying. I couldn’t believe after the stalking, the photos, and the videos – now I had to deal with her setting traps for me. I didn’t need that crap at all.</p><p>It had hit me as I pulled up and saw her car. She knew Heather. How could it be? My brain had begun to buzz. There was only one explanation for it; she had sent Heather to the shop to test me. That’s what it was all about. The pieces came together like tumblers in a lock. Nobody is that stupid to not know that a squeaking sound when you step on the brake means you need new brakes. I mean, seriously, nobody’s that blonde. I should have told Barbie to F-off.</p><p>I don’t know if it was curiosity or Austin’s words ringing in my ears that made me back up and decide to give her five minutes of my time – maybe it was both – but Mina mentioned her mother again. What had happened there? She had never told me. Yet another dark secret she was keeping. I just didn’t see how she was going to explain away the videos and pictures she’d been taking of me without my knowledge or consent. Who does that and has a sane, rational explanation for it? Perhaps she was insane and her explanation made perfect sense to her in her own mind.</p><p>I flicked the cigarette, along with Heather’s card, out the window, letting the hot summer wind catch both. I’d smoked three in the last thirty minutes and decided I was pitching the rest of the pack in the trash. Damn addictive cancer sticks.</p><p>I was overthinking this whole thing. I’ll go to her house, let her speak, then leave. Then I could tell Austin I had heard her out and be satisfied with myself that I let her explain, say her peace. Then I’d move on with my life and go back to being the terminal bachelor I’d been before Mina had crashed into my life and turned my once even, steady emotions upside down and inside out.</p><p>I killed the engine to the truck and got out, walking to the front door. Her car was already in the drive, and the front door was open so I walked in without knocking.</p><p>I saw her fiddling with the DVD player, hooking up a thick, gray cord from her laptop to the player and the TV. She grabbed a remote and flipped the TV on, where there was nothing but snow. She hit a few buttons on the laptop and the screen flicked to life. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My stomach did a summersault when I saw myself sitting at the Denny’s restaurant from our first date. I guess it had been our first date, the night she’d most likely stalked me and followed me to Rowdy’s. She had the sound muted, which was good because I hated the sound of my own voice. The camera was a bit wobbly and it was making me dizzy to watch.</p><p>I looked over at Mina, who still had not said one word to me, and was watching the screen with intensity.</p><p>I sighed. “Mina, I really don’t understand...”</p> <p>“Shush!” she barked.</p><p>I raised my eyebrows and shook my head, looking at my watch. She had four minutes left.</p><p>“Look!” she yelled, pointing the remote at the screen.</p><p>I jerked my head up from where I’d been staring at my watch and saw the same thing I’d been looking at before, me at the restaurant. I squinted at the screen. “What am I looking at, Mina?” Crazy, I wanted to call her.</p><p>She walked to the large 50-inch flat screen and tapped it with the remote. She was trying to draw my attention to something behind my left shoulder on the screen. I walked closer and looked. I suppose I did see something, it looked like a dark hazy shadow behind me.</p> <p>“This is what I see, Jax. All the time. Not just with you, but with lots of people. This is why my mother sent me away. She thought I was crazy and insane, just like you do.” She fixed me with a hard stare, which was beginning to soften with tears.</p><p>“So there’s a shadow behind me, maybe someone walked behind me...”</p><p>She stomped her foot and huffed. I had to admit it was kind of cute and I had to purse my lips together to keep from laughing. “Someone did walk behind you, Jax! They are spirits, okay?”</p><p>Now I couldn’t help but smile. “Spirits, Mina? Really?” I shook my head and fished my keys out of my pocket, turning toward the front door.</p><p>She ran around the sofa and grabbed my arm. “No. Don’t leave, please, I need to explain more.”</p><p>I looked down at her delicate, pale hand gripping my large tattooed bicep and then back into her glistening blue eyes. I raised an eyebrow. “Spirits and shadows. This is why you’ve been filming me?”</p> <p>She nodded, a pleading look in her eyes. “I have dozens more I can show you.”</p><p>“I bet you do,” I snarled under my breath.</p><p>“Please, Jax. Please sit. I can’t go through this again. This,” she pointed the remote at the TV, “has always made me different. I don’t want to see these things. I hate that I can see these things. You were right when you called me a freak earlier. I am a freak. Been hearing it my whole life. My mother, my friends. I just stopped telling people what I saw because it made me different. It made people distance themselves from me. I hate it. I hate it so much.” She dropped her head and I could tell she was fighting back a sob.</p><p>As angry as I still was, I had to fight the urge to hug her, to comfort her. She seemed broken, but genuine somehow. Whether or not this story of hers was true, one thing was for sure; she certainly believed it. So I could no longer think that she was a liar or not trustworthy. Maybe she was just a little disturbed. Some small piece of sympathy worked its way up out of my hardened heart and settled into my head. With a sigh, I grabbed her hand and led her to the couch. I supposed I could appease her for a little longer before I walked out of her life for good.</p><p>“Okay, show me more,” I said.</p><p>Her face lit up. “Really?”</p><p>I nodded.</p><p>She fumbled with the laptop some more, seeming to be fiddling through more files on the hard drive, and pulled up one of me at Starbucks. I was sitting with my own laptop, playing computer games. It was the day I’d met her, I was sure of it.</p> <p>She stood by the TV and pointed to the empty chair next to me on the screen. “See that shadow? Someone or something is sitting there with you.”</p><p>I sat forward, my arms on my knees, and stared at the TV. I had to admit, it sure looked like there was some sort of shadow sitting there in the chair. A shiver ran up my spine. It was pretty creepy. But then I started to wonder.</p><p>“You added those shadows, didn’t you?” I asked, skepticism coloring my tone.</p><p>She gasped. “I did not!”</p><p>“How is this possible?” I asked, jabbing a finger at the screen. “I don’t believe in this shit. I mean, like, at all! Ghosts, spirits, et cetera. I believe when we die, we die. There is nothing else. This looks like someone’s idea of a joke.”</p><p>She shook her head and sighed. “I can’t explain it, Jax, but it’s been happening my whole life.”</p><p>I nodded. I wasn’t sure what to think now. She looked so sincere, so honest. Not crazy or stalker-ish. Just desperate and almost grief-stricken.</p><p>“Is this what made your mom send you away?”</p><p>“Yes,” Mina nodded.</p><p>Chapter Thirty</p><p>Mina</p><p>I knew Jax wouldn't believe me unless I told him everything. To do that, I would have to go back to the very beginning. Jax sat on the sofa and looked at the TV. The image of him in Starbucks with the black shadow was frozen on the screen like they had both been caught in time. Jax looked at me and I could see the disbelief in his eyes. But there was something else, too. I could see pity. I didn't want his pity; I just wanted him to believe me.</p><p>So, turning to look at him, I said, \"When you were a kid, did you ever have one of those viewfinders?\"</p><p>\"A viewfinder?\" He sighed as if I really had lost the plot. \"What's a viewfinder?\"</p><p>\"One of those kids’ toys,\" I started to explain. \"You know, they look like a chunky pair of glasses. You can put discs in the front which have different pictures on them. There is a small handle on the side that you press with your thumb, which makes the disc go around so you can see the pictures...\"</p><p>\"Look, this all very interesting, Mina,\" Jax said, “but I didn't come back here to discuss your vintage toy collection.”</p><p>\"Let me finish, please, Jax,\" I said, hoping that I didn't sound as if I were pleading with him. Perhaps I was. \"Well, we had one of those viewfinders. My dad got me one for Christmas when I was about six. It was a Barbie one. But I never saw Barbie through that viewfinder. I saw the dead. At first I thought they were shadows or that perhaps the toy was broken. I asked my mum to look through it and asked her what she could see. My mother tossed it to one side and said that all she saw was a plastic doll that looked borderline anorexic. So I asked my father. He took me onto his knee and asked what I’d seen, and I told him I saw dark shadows that looked like people. When I went to bed that night, I think he threw that viewfinder in the trash or hid it from me, because I never saw it again, and to be honest, I was glad about that.</p><p>\"On my tenth birthday, my parents bought me a camera. I think my father got it for me because he was bringing me out here to Florida and I could use it to take pictures with. My mother came over too, but she spent little time with us. She spent most of it here at my uncle’s house while she tanned herself by the pool. That was the last holiday we all spent together.</p><p>“My father died of cancer soon after arriving back in the UK. It wasn't until after my father’s death that the film from my camera was developed. It was before digital cameras had come into fashion. When I went to collect the prints with my mother, I was excited and scared to see those photographs. I was excited about reliving those memories of that time I had spent with him, but I was also scared that those photographs would only add to my sense of loss that I felt since his death. I was not close to my mother and I missed my father with all my heart. Back at home and in my room, I pulled the photographs from their packet. In every photo of my father, there was a black smudge. At first I thought that the developer had left behind a dirty thumbprint, but in my heart I knew it wasn't so. I could remember the shadows I could see through my viewfinder as a small child. But the smudges in the pictures of my father were different. They were clearer. And as I worked my way through the packet of photographs, I was convinced that I could clearly make out what looked like a shadowy looking man standing in each of the pictures behind him.</p><p>\"The following day I went to the local store and bought myself a magnifying glass. Back in the privacy of my own room, I restudied those pictures. My heart nearly stopped in my chest and I dropped the magnifying glass as if it had scalded my hand. The man standing behind my dad in the pictures was my grandfather. What scared and upset me so much, was that my grandfather had been dead for more than five years already. Clutching the pictures, I took them to show my mother. I spread them before her over the kitchen table. I asked her what she could see, and of course she said my father. But I pressed her and told her to take another look. Again, she said she could only see my father. With trembling fingers, I pointed out the dark smudges. And just like you, Jax, my mother said they were nothing more than shadows. When I produced the magnifying glass and pleaded with her to take another look, she snatched it from my hand, collected together the photographs of my father, and told me that I was grieving and should snap out of it or she would take me to see a child psychiatrist. Just like my viewfinder, I never saw those pictures or the magnifying glass again,\" I told Jax.</p><p>\"Let's pretend for one minute that I believe any of this,\" Jax said. \"Why do you think your grandfather was in those pictures?\"</p><p>I looked at Jax and I thought – hoped – that perhaps he was starting to take some of what I said seriously. He hadn't left yet. He was still seated on the sofa and listening to me. \"I think... believe... that he was in those pictures because he knew my father was dying of cancer. My father didn't know himself, but he was diagnosed soon after returning to England. I think my grandfather knew my father would soon be dead and he was waiting for his son to pass over.\"</p><p>\"Your mother didn't send you packing because of those photos?\" Jax asked.</p><p>\"No, not because of those photographs,\" I said, lowering my gaze. This was going to be the hardest part of my story to tell.</p><p>\"What photos then?\" he persisted. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I took a deep breath and said, \"I took photographs of her boyfriend,\" I began to confess. \"For my seventeenth birthday, my mother bought me an iPhone. It was so she could contact me. She was often away with her boyfriend, John. A few days after my birthday, I was messing about with my new phone and I happened to take a picture of John as he strolled into the living room. Later, I was deleting pictures from my phone when I came across the picture of him and my heart froze in my chest. Just behind John was one of those smudges. I'd almost convinced myself over the last seven years or so that perhaps my mother had been right and I had just simply been grieving the loss of my father. So you can imagine how horrified and upset I was when I saw those smudges again. I needed to know if they were real. So casually, at first, I would snap photos of my mother’s boyfriend every chance I got, and each time, that same dark smudge would appear just behind him. The more pictures I took, the clearer those smudges became, and I knew they were taking on the form of a woman, but I didn't know who. Then, by chance or accident, as I readied myself to take another picture of John, I set my iPhone to video camera instead. When I watched the footage back, I nearly screamed with fright. The smudge was moving like it was alive somehow. It scared me so much that I couldn't pick up my phone for days. I hid the phone under the sofa cushions.</p><p>\"But something else happened which I couldn't have foreseen. John came to believe that I was taking his picture so often because I had become infatuated with him. He was younger than my mother by about ten years and he was very handsome in his own way, but I never had any feelings for him other than friendship. Then that Christmas, and feeling a little lightheaded and giggling, I had gone up to my room to lie down. As I swayed along the landing, the door to my mother’s bedroom door opened and I was suddenly grabbed by the wrist. John pulled me into the darkness of my mother’s room and began to kiss me. To my shame, I kissed him back. Not only because I was a little drunk, but because it felt nice to be kissed. I had never been kissed in that way before. No one had ever asked me out on a date, let alone wanted to kiss me. So I didn't put up much of a fight as he pushed me down onto my mother’s bed and climbed on top of me. Before I knew what was happening, his hands were all over me and he was hitching my skirt up around my waist and yanking down my panties. It was then, as I opened my eyes and peered over John’s shoulder, that I saw my mother standing in the open bedroom doorway.</p><p>\"Throwing her hands to her face, she cried out and called me a filthy little whore. She said that she suspected this day would come, as she had recently found my phone beneath one of the sofa cushions and had seen the hundreds of pictures of John that I had snapped. Hearing this, John blamed me for what happened. He claimed that for months I had flirted with him. He told my mother how he warned me off, but I hadn't listened. Then that night, I had followed him upstairs and gone into the room that he shared with my mother and had pulled him down onto the bed and onto me.</p> <p>\"My mother believed him. Thinking about it now, I wonder if she really did, though. It was easier for her to blame me for what happened, because if she didn't, that meant she would have to face the harsh reality that her young lover found her daughter more attractive than her,\" I said.</p><p>I lifted my head and looked across the room at Jax. He was staring right back at me. He looked angry. He looked disgusted. To see that look hurt me, and without warning, a gush of tears streamed down my face. It was like all the hurt and resentment I had been feeling about my mother and John had finally been released while confessing my secret to Jax. Even if he did find me disgusting for what I had done, at least I had told him the truth, whether he believed what I had told him or not. I lowered my head again and covered my face with my hands as I continued to sob. Suddenly I felt Jax's arm slide about my shoulder and pull me close.</p><p>\"Shhh,\" he whispered softly in my ear.</p><p>I couldn't even begin to describe how it felt to have him hold me. It didn't necessarily mean he believed what I said, but it did mean Jax cared, and that was enough for me at that moment.</p><p>\"Did you ever find out who the woman was you thought you saw in the pictures of John?\" he asked gently.</p> <p>\"I can't be sure, but just after arriving here, I overheard my uncle and aunt discussing my mother and John. They had recently been to a funeral.\"</p><p>\"Whose funeral?” Jax asked, his arm still about my shoulder.</p><p>Still unable to make eye contact with Jax, I said, \"Apparently John had an estranged twin sister. She had gone missing – fallen in with the wrong group and got into drugs. I'm not really sure, as I only caught the tail end of my uncle and aunt’s conversation, but I do know that John’s sister had been found dead of a heroin overdose in some disused block of flats. She had been lying there undiscovered for about six months or more.\"</p><p>\"So is that who you believe you saw in the pictures?\" Jax asked.</p><p>I nodded and mopped away my tears with the sleeve of my sweater.</p><p>\"So that's why you have been taking pictures and filming me?\" he asked.</p> <p>\"Yes,\" I whispered back. \"It started when I took a picture of my friend Evelyn about a year ago when you were still at school.\"</p><p>\"Before I dropped out you mean?\" Jax cut in.</p><p>I nodded again. \"By accident I captured you in that picture, but it was what I could see behind you that caught my attention. There was a smudge. I was terrified that it was happening again. So I started to secretly take pictures of you in the hallways and in lessons at school. But then you left. So I started to follow you, but only because of what I could see in the pictures I took of you. But as I followed you, it was like I got to know you somehow. I got to see into your life. I think I fell in love with you, Jax. So I did bump into you in Starbucks that day, not so I could take better pictures of you, but because I wanted to really get to know you. I wanted to be close to you. I didn't go on those dates with you just so I could take pictures; I went on those dates because I wanted to be with you, Jax. When we were together in your house the other day, I didn't stop because I wasn't enjoying what you were doing to me – I stopped because we weren't alone in your house. That shadow was in the room with us and it freaked me out, but I couldn't tell you that. I needed more proof. So I invited you here tonight and set up as many cameras as I could, hoping that I would finally get a clear enough picture of that smudge – shadow – so you would believe me when I told you my secret.\"</p><p>Jax sat beside me without saying a word. It was like he was taking some time to absorb everything I had told him. Then very slowly, he slipped his arm from around my shoulder and said, \"So you believe all these shadows you've seen have been dead people, right?\"</p><p>\"Right,\" I said, still unable to look at him.</p><p>\"So if these shadows, or smudges as you call them, are dead people, who is the shadow standing behind me in the pictures?\" Jax asked me. \"Are you trying to tell me it's my mother because you know she is dead?\"</p><p>This time I did turn to look at Jax. Slowly, I shook my head and said, \"It's not your mother in the pictures, it's your father.\"</p><p>\"No!\" Jax said jumping up. \"My father is just missing. He’s gone off on one of his drunken fishing trips and...\"</p> <p>\"No, Jax,\" I said, standing up and taking his hands in mine. \"Your father isn't just missing, he's dead.”</p><p>Chapter Thirty-One</p><p>Jax</p><p>I started to feel sick to my stomach for so many reasons. First of all, because of what Mina was telling me. I couldn’t believe she had been seeing these shadows and smudges in photos since she was a child. It was frightening for me to listen to, so I couldn’t imagine what a child must have felt.</p><p>Then she started in with the story of her mother’s boyfriend. Her mother sounded like an absolute bitch anyway, so the fact that she sent her away didn’t shock me, but it did make my stomach turn over. But when Mina started to sob, I just couldn’t continue to be the dick I had been for the past few hours. I let my guard down and went over and pulled her in my arms because I couldn’t stand to see her like that. Obviously I felt something for this girl, and it wasn’t something I was gonna be able to just turn off and walk away from.</p><p>As she spoke, and I listened to her go on about ghosts, spirits, and dead people in that mesmerizing accent of hers, I stared at the frozen TV screen and at that shadow occupying the chair next to me and asked myself if I believed in what she was saying. One thing I did know; she wasn’t lying. She truly believed what she was saying, so maybe she was just a little crazy. But I knew in my heart she wasn’t. She was as serious as cancer, and thinking about that made me pray to all that was holy that it was my mother’s spirit she thought she saw following me around. It gave me an odd comfort somehow to think she had been watching over me, if that’s what – or who – it truly was.</p><p>So that got me thinking that maybe she really was making up this stuff. After all, Mina knew my mom was dead, we’d discussed it. It was an easy out, a convenient answer. But couldn’t she have made up any excuse as to why she had been following me, photographing me, videotaping me? Like she thought I looked like someone she knew, or some celebrity from England I’d never heard of, or her dead imaginary brother? But no, she chose to tell me this. That she sees spirits. Who makes up stuff like that? Either it’s true, or she’s lost her freaking mind.</p><p>As she began to cry, I held her, and asked about my mother. When I felt her shake her head no, I looked down into the pools of her blue eyes and saw a deep sorrow, laced with something close to fear. She had said it was my father, and the tone she said it in was colored with absolute certainty.</p><p>I almost fell down. I had to sit. I had to get my head between my knees before I made an ass of myself and puked all over her aunt’s swirly red floor rug.</p><p>“No, Mina. My dad’s not dead. You don’t understand. He’s just missing,” I said, trying to convince myself more than her. It was the lie I’d been feeding myself for a year so I wouldn’t have to come to grips with what I knew in my heart to be true. Denial had been a comforting blanket I’d wrapped myself in every day and it was now coming apart, thread by thread. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She came to sit next to me, this time, her turn to comfort me. She soothed me and shushed me like a mother comforting a child, and laid her head on my shoulder, rubbing my tattooed forearm, stroking her fingers along it gently.</p><p>I looked at her and said something I never thought would ever come out of my mouth: “How can we tell for sure if the ghost around me is my father? Is he here right now?”</p><p>She shook her blonde head. “No, he’s not. And I just know, Jax. The video doesn’t capture half of what I see. Because I am now hyperaware of what I’m seeing, I’m able to make out more detail than what you see there.” She pointed at the TV.</p> <p>“Do they speak to you?” I asked, warming up to the idea, but still feeling like I too was losing my mind.</p><p>She shook her head. “Never. They don’t really even interact with me or acknowledge me. They just sort of shadow the person, and I’m able to see them.”</p><p>I took a deep breath, trying not to freak the hell out. “So what does this person following me around look like?” I asked, still unable to admit it might be my father.</p><p>Her eyebrows knit together and she looked down, as if she were trying to recall. Or perhaps she was stalling. After a very long, uncomfortable pause, she began. “Shorter than you, a goatee like yours but thicker in places. He’s wearing some sort of baseball cap on his head with a lighter color on the front of it with some sort of bird on it. It’s darker on the bill and the sides. A plain colored T-shirt and denims, and boots that look like they’d seen better days.” She looked up at me with expectant and sad eyes.</p><p>My head began to spin. My dad never took off that damn Atlanta Falcons ball cap. It was black with a white patch in the front and the Falcons’ bird in the center. He did have a goatee like mine, but his went around his mouth with a moustache, whereas mine was just on the chin. Jeans, T-shirt, and boots were all he ever wore.</p> <p>I stood up. “I... I need to go.”</p><p>I started to walk away and Mina grabbed my arm. “No, Jax. You need to stay here. I can help you.”</p><p>Something in me snapped. “Help me! You’ve done quite enough! I need to go try to find my father’s body and give him a proper burial so I can move on with my life!” I raked a hand through my hair and paced the floor, unsure what to do, where to go, how to cope.</p><p>She stood up. “Then I will go with you.”</p><p>“No, Mina, this isn’t your problem. You don’t need to deal with this. I do. It’s time I dealt with this. I can’t have you in this with me. It’s too ugly, too hard...”</p><p>Her eyes were glistening with tears again. I hated it when she cried. I had to swallow hard to keep it together. I was about to lose it.</p> <p>“I insist, Jax. I need to do this. I need to help you.”</p><p>I took a deep breath. “I’m sorry. I’m... I just...”</p><p>She hugged me. “I know. It’s awful. When my father died, I died a little too.”</p><p>Chapter Thirty-Two</p><p>Mina</p><p>Closing my eyes and holding Jax in my arms, I leant forward and kissed him gently on the mouth. I had seen the pain in Jax's eyes as he struggled with the idea that his father was dead. It hurt me to see how his eyes had closed over and his lower lip had trembled. I saw vulnerability in him that perhaps I had suspected was always there, but hadn't seen before. I knew that there was a deep and sensitive guy beneath his skin of tattoos and piercings.</p><p>For now I wanted to pull that skin back and love the man that lay beneath. Unlike my mother, he hadn't pushed me away. Jax had stayed and listened to me and had given me a chance to explain, and that meant more to me than I could ever try to tell myself or him. Just that simple act of kindness he had shown by slipping his arm round me as I told him the truth about what had happened between me and my mother's lover. Most guys would have gone running for the hills and believed me to be a whore, just like my mother had done.</p><p>With tears now running down my cheeks, I kissed him so tenderly. He kissed me back – but not with the passion of a few hours ago. He took his time, his lips covering my whole mouth, exploring my cheeks, the whole of my face. He pulled me against him, enclosing me in his strong arms.</p> <p>For the first time I could remember, I felt safe – needed – loved. This wasn't fake like it had been with... I pushed him from my mind. That was in my past and it was time it stayed there.</p><p>As Jax pulled me close, it felt as if he was absorbing all the pain I had felt at the loss of my father and the rejection of my mother. How I had longed just to be held like this – for it to be real. I held him just as tight as we kissed. I wanted to take away his pain too – the pain I knew was going to come for him and grip his heart like a cruel fist. For now I wanted both of us not to feel anything but tenderness and an affection that would shield us from whatever lay ahead with those smudges I had seen.</p><p>Locked in each other's arms, we sunk slowly to the living room floor and onto the soft carpet. We lay side by side, Jax losing his fingers in my long hair. His touch was soft as he ran his hands over the curve of my neck. He let his fingertips glide slowly over my skin – not rushed or desperate.</p><p>Tracing his lips over mine, he brushed them over my cheek and towards my ear. \"I believe you, Mina,\" he whispered. \"I do believe you.\"</p><p>To hear this brought more burning tears to my eyes. It was the acceptance I had always craved and longed for. For the first time in my life I no longer felt insane – like the freak I had so often been accused of being. In some way it made me believe in myself too. Deep in my heart I knew that I had always doubted myself. To have others doubt you was painful enough, but to doubt yourself could be crippling. How could I ever expect anyone to believe what I saw through my camera if a part of me – however small – doubted it too?</p><p>\"You have no idea what those words mean to me,\" I whispered, looking up into his eyes as he drew himself up onto one elbow so he could look down at me.</p><p>\"I think I do,\" he whispered back, wiping the tears from my face with his thumbs.</p><p>\"I've wanted people to believe in me too. I know what people think of me. I know what people like your friends think of me. They think I'm a hammerhead – a jackass who is only fit for getting his hands dirty beneath the hood of a car. Guys like me don't have feelings; we're only good for drinking and sleeping around.”</p><p>“Although we have led two different lives on two different sides of the world, we are more alike than perhaps either of us first thought. I like us being alike.\" I tried to smile up at him.</p><p>Jax didn't say anything at first. He just stared down into my face like he was thinking deeply about something.</p><p>\"What are you thinking?\" I asked.</p><p>\"Before, when you were talking, telling me about the smudges,\" he said, his voice, low and eyes never leaving mine. \"Did you mean what you said?\"</p><p>\"About what?\" I asked, wondering what part of my story he suddenly doubted.</p><p>He took a deep breath. \"You said that when you started following me – photographing me and stuff – that you never thought you would end up falling in love with me. You did say that, didn't you?\"</p><p>I nodded, my heart speeding up a little.</p><p>\"Good,\" he whispered, slowly leaning forward and placing his lips over mine.</p><p>Chapter Thirty-Three</p><p>Jax</p><p>As we melted together to the floor, I realized that Mina and I were more alike than perhaps I’d believed. When I first met her, heard her accent, watched her cautious movements... I thought we were nothing alike. We had the attraction, but would that be enough? Would we have this whirlwind relationship and then find we had nothing else in common? It happened a lot more than people admitted, and that was not the ending I wanted for our story.</p><p>But as she told me about these smudges she sees, how she’d been rejected by her mother, how she’d been called a freak and felt like an outcast, I realized we definitely were more alike than I had thought. Not that I felt like an outcast, but just the opposite. It was a long time ago I had admitted to myself that the tats, the piercings, the motorcycle... they were all just a cover to try and fit in, to hide the insecurities that lay deep within me. I literally wore my insecurities on the outside of my body, while Mina kept hers hidden deep inside. There was nothing she could hide from me now. I knew what her secret was, and I knew why she felt the need to hide it.</p><p>And I believed her. If she believed she saw these... ghosts... or whatever they were, then she did. She described my dad to a tee and broke my heart into a thousand pieces in the process, but maybe it’s what I needed to hear to bring my heart up to speed with what I already knew in my head. Dad was gone and now it was time to find it in me and let him go, say my goodbyes and try to mend my damaged and wrecked heart. I hoped Mina would be there with me for the journey.</p><p>But I wasn’t going to think about that right now. I looked down into Mina’s eyes and let my thumbs clear a path through the wet trail leaking down her flushed cheeks. She admitted she loved me, and now it was time for me to admit that I had fallen for her, too. I leaned over and gently kissed and licked away each tear, and heard her let out a soft sigh.</p><p>I slid my hand up and ran my fingers through her silky golden hair. Leaning down, I brushed my lips with hers and then softly licked her lips. She opened them for me and I nipped at her bottom lip before fully crushing my mouth on hers, gently snaking my tongue into her wet and willing mouth.</p><p>I felt her hands reach under my shirt and rub the skin on my back. Her hands were warm and soft, and when they slid down and began to slip between my beltline and my skin, I groaned into her mouth. I broke the kiss, and with my right hand, I reached behind my head and pulled my T-shirt off my back in one tug and threw it to the floor. It was time to feel skin on skin, so I slowly slid my hands up her bare belly and pushed the sweater she was wearing up and off. For good measure, I unhooked the bra and let it fall loosely to the side. I looked at her lying there, bare shoulders, her beautiful breasts on display.</p><p>My pants became even more uncomfortable. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I leaned back down and kissed her again, gentle kisses as she breathed under me, her pulse speeding up, matching mine. All the problems of the day, all the heartache and gut-wrenching hurt I’d felt over the past few hours melting into a puddle between us, both of us absorbing the pain into each other. Her kisses and touches seemed to be just as needful as mine; needy but not urgent.</p><p>I reluctantly broke the kiss once again and pulled her pants off. Before I could come back down to capture her mouth again, she reached for my belt buckle and pulled to release it, along with the snap on my jeans. I helped her get them off.</p><p>At this point, we were sitting, face to face, looking at each other. Her eyes were a mixture of longing, lust, and something close to desperation. That desperation wasn’t one of sadness, though, more like she was searching my brown eyes for acceptance. A grin twitched on the side of my mouth and I reached for her hands. She looked down as my strong, calloused fingers gently clung to her soft, pale, untouched ones.</p><p>“I’ve fallen for you, Mina. If this is love, then I love you, too.”</p> <p>Another tear slid down her face, and this time it didn’t break my heart. I knew it was out of happiness at my words and not at the horrid pain she’d had to relive by telling me her story.</p><p>I was still in disbelief over the treatment she’d received by her mother. And that creep of a boyfriend her mother had. If I ever met him, I’d fold his teeth back with my fist. What a spineless loser. How could anyone treat another person that way, especially the fatherless child of someone you claimed to love?</p><p>I could only imagine how much she must have missed her father during those hard times. The same way I missed my mother, my soft place to fall when I needed a sympathetic ear or a home-cooked meal. And now we were both essentially adult orphans, and all we had was each other. We would have to be each other’s friend, lover, and everything in between. The thought of that both excited and terrified me. This girl was something else, and if I put everything I had into her, would we both come out of this unscathed?</p><p>I wasn’t going to think about that right now. I wanted her heart and needed her body and I was going to have both.</p><p>I pushed her back on the soft rug and crushed my body down on hers, the skin on skin feeling amazing. I kissed her again, hearing her soft sighs and moans as they vibrated through our kisses. I ran my hand down the warm skin of her stomach and sides and stopped when I got to her lacy panties. I tickled her stomach with my fingers and she sucked in a breath.</p> <p>“Take them off, Jax, I need you. Now,” she said in that sexy-as-hell accent.</p><p>I didn’t need to be told twice. I slid them down her creamy thighs and let my fingers explore the area between them.</p><p>She groaned when I found the soft core of her body and I felt the fingers of one of her hands digging into my back, the other tugging on my briefs. I helped her with those too, and as soon as I lay back down on her, she opened up for me. I quickly found myself submerged in her soft, willing body.</p><p>Clasping her hands in mine above her head as I had done before, I felt her move in perfect time with me, her hips meeting mine in an erotic dance that was so new and exciting, yet so familiar and sensual.</p><p>It wasn’t long before she broke the kiss and arched her head back, moaning softly. “Oh, God...”</p><p>That put a smile on my face and I kept up the pace, hoping to hear it again soon.</p> <p>I removed one hand from hers and slid it up her stomach and cupped one of her gorgeous breasts, easing the palm of my hand over her beaded tip. She moaned again, so I didn’t stop.</p><p>She peaked twice after that, until I could hold out no more. I finally lost myself in her with a series of pleasurable sensations that made me see stars. This sexy English girl truly had me unraveled, and I knew from here on out, I would be nothing more than soft, pliable minion at her complete and utter mercy.</p><p>Chapter Thirty-Four</p><p>Mina</p><p>I lay in Jax's arms. My head floated with the soft rise and fall of his chest as he drew in breath. His body felt hot and slick with sweat pressed next to mine. The sex had been different this time. It had been more than just that. I'd wanted him just as much as before, but it felt different. More real is the word I'm searching for. Everything seemed more real now. Not only mine and Jax's feelings for one another, but the smudges, too. Jax had told me he loved me instead of cursing me – shoving me away like had happened so many times before in my life. But now someone believed me, those smudges had been brought into sharper focus somehow. It wasn't just me who believed anymore. But I had only ever seen the smudges through my camera lens. I had never taken it any further – I had always been too scared – that's why I had often hidden my phone – the reason why I had pushed the laptop away from me and across the kitchen table tonight. It wasn't the shadow of Jax's father I had seen, but another. This smudge had been smaller – fainter somehow. It had been a child, a little girl. And I suspected it was my uncle’s daughter. But what good was being believed if I didn't truly understand why I saw these dead people? Why was I seeing Jax’s father? He had meant nothing to me. Why was I seeing my tiny cousin who had been knocked down and killed in a hit-and-run? Why were they haunting me? I shivered in Jax's arms at the thought of the wispy grey smudge of my uncle’s daughter as she crept up behind Jax in that video.</p><p>\"Are you okay?\" Jax asked, pulling me closer.</p><p>\"I was just thinking,\" I whispered.</p><p>\"About what?\" he whispered back, his breath warm against my cheek.</p> <p>\"I need to know...\" I trailed off in search of the right words.</p><p>\"Need to know what?\" he asked, propping himself up onto one elbow so he could look into my face.</p><p>\"I need to know why I see these people...\" I said, looking up at him. \"Why are they haunting me? Why am I seeing your dad, Jax? I didn't even know him.\"</p><p>\"How should I know?\" Jax said, looking away so I couldn't see the flash of pain reignite in his eyes.</p><p>\"I think I see him because he wants to be found,\" I said, reaching out and taking one of his hands in mine. \"Just like that other girl.\"</p><p>\"What girl?\" He asked.</p><p>\"The sister of my mother’s boyfriend... John,\" I started to explain. \"I didn't know his sister. And just like your dad, I'd never met her. But I know it was her I was seeing in those pictures, and she was later found dead on a derelict building site. I think she wanted to be found so she could be laid to rest.\"</p><p>Jax looked at me and said nothing, but I knew what he was thinking – what we were both thinking.</p><p>\"I think your dad wants to be found... I think your dad wants us to find his body,\" I said, my eyes never leaving his. \"But I don't know where to start looking.\"</p><p>Jax was silent again. Then, lowering his head and drawing a deep breath, he said, \"The only place I can think of I've already searched.\"</p><p>\"Where was that?\" I pushed.</p><p>\"By the lake where my dad used to go fishing,\" Jax said. \"I think he drank more than he fished, but he would disappear up by the lake for days at a time. But like I've said, that was the first place I looked for him when he went missing.\"</p><p>\"But it might be different this time,\" I said.</p><p>\"How?\" Jax asked.</p><p>\"Because you'll have me with you this time,\" I said, squeezing his hand in mine again. \"I could film you... watch you through my camera.\"</p><p>Jax was quiet again, as if contemplating what I had suggested.</p><p>\"You want to know where your dad is, don't you?\" I gently urged him. \"And I think he wants you to find him. Perhaps then you can both have the peace you've been searching for.\"</p><p>Then, gripping my hand, Jax pulled me to my feet and said, \"Get dressed, Mina and I'll take you up to the lake.\"</p><p>We dressed in silence. I guess both of us were lost to our own thoughts as I wondered what I might see through my camera phone and whether we really would find Jax's dad. We stepped from my uncle’s house and Jax led me across the drive to his truck. He opened the door for me and I climbed inside. Jax got in behind the wheel and glanced at me in the gloom of the cab. I couldn't help but notice how pale and gaunt his face now suddenly looked. He started up the engine and it rumbled into life.</p><p>\"Ready?\" he whispered, looking straight ahead and into the dark.</p><p>\"Ready,\" I whispered back, sliding my phone from my pocket and pointing it at Jax.</p><p>I drew my thumb over the screen and switched on the video camera. I pressed the record button. Jax swung the truck off the drive and out onto the road. For two miles or more as Jax drove us out of town, all I could see was Jax. There was no smudge – not even a blur. But as we reached the narrow and winding roads which led us out towards the lakes, a shadowy image began to appear on the seat between me and Jax.</p><p>I drew a deep breath.</p><p>\"You can see him, can't you?\" Jax asked, his eyes never leaving the road ahead.</p><p>\"Yes,\" I whispered, fearing that if I spoke too loud I might scare the shadow away.</p><p>With my skin growing stiff with gooseflesh, I watched as that dark smudge became clearer and take on the indisputable shape of a man. And as we drew closer to the lake, the shadow sitting between us became clearer and clearer. He was now so clear that I could see the white whiskers on his chin and the flecks of grey in the tufts of hair that stuck out from beneath his cap. I peeked over the edge of the phone only to find that he had disappeared. I glanced back at the phone and there he was again, sipping from a bottle of beer as he sat between me and Jax in the cab of the truck.</p><p>\"I think you were right about the lake, Jax,\" I whispered, again careful not to scare the apparition away.</p><p>\"How come?\" Jax whispered back, again not once taking his eyes off the winding roads ahead.</p><p>\"Because the nearer we get to the lake,\" I said, \"the clearer your father becomes.\"</p><p>Chapter Thirty-Five</p><p>Jax</p><p>I glanced at Mina out of the corner of my eye, shivers dancing down my spine. I felt nauseous as she described the apparition sitting between us. I wasn’t ready yet to refer to it as my father, as I still had a small amount of denial seated in my brain. I was a hard evidence man; I never much believed people had feelings or intuitions about things. I didn’t believe in fate, destiny, soul-mates, and sometimes I wondered if there was even a God. I needed hard evidence and tangible things I could touch, see, and feel. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I knew later on, when Mina showed me the video footage from her phone, I would probably flip out. But for now, I was going to keep things calm and level-headed until we reached the lake. I had to.</p><p>I was lost in my thoughts as Mina and I drove in silence. I was seemingly on auto-pilot as my truck veered to the windy dirt back road leading to state park that housed the lake.</p><p>“Is this it?” Mina asked, looking around. Tall birch and pine trees towered around us in the dark sky. “It’s so... rural and desolate.</p> <p>I smiled, but there was no happiness in it. “That’s the way Dad liked it. He’d bring an old cane pole out here and his tattered box of lures and sit for hours, drinking and fishing. We had a small metal fishing boat too at one point, but he sold it a few years back.”</p><p>Mina looked at me, puzzled. “So he would just sit on the dirt and fish?”</p><p>I laughed. “You’re such a city girl. Yes, lots of people stand or sit on the edge of swamps and lakes here and fish. It’s not uncommon.”</p><p>I put the truck in park and we got out. We were literally parked on gravel and dirt, and as I helped Mina out, I shook my head at her footwear. She had on those little flat shoes that looked like ballerina shoes and I somehow knew I’d be hearing something about her ruined footwear before the day was over.</p><p>“Yuck,” she said, walking gingerly over the dirty ground.</p> <p>“You can take your shoes off and leave them in the truck if you want,” I said, pointing at the little silver things on her feet.</p><p>She wrinkled up her nose. “Aren’t there snakes out here?”</p><p>I chuckled. “Oh yeah.” I was glad I had my boots on. “Should have told you to wear sneakers, sorry.”</p><p>“I’ll leave them on, thank you very much,” she said in that accent of hers.</p><p>I motioned for her to take my hand as we wandered from the dirt parking lot and over a small crude wooden fence that separated it from the lake. She had her phone in her hand and had switched it on to video as we walked. With one hand she held mine, with the other she held the phone in front of us. I couldn’t bring myself to look at the screen or even ask if he was still here.</p><p>We walked along the shoreline and I looked out over the lake. The sun was starting to come up, a deep orange and pink sunrise painting the edge of the water where it met the sky. A warm, humid breeze blew through us and I watched as it lifted Mina’s hair off her face. Her ponytails were gone (thanks to me earlier) and her hair looked so pretty down, especially with the pinks and reds reflecting off its white-blonde surface.</p> <p>“What?” she asked, looking up at me.</p><p>I moved some hair from her face. “Nothing. You look pretty in the sunrise.”</p><p>She blushed and looked down. “So, this is where your dad fished?”</p><p>I looked up. “It’s just up here. Just keep your eyes peeled for anything – and I mean anything – that looks out of place.”</p><p>“He’s still here, Jax,” she said quietly, sensing my unease from earlier.</p><p>“Oh,” was all I could think of to say.</p><p>She nodded as if she understood, and we walked a little further down the muddy shoreline. There were plenty of discarded beer bottles, liquor bottles, and cigarette butts and I wondered why nobody had been out here to clean them up. I supposed they could have been left here the night before and nobody had gotten a chance to clean them up yet.</p><p>“Okay, here,” I said, coming to a long wooden pier. “Dad used to take his fishing gear and walk out to the end of the pier and sit here for hours, fishing and drinking. But like I said, I’ve come out here three or four times and turned up nothing.”</p> <p>She looked at her phone and bit her lip, then looked back up at me. “He is walking down the pier, Jax.”</p><p>I shivered again and led Mina by the hand down the wooden planks, wondering what in the hell I was going to find on the pier. I could see down its long length. It was probably twenty feet long and there was just nothing there. Still, I walked down it, dragging Mina by the hand behind me, her phone up at the ready.</p><p>I got to the end of the pier and looked down into the water. I peered over the edge carefully, but I didn’t see anything there on the edge or on either side. I looked up and saw nothing but the huge lake, and a few homes scattered on the other side of it. A lot of them were nice-looking cabin type homes with fancy cars parked on the side and boat slips in their backyards.</p><p>The sun was beginning to come up now, and it cast a breathtaking orange glow on the lake’s surface, which was as still as glass.</p><p>I looked once again into the water and around the pier, then at Mina. She had her phone up in the direction of the lake houses on the other side and she slowly lowered the phone and looked at me, her face white as a sheet.</p><p>“What?” I breathed, afraid to ask.</p><p>Her eyes were wide as she flicked them in the direction of the homes. “That is my aunt and uncle’s cabin right there. And there are two shadows standing in front of it.” She held up the phone and made me peer at the screen. I could clearly see a tall smudge and a smaller one.</p><p>“What happens now?” I shuddered.</p><p>Chapter Thirty-Six</p><p>Mina</p><p>\"You won't find your father out here,\" a voice said, cutting the morning silence in two. Jax and I whirled around and gasped at the sight of my uncle standing at the foot of the jetty. He wore a sweater and black loose-fitting jeans. His hair was matted and flat on one side where he had been sleeping.</p><p>\"Uncle Rob,\" I breathed. Jax squeezed my hand. \"What...?\"</p><p>\"What am I doing here? I own the cabin on the other side of the lake,\" he said, his face white and unreadable. \"But you already know that, Mina, and that wasn't going to be your question. You want to know what I'm doing right here – out on this jetty.\"</p><p>\"Yes,\" I frowned. Had he known Jax's father? I wondered.</p><p>Jax glanced at me then back at my uncle.</p><p>\"We're more alike than you think, Mina,\" Uncle Rob said. \"I've wanted to talk to you about it, but I've never been able to find the right time or the right words. Or perhaps I was just too darn scared.\"</p><p>\"Scared of what?\" I asked him.</p><p>\"I know you see the marks,\" he said, looking straight at me. It was like Jax wasn't even there on the jetty and holding my hand.</p><p>\"The marks?\" I frowned.</p><p>Uncle Rob saw the puzzled look on my face and smiled as if he understood. But there was a sadness I could see in his eyes, too. \"You call them something else. What is it? Blurs? Dirt?\"</p><p>\"Smudges,\" Jax cut in. \"Mina calls them smudges.\"</p><p>\"She told you about them?\" Uncle Rob said, looking at Jax for the first time. It was like he was pretending he wasn't there, but I couldn't figure out why.</p><p>\"Mina says she sees my dad in those smudges,\" Jax told him, squeezing my hand tighter still.</p><p>\"That makes sense,\" Uncle Rob said, nodding his head slowly as if something had fallen into place – like he had made some kind of connection.</p><p>\"Did you know my father?\" Jax asked.</p><p>\"Not very well,\" my uncle said, looking away from Jax and down into the water that shone red like a vast pool of blood beneath the rising sun.</p><p>\"How then?\" I asked.</p><p>He took a deep breath as if considering his answer or searching for the right place to start. \"I've seen marks – smudges – since I was a child,\" Uncle Rob finally said, sliding his hands into his jeans pockets to warm them against the early morning chill. \"But I don't need to tell you how that feels, do I, Mina?\"</p><p>I slowly shook my head, feeling shocked and confused by what my uncle was telling me. I thought I had been the only one feeling scared and bewildered in private, only now to discover that my uncle – someone I loved and respected – had been suffering like me too.</p><p>As if reading my mind, he looked at me and said, \"If it's any comfort, your mother used to call me a freak too when I was a boy. I made the mistake of confiding in her once – she was my older sister, after all. But she never understood...\"</p><p>\"She knew about the smudges?\" I gasped, suddenly feeling angry and more confused and hurt than ever before. \"So she knew I was telling her the truth, but still she refused to believe me – still sent me away.\"</p><p>\"That's why your mother sent you away,\" Uncle Rob said sadly. \"She sent you to me. She couldn't understand you, but thought that perhaps I could. Two freaks together, huh?\" He shot me a wry but knowing smile.</p><p>I didn't feel like smiling. Tears stung the corners of my eyes as I learnt of my mother’s true betrayal.</p><p>\"I guess, just like you, Mina, the marks come and go,\" he continued. \"Years can pass without seeing them. I hadn't seen a mark for ten years or more, and then....\"</p><p>\"And then what?\" I whispered.</p><p>\"My precious little girl, Summer was knocked down and killed in that hit-and-run,\" he said. His eyes glistened wet with tears in the warm glow of the rising sun. \"It was a few weeks later that I saw the first mark. I was taking a picture of your aunt, and there it was – a mark on the lens just over her right shoulder. I didn't need to check my camera lens for scratches or imperfections, I knew what that mark was, and I suspected I knew who it was.\"</p><p>\"Summer?\" I said.</p><p>\"Yes, but I didn't know for sure,\" he explained. \"The mark was very faint. That was until...\"</p><p>\"Until what?\" I cut in.</p><p>\"Until I was up here at the lake,\" he said. \"At first I thought that the marks were clearer here because Summer so loved to come up here with me – it was a place she connected with. But it wasn't the place Summer was connecting with, it was a person.\"</p><p>\"Who?\" I asked Uncle Rob, who was staring at Jax.</p><p>\"My dad?\" Jax breathed.</p><p>Uncle Rob nodded. “Yes,” he whispered.</p><p>“That’s bullshit,” Jax said, letting go of my hand. “What possible connection could there be between my dad and your daughter?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I couldn’t figure it out at first,” Uncle Rob said. “I felt as baffled as you now look, Jax. But like I’ve already explained, the mark I could see through my camera became clearer every time I came up here. Then one morning, I woke early and came out to the lake for a walk. The sunrise was as beautiful as it is this morning, so I took some pictures. In them, sitting on the other side of the lake, I could see a lone figure, and behind it was the mark. But it wasn’t just a blemish on my camera lens anymore, it was Summer. She stood beside the figure, her pretty blonde hair billowing in the morning breeze, the hem of her blue dress flapping about her knees. She was sobbing, and to see her looking so sad broke my heart. I raced around the edge of the lake to find a disheveled-looking man sitting alone. All about him there was empty bottles of beer. He was drunk, and just like Summer, he was weeping.</p><p>“‘What’s wrong?’ I asked him.</p><p>“He was unable to look at me. I held up my camera and it nearly leapt from my hand. Summer was lying on the dew-drenched grass beside him. Her eyes were open and they stared blankly up at me. Her body looked broken, like she had just been hit by a car and left for dead in the road. I knew what she was trying to tell me. She was lying next to the man who had killed her,” Uncle Rob, said, those tears now flowing freely down each side of his ashen face. “I just wanted to go to her, pick her up and hold her in my arms. But I couldn’t. Summer was nothing more than a smudge... a blur... a mark.”</p> <p>“No! It’s not true!” Jax snapped, edging his way past my uncle, as if he didn’t want to hear any more. “My dad didn’t kill your daughter.”</p><p>Raising one hand, my uncle pressed it gently against Jax’s chest.</p><p>Jax stopped. He hung his head, unable to meet my uncle’s stare.</p><p>“I don’t blame you, Jax,” my uncle whispered.</p><p>“What about my dad...” Jax started.</p> <p>“At first I was angry and I dragged your father to his feet,” Uncle Rob started to explain. “He was so drunk, he nearly collapsed in my arms.</p><p>“‘You killed her!’ I screamed at him, knowing that I was holding the man who had run down my daughter. ‘You killed my little girl!’</p><p>“Then he raised his head and looked into my eyes,” my uncle said. “And even though he was drunk, I saw a spark of recognition in his eyes... I saw a spark of guilt.</p><p>“I pointed my camera down at the patch of grass where Summer lay looking broken like some ragdoll fit for the trash,” Uncle Rob said. “But he couldn’t see her, only I could through my camera. I wanted to show him what he had done to her, so I held the camera up, and gripping him by the scruff of the neck, I forced him to look through it and down at the ground. Not for one minute did I think he would see anything. Then suddenly, your father started to scream and he pulled free of me.</p><p>“‘I’m sorry,’ your father cried, throwing his hands to his face. ‘What have I done?’</p><p>“I knew then that your dad had seen Summer through the camera, just like I had,” Uncle Rob continued to explain. “With a look of fear and great sorrow on his face, he staggered away from me and onto this jetty. I went after him...”</p> <p>“You chased him...” Jax said, as if understanding what was coming next.</p><p>“No,” my uncle said. “I could see that he was dangerously close to the edge and went after him to stop him from falling in...”</p><p>“You pushed him into the water...” Jax barked.</p><p>“No...” Uncle Rob protested.</p><p>“He would’ve never killed your daughter on purpose!” Jax roared at him, his face now wet with his own tears. He gripped his hands into fists at his sides. “He drank because he never got over the death of my mother. It was how he coped... it was how we both coped.”</p><p>“I never pushed your father into the lake,” Uncle Rob said, staring at Jax. “I went to him, but he just kept screaming and pointing over my shoulder. I looked back at the sandy shoreline, and holding up my camera, I looked through the lens and could see Summer now standing at the foot of the jetty, and I knew that even without the camera, your dad could see her too. I heard a deafening splash of water, and lowering my camera, I looked back to see that your father was no longer on the jetty. I dropped to my knees and peered into the dark waters but couldn’t see anything... he was gone... and when I looked back... so was Summer,” my uncle said.</p><p>“So you didn’t go and get help?” Jax demanded, hitching back a sob in the back of his throat.</p><p>“No,” Uncle Rob said, shaking his head, as if in shame.</p> <p>“Why?” Jax asked, looking bewildered and confused. “You could’ve saved him.”</p><p>“He was gone, Jax,” he said. “And I feared that others would think just like you.”</p><p>“How?” Jax demanded.</p><p>“They would’ve thought I pushed him in because he killed my daughter. They would’ve thought I killed him.”</p><p>“And they would’ve been right,” Jax spat, trying to get past my uncle again.</p><p>Uncle Rob stepped in front of him, again barring his exit off the jetty. “No, your father killed himself. If the lake hadn’t had taken him, the drink eventually would’ve. It was his own guilt that drowned him, not the lake.”</p><p>Jax lowered his head, unable to meet my uncle’s stare any longer. It was as if Jax knew what Uncle Rob had said was true. I took a step forward. It hurt me to see him standing alone.</p><p>I took Jax in my arms and held him close. He felt cold to the touch. I kissed him gently on the cheek and I could taste the saltiness of his tears. “I think that’s why I have been seeing that smudge... I mean your father through my camera,” I whispered.</p><p>“Why?” Jax said back.</p><p>“I think he wanted you to know the truth,” I said, looking up into his eyes. “Perhaps he didn’t want you to make the same mistakes that he had, Jax... the women and the drink...”</p><p>Jax looked down at me, then pulled me close. “But he’s at the bottom of the lake... I wish I could see him one last time...”</p><p>Then, aiming my camera phone at the spot on the other side of the lake where I had earlier seen the two dark smudges, I saw Summer and Jax’s father standing together on the other side of the shore.</p><p>“Take a look,” I whispered, handing him my phone.</p><p>Jax looked into it, his face a calm white mask. “They’re holding hands,” he slowly smiled.</p><p>“Good,” I smiled back, taking his hand in mine and never wanting to let go.</p><p>Chapter Thirty-Seven</p><p>Jax</p><p>Mina and I walked hand-in-hand across the parking lot and through the wrought-iron gates of the old cemetery. Both of us were dressed in black. Me a smart shirt and tie, Mina a dress that swished about her calves in the cool fall breeze. We weaved our way around headstones and cemetery plots, coming to stop at a small, humble gravestone, which read:</p><p>Summer Anne Duncan, Beloved Daughter, Forever Angel 2006-2012.</p><p>Mina laid a bouquet of pink roses on the grave. I kissed my fingers, and pressed them to the tiny headstone. Slowly, we walked away and towards two identical cemetery plots. The first read:</p><p>Amelia Marie Jackson-McElvoy, Beloved Wife and Mother 1968-2010.</p><p>The second:</p><p>James Michael “Trick” McElvoy, Father, Husband 1967-2012.</p><p>“I can’t believe it’s been a year,” Mina said quietly.</p><p>I nodded. I still felt lost – like I was living in a kind of limbo waiting for Dad to come back, for him to say, “Sorry I was away so long, son. I had some things to sort out, but I’m okay now. We can both move on.”</p><p>But that was never going to happen. I would never see him again. Never work on restoring an old Mustang with him. Never go fishing again. He was gone forever and my chest hurt every time I thought about that. I took a small framed picture of my parents from my pocket and placed it against my father’s headstone. Again I kissed my fingers and touched the photo.</p><p>“I miss him. I miss them both. So much,” I whispered.</p><p>Mina nodded. “I know you do. You take your time, I’m going to wait in the car.”</p><p>I looked at her. “You don’t want to stay out here with me?”</p><p>Mina shook her head, wrapping her arms around herself. “Too many smudges,” she said, glancing about.</p><p>“But I thought you left your phone in the car?”</p><p>She nodded as she walked away. “I did. But I can feel them.”</p><p>I watched her walk to the car. When Mina was gone, I turned back and looked at the headstones. I sat for about fifteen minutes, not saying anything, just sitting on the grass and weeds that had grown up next to the graves. Sadly, the only thing I wanted right now was a shot of something stiff and pungent to numb the pain in my chest. But then I thought about my poor dad and how this very method of coping had ultimately cost him his life and the life of an innocent little girl, and decided that the only drug I needed to get through this was Mina’s love.</p><p>I got up, brushed myself off, and walked back to the car.</p><p>As I got in, Mina smiled at me.</p><p>“Let’s go home,” I said, smiling back at her.</p><p>THE END </p> </body></html>"]