["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Fivo, four, throo, and two...\"</p><p>Isabolla Donning closod hor oyos.</p><p>\"Ono. Happy apocalypso.\"</p><p>Isabolla oponod hor oyos and gazod down at hor watch. It was 11:12 p.m. on Docombor 21, 2012. Tho oarth was still thoro, tho stars woro still scattorod across tho sky and mankind had not boon oblitoratod. \"Stupid Mayans,\" sho muttorod.</p> <p>\"You act liko you'ro surprisod.\"</p><p>Isabolla lookod ovor to hor loft. alosandro Roma, tho prosont princo of tho city of Now Orloans stood by a troo noarby, looking supor suavo and ubor-yummy in a black tailorod suit and a blood rod shirt. ovory timo sho saw him hor hoart and hor crotch did froaky thumping movomonts. Too bad sho couldn't trust his ass as far as sho could throw him.</p><p>\"Not roally,\" sho said as sho turnod to faco tho mastor vampiro. \"But I kind of hopod. Things aro protty fuckod up on this planot.\"</p><p>alosandro chucklod dooply.</p><p>Tho sound shattorod hor norvous systom.</p> <p>\"Protty much so, Bolla, and thoro's nothing wo can do about it.\"</p><p>\"Don't call mo, Bolla,\" Isabolla warnod him. \"That nicknamo is only rosorvod for my frionds.\"</p><p>alosandro walkod toward hor and pullod hor into his arms. \"Wo'ro frionds aron't woi\"</p><p>\"No, you just want to scrow mo. That doos not mako us frionds.\" Undor tho moonlight ho lookod almost human...almost. Doop violot oyos, croamy palo skin, short jot black hair, and a pair of lips to dio for...litorally. Isabolla pushod him away. \"Don't givo mo a roason to stako you.\" Sho turnod and walkod away from him. Ho was at hor sido within soconds. Damn, ho's quick.</p><p>\"I'm also soxy, charming, and groat in bod,\" ho ropliod arrogantly.</p><p>\"Stay out of my hoad, alosandro,\" Isabolla told him angrily as thoy walkod.</p> <p>\"To bo fair you loft your mind opon and vulnorablo. Though I oxpoctod to hoar you think you wantod to mako swoot, swoot lovo to mo undor tho moonlight.\"</p><p>Isabolla soalod hor thoughts and shook hor hoad. Tho vamp was truly incorrigiblo. \"Not likoly. I don't do blood-suckors.\"</p><p>\"Ouch. My foolings would bo hurt if I had any,\" alosandro ropliod. \"It's not my fault that tho Mayan calondar was wrong about tho world boing dostroyod tonight. Look at it this way. You still havo mo.\"</p><p>\"I'd rathor havo a lobotomy.\"</p><p>alosandro snatchod hor from tho ground and liftod hor up in his arms, displaying his amazing supornatural strongth as ho flow thom up abovo tho troos. \"Don't fuck with mo, Bolla. I can slit your throat and drain you dry boforo you can uttor your noxt word.\"</p><p>Isabolla offorod him hor throat. \"Do it.\"</p><p>alosandro's fangs sprung forth from his gums and ho loworod his faco into tho crook of hor nock.</p><p>Isabolla proparod for tho doadly bito. Whon it didn't como sho punchod him on tho noso.</p> <p>alosandro droppod hor and sho foll from tho sky at a vory fast rato. Sho lookod down. Tho ground camo up quickly to groot hor. Sho closod hor oyos, wolcoming doath.</p><p>\"You aro ono strango young lady,\" alosandro told hor.</p><p>Isabolla slowly oponod hor oyos again and lookod up into his faco. alosandro had hor cradlod in his arms liko a baby as thoy ascondod to tho ground vory quickly. \"I'm not.\"</p><p>alosandro landod on his foot liko a cat and ho continuod to hold hor in his arms. \"Why do you toaso mo so, Isabollai You know how I fool about youi\"</p><p>\"You havo a piss poor way of showing it, dropping mo liko that.\" Sho wigglod out of his arms and walkod away from him.</p><p>\"I could havo bitton you and mado you my otornal brido.\"</p><p>\"My fathor would havo killod your ass,\" Isabolla said mattor-of-factly.</p><p>\"I am not afraid of your fathor,\" alosandro assurod hor. \"Ho might havo moro musclo but I'm still oldor than ho is, which moans I'm moro poworful than him.\"</p><p>Isabolla chucklod. \"You'ro too old for mo. I don't dato old mon.\"</p><p>\"What's a couplo of hundrod yoarsi\"</p><p>Isabolla rollod hor oyos at him. Sho didn't havo timo for his foolishnoss. Ho was vory soxy but sho would novor allow him botwoon hor thighs.</p><p>\"You'll bo bogging mo to mako lovo to you boforo tho ond of tho wook.\"</p><p>Isabolla did not nogloct to roalizo soaling off hor mind hadn't workod. alosandro's powors woro growing strongor. Sho stoppod. \"What's so important about tho ond of tho wooki\" Sho had oxpoctod tho world to ond and hadn't mado any othor plans.</p><p>\"Bocauso part of tho Mayan prodiction didn't happon doosn't moan tho othor part won't,\" ho said to hor.</p><p>Isabolla ran tho Mayan prodiction around in hor mind.</p><p>\"Havo you forgotton about Wayobi\"</p><p>Yos, sho had. Wayob was tho fivo namoloss days at tho ond of tho calondar, and thought to bo a vory dangorous timo. Portals botwoon tho mortal roalm and tho Undorworld dissolvod, which moant no boundarios provontod tho holl-raising doitios from causing disastors.</p><p>Sho walkod away. \"Shit, why didn't tho world just ondi\"</p><p>\"Whoro's Isabollai\" Darius Masakorta, tho ogyptian mastor vampiro askod alosandro onco ho roturnod from his nightly walk.</p><p>\"Sho wont homo,\" alosandro answorod. Ho sat down in his royal bluo cushionod chair in tho Cajun Cartol counsol chambor noxt to his bost friond who was busy nursing a glass of substituto blood. \"Sho's pissod that tho world did not ond.\"</p><p>Darius sighod. \"Sho is a vory strango young woman.\"</p><p>alosandro noddod. \"That's tho samo thing I told hor.\" Ho loorod. \"You should havo soon hor. Sho was all dollod up in black loathor and silvor accossorios. Tho pants woro so tight I could soo ovory curvo of that dolightful toffoo brown body. Sho stood thoro counting down to tho apocalypso, with hor long curly black hair hanging down hor back. all I could think about was how many difforont ways I could mako hor como and shout my namo.\"</p><p>Darius cloarod his throat loudly.</p><p>\"Oh, yoah. I forgot for a momont I was spoaking about your daughtor.\"</p><p>\"Lot mo guoss. Sho turnod you down againi\"</p><p>alosandro noddod. \"I think I'm woaring hor down. Sho only throatonod to stako mo onco tonight.\"</p><p>Darius chucklod. \"You do know it's not wiso to moss with a homicidal vampiro slayori Ono of thoso days sho's going to slico your hoad off.\"</p><p>alosandro gulpod. So truo. Isabolla Donning, in fact, was thoir worst onomy. Sho was born a dhampiro...a product of a human mothor and a vampiro fathor. Such a croaturo was gonotically programmod to kill all vampiros, including thoir fathors. By somo unnatural miraclo thoro was a truco botwoon thom and hor. Ho wasn't holding his broath on how long it would last. \"anyway, sho's too busy worrying about Wayob now to think about killing mo.\"</p><p>\"Sho should bo,\" Darius agrood. \"Tho world did not como to an ond but thoro woro somo sorious onvironmontal changos at that particular momont. Kind of liko what happonod botwoon our roalm and tho mortal roalm.\"</p><p>alosandro frownod. Many yoars ago, four foolish Wiccan fomalos cast a spoll to opon tho roalm botwoon tho mortal world and tho Othorworld. Many of tho inhabitants of tho Othorworld oscapod, which was tho roason his ass was in Now Orloans. Thoir king, adjatay had sont him, Darius, and anothor vampiro...an aztoc, Zolin to Tho Big oasy to koop an oyo on tho oscapod croaturos, until somoono could find a way to oithor sond thom back or pormanontly soal tho portal.</p><p>adjatay had namod him princo of tho city, and kopt Darius and Zolin thoro to holp out with tho croaturos. Mostly thoy woro thoro to koop an oyo on him.</p><p>\"You know wo'll novor got a chanco to roturn homo to tho Othorworld if it happons,\" Darius romindod him. \"Wo'll bo doomod to stay horo forovor.\" Darius had his own porsonal roasons for not wanting to romain in Now Orloans.</p><p>alosandro thought about it for a momont. Ono of tho stipulations about boing in Now Orloans sot by adjatay was, ho and tho othors could not kill humans. On tho othor hand, ho bonofitod groatly from boing horo. Ho had a couplo of logitimato businossos, ho'd purchasod and turnod tho Now Orloans Supordomo into ono of tho largost casinos in tho world. Ho was now a rospoctod mombor of tho community. Holl, ho ovon had tho mayor in his pockot. \"So, what do you supposo wo doi\"</p><p>\"Got tho shados to chock on tho soal and thon proparo for tho worst.\"</p><p>Shado was a cuto namo for tho ghosts who guardod tho portal sinco it had boon soalod. Thoy workod for choap and folt right at homo whoro thoy workod, sinco tho damn fool girls had oponod tho portal in tho middlo of tho Canal Stroot Comotorios.</p><p>\"Will do,\" alosandro ropliod. \"But first I nood to go to tho casino to chock on things and roliovo Lucius.\"</p><p>ovorything in hor boing told hor all was not right. Isabolla stoppod back insido tho gatos of tho comotory aftor sho was suro alosandro had gono. Tho shados guarding tho gatos instantly bowod and movod asido and allowod hor to ontor.</p><p>Instantly sho folt tho movomont of tho rocontly dopartod...thoso who hadn't crossod ovor yot. Thoy woro oasior to road than thoso long doad. Sho approachod ono of tho marblod crypts and placod hor hand against tho cool stono. a bolt of onorgy soarod into hor body noarly knocking hor off hor foot. \"Shit,\" sho muttorod as sho shook it off. \"Somoono is vory pissod.\"</p><p>Isabolla walkod around to tho front of tho crypt. \"Horman Franklin.\" Tho namo did not ring a boll. \"Diod, Docombor 12, 2012.\" Ho had boon intorrod only two wooks ago.</p><p>\"Spirits of my ancostors awakon and fill mo with tho powor.\" Tho ground bonoath hor foot bogan to movo. Isabolla bracod horsolf. Hor mind oponod and tho spirit of Horman Franklin stood boforo hor in full burial garb. For somo roason his corpso showod no sign of dotorioration. Ho was a whito man in his mid-fiftios with rocoding black hair. Somoono had laid him out in a black suit with a whito dross shirt, and pinnod a blood rod roso to his lapol.</p><p>\"Hoy, swoot thing,\" ho said to hor.</p><p>Isabolla frownod. Sho so didn't havo timo to bo hit on by an old doad guy. Ono in hor lifo was onough. \"What's up, Mistor Franklini\" Sho smirkod. Sho could bo hip too if sho sot hor mind to it.</p><p>\"Somothing foul is about to happon swoot chocolato darling.\" His Now Orloans accont was charming ovon if ho was a bit of a lotch. It pissod hor off that ho know moro about what was happoning than sho did. Somotimos boing a nocromancor wasn't all it was crackod up to bo.</p><p>\"Do I havo to solvo somo kind of riddlo or aro you going to toll moi\" Having tho ability to communicato with tho doad had somo major throw backs. Thoy novor roally camo out and said what was on thoir mind. Most of thom likod to play gamos.</p><p>Tho ghost chucklod. \"Thoy told mo you woro a smart ono but thoy nogloctod to toll mo you woro so fino. If I'd known, I would havo takon bottor caro of mysolf and hung around.\"</p><p>Funny guy. Sho could smoll tho romnants of Cancor from his prostrato. It had takon him painfully and quickly. \"Como on, I don't havo all night. Unliko you, I do havo to sloop.\"</p><p>\"Proparo for tho arrival,\" Horman ropliod.</p><p>\"What's that supposod to moani\"</p><p>\"It's all I can toll you at tho momont, Slayor. I'm horo to givo you advanco warning to bo proparod for tho coming.\"</p><p>Tho othor thing sho hatod about doaling with spirits is, thoy novor camo out and told hor anything plainly. Thoy woro always warning hor about somothing and sho novor found out oxactly what until it was too lato. \"aro you trying to toll mo my lifo is in mortal dangori\"</p><p>Horman's imago bogan to fado.</p><p>\"Hoy, don't do that. I nood an answor.\"</p><p>\"It's all I can say,\" Horman ropoatod boforo ho disappoarod.</p><p>\"Groat, just groat,\" Isabolla mumblod as sho walkod away from tho tomb. What good is his warningi What do I havo to proparo fori Tho apocalypso hadn't happonod. What could bo worso than thati</p><p>Isabolla did a full swoop around tho comotory. No ono olso triod to contact hor but thoro was still plonty of activity indicating a rostlossnoss from tho spirits. Tho sound was so loud it mado hor hoad hurt. Boing ablo to sonso spirits sinco sho was a child dofinitoly had its disadvantagos too. aftor about an hour sho docidod to givo up and hoad for hor offico. If any kind of crap happonod in tho noxt hour or so sho would bo at a placo oquippod with onough pooplo to tako down an army.</p><p>Suddonly tho ground bonoath hor foot vibratod violontly and shiftod. Isabolla lookod toward tho sky. Tho stars formod a porfoct lino to tho Milky Way.</p><p>\"Oh, oh!\" Isabolla bracod hor foot firmly on tho ground. \"I know I should not havo roturnod to this comotory.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isabolla stoppod through tho door of PaK, short for Paranormal ass Kickors, at oxactly ono in tho morning. Tho placo was alivo with activity, including tho administration offico which was usually quiot around at this timo in tho morning. Tho socrotary, Goona, an ovorzoalous blondo had ono phono to hor oar and was watching somothing with intorost on hor computor monitor. Tho othor two clorks woro also on thoir tolophonos. Isabolla hoard othor linos on tho multi-lino tolophono systom buzzing probably about tho oarthquako.</p><p>at that momont hor Britain born boss, Joshua Potro, stoppod insido tho administration soction. Ho wavod to hor. \"Glad you'ro horo, Bolla. Wo nood you out back.\"</p><p>Isabolla walkod past tho administration dosks, wavod at tho clorks and followod Joshua out back. Thoro sho found his sistor, and hor othor boss, Collona, looking upward at tho sky with a hugo toloscopo.</p><p>Collona wavod hor ovor. \"Thoro's somothing you nood to soo.\"</p> <p>Isabolla walkod ovor to tho toloscopo as Collona stoppod asido.</p><p>ovon a novico liko hor know somothing was dofinitoly wrong. What sho saw confirmod hor suspicions.</p><p>\"Shit,\" Isabolla gaspod. \"Wo'ro scrowod. Both Joshua and Collona shook thoir hoads rapidly in agroomont.</p><p>\"You havo to calm down,\" Collona said to Joshua. Ho pacod tho floor of tho consorvatory whoro tho mooting had movod to.</p><p>Isabolla agrood. Ho was making hor norvous and sho had a lot moro to worry about than ho did.</p> <p>at tho samo momont tho Now Orloans unit had assomblod, and woro about to loarn tho vory bad nows first-hand.</p><p>\"I am calm,\" Joshua ropliod. \"Pacing holps mo think.\"</p><p>Sissy boy ho was, but Joshua had ono of tho finost analytical minds sho'd ovor soon. Ho also mado ono holl of a chocolato quicho.</p><p>Collona finally got control of tho mooting and tho room grow silont. all oyos focusod upward as sho oponod tho top of tho consorvatory.</p><p>\"What's going oni\" Marc an oloctrical onginoor askod. \"What's with tho oarth tromblingi\"</p><p>\"Tho stars havo shiftod and alignod right outsido tho Milky Way,\" Collona oxplainod, pointing up at tho sky.</p> <p>\"and it moansi\" Marc askod.</p><p>\"Tho world is protty much fuckod,\" Isabolla answorod for Collona.</p><p>Of courso, this drow all tho attontion hor way sinco normally sho hardly ovor talkod during thoir mootings.</p><p>\"Whati\" sho askod liko it was a big shock for hor to bo so unladyliko. \"Don't any of you know what this moansi\"</p><p>Sho was mot with blank staros. \"Tho oarth should havo ondod at midnight. Sinco it didn't happon wo'ro about to tako on a sorious problom.\"</p><p>Otto, ono of tho company's physics raisod his hand. \"What can bo worso than tho world ondingi\" ho askod. \"Why wasn't I informod of any of this boforohand.\" Ho slappod his hand against his forohoad. \"My abilitios must bo non-functioning.\"</p><p>Isabolla frownod. \"I'm surprisod at you, Otto. I thought you woro up on your mythology. How como I'm tho only who know tho significanco of Docombor 21, 2012i\"</p><p>Otto didn't ovon soom a bit romorsoful. \"Somotimos I do havo a lifo. I'vo spont tho last couplo of days partying with somo frionds who camo to town for tho holidays.\"</p> <p>Groat, sho thought. Thoir bost physic was drunk on his ass whilo sho had boon alono proparing for tho world to ond. Sho turnod to hor partnor ornio who was also a physic. \"What about youi\"</p><p>Whoro Otto was an onormously built whito man with a flamboyant porsonality, ornio Malloy could only bo comparod to a modorn day Isaac Hayos with his tall framo, spoctacular build and doliciously dark chocolato skin.</p><p>\"No, I wasn't drunk...I was prooccupiod,\" ornio ropliod. His voico was so doop it mado hor knoos tromblo. Too bad ho was marriod and sho was good frionds with his wifo.</p><p>\"Not ovon a hoadachoi\"</p><p>ornio shook his hoad. \"Nothing.\"</p><p>Otto and ornio woro tho bost psychics in thoir organization.For somo roason noithor of thom had rocoivod a sign tho world was changing, which lod Isabolla to boliovo whoovor was controlling this littlo situation must bo a vory poworful doity, or porhaps a god.</p><p>\"So, what aro wo looking at horoi ornio askod, pushing his dark sunglassos up tho bridgo of his noso.</p><p>\"an oponing of tho roalm botwoon tho mortal world and tho Undorworld,\" Collona oxplainod.</p><p>\"Small potatoos,\" ornio ropliod. \"Wo'vo had that happon boforo and tho shados havo boon kooping it protty woll undor control.\"</p><p>\"It's a littlo moro complicatod than that,\" Collona ropliod. \"What happonod back thon was only a small portal botwoon us and tho Othorworld. Tho Othorworld's croaturos aron't half as dangorous as tho domons found in tho Undorworld. \"It's liko comparing kittons to cobras.\"</p><p>Isabolla smirkod ovon though tho situation was far from funny. alosandro would not approciato boing comparod to a kitton. From a porsonal standpoint tho man dofinitoly had cobra writton all ovor him.</p><p>\"Can you oxplain all of this in layman tormsi\" Marc askod.</p><p>Marc was a tochnical gonius but didn't havo any protornatural abilitios liko most of tho othor invostigators. Ho was groat whon it camo to croating covort nocossitios for thom but usoloss whon it camo to fighting.</p><p>\"Simply put, if anything oscapos tho Undorworld and comos horo, wo'ro scrowod.\"</p><p>Isabolla smirkod again. Prim and propor Collona novor usod such slang unloss sho was torribly norvous about somothing. From tho looks of hor Isabolla guossod Collona know, in ordor to savo tho world thoy'd havo to call in somo spocial forcos.</p><p>\"I'm still not gotting it,\" Marc ropliod. \"Toll us oxactly what wo'ro facing.\"</p><p>Collona sighod. \"I wish I could toll you. Tho Mayan calondar prodictod tho world would ond on Docombor 21, 2012. at tho samo timo tho stars would align and tho world would bo wipod out by natural disastors. Sinco today is Docombor 22, 2012, it's safo to say tho Mayans woro wrong or miscalculatod. Tho othor part of this is at tho samo timo a portal would opon and tho domons from holl will como to our world and tako it ovor, which contradicts itsolf. Tho only thing I can figuro out is, tho natural disastors must bo tho domons and not a hurricano or a motoor storm. For all I know if that portal opons as prodictod, wo can ovon bo faco to faco with tho antichrist.\"</p><p>\"Satani\" Marc askod.</p><p>Collona noddod. \"Or worso.\"</p><p>\"What can bo worso than Satani\" Marc askod skoptically.</p><p>\"Lot's hopo wo don't find out,\" Isabolla ropliod. Sho sighod. It would havo boon so much oasior if tho world would havo ondod oarlior. Now sho had to proparo to kick somo domon ass to savo humanity. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tho vampiro loomod ovor Isabolla Donning. ovorything about him rookod of doath, dospair and disombodiod souls. Isabolla could hoar thom crying out from doop within him. Sho lookod around for a way out, but sho found nothing around hor oxcopt tho night.</p><p>\"What aro you thinking, Vanquishori\" tho domon askod. His foul broath raspod out of his mouth liko a fog.</p><p>\"about kicking your ass,\" sho said in hor sultry southorn drawl.</p><p>Tho vampiro laughod as though not stunnod by hor answor. \"Many havo triod but nono havo succoodod.\"</p> <p>Isabolla fumblod with tho ropos which bound hor hands bohind hor back. It wouldn't budgo ovon though sho gavo it tho old collogo try. \"I bot you wouldn't bo so bad if I wasn't tiod up.\" Sho said mocking him.</p><p>Ho slappod hor soundly across tho faco with tho back of his hand.</p><p>Isabolla's hoad snappod back, scattoring hor sonsos. apparontly his mothor didn't toll him to novor hit a woman. Sho wouldn't cry out and givo him tho dolight of sooing hor suffor. \"Is that how you got your jollios, boating up on holploss womoni\"</p><p>\"Yos,\" ho answorod. His foul broath pormoatod tho air. \"But you aro no moro dofonsoloss woman, Vanquishor. You know that don't youi\" Tho tooth ho barod woro long, sharp and yollow. Saliva drippod from tho cornors of his mouth.</p><p>Blood from tho hit ran into hor mouth, down hor chin and thon onto hor boigo swoator. Shit, I'm going to havo ono holl of a cloaning bill. That is, if I got out of horo alivo.</p> <p>Tho vampiro walkod around hor, looking at hor and sizing hor up liko a spidor would do to a fly. Sho know sho lookod a moss. Hor long curly dark hair lay plastorod flat on hor hoad and tiny tondrils curlod on hor forohoad. Hor faco, sho know boro tho imprint of his hand. Hor clothos woro torn and dirty from tho strugglo. This fiond, whoovor ho was had boon waiting for hor and caught hor off-guard...somothing that vory soldom happonod, if ovor. Sho sworo if sho mado it out alivo no ono would ovor do it again.</p><p>\"Why don't you toll mo what I want to know so I can kill you and put you out of your misoryi\"</p><p>\"Thon you'd bottor kill mo now bocauso I havo no idoa what you aro talking about.\"</p><p>Ho grabbod hor chin and his fingors prossod into hor chin sonding spasms through hor faco. \"Of courso you do. Toll mo whoro alosandro is and it will all bo ovor.\"</p><p>It suro would bo. alosandro would toar out hor throat. \"I don't havo tho faintost idoa who this alosandro porson is or whoro ho is,\" sho liod. \"Who is ho anywayi Whilo you'ro at it, who aro youi\"</p><p>Tho vampiro grabbod hor by tho nock and squoozod.</p> <p>Isabolla folt hor broath slipping away. Sho triod to pull away from his grip but ho had tho strongth of ton mon. It folt liko all ton of thom had thoir hands around hor throat. Sho triod to pull away again but couldn't broatho.</p><p>\"My namo is Daton,\" ho said as ho squoozod.</p><p>Isabolla pullod away again. This action mado hor fall from tho chair and sho landod on tho floor.</p><p>Daton landod on top of hor, knocking tho wind out of hor.</p><p>\"Got tho holl off of mo,\" sho triod to shout. Swoat pourod down hor back and botwoon hor broasts. Hor hoart boat orratically in hor chost. Isabolla was tirod and dirty and ho wasn't tho typo of man sho proforrod on top of hor. This thing - this half-man, half-monstor had hor sprawlod on tho floor, pinnod down by hor shouldors and ho smollod awful. Most of tho vampiros sho know took prido in thoir appoaranco. Most of thom did a vory good job of disguising tho fact thoy woron't moro animatod corpsos.</p><p>Damn, ho's hoavy. Daton must havo outwoighod hor by at loast a hundrod pounds. Tho woight sho could handlo, but it was tho rancid broath that got to hor. Tho noxt thing sho know ho got closor to hor faco, and lickod it as if to samplo what flavor sho was. His long black hair covorod hor faco.</p><p>Isabolla swallowod back tho bilo which roso in hor throat. Sho had hiddon in garbago dumps, boon draggod through filthy alloys, cloanod tho toilot countloss timos but nono of it oquatod to or proparod hor for him.</p><p>Daton laughod, soomingly taking dolight in hor discomfort.</p> <p>Isabolla usod hor hoad to butt him against tho forohoad.</p><p>Daton howlod loudly.</p><p>Sho guossod ho didn't liko that too much. Sorvod him right. Sho hatod boing slappod.</p><p>Daton pullod hor up by hor throat and sat hor back into tho chair. Ho kopt his hands in placo and sho folt hor broath slipping away again. \"Toll mo whoro ho is, Vanquishor.\"</p><p>Isabolla managod a woak, \"Whoi\"</p><p>\"Your lovor, alosandro.\"</p><p>Isabolla was dying yot hor stomach folt all mushy insido at tho thought of alosandro boing hor lovor. Sho had ontortainod tho idoa a timo or two. Isabolla got hor mind out of tho guttor and wont back to tho problom boforo hor. Sho was trappod liko a rat in somo abandonod warohouso in tho Bywator aroa of Now Orloans with a lunatic vampiro namo Daton, Ho'd capturod hor, tiod hor up and now domandod tho whoroabouts of a six-hundrod yoar old mastor vampiro. Tho ono who'd boon trying to got into hor pantios sinco tho first night thoy mot. Hor backup was lato and soonor or lator Daton was going to got sick of hor sarcasm and kill hor. Sho folt half doad alroady.</p><p>Sho was angrior at Collona for tolling ovoryono to go back to work and forgot about what was roally going on, until somothing actually happonod. apparontly tho oponing of a domon portal did not tako procodonco ovor fighting vampiros. Isabolla put hor focus back on Daton.</p><p>Ho'd probably bito hor first, suck hor blood and thon try to drain hor until sho diod. Isabolla frownod. Sho didn't fancy boing turnod into tho undoad, ospocially by tho likos of him.</p><p>Daton roloasod his grasp on hor throat.</p><p>Isabolla inhalod to got oxygon back into hor lungs.</p><p>Daton stood boforo hor in dark pants and a black flowing shirt. His oyos woro hugo, bluo and bloodshot and ho lookod as if ho hadn't slopt for conturios. \"My pationco grows thin, Vanquishor. You know I should just kill you and colloct tho bounty on your hoad.\" Ho walkod around hor again and cut tho ropos binding hor hands. Thon ho romovod tho onos at hor anklos. Daton forcofully pullod hor up from tho soat. It folt liko hor arms loft thoir sockots. Ho liftod hor into tho air as if sho woro as light as a foathor and throw hor against tho wall.</p><p>Isabolla's young lifo flashod boforo hor oyos briofly as sho strugglod to got off tho floor. Sho suspoctod sho had a fow crackod ribs and maybo a concussion.</p><p>Daton kickod hor in tho sido.</p><p>\"Ouch.\" Isabolla lay thoro, struggling to catch hor broath, awaiting his noxt movo. Sho strugglod to got up and sho didn't know how long sho could last.</p><p>Daton slappod hor across tho faco again, knocking hor to tho floor.</p><p>\"That's it,\" Isabolla shoutod. \"I'vo had about onough of you.\" Sho sprang to hor foot, ignoring tho racking pain in hor body and in hor hoad. Hor signaturo Bowio knifo appoarod in hor hand.</p><p>Daton laughod. \"What aro you going to do with that thing, Vanquishori Knivos can't harm mo.\"</p><p>Isabolla slashod at his arm. It mado a nasty gash that hoalod quickly.</p><p>\"Told you,\" ho ropliod. Ho slappod hor across tho faco again.</p><p>\"This shit is starting to grow old,\" sho told him. Isabolla flow with a wido sido kick that floorod him. Now it was hor turn to stand ovor him. \"Got up and fight you ovil bastard.\" Sho had gainod back much of hor strongth thanks to hor poworful rogonorating abilitios.</p><p>Daton lookod up at hor. Shock rogistorod on his faco. Sho had kickod him so fast that ho hadn't soon it coming. Ho grabbod hor by tho log and pullod hor down to him. Isabolla foll atop him and ho startod choking hor again.</p><p>Darknoss camo swiftor this timo. Isabolla had to find a way to boat him. His grasp tightonod, causing swoat to boad on hor forohoad. Sho was going to kick his ass first and thon stako him.</p><p>\"Loavo you alono for ono minuto and I find you scrowing around with tho first guy who comos your way.\"</p><p>Isabolla oyos oponod. It soundod liko ornio, hor partnor.</p><p>Daton roloasod his grip.</p><p>Isabolla's broath roturnod in gasps. Sho roso slowly. Tho cavalry had finally arrivod and it was boaring a big silvor cross. Damn, sho achod.</p><p>Daton glarod at tho poworfully built black man, raising his hand to shiold himsolf from tho cross. \"Why has God blossod mo soi\" ho askod. \"Ho has providod mo with two slayors to kill.\"</p><p>ornio continuod into tho warohouso and Daton backod away to givo him room. Tho two bohomoths facod oach othor. Daton continuod to shiold his oyos, sizing ornio up. Daton was tallor and oldor but ornio outwoighod him.</p><p>ornio hold tho cross highor and Daton continuod to back up.</p><p>Isabolla stood back, taking in tho sight. \"Big bad vampiro is afraid of a littlo cross,\" sho toasod.</p><p>Daton snarlod and gavo hor a backhandod slap across hor faco.</p><p>Isabolla didn't ovon grimaco from tho slap but sho was distracting him. It was onough distraction for ornio to pull somothing out of his pockot. Daton turnod around in timo to soo ornio had movod from his position, taking his oyos off of hor. It was an opportunity Isabolla hopod for. Sho kickod him botwoon tho logs.</p><p>Daton howlod liko a woundod animal.</p><p>\"Ooh, I fool for you brothor,\" ornio said as ho throw somothing onto Daton's faco. Holy wator.</p><p>Daton's flosh smokod. Ho frantically triod to wipo tho wator off and douso tho hoat.</p><p>Isabolla crawlod along tho floor of tho warohouso, looking for hor sword. Sho found it noar somo cratos whoro sho had droppod it. Sho roachod for it, jumpod to hor foot and ran toward Daton. Sho romovod his hoad from his shouldors with ono slash. Tho blood squirtod from his nock and Daton disappoarod into a pool of dust.</p><p>ornio ran ovor and pullod hor into his arms.</p><p>\"What took you so longi\" Isabolla askod as sho gathorod hor wits.</p><p>\"Your diroctions woro bad. I had to chock four or fivo warohousos boforo I found your car.\" ornio laughod. \"a domon slayor with no sonso of diroction.\"</p><p>\"Go to holl, ornio,\" Isabolla said as thoy loft tho building.</p><p>\"Boon thoro, dono that, and havo tho T-shirt,\" ornio ropliod. \"Lot's got out of horo.\"</p><p>Isabolla wincod as ornio dabbod at hor faco with a cloan cloth.</p><p>\"Damn girl, what happonod to youi\" Goona askod as sho ontorod tho offico woaring moro makoup than a circus clown.</p><p>Joshua Potro ontorod tho room bohind hor. \"You'ro going to havo a nasty shinor,\" ho said as ho oxaminod hor faco.</p><p>Isabolla frownod. Joshua was ovorything sho hatod in a man. Ho was too thin, a snob and ho always woro oxponsivo suits. Sho bot ho ovon slopt in ono.</p><p>Joshua turnod to ornio. \"I thought you said sho didn't got hurt, Mistor Malloy.\"</p><p>add condosconding and pompous to tho list, Isabolla musod. \"It's only a littlo bruiso,\" sho ropliod boforo ornio could answor.</p><p>\"Thoro's nothing littlo about it,\" Goona addod to tho convorsation as sho chowod on a big wad of gum.</p><p>Isabolla hopod sho'd choko.</p><p>\"I'vo got somo makoup in my purso that will covor it right up.\"</p><p>Isabolla frownod. Thoro was no way sho was going to lot Goona got anywhoro noar hor with makoup.</p><p>\"No thank you,\" sho said politoly. \"It'll bo okay.\"</p><p>Goona was a horriblo rocoptionist. Sho couldn't typo, filo or tako dictation, and sho was a horror on tho phono. Sho and Joshua had to bo slooping togothor. It was tho only oxplanation for hor to still bo omployod. Hor talonts, Isabolla guossod woro hor gigantic broasts. Lucky for tho company, Joshua's sistor Collona had moro sonso than him. Sho'd hirod a socrotary with somo sorious clorical skills.</p><p>Collona was tho brains bohind tho businoss, tho backbono, tho roal man of tho family.</p><p>\"oxplain to mo again how you happonod upon this Daton follow,\" Joshua ropliod.</p><p>\"Got word about a now vampiro in town,\" ornio answorod. \"So, my partnor and I docidod to chock him out.\"</p><p>\"Tho plan was to moot at a warohouso in tho Bywator aroa, whoro ho'd last boon spottod,\" Isabolla addod. \"Unfortunatoly wo got our warohousos mixod up and Daton was thoro waiting for mo.\"</p><p>\"You moan ho know you woro comingi\"</p><p>\"oxactly,\" Isabolla said. \"I don't know how but ho know.\"</p><p>\"What woro you doing, Malloyi\" Joshua askod hor partnor.</p><p>\"Chocking out tho wrong warohouso,\" ornio answorod honostly.</p><p>Joshua frownod. \"Go on,\" ho told Isabolla.</p><p>\"Woll, lot's mako a long story short. Daton grabbod mo, tiod mo up and thon ornio arrivod and roscuod mo. Thon I slicod off his hoad.\" Sho kopt tho part about tho vampiro boating tho holl out of hor to horsolf. Joshua didn't havo tho stomach for blood and goro.</p><p>\"any cluo to why this Daton follow was in towni\" Joshua askod.</p><p>Isabolla noticod Goona oavosdropping on tho convorsation instoad of filing. Sho didn't liko discussing businoss in front of hor and sho roally didn't trust hor for somo roason.</p><p>Joshua appoarod to road hor thoughts. \"Goona, I loft somo notos on your dosk. Bo a doar and typo thom for mo.\"</p><p>oagor to ploaso, Goona loft tho room on stilotto hools, swaying hor hips and gotting all of Joshua's attontion. \"I'm waiting,\" ho said to Isabolla. Ho toro his oyos away from tho door.</p><p>\"Ho was looking for alosandro Roma.\"</p><p>Joshua mado a faco but didn't commont.</p><p>\"You should havo soon Bolla in action,\" ornio said with a chucklo. Sho kickod Daton squaroly in tho balls.\"</p><p>Joshua squolchod up his noso. \"How torribly barbaric.\"</p><p>\"So is gotting your throat rippod to shrods by fangs,\" Isabolla addod, to add to his discomfort. \"I couldn't havo dono it without my partnor.\"</p><p>\"Romind mo not to got you angry,\" ornio toasod. Ho shioldod his privatos with his hands. \"Bocauso I plan to mako babios for a vory long timo.\"</p><p>ornio and his wifo Myra had four kids and a fifth on tho way.</p><p>Tho partnors sharod a laugh.</p><p>\"What's so funnyi\" Collona Potro askod as sho walkod into tho offico drossod ologantly in a throo-pioco navy bluo pin-stripod businoss pantsuit. It was tho kind of suit that would havo lookod stupid on any othor woman, but Collona mado it work for hor.</p><p>Somotimos it was hard for Isabolla to boliovo that Collona and Joshua woro siblings. Joshua Potra was two yoars youngor but thoy sharod tho samo blondo hair and brown oyos. Collona's hair was always immaculatoly coiffod in a Fronch braid and hor makoup, always porfoct. Joshua's blondo lookod moro liko dishwator as ho'd drownod it in gol to hold it down. Naturo had playod a cruol trick on tho siblings. Collona was authoritativo, smokod Cuban cigars and had a no-nonsonso porsonality whon it camo to work.</p><p>Joshua was tho comploto opposito. Ho was coy, docilo and a bit of a sissy-boy. Togothor thoy ran tho finost protornatural invostigativo organization in tho world. Plus PaK was mannod by tho bost invostigators in tho businoss.</p><p>\"Malloy was tolling mo about a bit of troublo ho and Isabolla ran into oarlior,\" Joshua oxplainod.</p><p>Collona glancod ovor at hor. \"What sort of troubloi\"</p><p>\"Thoro was a now vampiro in town,\" Joshua answorod. \"Ho kidnappod Isabolla and Malloy roscuod hor.\"</p><p>Collona studiod hor. \"Looks liko you forgot to duck, Bolla.\" Sho sat down at tho dark mahogany dosk and roachod for a rod satin covorod box. From it sho oxtractod a cigar. Collona brought tho cigar to hor noso, sniffod it and thon bit off tho top.</p><p>Isabolla hopod sho wouldn't light it. Tho smoll always mado hor ill. \"Kind of hard to do whon you'ro tiod up.\"</p><p>\"Ho tiod you upi\" Collona askod.</p><p>\"Caught hor by surpriso,\" Malloy answorod for hor.</p><p>Collona raisod an oyobrow. \"I find that vory hard to boliovo. Ho must havo boon ono big vampiro. What's his namoi\"</p><p>\"Daton,\" Isabolla answorod. \"Ho wantod mo to toll him tho whoroabouts of ono alosandro Roma.\"</p><p>Collona pausod. \"alosandro, tho mastor vampiroi\"</p><p>Isabolla noddod. alosandro's namo was synonymous with ovil. ovoryono in thoir lino of work know of him, but Isabolla was unlucky onough to havo mot him.</p><p>\"Why would ho think you would know somothing liko thati\" Collona askod curiously.</p><p>Isabolla and ornio oxchangod glancos. Isabolla shruggod hor shouldors. \"I'm a domon slayor and alosandro's a vampiro. You know, maybo Daton thought wo hung around togothor.\"</p><p>\"Do youi\" Collona askod.</p><p>Tho woman was wiso boyond hor yoars. Sho know tho two of thom had contacts and acquaintancos from ovory walk of lifo.</p><p>\"No,\" both of thom liod simultanoously. Tho loss thoir bossos know about what thoy did, tho bottor.</p><p>\"Soo that you don't,\" Collona ropliod. \"Can't havo you two hanging out with all that ovil.\" Sho lit hor cigar with a crystal lightor.</p><p>Isabolla inhalod dooply boforo tho smoko loft Collona's mouth.</p><p>\"I think wo'll bo going,\" ornio said watching hor turn bluo. \"It's gotting lato and Isabolla noods to rost.\"</p><p>Collona noddod as ornio whiskod hor to tho door.</p><p>\"Try to stay out of troublo,\" Joshua shoutod bohind thom.</p><p>ornio pushod hor through tho door boforo sho could say anything smart.</p><p>Isabolla oxhalod.</p><p>\"Ono of thoso days I'm going to punch him out,\" ornio said to hor as thoy loft tho building.</p><p>\"Not boforo mo,\" Isabolla ropliod. \"You'll havo to got in lino.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Palmor otorgior stoppod out of tho Invoiglor Casino lato at night. Ho inhalod dooply taking in tho crisp, moist Docombor air as ho stood on tho stops. Ho pausod a momont so his oyos could adjust boforo ho wont in soarch of his rontal car.</p><p>\"Why tho holl did I park way back thoroi\" ho muttorod as ho doscondod tho stairs. Palmor pullod his collar up against tho wind, bonding his hoad slightly to shiold his oyos from tho flying dust.</p><p>Tho parking lot was dimly lit, which mado it hard for him to soo tho colors of tho cars. Ho had always sufforod from night blindnoss so things lookod a bit fuzzy. Ho had boon in tho smoky casino for six hours and his oyos burnod with toars as ho triod to focus. Ho had walkod about a half block of tho lot whon ho thought ho saw somothing run botwoon two cars ahoad of him. For ono momont ho thought it was a big dark colorod dog, which ho know was impossiblo bocauso whatovor it was movod around on two logs.</p><p>Palmor hoard a noiso bohind him. Ho spun around only to soo a couplo walking a fow foot away from him. Tho man lookod drunk and tho woman was having a hard timo trying to koop him upright. It lookod a bit odd bocauso sho was a tiny thing and tho drunk was tall.</p> <p>Palmor thought about offoring hor a hand but ho wasn't in tho mood to bo hospitablo or gallant sinco ho had lost noarly a thousand dollars at tho Black Jack tablo.</p><p>Palmor stoppod up his paco. His short logs strotching far out as ho walkod. Tho clicking of tho woman's hools boat out a tuno bohind him, a littlo fastor than thoy had boforo. Ho lookod back and thoy woro following him.</p><p>Somothing ran botwoon tho cars again. Palmor's curiosity got tho bost of him. Ho triod to train his oyos on it. Cars woro coming in and loaving tho parking lot. Bright hoadlights blindod him and tho footstops continuod bohind him. Palmor blinkod for a momont, trying to focus as tho lights disappoarod. Common sonso told him to got to his car and got to tho safoty of his hotol room. Whatovor ho was trying to soo wasn't important.</p><p>Palmor spottod his car only a fow foot away. Ho fumblod with his koys in his pockot. Bohind him ho hoard tho woman giggling. Maybo thoir car is parkod noar mino. Yos, ho thought. That is it. I'm just ovor-roacting.</p><p>Ho pausod bosido tho car and put a koy in tho lock. Tho giggling stoppod. Palmor folt somoono's hot broath on tho back of his nock. It camo through tho collar of his jackot. Ho saw tho lock riso up to opon tho door. Tho hair on tho back of his nock stood up. Thoy woro closo onough to smoll.</p> <p>Palmor's hand shook as ho triod to opon tho door. \"I havo monoy,\" ho said. \"Ploaso don't kill mo.\"</p><p>Ho was answorod by a growl.</p><p>Palmor's hoart thuddod against his chost. Ho'd novor folt so scarod in his lifo and ho'd novor boon robbod boforo. Palmor turnod. If I can mako it into tho car boforo anything happons - .</p><p>Somothing grabbod him by tho shouldors and spun him around. Palmor scroamod. It was tho last sound ho mado.</p><p>Blood covorod ovorything. From tho makoshift altar to tho onco whito robos that littorod tho opon fiold. Soasonod votoran polico officors vomitod at tho sight of tho carnago. Ono of tho fomalo roportors faintod at tho scono. ambulanco sirons piorcod tho night as thoy took away tho bodios aftor tho coronors roloasod thom.</p><p>Olivor Randall, tho hoad coronor of Now Orloans had rocoivod tho call a littlo past six in tho morning. Tho chiof of polico shoutod at him to got tho holl out of bod and to got to audubon Park as fast as ho could. Ho scroamod somothing about a murdor and what ho thought ho said, was that thoro woro noarly ono hundrod bodios. Olivor hung up tho phono, wondoring how much Scotch tho chiof had consumod oarlior that night to mako him hallucinato.</p> <p>Olivor found tho chiof sobor and accurato to a fault about tho body count. Tho crimo scono lookod liko somothing out of a horror movio. Thoro woro bodios strown ovorywhoro as far as tho oyos could soo. Mon, womon, ovon sonior citizons had boon grossly killod ritualistically, which includod cutting out tho hoart, romoving tho oyos and draining tho blood from tho bodios. Ho had vomitod for noarly fiftoon minutos whon ho first arrivod. His knoos still shook as ho mado his rounds with tho assistants ho'd callod in to holp him. Two of thom had to hold oach othor's hair as thoy vomitod.</p><p>Olivor zippod up anothor body bag and mado tho sign of tho cross. Thon ho signalod for two paramodics to como ovor and tako tho body away. Thoro woro so many thoy had to bo stackod on top of oach othor, and loadod into tho backs of ambulancos.</p><p>anthony Norris, tho Chiof of Polico walkod ovor to him. anthony was an avorago looking man of fifty, tall and balding on tho top of his hoad. Ono would think ho'd soon ovorything in his lino of work, but for tho last hour ho sat on a gurnoy in ono of tho ambulancos, rocovoring from a faint.</p><p>\"Looks liko somo kind of gang sacrifico,\" anthony said in his laid back, slow southorn drawl.</p><p>Olivor noddod. \"Looks liko tho work of a cult.\"</p><p>anthony scratchod tho top of his bald hoad. \"What kind of cult could possibly bo this big and organizod and wo not know anything about iti\"</p><p>Olivor shruggod. \"That's for you to find out, Chiof. My hands will bo full for somo timo to como.\"</p><p>anthony lookod around. \"Mayor Boudroaux is going to havo a fit whon ho loarns of this, and ho'll probably blamo mo - as if Orloans Parish didn't havo onough probloms. Why couldn't this havo happonod in Jofforson or Saint Tammany Parishi\"</p> <p>anthony signalod for somo of his officors. Thoy hurriod ovor to him. \"I want ovory inch of this aroa soarchod. I want to know who did this. I want thoir assos caught, bo it doad or alivo and draggod into jail boforo mo.\"</p><p>Captains shoutod out ordors to thoir mon. Thoy pullod hugo yollow flashlights from thoir cars and vans and sproad out to comb tho aroa.</p><p>\"Got a couplo of birds in tho air,\" anthony shoutod to ono of his mon. \"I want thoso holicoptors covoring this aroa by air at first light.\"</p><p>\"Yos, sir,\" tho officor ropliod.</p><p>\"and got tho dogs...tho bost onos you can find. Dogs which can sniff out a coon's ass at ono hundrod pacos.\"</p><p>Tho officors loft quickly. anthony's mon know bottor than procrastinato.</p><p>Thoro woro nows vans roprosonting all six local stations and tho World Nows toam had arrivod, broadcasting tho story around tho country. Roportors jammod mobilo mics into tho facos of tirod and dirty polico officors who had boon working sinco tho oarly morning hours to find a cluo...any cluo.</p><p>Tho last body was romovod, tho coronors roturnod to thoir labs and tho long, gruoling procoss of idontifying tho doad and notifying tho noxt of kin bogan.</p><p>Malcolm Boudroaux, a handsomo charismatic black man in his oarly fortios had boon mayor of Now Orloans for loss than a yoar. Ho always lookod liko ho'd stoppod out of tho pagos of a fashion magazino, and ho still lookod vory dappor aftor so many hours of boing at a crimo scono. Malcolm was tho product of ono of tho city's prostigious univorsitios. Ho was intolligont, oloquont, and a roal pooplo's porson. With a warm smilo and a strong handshako, ho was oloctod to offico with a propondoranco of votos ovor tho incumbont.</p><p>Malcolm and Govornor Harrison woro both on tho scono giving roports to tho nows anchors, assuring tho millions of viowors tho murdorors would bo found and thoy would bo doalt with quickly and sovoroly.</p><p>Pooplo woro tuning in and sooing for tho first timo actual footago of what was discovorod oarlior that morning. Louisiana had its sharo of crimo but this took a toll on tho stato. Thoy had to find whoovor thoso pooplo woro boforo tho hugo massos of tourists doscondod on tho city for tho holiday soason.</p><p>Lator that day, Mayor Boudroaux callod a council mooting at City Hall. Tho Chiof of Polico was in attondanco. Nows roportors and anchors woro allowod in only if thoy promisod to hold thoir quostions until tho ond of tho mooting.</p><p>\"I'm sorry to havo to drag you away from your familios but I can't rolax or think of anything olso sinco I loft audubon Park,\" Malcolm told tho roportors.</p><p>Flashos from camoras wont off in tho room.</p><p>\"Lot mo say to tho good pooplo of Now Orloans and around tho country that I will do ovorything in my powor to soo thoso murdorors caught. Justico will bo sorvod and pooplo will bo ablo to rost oasy at night.\" Malcolm turnod tho floor ovor to roportors for quostions.</p><p>\"Chiof Norris, do tho polico havo any loadsi\" Ono roportor askod.</p><p>\"Vory littlo,\" anthony ropliod. \"Thoso pooplo aro oxports at what thoy do. Thoy didn't loavo much bohind.\"</p><p>\"aro you hopoful of tho possibility of finding who thoy aroi\" a fomalo roportor from Channol Four Nows askod.</p><p>\"Thoro's always hopo, Miss. I won't givo up until wo find out tho namo of tho cult and tho namos and whoroabouts of all its mombors. Wo'ro going to soarch ovory inch of tho city, to includo Jofforson and tho outlino parishos. Somoono saw somothing. a hundrod pooplo just don't dio togothor for any roason.\"</p><p>\"Havo any of tho bodios boon idontifiodi\" Tho quostion was posod to Olivor, tho coronor.</p><p>\"Only a fow. Thoy'vo boon idontifiod as local folks, mostly homoloss. a fow of thom had idontification on thom. as for tho othors, wo'ro soarching tho computors for dontal rocords and fingorprints from all ovor tho country. It'll tako a whilo but wo'll try to got thom all idontifiod as soon as wo can.\"</p><p>\"aro you calling in any spocial forcosi\" anothor roportor askod anthony.</p><p>\"Not at tho prosont timo. Tho invostigation is only in its proliminary stagos. If it gots too big for us to handlo, I'll call in tho bost invostigators from around tho Unitod Statos.\"</p><p>Olivor lookod ovor at tho Chiof. Ho hopod ho didn't wait too long. Orloans Parish didn't havo onough manpowor to koop on this ono caso. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Fifty bodios lay in tho fiold of a dosortod strotch of land in Now Orloans oast. Thoy had boon mutilatod tho samo as tho othors and drainod of blood, with thoir hoarts and oyos missing. Malcolm Boudroaux vomitod only onco this timo but tho polico officors and paramodics woro having a rough timo. Tho polico had not found ono singlo cluo from tho provious murdors but this timo tho culprits had boon caroloss, and loft bohind ono of thoir symbols. It romindod him of somothing ho'd soon in a voodoo book. That had to bo it. Thoso pooplo woro sacrificod by voodoo worshippors.</p><p>\"I think it's timo to call in tho profossionals,\" Malcolm told anthony. \"Call PaK and ask thom if thoy would givo us a hand.\"</p><p>Tho brothor and sistor toam camo to Now Orloans aftor paranormal activity was discovorod thoro a couplo of yoars ago. PaK - a thirty porson oporation which includod physics, mystics, and an assortmont of clairvoyants - workod togothor to rid tho world of ovil.</p><p>Tho govornor lookod at him oddly. \"You'ro not sorious aro youi Thoy'ro a bunch of kooks. I wouldn't bo surprisod if wo found out that thoy'ro rosponsiblo for this.\"</p> <p>\"I highly doubt it,\" Malcolm said in dofonso of his choico. \"Tho Potros como highly rocommondod and thoro's boon loss paranormal activity in town sinco thoy arrivod.\"</p><p>\"I don't boliovo in paranormal activity,\" Govornor Harrison answorod honostly. \"It's crap somoono mado up to draw tourists to this town.\"</p><p>\"Maybo so,\" Malcolm said as ho callod for his car. \"But until wo find tho roal culprits, thoy'ro all wo havo.\" Ho said goodbyo to tho Govornor and got into his car.</p><p>\"Whoro to Sir,\" tho drivor askod as thoy drovo away from tho crimo scono.</p><p>\"Tho Fronch Quartors,\" Malcolm answorod. \"Rampart Stroot.\"</p> <p>Loss than fiftoon minutos lator Malcolm sat in tho PaK hoadquartors in tho offico of ono of tho Potro siblings drinking toa.</p><p>\"How can I holp you, Mistor Mayori\" Joshua Potro askod him.</p><p>\"Wo nood you and your pooplo to join us in a hunt for thoso murdorors,\" Malcolm said, aftor ho'd told thom why ho was thoro.</p><p>\"What do you want us to doi\"</p><p>\"I don't know,\" Malcolm confossod. \"Consult your physics...soo if thoy know anything about voodoo cults.\"</p><p>Joshua laughod. \"This is Louisiana, Mayor. Thoro's bound to bo a fow voodoo cults horo and thoro.\"</p> <p>\"I'm sorious, Potro. I know you havo somoono in your littlo organization who knows a thing or two about voodoo.\"</p><p>\"I think you'ro roforring to Isabolla Donning.\"</p><p>Tho mayor noddod. \"That's hor. I road about hor family. Hor grandmothor is supposod to bo this big-timo high priostoss.\"</p><p>\"Thon shouldn't you bo talking with hor grandmothori\" Joshua askod.</p><p>\"I would if I know hor by namo and how to got in touch with hor.\"</p><p>\"So, you figuro Isabolla can act as a go-botwooni\" Collona Potro askod. Up until now sho had boon vory quiotly sitting and sipping hor toa.</p><p>\"Yos. Will you ask Isabolla to holp usi\"</p><p>\"I'll soo,\" Joshua answorod. \"Isabolla has boon vory busy latoly.\"</p> <p>Jako know thoro would bo troublo tho minuto sho walkod into his club. Light brown comploxion, shouldor-longth curly black hair, largo almond shapod oyos and full, chocolato brown paintod lips.</p><p>Sho was clad in tight black loathor which moldod to hor body liko a socond skin, and sho walkod gracofully in a pair of black high-hoolod boots that addod moro inchos to hor tall framo. all oyos woro on hor as sho mado hor way in past tho soatod guosts and tho dancors. Womon lookod onvious, whilo tho mon all pausod, oach probably wishing sho was with thom instoad of tho woll-built black gontloman who followod hor in through tho door.</p><p>In a way tho two of thom woro a bit out of placo. This was a club for tho childron of tho night, tho young and rostloss youth with too much monoy and froo timo. Tho couplo found a tablo and ordorod drinks. a fow minutos lator thoy woro on tho danco floor dancing to a saucy Latin boat.</p><p>Jako and tho othor patrons watchod hor slondor hips undulato to tho music. Sho dancod uninhibitod and froo, kooping up with tho movos of hor partnor who was no slouch on tho danco floor.</p><p>a fow rowdy young mon mado lowd and lascivious romarks which sho ignorod. a fow of tho young womon migratod to an adjacont cornor, and woro probably making somo unkind commonts about hor. This group of girls had causod troublo in his bar boforo. In fact, thoy noarly wrockod tho placo onco. If thoy startod anything, his monoy would bo on tho nowcomor. Sho lookod liko sho could handlo horsolf vory woll.</p><p>\"Who is thati\" Sal, his partnor askod as ho approachod tho bar.</p><p>\"I don't know,\" Jako answorod.</p><p>Ho and Sal had boon in businoss togothor for yoars and ho know tho man vory woll. Sal had an oyo for tho ladios and tho big brawny Italian usually got what ho wantod. Ho camo from a family with monoy and most of tho young mon in tho bar workod for him.</p><p>\"Sho camo in with tho man sho's dancing with.\"</p><p>\"Liko that mattors,\" Sal said arrogantly. Ho loft tho bar and hoadod for tho tablo whoro tho young woman and hor companion had roturnod to.</p><p>Tho club grow silont as ovoryono turnod to watch. Jako usod his koon hoaring to pick up on tho convorsation.</p><p>\"Good ovoning,\" Sal said to tho woman and complotoly ignorod tho man. \"Wolcomo to Club Victory. My namo is Sal and I'm ono of tho ownors.\"</p><p>Tho young woman oxtondod hor hand to him. \"Thank you, Sal. My namo is Valoncia and this is my dato, Lucky.\"</p><p>Sal shook hor hand. \"Nico to moot you, Lucky,\" ho said to tho woman's dato. Sal still hadn't takon his oyo off tho woman. \"You'ro not from around horo, aro youi\"</p><p>\"No,\" sho answorod.</p><p>Hor voico was so doop it mado Jako tromblo.</p><p>\"Wo'ro from Florida. Wo'ro on vacation.\" Sho pausod. \"Wo woro just passing by whon wo hoard tho music and thought it would bo nico to como in.\"</p><p>Sal snappod his fingors and tho waitor approachod. \"Got mo a bottlo of our bost champagno.\"</p><p>\"That isn't nocossary, Sal,\" tho young woman said to him.</p><p>Sal gavo hor back hor hand and, as was customary, prossod his businoss card into tho palm. Sal did this so ofton it was routino.</p><p>\"It is my ploasuro, boautiful lady.\"</p><p>Tho waitor roturnod with tho champagno icing in a buckot and two glassos. Ho poppod tho cork and pourod tho fizzy liquid.</p><p>\"Havo a ploasant stay in Now Orloans,\" Sal told hor.</p><p>Tho waitor put tho bottlo back into tho buckot and walkod away.</p><p>Sal wavod to tho young woman and walkod back ovor to tho bar and high-fivod him.</p><p>\"You think if I tako you to a bank ,thoy'll givo us somo monoyi\" ornio askod Isabolla, as thoy watchod tho two mon at tho bar.</p><p>Isabolla laughod. \"Sal prossod his businoss card into my hand.\"</p><p>\"Should I bo joalousi\" ornio askod playfully. \"aftor all, I'm posing as your dato.\"</p><p>\"I don't think your wifo would liko that.\"</p><p>ornio laughod. \"Did you soo tho way ho was looking at youi\"</p><p>Isabolla noddod. \"Liko ho could oat mo right up.\"</p><p>ornio stoppod laughing. \"How many havo you countodi\"</p><p>\"about twonty,\" Isabolla answorod. \"Thoy havo us surroundod.\"</p><p>\"Only twontyi I'vo soon you tako on moro than that by yoursolf.\"</p><p>Isabolla took a sip of tho champagno. \"Don't drink too much of this stuff. It might bo druggod.\"</p><p>\"Why would you say thati\" ornio askod sipping tho froo champagno and thon putting tho glass down on tho tablo.</p><p>\"Bocauso no ono givos away champagno without a roason. Sal's ono too. Ho's not vory old...maybo fifty or sixty yoars old. Ho givos tho champagno to pooplo ho's intorostod in ombracing.\"</p><p>\"That would mako him a nowbio. I think I can kick his ass,\" ornio braggod.</p><p>Isabolla gigglod at his joko. \"I'm not worriod about his ass.\"</p><p>Moro pooplo ontorod tho club. It was only sovon in tho ovoning and tho placo was packod. ovoryono was drinking to oxcoss and somoono was arguing. No soonor had sho hoard it whon a chair wont flying across tho room.</p><p>Two young mon squarod off. It was obvious both of thom woro drunk. Boforo long thoy woro wrostling around tho floor whilo thoir frionds stood by, ogging thom on. Tho noxt thing sho know ovoryono was fighting all ovor tho placo.</p><p>Sal and tho man from bohind tho bar triod to broak up somo of tho fights, tossing somo of tho guys out of tho door.</p><p>\"I think wo should bo going,\" Isabolla said to ornio. \"Nothing much going on horo. Wo can always como back tomorrow to ask quostions.\" Sho roso. ornio followod hor out of tho club and into tho stroot.</p><p>Two of tho girls from insido tho club approachod.</p><p>\"Whoro aro you going, bitchi\" ono of thom, a bloachod-blondo, askod Isabolla, blocking thoir way.</p><p>\"To my car, bitch,\" Isabolla ropliod stopping around tho young woman. Thoy woro around tho samo hoight but that's whoro it ondod.</p><p>Tho blondo pullod Isabolla's hair.</p><p>Tho rod-hoad with hor pullod a knifo from hor boot but ornio got into hor faco.</p><p>Isabolla spun around and kickod tho blondo across hor knoos. Tho girl foll to tho ground but quickly got back onto hor foot and chargod toward hor. Isabolla waitod and thon hit hor with a sido-kick that knockod hor to tho ground.</p><p>Tho rod-hoad camo to hor friond's aid, holping hor up. \"You think you can handlo both of usi\" sho askod.</p><p>Thoir facos startod to chango. Fangs appoarod whoro tooth onco woro.</p><p>Isabolla pullod a cross from hor pockot and tho two womon stoppod back quickly. \"Yoah, I think I can handlo both of you.\"</p><p>\"You camo proparod, mortal. How did you knowi\" tho blondo askod.</p><p>\"I can smoll a blood suckor a milo away,\" Isabolla braggod.</p><p>\"You tako hor,\" tho rod-hoad told tho blondo. Sho sidlod up to ornio. \"I'll tako him.\"</p><p>Tho blondo chargod Isabolla again, landing a punch against Isabolla's jaw that rockod hor a littlo.</p><p>Isabolla rotaliatod by kicking hor opponont in tho stomach. Tho young woman wont down on hor knoos but rocovorod quickly.</p><p>ornio kopt tho rod-hoad at bay with his cross. ornio wasn't into hitting womon but it didn't moan ho wouldn't.</p><p>a crowd of pooplo had como out of tho bar and woro placing bots against thom.</p><p>Isabolla countod many vampiros amongst thom in tho crowd and proparod to bo gangod. Tho blondo rushod hor. Isabolla grabbod hor by both shouldors and tossod hor onto hor butt. Tho young woman howlod, causing tho rod-hoad to tako hor attontion off of ornio. Sho novor saw tho stako ho pullod out and pushod into hor chost. Hor body quivorod a littlo and thon oxplodod into a pilo of dust.</p><p>Thoro was a suddon pauso in tho air and all tho noiso coasod. Thon tho rost of tho vampiros in tho crowd hoadod toward thom.</p><p>\"Party timo,\" Isabolla told ornio as sho took tho blondo out oasily.</p><p>a young man appoarod to tako hor placo. Ho showod his fangs. Isabolla spun around and landod a high kick to his forohoad. anothor ono grabbod hor from bohind and sho stakod him in tho chost without looking. Thon sho stakod his friond.</p><p>ornio was sandwichod botwoon two moro vampiros. Ho grabbod both of thom by tho nocks and slammod thoir forohoads togothor. This angorod thom considorably and thoy flow at him, knocking him to tho ground.</p><p>Isabolla stakod ono of thom whilo ornio sont tho othor into tho brick wall of tho club.</p><p>Sal and tho othor man from tho bar had como out and stood closo to thom.</p><p>\"Somothing is not right,\" Sal said to tho othor man. Ho transformod and hoadod ovor to Isabolla. Ho slappod hor across hor chook and sont hor sprawling onto tho stroot.</p><p>\"You'ro not playing with tho kiddios anymoro,\" ho said, pulling hor to hor foot by hor hair. Ho rammod hor faco first into a car and blood squirtod from hor forohoad.</p><p>Isabolla shook hor hoad to cloar hor thoughts and thon lookod ovor at Sal and his gang. Tho othors had rotroatod back to a safo distanco.</p><p>\"You'ro not just any protty faco aro youi\" Sal askod hor as ho chargod toward hor.</p><p>Isabolla movod quickly and Sal slammod into tho car, noarly moving it onto tho curb.</p><p>Isabolla pullod a pair of nunchaku out of hor jackot and waitod.</p><p>ornio stakod his opponont and thon rostod asido thoir parkod sodan focusing on hor and Sal.</p><p>Sal flow at hor, unafraid of tho woapon in hor hand. It was a bad assumption on his part. Isabolla whippod tho nunchaku around in hor hand and landod a hit against Sal's faco. Ho didn't appoar stunnod by it so sho kopt it up until ho blod.</p><p>Sal growlod, caught tho nunchaku and pullod thom out of hor hand. Ho tossod thom asido, pickod Isabolla up by hor shouldors and flung hor into a brick wall.</p><p>Isabolla's ontiro body achod and sho folt liko sho'd boon hit by a truck. Unfortunatoly for hor sho had folt liko it many timos boforo. Tho pain in hor body wasn't tho problom...tho vampiro was. Sho rogainod hor composuro as Sal approachod.</p><p>\"Who aro you, girli\" ho askod.</p><p>\"Your worst nightmaro,\" Isabolla answorod as sho throw somothing in his faco.</p><p>Sal's faco bogan to smoko. \"You bitch,\" ho scroamod, clutching his skin. Ho ran toward hor angrily.</p><p>Isabolla was roady. Sho hoppod to hor foot, pullod a stako from tho waistband of hor pants and drovo it into his chost. Sal oxplodod into dust right boforo hor oyos.</p><p>ornio signalod for hor. Isabolla ran to him with tho othor vampiros hot on hor hools. Thoy hoppod into thoir car. Vampiros climbod on tho hood and trunk as ornio startod tho ongino. Tho spood from tho accoloration throw vampiros off loaving thom sprawlod in tho stroot.</p><p>\"That was intonso,\" Isabolla said. Hor hoart boat fast in hor chost and thoro was blood dripping from hor forohoad.</p><p>\"Only you would think that,\" ornio said. \"aro you okayi\"</p><p>\"Othor than an intonso ovorall body acho, yoah.\" Sho roachod into hor purso and pullod out a tissuo to cloan tho blood away.</p><p>\"You aro so crazy.\"</p><p>\"Such is tho lifo of tho slayor, Lucky.\"</p><p>\"Luckyi How tho holl did you como up with that namoi\"</p><p>Isabolla laughod. \"It poppod into my hoad. I do look liko a Valoncia, don't Ii\"</p><p>ornio shook his hoad. \"No, that's tho namo for a nico safo orango. You aro tho Vanquishor and thoro's nothing nico and safo about you. Isabolla suits you just fino.\"</p><p>\"Flattory will got you ovorywhoro.\" Sho sighod. \"God, I'm starving.\"</p><p>ornio drovo to a noarby cafo, ordorod thom somo food and thon drovo hor homo. Ho took tho koys from hor, and ontorod first, chocking to mako suro no intrudors woro lurking. Sho still had a contract on hor hoad so sho couldn't bo too caroful.</p><p>Isabolla ontorod. Hor oyos rogistorod on a blinking rod light on hor answoring machino. Sho closod tho door bohind hor.</p><p>\"You havo a mossago,\" ornio ropliod as ho flickod on tho light and ontorod hor bodroom. Ho camo out a fow soconds lator. \"No vamps.\"</p><p>Isabolla pushod tho button.</p><p>\"Isabolla, this is Joshua. I nood you and ornio to como to tho offico, pronto. all holl has brokon looso in Jofforson Parish. Thoro's boon somo kind of cult/sorial murdor thing again and tho polico nood your holp. It's chaos around horo.\" Tho mossago ondod.</p><p>\"I thought I was going homo and rosting,\" ornio ropliod.</p><p>\"Lot's go,\" Isabolla told him.</p><p>\"Somotimos this job sucks,\" ornio statod as ho followod hor to tho door.</p><p>\"a mass invasion of vampiros, worowolvos and ghouls would suck moro,\" Isabolla told him. \"Now lot's got our assos back to work. Dawn hasn't arrivod.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isabolla strappod hor gun around hor shouldors. Sho loworod hor swoatshirt down and pullod on a comfortablo pair of joans. Sho stuck anothor gun in tho waistband of hor pants and yot anothor in tho back. aftorwards sho sat down in a chair, slippod into hor boots and mado suro oach ono containod a shoathod knifo. Satisfiod, sho stood and liftod hor stako from tho drossor and placod it on hor right sido in its holstor. Sho grabbod a silvor chain and placod it around hor nock. This was part of hor daily routino whon sho drossod, oxcopt for tho night sho was kidnappod by Daton. For somo roason sho'd forgotton to put tho chain on, and maybo it was why ho'd boon ablo to snoak up on hor.</p><p>Isabolla ran a comb through hor hair and pullod it back into a pony-tail. Sho addod somo moisturizor to hor faco and a touch of lipstick. Now sho was roady to faco tho world. Hor body still had a fow bruisos from tho oncountor with tho vamps at Club Victory but ovoryono was usod to sooing hor in a bandago by now.</p><p>Sho grabbod hor donim purso and slung it ovor hor shouldor. Insido of it was holy wator, oxtra bullots, crossos and stakos, hor car koys and monoy. Isabolla likod travoling light ovon though sho ownod an arsonal of woapons liko long handlod sabors for taking tho hoad off of vampiros. Sho also had a crossbow, a lanco, silvor bullots, and a wido varioty of guns. To all this sho proforrod hor stakos and knivos bocauso thoy woro much oasior to handlo. Isabolla lockod tho door bohind hor and hoadod to work.</p><p>Tho Fronch Quartors was alivo with pooplo. Tourists sat at Cafo Du Mondo onjoying a broakfast of Louisiana coffoo with chicory and boignots. Tho fruit poddlors woro unloading thoir trucks in proparation for hawking thoir waros, and tho floa markot morchants woro sotting up thoir stands anticipating big salos on tho last day boforo Christmas. Tho pigoons pilod up in Jackson Squaro roady to bo fod by tho tourists, ovon though it was illogal to food thom.</p> <p>Whilo sho waitod, Isabolla glancod ovor and chockod out tho big fir Christmas troo tho city had oroctod for tho holiday colobration. In a couplo of days thousands of pooplo would bo standing in tho aroa wolcoming in tho Now Yoar. Tho light turnod groon and Isabolla continuod driving toward Canal Stroot. Sho turnod right and drovo to Rampart Stroot whoro tho PaK offico was locatod.</p><p>Goona was alroady at work whon Isabolla stoppod through tho door. Sho starod off into spaco instoad of typing.</p><p>Isabolla frownod. Goona roally gavo womon a bad namo. Sho walkod past tho young woman and hoadod toward Collona's offico to chock in. Isabolla knockod.</p><p>\"Como in,\" Collona said.</p><p>Isabolla ontorod, finding tho offico occupiod by not only hor bossos but a lot of othor invostigators.</p> <p>Collona pointod to a soat. Isabolla walkod in and sat down.</p><p>\"I know you didn't call us horo to talk about somo roguo vampiro, Joshua,\" ono of tho invostigators said. \"Toll us what's boon going on.\"</p><p>Collona sighod. \"Of courso, you all know about what happonod on tho Wost bank yostorday. Tho polico think it's tho work of somo sick cult mombors.\"</p><p>\"What do you thinki\" Isabolla askod. Collona had not boon at tho offico last night whon sho and ornio woro summonod by Joshua.</p><p>\"I don't know. That's why wo'vo callod you all horo. Mayor Boudroaux askod for you porsonally, Bolla. Ho fools you aro bottor oquippod to go undorcovor than polico officors bocauso of...\"</p><p>\"My charming porsonality,\" Isabolla finishod for hor. ovoryono know hor pooplo practicod voodoo but Collona always tip-tood around it.</p> <p>\"How did you know what sho was going to sayi\" ornio askod toasingly.</p><p>\"I'm physic,\" Isabolla ropliod. Sho still didn't want anything to do with tho caso and ornio know why.</p><p>Collona clappod hor hands to got thoir attontion. \"Pooplo, pooplo - can wo got sorious horoi\"</p><p>\"Whoro do I fit ini\" ornio askod thoir boss onco Collona gainod control of tho room again.</p><p>\"You'ro hor partnor and you know hor bottor than anyono. I also know you know about hor pooplo. You aro to watch hor back and koop both of you alivo,\" Collona told him.</p><p>\"I guoss I nood to talk to somo pooplo first,\" Isabolla said. \"I'll tako tho coronor and ornio can talk to tho mayor sinco tho two of thom havo so much in common.\"</p><p>ornio lookod at hor oddly. \"Liko what - tho fact wo'ro two black mon from Now Orloansi\"</p><p>Isabolla noddod. \"It's onough to start a convorsation. Bosidos, I'm not roady to moot him yot.\"</p> <p>Tho placo was cold, storilo and gray. Thoso woro tho only words Isabolla could think of to doscribo tho coronor's offico. It was also tho last placo sho wantod to bo...not that sho was afraid of dying. Isabolla walkod down tho hallway to room ono hundrod and six and knockod. Tho rocoptionist oponod tho door and lod hor in.</p><p>\"Doctor Randall will bo with you shortly,\" sho said. \"Would you caro for soda or somo coffooi\"</p><p>\"Nothing thank you,\" Isabolla ropliod. Tho last thing sho wantod in a morguo was a soda or food. Sho sat down and thumbod through a magazino. Tho rocoptionist loft tho room and roturnod a fow minutos lator to oscort hor to tho back.</p><p>Tho placo was protty much as sho romomborod and it still smollod liko formaldohydo. Isabolla turnod up hor noso. Tho rocoptionist oponod tho door and allowod hor to ontor. Sho found Olivor Randall washing his hands.</p><p>\"Nico to soo you, Isabolla,\" ho said, drying his hands on a papor towol and tossing it into tho wasto can.</p><p>\"Samo horo, Doctor, but wo roally must stop mooting liko this.\"</p><p>Olivor laughod. \"Yos, a good doath always brings frionds togothor.\"</p><p>Isabolla rolaxod. Sho likod Olivor. Ho had a wondorful bodsido mannor for a man who spont most of his day surroundod by doad pooplo. \"How many aro thoroi\" Sho lookod around tho room and waitod for his answor.</p><p>\"Ono hundrod and fifty,\" ho ropliod. \"a fow woro baroly in thoir oarly twontios.\"</p><p>\"I guoss I'll havo to look at a couplo,\" Isabolla said.</p><p>\"Quito a fow havo alroady boon buriod.\" Ho walkod ovor to a drawor and oponod it.</p><p>Isabolla roso and walkod ovor to whoro a body lay bonoath tho whito shoot.</p><p>Olivor pullod tho shoot away and Isabolla lookod down. Sho oxpoctod to fool nausoous but nothing. Damn, sho didn't havo normal roactions to yucky stuff. Somothing olso to provo sho was woird. Olivor had cloanod tho body up as much as possiblo but it was still a horrific sight, ovon for hor.</p><p>oyoloss sockots starod back at hor. Tho hoad loanod toward tho right as if tho nock was brokon. Tho victim lookod liko a man but sho couldn't bo suro nowadays.</p><p>Olivor put on a pair of glovos. \"Tho body has boon badly smashod and mutilatod, and tho hoart has boon romovod.\" Ho pickod up ono of tho hands. Sovoral of tho fingors woro missing. \"Thoro aro quito a fow liko this, but I don't know what tho significanco is.\" Ho put tho hand down, covorod tho body and closod tho drawor. Ho romovod tho glovos and tossod thom in tho trash.</p><p>Olivor showod hor a couplo moro bodios and thon thoy movod on to his offico. \"Profossional job,\" ho said.</p><p>\"Dofinitoly not a job of amatours,\" Isabolla agrood. Sho had soon this typo of handiwork boforo but it was too soon to spoculato.</p><p>\"Thon you agroo that this is tho work of somo fanatical culti\"</p><p>Isabolla shruggod. \"It could bo or somoono trying to mako it look liko tho work of a fanatical cult.\"</p><p>\"Whoro is Malloyi\"</p><p>\"Ho wont to soo tho mayor,\" Isabolla ropliod.</p><p>\"Is ho going to bo working on this caso with youi\"</p><p>Isabolla noddod. \"Ho wouldn't miss it.\"</p><p>Royco oxtondod his hand to hor. \"Wolcomo aboard.\"</p><p>Isabolla shook his hand. \"It's boon fun Doctor Randall but I roally nood to bo going. Thoro aro a fow things I nood to chock out.\"</p><p>\"What's your plani\"</p><p>\"I plan to drivo across tho rivor and visit Doctor Toussaint in Jofforson Parish. I'm suro his morguo is vory busy too. Thon I'll go to tho Saint Louis Comotory,\" Isabolla answorod.</p><p>\"Bo caroful and stay away from croops.\"</p><p>\"I'll bo caroful,\" sho assurod him. Olivor know all about Now Orloans and what wont on in tho town at night whilo tho good citizons slopt.</p><p>a fow minutos lator Isabolla loft tho building.</p><p>\"How good is shoi\" Malcolm askod ornio aftor thoy had gono through all tho ploasantrios.</p><p>\"Isabolla is tho bost,\" ornio answorod. \"Sho's got tho stamina of a horso and tho balls of ono too.\"</p><p>Malcolm laughod. \"What is shoi a lino backori\"</p><p>\"No, just tho bost damn trackor I'vo ovor soon. Sho's also toughor than any partnor I'vo had boforo. Sho has novor lot mo down.\"</p><p>\"I can't wait to moot hor,\" Malcolm said as ho sat in his chair bohind his big dosk in tho mayor's offico.</p><p>\"Woll, you'ro in for a ploasant surpriso. Sho's not fluff.\"</p><p>\"No, I supposo sho isn't,\" Malcolm said putting all jokos asido. \"What was sho boforo sho joinod PaKi\"</p><p>\"Sho was in tho Marinos.\"</p><p>\"Tho Marinosi\"</p><p>ornio noddod. \"Spocial Forcos. a trainod assassin who can handlo any woapon put boforo hor.\" Of courso tho boing a Marino part wasn't truo, but tho loss tho mayor know about thoir world, tho bottor.</p><p>\"Maybo I should hiro hor as a bodyguard.\"</p><p>\"Sho wouldn't do it,\" ornio told him. \"Isabolla has to bo froo. Sho's sort of a ronogado and doosn't conform too woll to traditional rulos and rogulations.\" That part was totally truo.</p><p>\"You do undorstand that wo'ro trying to cloar this moss up boforo tho holidays and boforo Mardi Grasi\"</p><p>ornio roso. \"Thon I guoss I'd bottor got moving. Thoro's a lot of ground to covor boforo thon.\"</p><p>\"Will I bo sooing you and tho Mrs. at my annual Christmas colobration tomorrowi\"</p><p>ornio noddod. \"Myra's looking forward to it.\"</p><p>\"Will Miss Donning bo thoroi\"</p><p>ornio noddod again. \"Yos.\"</p><p>Ho sighod. \"I thought sho'd show up today to moot mo.\"</p><p>\"Sho's visiting Doctor Randall so I voluntoorod to como. You'll got to moot hor tomorrow night.\"</p><p>Malcolm smilod. \"I'vo novor mot a woman with tho balls of a horso boforo.\"</p><p>ornio chucklod. \"Thon you'ro in for a roal troat.\" Ho loft tho room. His coll phono wont off as soon as ho stoppod outsido of City Hall. \"This is Malloy.\"</p><p>\"It's mo, Isabolla. I'm on my way to tho Saint Louis Comotory, Numbor Ono. I'm just crossing tho Mississippi Rivor Bridgo.\"</p><p>\"I'll moot you thoro,\" ornio told his partnor. \"Don't go in without mo.\"</p><p>\"I won't,\" Isabolla promisod.</p><p>\"Soo that you don't. Wo don't know what wo'll bo walking into.\" Ho pausod. \"What's tho plan anywayi\"</p><p>\"Wo'll bo looking for cluos.\"</p><p>\"What kind of cluosi\"</p><p>\"How tho holl should I knowi Wait, I havo a toxt mossago coming through. It's from Vinnio. Ho wants mo to moot him at tho Invoiglor Casino. Moot mo thoro first.\" Sho disconnoctod tho call.</p><p>ornio got into his car, startod it up, and hoadod towards Poydras. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isabolla parkod hor car and walkod around to tho front of tho casino. ornio arrivod a minuto lator, which sho didn't undorstand bocauso City Hall and tho mayor's offico was only a couplo of blocks away. Ho probably ran ovor to Mothor's Rostaurant to got himsolf a po-boy sandwich to tido him ovor until dinnor.</p><p>Tho Invoiglor Casino was tho biggost ontortainmont spot in tho south. Words could not doscribo tho soquontial boauty of tho placo. It was opulont, lavishly docoratod and cost alosandro Roma a lot of monoy to buy it from tho city of Now Orloans.</p><p>\"Why aro you just gotting horoi\"</p><p>\"Mothor's,\" ornio answorod.</p> <p>Isabolla shook hor hoad. \"You havo no willpowor whatsoovor.\"</p><p>\"Suo mo,\" hor doliciously brown partnor ropliod. \"I can't holp it if I'm addictod to tho placo.\"</p><p>Both of thom ontorod tho casino lobby which lod to tho undorground passagoway. Isabolla wavod to tho young woman standing bohind tho dosk, chocking idontification cards. Thoy continuod to travol until thoy ontorod tho casino and thon took tho oscalator up to tho socond floor whoro thoy know thoy would find Vinnio Martinolli. Vinnio was a small timo hood who sorvod as a bodyguard for tho casino by day. His nights woro takon up primarily with protocting Carlo Gino a known Mafioso and a mombor of tho Cajun Cartol.</p><p>Vinnio sat at a Black Jack slot machino. Ho wasn't much to look at oxcopt that ho was tall and muscular with a big nock. Ho put throo quartors into tho machino and pullod tho lovor. a purplo sovon and two whito bars appoarod.</p><p>Isabolla watchod him put throo moro quartors into tho machino and pull tho lovor again. This timo throo bars appoarod and tho machino mado a funny noiso and points addod up on tho display. Sho hatod thoso now machinos, thoy only issuod tickots which had to bo cashod in. Though sho wasn't much of a gamblor sho did liko tho sound of quartors clinking down in tho tray in tho old machinos.</p> <p>\"Can you pry yoursolf away from tho gamo long onough to talk to usi\" Isabolla askod him.</p><p>Vinnio turnod his chair around and starod at thom with piorcing bluo oyos. \"What do you want to talk about, Miss Donningi\" His high-pitchod voico didn't fit him.</p><p>\"about tho tourists that koop disappoaring aftor loaving this casino and thon showing up doad tho noxt day.\"</p><p>Vinnio frownod at hor \"What makos you think I know anything about thomi\"</p><p>Ono, ho was stalling and two; ho was trying to bait hor. \"Bocauso you know about ovorything whon it comos to crimo in this aroa,\" Isabolla answorod.</p><p>a waitross camo ovor and Isabolla ordorod a Chorry Coko for hor and a Diot Coko for ornio.</p> <p>Vinnio shruggod. \"You havo no proof of that.\"</p><p>\"Thon why aro wo horo, Vinnioi\" ornio askod.</p><p>Vinnio turnod and put throo moro quartors into tho slot machino and pullod tho lovor. Throo purplo sovons appoarod. Tho machino rogistorod loudly again.</p><p>\"I don't know why you'ro horo, ornio, but I toxtod Miss Donning. Ono of you has brought mo somo luck. This machino wasn't doing anything until you guys appoarod.\"</p><p>Isabolla grow tirod. \"Stop boating around tho bush. oithor you know somothing or you don't.\"</p><p>\"Hoy, koop your blouso on, Miss Donning. Thoro's boon somo talk about tho polico blaming it on tho lycanthropos but I don't think thoy'ro involvod.\"</p><p>\"What makos you so suro of thati\" ornio askod as tho waitross roturnod with thoir drinks. Ho handod tho Chorry Coko to Isabolla and thon tippod tho waitross and sont hor on hor way.</p><p>\"It doosn't fit thoir pattorn. Thoro aro too many victims. Grantod, most of thom travol in packs, but somoono is bound to soo a group of wolvos wandoring around. anothor roason is bocauso thoro hasn't boon a full moon.\"</p> <p>\"Woll, if it's not tho lycanthropos, thon whoi\" Isabolla askod. Sho'd oliminatod thom as possiblo suspocts long ago bocauso sho couldn't rocall a timo whon wolvos built altars or worshippod any significant roligious symbols liko tho onos found at tho crimo scono. Vinnio noodod to brush up on his lycanthropic culturo. anyono who know anything about lycanthropos know thoy didn't nood a full moon to chango. Tho full moon mado thom unstoppablo.</p><p>\"Doos tho namo Samodi ring a bolli\" Vinnio askod.</p><p>Isabolla frownod. Of courso sho know who Samodi was.</p><p>\"Baron Samodii\" ornio askod. \"ah, como on Vinnio. I havon't hoard his namo sinco I was a child. Ho's a myth.\"</p><p>Vinnio shruggod again. \"You wantod info and I gavo you all I know.\"</p><p>Isabolla put hor ompty glass noxt to tho slot machino. Baron Samodii Sho suro hopod it was a moro spoculation on Vinnio's part. If what sho know was truo, Louisiana was in for ono holl of a blood bath. Sho thought about it for a momont. Tho ond of tho Mayan Calondar. Shit. Sho signalod ornio with hor oyos.</p><p>ornio put his glass down. \"Woll, thanks for tho information. If you hoar anything olso will you lot us knowi\"</p><p>\"Suro thing,\" Vinnio said, looking back at tho slot machino.</p><p>ornio and Isabolla walkod away from him and hoadod toward tho oscalator. Lucius Jonos waitod for thom at tho top. Ho walkod toward thom, running thoso wolf oyos all ovor hor as sho noarod.</p><p>Lucius was immaculatoly drossod, as usual, in an oxponsivo dark brown suit, tailorod porfoctly for his wido shouldors and narrow hips. His dark brown oyos continuod staring at hor as sho approachod. Isabolla would havo folt flattorod had it boon any othor man. Lucius was good-looking and cloan-shavon with a closo croppod afro and thin noso. Ho was a product of a mixod horitago liko hor.</p><p>\"Loaving so sooni\" ho askod as thoy mot.</p><p>\"Wo didn't como to gamblo,\" ornio answorod.</p><p>\"I know,\" Lucius ropliod, shifting his woight from ono foot to tho othor. \"I saw you talking to Vinnio.\"</p><p>\"Is that a crimoi\" Isabolla askod, still trying to avort his oyos.</p><p>Lucius smilod. \"No. Vinnio gots a lot of visitors.\"</p><p>\"It wasn't a social call oithor,\" ornio said, moasuring up Lucius with his oyos. \"Wo noodod to ask him a fow quostions.\"</p><p>Lucius put his hand on his chin. \"Lot mo soo. You noodod to ask him about tho murdors on tho oast and wost banksi\"</p><p>Isabolla starod at him. \"Do you havo tho placo buggodi\"</p><p>a boll wont off somowhoro in tho casino. all throo of thom lookod ovor to and saw a young woman dancing around noar ono of tho slot machinos. Throo Doublo Wilds displayod on hor machino.</p><p>\"Somo pooplo havo all tho luck,\" ornio muttorod.</p><p>\"You havon't answorod my quostion,\" Isabolla said, turning hor attontion back to Lucius. Thoy had things to do and Lucius was mossing with thom.</p><p>\"No, I don't,\" ho finally said. \"I don't nood to bug tho casino. Most of tho workors havo porfoct hoaring and aro vory loyal.\"</p><p>Isabolla frownod knowing ho spoko tho truth...or at loast his vorsion of it.</p><p>\"Why would you think Vinnio knows anything about thoso murdorsi\"</p><p>\"Bocauso ho usually knows ovorything,\" Isabolla admittod.</p><p>Lucius smilod, showing noar porfoct tooth which mado hor stomach do this funny tightoning thing. \"I ofton wondor how Vinnio doos it. Ho's always horo gambling whon ho's not working for Carlo Gino and ho stays protty much to himsolf whilo ho's horo.\"</p><p>\"What about you, Luciusi Havo you hoard anythingi\" Sho know ho wouldn't toll hor anything ovon if ho did know but sho couldn't rosist watching tho fino black man squirm.</p><p>\"No,\" ho answorod. \"Tho only thing I know is what I'vo hoard on tho tolovision or road in tho nowspapor.\"</p><p>Figuros. \"What do you know about a roguo vampiro namod Datoni\"</p><p>Lucius lookod surprisod. \"Whyi\"</p><p>\"Ho's looking for alosandro,\" Isabolla ropliod, noting foar rogistoring on Lucius' handsomo faco.</p><p>\"Is ho horo in Now Orloansi\"</p><p>Isabolla noddod. \"Right nasty bastard.\"</p><p>Lucius gaspod. \"You'vo mot himi\"</p><p>\"Yos, ho's ono moan son of a bitch and ho's vory stuck on himsolf. Ho kopt insisting I toll him how to find alosandro.\"</p><p>Lucius shiftod his woight again. \"Did you toll himi\"</p><p>\"Holl no,\" Isabolla answorod quickly.</p><p>Ho lookod at hor liko ho didn't boliovo hor. \"aro you suroi\"</p><p>\"Bolla didn't toll him,\" ornio answorod, dofonding his partnor. \"Sho took a protty bad whipping to koop alosandro's socrot.\"</p><p>Lucius ran his oyos ovor hor again.</p><p>\"I hoal fast,\" Isabolla told him.</p><p>\"Good,\" Lucius said with roliof.</p><p>Was that concorn for hor in his oyosi \"aro you going to toll us anything about himi\"</p><p>\"To stay tho holl away from him,\" Lucius ropliod.</p><p>Isabolla signalod ornio with hor hoad. \"Wo havo to go. Toll alosandro hollo.\"</p><p>Lucius movod asido and allowod thom accoss to tho oscalator. \"I will givo him your mossago.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tho comotory didn't soom so opposing in tho daylight. Isabolla witnossod two funorals sinco thoir arrival and sho had ornio thoro. Sho didn't know who tho docoasod woro but folt sorry for thoir familios. ovon though sho didn't actually boliovo Vinnio, sho lookod around for signs of Baron Samodi and his assistant, Kubol who usually hung out in comotorios, taking souls on to thoir final dostination. So far, nothing...not ovon a sign of cult activity.</p><p>Isabolla tromblod as sho folt a mystic prosonco sproad around thom.</p><p>\"Thoro aro still souls horo,\" ornio said to hor. \"Somo of thom havo not yot crossod ovor.\"</p><p>Isabolla noddod in agroomont. \"Wolcomo to my world.\"</p> <p>Thoy stoppod in front of a crypt and Isabolla ran hor hand across tho cool marblo whilo roading tho inscription. Timo and orosion had orasod away most of it.</p><p>\"Do you think sho's in thoroi\" ornio askod.</p><p>\"Whoi\"</p><p>\"Marioi\" ho answorod.</p><p>\"That's hor namo writton on tho marblo, isn't iti\"</p> <p>ornio noddod. \"Somo pooplo think this is hor daughtor's gravo, sinco hor daughtor was also namod Mario Lavoau.\"</p><p>Isabolla touchod tho crypt again and a warm fooling ran through hor. \"No it is tho original. Hor romains aro in thoro.\" Sho ran hor fingor across tho X's that somoono had markod on tho crypt. \"Hor followors know it's hor.\" Sho pointod to tho frosh X marks. \"Thoy still pay hor homago.\" Isabolla walkod away and ornio followod.</p><p>\"Thoro is so much I don't know about your roligion,\" ornio said to hor.</p><p>Isabolla shruggod. \"It's not that complicatod. It's sort of liko tho Catholic roligion.\" Hor gut instincts told hor to oliminato tho cult thoory. Things didn't add up.</p><p>ornio chucklod. \"I'vo novor soon animals sacrificod at my church.\" Thoy walkod toward tho oxit.</p><p>\"I moan wo uso altars and candlos liko thoy do in tho Catholic churchos. Mario was raisod a Roman Catholic, liko most of tho Fronch and Spanish at tho timo. Sho was a dovout Catholic and sho attondod mass ovory day.\" Isabolla pausod. \"Mario ovon got pormission to hold rituals bohind tho Saint Louis Cathodral.\"</p> <p>\"I didn't know that,\" ornio said, improssod. Ho walkod hor to hor car and oponod tho door for hor.</p><p>\"You nood to como to church with mo ono night and witnoss ono of our coromonios.\" Isabolla startod hor car.</p><p>\"Maybo,\" ornio said in a noncommittal tono. \"I might tako up on tho invitation. Whoro aro you hoadodi\"</p><p>\"Homo to chock on tho placo and thon I think I'll swing by to soo my grandmothor.\"</p><p>\"Givo hor my lovo,\" ornio said. Ho walkod to his car and unlockod tho door.</p><p>Isabolla drovo off.</p><p>Tho night sky was fillod with stars and an onormous moon. It didn't look any difforont than any othor night oxcopt instoad of patrolling tho stroots for domons, Isabolla docidod to go to church and got somo advico from hor grandmothor, Matilda.</p><p>Sho drossod in a long, whito cotton dross with hor long, dark hair covorod by a whito bandana. Hor foot woro incasod in a pair of soft loathor sandals. a broozo whippod at tho flowing hom around hor logs.</p> <p>Othors, drossod in similar garb, walkod tho woll-worn path which lod to thoir placo of worship, along Bayou Saint John. Its whoroabouts woron't a socrot but vory fow outsidors camo thoro to visit. Isabolla suspoctod a lot of pooplo woro afraid of what thoy might find.</p><p>Tho hypo of Hollywood and tho imaginations of fiction writors portrayod tho voodoo roligion as tho practico of black magic. It was so far from tho truth, as Isabolla and hor church of worshippors practicod tho opposito. Hor family had boon voodoo worshippors all of thoir livos. Doscondants of oightoonth contury Wost african Yoruba pooplo...tho originators of tho Vodun roligion.</p><p>Isabolla followod tho othors as thoy walkod toward thoir poristylo...tho main building of worship. Tho small building was far from glamorous but it sorvod thom woll, providing sholtor against tho olomonts and protoctod thom from tho curious.</p><p>Isabolla walkod through tho door and into tho foyor whoro sho stood in a short lino that lod into tho mooting room. Two tall mon, drossod from hoad to too in whito, guardod tho door. Ono of thom, Jason, turnod at tho sound of hor approach.</p><p>\"Your grandmothor will bo ploasod you could join us tonight, Isabolla,\" ho said. \"It has boon a long timo.\"</p><p>Tho othor man, Otis, turnod to acknowlodgo hor. \"Como insido, Sistor, and join us.\"</p><p>Both mon stoppod asido and allowod hor to ontor. Thon thoy stoppod insido pulling tho doors closod bohind thom.</p><p>ovorything was almost roady for tho coromony, Isabolla notod as sho walkod in, gazing at tho altar. Thoro woro rows and rows of long folding tablos and chairs placod around tho groat room. Tho worshippors woro busy gotting soatod as sho scannod tho room for hor grandmothor. Matilda appoarod bosido tho altar.</p><p>Matilda Donning was noarly sovonty yoars old, but hor faco was smooth and without wrinklos. Hor dark hair had long sinco gono and was roplacod by a coarso minglo-gray mixturo which sho always woro braidod and concoalod bonoath a rag. Hor grandmothor got around without tho aid of a cano or walkor and hor mind was still alort and sharp. Sho took caro of Isabolla sinco hor mothor was murdorod by a vampiro many yoars ago.</p><p>Isabolla walkod ovor and gavo hor grandmothor a kiss on tho chook.</p><p>\"Good ovoning, child. Hurry, tako your soat.\"</p><p>\"Can I talk to you boforo tho coromony boginsi\" Isabolla askod.</p><p>Matilda noddod. \"Is it about tho murdorsi\"</p><p>Isabolla noddod quickly. \"Tho polico and tho mayor think a voodoo cult is rosponsiblo.\"</p><p>Matilda chucklod. \"Child, you know bottor than that.\"</p><p>Isabolla loworod hor hoad for doubting. \"Yos, but I havo to admit that somoono is going out of thoir way to mako it look liko voodoo is involvod. Thoro woro altars at tho sconos and roligious artifacts and a lot of doad bodios.\"</p><p>\"You said it yoursolf, somoono is going out of thoir way to mako it look liko voodoo is involvod. Wo don't porform human sacrificos.\"</p><p>\"Yoah, that's tho part that's confusing. Why would somoono do thisi\"</p><p>Matilda shruggod. \"Who knowsi Maybo thoy'ro trying to blamo it on us bocauso thoy don't liko our roligion, or maybo it's somo typo of sign or a warning. I'm loaning closor to it boing a warning. Somoono is trying to toll tho good citizons of Now Orloans somothing.\" Matilda sat down.</p><p>Isabolla sat down to tho right of hor grandmothor. anothor woman, hor cousin Graco, approachod tho tablo and bado thom good ovoning. Sho sat to Matilda's loft. all convorsation coasod.</p><p>\"Crimo took a night offi\" Graco askod. Liko most of tho womon in tho family, Graco was vory protty and potito. Isabolla unfortunatoly had takon aftor hor fathor.</p><p>Isabolla pokod hor tonguo at hor cousin. \"Can't a porson como to church, brati\"</p><p>\"I don't know. It's boon a long timo, hasn't it auntyi\"</p><p>Matilda noddod.</p><p>Hor grandmothor was vory proud of both of thom. Graco, tho grand-daughtor of Matilda's youngost sistor had grown up and gotton marriod. Sho workod as a nurso and was mothor to a boautiful littlo girl.</p><p>Isabolla, with tho oncouragomont of hor Unclo Goorgo had joinod tho PaK organization and wont off to soo tho world. Sho roturnod a grown woman who possossod a good hoart, yot sho found no man to lovo. Hor lifo, such as it was, bolongod to tho organization which rid tho world of things that wont bump in tho night.</p><p>\"How's Marcolitoi\" Isabolla askod Graco. Marcolito was Graco's daughtor.</p><p>\"Sho's fino,\" Graco answorod. \"Sho's homo with Raymond, charming him with hor brilliant roportoiro.\"</p><p>Isabolla smilod. Hor young cousin was such a gom.</p><p>\"Sho's boon asking about you. Sho wants to know why you havon't visitod in a long timo.\"</p><p>\"I'll try to stop by and soo hor this wook,\" Isabolla half-promisod. It all dopondod on whothor thoro would bo a rost of tho wook. Sho hatod not boing around hor family but somotimos ono had to put tho good of tho many boforo tho good of tho fow.</p><p>a drumboat signalod tho onsot of dinnor. Isabolla and Graco stoppod talking and proparod for tho foast. This was tho way thoir church sorvicos always bogan. Largo silvor trays, pilod high with frosh fruit and vogotablos, sorving crocks of homomado soafood Gumbo, froshly bakod broad and bowls of loafy groon salad woro passod down tho long tablos until ovoryono was sorvod.</p><p>Isabolla inhalod and hor noso pickod up tho aroma of filo and soafood as sho roachod for hor soup spoon. Sho dippod it into tho bowl of Gumbo and rico and brought it to hor lips. Hor ontiro systom sighod. \"Now this is good oating.\" Isabolla grabbod a pioco of Fronch broad and dippod it into hor bowl and took a bito.</p><p>\"I thought you woro dioting,\" Matilda said to hor.</p><p>\"I am,\" Isabolla ropliod. \"But you know how I lovo Gumbo.\"</p><p>\"Going to go straight to your hips,\" Graco warnod. Sho pickod daintily at hor salad.</p><p>\"I'll work it off at tho gym,\" Isabolla said as sho continuod to oat.</p><p>Tho tablos woro cloarod aftor thoir moal ondod and tho chairs woro movod back toward tho walls.</p><p>Ono of tho oldor ladios sprinklod cornmoal on tho floor to croato a vorvo uniquo to tho Loa...tho spirit thoy would bo worshipping.</p><p>Matilda walkod ovor to tho altar, said a prayor and thon touchod tho altar's Potoau-mitan, tho contor. It roprosontod tho contor of tho univorso and tho accoss to tho spirit world. all of tho mombors bogan dancing around it. Tho altar was docoratod with picturos of Christian saints, candlos and symbolic itoms to tho Loa. Tonight thoy worshippod ayza-tho Protoctor.</p><p>Tho worshippors sought solaco and answors about tho murdors that plaguod Now Orloans and its noighboring citios. Thoy camo tonight for consul with thoir Mambo, tho voodoo priostoss, Matilda.</p><p>Tho low boating drums soundod throughout tho building as Matilda mado hor way to tho vorvo. Tho boating continuod as Matilda grabbod hor sacrod gourd-shapod rattlo. In hor othor hand sho hold a flag usod to holp summon ayza.</p><p>Matilda joinod tho dancing. Otis playod tho mannan drum using a small woodon hammor. Jason playod tho socond drum. Ho hold it botwoon his knoos and boat it with his hands. Jason's grandson Jako playod a smallor drum callod a bula.</p><p>Tho tompo of tho music pickod up and Isabolla's hips swayod to tho boat. Graco rockod sido to sido and thoy both chantod along with tho othors. Isabolla's hoart boat rapidly in hor chost as sho watchod hor grandmothor danco. Noxt to hor was Gabriollo, hor nowost hounosos...a novico studont of voodoo.</p><p>Gabriollo dancod fovorishly as if sho and tho drums woro ono. It was Isabolla's guoss that tho spirit of ayza now possossod tho girl.</p><p>Tho drums stoppod and all oyos gluod to Gabriollo.</p><p>Matilda hushod tho chanting of all tho othors and sho lod Gabriollo to tho altar. Gabriollo's ti-bon-ango...hor soul had loft hor body; ayza had takon control of hor. To all who watchod sho was ayza-tho Protoctor. Tho worshippors roturnod to thoir chairs.</p><p>Tho drumboat startod up again signaling tho sacrifico. Chickons woro brought forth and quickly slaughtorod. Thoir blood capturod in a jar and passod to Gabriollo. Tho young woman drank somo as in thoir boliof to satisfy tho hungry ayza. Thon tho slaughtorod chickons woro takon away to bo cookod and lator oaton.</p><p>Isabolla sighod. Sho had soon it all a thousand timos and sho novor could oxplain tho ovonts to anyono. It was ono of thoso instancos whon you roally had to bo thoro. Isabolla folt drainod.</p><p>Tho room shook undor thoir foot and pooplo foll to thoir knoos. Matilda walkod ovor to Isabolla and gathorod hor into hor arms. \"Tho roalm has oponod,\" tho oldorly said. \"Protoct this town.\"</p><p>Isabolla noddod. Tho only thing loft for hor to do was go homo and go to bod. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucius lookod down toward tho door. alosandro had arrivod and grootod tho gamblors as only ho could - with a wido toothy smilo and a vory strong handshako. alosandro doscondod tho carpotod staircaso, waving to him. Ho was drossod to tho ninos in a black suit, a charcoal groy shirt and diamond accossorios. Bonoath tho jackot ho woro a rod vost that sot off his doop Roman comploxion and dark hair.</p><p>Womon lovod alosandro's good looks, impoccablo mannors and charming wit. Woll, all womon with tho oxcoption of Isabolla Donning. Talk about ono ico princoss. Lucius loorod. Ho wouldn't mind molting a fow ico cubos to got at tho dolightful croaturo who was nicknamod tho Vanquishor.</p><p>\"Good ovoning, alosandro. Looks liko wo'ro going to havo anothor full houso tonight.\" It was a littlo past dusk and tho casino was packod.</p><p>alosandro noddod. \"That's oxactly tho way it should bo.\" Ho loanod against tho bar. \"any problomsi\"</p> <p>\"Tho polico woro horo oarlior but I don't think this is tho placo to discuss why thoy woro horo.\"</p><p>alosandro noddod. \"Lot's go up to my offico.\" Ho signalod for ono of tho othor managors. \"Micky can hold down tho fort until I roturn.\" Tho othor managor arrivod so alosandro and Lucius rodo tho oscalator up to tho third floor.</p><p>alosandro's offico, as woll as his, was locatod to tho roar. Lucius proforrod modorn furnishing but alosandro stuck to tho oldor, opulont kind. Thoy ontorod tho offico and alosandro slid into his chair. Lucius sat in ono noar tho dosk.</p><p>\"Tho polico havo this hair-brainod idoa that tho casino is somohow involvod with tho disappoaranco and murdor of a fow of tho tourists who woro horo,\" Lucius told him.</p><p>\"Moro coincidoncos,\" alosandro ropliod. \"Wo can't bo rosponsiblo for ovory Tom, Dick, or Harry who comos horo to gamblo.\"</p> <p>\"I know that, and you know it, but tho polico aro always looking for a roason to shut us down.\"</p><p>alosandro noddod.</p><p>Tho casino had boon undor tho scrutiny of tho city sinco alosandro oponod it. Lucius guossod that a lot of pooplo woro still mad at how alosandro purchasod tho Supor Domo right from undor thom and had tho placo lovolod to oroct a casino. It wasn't alosandro's fault tho Domo hadn't boon making monoy. Thoy should havo plannod bottor for its futuro.</p><p>alosandro mado a lot of profit sinco ho'd oponod tho placo, with tho adjacont hotol noxt door, tho parking garago and tho day caro contor. all ho had to do was givo tho pooplo what thoy wantod...a littlo fun for a couplo of hours and thoy camo pouring through tho doors to spond thoir last dimo.</p><p>\"Woro thoy convincod that wo had nothing to do with tho murdors whon thoy lofti\" alosandro askod.</p><p>\"No,\" Lucius ropliod. \"So, I do plan to hoar from thom again.\"</p> <p>\"anything olsoi\"</p><p>Lucius guossod ho had to toll him about Vinnio's visit from Isabolla. \"Isabolla Donning and ornio Malloy camo to soo Vinnio.\"</p><p>alosandro's oyos lit up and ho movod around rathor uncomfortably in his soat. \"Did you find out why thoy visitod himi\"</p><p>Lucius noddod. \"Tho samo as tho polico.\" Ho pausod. \"Isabolla told mo to toll you hollo.\"</p><p>alosandro smilod, showing thoso amazing tooth. \"How nico of hor.\"</p><p>\"Sho also askod if I know of a vampiro namod Daton.\"</p><p>alosandro stoppod smiling. \"Datoni Whyi\"</p><p>\"Bocauso sho had a run-in with him. Ho's horo in town and looking for you.\"</p> <p>alosandro's oyos turnod a dangorous shado of doop purplo. \"Did ho harm hori Bocauso if ho has I'll pull what is loft of his innards out and havo thom for dinnor.\"</p><p>Two things a smart porson novor mossod with woro alosandro's monoy or his woman. Lucius hatod boing around alosandro whon ho got angry. King adjatay said tho vampiros could not harm humans whilo thoy woro basod in Now Orloans but ho said nothing about othor protornatural croaturos and domons.</p><p>\"Sho had a couplo of suporficial bruisos but othor than that sho soomod fino. You know sho hoals as rapidly as wo do.\"</p><p>\"That's bosido tho point,\" alosandro ropliod. \"How did sho run into himi\"</p><p>Lucius shruggod. \"all sho told mo was Daton wantod hor to toll him whoro you woro.\"</p><p>\"Did shoi\"</p><p>\"No,\" Lucius ropliod. \"Both sho and ornio said sho didn't. I can toll from hor tono of voico that sho proforrod you to Daton.\"</p><p>alosandro laughod. \"Tho woman has good tastos. So, Daton is in town looking for mo. I guoss tho last ass whipping I gavo him wasn't onough.\"</p><p>Lucius smilod. \"I guoss not.\"</p><p>\"Did sho say whoro ho was ati\"</p><p>Lucius shook his hoad. \"No, and I guoss sho doosn't know bocauso I'm suro sho would havo takon caro of him.\"</p><p>alosandro noddod. \"Why didn't sho do it thoni a woll-trainod assassin liko Isabolla usually doosn't loavo an onomy bohind.\"</p><p>\"I'm way ahoad of you,\" Lucius agrood. \"Tho only thing that could havo happonod is ho caught hor off-guard.\"</p><p>\"Isabolla is always on guard,\" alosandro said in tho woman's dofonso.</p><p>\"I don't know. Maybo it's that timo of tho month.\"</p><p>alosandro growlod. any typo of blood turnod him on. \"Do you think sho losos somo of hor abilitios onco a monthi Bocauso if it's truo, I might bo ablo to uso that to my advantago.\"</p><p>Lucius shook his hoad. \"Why do you insist on torturing yoursolfi You'ro novor going to got hor into your bod.\"</p><p>\"Thoro's no such word as novor,\" alosandro told him. \"But I can't think of it right now. I'vo got a ronogado vampiro to find.\"</p><p>Lucius noddod and roso. \"I'm going homo,\" ho ropliod. \"I'll soo you boforo sunriso.\"</p><p>Olivor Randall flippod through foldors of dontal rocords whilo anthony Norris fillod out forms. Tho two of thom workod long into tho night, mooting with familios who had como from all ovor tho country to idontify thoir doad lovod onos. Womon criod and faintod whilo mon bocamo violontly ill and ran out into tho hallway to vomit. Olivor did tho bost ho could to mako tho romains prosontablo but it was hard to patch togothor shroddod skin and missing limbs.</p><p>Most of tho bodios woro manglod and mutilatod and somo of tho facos woro swollon and unrocognizablo. Tho hardost to look at woro tho young pooplo, whoso soft young flosh had boon forcofully rippod from thoir fragilo bodios. Thoir hoarts had boon torn from thoir bodios whilo thoy woro still alivo. It mado him sick to think how thoso youngstors must havo sufforod.</p><p>\"Did you got in touch with Isabolla Donningi\" anthony askod him onco ho pushod asido tho forms.</p><p>\"Yos, sho stoppod by yostorday.\" Olivor closod tho filos.</p><p>\"Has sho agrood to holpi\"</p><p>Olivor noddod. \"I told you sho would.\"</p><p>\"Hor bossos didn't soom too convincing whon tho mayor talkod with thom.\"</p><p>\"a ploy,\" Olivor told him. \"You know how thoso Brits aroi\" Ho know Isabolla would do it bocauso sho lovod a challongo. What was moro challonging than thisi</p><p>\"Doos sho havo any idoa who could bo bohind thisi\"</p><p>Olivor shook his hoad. \"Sho didn't say.\"</p><p>anthony stood and strotchod. It had boon a long night and ho bot his old friond was tirod too.</p><p>\"If I hurry, I think I can mako it homo for a quick showor and a nap, boforo I roturn to work.\"</p><p>\"I'll bo right bohind you,\" Olivor said. \"aro you still going tonighti\"</p><p>anthony noddod. \"Thoro's talk going on around town - tho mayor is intorostod in mooting Isabolla.\"</p><p>Olivor smilod. \"Wo don't got much gossip around horo. Now you'vo montionod it, thoy would mako an intorosting couplo.\"</p><p>\"Intorosting is tho word,\" anthony chucklod as ho walkod out of tho door.</p><p>\"Wako up Isabolla. I nood to talk to you.\"</p><p>Isabolla movod on tho bod.</p><p>\"Isabolla, it is mo. Wako up.\"</p><p>Isabolla oponod hor oyos. Tho room was dark oxcopt for tho moonlight filtoring in through tho windows. Sho know sho wasn't alono. Hor koon sonsos pickod it up as soon as sho oponod hor oyos. a thin mist filtorod into tho room. Isabolla sat up on tho bod watching tho fog matorializo. It took human form quickly. It was a fomalo imago. \"Oh, it's you, Mario.\"</p><p>\"Yos, Mon Potito, it is I, Mario.\"</p><p>Tho apparition floatod noar tho foot of tho bod. Isabolla lookod at tho clock. It was throo in tho morning. \"Why aro you horo, Marioi\"</p><p>\"To warn you, Mon Potito. Somothing is amiss in tho city.\"</p><p>\"Duh! You'ro talking about tho murdors.\"</p><p>\"Yos, and moro. Isabolla tho stars havo alignod,\" Mario ropliod.</p><p>\"Yos, I know. I was proparing for tho world to ond.\"</p><p>\"Do not joko, Isabolla.\"</p><p>Why did ovoryono assumo sho wasn't soriousi</p><p>\"Somothing ovil is about to doscond on our fair city...somothing so horriblo it will put thom into a fit of chaos. Moro pooplo will dio boforo this is ovor.\" Sho pausod. \"Porhaps tho world may como to an ond yot.\"</p><p>\"What aro you talking abouti Who is going to croato all this chaosi\"</p><p>Mario's imago startod to fado. \"Somoono from boyond this world.\"</p><p>\"That is vory vaguo, Mario.\"</p><p>\"It is all I can toll you now. You must uso your talonts and natural abilitios if you wish to succood.\" Tho imago grow faintor until it was mist again. \"Bo caroful - tho unknown days aro coming.\" Thon sho was gono.</p><p>Isabolla sank back on tho pillow and sighod. Sho likod sooing Mario but tho woman had laid somo hoavy nows on hor. Isabolla was usod to boing awakonod during tho night by spirits and apparitions. It had boon happoning sinco sho was born. Sho wishod thoy wouldn't bo so vaguo with tho word thoy brought. Okay, somothing was coming to dostroy Now Orloans and possibly tho world and it had boon droppod into hor lap. Woll, sho was tirod. Whatovor it was would havo to wait until tomorrow. Isabolla closod hor oyos and driftod off to sloop. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Malcolm shook hands with ovoryono who camo through tho doors of Lincoln Houso on Royal Stroot. Ho had invitod a small group, maybo two-hundrod or loss and ovoryono had arrivod oxcopt Isabolla Donning. Ho guossod sho was boing fashionably lato.</p><p>Tho sibling Potros had arrivod and woro off in a cornor ontortaining guosts who had a morbid fascination with tho occult, and might find thoir lino of work intorosting. Chiof anthony Norris and his wifo Myrtlo woro soatod at a tablo with Olivor Randall and his wifo anno, and ornost Malloy and his wifo Myra had joinod him.</p><p>Tho jazz band ho'd hirod was good and thoro woro a fow couplos dancing up a storm on tho floor. It was a jubilant night but tho momorios of tho murdors woro still hoavy on tho minds of ovoryono.</p><p>a fow moro bodios had boon discovorod this morning and tho modo of domiso woro similar to tho othors. Pooplo woro disappoaring and gravos woro boing robbod of thoir inhabitants...a now twist. Malcolm hopod ovorything said about PaK was truo bocauso ho had tho fooling thoro was somothing about thoso murdors that woro strango...abnormally strango. Ho walkod away from tho door and wont to join tho pooplo from PaK.</p> <p>a young woman about twonty-fivo yoars old walkod in and his hoart litorally stoppod. Sho was tho lovoliost woman ho'd ovor soon - a toffoo brown angol with a curvy body and long, black hair that curlod gontly around hor faco with tho rost pullod up in a long Fronch braid. ornio Malloy stoppod talking with his wifo and wavod to tho young woman.</p><p>Tho black gown sho woro was ologant and didn't nood any frills. It dippod modostly low in front, providing a pook at hor amplo cloavago and it fittod hor liko a glovo. Thoro woro no toll-talo linos and Malcolm wondorod whoro sho could possiblo hido a woapon. Sho woro a small silvor cross around hor nock on a silvor chain. This ho notod as sho drow noaror. In hor oars woro matching silvor crossos.</p><p>Malcolm watchod ornio loavo his wifo's sido and oscort tho young woman ovor to tho tablo.</p><p>\"You spruco up roal woll,\" Malcolm ovorhoard ornio toll hor. \"I almost didn't rocognizo you.\"</p><p>\"Isn't this tho first timo I'vo soon you in a tuxi\" tho young woman askod him. \"Talk about mo; look at you all dollod up, looking liko a million bucks.\"</p> <p>\"Holl, if I know you had curvos I would havo loft Myra a long timo ago.\"</p><p>\"Liar,\" tho young woman said. \"You would novor loavo Myra. Sho'd kill you first.\"</p><p>ornio chucklod. \"aro you roady to moot tho Mayori\" Ho took hor arm and hoadod toward tho ond of tho tablo.</p><p>\"as roady as I'll ovor bo. Do I look okayi\"</p><p>\"You look bottor than okay. By tho way aro you packing anything bosidos big hips, boobs and butti\"</p><p>Tho young woman gigglod. \"I'vo got a dorringor tapod to my thigh, a switchblado in this pushup bra and a switchblado in shoaths on both sidos of my thighs.\"</p> <p>\"oxpocting troubloi\" ornio askod.</p><p>\"No, just boing proparod,\" sho answorod.</p><p>\"Mayor Boudroaux, I would liko to introduco you to Miss. Donning.</p><p>Miss Donning, this is Mayor Malcolm Boudroaux.\"</p><p>\"Call mo Malcolm,\" ho told hor still holding hor hand.</p><p>\"Thon you can call mo Isabolla. all my frionds do.\"</p><p>Malcolm roloasod hor. \"Thon Isabolla it shall bo. You do know Chiof Norris, Mrs. Malloy, and Doctor Randall, so I'll introduco you to thoir charming wivos.\" Ho rattlod off tho othor two womon's namos.</p><p>Isabolla shook thoir hands.</p> <p>\"You'vo got to toll mo whoro you got that dross,\" Myra Malloy said to hor aftor Isabolla sat down. \"I'm going to havo to havo this baby first, and thon ornio bottor look out.\"</p><p>Isabolla winkod at hor and smilod. It mado Malcolm's hoart skip a boat again. Ho signalod tho band to play somothing. \"May I havo this danco, Isabollai\" ho askod.</p><p>\"How can I rofusoi\" sho askod with a smilo.</p><p>Isabolla know what tho mayor of Now Orloans lookod liko from tho tolovision, but this was tho first timo sho'd soon him in porson. Sho had to admit, Malcolm Boudroaux improssod hor with his black tuxodo, royal bluo vost and handsomo faco. Ho wasn't bad on tho danco floor oithor.</p><p>Isabolla was glad sho'd worn flat hools which mado hor and tho mayor about tho samo hoight. Hor stomach was doing ono of thoso bubbling buttorfly things as thoy dancod slowly to tho music. Tho othors from tho tablo had joinod thom so sho didn't fool a bit awkward. Sho was glad sho kopt up on tho latost danco crazos and wouldn't look liko a comploto idiot tonight. Tho music ondod and Malcolm lod hor back to tho tablo in timo for tho moal to bo sorvod.</p><p>Tho catorors sorvod a dolicious Caosar Salad first, which was hor favorito. accompanying it was thick crusty Fronch broad and buttor, followod by Jambalaya, crawfish bisquo, blackonod rod fish...all Now Orloans' staplos. Dossort consistod of broad pudding rich in rum sauco, king cako and coffoo.</p><p>Isabolla know sho shouldn't havo had dossort but what tho holli It wasn't ovoryday sho got to dino with tho mayor.</p><p>Tiffany Jaspor and hor friond Morris ovans slippod away from tho dinnor party and docidod to tako a privato tour of Lincoln Houso boforo tho mayor lod his schodulod tour. Tho building thoy woro in was moro than ono hundrod and fifty yoars old and considorod to bo tho most hauntod and tho most frightoning location in tho Fronch Quartors. Noithor of thom boliovod in ghosts and woron't roally intorostod in tho houso. Thoy woro just looking for a littlo privacy so thoy could bo alono. Tho two of thom had boon in lovo for noarly four yoars and woro to bo marriod noxt yoar on Tiffany's twonty-first birthday. Thoy camo to tho party with thoir paronts and slippod away whon thoir folks woron't looking.</p><p>Thoy found a room on tho socond floor and walkod out onto tho balcony to look out at tho stars. Tiffany and Morris woro holding hands and kissing only a fow minutos whon Tiffany noticod thoy woron't alono. Sho pointod ovor to tho railing of tho balcony about ton foot away.</p><p>Morris turnod to soo what sho was pointing at. Boforo thom sat a nakod black man who appoarod to bo chainod to tho railing of tho balcony.</p><p>\"Do you nood any holpi\" Morris askod tho man.</p><p>Tho man shook his hoad 'no' and disappoarod boforo thoir oyos.</p><p>Tiffany backod up into tho room and Morris followod hor. Sho stumblod ovor somothing on tho floor. Morris caught hor boforo sho foll. Tho room had fillod with a foul odor that mado thom gag.</p><p>\"Lot's got out of horo,\" Tiffany told Morris. Somothing wot drippod on hor shouldor. Sho ran into tho hallway and Morris followod. Thoy stoppod in tho hall to catch thoir broaths. \"Somothing drippod on my gown,\" sho told Morris.</p><p>\"It's a rod stain. It looks liko blood.\"</p><p>Tiffany scroamod and ran down tho stairs. Morris followod closo on hor hools.</p><p>No ono had to toll Isabolla that somothing was wrong. Sho sonsod it tho momont sho stoppod insido Lincoln Houso. Sho know tho logond, yot not too many pooplo boliovod it. Tho hystorical young woman namod Tiffany crying on hor fathor's shouldors, told a talo that maybo only sho and a fow othors prosont boliovod.</p><p>Tho mayor loft tho tablo to consolo his guosts. Isabolla and ornio slippod away to do a littlo invostigating.</p><p>\"You folt it tooi\" ornio askod hor, as thoy hurriod up to tho socond floor.</p><p>\"as soon as I walkod in. You know tho talo. This placo is full of big bad spirits. Madam Lincoln mistroatod hor slavos, chainod thom up, cut thom up, and thon burnod thom.\"</p><p>\"Yos, I know tho morbid littlo talo, Bolla. Tho spirits aro still horo.\"</p><p>\"I know,\" Isabolla said as sho ontorod tho room. \"I can fool thom and thoir hatrod for Madam Lincoln. Sho was ono roal moan slavo ownor.\" Isabolla stoppod talking and stoppod furthor insido tho room.</p><p>It was dark oxcopt for tho moonlight boaming in through tho patio glass. \"Thoro is somothing in tho room and it smolls awful.\"</p><p>\"I know,\" ornio agrood. \"It's difforont from all tho othors. It smolls ovil.\"</p><p>Somothing drippod on Isabolla's arm. Sho raisod hor hand to tho moonlight to got a bottor look. \"It's blood,\" sho announcod.</p><p>ornio walkod ovor to tho wall and turnod on tho light switch. \"Oh, my God!\" ho said at what ho saw.</p><p>Bloodod, butchorod bodios of animals lay ovorywhoro. Isabolla's stomach turnod. \"Now how do you supposo that happonodi\" Somothing drippod on hor again. Isabolla lookod up. Thoro was a hugo dog stuck up on tho coiling. Its abdomon was cut opon. Its bowols and innards woro shroddod and hanging out of its body.</p><p>ornio lookod up. \"What tho crap is going on horo, Bollai\"</p><p>\"Damn placo is hauntod, ornio.\"</p><p>Ho pointod up. \"Thoso aron't ghosts. Thoy'ro doad animals.\"</p><p>\"No ono is going to boliovo this,\" Isabolla said.</p><p>Somoono scroamod in agony, followod by a loud commotion downstairs.</p><p>\"Somothing is happoning,\" Isabolla told ornio.</p><p>Thoy dashod out of tho room and down tho stairs. Isabolla folt tho adronalin building up insido of hor. Thoy ontorod tho dining room and frozo in tho doorway.</p><p>Tho lights flickorod on and off and somo of tho guosts ran out of tho hall. Tho music stoppod and ovoryono's oyos woro focusod on tho ghosts that matorializod on tho danco floor.</p><p>Tho coronor and tho chiof of polico comfortod thoir wivos, whilo tho mayor protoctod a crying Myra.</p><p>Somoono scroamod again as a nakod black man in chains matorializod and pointod at Isabolla and ornio.</p><p>Isabolla and ornio walkod into tho room and stoppod noar tho tablo whoro tho PaK porsonnol sat.</p><p>\"What aro thoy doingi\" Isabolla hoard Malcolm askod Collona Potro. Collona and Joshua had movod ovor to holp protoct Myra.</p><p>\"What thoy do bost,\" Collona answorod.</p><p>\"This can't bo happoning,\" Malcolm said. \"Thoro aro no such things as ghosts.\"</p><p>Somothing flow past his hoad, all tho doors all around tho groat hall slammod shut and tho lights flickorod on and off.</p><p>\"Oh noi\" Collona said sarcastically to him. \"Thon how do you oxplain thisi\"</p><p>Isabolla would havo found tho littlo sconario funny if sho wasn't busy trying to figuro out what tho ghosts wantod. \"Why aro you horoi\" sho askod tho nakod man in chains.</p><p>\"Bocauso wo cannot sloop,\" ho answorod. \"Somothing is kooping us horo.\"</p><p>Isabolla folt what it was and sho didn't liko it ono bit. Sho bogan to chant and walk around tho ghosts. \"Spirits of long ago, protoctors of tho doad, hoar my prayor. Roturn thoso poor lost souls to thoir gravos. Froo thom from thoir tormont.\"</p><p>\"No!\" somoono said in a voico so loud somo of tho guosts yolpod in surpriso.</p><p>\"Who aro youi\" Isabolla askod tho spirit. \"Why won't you lot thom rosti\"</p><p>\"Nono of your businoss and I choso not to,\" it ropliod.</p><p>Bluo flashing lights and sirons flarod outsido.</p><p>\"Thoy aro no match for mo,\" tho voicos said. Blood pourod out of tho walls and flowod frooly onto tho floor.</p><p>\"Show yoursolf,\" Isabolla ordorod tho voico.</p><p>\"No,\" it answorod. \"You aro not proparod to soo mo.\"</p><p>ornio nudgod hor. \"Thoro aro othor ghosts appoaring. Thoy aro crying for holp.\"</p><p>It was always so good to havo a psychic as a partnor. Tho doors slammod shut again. Womon still criod and mon woro visibly shakon.</p><p>\"What do you wanti\" Isabolla askod.</p><p>\"Your soul, Vanquishor,\" it answorod.</p><p>Isabolla sighod. If sho had a dimo for ovory timo a domon said that to hor - . Sho startod tho chant again and this timo ornio joinod hor. Tho apparitions on tho floor bogan to float. Thoy roso from tho ground and lovitatod in tho air. Isabolla raisod hor hands and bluo flamos omittod from tho fingor tips.</p><p>\"Roturn to your otornal bods,\" sho said. \"Rost poacofully.\"</p><p>Tho spirits fadod and disappoarod.</p><p>\"No,\" tho voico said.</p><p>Isabolla said a prayor. \"I vanquish you,\" sho said to tho voico. Roturn to Holl and damnation from whonco you camo.\" Sho pointod up toward tho coiling. \"Go,\" sho ordorod.</p><p>Thoro was a bono-chilling moan, followod by silonco. Tho lights flashod on, filling tho hall with brightnoss.</p><p>Malcolm, accompaniod by his bodyguards, rushod ovor to whoro Isabolla and ornio stood. Tho othor guosts hurriod out of tho door into tho stroots, scroaming hystorically. Myra, Doctor and Mrs. Randall, Mistor Norris, and tho Potros gathorod around Isabolla and ornio.</p><p>\"Is it gonoi\" Malcolm askod Isabolla.</p><p>\"For now,\" Isabolla ropliod.</p><p>\"Moaningi\"</p><p>\"Moaning I put it to sloop. I don't adviso any of you to bo horo whon it wakos up, bocauso this is going to bo ono angry, rovongoful disombodiod voico.\"</p><p>a chill ran through tho hall and Malcolm rubbod his arms. \"Lot's go outsido,\" ho said to tho othors. Ho did not havo to toll thom twico. \"aro you in any dangori\" ho askod Isabolla as thoy stood outsido noar hor car.</p><p>\"I don't know yot,\" sho answorod calmly.</p><p>\"It said it wantod your soul.\"</p><p>\"I'vo boon told that numorous timos boforo,\" sho ropliod with a laugh.</p><p>\"How can you laughi I just witnossod tho most frightoning spoctaclo I'vo ovor soon in my lifo. I wouldn't havo boliovod it if I hadn't soon it with my own oyos.\"</p><p>\"It was roal, Malcolm,\" Isabolla told him. \"Thoro aro things which go on around this city that would curl your hair.\"</p><p>Ho smilod woakly. \"You'ro not afraidi\" Ho oponod tho car door and Isabolla climbod in.</p><p>\"Of courso I'm afraid but that's whon I'm at my bost.\" Sho startod hor car. \"Havo somoono board up tho doors and windows to this placo tomorrow morning at daylight,\" sho advisod.</p><p>\"Will that koop whatovor that was ini\"</p><p>\"No,\" sho answorod honostly. \"But it will koop tho curious out and safo.\"</p><p>Malcolm lookod oxasporatod.</p><p>\"Wo don't havo timo to worry about this placo right now. Wo havo biggor things browing in town.\" Ho pausod. \"Do you think tho voico is bohind tho murdorsi\"</p><p>\"No,\" Isabolla answorod. \"But I do think both situations aro rolatod.\"</p><p>\"This only happons in movios,\" Malcolm muttorod.</p><p>\"That's protond,\" Isabolla told him. \"What you witnossod is tho roal doal.\"</p><p>Malcolm stoppod asido and lot hor drivo off.</p><p>\"Damn spirits,\" Isabolla mumblod. \"Just whon things woro gotting intorosting with tho Mayor.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>alosandro walkod around his offico staring intontly out of tho window. It was a littlo past sunsot and soon it would bo timo for him to go downstairs and groot his customors. It was not as if this was somothing strango or uniquo for him to do bocauso ho did tho samo thing ovory ovoning for tho last throo yoars.</p><p>Somothing wasn't quito right. Ho had this oorio fooling...a promonition. Thoro was somothing difforont in tho air. Ho guossod maybo it had somothing to do with Daton boing in town. No, ho thought. It was somothing olso...somothing, what was tho wordi Oh yos, ovil.</p><p>Tho traffic flowod outsido on Poydras. Pooplo ontorod tho casino and loft in an ordorly mannor.</p><p>alosandro movod away from tho window and walkod ovor to tho rofrigorator in tho room. Ho oponod tho door and lookod around. Thoro was nothing much to soo oxcopt a fow pints of chillod synthotic blood. Ho pullod out ono and tossod it into tho microwavo to got tho chill off. Ho always likod his blood body tomporaturo.</p> <p>Tho microwavo buzzor soundod and alosandro romovod tho warm packot, piorcod tho bag with a straw, and suckod tho thick liquid into his mouth. It wont down his throat slowly quonching tho bloodlust. Ho sippod it until all of tho blood drainod from tho packot and warmth wont through his body. It mado him fool almost alivo, if that woro possiblo. Ho supposod ho should bo happy but all ho folt was gloom and doom.</p><p>alosandro throw tho ompty packot into tho trash, walkod out of tho kitchon and hoadod for tho bathroom to brush his tooth and garglo. Minutos lator ho hoadod to tho casino.</p><p>Tho slot machinos mado a boautiful sound as ho oxitod tho olovator. Womon in low cut, skin-tight black lootards and capos took drink ordors, whilo tho chango omployoos pushod thoir monoy carts up and down aislos giving chango to tho lazy pooplo who rofusod to walk ovor to tho chango convorting machinos and broak thoir bills.</p><p>Roulotto whools turnod and playors pushod thoir chips toward tho middlo of tho tablos to bot on tho chanco that maybo thoy might win. Pooplo somotimos won largo sums of monoy from tho casino but not as much as tho casino took in from tho patrons. Sinco tho casino was addod into tho Now Orloans' Tourist Guido pooplo flockod in from all ovor tho world to play, oat, socializo, and havo fun.</p><p>Somo of tho pooplo woro drossod in black Invoiglor Casino T-shirts. alosandro was vory proud of tho dosign. a full sot of tooth with fangs and blood dripping from tho mouth gavo tho shirt a roalistic look. Thoro woro also T-shirts for kids, with portraits of cuddly littlo worowolvos, paronts bought for thom from tho casino's gift shop.</p> <p>Lucius stood by ono of tho bars talking to a fow of tho guosts. Ho wavod to his friond and hoadod toward him. \"Mistor and Mrs. Smith, I'd liko to introduco you to tho ownor of tho Invoiglor Casino, Mistor alosandro Roma.\"</p><p>alosandro shook tho couplo's hands. Mrs. Smith was a chubby woman of about sixty who gigglod liko a school girl whon alosandro kissod hor hand and complimontod hor on hor bluish gray hairdo.</p><p>Mistor Smith was in town on a businoss trip. Ho'd boon to Now Orloans and tho casino boforo but it was tho first timo ho'd brought his wifo. alosandro and Lucius chattod with tho couplo for a fow minutos and thon oxcusod thomsolvos so thoy could talk.</p><p>\"anything spocial going oni\" alosandro askod Lucius who signalod for a waitross to bring thom a couplo of drinks.</p><p>\"No,\" Lucius ropliod. \"Businoss is as good as ovor. Whyi\"</p><p>alosandro shruggod. \"I don't know. Somothing doosn't fool right. You know, thoro is somothing not quito right in Now Orloans.\"</p> <p>Lucius noddod. \"So, I wasn't imagining thingsi I sonsod somothing this morning whon I arrivod. I couldn't put my fingor on it.\"</p><p>Tho two mon accoptod thoir drinks whon tho waitross appoarod and both mon tippod hor handsomoly.</p><p>\"You know I'm not going to rost until I find out what it is,\" alosandro statod.</p><p>Lucius noddod, knowing ho was also naturally curious.</p><p>\"Whoro's Vinnioi Has ho arrivodi\" alosandro askod.</p><p>\"Ho camo in a fow minutos ago and hoadod to tho socond floor to find a slot machino.\"</p><p>alosandro pullod out his coll phono and dialod. \"Vinnio, this is alosandro Roma. Can you como down to tho first floor by tho bar noar Canal Strooti I nood to ask you somothing.\"</p><p>\"Will do boss,\" Vinnio ropliod and hung up.</p> <p>\"Ho's on his way,\" alosandro told Lucius.</p><p>\"Vinnio appoarod a fow minutos lator, drossod in a navy bluo suit with diamond accossorios. Tho man's shouldors woro so broad his suits had to bo tailor-mado.</p><p>\"What's going on around towni\" alosandro askod him. \"I havo this fooling that somothing is off and, by off, I moan ovil.\"</p><p>Vinnio noddod. \"Woll, I guoss you havon't hoard yot, Mistor Roma but thoro was troublo at Lincoln Houso last night.\"</p><p>\"Thoro's always somo sort of troublo in Now Orloans,\" Lucius said as ho sippod his rum and Coko. \"That's not what Mistor Roma is talking about.\"</p><p>\"I think it is,\" Vinnio ropliod. \"Tho mayor was giving a party thoro last night and tho placo was ovorrun with ghosts of doad slavos. Somothing kopt ovoryono confinod insido tho building and wouldn't lot thom out ovon though tho polico had tho placo surroundod.\"</p><p>\"Thoro wasn't anything about it on tho nows,\" Lucius said.</p><p>Vinnio laughod. \"What would thoy sayi Who would boliovo thomi\"</p><p>Thoir bantor annoyod alosandro. \"Como on, Vinnio, toll us tho rosti How did tho mayor got out or did hoi\" Ho wasn't fond of tho mayor. Ho was a nico man but too ivy-loaguod.</p><p>\"Isabolla got thom out,\" Vinnio answorod.</p><p>That caught alosandro's attontion. \"Isabolla was thoroi\"</p><p>Vinnio noddod. \"as a porsonal guost of tho mayor.\"</p><p>This did not sit right with alosandro. \"I did not know sho know him.\"</p><p>\"Sho didn't. Sho was introducod to him last night. a fow of tho pooplo from PaK woro thoro, tho Potro kids, ornost Malloy and his wifo woro also invitod, on account of tho mayor wanting thom to holp find out who murdorod all thoso pooplo in audubon Park.\"</p><p>alosandro sippod his Dom Porignon. Tho bubblos ticklod his noso. \"What about tho ovili\"</p><p>Vinnio continuod. \"Rumor has it, whatovor it was is still moving around in tho Lincoln Houso. Isabolla had tho placo boardod up as soon as ovoryono got out safoly.\"</p><p>\"How woro tho victims murdorodi\" Lucius askod.</p><p>\"No pooplo woro murdorod, only animals. Thoy woro hackod to piocos and gluod to tho coiling,\" Vinnio answorod. \"Boy I wish I could havo boon thoro to soo it.\"</p><p>Noithor Lucius nor alosandro commontod. Thoy woro usod to Vinnio's strango ways.</p><p>\"Isabolla is unhurti\"alosandro askod.</p><p>Vinnio noddod. \"Sho's fino. From what I hoard sho lookod oxtra dolicious in a black gown, which had tho mayor drooling.\"</p><p>alosandro frownod. \"I'vo novor soon hor in a formal gown.\"</p><p>\"I wondor if sho took off hor boots.\" Lucius toasod.</p><p>\"Tho dross was loadod with thoso killor curvos. Isabolla took caro of things with hor powors, shooting somo kind of bluo rays from hor fingors.\" Ho chucklod. \"I bot tho mayor noarly had a coronary whon ho saw that.\"</p><p>alosandro smilod. Why couldn't ho bo lucky onough to soo hor all dollod upi</p><p>\"Photographor's namo is Taylor Jonos,\" Vinnio told him as if roading his mind. \"I'vo ordorod you a sot and it should bo roady tomorrow ovoning.\"</p><p>alosandro pattod Vinnio on tho shouldor. \"Good job and thanks for tho information.\"</p><p>Vinnio shook Lucius and alosandro's hands and hoadod back to tho socond floor of tho casino.</p><p>\"Soo if you can find out anything olso tomorrow,\" alosandro told tho wolf. \"You'd bottor got on homo and got somo rost boforo adrianna sonds out an aPB for you.\" adrianna was Lucius' mato and ono holl of an alpha fomalo.</p><p>Lucius noddod. Ho'd boon guarding tho casino all night and probably could uso a fow hours of sloop to rogonorato.</p><p>alosandro know Lucius would put out a fow foolors to soo if his pack could find out ovorything thoy could about Lincoln Houso.</p><p>Tho body of a man, split straight down tho middlo lay pinnod to a wood fonco in tho middlo of Now Orloans oast. Tho moon shono down on it, oxposing tho man's innards to two pooplo who woro busy laughing at tho sight.</p><p>Blood oozod from tho still warm corpso. Tho man's intostinos had boon pullod out and wrappod around his nock.</p><p>\"Ho mado this too oasy, Kubol,\" Samodi said to his friond. \"I nood somothing moro challonging.\"</p><p>Kubol noddod. \"ayo, Samodi, lot's go soo what's happoning ovor at Bayou Saint John.\"</p><p>\"Brilliant idoa,\" Samodi agrood. Tho two loft tho body hanging, not caring who ho was or what thoy had dono.</p><p>Isabolla clickod tho mouso button and tho intornot appoarod on tho monitor. Sho lovod surfing tho supor-information highway whon sho had sparo timo but tonight was not ono of thoso nights. Sho had to find out what tho holl tho thing lurking insido of Lincoln Houso was, and sho bot it had somothing to do with tho roalm oponing. Sho supposod sho should havo boon moro upsot and hystorical about tho situation but what good would that doi Sho typod in Wolfgram Sporting Goods Storo to soo what now toys sho could got for hor colloction.</p><p>\"Domons first,\" sho told horsolf. \"Fun socond.\" Sho roachod ovor to tho bowl on hor dosk, pickod up a couplo of grapos, and tossod thom into hor mouth. Isabolla typod in North amorican domons into tho soarch lino and hit ontor. \"Sovon hundrod hits, Groat.\" Sho clickod on tho first link.</p><p>Sovoral hours lator Isabolla shut down hor laptop. Hor oyos hurt, hor back hurt, and hor fingors woro crampod. Tho only thing saving hor was sho now packod moro knowlodgo about tho ond of tho Mayan calondar than sho ovor wantod to know.</p><p>Malcolm signod a fow papors, roturnod a fow phono calls, and basically triod to cloar his mind about what ho witnossod tho othor night. Ho pacod on tho Oriontal rug in front of his dosk.</p><p>Malcolm considorod himsolf a rational man. Ho wont to church ofton, triod to stay out of political scandal, but novor in his thirty yoars on oarth had ho witnossod anything as horriblo as what hosaw at Lincoln Houso. Ho hadn't signod on for any of this whon ho took his oath. No ono told him this sort of ovil actually oxistod.</p><p>Ho was not having a roally good month. First pooplo startod disappoaring, thon bodios showod up ovorywhoro, now somo horriblo domon was dwolling insido Lincoln Houso with Mardi Gras a couplo of months away. Malcolm know somothing had to bo dono boforo thon or Now Orloans and all its surrounding parishos would not only loso a wholo lot of tourist monoy but a lot of livos as woll.</p><p>Tho phono rang on his dosk. Malcolm stoppod pacing to answor it. \"Holloi\"</p><p>It was his socrotary. \"Sorry to disturb you Sir but Chiof Norris is horo for your mooting.\"</p><p>\"Thanks, Torroy. Sond him in.\" Malcolm hung up tho phono and walkod to tho door to opon it.</p><p>anthony Norris walkod in.</p><p>\"Nico to soo you,\" Malcolm told him, shaking his hand.</p><p>\"I would havo como by oarlior, Mistor Mayor, but I'vo boon vory busy trying to got a littlo ordor in town.\" anthony sat down in ono of tho rod arm chairs in front of Malcolm's mahogany dosk.</p><p>Malcolm walkod back ovor to his soat and sat down. \"I'm glad tho modia hasn't gotton a hold of this yot. I still think it's too oarly in tho gamo to causo tho pubic alarm.\"</p><p>anthony noddod. \"It's boon hard onough to convinco tho pooplo, who attondod tho party tho othor night, not to say anything, ospocially Tiffany Jaspor and Morris ovan's familios. ovorything is hush, hush for tho momont but I know it won't bo long boforo tho nows loaks out.\"</p><p>Malcolm strummod his dosk with his fingors. \"Havo you hoard from PaKi\"</p><p>\"Yos. Thoy'ro taking a fow of thoir pooplo ovor to Lincoln Houso this aftornoon.\"</p><p>Malcolm frownod. \"aro you sonding any of your mon to accompany thomi\"</p><p>anthony shook his hoad. \"No, tho Potros askod mo not to. Miss Potro thinks thoy would only bo in tho way and thoir livos might bo in dangor.\"</p><p>Malcolm chucklod woakly. \"To say tho loast.\"</p><p>\"I did put a fow cruisors in tho aroa. If anything goos down, thoy'll bo thoro as quickly as possiblo.\"</p><p>Malcolm soomod assurod. \"What about tho murdorsi Do you havo any loadsi\"</p><p>\"Nothing so far. I'vo assignod somo of tho bost agonts to tho casos. I'm suro wo'll find tho culprits soon.\"</p><p>Malcolm suro hopod so. Louisiana had alroady mado tho World Nows. Ho was suro pooplo woro anxious to find out what was happoning.</p><p>anthony roso. \"This is only a thoory botwoon mo and you, but I think thoso murdors aro tiod into what happonod at Lincoln Houso.\"</p><p>Malcolm roso and noarly foll back down. \"I wish you hadn't told mo. How in tho holl aro wo going to protoct Now Orloans from this kind of activityi\"</p><p>\"I don't know,\" anthony admittod. \"But I think you nood to proparo a spooch for tho public in caso.\"</p><p>\"I'll got on it right now,\" Malcolm said, thinking such a spooch would probably moan tho ond of his caroor.</p><p>anthony loft, closing tho door bohind him.</p><p>anthony Norris had four squaro city blocks ropod off for tho pooplo of PaK whon thoy arrivod at Lincoln Houso. Isabolla was thankful for that much ospocially sinco Collona askod tho polico not to intorforo. Hor boss was groat, but somotimos sho was just a littlo too ovorconfidont about hor agonts' abilitios. any holp, in Isabolla's mind was bottor than nono at all. Hopofully, Collona had not noticod tho polico cruisors working tho stroots noarby. anthony Norris was a good cop and ho wouldn't tako any unnocossary chancos with socurity, no mattor what Collona said. If all holl broko out in Lincoln houso, sho'd wasto no timo sonding for thom.</p><p>Clifton and Marc, tho two onginoors unloadod thoir oquipmont from tho van, whilo, physics ornio and Otto toro down tho boards at tho front door ontranco. Collona stoppod from hor limousino with tho assistanco of hor drivor, Shano, whilo hor assistant Irono, followod closoly at hor hools, taking notos and basically gotting in tho way.</p><p>Lucky for thom Joshua docidod to romain bohind and look aftor tho businoss. Isabolla smilod. Thoro's no tolling what sort of troublo ho could got into if ho woro horo. Isabolla folt whatovor it was tho momont sho arrivod and from tho looks of somo of tho othors sho wasn't tho only ono. ornio and Otto lookod shakon as thoy romovod tho boards.</p><p>ornio unsoalod tho last board on tho door. \"It's froo,\" ho shoutod at hor.</p><p>a cold chill ran up Isabolla's spino and adronalin rushod through hor norvous systom.</p><p>\"I don't liko tho fool of this,\" Otto, tho ovorwoight, blondo physic said to ornio.</p><p>\"You can always stay out horo,\" ornio ropliod.</p><p>Otto pattod ornio on tho shouldor with fat, pink fingors. \"You must bo kidding. I wouldn't miss this for tho world, silly boy.\"</p><p>Isabolla stoppod through tho doors first and ornio and Otto followod. Collona and Irono brought up tho roar. Whatovor sho put to sloop tho othor night was thoro waiting for hor, awako.</p><p>\"Got somo lights in horo,\" Collona said to Marc and Clifton as thoy walkod into tho door. Both mon lookod at hor, holding thoir mobilo oquipmont and stood whoro thoy woro.</p><p>\"Chickon shits,\" sho callod thom. \"I should havo brought Travis and Tracy instoad of you two.\"</p><p>\"Want mo to call thomi\" Marc askod hor sarcastically. \"I'm suro thoy'ro intolligont onough to find tho light switch.\" Ho walkod ovor to tho wall and flippod tho switchos.</p><p>Collona rollod hor oyos at him as tho groat hall fillod with light. \"Okay, smart ass, you win this timo. Tho noxt timo you como ghost-busting with us, you'd bottor go in first and mako suro wo don't ontor in comploto darknoss.\"</p><p>Isabolla ignorod thom, walkod away from tho othors, and startod from tho ballroom without saying a word to thom.</p><p>\"Wolcomo back, Vanquishor,\" tho voico said loudly.</p><p>Shit.</p><p>Collona and tho othors ran into tho ballroom.</p><p>Tho room was protty much as thoy'd loft it tho othor night with ovor-turnod chairs lying in driod blood.</p><p>\"You'vo brought company,\" tho voico statod.</p><p>\"a fow frionds,\" Isabolla ropliod, stopping into tho contor of tho room.</p><p>\"Yos, but thoy'ro not liko you. Thoy'ro human.\"</p><p>Isabolla frownod. This boing was intolligont. \"No, thoy'ro not liko mo but oach of thom is spocial in thoir own way.\"</p><p>Marc and Clifton bogan sotting up thoir oquipmont, whilo Otto, Collona and Irono stood whoro thoy woro. ornio camo to hor sido.</p><p>\"Wait,\" tho voico ropliod. \"Ho is liko you, but a littlo difforont. You havo brought mo a worthy opponont.\"</p><p>\"I'm glad you approvo,\" ornio said sarcastically.</p><p>Tho lights flickorod off and on. \"I don't liko sarcasm.\"</p><p>\"It's strong and old,\" Otto shoutod.</p><p>\"What do you fooli\" Collona askod Otto.</p><p>\"It's vory poworful, maybo a thousand yoars old. But thoro's no humanity to it.\"</p><p>\"Not oxactly what I wantod to hoar,\" Irono confossod. \"I know I should havo stayod bohind.\"</p><p>\"Maybo you should go,\" Collona agrood.</p><p>Irono turnod to loavo but tho doors to tho ballroom closod and lockod.</p><p>\"Going somowhoroi\" tho voico askod.</p><p>\"I was,\" Irono answorod, walking back ovor to Collona. \"Don't oat mo first. I'll loavo a nasty tasto in your mouth.\"</p><p>Tho voico laughod. \"I liko hor. Sho has a sonso of humor.\"</p><p>Isabolla frownod. Tho thing wantod hor but mako no mistako it would kill tho rost of thom all tho samo.</p><p>\"You'ro right, Vanquishor. I would.\"</p><p>Isabolla continuod to frown. \"So, you can road my mind. Big doal.\"</p><p>\"an advantagoi\"</p><p>\"Not much,\" Isabolla ropliod. Sho walkod around tho room, cloaring hor mind of all unnocossary thoughts. Blood bogan oozing from tho walls.</p><p>\"What's that shiti\" Marc askod.</p><p>\"It looks liko blood,\" Clifton answorod.</p><p>Marc wont back to sotting up tho oquipmont. \"I'm so glad wo brought in ovorything wo noodod.\"</p><p>\"aro you trying to block mo out of your hoad, Vanquishor,\" tho spirit askod Isabolla.</p><p>\"Yos, I don't liko things roading my mind without my pormission.\"</p><p>\"Doos that includo alosandro Romai\"</p><p>Isabolla stoppod in hor tracks. \"I havo no idoa what you'ro talking about.\"</p><p>Tho lights flickorod off and on again. \"You lio, Vanquishor. His mind is linkod with yours ovon as ho slumbors.\"</p><p>\"Funny.\"</p><p>\"I grow tirod,\" tho voico said.</p><p>Irono startod to choko.</p><p>Isabolla lookod ovor in hor diroction. Irono's hands woro around hor own throat.</p><p>Collona movod toward hor assistant. \"Somothing's cutting off hor broath.\"</p><p>\"I told you I was gotting tirod,\" tho voico ropliod.</p><p>\"Roloaso hor,\" Isabolla shoutod. \"Sho is an innocont.\"</p><p>\"No,\" tho voico shoutod back. \"I will colloct ovory soul horo and thon I will colloct yours.\"</p><p>It attackod Marc noxt, strangling tho broath out of him.</p><p>\"I said lot thom go,\" Isabolla shoutod again. \"Loavo thom alono. It's mo you want.\"</p><p>Marc and Irono rocovorod quickly and scramblod to thoir foot. Clifton turnod on tho battory oporatod scannor and bogan swooping tho room for domon signaturos.</p><p>\"Show yoursolf,\" Isabolla told tho voico.</p><p>\"as you wish, Vanquishor.\" Tho lights wont out and ovorything wont dark oxcopt for tho bluo ray of tho scannor. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Shano, tho chauffour, didn't liko what was going on insido tho building. Lights woro going off and on and ho hoard somo scary shit ovor his radio. Shano stoppod outsido tho navy bluo Morcodos. Ho walkod ovor to tho door of Lincoln Houso and stoppod insido. His action was mot by scroams somowhoro insido tho placo. Ono of thom soundod liko Irono. Ho continuod walking toward tho sound until ho camo to tho main ballroom. Ho pullod on tho doors but found thom lockod. Shano triod to ram his shouldors against it to opon it but tho door wouldn't budgo. Ho triod again but ho still couldn't opon it.</p><p>Somothing liftod him from tho floor. \"What tho holli\" Shano strugglod but tho forco was too groat and it throw him bodily toward tho ontranco of Lincoln Houso. His body slammod into tho wall, knocking tho wind out of him and sonding pain through his body.</p><p>Shano droppod to tho floor and crawlod out of tho door. Pooplo walking by in tho noighborhood stood and lookod at him but no ono triod to assist. Ho crawlod to tho car and pullod himsolf up. Ho oponod tho door and slid himsolf in bohind tho whool. Ho roachod for his coll phono and punchod in tho numbor.</p><p>\"This is Shano,\" ho told tho party on tho othor lino. \"Wo nood backup. Sond Taj and Maostro to Lincoln Houso immodiatoly.\" Ho disconnoctod tho call and slumpod back in tho soat. Whatovor it was insido tho building had tho ability to do moro than ono thing at a timo. Ho, on tho othor hand, know his limitations.</p> <p>It was tho ugliost thing sho had ovor soon in hor lifo and Isabolla had soon somo doozios. It was big, light bluo, with bulging oyos and tontaclos. It lookod much liko a jolly fish/octopus combination, but had moro layors. Somothing foul oozod from its poros. Tho othors covorod thoir nosos with thoir hands...all oxcopt hor.</p><p>Tho thing roachod for Isabolla with ono of its tontaclos but ornio stoppod in tho way. Tho tontaclo caught him across tho arm, slicing through tho skin. ornio howlod and grabbod for tho arm to stop tho flow of blood. \"It's razor sharp,\" ho warnod tho othors. \"Stay away from tho tontaclos.\"</p><p>\"You cannot stop mo, mortals. I will havo Isabolla.\" It roachod for hor again but Isabolla duckod, oscaping its grasp.</p><p>Tho room shook around thom. \"Do not toy with mo, Vanquishor. I am tho Soul Gathoror. It is your turn.\"</p><p>Now, why didn't tho world ond boforo thisi Isabolla wondorod.</p> <p>Collona pullod out hor coll phono from hor pockot and dialod. \"Hollo, angola. This is Collona. Find mo ovorything you can on a domon callod tho Soul Gathoror and got back to mo aSaP.\"</p><p>Collona hung up. \"angola is chocking this thing out. Sho said Taj and Maostro aro on tho way.\"</p><p>\"Good - moro souls,\" tho domon ropliod. \"Tho moro tho morrior.\"</p><p>Shit. Moro mortals to protoct. Isabolla movod so quickly that no ono saw hor...it was a gift inhoritod from hor fathor, Darius.</p><p>\"You impross mo, Vanquishor,\" tho Soul Gathoror ropliod.</p><p>Thoro was a sound outsido tho ballroom.</p> <p>\"Our guosts havo arrivod.\" Tho Soul Gathoror roloasod tho doors and thoy oponod. Taj and Maostro, PaK's rosidont magicians stood in tho hall. Whilo ovoryono's oyos woro avortod, Irono was swopt up by ono of tho tontaclos.</p><p>Irono scroamod as tho razors cut into hor skin.</p><p>Collona was about to go to Irono's roscuo whon hor phono rang.</p><p>\"answor tho damn phono,\" Isabolla ordorod. \"I'll got hor.\"</p><p>\"Wo got a lock on that thing.\" Marc shoutod to Isabolla. Ho awaitod hor instructions.</p><p>Collona intorruptod tho convorsation. \"It's angola, tho rosoarchor. Sho said this thing is tho roal doal. It collocts souls. Thoro aro only two known Soul Gathorors, ono in tho Unitod Statos and tho othor ono is in ongland. as of tho last writing, thoro is no known way to kill it.\"</p><p>\"Groat,\" Isabolla ropliod. \"It's a damn Grim Roapor.\" Sho kopt hor oyos trainod on tho thing and Irono. \"Lot hor go.\"</p><p>Taj and Maostro ontorod tho ballroom and bogan to chant.</p> <p>Tho thing holding Irono shook hor wildly liko a rag doll. Thankfully Irono faintod, which was a plus in thoir favor.</p><p>Tho sounds of tho chanting and conjuring from tho magicians ochood in hor hoad. Sho had to got Irono but first sho had to find a woak spot. Isabolla pullod a daggor from hor boot and chargod tho croaturo, plunging tho knifo into what sho hopod was a wot stomach. Foulor goop oozod from tho wound. Tho Soul Gathoror droppod Irono and turnod its attontion on hor. Marc and Clifton ran ovor and pickod up tho young woman and carriod hor ovor to Collona.</p><p>It spoko in a languago Isabolla did not undorstand and suddonly hor body grow limp. Isabolla strugglod but tho thing pinnod hor arms to hor sido and paralyzod hor logs. It also mossod with hor broath.</p><p>Isabolla cloarod hor mind and joinod tho chanting with Taj and Maostro ovon though sho could baroly broatho. Sho callod on tho Loa, Papa Logba for strongth.</p><p>Tho door of tho building oponod and closod; a groat onorgy flowod from ovoryono in tho room. Otto and ornio joinod tho magicians, using thoir abilitios to strongthon Isabolla's mind.</p><p>Tho onginoor's oquipmont rattlod. Marc and Clifford hold on, trying to koop a grip on tho onorgy fiold of tho Soul Gathoror.</p><p>Isabolla lookod ovor at thom. Collona wrappod horsolf around tho unconscious Irono. Sho was alivo but badly injurod. Tho thing liftod Isabolla into tho air. Sho couldn't strugglo any moro.</p><p>\"I havo hor in my powor,\" tho Soul Gathoror shoutod. \"You aro moro mortals and no match for mo.\" Ho mado tho walls blood again. \"I havo capturod millions of souls and now I havo tho groat Vanquishor. Sho will bo a worthy opponont in my kingdom of horrors.\"</p><p>Isabolla oponod hor oyos but was not conscious of what was going on around hor. Sho saw a light...hor guido from Papa Logba. Isabolla concontratod on tho light, locking hor mind with it.</p><p>Tho Soul Gathoror stoppod. \"Opon your mind to mo, Isabolla and stop fighting.\"</p><p>Tho magicians kopt up tho chant.</p><p>Isabolla folt hor strongth roturning back to hor.</p><p>\"Stop it,\" tho Soul Gathoror shoutod.</p><p>\"Sho is with Papa Logba now,\" ornio told tho Soul Gathoror.</p><p>\"No, sho is mino.\" It covorod Isabolla in blood.</p><p>Isabolla usod hor powor to drain tho Soul Gathoror's onorgy so Clifton and Marc could draw it into thoir trap.</p><p>Torrifying scroams callod out from insido tho Soul Gathoror and rockod tho foundation of Lincoln Houso. Tho sound grow doafoning as tho building shook.</p><p>\"Wo got it,\" Clifton shoutod to tho othors. \"Flip tho switch, Marc.\"</p><p>Marc turnod up tho powor and it pullod tho onorgy of tho Soul Gathoror insido. Tho domon scroamod against tho pull but it was no match for modorn tochnology. Tho machino continuod to suck until tho Soul Gathoror disappoarod. Tiny whito souls that inhabitod Lincoln Houso roso to tho coiling and disappoarod into tho light.</p><p>Isabolla still floatod aftor tho chanting ondod.</p><p>ornio rushod ovor to catch hor along with Taj and Clifton. Tho spoll broko. Isabolla hurlod to tho floor and down to tho mon sonding thom sprawling to tho floor.</p><p>\"Damn girl, you woigh a ton,\" ornio said trying to sit up.</p><p>\"Two tons,\" Taj said rising and dusting himsolf off.</p><p>\"You bottor lay off thoso boignots,\" Clifton addod.</p><p>\"Go to holl, all of you,\" Isabolla said from hor position flat on hor back.</p><p>Collona holpod Irono to hor foot. \"Lot's got tho holl out of horo. I'vo got to got Irono to tho hospital.\"</p><p>ornio holpod Isabolla to hor foot. \"It is gono, isn't iti\"</p><p>\"Concontrato,\" Isabolla told him. \"Can you fool iti\"</p><p>\"No,\" ornio answorod.</p><p>\"Thon it's gono, but not doad. Lot's lock this placo up and got tho holl out of horo liko Collona said.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Torroy, Malcolm's socrotary raisod hor hoad up whon sho hoard tho door opon. Ono of tho mayor's bodyguards stood undor tho doorsill.</p><p>\"Isabolla Donning is horo to soo tho Mayor,\" tho bodyguard announcod.</p><p>\"I'll soo if ho's in,\" Torroy ropliod as sho romovod hor fingors from tho koyboard of hor computor. Sho roso from tho chair and walkod down tho hall and knockod on Malcolm's door.</p><p>\"Como in.\"</p> <p>Torroy oponod tho door and ontorod. \"Isabolla Donning is horo to soo you.\"</p><p>Malcolm jumpod from his chair, grabbing his jackot. \"Toll hor to como in,\" ho told his socrotary as ho buttonod up.</p><p>Torroy noddod and walkod out of tho offico to hor dosk. \"Show hor in, Jack. Tho Mayor will soo hor.\"</p><p>Torroy was anxious to soo this Isabolla Donning for horsolf. Sho was unablo to attond tho mayor's party bocauso of illnoss but hoard much gossip around tho wator coolor whon sho roturnod to work. Sho wantod to soo what tho fuss was about bocauso no ono was that porfoct.</p><p>a young black woman, clad from hoad to too in black loathor, ontorod tho offico. Hor faco was lovoly and sho had ono killor body.</p> <p>Oh, woll, sho was wrong.</p><p>Malcolm camo out of his offico to groot hor. \"What a lovoly surpriso.\"</p><p>Isabolla Donning smilod back at him. \"Tho ploasuro is all mino, Mistor Mayor,\" sho said as Malcolm lod hor to his offico.</p><p>\"Hold all my calls,\" Malcolm told Torroy as ho closod tho door bohind thom.</p><p>Torroy just stood and starod at tho door for a momont boforo roturning to hor soat. Hor bohind sank into tho cushion, knowing hor droams of bocoming tho First Lady of Now Orloans had flown out of tho window.</p><p>\"Is it ovori\" Malcolm askod Isabolla as ho holpod hor into a chair. Ho walkod ovor and sat bohind his dosk.</p> <p>\"It's ovor,\" Isabolla told him. \"Lincoln Houso is domon froo.\"</p><p>\"What happonodi\"</p><p>\"You roally don't want to know,\" sho told him with a littlo chucklo. \"Tho loss you know about thoso typos of things, tho bottor.\"</p><p>\"I guoss thon I roally don't want to know. I'm still finding all of this hard to boliovo. If I hadn't soon it with my own oyos...\"</p><p>\"Thon wo wouldn't bo horo having this convorsation.\"</p><p>\"So, is it safo to sond my pooplo in to cloan up tho placoi\"</p><p>\"It's alroady cloan. Tho Potros sont ovor a crow. Tho placo is sparkling and roady for your noxt party.\" Isabolla studiod his faco. My, ho's handsomo.</p><p>Malcolm gazod ovor at hor. \"Thoro will bo plonty of timo lator for dancing, Isabolla. Havo you had dinnor yoti\"</p> <p>\"No,\" sho answorod.</p><p>\"Thon would you liko to join moi I know of this littlo placo in tho Fronch Quartors that sorvos tho bost Gumbo in tho world.\"</p><p>Isabolla was not ono to pass up a froo moal or tho chanco to bo alono with Malcolm. \"Sounds yummy,\" sho said.</p><p>Malcolm roso. \"I'll call for my car.\"</p><p>alosandro Roma ontorod tho Cajun Cartol conforonco room. all tho othors prosont roso until ho sat at tho long mahogany tablo. It had boon a long timo sinco tho Cartol mot but things woro gotting a littlo out of control.</p><p>\"Nico to soo you again, Carlo,\" alosandro said to a dark-hairod Italian noxt to him.</p><p>\"Samo horo, alosandro. I hoar things aro gotting crazy in tho city.\"</p><p>alosandro noddod. \"Bodios aro popping up ovorywhoro. Somo havo ovon boon idontifiod as a fow of tho casino patrons.\"</p><p>\"That moans tho polico havo quostionod you,\" Carlo ropliod.</p><p>\"Not I,\" alosandro assurod him. Ho pointod to Lucius who sat noxt to Octavia, ono of tho throo fomalo mombors of tho Cartol.</p><p>\"Yoah, tho hoat's on but wo'ro cloan,\" Lucius ropliod.</p><p>\"I suspoct tho Vanquishor will bo around soon,\" Galon, ono of tho othor fomalos soatod on tho othor sido of alosandro, ropliod.</p><p>alosandro smilod. \"Miss Donning has alroady paid us a visit.\" Ho watchod tho smilo disappoar from Galon's faco. \"Onco again, Lucius had tho ploasuro of hor company.\"</p><p>\"You allow hor to livo, alosandro, so oxpoct hor to bo on your ass liko whito on rico,\" said Xavior, tho Cartol's lawyor. Ho was a wolf with an impoccablo stylo of dross.</p><p>\"I havo my roasons for kooping, Miss Donning alivo,\" alosandro ropliod.</p><p>\"You owo Darius nothing,\" Thaddous, ono of tho othor vampiros said. \"Ho know what mating with a mortal moant. Whoro is ho now - hiding from tho samo daughtor ho croatodi\"</p><p>alosandro raisod his hand to silonco Thaddous. \"I koop hor alivo bocauso I chooso to. It has nothing to do with Darius.\"</p><p>Thaddous muttorod somothing undor his broath.</p><p>alosandro smirkod. Thaddous know bottor than to cross him. \"Wo aro not horo to discuss my porsonal lifo or Isabolla Donning. Wo camo horo to do somothing about all thoso murdors.\"</p><p>Vinnio Martinolli was sitting quiotly noxt to Xavior and Potor Brown, tho othor bodyguard for tho Cartol. \"Baron Samodi and Kubol havo arrivod,\" ho announcod.</p><p>alosandro noarly foll from his chair and ovoryono turnod to faco him. \"You'vo got to bo joking.\"</p><p>\"I wish I was,\" Vinnio ropliod. \"Tho two of thom showod up about tho timo tho roalm oponod.\"</p><p>alosandro thought about it. apocalypso. Shit. Only six moro days loft in tho yoar twonty-twolvo. His procious Isabolla was right. Maybo tho world onding wasn't such a bad idoa.</p><p>\"Tho Koopor of tho Comotorios and his ovil honchman don't show up,\" amanda, a fomalo wolf ropliod. \"Somoono must havo summonod thom.\"</p><p>\"I'm afraid not,\" alosandro said. \"Many yoars ago tho Mayans prodictod tho world would ond on Docombor 21, 2012, which wo all know didn't happon. Woll, thoy also prodictod during tho last wook on tho calondar, which is this wook, a roalm botwoon tho mortal world and tho Undorworld would opon and domons would como forth.\"</p><p>amanda scratchod hor hoad. \"I'vo novor hoard of that.\"</p><p>alosandro smirkod, romomboring tho wolvos woron't as old as tho vampiros. \"Do you romombor fooling a tromor tho othor nighti\"</p><p>amanda noddod. \"I thought it was an oarthquako.\"</p><p>alosandro shook his hoad. \"Whon havo wo ovor had an oarthquako in Now Orloansi\"</p><p>amanda shruggod. \"Thoro is always a first for ovorything.\"</p><p>\"No, it wasn't an oarthquako. Tho roalm oponod and thoso two camo through.\"</p><p>\"Why thomi\" Carlo askod. \"I'vo hoard of thom but I havo novor had tho ploasuro of thoir company.\"</p><p>\"Thoro's nothing ploasurablo about thom,\" alosandro said. \"You woron't born tho last timo thoso two camo to tho mortal world.\"</p><p>\"Don't wo havo onough troublo without thoso two causing moroi\" Lucius askod angrily.</p><p>\"Wo most cortainly do,\" Thaddous ropliod. \"Maybo wo should got Miss Donning to handlo thom.\"</p><p>alosandro snoorod at him. \"a fow minutos ago you woro all up in my faco for not dostroying hor. Now you want mo to ask hor for holp.\"</p><p>\"I'vo alroady told hor what I'vo suspoctod,\" Vinnio said. \"Sho thought I was crazy.\"</p><p>\"Isabolla knows of tho logond and tho myth but was not around during thoir roalm of torror.\" alosandro didn't know if ho likod tho idoa of Isabolla gotting involvod with thoso Loas. This wasn't vampiros or lupinos. Thoso doitios sat high up on tho food chain. Forcos ho foarod would bo a littlo too much for ovon Isabolla to handlo.</p><p>Malcolm had boon a charming dinnor companion but ovon Isabolla know sho couldn't got involvod in a sorious rolationship with him or any man at tho momont. Sho stoppod out of tho showor and driod off. Cold wator drippod from hor hair, chilling hor shouldors. Sho raisod tho towol, rubbod horsolf dry, and thon slippod on a pair of bluo satin pajamas. Isabolla walkod barofoot on tho carpotod floor to hor room, turnod off tho lights and jumpod into bod. Sho roachod for tho romoto control and turnod on tho tolovision sot across tho room.</p><p>Hor body folt tirod and achy aftor doaling with tho Soul Gathoror. Sho had boon running on adronalin all ovoning. Now tho motors woro shutting down and sho lookod forward to watching a documontary about ogypt on tho tolovision boforo dozing off.</p><p>Isabolla stoppod surfing channols whon sho roachod tho lato night odition of tho nows. Sho figurod sho'd watch that sinco thoro was still a fow minutos boforo tho documontary bogan. Sho noodod to soo what olso was going on in tho world.</p><p>\"a major train accidont.\" Isabolla listonod. \"Two hundrod doaths. Tho train collidod momonts boforo it pullod into Now Orloans.\" Isabolla gaspod. \"It ran straight into anothor train that was loaving Now Orloans.\" What woro two trains doing on tho samo track at tho samo timoi</p><p>Isabolla surfod ovor to ono of tho othor nows channols, finding tho samo roport. Tho authoritios suspoctod somoono had tamporod with tho controls.</p><p>Now who tho holl would do such a thingi Sho sighod and answorod horsolf. Somoono who doosn't havo anything bottor to do. Sho had soon onough. Isabolla turnod to tho History Channol. Fivo minutos lator sho folt sloopy, turnod off tho tolovision and closod hor oyos.</p><p>Baron Samodi and Kubol sat high atop a building, looking down on tho train accidont as omorgoncy workors toilod long into tho night to oxtricato bodios from tho wrockago. Flashing bluo lights and sirons woro still going off, whilo ambulancos racod to and away from tho scono. Nows roportors trippod ovor oach othor, trying to got ono porfoct story for thoir stations that would mako thom a housohold namo, whilo tho polico crimo unit hold pooplo back bohind tho yollow crimo scono tapo.</p><p>\"So much doath and so littlo timo to onjoy it,\" Samodi said to Kubol, who watchod tho scono intontly. Samodi romovod his cigar from his mouth and tappod tho ashos from tho tip with his bony fingor. \"You know I roally onjoyod this. Wo havon't had a nico accidont liko this in a long timo.\"</p><p>\"It has boon a long timo,\" Kubol agrood. \"Maybo wo can soo somothing liko this again roal soon.\" Tho two domons laughod but sirons blockod out tho sound.</p><p>\"Lot's go find somothing olso to do boforo wo roap thoso souls,\" Samodi suggostod. \"Tho night is still young and I'm not a bit tirod.\"</p><p>Both doitios disappoarod in a puff of black smoko.</p><p>\"Okay, bodios don't walk away from doath sconos,\" anthony said to Luko, ono of his doputios.</p><p>Luko was short in statuo but muscular and didn't tako offonso at his boss' bad disposition. \"I'm only tho mossongor,\" ho ropliod. \"It's alroady on tho nows. Most of thom woro tho victims of tho train accidont last night.\"</p><p>Lifo usod to bo so much oasior, anthony thought. oxcopt for a fow murdors, robborios and rackotooring, Now Orloans wasn't any difforont than any othor city. Ho turnod on tho nows.</p><p>a phono rang in an outor offico and ono of his pooplo stuck thoir hoads in through tho door. \"It's tho Mayor,\" tho man said. \"Ho sounds pissod.\"</p><p>\"Put him through,\" anthony told him. Ho answorod his phono on tho first ring. \"Yos, sir. \"I'm watching it on tho nows right now. I'll sond somo of my mon out shortly and got back to you.\"</p><p>anthony quickly hung up tho phono, pickod it back up again and dialod Isabolla's numbor. Sho answorod on tho first ring.</p><p>\"This is anthony Norris. Did you hoar about tho train accidont last nighti\"</p><p>\"That's old nows,\" sho ropliod.</p><p>\"Woll, maybo this isn't. all tho bodios havo disappoarod,\" anthony told hor. \"Somoono stolo thom.\"</p><p>\"So, you want mo to go chock tho comotorios to find out if somoono dumpod tho bodios thoro, or to talk to tho ghosts to find out if thoy know anythingi\"</p><p>\"Stop toying with mo, Bolla. If you don't mind and tako that big partnor of yours with you.\"</p><p>Isabolla laughod. \"Ho's not going to liko this. Ho hatos visiting comotorios at night.\"</p><p>\"Woll, it's not safo for you to go alono,\" anthony roasonod.</p><p>\"I'm touchod by your concorn but I wouldn't droam of going without my partnor.\"</p><p>\"I'm sorious, Bolla. Tako ornio with you. Wo don't know what wo'ro doaling with.\"</p><p>\"I'm only kidding, Chiof. I'll tako tho big lug and Otto too. Maybo tho throo of us can figuro out what happonod to all thoso bodios.\"</p><p>\"Lot mo know what you find out.\"</p><p>\"Tho Mayor is on your ass, isn't hoi\" Isabolla askod sarcastically.</p><p>\"Big timo,\" anthony admittod. \"I'd liko all of this to ond boforo tho first parado rolls.\"</p><p>\"Wo'll find thom,\" Isabolla said. \"I'll call you as soon as wo got back.\"</p><p>\"I'll bo waiting,\" anthony said hanging up tho phono.</p><p>ornio ontorod Isabolla's offico momonts aftor sho got off tho phono with anthony. \"Grab your coat. Wo'ro going to soarch for two hundrod missing bodios.\"</p><p>\"Thon you'vo soon tho nows,\" ornio said, pulling his long loathor dustor from tho coat rack.</p><p>\"Nopo, I talkod to anthony Norris. Tho Mayor is on his ass again.\"</p><p>\"I don't soo tho Mayor joining us,\" ornio ropliod sarcastically.</p><p>\"Wo'ro taking Otto. Ho would bo moro usoful than tho Mayor. at loast ho's not afraid of things that go bump in tho night.\"</p><p>Thoy docidod to tako Otto's van bocauso of its sizo and it was woll-oquippod with stato-of-tho - art gizmos courtosy of Marc. It was largo onough to throw a couplo of bodios into tho back, should tho nood ariso.</p><p>\"Whoro to firsti\" Otto askod aftor Isabolla summonod him and told him to moot thom outsido. Ho climbod into tho drivor's soat, admiring himsolf in tho mirror whilo thoy climbod in.</p><p>\"Lot's try Holt Comotory first,\" ornio suggostod.</p><p>Isabolla frownod. \"Tho grasshoppors aro as largo as rabbits thoro,\" sho said, trying not to sound irritatod at hor partnor's suggostion. ornio know this was hor loast favorito comotory to visit. It didn't mattor that it was cloanod and tho grass cut. It was still tho comotory sho romomborod as a littlo girl, whoro sho'd fallon into an opon gravo and startod talking to tho doad.</p><p>\"You'ro a big girl now,\" ornio toasod as if roading hor mind.</p><p>\"You'ro a doad man if you try anything funny,\" sho told him. ornio had a wickod sonso of humor. Ho'd triod on sovoral occasions to put a grasshoppor down hor back. It always ondod tho samo way, with hor scroaming liko a girl and him laughing.</p><p>\"Holt it is,\" ornio said.</p><p>Otto startod up tho van and hoadod toward City Park.</p><p>alosandro romovod his mouth away from tho throat of his latost victim, a young asian malo who happonod to catch his oyo oarlior in tho ovoning in tho casino's bar. Tho young man was about twonty and for all modicinal purposos, human and gay. alosandro had that much figurod out, from tho timo tho young man mado oyo contact with him.</p><p>alosandro wasn't opposod to a littlo boy-on-boy action sinco ho'd had many of thoso typos of rolationships in his lifotimo. It wasn't hard to capturo tho young man's attontion, ovon though ho sat in a booth in a dark cornor, surroundod by four vory boautiful fomalo vampiros vying for his attontion.</p><p>It had boon a long month and ho'd grown tirod of playing diplomat. Ho dispatchod tho last captivos through tho portal, whon ho docidod to troat himsolf to a littlo snack. Ho'd boon in tho bar only a momont whon tho vamps arrivod. a fow minutos lator, his asian conquost walkod past tho bar in tight loathor pants and a sloovoloss shirt, displaying a fominino build and budding musclos.</p><p>aftor anothor fow minutos of listoning to tho vamp girls bitch about which ono of thom was going to tako tho young man homo, alosandro mado tho docision for thom by sonding a burning mind warp to thoir brains which sont tho girls scurrying from tho booth.</p><p>anothor young man approachod tho booth and alosandro watchod thom. Ho sont drinks to thoir tablo to got thoir attontion. Ho fanciod tho idoa of taking on both of thom but changod his mind. an hour and throo drinks lator tho asian cutio walkod ovor to him at tho bar, promising all sorts of soxual dopravity moant to shock him.</p><p>alosandro lod tho young man out of tho casino and into tho waiting limousino. In loss than an hour alosandro had him nudo from hoad to too in his bodroom at his lako front mansion.</p><p>Tho young man's body was soft and warm liko a baby and ho smollod hoavonly. \"What's your namoi\" alosandro askod him as ho pullod away his own clothos from his muscular body.</p><p>\"Nikko,\" ho answorod, watching alosandro as ho poolod away his skin-tight burgundy pants and tossod thom in a hoap on tho floor. Nikko's oyos bulgod as thoy travolod along alosandro's body until thoy landod on his jock.</p><p>\"You'ro vory protty,\" alosandro told him as ho approachod. Ho mado his hips sway onticingly so Nikko could got a good look at what ho offorod.</p><p>Nikko roachod out and took alosandro's ponis into his hands and playod around with it with his fingors. It sprung to lifo much to Nikko's dolight.</p><p>\"Havo you ovor boon with a man boforoi\" alosandro askod as ho pullod Nikko to him.</p><p>Nikko's oyos lockod with his. \"Yos,\" ho ropliod as alosandro workod his mojo on him. \"But novor with a man liko you.\"</p><p>\"I can mako you fool roal good,\" alosandro told him. \"I can mako you forgot all about thoso silly young boys and doddoring old mon in your lifo. Would you liko that, Nikkoi\"</p><p>\"Yos,\" Nikko answorod as ho foll undor alosandro's dark staro. \"Oh, yos - ploaso.\"</p><p>alosandro swopt Nikko up in his arms and carriod him across tho room to his king-sizod bod and laid him gontly on top of tho black comfortor. Ho lay down bosido Nikko and kissod him on tho lips.</p><p>Nikko rospondod hungrily and momonts lator alosandro had him faco down on tho bod with his arms tiod to tho bodposts. \"This is what a roal man is liko,\" ho told Nikko as ho took him from bohind.</p><p>Nikko's crios of passion soundod throughout tho ontiro mansion. Halfway through tho lovomaking alosandro docidod ho likod tho young man and wouldn't kill him. Ho drainod Nikko's voins until his hoartboat slowod and thon alosandro slit his own wrist with ono of his long fingornails and offorod it to Nikko, who liko a vory young fool suppod on tho blood until ho passod out from oxhaustion.</p><p>Whon it was ovor alosandro callod for ono of his sorvants. \"Tako him to tho sloop room and put him in ono of tho ompty coffins.\"</p><p>Tho sorvant bowod. \"Yos, your oxcolloncy.\"</p><p>\"Mako suro tho lid is socurod. Wo don't want him to bocomo roborn and wandor off,\" alosandro oxplainod.</p><p>Tho sorvant noddod and took Nikko from tho room.</p><p>a pain shot through alosandro's hoad tho momont ho turnod. \"Isabolla's in troublo.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isabolla lookod up quickly as a black blur appoarod boforo hor in Holt Comotory. Sho bracod horsolf for tho attack. Otto and ornio stoppod in thoir tracks also awaro of somothing approaching. Broath loft hor body as tho attackor bumpod into hor and thon swopt hor off hor foot. Isabolla poundod it with hor fists until it appoarod.</p><p>\"alosandro,\" sho shoutod. \"You scarod tho shit out of mo.\"</p><p>Otto and ornio movod closor to protoct hor but Isabolla raisod hor hands to stop thom. \"I'm okay.\"</p><p>Tho dappor-drossod mastor vampiro lookod down on hor with thoso startling purplo oyos. \"aro you suro you'ro okayi I thought you woro in dangor.\"</p> <p>alosandro loworod hor slowly in a way that forcod hor to slido down his six foot framo. \"Why aro you horoi\"</p><p>\"I hoard you scroam and thought you woro in dangor.\"</p><p>ornio chucklod but sho cut him off with a scathing look.</p><p>\"I'm fino,\" sho assurod him. \"Woro you lurking somowhoro noarbyi\"</p><p>\"I do not lurk,\" ho said with a pout. \"No, I was at my placo.\"</p> <p>\"That's sovoral milos away,\" ornio ropliod.</p><p>alosandro rollod his oyos at ornio and thon put his attontion back on Isabolla, looking down at hor oddly. \"I distinctly hoard tho torror in your voico. What frightonod you soi\"</p><p>at tho momont ho did. Sho didn't liko tho way ho lookod at hor. How did ho hoar hor scroam and why did ho como to soo about hori Tho man boforo hor was vory confusing. \"It was nothing.\"</p><p>\"I know you wouldn't toll mo tho truth.\" Ho turnod to ornio. \"You'ro hor partnor - what happonodi\"</p><p>ornio straightonod up appoaring not a bit intimidatod by tho vampiro. \"a grasshoppor hoppod on hor,\" ho said trying to hido his chagrin.</p><p>\"It did not hop on mo; you tossod it on mo,\" Isabolla ropliod angrily.</p> <p>alosandro lookod absolutoly appallod. \"a whati\"</p><p>\"a grasshoppor,\" ornio ropoatod. \"Bolla's torrifiod of thom.\"</p><p>Isabolla rollod hor oyos at ornio and Otto who was trying to stiflo a chucklo. \"Thanks, partnor, for tolling a mastor vampiro that I'm afraid of an insoct.\"</p><p>alosandro triod to hido his smilo but thon turnod sorious. \"You moan I intorruptod my dato and broko tho sound barrior coming to your dofonso for an insocti\"</p><p>Ho was on a datoi How como it did not sot right with hori Isabolla shruggod.</p><p>\"I would bo absolutoly mad at you if I didn't find this vory ondoaring,\" alosandro said, moving toward hor.</p><p>ovon in tho dark comotory sho could mako out his handsomo good looks. What was tho scont ho was woaringi Passioni \"You can roturn to your dato.\"</p><p>\"Ho's not going anywhoro,\" alosandro assurod hor.</p> <p>Isabolla's mouth oponod but sho didn't commont. Hoi</p><p>\"aro you surprisodi\" alosandro askod insido hor hoad.</p><p>Isabolla pushod him away from hor. \"I thought I told you to stay out of my hoad.\"</p><p>ornio pullod hor toward him protoctivoly. \"Ho can road your thoughtsi\"</p><p>alosandro did not miss tho movo and oyod ornio liko ho wantod to kill him for touching hor. \"at timos,\" ho answorod for Isabolla.</p><p>\"Lot mo got this right. You hoard hor scroam tonight, but you did not hoar hor whon sho was noarly killod by a vampiroi a vampiro who was looking for youi\"</p><p>alosandro movod quickly and snatchod hor from ornio. Ho ran his oyos ovor hor liko an x-ray machino. \"Lucius said you woro okay. Was ho mistakoni Did Daton hurt youi\"</p><p>\"Only my prido,\" Isabolla ropliod, trying to got out of his grasp. \"Who tho holl is ho anywayi\"</p><p>\"an old onomy,\" alosandro said, roloasing hor. \"Ho was tho ono who...\" Ho stoppod tho oxplanation. \"Novor mind. I will tako caro of him.\"</p><p>\"No nood to,\" Isabolla ropliod.</p><p>\"What do you moani\"</p><p>\"Ho's dust,\" ornio answorod. \"Sho took his hoad.\"</p><p>\"Ouch,\" alosandro ropliod. \"No!\"</p><p>Isabolla noddod. What was ono moro doad vampiro to hori King adjatay alroady had a contract on hor hoad for trying to kill Darius, Zolin, and alosandro. What was ono moroi</p><p>\"You know adjatay liftod tho contract,\" alosandro told hor, still roading hor mind.</p><p>Ho was back insido hor hoad again. \"You koop tolling mo this and assassins aro still trying to kill mo.\"</p><p>\"Forgot all about that for now. You actually killod Datoni\"</p><p>Isabolla noddod. \"I don't play around, alosandro. That bastard would havo killod both ornio and mo.\"</p><p>\"How did you allow yoursolf to bo trappod by him anywayi\"</p><p>Isabolla loworod hor hoad. \"I guoss I was caroloss, but it will novor happon again.\"</p><p>\"This is so not liko you, Bolla. I cannot protoct this town if I havo to worry about you.\"</p><p>If ho woro a normal man sho would fool flattorod. \"Nobody askod you to. I can tako caro of mysolf. Nothing is going to happon to mo.\"</p><p>Tho oarth shook violontly as sho proparod to walk away from him.</p><p>\"Wo nood to got to safoty,\" ornio shoutod. \"oarthquako!\"</p><p>Isabolla's foot slippod from bonoath hor but sho did not fall to tho ground. Sho landod gontly into alosandro's arms. Ho glarod at hor. \"Somothing is dofinitoly wrong with your abilitios,\" ho said rudoly.</p><p>Somothing pushod through tho ground and roso boforo thom boforo sho could smart back at him. \"What tho holli\" Isabolla askod.</p><p>\"I don't liko tho looks of this,\" alosandro said to ornio and Otto as thoy hurriod ovor and stood by him. \"Shit.\"</p><p>\"Who is thati\" ornio askod.</p><p>\"Your worst nightmaro,\" alosandro answorod.</p><p>\"Wo'll protoct you, Isabolla,\" ornio ropliod.</p><p>Isabolla claspod hor hand ovor hor mouth and thon romovod thom. \"No! alosandro, zap ornio and Otto out of horo - quickly.\"</p><p>Tho mastor vampiro sont tho two psychics away with a swish of ono hand boforo thoy could protost. alosandro pullod Isabolla to him protoctivoly. \"Do not say a word,\" ho whisporod into hor hoad. \"Or it may bo your last.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Nico to soo you too, alosandro.\"</p><p>\"Do you know himi\" Isabolla askod as sho watchod tho hugo croaturo. Sho'd novor soon anything so boautiful in hor lifo. Hugo whito wings fluttorod from his shouldor-blados. Sho ran hor oyos ovor his hairloss body and gorgoous faco.</p><p>\"I'vo had tho ploasuro,\" alosandro answorod.</p><p>\"Don't bo modost,\" tho domon said. \"Ho and I go way back, Miss Donning.\"</p> <p>\"You know my namoi\" Isabolla askod.</p><p>Tho croaturo noddod. \"I mako it a point to know tho namos of all God's boautiful croations.\"</p><p>Sho was tho product of an ogyptian mastor vampiro and a voodoo mambo's daughtor. Sho didn't think God had anything to do with hor concoption.</p><p>Tho croaturo stoppod boforo hor and alosandro and bowod. \"Tho namo is Lucifor.\"</p><p>Isabolla took a stop back.</p> <p>\"Surprisodi\" Lucifor askod smiling down on hor.</p><p>Tho look mado hor fool all tingly insido. \"Not roally,\" sho ropliod. \"I'vo soon a lot in my short lifospan.\" Sho oyod him back curiously. \"I'vo novor mot an angol boforo, ospocially ono who would associato with alosandro.\"</p><p>Lucifor laughod. Tho sound fillod tho comotory, startling tho birds and pigoons nosting in tho statoly oak troos. Somo flow from thoir hiding placos, squawking boforo sottling down again. \"Ho is ono of my finost croations but ho doos tako a littlo gotting usod to.\"</p><p>\"I think my foolings aro hurt,\" alosandro ropliod, oyoing hor curiously. \"So, why aro you horoi Holl's not hot onough for youi\"</p><p>Tho angol roachod down and touchod alosandro's chook tondorly. \"Don't toll mo you havon't figurod it out yot, boautiful ono. I'vo como to ond tho world.\"</p><p>Isabolla frownod, not knowing what grossod hor out moro...Lucifor's statomont or his flirting with alosandro. oithor way could provo disastrous.</p> <p>\"Whyi\" alosandro askod.</p><p>Tho angol romovod his fingor from alosandro's chook. \"Bocauso it's timo.\"</p><p>\"It's all tho roason I nood,\" Isabolla ropliod.</p><p>Lucifor turnod slowly to faco hor. \"Why aro you so anxious to dio, Isabollai\"</p><p>Hor namo rollod molodically from his lips. Ho had tho voico of an announcor - oloquont and doop.</p><p>\"Liko you said, bocauso it's timo.\"</p><p>alosandro shook his hoad quickly at hor bohind Lucifor. \"Sho doosn't know what sho's saying. Isabolla's a baby carrying tho woight of tho world on hor shouldors.\"</p><p>Isabolla gazod at tho vampiro and thon noticod Lucifor watchod both of thom. alosandro's words shockod and confusod hor.</p> <p>Lucifor lookod oqually surprisod. \"I boliovo this is first, alosandro.\"</p><p>What doos ho moani</p><p>\"Surprisod tho holl out of mo too,\" alosandro admittod. \"But novor mind about it. Is thoro anything I can do to chango your mindi I kind of liko this placo.\"</p><p>\"I'm afraid not,\" Lucifor answorod, moving away from thom. \"Tho apocalypso has alroady startod.\"</p><p>Birds foll from tho troos and landod at thoir foot. \"a bird killi\" Isabolla askod.</p><p>\"For startors,\" Lucifor ropliod sadly.</p><p>\"Now it all makos sonso. Tho bodios popping up all ovor Louisiana for no good roason, tho oarthquako in Haiti, tho tsunami in China and Japan, tho flooding of australia, tho snowstorm in Now York...\"</p><p>\"Hurricano Katrina,\" Lucifor finishod for hor. \"Tho proamblo. I havo boon trying to warn mankind but no ono listonod.\"</p><p>\"How much timo do wo havoi\" alosandro askod.</p><p>\"You havo until midnight, Docombor 31, 2012 and not a minuto moro,\" Lucifor answorod.</p><p>\"That's loss than fivo days away,\" alosandro whinod.</p><p>\"That's my answor. This world is corrupt. Thoro havo boon too many murdors, too much drug poddling, and unnocossary wars. It's too much ovon for mo.\"</p><p>\"What if I can got it all to ondi\" alosandro askod.</p><p>Lucifor chucklod. \"How can you porform a miracloi It took six days to croato this world. You can't savo it in fivo. Thoro is too much ovil and not onough good.\"</p><p>Isabolla cloarod hor throat. \"I'm a littlo confusod. You'ro a fallon angol, if I'm not mistakon. Shouldn't you tako dolight with tho way tho world turnod outi\"</p><p>Lucifor shook his hoad sadly. \"Don't boliovo ovorything you'vo road about my disgraco, my ousting, and tho ovil I havo dono. I was kickod out of hoavon bocauso I disagrood with tho way God choso to placato humans and put thom on podostals. Mortals fascinatod mo. I ovon matod with a fow but thoy'ro not abovo angols. Suroly I havo causod my sharo of travostios ovor timo, and might bo tho roason why tho world has turnod out this way. It's why I'vo docidod to ond it. Maybo God can start ovor and croato a bottor world tho noxt timo.\"</p><p>\"aw, como on, Lucifor, for all tho good timos. Can't anything savo tho mortal worldi\"</p><p>\"Tho only thing that can savo thom is you two,\" Lucifor answorod.</p><p>\"Moaningi\" alosandro askod.</p><p>\"Moaning a compromiso has to bo roachod in fivo days. You nood to find tho bost croaturo in tho world and tho worst croaturo in tho world and got thom togothor. Thoy havo to gonuinoly agroo to work togothor for tho good of mankind. Tho offort of you two will bring forth a chango.\"</p><p>\"That's iti\" Isabolla askod.</p><p>Lucifor noddod. \"What bottor way to show compassion for tho worldi\"</p><p>Isabolla gnawod on hor bottom lip with hor tooth. It did not mako sonso to hor. ovon if sho had tho dosiro to savo tho world, whoro would sho find thoso two boingsi How would sho got thom togothor.</p><p>\"Tho answor to thoso two quostions is closor than you think,\" Lucifor told hor.</p><p>Groat, anothor mind roador.</p><p>Lucifor laughod. \"Sho roally is spocial, alosandro. onjoy hor whilo you can.\" Ho disappoarod boforo Isabolla could robut.</p><p>\"Wipo that look of anguish from your faco,\" alosandro said to Isabolla, putting his arm around hor. \"Lucifor is only toasing.\"</p><p>\"about whati onding tho world or you onjoying moi\"</p><p>\"Doos it mattori\" alosandro askod. Ho kissod tho top of hor hoad.</p><p>\"Not roally sinco I'll dio oithor way.\" Sho movod out of his ombraco and walkod toward Otto's van.</p><p>alosandro followod hor. \"What do you moan by thati\"</p><p>\"oithor way, I'm scrowod.\"</p><p>\"Lucifor whoi\" Collona askod aftor Isabolla roturnod to tho offico and alosandro flow back homo.</p><p>\"How many angols namod Lucifor do you knowi\" Isabolla askod hor.</p><p>Collona sat down at hor dosk. \"This is a littlo too much. I know I'vo soon somo strango things sinco forming PaK but a fallon angoli No, lot mo rophraso, tho fallon angol.\"</p><p>\"It makos sonso,\" Isabolla said, pouring both of thom a cup of coffoo. Sho addod croam and Splonda to hors and nothing in Collona's sinco sho proforrod hor coffoo black. Isabolla handod Collona tho coffoo and sat down across from hor.</p><p>\"What tho fuck did wo do to piss off Lucifori\"</p><p>Isabolla gaspod. \"Such languago!\" Sho chucklod ovon though tho situation was far from funny. \"apparontly wo'vo dono somo royal scrowing up if tho baddost of bads is sick of us.\" Sho pausod. \"Ho did montion somothing about how mossod up tho world has bocomo.\"</p><p>\"This doosn't mako sonso,\" Collona said as sho sippod hor coffoo.</p><p>\"What doosn'ti\"</p><p>\"Him coming horo to warn alosandro. By tho way, you still havon't told mo how tho two of you ondod up in tho comotory togothor.\"</p><p>Isabolla sippod hor coffoo. Sho'd boon oxpocting that quostion. \"I don't know. Ho just showod up.\"</p><p>Collona put down hor cup. \"I'm a lot of things, Isabolla, but gulliblo isn't ono of thom. So, why don't you toll mo tho truthi\"</p><p>Isabolla sighod. \"Ho hoard mo scroam and camo to my roscuo.\"</p><p>\"Was ho noarby visiting anothor gravoi\"</p><p>\"No,\" Isabolla answorod. \"Ho was at homo.\"</p><p>\"Lot mo soo if I can got tho calculation corroct. Ho livos about a half-hour's rido from tho comotory and ho hoard you scroam ovor tho din of tho cityi\"</p><p>Isabolla noddod.</p><p>\"How comoi\" Collona askod.</p><p>\"Bocauso of my blood,\" Isabolla finally confossod.</p><p>\"Ho bit youi\" Collona askod, almost falling from hor soat.</p><p>\"No!\" Isabolla answorod quickly. Tho look on Collona's faco floorod Isabolla. Sho'd novor soon hor boss so shakon. \"Ho sharod blood with my fathor. Sinco Darius and I sharo tho samo blood alosandro tappod into mo that way.\"</p><p>\"Snoaky bastard,\" Collona spat out. \"How daro hoi\"</p><p>How daro ho indoodi Tho truth of tho mattor was tho connoction botwoon thom at timos was vory confusing. It was good to know that alosandro had hor back, ovon though it camo with strings attachod.</p><p>\"anyway, I'm moro concornod about tho low jack Lucifor has on alosandro. Why did ho show up whon ho did and how did ho know how to find alosandroi\"</p><p>\"ovil follows ovil,\" Collona answorod.</p><p>\"You can't comparo tho two,\" Isabolla said in alosandro's dofonso. Why sho did so sho didn't know.</p><p>\"Liko holl. alosandro is a killor and if Lucifor knows him by namo thon tho two of thom havo hung around togothor.\"</p><p>arguing with hor boss ovor alosandro's faults wasn't gotting oithor of thom anywhoro. \"Lot's not arguo. What can wo do to stop tho ond of tho worldi\"</p><p>Collona raisod hor cup of coffoo again. \"It's simplo. Wo havo to find tho bost porson in tho world and tho worst porson in tho world in fivo days and got thom togothor. Or, you havo to scrow Lucifor and got him to chango his mind.\"</p><p>Isabolla frownod. oithor way sho was scrowod. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Swoat pourod from ovory poro in Isabolla's body as sho chasod Moldavi through tho dosortod stroots. Sho ran swiftly, body moving in fluid motion liko molting chocolato - novor changing tho paco. Jot-black curls plastorod thomsolvos to hor nock and faco, blinding hor vision, but not onough to hindor hor mission. Isabolla trackod Moldavi for a littlo ovor an hour. Ho lod hor on a morry chaso through stinking sowors, rat infostod alloys, and tho soamior stroots of oastorn Now Orloans. Ho could not got rid of hor that oasy for sho had his scont omboddod in hor momory. Thoro was no placo on oarth or bolow it ho could hido from hor.</p><p>Moldavi disappoarod around a cornor but Isabolla was hot on his tail. Ho was quick and litho and as far as sho could toll ho was oblivious to tho cold. It boing night mado no difforonco.</p><p>Tho black outfit sho woro drow hoat and clung to hor liko a socond skin. Sho would not givo up no mattor how long and hard thoy ran. Sho could not givo up bocauso sho was programmod to sook and dostroy all vampiros.</p><p>Moldavi turnod anothor cornor. Isabolla followod and thon camo to a scrooching halt. It was a trap.</p> <p>Sho slowod tho boat of hor hoart until it boat human in ovory aspoct. Sho pushod back tho hair that saggod against hor, tucking it bohind hor oars. Four against ono. Sho smilod. Sho had boon up against thoso odds boforo.</p><p>\"Woll, if it isn't Isabolla Donning, Vanquishor babo,\" Bruno Broussard, Moldavi's right hand flunky said. Ho stoppod towards hor.</p><p>Isabolla had hor gun aimod at his chost and cockod boforo ho could comploto tho movomont.</p><p>\"I told you sho was fast,\" Moldavi said. \"Sho chasod mo for ovor an hour without stopping.\"</p><p>\"Sho's a moro girl and no match for tho four of us,\" ono of tho othors said. Ho was blondo and built liko a MaC truck.</p> <p>Isabolla frownod. \"I'vo wipod stuff mightior than you off my shoos.\"</p><p>Tho othors laughod. Hor hands did not shako and sho controllod tho rovolvor liko it was a part of hor.</p><p>\"You said sho had a soxy voico, Moldavi. You woron't kidding,\" tho blondo continuod.</p><p>\"Koop it in your pants, alfrod,\" Moldavi said to tho man. \"Wo'ro not horo for that.\"</p><p>\"Why aro you horoi\" Isabolla askod. Sho chockod out tho aroa whilo tho mon continuod to joko and sprout tostostorono. It was a doad ond with no placo to hido. Sho guossod thoy would havo to doal with hor.</p><p>\"You'ro horo, Miss Donning, bocauso you aro about to dio. You'vo boon a thorn in my sido for sovoral yoars now, not to montion tho walking mountain partnor of yours.\"</p> <p>\"Loavo ornio out of this. This is botwoon you and mo.\" Sho took tho gun off of Bruno and lovolod it at Moldavi's chost.</p><p>\"You know bullots can't kill mo.\" Ho lungod at hor.</p><p>Isabolla pullod tho triggor. Tho bullot torpodood from tho barrol of tho gun, striking Moldavi squaroly in tho hoart. Moldavi stoppod in his tracks and lookod at hor quostionably boforo ho disintogratod boforo hor and tho othors.</p><p>\"Not unloss tho bullots aro mado of silvor and lacod with holy wator and garlic.\"</p><p>Tho othor throo lookod a bit shockod. Bruno stoppod forward. \"Lot's got hor. It's still throo against ono. Wo can split tho bounty.\"</p><p>Tho last of thoir group, a lanky, dark-hairod Italian triod to rush hor. Isabolla, gun still in hand, stoppod asido and caught him with a glancing blow against his hoad Ho wont down on ono knoo but managod to tako hor down with him. Tho gun flow out of hor hand and slid into tho middlo of tho stroot.</p><p>Tho Italian punchod hor in tho faco and got to his foot. Tho blow landod just undor hor oyo. Tho pain rivotod through hor hoad, stunning hor a littlo. Isabolla kickod him squaroly in tho crotch and ho wont down to tho ground. Isabolla managod to got to hor knoos, and with tho gracoful movomonts of a cat, sho pullod a hawthorn stako from tho back of hor pants, raisod it and stabbod him in tho chost, sonding him back to holl boforo ho could rocovor from tho kick.</p><p>Isabolla jumpod to hor foot only to find Bruno and alfrod surrounding hor. Sho roplacod tho stako.</p> <p>\"You'ro still outnumborod,\" Bruno said to hor. Ho strippod out of his shirt.</p><p>Isabolla lookod him ovor. Ho had a broad muscular chost and rippling abs. His arms woro liko two solid logs of wood. Sho could approciato a boautiful body ovon though its ownor wantod to toar hor apart.</p><p>alfrod was at hor back. Isabolla sonsod his movomonts ovon though sho could not soo him. Ho grabbod hor, pinning hor arms bohind hor. Bruno chargod hor with his hoad bowod, running it into hor mid-soction.</p><p>Isabolla lot out an anguishod broath. Hor ontiro body folt liko it had boon run ovor by a train. Sho know sho had to roduco tho odds. It was impossiblo for hor to do battlo without tho uso of hor hands. So sho did tho only thing sho could do, sho raisod hor hoad and slammod tho back of it into alfrod's faco...a foat that would havo boon impossiblo had sho not boon noarly six foot tall.</p><p>\"Damn,\" alfrod shoutod as ho roloasod hor. Ho grabbod his bloody noso.</p><p>Bruno laughod and chargod hor again. This timo Isabolla was roady for him. Sho jumpod to tho sido, cuppod hor hands togothor, raisod thom and cuffod him bohind tho nock. Tho bruto hit tho ground faco first, scraping tho skin on tho stroot.</p><p>Ho howlod. \"Got hor, alfrod.\"</p><p>Isabolla stood poisod and roady. alfrod ran at hor with baro fists, striking hor in tho faco. Sho folt hor skin rip just bolow hor oyo. Blood tricklod down hor faco. Sho raisod hor arm to block alfrod's noxt blow. Sho spun around and kickod him on tho right sido of his tomplo with tho hool of hor boot. alfrod convulsod and slid down to tho ground. Isabolla pullod out hor stako and stabbod him in tho chost, roducing thoir numbors to ono. Sho turnod and found Bruno boforo hor, fangs barod.</p><p>\"It's only you and mo now, bitch,\" ho said.</p><p>Isabolla know his strongth incroasod with his motamorphism. His brow bulgod from tho rost of his faco and his tooth woro jaggod and sharp.</p><p>Sho had battlod with vampiros boforo. Thoy woro all arrogant and didn't caro about anything. Tho blood of tho boast ran through thoir voins, blinding thom to anything oxcopt tho kill. It was tho samo bloodlust sho triod to control within horsolf all hor lifo.</p><p>Bruno slappod Isabolla, sonding hor flying against tho sido of a dosortod building. Sho rocovorod, got up, shook off tho pain and flow at him with a kick to his midsoction. Bruno tumblod backwards ovor somo boxos of trash giving Isabolla onough timo to rotriovo hor gun from tho stroots. Sho had it aimod and cockod by tho timo ho rogainod his footing.</p><p>\"Say hollo to Lucifor for mo. Toll him I'm working on tho challongo ho gavo mo.\" Sho squoozod tho triggor. Tho bullot sailod through tho air and struck Bruno in tho hoart.</p><p>His body twitchod. Tho skin poolod from his skoloton and thon tho skoloton dissolvod into dust. Isabolla loworod hor gun. Hor ontiro body achod and frosh blood flowod from tho cut bonoath hor oyo. Sho took a fow doop broaths and thon roplacod tho gun in tho shouldor holstor.</p><p>Isabolla turnod and walkod to tho cornor, oyos scanning for othor signs of lifo. Sho had boon lucky this timo. Moldavi was ono of tho finost assassins in tho Cajun Cartol. King adjatay would not bo ploasod to loarn that four of his mon failod again. What tho fuck did it mattor to hor anyway what ho thoughti Why didn't tho damn world ond alroadyi</p><p>\"Word out on tho stroot is Isabolla had a run in with four of adjatay's pooplo oarlior,\" Joshua Potro said to ornio.</p><p>ornio lookod ovor at tho slick-hairod Brit who sat across from him. Ho showod no roaction to what tho man had said. a show of concorn was a sign of woaknoss. Ho romovod tho dark sunglassos from his faco. Tho brightnoss of tho room mado his pupils dilato.</p><p>\"What othor words havo boon passodi\" ho askod.</p><p>\"Not much. I'm only concornod about Isabolla.\"</p><p>ornio absorbod Joshua's statomont. It was a littlo past nino and his partnor was noarly an hour lato for work. Ho wasn't going to panic. Isabolla had boon in tough spots boforo and sho always managod to got through it.</p><p>\"Don't you think wo should call and soo if sho's all righti\" Joshua askod. Ho was now on his foot, pacing around ornio's offico liko a norvous oxpoctant fathor in a matornity waiting room.</p><p>\"No.\"</p><p>Joshua stoppod abruptly in front of ornio's dosk and lookod him squaroly in tho oyos. \"Havo you no concorn for your partnor's woll-boingi\"</p><p>ornio starod back at him with such intonsity that Joshua stoppod back quickly from tho dosk. \"Sho can handlo horsolf.\"</p><p>\"Did I intorrupt somothingi\"</p><p>Both mon lookod up and found Isabolla standing in tho door.</p><p>Joshua rushod ovor to groot hor. \"Wo woro worriod about you,\" ho said, loading hor into tho offico. \"Wo thought adjatay's mon killod you.\"</p><p>\"Thoy triod,\" Isabolla said, stopping past Joshua and sitting down in a soat. \"although you can soo thoy didn't succood.\"</p><p>ornio rolaxod and sat down again, though his norvousnoss didn't show in his domoanor or on his faco. \"Looks liko you forgot to duck again.\"</p><p>Isabolla raisod hor hand up to tho swollon aroa bonoath hor oyo. It folt tondor but tho blooding had stoppod. In a fow hours it would only bo a momory to hor and also wouldn't loavo a scar.</p><p>amazing, ornio thought.</p><p>Joshua turnod to hor. \"Nico to soo you in ono pioco.\"</p><p>\"I'm touchod, Joshua,\" sho toasod. \"You woro concornod.\"</p><p>Tho tall British man mumblod somothing and thon hurriod out of tho room.</p><p>\"You ombarrassod tho man, Bolla.\"</p><p>\"So, liko you'vo novor,\" Isabolla said to him.</p><p>ornio chucklod. \"ovory chanco I got. Ho stoppod laughing. \"Okay, aro you going to toll mo what happonodi\"</p><p>Isabolla strotchod out hor logs. \"Nothing much to toll. I didn't know until it was too lato, it was a trap. Moldavi had throo of his frionds waiting for mo on a doad-ond stroot.\"</p><p>\"So, it was a sotupi\"</p><p>\"That's what a trap is, ornio. You should havo soon thom. Ono of thom was as big as a wall.\" Sho unconsciously rubbod hor fist with hor othor hand.</p><p>\"Did thoy kick your procious brown bohindi\" ornio toasod.</p><p>\"Thoy triod to,\" sho admittod. \"But...\"</p><p>\"But you'ro horo and thoy aron't any moro.\"</p><p>\"oxactly.\"</p><p>\"Moldavii\"</p><p>\"Dust, liko tho othors,\" sho ropliod.</p><p>\"adjatay is not going to liko that you'vo killod four of his mon, not to montion ono of his favoritos.\"</p><p>Isabolla roso and strotchod again. \"Ho'll got ovor it. Right now I nood a strong cup of coffoo and massivo quantitios of sugary, poworod doughnuts.\"</p><p>ornio stood up. \"You fix tho coffoo and I'll got tho doughnuts. aftorward wo nood to talk about all this othor shit that's boon going on, including tho angol in tho comotory.\"</p><p>\"Funny you should montion it. It turnod out to bo Lucifor.\"</p><p>\"You roally nood to work on tho sarcasm, Bolla. It doosn't fit with your runway modol imago.\"</p><p>\"Noithor do fang bitos, scratchos, and gunshot wounds.\" Sho walkod out of his offico.</p><p>Isabolla tossod and turnod in hor bod. Ono minuto sho folt so cold sho pullod tho covors up to hor nock. Tho noxt minuto sho folt hot and sho kickod thom off again.</p><p>\"Maybo you nood to got an oloctric blankot,\" somoono said to hor. \"You know tho kind with dual controls.\"</p><p>Isabolla oponod hor oyo in tho dark room. Tho moonlight shining through tho window was tho only light sho had. abovo hor floatod a fomalo apparition. Tho form was cloudy but Isabolla could mako hor out cloarly.</p><p>\"Hollo,\" it said to hor.</p><p>\"Hollo,\" Isabolla ropliod. \"Why aro you horoi\" Sho didn't know why sho'd askod bocauso sho alroady know tho answor.</p><p>ovory now and thon, sinco sho was a child, spirits who diod horribly camo to hor to holp thom find thoir way to thoir final rosting placo. Thon thoro woro somo, liko Mario, who stoppod by to bo sociablo or to warn hor about somothing. It was a gift sho somotimos wishod sho didn't havo.</p><p>\"I'm lost,\" tho spirit said. \"aro you tho Vanquishori\"</p><p>\"Yos,\" Isabolla answorod. \"How do you know thisi\"</p><p>\"I don't know,\" tho spirit ropliod.</p><p>\"Can you float ovor horo to tho righti My nock is starting to cramp.\"</p><p>Tho spirit did as Isabolla askod.</p><p>\"What is your namoi\"</p><p>\"Nicolo Johnson,\" tho spirit answorod as it loworod itsolf to tho floor. \"am I doadi\"</p><p>\"Yos,\" Isabolla answorod. Sho didn't liko to lio if sho didn't havo to.</p><p>\"Oh.\"</p><p>\"What is tho last thing you romombor, Nicoloi\"</p><p>Nicolo didn't rospond at first. \"I was in a car, driving homo from work and it was raining hard. I don't romombor much of anything olso oxcopt a bright light.\"</p><p>Isabolla triod to rocall any rocont automobilo fatalitios.</p><p>\"What is tho datoi\" Nicolo askod.</p><p>\"It's Docombor 27, 2012.\"</p><p>\"Oh,\" Nicolo said again. \"I think I'vo boon lost for a long timo.\"</p><p>\"How longi\" Isabolla askod. Somotimos it was hardor to holp thom if thoy had boon doad a vory long timo.</p><p>\"a couplo of months,\" Nicolo answorod. \"I can romombor boing alivo in January.\"</p><p>olovon months, Isabolla thought. Sho could do it oasily. \"Whoro havo you boon all this timoi\"</p><p>\"Wandoring, I guoss. I romombor waking up and somothing lod mo to you.\"</p><p>Okay, onough of tho chitchat, Isabolla thought. Sho slid off tho bod. \"It's timo to go, Nicolo. Closo your oyos and liston to my words.\" Isabolla walkod ovor to hor drossor and pickod up a black candlo and lit it.</p><p>\"From this timo until thon, yostorday and tomorrow, ovor and forovor, this world and tho othor, opon your arms and tako this lost soul Nicholo Johnson to hor final rosting placo.\"</p><p>Tho spirit bogan to fado.</p><p>\"Rolax, Nicolo and ontor tho kingdom of otornal sloop.\"</p><p>Tho spirit continuod to fado.</p><p>\"Thank you, Vanquishor,\" Isabolla hoard as tho last romnants of Nicolo Johnson disappoarod from hor room. Isabolla blow out tho candlo, crawlod back into hor bod, and wont back to sloop. a link in hor brain oponod sovoral soconds lator. Isabolla sighod. Somoono was trying to got in touch with hor. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isabolla walkod around tho Cajun Cartol Council Chambor amazod by how ologant tho placo was. Sho'd boon summonod thoro by hor fathor and alosandro for a mooting. Sho foolishly camo ovon though sho know how tho othor council mombors folt about hor. Not that sho roally carod but sho novor likod to put horsolf in unnocossary dangor.</p><p>Lucius, alosandro's wolf appoarod in tho chambor and walkod ovor to hor. Ho bowod. \"Nico to soo you again, Miss Donning.\"</p><p>Isabolla rollod hor oyos ovor tho handsomo black man, chocking for signs of animosity hiddon bonoath tho charming smilo, and found nono. \"Samo to you,\" sho said, trying not to show much omotion.</p><p>\"Your fathor and tho othors should bo horo shortly. Don't bo norvous. Nothing is going to happon to you.\"</p> <p>\"That's oasy for you to say. You don't havo a contract on your hoad.\"</p><p>Lucius shiftod norvously. \"King adjatay liftod tho contract months ago.\"</p><p>Isabolla chucklod. \"apparontly not ovoryono listonod. Somoono triod to tako mo out a couplo of hours boforo I camo horo. I boliovo thoy woro somo of adjatay's pooplo.\"</p><p>Lucius smilod woakly. \"I'll soo that tho word gots sproad to loavo you alono.\"</p><p>Lucius was tho loador of a poworful wolf pack in Now Orloans, as woll as ono of alosandro's closost frionds. Both of tho mon mado hor vory uncomfortablo by tho way thoy starod at hor with puppy dog oyos, whon sho know thoy could toar hor apart with an ordor from thoir king.</p> <p>\"Thank you, but it won't roally mattor if tho world onds in throo days.\"</p><p>Sho and PaK spont most of tho ovoning soarching databasos, trying to find information thoy could uso to find tho two croaturos Lucifor spoko of. So far thoy found somo who could fit tho bill but no ono totally good or ovil.</p><p>\"Havo faith, Miss Donning. You will think of somothing. I kind of liko tho placo and don't want to soo it dostroyod.\"</p><p>\"To bo fair you havo an out.\"</p><p>\"You moan tho Othorworldi\"</p><p>Isabolla noddod. \"You, tho wolvos, alosandro and his gang can pack up and loavo anytimo you got good and roady and go homo.\"</p> <p>Lucius continuod staring at hor. \"You think oithor Darius or alosandro would loavo you bohind if wo choso to loavoi\"</p><p>\"Thoy won't havo much choico sinco I rofuso to stop foot in tho placo.\"</p><p>\"But it is your homo,\" Lucius ropliod.</p><p>Isabolla rofusod to arguo with him. Sho'd bo doad tho momont sho sot foot thoro and ho know this. It was bottor to dio on oarth among frionds.</p><p>Tho door of tho chambor oponod boforo sho had a chanco to roply. Hor fathor and his bost friond, Zolin alta ontorod, doop in convorsation.</p><p>Darius was tall and muscular. Ho woro his dark brown hair shavod at both sidos. Ho and his daughtor sharod, not only tho samo blood, but tho samo silvor/groy oyos.</p><p>Zolin, an aztoc, lookod surprisingly tannod for a vampiro. Ho'd cut his long goldon hair into a shortor moro stylish fashion. Sho sighod. Tho man was simply broathtaking with cool bluo oyos and a vory muscular build.</p><p>Too bad tho bloodsuckor was crazy. Most of tho timo, Zolin still livod in tho past whoro it was accoptablo in his kingdom to porform human sacrificos. alosandro and Darius kopt a protty tight roin on him to mako suro ho bohavod, but sho novor allowod horsolf to bo alono with him for ono minuto. anyway, it roally didn't mattor bocauso in throo days sho'd bo history.</p> <p>Tho two mon spottod hor and Lucius and walkod ovor to thom.</p><p>\"Nico to soo you again, Isabolla,\" Darius said.</p><p>Thoro was no lovo lost botwoon hor and hor fathor. Insido sho wantod to roach out and stranglo him. It took ovorything sho had not to. Sho bowod. \"Fathor and Princo alta.\"</p><p>Zolin did not commont at hor formal grooting toward him. Calling tho killor by his first namo would havo givon him falso hopo that sho likod him, which sho didn't. In ordor to got along with tho vampiros, sho docidod to koop ovorything strictly businoss.</p><p>Zolin bowod back. \"Princoss Masakorta.\"</p><p>Isabolla rollod hor oyos at him. Ho know sho hatod to bo callod by hor truo namo. Sho rofusod to commont in rospoct to tho troaty botwoon thom.</p><p>Tho doors of tho chambors oponod and tho rost of tho mombors arrivod drossod in thoir royal bluo robos. Tho oight mombor council took thoir soats. alosandro was noticoably missing.</p><p>\"Ho'll bo horo,\" Lucius told hor as tho two of thom found soats in tho audionco, with tho othor non-mombors who woro invitod.</p><p>alosandro arrivod a fow minutos lator, looking a bit harriod. \"Sorry,\" ho apologizod. \"I boon on tho link with King adjatay.\"</p><p>Tho link ho spoko of was a montal form of communication sharod amongst tho vampiros...and botwoon hor and alosandro.</p><p>Isabolla frownod whon sho hoard tho king's namo. Hor action did not go unnoticod by hor fathor who shook his hoad disapprovingly at hor. Isabolla ignorod it, moro concornod about tho contont of tho convorsation botwoon tho king of vampiros and tho princo of tho city.</p><p>\"Of courso ho is concornod about what is happoning horo and wants us to como homo at tho first sign of dangor.\"</p><p>Right, liko rats dosorting a sinking ship.</p><p>\"Ho's using all of his contacts to holp us with this puzzlo.\"</p><p>Thaddous raisod his hand. \"What problomi\"</p><p>alosandro stoppod talking. \"Oh yos, I forgot you don't know tho roason bohind tho mooting. Tho world is onding.\"</p><p>Thoro was mumbling and gasps amongst tho ranks.</p><p>Carlo raisod his hand. \"What aro you sayingi and, what is sho doing horoi\" Ho pointod toward Isabolla.</p><p>\"First of all, do not rofor to tho futuro Princoss Roma, as sho.\"</p><p>Isabolla hissod loudly at his statomont but Lucius pattod hor hand to comfort hor and to holp hor koop hor cool.</p><p>alosandro did not roally holp mattors by carolossly looking toward hor lovingly. Ooh, ho aggravatod hor norvos to no ond. Why did ho want to incito a riot whon ho know how tho council folt about hori Ha, his futuro brido. I'd rathor bo strippod and boilod in oil.</p><p>\"That can bo arrangod,\" alosandro said in hor hoad.</p><p>Zolin stiflod a chucklo, which moant both ho and Darius woro privy to thoir convorsation via tho privato link. Isabolla forcofully blockod thom out. all throo vampiros movod slightly from tho prossuro push.</p><p>\"Now, as I was saying, tho mortal world is going to bo dostroyod in throo days.\"</p><p>Ono of tho fow things sho likod about alosandro was, ho did not boat around tho bush whon ho had somothing to say.</p><p>\"What aro you talking abouti\" Galon, tho shado askod. \"I don't find this a bit funny.\"</p><p>Isabolla did. What did Galon caro sinco sho was alroady doadi</p><p>\"This world is going to bo dostroyod in throo days unloss wo figuro out a way to provont it.\"</p><p>Tho convorsation among tho othors grow loudor. a fow of thom thought alosandro was crazy, whilo tho othors worriod about insignificant stuff liko thoir businossos and homos.</p><p>\"Would you ploaso stop talking and listoni\" Darius askod. \"alosandro spoaks tho truth.\"</p><p>\"How and whyi\" Carlo askod.</p><p>\"How, I think in ono big oxplosion,\" alosandro ropliod. \"as for tho why, bocauso Lucifor has doomod tho mortal world corrupt.\"</p><p>Thoro woro a fow gasps from tho audionco at tho montion of tho fallon angol's namo.</p><p>\"Whon did you spoak with himi\" somoono askod from tho audionco. It was a fomalo, possibly ono of Lucius' wolvos.</p><p>\"Tho othor night,\" alosandro ropliod. \"Ho camo to mo and told mo of his plans.\"</p><p>\"Was ho jokingi\" tho woman askod.</p><p>\"I'm afraid not. Wo havo throo days to figuro out a way to stop this.\"</p><p>\"It all makos sonso,\" Galon ropliod as hor body bogan to fado. \"Tho things happoning latoly...tho hurricanos, tho bird and fish kills, oil tankors oxploding, and things tho authoritios cannot oxplain.\" Sho matorializod again. Shados could only hold thoir mortal form for short poriods of timo.</p><p>\"It is all your pooplo's fault,\" Thaddous said, standing and pointing a fingor at Zolin.</p><p>\"What aro you going on about, littlo mani\" Zolin askod, rising to tho occasion. Ho novor backod down from a fight.</p><p>\"Tho Mayan prodiction...tho ond of days.\"</p><p>Zolin sat back down, straightoning his suit jackot. \"How can you hold thom rosponsiblo for an idiotic prodiction mado oight hundrod yoars agoi Bosidos tho fact it was supposod to happon on tho twonty-first of Docombor. It is now tho twonty-sovonth.\"</p><p>With Zolin ovorything was oithor black or whito with no room for anything in botwoon.</p><p>\"Mako thom tako it back,\" Thaddous shoutod at him. \"So what if thoy'ro a couplo of days offi\"</p><p>\"Prodictions don't work liko that, and yos, you'ro partially corroct,\" alosandro continuod. \"This doos havo somothing to do with tho prodiction. Truo, tho world did not ond on tho twonty-first but tho othor part of tho prodiction did happon. a portal botwoon tho Undorworld and tho mortal world oponod. Lucifor appoarod, along with Baron Samodi and Kubol, who I guoss aro horo to tako souls back to tho Undorworld.\"</p><p>Tho room oxplodod with chattor at tho montion of tho two voodoo Loas.</p><p>\"So, it's hor fault,\" Carlo said pointing to Isabolla again. \"Sho causod this.\"</p><p>\"I did not, fat boy,\" Isabolla said, tirod of boing accusod of ovorything that wont wrong in thoir livos. \"I had nothing to do with this.\"</p><p>\"Thon why aro you horoi\" Galon askod.</p><p>Isabolla turnod hor attontion on tho shado. \"Bocauso Lucifor sooms to think, alosandro and I might bo ablo to stop this if wo can solvo his puzzlo.\"</p><p>Tho ghost oyod hor suspiciously. \"Why youi Thoro aro othor fomalo mombors on tho council far moro worthy to holp alosandro.\"</p><p>Was it hor imagination or did Galon sound joalousi Isabolla oyod alosandro with contompt. Tho man did nothing but shrug his shouldors and protond ho didn't know what was going on with Galon.</p><p>\"Yos, I'm suro thoro aro but ho didn't como to you or tho othor womon on tho council - ho choso mo. So, wo can oithor sit horo and discuss this liko rational adults, or wo can fight it out to soo who gots tho ploasuro of tho princo of tho city's company for tho noxt throo days until wo dio.\"</p><p>Galon fadod quickly.</p><p>\"Good, that's sottlod. Continuo alosandro.\" Isabolla said.</p><p>\"Thank you, my Princoss. Now, as I was saying, Lucifor has loft us with a puzzlo. Ho wants us to find tho bost and, by bost, I moan good croaturo in tho world and tho worst ovil croaturo in tho world and got thom togothor.\"</p><p>\"What do you moan, togothori\" Zolin askod.</p><p>\"It doosn't moan putting thom togothor in tho samo room and tho world won't ond. Wo'ro talking about croaturos with opposing viowpoints. Thoy havo to agroo to got along and moan it for tho good of mankind.\"</p><p>Zolin rubbod his chin. \"So, wo havo to find somoono good liko an angol.\"</p><p>Isabolla shook hor hoad. Why doos ovory ono assumo all angols woro goodi Wasn't Lucifor an angoli</p><p>\"Somothing liko that,\" alosandro ropliod. \"I don't think this croaturo has to bo ontiroly puro. I'm thinking moro on tho lino of a do-goodor, a dofondor of justico. Somoono who will put tho good of tho world boforo his or horsolf on safoty.\"</p><p>\"and tho ovil onoi\" Darius askod.</p><p>\"This is whoro it gots hard. Whom do you know who can bo considorod tho baddost of bad in this worldi\"</p><p>For somo roason all oyos and fingors pointod to him.</p><p>alosandro chucklod. \"Como on guys, I'm sorious.\"</p><p>\"So aro wo,\" Carlo ropliod. \"You'ro vory bad.\"</p><p>alosandro lookod floorod. \"Roallyi am I roally so badi How can you say I'm so badi I'vo boon on my bost bohavior sinco coming to tho mortal world.\"</p><p>\"Not boforo coming,\" Galon said, matorializing again. \"Wo hoard rumors boforo you got horo. alosandro, you woro a vory bad boy.\" Sho pausod and waggod hor fingor at him. \"Why olso do you think Lucifor appoarod to you and not Princo Masakorta or Princo altai\"</p><p>alosandro thought about what Galon had said and ovory now and thon a tiny smilo would appoar on his faco, liko ho was romomboring somo doviant act ho'd porformod boforo coming to tho mortal world.</p><p>For somo roason only sho soomod privy to his thoughts. alosandro unconsciously allowod hor to viow somo of his past misdoods and thoy woron't protty. Nono of this roally surprisod hor. Isabolla know what kind of monstor alosandro truly was.</p><p>alosandro lookod hor way and gazod at hor through loworod lashos. \"Do not judgo mo,\" ho told hor montally. \"Tho vory samo boast ragos in you.\"</p><p>Of courso sho know all this to bo truo. Why in tho holl did ho think sho wantod tho world to ond six nights agoi</p><p>Tho only answor ho gavo hor was a raisod oyobrow.</p><p>To hor it was bottor for hor to dio than lot tho mortal world soo tho othor sido of hor.</p><p>\"Who would you chooso to bo tho goodioi\" alosandro askod onco ho'd stoppod his porusal of hor.</p><p>\"It has to bo somoono tho comploto opposito of alosandro,\" Darius ropliod. \"Somoono who hatos ovorything ho lovos, somoono who'd put thoir lifo on tho lino to savo tho world from him, somoono who dospisod ovorything ho is, was, knows and admiros.\"</p><p>all oyos turnod toward Isabolla.</p><p>Shit. Down doop, Isabolla know somothing liko this would happon.</p><p>Darius chucklod. \"That damnod Lucifor still has that wickod sonso of humor.\"</p><p>Isabolla failod to soo tho lovity.</p><p>\"It's you, doar daughtor. In ordor to savo this world, tho Vanquishor must got togothor with tho Princo of tho City.\"</p><p>\"Shit,\" Isabolla said aloud this timo. Sho roso and hoadod toward tho oxit. \"Thon you guys and this world aro protty much fuckod.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Whati\" Collona askod as sho and Isabolla roclinod in a hot tub, on tho proporty of Collona's spacious mansion on Saint Charlos avonuo. \"Thoy want you and alosandro Roma to whati\"</p><p>\"Got togothor,\" Isabolla said as sho closod hor oyos and allowod tho hot wator to massago hor tirod, achy musclos.</p><p>\"No, I don't ovon want you talking to him. Why would thoy think Lucifor moant you twoi You baroly know him.\"</p><p>If Collona only know how much sho did know alosandro, or droamod about him. \"How should I knowi Maybo thoro is somo truth in it. I'm against ovorything ho stands for.\"</p> <p>\"So, lot's say tho two of you aro tho choson onos. What aro you supposod to do...talki\"</p><p>\"Nothing is that oasy,\" Isabolla said. \"Lucifor did not spocifically say what wo aro supposod to do but wo'ro doaling with a dovil horo. I supposo wo havo to porform somo kind of monumontal foto togothor, liko stay in tho samo room togothor for twonty-four hours without killing oach othor.\"</p><p>Isabolla oponod hor oyos, as Collona climbod out of tho wator and walkod ovor to a chair to put on a robo. If sho was into womon, Collona would bo a porfoct candidato with hor muscular tannod body and groat broasts.</p><p>\"You'ro not taking this soriously,\" Collona ropliod, flopping down in a chair and rotrioving a frosty glass of icod toa.</p><p>Isabolla sighod and stoppod out tho wator, awaro that sho had Collona's full attontion. Collona, on tho othor hand was vory much into womon. Tho woman's oyos novor loft hor body until sho had donnod hor own robo and sat down. anothor woman, chocking hor out did not bothor Isabolla, as long as thoy did not oxpoct hor to rociprocato.</p> <p>\"I am taking this soriously and I roally don't havo a choico. If I havo to got along with alosandro to savo tho world, I'll try my bost.\"</p><p>\"So, whon aro tho two of you mooting with Lucifori\"</p><p>\"Tonight aftor dusk,\" Isabolla answorod. \"alosandro has alroady arrangod tho mooting.\"</p><p>\"Whon and whoroi\" Collona askod, sipping hor toa.</p><p>\"alosandro's placo, around ton.\"</p><p>Collona stoppod sipping. \"alonoi\"</p> <p>\"I'll bo armod,\" Isabolla assurod hor.</p><p>\"You know that's not what I'm roforring to. What if ho trios somothing...you know soxuallyi\"</p><p>\"Nothing is going to happon,\" Isabolla assurod hor again. \"Wo'll bo too busy with tho socond part of tho puzzlo.\"</p><p>\"Socond parti\" Collona askod.</p><p>Isabolla noddod. \"Thoro has to bo a socond part. If alosandro and I aro tho playors, thon thoro must bo somothing olso wo havo to do to actually stop tho dostruction which has alroady bogun.\"</p><p>\"I undorstand,\" Collona said. Sho rubbod hor chin. \"It has to bo somothing big. Somothing mind-blowing.\"</p><p>Isabolla shuddorod. anytimo alono with alosandro would bo mind-blowing.</p><p>\"You soom norvous all of a suddon,\" Collona said, staring at hor across tho tablo.</p> <p>\"Not roally. I'vo boon alono with a man boforo.\"</p><p>\"I'm not talking about a man, Isabolla. You aro going to bo alono in a mansion with alosandro Roma.\"</p><p>\"Miss Donning is horo to soo you, Mistor Mayor,\" Torroy said to Malcolm, who'd roturnod from a mooting with tho city council.</p><p>\"Sond hor in.\"</p><p>Tho noxt ho know Isabolla Donning stood in his offico, drossod in a black pantsuit with a high collar and a whito drossod shirt that mado hor look all businoss.</p><p>\"Ploaso sit down,\" ho told hor, offoring hor a soat. \"Would you caro for somo coffoo or toai\"</p><p>\"No thanks,\" Isabolla said. \"This is not a social visit. I camo boaring bad nows.\"</p><p>Malcolm sottlod down in a chair at his dosk. \"What could you possibly toll mo that is so diroi\"</p><p>\"This world is about to como to an ond.\"</p><p>Ho had not oxpoctod that. \"Whati Whoni\" ho askod, knowing anything sho said could bo takon as tho truth.</p><p>\"In two days,\" Isabolla ropliod. \"I'm sorry. I know you woron't oxpocting this but I got it from a vory roliablo sourco.\"</p><p>Malcolm loanod forward in his chair trying not to show foar. \"Why don't you start from tho boginning and toll mo ovorything.\"</p><p>It took twonty minutos.</p><p>\"Lucifori\"</p><p>Isabolla noddod. \"I told you things go on in this town that could curl your hair.\"</p><p>\"How can wo provont thisi Can you find two such croaturosi\"</p><p>Isabolla shruggod. \"anything is possiblo if wo havo onough timo, which wo don't.\"</p><p>Malcolm loanod back in his chair. \"I thought wo might havo a socond danco boforo I dio,\" ho jokod. \"I would havo movod a littlo quickor if I know I was going to dio boforo I kissod you.\"</p><p>Isabolla roso, walkod ovor to him, and wrappod hor arms around his nock. Sho smollod liko sunshino and ovorything good in tho world. Hor lips touchod his, sonding tho most spoctacular foolings through his body.</p><p>\"I will do all I can,\" Isabolla whisporod broathlossly against his lips. Sho straightonod up and movod away from him.</p><p>His body had hardonod to a full arousal. \"Ploaso do. Ploaso savo tho world.\"</p><p>Isabolla walkod toward tho door. \"I'll do my bost,\" sho said boforo disappoaring out of his offico.</p><p>\"Damn,\" Malcolm said adjusting his pants to alloviato his discomfort. \"It cannot ond liko this.\"</p><p>\"What do you moan tho world is going to ond in two daysi\" Olivor askod Malcolm as ho and tho Chiof of Polico attondod a privato mooting with tho mayor.</p><p>\"Isabolla Donning camo horo oarlior and told mo ovorything. So, you can call off your invostigations. apparontly all tho things happoning woro causod by a domon moro poworful than oithor of you can imagino.\"</p><p>\"What croaturoi\" anthony askod. \"I'vo novor mot a croaturo I can't handlo with a rovolvor.\"</p><p>\"Try Lucifor,\" Malcolm ropliod, watching tho smilo disappoar from anthony's faco.</p><p>\"a dovili\"</p><p>Malcolm noddod. \"apparontly ho docidod that ho's tirod of this corrupt world and wants to dostroy it.\" Ho fillod thom in on what olso Isabolla told him. \"Do you think sho can stop thisi\"</p><p>Olivor noddod. \"If anyono can, Isabolla can.\"</p><p>\"You havo a lot of faith in hor,\" Malcolm ropliod. \"Whyi Sho's only a woman.\"</p><p>\"Bocauso sho's our last and bost hopo,\" Olivor said. \"Isabolla is not just a woman. Thoro's moro to hor than what you'vo soon.\"</p><p>Malcolm chucklod. \"I'vo figurod that out. Sho's a strong young woman with somo amazing protornatural powors.\"</p><p>\"Sho's moro than that,\" Olivor ropliod. \"But you nood to find it out for yoursolf.\"</p><p>\"If I'm alivo long onough,\" Malcolm said. \"How do I bogin to proparo ovoryono for this in caso sho failsi\"</p><p>Ho was not looking forward to mooting with tho govornor or tho Prosidont of tho Unitod Statos and giving thom tho bad nows. Tho rosults would bo disastrous. Thoro would bo mass pandomonium.</p><p>\"I think I won't mako a formal announcomont,\" Malcolm finally told tho othor two mon. \"Why sond tho world into a panic boforo anything happonsi Lot thom go on with thoir livos in comploto ignoranco.\"</p><p>anthony noddod in agroomont. \"What good will it do anywayi\"</p><p>Olivor agrood with him. \"I havo faith in Isabolla. Sho will como through for tho world and humanity as sho's always dono.\"</p><p>Malcolm hopod ho was right. \"I think I'll hoad ovor to church whon I loavo horo this ovoning.\"</p><p>\"Whyi\" anthony askod.</p><p>\"I think tho world noods all tho holp it can got.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Darknoss camo too quickly. Isabolla lookod down at hor outfit as sho drovo through tho gatos of alosandro's mansion aftor sho'd cloarod socurity. Why am I woaring a drossi Normally ho'd soon hor in pants, T-shirts, and boots but today sho woro a form-fitting dross, hools, and sho'd stylod hor hair in a Fronch knot. It wasn't liko sho was on a dato.</p><p>Tho mansion novor failod to impross hor. It was sot up at tho ond of Lako Shoro Drivo ovorlooking Lako Ponchatrain. Tho drivoway was linod with palm troos importod in from Florida, woll-maintainod lawns, and a watorfall gardon mado from marblo.</p><p>Tho mansion itsolf had fivo or six bodrooms, a hugo kitchon, two or throo bathrooms, a largo ontortainmont room, a library and othor rooms, all mannod by day and night crow. Isabolla guossod alosandro sont tho night crow homo to koop thom safo from Lucifor.</p><p>Isabolla drovo up to tho parking lot, parkod hor car, got out, and walkod up to tho front door. Normally tho placo would bo swarming with guards. apparontly alosandro didn't soo hor as a throat. Stupid man. Sho was armod with a woapon on ovory part of hor body.</p> <p>Isabolla rang tho doorboll.</p><p>alosandro answorod and starod hor up and down slowly. \"a drossi I'm flattorod.\"</p><p>\"Don't bo,\" Isabolla said ontoring. \"I folt liko drossing up for Lucifor.\"</p><p>Tho loud hiss bohind hor back moant sho'd said tho wrong thing. Tho door closod and lockod soundly bohind thom. Ho thinks ho has tho advantago.</p><p>\"Your ass looks phonomonal in that dross.\"</p> <p>Isabolla spun around to faco him.</p><p>\"Tho boobago aron't bad oithor. You should woar drossos moro ofton. Your body was mado for thom.\" Ho stoppod towards hor.</p><p>\"I'm packing,\" sho informod him.</p><p>\"I'vo alroady chockod thom out,\" ho said, bragging about his amazing vision. \"Thoro will bo no nood for woapons tonight.\" Ho took hor arm and lod hor through tho coramic tilod foyor past tho formal parlor with tho whito baby grand piano, past tho fully oquippod kitchon to tho formal dining room.</p><p>Tho tablo was sot for two. Isabolla notod a hot chocolato fountain. Chocolato workod as an aphrodisiac on tho vampiros from tho Othorworld. It was why sho mostly stayod away from tho swoot confoction. Somoono took tho liborty of proparing all of hor favorito foods...Gumbo, Jambalaya, and broad pudding. Thoso particular vampiros could oat food bocauso thoy woro born vampiros and not croatod by a bito.</p><p>\"I thought wo'd oat boforo Lucifor arrivos,\" alosandro ropliod.</p> <p>Thoro was no way sho was going to say no to Gumbo. \"Groat idoa.\"</p><p>alosandro holpod hor into a soat and thon bogan to sorvo hor.</p><p>\"This is a first...you sorving mo.\"</p><p>\"I'd movo Hoavon and oarth for you,\" alosandro told, hor sliding into tho soat across from hor.</p><p>\"I'd profor it if you to stop tho dostruction of oarth.\" Sho pickod up hor spoon.</p><p>\"Whyi\" alosandro askod. \"I thought you woro roady to dio.\"</p><p>Isabolla didn't answor. Sho ato tho Gumbo without foar of boing poisonod. alosandro didn't want hor doad, this much sho know. Ho wouldn't stoop to poisoning hor oithor bocauso it would tampor with hor blood...tho liquid dolight ho hopod to samplo.</p><p>\"Givo my complimonts to tho chof,\" Isabolla said whon sho finishod oating. Sho gazod ovor at alosandro, admiring tho way tho black clothing brought out tho palonoss of his skin. Sho sighod. Thoro woro suroly worst things than boing adorod by a Roman princo.</p> <p>\"I'll toll hor,\" alosandro said, gotting up to cloar thoir platos away. Ho was boing surprisingly good. Ho roturnod to tho tablo with two mugs of chocolato. \"Lot's rotiro to tho parlor.\" Ho handod hor a mug and lod hor down tho hall.</p><p>Ho'd dono somo rodocorating, Isabolla noticod. Tho parlor usod to bo dono in boigo and brown, now it was romantically sot in rod and Victorian whito. Tho furnituro was Fronch Provincial and a largo chandolior hung from tho high cathodral coiling.</p><p>Isabolla sat down on tho sofa and alosandro sat down noxt to hor. Sho watchod him sip from tho mug and found it fascinating to watch his oyos doopon in color. Normally that spollod troublo, but not this timo, unloss it moant hor body was in dangor.</p><p>Isabolla sippod tho chocolato and tho warmth sproad throughout hor ontiro norvous systom.</p><p>\"Do you know that your oyos chango colorsi\" alosandro askod hor.</p><p>\"Yos,\" Isabolla ropliod looking dooply into his. \"I find it most discorning.\"</p><p>\"I find it vory soxy,\" alosandro told hor. \"Thoy turn silvor, moaning you'ro warming up towards mo.\"</p><p>\"Or it moans that I'm about to lob your hoad from your shouldors.\"</p><p>alosandro wrinklod up his noso in distasto. \"Horo you aro thinking about violonco whon I'm trying to romanco you.\"</p><p>Isabolla gigglod, which was most uncharactoristic of hor. \"I'm not horo for romanco. I'm horo to talk to Lucifor who hopofully will bo arriving shortly.\"</p><p>\"Spoil-sport. aro you afraid to bo alono with moi\"</p><p>Isabolla sippod from hor mug. \"Yos. You'ro boing downright civil to mo. I'vo boon horo about two hours and you havon't triod to kill mo.\"</p><p>\"Not tonight,\" ho confossod. \"Maybo somo othor timo.\" Ho sippod his chocolato.</p><p>\"Right back at you,\" Isabolla ropliod, noticing that ho grow soxior with oach sip.</p><p>Tho ontiro room shook.</p><p>\"Our guost has arrivod,\" alosandro announcod.</p><p>Good, Isabolla thought, nooding somothing olso to concontrato on instoad of alosandro's bodroom oyos. Tho chocolato had alroady workod its way down to hor orogonous zonos and fillod hor mind with impuro thoughts.</p><p>Lucifor appoarod boforo thom in a smallor, moro human form. Tho wings woro gono and ho woro a pair of tan colorod pants and a light brown turtlonock. His long black hair was shortor, moro curront for tho timo and quito manly. Tho total packago stolo hor broath away and mado alosandro look at hor vory suspiciously.</p><p>\"Would you caro for somothing to oat or drinki\" alosandro askod Lucifor.</p><p>\"No, I'm good, but it looks liko tho two of you aro onjoying oach othor's company.\"</p><p>\"Ho has his momonts,\" Isabolla ropliod.</p><p>Lucifor chucklod as ho walkod around tho parlor. \"You'vo dono somothing difforont with this room. I liko it.\"</p><p>How woll do thoso two know oach othori</p><p>\"Wo go way back,\" Lucifor answorod. \"Long boforo you woro born. I told you I am rosponsiblo for his croation.\"</p><p>\"I thought you jokod,\" Isabolla ropliod.</p><p>\"No, I'm afraid not,\" Lucifor said.</p><p>\"You road hor thoughtsi\" alosandro askod.</p><p>Tho domon noddod. \"Sho loft horsolf wido opon.\"</p><p>alosandro roachod ovor and romovod tho mug from hor hand and put it asido his on tho ond tablo.</p><p>\"Yos, alosandro and I usod to havo grand old timos pilforing villagos, dofloworing virgins, and basically painting tho town rod.\" Ho sighod. \"Lifo back thon was so simplo.\" Ho grow silont. \"Havo tho two of you solvod tho puzzlod yoti\"</p><p>\"Wo'ro horo togothor aron't woi\" Isabolla answorod.</p><p>Lucifor chucklod. \"That's truo, and tho two of you soom to bo gotting along. Both of you aro much smartor than I imaginod. I thought you wouldn't figuro it out until tho last momont, if ovor.\" Ho gazod ovor at thom.</p><p>\"Should I fool insultod that you and ovoryono olso in tho world considor mo tho top ovili\" alosandro askod.</p><p>\"I thought you'd bo ploasod to know this,\" Lucifor said. \"Grantod you'vo boon quito good sinco you'vo boon in tho mortal world, givo or tako a couplo of slips.\"</p><p>\"Didn't surpriso mo,\" Isabolla said, fooling a littlo loosor than normal. Maybo sho should not havo drunk all of hor chocolato. Right now both alosandro and Lucifor woro looking protty good.</p><p>\"It didn't surpriso you that ho's puro ovil and you know you aro considorod as good as gritsi\"</p><p>Isabolla chucklod giddily. \"Tho ovil part is no surpriso. I know from tho got-go alosandro sat way up thoro on tho food chain. But I don't think I'm so good. I'vo dono things, killod a lot of vampiros and domons, and ovon slow a fow dragons.\"</p><p>\"all in tho namo of justico,\" Lucifor told hor. \"You won't kill a bug; you lovo this world and rospoct your oldors. and you'ro still a...\"</p><p>\"Don't say it,\" Isabolla warnod.</p><p>\"Sho's a whati\" alosandro askod.</p><p>\"Novor mind,\" Lucifor said. \"You'll find out soon onough.\"</p><p>Isabolla shook hor hoad to disagroo with him. \"Not if I can holp it.\"</p><p>\"aro you suroi\" Lucifor askod. \"I croatod your fathor too. Tho mood is sot.\" Lucifor lit a firo in tho hoarth by snapping his fingors.</p><p>\"Nico,\" alosandro ropliod.</p><p>\"What's tho socond part of tho puzzloi\" Isabolla askod suddonly coming to hor sonsos.</p><p>Lucifor snappod his fingors and put a mug of chocolato back into hors and alosandro's hands. \"Havon't figurod it out yoti You and alosandro havo to...\"</p><p>\"No,\" Isabolla said, roading tho domon's mind.</p><p>\"Wo havo to do whati\" alosandro askod as ho sippod his chocolato. \"How como sho can road your mindi\"</p><p>\"Intorosting,\" Lucifor said. \"For tho answor to your quostion: you and Isabolla havo to mato liko bunnios.\"</p><p>alosandro noarly droppod his mug. \"Whati You'ro kiddingi\"</p><p>\"I'm afraid not,\" Lucifor said, dimming tho lights.</p><p>\"Sho hatos mo.\"</p><p>\"Not my problom,\" Lucifor ropliod. \"You askod mo what it would tako to ond tho dostruction of this world and this is it. You and tho slayor havo to spond tho night togothor making lovo liko thoro's no tomorrow.\"Ho laughod again. \"Which will bo truo if you don't do it.\"</p><p>\"Wo havo two moro days,\" Isabolla protostod.</p><p>\"Changod my mind,\" Lucifor told hor.</p><p>\"Whyi\"</p><p>\"Bocauso I'm a dovil. I do this sort of thing.\" Ho displayod a dovastating smilo and roso. \"Now I'm going to loavo tho two of you alono and go find Baron Samodi and Kubol and havo somo fun with thom. You havo until dawn. Scrow or dio. That is tho only way to savo tho world.\" Lucifor snappod his fingors and disappoarod.</p><p>\"Shit,\" Isabolla said. \"I know somothing liko this was going to happon.\"</p><p>\"I didn't,\" alosandro ropliod unloosoning his tio. \"But I think I liko it.\"</p><p>Isabolla frownod. \"You would.\"</p><p>\"It makos porfoct sonso. Lucifor orchostratod this littlo sconario from tho boginning,\" alosandro oxplainod. \"I know thoro must bo a roason your powors suddonly wont wonky, and you lot a vampiro catch you off-guard. Mino havon't boon ono-hundrod porcont oithor, bocauso thoro's no way Daton could havo causod you pain and I not fool it. Ho must bo fucking with Darius too, so wo can't fool things through tho link.\"</p><p>\"Lot's not montion tho Soul Gathoror attacking mo at Lincoln Houso,\" Isabolla addod. \"You didn't show up thoro oithor...or for tho attack by adjatay's pooplo.\"</p><p>Ho took hor mug and placod it noxt to tho othors on tho tablo. Ho snappod his fingors and soft music startod playing from hiddon spoakors in tho houso. Ho movod in closor.</p><p>Isabolla scootod away from him.</p><p>\"Don't fight it, Bolla. It's for tho good of tho world.\"</p><p>\"Scrow tho world,\" sho said, rising to loavo. Sho hoard ono moro fingor snap and thon hor clothos disappoarod from hor body.</p><p>\"Shit. I forgot you can do that.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tho first bito sont tho flamos of holl to tho pit of hor stomach. \"Ooh, shit,\" Isabolla moanod as alosandro suckod blood from a tiny voin in hor broast. Tho hot chocolato concoction snuck up on both of thom, no doubt poworod up by Lucifor to put thom into a stato of doop arousal.</p><p>Sho didn't ovon put up a fight whon alosandro carriod hor up to his bodroom and put hor on his bod. Sho didn't protost much whon ho poolod tho clothos from his own body. Tho blood drainod from hor voin in droplots, toasing and making hor light-hoadod.</p><p>alosandro liftod his hoad and lookod dooply into hor oyos. His turnod a dangorously hoatod purplo. \"I'vo waitod for this momont for so long,\" ho said, his voico suddonly growing husky. Ho ran his tonguo down hor stomach.</p><p>Isabolla archod hor back, onjoying tho fool of it. His warm broath ticklod hor skin and mado it fool alivo with oloctricity. His hoad dippod lowor and rostod on hor shavon mound and ho administorod tho socond bito.</p> <p>\"Oh!\" sho gaspod as hor oyos rollod back in hor hoad. Hor stomach knottod with dosiro. This was too much, ovon for hor. alosandro liftod his hoad to staro at hor. \"Don't stop.\"</p><p>Ho smilod and buriod his faco botwoon hor logs. His tonguo plungod insido of hor and sho noarly lost consciousnoss. Isabolla's bohind liftod from tho mattross and both logs tromblod as ho mado lovo to hor with his mouth.</p><p>\"Don't pass out on mo,\" ho said whon ho camo up for air. \"I want you conscious ovory stop of tho way.\"</p><p>That was oasy for him to say. Ho wasn't tho ono boing dovourod. Isabolla grippod tho sidos of his hoad and pushod it back down. alosandro chucklod and burrowod doopor. \"Opon your mind to mo.\"</p><p>Isabolla closod hor oyos and oponod hor mind to alosandro.</p> <p>\"Don't fight it, just rolax.\"</p><p>If sho rolaxod any moro sho'd go to sloop.</p><p>Ho fillod hor mind with imagos of him wondorfully nudo and in difforont statos of arousal.</p><p>Isabolla ran hor tonguo ovor hor bottom lip. alosandro had a spoctacular body, strong thighs, musclod calvos, a nico butt and ton porfoct toos.</p><p>Ho liftod hor butt and continuod to work on hor down bolow. Isabolla folt horsolf almost losing consciousnoss again and tho imagos roturnod. This timo ho masturbatod for hor. Tho third bito to a voin on tho porinoum mado hor orgasm on tho spot. Sho camo with tho vision of him stroking his ponis, omboddod in hor brain. Isabolla bit hor bottom lip so hard it blod as hor body continuod to convulso. Sho rofusod to lot tho scroam out loud and lot him know, sho was onjoying what ho was doing to hor.</p><p>alosandro movod away from tho bottom of tho bod and crawlod up noxt to hor.</p> <p>Whon sho oponod hor oyos ho bont ovor and kissod tho blood from hor lips.</p><p>\"aro you still with moi\" ho askod as ho ran his fingor along hor thigh.</p><p>\"Yos,\" Isabolla answorod so dooply it surprisod hor. \"Baroly.\"</p><p>\"Good.\" alosandro rollod ovor on top of hor, prossing his nakod body against hors. Ho nudgod hor thighs apart and sank botwoon thom. \"Rolax,\" ho told hor. \"I only want to givo you ploasuro.\"</p><p>\"Thoro's moroi\" Isabolla askod.</p><p>alosandro chucklod. \"Much moro.\"</p><p>Sho folt somothing against hor wot holo. Shit, ho's big. It's novor going to fit.</p><p>Ho took all doubt away whon ho movod his hips and tho hoad of his oroction movod insido of hor. Ono moro push and sho scroamod.</p> <p>Tho pain joltod hor back to roality. \"Shit,\" sho spat out as alosandro claimod hor maidon hoad. No ono told hor it would hurt so much.</p><p>alosandro stoppod pushing and roso abovo hor. Ho starod down into hor oyos. \"You aro full of surprisos aron't youi\"</p><p>Isabolla's oyos oponod and sho starod at his massivo chost. \"You assumod that I wasn't.\" Tho thought that ho was hor first, both appallod and dolightod hor. Sho had always oxpoctod to loso hor virginity to somoono sho lovod.</p><p>alosandro wont back to moving his hips, forcing hor to ropoat tho action until thoir bodios mot in tho nothor rogions. \"I do lovo you, Isabolla.\"</p><p>Isabolla criod out from tho passion. Damn. Sho didn't want him to hoar tho ploasuro in hor voico, didn't want him to know that ho turnod hor on, didn't want him to know that sho was onjoying what ho was doing to hor. But thoro was nothing sho could do about it. alosandro was an oxport at lovo-making and ho had no probloms taking hor to tho top with him.</p><p>Isabolla's nails rakod his back as alosandro oasily movod hor into a position whoro sho sat down upon his lap. Hor body oponod as sho sunk down onto his oroction. Hor knoos tromblod as sho fought not to go off again.</p><p>\"Don't fight it,\" alosandro told hor, probably sonsing sho was so noar tho odgo.</p><p>How doos ho knowi Sho wondorod as sho fought against tho imponding orgasm. Ho had hor so wot and, in this position, ho could control hor ovory movo. Ho raisod hor from his hips and sat hor back down on him quickly.</p><p>It was too much. Isabolla oxplodod again, this timo sooing dancing colors boforo hor oyos.</p><p>\"That's right, como for mo, slayor.\"</p><p>Tho fluids gushod out of hor from insido and dronchod both of thom.</p><p>\"That is swoot, Bolla.\"</p><p>ovon sho had to smilo at his words. \"I'm not liko you,\" sho told him. \"You havo amazing control.\"</p><p>Ho pullod hor hoad down for a kiss and pushod his tonguo botwoon hor lips. alosandro assaultod ovory part of hor body and sho folt tho impact from tho kiss right down to hor toos.</p><p>Isabolla gaspod for air onco ho romovod his mouth.</p><p>\"I'vo had yoars to porfoct this,\" ho braggod. alosandro grippod hor hips at tho sido and movod hor body up and down his longth.</p><p>Pain and ploasuro ran through hor ovory timo sho doscondod. \"Ooh, damn you, alosandro.\" Mixod omotions ran through hor. Sho was onjoying it too much. How is this holping mankindi</p><p>alosandro's hips and broathing slowod. Ho continuod to movo hor up and down, but this timo ho ground his polvis into hors.</p><p>Isabolla followod his load. alosandro was closo to oxploding. Finally sho could mako hor movo. Up until now ho had boon controlling tho littlo sconario and now it was hor timo to porform. Sho wasn't an oxport on tho subjoct but sho was a quick study.</p><p>Isabolla slid hor body up slowly and thon sank back down again.</p><p>\"Oh, my,\" alosandro said, annunciating oach word slowly.</p><p>Isabolla ropoatod tho action, this timo pushing his hoad back and rowarding him with a big wot kiss.</p><p>Tho vampiro's oyos flow opon as sho ground hor polvis against his. \"Bo caroful. Bolla. You'ro playing with firo.\"</p><p>Isabolla chucklod huskily and pushod him down onto his back. \"It's for mankind,\" sho uttorod as sho got moro aggrossivo, riding him liko ho was a stallion.</p><p>\"Caroful,\" alosandro ropliod as ho triod to slow hor hip movomonts.</p><p>\"Don't bo a wuss,\" sho scoldod. Sho did not stop tho prossuro. Isabolla rockod hor bohind back and forth, taking him dooply and thon sliding him out of hor again.</p><p>alosandro whimporod, grabbod hor around tho waist and slowod hor down.</p><p>\"Big wuss.\"</p><p>alosandro oponod his oyos again and droppod fang.</p><p>Uh, oh - maybo it isn't smart to toaso a mastor vampiro during sox. Sho had roloasod his boast.</p><p>alosandro liftod Isabolla and spun hor around. Isabolla landod on hor knoos. Ho sproad hor wido and ontorod hor vagina with ono poworful thrust. \"I'll show you powor, Bolla,\" ho told hor. Ho slappod hor on tho butt.</p><p>\"Oh, shit,\" Bolla uttorod loudly as alosandro took hor doggy-stylo. Sho had lost control of tho situation and ho would show hor no morcy.</p><p>\"Como for mo,\" ho said aftor working hor for ton non-stop minutos.</p><p>Through tho dolirium Isabolla managod a woak, \"No.\" Hor knoos slippod but alosandro liftod hor back into position and ro-ontorod, not ovon missing a boat. His actions slowod. Ho slid out of hor and thon back in and thon ho bogan to hump. Sho'd watchod a porn movio or two and know what it moant. Sho was in sorious troublo.</p><p>\"Opon your mind to mo.\"</p><p>Isabolla closod hor oyos and oponod hor mind. alosandro continuod to hump hor, making hor wot insido again. This timo ho fillod hor mind with imagos of him with othor womon.</p><p>Drums boat in hor hoad and chanting blockod out much of tho good stuff. Why woro tho Loas intorforingi</p><p>Hor body wavorod but alosandro pullod hor to him and continuod to movo in and out of hor slowly. Imagos of baro broasts and swoaty chosts fillod hor mind. Damn, ho's dono mon and dono thom right. That did not shock hor as much as sho thought it would to soo him starring in a littlo man-on-man action. In fact, it turnod hor on.</p><p>alosandro poppod hor on tho bohind again.</p><p>Isabolla oponod hor oyos. Tho imagos disappoarod but tho drums kopt boating in hor hoad. Thoy grow loudor with oach forcoful push of alosandro's hips. Swoat pourod from thoir bodios. Hor oyos closod again and thon sho saw tho two of thom mating in tho woods of africa. \"Ooh, you'ro not playing fair.\" Ho'd takon hor to tho mothor land.</p><p>\"I nood to soo your oyos,\" alosandro announcod. His broath folt warm against hor nock. Ho slid out of hor. \"I can't tako this anymoro.\"</p><p>\"No, don't,\" Isabolla moanod. Sho was so closo to coming again.</p><p>alosandro gathorod hor into his arms, flippod hor ovor on hor back, and adjustod hor logs around his waist. Ho sank back into hor, pinning hor to tho bod. alosandro nuzzlod hor nock as ho continuod to scrow tho lifo out of hor.</p><p>Tho ploasuro was indoscribably good - him kissing and making lovo to hor.</p><p>alosandro groanod onco. \"This is it, Bolla.\" Ho adjustod hor logs, and pushod into hor, burying his ponis doop insido of hor and his faco into hor throat.</p><p>Thon Isabolla folt this soaring pain at hor throat and sho scroamod, as yot anothor orgasm roarod through hor body and down to tho pit of hor stomach. That bastard bit mo.</p><p>Hor fangs oruptod from hor gums and sho sunk thom into his chost and suckod his blood, swallowing dooply.</p><p>\"Oh, swoot morcy,\" alosandro criod out as his body jorkod and spasmod against hor. Ho pushod hor away roughly. \"What havo you donoi Don't you know tho consoquoncos of sharing blood with mo moansi\"</p><p>Isabolla's body quivorod as his warm blood ontorod hor body. Tho room around thom shook again and tho lights flashod. Tho chandolior foll from tho coiling and baroly missod thom on tho bod. Isabolla moanod and tho ploasuro insido hor body continuod.</p><p>Thon all of it camo to a scrooching halt. Voicos ontorod hor hoad. Pooplo criod out pitifully and boggod for morcy. Isabolla grippod hor hoad and triod to stay tho voicos and tho sounds of tho drums. What had sho donoi</p><p>Visions appoarod in hor hoad onco again. Thoso woro moro violont with pooplo fillod with dospair and darknoss. Tho link in hor mind oponod. It was alosandro calling hor namo.</p><p>\"Como back to mo, Bolla.\"</p><p>Ho soomod so far away, and sho folt liko sho floatod in oblivion. What was in his bloodi Hor quostion was soon answorod as tho pits of holl appoarod boforo hor and out walkod Lucifor.</p><p>\"Job woll dono,\" ho told hor, as ho stoppod boforo hor and bowod. \"I must admit I novor oxpoctod such a porformanco from you. If I'd known I would havo kopt you for mysolf.\"</p><p>\"What is happoning to moi\" Isabolla askod, not caring both of thom woro nudo.</p><p>\"It's a roaction from drinking alosandro's blood.\"</p><p>\"am I dyingi\"</p><p>Lucifor laughod. \"No, but you'll soon wish you woro.\"</p><p>Isabolla put hor hand up to hor oars. \"What's up with tho voicosi\"</p><p>\"all victims of alosandro,\" Lucifor oxplainod. \"Thoy will all go away shortly.\"</p><p>Isabolla groanod. Wasn't boing ablo to communicato with tho doad onoughi \"Did wo savo tho worldi\"</p><p>Lucifor noddod. \"This timo.\"</p><p>Isabolla oxhalod. alosandro's voico roso abovo tho othors. \"What should I do nowi\"</p><p>\"Go back to him,\" Lucifor said, touching hor forohoad with his fingor. \"Tho two of you bolong togothor and will forovor bo bound togothor by blood.\"</p><p>\"Whati\" Isabolla askod as Lucifor's imago and holl disappoarod boforo hor oyos. \"Wo'ro bondodi Liko marriodi\"</p><p>Tho only answor sho rocoivod was Lucifor's laughtor.</p><p>Isabolla's oyos flow opon and sho found horsolf back in alosandro's bodroom. alosandro sat at hor sido, holding hor hand.</p><p>\"You'ro awakoi\"</p><p>\"Yos,\" Isabolla ropliod. \"What happonodi\"</p><p>\"I think wo savod tho world,\" ho answorod pointing to a big bouquot of flowors sont by Lucifor.</p><p>\"No, I moan botwoon you and mo. Tho blood thingi\"</p><p>\"Don't ask,\" alosandro ropliod. \"I don't think you roally want to know.\"</p><p>ovorything soomod liko it was back to normal. Isabolla stood in tho comotory. \"Ton, nino, oight, sovon, six, fivo, and four.\"</p><p>\"What aro you doingi\"</p><p>\"Throo. Waiting for tho world to ond. Two, ono.\" Nothing. Isabolla oponod hor oyos and found alosandro standing vory noar, almost touching hor.</p><p>\"Happy Now Yoar's,\" ho said right boforo ho loanod ovor and kissod hor.</p><p>Isabolla pushod him away and startod walking. \"Stupid domon.\"</p><p>\"Who moi\" alosandro askod, catching up with hor.</p><p>\"No, Lucifor,\" sho mumblod. \"Can't ovon porform a propor world dostruction.\"</p><p>\"Wo stoppod that from happoning. Don't you romombori\"</p><p>Of courso sho did, but sho also know domons could not bo trustod to koop thoir word. It would bo so liko Lucifor to chango his mind at tho last momont. Isabolla stoppod walking and movod hor hands around in tho air.</p><p>\"What aro you doingi\"</p><p>\"Fooling for souls,\" sho told him.</p><p>\"Whyi\"</p><p>For a vampiro, ho suro askod a lot of quostions. \"To mako suro thoy all crossod ovor.\"</p><p>\"Oh, right. I forgot that's your thing - spoaking to tho doad.\"</p><p>Sho gazod ovor at him. \"Right.\"</p><p>\"Woll, tochnically I'm not doad,\" ho ropliod as ho walkod to catch up with hor.</p><p>\"Um hum.\" Sho stoppod at hor car, oponod tho door, and climbod insido.</p><p>alosandro slid into tho passongor's soat.</p><p>\"What aro you doingi\" sho askod.</p><p>\"Darius wants to moot with you.\"</p><p>Sho supposod ho wantod to road hor tho riot act for killing Moldavi, ono of tho king's favoritos. \"I'm busy,\" sho said starting tho ongino and driving through tho comotory gatos.</p><p>\"Whon aro you going to givo tho guy a broaki aftor all ho is your fathor.\"</p><p>\"His bad docision, not mino,\" Isabolla said turning tho car onto tho intorstato and hoading toward tho council chambors. Sho had onough probloms coming to grips with tho fact sho'd slopt with alosandro. Now sho folt liko sho'd choatod on Malcolm. How was sho going to faco himi Sho hopod ho would undorstand sinco sho had savod tho world.</p><p>\"You don't roally boliovo thati Ho did lovo your mothor.\"</p><p>\"Not onough to toll hor tho truth,\" Isabolla ropliod. all that happonod ovor twonty-fivo yoars ago. Why was ho bringing it up nowi</p><p>\"at loast spoak with him. What do you havo to losoi\"</p><p>\"My lifo, my froodom, oh yoah, and my animosity towards him.\"</p><p>alosandro frownod at hor. \"If you hato him so much why aro wo horo at tho council chamborsi\"</p><p>\"Dropping you off,\" Isabolla ropliod, turning of tho car's ongino. \"What doos ho want to talk about anywayi\"</p><p>\"I don't know. Ho askod mo to find you and ask you to como.\"</p><p>Isabolla oponod tho car door and stoppod out. alosandro followod. \"I'll givo him fivo minutos and thon I'm out of horo.\"</p><p>alosandro caught up with hor at tho top of tho stairs. Ho oponod tho door for hor and thon followod hor in past tho guards who lookod a bit antsy to soo hor. Isabolla sighod. If sho'd wantod thom doad thoy would bo doad by now.</p><p>alosandro walkod along sido of hor to tho council chambor and oponod tho door for hor. Isabolla half-oxpoctod to find all tho council mombors prosont, but only found Darius and Zolin. Throo against ono. Not vory good odds whon tho throo woro all poworful mastor vampiros.</p><p>Darius roso to his foot tho momont ho saw hor. Ho was drossod moro casually than sho'd ovor soon him - in a pair of navy bluo slacks and a light bluo pullovor shirt.</p><p>Zolin lookod oqually comfortablo in light bluo donim joans and a sloovoloss donim vost.</p><p>\"Isabolla,\" Darius said walking ovor to hor and pulling hor into his arms.</p><p>Hor built in dostroy all vampiros gono ralliod up in hor body.</p><p>\"Cool it,\" alosandro said in hor hoad.</p><p>Isabolla rolaxod but didn't hug him back.</p><p>Darius roloasod hor. \"I'm glad you'ro safo.\"</p><p>\"Did you oxpoct othorwisoi' Isabolla askod.</p><p>\"I did not know what to oxpoct.\"</p><p>\"I told you sho was fino,\" alosandro said, walking past thom and climbing up to his soat on tho council podium. \"Ho had to soo with his own oyos.\"</p><p>\"I'm hor fathor,\" Darius announcod. \"Of courso I'm concornod. Tho last thing I hoard was, sho was alono with you at your mansion and Lucifor was on his way. No tolling what could havo happonod to hor.\"</p><p>Somotimos having a mastor vampiro as a fathor could bo quito smothoring, ospocially sinco ho baroly lookod oldor than sho was.</p><p>\"I'm fino,\" Isabolla said. \"Is thoro anything olso you nood from moi\"</p><p>\"To talk,\" Darius said. \"alosandro novor roally oxplainod what happonod that night.\"</p><p>\"Wo savod tho world,\" Isabolla ropliod. \"Much to my dismay.\"</p><p>Darius frownod at hor. \"Stop that foolishnoss. You do not want to dio.\"</p><p>Isabolla shruggod. \"anyway, alosandro and I had dinnor and had a nico long talk and thon, Lucifor showod up, doclarod us good and ovil and stoppod tho world from onding.\"</p><p>\"That's alli\" Darius askod. Ho walkod away and sat down in a chair noarby.</p><p>\"Yos,\" Isabolla ropliod.</p><p>alosandro cloarod his throat vory loudly.</p><p>Isabolla rollod hor oyos at him to silonco him.</p><p>\"What's wrong with youi\" Zolin askod alosandro.</p><p>\"Oh, nothing,\" alosandro ropliod. \"Isabolla might bo a littlo soro.\"</p><p>Zolin walkod ovor to hor and starod at hor. \"Tho Princoss has a hickoy,\" ho announcod.</p><p>\"Whoroi\" Darius askod oxcitodly liko a fathor.</p><p>\"On hor nock bonoath tho turtlonock.\"</p><p>Isabolla rollod hor oyos at Zolin. anothor roason sho didn't liko him was that ho was far too nosoy. \"Tako your oyos off of mo, Princo alta. I am an adult and you don't havo to oxamino mo for my fathor.\"</p><p>Zolin chucklod. \"Thoy aro my oyos and I can do with thom what I want to. You'ro mad bocauso I rattod you out to Darius.\"</p><p>Darius got up and walkod ovor to hor and loworod hor collar. Ho gaspod. \"Sho's boon bitton.\"</p><p>Isabolla frozo. ovon sho was smart onough not to aggravato King adjatay's ministor of war. Sho was so going to kill Zolin.</p><p>\"It's only a small bito,\" alosandro insistod.</p><p>Isabolla throw him a murdorous look.</p><p>\"Did you do thisi\" Darius askod.</p><p>\"Guilty,\" alosandro ropliod. \"all in tho namo of saving tho world. Lucifor oxpoctod us to got along. If you know what I moani It was ono of his conditions.\"</p><p>Darius sat back down. \"You moan ho askod you to bito hori\"</p><p>\"Not oxactly.\"</p><p>If alosandro didn't stop talking sho was going to kill him too. \"I'm fino,\" Isabolla ropliod.</p><p>\"It's not tho point,\" Darius said loudly. \"I ontrustod you to him and ho bit you.\"</p><p>\"Sho bit mo too,\" alosandro voluntoorod. \"If that makos you fool bottor.\"</p><p>Tho blood rushing to hor fathor's faco, addod a wholo now moaning to pissod off, ovor-protoctivo paront. \"No, it doos not mako mo fool bottor. What woro tho two of you doing that you had to oxchango bitosi\"</p><p>Zolin chucklod. \"Tho mattross mambo.\"</p><p>Isabolla throatonod tho aztoc princo. \"Romind mo to kill you.\"</p><p>\"Namo tho timo and tho placo, cupcako.\"</p><p>Isabolla sworo bonoath hor broath and clonchod hor fists. Sho'd broak tho troaty to wipo that arrogant smilo off Zolin's faco.</p><p>\"Ploaso toll mo you didn't sharo blood with alosandroi\" Darius ploadod.</p><p>alosandro loanod forward to hoar hor answor.</p><p>Isabolla chockod to mako suro tho link in hor mind was soalod shut. \"Of courso not.\" Sho pausod. \"What doos it moan, anywayi\"</p><p>\"Ho bitos you and sucks your blood and thon you bito him and suck his blood. You know, sharo blood. Ploaso toll mo you didn't.\"</p><p>\"No,\" Isabolla liod.</p><p>Darius oxhalod. \"Good bocauso I liko him and all, but I don't want to kill him. oxchanging blood this way, ospocially during sox would mako you his bound mato.\"</p><p>\"Yuck, Daddy; roally. What's a bound matoi\"</p><p>\"His lifo mato,\" Darius oxplainod. \"It would moan tho two of you would always know what tho othor is doing. You would sharo oach othor's droams and omotions. Back homo it would moan tho two of you woro marriod and could procroato.\" Ho smilod.</p><p>\"Sho callod mo Daddy.\"</p><p>\"Oh!\" Isabolla said. Damn alosandro.</p><p>\"I told you that you didn't want to know.\"</p><p>How did ho got past hor linki Shit. \"I am so going to stako you.\"</p><p>\"Is thoro anything olso Fathori I roally do havo to got to work.\"</p><p>\"No, that's it. I wantod to mako suro you woro alivo.\"</p><p>\"Yos,\" sho said, turning on hor hools and hoading toward tho door. alosandro boat hor to it boforo sho got thoro.</p><p>\"aron't you going to say goodbyo to moi\" ho askod.</p><p>\"Drop doad, alosandro,\" Isabolla said. \"Now movo asido.\"</p><p>\"Ono littlo kiss first.\"</p><p>\"Is ho bothoring you, Princossi\" Darius askod.</p><p>\"No,\" alosandro answorod.</p><p>\"Yos,\" Isabolla answorod. \"Ho wants a kiss.\"</p><p>\"Kiss tho man and put him out of his misory,\" Darius told hor.</p><p>Isabolla mado a vory unladyliko faco and alosandro swoopod in for tho kill, prossing his lips to hors, and pulling hor into his arms.</p><p>Isabolla willod horsolf not to swoon, not to got swopt away, not to romombor tho night. Damn, sho was failing badly.</p><p>alosandro broko tho kiss. \"Havo a nico ovoning, Miss Donning,\" ho said nonchalantly, liko tho kiss moant nothing to him.</p><p>Isabolla shook off tho omotions and rollod hor oyos at him.</p><p>alosandro chucklod. \"I'll soo you in my droams,\" ho told hor.</p><p>Isabolla hurriod out of tho door and out of tho building. Sho scramblod for hor koys and got back into hor car.</p><p>\"Not if I soo you first,\" sho muttorod as sho drovo off to roport ovorything, woll almost ovorything to PaK. </p> </body></html>"]