["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Seth Jackson sighed in resignation as he ended his conference call with the management team of the Oceanix Resorts. He swiveled his chair so that he was facing the wall of glass behind him. The Atlantic Ocean sparkled in the hot July sunshine as crowds of tourists lined the beaches below. Some days it was torture sitting in the office in a suit while looking down upon nothing but bikinis and swim trunks. That was one of the hard things about living and working in a resort town. Sometimes, or in his case, most of the time, work came first. Knowing it was pointless to delay; he spun his chair back to his desk and signed his name to the bottom of the contract from Danvers International. It wasn’t that he had a problem with the company itself, because they were the best there was in the communications field. But now whenever he thought of Danvers, he thought of Beth Denton and their last date together. That was probably one of the most surprising and awkward moments in his dating life.</p><p>His best friend, Brett, had been going through a rough time since his girlfriend had ended their long-term relationship. Brett was a relationship kind of guy and he was desperate to find someone new to fill the void that Becka’s departure had left behind. One night after multiple rounds of drinks, Seth had agreed to try out a local dating service with Brett. He really hadn’t intended to do anything other than pay his enrollment fee and go through the motions until Brett found someone. When he had run across Beth’s profile on the computer, he had been more than a little interested. She was beautiful and sounded like someone he would have a lot in common with. He had asked her out that same day and had been very impressed on their first date. They had gone out a few more times and had even progressed to some hot goodnight kisses before she had suddenly gone AWOL for a few months. When she finally returned his call and accepted another date, he had been excited and ready to move the relationship forward until the dinner discovery.</p><p>He had met Beth at Sara J’s, one of his favorite seafood restaurants in Garden City Beach, South Carolina. When she had walked in, he thought she looked different. He knew it was probably a bit crude, but she had the look of a woman well fucked. During their initial dates, she was always a tad reserved and obviously nervous, but on that night, she had seemed more confident in herself and her sexuality. He was pretty sure at that point what had been occupying her for the past few months, but maybe that was over since she had accepted his dinner invitation.</p> <p>They had just settled at their table with the conversation flowing easily when a man had approached their table. It was obvious that he knew Beth. He suspected from their body language that they had been intimate. He had been surprised when the introductions were made. He had heard of Nick Merimon. Hell, Myrtle Beach was a small town where you either personally knew or knew of most everyone in the business circles. He had heard that Danvers International had merged with Mericom, which had been owned by the Merimon family. He knew Jason Danvers socially and had met Gray Merimon, Nick’s brother, on a few occasions. Nick’s reputation as a ladies’ man preceded him. Even though they both worked for Danvers, he wouldn’t have suspected a personal connection between Nick and Beth. They seemed to be complete opposites. He actually found himself feeling a little sorry for Beth. He was afraid that she had probably been seduced and dumped. He, of course, would be happy to swoop in and give her the support she needed to move on. He wasn’t looking for long-term so he was happy to be her rebound guy if needed.</p><p>He had barely had time to relish that thought when things had gone wildly off course. He had asked Beth how she knew Nick and she had said that they worked together. Nick had added that they lived together and that they were having a baby. He had actually been tempted to laugh at first, sure that this was some kind of bad attempt at humor on Nick’s part. When he took a closer look at Beth’s face though he had known it was true. What he didn’t know was why in the hell she had accepted a date with him. He wasn’t one to judge, but come on. How many pregnant women who clearly have some type of relationship with the father are actively dating through a dating service?</p><p>With Nick still standing at their table, he had left the restaurant at barely less than a run. He had been pissed. He had no idea if Nick and Beth had left together and he couldn’t have cared less at that point. He couldn’t help but feel like he had been some pawn in whatever game Beth was playing with Nick Merimon. To her credit, she had left a message on his voicemail the next day apologizing. He hadn’t returned her call. He had hoped never to have to think about her or that night again, but apparently that wasn’t in the cards. Soon Danvers International would be invading his turf, and he hadn’t wanted to explain the reason behind his opposition to his nosy family so he was screwed.</p><p>Only his close friends and family were aware that the Oceanix Resorts were owned by the Jackson family. There were ten beachfront resorts located in such hot spots as Mexico, Jamaica, Bermuda, Florida, the U. S. Virgin Islands, Charleston, and Turks and Caicos. Seth ran the Oceanix Resort in Myrtle Beach and his brothers, Rhett, Ash, Dylan, and Luke, ran resorts in Florida, Charleston, and St. Croix. His cousins rounded out the rest of the management of the Oceanix chain. Like their fathers before them, they each lived and breathed the business. They could have easily expanded, but they all believed that quality was better than quantity. Each location was booked for months in advance. It was rare that they had vacancies. The service they offered was impeccable and second to none. A stay at the resort was first-class all the way. They were a five-star resort and their staff was paid well to make sure there were never issues with customer satisfaction.</p><p>In the scheme of things, replacing the communications system at the resort was minor and not something he would usually be concerned with. It wasn’t as if Beth Denton or Nick Merimon were going to walk through the door as a part of the installation team from Danvers. This was business and arguing against a Danvers system would bring nothing but questions from his nosy family. They only purchased top of the line for the resort chain and that meant Danvers whether he liked it or not.</p> <p>As if some sixth sense had alerted her, his assistant walked through the door as he was setting his pen down. He had no idea how she did that. He often wondered if she had his office under some type of surveillance. He smiled as Margie made her way to his desk. They had worked together for five years now and he would be lost without her, a fact that she pointed out to him at least five times a day. Even though he rolled his eyes, they both knew it was true. She was a wise-cracking, tough-love mother-figure and he adored her. She dressed like someone off a runway but complained endlessly about the high heels that she insisted on wearing daily. Her ink-black hair was cut short and had that perfectly mussed look that women paid a fortune for. He should know; he gave her carte blanche to the resort hair salon and she was a walking advertisement for the talent of the stylists. She was fit and trim and he had no idea how. She ate like a sailor and cursed like one at times.</p><p>His own mother, Charlotte, as she preferred to be called by her sons, lived in California with her second husband. He rarely saw her and that was something that they were both okay with. She had bonded with her husband’s children from his former marriage and she tended to act as if he and his brothers were just distant acquaintances unless she needed the services of one of the Oceanix Resorts.</p><p>His father had died a couple of years back of a heart attack. He had been a brilliant businessman but lived the extravagant lifestyle of the rich. After his divorce, he never lacked for female company. Seth was sure that he never lacked for it while he was married; he just tried to hide it better than he had afterward. He had vowed to never remarry and Seth was grateful that he had kept that vow. Having to deal with a stepmother was something that neither he nor his brothers had wanted.</p><p>He jumped when Margie snapped her fingers in front of his face. “Can I have that contract or do you plan to sit there clutching it while staring into space for the rest of the day?” He handed the papers over without comment and watched as she flipped through the pages. When she was finished, she shook her head saying, “Man, it sucks to be you. Talk about bad memories.”</p><p>Margie was one of the few people he had told about the fiasco with Beth and he now wished that he hadn’t. He shrugged his shoulders. “It’s not a big deal.”</p><p>“Well, obviously,” Margie snorted. “That kind of shit happens to you every day. I think whoever came up with the idea for Myrtle Manor was sitting at a table next to you that night and overheard your whole conversation. The only thing that would have made it any better was a possible paternity issue. Any chance that you could be the baby daddy?”</p> <p>“You’re a horrible assistant,” Seth deadpanned.</p><p>Margie laughed. “We both know I’m fabulous and you could never hope to do any better. Who else would put up with your snarky comments and lousy pay?”</p><p>Seth smiled, enjoying their verbal wordplay. “What? You haven’t managed to talk payroll into giving you a raise? You’re slipping in your old age.” She probably had him on the snarky comments, but she usually started it. As for the lousy pay, he highly doubted there was a better-paid assistant in the area or even the state. She also enjoyed more perks than anyone else in the resort. Some of them he had given her, some the other employees showered on her. They all thought he didn’t know, but there was nothing that went on in the Oceanix that Seth was unaware of. He made it his business to be one step ahead of everything and everyone. Margie deserved it though so he didn’t mind. She held the chaos at bay and kept things running smoothly, something that was priceless to him. He loved her unwavering loyalty and also her ability to give it to him straight when others just tried to tell him what he wanted to hear. Margie never sugarcoated things for him. As far as the rest of the staff and their clients were concerned, the woman could sell shit to a manure farmer. She was smooth, sweet, and full of southern charm.</p><p>Margie straightened to her full height, which was an impressive five-nine, and smirked. “Trust me, honey, there is nothing slipping here. I pay good money to keep it all where it’s supposed to be. Now should I send this contract over to Danvers? Does Beth handle that?”</p><p>Seth waved her away saying, “Get out before I call Joe. I think something is wrong with my computer. It’s been freezing up a lot.”</p><p>The smirk left her face as she glared at him. “If you do that, I will personally ask for Beth when I send these contracts back. Or better yet, maybe Nick. Talk about awkward.”</p><p>“I’ll behave if you do,” Seth countered.</p><p>“Fine,” she snapped before closing the door behind her in a huff. He declared himself the winner of this round. He very seldom got one up on Margie, but Joe worked every time. The head of their IT department was a sore subject for her. A few years back at the company Christmas party, Margie had indulged too much at the open bar and had grabbed Joe in a drunken embrace. He had turned her down flat. Since Joe had been after Margie for years, she had been shocked when he said no. He didn’t want to take advantage of her while she was intoxicated. To him, that made Joe a good guy. To Margie, that made Joe the man who rejected her and the sting to her pride was still there. Seth knew that Margie liked him, but she just couldn’t get past the humiliation of the party and she tried to avoid him now at all costs.</p> <p>Settling back in his chair, he took a minute to gloat before moving on with his day. It wasn’t often he got the best of Margie and he needed to enjoy the moment.</p><p>Chapter Two</p><p>Mia Gentry walked through the glass doors in the lobby of the Danvers International building singing to the music piping through her earbuds. At twenty-eight, she felt like some dirty old lady for listening to Justin Bieber, but she loved his music. She stuck the foot of her hot-pink pump in the door of the elevator to hold it. Suzy and her husband, Gray, were standing just inside the door as she made her way inside. God, she felt like such a frump standing next to her fashion idol and her GQ man. She wondered idly if they were into threesomes. She had never tried that, but she had a bit of a girl-crush on Suzy, and Gray was smoking-freaking-hot. Yeah, she wouldn’t think twice if they asked her. She smiled and muttered, “Morning,” as the doors closed.</p><p>Oh my god, he had his hand on her ass. That was it for Mia. Any man confident enough to feel up his wife in a corporate America elevator was the total shit as far as she was concerned. She knew she had just found some new material for the session with her battery-operated boyfriend tonight. Suzy and Gray stepped out on the fourth floor and as the doors were closing, Suzy flashed her a grin saying, “I love your shoes.” Luckily for Mia, she managed to contain her squeal until the elevator was moving again. Yeah, this day was looking up. Her fortune cookie from last night was right; good things do come to those who wait.</p><p>She stepped off at the sixth floor into the hub of the installation and support department for Danvers International. This place was heaven for a geek such as herself. She had worked here for three years now and had loved every minute of it. She had started out doing customer support and had eventually moved up to site installation. She supervised a crew of ten people, and depending upon the job, some or all of them traveled to each site. Although, when she had moved into management, she had given up a lot of the travel that had been required. She now only went on-site for a few days for the larger jobs or to fill in if necessary. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She grabbed a cup of coffee from the break room on her way to her corner office. Her space was small, but she treasured the window with the view of downtown Myrtle Beach. It was a big upgrade to her starter cubicle in the cube-farm down the hall. Just as she was running through the emails that had accumulated since yesterday, her boss, Hank, walked in and sank down in the chair in front of her desk.</p><p>“How’s it going, kid?”</p><p>She smiled at his standard greeting. Hank was in his forties and saw everyone around him as his kids. He had a thick mane of gray hair and if she squinted just right, he reminded her of Richard Gere. He had more than a few admirers in the office, both male and female, so apparently everyone else agreed with her assessment of his looks. “It’s going, no problems to speak of.”</p><p>Hank shook his head, giving her a rueful smile before saying, “Well, I’m about to mess that up for you. I know you’ve got half of your crew in Alabama this week, and Nikki is out with her . . . um . . . lady problem, but I’ve got a local install that just came through and it’s VIP.”</p> <p>Mia rolled her eyes. “First of all, Nikki just had a baby; how is that a ‘lady problem’? And secondly, who’s the local VIP? Unless we’re talking about something for the city, it should only require a couple of technicians, tops.”</p><p>“You know the Oceanix Resort?” Mia nodded even though it wasn’t really a question. Most locals could never afford to stay there but everyone still knew the Oceanix Resort. It was high-end luxury. She would never voluntarily admit it to her coworkers, but she suspected that Hank knew she might be familiar with the resort. “They are replacing their entire system with ours and the Myrtle Beach location is to be the first install. If things go well, the other nine locations will be next. The catch is they want to start on Monday, which means that the preliminary work needs to be laid out this week. Since you’d normally send Nikki on a local job, that only leaves you, kid. This needs to go off without a hitch so we can’t send some wet-behind-the-ears newbie and besides, those are your people, aren’t they?”</p><p>Indeed they had been at one time. You didn’t grow up as the only child of Jefferson and Madeline Gentry without rubbing elbows with some of the privileged elite. Her parents were what you would call “old money.” If there had ever been a poor Gentry in the family tree, it was too far back to be found. She had bowed to parental pressure and attended an Ivy League college, which was probably why Hank suspected that she was from money. After she graduated, she had started to pull away from the crowd she had grown up with. The pressure to fit in had long ago gotten old and she was eager to experience life without a constant safety net under her.</p><p>Of course, her parents had been less than thrilled with her choices. She would have thought her computer science degree would have tipped them off, but apparently they just assumed she had spent four years in college to study a hobby. When she moved out of her gated childhood home in a posh oceanfront section of Garden City Beach, they had been quite vocal in their disapproval. She had struck a compromise with them and had moved into a condominium that her father owned in nearby Surfside Beach. She wanted to hate it, but truthfully she loved her two-bedroom home right on the ocean. It was a small twelve-unit building and even though she was well paid at Danvers, it would have been out of her price range.</p><p>She rarely saw any of her childhood friends now. Most of them just didn’t understand her anymore. As was often the case, they had all moved on. She had new friends now such as her good friend and coworker, Nikki, who was currently on maternity leave and had named Mia the godmother of her first child. Indeed, life was different, but better now. Her parents might never understand her, but she hoped in some tiny way, they respected her need to make it on her own.</p> <p>Hank snapped his fingers, jerking her from her trip down memory lane and back to the present. Damn, what was his question again? Oh, yeah, her people, hmmm, how to answer that. “I don’t know about that. I’m not familiar with the owner or owners.”</p><p>He grinned, obviously amused with her efforts to sidestep his question. “Have you ever been inside the Oceanix Resort?”</p><p>Well shit, he had her there and he knew it. “Er . . . a few times. They have a good Sunday brunch.”</p><p>“Whew, I can only imagine how much a meal in that place would set you back.” Without waiting for an answer, he continued on. “So, at least you’re familiar with it. Bullshit aside, Merimon asked that we send you.”</p><p>Mia’s heart stuttered. Oh my God, Gray Merimon knew she existed? Maybe that threesome idea wasn’t all in her head. “Wow, okay. If Gray asked for me.” Before she could start mentally picking out lingerie, Hank busted her bubble.</p><p>“Gray? No, the other one, Nick. He handled the contract and requested the team leader. He even mentioned you by name.”</p> <p>Talk about having the rug pulled out from under you. It wasn’t that she didn’t find Nick attractive; he was delish. His fiancée, Beth, was hot as well, but she was pregnant. It seemed wrong to have a fantasy about someone knocked up. Oh, well, it was probably for the best. She would just continue to admire her idol from afar. “Yeah, I’ll head on over there this morning and get everything started. Who do I need to ask for?”</p><p>Hank pulled some paperwork that he had rolled in his shirt pocket and handed it over to her. “Seth Jackson is your contact. He also indicated that you can speak with someone named Margie if he isn’t in.” Hank’s name was paged for a call and he left her office with a curse.</p><p>Mia spent the next hour answering emails and returning calls. She packed a bag with her iPad and a notebook to jot down some quick notes. She stopped off at the restroom to survey her reflection before she left. She had dressed a bit casually for a customer visit, but it would have to suffice. She was wearing black skinny pants, with her high-heeled pink pumps and a matching pink-and-white striped top. Her wavy, brown hair was styled in the usual intentionally messy look, and her makeup consisted of pink blusher and a sheer lipstick. Yeah, it would have to do. She seldom spent a lot of time with management in the preliminary stages anyway.</p><p>Chapter Three</p><p>God, he needed a drink. This day had been nothing but a pain in the ass so far. He had spent the past hour dealing with a customer who swore that the cleaning staff had stolen her wedding ring. The cleaning staff had gotten defensive and plainly pissed off over the accusations and the customer had been rude and obnoxious. After an hour of dealing with it from both sides, the customer’s husband had returned from his round of golf and reminded his wife that she hadn’t brought her ring; it was at home with the jeweler having one the settings repaired. She hadn’t even bothered to apologize. It was as if the whole thing had been an inconvenience to her. Seth intended to ensure that they had no vacancies in the future to accommodate them. He would not subject himself or his staff to that type of treatment again.</p><p>Margie wasn’t at her desk so he assumed she had gone on to lunch. She didn’t like to deviate from her schedule. She was usually on some crazy diet and making her wait to eat could damn near get everyone in the vicinity killed. He had just sat down at his desk when he noticed the light on in the attached communications office. Margie was probably in there using the cameras to snoop on Joe again. He got back up and went toward the office with the intention of pulling her out. He came to an abrupt halt when someone very un-Margie-like almost backed her ass up into his crotch. When she continued to shimmy and kept singing, “I’m sexy, and I know it,” he thought he had possibly died and gone to heaven. He settled back against the doorframe to enjoy the show. When she flipped around, he saw her nametag with the words Danvers International and Mia Gentry below it. Well, fuck. Couldn’t Jason Danvers employ someone homely for once? Sadly, the dance moves had stopped and a pair of stunning blue-green eyes looked up at him in question. “So you’re from Danvers?” Brilliant, Seth, way to state the obvious. Follow it up by asking her sign.</p><p>Her full pouty lips settled into a mischievous smile as she said, “Yep, and since I’ve already met Margie, then would you be Mr. Jackson?”</p><p>Sticking his hand out, he said, “It’s Seth and you must be Mia. I take it Margie showed you around. Did you have any other questions?”</p> <p>“Nope, I think Margie gave me the 411 on everything. I’m just going over your equipment now. Do you want to keep your hard drive? I can dispose of it, but some people are funny about that.”</p><p>Seth couldn’t believe that the words equipment and hard drive had his cock stirring to attention. What in the hell was wrong with him? Why was he suddenly incapable of thinking of anything other than bending her over the control desk and fucking her senseless? He had to get out of this room before she noticed the tent in the front of his trousers. “Um, yeah, you can just keep it. I’m sure my hard drive will be safe with you.” Holy shit, did I actually just say that to her? So not cool. Just get out now before this gets worse. “I’ve got to get back to my office. Just let Margie know if you need anything.”</p><p>Mia looked at him in confusion and then to the space beyond him. “Isn’t that your office?”</p><p>“Oh, sure, yes. I meant to say, I was heading to lunch. You might be gone when I get back.” God, he really hoped so.</p><p>She looked down at her watch, seeming surprised by the time. Almost as if by some cruel twist of fate, her stomach growled at the same moment. “Where are you going for lunch?”</p><p>Before thinking better of it, he said, “I usually grab something from the restaurant downstairs. They have an excellent lunch buffet.”</p><p>Mia moaned and Seth started sweating harder. “Oh, they so totally do. It’s been ages since I’ve eaten there. Do you mind if I tag along? I hate to eat alone and I’m starving.”</p><p>“Er . . . sure. Just give me five minutes to finish a few things and I’ll be ready.” He could only imagine what she thought he had to “finish up” when he headed straight for his private restroom on the other side of his office. He just needed a few minutes to collect himself before what would undoubtedly be a long lunch hour. At this point, even having Beth do the system installation would have been preferable. At least he wasn’t likely to walk around with a raging hard-on the entire time. This girl though was getting to him. She wasn’t even his type. She was petite, but her heels made her appear much taller, with wild brown hair that looked like it had just left someone’s sheets. He preferred women with neater hair and more classic taste in clothing. Mia had neither of those things. And yet he would probably never get the fantasy of fucking her while she wore nothing but those damn pink shoes out of his head. Shit, he had to stop thinking about that!</p><p>He splashed some cold water on his face and mentally counted to one hundred. He could get through a simple lunch. He worked at a resort that catered to scantily clad females daily. This wasn’t a big deal. She wasn’t wearing a bikini like most of the people he dealt with. Mmmm, Mia in a bikini. Fuck! Enough already!</p><p>When he stepped out of the restroom, Mia was leaning against his desk waiting for him. He felt his cheeks color at the look of amusement on her face. Yeah, she thought he had problems. If she only knew. It was better that she labor under the illusion that he had stomach issues rather than the truth. He was dealing with an unruly cock.</p><p>“I’m ready if you are,” she said.</p><p>Why did everything she said sound like some sexy, double entendre when he knew it wasn’t intentional? “Sure, let’s go.” As they passed through the doorway, Margie was walking toward her desk. Seth wanted to pretend that he didn’t see her because he knew what was coming and she didn’t disappoint.</p><p>“Well, hey there, you two. Where are you off to?” She shot him a knowing smirk before looking at Mia as if they were new best friends.</p><p>“I invited myself to lunch with Seth.”</p><p>“Ah, honey, I’m sure he would love to have you.” Seth coughed, knowing damn well he wasn’t imagining the double meaning this time.</p><p>Before it could get worse, he walked to the elevator saying, “I’ll be back in an hour.”</p><p>“Take your time,” she yelled after them, “your afternoon is clear.” Sometimes, he truly hated that woman.</p><p>The elevator ride to the lobby was crowded, saving him from having to make conversation. When they entered the restaurant, he steered Mia toward his reserved table at the wall of windows. He loved looking at the ocean view while he was eating. Mia took the seat opposite from him, ordering a sweet tea from the waiter. Once their drinks were delivered, she jumped up and made her way toward the buffet at a rapid pace. Apparently, she wasn’t lying about being starving. He was barely halfway through filling his plate when she walked by him flashing a sheepish grin. Her plate was completely loaded and he couldn’t imagine where she would even put it all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I skipped breakfast this morning,” she said by way of explanation. He couldn’t help but laugh. He found himself putting more on his plate than he usually would so she wouldn’t be embarrassed.</p><p>She was eating with gusto when he returned. He had just taken his first bite when a couple approached the table. Mia choked on her piece of chicken when the woman said, “Mia, darling, how wonderful to see you.”</p><p>She took a quick sip of tea to wash down her food before saying, “Mom, Dad, wow, what a surprise.” Seth was equally surprised. He hadn’t connected her last name with Jefferson Gentry.</p><p>Seth stood extending a hand to Jefferson and his wife, Madeline. “Jefferson, Madeline, how nice to see you again. I didn’t know that Mia was your daughter.”</p> <p>Madeline dropped her perfectly manicured hand to her side before answering. “Yes, Mia is our only child. How do you two know each other?”</p><p>Before he could answer, Mia spoke up. “I’m here to do an install for Danvers.”</p><p>“Oh, how nice. Mia just loves that little project of hers.”</p><p>“It’s called a job, Mom. They pay me and everything.”</p><p>Her mother seemed oblivious to the sarcasm, but judging by the frown on her father’s face, it hadn’t escaped his attention. Her mother turned her attention back to Seth saying, “I wanted to thank you again for donating the use of your ballroom for our charity bachelor auction tonight. I think it’s wonderful that you have decided to participate as well. I know we are going to raise a lot of money tonight for the new children’s hospital.”</p> <p>Mia looked at Seth in surprise. “You’re going to be auctioned off tonight?”</p><p>“Um . . . yeah. It’s for a good cause and it’s only one evening out of my life so it’s really not a big deal.” Luckily, Mia’s parents spotted some friends a few tables away and after bestowing some air kisses on their daughter, they were off. He couldn’t help but breathe a sigh of relief. They might run in the same social circles, but he had always found them a little too reserved for his taste.</p><p>Beside him, Mia also seemed to expel a breath as well. “Sorry about that. My parents aren’t exactly the life of the party. I’m sure you noticed that they don’t think much of my career. If they had their way, I would be with them right now making the rounds.”</p><p>“I’ve known them for years. How is it that we’ve never crossed paths?”</p><p>“On the occasions that I’ve been with them, I usually spent the evening with friends. They were never the type to bring out the baby pictures and brag about their only child either so it’s easy to see why most people other than very close friends don’t know I exist. So . . . a bachelor auction. I have to admit, I find that surprising. Have you done that before?”</p><p>Grimacing, he said, “No, this will be a first for me. How bad could it be, right?”</p> <p>Mia chuckled. “Oh, it could be bad all right. You will probably be purchased by some old cougar who will feel you up all the way through dinner and then try to bribe you into the sack at the end of the night.”</p><p>“Oh, God, I hope you’re wrong. I was picturing some shy, homely girl who would be happy with a good meal and some nice conversation.”</p><p>“Good luck with that,” Mia laughed. “I know most of the crowd who will attend tonight and there isn’t a wallflower in the bunch. I may actually enjoy myself at one of these things for once.”</p><p>Seth raised a brow. “You’re going to be there tonight?”</p><p>“Unfortunately, yes. I have to put in an appearance at a few events just to keep my parents happy. Since this is one of my mother’s favorite charities, she expects me to attend. Madeline Gentry isn’t a woman you want to disappoint on a regular basis.”</p><p>He wasn’t sure how he felt about her being in attendance to watch him go on the auction block. She would probably laugh her ass off if no one bid on him or, God forbid, the cougar she described bought him. But, at the same time, the evening seemed a lot more interesting than it had earlier. He was almost looking forward to it.</p><p>When they had finished eating, he was surprised to find that he had enjoyed their lunch together. She was intelligent, funny, and the conversation had never waned. Unfortunately, neither had his attraction to her. It would probably be a good idea to plan many of his meetings for offsite in the coming weeks. He wasn’t sure he could handle her being that close to him without losing it. It had been a while since he had felt the need for a lunchtime masturbation session, but today just might be the day.</p><p>Chapter Four</p> <p>Mia pulled on the strapless red cocktail dress and spent several moments struggling with the zipper before finally managing to get it zipped. There were times when it was a real pain in the ass not having a man around. She surveyed her reflection in the mirror and knew that even though her mother would hate the short, mid-thigh length, she absolutely loved it. The dress had a pleated bodice and the narrow skirt contained side pockets. She settled on a large pair of gold hoop earrings and a matching cuff bracelet. Impossibly high-heeled strappy sandals completed the look.</p><p>She had to wonder if she was putting just a little extra care into her appearance because she knew Seth would be there. He intrigued her. He seemed so reserved at first, but she had caught him checking her out more than once. She didn’t think she was imagining the chemistry between them. She had always been a sucker for a man with blue eyes. The cologne that he wore also made her want to rip the clothes off his tall, rangy body and answer one of her burning questions: boxers or briefs? He definitely looked like a boxers kind of guy, and she found those so damn sexy. Briefs were too revealing, too fast. Boxers were like unwrapping a present. You never knew what was under them. If the outline at the front of his trousers was to be believed, she wouldn’t be disappointed in Seth’s . . . package. Okay, so she had been checking him out today as well. Nothing could happen between them while she was working there, but after the job was completed . . . all bets were off.</p><p>She had been too busy with work and travel the last few years to maintain any type of relationship. She had never been shy about going after something she wanted and right now, that was Seth Jackson. She didn’t want to marry the man, but she damn sure wanted to sleep with him. If things went well, she could see things going longer than just one night. Of course, this all depended on Seth being a willing participant and from the vibes she was getting earlier, she felt that he was. Thanks to the wonder of Google, she knew that he was single and appeared to be unattached. She was also surprised to find that he and his family owned the chain of Oceanix Resorts. He wasn’t just an employee there as she first thought. That didn’t really mean anything to her, but it explained why her parents knew him well enough for casual conversation. She would have preferred someone outside of their social circle, but at least they didn’t appear to be golf buddies or anything close. It was doable and so was he.</p><p>The cab that she had called was waiting at the entrance to her condominium. She usually preferred to have her own car, but she wanted to be able to enjoy a drink if she felt like it so she opted for safety. When she arrived, the ballroom was already packed. Her parents were standing at the door greeting the new arrivals. Her mother shot a quick look at her short dress before giving her a fake, public smile. “Mia, darling, don’t you look . . . cute tonight.” Her father was deep in conversation with another couple and gave her a perfunctory kiss on the cheek before turning away again.</p><p>“Hi, Mom, it looks like you’ve done it again. It’s standing room only in here.”</p><p>Her mother beamed, pleased by her remark. “I think some of the credit goes to Seth for donating the venue. Everyone loves the Oceanix Resort and couldn’t resist an evening here. You two seemed quite comfortable today.”</p><p>Oh, yuck, is my mother trying to match-make again? I have to give her credit; her taste has improved a lot since the last disaster. Mia tried to seem uninterested. She didn’t need her mother getting involved and scaring the man away.</p><p>“He’s just a client, Mom, nothing more.” She was grateful that a group of people behind her provided just enough distraction for her to make a quick escape. She loved her parents, but they didn’t have much in common. Plus, it could be draining when you were the center of their focus. It was much easier just being the usual afterthought. She took a glass of champagne from a passing waiter and scanned the room. She was disappointed that Seth was nowhere to be found. Maybe he had decided against being auctioned off tonight.</p><p>When a hand landed on her shoulder, she turned to find Margie, Seth’s assistant, behind her. “Well, hey there, girl, don’t you look hot.” Margie was wearing a form-fitting black dress, which displayed a body that most would envy, including her.</p><p>“Wow, so do you. I love that dress and those shoes are amazing!” She had instantly bonded with Margie that morning and she was happy to see a friendly face in the crowd.</p><p>“Ah, thank you, dear. They are killing my feet already, but it’s the price you have to pay, right? I hear your parents are throwing this shindig. I didn’t peg you for one of those Gentrys.”</p><p>Mia winced. “Yeah, well, someone had to be their token child and my number was called so here I am.”</p><p>Margie laughed, throwing an arm around her. “I like you. It’s about time we had someone interesting around here. So, are you buying yourself a man tonight? I know you probably think I’m saying this because he pays me, but you can’t go wrong with Seth. The boy cleans up real well and the way the women around the hotel chase him, he must be pretty good at his game, if you get my drift.”</p><p>She smiled, more than getting her drift. “I hate to disappoint you, but the auction is out of my price range. Is Seth still planning to do it? I haven’t seen him around.”</p><p>“He had to take a late conference call. He should be down in time for his moment on the stage. I tried to get him to wear something sexy, but he insisted on sticking with his suit.”</p><p>“That’s too bad,” Mia murmured before she could stop herself.</p><p>Margie gave her a wicked grin, saying, “Use your imagination, honey. Mine sure keeps me entertained. Now, do you think you can score us some good seats to the action?”</p><p>Linking their arms, Mia said, “I’ve got this covered, follow me.”</p><p>Seth cursed under his breath when he looked at his watch. The conference call had run later than he had anticipated and he had missed the start of the auction. If he didn’t hurry, he would miss the whole damn thing and Madeline Gentry would have his head. He wondered again why he had agreed to this in the first place. He had no desire to take some stranger out to dinner and make polite conversation. Worse yet, if Mia was correct, he might be fending off some older lady with roving hands. Maybe he should just stay in his office and pretend that he couldn’t get away. If you do, you’ll miss seeing Mia again.</p><p>Shit, why did he care about that? He would see her tomorrow. But, you’ll miss seeing how she’s dressed tonight. What if she’s showing more skin? That was a thought he couldn’t resist. He had to see her. If that meant embarrassing himself in front of a roomful of people, then so be it. How bad could it be?</p><p>The spotlights were glaring down on him, causing a fine sheen of sweat on his neckline, and the women in the room had turned into a bunch of horny piranhas. Mia, who was dressed in a fire-engine red dress that was indecently short, was seated in the front row next to Margie. Both of them were openly laughing as the room went crazy. Bids were being screamed from everywhere—and the amounts were in the thousands now. These women had more money than sense. Who would pay that much to go out with a stranger? They did know that this didn’t include sex, right?</p><p>There was one bidder sitting quietly at the end of the front row who kept discreetly raising her hand to outbid the last bid. Whereas the other women seem to have lost their composure and were now acting more like a bridal party at a male strip club, this woman was calm and collected. She appeared to be in her thirties with long, blonde hair and a blue cocktail dress. He admired her calm approach to the auction, but strangely enough, worried about what an evening with her would be like. She seemed too businesslike to be bidding on a date. She barely even looked at him. She seemed to be listening to each bid and automatically raising her hand. The other women might try to grab his crotch during the date, but this one just might try to emasculate him. Was he actually hoping that someone else would win? Why in the hell hadn’t he instructed Margie to buy him? He could have given her the money. The thought had never crossed his mind.</p><p>The bidding finally ended at $18,000 with him being sold to the eerily calm blonde in the front row. The amount of money boggled his mind. He had contributed more to various charities than that last year, but he would have never paid that much for a date. Of course, looking into Mia’s twinkling eyes and seeing the way her dress had crept up to expose a mile of tanned thigh, he had to wonder if he was wrong. How much would he give for one date with her? He averted his gaze and tried to shake her from his thoughts. Maybe the mystery blonde who had paid so much for a date would be a good distraction. Hell, she was attractive and he needed to get his mind off Mia. She was a complication that he didn’t need right now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mia couldn’t remember the last time she had enjoyed something more. Watching Seth shift uncomfortably on stage while the women in the audience went crazy was hilarious! Beside her, Margie added to the noise level with some encouraging wolf whistles of her own. She had to admit, he did look amazingly hot in his tailored suit. The fact that he wasn’t even trying to work the crowd like his predecessors made him that much more desirable. Women tended to want the men who didn’t seem interested and he was definitely giving off that vibe. When the bidding started, women were screaming amounts. As the action continued though a blonde at the end of their row clearly became the front runner. No matter the top bid, she would immediately counter it. She smiled at Seth, but found herself becoming strangely annoyed at this woman’s determination to have him. She wasn’t surrounded by a group of friends egging her on as many of the others were. No, she worked it almost like a job. Mia had no doubt: this woman was going to win the date with Seth. Why that bothered her, she had no idea, but it did.</p><p>When the bidding ended, Margie leaned in saying, “I can’t believe he sold for that much. I’m never going to be able to live with him. He’ll probably demand I call him Mr. Jackson now and spend half the day staring at himself in the mirror.” Nodding to where the winner was acknowledging everyone’s congratulations with polite nods, she added, “Boy, Blondie sure is hot for him, isn’t she? He might get more than he bargained for out of that one.”</p><p>Mia had to admit that she was curious. She knew most of the people here tonight and she was certain she had never seen the woman before. Looking back at Margie she asked, “Do you know who she is?”</p><p>Margie shook her head. “Nope, I sure don’t. She seems a little calm though to be buying a date. What do you think? Maybe she went off her meds recently?”</p> <p>Mia giggled at Margie’s joke. She really did like Seth’s assistant. It made her wish that she had this kind of relationship with her own mother. What would it be like to actually joke and have fun with her rather than the distant relationship that they had? Oh, well, if that hadn’t happened by now, it wasn’t likely to.</p><p>“Even uptight women get horny, ya know,” Mia deadpanned, which sent Margie into a fit of laughter loud enough to draw the attention of everyone in the vicinity.</p><p>When she had calmed down, Margie said with a wink, “Honey, we all get the urge, but if I’m gonna buy it, it’s not going to be in public.”</p><p>Chapter Five</p><p>“You did what!” Mia stuttered. “Oh my God, why would you do that?”</p> <p>Her mother sat across the table from her at Starbucks sipping a non-fat soy latte. “Please lower your voice, Mia; we don’t need the entire place hearing our conversation.”</p><p>Mia knew it was bad when her mother called her early the morning after the charity auction and demanded that she meet her for coffee before work. She had imagined a million different reasons but none of them came close. “I can’t believe you had your secretary buy Seth Jackson for me. I . . . don’t even know what to say. Does Dad know about this?”</p><p>“No, he doesn’t. Your father would never pay attention to a bachelor auction, so he never noticed Cathy bidding. She has only been with me a few months.”</p><p>“Okay,” Mia sighed. “That still doesn’t answer why.”</p><p>Her mother appeared to take her time answering before finally saying, “You never seem to be interested in anything other than work. I watched you with Seth at lunch yesterday and you were so at ease with him.”</p><p>Exasperated, Mia said, “Mom, it was just business.”</p> <p>“You laughed, you smiled, and your whole body was relaxed. I haven’t seen you like that in so long. I know you will finish your work there and move on. But, I thought if you and Seth had the opportunity to get to know each other in a social setting that maybe your connection might continue after your assignment there is complete.”</p><p>How was she supposed to respond to a statement like that? She was attracted to Seth and she had been hoping something might come of it after her job at the Oceanix Resort was done, but she hadn’t been expecting this. Normal mothers bought their daughters dinner or some new shoes. Her mother bought her a man. It completely boggled her mind that her polished, society darling mother had even thought of it, much less taken the time for the careful execution of the scheme. Was she that concerned about her love life or lack of one? It wasn’t as if it would reassure her if she confessed that she had casual sex when the need arose or used her vibrator. Yeah, that would be a proud moment for any mother. The need just hadn’t arisen lately. “Mom, I . . . I guess this is one of those, ‘it’s the thought that counts’ moments, so er . . . thank you for that. I think though considering the circumstances, that we should just let Seth off the hook. You can just make the contribution and everyone will be happy.”</p><p>To her surprise, her mother shook her head saying, “Oh, no, I wouldn’t be happy. Seth agreed to the arrangement and it will stand. If anyone backs out, I will withdraw my money.”</p><p>“What? You can’t do that to your own charity.”</p><p>Smiling, her mother said, “The charity wouldn’t suffer, dear. Seth would pay the money instead. That was part of the agreement. If, for some reason, any of the bachelors were unable to fulfill their obligation, they would make the donation instead. It wouldn’t be fair to the person bidding for one of the men to drop out now, would it?”</p><p>Wow, her mother was more than a little scary. She didn’t know whether she was impressed or pissed off. She had Seth all neatly tied into the deal. If she backed out, then her mother would probably find some way to make Seth pay as well. Good Lord, it seemed as if the wrong person was running the family business. Her mother was something of a shark. Maybe there was more there than the cool façade that she always presented to the world and to her daughter. Sadly, this was one of the few times in her adult life that she felt some kind of connection to the woman who had given birth to her.</p><p>She would just talk to Seth tomorrow and let him know what was going on. They could go out somewhere for a quick dinner to fulfill the terms of the auction and make everyone happy. No one at Danvers had to know about it. They were both adults here. “Alright, Mom, it looks like you won this one. It’s just dinner though so don’t bother contacting a wedding planner.”</p><p>Her mother gave her a satisfied smile in return. “I knew you would come around, dear. After all, why would any woman in her right mind argue over spending an evening with Seth Jackson?” Why indeed, Mia thought. She had to agree with her mother, but likely for different reasons. Her mother was thinking of his wallet size and Mia was thinking of the size of something else.</p> <p>Damn, where was Seth? He hadn’t been in his office all day. She had been all prepared to talk to him about their “date” tonight and he was a no-show. Margie said that he had driven down to Charleston to the resort there to meet with his brother. She thought that he would be back sometime that afternoon. Looking at her watch, she uttered another curse. It was after four and there was still no sign of him. What was she supposed to do now? Her mother had called her earlier and told her that Seth had called Cathy and made arrangements to meet her at the restaurant Ivy at six. She finally gave up at five and went home to get ready. She would just explain it to him in person. He would be surprised to see her, but surely, he would understand.</p><p>When she arrived home, she took a quick shower and pondered her next decision. If she wore homely underwear, she was less likely to let things get out of hand. Dammit, it almost seemed like a sin though with the short, flirty fuchsia dress that she had picked out, especially since she had a bra and panty set that would match it perfectly. If she wore granny panties, there were bound to be panty lines, right? She put on her silk thong underwear and the matching demi bra and then slid into the dress. She was a sucker for a skirt with some twirl in it and this fit the bill perfectly. The top of the dress had a square neckline with a bustier-type bodice. She added a pair of four-inch black platform sandals and stood back to survey her reflection. She knew she was playing with fire. She should be dressed in something approaching business attire. You didn’t go to a restaurant with a man dressed in a short dress and fuck-me heels and have any hope of keeping things strictly professional. She wanted him and thanks to the unexpected intervention from her mother, she was in a position to have that opportunity sooner than expected.</p><p>If things went well, the installation project at Oceanix Resort would be finished in another week or so. Assuming that Seth was willing, surely they could use this next week for foreplay. No lines needed to be crossed when the finish line was just ahead of them. What was wrong with a little harmless flirting tonight just to gauge his level of interest in taking things to a personal level?</p><p>Her mother was correct about one thing: she seldom had this type of instant connection to someone. She had felt like she had been sucker-punched when they had met in his office for the first time. That type of connection was something she had only read about, but never experienced. There was an attraction there and she was sure that it wasn’t one-sided. He had seemed uncomfortable around her and she thought that was because he had felt that same way. God, she hoped she wasn’t misreading the whole thing. They might not be able to do anything about it tonight, but she intended to confirm Seth’s attraction to her, and her little pink dress should help her do just that.</p><p>Chapter Six</p><p>Seth scanned the crowded bar area at Ivy, looking for the blonde from the auction. He was a few moments late, but the hostess assured him that his party had not arrived. When he was making another pass around the room, he spotted a familiar figure at the bar seated between two men in business suits. She looked up and noticed him at the same time. What was she doing here? He had stayed away from the office all day to avoid having to work in close quarters with her again. He had no self-control around her. He knew that visions of throwing her across his desk and fucking her until she couldn’t stand up would make it damn near impossible to get any work done.</p><p>Now, here she was in this restaurant of all places, looking like pure sex. The men sitting near her at the bar looked like they were in need of bibs. He knew the feeling; he felt like checking himself for drool as well. She was wearing a sexy dress in an eye-catching color. When she stood, he saw a pair of high heels that only brought to mind other fantasies involving her wearing them and nothing else. The man next to her was obviously disappointed by her departure. He saw both men and women staring as she crossed the small space confidently to meet him. Giving him a flirty smile, she said, “You’re late.”</p><p>Before he could even think about what she said, he answered automatically, “I know, sorry about that.” Then it hit him. How could she possibly . . . ? “What?”</p><p>Mia appeared to take pity on him as he struggled for a reply. Taking his arm, she said, “It’s a long story. Why don’t we go to our table and I’ll tell you everything.”</p><p>Still at a loss, he said, “But, I’m supposed to be meeting someone.”</p><p>“I’m the someone you are meeting. Just trust me. I’ll tell you everything when we’re seated. There is no one else coming.” They were starting to attract some attention and by that point, he was intrigued despite himself, so he held his hand out, indicating that she should precede him. Within a few moments they were seated at a window table. He stayed quiet until they had placed their drink order and then settled back to give her a questioning look. He had a feeling this was going to be entertaining.</p><p>“I must admit, you have me more than a little curious.”</p><p>She gave him a slight smile, looking suddenly nervous. “Er . . . I don’t really know where to begin. I guess I should say that the blonde who bid on you at the auction is actually my mother’s assistant, Cathy. She was instructed to, um . . . buy you at my mother’s directive.”</p><p>He interrupted her, clearly surprised. “Your mother bought me? Why in the world would she do that?”</p><p>By this point, Mia’s cheeks had flushed to a hue that matched her dress. “For me,” she whispered.</p><p>“Pardon?” he asked, not sure that he had heard her correctly.</p><p>Clearly exasperated with him, she said louder than she had probably intended, “She bought you for me!”</p><p>He knew it was probably his imagination that everyone in the restaurant was suddenly looking at them. He was sure there were probably a few people in the back who hadn’t caught that attention-getting statement. Holding up his hand, he said, “Okay, I got that. Does she . . . do this type of thing for you often? I mean, buy you dates?”</p><p>The confident Mia seemed to have returned as she chuckled at his question. “No, believe it or not, you’re a first. Apparently, seeing us together at lunch yesterday gave her the idea. Wouldn’t you think she would have just tried to fix us up or something instead of spending thousands to force you to have dinner with me? Sorry about that, by the way. I was planning to tell you all of this at your office today, but you never came in. I didn’t want to just not show up tonight. Plus my mom assured me that if you cancelled, you would have to pay the money yourself, which isn’t exactly fair.” He felt like his head was spinning at the end of her rapid-fire list of things that had brought them to this point tonight. All he could focus on was how sexy she looked in that dress. He had to refrain from moaning out loud when he noticed the distinct outline of her nipples against the fitted material. He wondered how they would taste when he licked the tips with his tongue. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Seth . . . Seth . . . hellooo.”</p><p>Finally, her words penetrated the sexual fog and he was sure that his face was now the color of her dress as well. His heavy cock pressing painfully against the zipper of his pants made it necessary to shift in his chair before answering her. “Sorry, Mia, that’s . . . it’s fine, really. It’s not a big deal. Who knows why parents do the things they do? Let’s just have dinner and enjoy the evening. You look beautiful, by the way.” Way to keep things business, Jackson. You shouldn’t notice how she looks, much less compliment her on it.</p><p>“Holy hell, that’s a relief. I was afraid you were going to freak out or something.” When the waiter returned with the bottle of wine that Seth had ordered, she held her glass up.</p><p>“Do you want to sample it first?”</p> <p>Smirking, she shook her head. “No way, I trust your judgment. Go ahead and fill it up. I could use the liquid courage.”</p><p>He smiled in agreement. So far this evening was nothing like he had planned . . . it was so much better that it scared the shit out of him.</p><p>Mia was tipsy. How had that happened? Maybe she had drunk a glass or two of wine before their meal arrived, but surely that wasn’t enough to have her giggling at everything Seth said like a schoolgirl. He didn’t seem to be in much better shape than she was. Oh, shit, were there two bottles of wine on their table or was she seeing double? When she had told him a few minutes before that his ass was so beautiful she wanted to take a bite out of it, she knew she had had one too many. Far from being offended, he had shifted his chair closer to hers and now had a hand on her thigh dangerously close to the hemline of her dress. She should move away or go to the restroom and hide. Was she doing any of those things, though? No, she was returning the gesture and running her hand up his thigh. She wasn’t stopping there, either; she was now stroking the outline of his hard cock through his trousers, and his wandering hand was getting closer and closer to the apex of her thighs. Before she thought better of it, she said, “You’re a big boy, Seth, a really big boy.”</p><p>“And you’re a bad girl, Mia, a very bad girl. Let’s get out of here so I can do something about that for you.”</p><p>She made a feeble excuse. “But, my car is here.” He rubbed his hand against the thin silk of her thong and she fought to control the moan that rose to her lips.</p> <p>“I’ve got a car and a driver. I just texted him and told him to pick us up at the entrance. I’ll have your car brought to my house.” Before she knew it, Seth had settled the bill and was steering her toward the door with a hand in the small of her back. She gave a bright smile to the man holding the rear door of a shiny, black car open as Seth helped her inside. When he pulled her into his lap as the car started moving, she looked toward the front in alarm. “It’s okay; there is a privacy glass so Mike won’t be able to hear or see a thing.”</p><p>That was all she needed to know. She settled her mouth against the lips she had been admiring all evening and slipped her tongue inside his mouth. He tasted faintly of wine and of the chocolate soufflé that they had shared for dessert. Completely and utterly delicious. He took over the kiss and devoured her mouth. His hands settled against her ass, kneading it before pushing her into closer contact with his cock. She rubbed herself against him unashamedly, desperate for relief. When she felt him lean her back in his arms, she protested the loss of contact. “I want you . . . now.”</p><p>“Shhh, it’s okay. I don’t want to fuck you in the car the first time, but let me make you feel good.”</p><p>His hand slid her panties to the side and his long finger stroked her wet slit. She moaned and moved her hips, seeking the full pressure of his hand. “Oh, yeah, you like that, don’t you?” Suddenly his finger was inside of her, buried to the palm of his hand.</p><p>“Oh, God,” she bucked against him. “Please.” He added another finger and thrust them in and out of her. His thumb rubbed against her clit and she felt the explosion begin inside her. Tremors wracked her body as wave after wave of pleasure streaked through her. He continued to milk her for everything she had. His fingers were relentless as another orgasm threatened. She was so sensitive that she thought she would die if he didn’t stop. She attempted to clamp her legs together and shift away from him.</p><p>He gave a husky laugh, tweaking her clit one last time before removing his hand from between her legs. “We’re almost at my place, and I want to be buried inside of you the next time you come.”</p> <p>“Where do you live? Please tell me we aren’t going to your hotel.”</p><p>“I split my free time between a house on the beach and a penthouse at the Oceanix. I didn’t think it was a good idea for us to be seen in our, um . . . condition walking through the resort. I thought my home would be more private.”</p><p>The gates opened ahead and the car pulled smoothly into the circular drive of his home. He helped Mia straighten her clothing before the driver opened the rear door. He kept his hand at her back as he escorted her to the front door. The house and grounds were well lit by landscape lighting, but it still took him a moment to fumble for his keys. Mia stuck her hand in his pocket, skimming near his cock. “Need some help finding your . . . keys?” she joked.</p><p>He raised an eyebrow saying, “If you keep that up, I’ll fuck you against the door and forget trying to open it.” She felt a thrill shoot through her at the image his words invoked. She had no idea that he was so forceful and she had to admit, she loved it. Her intuition had told her that Seth would be good in bed. She now thought he might be more like the Holy Grail. The man had some kink, which was an unexpected turn-on. She would have never pictured him fingering her to an orgasm in the back of a car. Even with her alcohol buzz starting to wear off, she had no plans of backing out. Just this once she was going to mix business with pleasure. She had come too far to stop now.</p><p>A lamp burning in the foyer cast a dim glow on the surroundings. Before she could look further, his hand settled on the curve of her ass and pushed her forward to what she presumed was his bedroom, if the massive bed was any indication. “If you don’t mind, let’s skip the tour for now and get on to more . . . pressing business. I believe I promised you an orgasm with my cock inside of you and I’m ready to make good on that.”</p><p>What little modesty she had left was gone. Her only reply was, “Could you unzip me, please?”</p><p>“Most fucking definitely, sweetheart.”</p><p>When Seth lowered her zip, she stepped away from him before he could remove her dress. He moaned his frustration with her evasive maneuvers before she turned back to him, making eye contact. She slowly lowered the top of her dress, exposing her barely contained breasts to his hungry gaze. With a shimmy of her hips, the dress continued down until it pooled at her feet. She kicked the fabric away and allowed him a moment to enjoy the her lingerie. When he tried to reach for her, she took another step back. She pushed him back onto the bed saying, “Not yet, cowboy, this is my show. Just enjoy it.”</p> <p>Mia had no idea who the wanton woman was who had taken control of her body. She blamed it on the alcohol, even though she thought she could walk a straight line now if needed. Keeping her bra and panties on, she turned around, spread her legs, and settled her hands on her hips. She slowly started to swivel her hips from side to side. She circled around until her ass was in Seth’s line of sight and lowered her body until she felt his hand stroke one of her cheeks. She spun away, unclipping the front clasp of her bra and allowing it to drop as she turned back to face him. She noticed with satisfaction that his face was flushed and he appeared to be breathing harder as she reached up to cup her breasts, lightly pinching the nipples that had puckered under the heat of his gaze. Her body continued to sway in a sultry dance as she hooked her hands in the side of her panties and smiled at Seth’s ragged moan. It was naughty of her to torture him so much, but he seemed to appreciate the show even if it was starting to torture her as much as it was him.</p><p>She gasped in surprise as he suddenly leapt from his seat on the bed and put his large hands over her smaller hands, stopping her from removing her thong. “Oh, no, baby,” he growled, “I believe it’s my move now.”</p><p>Wiggling her hands from under his, she purred, “Only if you remove some clothing. I’m feeling a little underdressed.” Without waiting for his approval, she pulled his button-down shirt from his slacks and started unbuttoning it. His fingers dug into her thighs as she nibbled her way down his chest, nipping at the flesh each button exposed. She reached his belt and congratulated herself on getting it unbuckled in record time. When she reached for the button of his slacks, he grabbed her wrists, stopping her.</p><p>“That’s enough for now. If those sweet hands of yours touch my cock right now, this might be over sooner than either of us wants. Let’s focus on you.” He turned and nudged her toward the seat on the bed that he had recently vacated. When she dropped down to the edge, he knelt between her spread legs and eased his way closer to her. She obligingly spread her legs further until he was nestled against her core. His fingertips glided down her arms as his gaze ran over every exposed inch of her body. “So fucking perfect. Shit, you make me want to fuck you first and think about the rest later.” Her body clenched in anticipation, more than agreeable to his suggestion until he added, “But . . . I won’t. A body like this must be stroked . . . licked . . . sucked, and savored first. Then I’ll have you grip the headboard while I fuck you . . . hard.” A moan escaped her parted lips causing him to smirk. “I think you like that don’t you, Mia?” She nodded her agreement, but he wasn’t satisfied with that. “Tell me you like it.”</p><p>“I . . . I like it. I want that,” she whispered.</p><p>“I think you just earned another orgasm.” His hand trailed down her throat before finding her erect nipples. He palmed one while stroking the stiff peak on the other. Just when Mia had grown accustomed to the gentle pressure of his hands on her breasts, he suddenly pinched both nipples firmly. Her body jerked at the combination of pleasure and pain. Moisture gathered between her thighs, making her panties embarrassingly wet, and his hands left her breasts and circled closer and closer to her core. She shifted her hips, begging him to make the contact that she so desperately needed. By the time his fingers brushed against her slit through the wet fabric of her panties, she thought she might explode. She was ready to push the material aside and push his hand against her throbbing clit. The man had way too damn much self-control. Without warning, he grasped the side of the delicate material and gave a firm tug. She gasped in surprise as the silk gave way. He performed the action on the opposite side and suddenly the panties were gone in the blink of an eye. He lifted her legs, draped them over his shoulders, and lowered his head before she had time to protest. He buried his face between her legs and . . . sniffed. What the hell? “Ah fuck, baby, you smell so sweet. If you taste half as good, I’m never going to want to leave your hot little pussy.”</p><p>Shit, Mia thought, Seth Jackson talks dirty. Could this get any better?</p><p>When his tongue slipped through her folds and circled her clit, she knew had her answer. The man had the tongue of a god! He alternated between licking her like an ice cream and sucking her clit like a damn Hoover. Her eyes literally rolled back in her head as the best orgasm of her life came ripping through her body like a freight train. When he added his fingers to the mix and started pistoning them in and out of her, every nerve ending in her body caught fire. She clamped her legs around his hand, not sure if she was trying to push him away or trap him there forever. She was as limp as a dishrag when he finally removed those magical fingers and stood to discard his remaining clothing.</p><p>Mia was sure she could pack it up and go home at this point and still have had the best sexual experience of her life. Well . . . until she saw the impressive cock that Seth’s slacks had been covering. Her poor vagina didn’t know whether to freeze in anticipation or run scared. To say that he was impressive in that department was an understatement; the man could make a fortune in the porn industry if he ever decided on a career change. He stood still for a moment, content to let her look her fill. “Wow,” she finally murmured, “you don’t believe in doing things halfway, do you, Mr. Jackson?”</p><p>Smirking, he said, “No, I don’t, Miss Gentry. Now how about sliding back onto the bed so I can join you.” She managed to move backward in what she knew was a very ungraceful crawl. He grabbed a condom from the bedside drawer before settling between her legs once again. She was surprised when he lifted her legs against his chest and shoulders, elevating her hips into the air. Without any warning, she felt his large cock probe her wet slit before he plunged into her.</p><p>“Ahhh, God!” she screamed as her body rushed to accommodate his size.</p><p>He strained to hold back asking, “Too deep?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Just give me a minute,” she panted. When he used his thumb to start rubbing her clit, she forgot her discomfort. She wouldn’t have cared if he split her in two. She circled her hips, moaning when she felt his cock sliding further inside her. “Seth . . . ple-e-ease.” He didn’t need to be asked twice. His buried his cock inside of her again and settled into a relentless rhythm that she was helpless to resist. When his grip loosened on her legs, she wiggled them free and wrapped them around his lean waist, raising her hips to meet each thrust.</p><p>“Holy fuck, Mia!” he shouted as her body started to shudder around his. She felt his cock start to twitch and then he was coming apart along with her. He continued to slide in and out afterward, bringing them both back down from their high. She was too exhausted by that point to move. She was dimly aware of Seth going into the bathroom and coming back. She thought she should offer to go home now, but she couldn’t find the strength to care. She curled against the warmth that settled at her back and was fast asleep within moments.</p><p>Chapter Seven</p><p>“Morning, kid.” Mia looked up from loading her messenger bag behind her desk to see her boss, Hank, walk into her office and shut the door behind him. She gave him a smile in return before she finished adding the last items she needed for her work at the Oceanix Resort that day.</p> <p>She saw a cup of coffee sitting on her desk and alarm bells went off. Hank always brought food or drink with him when he had any kind of bad news to impart. Shit, had someone on her team quit? Giving him a wary look, she dropped down into her chair saying, “Er . . . something wrong?” He looked surprised before she gave a pointed look at the cup of coffee.</p><p>“You young people have me all figured out, don’t you? I feel like a grandpa trying to handle a pack of evil geniuses.”</p><p>Mia smirked. “Yeah, that’s a conversation for another day. By the way, you’re only in your forties, right? I don’t think you could qualify for my grandpa yet. So . . . what’s up?” He shifted uncomfortably in his chair and was that . . . my God, was he blushing? What in the hell?</p><p>“Um . . . kid . . . this is,” he stuttered before finally blurting out, “well, Suzy Merimon saw you and Seth Jackson going at it like rabbits at some restaurant last night. God damn, that was awkward as ass to say!”</p><p>Mia felt as if someone had just punched her in the gut. She knew she looked just as stunned as she felt. She couldn’t remember exactly what had happened during dinner last night. Things were a little hazy thanks to all of the wine that they had consumed. She did know that there had been some very hands-on moments, none of which would probably look innocent to a spectator. Hank was waiting on her to respond with what looked like equal parts curiosity and embarrassment. Denial wasn’t even an option here and they both knew it. She absently lifted a hand to massage the now pounding headache beating against her temple. Sighing she said, “This totally sucks. I color outside of the lines at work for the first time ever and get busted by my freaking idol, Suzy. By the way, how did she make the connection? It’s not like we are drinking buddies or anything.”</p> <p>For the first time since he entered her office, he had a genuine smile on his face. “Those crazy-ass shoes of yours finally got you in trouble. I have been telling you that would happen. To be fair though I just thought you would fall on your face or down a set of stairs. I never thought of them getting you cold-busted in an, um . . . well, you know.”</p><p>Confused, she said, “I still don’t follow you. What have my shoes got to do with it?”</p><p>“Well, that’s just it, kid. Suzy called down this morning and said that she was dining at the Ivy last night with her husband, Gray, and a few friends. Gray saw Seth but did not know you. Suzy said that she recognized you. She always admired your ‘funky shoes’ when she saw you at the office. Gray knew that Danvers was in the middle of an installation at the Oceanix so he was going to go over and speak to Seth. Suzy managed to convince him that he shouldn’t disturb you two since you were obviously on a date. I guess she asked around and came up with your name and traced you to this department. She said that she intends to mind her own business even though she now knows that you were out with a customer you are currently working with. She hopes that you will keep things with Seth under wraps until the job is complete. She is kind of a nosy broad, isn’t she?”</p><p>She waited for Hank to add some comments of his own, but the silence in her office continued to lengthen until she knew he was waiting for her reaction. She looked him in the eyes and said, “It’s true, of course, you know that. It came about in a rather different manner from what you would think, but I was out with Seth socially last night.”</p><p>She really hoped he didn’t ask for clarification on exactly how the date had happened. Somehow, it seemed a little strange to tell your boss that your mommy had bought you a date for $18,000. “I know that this is a very bad lapse in judgment on my part. I . . . I didn’t mean for anything to happen with him until after my work was finished there.”</p><p>Hank ran a hand through his hair, looking like he wished he were anywhere else. “Kid, I don’t need any details here, either. I’m not your daddy or your girlfriend. You are a grown woman and damn good at your job. I know this situation bends the rules all to hell, but I’m just going to pretend that I don’t know anything about this. As far as I’m concerned, I’m taking Suzy’s line and minding my own business. Just please make sure this doesn’t come back to bite both of us in the ass, okay? If you and Jackson can’t keep your . . . whatever . . . off each other, then be discreet about it until we finish up there. We sure don’t need him getting pissed and letting everyone, including Jason Danvers, know about our lapse of policy, so be careful.”</p> <p>Trying to lighten the mood because Hank looked so miserable, she smirked. “Be careful? You aren’t talking about . . . ?”</p><p>He wadded a piece of paper off her desk and threw it at her. “No, you smartass, I’m not giving you a condom speech!” Even though she still had the urge to crawl under her desk and pretend this whole conversation had not happened, she could tell that he appreciated her attempt at humor.</p><p>Seth jerked out of bed as his phone shrilled from the nightstand. The clock beside it showed 8:20. Shit! When was the last time he had failed to set his alarm or even needed the alert? His internal clock usually had him up long before he needed to be. He grabbed the phone and saw the office number on the caller ID. “Jackson,” he barked.</p><p>“Well, well,” drawled Margie, “are we sleeping in this morning? Your eight o’clock is here. Should I send him down for a free breakfast while you finish up . . . whatever it is you’re doing?” It was times like this when he wasn’t sure if he loved or hated her.</p><p>“Fuck,” he snarled into the phone. “Tell Marshall that something came up and reschedule him.” When Margie chuckled, he knew what she was laughing about. Grudgingly he smiled saying, “Don’t even think of commenting on that or I’ll fire you . . . again.”</p><p>“I wouldn’t dream of it, boss. Are you going to be here for your ten o’clock conference call or do I need to move that as well?”</p><p>Seth looked around the bedroom for the first time, wondering where Mia had disappeared. He didn’t see any of her clothing on the floor and the bathroom door was open, showing no sign of life. Absently, he scratched his head while saying, “No, I’ll be there soon.”</p><p>When he didn’t immediately end the call as usual, Margie asked, “Was there anything else?”</p> <p>He knew this next question was a bad idea, but he asked it regardless. “Is . . . um . . . Mia there today?”</p><p>Sounding deeply amused, Margie said, “Yep, she just walked in the door. Might I say, she is just glowing today.” He knew there was no way that she could possibly know that he had slept with Mia last night, but damned if she didn’t sound smug. He had long suspected that she stalked him just for kicks in her spare time. Now he was starting to believe that maybe he wasn’t just completely paranoid about that assumption. He took satisfaction in ending the call without responding. That woman was a pain in his ass.</p><p>When had Mia left and why hadn’t she said goodbye? Fuck, Jackson, you sound like a woman. Isn’t this what you prefer? Avoid the whole awkward morning-after scene? You should be grateful that she made the walking away part easy for you. The problem though was that he wasn’t sure that he wanted to walk away. Last night he had fallen in lust with her in a big way. She took everything he had to give her and then demanded more. She was insatiable and he was even more intrigued by her than he had been at the start. His cock was hard and throbbing remembering her waking him in the night with him in her mouth. She had proceeded to suck him dry. He had tried to pull out when he knew he was on the verge of exploding, but she had tightened her grip, swallowing every bit of his load before letting him collapse against the pillows. When he had recovered, she had climbed on top, seating his cock to the hilt. He could still feel her hot pussy gripping him as he stroked and pinched her plump nipples into taut peaks.</p><p>Damn, there was no way he could go into the office with the hard-on he was sporting. He walked to the bathroom and started the shower. With the steam rising over the top of the glass enclosure, he took his cock in his hand once again and squirted some body wash onto the hard length. Slipping his hand up and down, he imagined Mia’s hands on him. As his body was jerking in release he thought, I’m locking the door when Margie goes to lunch and fucking Mia in the control room.</p><p>Chapter Eight</p><p>Mia had enjoyed a quick cup of coffee with Margie before escaping to the control room to get started. She had tried to appear ignorant when Margie had called Seth about his missed appointment. Maybe she should have woken him before she left this morning. She wasn’t sure what time he usually started his day. She was typically up early and most mornings had a jog or a walk on the beach before work. She had called a taxi and left his place around six a.m. That hadn’t been easy since she hadn’t known his street address. Luckily, she had found a magazine with a mailing label, before she had to resort to digging through his wallet for his driver’s license. She was surprised to find her car sitting in its assigned spot when she got home. How had Seth managed that? She had to admit, she was impressed. Hell, the whole morning after had felt good, until the embarrassing talk with Hank. She didn’t know what was worse, Suzy seeing her or Hank fumbling over the whole incident.</p><p>What was she going to do about the situation? She had fully intended to keep seeing Seth if he was interested, but now that was on hold. She didn’t think he would be thrilled about the whole situation, either. It was only a few weeks until things wrapped at the Oceanix Resort, but that seemed like a year at this point. She had never been with a man so in tune to her body. He gave her everything she needed without having to ask. He was rough when she wanted it and gentle when needed. Even after last night, her body still burned for him. She had been pleasantly surprised at dinner. Before she had had one too many to drink, she had been surprised by how easy he was to talk to. Once he loosened up, he was funny and charming. She had never had this kind of rapid-fire connection to a man before.</p><p>The one thing she hated though was how unprofessional this made her look at work. Sure, no one other than Suzy and Hank knew, but they were probably the two people that she admired the most at Danvers. Hank was her mentor and Suzy was her idol. She took pride in her work and her reputation and she couldn’t have everything completely blown over a man. Especially one who was likely just in it for the sex. Shit. Thanks a lot, Mom. If you had resisted the urge to buy me a man, this might not have happened. Now that the pot was stirred, it was going to be hell to pretend that nothing had ever happened . . . but she could do anything after another couple weeks, right?</p><p>Seth walked into his office whistling and abruptly stopped when Margie smirked at him. He figured he had two options: ignore her and wait while she dropped hints all day or just ask her what was going on. Even as he opened his mouth, he knew he should have gone with the first option. “Good morning, Margie. Is there anything I need to know?”</p><p>“Good morning, boss. Marshall was a little miffed about missing his appointment with you, so I offered him a free meal downstairs one evening. He seemed thrilled with that.”</p><p>“Is that all?” he asked hesitantly.</p><p>“That’s it for now. Is there anything you need to tell me?”</p><p>He backed toward his office shaking his head. Shit, how did she do that? Surely, Mia hadn’t told her anything about last night. He would have to find a way to let her know nicely that he didn’t want any of his private business known to his employees. He also hoped that she wouldn’t tell her mother just how successful their date had been.</p><p>His eyes went directly to the control room. What he saw there brought to mind a particular fantasy that he had been having since he met her. She was standing with her back to him. She was reaching above her head to examine a set of wires. Her form-fitting black skirt stretched against her firm ass with every movement. She had on a sleeveless white top and a pair of fire-engine red heels. His cock throbbed as he imagined shoving her skirt up around her waist, ripping her underwear off, and taking her from behind. He would bring his hands around the front of her top and cup her tits through the fabric, teasing them with his fingers. He would then lower his hands . . . suddenly, he couldn’t wait any longer. He didn’t care if Margie smirked at him for the next damn month; he had to touch Mia . . . now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Seth moved silently into the control room behind Mia, stopping to quietly shut the door and turn the lock. As if sensing his presence, she started to turn toward him, a look of surprise on her face. He stopped her progress with a hand on her waist. “No, baby, face forward like you were.” He reached lower to squeeze her ass, saying, “I couldn’t think of anything but doing this the first time I saw you in here.” He heard her breath hitch as he used his feet to wedge her legs farther apart. As his hand slid under her skirt, he had never been more grateful for thong underwear and women who refused to wear hose in the summer . . . God bless them. She rubbed against his hand, like a cat wanting to be stroked. He followed the line of her thong, sliding past the sensitive skin of her ass before finding her already wet slit.</p><p>She moaned as his fingers stroked through her heat before abruptly stiffening. Her legs tried to close against his hands as she said, “Seth . . . wait . . . we can’t.”</p><p>He lowered his head to her ear, nipping it lightly with his teeth. “It’s okay, baby, I locked the door when I came in. We just need to be quick before Margie starts looking for me.” When he attempted to move his hand between her legs again, she held firm even though he could feel her quaking.</p><p>“It’s not that,” she whispered. “My boss knows about us. I can’t let anything else happen until the job here is finished.”</p> <p>“How?” he asked, wondering if everyone including Margie had been spying on them last night.</p><p>“Suzy and Gray Merimon were at the Ivy. Suzy recognized me from Danvers and Gray recognized you, although luckily not me. She told my boss, because she wanted me to cool things before someone else found out.”</p><p>He felt his cock scream in protest as he pulled back slightly. Having something you wanted literally in the palm of your hand and having it yanked away was sheer torture. He had only known Mia for a few days, but he had a feeling he would have a severe case of blue balls if he had to wait a day, much less a week until he had her again. He had never wanted another woman the way he wanted her. He had turned into a horny teenager seemingly overnight and his cock now ruled his head. Fuck! He still had one hand between her legs and one on her ass. Neither of them had bothered to move farther away from each other. “If we keep this quiet, no one would ever find out. We could avoid being seen together in public until the project is finished here. Hell, what I want to do with you would get us arrested in most states.”</p><p>She finally eased away from him, letting her skirt drop back into position. When she turned to face him, he could see the desire and the conflict on her face. “You have no idea how much I want to take you up on that. And you’re right, we could probably get by without being caught, but I would know. My job at Danvers is one of the things that I am most proud of. I got it on my own, without my parents’ help or their approval. It just seems . . . wrong to sneak around. Could you wait for me until we’re finished here?”</p><p>Seth looked into her big blue eyes and knew he would agree to whatever she wanted. He might need to ice his lap by the end of each day, but he could make it if it meant another night with her. Giving her a smile, he said, “Yeah, I guess I can do that if you can do something for me?” When she gave him a questioning look, he looked down at her skirt and said, “Please don’t wear anything like that again. Nothing is going to stop me from fucking you if I walk in this room and see you like that again.” With those last words, he went back into his office, pulling the door to the control room closed behind him. He needed the visual out of his mind if he was to survive the day.</p> <p>As he settled into his chair, preparing for his morning conference call with his family at the other Oceanix Resorts, he felt a trickle of unease. What was he doing with Mia? Hadn’t he decided to avoid romantic hassles and just keep things casual? Of course, he had only agreed to wait until she was finished with the installation project before they had sex again, but that was still a commitment of sorts. When Margie buzzed his phone to let him know the others were ready for the morning conference, he shrugged his paranoia aside. It was just no-strings-attached sex. Nothing had changed for him and he needed to remember that.</p><p>Chapter Nine</p><p>Mia knocked her head against the wall in frustration. Her installation at the Oceanix Resort was now running into the fourth week. It seemed like there was something that happened daily to push them further behind schedule. Of course, no one else at Danvers was complaining because the cause of most of the delays was the Jackson family deciding to upgrade more of their communications and security equipment. Even Seth had contributed to the project delays. He was having monitors installed in his top-floor penthouse so that he could view any area of the resort from there. She understood his reasoning. It was a lot easier for him to look at a camera in the evening rather than walking through the hotel and being stopped ten times on his way.</p><p>Today the finish line was finally in sight when the latest problem cropped up. Their last shipment of cameras had been damaged upon delivery and were going to have to be returned and another set ordered. They could have them overnighted, but she still cursed the delay. She was horny and oh-so-frustrated. The one good thing to come from it all was the additional time she had been spending with Seth.</p><p>They had kept to their word and there had been no sex and just a slight blurring of the lines between business and pleasure. More days than not, they managed to find the time to have lunch together in the dining room downstairs. They also usually had a cup of coffee together in his office in the mornings and sometimes a snack in the afternoon. At first, she had done most of the talking. She had told him about going to Brown University and then getting a job at Danvers. He knew her parents well enough to know how they felt about their daughter being a technology geek who was determined to find employment without their help. He constantly asked questions and seemed genuinely interested in her life. After a few days, he opened up to her about his parents and his family. She learned that out of all of his brothers, he was the closest to Ash who ran the Oceanix Resort in Charleston. He laughed as he told her about all of the hell they had raised when they were young and about his mother wanting to send the lot of them to military school. He was glad that his father had put his foot down and said that boys should be boys. Sadly, that seemed to be a saying that his father had continued to live by in his personal life until the very end.</p><p>She knew it was only supposed to be lust between them, but somewhere along the way, she had really started to care for Seth. Maybe if they hadn’t been forced to put off having sex, things might have been different. Now, she had gotten to know him more as a person rather than just a sexual partner and that could be bad. Despite the obvious enjoyment of each other’s company, he hadn’t suggested anything beyond sex. Never had there been the mention of an actual date. She was afraid that the delays at the Oceanix Resort could well end up breaking her heart.</p> <p>It was Wednesday, and the official finish date for the installation was Friday. Mia hoped to finish on Thursday afternoon and surprise Seth that evening. She knew that he was having some painting done at his beach house, so he was spending every night at the hotel. She could barely control her need for him. Her desire for things to go further was also getting harder to ignore. Shit, maybe the old saying was right; Why buy the cow if you’re getting the milk for free? In this case, she was the cow and Seth had already tasted the milk. That was one saying she dearly hoped wasn’t true.</p><p>Seth was wired and edgy. Having Mia close for weeks had been somewhere between heaven and hell. She had done as he asked and not worn a skirt, but it didn’t help. She would look hot in a burlap sack. His cock had been hard so much that he felt like every drop of blood in his body stayed pooled there. He had missed meetings and was scattered on his calls. He cancelled anything that threatened to interfere with his lunch with her each day. He knew he sat riveted as she told stories of her childhood and later years. His brothers had actually been making fun of his unorganized state. His life seemed to be in some sort of free fall lately and he placed the blame squarely on Mia’s beautiful shoulders. Even Margie had long since stopped smirking at his behavior and now just gave him pitying looks. Hell, he had a longer relationship with his dry cleaner than he had with Mia, so why was he letting her practically take over his life?</p><p>As he sat brooding, his personal line rang and he absently answered. When he heard Ashley’s sultry voice on the other end, he couldn’t help but smile. They had grown up together and dated for about a year before she had moved away to California to pursue her true love: acting. She was now a regular on a daily soap opera, which she seemed to love. Their relationship had always been more a friends-with-benefits one rather than a great love affair. She was blonde, beautiful, and sexy, but best of all, a genuinely nice person. When she was in town, more often than not, they had dinner and sex. No strings, nothing exclusive, just two people who enjoyed each other both in and out of bed. He hadn’t seen her in well over six months so he was pleasantly surprised to hear her voice. He also shot a quick look toward the control room to confirm that Mia was still in the penthouse with her team working on the installation there. Fuck, why should that matter?</p><p>“Seth! It’s been so long, darling, I’ve missed you!” He smiled at the southern twang that working for years in California had never quite taken away. She told him that it was one of the reasons the producers of the show loved her so much; she was different.</p><p>“Ashley, it’s great to hear your voice. I thought you had forgotten about your friends here. I hear you are doing well, though.”</p><p>“Oh, I am,” she laughed. “We can save all of that for tonight, though. I’m in town visiting my parents for a few days and I would love to see you before I leave.” She lowered her voice to a purr, adding, “How about I come over to your place around seven?”</p><p>“Shit, Ashley, I’ve got a dinner meeting tonight that will probably run late. How about tomorrow night?”Margie walked into his office just as he was finalizing his plans for the next evening. When he ended the call, he couldn’t miss her frown of disapproval. Fighting the urge to roll his eyes, he asked, “What have I done now?”</p><p>Ignoring his question, she asked, “So Ashley is back in town?”</p> <p>He smiled, knowing Margie had always liked Ashley. “Yeah, just for a few days, though.”</p><p>“You’re going out with her tomorrow night?”</p><p>He was puzzled by her sudden interest in his old friend. Other than making a few off-color remarks through the years about his fuck-buddy, she had never shown much interest in Ashley’s visits when she came by the office. “Yes, I am. Do you have a point?”</p><p>“Yes,” she snapped, “that you’re involved with Mia. Don’t you think it might be a bad idea to see Ashley?”</p><p>Beyond irritated now, he said, “I’m not ‘involved’ with Mia and there is no reason I shouldn’t have dinner with a friend if I want to. Now if that’s all, I need to get back to work.” He knew a verbal dismissal never worked on her and this time was no exception. He could see her physically digging in her heels.</p><p>“Oh, well, excuse me for misunderstanding. I guess the fact that you have been running around here like a schoolboy with his first crush the last few weeks doesn’t mean anything at all. I’ve never known you to put a woman ahead of work and yet you have cancelled at least five meetings lately so that you are free to eat with her. Heck, at this point, she probably thinks you don’t work at all. There are more hormones raging in this office between you two than in a strip club at happy hour.”</p><p>Seth could feel his face color at Margie’s comments. The fact that she was right about all of it made it even worse. He was helpless to hide his defensive tone when he said, “Can we stop making this into a big deal? Ashley and I are just having dinner. As for Mia, it’s just casual. Stop trying to see something that isn’t there.”</p><p>He almost preferred the anger in her eyes to the sympathy that filled them now. “You’re going to screw this up, and short of locking you up in the trunk of my car, there is nothing I can do about it. Mia is a nice girl, Seth. Give yourself a chance to have someone like that in your life.” With that parting line, she quietly closed the door behind her. Shit, he would have preferred if she slammed it.</p><p>When Mia walked in an hour later, he had once again moved his schedule around to have lunch with her. He knew he was a distracted companion at best with Margie’s words still echoing through his conscience. Was he grabbing onto Ashley’s visit like a lifeline to get some distance from Mia? Whether he admitted it to Margie or not, he knew where his evening would go lead with his friend. Making a date with her wasn’t only agreeing to dinner. He felt guilt eat at him as Mia sat across from him giving him her usual easy, genuine smile. She was so fucking beautiful his heart stuttered just looking at her. Could there be more between them than sex? Was he even interested in finding out? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m not wearing any panties.” His body jolted as Mia’s words caught his attention. She gave him a devious smile as she watched him struggling to recover his composure.</p><p>“Honey, now might not be the best time to tell me that.”</p><p>She gave a soft chuckle before admitting, “It’s not true, but I had to say something to get your attention. I’d already asked you a question three times, but you were staring off into space.” Her amusement turned into a look of concern as she asked, “Is everything okay?”</p><p>He allowed himself a small show of public affection as he rested his hand over hers briefly. “Yeah, it’s fine. Things have just been hectic this morning. Speaking of, I heard about the latest delay with the cameras. Are you still looking at finishing on Friday?”</p> <p>“That’s the plan. I know you’re ready to have your office back,” she joked.</p><p>“I’m also ready to have you under me again. Is that also part of your plan?”</p><p>Mia took a sharp breath, looking completely floored by his comment. He had been a bit surprised when he said it out loud as well, but it was the truth. It had been far too long since they had been together and he could barely think of anything other than sliding into her hot body again. “Yes, that is a big part of my plan. I would love nothing better than to go back to your office and fulfill your fantasy of bending me over the desk.”</p><p>Seth felt his cock harden at her provocative comment. She even had the gall to lick her lips in a slow, tortuous display. Fuck! It looked like the gloves were coming off. The next forty-eight hours were going to be a strain on his self-control, especially if Mia wanted to tease him. He had started a verbal wordplay with her that might just end up burning him. He discreetly adjusted himself under the table before telling her, “Be a good girl or Margie might see more than she bargained for this afternoon.”</p><p>Mia grimaced, saying, “Something tells me it wouldn’t offend her.”</p> <p>“That’s an even more disturbing thought,” Seth groaned. “How about we try to keep it together until Friday night and then all bets are off?”</p><p>She ran her hand over his thigh for a brief moment before whispering, “Oh, you are so totally on.”</p><p>Chapter Ten</p><p>“You know that’s gonna cost you another lunch, right?”</p><p>Mia smiled at Kyle, as he walked toward her from his UPS delivery truck. They had long ago formed a relationship based on bribery and threats. She bribed him with food and he threatened to leave her shipment until last if she didn’t. She loved him and his wife, Sandy, to death. Since he made daily deliveries to Danvers, she saw him more than she saw her own family. Despite their kidding around, she knew that when she was under a time crunch, he would make her his first stop of the day. Truly, he was the one man who had never let her down. “Wow, I was going to spring for dinner, but if you are going to let me off with just lunch, hey, I’m not arguing.”</p><p>Kyle raised his brow saying, “Dinner? Boy, this must be an important delivery. It’s not that I’m complaining about the usual Taco Bell, but I wouldn’t say no to a steak every once in a while.”</p> <p>She staggered back dramatically like the thought was killing her, but she made a mental note to get him and Sandy a gift certificate to somewhere fancy, maybe even the Oceanix Resort. “I’ll see what I can do since once again, you are saving my ass.” In truth, she wanted to break out her victory dance. Getting the delivery of cameras first thing that morning ensured that they were going to be able to wrap things up a day earlier as she had hoped. Everyone on the team would be thrilled. Several had put off their vacations when the install ran later than planned. She waved as Kyle backed away from the loading dock. The shipping department was used to her running down to check shipments when she was expecting a delivery. They had even made her Employee of the Month for their department once because she usually stayed to help them sort the boxes before she went back to her office.</p><p>She ran into Hank coming out of the break room. He had a donut in one hand and a Diet Coke in the other. He saw her smirking at the combination and said, “There is no reason to add insult to injury, kid. When I go to the gym after work, I’ll only have to work the donut off. So, how are we looking at the Oceanix? We on schedule to finally get the hell out of there tomorrow?”</p><p>Mia wiggled her eyebrows and said, “I’ll give you one better, boss; we should be done today.”</p><p>He finished chewing his bite of the powdered-sugar treat before saying, “No shit, that’s good. Who did you have to bribe to accomplish it this time?”</p><p>She chuckled and said, “You know I never reveal my sources. As soon as I have Danny load the boxes in the van, I’ll be on my way.” She felt herself blush when she asked, “Um . . . are you okay with me taking a personal day off on Friday if there are no problems on the job?”</p><p>When Hank looked down at his shoes, she knew that the reason for her request wasn’t lost on him. Shit, how embarrassing. For all she knew, Seth had something important going on Friday and wouldn’t be able to spend the day in bed as she was hoping. It never hurt to be prepared though, right? She never took all of her vacation or personal days so she had plenty to work with.</p><p>“Sure, no problem. You better get going if you are going to finish today, though.” Her mouth dropped when he threw over his shoulder, “Give Jackson my best.” Yeah, the reason for her request hadn’t escaped him at all. Oh, well, a little embarrassment was well worth a day of Seth . . . naked.</p><p>Seth had cursed at his desk when he realized that he would have to miss lunch with Mia. He was scheduled to meet with the bank to discuss the possibility of building another Oceanix in Myrtle Beach. There was easily enough tourism and local traffic to support a second location. He was friends with his banker, Miles Keaton, which was not good when you wanted to keep a meeting brief. After meeting in his office at the bank for an hour, they were now settling down to lunch at a nearby bistro. He had already let Margie know that it would be the afternoon before he would be back in the office and he had asked her to let Mia know as well.</p> <p>He had also failed to cancel his dinner date with Ashley. She had texted him earlier to let him know that she was picking up the ingredients for spaghetti and would be cooking for him at the penthouse tonight. She knew that was one of his favorite meals and after all of her trouble, he hadn’t been able to bring himself to cancel on her. After all, they were friends first and foremost. He had alternated between feeling like he was cheating on Mia for having dinner with Ashley and feeling pissed at himself. They had had sex once. There was no relationship. Sure, he was going to see her again tomorrow night, but there was nothing exclusive between them. Maybe he needed to see Ashley to drive that point home. This thing with Mia was messing with his head and he was tired of it. He didn’t want to feel anything for her other than lust. Sex was something he understood, and the sooner things were back on that track, the better. Maybe Ashley’s visit couldn’t have come at a better time.</p><p>Chapter Eleven</p><p>Mia slathered lotion all over her body. Her workday had ended just an hour ago and she had rushed home as soon as she had finished her final task. She had phoned Hank to let him know that the job at the Oceanix was complete. Seth had been out of the office when she left so it had been easy enough to leave without him knowing. Nick Merimon would officially contact him tomorrow to let him know that the work was complete. If Mia had her way, Nick would only reach Seth’s voicemail.</p><p>She opted for a short skirt with a slinky halter top. She thought he would appreciate being able to live out his fantasy of bending her over and pulling up her skirt. Truth be told, that had been on her mind every day while she was working. She couldn’t remember ever being in such an almost constant state of arousal as she had for the last few weeks. As much as she loved her job with Danvers, she had been tempted to ignore Hank’s warning and throw caution to the wind. Her nipples throbbed against the lace of her demi bra as she imagined his hands on her body again. Even her thong rubbing against her clit was almost enough to send her over the edge.</p><p>She had no idea what Seth’s schedule was this evening. The private elevator to the penthouse of the Oceanix Resort opened into the foyer with a view of the living room. The elevator code had remained the same during their three weeks of work there. She was slightly nervous about dropping in on him unexpectedly, but she hoped that it would be a surprise he would love. Everything about their relationship so far had been spontaneous and she wanted to keep it that way. She stepped into a pair of black heels and took one more look in the mirror before turning to grab her purse and keys. This was it, the wait was finally over.</p><p>Seth was in over his head and he wasn’t sure what to do about it. Had Ashley always been this aggressive and he just hadn’t noticed? Despite his obvious lack of encouragement, her tongue had been in his mouth once and her hands had wandered over his cock at least three times. Fuck, now her foot was running up his leg from across the table. If he thought not sitting right beside her would deter her, he was sadly mistaken. And if he didn’t know better, he would swear she had at least four pairs of feet and hands. He had known he was in trouble when she announced that she was finished with acting and planning to move back east. It seemed obvious that she was now looking for more than friends with occasional benefits.</p><p>He wasn’t sure how he was going to deal with her when he no longer had the semi-protection of the dinner table between them. They had been friends for a long time and he hated to hurt her feelings, but he wasn’t sure how else to handle it. He wouldn’t have been interested in a relationship with her even if Mia weren’t in the picture. Dating her in school had been enough to show him that they didn’t have much common ground outside of good sex. He had always enjoyed her company, but tonight, he didn’t even feel like he knew the Ashley who had shown up at his door. This one seemed to have an agenda and he had a bad feeling he was it. His brothers had dealt with their share of women wanting them for the Jackson family money, but that was something he had never come across. Ashley was from a well-off family, so surely this wasn’t prompted by that. Biological clock ticking? She was barking up the wrong tree either way.</p><p>When dinner was over, he made a show of yawning. He gave her a sheepish look saying, “Sorry, it’s been a long day and I’m wiped out.” When she settled down close beside him on the couch, he knew that the not-too-subtle hint had rolled right over her head. Her hand was once again back on his thigh. His cock didn’t seem to be able to tell when his head was into it or not. Ashley had her hand close enough to feel the sudden interest of the traitor in his pants. The situation was becoming awkward in a hurry. He grabbed her wrist as it connected with his zipper, halting her at least temporarily. He used his other hand to pick up the television remote and the sounds of ESPN soon filled the room. He gave her a bright smile saying, “You don’t mind if I catch the scores, do you?”</p><p>Ashley puckered her lips into a pout. Before he knew what was happening, she had hooked a leg over his hips and was straddling his lap. In seconds, the short dress that she was wearing was over her head and lying in the floor. Holy shit! There was no bra in sight. Her perfectly erect nipples were now even with his mouth, and his cock was going crazy beneath her firm bottom. She rubbed seductively against him as she lowered her head to whisper in his ear, “Forget the scores, the bases are loaded. It’s your swing.”</p><p>Seth knew he lost control for a few seconds before he managed to get it together. As a guy, having the sensory overload of a naked female in your lap pushing every button that you have was something damn hard to regroup from. Her hands on his cock finally jolted him enough to pull back and at what he saw when he did, ice ran straight through his veins. Mia stood in the entryway of the living room looking at him in horror. His mind was frantically buzzing, trying to piece together how she could be here to witness what was no doubt a damning scene. He pushed Ashley’s hands roughly away from him, sitting her none too gently on the couch beside him. Possibly that hadn’t been a great move since Mia couldn’t miss Ashley’s exposed breasts now. She was still staring at him, but her feet were carrying her backward as if she couldn’t look away from the train wreck long enough to turn around and flee. He got to his feet, ignoring Ashley’s questions as he made his way toward Mia.</p><p>He was afraid she would run before he reached her, but she had stopped, waiting for him. The confident woman that he was used to looked more like a confused child, causing something inside of him to clench in remorse. “Mia, honey, what are you doing here?” Yeah, shit, that didn’t sound guilty at all.</p><p>“I . . . we finished early. I wanted to surprise you tonight. I . . . did, didn’t I?”</p><p>He took her arm, gently saying, “This isn’t what it looks like. She . . . um . . . caught me off guard. It wasn’t going any further.” Ashley’s roar of outrage rang off the walls of his apartment and seemed to snap Mia out of her trance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She jerked her arm out of his and gave him a look of such contempt that he flinched. “Do me a favor and don’t lie to me. I’m sure you fully planned to sleep with her tonight and with me tomorrow night.” She laughed a laugh devoid of humor. “You know, I had actually started to believe the last few weeks that you were someone of substance. I pushed myself and the entire team to finish early because I thought there was something . . . more between us. Thanks for the wake-up call.”</p><p>Seth felt her words flaying him. Despite the anger now radiating off her in waves, he could see tears gathering in the corners of her eyes. “Mia . . .”</p><p>She held up her hand, stopping him. Her anger seemed to have fled as fast as it had erupted. She held his gaze for another moment before saying, “Just don’t, Seth, please. You don’t owe me anything . . . anything at all. I saw something that obviously wasn’t there, at least on your part.” With those parting words, she walked through the foyer and into the elevator. As the doors closed, he stood there stunned by what had just happened. He had the very real urge to pinch himself to see if this was some kind of a dream. He still couldn’t fathom her showing up out of nowhere at the exact moment that Ashley was sitting on him practically naked.</p><p>“Fuck,” he muttered. He turned to find Ashley slipping her dress back over her head. He knew things were just as bad as he thought when she walked toward him with a look of pity in her eyes.</p> <p>“Seth, if you had told me beforehand that you were involved with someone, this would have never happened. I may be many things, but I’m not the other woman. I don’t have to be.” Her look of pity turned to a look of disgust in the blink of an eye. “You really hurt that woman. You should have manned up and broken up with her instead of letting her see something like that.” For the second time in so many minutes, another pissed-off female stalked to his elevator and left.</p><p>Unfucking believable. Ashley, who had removed her clothing and shoved her tongue in his mouth and her hand down his pants, was his judge and jury. Mia, whom he had slept with once, had looked heartbroken. Even as he tried to convince himself that he wasn’t in the wrong, a part of him was torn up over what had happened. It was obvious that she had seen more happening between them than casual sex. If he were honest, hadn’t he started to feel that way as well? Dammit, Ashley was right; he could have prevented this whole mess if he had just leveled with her. He had kept their dinner date to prove that he wasn’t tied down to anyone.</p><p>His denial of his growing feelings for Mia was to blame for everything that had happened tonight. He didn’t want to accept that he could be feeling something more than lust for someone he had only met a month ago. Things like that just didn’t happen to him. He had let his guard down for a brief time when he met Beth and look how that had turned out. Mia scared him shitless and he hated that out-of-control feeling. He wasn’t sure it even mattered anymore. The look on her face when she left didn’t bode well. He needed a few days to figure out what his next move would be. One of his brother Ash’s favorite sayings came to mind: Piss or get off the pot. He couldn’t think of anything that fit the situation more. He was either all in or he would have to walk away from her.</p><p>Chapter Twelve</p><p>The insistent knocking at her door showed no sign of stopping. Even with the comforter pulled up over her head, the sound still reverberated around the bedroom. “Shit!” Jumping out of bed, she stomped through her condominium and jerked the front door open without bothering to look through the peephole. She took a step back in surprise when she saw her immaculately dressed mother standing on the other side. She could count the number of times her mother had visited her at home on one hand, and she had never just shown up without making a formal appointment.</p> <p>“Mom, what are you doing here?” She had to give her credit. She barely noticed the slight grimace that she made as she took in her daughter’s disheveled appearance.</p><p>“Mia, darling, I was worried about you. I have been calling you since last week and you haven’t returned any of my calls. I even called your office and they said that you were taking some vacation time this week. I’m used to you never answering your phone, but you do usually call me back within a day. I could only assume that you must be gravely ill.”</p><p>Being scolded by her mother was like being in grade school and being called to the principal’s office. “Sorry, Mom. I haven’t been checking my messages for the past few days. I needed some downtime. Was there something you needed?”</p><p>Her mother raised a perfectly plucked brow saying, “Well, you could invite me in and then we can go from there.”</p><p>Mia stepped aside and waved her inside. Crap, why didn’t I return her call? Her mother then did something else strange. She settled on the sofa as if she intended to stay for a while. Hadn’t she been through enough lately? Was she going to be forced to play caring family now? This whole visit was starting to seem suspicious. Shit, surely there wasn’t more bad news coming? “Is there . . . um . . . something you want to talk about?” she asked cautiously.</p><p>“Well, of course,” her mother replied, looking surprised. “I wanted to see what was happening with Seth Jackson. When we spoke after your dinner with him, you said that you would be seeing him again after your business there ended in a few weeks. When I hadn’t been able to reach you for several days, I assumed you were together, but Margie says that isn’t the case.”</p> <p>Mia’s mouth dropped. “You called Seth’s assistant to ask if I was dating him? Mom!”</p><p>Her mother looked surprised at her shock. “What? Margie and I are on friendly terms. I called to thank Seth again for his contribution to our charity auction and since I hadn’t spoken to you recently, I asked her if you were still working there and she informed me that your job ran long, but was finished now.”</p><p>“God, please tell me you didn’t ask her if Seth and I were together,” Mia groaned.</p><p>“Darling, I don’t remember our exact conversation. I believe she just confirmed that he was in the office and in a terribly poor mood.”</p><p>Damn, she knew it. When her mother hadn’t been able to get answers anywhere else, she had called Margie to press her for information. There was no way she was calling Seth weeks later to thank him again. She would have had her secretary do that if she even thought of it. She couldn’t remember the last time she had been forced to discuss her dating life with her mother and she didn’t relish doing it now. God, she still felt too raw to talk about him. She had done nothing but lie around for days throwing herself an outstanding pity party. She had been fortunate that there was a lull in installations at work and Hank had been fine with her taking a vacation week while things were relatively quiet. After seeing her moping around the office, he was probably thrilled to be rid of her for a while, and she had needed time to process what had happened that night at Seth’s penthouse.</p><p>She had gone through shades of anger, disbelief, sadness, and finally settling somewhere in between. She had allowed herself to feel more for him than she was aware of until it was over. In his defense, he technically had done nothing wrong. Sure, you would hope that the guy you slept with and had planned to sleep with again wasn’t also doing it with someone else, but there had never been any promises of anything. They weren’t even officially dating. What did she really expect? Just because it was something she wouldn’t do didn’t mean that Seth played by the same rules. Did that mean she was okay with the whole thing? Hell, no! Even more crushing was the feeling that he wasn’t satisfied with her enough to wait. Nothing about their night together seemed special now. How could it have meant anything at all to him if he was planning to sleep with someone else right up until their next night together? Well, you slept with him on the first date. What did you expect, a marriage proposal?</p><p>Sometimes the voice in her head sucked. She just needed to focus on giving her mother enough information to get her out the door so she could finish her pity party in peace. Sighing, she said, “There really isn’t anything to tell. We won’t be seeing each other again.” To her complete and utter horror, she felt herself starting to tear up. Oh, good Lord, no!</p><p>Unfortunately, her mother didn’t miss the moisture gathering in the corners of her eyes. “Mia, what happened? Did Seth do something to you?” Before she knew what was happening, she had poured out the whole story to her mother, albeit a PG-13 version. She could hardly fathom what had made her decide to lean on her mother for the first time in her adult life and no doubt, she would regret it. But, damn, she just needed to talk to someone. Her friend Nikki didn’t need to hear it while she was dealing with a newborn baby so that didn’t leave many options. Her mother had remained quiet during the story and had pressed a tissue in her hand at the end. Finally she said, “Darling, go pack a bag; you’re coming home with me for a few days.”</p> <p>Mia looked at her in shock before saying, “No, that’s okay, really. I’ll be fine.”</p><p>“Nonsense. Your father is out of town on business so it’s just me there this week. We will have some girl time without him around to be a wet blanket.” Her mother raised a brow at her look of surprise. “What? I love the man, but we both know he can be a bit of a bore at times. Bring your swimsuit, too. We can spend some time at the pool or the beach.”</p><p>Mia was so surprised over her mother’s apparent normalness that she allowed herself to be herded into the bedroom to pack an overnight case. She had no intentions of staying for more than a day. Her mother wouldn’t hear of her driving separately so she got in the passenger side of the Mercedes sedan. They both seemed content to keep the silence and soon they were pulling into the exclusive Sunray Bay in the Garden City Beach area. She knew well that the houses in this area went for millions of dollars. To give her parents credit, their home, although large, was still extremely comfortable with warm colors and soft, inviting furniture. “Is my bedroom still available?” she asked.</p><p>Her mother looked confused, asking, “Well, of course it is, why wouldn’t it be?”</p><p>She supposed it was a rather silly question. It wasn’t like they needed the space. She just didn’t see her parents as sentimental enough to keep a room for her. “Um, no reason,” she mumbled as she made her way upstairs. When she walked into her old bedroom, she wrinkled her nose. Yeah, she had been going through a pink phase back then. Maybe this was one time that her mother should have torn the room apart and started over from scratch. Although, she had to admit she did love her white canopy bed even if it was covered by a bright pink, fuzzy comforter. Damn, had she really liked that at one time? A little pink was fine . . . looking like a bubble-gum-pink–paint can exploded in the room, not so good. She flopped down on the bed and wondered again what she was doing here. This was about the last place she would normally go to get away. A knock sounded at the door and her mother peeked her head inside, saying, “Pop into your swimsuit, darling. I’m going to make a pitcher of margaritas. We can drink too much and insult the men in our life.” Without waiting for her to answer, the door slammed.</p><p>What was going on here? This was feeling more and more like a singles vacation with her mother as the weird cruise director. She was actually starting to sound . . . fun, which was completely unreal. This wasn’t and had never been their relationship. Oh, crap. Something had to be going on. Her mother was going to liquor her up and break the news. She threw on her bikini and walked outside to the pool area. Just as promised, her mother was standing behind the outdoor bar with a blender and two chilled glasses. As if her heart could take any more shocks today, her mother walked out from behind the bar in a bikini and gave her a hug. Had someone here possibly started drinking earlier in the day? Mia cautiously took the drink that her mother indicated and walked over to a lounge. Her mother settled her glass along with a pitcher of the remaining margaritas between them. She gave Mia a bright smile saying, “Honey, go ahead and finish your first glass, you’ll feel much better.” Needing little prompting, she turned the cold beverage back and emptied it. Her glass was promptly filled as a warm buzz started working its way through her system.</p><p>Taking a sip of her second drink, she turned her head to study her mother. Wow, where was the normally reserved woman that she knew? Had they ever spent mother/daughter time at the pool together? Her father used the pool to swim laps, but she couldn’t remember her mother spending much time at it. Something was different. “So, um, Mom, this is . . .”</p><p>“Unexpected?”</p><p>Smiling in relief, Mia replied, “Yep, exactly. It’s nice, just not something we normally do.”</p><p>On a sigh, her mother said, “I know, darling. Believe it or not, I used to be fun when I was younger. Your father preferred me more . . . dignified . . . and eventually when you play the part long enough, it becomes who you are.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Giving Mia what looked like a rather sad smile, she added, “I’m just trying to find the person that I used to be. Your father is away so much on business and it gets . . . lonely here sometimes.” She took Mia’s hand saying, “One of the things I regret the most is never having this type of relationship with you. I bowed to pressure and let the nanny handle most of your care even though I wanted to do it all for you. I’m so sorry I didn’t stand up for us.”</p><p>Mia looked on in horror as her mother burst into tears. She sat up in her chair saying, “Mom . . . please don’t. We can start from today. It’s not too late.”</p><p>Her mother jerked her head to look at her, hope beginning to burn through the tears that still rolled down her cheeks. Mia couldn’t remember ever seeing her cry before. Maybe she should harbor anger toward her, but having the chance for a real relationship with her mother for the first time ever was something too enticing to refuse. “Honey . . . do you mean it? I know I have a lot to make up for, but will you really give me a chance to get to know you and have a place in your life?”</p><p>Mia could feel tears gathering in her own eyes as she said, “I’d love that, Mom, I really would.” Maybe when one door closed, another did open. She was gaining a real mother even as her heart still mourned the loss of Seth.</p> <p>“Margie! Where are last month’s budget figures?” Seth bellowed. Was everyone at the resort completely incompetent? Was expecting everyone to do their damn jobs too much to ask? Margie stalked into his office and slammed the door behind her. She picked up a folder from the corner of his desk and smacked it down in front of him.</p><p>“It’s on your desk where it’s been for days, master!”</p><p>“Margie, I’m not in any mood for any shit today,” he growled.</p><p>Putting her hands on her hips, she glared back at him. “I’m not in any mood for your shit, either, Seth. You have been nothing but an asshole to me and everyone within a ten-mile radius since you lost Mia. If you keep this up, everyone here is going to walk out. I have already had to talk three people out of quitting just today!”</p><p>“Don’t coddle the staff. If they can’t handle being called to task for not doing their jobs, then let them quit.”</p> <p>He saw her face flush red before she threw her hands up in the air and sank down into a chair in front of his desk. He could feel the now-familiar irritation burning just beneath the surface as he waited for her to say whatever she needed to say and get the hell out of his office. He was surprised when she finally raised her head and gave him a look of genuine sadness. “What?” he asked, surprised.</p><p>“I love you, Seth, you’re like a son to me. In the years I’ve worked for you, I’ve seen you at your best and your worst. In all of that time though I’ve never known you to be the cruel bastard that you have turned into. You are being mean, insensitive, and overbearing. I know this all comes from Mia so tell me, what happened?” When he opened his mouth, she added, “And don’t say ‘nothing’; I know better.”</p><p>He stared at her, feeling his heart race in his chest as thoughts of that night crashed back in. He had worked nonstop since then to keep his mind off the look on Mia’s face as she walked away from him. He kept thinking things would get better, but it only got worse. Margie was right: He had turned into a monster, and he couldn’t seem to stop it. He looked at the woman who was more of a mother to him than his own and felt his anger start to fade away for the first time since Mia left. Running a hand through his hair, he admitted to Margie and to himself, “I fucked up royally and I don’t know if it can be fixed.”</p><p>“Oh, honey,” Margie said. “You know between you and me, we can fix anything. Just tell me what we’re dealing with and we’ll go from there.” Without further urging, he poured out the whole sordid mess and watched Margie flinch a few times before he was finished. She shook her head before dropping it onto the desk. He heard her blow out a breath before saying, “Shit, when you screw up, you don’t do it halfway. Geez, didn’t I warn you about Ashley? Where is she hiding out, by the way?”</p><p>Seth snorted. “Apparently, I even turned her off that night. She took off afterward and I haven’t heard from her since. I guess I’m too big of an ass for her.”</p><p>“Probably,” Margie agreed. “All right, let’s start at the beginning. Have you called Mia to apologize?”</p> <p>When he shook his head no, he felt a paperclip bounce off his cheek. “Hey,” he protested, “I was in denial. People in denial don’t apologize.”</p><p>“Well, you’ve pulled your head out of your ass now, so that should be our first step. Give her a call and tell her you messed up. If she gives you long enough before slamming the phone down, try to explain.”</p><p>Seth gave her a disgusted look. “You’re really filling me with confidence here.”</p><p>With an exasperated snort, Margie said, “Honey, this would have been easier if you had just called her fat. I could have worked with that. You had a naked woman in your lap after you had strongly led Mia to believe you were waiting for her. You are going to have to do something that you aren’t used to doing: grovel.” Before he could answer, she added, “And I mean the lick-the-dirt kind. Now I’m going back to my desk and you are going to call her. Do you have her number?”</p><p>Rolling his eyes, he said, “Of course, I’m not completely incompetent.” He knew by the look on her face that she was dying to challenge that statement, but wisely, she continued on out the door. Before he could talk himself out of it, he pulled Mia’s cell number up in his contacts and clicked to connect the call. He was secretly relieved when it went straight to voicemail. He left her a message to call him and ended the call.</p><p>When Margie stuck her head in the door four hours later, he shook his head in disgust. After another five calls, Mia had neither answered nor called him back. He had already looked up the number for Danvers and was fixing to call there when Margie said, “She’s not at work, either. I . . . um . . . took the liberty of calling there and they said she’s on vacation this week. Her home number is unlisted and despite a considerable amount of charm on my part, they wouldn’t give me that number.”</p><p>Seth really wasn’t surprised that Margie had taken it upon herself to track Mia down. She never could resist a challenge and Mia was giving them both that. But, still, he was hanging onto the hope that she would return his call sometime before the day was over.</p><p>Mia had just finished emailing Hank and Nikki to let them know that her cell phone was dead and that she had left her charger at her condominium. They were really the only two people who would possibly try to reach her this week. She had planned to go home today, but with the surprising turn of events with her mother, she was curious enough to stay for a few more days. It wasn’t that their relationship had completely changed overnight, but they were trying. She had always thought she was just fine without the usual parental affection, but now that it was being offered, she found herself soaking it up, unable to get enough. Her mother was actually funny and just a tiny bit irreverent, which was completely shocking. She was still smiling when she rounded the corner to find her mother in a heated conversation on her phone. “Listen here, you had your chance, and you screwed up big time. You had better come up with something more impressive than a phone call if you want to fix this. I expected better from you. Don’t disappoint me again!” With those words, the phone call was ended without a goodbye.</p> <p>“Mom?”</p><p>Her mother whirled around, surprise obvious on her face. “Oh, darling, I didn’t hear you.”</p><p>“Is everything okay?” Mia asked.</p><p>Her mother took a moment, choosing her words carefully. “Yes. It’s nothing really. Your father can just be so . . . thoughtless sometimes. Sometimes a man needs a good challenge so that he can rise to the occasion. I have no doubt that he will figure out a way to get back into my good graces. Now, how about we grab some lunch and spend the day on the beach?”</p><p>Mia could only shake her head at her mother’s lightning change of mood. Her poor father didn’t stand a chance against her. Whatever he had done, she hoped he was smart enough to make amends because it didn’t sound like something that flowers would take care of.</p><p>Seth threw his phone across his office in disgust. Margie had given him Mia’s mother’s number and he had just attempted to reach out to her for help. He gave Margie an incredulous look, saying, “She fucking told me off and hung up on me!”</p><p>Margie winced in sympathy. “I guess Mia told her what happened then.”</p><p>“You think?” he grumbled. “The way Mia spoke of her led me to believe that they didn’t have a close relationship.”</p><p>“Maybe she emailed her,” Margie added helpfully. When he gave her a nasty look, she held up her hands in surrender before saying, “Alright, that was a bad joke. I do have something that will make you happy, though.” She dangled a piece of paper from her fingertips. “I have Mia’s home address.”</p><p>He stood up and grabbed it from her hand. When he started for the door, she yelled, “You have a conference call with Ash and Dylan in an hour.”</p><p>“I’ll call Ash on my way and cancel it.” Without waiting for a reply, he took off out the door and to his car. Hopefully, this was what her mother had meant about doing better than a phone call.</p><p>Days had gone by and he was back in his car stalking Mia’s home. He wasn’t sure when his need to apologize had turned into desperation to make things up to her, regardless of the cost. Once he had finally admitted to himself that he wanted her, the floodgates had truly opened. His pride was definitely taking a beating from his brothers. His pursuit of Mia had Ash laughing his ass off every time they talked. He had suggested that when Seth finally located Mia, he spank her ass and show her who was in charge. He was pretty sure Ash wasn’t joking. He knew enough about his brother’s lifestyle to know that spankings were the norm for him. He didn’t think Mia would be receptive to it, either. He had called her mother countless times and the damned woman hadn’t answered or returned any of his calls. He had even found her address and attempted a drive-by, but was turned away at the security gate of the exclusive community. He continued to leave messages on Mia’s phone to no avail. It was Sunday evening. Surely, she would come home tonight. Didn’t she have to return to work tomorrow? He finally gave up at midnight and drove home to catch a few hours of sleep. Tomorrow he would go to Danvers and see if she showed up for work.</p><p>Chapter Thirteen</p><p>“Welcome back, kid.” Mia looked up as she stepped from her car smiling as Hank walked toward her.</p><p>“Hey, boss-man, you miss me?”</p><p>“Hell, yeah,” he laughed. “I got stuck with all of the shit I usually put off on you.” Then studying her face a little longer than usual, he asked, “How you doing? Everything . . . better with you?”</p><p>Hank didn’t know all of the particulars, but he did know that something had happened with Seth. His concern for her was obvious and she was touched by it. “I’m fine, ready to get back to work.” She wanted to laugh at how relieved he looked when she didn’t elaborate. She knew how uncomfortable he was discussing “lady problems.” He didn’t want to hear that she was still a heartsick fool over Seth Jackson, a man she barely knew, or that she hadn’t washed her dress yet from their night together because it still had the faint scent of his cologne clinging to the fabric.</p><p>“Good deal then. We have some installations to schedule so I’ll tag you when I have everything ready to go over.” They parted ways in the hallway and she spent the morning catching up on emails and returning calls. When her phone rang around lunchtime, she assumed it was Hank. He usually liked to grab a sandwich while they worked on scheduling. “You ready to roll?” she joked.</p><p>“I was born ready to roll,” replied an unfamiliar female voice.</p><p>“Oh, excuse me, I thought you were a man . . . er . . . I mean Hank.”</p><p>A feminine chuckled filled the line. “Yeah, I get that a lot. This is Suzy Merimon. I work . . .”</p><p>“Oh,” Mia gasped, “I know who you are. I freaking love you! Oh my God, please forget I said that. Um . . . what can I help you with, Mrs. Merimon?”</p><p>“I like you. I knew I would. We have the same taste in shoes, after all, and shoes never lie. Could you possibly meet me in the outdoor seating area? I have a . . . situation that I need your help with.”</p><p>As she rushed from her desk to the elevator, Mia belatedly realized that she hadn’t answered Suzy; she had simply rushed off, eager to finally talk to her idol, regardless of the reason. Cool your jets! Never once did she question why Suzy would want to meet her outside. Once she’d made it to the arrangement of chairs and benches under the outdoor pergola, she looked around for Suzy’s red hair. When a hand settled on the small of her back, she jerked around, nearly fainting when she saw Seth. “What the . . . ” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Mia, I apologize for bothering you at work, but I needed to ask you something. Have you moved?”</p><p>“No.” Shaking her head in confusion, she asked, “What are you doing here? I was supposed to be meeting someone.”</p><p>He gave her a sheepish look before admitting, “Yeah, Suzy. She recognized me when I was asking the front desk for your floor. She politely pulled me out here and asked me if I was ‘out of my damned mind. ’ I’m not sure what that means, but she assured me that you wouldn’t want to have this conversation in your office for everyone to eavesdrop on.” Dragging a hand through his hair, he added, “Shit, that woman is scary, isn’t she?”</p><p>Mia felt her heart race as she looked at him. God, he was a beautiful man. Hold onto your hormones, remember what happened. “I’ve got to get back to work.” As she turned to go, he grabbed her arm.</p> <p>“Mia, wait.” She whirled back around, trying to channel all of the anger she had felt that night, but instead it was mostly just hurt now. “Please let me explain and apologize to you for what happened.”</p><p>“That’s not necessary,” she said quietly.</p><p>“Yes, it is. Please . . . just give me five minutes.” When she didn’t object, he took a deep breath and continued. “The woman you saw that night was Ashley. We dated when we were in school and have had casual . . . meetings randomly since then. I know you must think this is bullshit, but I never intended for things to go that far with her. We didn’t have sex, nor would we have. She left right after you did. I was intrigued by you. I still am. I had every intention of seeing where whatever this is between us would lead. You’re a beautiful, funny, intelligent, sexy woman and even though we haven’t known each other long, I’m completely captivated by everything about you. I’m sorry it took me a while pull my head out of my ass, as Margie says, and tell you how I feel. I’m so damn sorry for hurting you, baby.”</p><p>Mia shut her eyes and moisture gathered there. What she wouldn’t have given to hear that from him before that night. “I believe you,” she whispered, “but it’s too late. We had sex and I was hopeful that there was more between us. I just . . . can’t do it again.” Forcing a smile she was far from feeling, she continued, “Other than that one, er . . . issue . . . I really enjoyed our time together. We are just too different for anything more.”</p><p>He picked up a bouquet of wildflowers and a bag from the bench behind him that she hadn’t even noticed and said, “These reminded me of you. Don’t say no again. Take the day and think about it. I’ll call you tomorrow.” Before she could say anything further, he gave her a gentle kiss on the cheek and was gone.</p> <p>She forced herself to go back to her office instead of running to her car and following him like she wanted to. It was over. Hell, it had never really even started. Just because he looked and smelled as good as ever wasn’t a reason to open herself to more heartache. She sat the flowers and the bag on the table behind her desk and buried herself in work for the rest of the day.</p><p>When someone knocked on her door late that afternoon, she almost fainted when Suzy stuck her head inside. “Mind if I come in for a minute?” She knew she looked like a fool with her mouth hanging open. Suzy settled in the seat across from the desk and said, “I’m sorry about doing that to you this morning. I recognized Seth from the restaurant. When I heard him ask for you, I pulled him to the side to be . . . nosy. The poor guy looked like he had it bad. He told me that he had screwed up and was here to talk to you about it so I suggested he do it somewhere a little more private. He wasn’t sure that you would come down if you knew it was him, so I sort of left that part out.”</p><p>Mia smiled, liking Suzy even more than she had imagined. “It’s okay. He apologized and that’s the end of the story.”</p><p>Looking at her curiously, Suzy asked, “So, you don’t plan to see him again?”</p><p>Shaking her head, Mia said, “No. I think I need to move on. We never really knew each other.”</p><p>Suzy gave her a shrewd look before standing. “Just make sure that’s what you want.” As she was leaving, she said, “Let’s do lunch soon.” With those words, she was gone and Mia was smiling despite Seth weighing heavily on her mind. It wasn’t every day you got a lunch invitation from your idol.</p> <p>She logged off her computer and reached behind her to grab her handbag. When her fingers instead pulled up the bag that Seth had given her, she grimaced. God, she was sure it contained breakfast and she had left it sitting all day long. She peered inside out of curiosity and gasped at the contents. She jumped up and locked her door before emptying the bag onto her desk. Her shock finally wore off and she started laughing as she studied the contents: a pair of handcuffs, a black silk blindfold, and two small clips that she thought were nipple clamps. OH, MY! Seth had just proven her wrong. He might not know every detail about her, but he damn sure knew what turned her on. She threw everything back in the bag and had never been more grateful for the black thong she was wearing. Tonight she would return to the scene of the crime and face her fears. If Seth was as smart as she thought he was, he would be ready and waiting.</p><p>Seth paced the foyer of his penthouse looking at his watch again. Shit, why had he listened to his brother? Ash had assured him that to win Mia over, he had to appeal to her needs as a woman. Needs that she might not even be aware of having. Well, the flowers, which had been his idea, hadn’t brought her around so he had lost nothing by leaving her the bag. He liked to fuck hard, but he had never dabbled much in bondage. Where was she? He paced for another thirty minutes and had almost given up when he heard the chime of the arriving elevator. If Margie walked through that door, he would have to fire her because seeing him standing there in nothing but a black tie would be the end of their working relationship. He shuddered in relief when Mia stepped off wearing a long, dark jacket with black stiletto heels. His cock jumped to attention when she dropped her jacket to the floor leaving her in tiny, black panties with the handcuffs hanging off one wrist, the blindfold sitting around her neck, and, shit, her strawberry nipples held erect by the nipple clamps. “Fuck me,” he breathed.</p><p>“Oh, I intend to,” she purred. He had her pushed up against the foyer wall in the blink of an eye. “This doesn’t mean we’re dating.”</p><p>He ran a hand down her back, squeezing her ass. “Baby, if this is your idea of not dating, I’m freaking fine with it. Let’s not date about five times tonight.” Her giggle quickly turned into a moan when he removed one of the nipple clamps. He replaced it with his mouth and her body thrashed as the circulation returned to the area of her nipple. He lightly squeezed her other breast, causing the clamp to tighten. Mia moaned from the exquisite sensation of pleasure mixed with light undertones of pain. He felt his cock grow even harder and his desire greater. What had started as a gamble instigated by his brother to get Mia’s attention was fast turning into the hottest experience of his life. He slid his hand from her breast and trailed it down her arm until he reached the dangling handcuffs. He was intrigued with the possibilities they offered and quickly looked around for the perfect place to position Mia’s delectable body. When he spotted the wrought-iron stairway, he knew he had found the perfect place. Her eyes widened as she caught onto what he had in mind. He paused to give her time to call a halt if she wasn’t comfortable with the idea. Instead of balking though she stepped forward and held her wrists out, placing her trust in him. He pulled a cuff through the railing and snapped it around her other wrist. He then pulled the blindfold up, completely covering her eyes. “Okay?” he asked softly.</p><p>She wiggled her pert behind against him. “God, yes. Touch me, Seth.” She didn’t need to ask twice. He settled his body flush against hers. He was thankful for the added height that her heels gave her as his cock nudged against her rear. He felt the breath hitch in her chest and her heart race as he nudged her feet apart, opening her body to his seeking hand. With his front still pressed to her back, he reached around and stroked her closely cropped mound before slipping into her slick folds. She was so hot and wet that he wanted nothing more than to bury himself to the hilt without further delay. He settled for rubbing his cock in the fold of her ass while sinking one finger inside of her and circling her clit with his thumb. Her body jerked against his and he could feel her tighten and quiver as he added another finger to her tight passage. He quickened his pace and she rode his hand, seeming desperate for the sweet relief that he offered. As he felt her get close to the edge, he picked up the nipple clamp that he had placed on the stairs and attached it to the breast he had removed it from earlier. The sudden bite into her sensitive peak pushed her over the edge. “Ohhh, ahhh, Seth!”He couldn’t wait any longer. He grabbed the pants he had discarded earlier, pulling a condom from his billfold. Yeah, it might be juvenile but most men lived by the Boy Scout rule of always be prepared. He quickly sheathed himself and braced Mia’s hands against the lower side of the stairway, bending her further.</p><p>“Ready, baby?” Without waiting for an answer, he circled his cock in her juices for lubricant and then plunged inside her deeply. When he pulled out almost all of the way, she surprised him by jerking her hips back and impaling him again. She continued to meet him thrust for thrust and soon they were both racing toward completion. He felt himself hovering on the edge and he wanted Mia there with him. When he lowered his hand to tweak her clit, he felt her body start to shudder. “Now, baby!” With those words, she went over the edge and he followed closely behind. He supported her limp body as her strength deserted her. His head slumped against her shoulder, his cock still buried deep inside of her soft body.</p><p>He was still trying to recover when she turned as far as her cuffs would allow and kissed the corner of his mouth. “Baby?”</p><p>“Hmmm?”He murmured, completely content.</p> <p>She shook her hands, clanking the metal against the railing. “Please tell me you know where the keys are to these.” When she felt his body shaking with laughter, she yelled, “Seth!”</p><p>Yeah, he didn’t know where in the hell the key was. His brain was too muddled. He was sure they could find some way to pass the time until it came to him. He had never been a man to waste an opportunity. If this was what “not dating” Mia was going to be like, he couldn’t wait to see what not being in a relationship with her would be.</p><p>Epilogue</p><p>What did you buy a man for your three-month anniversary? Her newly minted friend Suzy had suggested some Ben Wa Balls and a leather crop. Her cheeks flushed pink as she scrolled the online store for those items. She felt like it was more of a gift for her than for Seth, but Suzy had assured her that they would equally thrill him. There was no way that Mia was going into a store to purchase them, though. God, she hoped her elderly neighbor, Mrs. Cole, didn’t get her mail again when these packages arrived. She was almost sure that she opened her packages and glued them shut again before leaving them at her door. Mia never said anything though because she enjoyed providing the woman with some gossip.</p><p>The past few months had been some of the best of her life. Seth had become the friend, lover, and yeah, the boyfriend of her dreams. Their sex life was adventurous and earthshaking and, out of bed, she loved nothing better than spending time with him. They challenged each other on every level and even their downtime was exciting. Tonight they were having dinner with her parents. That was another thing going right in her life. Her relationship with her mother continued to grow and evolve and her father was desperately trying to adapt to his new wife. The woman he had initially fallen in love with was back in all of her glory, and Mia was surprised to see her father scrambling for footing for the first time in her life. In the end though she thought that the change in their relationship would be what kept them together instead of eventually pulling them apart.</p><p>The knock on her door had her quickly finishing her online purchase before shutting her computer down. She didn’t want Seth to see her surprise yet. She smoothed the skirt of the short, pink dress down and ran for the door as he knocked again. She threw it open and her heart kicked into high gear as it always did. God, she was in love with the man standing on the other side looking so damn handsome and sexy. Maybe it was all moving too fast, but she was helpless to stop the flow. She was firmly in the Seth Jackson gravitational field and she had no desire to escape. He pulled her close and she melted against his firm lips. When her mouth had been thoroughly plundered, he said, “Hey, baby. I missed you today.”</p><p>She smiled in return, admitting, “I missed you, too.” She gave him another quick kiss before turning to grab her bag. “Ready to go?”</p><p>He wiggled his brows saying, “I’d rather stay here and eat you for dinner.”</p><p>Neither of them noticed Mrs. Cole standing in her doorway across the hall. She rolled her eyes before giving them an indulgent smile. And, since she knew everything that happened in the building before anyone else, it likely would not come as a surprise to her that before the evening was over, Seth and Mia would say “I love you” for the first time. </p> </body></html>"]