["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>One</p><p>The first thing you need to know about me is—I see dead people. Okay, that’s a lie. I hear dead people—on an antique radio of all things. I know, right? But I didn’t make the rules. If I had, I certainly wouldn’t be working at Pretzel Pirate. The uniform is unrelenting polyester, and I can’t pull off white lace or a swashbuckler hat. I’m into striped tights, combat boots, cosmetics, piercings, and tattoos.</p><p>I’ve also got an amnesia thing going on. Don’t ask me to explain it, but my head’s foggy. I used to live in Kilmer, Georgia, and for reasons I can’t recall—I’m sure it seemed like a good idea at the time—I split with a cop from Texas...and some other guy. I haven’t seen the second dude for a while, but the cop brought me to Laredo. It was weird in Kilmer, and my mom’s...gone. I should be sad about that, but that part of my life is misty. Which makes me wonder if I used to do hardcore drugs. It would explain a lot, huh? I should be grateful it was a cop who pulled me out of that death spiral and not some perv who’d chain me up in his basement.</p><p>So I’m in Laredo now. The cop who saved me—and I’m sure whatever he hauled me out of in Kilmer, it was ugly—then deposited me with some family friends. They’re a married couple, nice enough, but I felt like I was cramping their style. They just had a baby, and I’m not au pair material. To make matters worse, their house burned down, and we were all out of luck for a while.</p> <p>They went to stay with relatives, and I didn’t feel right about going along. So this guy, Chuch, found me a roommate, his cousin, Maria. She’s a nice girl, but not home a lot. We both work, and I’m trying to get into community college. Things being what they were in Kilmer, I got my GED here.</p><p>So anyway, it’s five thirty p.m. on a Thursday, and I’m stuck at Pretzel Pirate. The food court is hell. Each afternoon, I stare across at the same dorky kid selling burgers. Sometimes he makes a pirate hat out of a paper placemat and puts it on to mock me. I give him my middle finger as a special prize. Good times. This job pays minimum wage; it also siphons off a portion of my soul each time I say, “Arrr, matey, want to try a Buccaneer special pretzel with extra cheese?” FML.</p><p>Unlike charlatans who use a crystal ball, I can tune into dead people on my radio—and not random ones, either—so considering that I’ve learned to control the ability, I should be raking in the cash. But due to snafus like the Salem Witch Trials, the Gifted community frowns on us using our talents in the open, so any medium listed in the Yellow Pages is a fake. I wish I could figure out a way around this restriction, but for now, I’m working at the mall to make ends meet.</p><p>The only bright side is that I’m sober, apparently, and the guy who rescued me cares enough to check in on a regular basis. At least, I think that’s why he’s coming toward me. Here’s something I didn’t mention. The cop’s smoking hot. Jesse Saldana, that’s his name. I’ve never written it all over my notebooks or drawn hearts around it, but sometimes I do whisper Jesse in a certain way.</p><p>I have zero shot, but since the moment I saw him, I’ve been on fire. He’s got tawny hair and dark eyes, a hint of Mexican heritage in his tan skin. Plus, with a day or two of golden scruff, he always looks like he could use a shave. I see him and I just want to take a bite; he’s the ultimate forbidden fruit. I’m not sure exactly how old he is, but I’m guessing twenty-eight or twenty-nine.</p> <p>Did I mention I’m not quite nineteen?</p><p>Ten years might not seem like such a big difference down the road, but right now, it’s insurmountable. Because he sees me as a project—I’m the girl he’s saving. And unless you’re crazy, you don’t kiss the crap out of damsels in distress. Christ, I hate that label. I wish I could prove that I’m not an at-risk youth, but I have no idea how to make it happen.</p><p>He cuts through the tables, making a beeline for Pretzel Pirate. Let me point out, there are way better places to eat. If he’s after actual food, the court has sushi, sandwiches, pasta, pizza, and burgers. Some of it even tastes decent.</p><p>God, Jesse Saldana’s smiling at me.</p><p>“Hey,” he says, as he reaches the counter.</p><p>“Arr,” I answer. “Prepare to be boarded.”</p> <p>Oh, God, why? I have no idea why I said that. It’s not even an official Pretzel Pirate greeting. Mark, my manager, would vehemently disapprove. He’s all about corporate policy and reminds me of that movie where Jennifer Aniston works at a terrible restaurant and they give her shit for not wearing enough buttons.</p><p>Fortunately, Jesse laughs. He’s got a great smile, white teeth—and dimples. How am I supposed to cope? Dimples. It’s absurd.</p><p>“How’s the pretzel business?”</p><p>“It’s horrible. I have no dignity. On the plus side, I’ll be able to make rent.” When his brow furrows, I realize I’ve reinforced his impression of me as vulnerable, someone who needs looking after.</p><p>“If you ever need anything, Shan, let me know. I’m here for you.”</p><p>“You’ve been sentenced to community service? What’d you do?”</p><p>“Funny. Can I get a lemonade and an order of toasted pretzel bites?”</p><p>“Tell me this isn’t your dinner.”</p> <p>“What?” Now he looks defensive. “It’s food.”</p><p>“Debatable.” But Mark would not be amused to hear me talking this way about our fine products.</p><p>Glumly, I put together Jesse’s order, mentally counting the seconds before he walks away. “So what’re you doing here?”</p><p>“Would you believe I was craving pretzel bites?”</p><p>“Not even on my dumbest day.”</p><p>“Car charger for my phone.” He lifts a small plastic bag. “I’m always forgetting to plug it in at night.”</p><p>Take me home with you. I’ll remind you. Oh, God. Why does he have to be so...day-um? And so oblivious to the fact that I’m female. He treats me like a little sister, maybe one he adopted through a charitable organization. I suppose I’m lucky he doesn’t offer to take me out for ice cream or to play skeeball once a week.</p><p>“Yeah, it’s hard to save the day when people can’t reach you.”</p><p>“Do I detect sarcasm, Shannon Cheney?” Jesse props himself on the counter, giving me a look that melts my knees.</p><p>“Only always.”</p><p>“You’re too young to be this cynical.”</p><p>“And you’re too old to be this hot.” Shit. I said it out loud.</p><p>To my relief, he laughs. “Thanks. That made my day.”</p><p>Wow. So I’m the waitress who flatters him despite being undateable. If he ruffles my hair, I’ll bite his hand. No joke, I will draw blood. When he gets a tetanus shot, he can think of me. I shove the pretzel bites at him, set the lemonade on the counter, and mumble the total. He pays in exact change, and I pretend it’s because he’s trying to make my life easier.</p><p>“That’s why I’m here—to provide excellent customer service. And pretzels.”</p><p>And to want things I can’t have. As he waves and turns, I can’t help checking out his lean, muscled back and the fit of his jeans. I’ve done my share of screwing around, but I could ride this cowboy until the break of dawn. I’m actually chagrined by the rush of heat that accompanies the thought. And then the unthinkable happens. Jesse Saldana whirls to face me.</p><p>See, this is the other thing I haven’t mentioned. Jesse Saldana isn’t simply a smoking-hot cop. He’s also an empath. Dunno if he’s been trying not to read me, or if I’ve done a good job keeping it locked down until now. Color touches his cheeks, and he hesitates, like he’s not sure if he should acknowledge what he just felt.</p><p>I raise a brow at him, the one with the piercing. “Something on your mind?”</p><p>It seems best to brazen it out; I refuse to pretend I don’t feel as I do. He can think it’s ill-advised or that I’m too young, or a bad bet in other ways. God knows that’s all true. But it doesn’t mean I don’t want him, more than anything.</p><p>“Seems like there’s something on yours.” He summons a gentle, let her down easy smile. “While I’m flattered, I’m not the one for you, Shan.”</p><p>I shrug. “Too bad. You’re missing out.”</p><p>“I know.” Jesse sounds like he means that.</p><p>My ego poofs a little.</p><p>This isn’t easy when you’re wearing the polyester Pretzel Pirate uniform. But he’s seen me in my street clothes; he knows I can rock a look. I’m the kind of girl who scares males my own age and attracts those old enough to know better. Apparently Jesse thinks he falls into the latter category, but I don’t see it that way. A guy needs to be on the wrong side of forty-five for me to dub him a creeper for wanting to date me. To put it another way, my dad’s forty-two. I’m never going out with anyone older than my father; that’s the rule.</p><p>Because I’m curious—and there will never be a better time to find out—I ask, “Is this the first time you’ve noticed how I feel?”</p><p>Jesse shakes his head. “Only the most potent flash. I knew you were nursing a crush, but I figured you’d get over it without me needing to say anything.”</p><p>“Is this where you warn me off?”</p><p>“It would be wrong to take advantage while you’re feeling grateful. I extracted you from a bad situation and—”</p><p>“The way you visit me, I could take it for encouragement,” I interrupt, unable to listen to more bullshit about my alleged emotions. “You’ve found reasons to stop by three times in the last week. And the mall’s nowhere near the station.”</p><p>“I’m looking out for you,” he mutters.</p><p>“Then stop. I can take it from here.”</p><p>“Are you cutting me off?” He tries to say it lightly, but I can tell that this feels like a breakup to him, too. A weird one, certainly, but there’s a bond between us, one I can’t explain and didn’t ask for.</p><p>“It’s for the best,” I say quietly.</p><p>I’m never gonna smother these feelings as long as he’s coming round, fanning the flames. Though I played the role once, I refuse to be Jesse Saldana’s permanent damsel in distress, always yelling for help from a tower. I can make a rope out of bedsheets and climb down my own damn self. So he can take his white-knight complex and go tilt at somebody else’s windmill.</p><p>“Shan... I just want...” In the end, he trails off, unable to express whatever it is. “Look, can’t we be friends?”</p><p>“Not when I want to kiss you so bad that it’s all I think about.” There’s no point in playing coy. He knows.</p><p>For a few seconds, his gaze locks on mine, and there’s a swirl of superheated awareness in his eyes. Holy shit. He feels it too. I have no idea if it’s an echo of what I’m offering, or if he’s been suppressing this because he feels like a dirty old man. Before, I didn’t chase him because I thought he saw me as a kid. But if he can look at me, right here, right now, and find anything desirable? Then he wants me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I just have to decide what I’m going to do about it.</p><p>Two</p><p>Jesse’s the first to look away. “There’re so many reasons why we shouldn’t—”</p><p>“But we only need one why we should.” I’m smiling now, confident that I know where this is going.</p> <p>“And what’s that?”</p><p>“Because we want to. Pick me up tomorrow night at eight. You know where I live.” He helped me move in, after all.</p><p>“We can have dinner,” he decides. “But it’s not a date.”</p><p>Yeah, like a label’s gonna stop me. I merely smile. “You’ve got my number, right?”</p><p>In answer, he taps out a quick hey and my phone pings. I shouldn’t find this so endearing. “See you tomorrow, cowboy.”</p> <p>After he leaves, the rest of my shift is...bearable. I shut the place down at nine, and by fifteen past, everything is sparkling clean. I take the bus home, wishing I had a car. Maria’s out with her boyfriend, no surprise there, so I strip off the Pretzel Pirate get-up and take a shower. It’s not even ten thirty, and I’m bored as hell. I have the sense that I used to have somebody to hang out with—but maybe I left her in Kilmer. My head hurts when I poke at this half-formed memory, so I switch on the TV and numb my brain.</p><p>While some stupid show plays, I waver, tempted by an unwise idea. I’ve thought about doing this before, but I always decided against it. For obvious reasons, I can’t raise the dead when Maria’s around. Since she’s an Ortiz, I’m sure she knows about the Gifted population, but it seems best not to rub her nose in the fact that I can talk to dead people. Before I can think better of this, I head into my small bedroom. It didn’t come furnished, so right now there’s a futon in it, and I’m storing my personal stuff in the closet and in milk crates I stole from behind a convenience store.</p><p>Pulling the antique radio out of my closet, I sit cross-legged on the floor for a few seconds, holding it. Nobody else can feel this—I’ve tested it—but to me, this old gizmo radiates cold energy that tingles in my fingertips. There’s not much left from my Kilmer days since I bolted in a hurry, but I do have an old ring that belonged to my mother. Actually, I stole it from her jewelry box before she died. I used to be kind of a klepto, though I control the impulse these days. They’re serious about loss prevention at the mall, and I’d look horrible in an orange jumpsuit.</p><p>I dig it out of the small, satin-lined box that houses my jewelry. I don’t have much, and I wear most of my bracelets at the same time; I’ve grown accustomed to the weight and jingle on my wrists. If I ever went into the sun, I’d probably have tan lines from my bracelets. But I’ve been cultivating this pallor for years, mostly to irritate my mother. Now, however, the results are permanent. I’m pretty sure I’d burst into flames if I tried to tan.</p><p>Clutching the ring in my left hand, I focus on recalling how my mother looked and sounded, before the mental fog set in and my memory got weird. I just simply can’t recollect certain things anymore. My exodus from Kilmer is wreathed in shadows, which makes me think it must be bad. Either someone doesn’t want me to remember, or I’ve forced myself to forget. And you don’t usually block out the happy times.</p><p>Nervous, I fiddle with the dials of the radio as I whisper, “Restless dead, blood of my blood, I summon you to this place.”</p> <p>The room immediately chills, raising goose bumps on my arms. Hissing static crackles from old speakers as I scan various stations by adjusting the dials. I’m into the AM side, down on the low end, when the white noise resolves into intelligible words, spoken in a familiar voice.</p><p>“You shouldn’t have called me, Shannon.”</p><p>That’s my mom all right. She finds reason to bitch at me even from beyond the grave. “Why not? I have questions.”</p><p>“Most of them, I’m not permitted to answer.” The display glows when she speaks, something I’ve never seen. This analog device doesn’t have a backlight.</p><p>The cold intensifies, so I can actually see my breath. “Not about the afterlife. I’m wondering what happened in Kilmer. I can’t remember how I ended up in Laredo or why Jesse Saldana was there in the first place.”</p><p>I mean, he’s from Texas for fuck’s sake, and it’s not like a creepy, haunted little town in Georgia is a tourist hot spot. When I ask him, Jesse smiles and says in his super-hot drawl, “Chalk it up to fate, sugar. I was destined to save you.”</p><p>Which is sweet, but it’s also bullshit. I want—I need—answers, but when I push too hard, it feels like my brain is about to pop out of my skull. Most people would heed that warning, I guess, but you can tell by looking at me that I’m not normal. That’s partly what my style’s about, honestly. It seems wrong to go around in jeans and hoodies. Then a guy who asks me out might expect an average girl, not one who talks to dead people. This way, I feel like he’s been forewarned, and if he still wants to date me, he shouldn’t be surprised that there’s a spooky surprise in this box. I mean, the package was wrapped appropriately, after all.</p><p>“There’s a reason you can’t remember,” my mom tells me.</p> <p>Well, duh. Sadly, this is the most civil exchange I’ve had with her in years. Most of our discussions ended with me screaming you don’t understand anything and slamming into my room. In life, my mother was a pearl-clutching Southern belle, and I suspect she used to prowl our house, searching for proof that I’m a changeling. So in that respect, death eased the tension between us—yep, oblivion’s the ultimate icebreaker.</p><p>“I was hoping you could clue me in.”</p><p>“The pain you experience when you try to remember is a clue, Shannon. You can’t circumvent a spell before its time through sheer willpower or mental force. There could be...repercussions.”</p><p>A spell? So somebody made me forget? What the hell. There are so many questions I should ask, but my energy is limited. The power to communicate with her is pulled directly from me in the form of life energy, and I suspect if I stretch my reserves too far, it might be lethal. Tonight’s not the time to find out.</p><p>So I settle on asking, “Do you know who did this to me? Or why?”</p><p>But the radio crackles, and I feel woozy. My mom’s gone. I desperately need a sugar rush or I’ll pass out. On hands and knees, I crawl over to the crate I keep stuffed full of chocolate. I’m pretty sure Maria thinks I’m bulimic. With trembling hands, I tear open a candy bar and cram it in my face. In a few minutes, I feel better. The black spots are gone, and my hands aren’t shaking anymore. Five years down the road, I’ll have rotten teeth and probably diabetes as well. They don’t warn you about this shit when you first start talking to dead people.</p><p>I try to picture what it’s like on the other side; I’ve never queried a spirit on how it feels when I summon them. Is it a painful tug or more of a warm, delicious rush? I highly suspect I’m feeding them. Ew. I close my eyes for a few seconds, then turn off my radio, killing the chaotic snake hiss.</p><p>The conversation with my mother told me enough to get started. If it’s a spell, it can be broken, right? Magick wears off on its own, unless it’s powered by some natural source, a ley line for instance. But I’m not attached to anything like that. Time will probably dissipate it, but I need to recover the missing pieces of my life; the hole’s bothering me, as if I’ve forgotten something super important.</p><p>The room is still freezing when Maria comes home a little later. She pops her head in and shivers. “Did you leave the window open?”</p><p>“Just closed it.” The lie seems better than an actual explanation.</p><p>“Fresh air is good if it doesn’t kill you,” she says dubiously.</p><p>She’s a nice girl, two years older than me, but sometimes I feel ancient by comparison. So far as I can tell, despite having an oddball family, she’s totally normal. Maria works at a jewelry store and goes to night school, learning to do hair. Which is cool and she’s good at it. She’s already volunteered to help me freshen up the blue streaks in mine; I have to do that often or the vivid color dies away to a sickly mermaid seafoam. She looks somewhat like Chuch, Jesse’s family friend, but not enough to be alarming in a girl. I just mean she has dark hair and eyes, plus a stocky build.</p><p>“That’s pretty much the way I feel.”</p><p>We make a little more awkward small talk because we’re roomies, not friends. She tells me about her date and the movie she saw. I joke about the kid who makes paper pirate hats in the food court. She seems to think this suffices for polite interaction and says something about a shower. I’m relieved, as I don’t know anything about dealing with regular people. I’m like one of those kids from Hogwarts, dodging through the train station and muttering, “Muggles.”</p><p>Once Maria leaves, I shut my bedroom door. I’ll scrub off my makeup later, after she goes to bed, like I always do. This is a quirk, but I don’t enjoy people seeing me without it. It’s armor in a way. For me to let someone see my skin? It’s major. Like, I’ve slept with guys who never did—and it’s probably why we broke up, too.</p><p>I pop my laptop, planning to watch some TV on the ‘net, but my mail client dings. No lie, my heart skips a beat when I see the name. Jesse Saldana. I got a couple of emails from him while we were moving me into this apartment, and he insisted on helping. But since then, there have just been his casual visits to the mall.</p><p>Which are definitely increasing in frequency.</p><p>Opening the message, I read:</p><p>Hey, Shan.</p><p>I’ve been thinking about you since I got home, and I just want to make sure we’re okay. It was a little awkward before I left. Or did I imagine it? I’m trying really hard not to be a jackass here.</p><p>Jesse</p><p>I skim the words twice. Most of it, I don’t care about, but for obvious reasons, I fixate on I’ve been thinking about you. Since I wake up with Jesse Saldana on my mind, I spend the workday daydreaming about him while making pretzels and pouring drinks for people, and then I come home to obsess about him some more, this seems like the least the universe can do to level the field. I hate the word crush, but it so totally applies here. And I don’t want to be that girl; I kind of hate myself for it, actually.</p><p>So I decide to make him sweat. Deliberately, I close the program and find some free TV online; there are sites that let you watch if you’re willing to put up with their stupid ads. It’s on my to-do list to get a monthly subscription to Netflix, but you need a credit card for that, and I’m not exactly flush with cash. So I watch this sitcom until I’m tired enough to sleep, and it makes me happy to imagine Jesse wondering why I haven’t replied.</p><p>In this single matter, I agree with my mother.</p><p>It’s best to leave a man hungry.</p><p>Three</p><p>I’m looking hot tonight. Maybe it’s immodest to say so, but I know what suits me and I’m good with hair and makeup. I suspect Jesse’s never dated a girl who looks like me, though. I could be wrong. Maybe he’s all about bad girls deep down...and if so, he’s knocking on the right door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Before answering, I count to ten, then answer his hesitant tap, relishing his stunned expression when he takes in my platform boots, striped tights, short leather skirt and black corset top. His gaze doesn’t reach my face for a full ten seconds, and then he jerks his eyes upward, looking so guilty that I could shove him against the wall and take a bite. He cherishes a mistaken image of me as a helpless flower, and I want to scratch it off like a one-dollar lottery ticket.</p><p>“I’m ready,” I say, smiling.</p><p>He looks like he’s torn between a compliment and telling me to go put on some pants. Instead, he only nods and ushers me downstairs, where his green Forester is parked. I notice his ride has seen better days and is in the process of being repaired, a little at a time.</p><p>“What happened here?”</p> <p>He frowns, seeming not to want to talk about it. “I... Car chase. Any thoughts on where you’d like to eat?”</p><p>“Isn’t that your job?” I ask, teasing him. “To read my mood and figure it out?”</p><p>“I can’t tell if you want tacos or Chinese, just based on—” The words cut off as he registers what I really want. And he stumbles from the intensity.</p><p>Here’s a hint—it’s not food. I can’t tell you what it is about him; I’ve known hotter guys and I didn’t spend my time thinking about them naked. I cop to being obsessed, Officer. You should definitely cuff me now. Part of me wonders if this attraction springs from the spell my mother mentioned. Maybe the magick tampered with my memory and made me crazy for Jesse Saldana. If so, it’ll be awkward when the mojo wears off. But I still wouldn’t regret any bedroom action between us because he moves like he knows how to show a lady a good time.</p><p>Jesse opens the door for me, the consummate gentleman, and I flash him some thigh as I climb into his SUV. “Thanks.”</p> <p>He narrows his eyes, dark and shadowed beneath the streetlights. “I care about you, Shan, but you shouldn’t push me.”</p><p>“Too bad, because that’s exactly what I plan to do,” I mutter.</p><p>Circling around the truck, he doesn’t catch that, and it’s just as well. After thinking aloud, he decides to take me to a dive his folks like. It’s apparently a family place, noisy and crowded, one of those tiny neighborhood joints that you’d be afraid to try if you didn’t already know the food was delicious. I can surmise why he’s chosen such a venue; I’m supposed to be a good girl if there are children running around and not allude to the fact that I want to end the night on top of him.</p><p>We’ll see.</p><p>He tells me about his day as he drives. Apparently it’s not always thrilling to be a cop, and I hear about the extensive interviewing he did. His partner died a while back, and they just assigned him a new one. Her name is Stella, and Jesse likes her. He’s also grateful that she’s ten years older than he is and happily married. This carries us all the way to the small, adobe restaurant with hand-painted lettering on the front that reads TITO’S. There are lots of cars parked on the street too, always a good sign.</p><p>Deliberately, I sit in the car until he comes around and opens my door. He may not want to think of this as a date, but it definitely qualifies in my mind. I hop down and take two steps toward Tito’s. People are sitting out front, eating tacos from Styrofoam trays. Rising up on tiptoes, I can see there are no tables open indoors, but there are picnic tables out here. This is the opposite of romantic, exactly what he was going for.</p> <p>“It smells great,” I tell him.</p><p>He was expecting me to object, but they’ve got proper pork roasting on a spit behind the counter, which means these tacos will taste right. There’s nothing like tacos al pastor, loaded up with cilantro, green sauce, chopped onion, and fresh pineapple. I pull up short, frowning. Why do I know that? For a few seconds, there was a voice in my head, making me think I’m an expert on Mexican food.</p><p>“Have I ever been to Mexico?” I ask Jesse.</p><p>It’s a stupid question...because how the hell would he know? He’s frowning, though, and he puts a hand to his head, like thinking about it hurts.</p><p>“Maybe,” he finally offers.</p><p>“Are you all right?”</p><p>“Just hungry, I think. I skipped lunch.”</p><p>“Then go get some food. I’ll grab a table.”</p> <p>“Right away.” He pretends to be irked that I’m coming across bossy, but I see the smile playing at the corners of his mouth.</p><p>You can’t fool me, Jesse Saldana. You think I’m pretty.</p><p>It doesn’t take long for him to come back with drinks in paper cups and two trays piled with tacos of varying types. But they’re all made right, none of that crunchy shell nonsense, stuffed full of ground beef. Damn. I have no idea where this attitude came from, but I’m apparently awash in scorn for Mexican fast food.</p><p>“This is great,” I say, digging in.</p><p>“Most women don’t like it. No ambiance.” He stills, seeming to realize what he’s implying there.</p><p>Too late. You said it. You can’t unsay it.</p><p>“I’m not exactly the poster girl for normal.”</p><p>“Normal’s overrated.”</p><p>“You saying you like what I’ve got to offer?” I smile at him, holding his gaze for several heartbeats.</p><p>“Shannon, stop.”</p><p>I widen my eyes. “What?”</p><p>“Flirting.”</p><p>“Flirting never hurt anyone. You’re a big, strong man. You can take it.”</p><p>He swallows. “Seriously. Quit trying to make me want things I can’t have.”</p><p>“But...I’m pretty sure you can.” I make a show of checking my phone for prior engagements. “Yep. I can pencil you in. But it’d be better if we go to your place. Maria might eavesdrop on our moaning and banging around. Do you break things during sex? I always wanted to knock over a lamp.”</p><p>“You’re incorrigible.”</p><p>“So corrige me, all night long. I’m positive I could be reformed by hands-on attention.”</p><p>“Eat your dinner,” he says in a suffocated voice.</p><p>“Will I get candy after? Just so you know, I’m not getting in your panel van.”</p><p>He swears softly. “I’d think you were screwing with me, if not for—”</p><p>“The way I feel to you?” I whisper.</p><p>“Yeah.”</p><p>I swear, you could scoop up the atmosphere with a spoon. He’s still, but I notice him breathing faster. This is dirty pool, but I’m not trying to suppress how much I want him. I spackle it with levity, but this longing is a tidal wave. I can’t get enough oxygen. There are people all around us, but I have the crazy feeling we’re inside a bubble; the world recedes like a hitchhiker in the rearview mirror.</p><p>“I’m not going to lie,” I tell him. “Or pretend. It’s up to you how to respond.”</p><p>He clenches a hand on the table, apparently on edge. Then his voice drops deep and low, so I lean in to catch it. “I don’t break things. I go gentle and slow.”</p><p>“That’s a shame. I want you to be wild.”</p><p>“You know I’m not a bad boy, right? I’m the one mothers love to meet and their daughters love to fuck over.” Jesse sounds slightly bitter.</p><p>For a few seconds, I consider sending the dead to traumatize Jesse’s exes. Then I choose sanity instead. But I can’t decide if his penchant for crazy girls makes his refusal to explore the chemistry between us better or worse. Does his reluctance mean I’m too batshit to date him or not nutty enough?</p><p>“Being a sweet guy doesn’t mean you have to repress your desires.”</p><p>“What makes you think I am?” He scowls at me, devouring half a taco in one angry bite.</p><p>“Every guy has fantasies he’s afraid to share. And if you’re slow and gentle all the time, it’s because you’re trying to make a woman feel loved. But what men don’t understand is—sometimes we just want to be fucked. We need a sexy beast, not Prince Charming.” I watch his reaction to that, then add, “If you’re doing well, you make us feel cherished out of bed, and then we have rough, dirty sex.”</p><p>He groans, scrubbing a palm across his face. “I’m starting to suspect you’re a demon, a Luren, maybe.”</p><p>“What’s that?”</p><p>“Look it up,” he mutters.</p><p>Smart ass. I’ll be on Area 51, searching that word, right after I get home. Unfortunately, I’m pretty sure Jesse means to drop me off untouched. But he looks pained now; I hope it’s because his pants are too tight. Unfortunately, the picnic table doesn’t offer a subtle way to check.</p><p>“You know what your problem is?” I ask.</p><p>“I’m sure you plan to tell me.”</p><p>I beam. “You so get me. Here’s what I see, cowboy. You put women on a pedestal. You worry about looking after them. Then they get sick of being handled with kid gloves and they bail on you.”</p><p>Jesse seems honestly astonished. “Did Eva tell you to say that?”</p><p>“No. I haven’t seen her since I moved, though I get the occasional email.”</p><p>“How can you possibly know that? We haven’t been friends that long.” But I hear the doubt in his voice. He’s not sure when we met, either.</p><p>“Someone roofied us,” I say. “Magical roofies. It’s the only explanation.”</p><p>But this seems like a good time to elaborate on what my mom told me, so I do. Maybe Jesse will have some idea who might’ve wanted us to forget. I have an awful suspicion that I did something horrible, and this was done to protect me. I imagine setting my ghosts on a human being and shiver, staring at my fingers.</p><p>Are these the hands of a killer?</p><p>I’d get away with it, too. If the dead suck all the energy out of a person, they fall down and don’t get up. It would look like a heart attack. At length, I fall silent, waiting for his response.</p><p>“You’re sure about this?” He’s got his cop face on now, simultaneously alert and alarmed. “Your mother’s reliable?”</p><p>“Not in life, but maybe death has improved her.” I suck it up and ask the hardest question ever. “Do you think I’m a good person?”</p><p>“Yeah,” he answers without hesitation. “You dress dark, but you feel like sunshine to me, Shan. Pure light.”</p><p>Nobody’s ever said that to me before. I’m sure, no matter what else I’ve forgotten. I’d remember if a man had ever made me feel like the witch Dorothy threw water on, melting from head to toe. Naturally, I can’t let a moment so touching pass unremarked.</p><p>“I would bang you like a gong,” I tell him.</p><p>“You’re too young to talk like that,” he snaps.</p><p>“I just did, so clearly that proves your hypothesis false. I suppose if you added a Mormon control group, you might find that some females my age don’t communicate in such a way, but—”</p><p>“I’m starting to understand why men kiss women to shut them up.”</p><p>“Feel free. I wouldn’t find it disrespectful.”</p><p>He shoves to his feet, goaded. Jesse hovers on the brink of grabbing me, but instead he clutches the tatters of his self-control and clears the remnants of our meal. But no joke, he slams the rubbish into the bin like he’s punching a wall. I love the fact that I’ve riled him. He’s usually so sweet and calm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I better take you home. I’ll ask around, regarding the spell, and I’ll let you know what I find out.”</p><p>Balls. Round one to Jesse Saldana, but I’m in it to win it.</p><p>Four</p><p>Since I have Saturday off, I hop a bus that takes me partway to Chuch and Eva’s house. They live outside of town, so it’s still a fair walk. I could call instead, but if you’ve ever tried talking to new parents on the phone, then you know why I’m making the trip. Along the way, I turn down a couple of guys who slow with suggestive looks. Yeah, they’re offering more than a ride...or rather, it’s not transportation they’re thinking about.</p> <p>As with so many other facts, I’m fuzzy on the details, but I get the impression that Chuch used to be a badass before he settled down. He hasn’t told me as much, but I suspect their old house burned as a result of his shady past. On the plus side, the insurance paid, so they got a new house out of the deal, bigger and better than the old one, mostly because Chuch and his cousins did most of the actual labor, so the money stretched.</p><p>The new place is beautiful. It’s weird that I can remember what their old place looked like but not how long I’ve been in Laredo. Or how we met, exactly. But I’m used to that kind of thing—fucking magick, man. Anyway, the architectural style borrows from a couple of schools, Colonial and Mediterranean, which maybe doesn’t sound like it would work, but together, they create an amalgam of Texan charm, warm with stucco and mosaic tiles.</p><p>I walk up to the front door and ring the bell. Eva answers a few minutes later, looking harried. Baby Camille is propped on her hip. “Hey, Shannon. How are you? I’ve been meaning to call, but these days, it seems like I stumble from nap to nap.”</p><p>“It’s not a problem. Can I come in for a few minutes?”</p><p>“Absolutely. Just be warned, the house is a mess.”</p> <p>Sometimes when people say that, they’re being disingenuous and you step inside to find tidy décor worthy of Martha Stewart. This is not the case with Casa Ortiz. It kind of looks like a baby store exploded in here. There are blankets and afghans everywhere, toys strewn on the floor. A fine layer of dust coats everything, and I couldn’t tell you how long it’s been since the floor was mopped.</p><p>And there are frogs everywhere. Not live ones, but little ceramic or china knickknacks. Chuch collects them, apparently. He says they’re good luck.</p><p>“You want something to drink?” Eva looks so tired.</p><p>“Just water for me. Sit down... I’ll get it. What do you want?”</p><p>“I want coffee, but I can’t have it. I’m breastfeeding. So water for me too.”</p><p>From my stay with them before, I’m familiar with how she organizes her cupboards, so I fill two glasses with ice and pour from the filtered pitcher Eva keeps in the fridge. Then we both sit down at the kitchen table. I feel guilty for bothering her, but I really need to know.</p> <p>“So I talked to my mom,” I start.</p><p>Both her brows shoot up. “I thought she was dead.”</p><p>The weird thing is, I don’t remember telling her that...but clearly she knows. This is kind of like me knowing things about Jesse that he can’t recall sharing. Something super weird is going on here.</p><p>“She is,” I answer, my expression reminding her that for me, death’s not a barrier to conversation.</p><p>“Right. You were saying?” She jogs Camille on her knee, which makes the baby smile, all pink gums and chubby cheeks.</p><p>“I learned something interesting from her. It appears that this brain fog comes from a spell. Do you know anything about that?”</p><p>For a split second, she freezes. But I read the answer in her eyes. She does know. Maybe not everything, but there are definitely secrets hidden in Eva Ortiz’s dark eyes. Yet she shakes her head.</p><p>“That’s strange. But it explains a lot.”</p> <p>“Would you tell me if I pissed off a witch?” I ask.</p><p>“As far as I know, you haven’t irked anyone. I mean, you haven’t been living in Laredo that long, relatively speaking.” She shrugs. “But I wouldn’t worry about it. Spells don’t last forever. I’m sure if you’re patient, your memories will return on their own.”</p><p>“Easy for you to say,” I mutter. “You’re not the one with a hole in your head. Figuratively speaking.”</p><p>“I know.” Her look becomes sympathetic. “It must be frustrating.”</p><p>Then why are you lying to me?</p><p>But before I can press the point, Chuch comes in the back door. “Shan! You missed us, huh?”</p><p>Chuch is a thick, short guy just starting to get a paunch. Considering how classically gorgeous Eva is, they make a bit of an odd couple since his face can best be described as...battered. He’s also a hugger. He demonstrates the latter by yanking me out of my chair and squashing me against his chest. Since he smells like motor oil, I guess he was working in the garage. That’s how he makes his living, restoring old cars.</p><p>“How’s it going, prima?” Chuch calls me “coz” like we’re related. I’m told it’s affectionate, meant to acknowledge me as family even though I’m really not.</p><p>“Not great.”</p><p>“What’s wrong?”</p><p>Eva shoots him a sharp look, but Camille interrupts with a loud noise, then the smell that permeates the kitchen is truly horrific. If I were eating, I might hurl.</p><p>“I need to take care of this,” Eva says.</p><p>“Before it eats through her skin,” I mumble.</p><p>I’m not sorry to see her go, however. Based on past experience, I know Chuch is susceptible to big eyes and feminine pleading. This means his daughter has him wrapped him around her pinkie. Maybe I can do the same. I lean forward, elbows on the table, watching him as he fixes a glass of sweet tea.</p><p>“So what’s on your mind?”</p><p>“The amnesia spell somebody dropped on me.”</p><p>He offers an assessing look, and his expression turns cagey. “You know about that?”</p><p>“Yep.” Maybe I can make him think I know more than I do, trick him into revealing something crucial. Eva will be pissed, but I can live with that.</p><p>“Then you know it was done with the best of intentions.”</p><p>I didn’t, actually. But that dovetails with my fear that I’ve done something terrible, so bad it had to be wiped from my brain for me to cope. A shiver rolls through me, and it’s not hard at all to aim an anguished look at Chuch.</p><p>“Just tell me what happened, please.”</p><p>“Shan, if I remind you of what the spell’s blocking too soon, the feedback could seriously hurt you.”</p><p>“So people keep telling me.”</p><p>“Then you should listen. We’re not keeping quiet to be assholes.”</p><p>“Could’ve fooled me.” But being rude will just annoy the few friends I have, so I shove to my feet. “Thanks for the drink. I should get home.”</p><p>“Did Maria drop you off?”</p><p>“Nah. For me, it’s the bus, then the pedestrian shuffle.” I should’ve lied because now he’s on his feet.</p><p>“Let me run you back. It’s two miles to the nearest bus stop.”</p><p>“I’m aware. But you don’t need to—”</p><p>“Eva!” Chuch calls. “I’ll be back in half an hour. I’m taking Shannon home.”</p><p>“Pick up toilet paper and baby wipes!”</p><p>He sighs but he’s smiling. “I swear she thinks of something for me to buy anytime I leave the house. It’s like she’s proving I’m properly trained.”</p><p>“You love it.”</p><p>“It’s true. Come on.”</p><p>Chuch owns six cars in various stages of restoration, and he chooses the sportiest, a black Charger. I climb in, listening to him ramble about marriage and fatherhood. This monologue would constitute complaining from any other guy, but Chuch loves Eva so much that he’s happy she’s there, organizing his life and telling him what to do. I’ve noticed that he doesn’t always listen, however. Sometimes he nods at whatever she says and then does something else.</p><p>He’s a fast driver, but safe, so it doesn’t take long to reach my neighborhood, much quicker than the bus. I convince Chuch to drop me off at the mom-and-pop store five blocks from my apartment, and through some miracle I persuade him to let me walk home afterward. He comes in long enough to grab Eva’s requested items, but he hurries off, officially relieved of responsibility. I’m grateful that people care what happens to me, but I need to take care of my own business.</p><p>In the market, I take my time since I’m on a budget and it’s an exercise in humiliation if I bring more to the register than I can afford. In my shopping basket, I’ve got bread, cereal, milk, turkey, lettuce, noodles, tuna, tomatoes, and good cheese. Hopefully these groceries will last until my next payday.</p><p>At first, I don’t notice my shadow. I mean, the guy’s not memorable: thin, middle-aged, wispy brown hair, and a sallow face. He’s just another shopper in the small store, browsing among the pasta. But when I turn down the next aisle, I see him move in the round, silver mirror hung at the back of the store.</p><p>A chill goes down my spine.</p><p>Without my radio, I’m as helpless as the next girl, and I don’t like the feeling. As I shop, I watch the way he keeps pace. I can’t decide if this is regular pervert stalking or if he’s observing me for some other, possibly more alarming, reason.</p><p>It’s fine. There are other people around.</p><p>I’m a little nervous about walking home, but there are no back streets. One of the reasons my half of the rent is so cheap is because the apartment’s on a main road, noisy, but there’s a bus stop nearby and shopping within walking distance. It’s not upscale, but most of Laredo has seen better days. On the positive side, it only costs three hundred a month to live here, plus my share of the utilities.</p><p>The creeper’s still following me.</p><p>There’s only one cash register, so he waits for a few more people to get in line behind me, while he pretends to study a display. Then he joins the queue. My heart beats faster as I wait my turn. After check out, I have two dollars and forty-six cents left. Could be worse. I already gave Maria the rent money, and the other bills aren’t due until later. I might need to take a second job in order to afford tuition, but that leaves the excellent question of when I’ll find the time to attend classes.</p><p>Whatever. I hurry out of the store, wondering if he’ll drop his items and follow. When he does, it feels like ice freezing at the base of my spine. Instead of leaving the parking lot, I set my bags down and get out my phone. When Mr. Nondescript pops out of the market, I snap a picture.</p><p>“I’m sending this to my boyfriend, who’s a cop.” Jesse isn’t, but this asshole doesn’t know that. “If I catch you tailing me again, I’m sure he’ll find something to charge you with.”</p><p>The man stills, scanning me head to toe at a leisurely pace, and I feel like I need a hot shower. Or maybe I need to sit in the shower to rock and weep...because I’ve never felt tainted by a look before. In the afternoon sunlight, his eyes glint strangely, first yellow, and then red, like blood’s flowing inside his sclera. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well-played, Ms. Cheney. I assure you, you won’t spot me next time. Not until it’s too late.”</p><p>“What does that even mean?” It sounded like a threat.</p><p>But he’s already striding away, crossing the busy street with a speed and agility entirely foreign to his build. Belatedly I realize, that bastard knew my name. At that point, my flight instinct kicks in. I grab my stuff and sprint all the way home.</p><p>Maria’s at work, so she doesn’t witness my collapse against the front door. All my natural intuition tells me that guy wasn’t normal. I feel like such a dipshit since I’ve been full of big ideas about taking care of myself, but this is weightier than dinner or the phone bill. So I type a succinct message to Jesse about my creeper and then send him the photo.</p> <p>I’m surprised when he calls me five minutes later. I figured he’d be tied up in interviews today, but he might have the day off. I haven’t memorized his work schedule or anything.</p><p>“You all right, sugar?” His voice is buttery sweet, warm with concern, and my toes actually curl.</p><p>“Yeah, he just freaked me out.”</p><p>“Tell me what happened, exactly what he said.”</p><p>So I repeat the encounter, word for word. He sounds troubled when he replies. “Sounds like you’ve drawn somebody’s eye.”</p> <p>“Not a normal perv, right?”</p><p>“I’d say no. Be careful, okay?”</p><p>“Do you think this has to do with the spell?”</p><p>He hesitates. I so wish I could see his face right now. “Hard to say. Maybe.”</p><p>“Chuch and Eva know something, by the way. But they’re not talking. Did you find anything out?”</p><p>“Sort of. There’s no relevant chatter on Area 51, but...today, my boss asked me if I was still dating that sweet redheaded girl.”</p> <p>He’s seeing someone? What the hell. Somehow I keep my voice from trembling. “Well, are you?”</p><p>“That’s the strange thing, Shan. To the best of my recollection, I’ve never gone out with anyone like that.”</p><p>“Just how big is this spell?” I wonder.</p><p>“No idea. But we need to get to the bottom of it.” His voice deepens, softens. “You’ll stay safe for me, right?”</p><p>“Anything for you,” I answer breezily, and I guarantee he has no idea how much I mean it.</p><p>Five</p><p>Sunday is laundry day. I use two bucks to wash my work uniforms, which is almost all I wear during the week, so I’m set when Monday rolls around.</p><p>The next morning, I take the bus to work, as usual, and I’m jumpy, watching for the spooky dude, but I don’t spot him. There’s just the usual bunch of commuters who can’t afford a car or insurance or both. They nod at me as I board; I lift my chin in response.</p> <p>I sit next to an older woman who clutches her bag as if I’m likely to mug her. People often respond that way to the piercings and my general style. It’s not personal, though. I’ve watched folks with similar looks receive the same treatment.</p><p>It’s a decent day, bright enough and unlikely to rain. Most of us hop off at the mall and I traipse inside, ignoring the kid from the hamburger stand who’s puffing away near the ashtrays; he looks like he isn’t even old enough to buy smokes. I give him a wide berth. Despite my cold shoulder, he falls into step beside me.</p><p>“Shouldn’t you be in school?” I ask.</p><p>That makes him scowl. “I graduated last year.”</p><p>“And you’ve come so far. Your mother must be so proud.”</p><p>“I don’t know why I bother trying to be nice to you.”</p><p>So maybe he’s attempting humor when he makes the paper pirate hat? Or possibly it’s a nerd courtship ritual. “It’s a mystery to us all.”</p><p>He follows me to the food court. During this interminable walk, I learn his name is Felix and he wants to be an optometrist but his grades weren’t good enough to get into the university of his choice, so he’s taking a year off to figure out his next step. I’m puzzled why he thinks I care enough to merit this vomitous outpouring of personal information.</p><p>“Now you,” he prompts as we cross through the tables. “That’s how conversation works.”</p><p>“My name’s Shannon. I was born in the Deep South in a cursed little town, one full of witches, demons, and shit. Then some horrible things happened, and I probably killed my mother, but because I have partial amnesia, I can’t be sure. Now I’m working at Pretzel Pirate, which might literally be an annex in hell. Who says there’s no such thing as karma?”</p><p>To my surprise, he cracks up. “Okay, I get it, I’m pushy. Talk to you later, Shannon...if that is your real name.”</p><p>Huh. Telling the truth is fun, boys and girls.</p><p>Bemused, I head toward my penance for the bad deeds I don’t clearly remember. Opening at Pretzel Pirate has become second nature; I could do it in my sleep. I set the dough in the machines, put pretzels in the oven, and turn on various gadgets. Work passes with routine issues, like people bitching that their pretzel is too soft, not crispy enough, or I didn’t top it with enough jalapeño cheese.</p><p>The hamburger stand closes an hour before Pretzel Pirate, so I get to chat with Felix before he gets too hungry to wait any longer. This is good because if he’s still here when I close, he’ll ask me to dinner. I can read the signs, but there’s no way in hell that would ever happen. We may be the same age, but he looks like a toddler to me. He’s barely pubescent, let alone interesting in a sexual fashion.</p><p>As I’m locking up, I get a text from Jesse. Come out the west doors. I’m taking you home. If I didn’t have the dude from yesterday fresh in my mind, I’d bitch at him. It’s only nine fifteen, and I’ve been taking the bus for weeks. Yet tonight, the mall seems silent and faintly ominous as I pass through the food court; I don’t see any security guards and the stores have all shut down. Metal gates cover the shops, and the fountains aren’t flowing. Maybe I’ve seen too many zombie movies. Despite my best intentions, I quicken my steps.</p><p>It’s probably my imagination, but the faster I move, the surer I feel that someone’s watching me. I mean, there’s a night watchman on the security cameras. Maybe that’s what I’m sensing. Goose bumps rise on my arms. I feel...hunted. Darkness flashes to my right, but when I turn, there’s nothing, just a residual chill.</p><p>Bullshit to this. I take off toward the western exit, easier in my Pretzel Pirate shoes than it would be in combat boots. To my astonishment, Jesse comes tearing at me, his strides ringing on the tile floor. He stops when he sees nobody’s chasing me. That’s when I realize he’s drawn his weapon.</p><p>“What happened?”</p><p>“That’s what I’d like to know,” he snaps.</p><p>“But...” I don’t even know what to ask. He was running like he thought my life was actively in danger. Now, I figure I probably overreacted. I’ve got a vivid imagination.</p><p>“You were scared to death,” he says softly.</p><p>My eyes widen. “You could tell?”</p><p>He ignores the implicit question. “Did you see the guy again?”</p><p>“No, I just...” It sounds dumb. “I felt like I wasn’t alone, as if somebody was watching me.”</p><p>“It’s possible. Show me where.”</p><p>“Why?”</p><p>“Humor me.”</p><p>So I lead him back to the spot where the impression was strongest, just past the dark water in the silent fountain. Jesse pulls a pewter keychain out of his pocket, but there are no keys attached. He cradles it between his palms and walks a slow circuit around the area. Finally he stops, his gaze level and somber.</p><p>“You didn’t imagine it. Scrying magick’s been used here recently. The water is a natural conductor for those kinds of spells.”</p><p>“Maybe it was the weirdo from yesterday. He did say I won’t see him again until it’s too late.” I sound calmer than I feel.</p><p>This makes no sense. Why would the Gifted hunt me? If they need me to contact a dead relative, I’ll do it for twenty bucks, a six-pack, and a pizza.</p><p>Jesse pulls out his phone. “You see the odd shadings on his skin?”</p><p>It’s the photo I sent him. “Yeah, I figured it was my crappy camera.”</p><p>Absently, he shakes his head, reaching for me. Speechless, I let him lace our fingers together. It’s a protective gesture, not a romantic one, but I’m fucking holding hands with Jesse Saldana, so I’d be crazy to complain. His fingers are lean and long, callused in the right places, and his palm is hard against mine.</p><p>“Let’s walk and talk. I showed this to someone on my lunch hour today.”</p><p>“Oh?”</p><p>“She said the discolorations are consistent with long-term demonic possession.”</p><p>“What?” I know demons are real...and they usually don’t have enough power to traverse the gate between our worlds physically. It requires less juice to send mental energy, which results in a person being driven like a meat wagon. That’s not news, but I’m startled to hear my stalker is most likely extra-dimensional.</p><p>Mustering some presence of mind, I add, “So can your thingie tell if witch or demon magick was used to spy on me?”</p><p>“Unfortunately, no. But I’ll feel better once we get out of here.”</p><p>“They might still be watching? Why?”</p><p>“I wish I knew, Shan. Let’s go.” He tugs gently on my hand, and we hurry back toward the exit.</p><p>The air’s still cold inside the mall, a chill deeper and more disturbing than what comes from good air conditioning. There’s a faint smell too, sickly sweet, like death drizzled in honey. I don’t look back as Jesse shoves the door open. He’s left his Forester parked at the yellow curb, and the engine is running. In fact, the driver-side door’s open, too.</p><p>“You were pretty worried about me, huh?” I imagine him getting a wash of my emotional state and coming at a dead run.</p><p>Oh, Jesse. So many ways I’d love you, if you’d let me.</p><p>“For good reason, as it turns out.” He opens my door and waits until I’m settled to shut it behind me.</p><p>I could get used to being treated like a princess, as long as he brings the dirty cowboy to bed. Of course, I’m still working on that development, but it’s a good sign that the idea of me in danger scared the shit out of him. He starts the SUV and pulls out of the mall parking lot. For a few seconds, I watch as he eyes his rearview mirror, but nobody seems to be following. They don’t have to; they can use standing water to watch me. Note to self—showers only until we resolve this shit.</p><p>Jesse drives to my place, but he doesn’t drop me off. Instead he escorts me to the door. “I’ll wait here. Pack a few things.”</p><p>“Excuse me?”</p><p>“I’m not leaving you here alone when we have no idea what’s going on.”</p><p>“I have a roommate and I know how to dial 911.”</p><p>“So you’re willing to endanger Maria?”</p><p>“That’s a low blow, but I’m not going home with you, Jesse. Not unless you’re taking me there for better reasons.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Shan—”</p><p>“G’night. Thanks for the ride.”</p><p>I don’t think he expects me to close the door in his face. When I turn, I spot Maria in the hall, just stepping out of the bathroom. “Did I hear voices?”</p><p>I squelch the urge to reply, I dunno, but if so, you should check your medication. “Yeah, I bummed a lift from a friend.”</p> <p>“The hot cop? Are you guys a thing?” She skims me up and down, not meant to be insulting, but I suspect she can’t picture Jesse and me together.</p><p>Dammit. Neither can he.</p><p>“Nope. He’s just overprotective. Apparently the public transportation system is fraught with many and myriad dangers.”</p><p>“You should go for it,” she advises.</p><p>“I’m trying,” I mumble.</p> <p>“I’d offer to lend you some sexy undies, but I don’t think they would fit.”</p><p>That’s not a slam. Maria’s butt is bigger than mine, plus who wants to borrow sexy panties? Pass.</p><p>“Thanks. I appreciate the thought, though.”</p><p>Maria heads to her room after that. We don’t talk extensively, but she’s a decent roomie, here enough that I don’t feel totally alone, but she’s not always in my business, either.</p><p>First I wash the Pretzel Pirate smell off, then I make a salad. Along with some tuna and buttered noodles, this is dinner. I’m not much of a cook, but I’ve gotten good at putting healthy meals together from fairly little. Maria goes to bed while I’m still eating, so I turn on the TV for company.</p><p>I’m almost ready to turn in when my phone vibrates with a text from Jesse. You drive me crazy. Why won’t you let me protect you?</p> <p>I reply, That’s not your job. You’re my friend, not my lover or my bodyguard.</p><p>There’s a pause between messages. I picture him on the couch, like I am, frowning at his phone. If we WERE together, would you fight me this much?</p><p>Elation surges through me. He might not realize it, but that reveals how much his thinking has changed in a relatively short time. Even if it’s a hypothetical question born of aggravation, it also means he’s wondering what we’d be like as a couple. So obviously, I flirt with him.</p><p>That depends, I answer. How much do you like it?</p><p>A whole lot...and not at all.</p><p>Look, J, I’m never gonna sit on a pedestal and wait. I’m not that kind of princess. I’ll insist you take me with you to storm the castle and I’ll carry my own sword.</p><p>You won’t let me slay your dragons? I imagine him saying it in a soft, teasing tone.</p><p>Without hesitation, I type, there’s only one circumstance where I would.</p> <p>What’s that? He responds so fast; there’s no way he’s doing anything but talking to me. That makes me ridiculously happy. His dinner might be cooling on the table beside him, the TV playing unnoticed.</p><p>If you want me to say yes to you, you have to say yes to me.</p><p>Blackmail’s illegal. But damned if you don’t make it tempting.</p><p>That’s the idea. Night, cowboy.</p><p>Six</p><p>All through the week, Jesse sends me texts and emails.</p><p>Those messages are the high point of my day, no matter what he says. Sometimes he writes about how work’s going, though nothing specific about his cases. Other times, he talks about his partner, and then rarely, his family. I wonder if he realizes how much he’s sharing, how much he’s opening up. I keep teasing him, and soon he’s flirting back. It’s easier to get him to respond this way, possibly because he’s not looking at me and thinking how young I am.</p><p>Wednesday, Maria and I have a Chris Pine movie marathon by connecting my laptop to the TV; she has a Netflix account—or rather, she knows a cousin’s password. So we’re all set. As we’re watching Mr. Pine use psychic powers, I try not to think about the weirdo who was watching me. I haven’t sensed anything out of place since then, but that doesn’t mean I’m clear. It’s hard to feel safe when somebody could be staring up at you from your dishwater.</p><p>A text comes in from Jesse as the last movie ends. What’re you doing?</p><p>Admiring Chris Pine’s hotness.</p><p>He’s older than I am!</p><p>Like I care. Or as if age would stop me. What’s your point?</p><p>Mentally, I hear him sighing. Never mind. I wish you were here. Texts and emails are fine, but I want to talk.</p><p>About what?</p><p>I just miss you, that’s all.</p><p>This feels like a huge admission. So I stand up and say to Maria, who’s been watching me text, “I’m gonna call it a night.”</p><p>“Sure. It was fun. We should do it again.”</p><p>“Chris Evans next time?” I suggest.</p><p>“Deal.”</p><p>Once I’m in my room with the door shut behind me, I dial Jesse’s number. I’m not a phone talker, you understand, but I’ll make an exception to capitalize on this emotional confession. It rings twice before he answers. I’m already snuggled down on my futon. Low-level arousal percolates through me as I picture him doing the same. In my head, he’s in bed and shirtless, listening to my voice.</p><p>Mmm, yeah.</p><p>“Here I am,” I say.</p><p>“Shan...” His voice is rich, the drawl pronounced, and he imbues my name with a kind of longing I’ve never heard before. “You can’t make me feel this way.”</p><p>“Are you sure it’s me and not you?” I ask.</p><p>“That’s the problem. I’m never sure.”</p><p>“You would be with me.”</p><p>Silently, I replay his words in my head. Is he picking up how I feel, from all the way across town? I don’t know much about empathy, but that’s an enormous range.</p><p>“How do you keep from drowning in other people’s emotions?” I ask, before I can think better of it.</p><p>“It doesn’t work like that. The distance is more of a gauge,” he mutters. From his tone, it’s clear he doesn’t care to elaborate.</p><p>And that makes me even more determined to get an answer. “Of what?”</p><p>“How much I care.”</p><p>“So you care...a Laredo-sized amount about me?”</p><p>“Shan,” he whispers. “I doubt you could go anywhere that I wouldn’t feel you.”</p><p>Oh. My. God.</p><p>He goes on, “I haven’t felt like this since high school. You’re burning me alive.”</p><p>“That’s not a bad thing.”</p><p>“Said the flame to the moth.”</p><p>He must be wondering how he’d explain me to his friends and family, his work colleagues. I won’t change for him. If he wants me, I come with Gothic splendor. He has to love me enough not to care what other people think or how they feel about us together. I don’t know if Jesse has that much of a lawless streak in him.</p><p>I sure hope so.</p><p>And it’s not like I’m jailbait. I’m just not the girl anybody would pick for him.</p><p>“You seem to think I’m bent on your destruction.”</p><p>“Sometimes it feels that way. No matter how many times I tell myself it’s a bad idea, I close my eyes and see your face.”</p><p>“I’m good with that.”</p><p>Then I disconnect the call because I’m ready to turn it into something filthy, and I don’t think Jesse’s ready for that. I suspect he’d feel guilty if we had phone sex, which would set us back. I text him a good night, and then I handle my own needs, all the while conscious that he’s probably feeling everything I do. I consider how he might respond, and that’s enough to make me arch and quiver. Afterward, I’m glowing when I get his texted reply to my emotional message.</p><p>God, that was good.</p><p>For obvious reasons, I start all over again.</p><p>On Friday, I’ve been working for about four hours when I straighten up too close to the drink machine and whack my head. There’s a line of customers, and a few of them act like they might slip behind the stand to help me. Mark would throw a fit and probably fire me; I can hear him ranting about liability. God, training with him sucked so much.</p><p>Through sparkling vision, I mumble, “I’m fine, just give me a few seconds.”</p><p>I stumble through their service, and they’re all humane enough not to whine. I probably give them the wrong food and beverages, but I’m barely conscious. Afterward, it’s like that impact shook something loose—or broke it more likely—but now I’ve got this picture sitting in the front of my head.</p><p>From the outside, it looks like an Oriental trading company, a shop where they sell rugs, fans, and cute imported things. I see myself walking into the store, through the front, and into a private room in back. Here, it’s clearly an arcane supply house with wards, runes, wands, herbs, athames, and other rare spell components. Since I’m pretty sure I can’t cast spells, I can’t fathom what I was doing there. I get flashes, too, of the woman who accompanied me, but there’s a blank spot where her face should be, one I just can’t fill—and pushing ends with me crouched on the floor, cradling my head. Bumping it was painful, and I’ve got a lump rising; this is more of an iron spike through my frontal lobe.</p><p>Felix comes jogging over. “Damn, you okay? I heard that bang from across the way, over the whir of the milkshake machine.”</p><p>“You’re hilarious.”</p><p>“You don’t look good. Come on, sit down for a minute.”</p><p>I let him help me up and lead me out to the nearest table. Unless my vision clears up, there’s no way I can finish my shift. Which is unfortunate because the manager’s on vacation for two weeks. He’s been running the place with little help for months, not too surprising, given the uniforms and the pay. My hours might get cut once he comes home, but I’ll worry about that later. Like when my brain isn’t trying to leak out my ears.</p><p>“Is there anyone you can call to cover your shift?” Felix asks.</p><p>“Maybe.” It’s past three, so Tim, the high school boy who works on the weekends, might be able to come in. But we’re not supposed to swap hours without Mark’s approval. But I don’t give two craps about policy at the moment.</p><p>After a few seconds, I hobble back to the stand, the ache in my head subsided to a low roar, and I dig for the personnel roster. Soon I’m on the phone, begging Tim to save me. “I’ll work all day tomorrow for you, promise.”</p><p>“Deal,” he says.</p><p>Four hours for eight is a bargain. Despite working at Pretzel Pirate, Tim is no fool. He gets a free Saturday out of this arrangement. As I disconnect, a coworker calls Felix back to continue flipping burgers, and I dig the Yellow Pages out from beneath the counter, then look up the shop. I recall the name from the signage, and to my surprise, I find the listing. Huh. I tap the page. So it’s a real place downtown...and I’m not crazy. I enter the address in my phone and then use an online service to figure out what buses to take from here. I note that on my phone, too. Hopefully, if I make all the right connections, I’ll get there before closing time.</p><p>I can’t shake the certainty that it’s important. Honestly, that’s why I’m so set on getting out of here. I could finish work with a sore skull, but since Tim agreed to fill in, I’m heading out as soon as he shows; maybe the place will jog my memory. It only takes fifteen minutes for Tim to saunter in. He moves slow, but he’s a good worker, and he’s not annoying like Mark. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He eyes the bump on my head and says, “I get it. No explanation necessary.”</p><p>“Some days are like that,” I say with a sigh.</p><p>He grins. “Most of mine, actually. Later, Shannon.”</p><p>As I’m heading for the bus stop, my phone beeps. Honestly, I’m surprised Jesse hasn’t messaged me sooner. I’m not 100% sure if I love being looped in so tightly, but on the other hand, it means he cares. So I can handle the attention, especially when it comes with perks like the other night.</p> <p>This might sound dumb, but are you all right?</p><p>Minor head trauma, self-inflicted. Nothing to worry about.</p><p>But worrying is my only superpower.</p><p>Lies. You also look amazing in jeans.</p><p>It’s absurd that I can enjoy flirting with him so much via text. But I’m smiling as I board the bus. Patting my bag, I make sure my radio’s still in place. Since that freaky meet-up outside the market, I don’t go anywhere without it. My magickal focus, so to speak, fits in a backpack, so there’s no reason for me to go unarmed, especially when things could turn scary in a split second. Reassured that I’m not helpless, I transfer near downtown and ride a little farther, then I hop off a block from the store. The whole time, I’m aware somebody could be following me, but I don’t see anyone. Nobody else gets off at my stop, anyway, and there are no puddles they can use to spy on me.</p> <p>I hurry along the sidewalk and enter the trading company. A bell jingles, and I’m overcome by an urge to leave. The feeling almost chokes me, but I force myself to continue deeper into the shop. As I get closer to the back room, the aversion dissipates. I push through the curtain, and everything’s just as I’d pictured in my mind’s eye. Only I don’t remember coming here per se; it’s more like a dream.</p><p>An elderly woman sits behind the counter. She watches me with still, dead eyes, and she doesn’t smile. Customarily, a greeting might be in order or an offer to help the customer find what she’s looking for. This clerk tracks my movements with her eyes, which seem impossibly dark and deep, too much for her grandmotherly demeanor. For God’s sake, she has knitting on the counter. I feel weird thinking she’s pure evil, like I might be guilty of ageism, but I have the same feeling now as I did the other night at the mall.</p><p>I hardly dare to breathe as I move through the shop, pretending to look at the arcane accoutrements. I suspect this might’ve been a mistake. Why didn’t I tell Jesse where I was going? I’m wondering if they can track my phone. He’ll try that, right, when I turn up missing? Then I remember that’s for contract phones and mine’s pay-as-you-go. Dammit.</p><p>“Are you looking for anything in particular?” She speaks at last, and her voice has an awful quality, like a dead thing scrabbling up from the bottom of a well.</p><p>“I’m just browsing.” What the hell. Since I came all this way, I might as well ask what’s on my mind. “This might be an odd question, but...have I ever been in here before?”</p><p>And that’s when the old woman vaults the counter like a stick bug and tries to kill me.</p> <p>Seven</p><p>I stumble back a few steps and topple a display between us. The shattering glass slows her down long enough for me to pop open my backpack. Dodging between display racks, I weave away from her. Madness and malevolence radiate from her in smothering waves, and she’s eerily silent, just the rough gasps of a body unused to such physical exertion.</p><p>“Maybe we could talk things through,” I offer. “Get some counseling? I’m sure whatever it is I did to you, which I apparently don’t remember, I can make amends. How do you feel about macramé rugs?”</p><p>Her bony fist smashes through some stained-glass shelving, and her blood spatters me as I dive away. It smells faintly of rotten eggs.</p><p>“So that’s a no on arts and crafts?”</p><p>When she sweeps her arm across a shelf, crystal shards rain down, tangling in my hair. At her next attack, some kind of dust explodes all over us, making me choke, but it hampers the crazy demonic assassin as well. Close up, I can see the uneven patches on her skin. Her eyes roll in her head, spinning like no human could manage, and that creeps me out enough that I almost drop my radio.</p><p>Almost.</p><p>I tug at the dials with cold, shaking fingers. I’ve never tried to summon whatever spirits might be listening, but I need help. So I spin at random and call out, “Restless dead, I summon you to this place, I call you to my aid.”</p> <p>At first it seems like I’ve chosen a bad channel and nothing’s within the sound of my voice. Worried, I duck the heavy urn she hurls at me. If she keeps this up, she’ll destroy the store’s whole inventory. Also, she’ll open my head like a melon. Of the two, I’m more concerned about the latter.</p><p>I jiggle the dial and mutter the call again, and this time, I feel them coming. The temperature in the room drops by ten degrees, sending a chill down my spine. Tingles radiate outward from where my fingers are touching the radio, my energy fueling their hunger, but it’s not sated. I could never give enough to make them feel warm or whole. This is like tossing a few scraps to a starving predator. Though it’s dusk outside, that purple plum of a sunset, it’s darker still in the store, as if some pagan god dropped a black bag over the sun.</p><p>“Drain her,” I command.</p><p>Darkness swarms around the old woman. I stop running then, watching in horrified fascination as her body pulls taut, held by unseen hands. Her feet come up, nearly off the floor, and she quakes from head to toe. At first, she lashes out, snarling in incoherent rage, but her skin grows paler and paler, then the creature driving her body leaps away. It’s hard to distinguish its sooty swirl from my starving spirits, but I track the energy; it dives from the old woman into the telephone, and I’m astonished. Is that how demons travel? If they’re energy, it stands to reason they could pass in telephone or electrical wires, right? Holy shit. It makes me want to break all my electronics, right this minute. But I’m so busy pondering the implications that I almost forget to stop the feast.</p><p>“Stop!” I call. “Don’t kill her. Restless dead, I send you from this place.”</p><p>The room chills further, and I fear they won’t listen. Part of me wonders why they heed me at all. But the ghosts withdraw in a misty blur, quick as they came. The old woman drops in a heap on the floor, amid the wreckage. With trembling hands, I turn off the radio. There’s no sign of what truly happened here, apart from her collapse and my minor injuries. How the hell can I explain this?</p><p>Good thing I’ve got a cop on speed dial, but like usual, he’s already calling me. “Shan, what the fuck?”</p><p>“Hey. So can you please send EMTs...and I’d appreciate it if you came too. There will be questions...and I don’t know what to say.” I give him the address.</p><p>“Are you hurt?” He sounds frantic. I hear horns honking, Jesse swearing, and the screech of tires. “I’ll be there in fifteen minutes. Sit tight. Wait, no, first get to a safe location and sit tight.” The fact that he’s repeating himself is kind of adorable.</p><p>“I’m not hurt. The ambulance is for someone else.” I kneel beside the old woman and press two fingers to her throat. “She’s alive but in bad shape.”</p><p>“Christ almighty, Shan.” He produces a string of curses that would impress me at any other time.</p><p>“I’m hanging up now. I’ll be here, and you need to focus on your driving.”</p><p>He’s still ranting when I cut the call. Sometimes I think Jesse’s not used to females like me. I sit down beside the old woman, feeling horrible and helpless, but was I supposed to let her kill me? I did the best I could. Heart heavy, I dig into my bag and produce a chocolate bar. Eating it keeps me from passing out.</p><p>Jesse arrives before the medical personnel. He runs through the shop, apparently not bothered by the aversion spell that rocked me in the front of the store. I guess if you can shake it off, you belong here. His cop instincts make him clear the room before he approaches, then he kneels beside me.</p><p>“What the hell happened here?”</p><p>I give him the nutshell version of how I remembered this place and thought visiting might help. Then I explain the woman’s weird reaction and how she went after me. He can tell by looking at her she’s been hosting for a while, as that’s not good for your health, but this account won’t satisfy the authorities.</p><p>Quickly, he searches the premises, and I watch, puzzled. “What’re you doing?”</p><p>“Quiet. I’ll deal with you later.”</p><p>Hm. I like the sound of that. So I shut up, letting him do his thing.</p><p>At last he comes back, seeming relieved. “This is a break for us. There are no security cameras, so we’ll go with an unknown assailant. Caucasian male, late twenties, brown hair, no distinguishing features.” He pauses. “That’s your report, right, Ms. Cheney?”</p><p>I see where he’s going with this. That’s too general a description to convict anyone; it applies to billions of men across the country. “Absolutely. He tore up the place and scared the clerk so bad, she had some kind of seizure. I ran away from him and called you...because we’re acquainted and I thought you might come faster than 911.” I wish I could use a stronger word to describe our relationship, but I rather doubt Jesse wants me to announce that I’d give a kidney to fuck him, especially in official documents.</p><p>The EMTs race in, just as I’m concluding this version of events. Other police officers arrive as well, and they start the inquiry. Jesse tries to shield me from the worst of it, but he can’t keep the rest of the force from trying to figure out what happened. Fortunately, the shop is busted up enough that they can’t be sure what kind of goods were sold. Some of the powders and potions would probably draw strange looks if the officers were reading the labels instead of questioning me.</p><p>The ambulance takes the old woman away, and I’m left repeating my story, hoping it doesn’t sound rehearsed. I don’t have to pretend I’m shaken or that I can’t remember much because, oh my God, it all happened so fast. I’ve seen enough cop shows to be confident these guys hear that all the time from agitated witnesses.</p><p>Finally, Jesse says, “I’d like to get the cuts on her hands checked out. I’ll make sure she comes in for a follow-up interview.”</p><p>“I think we’re good, actually.” The other cop puts away his notepad. “It was probably a tweaker, looking for some fast cash. Don’t imagine he found any in a place like this. They usually knock over convenience stores.”</p><p>“Maybe he was just in the neighborhood,” Jesse says with a straight face.</p><p>The uniformed officer laughs. “Crime of opportunity? Maybe. It doesn’t sound like much planning went into this.”</p><p>Soon after, Jesse escorts me to his SUV, makes sure I buckle up, and then he drives exactly two blocks. For the first time, I notice how tightly he’s locked himself down, like if he didn’t have his hands balled into fists, he’d be screaming and punching things. Is it odd that I find this self-control insanely hot, even while I’m contemplating all the delicious ways I can make him lose it? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He jams his finger into my seat belt button and drags me up into his arms, across the console and onto his lap. I settle, deciding this isn’t the time to fight him. Jesse runs his hands up and down my back, burying his face in the curve between my neck and shoulder. Tentative, I touch his jaw, bristly with scruff, and then walk my fingers up his cheek to his temple, stroking back toward his hair.</p><p>“I’m fine,” I whisper. “I handled it. I just needed an assist with the logistics afterward.”</p><p>“I can’t take this, Shan. Do you have any idea how much I worry? I think about someone hurting you and I can’t fucking breathe. I want to invent a hundred new kinds of pain and teach it to anyone who looks at you the wrong way.”</p><p>“Why?”</p> <p>“I don’t know,” he snarls.</p><p>“That’s a copout. Or a lie.”</p><p>“Because you’re in me like a fever. I wake up thinking about you. I go to sleep that way. I find you in my dreams.”</p><p>“What’m I doing?”</p><p>“Me,” he bites out.</p> <p>And then he kisses me like he needs me more than air. His mouth is fierce and hot, ravenous as he nuzzles into me, tongue surging in lavish strokes. I can feel his desire, both from the hard length under my ass, and because he’s totally lost the reins on his gift. Powerful empaths don’t just read emotions; they can also broadcast, but I’ve never known Jesse to do that. He’s off the chain now, though, wild as a Texas storm and twice as dangerous. He pulls me to him until I’m sure he’s leaving bruises on my hips. His emotions feed mine, which ratchets his need higher in turn, until we’re both damn near mad with lust.</p><p>I scramble, not fighting him, but helping, until I’m astride his lap. With a growled curse, he shoves the seat all the way back, making room. He bites down on my neck, hard enough to hurt, not quite enough to bruise, but I wouldn’t mind if he broke the skin. I’d be glad to walk around with Jesse’s teeth marks on my body. In fact the thought of it makes me hotter, and I move on him. He’s ablaze beneath me, panting against my lips.</p><p>We’re gonna do it. He can’t stop. I don’t want to.</p><p>Then someone taps on the window. Motherfucking bastard-ass shitballs—I melt down silently in frustrated rage. The glass is fogged up, so whoever it is can’t see us. My knees are weak when I slide off his lap. Jesse looks like he could happily tear somebody’s heart out with his teeth when he powers down the window.</p><p>“What?” he snaps.</p><p>It’s one of the uniformed officers from the scene, looking curious, terrified, and intrigued, all at the same time. “I saw your vehicle and I wondered if you’d broken down. You said you were taking her to the doctor...” His voice trails off, then he changes his mind. “I can see things are fine. Sorry to bother you.”</p> <p>Once he walks away, I check my reflection in the mirror attached to the visor. My hair is a mess, my lips are swollen, and I’m covered in glass fragments and speckles of blood. It’s obvious to me—and probably the other cop—that we were making out.</p><p>Jesse slams a hand into the dashboard, and my heart sinks. I guess he’s ashamed that we got caught, and the hurt swells up until I think I might be sick. His look softens at once, and he covers my hand with his.</p><p>“Hey, no. It’s not that, Shan.”</p><p>“What is it then?”</p><p>“I’m pissed we had to stop.”</p><p>I don’t suggest that we pick up where we left off. This isn’t the time or place. We both got carried away, but damn, was that amazing. “Oh.”</p><p>He smiles, his dark eyes warm as melted chocolate. “Now I have to be responsible and make sure you don’t need stitches. Then you’re coming home with me. No arguments, or I’ll remember that I’m furious. You don’t wanna find out how that story ends, sugar.”</p><p>I smirk. Actually, I kinda do.</p> <p>Eight</p><p>Jesse takes me to a twenty-four-hour clinic, where the doctor cleans and wraps my injuries, apart from a deep cut between my middle fingers. It gapes open when I flex my knuckles; that gets two stitches, but since they’ll dissolve on their own, I don’t have to come back in. The doc looks tired, and he doesn’t ask any questions. I’m sure Jesse was prepared to answer them, but I guess the doc sees much worse on a daily basis.</p><p>This time, when we get in the SUV, Jesse doesn’t take me to my place. He’s gotten savvy; he figures I might change my mind if he gives me the chance, so we end up at his apartment, even though I don’t have any clothes. Like me, he doesn’t live in a complex. Rather, this is a three-story brick building. From the size, I estimate there are six apartments total, two on each floor.</p><p>Jesse leads the way up two flights, then unlocks the door. Inside, it’s tidy, but I glimpse the ravages of an old scuffle; there are lighter spots on the walls, as if small holes have been patched, and the furniture is so crisp and new that I figure something must’ve happened to his old, comfy stuff. This doesn’t look like I imagined, however. It’s warmer and less modern, possibly because of the combination of textiles and colors. I would never have pegged Jesse as favoring red and yellow. Against the white walls, it works, though.</p><p>“You’ll sleep on the couch,” he says.</p><p>I’m not surprised. The heat of the moment overwhelmed him in the car, but now that logic’s driving the bus again, he doesn’t feel right about asking me to get naked and hop in his bed. Though that would totally be all right with me.</p><p>“I hope you have a spare toothbrush.”</p><p>“In the medicine cabinet.”</p><p>When he comes back with it, I ask, “Are you worried about your coworker telling everyone...?”</p><p>He shakes his head. “They’ll probably give me shit for steaming up the windows with a girl in a Pretzel Pirate uniform, but I can take it.”</p><p>Oh, shit. I realize I am, in fact, still wearing my work clothes. “Do you have a washer? I have to go in tomorrow. I promised Tim I’d cover his shift if he took over for me today.”</p><p>“So you could go poking around a store that came to you in a vision.”</p><p>“Hey, it was almost a memory.”</p><p>“I can’t believe you just went off on your own. Were you thinking at all? You know somebody’s stalking you, Shan.”</p><p>“Since when is shopping hazardous to your health?” I bristle.</p><p>Jesse sighs. “Yes, I have a washer. This way.”</p><p>His apartment is definitely nicer than mine. His bathroom has a small space set back in the wall, which holds a stacked washer and dryer. I’d love if I didn’t have to drag my clothes downstairs to the communal laundry room. Because I’m made of evil with whipped cream frosting, I start stripping right there.</p><p>“What’re you doing?” he demands, whirling away.</p><p>“Washing my things. Do you have anything you want me to add? It seems like a waste to run the machine for four items.”</p><p>“I’ll get my laundry basket.” He sounds strangled. “And I’ll bring you something to put on.”</p><p>“Appreciate it,” I say cheerfully.</p><p>So I’m literally standing naked in Jesse’s bathroom when his arm reaches around the corner. He’s holding a white V-neck T-shirt and a pair of boxers. I scramble into them, then I step out, so he can add his clothes to the washer. This outfit’s not exactly modest. You can see the points of my nipples and the fly gaps when I walk.</p><p>“I should get you a robe. Dammit. I don’t own one. I’ll go to the store.”</p><p>I laugh. “Now you’re being silly. I’ll wrap up in a blanket in the living room. It’ll be fine.”</p><p>“No, it won’t,” he mutters. “You’re wearing my clothes.”</p><p>“Huh?”</p><p>“Never mind. You don’t need any hints on how to drive me crazy.”</p><p>Ignoring my offer of help, he aims me at the couch and whips up a quick meal. The chicken and rice is fancier than I’d have made, though it’s not haute cuisine. It’s also really good. He turns on the news as we eat, and I have the thought that I’d be so happy if this was my real life. I mean, not necessarily wearing his underwear every night, but curling up with Jesse, eating dinner?</p><p>God, yes. Please.</p><p>After dinner, he dumps the plates in the sink and joins me on the couch. It’s just past nine by now, not early enough for bed, and I have no idea what he’s thinking. With a sigh, Jesse wraps an arm around my shoulders.</p><p>“Don’t be nervous, Shan. I won’t do anything. I was an asshole to treat you like I did in the car.”</p><p>I laugh. “Seriously? You think that’s why I’m uptight?”</p><p>“No?”</p><p>“In my mind, that’s the best move you’ve made where I’m concerned, and certainly the most honest. And now you’re back to being the good guy, the one with perfect manners. I’m afraid you’ll raise up the walls between us and I’ll have to start all over again.” I pause, wondering if I should say this. “I don’t know if I have the energy. I mean, I want you. I’ve made no secret of it. But I won’t chase you forever.”</p><p>“Is that an ultimatum?” He sounds coldly furious.</p><p>I’m a little proud of myself. I didn’t know it was possible to make Jesse angry so fast. “Just a fact. In time, I’ll move on, find someone who wants me more.”</p><p>Rage bludgeons me. For the second time tonight, he loses control and his emotions hit me like a hammer. It’s a mad wash of fury, jealousy, frustration, and a hint of possession that thrills me to my core. He might be struggling, but he doesn’t take me lightly.</p><p>“That would be impossible,” he growls.</p><p>I never imagined he’d be so intense; he projects such casual charm. Most likely, other women couldn’t handle it, so he hides. He pretends to be gentle and tender, no darker feelings, no obsessive tendencies. He’s been playing that violin so long, it’s become the only tune he knows. But I don’t just want his sweetness.</p><p>I want everything.</p><p>“Tell me about her,” I say then.</p><p>“Who?” I’ve surprised him.</p><p>“The girl who made you like this. Before, you said you haven’t felt this way since high school. I’m guessing it didn’t end well.”</p><p>“It never does.”</p><p>I stare at him until he shifts uneasily. Then he pushes out a sigh of mingled annoyance and capitulation. “You want to know how it goes, sugar? I’m a black hole. I want and need and I devour their feelings, until they’re empty, too. Nobody can satisfy me. And I drive everyone away in the end.”</p><p>“I’m still here.”</p><p>“That’s because you’re not actually with me. If you were, you’d come to hate yourself...and me. Because you’d see me reacting to other women, just like they did. Do you have any idea how hard it is not to reciprocate when somebody wants you and you can feel their desire coursing through you, sweet and hot? It’s like a drug.”</p><p>Suddenly, I understand—and the barrier isn’t what I thought. He’s not thinking about how wrong I am for him, or that I’m too young anymore. It’s not being with me that he fears; it’s losing me. And I fall in love so hard that I see stars. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, here’s my opinion: I don’t care where you start the fire, as long as you bring it home to me.”</p><p>Desperation wars with hope in his dark eyes. “You say that now. But it wears away at you. I’ve heard it so many times, why aren’t I enough for you? Why—?”</p><p>“Don’t compare me to other women, Jesse. That’s not fair, and...I’m not doing it to you.”</p><p>“Stop,” he begs, pained. “You’re so fucking lovely that there must’ve been guys, but when I think about it, I could kill somebody.”</p> <p>“Fair enough.”</p><p>“Give me some time. Not long. Just...I need to think.”</p><p>“Are you sure? Thinking is bad.” But I’m teasing him. When I said I’d move on, I meant after fruitless months...or maybe even years. I’ve never been in this situation before, so I can’t say with any surety when I’d run out of patience. So if he needs a few days to consider where we go from here, that’s fine.</p><p>And he knows this. That’s a handy adjunct to his empathy; he can feel my amusement. His expression lightens to relief and appreciation. I don’t have to worry about stupid fights with Jesse. He’ll always know how I’m feeling when I say something. It also means there will be no secrets, no quietly nursed resentments. I bet most women found that much honesty terrifying, but I’m on board.</p><p>“If...when...we do this, just know...I’m gonna be possessive as hell. I’ll crowd you. I might annoy you. And I don’t want—”</p> <p>“Hey. None of that’s a surprise to me. If you start bugging me, I’ll push back. I’m not made of spun sugar and unicorn whiskers.”</p><p>“Do unicorns have whiskers?”</p><p>I grin at him. “That’s completely beside the point.”</p><p>Jesse puts on a movie after that, and the air feels clear between us. We’re not together, exactly, but we’re in the sweet anticipatory stage where desire flares like a bottle rocket and lights the sky with promise.</p><p>At the midway point, he squeezes an arm around my shoulder. “Stop thinking about sex. It’s distracting.”</p><p>“I guarantee nothing.”</p> <p>In fact, he sleeps on the couch with me. I suspect his neck hurts in the morning because we drifted off snuggled up with his arm about me. Jesse rushes around getting ready, and I can tell he feels awful that he has to run, and he can’t take me to work, but I don’t have to be there for three more hours. So I hang out at his place until it’s time for my shift, then I catch the bus as usual.</p><p>I come in through the employee entrance and draw up short when I step into the food court. Strangely, there’s a man sitting at one of the tables, even though none of the stands are open yet. He’s not eating, either, or reading a magazine. He’s just...waiting. There’s a niggling familiarity about him, but I can’t place the memory—and when I try, that old sharp pain surges forth. The last few days have been weird enough that I pull my radio out of my backpack. Better to look like an oddball than to be caught defenseless.</p><p>“You won’t need that, Shannon.”</p><p>What’s with all of these guys knowing my name?! I stop, narrowing my eyes. “Who the hell are you?”</p><p>From this distance, I can see that his skin isn’t quite right, either, but it’s not as bad as the old woman or the man who was following me at the market. He clasps his hands before him, like that will reassure me.</p><p>“I’m here to offer you a deal,” he says.</p><p>“I’ll just bet.”</p><p>“What if I told you I could restore all your lost memories? How much is that worth to you?”</p> <p>“A lot,” I answer, before I can stop myself.</p><p>Dammit. I just gave up some leverage.</p><p>“Excellent.” The man looks dreadfully pleased. “And what if I told you that regaining your memories means losing Jesse Saldana forever?”</p><p>Shit. Is that his price? I’m familiar enough with the concept to realize I’m being offered a demonic bargain. There’s always an awful aspect to the deal, but they don’t usually spell it out for you upfront.</p><p>Yet I don’t even have to think about it. “Forget it. I’ll handle the uncertainty. I won’t live without Jesse.”</p><p>“That’s exactly what I told them you’d say,” he murmurs.</p><p>When I turn, he’s already gone.</p><p>Nine</p><p>The week ends without further complications. This makes me nervous because demons have been all up in my business, whatever that is. I imagine it’s related to the memories I’ve lost. Since they want Jesse as the price for getting them back, well, it’s not happening. I’ll deal with this some other way.</p><p>I don’t see Jesse until the following Saturday, though he sends regular texts, so I know he’s thinking of me. And I hope he’s contemplating our situation. But I’m trying not to be pushy. He has to want this as much as I do.</p><p>Early on Saturday afternoon, he calls me. “I’ll be at your place in half an hour. Pack a bag.”</p><p>“I’m not moving in with you. What if the sex is terrible? I’ll have to take all my stuff home again, and I’m opposed to so much extra work.”</p><p>“Stop trying to sidetrack me, woman. I know I’m supposed to want to prove my prowess now.”</p><p>“And don’t you?” I ask softly.</p><p>“Dammit, Shan. Later.” He sounds equal parts amused and turned on. “We’ve got a meeting with Twila tonight.”</p><p>She’s the woman who runs Texas. I’ve never met her, but I’m told she’s the most powerful person in the whole state, so far as the supernatural community is concerned. Whether you’re a witch, warlock, wizard, Gifted, or demon, you owe Twila fealty. I probably should’ve gone to see her when I first arrived, but I had other things on my mind, like not being homeless or unemployed.</p><p>“Does she know about my gift?”</p><p>“Twila knows everything, but she’ll ask a steep price for her information.”</p><p>“If I can afford it, I’ll pay. And...I’m getting my stuff together now. Gotta go.”</p><p>I hang up on him again, something that gives me inordinate pleasure. The background noise made me think he was in the car when he called, so I hurry through packing. I take enough for an overnight stay: clean panties, bra, fresh outfit. The combat boots I’m wearing will work tomorrow, so I don’t need extra shoes. Then I stuff my huge cosmetic bag into the backpack.</p><p>The weird thing is, I can imagine washing off my makeup before going to bed with Jesse. I can picture letting him see my naked face in the morning, the way other people rarely see me. In my mind, it’s like when a Victorian maiden lets down her long hair only in front of her husband. There’s a sexual component to it, a sense of stripping down with him completely. I want that. The other night, I didn’t take my paint off, so it was kinda smeared when we woke up, but he was in such a hurry that I don’t think he paid much attention.</p><p>I’m waiting out front when he arrives. Waving, I jog toward the SUV, but he’s faster, sliding across the hood to keep me from opening my own door. I find his eagerness adorable. He sets a palm to my cheek and kisses me softly, sweetly.</p><p>“Hey,” he says, and it’s a thousand words crammed into one. It’s hello and how are you and I missed you and thanks for coming when I call.</p><p>I hear him. I hope I always do.</p><p>“Hey yourself.” I don’t know if I’m as eloquent with my tone as he is with that sexy-as-fuck drawl, but he can feel my emotional response.</p><p>I watch his eyes melt. Deep down I highly suspect the women who left Jesse just couldn’t carry his love, because it’s a big, deep-swimming plesiosaur of a thing, and if you’re not strong enough, it could swallow you whole. There’s something I haven’t told him, though. I’ve spent my life with a hole inside me too, waiting for somebody who’ll make me the center of his world—and without trying to change me. It feels like nobody’s ever loved me exactly as I am.</p><p>“Not...sad. Wistful? Why?”</p><p>I just shake my head and hop into the Forester. It’s not time to be emotional. Since this is a road trip, I buckle up and fiddle with the radio. “Does Laredo have a non-country radio station?”</p><p>“Careful,” he teases. “You might end up with dead people instead of music.”</p><p>“One day, when you least expect it, I’ll make you sorry for that.”</p><p>“Shan, you’ll never make me sorry for anything.”</p><p>“You make it impossible to stay pissed at you.”</p><p>“Psh. As if you were.”</p><p>He’s got me there. I find some decent music, and Jesse doesn’t object to what I like. Good sign. The drive to San Antonio passes with him teasing me, and I joke back. Every word has a flirty, playful undertone; it definitely qualifies as foreplay. But he quiets the closer we get to the city, and he’s not talking at all by the time he pulls off the highway.</p><p>Twilight is situated in a seedy area, a strip on Main full of Goth bars and gay clubs. A few of them look like they’d be fun. Does Jesse like to go dancing? Our destination occupies the corner, and it’s built of crumbling brick. If Jesse wasn’t leading the way, I’d have no reason to head into such an unremarkable place. The only bit of color comes from a small purple neon sign that says Twilight.</p><p>“This is kind of a hub,” he explains, opening the black metal door for me. “Where the Gifted populace can mingle, make connections. Sometimes there’s work for hire. Other times it’s just people cutting loose.”</p><p>The floor is hardwood in need of refinishing and partially covered in faded carpet. On the walls, red lights glow in scalloped sconces, then there’s this funky maroon striped wallpaper. Dark beams give the place a certain rugged charm. I like that it isn’t pretentious. You could really settle down and drink here. Well, as long as you like the Dropkick Murphys, currently blaring from the jukebox.</p><p>“Don’t you ever play anything else?” Jesse asks the ginger-haired, freckled bartender.</p><p>The woman shrugs. “They’re Twila’s favorite band. Haven’t seen you in here for a while. Everything all right?”</p><p>“More or less. Is she ready for us?”</p><p>“Not quite. I’ll let you know when she buzzes.”</p><p>“Then let’s have a drink while we wait.” Jesse orders a lime fizz, which is basically just lime juice and seltzer. I’m sure he’s thinking about the drive back.</p><p>I’m not technically old enough to drink, but I wear so much makeup that bartenders rarely card me. They assume the paint is to cover wrinkles, I guess. So I say, “Can you make me a Forbidden Fruit?”</p><p>“Coming right up.” I watch as she mashes the kiwi, adds sugar, Midori, sake, Zubrowka, and lemon juice. The resulting cocktail is fresh, fruity, and a delightful blend of sweet and sour. Jesse raises a brow at me, looking bemused, as I sip.</p><p>“That’s the girliest drink I’ve ever seen.”</p><p>“What? It’s not even pink. I’m sure Cosmos are girlier. Even a Tequila Sunrise looks more feminine.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t do tequila.”</p><p>“One tequila, two tequila, three tequila, floor?” I guess.</p><p>He laughs. “More than once, and I finally learned my lesson. The agave plant and I simply do not get along.”</p><p>“Let me guess. For light drinking, you prefer a bottled beer, probably microbrew. And when you’re feeling fancy, it’s expensive Scotch.”</p> <p>“Smart-ass.” Jesse leans in and kisses me. “Mmm. Forbidden fruit, so very sweet.” His drawl kills me dead. Dead, I tell you, especially the way he stretches the word very. He goes on, “But yes. In beer, it’s Flying Dog pale ale. For sipping, I prefer Chivas, if you’re looking to buy me something nice.”</p><p>I grin. “I doubt I can afford it on a Pretzel Pirate’s salary.”</p><p>“Then you’d better find a higher-paying job if you intend to keep me in the style to which I’ve become accustomed.”</p><p>I absolutely love this exchange because the idea of me being Jesse’s sugar momma is hilarious. Besides, he gets a cop’s paycheck, so he’s not used to a lavish lifestyle. I’m giggling quietly as the bartender says: “Twila will see you now.”</p><p>Jesse takes my hand and guides me back, suddenly somber, and I take my cue from him. My first impression of the Queen of Texas is regal beauty. Her presence is powerful, making you want to drop to one knee in obeisance. I can imagine her seducing Mark Anthony or captivating Caesar on a barge drifting slowly down the Nile. She’s tall, stately, with graceful shoulders and dusky skin. Her black hair hangs in beautiful braids, twisted together and caught in a golden snood. This only reveals her strong jaw and sculpted cheekbones. Right now, I realize I’ve been staring too long, but she must be used to startling people with her majesty.</p> <p>Her office is equally impressive, all old-world elegance. I dip at the knee, unable to control the urge. Jesse bends as well, bowing before her.</p><p>And Twila smiles.</p><p>“I wondered how long it would be before you lost lambs came bleating at me.” Her voice is lovely too, mellifluous and rich with just a hint of tropical islands. “Sit, little one.”</p><p>She’s clearly talking to me, so I obey, folding my hands in my lap like I’ve been called out for disciplinary action. I’m so nervous, more than when the old woman was trying to murder me. And what sense does that make? Yet the air feels thick, not with the dead, but...sentience. It’s like no feeling I’ve ever had before.</p><p>Before I can speak, she adds, “Let me save you some time. You want your lost memories...and to know why the demons are involved.”</p><p>Jesse was right; she does know everything. She’s like that song, where Santa Claus sounds like a stalker. He sets a hand on my shoulder, obviously sensing my emotional state. Something about this room is freaking me out. My skin literally creeps, like when I was being watched at the mall, only not quite.</p> <p>“You’re more sensitive than most,” she says softly. Then she whispers a few words, and the atmosphere lightens.</p><p>“What did you do?”</p><p>“Sent the loa away. Most people can’t feel them.”</p><p>Wow. The power she commands awes and terrifies me. “You were right about why we’ve come.”</p><p>“I can help,” she tells me. “But it will cost you.”</p><p>“Without knowing what you’ll charge, I can’t say whether I’m willing to pay.”</p><p>Twila arches a brow, glancing at Jesse. “I like this girl.”</p><p>That’s good, right?</p> <p>“We’re willing to talk terms,” Jesse says. “But not before full disclosure.”</p><p>“Then let me spell it out. In return for my aid, Shannon Cheney will come to work for me. People occasionally leave this life without telling me what I need to know. It would help me immeasurably to have someone who can coerce answers from beyond the grave.”</p><p>“You can’t?” I ask, before realizing that might sound offensive.</p><p>She shakes her head. “My loa can do many things, but they cannot pass to the other side. As I understand, nor can you. Instead, you call the dead back to you.”</p><p>That’s a fair assessment. I’m about to agree to her bargain when Jesse presses on my shoulder. “Can we talk in private for a moment?”</p><p>“Of course. You have five minutes.” She rises smoothly and steps out of the office, then I hear her moving away.</p><p>“You can’t do this, Shan. Your life wouldn’t be your own...Twila will keep you on call twenty-four seven. And she won’t have a reason not to kill people. It’ll become more efficient to dispatch her enemies and question them after death. Can you imagine the toll it’ll take on you?”</p><p>Not to mention the jump in murder rate. I didn’t think of that, but it makes sense. Twila doesn’t run Texas by being gentle and generous with her rivals. I push out a sigh. “Then I have to turn her down.”</p><p>“I think so.”</p><p>When she returns, I decline her offer with as much courtesy as I can muster. Whatever she thinks of this, she only inclines her head. “The offer will remain open until the situation is resolved, one way or another.”</p><p>Fuck, that sounds ominous.</p><p>Once we’re back in the bar, Jesse wraps his arms around me and pulls me close. “Try not to worry. We’ll figure this out. She’s just trying to spook you.”</p><p>“It worked,” I whisper.</p><p>He rubs my back gently. “I know, honey. Let’s go home.”</p><p>Ten</p><p>The return trip is much quieter; I don’t feel like joking around. Though it takes a lot to depress me, I can’t shake the feeling that something major’s about to go down—and maybe I would’ve been better off throwing in with Twila, who can protect me, even if she makes me do bad things. Yet I don’t want to be an accomplice in her dark business, either. This would be the classic rock-versus-hard-place dilemma, and I get to be the squishy thing in the middle.</p><p>“Hey,” Jesse says, as we exit the highway and drive through the dark Laredo streets toward his apartment. “You know I won’t let anything happen to you, right?”</p><p>I feel like saying I understand he’ll do his best to protect me, but there are no guarantees...and I don’t expect him to be my hero. I just want him to be the man in my bed. Hell. I’ll eat a quart of ice cream if he makes me sleep on the couch again.</p><p>“Thanks,” I manage to reply.</p><p>“I know you’re scared. Sad. Confused, too, unless I’m reading you wrong.”</p><p>“No, that covers it.”</p><p>“What can I do to make it better?”</p><p>Despite myself, I grin. “Are you really asking me that?”</p><p>“Shan. I’m being serious. Sex won’t fix your emotional—”</p><p>“Couldn’t hurt. It produces endorphins, you know, and those improve your mood. Doctors have proven that orgasms help with headaches, too.”</p><p>“So I can expect you to say, definitely tonight, baby, I have a headache?”</p><p>“You could stop at definitely tonight and you’d be covered.”</p><p>It’s easier for me to put aside the bad mood when he’s smiling. My breath hitches a little when his dimple puts in an appearance, creasing his lean cheek. He’s wearing cowboy boots, and I’m discomfited at how hot I find him—from the softly worn chambray shirt to the faded Levi’s, down to those battered boots. He’s all Texas sexy, and I’m incapable of resisting him. To look at me, you’d guess I go for thin, sensitive types with dyed black hair, partial to basements and bad poetry, but no. I’ve never had an eye for pretty emo boys in guyliner.</p><p>Jesse parks the car, still amused. He grabs my bag from the back, then comes around to open my door. I follow him up to his apartment, which is even cleaner than the last time I visited. It smells of lemon furniture polish and...air freshener? Yep, there’s a deeper citrus scent circulating.</p><p>“Aw, you got me a Glade PlugIn. You shouldn’t have.”</p><p>“Anything for you.” He quotes back my words, and I wonder if he means them as fully as I did. My heart clenches a little at the possibility.</p><p>“Smooth talker. Is my toothbrush still in the bathroom?”</p><p>He draws in a sharp breath, as if he hadn’t thought of it that way before. “Yeah. It’s in the glass next to mine.”</p><p>“Then I’ll get changed and wash up.”</p><p>There’s no way he can understand how momentous this is. I’m going to take off my makeup before he sleeps with me. I’ll sit and talk with him, barefaced. Naked. My heart is pounding so fast as I take my bag from him and head down the hall to the bathroom. I lean against the door, nervous but also excited. If I want everything from him, I must be willing to give it back.</p><p>Still, I take my time with my nighttime routine, and it’s hard to work up the courage to step into the hall. With all of the kohl, eyeshadow, lipstick, and foundation removed, I look younger. I hope that doesn’t deter him. I don’t think I look like a kid, but he’s not used to seeing me this way, either. He might not want the real me.</p><p>Please, want the real me.</p><p>Since I own no sexy pajamas, these are simple, a white top with huge blue polka dots, worn with matching shorts. I brush my hair one last time before I exit and head back to the living room. Jesse’s already changed into baggy athletic shorts and a plain gray T-shirt. The soft cotton clings to his chest and shoulders to reveal a lean yet muscular build.</p><p>“Come here,” he murmurs.</p><p>God, I hope he doesn’t turn on the TV. But I move toward the couch, head down. Jesse startles me by tugging me onto his lap. Well. That’s a good start. Warm hands cradle my cheeks, forcing me to meet his gaze. He skims my face with dark eyes, silently rapt.</p><p>Then he whispers, “I had no idea you were this beautiful, Shan. No wonder you wear camouflage.”</p><p>Heat rockets through me, starting in my chest and working its way down until I’m squirming on his thighs. There’s no way I can survive wanting him this much. I’ll go nova and explode in a cascade of lights, like the umbrella fireworks on the 4th of July. I tuck my face against his shoulder, trembling with the intensity.</p><p>“Back home, there was a boy... Funny how clear I remember him when so much else is fuzzy. Late at night, we’d sneak off to the woods. He said he loved me.”</p><p>“Sugar, if you think I want to hear this—”</p><p>I ignore him because he needs to. “We had sex, more than once. I liked it, but I didn’t kid myself that it was anything special.”</p><p>“Goddammit.” His voice is a raw ache. “I guess I’m supposed to feel better about fucking you now, knowing I’m not the first? So you’re not untouched, I get it.”</p><p>“That’s not the point at all. I’m trying to say, this is special. You are. And I’ll never want anyone more than I do you.” That said, I open the floodgates and let him feel...everything, how deep and far my yearning runs. It’s an underground river, racing endlessly toward a sunless sea.</p><p>“God help me,” he whispers. “I can’t stop this. Not again.”</p><p>“Do you want to?” I’ll leave if he feels strongly against it. Seducing him through my own desire is fine, but only as long as he won’t hate me afterward. I want more than one night with Jesse Saldana. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not even a little bit.” Abruptly, he shoves to his feet, swinging me up in his arms in the same motion. “You’re coming to my bed tonight, sugar, and if you’re good, I may never let you leave.”</p><p>“What if I’m bad?”</p><p>“Then you’re assuredly not going anywhere.” He growls the reply into my ear.</p><p>In ten strides, we’re in his room. Jesse’s bed is made, a striped comforter tucked in around the pillows. He rips it back with impatient hands, then he turns to me. “I want those pajamas off. Now.”</p> <p>I remember him saying he was gentle and slow, but a hungry wolf shines out of his dark eyes. He’s longed for someone like me, starved even. I don’t need pretty words, flowers, or expensive dinners. I just want to learn the taste and scent of his skin. I want to drown in him.</p><p>Deliberately, I strip. Beneath, I’m wearing only simple black panties, but his gaze sharpens. He takes in the body that I know is decent, if not spectacular. Somehow I manage not to cross my arms to shield my breasts. This is where I’ve wanted to be for so long; I won’t back down now.</p><p>“Your turn, cowboy.”</p><p>I’ve never seen a man shuck his clothes so fast. His shirt goes flying, then he shoves his shorts downward. God, is there anything sexier than a man showing that sweet spot on his pelvis? I love the way his hip curves, slightly concave, with layer of muscle and jut of bone. I could start licking there and work my way to the center. Mmm. His underwear shows...everything. Damn. I’ve never been this turned on in my life...and he hasn’t even kissed me. Desire washes over me—and Jesse’s head falls back. A groan escapes him. A small damp spot appears on the front of his boxer briefs.</p><p>“You could make me come without touching me,” he growls. “But don’t.”</p> <p>“Then come here.”</p><p>In answer, he prowls toward me and shoves me back on the bed. I bounce once, then he’s on top of me. The sudden shock of his heat and weight on me spikes my urgency, and he feels it. I dig my hands into his back as his lips claim mine. It’s a sirocco of a kiss, all heat and irresistible power. He tastes of lime and I, of mint, so our kisses are like mojitos, savored again and again. When he comes up for air, he studies my swollen mouth...and smiles.</p><p>“Here’s how it’s gonna be, Shan. You’re gonna take every stroke, one for every time you teased me, each time I went home hungry.”</p><p>“Please,” I whisper.</p><p>“And I’m going to make you come until you beg me to stop.”</p><p>“Won’t happen.” I manage a hint of bravado. “But you’re welcome to try.”</p> <p>He’s wild with me, just like I knew he could be. There’s no gentleness at the moment, no good manners. Jesse pulls my panties off and then his own briefs. From his night table, he grabs a condom, and though I’d like to put it on him, he tugs my hands away. Tonight, this is definitely his show. I shiver, hard. For good measure, he lifts my arms above my head.</p><p>“Lace your fingers together and don’t let go.”</p><p>“I’m not allowed to touch you?”</p><p>“I told you how it would be...this time.”</p><p>Which tells me he’s open to other things, later, but this must be a fantasy of his, one he’s been afraid to explore with anyone else. So I lock my hands and nod. I think he’ll just take me because we’re both so damn hot, but instead he whispers with his fingertips, gliding, stroking, until I arch up off the bed.</p><p>“You want me so bad.”</p><p>“Fuck, yes.”</p><p>“You’re so pretty and slick. Later, I’ll lick you, right here.” A graze of his fingertips drags a moan from me.</p> <p>“I’ll enjoy that,” I gasp.</p><p>I’m panting, but I don’t beg. Need will surely overwhelm him soon. We’ve been fighting this for weeks.</p><p>“You know how many nights I yanked my cock, thinking of you?”</p><p>“Tell me.”</p><p>Instead, he nuzzles and bites a path down my throat, over my breasts, past my belly and onto my thighs. Yeah, he likes using his teeth. When we’ve been together longer, I can see him wanting to leave marks. God, he’s so close; I can feel the heat of his mouth swirling over my hip. My whole body’s trembling now.</p><p>“It can’t be more often than I did,” I whisper in an attempt to break him.</p><p>And...it works. His control snaps.</p><p>Jesse finally fills me in a long, hard thrust. It’s all I can do not to grab on to him, but the restriction on my movement heightens the heat and tension. I can only work my lower body beneath him, so I wrap my legs around his hips. That makes him growl and push faster. Since he was on the edge earlier, I don’t know how he can keep this up. Then he cheats like a bastard and opens himself to me. His lust hammers through me, along with chaotic impressions of how good this is: so much, more, faster, take, take, claim. My nails bite into my palms as I come.</p><p>And Jesse keeps his promise, somehow. The pleasure loops between us, and I swear he gets off too, but he doesn’t soften. He pushes, grinds, until I’m weak and shivering when he arches into me the last time, his teeth sinking into my shoulder. The pain sparks a soft, weak orgasm, just exhausted flutters. That’s the sign for me to unlace my hands and wrap my arms around him, stroke his back. I’d hold him like this forever, only he rolls away to dispose of the sticky condom.</p><p>But he comes back. I hope he always does.</p><p>Eleven</p><p>Sunday morning with Jesse is a new kind of wonderful. We fix breakfast together and then turn on the sports channel. You wouldn’t guess it, but I enjoy watching men celebrate their penises by knocking each other down and tossing things at each other. So I snuggle up with Jesse happily, wearing a white dress shirt that belongs to him instead of the pajamas he made me take off the night before.</p><p>Later, I’m in the bathroom brushing my teeth when he comes in. He steps up behind me, wraps his arms about my waist and nuzzles my neck. I spit, drop my toothbrush in the sink, and turn into his embrace. Jesse lifts me up and carries me back to bed. We stay there for most of the day, and I only get up because it’s getting late, and I need to shower so he can take me home.</p><p>“No regrets?” I ask him, as I’m climbing into his SUV.</p><p>“Only that you’re leaving.”</p><p>“Good answer.”</p><p>“I warned you how this would go, though, Shan. You’re mine now, and I’m very opposed to sharing.”</p><p>“You think I’ll run into men who tempt me at Pretzel Pirate?”</p><p>He laughs. “When you put it that way...”</p><p>“Then I’m not sure what I’m supposed to take from this. I’ve been trying to hook up with you for weeks. Now that I have, you figure I’m done, mission accomplished?” I shake my head. “No thanks. I’d much rather be your girlfriend.”</p><p>“Yeah?” Jesse starts the SUV, looking pleased.</p><p>And frankly, after the last twenty hours, he should be. I know I am. “Definitely. Or were you trying to talk me out of a relationship?”</p><p>He leans over and kisses me. “No. You’re in this now. I tried to be smart and sensible and let you move on to somebody else. Hell if that’s happening now.”</p><p>“I don’t want anybody else.” A surge of love rolls through me.</p><p>“Keep talking like that, looking at me with those eyes, and I’m carrying you right back up those stairs, Shan.”</p><p>“I have to get back. My work uniforms are at home.”</p><p>Jesse bitches under his breath, giving me the first glimpse of how possessive he can be. But it’s not like it comes as a surprise. He puts the vehicle in gear and takes me back to my apartment. I think he’d like to come up, but that will just make it harder to say good-bye later, and I haven’t talked to Maria about having overnight guests. If her boyfriend has ever stayed, I didn’t see or hear him. So I feel like it’s polite to check with her first. Plus, my futon isn’t as big or comfortable as his bed.</p><p>He parks on the street and shifts to study me. “Work’s likely to keep me tied up this week. There are some things going on in the department. But if you have any problems, text me.”</p><p>“I can’t text you anyway?”</p><p>“You know what I mean.”</p><p>Yeah, I do. I’m teasing him. “If anything weird or scary happens, you’ll be the first to know.”</p><p>This is a little awkward because I don’t know where to go from here. I can’t seem to make myself get out of the SUV. Jesse kisses me again; this one is deep and lingering, his hands in my hair.</p><p>“I’ll pick you up Friday night at eight, sugar, unless there’s an emergency.”</p><p>“How should I dress?”</p><p>“Wear something sexy, suitable for dancing.”</p><p>“I have the perfect outfit.”</p><p>After that, I hop out and head upstairs. There’s no reason to feel so sad, like the minute we separate, he’ll have second thoughts and I’ll never see him again. He’s not changeable like that. In fact, I’ve barely gotten inside my front door when I get a text message from him.</p><p>I miss you already. Think about me this week, k? I’ll know if you are.</p><p>Okay, that’s kinda hot. I’m smiling when Maria wanders out of her bedroom. She takes one look at me and grins. “Good weekend, huh?”</p><p>I don’t know what she means until I peek at my reflection in the bathroom mirror. There are faint bruises on my throat, whisker burns on my cheeks and jaw. I’m not wearing my usual makeup to cover it either. Damn. I can’t believe I left the house without putting my war paint on. I can remember a time when I’d have died before doing that. Like, the house could be on fire, and I’d still apply cosmetics.</p><p>“You could say that,” I answer belatedly.</p><p>After checking to make sure I have a clean uniform for tomorrow, I crash with Maria and we have our Chris Evans marathon. During intermission, I ask, “So I’m wondering about your policy on overnight guests?”</p><p>“Not a rhetorical question, I take it. You finally bagged the hot cop?”</p><p>“You make him sound like a deer I shot.” I grin at her. “But yeah.”</p><p>“Then as long as he sleeps in your room and you’re not too loud, I’m fine with it. I’d appreciate it if you don’t send him out naked to rummage for food.”</p><p>“I suspect we’ll be at his place more often, but I thought I’d ask.”</p><p>She nods. “I appreciate the consideration. I’ve had so many roommates who did what the hell ever. And the last one left without any notice.”</p><p>“That had to suck.”</p><p>“Tell me about it. But I’m glad Chuch introduced us. I like you.”</p><p>It’s nice to have female friends. “Back at you.”</p><p>That night, I go to bed early and wake up in time to do some mundane chores. Our apartment doesn’t sparkle like Jesse’s, but it’s not a sty either. I already have a message from him on my phone. He warned me he would crowd me, but it’s not a needy, where are you, type text. Instead he’s written, my bed was fucking empty without you. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Way to curl my toes before noon, Saldana.</p><p>I type back, you’ll be good and hungry by Friday night.</p><p>He must’ve gotten busy at work because he doesn’t reply until after I’m at the mall. If I last that long.</p><p>I’m smiling up until the point where I reach Pretzel Pirate...and find Mark already behind the stand. He’s frowning at me. “You’re two minutes late.”</p> <p>Vacation has not improved his temper. I want to protest that I’ll still have plenty of time to open because it’s not like it takes a full hour to turn on the machines, get the pretzels going, and put cash in the register. But men like Mark are petty dictators; that would only piss him off more. So I mumble an apology. And the day only gets worse from there.</p><p>Mark picks on me all damn day, bitching about every little thing. I’m starting to understand why he can’t keep employees. My annoyance builds to the point that Jesse actually texts me around four to ask, you all right?</p><p>Fine. Just pissed. My boss is an asshole.</p><p>Somehow I finish my shift, but the next day is more of the same. By two, I’ve had enough. “This is bullshit,” I say, interrupting his lecture. “I did a great job while you were gone. I deposited all the money, balanced the cash drawer, handled all of the setup and break down. And now I’m done.”</p><p>“You can’t just walk off the job!”</p> <p>“Watch me, fuckhead. I’ll drop off these stupid uniforms tomorrow.”</p><p>Earlier, I saw a Help Wanted sign in a clothing store that sells really cool merchandise: funky graphic tees, studded wristlets and belts, earrings, skinny jeans, that kind of thing. The workers are all around my age; most have dyed hair or piercings and tattoos, also. If I could get a job there, it would be leaps and bounds better than Pretzel Pirate. I mean, it would still be customer service, but maybe I could earn back a fraction of my lost dignity. I’m not applying dressed like this, though. Presentation matters in a shop like that, so I’ll put in an application tomorrow when I return these stupid polyester pirate suits.</p><p>Grumpy, I take the bus home. Maria’s not off work yet, so I throw myself down on the couch and watch Netflix. Around six, I fix myself some food and go back to watching feel-good movies. Half an hour later, somebody knocks at the door. Cautiously, I peer out the peephole and spot Jesse. It’s only Tuesday, and he told me he’d probably be busy until Friday. He holds up a carton of ice cream.</p><p>“You had a bad day,” he says. “So I brought the chocolate.”</p><p>“Best boyfriend ever.”</p><p>“Can I come in?”</p> <p>“Sure.” I step back to let him into the apartment.</p><p>He smirks when he notices I’m watching Iron Man. “Most girls would be watching chick flicks.”</p><p>“Did you just lump me in with all the other estrogen bearers? For your sake, I hope that you did not.”</p><p>“No offense intended. Tell me what happened?” He pulls me into his arms, after I get a spoon.</p><p>And between bites of ice cream, I lay out my day. “So now I’m unemployed.”</p><p>“Not for long, I’m sure. If you need cash—”</p><p>“Stop right there. Taking money from the guy I’m sleeping with is beyond skeevy, and it will never, ever happen.”</p><p>“I see your point.” Before he can say more, his cell rings. Jesse pushes to his feet, listens, and then sighs. “Yeah. I hear you. I’ll be there in twenty minutes.”</p> <p>“Work?” I guess.</p><p>“Yeah, sorry. I thought things had settled, but it seems not.”</p><p>“Everything all right?”</p><p>He hesitates, then shakes his head. “If I could say more, I would.”</p><p>I remember he mentioned there was some kind of scandal with the partner he had before Stella, and he’s still dealing with the fallout. “I get it. Thanks for stopping by to cheer me up. And thanks for the ice cream.”</p><p>He draws me up into his arms and kisses me until I’m actually dizzy. “I hate it when you’re sad. See you Friday.”</p><p>When Maria gets home an hour later, I’ve eaten most of the chocolate ice cream. I regret nothing. I don’t mention that I’m now sans income; she might fret. We watch a little TV, then I head to my room to pick out an outfit for the job I intend to snag tomorrow. The store is a better fit for me, similar to Hot Topic but cooler.</p><p>At eleven, Jesse rings my cell. I expected he might text. A voice call seems special, fancier somehow, mostly because people don’t bother anymore. I’m snuggled into bed, wearing the jammies I took to his place. Smiling, I tuck the phone against my ear.</p><p>“Feeling better?” he asks.</p><p>“You know the answer.”</p><p>“But it’s polite to ask.”</p><p>“Did you take care of things at work?”</p><p>“More or less. I put a patch on the situation anyway.” His voice drops low. “Wish you were here, Shan. How’s it possible that I already have a hard time sleeping alone?”</p><p>That fast, I’m turned on. He only needs to drawl the word hard and I’m like, yes, green light, let’s go. The chemistry between us has always been incendiary; he just didn’t want to admit it. I suspect he gets that flash of heat, but my breathing quickens, too. I can’t hide anything from him.</p><p>“Oh, honey. Really?” It’s like he can’t believe that’s all it takes.</p><p>“I think I’d better get off the phone now.”</p><p>“No,” he murmurs. “Stay.”</p><p>It’s pretty clear what he’s asking, and I don’t really know how to do this, but I’m willing to try. In the end, it’s mostly sounds and sighs while we both work, slow at first, then faster, until I hear him moaning my name, and then I’m gone, too. Gradually my heart rate slows.</p><p>“Wow,” I whisper. “I think I’ll keep you.”</p><p>“Please do.” And I hear his need, his uncertainty. This is his gift to me.</p><p>I’ll cherish it always.</p><p>Twelve</p><p>The next day, I wake up feeling off since strange dreams chased me all night long. Shaking that lethargy, I don my coolest outfit: striped stockings, combat boots, faux-leather mini, black lace peekaboo blouse with a corset vest over the top. I study myself in the mirror, then add chunky, funky jewelry. I take my time with my makeup. Fortunately, Maria goes to work earlier, or she’d wonder why I’m not a pirate today. Last thing, I bag up those fucking uniforms.</p><p>I take the bus and get to the mall by ten. Mark isn’t even at the stand yet. Excellent. I don’t want to see that asshole. I drop my stuff off behind the counter and hurry through the food court. Unfortunately, I run into Felix on the way. He seems really happy to see me.</p><p>“Hey, Shan, how’s it going? Damn. You’re looking hot today.”</p><p>“Thanks.” I feel like saying, dude, I have a boyfriend. But even if I didn’t, this is not on. It will never be on.</p><p>Yet that would be like kicking a puppy. So I listen to his chatter with a faint air of impatience. “Look, it’s good to see you, but I have a job interview.”</p><p>“Oh.” He seems sad to hear that I’m leaving our food stall hell. “I won’t keep you, then.”</p><p>His downcast look goads me into adding, “But I’ll stop by on my way out, okay? We can talk more then.”</p><p>“Sounds great. I’ll spot you a free Coke.”</p><p>Be still my heart.</p><p>“Thanks,” I say aloud.</p><p>Steeling my nerves, I stride toward Toxic, the store where I want to work. The sign’s still posted, so they haven’t filled the position yet. Go big or go home, right? So I pull the Help Wanted notice from the window and take it inside with me.</p><p>I set it on the counter. The guy behind the register is hot, but not my type. He’s the skinny, emo, guyliner sort, one who fits with me in theory. I guarantee he’s nowhere near Jesse Saldana’s level, however. This dude is the reason girls eat chocolate ice cream; he sure as shit doesn’t bring it to them.</p><p>“Hire me,” I say.</p><p>He skims me up and down, seeming to decide I’ve got the right look. “You have to fill out an application first.”</p><p>“Give it to me, then.” I have to be careful not to let the attitude cross the line into bitch territory. I think I’m standing right on the border.</p><p>He does, and I get out my pen. Hm. Chuch and Eva as personal references. I add Jesse too, though it’s probably immoral to use your boyfriend in that respect. The rest of the app doesn’t take long since I’ve had exactly one job and I quit it yesterday. Once I’m done, the guy skims my information.</p><p>“Pretzel Pirate, huh? I can see why you’d rather work here.”</p><p>“Just so you know, Mark probably won’t have good things to say about me. But I’m a hard worker for anyone who’s not a complete asshole.” Hard to say if that’s too much honesty.</p><p>Then the guy smiles. “Understood. I’m Nick, the assistant manager, so you’ll need to meet Kim, too. She’s in the back.”</p><p>I end up having an impromptu interview with both of them, so it turns out I didn’t lie to Felix after all. When I leave Toxic, I have a fucking job. I start tomorrow. Thirty hours a week to begin with, but the pay’s a little better. I can still afford to cover my bills, at least, and I get to wear my own clothes. That was one thing Kim stressed; we need to look the part, making people want to be cool like us.</p><p>Keeping my promise, I head back to the food court. It’s close to noon, so a few people are scattered at the tables, eating an early lunch. Felix waves at me as I amble toward him. His stand has no line, so he pours me a drink, then hands it over without his coworker noticing. It’s sweet, but I hope he doesn’t get in trouble.</p><p>“I was wondering...”</p><p>Shit, here we go. I have to shut him down politely. “Yeah?”</p><p>“I have a break coming up...and there’s a car for sale in the parking lot. I was wondering if you’d look at it with me.”</p><p>Huh. That isn’t what I thought he’d ask at all. “Do I look like a vehicular expert to you?”</p><p>“No, that’s not why I want your opinion. I thought you could tell me if it’s something girls would think is—”</p><p>“Oh. You want me to gauge its chick appeal?” Poor kid. He’s so clueless.</p><p>Felix nods. “If you have time?”</p><p>“Absolutely. You can walk with me out to the bus stop. I’ll rate it for you.”</p><p>“Thanks. I don’t have a lot of friends who are girls.”</p><p>It’s been a good day. Not only did I get an awesome new job, I also avoided crushing Felix’s dreams. Maybe he’s not interested in me after all. I’m happy to be his friend, as long as he’s not secretly angling for more. That never ends well.</p><p>“Come on.” I beckon.</p><p>Once he calls that he’s taking a break, Felix comes around the counter and walks with me to the exit. “I think the car’s pretty sweet, but my sister tells me I have no idea what’s cool.”</p><p>“All sisters say that.” Or so I imagine, anyway. I have no siblings, unless my father is breeding as we speak. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It’s this way,” he says, leading me through the parking lot.</p><p>I imagine he spotted a car with a sign in the window; the owner must work at the mall. Then he wheels and punches me square in the face. I go down because it’s so unexpected. The pain doesn’t incapacitate me, but I can’t process what’s happening. I scramble backward beneath a car and roll out the other side.</p><p>“What the hell!”</p><p>Is he a psycho, or is this something else? I get a glimpse of his face between the cars as I run, and it’s...odd, wavering. His skin shivers like his face doesn’t fit right, and his eyes are swimming in darkness. Goddamn them. This isn’t Felix. There’s a demon in him, one that whispered about the car but didn’t drive him out here. The thing knew I’d notice. So this is the perfect ambush. I’ve dropped my bag, and I scramble for my radio. I don’t want to hurt Felix like I did the old woman. This isn’t his fault; he was a target of opportunity.</p> <p>He lashes out. The kick connects to my shoulder, and my backpack bounces away. I need to learn how to fight; the dead won’t always be able to defend me. My arm’s numb now, too. Feels like he dislocated my shoulder. I crawl away, beneath a car, and then I scream. With my good hand, I dig out my phone and speed dial Jesse. I wish I had some mace, pepper spray, anything.</p><p>The call goes to voice mail as the demon grabs my ankle and hauls me out from under the car. My phone bounces away. I keep yelling and aim a kick at his junk, but he’s too fast for me, even in a teenager’s body. But my shouts have drawn attention; there’s a woman getting out of her car, and when she sees what he’s doing, she runs toward us, scrabbling at her purse. My vision goes blurry when he punches me in the head, trying to shut me up, but from the sound, I think she tases him. His body jerks, but it’s not enough to drop him with the demon driving, so she hits the button again.</p><p>That time, he drops, twitching, and she helps me up. She’s shaking, and I’m one big mass of bruises, but alive. She just keeps saying, “Oh my God, oh my God,” and that pretty much sums up my reaction, too.</p><p>A minute or so later, mall security arrives. The guy rolls Felix over, but he’s stopped moving. The darkness swims in his eyes slower and slower, but nobody else seems to notice. Dread swells inside me, heavy as lead. He’s just a kid, a dumb, sweet kid, who wanted to be an eye doctor. Fucking demons. And the worst part is, they even warned me. The other one said I wouldn’t see them coming until it was too late. And while I survived, he was still right.</p><p>The guard takes the boy’s pulse, then gazes somberly up at us. “Which one of you did this?”</p> <p>Nervous, the woman hands over her taser. “He was attacking her!”</p><p>“I can see that, ma’am. But it looks like the shock stopped his heart.” He radios in, then starts CPR, but it’s no use.</p><p>By the time the EMTs arrive, there’s nothing left to do but call time of death. Jesse gets there ten minutes later, a perk of being a cop. Though I didn’t leave much of a message, he got the gist from the police scanner. I’m sitting on the curb wrapped in a blanket when he rolls up. He takes one look at me and rage goes off in his head like a bomb. I don’t know if other people can feel it, but for me, it’s a constant wash of red, lapping over me like lava.</p><p>Yet he’s gentle when he pulls me into his arms. A few seconds ago, the EMTs popped my shoulder back into place, and they’re trying to talk me into a trip to the ER, but I knew Jesse was on his way. I knew it. And the police still have questions. I’ve done my best to answer them, but there are a lot of gaps in my story. They sense it, even if they aren’t sure what they are. When they look at Felix’s life, they won’t find any sign that he was obsessed or stalking me. They’ll see a normal kid, trying to figure out his life. The pieces don’t add up, and only Jesse and me know why.</p><p>“It’s okay,” he whispers into my hair. “It’s over.”</p><p>Maybe he can tell, somehow, that the demon didn’t get out of the host before Felix died. I can’t ask what that means for a demon. It makes me happy to imagine the thing trapped in his corpse, unable to muster enough power to move, now that the life force has gone. That’s the most fitting prison imaginable, except that it cost this boy his life. The only reason he’s dead is because the demons saw me talking to him. I feel horrible about it.</p> <p>Once we deal with the preliminary questions, Jesse takes me to the same clinic. At this rate, they’ll think I’m a battered wife. After a few X-rays, the doctor determines I don’t have a concussion and I just need some rest and pain medicine. Afterward, Jesse drives me to his place; I don’t protest. I’m not up to facing Maria or explaining what the hell happened, especially since I’m not sure myself.</p><p>Inside his apartment, Jesse draws me gently into his arms. The thump of his heart is reassuring beneath my cheek. “I was so fucking scared, Shan. I know we’re brand new, I know it’s too soon, but I have to say it. I am crazy in love with you. Please don’t ever make me feel that way again.”</p><p>“I love you, too,” I whisper.</p><p>After that, he whispers not to worry—I’m safe. But I don’t know if I’ll ever feel safe. I can’t trust my eyes or my judgment. Since one demon failed, who’s to say they won’t send more? I can’t live in a bubble, though. I have work tomorrow, and I’ll be damned if I let them turn me into a cowering ball of fear.</p><p>“I want to learn how to defend myself,” I say then.</p><p>“I’ll find a class for you.”</p><p>“If that woman hadn’t been carrying a taser, I’d be dead. Or gone.”</p><p>He swallows hard. “I didn’t do enough. I should’ve put a protective detail on you after what happened at the shop. I knew it wasn’t random violence, but I thought I could keep you safe on my own. But I’m not with you all the time.”</p> <p>“Bullshit. The PD has budgetary considerations. And based on the evidence, they wouldn’t have judged my danger to be acute.”</p><p>He sighs. “Goddammit. You’re probably right.”</p><p>“Sometimes there’s just nothing you can do, too many factors in play.” If I worked for Twila, this wouldn’t have happened. Felix would be alive, but others would be dead. I can guess and second-guess, but bottom line, this is where I am.</p><p>“I feel like I need to tell you something.” Jesse pulls back, serious as I’ve ever seen him.</p><p>“What?”</p><p>“I dreamed of her last night.”</p><p>“Who?”</p><p>“The redheaded woman.”</p><p>I freeze, unsure of what to ask. “What...?”</p><p>“We were in Kilmer...and you were there, too. And we were in this old, creepy house, and you had a bicycle—”</p><p>“Oh my God. And there was writing on the walls, letters scratched into the windowsill in the attic. The red-haired woman ran into the woods, and I woke up.” I’m able to finish his description, because last night, I had the same fucking dream.</p><p>“What does this mean?” he asks.</p><p>“Hell if I know. But I think she must be a real person.”</p><p>“Someone we’ve forgotten because of the spell?”</p><p>I shrug, my head aching too bad to think on this any further. I’m hurt. I’m scared. But I’m still here. I’ll get stronger and I’ll learn to fight. Whatever’s going on, Jesse and I will figure it out together.</p><p>“I don’t have the answers,” I whisper.</p><p>“Well, you’ve got me. If it helps any, I checked on the woman from the store. She’s non compos mentis but she’s alive. And I saw on Area 51 that her shop will reopen in a few weeks. Some relative’s taking over.”</p><p>“It does make me feel a little better, actually.” I don’t tell him that if I could, I’d swap the shopkeeper’s life for Felix’s. She was old whereas he’d only just begun.</p><p>He murmurs in my ear, “You need to rest, so we can go dancing on Friday.”</p><p>Maybe I won’t be up to it, but I’ll try. And we’ll probably fight over whether I’m strong enough to start my new job tomorrow. I’m not scared of arguing with Jesse, only being without him. So I’ll muster my strength for battles to come. When he sweeps me into his arms and carries me to the bedroom, the future strikes me like an Impressionist painting, all my tomorrows blurring in a haze of pink and gold, because for me, that’s heaven—Jesse Saldana’s arms.</p><p>And even with dark clouds rolling in, a storm on the horizon, there’s no place in the world I’d rather be. </p> </body></html>"]