["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Part I</p><p>Life</p><p>“Surrender, y’ scurvy bastard!” Bartholomew Miller cried harshly.</p><p>There was no hope for the wounded Hellion, a ship captained by Pie-Eyed Wallace, one of the pirates who had been plaguing ships bound for Key West, Florida. Bartholomew, captain of the eight-gun sloop Bessie Blue, was working per request of Craig Beckett, one of the most respected civilians in Key West who had cast his lot with David Porter, commander of the Mosquito Squadron, a naval assignment group sworn to rid the south Florida waters of the dreaded scourge of piracy.</p> <p>Bartholomew knew the waters, the depths and shallows and reefs, as few men did. He had chased the Hellion to a reef, and there pounded her with his guns. The Hellion was sinking. Half her crew floated dead in the water, and others moaned on a deck that was flooding with the sea.</p><p>Just as he knew the reefs, Bartholomew knew sea battles, and he knew pirates. He had never been a pirate, he had been a privateer. He had taken ships by license of the Crown, until he had become a citizen of the United States. Then, he had fought the Crown of England, as he would fight anyone now who brought death, danger and mayhem to his new country.</p><p>“No surrender!” Pie-Eyed Wallace called, looking him in the eye across the expanse of water that separated them. Bartholomew had carefully maintained his shallow-drafted sloop in the deeper waters off the reef. His men would prepare the longboats to collect survivors—those who wished to be taken to town for trial—when the inevitable happened and the Hellion went down to her watery grave.</p><p>“There’s a chance for life!” Bartholomew shouted. “What of your men?”</p><p>“Me men will swing from the hanging tree ’neath the merciless order of the tyrant Porter. Trial! ’Tis a travesty—there is no hope for justice. We will die at sea! Ye’ll grant me that!” Wallace cried.</p> <p>“Nay, Cap’n, there’s hope!” one of his men shouted from the deck. “We could find mercy!”</p><p>Wallace turned to eye the wounded man on deck. He pulled one of several pistols from the long holster across his chest—and shot him.</p><p>“There, there is the only mercy to be found!” Wallace said.</p><p>Wallace was right; David Porter was merciless when it came to pirates—despite all the good he had done, it was true that the man was a tyrant, keeping Key West under stringent military rule.</p><p>Those who were esteemed in Key West lived well and nicely. And in certain fine homes, hastily furnished by trade or through salvage, one could pretend to be in one of the finest drawing rooms in Richmond, New York or even New Orleans.</p><p>Those who broke the law discovered that Porter’s justice was harsh.</p> <p>Wallace stared at Bartholomew. “Will you have mercy, sir?” he asked as he drew out another gun that was long enough to cover the many yards of distance between them. He took aim at Bartholomew.</p><p>No choice. Bartholomew quickly drew his own rifle, Bess, and fired in return. The sound of the bullets from both of their guns was explosive; the air filled with black powder again where it had just begun to settle.</p><p>Wallace’s bullet crashed into the mast; Bartholomew’s aim was true, and the pirate Pie-Eyed Wallace dropped dead where he stood.</p><p>Mercy.</p><p>A pirate’s mercy. A quick bullet, rather than the slow death of the hangman’s noose and a slow strangulation with the body flailing, kicking and writhing—and finally, failing.</p><p>Bartholomew turned away and spoke to his first mate, Jim Torn. “We must collect the survivors and bring them to the law.”</p><p>He was weary as he gave the order and returned to his cabin, anxious to return to port.</p><p>He had seen many a hanging, and he had to wonder if they should leave the men to drown. But he had discovered that he admired Craig Beckett, the man who had befriended him in New Orleans and who had encouraged him to bring his ship to Key West. The Island was raw and young, but it was a place where a young man, once a Brit, once a privateer, once a rover of the world, might find a future. He would still find his fortune at sea, but as a merchant. He would be able to build himself a fine house soon enough and lead the life of a gentleman.</p> <p>He had but one dream. And a fine house would be part of that dream.</p><p>They returned to port where Jim Torn and his men saw to the three half-dead prisoners they had taken from the sea. One, Scurvy Pete, had a horror of drowning; he would take the noose. Two others had simply not managed to die.</p><p>Mariah’s Bar, a popular place for seamen, stood near the deep water docks, and Bartholomew headed in for a pint. He was especially weary though, and after the pint, he left, intending to seek a long night’s rest in his rental rooms. But, as he left the bar, he saw her.</p><p>His dream.</p><p>He saw that she had come to the docks to collect a purchase, and it appeared that the purchase was heavy or awkward as she seemed to have some trouble gathering the long package.</p><p>“Mistress, I implore you, do allow me to help you with that!” Bartholomew said, hurrying to her where she stood by the merchant’s carts.</p><p>Victoria Wyeth looked up at him with blue eyes—no, violet eyes, like huge pools of wonder. They were set in a face of absolute and stunning perfection, perfectly sculpted cheekbones, a fine chin, small nose and a high forehead. Her hair was like the proverbial raven’s wing, sleek and coifed. A large straw hat shadowed her features to save her porcelain skin from the merciless heat of the sun; her day gown was sewn from the most delicately fashioned cotton, cool despite its cumbersome skirts and form-hugging bodice.</p><p>In the midst of the rough town that was Key West, she was a breath of freshness, cool air and society, all that was right and structured and noble in the world. When she moved, it was with grace, and when she spoke it was a fluid melody.</p><p>They had met briefly upon many an occasion, though he had not been invited into her home—nor was such an event likely to come about.</p><p>Not until he had proven himself a good and responsible citizen, worthy of such a prize. Not until he had managed a real income at trade, and had built a fine house. Not until he had earned the respect of her father, who wanted far more for her than an ex-privateer, a man without family—or prospects of any great inheritance.</p><p>“Captain Miller!” she said. And the melody of her voice touched him as the seductive hand of many another had never done. In his time he had known many a tavern wench, and many a whore. He’d slept with fine ladies as well—divorced or widowed and, because the poor woman had been so mistreated by her husband that it had seemed a mercy to show her tender love, one who was married. He had felt desire, and he had known amusement and laughter, but in his life he had not known this feeling, this deep ache inside, to have and to hold and protect against all odds.</p><p>She smiled, and he, who had survived many a sea battle, fought the Spanish and the British on land and sea, felt as if all strength deserted him, as if knees became the very substance of salt water.</p><p>He helped her with the parcel she had acquired from the ship that had just docked, the Langley, out of Norfolk, Virginia. The well-wrapped package read “Timmons of London,” and he knew that it must contain some of the finest crafted fabric to be had. She never appeared to be overly interested in clothing or decoration; she just had the ability to make simple elegant. Despite her high role in the social strata of a country where “every man was born equal,” she was kind and gentle, never affected. He had seen her handing out coins to the little children of Caribbean fishermen, and tossing a ball to them in play.</p><p>“My deepest thanks,” she said, flushing.</p><p>He gathered the parcel. Her fine house was down on Duval Street—named after the territorial governor—almost a mile from his own lodgings, closer to the water. He found that he was suddenly wide awake, that he could walk on air.</p><p>“Sir, I saw men arrested,” she said. “Were you responsible?”</p><p>“Pie-Eyed Wallace’s ship was racing south, and we came upon him,” Bartholomew explained. “Craig Beckett, though a civilian, helps attend to matters for David Porter, and he ordered that Pie-Eyed Wallace be taken if seen, and I follow his lead in all things.”</p><p>“You’re very brave,” she told him.</p><p>He shrugged, aware that a blush was forming on his cheeks. Brave? No, just hardened, and aware from his penniless youth on the streets of Liverpool that he must find his own place in the world. He’d been a hungry child, not just for food, but for knowledge, and he had used every opportunity to learn, being like a sponge around well-educated men. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not so brave, Mistress Wyeth. I’m just a man doing as he must. Captain Beckett is someone I admire greatly, and he is my friend, helping me to gain a solid foothold that I might become a man of means about this town.”</p><p>“And that’s important to you?”</p><p>He looked at her, and the words slipped from his mouth. “You are important to me, Miss Wyeth.”</p> <p>She sucked in her breath, staring at him.</p><p>“I beg your pardon. I most heartily beg your pardon!” he said hastily.</p><p>“But you have not offended me,” she told him. “You need beg no pardon.”</p><p>He was horrified to find himself speechless.</p><p>He was customarily the one who teased and flirted. He had confidence and ease, and he loved to make the young girls giggle and speculate.</p> <p>Bartholomew Miller cut a fine figure. His shoes were buckled and bore heels, his hose didn’t display a single knot, and his breeches were impeccable. He wore a ruffled shirt, red vest and black jacket. His hair was jet-black and neatly queued beneath his tricornered hat. His eyes were light and bright and bore a sparkle of mischief that women usually found to be as captivating as his grin and his dimples. Women had always liked him, and he was grateful that he’d always managed to keep the friendship of his fellows, as well. He enjoyed life, and was fascinated by events and people.</p><p>He’d been lucky in living a life that had brought him around the globe, and he was grateful for the hard training he’d received at the hands of the British Navy. It had prepared him to captain a ship, and though he had been born and bred in Liverpool—admittedly in an area that was the cesspool of the city, he’d discovered a passion for a wild new country in the western hemisphere—the United States of America.</p><p>But this feeling was new to him. This pining, this sense of wonder just to be near a woman.</p><p>“Oh,” he managed at last.</p><p>She laughed softly, and again, just the sound of it was like music.</p><p>“My good fellow, this is America!” she said.</p> <p>“Meaning every man might have his chance?” Bartholomew asked.</p><p>“Of course,” she said.</p><p>“I don’t think your father would agree,” he said.</p><p>“I’m not a child,” she told him, a flash of indignity in her eyes.</p><p>He was touched and amazed that she had so noticed him, that she might be attracted to him, as well.</p><p>But he had been around the world.</p><p>And he knew many a man like her father.</p><p>“Let me walk you home with this parcel,” he said.</p> <p>They walked, and she asked him questions about sailing, about the exotic ports he had known, and the men with whom he had fought. When they reached the house—a huge clapboard with a grand porch and beautiful veranda—she laughed and insisted that he come in. He was uneasy, but her enthusiasm was such that he agreed, and he carried in the parcel, depositing it in the foyer where she directed, and then following her into the parlor. She rang a little bell, a maid came, and she ordered tea service.</p><p>The maid brought their repast, and they sat together on the sofa, still talking. She and her father had come down from New York City, where her father had been a successful banker, allowing him the freedom to come south to fulfill his dream of creating a vast shipping empire. Bartholomew was familiar with New York, but not as she knew it, and she talked about life south and north of Wall Street, and the sadness in the Five Points area, where immigrants fought and starved, and gangs often ruled the street.</p><p>Their fingers touched, their voices were quick and hurried, and they were close, so close he knew that he wanted her more than ever, and he said, in the midst of a sentence about London, “I will do anything. I have loved you so from afar, I can no longer imagine life without you. I cannot believe that you would even consider a man so humble in station as I.”</p><p>She held his hand between her own. “I believe in the dream of our country,” she said. She smiled. “I have met many of my father’s business friends and acquaintances, and most are snobbish fops. But you, Bartholomew, are not taken with your own grandeur, you don’t talk of choice and honor, you have lived in search of it. You are the man with whom I can find what I seek in life—dreams of our own creation, a world in which we make our lives what we wish them to be and are heedless of a friend’s position or his money.”</p><p>She smiled, and turned away, and pointed to a small framed likeness on the mantel. “My mother,” she said. The woman in the painting was lovely, and her daughter was in her image. “I lost her five years ago. She believed in dreams. She believed that an Irish washerwoman could earn her way and make a life. She did so. She had her own business, tailoring with several seamstresses, when she met my father. She was strong and wonderful. I loved her so much.”</p><p>“I’m sorry she is gone,” Bartholomew said. He didn’t remember his own mother. He had never known his father. His surname had come from the man in Liverpool who had taken him in, and taught him the sea, out of kindness. He had died the first year that Bartholomew had been with the British Navy.</p><p>Before either could say more, the front door opened and closed. Victor Wyeth, Victoria’s father, had come home.</p><p>“Victoria!” he called.</p><p>“In here, Father! Captain Miller and I are having tea,” Victoria returned.</p><p>Victor Wyeth, a large, robust man, strode into the room. His gaze instantly fell upon Bartholomew. That gaze created a chill that raced along his spine.</p><p>But Wyeth was polite. “Why, Captain, what a surprise,” he said, shaking hands as Bartholomew stood to greet him.</p><p>“I was struggling with a large parcel and Captain Miller came to my rescue,” Victoria said.</p><p>“That was most kind,” Wyeth said. “Whatever charge you might like to make upon me will be most gratefully paid.”</p><p>“Sir, it was a pleasure to help,” Bartholomew said.</p><p>“Father! He does not wish to be paid. He is a friend, and friends help friends,” she said.</p><p>“Of course,” Wyeth said. He looked at his watch. “But tea time is over, and I have pressing business with which I will need your assistance, Victoria.”</p><p>“Father, honestly—” Victoria began.</p><p>Bartholomew did not take his seat again. “I must be going,” he told Victoria. He smiled, telling her he understood.</p><p>And in his eyes, and in his touch as he delicately kissed her fingers in farewell, he was certain that she knew he would wait for her, a lifetime, if need be.</p><p>“I shall see you out,” Wyeth told him.</p><p>“Thank you, sir,” Bartholomew said.</p><p>The pretense ended when Victor Wyeth led Bartholomew outside. “Sir, you will not come near my daughter again, do you understand? She is a lady, and far above the reach of a pirate such as yourself.”</p><p>“I am not a pirate, Mr. Wyeth,” Bartholomew said.</p><p>Wyeth waved a hand in the air. “I know your past. You will stay away from my daughter.”</p><p>Bartholomew meant to do all the right things, but he couldn’t accept such a statement. “What if your daughter is not of the same mind?” he demanded.</p><p>“My daughter will do as I say. And I am best of friends with Commodore Porter—I can see to it that you regret any trouble you cause me,” Wyeth said.</p><p>Bartholomew stared at him. “I don’t bow down to threats, Mr. Wyeth. If Victoria tells me to stay away, then that is what I will do. Good day, sir.”</p><p>He turned and left before they could get into a screaming match, or, God forbid, a brawl. He walked down the street with his head high, his stride long and strong.</p><p>Bartholomew had expected Wyeth’s reaction; he had not known that he would shake so badly once he was away from him, or how bitter the rejection would feel when it was voiced out loud. He was glad, however, that he had not backed down, and he was equally glad that he had not allowed himself to be drawn into an altercation.</p><p>He returned to his rooms. He was exhausted. There was a bottle of rum by his bedside, and he drank deeply from it, staring at the ceiling. He reminded himself that the day had been filled with enchantment—no matter what Victor Wyeth said, Victoria had spoken her mind. Love, he determined, would have its way. He wasn’t a fool; he knew the world, and he had seen many an affair go sadly as daughters or sons obeyed their parents. His Victoria, however, would not do so. They would be together. He had to believe in the dream, because the most important aspect of the dream had proven real—Victoria herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He drank himself to sleep.</p><p>In the morning, he ordered a bath from the mistress of his lodgings, and once bathed and shaven, he felt like a new man. He had just completed his toilet when the landlady brought him a note.</p><p>It was from Victoria. She was visiting a friend, Siobhan O’Hara, at a public house with a lady’s tea room. There was also a lovely outside patio.</p> <p>And Siobhan’s personal apartments were atop the lower level public house.</p><p>She would be delighted if he might pass by.</p><p>Discreetly.</p><p>Immediately, he felt overcome by emotion. And he realized, sadly, that Victoria had understood the extent of her father’s temper and determination. That would not deter him. If she wished it, he would be discreet.</p><p>And so he donned his hat and set out on the street until he reached O’Hara’s. There, he paused, uncertain, but a young lady came from the house, Miss Siobhan O’Hara, as pretty as a picture with her blazing red hair and snapping green eyes. “Why, Captain Miller! How lovely to see you. I have a box that needs lifting around back, if you’d be so good as to assist me?”</p> <p>“Aye, with pleasure,” he assured her, and so he walked around with her to the rear of the establishment and the delivery entrance. “I really do have a box of Cuban rum,” she told him, her green eyes afire with laughter. “If you would?”</p><p>“As I said, dear Miss O’Hara, with pleasure!”</p><p>He lifted the box, and set it where she directed just inside the storage room, then she brought a finger to her lips, winked, and led him to a stairway.</p><p>“You’ll not be disturbed!” she promised, and disappeared outside.</p><p>He walked up the stairs. When he reached the door at the top of the stairs and was about to knock, the door flew open.</p><p>Victoria was there.</p> <p>She drew him in.</p><p>She did not speak.</p><p>She slid into his arms, as if they had been betrothed for years, as if they were known lovers, and she was greeting him as was only proper.</p><p>They kissed, and her lips were pure sweetness, her breath was mint, and what she might have lacked in experience, she quickly made up for in ardor. Holding her, he felt his limbs inflame, his desire ignite into fever. He tried so hard to hold back, but she would have none of it.</p><p>“Please!” she commanded. “I watched you on the streets forever! We would meet, and you would ask about my welfare and mention the weather. And now we have talked, and we know our hearts and minds.”</p><p>“But you are a proper lady,” he whispered against her lips, aching. And yet, he loved her—he would never force anything upon her. He would wait. He would fight. He would die for her.</p><p>She laughed. Ah, that melody of sound. Her eyes were wicked as they touched upon his. “I am a proper woman as well, my dearest Captain! One who has dreamed of you...longed for you so many lonely nights!”</p><p>Everything within him seemed to explode with a thousand rockets, and his need for her was urgent and desperate, and still...</p> <p>She would not wait. They tangled in a passionate kiss. She was a determined tease, touching his sex, stroking him through clothing, until they both struggled to rid one another of the cumbersome costume that was only proper on the streets, yet so impractical in such a climate! They were both steaming as they struggled with stays and laces and ties, and he laughed, asking her how he was ever going to put her all back together again.</p><p>“You’ve never disrobed a woman before, Captain?” she teased. “Why do I doubt that?”</p><p>“Well, I have disrobed one, but I’ve yet to re-robe one,” he told her. “And seldom were the woman quite so dressed!”</p><p>She never took offense at honesty, and for that, he loved her all the more. And as they talked and laughed, their clothing was at last cast away, and he looked at the beauty of her nakedness, and he was as breathless and in awe as a school boy. But he drew her to him, and their bodies seemed so attuned and so perfect. The feel of her flesh against his was the most wondrous thing that might be imagined, until her lips fell upon his shoulder and his chest, and he could bear no more, lifting her up and carrying to their hostess’s bed, where he laid her tenderly down and loved her once again with his eyes.</p><p>“Come, come, Captain!” she taunted.</p><p>Enough. He loved her then with his kisses, his caress; he adored her from head to toe and back again, until she was crying out for him, and he rose above her at last, sinking slowly into her.</p><p>He was her first lover. He had expected as much. And he made love with all the aching tender care a man could summon, until her needs matched his, and they fulfilled the frantic need of their desire in a glorious rush of silver and gold—it seemed that the world turned colors for them, celebrating their sheer ecstasy of belonging, consummating all that had filled their dreams.</p><p>Nor was she then shy, decrying her moment of madness or asking if he loved her still. She was tender and thoughtful for long moments as they both learned to breathe again, and then she rolled to him and said, “My father has indeed threatened me. I loathe him! No, he is my father, and I love him, but I detest his snobbery! He has forgotten his own love, forgotten my dear mother. He has it in his head that I must marry a filthy rich banker named Townsend—or that lying little thief of a man, Eli Smith, who is a pirate in truth, but is such a suave and smooth liar that they believe he is merchant when the bastard is none. I know he has taken ships, I just know it. I’ve seen goods that such a man could not afford among his offerings, but he has thus far escaped the law. I swear that I will not have either man! He will have to understand that I love you.”</p><p>“He lost your mother,” Bartholomew reminded her. “He lost your mother, and he forgot about love and dreams. Maybe he had to bury them to salve his grief. I’m glad you do not hate him—a daughter should not hate her father.”</p><p>She looked at him in such a way that he felt he could melt like candle wax in her arms. She stroked his cheek. “I love you for all good reason!” she said.</p><p>“We will be together,” he assured her.</p><p>She nodded grimly. “Aye, we will be together. You mustn’t come around—give me time to talk to him. I will make him see life my way. Siobhan is my dearest friend, and her brothers are hardworking men, and her mother is a saint. They will keep our secret. Meet here, not tomorrow but Friday, say, and it will appear that I abide my father’s rule. If I cannot sway him to my way of thinking...”</p><p>“Then I have a fine ship, and we will sail away to another port,” he assured her.</p><p>“Aye. We will sail away to another port,” she agreed.</p><p>The hour was growing late, but they were new lovers so enamored of one another that they were careless of time.</p><p>They made love again.</p><p>Then he knew that she must get home, and he fumbled ridiculously trying to help her back into her corset and stays and all else, but she laughed and guided him and at last, she was dressed. He left first, going into the public house for a beer and a fish pie, and she emerged later, joining Siobhan in the tea room for sandwiches and tea.</p><p>He lived for Friday.</p><p>On his way back to his rooms, he ran into one of the men who had been seeking Victoria’s hand.</p><p>Eli Smith.</p><p>He greeted the man pleasantly enough; he did not know him well. He didn’t like Smith, though. There was something shifty about his eyes—something oily in his speech.</p><p>“So, you’re not at sea, Bartholomew Miller!” Smith boomed. “I thought you were seeking a life as a merchant?”</p><p>“Indeed. I’m heading out to sea soon.” Bartholomew said, trying to be pleasant.</p><p>Smith was pleasant enough in return. “Aye, I must take to the sea soon again myself. But first I must press my suit. I believe that Mr. Wyeth is entertaining my request for his daughter’s hand in marriage. The lady is not ready to wed, but I will lay roses at her feet and await her love!”</p><p>Bartholomew fought to keep his smile.</p><p>“Good luck to you, Mr. Smith,” he said, touched his hat and went on.</p><p>He loathed Eli Smith.</p><p>He was certain Eli Smith loathed him, as well.</p><p>Finally Friday arrived and Bartholomew made his way to meet Victoria.</p><p>As he moved through the streets, he noted that one of the town’s most fascinating women, Dona Isabella, was busy with a bevy of servants. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was shopping. He’d heard it said that her husband, living in Spain, had tired of his wife’s idle days at their island property. He was demanding that she return to Spain.</p><p>Perhaps she was preparing for the journey. He stepped out of the way as she and her entourage passed; her eyes touched his. She didn’t smile or acknowledge him—he was beneath her. She should take care, he thought—there were still pirates aplenty in the water.</p><p>He passed some of the less scrupulous bars in the town, bars where it was said that pirates came, pretending to be good citizens of the town.</p> <p>He knew of one pirate, Mad Miller, who often liked to come to Key West, to drink with the navy men. Despite his name, Mad Miller was not known for being a killer, just a thief. He was friendly with a bar wench, and it was said as well that he would come for her, and they would sail away together. He smiled, thinking that love knew no bounds.</p><p>He knew that so well himself.</p><p>He forgot the wretched Smith, the haughty Dona Isabella and the crazy pirate Mad Miller. He met Victoria, and, if possible, they made love more passionately.</p><p>“I leave with my mentor, Captain Beckett, on a fishing expedition with friends,” Bartholomew said. “I will be gone but overnight—or possibly for two nights. We are going out to catch majestic marlins, for he has friends who enjoy the fight of the fish. Perhaps, I can cancel—“</p><p>“No!” she said with horror, “you must not. People will notice that we are not about, doing as we would normally do.” She was quiet for a minute. “Bartholomew, I know how you love this place, how your dreams were here, but I believe we must run away.”</p> <p>“My dreams are where you are. But we will not run away. Not unless forced in time. I love you, and I care not about any place, but I know that you love your father, and so I will try through my friend, Captain Beckett, to reach your father. Only if we are forced will we go. Let’s give it a few months. I would never have you resent me in time, hate me that you lost the love of your father.”</p><p>She cradled his face. “That you can care, when he has treated you so shabbily, makes me love you all the more.”</p><p>“Ah, well!” He caught her hand and kissed it. “I will not wait forever.” he teased. “There are places we can go. We can go to Jamaica, Bermuda or even New Orleans. I have friends there still,” he assured her.</p><p>“We will wait three months after your fishing trip,” she told him. “Not a day longer. And if we are forced to flee, then later when we have our own precious little daughter, he will make peace with us. He is, at the bottom of his heart, a loving man.”</p><p>He agreed; they kissed.</p><p>And they knew they must part.</p> <p>Part II</p><p>Death</p><p>“Ah, what a beauty!” Captain Craig Beckett applauded, watching as Andrew Morton, a businessman from Key West and a good friend, reeled in a giant blue marlin, a magnificent fish in truth. “What a fine beauty! You’ve done yourself proud, Andrew!”</p><p>“Couldn’t have done it with the expertise of your young friend there!” Morton said, acknowledging Bartholomew.</p><p>“It was my pleasure, sir,” Bartholomew said.</p><p>“A round of rum, a mighty toast!” Beckett said, grinning. He looked at Bartholomew—a look that assured him that he was a good man, and a good man making the right connections.</p><p>“Rum, yes! Or grog, rather, I believe—we’ve sugared her down mightily and added a bit of water,” said Peter Yearling, another friend of Beckett’s, who worked as an architect.</p><p>“Grog, it is! Peter, soon enough Bartholomew is going to need your services, you know. You had best plan to cut him a fine deal. He’ll be running merchandise up and down the coast, and bringing back the finest goods from all over the world,” Beckett said, accepting the mug handed to him by the architect.</p> <p>“A home!” Peter boomed. “Indeed, when you are ready, I will build you a fine home, my friend. And as it is done, I will keep the cost down for you—and expect the best in tea, silk, and so on in return!”</p><p>Bartholomew laughed with the men.</p><p>The conversation went on, and he was pleased, and he thought that he might have a chance of creating a home here, with Victoria. He was befriending men who were respected in the community; he would make the living he must—an honest living—to be a good husband and provider for Victoria.</p><p>“What say you, Bartholomew? Onward to the islands?” Beckett asked.</p><p>“Pardon?” He had been thinking about Victoria.</p><p>“We’ve decided to lengthen the trip. Head for the southern Bahamas,” Beckett said.</p><p>His own ship was anchored nearby with Jim Torn awaiting his command.</p><p>He smiled. “Sir, if you’ll forgive me, I will return to Key West. I have many books you have given me, regarding money matters and record keeping. I’d study them before we head to Richmond, sir.”</p><p>“There’s my man! Stalwart in battle, earnest in peace!” Beckett applauded.</p><p>Bartholomew thanked him for his support, said his goodbyes to the others and headed for the ship’s ladder down to his small boat. He rowed to the Bessie Blue, where his men awaited him, and he assured them all that the expedition had gone well.</p><p>Pleased with the day, he was heedless of the wind or the weather. He had been away from his love for only days, but it felt like eons.</p><p>It was late, however, when they returned to port. He wouldn’t try to see Victoria or contact her that night; he would wait until morning, and head straight for O’Hara’s public house. The family was warm and wonderful, coming and going from Ireland, some embracing America and some returning to the Old Country.</p><p>They knew of his love. And they all seemed to be in love with love, and certain that all would end right.</p><p>Anxious, and dreaming of the morrow, he headed home through dark and empty streets.</p><p>His lodging house was quiet as well, not a man about, and certainly not the mistress of the house, his landlady. He did not expect many to be up at this hour, but he hadn’t even seen the usual drunks in the street. No matter; he gave it little thought.</p><p>He fell back upon his bed, exhausted, yet not quite ready for sleep. He took a small measure of rum, swallowed it down and stared at the ceiling, dreaming. He loved Victoria. He truly loved her. She was goodness and purity with spirit and vivacity—and she loved him, as well. They would make it work.</p><p>He closed his eyes, content and anxious, dreaming of Victoria and their future.</p><p>He felt a soft touch upon his cheek, and his eyes flew open. He smiled. He’d dreamed her touch, just as he dreamed her there.</p><p>“My love,” Victoria said, and a kiss fell upon his lips, as gentle as the air. She seemed to float above him.</p><p>“I am all right—I am better where I am, for I chose the ending. I could not live with the memory of you, and the touch of another man,” she said. “But now, you must rise. You must not lie here. You are accused. They will be coming for you. They will want you dead.”</p><p>“Victoria, don’t fret! No one will come for me. All is well. I am here now. My trip was a great success. We will have many powerful friends. I will convince your father that we can marry, that I can be the husband you deserve and a provider who is strong and resilient and good.”</p><p>He heard something outside, some major commotion.</p><p>“Run, you must run!” she told him.</p><p>“No, my love, I have nothing to run from,” he said.</p><p>The commotion grew louder.</p><p>He was looking at Victoria, and then he wasn’t.</p><p>She wasn’t there; she had been nothing but a dream. A confusing dream, for he couldn’t understand what she had been trying to tell him.</p><p>Had he been sleeping?</p><p>Then his door burst open. He jumped at the sound, and reached for his sword. He wanted to be a man of business, but he had long been a seaman. He had seen much of war, and he had roamed the seas as a privateer—awakened suddenly, he would always reach for his sword.</p><p>He was stunned when men began pouring into the room—David Porter’s men, and a few citizens of Key West.</p><p>“Bartholomew Miller! You are under arrest for murder!” cried out a lieutenant.</p><p>Aghast, stunned, he faced them all with his sword.</p><p>“I have committed no murder!” he cried. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Foul bastard!” shouted another man, a citizen. “You raided the ship Annabelle Lee, causing her to sink. You butchered her crew.”</p><p>“I did no such thing!”</p><p>“You even murdered the young and innocent Victoria Wyeth and her maid!”</p> <p>“What?” The single word didn’t explode from his mouth—it was a whisper of disbelief.</p><p>They were lying. What words had come out of the man’s mouth were so abominable they couldn’t be true.</p><p>“No!” he cried, an eruption of horrified protest. “What are you talking about? Victoria Wyeth was on no ship. She is home, certainly—she is home in bed, sleeping.”</p><p>“Victoria Wyeth was on the Annabelle Lee, heading north to Virginia at her father’s command—to escape the likes of you,” the lieutenant informed him.</p><p>“And you did draw her out and murder her, in cold blood,” another cried.</p> <p>He shook his head. “This is not true. Victoria is not dead. She cannot be dead.”</p><p>“You were seen,” said the lieutenant. “Your ship was seen, blasting cannon at the merchantman. You lured the ship to the reef, and proceeded to pummel her with deadly powder, and then went aboard the dying vessel to cut down and kill all aboard.”</p><p>“No! Never, never! I love Victoria!” he said.</p><p>“You loved her, you scurvy bastard, and you couldn’t have her, so you killed her,” the lieutenant said scathingly.</p><p>Bartholomew still couldn’t understand the words that were being said. He couldn’t comprehend them. Because it couldn’t be true.</p><p>And if she was dead...</p> <p>Nothing else mattered.</p><p>But she couldn’t be dead. Not Victoria, with her laughter, with her spirit, with her joy and kindness, and absolute beauty in person and in soul.</p><p>“You were witnessed, and all know that you are a pirate, Bartholomew Miller,” the lieutenant said. “And according to our law, you will now be hanged by the neck until dead.”</p><p>He didn’t care. He didn’t care what happened to him.</p><p>But, Victoria...</p><p>And the accusation that he had killed her? Killed his love?</p><p>“Back away!” he warned, swinging his sword. “If what you say is true, if Victoria Wyeth is dead, then gladly will I lay down my life, for it is worthless if she is no longer in this world. But it is a lie, a foul lie. I killed no one, and damn you all and the liar who said it. I was never a murderous pirate. I served king and country, and then the ideal of this country, and I fought the enemies of my state at all times. To murder any woman would be abhorrent to me—to injure a hair on the head of Victoria Wyeth would be anathema, and I am innocent of such a charge.”</p><p>“Seize him!” the lieutenant ordered.</p> <p>There were many after him—a good two dozen. But there was something in him that night. He fought like a caged beast, which, in truth, was what he was. Men fell back before him. He caught the tip of one fellow’s nose with so smooth a slice that the man bled like a pig before crying out that he had been injured.</p><p>Many another bore a slice, but he had no desire to kill.</p><p>No desire to live.</p><p>He had a chance to make a clean strike and kill the lieutenant. He watched the man step back in fear.</p><p>He lowered his sword.</p><p>“Tell me—is it true? Is Victoria Wyeth dead?” he asked quietly.</p><p>“Indeed,” the lieutenant said quietly. “Your ship was seen. A witness cries against you, one who fled in terror for his own life.”</p><p>“The witness lies,” Bartholomew said.</p><p>“You are condemned,” the lieutenant told him.</p><p>“Then I will go to my death,” Bartholomew said.</p><p>None of them dared go near him.</p><p>He shook his head, his heart dead already. He dropped his sword and offered his hands to be bound behind his back.</p><p>Finally a man stepped forward, nervously trying to tie the rope. He did the job badly. It didn’t matter. Bartholomew intended to make no fight.</p><p>He left his room without a backward glance. He was led down the stairs and out to the street, and now, despite the late hour, there were people everywhere, all crying out against him, hurling bad tomatoes and whatever else lay in the road. He felt nothing.</p><p>They walked, in the pale glimmer of the moon to the hanging tree. And there he was prodded up on a box, and the lieutenant was taxed with the job of offering him a hood and setting the rope around his neck.</p><p>He declined the hood.</p><p>“Have you last words?” the lieutenant asked, his voice shaking.</p><p>“Indeed! I am innocent of this charge. I was nowhere near the reef, rather on a fishing expedition with Captain Craig Beckett, and when he returns, you will know the truth of my words. I have always shown mercy to my enemies, I have served all well with passion. I loved Victoria Wyeth with every breath in my body. I have but one question. Who accused me?”</p><p>Nervous silence greeted his words.</p><p>“I have the right to know before I die! Who accused me of this foul crime?”</p><p>“Eli Smith,” the lieutenant said.</p><p>“Then I hope that he meets his just end—I hope that the truth comes out. I hope that he comes to this hanging tree himself, but that, when he dies, he finds no reward, but rather that he rots in hell for eternity. For myself, all that I loved in life is gone, and therefore I go willingly to meet her. I still stand before you an honest man who loved deeply, but did no ill to anyone in that love!”</p><p>He was startled to hear a woman’s tears from the crowd.</p><p>There was a murmur of protest.</p><p>“As per the law and the task with which I am charged!” the lieutenant cried out, and he kicked the box away.</p><p>Dying was quite bizarre, and as he had felt nothing since learning Victoria was dead, he was only vaguely aware of the pain.</p><p>His neck did not break.</p><p>He was suffocated slowly. He tried hard to die with dignity, but he was aware that his body betrayed him, that his limbs twitched and jerked.</p><p>Slowly, too slowly, the blackness began to overwhelm him.</p><p>This was death...</p><p>Suddenly, he was no longer the man swinging from the tree. He was above it all, watching.</p><p>Watching as his limbs ceased to twitch.</p><p>Watching as he hung limp in death.</p><p>Someone walked up to him and stood on the block, and placed their fingers against his throat. “Is there a physician?” he cried.</p><p>There was a doctor in the crowd. He came forward and placed his ear to Bartholomew’s chest, and waited.</p><p>Someone brought a mirror; it was set before his parted lips.</p><p>“He is dead—it is done. So die all pirates!” the lieutenant. He tried to cry out the words with conviction and assurance. His voice squeaked.</p><p>Bartholomew felt as if he was standing behind the crowd, watching.</p><p>As he watched, he felt a hand slip into his.</p><p>He turned.</p><p>Victoria was there. Her beautiful eyes were filled with sadness. She touched his cheek. They were together but invisible to the others. “My love. My poor, dear love,” she whispered. “I tried...I tried to warn you.”</p><p>He stroked her cheek in return. “But you are here. I prefer death with you to any life without you.” he said.</p><p>“We are here, together,” she said.</p><p>“Who did this to you?” he asked her.</p><p>“Smith,” she said, as if even the saying of the name was loathsome. “Smith! He wanted to take me. He meant to kill everyone on the ship and take me with him. I refused to go with him. I could not! My skin crawled at the thought of it. He said that I could die or have him, and I said that I preferred death. And he said that I was hypnotized by evil—you. He said that we would both pay. And he put his hands around my neck, and strangled me...and I died, and yet I stayed. I was on his ship when it returned, and I heard him shouting that my ship had gone down and that...you had done it.” She began to weep with no tears. “My father heard the words and went mad. He took his pistol, set it in his mouth, fired it and died on the spot.”</p><p>“I am so sorry, my poor, dear love.”</p><p>“Smith must be made to pay for his crime,” she whispered.</p><p>“Yes, Smith must pay. And he will do so,” Bartholomew said.</p><p>And so they remained, hand in hand, as the days passed by. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Then Craig Beckett and his crew returned. Eli Smith must not have known that Bartholomew had sailed with Beckett that day, because he was in the bar, boasting of his prowess at sea and saying as how he’d have taken on the pirate Bartholomew Miller himself had he but had a few guns on his own sloop, when Craig Beckett strode into the room.</p><p>Beckett was incensed.</p><p>“Liar! You are the worst, most sniveling bastard of a bloody liar,” Beckett said. “Bartholomew Miller could not have committed the crime as you say, and I know it well, for Bartholomew Miller was with me when the crime took place.”</p> <p>“No, that’s not true,” Eli Smith cried out, but he was so taken by surprise that his words tumbled out oddly. Then he found his voice. “No, no, this is not true. You—defend him falsely. And it is too late—he is dead. Hanged by the neck, and dead as a pirate should be dead.”</p><p>Craig Beckett stood straight and slowly smiled a smile that was not a smile at all.</p><p>“There were others with me, Smith. Other good men of this town. Honest men, who know that you killed the people aboard the Annabelle Lee, you killed Victoria Wyeth because you could not have her—she truly loved another. And you brought about the execution of a good man who caused no ill to any other in a heinous manner. You, sir, deserve to die! But it will be just and right—you will be condemned by a jury of your peers.”</p><p>Eli Smith fought. He fought wildly. He screamed, he cried out, and he was finally subdued and caught between the two burly men who had taken him. He was dragged down the street—dragged, for he fell limp between his attackers—and continued to scream and cry and protest.</p><p>Bartholomew, with Victoria’s hand in his, followed.</p> <p>Eli Smith was actually given a trial. But he had no witnesses in his defense—his crew were rounded up by the squadron and brought in for trial, as well. Desperate to save their own lives, his own men spoke against him. Bartholomew was glad to see that even the justice of Commodore David Porter was not so harsh as to have the young cook’s helper charged with murder, but most of the other men, no matter how they maligned their captain, would not be spared the rope.</p><p>The trial came to a conclusion, with Beckett and many another good man speaking in defense of Bartholomew.</p><p>The time and date for the execution were set, and it came about.</p><p>Eli Smith was dragged to the hanging tree.</p><p>The man did not want to die.</p><p>As all others, he was given his chance to speak.</p> <p>Craig Beckett was there, and Eli Smith pointed at him. “I curse you, Beckett! I curse you, and all your heirs! Time will come and time will tell, and by all that is holy and unholy, I swear that you will know the pain I suffer now! I curse you. I curse you. I curse you! May all the demons of hell curse you and all your issue, and their issue, until time is no more!”</p><p>Beckett stood watching him. “It is you who are cursed, man. It is you who murdered an innocent young woman, and all aboard her ship. You brought about the death of an innocent man. The death of Victor Wyatt also weighs on your soul, for he died of the pain you caused. You, sir, will rot in hell.”</p><p>“I punished those who sinned! I did no more!” Eli Smith called out. “You are cursed, sir! Whatever time it may take, I will see that you and yours rot in hell! Cursed—”</p><p>The hangman had tired of the tirade.</p><p>He kicked out the platform upon which the condemned man stood, and Eli Smith’s words were cut off cleanly.</p><p>Bartholomew listened to the sound of the rope scraping against the tree, and he heard the sound of the dead man swinging to and fro, to and fro.</p><p>Then, they saw Eli Smith drop, in spectral form, from the swaying body. He stared at himself. And he began to curse again, damning Beckett—and damning him.</p><p>He turned, and he saw Bartholomew, and Victoria holding his hand.</p> <p>He pointed at Bartholomew. “Bastard, you both deserved to die!” he shouted out.</p><p>Bartholomew just stared at him, praying that he was not about to spend eternity roaming the streets of Key West with this man.</p><p>But then, there seemed to be an eruption from the ground. None of the living saw it, but Victoria did, as did Eli Smith. He frowned, staring.</p><p>Bartholomew grasped Victoria’s hand, and pulled her back, and they saw a dark, oozing blackness arise out of the ground. It was like a sea of swirling, spiraling tar, thick and viscous. It rose as if it sought to find a form to take, as if it had eyes, as if it searched for something—or someone—and found what it sought.</p><p>It started toward Eli Smith.</p><p>“No!” he raged in terror. “No!”</p><p>He tried to run from the oily, stygian ooze, but the thing formed fingers and arms and reached out for him.</p><p>“No!” he cried again. He began to scream and gurgle as the stuff surrounded his spectral being. He cried out horribly, as if the black ooze were a burning tar, and it seemed long agonizing minutes before it all ended with the ooze receding into the floor, along with the ghost of Eli Smith.</p><p>And all was silent. Except for the living, who went about the business of cutting down the body, unaware of the drama that had taken place in another sphere of existence.</p><p>“It’s not good,” someone muttered. “Not good, being cursed by the dead.”</p><p>Craig Beckett was not disturbed. “I don’t believe in curses, man. I believe in the good and evil in a man’s soul, and a curse from one evil man can only be a curse when another comes along. Let’s put an end to this business.”</p><p>Victoria looked at Bartholomew, her eyes wide. “There is justice. We don’t always see it, but there is justice.”</p><p>He nodded. He had no real body, and yet he felt that he swallowed hard, for he wanted to be strong and sure, but he didn’t know what any of it meant.</p><p>The body was cut down; the spectators meandered away, and soon, they were alone. Bartholomew held both Victoria’s hands, looked down at her, and tried to smile.</p><p>“I have you,” he began to say. He had been about to tell her that he could face heaven or hell with her by his side.</p><p>But then the light came.</p><p>Like the ooze that came from the ground, the light seemed powerful and living. It burst out around them, filling the air.</p><p>He lifted a hand to shield his eyes against it. There were people walking from it. Some hovered in the distance, but two, hand in hand came closer.</p><p>He saw who had come. Victor Wyeth, and his beautiful wife—so like Victoria, just Victoria in another twenty years. Still lovely, tall, sweet and proud.</p><p>At his side, Victoria cried out.</p><p>“My daughter!” her mother said.</p><p>“Victoria!” her father cried, and there was a sob in his voice.</p><p>Bartholomew felt her hand slip away from his; she raced to her mother, who enveloped her in a gentle hug. Victor Wyeth set his arms around his wife and his daughter, and the threesome held together for many long minutes.</p><p>Victor Wyeth looked over at Bartholomew then. “I was wrong—my apologies come too late.”</p><p>“Not too late, sir. I am...I am...I am so sorry for us all.”</p><p>Victor nodded, looking at him. Then he turned to his daughter. “It’s time—your murder is avenged, and I must seek forgiveness for all my actions. It’s time.”</p><p>Time? Time for what? Bartholomew wondered.</p><p>He saw that the light streamed from a path.</p><p>“We must go,” Victor said.</p><p>Victoria reached out for Bartholomew.</p><p>Victor caught her hand. “No,” he said gently. “It’s not time for Bartholomew,” he said.</p><p>Victoria frowned. “Father, Bartholomew must come. You know that he was guilty of no evil, that his heart was pure, his intentions good.”</p><p>Victor shook his head sadly. “It is not for me to say.” He looked at Bartholomew. “You are charged to remain.”</p><p>Victoria ran to him. He took her into his arms. But then she pulled away, troubled as she looked at him. “I must go. I feel the light, and I must go. I am avenged, and with those who love me, and I know that there is a greater love...forgive me.”</p><p>She was to go, and he was to stay.</p><p>But he saw the radiance in her face, and he knew, yes, she must go.</p><p>For a moment, his arms tightened around her. He held her close, and he wondered if he would know only loss, and he wondered why the light was coming for Victoria, and not for him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But he loved her.</p><p>And he let her go.</p><p>He kissed her spectral lips one last time. She stepped backward, until she reached her parents. She looked at him, and he smiled.</p> <p>Know only pure happiness and the great warmth and light of love that surrounds you, he thought. And she heard his thoughts.</p><p>They turned, and walked into the light.</p><p>And then the light was gone, and he remained.</p><p>Bartholomew mourned for a decade, but it seemed that he was to remain, though for what reason, he did not know.</p><p>Eli Smith had been duly hanged. His death had been avenged.</p> <p>He followed Craig Beckett around at times, but Beckett never noted him, though now and then he would pause and look around, puzzled.</p><p>He watched as David Porter brought down the pirates—not an easy task, and there was many a tragedy at sea. As he had feared, Dona Isabella was beset at sea and murdered by the love of Mad Miller’s life, his bar wench, finally his consort. Ah, jealousy!</p><p>The Mosquito Squadron moved north, and the salvage trade made Key West one of the richest cities in the country, and the world.</p><p>War broke out. Civil War—terrible in the extreme. Florida seceded from the Union, but the Union held the fort, and the streets were filled with tension and sadness.</p><p>There were good years, and there were bad years.</p><p>Boring times and intriguing times.</p> <p>He was saddened when war came again, when the bodies of sailors who died on the Maine came to Key West and were buried.</p><p>He met other ghosts now and then, and some were bitter, and some were lost. Some stayed in the cemetery—now in the center of the island, after a horrible storm sent bodies floating down Duval Street. He haunted those who read, and learned to keep pace with them, since it was awkward and difficult to turn pages.</p><p>He saw fine people throughout the years, but none of them seemed to notice him. They would pause and sometimes shiver, but they didn’t notice him.</p><p>Time came, and time went.</p><p>He was fascinated by the grouchy old bearded writer—Ernest Hemingway—and he enjoyed hanging out at the bars with him, and laughing over his foibles with his wife.</p><p>Key West, infuriated by a blockade, seceded from the Union and became the Conch Republic—only for a few hours, though the title would remain forever. The blockade—strangling the islands and ruining Key West’s business, the tourist trade—was lifted. Their point was made.</p><p>And still, he haunted the island. He had loved life, and he had loved Victoria, but she was long gone. He found himself pining after another ghost, a beautiful young woman in white who was often in the cemetery. But she was shy, and they had yet to formally meet. He knew that Victoria was long gone, and that she was happy, loved, and at peace.</p><p>And he was lonely.</p> <p>He was still intrigued, however, with the people and places around him. It was Key West. The bizarre happened. As in the case of that Carl Tanzler fellow—who fell in love with a young Cuban girl, tried to cure her tuberculosis, then dug her up and repaired her body constantly so that he could marry her—and sleep with her corpse for years and years.</p><p>It could be entertaining. At least he was in Key West.</p><p>But still wondering why he remained.</p><p>Then came the day that he was hanging around O’Hara’s.</p><p>The day he met Katie O’Hara.</p><p>He was absolutely astounded. She didn’t pause and shiver and feel as if a goose had walked over her grave. She saw him—she really saw him. And she spoke to him.</p><p>Katie was gifted. He loved to tease her—she had been told, of course, never to let on that she saw ghosts.</p><p>People would think that she was crazy.</p><p>So he loved to tease her. Say things in public that would demand a response.</p><p>But it was amazing. He had gone so many years, being lonely.</p><p>And now...</p><p>Of course, he had gone so many years wondering why he remained, as well.</p><p>But then, Katie was trying to buy the old Beckett museum, so...</p><p>And David Beckett, who had left town years ago, accused of the bizarre murder of his fiancée, was returning.</p><p>Things might just start to get interesting.</p><p>He might have finally found the reason why he remained on earth....</p><p>Ever waiting for the light. </p> </body></html>"]