["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>\"So, if I'm reading this correctly, you're a vampire now. Not a secretary.\"</p><p>\"Not an administrative assistant,\" I corrected automatically. I mean, jeez! I knew Cooper was old and creaky, but what century did he think we were living in? (Or in my case, dying in and then reliving?)</p><p>\"The important bit,\" Cooper went on, \"is about the vampire.\"</p> <p>\"Well, yeah.\"</p><p>\"And how you're the queen of them.\"</p><p>I sighed and flopped into an airplane seat. I examined the toes of my navy blue Cole Haan Penny Air Loafers . . . not a scratch so far. \"I guess some people would consider that an important point. The queen thing.\"</p><p>\"It's bulleted and boldfaced. Also, the date of your death is in italics, along with how you don't have to urinate anymore.\"</p><p>\"My pee or the lack thereof is nobody's business!\" I gnashed my teeth and added, \"Give me that.\"</p> <p>I snatched the memo away from Cooper so quickly, he didn't see my hand move until his wrinkly fingers were clutching air. This startled him into a gasp, which we then both pretended I hadn't heard. That, I was learning, was vampire etiquette. Or, that is, vampire etiquette when dealing with humans. I'd finally figured it out after three years of being undead.</p><p>There should be a class, you know. Vampire Etiquette When Dealing with Humans 101. In another fifty years, I could teach the stupid thing.</p><p>I scanned the memo, my eyes bulging so much they felt like they were trying to leap from my skull. Cooper hadn't been kidding. Jessica had sent him a memo detailing my bodily functions. Two pages!</p><p>To: Samuel Cooper.</p><p>From: The Boss.</p><p>Re: Betsy, Vampirism, and Cargo.</p> <p>Cargo? My gut churned.</p><p>And the part about me being the vampire queen was bulleted.</p><p>\"I can't believe she sent you a memo.\"</p><p>\"She always does. And I send 'em to her. Increasing fuel costs, licensing issues, route changes. You know how expensive fuel's getting now that China's buying all the oil? The E.M. ain't cheap, you know.\" The E.M.: Jessica's private joke. It stood for Emancipated Minor.</p><p>\"And she sends her memos to me to keep me in the loop, don't you know. Seems this one's a little late, though,\" he muttered.</p><p>\" 'Creepy speed and unnaturally grotesque super-strength'?\" Aghast, I kept reading as other blechy phrases leaped out at me. \" 'Still obsessed with shoes but married rich and can now actually afford the stupid things'? That scrawny traitor, I'm going to-agh! 'Immortality hasn't given her any interest in any topic she cannot refer to in the first person.' Why, that-okay, I can't really argue with that last one, but she didn't have to highlight it. Look! It's highlighted. \"</p><p>\"So is 'extreme narcissistic tendencies.' In any case, I'm to fly you to Cape Cod, so you can meet with the King of the Werewolves and make sure he doesn't sic his pack on you.\"</p><p>\"I think it's pronounced Pack.\"</p> <p>Cooper heard the capital P and nodded. \"Right. This Pack, they're pretty ticked? Because of that little gal Antonia?\"</p><p>I nibbled on the inside of my lip, distressed, as always, by any mention of Antonia. It had only been a week. It didn't still sting, as much as feel like a lateral slice through the liver.</p><p>See, poor Antonia was making the trip with us-in the cargo hold, as all corpses flew. In a plain wooden coffin, the lethal bullet holes all over her skull still not filled in by an undertaker. My husband, Sinclair, and I had no idea what werewolf funeral customs entailed, so we'd given orders that her body simply be placed in a coffin and loaded onto Jessica's private plane.</p><p>We didn't even wash her beautiful, dear face.</p><p>But that was nothing compared to what we did with Garrett's body.</p><p>\"Look, Cooper, the important thing is now you know what you're getting into. So if you can't fly us out there, or if you think you-\"</p><p>\"Bite your tongue, miss. Or missus, I suppose. I've been flying for Jessica Wilson since she was seven years old, don't you know, and we've had hairy days and we've had hairy days.\"</p><p>\"Cooper, I never, ever want to hear about your hair.\"</p><p>He ignored me. It was just as well. \"I've seen and heard things-never mind, that's private family business.\"</p><p>\"Oh, come on, we're best friends. I mean, Jessica and me.\" I didn't know if Cooper had any friends. \"There's no way you know stuff that I don't-\"</p><p>Cooper ruthlessly interrupted my shameless scrounging for gossip. \"This doesn't scare me.\" He nodded at the memo, inadvertently crumpled in my fist. \"But I surely wish Miss Jessica had told me earlier.\"</p><p>He meant, of course, \"Like, how about before I flew you and the vampire king to New York City for your honeymoon, dumbass?\" But Cooper neither a) freaked out, nor b) quit. And thank God, because finding another private pilot at this hour would have been a bitch.</p><p>\"You got a problem with the boss?\" I asked. \"Take it up with the boss. What I want to know is, are we still leaving at eight o'clock?\" Because if we weren't, I (and probably my husband) was going to be in big trouble with seventy-five thousand werewolves. I held my breath, remembered for the thousandth time I didn't have to breathe anyway, and waited for his answer.</p><p>Chapter 2</p><p>\"Memos don't slow down my flight check,\" Cooper semi-scolded in his luscious Irish accent. I managed not to swoon with relief. Also, oooh, European accents, I could listen to them all day. Americans sounded like illiterate bumpkins by comparison. \"Gunshots don't slow down my flight check.\"</p><p>\"Don't worry. Nobody's packing.\" On this flight.</p><p>\"I could tell you stories about the carnage and body counts . . .\" Cooper's pale blue eyes went misty with nostalgia while I watched him nervously, then he seemed to shake himself. \"But the government made me promise.\"</p><p>\"Well, hoo-ray for the government.\"</p><p>Cooper had first worked for Jessica's dad and, when her folks died (an ugly yet fitting death and a story for another time) and their assets transferred to her, he kept right on flying for her.</p><p>And as he'd said, Cooper heard things. Chances were he'd already known I was walking around dead. He was just miffed that Jessica hadn't told him three years ago.</p><p>And you know, he wasn't revolting looking. Tall-my height-with eyes the color of new denim and a shock of pure white hair that he wore over his shoulders, he was like an ancient hippy, albeit one who had never touched drugs nor alcohol.</p><p>He was wearing what Jessica teasingly called his uniform: khaki shorts, sandals, and a T-shirt that read, JESUS SAVES. HE PASSES TO NOAH. NOAH SCORES! He had tons of weird Jesus shirts. People picked fights if he wore the wrong T-shirt to the wrong place. Fights Cooper always won, despite his age. It was unreal, yet cool . . . sort of like Cooper himself. Jessica had fired him dozens of times for his own safety, but he always showed up the next day.</p><p>\"Okay, then.\" I stood, forgetting I had been sitting under a bulkhead, and banged my head. \"Ow!\"</p><p>\"Luckily being dead hasn't dulled your natural grace.\"</p><p>\"Shut up, Cooper.\"</p><p>He smirked and tipped two fingers in a mock salute.</p><p>\"All right, so I'll see you in another hour or so. They're, um, they're done loading Antonia and my husband's pulling together some paperwork . . .\"</p><p>For what, I had no idea-Sinclair had his fingers in a lot of pies, and I wasn't interested enough to ask. He might answer, and then I'd have to listen. Or look like I was listening, which was harder than it sounded.</p><p>\"Anyway,\" I finished, having almost lost my train of thought (again), \"we'll be back a little later.\"</p><p>\"I'll be ready, mum.\"</p><p>Oh, it was mum now? What was I, the queen of-never mind. \"And for the zillionth time: Betsy. It's Betsy.\"</p><p>\"Whatever you say, mum.\"</p><p>Polite as always, he didn't turn his back on me while I scuttled out of the plane and down the stairs. My car was parked on the west end of the tarmac of the MinneapolisInternationalAirport; I had no idea what strings Sinclair had pulled so that I could park there. I didn't want to know, frankly.</p><p>Okay, \"my car\" was a bit of an exaggeration . . . I'd driven one of Sinclair's to the airport for my little hey-guess-what-I'm-dead meeting. It was a Lexus hybrid, the only SUV I could drive without feeling like another planet-polluting asshole. Also, it had seat-warmers.</p><p>There! One unpleasant chore out of the way-Cooper knew the scoop and, even better, hadn't tried to jam a cross down my throat. He'd agreed to fly us to the Cape, and best of all, hadn't tried to offer me a washcloth soaked in holy water. Another sneezing fit I so did not need.</p><p>Have I mentioned there are some actual perks to being the long-prophesied vampire queen? I'm so used to bitching about my unwanted crown I tend to overlook the positives.</p><p>Holy water, crosses, and stakes can't hurt me. Nor garlic. Antonia, my dear dead friend, had no idea if bullets would kill me, and refused to risk my life to find out. Which is why she was riding in the cargo hold instead of the plush seats of a private plane.</p><p>I shoved Antonia out of my head; it still hurt too much to think about her sacrifice.</p><p>And speaking of sacrifices, there was Garrett, Antonia's late lover, to think about. Once he'd realized that Antonia was dead-in part due to his own cowardice-he'd killed himself right in front of us. Messily.</p><p>I didn't quite dare broach the subject with Sinclair; he felt unrivaled contempt for a lover who would jam someone up and then not face the consequences.</p><p>Me, I wasn't so sure it was that black and white. Garrett was never strong. He was never even brave. But he had loved Antonia and couldn't live without her. Literally.</p><p>Tina and Sinclair had taken care of his body, dragging it off the broken staircase (poor Garrett looked like he'd been caught in a giant set of teeth), cutting off the head, and burying it at Nostro's old farm (where the Fiends . . . the ones still alive . . . lived).</p><p>But that was enough of that for now-Garrett was dead, and I couldn't change that. But I was going to have a word with my alleged best friend about her irritating, insulting, and idiotic memorandum (memoranda?).</p><p>I mean, jeez. Narcissistic? Didn't she stop to think how I would feel if Cooper read that about me? Not to mention, I wasn't even cc'd on the thing.</p><p>I swear, I didn't know what had gotten into that girl since I'd cured her cancer and she had to dump her boyfriend because he hated my guts. Frankly, I've been having a terrible time this week.</p><p>And now rogue memos! It was too much for anyone to expect me to handle, which I would be pointing out to her the minute I saw her.</p><p>Self-centered? Me? Sometimes that girl doesn't know me at all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 3</p><p>Dear Myself Dude,</p><p>I can't remember the last time I tried to write in a diary. This one will go the way the others went, I think. I'll write like gangbusters for a week or two, then lose all interest in writing about my life and get back to living my life. But here I am again, starting a diary for the first time in over twenty years.</p><p>That's a lie, of course. One of my psych profs told me in college that we lie best when we lie to ourselves.</p> <p>The man knew his shit. I know exactly when I quit writing in diaries: it was right around the time I realized I had zero interest in girls, but plenty of interest in boys. I was fourteen, and kept waiting to grow out of it. Kept wondering what was wrong with me. Hoped it was just a phase. Prayed my father wouldn't find out. Prayed no one in high school would find out.</p><p>The trouble with being a closeted homosexual is exactly this: you live with the agonizing fear you will be found out.</p><p>I hid until I was old enough to drink.</p><p>When I was sixteen, I tore up my last diary for the simplest and most cowardly of reasons: I didn't want my dad to find it. Colonel Phillip P. Spangler's only son a bum puncher? A faggot? A crank gobbler? He would have killed me, or I would have killed me, so best to stop writing things like \"I wish Steve Dillon would dump that idiot cheerleader and blow me for an hour or two.\"</p><p>So.Diaries. Specifically, new diaries. No chance the colonel will find this one; he's in hospice, crankily dying of lung cancer.</p> <p>It's pretty rotten that I wasn't sad when I heard. It's worse that I reran his labs myself to confirm it. I was relieved. Poor excuse for a man's only son.</p><p>My name is Marc Spangler. I'm a doctor, an ER resident at one of the busier Minneapolis hospitals, and I live in a mansion. No, I am not rich. Not yet . . . and probably not ever unless I specialize in cardiology, oncology, or face-lifts. Fortunately, this is not the sort of job you go into in order to make money. Which is a good thing, because I found out (quite by accident) that when you break down my shifts into hourly rates, every receptionist in the building makes more money than I do.</p><p>But back to the mansion. My best friends are a vampire and the richest woman in the state of Minnesota (and, as Jessica herself would point out, not the richest black woman . . . the richest woman). In fact, they are my only friends. Once I left the shithole I grew up in, I never went back. And I never will.</p><p>I haven't gotten laid in a while, but on the upside, I lead the most interesting life of anyone I know . . . except maybe for Betsy and Sinclair, the King and Queen of the Vampires.</p><p>Ooooh, Sinclair. Don't get me started. Tall, broad-shouldered, dark hair, dark eyes, long fingers, and when he and Betsy go at it, the entire mansion shakes. Those are usually the nights I go out and get drunk.</p><p>Mostly because I've always been wildly attracted to him, and partly because Betsy has unconsciously worked her charm on me . . . she's about the only woman I've ever seriously considered sleeping with. And-don't get me wrong, dude, because I love her to death-it's just as well we didn't hook up. What with the shoe shopping and the bitching about being stuck in a job she didn't ask for and didn't want, and the way she manages (quite unconsciously, I'm sure) to make everything about her . . . nope, nope, nope. If she was my girlfriend, I probably would have jammed a needle full of potassium into my heart before the end of the first week.</p> <p>She has twenty-eight pairs of black pumps. Twenty-eight! I counted them myself. Then I counted again to make sure I wasn't hallucinating, and got twenty-nine. Those twenty-eight or -nine pairs were maybe a third of her collection. Her love for fine footgear . . . it's almost pathological.</p><p>Thing is, while I was debating trying sex from the other side of the fence, Betsy didn't even know she was doing it. Getting into my head, inspiring me to wear a bit more aftershave than I usually do, making me want her . . . she did it completely unknowingly and by accident. My inner scientist wished I could have known her in life, so I could compare her premortem charisma with her \"vampire mojo,\" as she called it.</p><p>And why am I going on and on about Betsy's unholy sex appeal? That's not what I wanted to say at all.</p><p>Basically, I guess I've started another diary because things aren't all happy-happy-yay-yay, the-good-guys-win anymore. I thought I'd learned that by the time I was in my fourth year of medical school, but I didn't know shit about death back then.</p><p>I know a lot more, now.</p><p>People are dying. Good guys are dying. Friends are dying. And I just figure someone ought to be writing it all down.</p><p>Because one of these days, I'm worried they'll be flying me in a private plane and I won't be riding in first class, if you know what I mean.</p><p>The colonel might care. Might. I won't be around to see it, so I guess it doesn't matter.</p> <p>Chapter 4</p><p>My husband grimaced as I plopped down next to him with BabyJon in my arms. Not particularly keen on fatherhood in the first place, Eric had found it an annoying shock that his wife was the legal guardian of her infant half brother.</p><p>He was, like any man, jealous of anything that took his wife's attention away from him (which was part cute and part irritating).</p><p>Also, it was my fault my father and stepmother were dead (long story short: cursed engagement ring, grants wishes, and the cost is always high). And when I used the ring, my father was killed. As well as my stepmother.</p><p>I had wished for a baby of my own and, like that story \"The Monkey's Paw,\" my wish was granted in a rather grisly way: With BabyJon's parents dead, guess who got custody? Bingo. Leaving me with an instant baby, zero stretch marks, and a ton of buried guilt.</p><p>Since I had inadvertently made BabyJon an orphan, I figured the least I could do was raise him. He was my only shot at motherhood; obviously, dead people don't breed.</p><p>He squirmed in my arms. I smiled at him. Jet-black hair and crystal blue eyes, plump where babies are supposed to be plump. (Enjoy society's acceptance of your body fat while it lasts, baby brother.) He had four teeth so far, and his lower lip was a waterfall of drool.</p><p>\"Why not put him in his seat?\" my husband asked, shaking out the Wall Street Journal like it was a beach blanket.</p><p>\"Because we're not going anywhere right this second.\"</p><p>\"Not yet!\" Jessica called from the cockpit. She took off her headphones-she thought they made her look cool, when I knew she was listening to the latest Shakira album-and headed toward us.</p><p>She plopped into the seat behind us and curled up like a cat. She was so small, she actually pulled it off.</p><p>\"So we're really doing this thing?\"</p><p>Sinclair looked around as if verifying the cockpit, the pilot, his papers, my magazines. \"It appears so.\"</p><p>\"Because, for the record? I think it's nuts. What happened to that poor girl wasn't your fault.\"</p><p>\"Sure,\" I said, shocked at how bitter I sounded. It felt like I was sucking on a psychic lemon. \"I'll blame the next-door neighbor's dog.\"</p><p>\"Not Muggles?\" Jessica gasped, which made me snicker in spite of myself. She could always do that. I was awfully glad she hadn't died.</p><p>\"Even if Elizabeth felt no sense of responsibility, bringing the body back is respectful.\"</p><p>And it lets you get a good look at the maybe-bad guys, doesn't it, hot stuff? But I kept that stuff to myself; it was pillow talk, and none of Jessica's business.</p><p>She probably knew, though. Sinclair would no more let an advantage like that slip (meeting a powerful force in neutral territory) than he would go outside without pants.</p><p>\"But I would like to add once again-\"</p><p>\"Oh, here we go.\"</p><p>\"I don't think you should accompany us, Jessica. It's likely to be dangerous.\"</p><p>Jessica waved her sticklike arms around. She could put an eye out with one of those things. \"Since Betsy came back from the dead, what isn't? Shit. I can't even go to the Mall of America without running into a sniper team.\"</p><p>\"You exaggerate.\"</p><p>\"Yes, but not by much.\"</p><p>Sinclair shrugged. \"As you like.\" He knew, as we all did, that it was Jessica's plane. And that she'd insist on coming even if it was his plane.</p><p>In some ways, and I know this sounds terrible, but in some ways it was almost bad that I'd cured her cancer. Now she was in the middle of this whole \"lust for life\" thing and was being more of a tagalong than usual.</p><p>I'd cured her by accident, which was terrific. But I'd also made her fearless by accident, which wasn't. There'd come a day-the law of averages demanded it-when I wouldn't be around to save her teeny butt.</p><p>\"You know, Sinclair's got a point,\" I began, knowing I was wasting my time (I had no actual breath to waste). \"Who knows what the reception's going to be like? There's still time to get off this crazy train and-\"</p><p>\"Taking off right about now, ma'am,\" Cooper called.</p><p>\"You did that on purpose,\" I muttered.</p><p>Up front, Cooper was doing his flight check while Jessica climbed out of her seat, walked to the front (the fore? The cabin? I was many things, but a pilot wasn't one of them), and took her seat next to Cooper.</p><p>She couldn't fly and only had a passing knowledge of the instruments Cooper used, but it was her plane. I figured someday she would summon the nerve to ask him to teach her.</p><p>Jessica's presence was less problematic for Cooper than for me, which is a horrible thing to say about a best friend. As I said, I'd cured her of a lethal blood disease, totally by accident.</p><p>But while the vampire in me had once cured her cancer, it had also attacked her. It had also ripped her boyfriend from her and leeched off her generous spirit.</p><p>Every time I looked at her I worried, and resolved to deserve her, and then worried again.</p><p>To distract myself I stood up, popped BabyJon into his car seat, made sure it was secured to the airplane seat, and then sat back down to buckle my own seat belt. Little brother stared out the window without making so much as a peep.</p><p>Wait. Buckle my seat belt? Should I bother? Could a plane crash even hurt me? I looked down at Eric's waistline and saw that he hadn't bothered.</p><p>Huh. Well. Old habits, you know?</p><p>\"Aren't you nervous?\" I asked.</p><p>\"Extremely.\"</p><p>\"I'm being serious.\"</p><p>\"Oh.\" The newspaper slowly came down. \"My pardon, dear one. Nervous about what? Facing down an unknown number of opponents as strong and fast as we are? Or surviving a plane flown by an Irish-man?\"</p><p>\"Nasty! What'd the Irish ever do to you?\"</p><p>\"Never mind,\" he muttered darkly. \"It was a long time ago.\"</p><p>\"Just focus on not dying, and we'll be fine.\"</p><p>He smiled and cupped my chin in his hand. In a second, our faces were only inches apart. \"I shall promise not to die, but only if you do so as well.\"</p><p>\"Deal,\" I murmured, having no idea what I was agreeing to. Being this close to Sinclair often had this effect on me.</p><p>\"Taking off now, ladies and gents,\" Cooper said, the party pooper.</p><p>Sinclair took his hand away and picked up the paper; I just stared at the ceiling. That was how we began the long taxi toward a place I had never been and didn't particularly want to go.</p><p>With a corpse somewhere under my feet.Mustn't forget that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 5</p><p>A few hours later, we were descending the stairs (except for Cooper, who stayed behind to do whatever it is pilots do after passengers exit) to the Logan Airport tarmac.</p><p>I winced when I saw Antonia's coffin brought out and carefully laid down.</p><p>For such a huge airport, I was surprised at how quiet Logan was . . . it seemed almost deserted. I figured that was because we were at the part where they parked the private planes.</p> <p>Three people were waiting for us on the tarmac, clustered around a vehicle that was a cross between a limo and a hearse.</p><p>I recognized them right away. Michael Wyndham, Pack leader (and, though this wasn't the time or place, so so cute, with golden brown hair and calm yellow eyes). His wife, Jeannie, a blonde with a head full of fluffy curls (must be hell in the humidity). And Derik, one of Michael's werewolves, also yummilicious with short-cropped yellow blond hair and green eyes. Was being gorgeous written into the werewolf genetic code?</p><p>Well, wait. Jeannie was human, though the others weren't. We'd met the week I got married (long, long story) and I'd gotten a bit of her history then. I guess, for Michael and Jeannie, it had been love at first sight.</p><p>As opposed to the loathe on first sight it had been for Sinclair and me. Ah, memories.</p><p>If nothing else, I hoped that my prior meeting with Jeannie might help smooth things over. The woman had helped me pick out my wedding gown, for heaven's sake. There was a bond there, dammit.</p> <p>I'd met Derik and Michael that same week, and though Michael gave off \"cool leader\" vibes, Derik was a ball of good-humored energy.</p><p>Usually.</p><p>We faced each other through a long, uncomfortable silence. Finally, I cleared my throat to say something when Derik walked over to the coffin and started to-</p><p>Oh, man. He wasn't. He wasn't. He . . . was. He was lifting the lid off.</p><p>\"I don't think that's a good idea,\" my husband said quietly, and I seized his hand and squeezed, which would have pulverized the bones in an ordinary human's hand, but would have as much effect on Sinclair as a mosquito bite.</p><p>He squeezed back, which hurt.</p> <p>\"Derik, Eric's right,\" Michael warned. Under the fluorescent lights, he was as pale as milk. They all were, actually. Poor, poor guys. I wasn't sure who I pitied more: the dead Antonia or the living Pack members.</p><p>\"I need to be sure,\" Derik insisted, and I winced again. The poor guy had pinned all his hopes on the chance that we'd gotten another werewolf mixed up with Antonia, which was so dumb I wanted to cry.</p><p>The lid was all the way up. Derik stared inside for a long moment and then, with infinite care, slowly lowered the lid.</p><p>Then he started to howl.</p><p>Chapter 6</p><p>We were all shocked, even his friends were shocked. Derik, normally a man of sunny temperament (at least from what I'd seen a few months back), was roaring like a rabid bear. Then he raised his fists over his head and brought them crashing down on the coffin lid, which instantly gave way.</p><p>Suddenly it was hard for me to swallow. Suddenly I wanted a drink in the worst way. Any drink. A smoothie, a frozen mudslide, blood, gasoline, Clorox, whatever.</p><p>Derik was glaring at me with eyes that were hard to look away from. \"You might have washed her face, at least.\"</p> <p>This was my evening for wincing, except this time it was almost a flinch. Because Derik was right . . . but then, was I wrong in trying to show respect for whatever rituals they had?</p><p>Jessica coughed and spoke up, attempting to save my ass. \"We, um, didn't want to offend you guys.\"</p><p>\"Offend?\" Derik spat. And in a flash, I remembered Antonia once telling me that her only real friend in the Pack was Derik. \"Offend?\"</p><p>Crash! More fist-sized holes in the lid, which he seemed determined to convert into thousands of velvet-tipped toothpicks. I took a step forward . . . only to feel Sinclair's hand close around my bicep and gently pull me back.</p><p>He was right, of course. This wasn't about me, and stomping into the middle of it would have been grossly inappropriate. And yet. And still. I couldn't stand seeing anyone-even a bare acquaintance-in so much pain.</p><p>My feet seemed determined to disobey my brain, because they took another slow step . . . and Sinclair tugged me back, not so gently this time.</p><p>\"You never should have gone!\" Derik was yelling into the coffin. \"You stupid bitch! You left your Pack!\"</p><p>Nobody said anything to that, big surprise. Because, again, it was the truth.</p><p>\"All right, that's enough,\" Michael said calmly. His copper-colored eyes looked almost orange in the fluorescents. \"Let's take her home, Derik.\"</p><p>So into the back Antonia went, the way back where there were no seat belts, because none were needed.</p><p>Jeannie drove; Michael sat beside her in the front. Derik sat across from us in the back. Looking through us, not at us.</p><p>No one said a word during the entire ninety-minute drive to Cape Cod.</p><p>Chapter 7</p><p>Jesus!\" I gasped, staring out the window. Sinclair flinched, but I was used to his twitches. \"This is where you live?\" I asked, feeling like I had straw in my hair and cow shit on my heels. All I needed were a few \"hyuk, hyuks!\" to complete the picture. \"You live here?\"</p><p>\"Yes,\" Michael said shortly as he drove to the main entrance. I pressed my face up against the window so hard my nose squashed. Thanks to no longer being addicted to oxygen, I didn't fog up the glass, at least.</p><p>It was a castle.</p><p>No, really. A castle. On Cape Cod! And I wasn't the only impressed yokel: both Jessica (who'd napped all the way here, like BabyJon) and Sinclair (who'd grown up on a farm a zillion years ago) were staring out their windows, too.</p><p>Gravel crunched beneath the wheels as we neared the castle of red bricks and red stones with about a zillion windows, set square in the middle of a huge field of green, with the Atlantic Ocean right behind it and stretching all the way into a gray forever. If it looked this magical at night, how, oh how, would it look during the day?</p><p>I promised myself I would find out. If you're going to get stuck with an eternal membership card of the undead, being the prophesied queen was the way to go. Not only did I wake up in the afternoon, instead of sunset, but I could go outside. I'd never burn up, not to mention worry about wrinkles and freckles. It was like getting your hand stamped at a club, only a zillion times cooler.</p><p>I realized I was still sitting in the car like a startled blond lump, and yanked on the door handle. I could hear the murmur of waves as I got out of the limo. Could smell the salt in the air, the sweetness of the grass field. Tilted my head back and looked at a sky of stars I had never seen before, dangling over the pure ocean.</p><p>I almost went into sensory overload, to be honest; it was a gorgeous night and, by God, it smelled gorgeous and I was absolutely loving my enhanced senses (which had not always been the case, believe me-don't even get me started on Marc's aftershave).</p><p>Until I got here, I hadn't known that gorgeous could be a smell.</p><p>\"It's late,\" Michael said curtly, striding up to the main doors with Jeannie almost in lockstep beside him. Sinclair was also abreast of them. (How did he do that, just fall into step right beside the biggest and strongest like he belonged there?)</p><p>So I tried to stop gaping and trotted after Jessica, who was trotting herself to keep up. I'd unhooked BabyJon's car seat and carried it with us, though it suddenly felt like it was full of several gold bars as I hurried and sniffed and looked around and kept my grip hard enough so that the seat didn't bang against my shins. Good Lord, I was really getting out of shape if a simple walk to a house . . . castle. . . . taxed my attention, not to mention my balance.</p><p>\"And we have a lot to talk about.\"</p><p>Eh? Oh, right. Michael was talking. I should absolutely be listening.</p><p>\"Gee, ya think?\" Jessica whispered to me. \"And here I thought we were here for the lobster.\"</p><p>I smothered a laugh, knowing that even if Antonia and Garrett weren't dead this was no time to get the giggles. We had a pretty scary itinerary and never mind the seafood jokes (though I wondered if I could eat clam chowder). Maybe it seemed weird for a vampire to fret or be stressed-this vampire, at least-but despite how it always looks in books and movies, whole weeks-months-could pass by without any life-or-death bullshit.</p><p>Not last week, though. I thought the early part of the week had bitten the big one, what with the Fiends going all, you know, fiendish, solving the murders, avoiding my own murder (something I was starting to get good at just from sheer repetition, and wasn't that the opposite of amusing), and being a helpless witness to a murder/suicide in my foyer. Okay, technically Jessica's foyer.</p><p>So Antonia was dead, Garrett had killed himself, but the fun wasn't over yet, which is why I was standing in front of the Atlantic Ocean instead of the Mississippi River.</p><p>Yeah, I figured we'd all earned about six years off-shoot, I was still a newlywed, I had a pile of thank-you notes yet to write-but the joke was on me, as it so often is, and all the tears and terror and bullets meant for me had only brought us to Wednesday. Now it was the weekend, and Sinclair and I had a fresh set of problems.</p><p>First and foremost, how big a mess was this? How much blame would fall on my friends and me, how much did we deserve . . . or need to dodge? Most important, what were the werewolves cloistered here going to do about it? About us? And how could I explain Antonia's former-Fiend boyfriend to werewolves, without going too far and screwing over my own people?</p><p>Had Antonia ever even told her Pack she'd been sleeping with a vampire? I should have known the answer to that. But Antonia had always made it clear that her phone calls with Michael were Pack business, and we all tried to respect her privacy.</p><p>Only to the werewolves, it would probably look like negligence, or carelessness.</p><p>I had never wanted a drink so badly in my life.</p><p>We followed Michael up red brick stairs and into a vestibule the size of a ballroom. I stared . . .</p><p>Sure, why not? You've been gaping like a tourist instead of an invited head of state. Which is just fine, because you'll never fool a real leader.</p><p>... while trying not to look like I was doing so. This place made our mansion on</p><p>Summit Avenue</p><p>-one of the prettiest, grandest, richest streets in the Midwest-look like a one-bedroom apartment in the warehouse district. Michael's castle . . .</p><p>Yep, now there's a real leader, so quit fakin', bacon.</p><p>... was lit up in a blaze of lights (mostly from the overhead chandeliers) and what little furniture I could see was mahogany. The place smelled like old wood and cedar, floor wax and furniture. It was the most impressive dwelling I'd ever seen, and I'd only seen a tenth of a fraction of it.</p><p>We climbed a grandly sweeping flight of stairs (Marble floors! Marble floors! Werewolves must not ever slip, or maybe they just hated vacuuming.), followed the Wyndhams down a wide hallway carpeted in red (not the red you might think, an orangey red, a dark pink-no, this was red red, a deep, rich, true red), and were soon in a room twice as big as my kitchen that was clearly Michael's office.</p><p>He probably filled out paperwork, or clipped coupons, or downloaded songs from iTunes when he wasn't ruling the world from behind the ginormous desk almost directly across from us. And excuse me, had I described the grand piano-sized, reddish brown, beautifully appointed, gleaming chunk of wood as a desk?</p><p>More fool me. The President of the U.S. sat behind a desk. Elementary school teachers sat behind desks. Prison wardens. Librarians. DMV employees. Desk sergeants. (Thus the name!) Reporters. Loan officers.</p><p>Those were desks. This thing was a wooden monument to Michael's status.</p><p>There were a few comfortable chairs scattered about, all dark wood with plush seats. Floor-to-ceiling bookshelves lined two of the walls; the other walls had windows and pictures and such. One framed portrait caught my eye-obviously old, but the people were familiar to me somehow, which was impossible.</p><p>I stepped closer and stared harder. No, I didn't know them. The man had lush dark hair and the woman had brown eyes-no, not brown, more golden than brown, more like-</p><p>More like Michael's.</p><p>Of course! The mater and pater of the Pack. Damn. Bet they'd known some good stories.</p><p>(Can you hear them, Elizabeth?)</p><p>I stifled a yelp of surprise and darted a look in Sinclair's direction. It was handy to be able to read your husband's mind, but that didn't mean I thought it was natural, normal, or not nerve-wracking. The fact that our telepathy tended to show only during extreme stress or excitement (making love, being murdered, trying to figure out if vampires have to pay property tax) told me something about Sinclair's state of mind.</p><p>My tall dark darling might come across as calm and reasonable, even a little bored, and yet he was worried enough (about me? the whole group? both?) to pop his question right into my head, where I heard it as easily as if he was using a megaphone.</p><p>(Elizabeth. Can you hear them?)</p><p>Oh, right, you're probably expecting an answer. I nodded. Sure I could. And I knew what Sinclair was getting at. There wasn't a soul to be seen, and the castle seemed almost deserted, but it wasn't. Not even close to deserted. We could hear them walking around and, even worse, standing still. I was-don't ask me how-sure they were listening to us. Believe me, I know how it sounds: We could hear them listening to us? Give me a break.</p><p>Except we absolutely could. And that was the scariest thing of all, knowing the castle was full of monsters who really would eat you, just like an ogre in a fairy tale.</p><p>My, Grandma, what big ears you have.</p><p>My worry for Jessica increased by a factor of about eight hundred . . . she had nothing in the way of enhanced paranormal senses, but that didn't mean she wasn't picking up on the tension. Boy oh boy, I hoped we'd be able to make friends with the ogres. Which is a sentence I never thought I'd have to think, much less articulate. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 8</p><p>\"Drinks?\" Jeannie asked, playing bartender. I was eyeing her hair with not a little admiration. Unlike mine, which at best could be coaxed to be wavy (I'd had a highlight touch-up and deep-conditioning treatment the week before I'd died; I might be a slavering ghoul of the undead, but I would never have graying split ends), hers was shoulder length, surfer blond, and curly . . . the kind that frizzed out in July, the kind that was a mass of soft spiral curls tonight. The rest of her was unexceptional.</p><p>Okay, that came out wrong . . . Jeannie Wyndham was a beautiful woman, admirably slim after two kids, casually dressed in jeans, loafers (Payless; ah, well, nobody's perfect), a soft blue chambray shirt, and a tan wool blazer.</p><p>When I described her as unexceptional, I meant in comparison to my surroundings: Michael's wife was the queen of everything I was staring at; it was all half hers. But you'd never know it to look at her; she had the brisk, understated demeanor of an experienced nurse.</p> <p>Except for the eyes, of course; she had the flat and calculating gaze of a sniper. I wondered where her gun was. This was more than idle curiosity; the last time I'd seen her she'd shot me. Three times, in the chest.</p><p>But later she'd helped me pick out the greatest dress in the history of human garments, so I didn't hold it against her anymore. Attempted murder is a fleeting moment, but the perfect wedding gown lasts forever.</p><p>\"Betsy? Drink?\"</p><p>Damn, I was really gonna have to pay better attention. I'd been so busy staring around the room and remembering point-blank chest wounds that I took the glass without looking and drained it.</p><p>And nearly barfed all over the beautiful Persian rug. I think it was Persian. It looked expensive and smelled old. Michael's great-great-great-great-grand-parents had probably hauled it all the way to Plymouth from the Mayflower, centuries after their great-great-great-great-grandparents had hauled it from the palace of Cyrus.</p> <p>How did I know Cyrus was one of the first rulers of the Persians, you ask? Hey. I don't always ignore my husband when he's prattling on about useless stuff.</p><p>\"Wwwrrllgg!\" I managed, wiping off what was dribbling down my disgusted chin. I forced what was left of the loathsome liquid down. \"What the hell is this, kerosene?\"</p><p>\"We're out of kerosene,\" Derik said with no trace of a smile. This was far from the Derik I'd met before, who had been all smiles, charming and sexy and nice.</p><p>\"I should have mentioned that my wife only likes drinks that come from a dirty blender,\" Sinclair said. He was sitting across from Michael, who was behind his desk. I was sitting next to him; Jessica was on my right. Jeannie, done with handing out glasses of regurgitate, was pacing back and forth behind us. Like I wasn't already nervous enough. \"I take it you didn't enjoy your first whiskey, dear one?\"</p><p>Yeah, about as much as a tax audit, jerkhead. Guess I wasn't as thirsty as I'd thought.</p><p>Sinclair nodded thoughtfully, his fist pressed under his nose to hide a smile. He hadn't been reading my mind as long as I'd been able to read his (it's a long story, and I come off kind of bad in it), so he was still in the wow-this-is-so-awesome stage, whereas I was at the fuck-you-I-have-no-privacy phase.</p> <p>I fumbled frantically in my purse, found a tin of Altoids, and dumped half of them in my mouth. I crunched them up like they were Rice Krispies, relishing the way the mint overpowered the yuck-o booze. Zow! The potent little buggers were really clearing out my sinuses; my eyes were all but watering. Which would have been a good trick, since my eyes don't water.</p><p>\"Let me begin by saying we appreciate you bringing Antonia home to us.\"</p><p>\"Nnnn prbm,\" I crunched, trying not to cough. Dammit! Probably shouldn't have dumped such a big mouthful into my gaping piehole. Probably shouldn't have done a lot of things this week.</p><p>\"It was no trouble, and the least we could do,\" Sinclair said, speaking as calmly and colorlessly as Michael while I crunched furiously. I wondered if that was the royal \"we.\" \"It was an honor to escort her back home.\"</p><p>\"My understanding is that she was shot several times in the head, protecting you,\" Michael said calmly. Calmly, but a muscle beside his eye twitched.</p><p>I tried not to stare, and failed. I gave serious thought to getting up and spitting my mashed Altoids into his spotless wastebasket, but just didn't dare. It seemed . . . what was the word Eric would use? Undiplomatic.</p><p>With a mighty effort, I swallowed the minty lump down, gagged briefly, and sneezed. Beside me, I could sense Sinclair rolling his eyes and either trying not to smirk, or thinking up an excuse for me. I'd deal with him later.</p><p>\"Yes, that's right,\" I replied with startlingly fresh breath. I managed to stifle the second sneeze. \"She saved me.\"</p> <p>\"Why?\"</p><p>Huh. That didn't seem very nice. My tongue ran away before I could stop it: \"Because she lost a bet?\"</p><p>There was a loud hissing sound, like everyone had gasped at the same time. I looked at my lap and muttered, \"Sorry. Too soon?\"</p><p>\"What could bullets have done to a vampire?\" Michael continued, unmoved by my terrific breath and sarcastic observations. And that was the $50,000 question. Because it was only recently that vampires realized werewolves existed, and vice versa. Michael probably assumed our vampirism was straight out of a bad horror movie. And who could blame him? I hadn't thought lead bullets would hurt a werewolf.</p><p>\"What would bullets in the brain do to anyone?\" Sinclair replied quietly, totally screwing up my assumption. \"There was no chance anyone could have regenerated.\"</p><p>Michael had tipped back in his chair and was staring at the ceiling. \"Mmmm.\" Then he had all four legs of his chair on the floor and met all our gazes.</p><p>Well. Almost all. His gaze kept skittering over the sleeping BabyJon. He hadn't asked one question about the baby, made one comment, not even a careless, \"Cute kid.\" And from what I'd heard, he was a devoted dad who loved ankle biters, nose miners, whatever.</p><p>But he wouldn't look at BabyJon. And that was very strange. So strange it was starting to make me nervous.</p><p>\"I hope the baby isn't bothering you,\" I said, to which Michael had no reply. Now he was locking gazes with Derik. It was like he hadn't even heard me-which was bullshit, given what I knew about werewolf hearing.</p><p>Why ignore an infant? To what purpose? And why was it making me so nervous?</p><p>I was rocking BabyJon's seat with my toe as he slept, trying to get a handle on my feelings. Hey, it wasn't like I had to worry about bad breath at the moment. Quite the opposite, in fact. And sure, this was a stressful scene, but they had all seemed nice enough when I'd met them earlier.</p><p>After all, we could have gotten a much nastier reception. Much nastier. But nobody had so much as waved a crucifix in our direction. No one had attacked us yet, to be sure. So why was I practically shaking?</p><p>Sinclair was frowning at me picking up my nervousness, but not the cause. All I could do was lift my left shoulder in a tiny shrug, the international \"tell you later\" gesture.</p><p>Besides, I had other things to focus on. Derik, for instance. He'd been so different when he'd come to the mansion looking for Antonia a couple months back. Friendly and charming and funny and sooo cute . . . though I usually didn't go for blonds.</p><p>In fact, the only time he'd gotten upset was when he followed me to BabyJon's nursery and-and-</p><p>I could almost hear the click as the reason behind my sudden nervousness clunked home: Derik kept giving BabyJon a wide berth, and Michael didn't even seem to see him. Which was impossible; you couldn't hide a twenty-pound infant surrounded by a pastel car seat, not when it was right out on the floor and smelling like formula and stale powder.</p><p>Now that I thought about it, Jeannie was the only one who had acknowledged BabyJon; she had stroked his feathery black hair once we had him buckled in the limo, and complimented me on his good looks. I wasn't sure if I could take the credit for those or not, so I'd just nodded.</p><p>But Derik . . . Derik had followed me to the nursery once, taken one look at the baby, and nearly broken his neck on the stairs while trying to achieve distance. There was so much other shit going on at the time, I'd completely forgotten about it until now.</p><p>I dared not forget again . . . something was wrong with this baby. Or with any werewolf who came in contact with him.</p><p>And I didn't like that. At all.</p><p>Now Derik and Jeannie were pacing behind us, which was just as nerve-wracking as it sounds. But whenever Derik got near BabyJon, he would veer off. And Michael, as I said, couldn't see him at all.</p><p>And they weren't even aware of it. Derik could have been avoiding a mud puddle for all the emotion he showed, and Michael, who could and did hold everyone's gaze in the way only an alpha Werewolf could, wasn't looking at BabyJon.</p><p>All of a sudden, I had a brand-new problem dumped in my lap. Just what I needed. I'd have rather had a new pair of Prada pumps dumped on me.</p><p>Chapter 9</p><p>Why did I seize so quickly on the possibility that BabyJon was special? Well, consider our sister, Laura, who was still back in Minnesota but still very much in my thoughts as I whispered super-minty breath across the mahogany expanse that separated me from the alpha male of Antonia's werewolf Pack.</p><p>Laura, an impossibly beautiful, naive, and sweet blonde, was raised by a minister and his wife, which partially explained why she was currently a tireless worker for charities, as well as a cheerful and frequent Goodwill volunteer.</p><p>Laura worked in soup kitchens and went to church on Sundays. She stuck twenty-dollar bills into red Salvation Army buckets at Christmastime (and Laura was far from rich; her folks made less in one year than Sinclair made in a month). In February she had literally given the shirt (well, the coat) off her back to someone down on her luck.</p><p>Sickening? Okay. Yes. A little. But still, it all made perfect sense. How else could someone rebel against their parent? Laura fought back by being sweet and kind. Mostly sweet. Although she had a spectacular temper.</p><p>Also, her birth mother (not the minister's wife) was the devil. Yes. The devil. As in Satan. As in Lucifer. As in a woman who looked weirdly like Lena Olin, except with better footgear. Either Satanic influence or Lena Olin's terrific fashion sense had endowed Laura with supernatural abilities-of course! She was half angel, right? Lucifer's lineage hadn't changed when he/she was tossed out of heaven.</p><p>And I was beginning to suspect BabyJon had powers, too. Not that we could confirm this by asking Lena-Satan-after possessing the birth mother long enough to experience breast-feeding and stretch marks, she had fled for the easier comforts of hell. The minister and his wife who adopted Laura had been the best thing to happen to her, and kept her diabolic lineage in check.</p><p>So who will keep, I wondered, my half brother in check, if he inherits anything unusual? Me? It was the only thing that made sense in an increasingly complicated family history.</p><p>(I have a point. I promise.)</p><p>Okay, I can see how some of this-most of this-could be confusing. Shit, it's my life and even I get mixed up sometimes. So. The Cliffs Notes version: the devil possessed my stepmother, the Ant, because she wanted to try the whole giving birth and raising a kid thing. My stepmother, the late Antonia Taylor (I know, I know . . . two Antonias? Both dead? What were the odds on something like that?) was so unrelievedly nasty, no one had any idea she was possessed.</p><p>Think about that for a minute. My stepmother was so horrible and nasty on a daily basis that no one noticed when she was possessed by the devil for almost a year.</p><p>I know! It boggles my mind, too.</p><p>Anyway, the devil had hated labor and delivery, not to mention breast-feeding and stretch marks, and fled my stepmother's body to get the hell back to hell.</p><p>When my stepmother realized that someone else had been running her body for almost a year (remember: nobody even noticed!), she promptly gave the baby up for adoption.</p><p>And didn't tell my father about it. Hey, the couple that lies together (no pun intended) stays together. Or however that saying went.</p><p>Only the Ant knew my dad had fathered Laura, which is why she and I didn't meet until two decades later. My late father, who I'd always thought of as a colorless coward, had fathered the Beloved of the Morningstar (in other words, the Antichrist) and a vampire queen.</p><p>God help us if it turned out I had another half brother lurking out in the world somewhere; maybe he was the reincarnation of Attila the Hun. Maybe I should have talked Dad into having some of his sperm frozen.</p><p>Yuck. Time to get off the subject of my father's sperm.</p><p>Anyway, back to BabyJon. Now I was wondering-maybe it was silly . . . vampire queen or no, this stuff really wasn't my field-maybe my stepmother's body had retained some leftover magic from her days of possession. And maybe that had had a profound effect on her late-in-life baby.</p><p>Shoot, the poor kid had been conceived purely out of spite. The Ant had not liked it at all when her spoiled bimbo stepdaughter returned from the dead, and tried to pull her husband's attention back to his second family with the age-old trick: she'd gotten pregnant to jazz up her marriage.</p><p>Michael was still talking. Jeannie and Derik were still pacing. Sinclair's face was serene and composed, but he kept glancing at me and I knew he knew I wasn't paying attention. Well, who could right now?</p><p>Besides, Sinclair would give me the scoop on anything I needed to know when we were alone. Meanwhile I, the Daphne of the Undead, had a mystery to solve.</p><p>I carefully nudged the car seat with the toe of my left shoe, forcing it farther away from the desk and toward the middle of the floor.</p><p>Again, Derik veered. He didn't look down. He didn't frown at the baby, or at me. He just kept giving the sleeping BabyJon a wide berth. And it looked like Jeannie hadn't noticed the phenomenon, which didn't surprise me. She'd just lost a family member; her mind was definitely on other things.</p><p>Hmmmm.</p><p>\"-know when the service will be,\" Michael was saying.</p><p>I was instantly diverted. Ah ha! Now we would find out the secret of werewolf funeral rituals. Did they burn the body on a pyre? Loft it into the ocean? Cremate it and scatter the ashes over sacred moss? Bury her while in wolf form with some yowling ritual under the yellow glow of a full moon? Preserve her in spice-soaked cocoon wrappings underground, like mummies?</p><p>Everyone was staring at me, and I would have died if I hadn't already. I hate when I think I'm thinking something only to find out I've been saying it out loud.</p><p>\"Pyres?\" Michael asked. \"Yowling ritual?\"</p><p>\"Oh, fuck me twice,\" Derik said, throwing his hands in the air. \"Did you really think we were going to bury Antonia in the woods like she was a dog treat?\"</p><p>\"Well, how'm I supposed to know what you're going to do?\" I snapped back as I leaned over and pulled BabyJon's car seat closer. \"That's why we're here. To do things your way. Ow!\" Sinclair had kicked me none too gently in the ankle. I glared at him, then returned my attention to Derik. \"Sorry. Muscle spasm.\"</p><p>\"Mummies,\" Derik was muttering. \"Funeral pyres. Burial at sea? Antonia was Presbyterian, morons.\"</p><p>How anticlimactic.</p><p>\"You may call me whatever you wish,\" my husband was saying in a voice more smoke than sound. \"But do not insult my wife and queen.\"</p><p>\"Well, which is it?\" Jeannie asked. I heard the clinking rattle of more ice as she filled her glass with something. Her tone was okay; she didn't sound mean or anything. Sort of half-teasing/half-curious. \"Are you here wearing your wife hat or your queen hat?\"</p><p>Huh. Hope they had a few hours to kill, because it was a long story. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 10</p><p>Dear Future-Self Dude,</p><p>Fifteen minutes ago I nearly experienced the heartbreak of fecal incontinence. I was in the kitchen, staring glumly at the near-bare refrigerator shelves and wondering if I had time to swing by Cub Foods before my shift started.</p><p>Living with vampires and the Antichrist isn't the constant fun and games you must imagine. To begin, I don't technically live with Laura; she's a student at the U of M and has a place of her own in Dinkytown (That's what we called the small batch of apartment buildings and restaurants near the U of M. After I gave this some thought, it made perfect sense that the Antichrist lived in Dinkytown. She was probably right down the block from a Cinnabon chain, too. As Jim Gaffigan said, \"Tell me that place isn't run by Satan.\").</p> <p>Anyway, Laura has her own place and I imagine she eats most of her meals there. And since she's alive, she buys food. Which she keeps in her fridge.</p><p>Our fridge, nearly big enough to use in a restaurant, is not so lucky. Today its contents revealed four bottles of Diet Peach Snapple (as a doctor, I never touched Diet anything . . . why not just drink gasoline and be done with it?), a carton of strawberries (which, as they were not in season, tasted like tiny, fuzzy raw potatoes), two pints of cream, half a box of Godiva truffles (I knew, without looking, that Betsy had already scored the raspberry ones, pureeing them with milk in one of the six blenders), an open box of baking soda that was not doing its job to defunk the fridge, fourteen bottles of water, a near-empty bottle of Thousand Island dressing, a cellophane-wrapped chunk of parmesan cheese so hard it could be used successfully as a blunt instrument, an unopened jar of lemon curd (whatever the hell that was), two cans of Diet Coke (Jessica was addicted to it; why is it that the chronically underweight were drawn to drink diet soda? And am I the only one to notice someone who drank seven cans a day ended up with cancer?), and something foul lurking beneath the tin foil on a paper plate . . . I just wasn't up to exploring (I didn't even know we had paper plates), so I let it be.</p><p>This is what comes of living with vampires and a woman who seemed to consume nothing but salads and Diet Coke. Unlike the community fridge, the freezer was full, but still weird. It fairly bulged with bottles of a vodka brand I'd never heard of-Zyr-in various flavors. The flavors were alphabetized. The bottles were perfectly lined up; they were like cloudy glass soldiers at attention.</p><p>As these were typical contents of the mansion's kitchen freezer, I knew some of the flavors lurking in the back were lime, juniper, peppercorn, espresso, fennel, mint, garlic, cherry, sun-dried tomato, mustard seed, apple, and horseradish.</p><p>Dude, I am not making this up, or exaggerating for humorous effect. In a household of oddities and the undead, Tina was everywhere and nowhere. She excelled at going unnoticed and she could pull that off anywhere in the world . . . except our kitchen freezer. Vodka was her vice; the more obscure the flavor, the more she had to try it. She drank it neat, using a succession of antique shot glasses, which were always kept chilled.</p> <p>Tina had offered to make me a drink once. I had accepted. Once.</p><p>I did not have time to swing by Cub on the way to work and would be too tired after my shift; time to order pizza again. Green Mill was practically on my speed dial.</p><p>Sighing, I swung the freezer shut and my senses, instantly overwhelmed by someone they hadn't smelled, seen, or heard, but who was all of a sudden right there, went into overdrive. My adrenal gland dumped a gallon of F.O.F. into my system (what my interns called Fight or Flight juice) and for a long minute I thought my heart was going to just quit from the shock.</p><p>She greeted me with \"I am out of cinnamon vodka,\" then grabbed my shoulder and prevented me from braining myself on the metal handle as I flinched hard enough to be mistaken for an epileptic.</p><p>\"Tina,\" I groaned, yanking my hand out of her chilly grasp, \"that's the second time today. I'm putting a bell around your neck. Or sewing one into your scalp, I swear to-\" No, don't swear to God; just hearing the G word was like a whiplash to a vampire, the movies had gotten some things right. \"I swear,\" I finished.</p><p>Tina looked mildly distressed. Most of her expressions were mild versions of what humanity could come up with. What would put you or me in a killing rage would cause her to raise one eyebrow and frown. Frown sternly, but still.</p> <p>The smooth efficiency and profound, almost unshakable calm were at odds with her appearance. Tina looked like an escapee from Delta Nu, the sorority Reese Witherspoon's character made famous in Legally Blonde. (Great movie, dude. \"All those opposed to chafing, please say aye.\")</p><p>Tina had long, honey blond hair-past her shoulders in rippling waves-and big, dark eyes, what Tina called pansy eyes. Not only did Tina look too young to vote, she would probably get carded if she tried to buy cigarettes. And she dressed to play up her appearance in a never-ending variety of kicky plaid skirts, white button-downs, anklets, everything but a backpack full of high school textbooks. She looked like a walking, talking felony. One far older and smarter than any would-be college boy who might try out a little date rape.</p><p>Also, she was about as noisy as an unplugged television. If you don't believe that, dude, you couldn't feel my heart just now.</p><p>\"I apologize, Marc. I honestly don't mean to frighten you.\" This was true, and scary in its own way-I hated to think what she could do to my nervous system if she really put some thought into it. \"We're just two peas rattling around in a can 'round here, aren't we?\"</p><p>She laughed a little and I noticed she had slipped again. Most of the time, Tina had the smooth, accent-free tones of a weather reporter. But occasionally a Southern accent would creep in. I loved it when that happened because she seemed less a smooth-voiced butler and more like a walking, talking, feeling person.</p><p>Don't misunderstand; I have no problem with the undead, although I was dying to learn all I could and trying to work up the nerve to ask Betsy if I could autopsy the next Big Bad she would inadvertently kill with a heretofore unknown superpower. Nope; no real problem with them, I just thought they should get back to their roots a bit more often.</p><p>Besides, Tina made me nervous.</p><p>And she knew she made me nervous. This was nothing I could discuss with Betsy, of course . . . my feelings were too vague and unformed and frankly, my best gal wasn't what I would ever call a deep thinker. As Susan Sarandon said in the greatest movie in the history of cinema, Bull Durham, \"The world is made for people who aren't cursed with self-awareness.\" The world was made, in other words, for people like Betsy.</p> <p>She had no time for \"Hmm, Tina's a quiet one, huh? Perhaps we should ponder what that signifies,\" particularly during the fall when she had to update her collection of winter footgear. But it was there and I couldn't deny it: Tina gave me the creeps.</p><p>I knew she had been born the year the Civil War had begun.</p><p>I knew she had been a vampire long before Sinclair.</p><p>I knew she had made Sinclair, had remained by his side all the years since then, and was his capable assistant.</p><p>And that was all I knew about her. And I only knew those things because Betsy had told me. In other words, that was all Betsy knew about her, too. And she was the queen, for the love of . . .</p><p>Dude, there are all sorts of etiquette rules for living with vampires. There had to be; there was etiquette for everything. But it was hard to come up with a tactful way to ask, \"So, how'd you get murdered, anyway?\" And that was only one of the things I would love to learn.</p><p>All this went through my head in about eleven seconds. Meanwhile, Tina was still lurking-well, standing-by the fridge.</p><p>\"Will you have a drink with me?\" She opened the freezer and reached for the first row of bottles. I saw she had extracted mustard seed-flavored vodka and, thanks to years of seeing man's inhumanity to man via the emergency room, I manfully concealed my shudder.</p><p>\"I have to get to work,\" I said glumly.</p><p>Curious, I waited a beat, but Tina did exactly what I anticipated. \"Oh, that's too bad, Marc. A pity you won't have time to shop first.\"</p><p>Dude, if I had been Sinclair or Betsy, her answer would have been something like, \"Oh most wondrous undead monarch, please give me, your humblest, lamest, most slovenly servant, your grocery list and I shall fill your fridge with any produce, meat by-products, Little Debbie snack cakes, and dairy products you desire and also pick up your dry cleaning on my way home, unless you would prefer I simply run out to KFC for some original recipe chicken.\"</p><p>Alas, it was not to be: not only was I alive and well, I was neither the vampire queen nor the vampire king. Tina was their willing and untiring slave, not mine.</p><p>Still, we were roommates. You would think that would lead to some kind of bond. The Sacred Roommate Bond. Would it kill her to bring home a gallon of milk once in a while?</p><p>Chapter 11</p><p>The words wife or queen seemed almost to hang in the air over our heads. I had the sense that they weren't asking these questions out of idle curiosity, or to be polite. No, no. Michael was a predator, of course, as Antonia had been, which meant he was constantly on the lookout for weakness. He couldn't help it. Probably he didn't even know he was doing it.</p><p>Wife or queen? A question I had asked myself on more than one occasion. Sinclair was bigger, stronger, faster. Older. Richer. Better educated. More even-tempered, more in control. Frankly, there were times-lots of times-when I wished I could just be the wife, and leave the whole vamp royalty thing to him.</p><p>But I could do things no other vampire on the planet could. Seemed dumb not to take advantage of that, or at least acknowledge it. So we existed in an interesting state of love and respect.</p><p>Well, occasional respect, when I wasn't giving him a Wet Willy or poking him in his flat belly when we showered together-the man wasn't ticklish! Talk about an unnatural creature.</p><p>He'd bowed to my authority on more than one occasion, too-usually just before I started hurling heavy objects at his head to emphasize whatever point I was making. You want to see something funny? Eric Sinclair, following one of my orders. Believe me, it didn't happen all that often. Whenever it did, he always had an odd expression on his face: part admiration, part annoyance.</p><p>Now where the hell was I? Dammit! It was three A.M., I was tired out from being on edge all night, and was having more trouble than usual following the conversation, which had veered from funeral rights to religion to atheist vampires to my title.</p><p>\"Funny thing for you to ask, Jeannie,\" I finally said. I guess it wasn't exactly unheard of for a werewolf to marry a-you know, a regular person. But it was rare enough so that the two of them caused a stir now and again-I'd gotten that much from Antonia, and that only after she'd been living with us for a while.</p><p>Get this: not only was it rare for werewolves to marry boring old humans, it was considered super-lucky for the Pack, and the offspring were usually exceptional Pack members. For example, Antonia-</p><p>But I wasn't ready to go there again. Call me a chickenshit coward; that's fine. I just couldn't do it again right now.</p><p>\"Mmm.\" Jeannie grinned, but didn't rise to the bait, just shrugged. \"Good point.\"</p><p>I cleared my throat, because I was having trouble swallowing the whole-the whole mundaneness of the thing. Mundaneness? Mundanity? \"So there are Presbyterian werewolves, and Catholic ones, and Lutherans-\"</p><p>\"And Buddhists and atheists and Hindus,\" Derik added.</p><p>\"Will you please stop that pacing and sit the fuck down? Ow!\" I yanked my poor sore ankle out of reach of Sinclair's foot. \"You look like a cheetah on crack.\"</p><p>\"Back off, blondie,\" Derik snapped back and, if anything, sped up the pacing.</p><p>\"I'm surprised you didn't draw your own conclusion,\" Michael said loudly, clearly trying to distract us. I think he was clearly trying. It was hard to know what the guy was up to. \"Because clearly, all vampires are Christians.\"</p><p>\"No,\" Sinclair said.</p><p>No? What, no? How did we get off the topic of werewolf retribution for Antonia and on to religion? I got enough of the \"let's all pray to Jesus meek and mild\" stuff I needed from Laura.</p><p>\"No?\"</p><p>\"No. We, too, have Muslims and Catholics and pagans. We, too, have-\"</p><p>\"Whoa, whoa, whoa,\" Jeannie interrupted. \"That makes no sense at all.\"</p><p>\"We do not go about our lives with the objective of making sense to strangers,\" my husband said with terrifying pleasantness.</p><p>\"Fuck.\" Derik, thank God, had grabbed a chair, dragged it over, turned it so it was facing backward, and sat. His blond hair fell into his eyes and he shook it out of his face with a quick, impatient movement. \"Why would a cross work on an atheist vampire?\"</p><p>Sinclair and I traded a glance. Jessica, I noticed, was all ears as well-she'd been so quiet I'd almost forgotten she was in the room.</p><p>\"Or someone Jewish?\" Derik continued.</p><p>Because vampirism was a virus.A virus that was very hard to catch, and even harder to pass on. This was Marc's theory, backed up by Tina and Sinclair-again, not all of a sudden. After months and months and months. Tina and Sinclair couldn't be much more tight-mouthed if someone sewed their lips shut with ultralite fishing line.</p><p>Vampirism, as a virus, slowed your metabolism waaaaay down, but didn't stop it. Good points: you no longer sweated, or peed. Aging seemed to stop altogether. You were faster, stronger. Heightened senses. Blah-blah.</p><p>Bad points: vampires were highly susceptible to suggestion. (All of them-modest cough-except me.) Tina, my husband's right-hand woman (she had been the one to turn him into a vampire in the early part of the twentieth century . . . yup, I was in love and regularly boinking a man old enough to be my grandfather), had eventually advanced this theory with Marc.</p><p>Marc went into MD mode and had tentatively concurred (on the grounds that he could change his mind if further proof emerged) that yes, it was a virus, and yes, a Jewish vampire would cringe away from a cross. Because we all know that's what vampires do. They are vampires; ergo, crosses and holy water can hurt them.</p><p>I know, sounds stupid, right? Give it a minute. If you catch a disease that makes you highly suggestible, and you have the weight of a zillion horror movies telling you holy water burns . . . then holy water burns.</p><p>But we were getting off the point.</p><p>And it was driving me so nuts, I was practically biting the tip of my tongue off so I wouldn't point out that Derik had made the same silly assumptions about vampires that we had about werewolves. After calling us morons.</p><p>\"-explain what happened?\"</p><p>Eh? Aw, shit. Michael was looking right at me. I jerked my foot away in time and Sinclair's Kenneth Cole-shod shoe clunked into the back of Michael's desk.</p><p>\"Explain what happened?\" I repeated with what I hoped was an intelligent question on my face.</p><p>\"Yes, to the Council.\"</p><p>Council? What council? That didn't sound good at all. Nobody had said anything about a council-I think. Damn. I really should be paying attention to the goings-on in my life. \"Can't you tell them what happened? You're the boss around here.\"</p><p>\"No.\" Click. Closed. End of argument. I knew that tone-I'd heard it in my husband's voice often enough-to know when it was no good to protest. \"We'll be meeting on the grounds just after sunset tomorrow. I'll need all of your testimonies, so do not send one representative to speak for the group.</p><p>\"Then what?\" I asked nervously.</p><p>He just looked at me, almost like he was sorry for me.</p><p>Somehow, that was even worse than his cool fury. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 12</p><p>Dude,</p><p>Here I am again, shift over (and I managed to leave the hospital on time, a miracle of parting-the-Red-Sea proportion), writing the day after Betsy and the others flew away to Cape Cod to face whatever music there was to face. I'd asked to go and had been gently refused. Jessica got to go, but then, it was her airplane.</p><p>That left Tina-as I mentioned earlier, she was a sort of super-secretary to Sinclair-and Laura and me.</p> <p>I didn't have a chance to go into Laura much before I had to leave for work (and grocery shopping). Now I've got some time and, as it's daytime, Tina won't be lurking in a shadowy corner of the kitchen, waiting to startle me to death and then smoothly apologizing.</p><p>So. Laura. A word or two about her, yes, please. Very, very nice girl. Young . . . not even drinking age. She studied hard at the U of M and was a credit to her parents. Excellent health, and conventionally beautiful if you liked slender, fair-skinned blondes with terrific breasts, long legs, and big blue eyes.</p><p>She was also occasionally homicidal and cursed (or was it more of an inheritance?) with an unbelievably bad temper. When she's upset about something, you can practically feel the air get heavier and warmer. One thing I hated to see was Laura's hair shading from buttercup yellow to auburn, as it always did when she was infuriated.</p><p>According to the Book of the Dead, a sort of vampire bible, Laura is fated to destroy us all, something Betsy seems to keep overlooking or forgetting. Or forgetting on purpose (she's not quite the ditz she'd like us to believe . . . at least I think she isn't).</p><p>A digression for a minute: the Book of the Dead was kept in the mansion's library, on its own stand. Betsy didn't talk about it much, but she practically babbled about it nonstop compared to how much Tina and Sinclair discussed it. So you can imagine how frustrating it was to just get a minor detail or two about the vampire bible.</p> <p>It was bound in human skin, and written in blood by a crazy vampire a thousand years ago. Everything in it (so far) came true. And (here comes the fun part!) anyone who read it too long went clinically insane. Scariest of all, Betsy had tried to destroy it-twice-and it always found its way back to her.</p><p>I wasn't dumb enough to try to read it, but I did want a look at it. I waited for a night when I had the mansion to myself (Betsy and the others were off trying to catch a serial killer-or maybe it was the time that crooked cop set the Fiends free? Who could keep track of their nocturnal crime-fighting habits? Well, it doesn't matter now.), then went into the library.</p><p>I didn't sneak. I live here, too. I was not sneaking, nor being a sneak. I walked. I walked right up to the stand. I reached out a hand. I wasn't going to read it. I wasn't. I just wanted to-</p><p>Wait.</p><p>Okay, I'm back. I had to take a second and go throw up. Which is what I did those few months ago when I grasped the cover to flip the book open. I didn't even get a good look at the title page, never mind the table of contents, before I started vomiting blood.</p><p>As a doctor, I found this to be a somewhat alarming symptom, especially since I had felt perfectly fine ten seconds earlier. I made it to the nearest bathroom-thank goodness the mansion's got about thirty of them!-and, between bouts, called my friend Marty (part-time EMT, full-time guy who could keep his mouth shut) for a ride to the hospital.</p> <p>By the time he got me there, I was fine again. His backseat was a mess, though. It cost me six hundred bucks to get it clean again.</p><p>Sorry, dude, that was a major digression, not a minor one. So that's enough about the vampire bible, which I now prudently stay the holy hell away from; let's get back to Laura.</p><p>It's hard to believe that a gorgeous sweet Norwegian is the Antichrist. And even harder to imagine her destroying a cactus plant, much less the entire world. When she's blond, anyway.</p><p>When Betsy and Laura first hooked up, we had no idea she even had a dark side (which was silly . . . don't we all?). Then she killed a serial killer. And then she beat a vampire almost to death. More worrisome was the fact that she could have done much, much worse. Because Laura's weapons pop out of nowhere when she's mad, and they show up express delivery from hell.</p><p>And lately she's been skipping church. She'd already been over here twice, and Betsy hasn't been out of the state even twenty-four hours. I think she's lonesome. Scratch that-I was familiar with all the symptoms. I knew Laura was lonesome.</p><p>I also knew she was extremely dangerous. But I know better than to try to open a dialogue with her about the subject. Laura hated her birthright, her heritage, her mother. Hated knowing someone had predicted she'd destroy the world almost a thousand years before she was born. I was pretty sure she hated the fact that we all knew about it, too.</p><p>So. Tonight we're going out for drinks, and I'll tease her and we'll gossip about Betsy and Co. at the nearest smoothie bar and then Laura will be herself again.</p><p>For a while.</p> <p>Chapter 13</p><p>The last thing we did before going to bed was set up Sinclair's laptop-</p><p>Right, Sinclair, I forgot to explain that. I hardly ever call him Eric. He's always been Sinclair to me (or Sink Lair, when he's really pissing me off), just as I have always been Elizabeth (yech!) to him. I still can't believe my mother stuck me with a first name like Elizabeth when my last name was Taylor. What, did she lose a bet?</p><p>Anyway, I was Betsy to everyone except the man I loved.</p><p>And speaking of the man I loved, he was rapidly typing something, probably an update e-mail to Tina. Then he showed me one of Marc's typically annoying e-mails, which went like this:</p><p>Hey, girrrrl! miss you guys already, i mean WTF? Hope the furry friends haven't eaten any of you yet, LOL! love, marc</p><p>Oh, boy. Don't even get me started.</p><p>Too late, I'm starting. What the hell was it about e-mail that made everybody forget the stuff they learned in second grade, like capitalizing I and proper names, and using periods? Hello? We all learned how to do this less than five years out of diapers!</p><p>And what was with all the increasingly stupid acronyms? Nobody with any sense would dare send out a snail-mail letter written in that odd, juvenile style. No one would send a business letter written like that. But I've seen executive VPs send out e-mails riddled with spelling and punctuation errors and LOLs.</p><p>Somehow, when I wasn't looking, somehow because it's electronic mail, none of the basic grammar rules applied.</p><p>Barf.</p><p>Sinclair obligingly vacated the desk chair for me. I plopped into it and kicked off my pumps. However the werewolves might feel about us, they were pretty good hosts so far. This was the most beautiful bedroom I'd ever seen. No, not bedroom . . . suite. A sitting room. An office. A teeny kitchen. Two bathrooms. A living room with a piano in the corner. A freaking piano, who lives like this? And a bed so gigantic I felt as small as a saltine cracker when I lay on it.</p><p>I clicked on REPLY and rapidly typed.</p><p>Marc, you nitwit, how many times do I have to tell you, enough with the acronyms. I'm assuming since you made it through college and medical school that sometime before you left for college someone mentioned a cool new invention: punctuation. Try it sometime. You might like it.</p><p>Clicked on SEND. Stretched in the chair like a cat, then got up and ambled over to my husband, who held his arms out to me. He was smiling his sexy, somehow sweet smile and I could see the light glinting off his fangs, teeth so sharp they made a rattlesnake seem like it had a mouthful of rubber bands.</p><p>I grinned back, kicked out of my clothes, and pulled the sheet back. As my husband's fangs sank into my neck and things began to go dark and sweet around the edges of my brain, I had a thought: What about werewolf hearing? Shit on that, how about their sense of smell, which was even better than a vampire's? Even if they couldn't hear us, they could sure tell what we were doing.</p><p>Then Eric's fingers were gently parting my thighs and stroking me in that luscious, insistent way he knew I loved, and I forgot all about werewolf hearing. Hell, I'd be lucky if I didn't forget my own name.</p><p>Chapter 14</p><p>Dude!</p><p>You will not believe this. I was there, and I almost don't believe it. And there's no way to pretty this up, so I'm just going to spell it straight out: a group of Satan worshippers found Laura.</p><p>Yes! And yes, I know how it sounds! But it's all true; my God, I can hardly type I'm so excited/freaked out/ amazed.</p><p>Okay, so this is what happened. Laura called and asked if she could hang out at the mansion, and of course I said yes. It was daytime, so Tina was snoring away somewhere (not that she snored, or even breathed, but you know what I mean). So into the mansion I come, only to be greeted by a scene out of-of-shit, I have no frame of reference for this.</p><p>Real Satanists had apparently tracked Laura down via astrology (not my field, so much of the explanation I got later went right over my head). Apparently, just as there was a star of Bethlehem, there is also a Morningstar, which shows up just before the Antichrist comes into her maturity.</p><p>Seriously, dude, I know how it sounds. A star? Laura's own star, shining down on the planet like a treasure map leading Satanists to our door? (And why not her apartment? Why Betsy's place?) A star that didn't show until her maturity, what the hell did that mean? The star didn't show itself until she had a driver's license? A passport? Until she was legal drinking age? What?</p><p>Laura either didn't know, or wasn't saying, pardon me while I evince a complete lack of surprise. And I suppose it doesn't matter. What matters is the star is here (I plan to dip into my savings first thing tomorrow and buy a decent telescope to set up in the yard . . . I simply have to see this puppy for myself) and people who have read the right books and worshipped the right demon and made the right sacrifices (I'm guessing on that last one, but the movies can't be all wrong, right? Memo to me: Netflix Rosemary's Baby.).</p><p>Anyway, the right people can now track Laura down pretty much at will.</p><p>Which is why, when I walked into the house after a milk run, I nearly tripped over the dozen people kneeling in front of Laura, who was blushing like a tomato. A demonic tomato. I was instantly alarmed; she was so fire-hydrant red, so incredibly flushed, I was afraid she was going to stroke out, and I almost dropped the milk.</p><p>They had (not on purpose, I'm sure of that) backed Laura into a corner of the kitchen and were moaning and praying.</p><p>Yeah. Praying. Praying to Laura.</p><p>I don't know what I should do with this information, not to mention the stuff that happened afterward. Betsy has enough on her plate these days. And it wasn't like Laura had killed anybody.</p><p>In fact, the way she handled it was nothing short of hilarious. She-</p><p>Wait. She's calling me from the hallway. More later, dude. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 15</p><p>When I next opened my eyes, it was, according to the grandfather clock bonging away at the other end of our suite, four o'clock. Our bedroom was utterly gloomy, thanks to all the heavy curtains, so I stretched and sat up, swung my legs over the bed, and thought about what to do.</p><p>Sinclair was still-ha, ha-dead to the world beside me. He was on his side, one arm flung out, palm up. His normally pin-neat hair was a ruffled dark mass; his lips were slightly parted.</p><p>I watched his chest for a long time . . . three minutes, almost. I think it rose once. But he felt like living flesh; he was warm (we're speaking comparably, of course). He wasn't a corpse, he wasn't dead. He wasn't alive, either.</p> <p>Undead.</p><p>Stupid word, I've always hated that word.</p><p>This was the part of every day when I deeply pitied my husband, and I would never tell him. Sinclair needed me for several things-pity wasn't one of them. He didn't have to sleep all day, and he could stay awake when the sun came up (unlike yours truly, who would drop like a puppet with her strings cut as soon as it was dawn) but he could never, ever go out into the sun.</p><p>I, however, could.</p><p>So I got to my feet and checked on BabyJon, who we'd set up in the small sitting room. And by the way? The guy who invented the port-a-crib? A genius of Jonas Salk proportions.</p> <p>Anyway, he was in his crib, flat on his back with his little arms in the \"this is the police, put your hands up\" position. If he grew up to be anything like the Ant, he couldn't practice that position soon enough.</p><p>I couldn't help but smile when I looked at him. Don't get me wrong, it was unfortunate that my father and his wife died. But BabyJon was mine, now.</p><p>Forever.</p><p>Best of all, he was adjusting to the new sleeping schedule. After all, I can't have a kid running around during the day when I sleep. No, BabyJon was officially on graveyard shift now, and for a long time to come.</p><p>I wondered what I would tell him when he was older. \"Mom, why is there an unconscious man stuffed in the closet?\"</p><p>\"Nothing to worry about, dear, Mommy just wanted a snack.\"</p> <p>Hmm. Better rethink that one. Later. Besides, since he'd be growing up with us, he'd probably think it's normal for parents to stay up all night and never eat solid food. Or age. Or poop.</p><p>A problem for another time, so I popped into the bathroom, which was more or less unnecessary, but old habits, right? Sometime during our late-night chat with the Wyndhams, a castle employee had unpacked our clothes and stocked the bathroom. Good stuff, too-Aveda products.</p><p>Feeling minty fresh, I left the bathroom, and pulled on brown velvet leggings and a long-sleeved blue flannel shirt. I was always cold, and had long since donated all my tank tops to Goodwill. I slipped into my Cole Haan Penny Air Loafers and was ready to face the day. What was left of it, anyway.</p><p>I had to walk through the rest of the suite, and after a second I realized that our suite was on the west side of the castle. Okay, mansion-really huge, amazing mansion. That looked, to my Midwestern eyes, awfully like a castle.</p><p>Someone was being pretty thoughtful. Never let it be said that werewolves weren't polite hosts-I only had to look around our guest suite to see that. But I drew all the curtains anyway, just to be on the safe side. I didn't want to take the smallest chance that Sinclair might get burned. The sun wouldn't go down for another four hours or so.</p><p>I stepped out into the hallway, pulled the door closed, and nearly fell over Jessica, who was all but lurking in the doorway of the suite directly across from ours.</p><p>\"You know, they did let you have that room,\" I said. \"In fact, I think they're assuming you'll use it, as opposed to lingering in strange hallways.\"</p><p>She responded to me with, \"Girl, I am bored outta my tits.\"</p> <p>\"Can we have one cross-country quest without talking about your tits?\"</p><p>Her pretty dark eyes went narrow and thoughtful, and she caressed her cheek with a long fingernail colored jack-o'-lantern orange. After a thoughtful pause, she shook her head. \"I don't see how.\"</p><p>\"I figured.\" I scanned the hallway and listened hard: it was as empty as it looked. \"Want to find the kitchen? Maybe whip up a-\"</p><p>\"If I have to look at another smoothie this month, I'm going to barf in one of your Beverly Feldmans.\"</p><p>\"And face a terrible, prolonged death.\" We fell in step and, when we reached the main staircase, I pointed in the direction of the kitchen-or whatever room smelled like spices, meat, and fresh vegetables.</p><p>\"How can you be bored in the middle of a Pack of werewolves?\"</p><p>\"Easy. They're not talking to me. The ones I bump into are soooo polite-bathroom's right there, the east wing's over there, one of the indoor pools is through there, the weight room is over there-but I'm a cipher here.\"</p><p>Jessica, well used to my blank expression, correctly interpreted it as \"I am unfamiliar with that word; please explain\" and added, \"I'm a nobody. A nothing. A zero. This is about vampires and werewolves, which, thank God, I'm neither. No offense.\"</p><p>\"Who could be offended by that?\" I muttered, jumping down the last four steps. \"That way. Then a right. So, they've been nice to you at least?\"</p><p>\"Sure.\"</p><p>\"Good. Listen, I think it's really good that you're here-\"</p><p>\"You're the worst liar in the galaxy.\"</p><p>\"Shut up. Anyway, I sort of forced BabyJon on Sinclair-\"</p><p>\"This I already knew. The entire street knew,\" she added thoughtfully.</p><p>\"-because we're his parents now and we have to learn how to be a family-\"</p><p>\"Uh-huh, yup. Getting to something I don't know anytime soon?\"</p><p>\"-but I can't watch him every minute I'm here.\"</p><p>\"I don't mind watching him-much-but you know he'll only be cute and cuddly with you. With me . . .\" She sighed. \"With everybody else, it's colic city.\"</p><p>\"Sorry, Jess. I can't help that. But I appreciate you watching out for him for me.\"</p><p>She waved it away, and obediently turned left when I pointed. We were now in a slightly narrower hallway, on hardwood floors this time, no carpet. The smell of food was very strong.</p><p>\"At least you got the boy trained. Sleeps half the day and half the night.\"</p><p>\"He's really very sweet,\" I whined.</p><p>Jessica snorted and straight-armed the swinging door into the kitchen.</p><p>Like everything, the Wyndham kitchen made mine look like a dining nook. At least four big tables-the kind you could chop anything on-with long legs. Another big table, marble-topped, probably for baking. Three fridges. Another door, which led to industrial-sized freezers. I could smell the Freon.</p><p>There were huge windows-one overlooking a kitchen garden-on every wall. The windows on the opposite wall overlooked the Atlantic.</p><p>\"I could get used to this,\" Jessica commented.</p><p>\"So buy something just like it. You've probably got enough money in the sofa cushions for a down payment.\"</p><p>Jessica shrugged and went to the nearest fridge while I slid onto a bar stool. \"I like the place in St. Paul.\"</p><p>I nodded. Shoot, before the mansion, she'd lived in an ordinary house in the suburbs. She had never lived rich, dressed rich, ate rich, or looked rich. It was one of her many charms.</p><p>\"So you're not, um, hungry, are you?\" Jessica had extracted an apple and a Diet Coke. Wait'll I ratted her out to Marc! He considered diet pop one step up from muriatic acid, whatever the hell that was.</p><p>\"Naw. Sinclair and I snacked on each other for a while last night. I'm good for a few days.\"</p><p>\"Good to know. If you go nuts and accidentally chew on one of the locals-\"</p><p>\"Right, I get the picture, and duh, like I haven't thought of that. How dumb do you think I am?\"</p><p>Her answer was muffled in the loud crunch as she went to work on the apple . . . probably just as well.</p><p>\"So, that Jeannie seems nice,\" Jessica said, masticating slowly.</p><p>\"Shhhh,\" I said, putting a finger to my lips.</p><p>Jessica gnawed and crunched and all but growled at her McIntosh for a good minute, when the doors swung inward (werewolves must just know if someone's on the other side; probably because they could smell them) and in walked Jeannie, carrying a toddler, and behind her, Lara.</p><p>\"Hello,\" Jeannie said. The toddler, a boy with his mother's wild blond curls and blue eyes, waved a chubby hand in our general direction. \"Sleep all right?\"</p><p>\"Like the dead,\" I said cheerfully.</p><p>Jeannie rolled her eyes at me in a remarkable imitation of Jessica. She carefully set the toddler down in a high chair, strapped him in, then started rooting around for toddler food.</p><p>\"Mmmmph gmmmph mmmm nughump mph,\" Jessica commented, tiny pieces of apple flying like shrapnel.</p><p>\"She didn't know you had another kid.\" Or forgot Jeannie had another kid . . . she'd been a little out of it when the Wyndhams visited us the last time. Chemo really plays havoc with your memory.</p><p>\"This? This is Sean. And you remember Lara, Betsy.\"</p><p>\"Hullo,\" the tiny werewolf said as she opened the fridge, pulling out a small Tupperware bowl. She popped the lid, and-</p><p>\"Don't you dare,\" Jeannie said severely, pretending not to hear the delicate sound of Jessica's gagging. \"You have one of the chefs cook that hamburger, or ask me to.\"</p><p>\"But it tastes better when it's raw,\" Lara the Weird whined.</p><p>\"You heard what I said.\" Jeannie plunked a Lunchable in front of her son, who carefully began dismantling it and eating.</p><p>\"But I want to eat a raw hamburger.\"</p><p>Jessica raised her eyebrows at me while Lara placed her teeny hands on her teeny hips and glared up at her mother.</p><p>\"Tough nuts,\" Jeannie replied with admirable unconcern. \"And that locked gaze might work with your father and the others, but it doesn't do diddly to me. So: Cooked hamburger? Or no hamburger?\"</p><p>\"No hamburger.\"</p><p>\"Ah, starving yourself to spite the woman who gave you life.\" Jeannie leaned against the counter and put a hand over her eyes. \"Ah, 'how sharper than a serpent's tooth it is to have a thankless child.' \"</p><p>\"Mommy Shakes,\" Sean said, carefully picking up a pepperoni slice and popping it into his mouth.</p><p>\"Yes, that's right, Mommy likes to quote Shakespeare.\"</p><p>Lara sighed. \"Since I'm not going to eat my snack, can I go to the playground?\"</p><p>\"Lara, I'm sorry, but I can't get away right now-your father and I have some stuff to talk about.\" Her gaze slid to me, but I don't think she was aware of it.</p><p>\"I'll take her,\" I volunteered. \"I'd like to get outside.\"</p><p>\"Oh. Well. That's very nice, Betsy, but you're not really used to werewolves, y'see, and-\"</p><p>\"Not used to-Hello? I lived with one of them?\"</p><p>Jeannie gave me a long, speculative look, then beckoned with one finger. \"Step over here with me for a moment. Would you?\"</p><p>Jessica shot me her you'd-better-tell-me-everything-later expression and added, \"I'll keep an eye on your boy for you, Jeannie.\"</p><p>\"That's great, Jessica. If he wants another Lunchable-\"</p><p>\"And he will,\" Lara piped up.</p><p>\"-they're on the bottom shelf in the fridge to your right.</p><p>So saying, she spun on her heel and walked out through a different door, one I hadn't even spotted until Jeannie moved toward it.</p><p>I guess I was going back down the rabbit hole. Me and Alice.</p><p>Chapter 16</p><p>:I'll trust you with my daughter,\" Jeannie began the moment she'd started up four washing machines at once. The mysterious door had led to the mysterious Laundromat. The Wyndhams had their own Laundromat! Unreal.</p><p>Anyway, she got a bunch of the machines going and I was puzzling over that when I suddenly realized: she didn't want Lara to overhear. Or anybody close by to overhear.</p><p>\"I'm doing this,\" she continued, \"because I know you liked Antonia and wouldn't have seen her dead. I'm also doing this because Lara can take care of herself. So if you turn evil and try to bite her or hurt her in any way, don't be surprised if it's your head bouncing across the playground.\"</p><p>\"That's, um, sweet. You must be very proud.\"</p><p>\"But I need you to remember this: a werewolf cub is not a human child. They're different.\"</p><p>\"Okay.\"</p><p>\"They're faster. Stronger. Even crueler. She looks like a little girl to you, but you must never forget-she is her father's daughter, the man who had to kill over twenty-five werewolves to take the Pack. Do you understand?\"</p><p>I just stared at her while all around us washing machines went shhh-thump, shhh-thump, shhh-thmmp.</p><p>I'd expected the standard warning: if you bite my kid, I'll hunt you down and shoot you dead.</p><p>But it wasn't like that. Jeannie wasn't scared for Lara.</p><p>She was scared for me.</p><p>\"I told you something like this before, but you had a lot going on at the time. This time I've got your full attention. Right?\"</p><p>\"Right, absolutely, you bet.\"</p><p>\"As long as we understand each other.\"</p><p>\"Oh, we totally do,\" I assured her.</p><p>\"All right, then.\"</p><p>\"All right.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 17</p><p>With her warning still ringing in my ears, we trooped back to the kitchen after Jeannie opened one of the dryers, groped around inside, then turned the dryer back on. \"A quilt,\" she explained, and I nodded just like this was an ordinary week, day, conversation, whatever.</p><p>We got back just in time to hear Lara laughing and Jessica's \"Ooof ! All right, all right, you crummy kid, you win the bet.\"</p><p>Jessica, obviously the loser in a game of arm wrestling, looked relieved to see me as she rubbed her shoulder. \"Ah, the Mysterioso Twins are back. What's up?\"</p> <p>\"Just giving her directions to the playground,\" Jeannie calmly lied. \"Lara, you can go, but you mind Betsy like it was me talking-you understand?\"</p><p>\"Yes, Mom.\" Lara slid off the stool and faced me.</p><p>\"Hi again,\" the next Pack leader said.</p><p>\"Nice pigtails,\" I replied.</p><p>Chapter 18</p> <p>That was how I found myself taking Lara-Michael and Jeannie's eldest-to the nearby playground for good, clean, wholesome werewolf fun.</p><p>She was a cutie, no question. She had her father's eyes, that odd yellow-gold I'd seen on television nature shows-eyes the color of an owl's, or a hawk's. Slender and straight, with her curly dark hair pulled into pigtails. Jeans and a Hannah Montana T-shirt. Maybe . . . six?</p><p>\"-then Daddy said you were going to bring Antonia back but now you have to talk to the Council and nobody knows what will happen after that but Derik's really upset because he loves-loved-Antonia and-\"</p><p>\"Where the hell is the playground?\" I muttered. Lara, as far as I could tell, hadn't taken a breath in the last eight minutes. We'd taken a path that led off the grounds and onto a small, brick-lined sidewalk beside a bike trail. Lara had explained that it was \"really close.\" Sure it was.</p><p>\"-had to go before the Council since Grandpa took over the Pack so nobody knows what's going to-\"</p><p>\"There is no park,\" I muttered. \"That's my theory. I'm trapped on a never-ending sidewalk beside a never-ending bike path.\"</p> <p>\"-walk around outside?\"</p><p>\"What?\"</p><p>\"I said, how come you can come outside? It's daytime.\"</p><p>\"I just can.\"</p><p>\"But how come?\"</p><p>It sounded too dumb to say it out loud, but I did it anyway. \"Because I'm the queen. Sunlight can't hurt me. Only a knockoff shoe sale can hurt me.\"</p><p>\"Because I thought you'd have to sleep in a coffin but my friend said you guys have one of the guest suites and there's no coffins in there and-\"</p><p>I stopped. Lara halted beside me. We'd rounded a tree-lined corner and suddenly the park was spread out before us. There was a large sign at the entrance that read, MICHAELWYNDHAMSR.MEMORIAL PARK.</p> <p>\"Don't tell me,\" I said. \"Let me guess.\"</p><p>\"You don't have to guess,\" Lara said, giving me a look I knew well. It was the what-kind-of-moron-are-you look. \"The sign's right there.\"</p><p>\"So your dad made this?\"</p><p>\"No. Daddy's the third.\"</p><p>\"He's what?\"</p><p>\"Michael Wyndham the Third. My great-grandpa was-\"</p><p>\"You know what? I've kind of lost interest by now.\" Legacies. I should have remembered where I was. This was New England, not Minnesota. \"Run along.\"</p><p>So she did, heading straight for the monkey bars. There weren't many cars in the small parking lot to the left-maybe half a dozen-and about that many kids playing. A couple of moms were sitting on benches on the far side of the park, chatting and keeping half an eye on the children.</p><p>Which left me time to think about just what the hell we were in for. For example, just what the hell was the Council? Was it as bad as it sounded? Because it sounded a bit like a trial without a jury. Or a fair-minded judge. And what was I supposed to tell them? I hadn't made Antonia take slugs for me, or even asked her. We walked in, the bad guy shot, and Antonia died. The end.</p><p>I prowled around the teeter-totters and tried to think of a plan. But I had no gift for strategy-I left that shit strictly to Sinclair and Tina-and felt more out of my depth than usual. What were we doing here, anyway?</p><p>Let's say the Council decided the vampires had screwed up. What then? They couldn't punish us. Could they? Would that mean we'd go to war? That could be a problem-not only did I not know how many vampires were walking around on the planet, I had no way to mobilize them. And I didn't want to. I found it completely ridiculous that I had to police adults, most of whom were far, far older than I was. And as far as siccing them on werewolves, for crying out loud? Puh-leeze.</p><p>I kicked irritably at an errant tuft of grass, then looked up at the unmistakable sound of a child bursting into tears. A little girl-three? four?-was sprawled in the gravel, sobbing, and a bigger boy-nine, ten?-was standing over her.</p><p>\"I said your turn was over,\" the brat said, sounding remarkably unrepentant. I knew a few vampires like that.</p><p>The thing about being childless (as I still thought of myself, BabyJon being a relatively late arrival in my life) is you sort of freeze up when kids are acting badly. On the one hand, you know the kid's in the wrong and you want to help. On the other hand, it's not your kid, so perhaps it was none of your business.</p><p>The little girl was still crying. The bigger boy was now on her recently vacated swing.</p><p>I glanced over at the moms sitting on the bench and saw one stop in mid-gossip and say in that fake \"I'm trying to sound stern but I'm really proud of my big boy!\" tone that I absolutely hated, \"Jaaaaason! You know you're supposed to wait your turn, honey.\"</p><p>\"I'm telling!\" the tiny girl in the gravel sobbed. \"I'm telling! Mom! Mommy, Jason pushed me off the-\"</p><p>\"You be nice to your little sister, Jason Dunheim?\" the mom asked. Asked. Not told. Oh, God save me from overindulgent nitwits who insist on procreating but not parenting. \"Jason? Okay?\"</p><p>Why is she asking? I hate when parents ask. What happens if the kid says no? Then what are you supposed to do? Slink away? Have a tantrum? What?</p><p>\"Mommy!\"</p><p>\"Shut up, bawl baby.\"</p><p>\"Jason? You know we don't use that phrase in our house, Jason? Honey?\"</p><p>Sigh. Well, the little one didn't appear to be hurt (I couldn't smell any blood on her), and if I didn't exactly approve of a mother who so clearly favored one child over the other, there wasn't much I-</p><p>\"Say you're sorry.\"</p><p>I turned my head so fast I nearly gave myself whiplash. Not only was Lara in it (groan), she was hoisting Jason by bunching his T-shirt in her fist.</p><p>Chapter 19</p><p>Lara lifted his big butt right off the swing, and was holding him a foot over her head with one arm. I'd never even heard her move, and the monkey bars were all the way across the playground from the swings.</p><p>\"Let go of me!\" Jason's legs swung and kicked.</p><p>Lara gave him a brisk shake. It looked about as difficult for her as salting pasta would be for me. \"Say you're sorry.\"</p><p>\"Hey!\" Miracle of miracles, The Thing That Spawned Jason was on her feet and running for the swings. \"Leave my son alone! Put him down right now!\"</p><p>I started to run, too. But my motives were in no way altruistic . . . I sure wasn't at all interested in saving Jason's spoiled little white-bread butt.</p><p>No, all I could think as I raced toward them was, First I get Antonia killed, and now I'm going to get Lara beat up . . . Oh, the werewolves are gonna throw us a party, they'll be so pleased. Nice, Betsy. And it's not even five o'clock.</p><p>I made myself slow down. A lot. Because about the only way this could get worse was if I outed myself as a vampire. Humans could not run at forty miles an hour. Slow down. A lot. Get Lara away from there before she-</p><p>\"She's littler than you.\" Another shake. \"And not as strong.\" Another shake-sort of like when a terrier kills a rat.</p><p>Jason had both his hands locked around her wrist and, from his strained, reddening complexion, was trying as hard as he could to pry her hand off him. \"You're supposed to watch out for her,\" Lara the Terrifying was saying. \"She's your 'sponsibility and you hurt her on purpose! You don't ever do that!\"</p><p>\"Put me down!\"</p><p>\" 'kay.\" I didn't even have time to groan and cover my eyes; Lara pulled Jason toward her, sidestepped, and threw him about six feet. He skidded nose-first into the gravel, sat up, and started howling. His nose was bleeding and the rich, heady scent went straight to my head.</p><p>Well, this was just swell. On top of everything else, I'd popped my fangs. Way to stay off the radar, Vampire Queen.</p><p>I reached Lara, veering around the mother who had instantly rushed to her son's side when things stopped going his way.</p><p>\"Argh, Lara, thith ith awful! Why'd you do that? You can't be throwing bullieth around like that. Are you trying to get me eaten alive? Your father-\"</p><p>Lara was ignoring me. I had, in fact, stopped existing for her at all. She had gone to the girl, helped her out of the dirt, and brushed her off. \"Are you okay? We have Band-Aids at my house. Do you need one?\"</p><p>\"Nuh-uh.\" The girl rubbed her cheeks with grubby fists, mixing dirt with tears. \"How'd you do that? That was really cool. I want to do that. Can you throw him again?\"</p><p>\"I better not,\" Lara muttered, giving me a wary look. Not like she was scared of me; more like she was calculating how much of a threat I was to her at that moment.</p><p>I had a flashback to what her mother-her human mother-had told me earlier.</p><p>A werewolf cub is not a human child. And what else had she said? She'd looked so strange when she said it. That look on her face-a mixture of pride and sorrow. It wasn't an expression I'd ever seen before.</p><p>They're faster. Stronger . . . crueler.</p><p>Jeannie had known her shit; Lara was no more human than I was. She hadn't responded to Jason like a little girl who wanted to play on the monkey bars; she'd responded like an alpha who saw weakness and pain and instantly acted to put an end to it. She'd seen someone who needed protecting and she hadn't hesitated-never mind the consequences to her, or me.</p><p>Which was a lot more than I had done.</p><p>Great. Shown up by someone who didn't weigh more than a bag of dog chow. Who was already more of a leader than I could ever be.</p><p>\"-because we could go up to my house and-\"</p><p>\"You!\" Oh, terrific. The Thing That Birthed Bullies had marched over to us, dragging her bawling son behind her. \"You think I didn't see what you did? I saw what you did, and you're going to-\"</p><p>Okay, that was just about enough. I locked gazes with her and said, \"Go thit down.\"</p><p>The anger-all animation, in fact-left her face and she turned and walked like a robot over to the bench. Good old vampire mojo; there were times when I was more than pleased to use it.</p><p>\"What's wrong with your voice?\" Lara asked.</p><p>\"You jutht never mind my voith. Letth get out of here.\"</p><p>\"Hey, your teeth are all pointy! I don't think you should bite him, though.\" She looked at Jason, who was so bewildered by the events of the last twenty seconds he had stopped crying. Then she smiled at him, the flat, fake smile of a store mannequin. \"He wouldn't taste good at all.\"</p><p>Jason was now backing away from her, wiping the blood from his nose with a swipe of his sleeve. I couldn't say I blamed him. And the farther away he got, the less crazy the smell of his O-positive goodness made me.</p><p>\"Your mom underplayed it, if anything,\" I muttered.</p><p>\"What?\"</p><p>\"Never mind. Let's get out of here.\"</p><p>\"Okay. I've got what I wanted, anyway.\"</p><p>We started heading out of the playground, back toward Lara's house. \"What, you wanted to throw a bully fifteen feet?\"</p><p>\"It wasn't even close to fifteen feet. Boy, you really like to exaggerate, don't you?\"</p><p>\"It's one of my weaknesses,\" I admitted.</p><p>\"Besides, I just wanted to get another look at you.\"</p><p>I stopped so suddenly she took a couple more steps before she realized she was walking alone. \"You wanted to what?\"</p><p>\"To get another look at you. If you and my daddy become enemies, you'll be my enemy. I might have to kill you someday, to protect the Pack. Why wouldn't I come see you?\"</p><p>\"But you and I met already.\"</p><p>\"Yes,\" Lara explained patiently, \"but now you're in my lands. I'm not in yours.\"</p><p>I stared, struck speechless-which is not a normal thing for me, better believe it. \"So, if I've got this right, you didn't want me to take you to play. You wanted to-to-\"</p><p>A werewolf cub is not a human child.</p><p>\"-to size me up?\"</p><p>\"Uh-huh.\" She brightened as the mansion came into sight. \"D'you want some ice cream? I'd love a dish of chocolate.\"</p><p>Okay. Now I was getting a genuine case of the creeps. Because I could see that, for her, the situation was over, done, resolved. She could move on to other things now, and would.</p><p>In other words, she was behaving exactly like she was taught and bred to behave: to worry only about the Now. Tomorrow was a thousand years away. Yesterday was even further away.</p><p>I sighed and surrendered. \"Yeah. Let's go get some ice cream.\"</p><p>\"Hey! You're not talking funny anymore.\"</p><p>\"Let's thank God for small favors, okay? Also, if you could not mention this little fracas to your folks, that would be peachy.\"</p><p>Lara laughed. \"You're funny.\"</p><p>\"Yeah, yeah.\" I followed her up the drive to the mansion. \"I'm a barrel of freakin' monkeys.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 20</p><p>Dude,</p><p>Well, I definitely picked the right time to keep a journal. Because it has been an interesting couple of days. Who knows? I might actually keep writing the thing.</p><p>When Laura called me away during my last entry, I had followed her into the kitchen. But not as her friend . . . I was more than a little alarmed at the symptoms of intense stress she was exhibiting. Since unpleasant things had a way of happening when she was angry or frightened, I had a more than passing interest in her state of mind.</p> <p>I was able to sit her down at the kitchen table and get her to drink a Snapple. The act of doing something nice and mundane seemed to calm her. That's when I realized she was more humiliated than angry.</p><p>\"Marc, I am so sorry you had to see that. I just don't know what to say.\"</p><p>\"Laura, it's not your fault. Hey,\" I joked, \"how do you think I'd feel if my old man showed up? You shouldn't feel bad about something beyond your control.\"</p><p>\"Maybe it isn't beyond my control.\"</p><p>I wasn't sure I liked the sound of that. \"It's fine, Laura, I don't mind. Satanists showing up in the foyer certainly add some spice to my day. Nobody likes the pop-in. And like I said, it's not your fault.\"</p> <p>\"No. It's my mother's.\" That last was practically spit out. \"I was going to ask you something and now I can't, because of her.\"</p><p>\"Ask me what? Drink your tea. So. Ask.\"</p><p>\"Um.\" Laura gazed into her bottle of Snapple, which I doubt held any answers. \"It's just, I told Betsy I'd look after you and Tina while she was gone. So instead of coming over when I can, I was hoping I could move in. Just for a little while,\" she added, misreading my expression. \"I won't get in the way, I promise.\"</p><p>\"How could you get in the way? There are twenty bedrooms in this thing. But come on, Laura. Cut the bullshit.\"</p><p>\"I don't-\"</p><p>\"Betsy asked you to look over Tina, too?\"</p> <p>\"Well.\" Laura looked down for a moment. \"Mostly you, I guess. I think she felt bad about leaving you behind.\"</p><p>I shrugged. \"It's moot. I didn't have the vacation time, anyway. Tina had to stay, too-somebody's got to stay in Vampire Central and handle any undead-related stuff that comes up while they're gone. Which leaves thee and me. And of course you can move in. Heck, pick an entire wing to live in.\"</p><p>\"No, I can't, now.\" Her knuckles whitened on the bottle. \"Not with these-these people tracking me down all the time and asking-\"</p><p>\"Wait. This has happened before?\"</p><p>Laura didn't say anything. She didn't have to. The Snapple bottle shattered in her hand, spraying tea and glass all over the place.</p><p>\"Oh my God! I'm sorry, Marc, I didn't mean to be so clumsy, I'll get a towel and-\"</p><p>I was instantly on my feet, hauled her to hers, and hustled her over to the sink. \"Laura, if you don't mellow out, I'm going to slip some Valium into your next Frappuccino. Now hold still and let me look.\"</p><p>I carefully examined her hand, rinsed it, and examined it again. She had a couple of minor cuts on the pads of her left ring and middle fingers, and that was all. Nothing arterial, no damage to the tendons that I could see.</p> <p>\"No more Snapple for you,\" I said, handing her a dish towel and stepping around the broken glass. \"From now on it's strictly sippy cups.\"</p><p>The only reason I was letting her clean up was because it was the only thing that would make her feel better. Laura was nice-a little too nice. She always made me wonder when she was going to blow. Looked like this might be the week.</p><p>\"You said this has happened before?\"</p><p>\"Yes.\" She wiped up glass and tea, being careful to get even the smallest pieces. \"Those people. They always find me. Always.\"</p><p>\"So they show up at your apartment, too?\"</p><p>\"My apartment.My parents' house.\"</p><p>\"I'll bet the minister loved that,\" I said dryly, earning a ghost of a smile. \"What do they want with you?\"</p><p>\"To serve me,\" she replied shortly, wringing the now-wet towel over the sink (after she'd shaken the glass into the garbage).</p><p>\"Serve you, what? With toast?\"</p><p>A real smile this time.\"No, silly. To do my bidding.\"</p><p>\"So what have you done in the past?\"</p><p>\"I just tell them to go away.\"</p><p>\"No, no, no.\"</p><p>Laura blinked. \"No?\"</p><p>\"You're going about it all wrong.\"</p><p>\"I am?\"</p><p>\"It's going to happen anyway, right? Because of that star or whatever heralding you like-I dunno-like January heralds weight-loss resolutions.\"</p><p>\"Yes, I suppose.\" Laura was looking increasingly mystified, which was a big improvement over mortified. \"But what else could I do?\"</p><p>\"Lots of things.\"</p><p>Then I told her. And got another smile, this one even better than the last one. This was a smile of absolute delight.</p><p>Chapter 21</p><p>I got back in time to change into a black suit, black panty hose, and Carolina Herrera black pumps. Sinclair was up and working at the desk in our suite; he was also dressed for the service.</p><p>Yes, indeed, my first werewolf funeral.</p><p>I watched my husband work for a minute until he felt my gaze and turned. \"Something on your mind, dear one?\"</p><p>\"Several things,\" I replied, thinking of Lara, future psycho werewolf leader. \"Mostly about how awkward this is going to be. I mean, everyone there will know. They'll know Antonia died saving me.\"</p><p>\"I imagine they will, yes.\" He watched me with his dark eyes, an unreadable expression on his face.</p><p>\"Like I don't hate funerals enough.\"</p><p>\"Yes, of course,\" he soothed. \"Everyone should realize how difficult this will be for you.\"</p><p>\"Yeah, that's-you jerk. I hate you.\"</p><p>\"No, you worship the hallowed ground I trod upon, which is what any good wife should-\" He ducked, and my left shoe went flying over his head. Fortunately, it missed the window. I couldn't stand the thought of my new pump being torn by flying glass. \"My sweet, I was only seeking to give comfort in your time of-\"</p><p>\"Do you know how many pairs of shoes I packed?\"</p><p>\"Ah . . . no. Perhaps a change of subject would be prudent. Where is Jessica?\"</p><p>\"Watching BabyJon in her suite. You know, I didn't want her to come, but now I'm awfully glad she did. I don't trust the werewolves with him. There's something weird going on there.\"</p><p>\"Mmmmm. What were you up to until the sun set?\"</p><p>\"You wouldn't believe me if I told you.\"</p><p>His eyes narrowed. \"No one bothered you, did they?\"</p><p>\"It's not like that, Sinclair.\" I sighed and sat down across from him. \"This is a weird place. I'm not sure I like it. And this whole Council thing is making me nervous. I miss our house. I miss Tina and Laura and Marc. I just want to go home.\"</p><p>\"At last,\" he said, \"we are of one mind. Perhaps it will help you to think of the funeral as part of the cost of returning to Minnesota.\"</p><p>\"Or perhaps I'll think of it as the werewolf version of Tailhook.\"</p><p>\"Either way,\" he said, glancing at his watch, \"we had best get moving. Soonest done, soonest home.\"</p><p>\"Dammit. No time for a quickie?\"</p><p>He smiled at me and shook his head, but I could tell he hated to do it.</p><p>\"Not even a quickie quickie?\"</p><p>\"Stop that, vile temptress. Now let's be off; people are waiting for us.\"</p><p>Hmph. I'd always thought that whole \"jump in and get it over with\" thing wasn't always the way to go.</p><p>But damned if I was going to cower in a room that wasn't mine, in a house where nobody knew me and nobody cared to. No, I'd go to Antonia's funeral and hold my head up, and if the fuzzy lollipop brigade didn't like it, nuts to them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 22</p><p>I knocked, then poked my head into Jessica's room to see how BabyJon was doing. Jessica, resigned, was walking back and forth with him while he alternated crying with spitting up on her shoulder.</p><p>\"And once again, I can't thank you enough.\"</p><p>\"And once again, I need to buy a new shirt.\" She had to raise her voice to be heard over the baby. \"Have fun at the funeral, anyway. Should be a piece of cake, right?\"</p> <p>\"It's a joke, that's what it is.\" I held out my arms and she gladly surrendered him to me. BabyJon hushed at once, except for the occasional hiccup.</p><p>\"I wouldn't say that around here if I were you,\" she warned, scraping at the fusty left shoulder of her blouse.</p><p>\"It's the truth, though.\"</p><p>\"Come on, Bets. It's hard for them. These guys-from what I've seen, they're a tight bunch. It's probably like losing a niece, or a sister, or-\"</p><p>\"Bullshit. The Pack didn't like Antonia, remember? They were glad when she left.\"</p> <p>Jess snapped her fingers. \"Jeez, you're right! I'd forgotten all about that. It creeped them out that she couldn't change, but could tell the future. They needed her, but they were all sorta scared of her, too.\"</p><p>I nodded. Antonia had gotten abysmally drunk (do you have any idea how much booze a werewolf has to drink before feeling it?) one night a few months back. She'd told us the whole story.</p><p>How hardly any of them spoke to her.</p><p>How frightened they were of her: Would she withhold her predictions? If she saw something bad in a Pack member's future, would she spill it? Or keep it to herself?</p><p>Worst of all, she'd told us how the Pack had been relieved when they'd found out she wasn't coming back. They hadn't missed her at all, or even worried about her.</p><p>No. They'd been relieved.</p> <p>And now they expected me to face the music. The whole thing pissed me off.</p><p>Jessica was shaking her head. \"Glad I'm not in your shoes, Bets. Although they are pretty nice,\" she added, peeking at my pumps.</p><p>\"They can do whatever they want with me,\" I muttered. \"But if they fuck with my shoes I'm going to kill them all in a variety of horrible ways.\"</p><p>\"Gosh.\" I kissed BabyJon on his sweet head. \"I feel safer already.\"</p><p>Chapter 23</p><p>Wyndham Manor, I had been told, was not only werewolf HQ and the seat of their power, it was also home to dozens of Pack members. And it had obviously been built to accommodate crowds, because the service was held in a room the size of a warehouse and nobody was crowded. I was guessing, when there wasn't a coffin involved, it was a ballroom.</p><p>Michael had spoken briefly, and then a minister (a werewolf Presbyterian minister!) had spoken, and then people started filing past the coffin, no doubt paying their respects.</p><p>I had noticed right away that they'd switched Antonia to a much nicer coffin. It shone like polished jet and was just as black. An enormous spray of white calla lilies nearly covered the entire top. I wonder what they'd done with the old one-the one Derik had destroyed. Then I decided a) it was a morbid thought and b) none of my business.</p> <p>At least Jessica was missing this. This was actually fine by me-if I knew where she was, I wouldn't worry about her.</p><p>BabyJon was snuggled against my shoulder, thumb popped into his mouth, gazing around with bright-eyed interest. I tried to pretend he wasn't drooling on the lapel of my Ann Taylor.</p><p>Weirdly, it had been Sinclair's idea for me to bring him. It was the first time Sinclair had suggested we bring BabyJon anywhere, so on top of being sad for Antonia, and scared for us, I was suspicious of my husband's motives.</p><p>I didn't move when people started getting up. I had already paid my respects. I had wept over her, called her Pack, and told them the unthinkable, had flown her home. It was more than I'd done for my own father.</p><p>\"Hello. It's Betsy, right?\"</p><p>I looked up and almost gasped. One of the most striking women I had ever seen in my life was standing in front of me, with a pregnant belly out to here.</p><p>\"Uh, yeah.\" I shifted BabyJon and held out a hand, which she shook briskly. \"Betsy Taylor.\"</p><p>\"The infamous queen of the dead.\" But her blue eyes were kind, and she was smiling. Her hair was a rich auburn cloud around her shoulders. \"I'm Sara, Derik's wife.\"</p><p>\"Undead,\" I corrected, \"and yeah, that's me. Was Antonia a friend of yours? I s'pose she must have been; she and your husband were kind of tight, or so I heard. I'm very sorry about what happened to her.\"</p><p>\"Thank you.\" Sara eased herself into the chair beside me and massaged the small of her back. \"But she wasn't my friend. I couldn't stand spending time with her.\"</p><p>I stared. And stared. And stared some more, feeling equal parts admiration and horror. Sara had a pair, that was for sure, to speak ill of the dead in this of all places. But she was telling the truth, which I admired tremendously.</p><p>\"She was kind of a grump,\" I admitted. \"You're, um, not a werewolf. Are you?\"</p><p>\"No, no.\"</p><p>\"So Jeannie's not the only human who, ah, runs with the Pack?\"</p><p>\"No indeed. Although I'm not technically human,\" she said.</p><p>\"Oh.\"</p><p>\"I'm the reincarnation of the sorceress Morgan Le Fay.\"</p><p>Oh. Great. A crazy woman-a crazy pregnant woman-was sitting less than two feet away. My, what an interesting week this was turning out to be!</p><p>Sara laughed, accurately reading my expression. \"Never mind, you don't have to believe it, just like I don't have to convince you. Although I should warn you, if you try to hurt me, the chances are excellent that something awful will happen to you.\"</p><p>\"I just met you. Why would I want to hurt you?\"</p><p>\"Nobody knows. Just like no one can predict what you and your husband are up to at any given time. Are you going to finish that?\"</p><p>I handed her my cherry Coke-yes, now that the actual service was over, they'd broken out the bar drinks. \"Predict . . . what the hell are you talking about?\"</p><p>Sara gestured to the room. I looked, but all I saw were hostile gazes pretty much everywhere I turned. \"You're just making them extremely nervous, that's all.\"</p><p>\"What? Me? But that's-\"</p><p>\"You don't have a scent,\" she interrupted gently. \"So they can't tell how you're feeling at any given time. It makes them-all of them-extremely nervous.\"</p><p>Of course! I almost slapped my forehead. I had completely forgotten how much that had weirded Antonia out when she came to live with us. It took her weeks to get used to us for that exact reason.</p><p>\"Then how come you're on this side of the room, talking to me?\"</p><p>Sara shrugged. \"You don't make me nervous. You're still our guest, despite the circumstances. And you won't be able to hurt me.\"</p><p>Back to that again. \"What, are you a superstar pregnant ninja warrior or something?\"</p><p>\"No, no. Nothing like that.\"</p><p>Silence.</p><p>\"Well? Jeez, you can't make comments like that and then leave me hanging.\"</p><p>\"But you won't believe me anyway, so why waste my breath?\"</p><p>\"Try me,\" I retorted.</p><p>She shrugged. \"I affect the laws of probability. If someone tries to shoot me, the gun will jam. Or a pinprick aneurysm he had all his life will pick that second to blow. Or he'll miss me and the bullet will ricochet back into his brain.\"</p><p>Sara sighed. \"I knew you'd say that.\"</p><p>\"I didn't have a chance to say anything, you-\" Poor crazy person, I'd been about to say, which wasn't nice, under the circumstances. \"So in order for you to-to-uh-\"</p><p>\"Affect the laws of probability.\"</p><p>\"Don't you have to do tons of math all the time?\"</p><p>\"Oh, no. My power's completely unconscious. I have no control over it at all. After I won the lottery for the fourth time, I sort of hung it up.\" She patted her belly. \"Besides, there are more important things than buying lottery tickets.\"</p><p>\"Yeah, I s'pose.\"</p><p>\"And knowing I'll win sort of takes the fun out of it.\"</p><p>\"Sure, I can see that.\" Looney tunes.</p><p>\"Is this your son?\" Sara smiled and held her arms out. BabyJon smiled back and snuggled more firmly into my shoulder.</p><p>\"It's not you,\" I hastily assured the crazy pregnant woman. \"He pretty much only likes me. He's not my son, though. He's my half brother.\"</p><p>\"He's charming,\" Sara said admiringly. \"What beautiful eyes!\"</p><p>\"Thanks.\" I perked up a little. \"He's really a sweet baby. He almost never cries, and he sleeps all day-\"</p><p>\"I would imagine, with a vampire big sister.\"</p><p>\"Yeah, we had to do some juggling with everybody's schedule,\" I admitted.</p><p>\"But weren't you worried about bringing him here with-with everything that's happened?\"</p><p>\"I haven't been his guardian very long. My husband and I need to get in the habit of thinking like parents, not ravenous, slavering monarchs of the undead.\"</p><p>Sara cracked up, holding her belly and clutching the table so she wouldn't fall over. I perked up even more. At least someone at this funeral didn't blame me for Antonia's sacrifice. I could feel the disapproving stares, but Sara just laughed and laughed.</p><p>Finally, she settled down and wiped her watering eyes. \"Hormones,\" she explained. \"Sorry.\"</p><p>\"Hey, I'm not offended. It's kind of nice to see someone-\" Lightening up, I'd been about to say, which would have been seriously uncool.</p><p>\"So! I've never met a vampire before.\"</p><p>\"Well, I've never met a sorceress before.\" I was trying to remember what I knew about Morgan Le Fay, but history was so not my strong point. I thought she'd been a witch during King Arthur's time. She was one of the bad guys, I was pretty sure. Well, I could always ask Sinclair.</p><p>\"We can't say that any longer, can we?\" Sara was asking.</p><p>\"Not hardly.\" I glanced over her shoulder and saw Derik stomping toward us, his normally smiling countenance twisted into a scowl. \"Uh-oh. Pissed off hubby at six o'clock.\"</p><p>Sara sighed. \"It's been awful for him; I'm sure you can relate. He doesn't mean to act like you shoved Antonia into a hail of bullets. But it's hard. You know?\"</p><p>I did know. Derik was playing Pin the Blame on the Vampire as an alternative to facing up to the fact that the only reason Antonia left was because most of the Pack disliked her, or was scared of her. I understood, even though I didn't like it one bit. Where was all this concern when she decided to leave town and never come back?</p><p>And here he was, looming over our table. \"I'd like you to step away from my wife, please,\" he managed through gritted teeth. \"I don't want-aaaggghhh!\"</p><p>At first I thought he had slipped. Then I realized he'd seen BabyJon and jerked backward so hard, and so fast, that he lost his balance.</p><p>\"That again! Get that baby away from my wife!\"</p><p>You know those moments in parties where you have to talk loud to be heard, only you do it the one time everyone's quiet? So they all hear exactly what you're shouting?</p><p>Yeah. It was like that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 24</p><p>Dude,</p><p>It wasn't long before Laura had a chance to implement Operation Distract. Yes, another band of devil worshippers showed up. But this time she (we, actually) was ready for them.</p><p>\"Oh most gracious and dread lady,\" their leader was proclaiming, kneeling before her. His fellow lemmings followed suit, which meant there were sixteen religious extremists in one of our parlors. \"We but live to serve you in any capacity you require. Only point us to your enemies and we shall wreak vengeance in your name. In your father's name, Lucifer Morningstar.\"</p> <p>That was kind of interesting, because we knew Laura's mother had been possessed by the devil. And the devil always appeared to Laura (you can imagine her mood after one of those fun-filled visits) as a woman.</p><p>I imagine the Prince/Princess of Lies can appear as anything he/she wants.</p><p>\"We are yours to command!\" he shouted at Laura's feet, since they were all cowering before her on their knees. None of them could see the way she shook her head in disgust, rolling her eyes. \"Oh most dread sovereign, your coming was foretold and it has come at last!\"</p><p>\"Yes, yes,\" she replied impatiently. \"That's fine. Now. You. All of you.\"</p><p>All the heads jerked up at once. It was like watching otters pop their heads out of the water at the zoo.</p> <p>\"I bid ye go forth. All of you find the soup kitchen on Lake and Fourth, in Minneapolis. Volunteer for at least fifty hours a week.\"</p><p>The leader's sad basset hound face seemed to sag even further. \"But-but we wish to-\"</p><p>\"Are you questioning me?\" Laura thundered in a pretty good imitation of an angry demigod wearing a pink sweater. \"You dare question how I test your loyalty?\"</p><p>Practically elbowing each other out of the way, they all denied questioning anything.</p><p>\"So begone from here, and do my unholy bidding at Sister Sue's Soup Kitchen. I will know when you are ready.\"</p><p>They all galloped out, several of them getting wedged in the doorway in their eagerness to obey Laura's completely unevil command.</p> <p>They were no sooner out the front door than Laura threw herself into my arms hard enough to rock me back on my heels. \"It worked! Oh, Marc, I can't thank you enough, what a wonderful idea you had!\"</p><p>\"Fifty hours a week should keep them out of trouble,\" I agreed, patting her back.</p><p>\"Oh, I don't know why I didn't think of this before!\"</p><p>Well, honey, you pretty much tense up and close off whenever anything connecting you with your mother gets shoved in your face. When you're that angry, or that upset, or that sad, it's impossible to think logically.</p><p>(Dude, I prudently kept that to myself.)</p><p>\"I don't know how I kept a straight face,\" Laura gasped. \"I looked at you and I almost lost it right in front of that band of dimwitted sheep.\"</p><p>In all modesty, I had to admit my idea stank with the reek of genius. Put them to work for you, I'd said. Make them volunteer at homeless shelters, at soup kitchens, at church fund-raisers. That way they're happy-they think they're being tested-and you're happy because not only are they out of your hair, they're spending virtually all their free time helping the greater good.</p><p>I'd saved the best for last: ordering devil worshippers to commit good deeds was a terrific way to defy her mother. If I had needed a deal closer, that was it.</p> <p>\"Marc, if there's ever anything I can do for you, you have to come see me or call.\"</p><p>\"Are you kidding? You just gave me ten minutes of free entertainment. You're square with the house, honey.\"</p><p>Laura turned away for a moment, suddenly lost in thought. \"Maybe I've been looking at this the wrong way. If they'll do anything I say-if they'll do things for me they would do for no one else-I wonder what else I can make them do?\"</p><p>\"Hey, one way to find out,\" I said, having absolutely no idea that I was inadvertently, and with the best of intentions, driving Laura to a break with her conscience and her sanity.</p><p>I take full responsibility for the following events, which I will narrate as quickly and carefully as I can.</p><p>Chapter 25</p><p>Derik! Apologize this minute,\" Sara practically hissed. \"I know you're upset, but this is ridiculous. He's just a baby.\"</p><p>\"I don't know what the hell that thing is,\" Derik retorted, \"but it's not a baby.\"</p><p>\"You're acting like you've seen a ghoul, or something,\" Jeannie said.</p><p>\"What baby?\"</p><p>Jeannie turned to her husband. \"What baby? The one she got off the plane with, what are you talking about, what baby?\"</p><p>Oh, great, here were Michael and Jeannie Wyndham, with Sinclair hot on their heels.</p><p>\"Everybody just calm down,\" I began, but Derik drowned me out.</p><p>He pointed. \"That baby.\"</p><p>Michael frowned. \"But you don't have a baby.\"</p><p>Jeannie stared. \"What's wrong with you?\" She nodded toward Derik. \"Him, I get. He's just playing the blame game. But you-\"</p><p>I was flabbergasted. I'd suspected last night he hadn't noticed BabyJon, but not noticing or commenting was one thing. Michael didn't appear to see my brother at all.</p><p>\"Well, he's not mine,\" I said, trying to recover from my surprise. \"I mean, he is now. He's my brother.\"</p><p>Michael was staring at BabyJon with his flat, yellow gaze. \"Where did he come from?\"</p><p>\"Uh, Michael.\" I coughed. \"Um, he came with us. On the plane, like Jeannie said. He was in the limo with us last night. And in your office.\"</p><p>\"Oh, well, that's fine then.\"</p><p>\"I wouldn't call that exactly fine,\" Jeannie began, but Michael had already turned away, gently touching Jeannie's elbow.</p><p>\"Hon, would you tell the kitchen they need to send up more-\"</p><p>\"Wait.\"</p><p>Sinclair might not have been a Pack member, but he had no trouble seizing control of a moment . . . Everybody stopped and looked at him.</p><p>\"Michael,\" Sinclair asked quietly, almost gently, \"where is the baby?\"</p><p>Michael frowned and cocked his head, as if listening to a voice from another room. \"What baby?\"</p><p>\"That's it,\" Jeannie said firmly. \"I'm taking you to a doctor. Right now.\"</p><p>\"I'm not sure it's something a doctor can fix,\" I said, mentally reeling. I mean, I really needed a minute here.</p><p>As soon as Michael had turned his back, he'd forgotten-again-about BabyJon. Derik wouldn't go anywhere near the kid. And the other werewolves seemed to be picking up on Derik's extreme stress. Only Sara seemed unperturbed.</p><p>\"Perhaps it's time to go,\" Sinclair murmured, his fingers clutching the back of my chair.</p><p>Perhaps it was time to call the local mental hospital with some new admits. \"Uh, okay,\" I said, slowly getting to my feet. BabyJon, unmoved by recent events, yawned against my neck. \"Well, thanks for the-uh-snacks. I guess we'll-\"</p><p>\"We're not going to actually let them get away with this, are we?\" A petite, dark-haired woman with a severe buzz cut was standing on the fringe of our small group. She was dressed in black jeans and a black button-down shirt, and it took me a minute to place her.</p><p>It was Cain-one of the werewolves who'd come to the mansion looking for Antonia earlier in the week.</p><p>\"She gets Antonia killed, then brings some sort of ensorcelled infant-if that's what it really is-and we're just going to let her walk?\"</p><p>\"Cain.\"</p><p>\"Well, are we?\" she cried, turning to face the man who towered over her. He, too, was dark and whip-thin. He, too, looked weirded out but, even more than that, he seemed almost embarrassed. For her or for me, I had no idea. But I wasn't going to bet the farm it was me.</p><p>\"That's for the Council to decide,\" the quiet, dark-haired man said. \"Not us. And not here.\"</p><p>\"But she got Antonia killed! And she doesn't even seem to care!\"</p><p>And that was just about enough. \"I didn't get Antonia killed,\" I said, and I could practically feel ears pricking up all over the room. \"You did.\"</p><p>Sinclair pinched the bridge of his nose and shook his head.</p><p>\"And then she-what?\" Cain's jaw sagged and she turned to fully face me. \"What did you say to me?\"</p><p>\"What's wrong? Should I get a megaphone? Do you not understand English?\" Smiling, I beckoned her closer and, when she bent to hear, I said loudly, \"I didn't get Antonia killed. You did.\"</p><p>Cain jerked away and rubbed her ear. A few more werewolves sidled over. Sinclair was still shaking his head and looking like the before picture of a sinus headache commercial.</p><p>\"I am so sick of this bullshit,\" I said, knowing my voice was carrying, knowing everyone in the room could hear me, and not much caring. \"I guess it hasn't occurred to any of you to ask yourselves what the hell Antonia was doing living with vampires in the first place. Oh, hell no! After all, it's much more convenient to blame us than face the fact that she couldn't get out of here fast enough.\"</p><p>\"And now,\" Sinclair sighed, \"we fight.\"</p><p>\"Here,\" I said, thrusting BabyJon toward Sara, who scooped him up and backed off a couple of steps. BabyJon let out a pissed-off yowl, ignoring Sara's attempts to soothe him.</p><p>\"You can't pass the buck that easily,\" Cain retorted. \"You were the leader; she was your responsibility.\"</p><p>\"She was a grown woman, you nitwit! You're making it sound like she was my kindergarten student.\"</p><p>\"You're still passing the buck,\" someone else said, a werewolf I hadn't met.</p><p>\"And you're all conveniently overlooking the fact that not only did you practically drive her to my front door, I didn't see any of you assholes ever come to visit.\"</p><p>\"She was her own person,\" that same werewolf said.</p><p>\"Well, which is it, dipshit? Either she was a grown woman who could take care of herself, or she needed me to shelter and protect her. You can't have it both ways.\"</p><p>\"We're getting a bit far afield,\" Sinclair began, but I bulldozed right over him.</p><p>\"She didn't get a single phone call the entire time she lived with us. The only time anyone bothered to show up was after she missed her weekly military check-in, whatever it was. When your info pipeline into the vampires suddenly got cut off, then you showed up.\"</p><p>A furious gabble of voices rose, and rose, and I had to shout to be heard over the din. \"Not to mention, not to mention, you guys clearly didn't want much to do with her while she was alive. So all this postmortem concern is a pile of crap. You guys look stupid trying to come off all morally outraged when it was your fault she was living in my house in the first place.\"</p><p>The babble of voices got louder, but I was able to pick out one comment from the din: \"The bottom line is that she died in your service, so it's your responsibility.\"</p><p>\"If they're even telling the truth about how she died,\" someone else said. \"How can we ever know? She and her mate don't have a scent. They can make up any story they like and we'd never know the difference.\"</p><p>\"Oh, really? Okay. Here's a story, fuck-o. Once upon a time, there was a werewolf who could predict the future who lived on Cape Cod. And all her supposed friends and family went out of their way to avoid her because she wasn't exactly Miss Congeniality.\" I ought to know; I used to be one. \"And one day she moved away and never came back, and nobody in her Pack gave a rat's ass. The end.\"</p><p>More babbling. The din rose and rose. Shouts. Threats. Michael trying to get everyone to calm down. Sinclair rubbing the bridge of his nose. Sara looking like an increasingly nervous tennis match observer. BabyJon crying.</p><p>It was stupid, really. Stupid to forget how fast they were. Stupid to pick a fight in a room full of werewolves. I heard the crash of a chair splintering, and turned just in time to get stabbed in the heart with a chair leg.</p><p>That was pretty much when the lights went out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 26</p><p>Dude,</p><p>I swear my intentions were good. But I vastly overestimated Laura's state of mind and underestimated the rapidity with which things could deteriorate. And when Tina started having trouble sending and receiving e-mails, I honestly didn't make the connection until it was too late.</p><p>But I'm getting ahead of myself.</p> <p>More Satanists showed up and, instead of hiding from them or being embarrassed by them, Laura started briskly giving them orders. She spent a lot of time on the web finding charitable organizations where she could send the devil worshippers, and soon there were Satanists all over the metro area, cheerfully raising money for the homeless or participating in Meals on Wheels.</p><p>I admit, dude, I was proud of myself. I didn't go into medicine for the money, obviously, so helping people always put me in a good mood. And Laura, for all her advantages, needed me as much as any patient. It's just too damn bad I was too busy patting myself on the back to notice what was really going on.</p><p>Tina came and went, always on her own schedule, and I knew better than to ask her what she was up to. Mostly because it was none of my business, but also because she was as closed-mouthed about her work as I was about mine.</p><p>There had been a bad crack-up on I-35-no fatalities, thank God-so I didn't get home until about 2:30 A.M. I headed straight for the kitchen (I had finally gone grocery shopping, so there was actual food in the fridge), where I found Tina sitting at the counter with her laptop, muttering to herself.</p><p>\"Hey.\"</p> <p>\"Good morning,\" she said, not looking up.</p><p>\"Everything okay?\"</p><p>\"Mmmm.\" Then, thoughtfully, \"You had a busy night, I see.\"</p><p>Ah. Right. I had found it prudent to change out of my scrubs the moment I got home-or, even better, before I left the hospital. It didn't matter if the blood on me was ten minutes old or ten hours. They could always smell it.</p><p>\"Car crash.\"</p><p>\"Mmmm.\"</p> <p>I set about making myself a tuna sandwich while Tina pecked away at her laptop. She seemed a little off-annoyed, maybe, or distracted.</p><p>\"Everything okay?\"</p><p>\"Hmmm?\" She looked around as if noticing me for the first time. \"Oh. Yes, everything's fine. I'm getting a poor wireless signal. My e-mails to His Majesty keep bouncing.\"</p><p>\"So call.\"</p><p>\"I have.\"</p><p>\"Oh. You don't think anything's wrong, do you?\"</p><p>\"I'm sure they're fine.\"</p><p>I believed her. But I also knew what was bugging her. Tina lived for Betsy and Sinclair, the way most people lived for racing cars or marathons. When she couldn't keep in touch, she got antsy. Not unlike a drug addict going through withdrawal, to be perfectly blunt.</p> <p>\"Betsy answered my e-mail,\" I volunteered. It was a typical Betsy missive: bitchy and shrill. She really hated e-mail acronyms. The woman should really catch up to this century's lingo. \"I'm sure she's already won over the werewolves and they're somewhere partying like it's 1999.\"</p><p>Tina slapped the laptop closed and smiled at me. \"I'm sure you're right. Now, if you'll excuse me, I must go out.\"</p><p>To hunt. And feed. She was too polite to say so, of course. But I sure as hell wasn't going to stand in her way. A grumpy vampire is a homicidal vampire. Hungry ones were even worse.</p><p>\"Heck,\" I called after her, \"they've probably declared it National Betsy Day out on Cape Cod. You know she can win over just about anybody.\"</p><p>Yes, dude, I know. In retrospect that was beyond ignorant. But how was I supposed to know they were going to kill her?</p><p>Chapter 27</p><p>I opened my eyes and saw a ring of tense faces above me. The first few times this had happened to me I'd been badly startled, but now I was getting used to being killed and then brought back to life.</p><p>\"Ow,\" I commented, sitting up. There was a sizeable hole in my blouse and suit jacket. Not to mention an unconscious werewolf three feet away. And BabyJon was still howling. \"You'd better give him to me.\"</p><p>Wide-eyed, Sara knelt beside me and obliged. BabyJon hushed at once, giving me a chance to take a good look around.</p><p>\"Oh, man,\" I said, eyeing the werewolf who, I assumed, had driven a chair leg into my heart. \"Sinclair, what did you do to him?\"</p><p>\"I only hit him once,\" my husband replied in that faux-casual tone that didn't fool me one bit.</p><p>\"Where'd everybody go?\"</p><p>Aside from Sara, Sinclair, Jeannie, Michael, BabyJon, and Derik, the room was empty. Oh, and let's not forget the werewolf who killed me.</p><p>\"Michael cleared the room after you were attacked. Ah-it's none of my business,\" Sara continued, \"but why aren't you a pile of dust?\"</p><p>\"It's a queen of the undead thing,\" I said, trying to get my feet under me so I could stand. Sinclair gripped one of my arms, Michael the other, and they hauled me up. I stared down at my ruined suit and sighed.</p><p>\"I must apologize on the Pack's behalf,\" Michael said stiffly. He appeared calm, but I had the distinct impression he was mortified.</p><p>And Jeannie was pissed. \"There was no excuse for that. At all.\" She turned to Sinclair. \"You should have torn his damned head off.\"</p><p>\"Maybe next time,\" my husband replied.</p><p>\"Again, I apologize.\" Michael nodded at the still-snoring werewolf. \"He will be dealt with; you have my word.\"</p><p>\"No, don't.\"</p><p>\"Sorry, what?\"</p><p>\"Just forget it.\"</p><p>\"Elizabeth,\" my husband began warningly.</p><p>\"Let's not make things any worse than they already are. Look! No harm, no foul. I'm fine. He can buy me a new suit and we'll call it even.\"</p><p>\"Unacceptable,\" Sinclair said flatly and, wonder of wonders, Michael was nodding in agreement. Finally, they had a goal in common: ignoring my express wishes.</p><p>But for a change I had the chance to be the better man-so to speak-and moved to take advantage of it. Maybe I was beginning to think more politically in my old age. \"I mean it, you guys. Let it go. It was a bad situation for all of us. It's not like I didn't provoke him. Come on, let's forget about it and move on. This Council thing-when are we supposed to talk to them?\"</p><p>\"Tomorrow,\" Michael said, giving me a look I'd never seen on his face before. Grudging admiration? Disbelief in my sanity? Maybe he just had to use the bathroom. \"Midnight.\"</p><p>Ah, yes. Midnight. Not too big of a cliche. But I kept that to myself-I'd shot my mouth off enough for one night.</p><p>\"So, we'll be there. But let's call it a night for now. I don't know about you guys, but I've had about all the excitement I can take for one day. Night. Whatever.\"</p><p>Sara laughed; she was the only one who did. But at least the others seemed to tacitly agree, because they fell back and let Sinclair, BabyJon, and me get back to our suite.</p><p>\"Are you okay?\" I muttered out of the side of my mouth, patting BabyJon on the rump. Hoo! The boy needed a diaper change in the worst way.</p><p>\"I am deeply, deeply regretting not putting my fist through your attacker's skull,\" Sinclair replied neutrally.</p><p>\"Don't worry. There's always tomorrow.\"</p><p>Sinclair snorted, but seemed to lighten up. That was a good, good thing. I'm sure the werewolves were all badass and everything, but none of them had a thing on my husband, who wasn't only a) the king of the vampires and b) old and wily, but c) wouldn't tolerate people messing with me.</p><p>If they hadn't learned that after tonight, there was no hope for them, and no hope for reconciliation. And then what?</p><p>War, maybe. A vampire/werewolf war.</p><p>Swell. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 28</p><p>My king,</p><p>Things here are as well as can be expected. I have reviewed the quarterly report from your holdings in Los Angeles and it seems the new security system for the company's web server is doing the job.</p><p>Laura seems to be entertaining quite a bit in your absence; it seems there are always strangers in the house. Neither Marc nor Laura has said anything to me about them, so I am respecting their privacy and assuming they are trying to fill the void left by the absence of you and the queen.</p> <p>I trust this finds you and Her Majesty well. If you require anything of me, do not hesitate to contact me at once. In the meantime, I have FedExed copies of the contracts for your most recently acquired properties. Please review them at your leisure, sign them if they are satisfactory, and return them to me. I will then take the next step.</p><p>My love and fealty to you both.</p><p>-Tina</p><p>\"See?\" I whined. \"Why can't I get e-mails like that? Not only is it clear and understandable, it's in English!\"</p><p>\"My love, what in the world are you talking about?\"</p> <p>\"Look!\" I stabbed a finger at the printout of Marc's latest rambling.</p><p>hey, grrrrl, miss you bad. things out here are BTW, but I've got a handle on it. Laura says howdy and wants you to GBH ASAP. tell your magically delicious hubby to answer tina's e-mails; the grrl is FRO! later, marc.</p><p>\"I have no idea what he's talking about,\" I muttered. \"This might as well be in French.\"</p><p>\"What is a FRO?\" Sinclair asked, studying the printout.</p><p>\"My point! How should I know? When I send an e-mail, I actually spell words out. And use punctuation.\"</p><p>\"Light of my life, while I enjoy tirelessly listening to your never-ending litany of complaints, I believe we have slightly more pressing matters to discuss. For example, your attempted murder. And our appearance before the Council.\"</p> <p>\"Yeah, yeah. But we're getting back to this e-mail thing.\"</p><p>We'd been back in our suite for about twenty minutes. The first thing Sinclair did was strip me out of my ruined suit and blouse and examine me from head to toe. It was a waste of time-I was fine. But sometimes there was no talking to the stubborn cuss I had married.</p><p>\"So, dish.\" I had put BabyJon down for a midnight nap and was lying on our bed, covertly feeling my chest now and again. Nope, no gaping holes. \"What happened after I got stabbed?\"</p><p>\"Oh, the usual.Pandemonium. Violence. Threats. More violence.\"</p><p>\"You suck at narratives.\"</p><p>He bowed his head modestly. I knew I was wasting my breath (so to speak). Sinclair wasn't about to confess that he'd been scared out of his mind yet again. He liked to play it cool, even with me.</p><p>\"Logically, your attempted murder can only help us.\"</p><p>\"Gee, thanks. So glad to be of service.\" I sat up and swung my right leg out to kick him in the shin, which he neatly avoided.</p> <p>\"Elizabeth, you know exactly what I mean.\"</p><p>\"Michael's humiliated and mortified, which the Council will pick up on? Like that?\"</p><p>\"Yes. Like that.\"</p><p>\"They must have been pretty surprised when I got up off the floor.\"</p><p>He grinned. \"Yes, indeed. Once I was able to remove the chair leg from your sternum, you woke up almost instantly-and healed as quickly.\"</p><p>\"Glad to be of help. That Sara girl was nice. She was about the only one who was nice.\"</p><p>He shrugged and eased out of his jacket. \"Give them time. Your warped charm will eventually win them over.\"</p><p>\"Hypocrites. Is it just me, or did Antonia never get a call or a visit from these guys the whole time she was living with us?\"</p><p>\"It is not just you. But take comfort in the fact that in the last year of her life Antonia found love and happiness with us. Something she apparently could not get out here.\"</p><p>That was sad. These yo-yos were supposed to be her family. But nobody had much cared until she was killed. Hell, they hadn't even known she was in a committed relationship with another vampire-Garrett, who had killed himself about four seconds after he'd realized the love of his life was dead.</p><p>It was all too awful to contemplate and for a moment I envied Jessica, lying in a dark bedroom and sleeping through this entire rotten mess.</p><p>But that was no way to be; it certainly didn't solve anything. We had to move forward-even if it meant leaving some people behind.</p><p>Chapter 29</p><p>Dude,</p><p>It's really hard to write this. I'm embarrassed and mad at myself. But I'd better get it off my chest, so listen up.</p><p>I can pinpoint the exact moment I realized the shit was hitting the fan. It was the next morning, long after Tina had retired for the day. I was minding my own business, wolfing down a bowl of Special K and reading the latest John Sandford novel, when Laura bopped in.</p><p>She seemed more cheerful than usual, which was nice, because she'd been awfully stressed since Betsy and Sinclair left. And she looked even prettier than usual-and Laura was a beautiful girl-with her buttercup yellow sweater and faded jeans, her blond hair pulled back in its perpetual pony-tail, big eyes bright and sparkling.</p><p>\"Morning!\" she chirped, sitting across from me. \"Did I get any calls?\"</p><p>\"Uh, no. Are you expecting one?\"</p><p>\"Sure. I had this great idea and I have you to thank for it. I'll hopefully find out today if it worked.\"</p><p>Dude, I should have followed up right then. But I didn't. I figured she was involved with some church thing, or was working on a project for school. I'm an ER resident, not a shrink. How was I supposed to know she'd lost her mind?</p><p>Yeah, I know. It's all just a bunch of crap justification now. I should have been paying closer attention, and I wasn't. That's the long and short of it.</p><p>\"It's going to solve a lot of problems,\" Laura continued, and I admit I was barely listening to her. \"I've just been so worried about Betsy ever since she almost died (again) when Antonia got shot.\"</p><p>\"Betsy's always almost dying again.\" I was a little more sanguine about the vampire queen's resilience; I had seen many, many strange things since Betsy stopped me from killing myself a couple years back. \"She's like our own personal Kenny.\"</p><p>\"Kenny?\"</p><p>\"FromSouthPark. Pop culture reference; sorry.\" Laura tended to stick to network news and the Food Network. A single episode ofSouthParkwould horrify and disgust her. Sometimes the show horrified me, too, but I was still addicted to it. Nobody's perfect.</p><p>\"Where's Tina?\"</p><p>\"Conked out in her room-you know how it is with her. She won't be going anywhere until the sun's down.\"</p><p>\"I have something for her,\" Laura said vaguely. \"And some people want to see her.\"</p><p>\"Great.\" I yawned. New vampires were always stopping by the mansion to pay their respects. \"Thank God it's my day off. I need a break from sick people.\"</p><p>Laura giggled. \"That's an odd thing for a doctor to say.\"</p><p>\"Honey, all doctors say it. Just not around patients.\"</p><p>\"I'm sure that's-\"</p><p>The phone rang and Laura leaped to her feet, practically sprinting to get it before it rang again. I rolled my eyes; probably some church wanted her to run a fund-raiser or some such thing. Or maybe PBS was running another pledge drive.</p><p>\"Yes? Hello?\" She paused, listening. \"Okay, great! That's just great . . . uh-huh . . . really? Oh, you didn't!\" She laughed, then paused again. \"Uh-huh . . . you are? Terrific. Then I'll see you in a bit. Thanks very much.\" She hung up.</p><p>\"Good news?\" I yawned.</p><p>\"The best news. Okay, well, I've got to go. See you.\"</p><p>\"Bye,\" I said vaguely, and I was back into my book before she got to the front door.</p><p>So, so careless. Not to mention stupid. It's all fine and good to say now \"How was I supposed to know?\" except I had seen the effect the devil worshippers had on Laura. I should have been suspicious of her 180, instead of focusing on my own problems.</p><p>But I wasn't.</p><p>And, though I didn't know it, it was already too late. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 30</p><p>You mean someone killed you again? And I missed it?\" Jessica groaned and covered her face. \"Damn! I was washing puke from my clothes while you were getting murdered . . . Dammit!\"</p><p>\"You didn't miss much,\" I soothed. \"Just me picking a fight with a bunch of werewolves, getting stabbed, Sinclair kicking the crap out of my stabber, me waking up, and then everybody taking off.\"</p><p>\"Oh, sure. Sounds like a real snooze-fest. So what happens next?\"</p> <p>\"We're supposed to meet the Council tonight.\"</p><p>\"Why?\"</p><p>I shrugged. I was still a little vague on that myself.</p><p>Jessica and I were having a late-afternoon drink in the sitting room of my suite. Because it was barely five o'clock, BabyJon was still asleep, and so was Sinclair.</p><p>I had my own thoughts about that, but kept them to myself. See, Sinclair could move around during the day, he just couldn't go outside. The fact that he was choosing to stay under told me he was storing up his strength for whatever ordeal lay ahead. And, typical of Sinclair, he wasn't telling me any of the things he was worrying about.</p> <p>\"So, what?\" Jess was saying, blowing on her hot chocolate. \"You tell them what happened, and they do what?\"</p><p>\"I have no idea.\"</p><p>\"You shouldn't even be talking to them.\"</p><p>\"What?\"</p><p>Jessica sipped. Blew. Sipped again. \"You did what you had to do. Just like Antonia. So why should you have to explain yourself to a bunch of strangers who apparently never gave that poor girl a thought once she blew town?\"</p><p>\"It's why we came out here,\" I said. \"We knew we'd have to face the music one way or another.\"</p> <p>\"I don't like it. I never liked it. You shouldn't take the defensive.\"</p><p>I shrugged. \"Let's see how it plays out. A few hundred people noticed last night that I'm pretty tough to kill. And-holy crap, I forgot to tell you about what happened with the baby!\"</p><p>I summed it up for Jess, who was amazed. \"Come on. Michael really forgot you brought a baby out here?\"</p><p>\"He totally, completely did.\"</p><p>\"Weird.\"</p><p>\"Tell me! And Derik freaked out again.\"</p><p>\"Here all this time we thought werewolves were vulnerable to silver bullets, when it's dirty diapers that they fear.\"</p><p>I snorted with laughter, nearly spilling my own cup of cocoa. \"Oh, and I met this really nice woman-\"</p> <p>\"Let me guess: not a werewolf.\"</p><p>\"No, but she's married to one. She was really nice, for a crazy lady.\"</p><p>\"That's what they said about Lorena Bobbitt.\"</p><p>I shook my head at her. Jess could always cheer me up. She could always put things in perspective for me. I hadn't wanted her to come on this trip, but now I was glad she had.</p><p>\"This whole thing has me thinking.\"</p><p>\"I'll call the newspapers,\" she replied. \"Maybe even take a picture of you thinking and post it on a website somewhere. Dammit again! My phone's on the plane with Cooper.\"</p><p>\"I'm sure they have phones here if you need to make a call.\"</p><p>\"Not this time. You're the one I always call-God knows why-and you're just across the hallway. By the way, these walls aren't soundproofed. You think you can keep it down while you're making the beast with two backs?\"</p><p>\"Knock it off, you bitch. I've been thinking that Michael and I are very different kinds of leaders.\"</p><p>\"Well, you don't like to lead anybody. You've been saying since day one that vampires should police themselves.\"</p><p>\"Right. But see, Michael knows how many werewolves are in the Pack. He knows where they live and who they are. But me, not so much. I have no idea how many vampires are running around. And even if I did, I'd have no idea how to get in touch with them. Say, God forbid, there's a war between vamps and weres. We'd be fucked, because the werewolves are a species. They're born werewolves and they know who they are and where they're going. But vampires are made. Violently made. So why should they feel any loyalty to other vampires? I sure don't. I mean, I'm loyal to Tina and Sinclair, but they're family. None of the other vamps are.\"</p><p>\"So there you are.\"</p><p>\"What?\"</p><p>\"Now you know what you've got to do.\"</p><p>\"Terrific. Care to share with the rest of the class?\"</p><p>\"Prevent a war. At all costs, prevent a war. Because it sounds to me like you'd lose, and lose big.\" For once, Jessica wasn't teasing. She looked very sober and she was gripping her cup so hard her hands shook. \"You can't afford it, Betsy. None of us can.\"</p><p>\"They don't know I've got the devil's daughter on my side.\"</p><p>\"You really want to put Laura through that? That girl's already walking a fine line between too good and really nuts.\"</p><p>\"You're right. It'd be a rotten thing to do.\" But I made a mental note to keep it in mind. If worse came to worst, we'd fight. And if worse came to terrible, I had the devil's daughter as my secret weapon.</p><p>I guess that's what being a leader meant. Using people for your own ends, even if you knew it was a bad idea.</p><p>Great.</p><p>Chapter 31</p><p>Jess had gone back to her room to get dressed for the Council, and Sinclair was working away at his laptop, when I decided to get some fresh air. I was taking a stroll down the beach when I saw the ghost. She waved at me tentatively, and I waved back.</p><p>This had been one of the hardest things for me to get used to, almost as difficult to accept as the fact that I had to drink blood to survive. Like the kid from The Sixth Sense, I saw dead people. Also like that kid, they tended to scare the crap out of me. Given how scared I was of ghosts and zombies, I wasn't unaware of the irony that I was now one of the monsters. Didn't like it, but understood the grisly joke life (or death) had played on me.</p><p>Unfortunately, ignoring the ghosts just made it worse . . . When they saw I wasn't hopping to obey their edicts from beyond the grave, they got more aggressive. Hung around all the time. Popped out of nowhere when you were, say, having sex with your husband.</p><p>My favorite ghost-Cathie, victim of the serial killer Laura had killed-and my least favorite-the Ant-both came and went without warning. In fact, I hadn't seen Cathie in almost a year. This bummed me out a bit, and when I thought of her I always hoped she'd gone on to better things.</p><p>As for the Ant, I was just grateful she'd disappeared and hadn't come back. Yet.</p><p>So, though I didn't much want to, I walked up to the ghost and said howdy.</p><p>\"Excuse me,\" she said politely, interrupting me mid introduction. \"But how in the world can you see me?\"</p><p>\"Vampire.\"</p><p>\"But there are no vampires. And it's still light out.\"</p><p>\"There are, and it is, but it's a long story, so why don't you just tell me why you're haunting the beach so we can get on with our lives? Or deaths. What-ever.\"</p><p>The ghost, a pale brunette with her hair pulled back in a bun, appeared to think that over for a bit. She was wearing clothes that were clearly from the 1960s, poor thing (of all the decades to be trapped in, fashion-wise!), and was wearing cat's-eye glasses. We were far enough down the beach that my feet were getting wet as the waves slopped over them, but they just went right through the ghost's shoes without doing any damage. Luckily, I was wearing last year's sandals.</p><p>\"Would you mind giving a message to my son?\"</p><p>\"If I can find him, sure.\"</p><p>\"Would you please tell him I would prefer he not name his unborn child after me?\"</p><p>\"Seriously? That's it? That's why your spirit can't rest?\"</p><p>\"My name is Theodocia,\" she said.</p><p>\"Oh.\" The horror! \"Jeez. I'm really sorry. I'll be glad to pass that on for you.\"</p><p>\"Thank you kindly.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 32</p><p>Dude,</p><p>The shit officially hit the fan later that night. I was on-line, chatting with an old boyfriend from Oregon, when I heard a racket downstairs. I logged off and went to see what the problem was.</p><p>The problem was Laura, surrounded by people so completely deferential to her that I knew at once we had more devil worshippers on our hands.</p> <p>\"You did it?\" Laura asked. \"You actually did it?\"</p><p>\"It was easy, dread mistress! Two of us acted as bait, and we were able to surround it and kill it with no trouble at all.\"</p><p>\"Kill what?\" I asked, halfway down the stairs.</p><p>Laura looked up at me and the smile dropped off her face. \"Nothing, Marc. We're sorry to disturb you.\"</p><p>\"What's going on?\"</p> <p>\"The Beloved of Samael has told you: nothing. Now away with you, or you'll find out exactly what we killed,\" one of the half dozen around her snapped.</p><p>Laura rested her hand on his shoulder. \"Don't speak to him like that,\" she said quietly. \"He's my sister's friend.\"</p><p>Andyours, honey.</p><p>The man, taller than Laura by almost a foot, and at least thirty pounds heavier, instantly acquiesced, and even bowed his head in compliance. Good dog, nice dog, woof-woof-woof.</p><p>\"Laura, what the hell is going on?\"</p><p>\"Come into the kitchen and I'll explain.\" She turned to the group. \"You all know what to do. Come find me tomorrow and let me know how it went.\"</p> <p>There was a chorus of \"Yes, dread mistress!\" and \"At once, my lady!\" and then they all galloped toward the foyer leading to the front door.</p><p>I followed Laura to the kitchen, where she turned and gave me a smile that was much too bright.</p><p>\"I'm helping Betsy,\" she confided.</p><p>\"Uh-huh. Helping her how?\"</p><p>\"Well.\" Laura helped herself to a glass of milk, guzzled half of it, then continued. \"You know I've been worried about her ever since that awful, awful thing with Antonia.\"</p><p>\"Yeah,\" I said, still mystified.</p><p>\"I promised myself that if I could do anything to keep her from harm, I would. Anything in my power. Because she's my only sister, and she can't help being a sinner. None of us can!\"</p><p>Oh, cripes, I hated when she went on these pseudo-religious original sin rants. But I kept a pleasantly neutral expression on my face. \"And?\"</p> <p>\"Okay. So I've been trying to figure out just what I can do. And her and Sinclair going to the Cape is the perfect time, right?\"</p><p>\"Why?\"</p><p>\"Because she listens to him too much,\" she said impatiently. \"I warned her not to marry him, but she didn't listen. But with him gone, I only had Tina to worry about.\"</p><p>The hairs on the back of my neck were trying to stand up. Fortunately, thanks to years of practice as an MD, I was able to keep my expression neutral. \"Where is Tina, Laura?\"</p><p>She waved that away. \"Never mind. The important thing, the most wonderful thing, is that the sinners who keep finding me-they're helping me save Betsy! I never would have thought of it if it hadn't been for you, Marc.\"</p><p>Oh, shit. \"Maybe you'd better not give me the credit until you tell me exactly what it is you and the Satan Brigade have been up to.\"</p><p>\"Killing vampires!\" Laura said brightly, oblivious of her milk moustache.</p><p>\"Killing vampires.\"</p><p>\"Sure. They keep coming here to pay tribute, and we've managed to send almost a half dozen of them straight to my mother. Straight to hell,\" she added, unable to keep the dark satisfaction out of her voice.</p><p>\"Oh my God,\" I said, appalled. \"You didn't. Tell me you didn't.\"</p><p>\"Of course I did. We did. You were so right, Marc. Put the devil worshippers to work doinggood. And I have!\"</p><p>I felt my stomach drop into my feet. I couldn't even begin to imagine how much trouble this was going to be . . . for Betsy, for Sinclair, for Laura, for me. And even if there were no consequences to killing vampires (ha!), Laura had clearly lost it.</p><p>Her affect was all wrong. She was smiling, laughing, happy. But her eyes had a flat shine that I didn't like, and she'd gone out of her way to keep this from me until I forced the issue.</p><p>Was I a sinner, too?</p><p>Expendable?</p><p>Sure I was. The fundamentally religious were not exactly known for their tolerance of homosexuality. Quite the opposite. I imagined it would only be a matter of time before Laura decided she needed to \"save\" Betsy from me.</p><p>Who were the vampires? What had they wanted? And what was going to happen when people realized the queen's sister was killing them?</p><p>Civil war?</p><p>Worse?</p><p>\"Where's Tina?\" I asked, struggling to keep my voice calm and even.</p><p>\"You don't need to worry about that, Marc.\"</p><p>\"But I am, Laura. She lives here, too. She's Betsy's friend, just like I am.\"</p><p>\"Oh, no!\" Laura looked shocked at the very idea. \"She's nothing like you, Marc. And you have to understand, I couldn't start helping Betsy until I got her out of the way.\"</p><p>Oh my God. She'd killed her. Tina was a pile of dust somewhere.</p><p>And it was all my fault.</p><p>I pulled out my cell phone, but Laura just shook her head and smiled at me. \"I cancelled everyone's cell service-you're all on the same plan.\"</p><p>That would explain the fact that instead of a cell phone, I was holding a useless piece of metal and plastic.</p><p>\"Oh, Laura,\" I said, and dropped my head into my hands.</p><p>Chapter 33</p><p>Betsy!</p><p>OMG you've got to get back ASAP because TSIATHTF!!!! Grab the gang and CBRA! Right now!</p><p>\"You see what I mean?\" I bitched, showing Jessica Marc's latest acronym-strewn e-mail. \"How am I supposed to make heads or tails out of this? He could be asking me to schedule a massage for all I know.\"</p><p>Jessica shrugged. \"Can't help you with that one. Gives me a headache just to look at it. Besides, don't you have more important things to worry about?\"</p><p>\"Damn straight. I had to listen to Sinclair's shrill bitching when he couldn't make his cell phone work. Big baby-you'd think the thing was permanently attached to his head. I suggested he call from the mansion, but his stubborn paranoia kicked in and he refused. He's sure the phones are all tapped. The thing of it is, he's probably right. Did you know the full moon is tomorrow?\"</p><p>\"Sure.\"</p><p>\"Can you-wait. You did?\"</p><p>Jessica gave me a look. \"I checked before we boarded the plane. Since we were heading into the belly of the beast, so to speak.\"</p><p>\"Yeah, well, I've had a few too many things on my mind lately to look up things like moon phases.\"</p><p>\"Yes, of course, for example: Is there a shoe sale at Macy's today?\"</p><p>\"I hate you.\"</p><p>Jessica shook her head and smiled at me. \"Nice try, but I know I'm your hero.\"</p><p>\"Hero,\" I began, \"isn't exactly the word I'd-\"</p><p>Sinclair stepped into the small sitting area before we could really get going, splendidly dressed in a dark suit and his Kenneth Coles.</p><p>\"You clean up good,\" Jessica commented, and he bowed his head in acknowledgment.</p><p>\"Are you all right, hon? You look a little distracted. Is your phone working now?\"</p><p>\"No, they're claiming someone cancelled our service and it will be a few hours before the cells work. And Tina hasn't responded to my e-mails.\"</p><p>The man did pick the oddest things to fret about. \"It's probably a bad signal or something. Besides, don't you think we've got slightly more pressing things to worry about?\"</p><p>\"No doubt, my love. I suggest we try to reconcile with the Council tonight so as not to face several hundred angry werewolves tomorrow evening.\"</p><p>\"Say it twice,\" I said, inwardly groaning. Man oh man, the hits just kept on coming. I actually envied Marc, back in St. Paul with nothing more pressing to worry about than whether or not he had time to hit Cub Foods before his shift started.</p><p>Lucky bastard. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 34</p><p>We were back in the ballroom, except it had been set up almost like a courtroom. A long table was at the front of the room, and hundreds of chairs were scattered about.</p><p>Because we weren't sure just what everyone's problem with BabyJon was, I had prevailed upon Jessica to watch him for me during the whole Council thing.</p><p>She'd protested-boy, had she protested, my ears were still ringing-but finally agreed. Good thing, too, because after last night I didn't trust anyone out here to watch him, except maybe for Sara. And I didn't like asking favors from someone I'd just met.</p> <p>I had dressed up for the occasion, as Sinclair had, in a knee-length black dress with a simple strand of pearls my mom had given me for my sweet sixteen. Manolo pumps in deep purple-they went with almost everything, especially black-completed the picture of a sophisticated vampire queen (ha!).</p><p>\"Perhaps we should discuss a plan in case things do not go our way this evening,\" Sinclair murmured, his hand on the small of my back as we walked in.</p><p>\"Run like hell?\" I suggested, and he grinned, whip-quick, there and gone almost before I could register the expression.</p><p>Michael came forward to greet us, Jeannie right beside him as usual. \"Hello, Betsy. Hello, Eric. Thank you for coming.\"</p><p>Sure, pal. Like we had a choice.</p> <p>\"I'll introduce you to the Council, and they'll ask you some questions about what happened the night Antonia was killed.\"</p><p>\"As you like,\" Sinclair said politely.</p><p>\"Good luck,\" a familiar voice said, and I turned and saw Sara, who looked ready to pop at any second. Extremely pregnant women make me nervous; it's like hanging around a ticking time bomb. \"I'm sure you'll be fine. Where's the baby?\"</p><p>I started to answer, when Michael said, \"What baby?\"</p><p>Seriously? He'd forgotten about BabyJon again? Okay, that was enough. Once this Council thing was taken care of, I was getting to the bottom of this. It was just too effing weird.</p><p>\"Never mind,\" I said hurriedly before Sinclair, who looked decidedly bemused, could answer. \"Can we just get going with this, please?\"</p> <p>\"Of course.\" Michael gestured to two chairs, then turned on his heel and headed toward the front of the room. Derik materialized out of the crowd, said nothing to either of us, then grabbed Sara's hand and away they went.</p><p>I felt bad for him, to tell the truth. Grief was completely fucking him up-he was nothing like the easygoing blond fellow I had met earlier.</p><p>Worse, I knew that kind of grief was at least half guilt. He'd never forgive himself for not being there to save her. For not making her feel wanted here, so she wouldn't have moved away.</p><p>\"All right, everyone. Attention, please.\" Michael didn't need a microphone; his voice carried perfectly, and the murmuring died down at once. \"We're assembled here this evening to discuss the death of Antonia Wolfton, who left our territory on a quest to the Midwest and never returned.\"</p><p>Well, hell. Anything sounded bad when you put it that way.</p><p>\"Giving testimony tonight are Eric Sinclair and Elizabeth Taylor.\" I mentally groaned when he said my full name, and tried to ignore the snickers from the crowd. I cursed my mother under my breath for the zillionth time.</p><p>\"They govern the vampire nation,\" Michael continued, \"and have agreed to appear before the Council.\"</p><p>One by one, Michael introduced the Council members to us. I was a little surprised that they were all women-except for Michael. Maybe werewolves had a more, what d'you call it-matriarchal society?</p> <p>Anyway, they ranged from middle-aged to elderly, all shapes and sizes. They took their seats at the big table up front, and the Q&amp;A began.</p><p>Chapter 35</p><p>Dude, dude, dude.</p><p>I've been all over the mansion. Every room, every closet, every inch of the basement and the attic. The garage. The grounds.</p><p>I can't find Tina anywhere.</p><p>I don't know what to do.</p><p>I can't call the cops, for any number of obvious reasons. \"Well, Officer, the devil's daughter has lost her mind, and is killing people who are already dead. She's doing it to keep her sister, the queen of the vampires, safe. Oh, her sister isn't here, she's on Cape Cod explaining to a bunch of werewolves why one of their own was shot to death in this very house. Sorry, we never got around to filing a police report. So could you get right on this, please?\"</p><p>I can't call Betsy or Sinclair or Jess . . . no cell service.</p><p>Worse, I snuck out to buy one of those disposable phone cards, only to be intercepted by three-three-devil worshippers, who escorted me politely but firmly back to the mansion.</p><p>I hadn't realized she was spying on me. And dude, let me tell you-she's got people everywhere. She's even got one at Verizon-that's the one who was making sure our cells went down and stayed down.</p><p>Talking to Laura does no good at all. She just keeps giving me that big sweet smile and assuring me that everything she'd doing is for Betsy's own good and really, maybe I should get more sleep because I seem awfully grumpy these days.</p><p>I can't call for help-Sinclair left the contact information with Tina.</p><p>And nobody's answering my e-mails.</p><p>Short of hopping on a plane bound for Logan, renting a car, driving to the Cape, and hoping I stumble across Betsy, Sinclair, and/or a werewolf, I'm out of ideas.</p><p>I even thought about nailing Laura with a trank, except I'm pretty sure one or more of her Satan-worshipping followers would slaughter me like a goat.</p><p>As if things weren't bad enough, my admittedly bizarre home situation is starting to affect my work performance . . . I tried to admit a five-year-old to the geriatric ward last night. And don't even get me started on the poor woman who asked for the morning-after pill . . . I gave her a Tums.</p><p>I cannot believe things have gotten so bad, so quickly.</p><p>I'm out of ideas.</p><p>Chapter 36</p><p>I was sitting at the front of the room, in what would be the witness chair if this was a courtroom. The Council was sitting to my left. Sinclair was right across from me, about ten feet away.</p><p>The room was jammed. Except for when Marc and I went to see Jim Gaffigan live, I'd never seen so many people in one place.</p><p>They were all perfectly silent. I could practically feel them all listening hard. It was like there were flies walking around in the back of my brain.</p><p>Through dumb luck I caught Sara's gaze and she smiled at me and nodded. If she'd been one of them, I might have taken some comfort from that. Well, at least there were two people in here who didn't want me to drop dead on the spot.</p><p>\"And then what happened, Mrs. Sinclair?\"</p><p>Oh, God, I'd almost forgotten the worst part. They were calling me Mrs. Sink Lair! Would the horror never end?</p><p>\"Well,\" I said, ignoring my husband's grin, \"we didn't know that the bad guy's son was behind everything. So we came back to the house and he was waiting for us. None of us saw him in time. He . . . uh . . .\"</p><p>I stared down at my hands. \"He was a cop. And he had a gun, of course. I think it was a .357.\"</p><p>\"You're familiar with firearms, Mrs. Sinclair?\"</p><p>\"Yeah. My mom started taking me hunting with her when I was twelve.\"</p><p>\"Very well. Please go on.\"</p><p>\"Well. Like I said, nobody saw him in time. But then Antonia shoved me, really hard. I didn't-I didn't see her get shot. I just heard the shots. I think he emptied the gun into her. It was at least five shots for sure. And she-Antonia, I mean-she-uh-\"</p><p>I clapped my hands over my eyes and told myself I wouldnotwouldnotwouldnot cry in front of these strangers, no chance, no way, ain't gonna happen.</p><p>So I burst into tears and said, \"I didn't even know who was shot until I rolled her over. I thought-she was a werewolf and I thought you needed s-silver bullets or s-something like that, but she was just dead. There was blood and the stink of gunpowder, and we were all stuck in the hallway-there w-wasn't anywhere for us to g-go.\"</p><p>\"That is quite enough.\" Sinclair was on his feet, his voice lashing through the ballroom like a whip. \"My wife doesn't answer to the Council, or anyone here. Neither do I. We are here simply as a courtesy.\"</p><p>\"It's fine, Sinclair,\" I said, which was just about the biggest lie ever. It was far from fine. But it was almost over. \"There isn't much else.\"</p><p>\"What happened to the man who shot at you?\"</p><p>\"He killed himself. Tucked the gun under his chin and pulled the trigger.\" I suddenly remembered a detail I'd managed to repress. \"He used twenty-two longs.\"</p><p>The Council looked blank. I reminded myself that werewolves probably didn't have much to do with guns. \"Those are special bullets that ricochet around inside a person for maximum damage, but they won't go through walls and kill an innocent bystander.\"</p><p>\"Charming,\" one of the Council members muttered.</p><p>\"And then what?\" The head of the Council-the one who was asking most of the questions-seemed nice enough. Matronly, sort of. A headful of gray curly hair, big brown eyes. Laugh lines. And bifocals! I didn't know werewolves needed glasses.</p><p>\"Then-then nothing. Antonia was dead. The bad guy was dead. So I called Michael and-and you know the rest.\"</p><p>\"Why did you involve Antonia in vampire politics?\"</p><p>\"Involve her?\" I asked blankly. \"Involve her?\" A shrill giggle burst out of me before I could squash it. \"So, you never actually met Antonia, huh?\"</p><p>There was an amused rustling from the assembled crowd, but I didn't score any points with the Council, who scowled at me as one.</p><p>\"I only meant that Antonia did whatever the hell she liked. She wasn't afraid of anything, and she didn't take shit from anybody. Especially after she was able to change into a wolf during the-\"</p><p>\"What?\" The Council spoke as one (creepy!) and there was an excited murmuring from the crowd.</p><p>The head cleared her throat, and the room hushed. \"Mrs. Sinclair-\"</p><p>\"Please call me Betsy.\"</p><p>\"Mrs. Sinclair, Antonia was a hybrid.\"</p><p>\"Okay,\" I said.</p><p>\"Meaning she couldn't change into a wolf. She had other gifts.\"</p><p>\"Yeah, I know, she could tell the future. But see, she got kidnapped a while ago by a murderous librarian and when I rescued her and my husband-except he wasn't my husband then-I accidentally fixed it so she could change.\"</p><p>Dead silence.</p><p>\"Uh . . . so can I go now?\"</p><p>\"You 'fixed it so she could change'?\" the head of the Council asked, looking stunned. \"What do you mean?\"</p><p>\"I-you know. I fixed it.\" How could I explain something I didn't understand myself? It seemed like I discovered a new weird power every other month.</p><p>I heard someone clear his throat, and then Michael was standing. \"Mrs. Sinclair is quite correct. Antonia and I spoke frequently on the phone, and she explained to me that she was now able to change, thanks to the intervention of the vampire queen. In fact, Antonia was never happier in her life than she was in the final months with the Sinclairs.\"</p><p>My grip tightened on the arms of the chair as the room burst into noisy gabbling. Was this good for me or bad for me? I glanced at Sinclair, who simply raised his eyebrows at me. Fat lot of help he was.</p><p>\"Michael, why didn't you bring this up while she was still alive?\"</p><p>\"Why?\" I snapped. \"So you could welcome her back now that she wasn't a freak in your eyes?\"</p><p>\"Mrs. Sinclair, no one is speaking to you right now.\"</p><p>\"Too fucking bad. You guys aren't fooling anybody, you know. Pretty much everyone here made it clear they didn't want her around, so she left. Now she's dead, and you're trying to make it my fault, or my husband's . . . anybody but the Pack's. Meanwhile you're playing the blame game while Antonia rots in her grave. And for what? So you don't feel bad? So you can make me feel bad? Trust me, nothing anyone says here today is going to hurt me more than I've hurt myself. You can't punish me more than I've punished myself.\"</p><p>Sinclair was nodding solemnly, as if listening to something both wise and wonderful, but his hand was up, covering his mouth so no one could see him smile.</p><p>There was that feeling of flies in my brain again, and it took me a second to realize what was wrong. Before, the Pack had viewed me as an annoyance, a blundering idiot who'd gotten one of their family killed. Now they were seeing me as an active threat . . . who'd gotten one of their family killed.</p><p>Was this good for me, or bad for me?</p><p>The way my luck was going? Please. So, so bad for me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 37</p><p>Betsy, you have to have to have to come home! Laura has LHDM! Quit dicking around on the Cape and CHRTM!</p><p>\"You're right,\" Jessica said, squinting at the printout of Marc's latest gabble. \"It's pretty incomprehensible.\"</p><p>\"I'm not answering him until he writes like a grown man instead of a thirteen-year-old girl. He knows how I feel about all the silly e-mail faux-netiquette garbage. And, hello? I've only got about fifty bigger problems to worry about.\"</p> <p>\"Yeah, I know. So finish already! You told the Council that you gave Antonia more superpowers than she already had, and then what?\"</p><p>\"Then they decided to call it a night. I'm supposed to answer more questions later.\"</p><p>\"Later, when? Tonight's the full moon.\"</p><p>\"I know. I guess tomorrow night, maybe. Or-wait. Isn't the full moon usually for a couple of days?\"</p><p>Jessica, who had been walking beside me down the beach, stopped and stared at me. I shifted BabyJon to my other arm and faced the dragon: \"What? Something's on that so-called mind of yours. Spit it out.\"</p> <p>\"This is crap, Betsy,\" she said, kindly enough. \"You've done everything they've asked. You did everything you could for poor Antonia, and then some. But because they found out you're a lot stronger than they ever imagined, they're assuming you can just hang out until they have everything settled their way? Bullshit.\"</p><p>\"So, what? We leave before they're satisfied? How does that fix anything?\"</p><p>\"I don't know, but I sure don't like how you're letting them push you around.\"</p><p>\"Well, they do sort of outnumber me seventy thousand to one.\"</p><p>\"That's worldwide. There can't be more than three thousand on the Cape.\"</p><p>\"Much better odds,\" I said glumly.</p> <p>\"Look, that's part of the reason I had to break up with Nick-\"</p><p>I moaned and covered my eyes. \"Something else to hate myself for.\"</p><p>\"Oh, just stop it,\" she scolded. \"I don't blame you-even if he does-and he made his choice.\"</p><p>\"Yeah, but-don't you miss him?\"</p><p>\"Every day,\" she replied quietly. \"But letting him stay in my life was going to cost too much. Even for me.\"</p><p>\"I wish . . .\" I trailed off. \"I don't know. I wish for everything, I guess.\"</p><p>\"You can't tell me Sinclair is fine with all of this.\"</p><p>\"No, he's pissed. I mean, he got pissed during some of the questioning. Then he thought the rest of it was funny.\"</p> <p>\"Your husband is a whack job.\"</p><p>\"Tell me. But that's not even my biggest problem right now.\"</p><p>\"Split ends?\" Jessica inquired.</p><p>\"Shut your cake hole.\"</p><p>\"Ah, cake. That reminds me, I missed lunch today.\"</p><p>\"Can you stay focused, please?\"</p><p>\"Sorry, forgot-only for a minute-that everything's about you all the time.\"</p><p>\"I've mentioned my deep hatred for you, right?\"</p><p>\"Twice today.\"</p><p>\"What I'd like to know is what's the deal with my brother?\" I patted BabyJon on his diapered rump; sunset was about half an hour away. \"Derik acts like BabyJon's head can spin all the way around, and Michael keeps forgetting I even brought a baby! Something is rotten in Hallmark.\"</p><p>\"Denmark.\"</p><p>\"Right.\"</p><p>\"Don't take this the wrong way, Betsy, because I know you love him, but he is the spawn of the Ant and your dad. Who knows what twisted up his DNA?\"</p><p>\"That's fair enough,\" I admitted. We were slowly making our way from the beach to the mansion. \"Especially when you consider the Ant's other kid.\"</p><p>\"There's nothing wrong with Laura that getting laid wouldn't cure.\"</p><p>I started laughing so hard I nearly dropped the baby. \"That's quite enough about my siblings from you,\" I said, trying (and failing) to sound stern.</p><p>\"Somebody's got to help you keep it real.\"</p><p>\"Nobody's said 'keep it real' for about five years.\"</p><p>We walked through the front door and into the large receiving hall, and I still wasn't used to the immensity that was Wyndham Manor. It made our place in St. Paul look like an RV. I was about to comment on that to Jess when I noticed a bunch of people running toward us.</p><p>I instinctively clutched the baby-What now, for God's sake?-only to see them run straight past us.</p><p>\"Betsy, oh my God! Look!\"</p><p>I spun and looked. A kid-twelve? thirteen?-was falling, oh my God, he was actually falling from the third-level landing, headed straight for the marble floor. I thrust BabyJon at Jessica, but it was too late and the poor kid hit the floor with an awful, wet smack.</p><p>Chapter 38</p><p>Call an ambulance!\" I screamed as a ring of adults surrounded the boy. \"He's-what the hell?\"</p><p>He was growling. At least three adults went reeling backward, and I saw a blurred face, lots of white teeth, a snarl of fur.</p><p>And the sounds, dear God, the sounds! It was the noise you'd hear coming from a slaughterhouse. Or if a cat was tossed into a pack of wild dogs. It was chilling; it was terrifying.</p><p>Suddenly Jeannie was there, hauling Jessica and me back by our elbows. \"You need to go,\" she said firmly. \"Now.\" She was practically carrying us; our heels were dragging across the floor. \"Right now!\"</p><p>\"What-what's going on?\" Jessica asked, trying to stare at the kid and extricate herself from Jeannie's grip while keeping her balance.</p><p>\"He's only eleven. This is his first change. You need to leave right now. He won't be able to-\"</p><p>More adults fell back. One of them spun right into Jessica, and she-oh my God, she-</p><p>She dropped my brother. Right in the path of a brand-new werewolf.</p><p>The crazed adolescent (was there any other kind?) charged at my brother and bit him. I screamed, high and shrill . . .</p><p>(Elizabeth? What's wrong?)</p><p>... and cried out for my brother, now surely dead at the hands of-</p><p>He was laughing.</p><p>BabyJon was laughing.</p><p>The new werewolf took off with his tail between his legs with at least three adults in pursuit, and suddenly the marble floor rushed up at me and hit me in the face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 39</p><p>\". . . maybe she . . .\"</p><p>\". . . couldn't have . . .\"</p><p>\"... her a minute ...\"</p> <p>\". . . just the shock . . .\"</p><p>I opened my eyes and saw Jeannie, Michael, Sinclair, and Jessica all peering down at me.</p><p>\"Hey, there you are,\" Jess said. She was, thank God, holding BabyJon, who was wriggling and whining to come to me. \"You fainted.\"</p><p>\"I did not faint. Vampires don't faint.\"</p><p>\"I know of at least one who does,\" Sinclair teased.</p> <p>\"What happened?\" I asked, sitting up.</p><p>\"We were hoping you could tell us,\" Michael said.</p><p>\"Hey, one minute I'm minding my own business and the next some poor kid is falling to his death-except he didn't die-and then trying to eat my brother. Who appears to be not eaten.\"</p><p>In fact, BabyJon appeared to be fine. Which was impossible. I reached up and took him from Jess, inspected him, and found nothing except some saliva. No bite. No blood. Unbelievable.</p><p>\"-don't normally go through their first change until thirteen or fourteen,\" Michael was saying. \"Aaron's only eleven; nobody expected him to change during this phase.\"</p><p>\"Is that why he did it while it was still daylight?\" Jessica asked.</p> <p>Nobody answered her, which was just rude. Super-Secret Werewolf Business, no doubt. And speaking of daylight, there wasn't much of it left. I imagine Michael was going to have to get furry pretty soon. Which meant-oh, shit.</p><p>\"Sinclair!\" I cried. \"This castle is practically all windows, what the hell are you doing out of our room?\"</p><p>He looked at me as if I'd suddenly grown another head. \"You were screaming,\" he said simply. \"In my head. I had to come.\"</p><p>\"He jumped down from the third-floor landing,\" Jessica added. \"I can't believe his femurs aren't in his lungs right now.\"</p><p>\"Gross,\" was my only comment.</p><p>\"I don't understand any of this,\" Michael said. \"You said Aaron bit the baby? You must be mistaken; there isn't a scratch on him. And whose baby is that, anyway?\"</p><p>Oh, for the love-</p><p>\"Wait a second. Wait.\" Jessica frowned. She frowned harder. Her eyes went all narrow and squinty. Her lips twitched. Michael and Jeannie looked alarmed, but I knew that expression. It was her It's on the Tip of My Tongue look.</p> <p>Then: \"Bite him.\"</p><p>\"What?\"</p><p>\"Bite the baby.\"</p><p>\"Nobody's biting anybody's baby,\" I protested. \"Least of all this one.\"</p><p>\"I'll bite him,\" Jeannie offered.</p><p>Jessica shook her head. \"It's got to be one of the vampires.\"</p><p>\"Ah,\" Sinclair said. \"I see what you're getting at.\"</p><p>\"Swell,\" I grumped. \"Somebody want to clue me in?\"</p><p>\"BabyJon may well be immune to dangers others would find crippling, even fatal.\"</p><p>\"He's not immune to anything,\" I protested. \"He's had colds. He's had shots at the pediatrician. He-don't do that!\"</p><p>Sinclair, moving with the spooky speed that, even after all this time, startled the hell out of me, dipped his head and slashed at BabyJon with his jaws. He made a rattlesnake look slow.</p><p>I lashed out and punched him in the eye before I knew what I was doing. Then, when I did know what I was doing, I slapped at his shoulders. It probably looked to the others like he was on fire and I was trying to put him out. \"What-do you think-you're doing?\"</p><p>\"Proving-ouch-Jessica's theory.\" He rubbed his eye. \"Look.\"</p><p>\"Look at what, you psychotic?\"</p><p>\"Look at the baby.\"</p><p>BabyJon yawned, unmoved by either a) the werewolf attack or b) the vampire bite.</p><p>\"He doesn't have a mark on him!\" Jeannie marveled. \"That's the most amazing thing I've ever seen!\"</p><p>\"What, you're saying he's-what? Invulnerable?\" I shook my head, feeling like I should be wearing a dunce cap. \"But he's not. You guys know he's not. He's skinned his knee crawling, he's-\"</p><p>\"Invulnerable to paranormal harm,\" Sinclair said, and Jessica nodded.</p><p>\"Wait a minute,\" Michael said. \"That's your baby?\"</p><p>\"Well, look who just caught up. Seriously? You guys think that's what it is?\"</p><p>\"I saw Aaron try to bite him,\" Jeannie said quietly. \"It would have killed a normal infant.\"</p><p>\"When did you have a baby?\" Michael asked, but I waved off his silly-ass questions.</p><p>\"So that's why Derik kept freaking out around him. He knew something was different about BabyJon, but not what. And-Jeannie, how would a Pack leader deal with something he could never hurt?\"</p><p>\"Why . . . I suppose he would try to gain dominance of some sort,\" Jeannie replied slowly. \"That's their nature. That's-\"</p><p>\"That's why Michael kept forgetting about BabyJon. He can't dominate someone if he doesn't remember him.\"</p><p>\"How long has this baby been here?\" Michael demanded, poor guy. He was sounding more and more bewildered . . . and the sun was dipping lower every second. Explanations would have to wait.</p><p>\"We'll tell you all about it,\" Jeannie promised. \"Later.\"</p><p>\"When you aren't furry and drooly and such,\" I added.</p><p>\"So a vampire can bite-and nothing will happen. A werewolf can chomp, a fairy can whack him with her wand-and nothing.\" Jessica paused, deep in thought. \"Nothing at all. Wow.\"</p><p>\"But why?\" Jeannie asked. \"Why would this baby be special?\"</p><p>\"It's a really long story,\" I said. \"Which I'll probably never tell you.\"</p><p>Jeannie laughed. \"That seems fair.\"</p><p>Chapter 40</p><p>Dude,</p><p>Not only is Tina gone, but her laptop is missing as well. I had hoped to use her e-mail address to get Betsy and Sinclair's attention, but a room-to-room search revealed nothing.</p><p>I was far too distracted at the hospital to do a reliable job, so I was taking unpaid sick time as I tried to figure out what the hell to do.</p><p>I managed to keep it casual as I asked Laura what she'd done with Tina's stuff, but just got another one of her insipid smiles and assurances that I didn't need to worry about a thing.</p><p>Ha. Worrying was more or less all I was doing. And each time Laura tried to assure me she hadn't lost her mind, she sounded a little less sane.</p><p>\"Marc, vampires are-with the possible exception of my sister-evil by nature. Betsy's life would be so much simpler if she didn't have to spend so much time policing monsters. And,\" she went on with the fervor of an evangelist, \"not only am I helping Betsy, I'm keeping the peace in the Twin Cities, keeping the devil worshippers busy doing God's work-it's all good.\"</p><p>\"Having me followed every minute of the day or night is God's work?\"</p><p>She had the grace to flush a little at that. Maybe she wasn't entirely gone. \"Marc, you don't know any better. You'll give Betsy all the wrong ideas. I want her to come home, too, but not until I've finished working on the surprise.\"</p><p>\"The surprise? You mean there's more to come?\" I tried not to sound as horrified as I felt.</p><p>\"Sure! Lots more. You'll see, Marc. Besides, they're for your own protection. We can't have anything happen to you, now can we?\"</p><p>\"Will you at least consider the possibility that you've gone insane?\" I asked, and got a soft laugh in response. She had thought I was kidding.</p><p>\"You worry too much.\"</p><p>\"What are you going to tell Betsy and Sinclair when they get back?\"</p><p>\"That I kept things safe for them,\" she replied promptly.</p><p>That you've gone looney tunes, I thought, but prudently kept that to myself.</p><p>I tried arguing with her for another ten minutes, and kept getting that sweet smile for a response. Dude, after a while I just wanted to whack that smirk off her face.</p><p>At least we still had an Internet connection, though what I knew about such things could be carried in an emesis basin. E-mails were about all I knew. Sure, I could have gone to an expert, a real techno geek . . . except I had Satan's Minions constantly on my heels.</p><p>In desperation I waited until she and the devil worshippers had left on another kill-all-vamps mission, then typed out a quick e-mail to Betsy. And sent it. And sent it. And sent it. And sent it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 41</p><p>Ah, there's my boy.\"</p><p>Jessica and I stared at each other, then Sinclair. It was almost two o'clock in the morning; the place was crawling with werewolves. I was a little curious and was interested in going outside, but Jessica was understandably nervous and had practically barricaded herself in the downstairs library.</p><p>And what a library! I swear, it was at least half the size of the New York City Public Library. Towering bookshelves, mahogany furniture, a row of computers . . . the only thing it was missing was a pair of stone lions.</p> <p>Maybe it seemed larger because it had been empty except for Jessica, me, and the baby. In fact, the mansion was practically deserted. But occasionally we could hear faint wolf howls from outside.</p><p>And now here was Sinclair bustling in and actually holding his arms out for BabyJon, formerly his number one rival for my affection.</p><p>\"Your boy?\" I asked, and Jessica raised her eyebrows.</p><p>\"You know,\" Sinclair said, hovering over the baby and me, \"it's not too soon to start planning his education.\"</p><p>\"He can't even walk yet,\" Jessica pointed out.</p> <p>\"Oh, I get it. BabyJon is invulnerable to paranormal harm, so suddenly you're taking interest in his well-being.\"</p><p>\"Elizabeth, you've got me all wrong.\" Sinclair had the nerve to look and sound wounded. \"As your husband, and his co-guardian, it's my responsibility to do right by this boy.\"</p><p>\"Sure it is.\" I handed BabyJon over and Sinclair was so startled he juggled the baby for a few seconds before holding him at arm's length. \"Okay, co-guardian. He needs changing.\"</p><p>\"Ah . . .\"</p><p>\"Don't even try to wiggle out of it,\" I warned. \"I've been dying to get out of here and walk around. Think you two can handle the kid for half an hour?\"</p><p>\"One of us can,\" Jessica said with a sly wink.</p> <p>\"Something smells awful,\" Sinclair moaned, and I practically sprinted out of the library before he could hear me laughing.</p><p>Chapter 42</p><p>It was a beautiful night-cool, with clear skies. The moon seemed to almost hang over Wyndham Manor, huge and white. There wasn't a cloud anywhere, and the stars seemed brighter and closer than they ever had been.</p><p>I started walking on the same path Lara and I had taken to the playground . . . Thanks to my vampire senses I could hear wolves running and walking and fucking all over the place. Two of them crossed my path, clearly playing Chase Me, but they moved so quickly I only got a blurred glimpse of tan fur and lots of teeth.</p><p>I must be out of my mind.</p><p>Well, that was always a possibility. But for once I wanted to take advantage of the fact that I, too, was fast and strong. I suppose if a few hundred of them ganged up on me I could be in serious trouble, but Jeannie had told me that werewolves didn't go feral during the full moon. They retained their human personalities, they just felt things more keenly. Sadness became depression; anger became fury; happiness became ecstasy. But no matter how deeply they felt something, innocent bystanders didn't get eaten.</p><p>Not that I was exactly innocent, but I think you know what I'm getting at. And it made sense-they had been coexisting with humans for millennia. People were bound to notice if gobs of mutilated corpses were found after each full moon.</p><p>I rounded the curve just in time to see the largest wolf I'd ever seen step out of the woods and block my path. Huge, with extremely light fur-almost white-and the biggest green eyes I'd ever seen. It was powerfully muscled and sat in the middle of the road, staring at me like a living statue.</p> <p>\"Uh, hello.\"</p><p>Nothing. Of course-what had I expected?</p><p>\"I, uh, come in peace.\"</p><p>Then I realized where I'd seen those eyes before-Derik.</p><p>Great. A werewolf who was pissed at me for getting his friend killed was now blocking my path. Ah, what a week!</p><p>I was suddenly so thirsty I could hardly stand it, but realized that was the vampire equivalent of adrenaline. The fight or flight reflex. The last thing I planned to do was bite him. It would be a novel way to be disemboweled.</p><p>\"Good dog,\" I said, wishing I had a Milk-Bone. Or a case of them. \"Uh-I wish Antonia was here with you right now. She was really happy when she was finally able to change.\"</p><p>Derik cocked his head, never blinking, and then-ulp-started walking toward me. Good-bye, cruel world.</p><p>He stopped at my feet and looked straight up at me. His head was bigger than a bowling ball. His paws were larger than my hand, even with all my fingers spread wide.</p><p>Is he gonna kill me?</p><p>Yup. He probably is.</p><p>Except he wasn't. He was just sitting there, staring up at me.</p><p>And all at once I stopped being nervous for myself and put myself in his shoes. Paws. His friend had died half a continent away, and he couldn't save her. Any more than I had been able to save her.</p><p>I knelt on the path. We were so close, our eyes were no more than eight inches apart.</p><p>\"I am so sorry about Antonia,\" I said. \"I'm sorry I couldn't save her. But you go on and stay mad at me, Derik. It's my fault she's dead. If I had it to do over, I'd have taken the bullets myself.\"</p><p>Derik threw back his head and howled-shrieked-at the moon. I thought my head was going to split. I thought my heart was going to split.</p><p>When I couldn't stand it another second, I flung my arms around his thick, furry neck. And did the thing I swore I wouldn't do again this week.</p><p>I cried and cried.</p><p>More wolves were padding out of the trees on either side of the road, one with Michael's black fur and distinctive golden eyes. They formed a ring around us, and the air was split again and again by the silvery, haunting howls.</p><p>Chapter 43</p><p>I got back to our suite just before dawn. As I passed through the rooms, I checked on BabyJon-sound asleep. Thank God he hadn't been hurt-could never be hurt, at least by werewolves and vampires. He was mine. I wanted him to live forever.</p><p>Sinclair, with his usual brand of magic-or perhaps because he knew me so well-was waiting for me. I went to him without a word and hid my face against his shirt.</p><p>\"Elizabeth, my own, my dear, shhhhh.\"</p><p>\"It's all going wrong,\" I cried, \"and I don't know how to fix it.\"</p><p>\"This is very unbecoming to the ball-busting queen I married,\" he said, trying to tease me into a smile.</p><p>\"But I want to fix it!\"</p><p>\"You are young, my own.\"</p><p>I sniffled and looked up into his black eyes. \"So?\"</p><p>\"So some things-many things-cannot be fixed. These people will have to be satisfied with your sorrow. You cannot give them any more of yourself.\"</p><p>\"No, but I can give you more of myself.\"</p><p>I went up on tiptoe to kiss him and his mouth pressed over mine, his tongue darting and stroking. I slipped his suit jacket off his shoulders as his fingers were busy with my blouse buttons.</p><p>In another few moments we were naked and falling on the bed together. I was clutching at him, kissing him wildly, biting him, drawing blood even as he was drawing mine.</p><p>His teeth slid into my jugular just as that other part of him slid between my legs. I crossed my ankles behind his back and returned every thrust, every nip, every kiss.</p><p>I took everything. And gave back what I could.</p><p>Sometimes, I figured, that's all anyone can do, even if they are the queen of the vampires.</p><p>He held me for a long time, after. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 44</p><p>It was the next afternoon, late-close to five o'clock. Sinclair was up and working on the laptop (all the shades were drawn, natch). I was moping around, wondering what more the werewolves wanted, wondering how much longer I'd have to stay on the Cape to prevent a paranormal war.</p><p>\"That's odd,\" Sinclair said.</p><p>\"What now?\"</p> <p>\"You've got several e-mails from Marc. Ah . . . thirty at least. And my damn cell phone still isn't working,\" he added in a mutter.</p><p>\"Torturing me with more bad grammar and acronyms,\" I muttered. I was so not in the mood.</p><p>There was a polite rap at the door, and when I opened it, Derik and Michael were there.</p><p>\"Okay to come in?\" Derik asked, looking a little more like his old self.</p><p>\"Ask him,\" I said nodding at Michael. \"It's his house.\"</p> <p>\"Yes.\" Michael smiled at me. \"We can come in.\"</p><p>Sinclair came into the sitting room, nodded politely and, seeming to know what was up, excused himself to give us a false sense of privacy (with his hearing, there was no privacy . . . not when we were only twenty feet away).</p><p>\"I, uh, wanted to apologize,\" Derik said stiffly. \"About before.\"</p><p>\"You don't have to.\"</p><p>\"I do have to, not least because if I don't, it'll get me in trouble with my wife.\"</p><p>I laughed. \"When is she due?\"</p> <p>\"Any second.\"</p><p>\"Yeesh.\" I've mentioned hugely pregnant women make me nervous, right? \"Well, good luck with all of that.\"</p><p>\"I wanted to tell you that the Council is satisfied with your testimony and thanks you for your cooperation.\"</p><p>I was silent. I wasn't the smartest woman in the world, but even I could smell Derik all over that one. Sometime today, when he woke up with two legs instead of four, he had fixed things with the Council.</p><p>\"Thanks,\" I said. \"I'm glad you-I'm glad the Council is satisfied.\"</p><p>\"On a more personal note,\" Michael said, giving me the friendliest smile I'd ever seen, \"my home and my lands are open to you and your husband anytime. I hope you'll come to see us again soon.\"</p><p>\"Oh. Well, thanks.\" \"Thanks\" seemed big-time inadequate, but it was all I could come up with.</p><p>Poof! Just like that, our troubles were over. It was hard to believe that we could just pick up and leave without werewolf repercussions.</p> <p>Sinclair rapped politely, then came into the room and handed me a hard copy of one of Marc's e-mails. It was such a disaster it actually hurt my brain to look at it.</p><p>Betsy!</p><p>CBN grrrl Laura's LHM and IDKWTD!!!!! Please you have to GYBBH ASAP! I am so not LOLing right now please please come!</p><p>\"It's the same message over and over.\"</p><p>I rolled my eyes. \"Who can make heads or tails of this? Maybe we should call him.\"</p><p>\"I have been. Nobody answers . . . and I can't reach Tina.\"</p><p>Huh. That was odd. Tina was available to Sinclair at all times.</p><p>Derik peeked over my shoulder. \"Holy crap. You'd better get going.\"</p><p>\"What?\" I looked at the gibberish. \"You mean you actually understand this mess?\"</p><p>\"You mean you don't? 'Come back now, girl. Laura's lost her mind and I don't know what to do. Please, you have to get your butt back home as soon as possible! I am so not laughing out loud right now. Please, please come!' \"</p><p>There was a short silence as Sinclair and I locked gazes. He looked as horrified as I felt.</p><p>\"Oh my God. Oh my-get Jessica. Get the baby. We have to go right now-oh my God, what's she done? Did she lose it and kill Tina?\"</p><p>\"You've got trouble at home,\" Michael said, not wasting our time with silly questions. \"Is there anything we can do to help?\"</p><p>\"I'll come with you, if you want,\" Derik offered.</p><p>\"No, that's-that's okay. I mean, thanks and everything, but you stay here with your wife. Sinclair, Jessica's got to call Cooper and get the plane ready.\" I was dashing around the room, scooping up clothes and flinging them in the general direction of one of the suitcases.</p><p>\"I've got some people at the airport,\" Michael said. \"I'll call ahead and make sure you're not unnecessarily delayed.\"</p><p>\"Great. That's great. Okay, let's-damn! I almost forgot.\"</p><p>\"Forgot what?\"</p><p>\"Your mom says not to name your daughter after her.\"</p><p>\"My-what?\"</p><p>\"Your mom.\"</p><p>\"My mom's been dead for twenty-\"</p><p>\"I know. But that doesn't change the fact that she doesn't want another Theodocia running around in the world.\"</p><p>That was how we left Antonia's best friend and the Pack leader: amazed and staring after us.</p><p>Chapter 45</p><p>I wasn't sure how Cooper had managed to shave thirty-five minutes off our flight time, and I didn't want to know. Sinclair's car was waiting on the tarmac for us when we landed, and the four of us piled in and took off.</p><p>Sinclair made that car move, getting us to the mansion in record time. Before we could even get to the front door, it was yanked open and Marc was framed in the doorway.</p><p>\"It's about damned time!\"</p><p>\"If you wrote your emergency messages in English, we would have been back three days ago. Where's Laura? Where's Tina? What's going on?\"</p><p>\"I haven't seen Tina in days. I think Laura might have done something.\"</p><p>We followed him through the house. \"What's she been doing?\"</p><p>\"You might as well see for yourself. Because even I don't believe it, and I've seen it.\"</p><p>He stiff-armed the door to the parlor, which swung open.</p><p>Sinclair, Jessica, and I stared at the goings-on.</p><p>He was right. I didn't believe it.</p><p>Chapter 46</p><p>The parlor was packed with people in dark hooded robes. Laura was standing at the front of the room, holding a clipboard.</p><p>\"Okay, then after you take care of the two vampires who got away last night, I need some of you back here. I was able to intercept a call to the house-I guess some vampires from Maine are on their way to pay tribute.\" Laura shook her head. \"Blasphemy. Then we'll-\"</p><p>\"What the fuck are you doing?\"</p><p>Laura glanced up, startled, and instead of looking ashamed or scared or sad, she looked delighted. \"Betsy! Thank goodness you're back. I've got so much to tell you.\"</p><p>\"Why,\" I demanded, \"are you meeting with monks in our house in the middle of the night?\"</p><p>\"Those aren't monks,\" Marc sighed. \"They're devil worshippers.\"</p><p>\"Devil-\" I suddenly realized what was going on. They were confusing Laura with her mother. But why would Laura have anything to do with-</p><p>\"Laura,\" Sinclair said in a calm tone that didn't fool me at all, \"where is Tina?\"</p><p>\"Oh, I had to get her out of the way,\" Laura said with Bambi-like sincerity. \"She would have tried to stop me. But I'm being rude. Everybody, this is my sister, Betsy, and her husband, Sin-\"</p><p>\"We don't need intros!\" I snapped. \"We need to find out where Tina is.\" Not to mention when you lost your mind.</p><p>\"I'm in a meeting right now,\" she said in a scolding mommy voice. \"I don't-\"</p><p>I hauled one of the robed morons to his-his? yep, it was a guy-feet and tossed him away. He bounced off the wall like he was a SuperBall, hands clapped to his face as his nose gushed blood.</p><p>\"I want you athholth out of my houth!\"</p><p>\"Protect the Beloved of the Morningstar!\" some other hooded freak yelled, and just like that, I had my hands full. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 47</p><p>Dude,</p><p>Thank God, thank God, thank God, Betsy finally came home and she brought the cavalry. I was torn between the urge to strangle her because she took so long, and hugging her because I was so relieved.</p><p>Even better, they caught Laura practically red-handed, which was even better, because it saved a lot of time.</p> <p>Unfortunately, Laura not only wasn't sorry, she wasn't even defensive. She seemed proud and happy that she had found a way to \"help\" Betsy, and the more she talked about the vampires she and her minions had killed, the more pissed Betsy and Sinclair got.</p><p>I've never been particularly scared of Betsy, but Sinclair was a whole different story. Even when he was pleasant, he could be sort of terrifying. And he wasn't being pleasant now.</p><p>I managed to haul Jessica aside and told her to get her ass out of here and take the baby with her-something fairly awful was about to happen, and I didn't want either of them to get hurt.</p><p>Jessica must have believed me, because she didn't make so much as a token protest. Just picked up the diaper bag, the baby in the car seat, and left.</p><p>Which left Laura, the devil worshippers, me, Betsy, and Sinclair. That's when things started to get a little on the violent side.</p> <p>When Betsy shoved one of the devil worshippers she gave him a bloody nose, so her fangs popped (you can always tell-she lisps, which is hilarious under most circumstances). And of course Laura felt obliged to protect her minion. Which is when the rest of them jumped us.</p><p>I still couldn't believe how quickly things had gone to shit. I should never have suggested to Laura that she find ways to work with the misguided morons who kept showing up.</p><p>Everything was my fault.</p><p>Chapter 48</p><p>I had just enough time to grab Marc by the collar, ignore his surprised squawk, and bundle him into the closest closet. The poor guy looked ghastly-pale, with dark circles under his eyes and at least three days of stubble. Clearly he'd been under stress during our little sojourn to the Cape. And no wonder, with the devil's daughter cracking up right under his nose.</p><p>As usual, things were happening so quickly I was having trouble keeping up. Even as a bunch of jerks in hoods rushed me, Sinclair was there, knocking and shoving and punching them out of the way.</p> <p>Which left me free to-</p><p>\"Laura!\"</p><p>Her big blue eyes, wide, got even wider as I hit her around the thighs in a low tackle. I knocked her backward a good four feet, and she slammed, back first, into the far wall of the parlor.</p><p>\"Betsy, have you lost your mind?\" Crazy Lady had the nerve to ask. \"Get off !\"</p><p>\"What'd you do with Tina, nut job?\"</p><p>\"Oh, I like that! After everything I've done for you, you can't even show me simple gratitude.\"</p><p>\"Gratitude?\" I almost gagged on the word. \"Thank you for going crazy? For killing our subjects and maybe even our friend? I'd like to put your fucking head through a wall.\"</p><p>\"Like this?\" she asked brightly and, cat-quick, she wriggled free of me, seized a yank of my hair, and drove me face first into the wall.</p> <p>My face blew up. Or at least, that's what it felt like. My nose was already dripping, and I was pretty sure there was a piece of wallpaper in one of my eyes.</p><p>Will you get it together? You're undead; she's not. You're stronger and faster; she's not.</p><p>As I reminded myself of essential facts of nature, Laura picked me up like a wolf with a cub and heaved me so hard I crashed through the wall and spilled into the next room.</p><p>I shook splinters out of my hair, wiped the blood from my face, and reassessed the situation. Clearly, Laura had been keeping secrets. Or had never come up with a tactful way to explain she had superhuman strength.</p><p>Which was my own fucking fault. She was the Antichrist, after all.</p><p>I'd even seen the breakdown coming. I'd just kept conveniently shoving it out of my mind. It seemed like there was always something more important claiming my attention: killing the old vampire king, my wedding, catching serial killers, my wedding, catching a crooked cop, my wedding . . . and now I was paying the price.</p><p>Worse, I wasn't paying it alone.</p><p>\"After everything I've done for you,\" Laura said reproachfully, standing and brushing bits of wall off her sweater. \"Clearly the undead have been a terrible influence on you.\"</p><p>\"And clearly your mother's been one on you.\"</p><p>As soon as it was out, I wished I could take it back. Because right in front of my eyes, Laura's mouth went thin and hard, and her hair turned red.</p><p>Never a good sign.</p><p>Chapter 49</p><p>Dude,</p><p>Betsy bundled me so efficiently and so quickly into the closet, I hardly had time to protest. And believe me, dude, the irony of me being back in the closet was not lost on me.</p><p>I hammered on the door, wanting to help them any way I could, but she must have jammed the knob with a chair or something.</p><p>Great. My friends were going to live or die ten feet from me, and I was helpless. I'd been helpless this entire week. No matter what I did, or tried, things just kept getting worse.</p><p>I'd been so happy to see Betsy and Sinclair. Now I wished I'd kept my mouth shut and kept them far, far away.</p><p>Chapter 50</p><p>Think about what you're doing, Laura.\"</p><p>\"I told you never to speak of her around me.\" She was striding forward and I was backing up-while trying to tell myself I wasn't backing up. Laura's hair went red when she was indulging a homicidal rage. My little sis definitely had a dark side.</p><p>\"Can't we talk this through-oooooh!\"</p><p>This time I crashed, back first, into the fireplace. Luckily it was a mansion-sized fireplace, not the little ones you usually see in houses these days. The thing was big enough to roast a sheep in. Or a vampire.</p><p>\"All right, enough is fucking enough.\" I crawled, coughing soot, out of the fireplace. \"No more Mrs. Nice Guy. I'm not pulling any more-\" That was as far as I got before I had to duck. Laura's clenched fist whistled over my head and went right into the wall.</p><p>She hissed in pain, yanked her hand free, and whipped around so fast she'd given me an eye-watering slap before I knew what was happening.</p><p>\"This isn't striking you as just a little bit psychotic?\" I asked. Too bad Laura wasn't bleeding; I could really have used my fangs about now.</p><p>\"You're the psychotic. Running around saving vampires instead of killing them, it's nonsense.\"</p><p>\"I've killed some vampires,\" I whined.</p><p>\"I have been trying to save your soul.\"</p><p>We were stalking each other, circling warily. \"My soul's fine. But you need to be on medication.\"</p><p>I could hear tons of racket from the other room-Sinclair, taking on the thirty or so devil worshippers by himself. I couldn't help him; I could only pray he wouldn't get badly hurt.</p><p>\"I destroy evil, so I should be medicated?\"</p><p>\"You've appointed yourself judge, jury, and executioner.\"</p><p>\"They're vampires!\"</p><p>\"So am I. Are you going to kill me, too?\"</p><p>\"No,\" she said sulkily. \"At least, I don't think so.\"</p><p>\"Laura, what's wrong with you? What happened while we were gone?\"</p><p>\"Marc gave me an epiphany.\"</p><p>\"What is that, an STD?\"</p><p>She rolled her eyes. \"He solved a big problem for me. He showed me the light.\"</p><p>\"I'll show you a light.\" I seized her by the hair (cat fight!), yanked her down sharply, and brought my knee up into her nose, which broke with a soft crunch.</p><p>Laura screamed. My sister was screaming. And bleeding. Here came my fangs-at the worst possible time. Just what Laura needed to see-a physical reminder that I was one of the evil beings she was trying to wipe off the planet.</p><p>I brought my hand up to hide my lips. \"Laura, I think if we dithcuth thith, we can-\"</p><p>Something bright swung toward me, something that shone like a small sun, something that hurt to look at. I ducked . . . and Laura's Hellfire sword whistled over my head.</p><p>Oh, this was getting better and better. First, the psychotic break. Then the red hair. Now her weapons. Laura could pull a sword, a crossbow, whatever, out of thin air and no matter what shape the weapon took, it was fatal to vampires.</p><p>And their queen. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 51</p><p>Dude,</p><p>The door actually split down the middle and, with judicious shoving, I freed myself . . . and promptly tripped over two unconscious devil worshippers.</p><p>Sinclair was a whirl of activity; I could only get the occasional glimpse of him when he managed to knock a bad guy away from him. And I realized why the door had been broken-he'd thrown someone into it so hard, the flimsy closet door had cracked.</p> <p>I tried to figure out who to help. Calling the cops was out, for obvious reasons. Getting between Betsy and Laura would be a quick and painful way to commit suicide.</p><p>So when a hooded jerk ran past me I caught him by the back of his robe, yanked him back, and smashed my elbow into the hinge of his jaw.</p><p>\"That'll teach you to mess with a licensed physician,\" I told the unconscious Satanist.</p><p>Then I ran to see if I could give Sinclair a hand.</p><p>Chapter 52</p> <p>I ducked again as her Hellfire sword whistled over my head, and sidestepped so quickly I tripped over a chair. I was in such a hurry to scramble to my feet that for a few seconds I ran in place, like the Road Runner.</p><p>Then I was up and backing away again.</p><p>\"You came back too soon,\" Laura said, circling me. Her knuckles were white on the sword hilt. If my eyes could water, they would have. It was like she was holding the sun.</p><p>\"Tell me about it,\" I retorted. And I thought I had problems on the Cape? Good God, I didn't know what problems were. \"I should have left BabyJon in charge.\"</p><p>\"You never mind about him.\"</p><p>\"Your mother infected him, too,\" I said brightly as a wonderful idea came to me.</p> <p>\"You shut up.\"</p><p>\"Yep. He's got demonic unholy powers-just like you!\"</p><p>\"I said. Shut. Up.\"</p><p>\"You know what they say . . . like mother, like dau-\"</p><p>She forgot about the sword and, the minute she wasn't concentrating on it, it disappeared . . . back to hell, or whatever unholy armory her weapons came from.</p><p>She hooked her long, slender fingers into claws and ran straight at me. They looked very long and very sharp. And pink! Blech.</p><p>I managed to grab her by the wrists and keep her hands away from my face. Sure, it was a cliche, but she really was trying to dig her fingers into my eye sockets.</p><p>We danced around in a tight, difficult circle, me holding on to her wrists for dear life-getting killed was one thing, but having my eyeballs clawed out was something else again-and her straining to mess up my pretty face in all sorts of nasty ways.</p> <p>\"Can't--we--just--get--along?\" I managed.</p><p>\"You go to hell,\" she snapped.</p><p>\"But I don't want to see your mom anytime soon.\"</p><p>\"Stop calling her that!\"</p><p>\"Fine. I don't want to see the fallen angel who gave you life. See? I didn't use the M word.\"</p><p>She yanked me forward, which I wasn't expecting, and gave me a savage head butt. Stars actually exploded behind my eyes and I sagged in her grip.</p><p>Which is when she picked me up and threw me out the window.</p><p>I heard the glass shatter but, fortunately, didn't feel it. Mostly because my entire face had gone numb. When the hell had Laura learned to fight dirty?</p><p>I'd actually thought I could take her, reasoning that I'd been in more fights than she had. It was only about the tenth time I'd underestimated the Big Bad.</p><p>I hit the lawn with a teeth-rattling thud, thought about passing out for a few seconds, then painfully climbed to my knees.</p><p>Where I spotted the feet.</p><p>Clad in Vera Wang strappy gold sandals in mint condition.</p><p>Only one creature in the galaxy has such great shoes.</p><p>I flopped over on my back and stared up into the devil's smiling face.</p><p>Chapter 53</p><p>Hello, Betsy,\" Satan said cheerfully. \"Having a bad week?\"</p><p>\"You,\" I groaned.</p><p>\"Yes, me. That's it? That's the best you can do? You were never the sharpest knife in the drawer, Betsy, when it came to rejoinders.\"</p><p>\"Fuck rejoinders. This is your fault. You drove Laura crazy.\"</p><p>\"I certainly did not.\" The devil had the nerve to look offended. She was a petite woman with gray-streaked hair pulled back in a bun. Her navy blue suit ruffled, showing her indignation.</p><p>\"Did, too.\"</p><p>\"No, I stayed well away from Laura.\" The devil smiled, revealing dimples. \"I might, however, said a word or two in Dr. Marc Spangler's ear.\"</p><p>\"Oh, man,\" I said. It occurred to me I was still lying on the lawn, broken glass everywhere, bleeding, and Satan was standing over me.</p><p>Yep. Things could not get any worse.</p><p>That's when Marc came sailing out the same window and landed right on top of me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 54</p><p>Marc squashed me so thoroughly it was a damned good thing I didn't need to breathe much. I lay on the grass like a landed trout, my mouth opening and closing, shoving and pushing at his carcass.</p><p>\"Betsy,\" Marc said, remarkably unharmed. Of course, I'd broken his fall. Stretch some rubber over me and call me a trampoline. \"This is all my fault.\"</p><p>\"It's not,\" I wheezed.</p> <p>\"No, really, it is. I-\"</p><p>\"Marc, do you think you could get the hell off me sometime today?\"</p><p>He leaned back, squashing just one lung now. \"I'm the one who-\"</p><p>\"It's not your fault. Marc, this is Satan. Satan, this is-\"</p><p>\"I know Dr. Spangler, thank you.\"</p> <p>Marc was gaping up at the devil. \"Satan? Laura's mother, Satan? That Satan?\"</p><p>\"How many do you know?\" I pushed him the rest of the way off me and climbed slowly to my feet. \"We're the flies in her web, as usual.\"</p><p>The devil shook her head. \"I never interfere with free will.\"</p><p>\"No, but you're sure good at inspiring it. I've got to get back in there.\"</p><p>\"But we were having such a nice talk. Where are you going?\"</p><p>\"I'm gonna go tell Laura what you did.\"</p> <p>The devil raised a dark eyebrow. \"You're going to tattle on the devil?\"</p><p>\"Damn right!\"</p><p>I began the painful climb back up through the window, pausing just long enough to tell Marc, \"Will you for God's sake get the hell out of here? Somebody's likely to get killed and I'd rather it wasn't you.\"</p><p>I'd rather it wasn't me, either, but I wasn't placing any bets on that one.</p><p>Chapter 55</p><p>Dude,</p><p>You are not even going to believe what happened next. I was there, and I hardly believe it myself.</p><p>I pulled another one of the hooded jerks off Sinclair-there appeared to be an unending supply-but one of them fell back so fast he knocked me through a window. It was a little like being in a Western. The window, luckily, had already been broken.</p> <p>By Betsy, whom I landed on. It was the closest thing to straight sex I'd experienced in years. Although I have to say, she was more bony than lush. It was those long femurs of hers.</p><p>Betsy, clearly squashed, managed a weak groan. I tried to explain what had happened, which is when she introduced me to the devil.The devil. Then she (Betsy) scrambled back through the window.</p><p>I decided there was a strong possibility that I was concussed, and reminded myself to watch for symptoms. Surely this was the result of a mind weakened by blunt-force trauma.</p><p>\"So, Marc. Let's talk. How have you been?\"</p><p>I gaped at her. This was Lucifer? The Fallen One? Samael? The Morningstar? She looked like a beautiful middle-aged, gray-streaked brunette with pretty shoes. And those ankles! I was getting straighter and straighter by the moment.</p><p>\"What do you want with us?\"</p><p>\"Nothing at all.\" The devil gazed thoughtfully at the broken window. \"Laura's my primary interest. The rest of you-you're just wrenches in the toolbox of life. Things to use. Tools.\"</p><p>\"That was a terrible analogy.\"</p><p>The devil gave me a decidedly unfriendly look.</p><p>\"Why don't you just leave Laura alone, to live her own life?\"</p><p>\"Dear boy. Even mothers who aren't me can't do that for their children.\"</p><p>\"She could have a happy life if you'd just leave her alone.\"</p><p>Satan snorted through her nose. \"Leave her alone? Never! She's been poisoned by humanity. She actually thinks what happens to other people matters. I have the cure for that diseased worldview.\"</p><p>I stood, brushing grass off my knees. \"I don't like you one bit.\"</p><p>\"Ooooh.\" The devil smirked. \"That one hurt. By the way, Marc, he knows.\"</p><p>\"What?\"</p><p>\"Your father. He knows all about you.\" She leaned forward and whispered in my ear, \"He has always known. Oh, Marc. How you've disappointed him. You should see him cry when he's alone and thinks no one's watching. Like you do, sometimes.\"</p><p>A sliver of ice pushed its way into my gut, but before I could think of a retort, or run away, the devil was gone.</p><p>Leaving the rest of us, of course, to clean up the mess she had instigated.</p><p>Chapter 56</p><p>Laura looked delighted to see me crawl back into the room. \"Good. I was hoping to beat the sin right out of your silly vain carcass, and I wasn't sure I had finished the job.\"</p><p>\"Your mother's in the yard.\"</p><p>Laura, already reaching for my throat, hesitated. \"Don't lie, Betsy. You've tried everything but that.\"</p><p>\"But she is. I just talked to her. She said she gave Marc the idea about how you could use your followers to kill vampires.\"</p><p>\"That isn't true.\" But she didn't look at all sure of herself. \"Marc would never hurt me.\"</p><p>She reached for me again and I batted her hand away. \"He's not the one out to push your buttons, dumbass! She is. This is, like, phase five of her plan to have you take over hell when she retires.\"</p><p>My ears rang and I realized she'd slapped me so hard and fast that I'd barely seen her hand move. \"Stop talking about her!\"</p><p>\"Laura, she wants you to do everything you're doing.\"</p><p>\"That's not true! I've been doing good! We've been killing demons!\"</p><p>\"No, you've been suckered. If you won't stop for my sake, or your own, then stop for no other reason than because it will completely foil your mother's wicked-ass plans for you.\"</p><p>Here came the bright light. Here came the sword, straight for my heart. Here came the killing blow, and thank goodness, because one way or the other, it meant the fight was almost over.</p><p>I sidestepped and punched Laura in the eye. She went down without a sound.</p><p>I didn't realize until it was too late that she'd swung wide on purpose. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 57</p><p>Sinclair staggered through the doorway, looking like he'd been through a hurricane. Or through a whole shitload of devil worshippers. Having vampire strength and reflexes was all fine and good, but it didn't mean that enough bad guys couldn't take a piece or two out of you.</p><p>His suit was in tatters; his face was streaked with blood. I imagine I didn't look much better. At least we were both standing. Well, leaning.</p><p>\"Some of them are dead,\" he informed me. \"Some of them ran off.\"</p> <p>Marc called from the other room, \"And some of them are going to need medical attention! I'll do what I can.\"</p><p>Sinclair took in the ruined room, the holes in the walls, the broken windows, Laura, unconscious on the floor.</p><p>\"Are you all right?\"</p><p>\"Shit, no. But I'll live. How about you? You look like somebody dropped you into a blender and pressed puree.\"</p><p>\"What a coincidence. That is precisely how I feel.\"</p> <p>I went to him and hugged him, closing my eyes as he stroked my back. \"Laura's mom was here.\"</p><p>\"That explains much.\"</p><p>\"It explains mucher than you know.\"</p><p>\"At least you won the fight.\"</p><p>I looked up at him. \"She could have killed me at any time. She threw the fight when she realized her mother had been pulling her strings all this time.\"</p><p>\"Ah.\"</p> <p>\"Yeah.\"</p><p>I imagined Sinclair didn't need me to spell out the ramifications for him. Given the way he was grinding his teeth, I knew he was equal parts pissed for me and frightened for me.</p><p>Because if Laura could kill me anytime-she'd hidden her strength and speed all this time, for one thing-who was really in charge around here? A mere vampire?</p><p>Or the devil's daughter?</p><p>And what about the next time Laura and I butted heads? Much as I hated to admit it, there most likely would be a next time. I couldn't count on her to throw every fight. Frankly, I was pretty sure she'd only thrown this one because I'd shocked her with the bald truth. There were only so many times I could play the sister card.</p><p>And next time, she wouldn't be taken off guard.</p><p>Next time, she might kick my ass straight into hell, and then bye-bye for every vampire she could get her hands on.</p><p>And she could get her hands on a lot. Especially since she apparently had followers who would do whatever she asked. Legions of them.</p> <p>It should have been over.</p><p>But it wasn't. We'd earned a temporary respite, that was all.</p><p>Chapter 58</p><p>Between Marc and Sinclair, they pulled enough strings to get the wounded to the hospital without us having to fill out reams of paperwork or answer unanswerable questions. Not for the first time I appreciated being married to a rich man who knew people . . . not to mention having Dr. Spangler as a roommate.</p><p>Sinclair carried Laura to the room she'd been staying in and laid her on the bed. She was going to have an unattractive shiner, but Marc checked her over and pronounced her merely unconscious.</p><p>We still had no idea where Tina was, so I stayed in the room listening to Laura's soft breathing, waiting for her to wake up.</p><p>After about half an hour, her eyes opened and she stared at the ceiling, then at me.</p><p>\"Welcome back.\"</p><p>\"Is it true?\" she asked hoarsely, and I realized with a stab of pity that she was afraid. \"Did my mother have something to do with all this?\"</p><p>\"Yeah, Laura. It's true.\"</p><p>\"I was so sure it was a good plan, the right plan. Instead of running from those-those people, I thought I was-oh, Betsy! How am I ever supposed to know what's my idea, and what's part of her plan for me?\"</p><p>The time was past for comforting lies. \"I don't know.\"</p><p>\"I'd rather be dead than be her puppet.\"</p><p>\"Can't we find a happy medium between those two?\"</p><p>She suddenly seemed to notice my ruined suit, the blood, my mussed hair, the way I was covered with bits of soot, wallpaper, and plaster.</p><p>Her face crumpled and she clapped her hands over her eyes. I leaned forward, grasped her wrists, and gently pulled her hands away from her face.</p><p>\"Come on, Laura. It's not fatal. This is why God invented dry cleaners. Also, it's going to be really, really awkward between us for a while. It might even ruin Christmas.\"</p><p>My lame-ass joke fell flat-deservedly so-and Laura burst into tears. \"I'm sorry,\" she managed, pulling free of my grip. \"I'm just so, so sorry.\"</p><p>She rested her forehead on my shoulder and I stroked her (blond) hair while she sobbed all over my already filthy suit. \"It's all right, Laura. We'll figure it out. Come on, enough with the waterworks.\"</p><p>\"I could have killed you.\"</p><p>\"But you didn't.\" You just killed a bunch of my people. But I'd have to address that later. I wasn't looking forward to it, that was for damned sure. \"You let me hurt you-punch you out like we were brawlers in a Western-rather than killing me. You know what that makes you?\"</p><p>\"No.\"</p><p>\"One of the good guys. Your white hat is in the mail.\"</p><p>\"No, it's not,\" she said again, and wept harder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 59</p><p>Traffic was light at this time of night, and Sinclair rode the gas pedal like he was in the race of his life. Which wasn't far off.</p><p>In next to no time (objectively, subjectively it seemed to take a week), we were at Laura's apartment in Dinkytown, opening the door to the spare bedroom.</p><p>Marc, Sinclair, and I all stared. Laura was studiously not staring.</p> <p>Finally I said, \"Devil worshippers brought a coffin up here and nobody noticed?\"</p><p>Laura shrugged. I moved forward and stripped the crosses off the coffin, off the inside door handle, and the windows-no wonder Tina had disappeared from the picture so completely. The crosses were more effective than bear traps.</p><p>I popped the top off of the second coffin in the same week. \"Hey, Tina? Rise and shine, it's time to-gggkkk!\"</p><p>Tina's hands had shot up and out and she was briskly strangling me while I gurgled and grabbed her wrists. \"Help me, you idiots,\" I choked, which seemed to break the spell . . . Marc and Sinclair both sprang forward to prevent Tina from snapping me in half.</p><p>The perfect end to a perfect week.</p> <p>They pulled her off me and Sinclair helped her sit up. She was terribly wasted, terribly old, but I knew some blood would fix her right up. She kept beating her withered hands at Sinclair's shoulders and trying to speak.</p><p>\"Be calm, Tina.\"</p><p>\"Yeah, be calm already,\" I added. \"We'll take care of you.\"</p><p>\"Laura,\" she whispered, so faintly I had to strain to hear. \"You have to watch out for Laura.\"</p><p>\"They know,\" Laura said, staring at her shoes.</p><p>Then Sinclair and Marc and I had our hands full keeping Tina from ripping out my sister's throat and taking a shower in the blood.</p> <p>Chapter 60</p><p>Oh, come on, you guys.\" Everyone but Laura was in our kitchen . . . it was the next evening, and I didn't think Tina was going to not try to kill my sister anytime soon. And who could blame her? Laura had tricked her, trapped her, and starved her. Something other than a Hallmark card was definitely called for. \"We won! The bad guys are vanquished. Why so glum?\"</p><p>Sinclair was giving Marc his \"you idiot\" stare, but Marc was so happy we were all back home he was overlooking a few things.</p><p>Sure, we had friends among the werewolves now . . . including Michael and Jeannie, which was quite a coup. I could practically hear Sinclair trying to figure out how to turn their goodwill to our advantage.</p><p>And yes, we'd found out BabyJon was no ordinary baby-which was a great relief, given our dangerous lifestyles. If he was going to be raised by vampires, it was excellent that he couldn't be hurt by them.</p><p>The vampires Laura and her minions had killed were all pretty bad characters . . . Sinclair and Tina knew each and every name, and couldn't deny the planet was better off without those particular undead walking around.</p><p>However, the ends don't justify, etcetera.</p><p>Worse, I didn't think Laura had learned her lesson. She had never regretted killing the vamps, she only regretted hurting me. There was still work ahead.</p> <p>The only thing worse?</p><p>She threw the fight. She let me win. Let me. Which meant she could probably kill me whenever she wanted. If the devil decided to whisper in the wrong ear again, I could be in very serious trouble.</p><p>But even if that never happened (ha!), I had discovered something knew and awful about my sister.</p><p>Despite my earlier assurance, Laura wasn't necessarily a good guy. In fact, I was pretty sure she was the worst kind of bad guy. She was a bad guy who thought she was a good guy.</p><p>I was normally pretty sanguine about the future, but I wasn't going to be able to relax for a while.</p><p>I didn't think any of us were.</p><p>Chapter 61</p><p>Dude,</p><p>This will be my last entry for a while. I think part of the reason I wrote so much this week was because Sinclair and Betsy weren't here, and it helped fill my days.</p><p>They're back now, and things are sort of back to normal. Tina's still not speaking to Laura. Laura's avoiding all of us. BabyJon apparently has superpowers. And Betsy doesn't seem quite so bubbleheaded.</p><p>Only Sinclair is the same: cool, calculating, untroubled. Thank God he loves Betsy-I'd hate to think what would happen to us if he didn't.</p><p>Meeting the devil-that was a new one for me, even for the funhouse we all live in.</p><p>I can't get what she said out of my head.</p><p>So I'm going to call my dad tonight. Maybe even go see him.</p><p>The devil might have told me he knew my secret to fuck me up, and that's fine-that's the devil's job.</p><p>I plan to use the information to make my life-and maybe my dad's-a little better.</p><p>That ought to fix that rotten bitch. And hey, Satan, since you're so busy watching me, let me be the first to say: not even those Vera Wangs can hide the fact that Lena's got better ankles than you.</p><p>Later, dude. </p> </body></html>"]