["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>To my father, Gary Schreiber, with all my love, from your little</p><p>\"Here's to new blood.\"</p><p>--Jagger Maxwell</p><p>Chapter 1 Bleeding Heart</p> <p>It was like a final nail in a coffin. Becky and I were camped out in my darkened bedroom, engrossed in the eighties cult horror classic Kissing Coffins. The femme fatale, Jenny, a teenage, malnourished blond wearing a size negative-two white cotton dress, was desperately running up a serpentine rock footpath toward an isolated haunted mansion. Bright veins of lightning shot overhead in the pouring rain.</p><p>Only the night before had Jenny unearthed the true identity of her fiance when she stumbled upon his hidden dungeon and found him climbing out of a coffin. The dashing Vladimir Livingston, a renowned English professor, was not a mere mortal after all, but an immortal blood-sucking vampire. Upon hearing Jenny's blood- curdling screams, Professor Livingston immediately covered his fangs with his black cape. His red eyes remained unconcealed, gazing back at her longingly.</p><p>\"You cannot bear witness to me in this state,\" I said along with the vampire.</p><p>Jenny didn't flee. Instead, she reached out toward her fiance. Her vampire love growled, reluctantly stepped back into the shadows, and disappeared.</p><p>The fang flick had gathered a goth cult following that continued today. Audience members flocked to retro cinemas in full costume, shouted the lines of the movie in unison, and acted out the various roles in front of the screen. Although I'd seen the movie a dozen times at home on DVD and knew all the words, I'd never been blessed with participating in a theatrical showing. This was Becky's first time watching it. We sat in my room, glued to the screen, as Jenny decided to return to the professor's mansion to confront her immortal lover. Becky dug her gnawed-on blood-red-painted fingernails into my arm as Jenny slowly opened the creaky wooden arch-shaped dungeon door. The ingenue softly crept down the massive winding staircase into Vladimir's darkened basement, torches and cobwebs hanging on the cement brick walls. A simple black coffin sat in the center of the room, earth sprinkled beneath it. She approached it cautiously. With all her might, Jenny lifted the heavy coffin lid.</p> <p>Violins screeched to a climax. Jenny peered inside. The coffin was empty.</p><p>Becky gasped. \"He's gone!\"</p><p>Tears began to well in my eyes. It was like watching myself on- screen. My own love, Alexander Sterling, had vanished into the night two evenings ago, shortly after I had discovered he, too, was a vampire.</p><p>Jenny leaned over the empty casket and melodramatically wept as only a B-movie actress could. A tear threatened to fall from my eye. I wiped it off with the back of my hand before Becky could see. I pressed the \"Stop\" button on the remote and the screen went black.</p><p>\"Why did you turn it off?\" Becky asked. Her disgruntled face was barely illuminated by the few votives I had scattered around my room. A tear rolling down her cheek caught the reflection of one of the candles. \"It was just getting to the good part.\"</p><p>\"I've seen this a hundred times,\" I said, rising, and ejected the DVD.</p> <p>\"But I haven't,\" she whined. \"What happens next?\"</p><p>\"We can finish it next time,\" I reassured her as I put the DVD away in my closet.</p><p>\"If Matt were a vampire,\" Becky pondered, referring to her khaki-clad new boyfriend, \"I'd let him take a bite out of me anytime.\"</p><p>I felt challenged by her innocent remark, but I bit my tongue. I couldn't share my most secretest of secrets even with my best friend.</p><p>\"Really, you don't know what you'd do\" was all I could say.</p><p>\"I'd let him bite me,\" she replied matter-of-factly.</p><p>\"It's getting late,\" I said, turning on the light.</p><p>I hadn't slept the last two nights since Alexander left. My eyes were blacker than the eye shadow I put on them.</p> <p>\"Yeah, I have to call Matt before nine,\" she said, glancing at my Nightmare Before Christmas alarm clock. \"Would you and Alexander meet us for a movie tomorrow?\" she asked, grabbing her jean jacket from the back of my computer chair.</p><p>\"Uh...we can't,\" I stalled, blowing out the votives. \"Maybe next week.\"</p><p>\"Next week? But I haven't even seen him since the party.\" \"I told you, Alexander's studying for exams.\"</p><p>\"Well, I'm sure he'll ace them,\" she said. \"He's been cracking the books all day and night.\"</p><p>Of course, I couldn't tell anyone, even Becky, why Alexander had disappeared. I wasn't even sure of the reason myself.</p><p>But mostly, I couldn't admit to myself that he had gone. I was in denial. Gone--the word turned my stomach and choked my throat. Just the thought of explaining to my parents that Alexander had left Dullsville brought tears to my eyes. I couldn't bear accepting the truth, much less telling it.</p><p>And I didn't want another rumor mill circulating throughout Dullsville. If word got out that Alexander had moved without warning, who knows what conclusions the gossipmongers would jump to.</p><p>At this point, I wanted to maintain the status quo: keep up appearances until the RBI--Raven Bureau of Investigation--had a few more days to figure out a plan.</p><p>\"We'll double-date soon,\" I promised as I walked Becky outside to her truck.</p><p>\"I'm dying to know...,\" she said, climbing into her pickup truck. \"What happens to Jenny?\"</p><p>\"Uh...She tries to find Vladimir.\"</p><p>Becky closed her door, rolled down the window. \"If I discovered Matt was a vampire and then he disappeared, I'd search for him,\" she said confidently. \"I know you'd do the same for Alexander.\"</p><p>She started the engine and backed out of the driveway.</p><p>My best friend's remark was like a package of Pop Rocks blasting off in my brain. Why hadn't I thought of it sooner? I'd spent the last several days worrying how long I'd have to keep making excuses for Alexander's absence. Now I wouldn't be forced to wait an eternity in Dullsville wondering if he'd ever return. I didn't have to jump every time the telephone rang to find out it was for my mother.</p><p>I waved to Becky as she drove down the street. \"You're right,\" I said to myself. \"I have to find him!\"</p><p>\"I'm going to Alexander's. I won't be long--\" I called to my mother as she sat devouring a J. Jill catalogue in the living room. I had a jolt of electricity coursing through my veins, which had been stagnant since my goth guy departed.</p><p>I grabbed my coat and ran back to the Mansion to find any clues of Alexander's whereabouts. I couldn't let my true love disappear without a full report from the RBI--Nancy Drew dipped in black.</p><p>Although becoming a vampire had always been a dream of mine, when faced with it, I didn't know what I'd do. Alexander already did what all great vampires do--he transformed me. I craved his presence every minute I was awake. I thirsted for his smile and hungered for his touch. So did I need to literally transform into a diva of darkness to be with my vampire boyfriend? Did I want to spend my life in greater isolation than I already did as an outcast goth? However, I had to let him know that I loved him no matter who or what he was.</p><p>I had spent a lifetime as a nocturnal-loving, rebellious, black-on- black-wearing outcast in the pearly white cliquey conservative town of Dullsville. I was relentlessly teased and bullied by soccer snob Trevor Mitchell. I was stared at like a circus freak by Dullsvillians, classmates, and teachers. The only friend I'd ever had was Becky, but we never shared the same taste in music or fashion, and our personalities were polar opposites. When Alexander Sterling moved to the Mansion on Benson Hill, for the first time in my life I felt like I wasn't alone. I was drawn to him before I even met him--seeing him standing in the darkened roadway, Becky's headlights illuminating his fair skin and sexy features. He took my breath away. Then, when he caught me sneaking into the Mansion and I got a glimpse of him again, I had a feeling I'd never known before. I knew I had to be with him.</p><p>Not only was he a pale-skinned, combat-boot-wearing goth like me, but as we began dating, I found out we listened to the same music--Bauhaus, Korn, and Marilyn Manson. More important than tastes, we shared the same desires and dreams. Alexander understood loneliness, isolation, and being different. He knew firsthand what it was like to be judged for what he wore, how he looked, for being homeschooled and expressing himself through a paintbrush instead of a soccer ball.</p><p>When I was with him, I felt like I finally belonged. I wasn't judged, bullied, or teased for what I wore but was accepted, and even celebrated, for who I was inside.</p><p>With Alexander gone and his whereabouts unknown, I felt lonelier than I had before I met him.</p><p>I removed the brick that held the broken window open and crept inside the Mansion's basement. The full moon illuminated mirrors covered with white rumpled sheets, carelessly stacked cardboard boxes, and a coffin-shaped coffee table. My heart sank when I saw again that the earth-filled crates were gone.</p><p>The last rime I had searched the Mansion uninvited, I had hoped to make chilling discoveries. I unearthed crates stamped by Romanian customs and marked SOIL. I found an ancient family tree, including Alexander's name, with no dates of births--or deaths. Now I was apprehensive about what I wouldn't find.</p><p>Upstairs, the portraits that once lined the walls were gone. I followed the hallway to the kitchen, where I opened the refrigerator. Only leftovers remained. Antique china dishes and pewter goblets still lined the cabinets. I spotted an unlit candle and a box of matches on the black granite countertop. I wandered the empty halls by candlelight. The wooden floorboards creaked beneath my feet as if the lonely Mansion were crying.</p><p>In the living room the moonlight shone through the cracks in the red velvet drapes. The furniture was once again covered with white sheets. Disheartened, I headed for the grand staircase.</p><p>Instead of the music of the Smiths pulsing from upstairs, all I heard was the wind blowing against the shutters.</p><p>The ghoulish Mansion no longer sent waves of excitement through my veins, only lonely chills. I ascended the stairs and crept into the study, where I'd once been greeted by my knight of the night, holding fresh-picked daisies. Now it was just another abandoned library--books collecting dust, empty of readers.</p><p>The butler's bedroom was even more spartan, with a single perfectly made bed, Jameson's closet cleared of clothes, cloaks, and shoes.</p><p>The master bedroom was furnished with a canopy bed with black lace that dripped around its gothic columns. I stared at the mirrorless vanity directly across. The little combs, brushes, and nail polishes in shades of black, gray, and brown that had belonged to his mother were gone.</p><p>I'd never even had the opportunity to meet Alexander's parents. I wasn't sure if they even existed.</p><p>Tormented, I paused at the bottom of the attic steps. I wondered how Alexander felt leaving so suddenly, after finally being accepted by so many Dullsvillians.</p><p>I climbed the narrow attic stairway and blew out the dripping candle. I entered his abandoned bedroom, which only two nights ago he had invited me into. His twin-sized mattress rested on the floor, unmade. Typical for any teenager, vampire or not. The easel in the corner was bare. I gazed at the paint splattered on the floor. All his artwork was gone, even the painting he had made for me--a portrait of me dressed for the Snow Ball, holding a pumpkin basket and a Snickers, sporting a spider ring and fake vampire teeth.</p><p>A black letter-sized envelope lay on top of a blood-red paint can, sitting underneath the easel. I held the piece of mail up to the moonlight. It was addressed to Alexander and had a Romanian stamp. There was no return address and the postmark was illegible. The envelope had been ripped open.</p><p>Curiosity getting the best of me, I reached my fingers inside and pulled out a red letter. In black ink it read:</p><p>Alexander,</p><p>HE IS ON HIS WAY!</p><p>Unfortunately the rest of the letter had been torn off. I didn't know who it was from or what it meant. I wondered what vital information it held--maybe a top secret location. It was like watching a movie and not seeing the ending. And who was he?</p><p>I walked to the window and stared up at the moon--the very window where his grandmother's ghost was rumored to have been seen. I felt a kinship with the baroness. She had lost the love of her life and was left to keep his secret in isolation. I wondered if that would be my fate as well. Where was Alexander headed? Back to Romania? I'd buy a ticket to Europe if I had to. I'd walk mansion door to mansion door to find him.</p><p>I wondered, if Alexander had stayed, what would have happened to him. If the town found out his identity, he could have been persecuted, taken away for scientific research, or paraded around as the top act in a sideshow. I imagined what would become of me. I might be interrogated by the FBI, hounded by tabloids, or forced to live in isolation, forever known as the Vampire Vulture.</p><p>I turned to leave his room when I saw a small booklet poking out from underneath his mattress. I took it to the attic window for closer inspection.</p><p>Had Alexander forgotten his passport? There was an empty spot where his photo had been torn out. I touched the space, wondering what picture a vampire could have taken.</p><p>I flipped through the pages. Stamps from England, Ireland, Italy, France, and the United States.</p><p>If I had Alexander's passport in my hand, he couldn't have gone back to Romania. No one can travel out of the country without a passport.</p><p>Now I had one thing I didn't have before.</p><p>Hope.</p><p>\"Slow down!\" my mom said when I burst through the kitchen door. \"You're tracking mud all over the floor.\"</p><p>\"I'll clean it later--\" I said hurriedly. \"I'd like to invite Alexander over for dinner this week,\" she offered, catching up to me. \"We haven't seen him since the party. You've been keeping him all to yourself.\"</p><p>\"Sure--\" I mumbled. \"We'll talk later. I'm going to study.\"</p><p>\"Study? You've been studying since the party. Alexander has had a positive effect on you,\" she said.</p><p>If my mother only knew I had been holed up in my room, waiting for e-mails, calls, and letters that never arrived.</p><p>Billy Boy and my dad were watching a basketball game in the den.</p><p>\"When's Alexander coming over?\" Billy asked when I passed by.</p><p>What could I tell him? Maybe never?</p><p>I quickly settled for, \"Not for a while. I don't want to overexpose him to suburbia. He might want to start playing golf.\"</p><p>\"I think you've found yourself a keeper,\" my dad complimented.</p><p>\"Thanks, Dad,\" I said, stopping for a moment, thinking of the family picnics, holidays, and vacations Alexander and I wouldn't be able to share. \"Please don't disturb me,\" I ordered, heading toward my bat cave.</p><p>\"Could she actually be doing homework?\" Billy Boy asked my dad, surprised.</p><p>\"I'm doing a report,\" I called back. \"On vampires.\"</p><p>\"I'm sure you'll get an A,\" my dad replied.</p><p>I locked myself in my bedroom and feverishly searched the Internet for any info on vampire hangouts where Alexander might be. New Orleans? New York? The six months sans sunlight of the North Pole? Would a vampire want to hide among the mortal population or isolate himself with his own kind?</p><p>Frustrated, I lay on my bed, boots still on, and stared at my bookshelves of Bram Stoker novels, movie posters of The Lost Boys and Dracula 2000, and my dresser top adorned with Hello Batty figures. But nothing gave me insight into where he might have gone.</p><p>I reached over to switch off my Edward Scissorhands lamp when I noticed on my nightstand the object that had gotten me into this mess: Ruby's compact!</p><p>Why hadn't I thought of her sooner? At the party, Jameson had asked her out for a date.</p><p>No one stands up Ruby--not even the undead! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The following morning I ran full throttle to Armstrong Travel, arriving before the agency opened. I heard keys rattling and heels clicking behind me. It was Janice Armstrong, the owner.</p><p>\"Where is Ruby?\" I asked breathlessly.</p><p>\"She doesn't come in on Tuesdays until the afternoon,\" she answered, opening the door.</p><p>\"The afternoon?\" I groaned.</p> <p>\"By the way,\" she said, moving close, \"do you know anything about Alexander's butler?\" \"Creepy Man?\" I asked. \"I mean, Jameson?\"</p><p>\"They were supposed to have a date,\" she confessed, switching on the office lights and adjusting the thermostat.</p><p>\"How was it?\" I asked naively.</p><p>Janice put her purse in her top drawer, turned on her computer, and looked at me.</p><p>\"Don't you already know? He didn't show,\" she said. \"And with a stunner like Ruby he was lucky she even looked in his direction!\"</p> <p>\"Did he say why he canceled?\" I pressed.</p><p>\"No. I thought Alexander would have told you,\" she said.</p><p>\"Not directly.\"</p><p>She shook her head. \"A good man is hard to find, you know. But you have Alexander.\"</p><p>I bit my black lip.</p><p>\"Hey, aren't you late for school?\" she inquired, looking up at the Armstrong Travel clock.</p> <p>\"I'm always late! Janice, can you give me Ruby's address?\"</p><p>\"Why don't you stop back at the end of the day?\"</p><p>\"It's just that she left her compact--\"</p><p>\"You can leave it here,\" Janice suggested.</p><p>The front door opened and in walked Ruby.</p><p>I imagined a jaded woman in jeans holding a cigarette and a beer, but even being jilted, Ruby was in style. She was wearing full makeup and a white sweater and matching tight white slacks. \"You're in early today,\" Janice said.</p><p>\"I have a lot to catch up on,\" Ruby replied with a sigh. \"What are you doing here?\" she asked, surprised to see me.</p><p>\"I have something of yours.\"</p> <p>\"If you are here on behalf of Jameson,\" she said, \"you can tell him I'm sorry I had to cancel.\"</p><p>\"You? But he was--\" I began.</p><p>Ruby settled in at her desk and turned on her computer, accidentally knocking over her cup of pens.</p><p>\"Darn it!\" she exclaimed, agitated, trying to grab the pens as they fell to the floor.</p><p>Janice and I raced over to help her pick them up.</p><p>\"This has never happened before!\" Ruby said angrily. \"Now everyone will know.\"</p><p>\"I knock things over all the time,\" I comforted.</p><p>\"No, she means about Jameson,\" Janice whispered to me. \"I got stood up several times before I met my Joe. But I must admit I'm surprised about the butler. It was doubly rude, since we came to the party to support the Sterling family.\" Janice glared at me as if Jameson's no-show was my fault. \"I feel as though he stood me up, too.\"</p><p>\"It's not the biggest deal,\" Ruby said. \"Anyway, he's more...shall I say, eccentric than I am.\"</p><p>\"He's a fool,\" Janice said.</p><p>\"This really surprises me. He was such a gentleman,\" Ruby lamented. \"And that accent. I guess that's why I was taken by him.\"</p><p>\"He likes you, too,\" I said. \"Only--\" Both women looked at me as if I were going to reveal national secrets.</p><p>\"Only what?\" Janice asked.</p><p>\"Only...that he should have called.\"</p><p>\"You're darn right! I hope you haven't told anyone about this,\" Ruby said worriedly. \"In a small town like this, being stood up could ruin my reputation.\"</p><p>\"You must know something, Raven,\" Janice pried.</p><p>\"Yes, did Alexander allude to anything?\" Ruby asked.</p><p>I had to console my former boss. After all, I was the one who caused Jameson to abandon their date. I couldn't let Ruby take it personally.</p><p>\"Just that the reason he canceled had nothing to do with you,\" I said evasively.</p><p>\"I bet he has a girlfriend,\" Ruby speculated. \"I read in Cosmo--\"</p><p>\"Of course he doesn't!\" I exclaimed with a laugh. \"But I need to know something as well. Did Jameson have a trip planned?\"</p><p>\"Do you know something I don't?\"</p><p>\"Did he buy any airline tickets? Or come in asking for any road maps?\" I hinted.</p><p>\"What aren't you telling us?\"</p><p>Ruby and Janice stared at me hard. I wasn't about to tell them the truth--that Alexander didn't reflect in her compact.</p><p>Ruby's compact! I almost forgot. I began to pull it out from my purse when a man dressed in chinos and a red polo shirt entered the office with a grand bouquet. Distracted, I replaced the compact and zipped up my purse.</p><p>\"Ruby White?\" he asked.</p><p>\"I'm Ruby,\" she said, her hand waving in the air like she'd just won the coverall at bingo.</p><p>He handed Ruby a bouquet of white roses. She blushed as she took the flowers.</p><p>Flowers for Ruby? They could have been sent from any number of Dullsvillian suitors.</p><p>\"What does the card say?\" Janice asked eagerly. \"I wonder if they're from Kyle the golf pro.\"</p><p>\" 'I'm sorry these had to greet you instead of me,'\" Ruby read. She looked up in astonishment. \"'Fondly, Jameson.'\"</p><p>\"Jameson?\" I asked, suddenly wide-eyed.</p><p>\"How sweet!\" Janice said, filling a glass vase from the watercooler. \"I told you all along he was wonderful.\"</p><p>\"Can you believe this?\" Ruby wondered aloud, holding the bouquet close.</p><p>\"What else does it say?\" I asked.</p><p>\"Isn't that enough?\" Janice said, inhaling the scent and placing the flowers in the vase. \"They're beautiful!\"</p><p>\"No info on where the order was placed from?\" I inquired.</p><p>Ruby shook her head, distracted.</p><p>\"But there has to be--\" I mumbled. I looked out the window and saw the deliveryman stepping into a white van with the words FLOWER POWER spelled out in daisies. I raced out the door as the van began to drive off.</p><p>\"Wait!\" I called, running hard in my combat boots. \"You forgot something!\"</p><p>But it was too late. The van sped around the corner.</p><p>Breathless and frustrated, I retreated back to the travel agency. I began to open the door when I noticed a piece of paper lying on the sidewalk. It was a Flower Power delivery order. It must have fallen out of the van. I quickly grabbed it, scanning the document for any vital info. The travel agency address was fully disclosed. But the sender's address was blank. No name. No e-mail. Nothing.</p><p>Then, hidden in the right-hand corner, I noticed a ten-digit number.</p><p>\"Can I use your phone, Ruby?\" I asked, running inside. \"I'll only be a minute.\"</p><p>\"Of course,\" she said, arranging the roses. At that moment, I could have called Africa and she wouldn't have cared.</p><p>The area code seemed oddly familiar. I racked my brain. It belonged to a town a couple hundred miles away, where my aunt Libby lived.</p><p>I dialed. Would Alexander's voice greet me? Ring. Or Creepy Man's? Ring. Or would it be a dead end? Ring.</p><p>\"Thank you for calling the Coffin Club,\" a zombie-like voice finally answered. \"Our business hours are nightly from sunset to sunrise. Leave a message--if you dare!\"</p><p>I let the phone slip from my hand. Ruby was still arranging her flowers.</p><p>\"Good goth!\" I whispered. \"The Coffin Club!\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At school I now experienced a newfound popularity. It wasn't as if I were a celebrity, but schoolmates who had never even looked my way before called, \"What's up, Raven?\"</p><p>But besides a hello wave, nothing had changed. No one except Matt and Becky invited me to eat lunch, offered me a ride home, or asked me to join their study group. Not one classmate secretly passed me a note or bothered to share his pack of gum. Thankfully, I was too distracted to appreciate any rise in status and spent a morbidly long afternoon in front of the library computer searching the Internet for the Coffin Club.</p><p>\"I want to visit Aunt Libby,\" I told my parents that night at dinner.</p><p>\"Aunt Libby?\" my dad asked. \"We haven't seen her in ages.\"</p> <p>\"I know. And it's about time. Spring break starts Wednesday. I'd like to leave tomorrow afternoon.\"</p><p>\"I can't imagine you'd want to be away from Alexander for a minute, much less a few days,\" my mom said.</p><p>\"Of course I'll die being away from Alexander,\" I exclaimed, rolling my eyes. I could feel my family staring at me, waiting for my next response. \"But he's going to be tied up with his homeschooling exams. So I thought I'd take the opportunity to see Aunt Libby.\"</p><p>My parents looked at each other. \"Are you sure you're not going there to see a Wicked Wiccas concert?\"</p><p>\"Dad! They broke up five years ago.\"</p> <p>\"Well, Libby's not a very good role model,\" my dad remarked. \"And who knows what neurotic guy she's involved with this time.\"</p><p>\"Dad, she's more like you than you think. You just don't drive a hippie mobile anymore.\"</p><p>\"I remember visiting my aunt when I was a teenager,\" my mom said. \"She took me to see Hair.\"</p><p>\"See--I need these memorable teen experiences to shape my life.\"</p><p>\"Libby gets such a kick out of Raven,\" she admitted. \"It would be good for her as well.\"</p><p>\"All right,\" Dad said reluctantly. \"I'll call her tonight. But if she's still practicing voodoo, you're not going.\"</p> <p>After dinner I met Becky by the swings at Evans Park.</p><p>\"I had to talk to you, pronto,\" I began.</p><p>\"Me, too! Life is so good. Can you believe we both have boyfriends?\"</p><p>Even if Alexander weren't a vampire, the idea of us having boyfriends was still unreal. We'd both been social outcasts for so many years, it was incomprehensible to be accepted by anyone but each other.</p><p>\"I need you to come on a little trip with me,\" I told her. \"Trip?\"</p><p>\"I'm going to visit my aunt Libby and I need you to come!\" I exclaimed excitedly.</p><p>\"This weekend? I'll have to ask.\"</p><p>\"No, I'm leaving tomorrow afternoon.\"</p> <p>\"Matt asked me to watch his soccer game after school.\"</p><p>\"You just started seeing him!\" I argued.</p><p>\"I thought you'd be happy for me. Besides, I was going to ask you to come.\"</p><p>The thought of watching a soccer game made me want to hurl, but Becky's glow made me realize I was being selfish. \"I am happy for you, but--\"</p><p>\"Can't you go another time?\" she begged. \"We have all spring break to hang out with Matt and Alexander.\"</p><p>There was no point arguing. Becky was going to watch Matt's game tomorrow, just as I was going to search for Alexander. No amount of pleading would make us change our minds. Now that Matt had abandoned his best friend, my nemesis, Trevor, the thorn in my side since kindergarten, he would hang out with Becky all the time. And I was jealous of Becky for having a boyfriend who hadn't disappeared into the night.</p><p>\"Why is this trip so important?\" she asked.</p><p>\"It's top secret.\"</p><p>\"What's top secret?\" Matt inquired, appearing behind us.</p><p>\"What are you doing here?\" I asked, startled. \"This is a private meeting.\" \"Becky and I are going to Ace's Arcade. She told me to meet her here.\"</p><p>It was bad enough I was losing Alexander to the Underworld, but when I needed my best friend the most, I was losing her to 3-D pinball.</p><p>\"I gotta go,\" I said, turning away.</p><p>\"So what was your top secret news?\" Matt asked. \"It'll be great to hear something other than Trevor's bogus stories for once.\"</p><p>I stared at the happy couple--Cupid's newest bull's-eyes.</p><p>\"Trevor was right. The Sterlings really are vampires,\" I said impulsively.</p><p>They stared at me like I was crazy. Then they burst into laughter.</p><p>I, too, laughed and then walked away.</p><p>I packed my suitcase full of black garments, unsure of what I was preparing for. To be safe I also packed a clove of garlic in Tupperware, Ruby's compact, and a can of Mace.</p><p>To calm my nerves, I opened my Olivia Outcast journal and made a list of Positives of Dating a Vampire:</p><p>1. He'll be around for eternity.</p><p>2. He can always fly for free.</p><p>3. I'll save hundreds of dollars on wedding photos.</p><p>4. No mirrors to Windex. 5. He'll never have garlic breath.</p><p>I closed my journal. I had one more thing to pack.</p><p>I opened the door to my brother's room. Billy was tapping his skinny fingers on his computer keyboard.</p><p>\"What do. you want?\" he snapped when I peeked in.</p><p>\"Want? It's not what I want, but rather what I have to give. I picked this up after school today from Software City. They said it was the latest.\"</p><p>I showed him Wrestling Maniacs 3.</p><p>\"Did you steal it?\"</p><p>\"Of course not--I may be weird, but I'm not a thief!\"</p><p>He reached for the game, but I held it firm. \"I just need one thing in return.\"</p><p>He rolled his eyes. \"I knew it!\"</p><p>\"It's just teensy-weensy.\"</p><p>\"Answers to a test?\" he guessed.</p><p>\"Not this time.\"</p><p>\"Need a paper written?\"</p><p>\"Not yet.\"</p><p>\"Then what?\"</p><p>\"I need a fake ID,\" I whispered. \"Aunt Libby is not going to take you to a bar!\"</p><p>\"Of course she's not. But it's really for identification, since I won't have my driver's license for a few months.\"</p><p>\"Use your school ID, then.\"</p><p>\"I need to be eighteen!\" I started to shout. Then I took a deep breath. \"There's a library convention, and I need to be eighteen to check out books.\"</p><p>\"Whatever! Mom and Dad will kill you! You're too young to drink.\"</p><p>\"I'm not going to drink. I just want to hang out.\"</p><p>\"What would Alexander say if he found that you were going cruising without him?\"</p><p>\"I'm hoping to meet him there,\" I whispered.</p><p>\"I knew it! You couldn't care less about 'my favorite aunt Libby,' \" he said in a girlie voice.</p><p>\"Pretty please?\" I asked, dangling the game before his computer-strained eyes.</p><p>\"Well...\"</p><p>\"You'll make it?\"</p><p>\"No, but I know someone who will.\"</p><p>For the first time ever I walked my brother to school--Dullsville Middle. The redbrick building, front lawn, and playground looked surprisingly smaller than when I had attended several years ago. \"I used to skip class and hide out over there,\" I said, pointing to a small athletics equipment shed.</p><p>\"I know,\" he said. \"'Raven was here' is scratched all over the side.\"</p><p>\"I guess I skipped more than I thought,\" I said with a grin.</p><p>I felt like a towering gothic giant as I walked up the front lawn among girls sporting Bratz T-shirts and Strawberry Shortcake notebooks and boys with overstuffed Pokemon backpacks.</p><p>I figured we were meeting a corrupt shop teacher, but instead we were greeted at the entrance by an eleven-year-old red-haired wunderkind named Henry.</p><p>\"What do you need to make fake IDs for?\" I asked him. \"Getting into Chuck E. Cheese's after hours?\"</p><p>Billy Boy's friend gazed up at me, like he'd never seen a real girl up close.</p><p>\"You can stare at my picture after you take it,\" I joked.</p><p>\"Follow me,\" he said.</p><p>In the hallway we were stopped by Mrs. Hanley, my sixth grade math teacher.</p><p>\"Raven Madison! You look so grown up!\"</p><p>I could tell she had expected me to wind up in juvie hall or shipped off to a boarding school. She stared at my brother and me, obviously wondering how two such different human beings could come from the same shared DNA.</p><p>\"I never realized Billy was your brother,\" she confessed. \"I know,\" I whispered. \"I'm amazed, too.\"</p><p>\"Well, some things haven't changed,\" she said, walking off. She kept looking back as if she had seen an apparition. I knew who'd be the subject of today's talk around the microwave in the teachers' lounge.</p><p>We stopped at Henry's locker, the only one with a combination lock that was hooked up to a garage door opener. Henry flipped the control switch and the combo lock sprung open. Computer games, electronics, and programming manuals were organized in racks like a miniature computer store.</p><p>He pulled out a digital camera hidden underneath a shelf.</p><p>\"Let's go.\"</p><p>I followed them around the corner to the computer room. But it was locked. My heart sank.</p><p>\"This can't happen! Break a window if you have to,\" I said, half jokingly.</p><p>Both geeky preteens looked at me as if I were the odd one.</p><p>Henry dug into the back pocket of his chinos and pulled out a worn brown leather wallet. He opened it and got out a credit card. He slid the card into the door, jiggled it a little, and within a moment the door slipped open.</p><p>\"I like your style,\" I said with a smile.</p><p>Twenty minutes later I was staring at an eighteen-year-old Raven. \"I look good for my age,\" I said with a wink, and headed for home. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Mom, I'm not going to Siberia. I'll be back in two days.\" We were sitting at Dullsville's Greyhound bus stop, outside Shirley's Ice Cream Parlor. She was trying to strangle me with kisses when the bus squealed to the curb in front of a few other young Dullsvillians heading out early for spring break.</p><p>As the bus pulled away and I waved good-bye from my window seat in the back, I actually felt a pang in my stomach. This would be my first trip away from Dullsville on my own. I even wondered if I would return.</p><p>I sat back, closed my eyes, and thought what it would be like if I became Alexander's vampiress.</p><p>I imagined Alexander waiting for me at Hipsterville's bus stop, standing in the rain, wearing tight black jeans and a glow-in-the-dark Jack Skellington shirt, a small bouquet of black roses in one hand. Upon seeing me, his pale face would flush with just enough pink to make him look alive. He'd take my hand in his, lean into me, and kiss me long. He would whisk me off in his restored vintage hearse, adorned with painted spiders and cobwebs, the music of Slipknot blasting from the speakers.</p> <p>We'd park in front of an abandoned castle and climb the creaky spiral stairs that led to the desolate tower. The ancient castle walls would be lined with black lace and the rustic wooden floors sprinkled with rose petals. A million candles would flicker around the room, the skinny medieval windows barely letting in moonlight. \"I couldn't be without you anymore,\" Alexander would say. He would lean into me and take my neck into his mouth. I'd feel a slight pressure on my flesh. I'd become dizzy, but feel more alive than I'd ever felt before--my head would slump back, my body become limp in his arms. My heart would pulse in overtime as if beating for both of us. Out of the corner of my eye, I would be able to see Alexander lift his head proudly.</p><p>He'd gently let me down. I'd feel lightheaded and stumble to my feet, holding my red-stained neck as the blood trickled down my forearm.</p><p>I'd be able to feel two pointy fangs with the tip of my tongue.</p><p>He would open a tower window to reveal the sleeping town. I'd be able to see things I'd never seen before, like smiling ghosts floating above the houses.</p><p>Alexander would take my hand, and we would fly off into the night, above the sparkling lights of the town and beneath the twinkling stars, like two gothic angels.</p> <p>The sound of clanging bells interrupted. Not the tinkling of bells signaling my arrival into the Underworld, but rather a railroad crossing warning of an incoming train, signaling the end of my overactive imagination. The bus was stopped in front of a railroad track. A toddler in the seat across the aisle from me waved excitedly as the black engine approached.</p><p>\"Chug-a-chug-a-choo-choo!\" he exclaimed. \"I want to be a conductor,\" he proclaimed to his mother.</p><p>I, too, stared as the conductor waved his blue hat while the train began to pass us. Instead of new boxcars whizzing by us, a string of dilapidated, graffiti-laden freight cars lagged in front of us. Like the toddler across from me, who was likely dreaming of the glamorous life of a conductor--too naive to realize the demands of the job, isolation, long hours, and little pay--I, too, wondered if my dream of becoming a vampire was more romantic than its reality. I was stepping into a world of the unknown, knowing only one thing: I had to find Alexander.</p><p>The official welcome sign to Aunt Libby's town should read, \"Welcome to Hipsterville--Inhabitants must check all golf pants at the city limits.\" The small town was an eclectic mix of hip coffee shops, upscale secondhand stores, and indie cinemas where all forms of cool people presided-- granola heads, artists, goths, and chic freaks. Every kind was acceptable here. I could see why Alexander and Jameson might have escaped to this particular town. It was in close proximity to Dullsville and they could easily blend in with the smorgasbord of other motley inhabitants.</p><p>I could only imagine what my life would have been like if I had grown up in a town where I was more accepted than ostracized. I could have been on the A-list to Friday night \"haunted\" house parties, been crowned Halloween Queen, and received straight A's in Historical Tombstones class.</p><p>Dad and Aunt Libby had both been hippies in the sixties, but while Dad morphed into a yuppie, Libby stayed true to her inner Deadhead. She had moved to Hipsterville, majored in theater at the university, and now worked as a waitress in a vegan restaurant to support her acting. She was always performing in an avant-garde play or a performance-art piece in some director's garage. When I was eleven my family watched her stand onstage for what seemed like days, dressed as a giant snow pea and speaking in broken sentences about how she sprouted.</p> <p>When I arrived in Hipsterville, I wasn't shocked to find that Alexander wasn't waiting for me, but I was surprised my aunt wasn't. I hope she isn't this late for her curtain calls, I thought, as I waited at the bus stop in the hot sun beside my suitcase. Finally I spotted her beat-up vintage yellow Beetle sputtering into the lot. \"You're so grown up!\" she exclaimed, getting out of her car and giving me a huge hug. \"But you dress the same. I was counting on that.\"</p><p>Aunt Libby had a youthful face, decorated with sparkling purple eye shadow and pink lipstick. She wore red dangly crystal earrings beneath her auburn hair, a sky blue halter dress spotted with white beads, and beige Nairobi sandals.</p><p>Her warmth spilled over me. Even though we differed in our tastes, we immediately bonded like sisters, talking about fashion, music, and movies.</p><p>\"Kissing Coffins?\" she asked when I told her what I recently watched. \"That's like The Rocky Horror Picture Show. I remember going to the midnight show and dancing in the aisles. 'Let's do the time warp again,' \" Aunt Libby sang, as passersby gave us strange looks.</p><p>\"Uh, Kissing Coffins isn't a musical,\" I interrupted before my aunt got a citation for disturbing the peace.</p><p>\"Isn't that a shame. Well, I've got a great place to take you,\" she raved, and led me around the block to Hot Gothics.</p><p>\"Wow!\" I shouted, pointing to a pair of black patent-leather boots and a torn black mesh sweater. \"I've only seen this store on the Internet.\"</p><p>I was in goth heaven, and it was beautiful! Wicked Wiccas T- shirts, Hello Batty comics, and fake body tattoos.</p> <p>The multipierced fuchsia-haired clerk in black shorts over black leggings, three-inch-heeled Mary Janes, and a gray mechanics shirt that said \"Bob\" walked over to me. She had the kind of style that in Dullsville could be seen only on satellite TV. And instead of my usual retail experience of either being ignored or seen as a potential thief, she greeted me as if I were a movie star at a Beverly Hills boutique.</p><p>\"Can I help you? We have tons of stuff on sale.\" I eagerly followed her around the store until I was exhausted from rack after rack of gothic clothing.</p><p>\"Feel free to ask, if you need anything else,\" she said.</p><p>I had my arms stuffed with fishnet stockings, knee-high black boots, and an Olivia Outcast purse.</p><p>Libby modeled a black T-shirt that read \"Vampires Suck.\"</p><p>I felt a pang in my heart and a lump in my throat.</p><p>\"I'll buy it for you,\" she insisted, taking it to the cash register.</p><p>Normally I would have screamed with delight at a shirt like that. But now it only reminded me that Alexander was gone.</p><p>\"You don't have to.\"</p><p>\"Of course I do. I'm your aunt. We'll take this,\" she said, handing the clerk the shirt and her credit card.</p><p>I held my gothic goodies. Everything reminded me of Alexander.</p><p>\"I'll just put these back,\" I said. But then I thought about how sexy I'd look in boots and black fishnets, if I found him again.</p><p>\"We'll get these, too,\" my aunt said, seeing through me, and handed the clerk my merchandise.</p><p>Aunt Libby lived on a tiny tree-lined urban street with skinny row-house apartments from the 1940s--a sharp contrast to my contemporary suburban house and neighborhood in Dullsville. Her one-bedroom apartment was small but cozy, with a bohemian feel-- flowered rugs, pillows, wicker chairs, and lavender potpourri filled the living room. Italian masks decorated the walls and Chinese lanterns hung from the ceiling.</p><p>\"You can crash here,\" Aunt Libby said, pointing to a paisley futon couch in the living room.</p><p>\"Thanks!\" I said, excited about my new digs. \"I appreciate you letting me visit you.\"</p><p>\"I'm so happy you came!\" she replied.</p><p>I placed my suitcase by the futon and glanced at a Pink Floyd clock hanging above the antique \"just for show\" fireplace, which she had filled with unlit candles. I had only a few hours until sunset.</p><p>Libby poured me carrot juice as I unpacked. \"You must be hungry,\" she called from her tiny art deco kitchen. \"You want an avocado wrap?\"</p><p>\"Sure,\" I said, plopping down at her vintage weathered-yellow dinner table with a beaded napkin holder and a wobbly leg. \"I bet you have a hot date tonight,\" I hinted, as she topped my sandwich with sprouts. \"But that's okay. I can take care of myself.\"</p><p>\"Didn't your father tell you? I guess he wanted it to be a surprise.\"</p><p>\"Tell me what?\" I asked, envisioning Libby handing me VIP passes to the Coffin Club.</p><p>\"I have a show tonight.\"</p><p>A show? I didn't travel all the way to Hipsterville to spend three hours sitting in a garage.</p><p>\"It's downtown,\" she said proudly. \"We're having a private performance tonight for the town's senior citizens, so I'm sorry to say you'll be the only one there without gray hair. But I know you'll love it.\" She grabbed an envelope hanging on her fridge by a rainbow magnet. She opened the envelope, pulled out a ticket, and presented it to me.</p><p>THE VILLAGE PLAYERS PRESENT</p><p>Dracula</p><p>The Village Players performed in a former elementary school. The actresses' dressing room was a classroom that still smelled of erasers, and the large windows were covered with heavy shades. Mirrors replaced the chalkboard, and a long vanity lined with makeup cases, flowers, and congratulations cards sat in place of a teacher's desk.</p><p>As Aunt Libby applied her makeup and squirmed into her white Victorian dress, I spun a forgotten globe in the corner, letting a black- painted fingernail come to a rest on Romania.</p><p>Of course, under any other circumstances I would have loved to see a performance of Dracula. I would have gone every night, especially to see my aunt as an admittedly old, but I'm sure convincing, Lucy. I would have ordered front-row seats. But why would I want to see a fake Dracula when I could see the real thing sipping a Bloody Mary down the street at the Coffin Club?</p><p>The stage manager called from the hallway, \"Five minutes.\"</p><p>I hugged Libby and told her to break a leg. I hoped she wouldn't notice my empty seat during the performance, but I couldn't worry about that as I hurried up the aisle to the back of the theater.</p><p>I pulled aside an elderly usher who looked like he might be one of the undead. \"Which way to the Coffin Club?\" Some people spend all their lives searching for their soul mates. I had only an hour and a half to find mine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I turned the corner to a sight I'd never seen before: More than a dozen young goths waiting in a line. Spiked, dyed black-and-white hair, purple floor-length extensions, billowy capes, knee-high black boots, and Morticia dresses. Lips, cheeks, tongues, foreheads pierced with metal studs and chains. Tattoos of bats, barbed wire, and esoteric designs covered their limbs, chests, and backs and, in many cases, their entire flesh.</p><p>Above the line of ghoulish goths, two coffins were outlined in red neon on the black brick building.</p><p>Impatience being my virtue, I snuck in front of a girl who was tying up loose corset laces in her medieval gown.</p><p>A Marilyn Manson look-alike standing in front of me turned to face me. \"You from around here?\"</p> <p>\"I don't think any of us are from around here, if you know what I mean,\" I said, all knowing.</p><p>\"I'm Primus,\" he responded, extending his hand. His fingernails were longer than mine.</p><p>\"I'm Raven,\" I replied.</p><p>\"And I'm Poison,\" a girl in a tight black-and-red-striped rayon dress snapped, grabbing Primus's hand away. The crowd continued moving forward. Primus and Poison showed their IDs and disappeared inside.</p><p>A bouncer in a Nosferatu T-shirt scrutinized me, blocking the black, wooden coffin-shaped door.</p> <p>I held my card proudly. But when the devilish-looking bouncer started studying it, my confidence waned and my heart began to pound.</p><p>\"This looks like it was taken yesterday.\"</p><p>\"Well, it wasn't,\" I said with a sneer. \"It was taken today.\"</p><p>The bouncer cracked a smile, then laughed. \"I haven't seen you here before.\"</p><p>\"Don't you remember me from last time? I was the girl in black.\"</p><p>The bouncer laughed again. He stamped my hand with an image of a bat and wrapped a barbed-wire-shaped plastic bracelet around my left wrist. \"Here alone?\" he asked.</p> <p>\"I'm hoping to meet a friend. An older dude, bald with a gray cloak. He was here recently. Have you seen him?\"</p><p>The bouncer shrugged. \"I only remember the girls,\" he said with a smile. \"But, if he doesn't show, I'm off just before sunrise,\" he added, letting me pass and opening the coffin door.</p><p>I stepped through and entered a dark, crowded, smoke-filled, head-banging Underworld. I had to pause to let my eyes adjust.</p><p>Dry-ice fog floated over the clubsters like tiny ghosts. The cement walls were spray-painted black, with flashing neon headstones. Pale mannequins with huge bat wings hung from the ceiling, some bound in leather, others in Victorian suits or antique dresses. The bathroom doors were shaped like giant tombstones; one read MONSTERS and the other GHOULS. Spiderwebs clung to the bottles behind the bar. A sign underneath a broken clock read NO GARLIC. Next to the dance floor a mini gothic flea market was set up on folding tables. A vampire clubster could buy anything from fake teeth to body tattoos and tarot card readings. A balcony loomed above the dance floor, accessible by a spiral staircase. Clubsters, with blood- filled amulets dangling from their necks and grimacing vampire teeth, seemed to be a mix of harmless outcast goths and maybe a few truly deranged. But if I had to bank that there were real vampires in this part of the world, some had to be mixing it up here, where they could walk hidden among the masses. The thrashing music of Nightshade blasted from the speakers. I could feel the stares as I walked by. Instead of the usual glares I was used to enduring whether walking down the halls of Dullsville High or sauntering past Prada-bes milling about town, I felt self-conscious for a different reason--I was being checked out. Hot Goths, Gorgeous Goths, even Geeky Goths were eyeing me as if I were a gothic Paris Hilton catwalking down a medieval runway. Even girls, sporting shrunken T-shirts that read SIN or pretentiously exposed their concave, multipierced bellies, scrutinized me territorially, as if threatened by any other single female with black eye shadow in a tight black dress. I fingered my raven- colored hair nervously, trying to be careful whom I made eye contact with. Were they real vampires smelling the scent of a mortal? Or just goths looking for a ghoul?</p><p>I pushed my way to the bar, where a longhaired bartender wearing lipstick and eye shadow was pouring red liquor into a martini glass.</p><p>\"What can I get for you?\" he asked. \"Blood beer or an Execution?\"</p><p>\"I'd like an Execution, but make it a virgin,\" I replied with confidence. \"I'm driving. Or should I say flying.\"</p><p>The grim bartender broke into a smile. He took two pewter bottles off the shelf and poured them into an iron-maiden-shaped glass.</p> <p>\"That'll be nine dollars.\" \"Can I keep the glass?\" I asked. I sounded like an excited kid at an amusement park instead of an underage teen trying to be cool at a bar.</p><p>I handed him a ten. \"Keep the change,\" I said proudly, like I'd seen my dad do a thousand times. I wasn't even sure I was leaving a proper tip.</p><p>I took a sip of the red slush, which tasted like tomato juice.</p><p>\"Was a bald man wearing a dark cloak here the other night?\" I asked, shouting over the blaring music. \"He made a phone call from the club.\"</p><p>\"That guy's here every night.\"</p><p>I smiled eagerly. \"Really?\"</p><p>\"And at least fifty guys just like him,\" he answered loudly.</p><p>I turned around. He was right. There were as many shaved heads as there were spiked ones.</p><p>\"He has creepy-looking eyes and a Romanian accent,\" I added.</p><p>\"Oh, that dude?\" he asked, pointing to a skinny, bald man with a gray cloak, talking to a girl in a Wednesday Addams dress in the corner.</p><p>\"Thanks!\"</p><p>I quickly pushed my way through the crowd.</p><p>\"Jameson!\" I shouted, tapping him on the shoulder. \"It's me!\"</p><p>He turned around. But instead of actually being a senior citizen, he just looked like one. I fled before he could ask me to bond with him for eternity. I scooted by the gothic marketplace, not having time to stop and purchase pewter, crystal, or silver amulets or have my tarot cards read.</p><p>But when I passed the last booth, a palm reader grabbed my hand. \"You are looking for love,\" she said.</p><p>A single girl in a club looking for love? What were the odds of that?</p><p>\"Well, where is he?\" I challenged, shouting over the blaring music.</p><p>\"He's closer than you think,\" she answered mysteriously.</p><p>I glanced around the packed club. \"Where?\" I hollered.</p><p>The reader said nothing.</p><p>I slipped a couple of dollars into her palm. \"Which direction?\" I asked loudly.</p><p>She looked into my eyes. \"East.\"</p><p>\"The bar?\"</p><p>\"You must look in here,\" she said, and pointed with her other hand to her heart.</p><p>\"I don't need pithy sayings. I need a map!\" I chided, and continued to make my way through the crowd.</p><p>I stopped at the DJ booth.</p><p>\"Did you see a bald man here recently?\" I asked the DJ, who was dressed in a white lab coat with fake blood splattered on it.</p><p>\"Who?\"</p><p>\"Did you see a bald man here last weekend?\" I repeated. He shrugged his shoulders.</p><p>\"He may have been wearing a gray cloak.\"</p><p>\"Who?\"</p><p>\"The man I'm asking about!\" The music was so loud, even I couldn't hear myself.</p><p>\"Ask Romeo at the bar,\" he hollered back.</p><p>\"I already did!\" I grumbled.</p><p>As I returned to the bar, I spotted a dark-haired guy in jeans and a charcoal gray T-shirt leaning against a Corinthian column on the dance floor.</p><p>I pushed past the clubsters, my heart beating full force. \"Alexander?\"</p><p>But on closer inspection, I was confronted with a twenty- something wearing a BITE ME T-shirt and reeking of alcohol.</p><p>Frustrated, I headed back to the bar once again.</p><p>\"That wasn't him,\" I said to Romeo. \"The guy I'm talking about made a phone call from the Coffin Club.\"</p><p>Romeo turned to his Elviraish counterpart, who was placing a tip into her bra.</p><p>\"Hey, this girl's looking for a bald guy who came to the club the other night,\" Romeo said. \"He made a phone call from here.\"</p><p>\"Oh, yeah, that sounds familiar,\" she said.</p><p>\"Really?\" I perked up.</p><p>\"I remember because he asked to use the phone. No one asks anymore. Everyone has a cell.\" \"Did he tell you where he was staying?\"</p><p>\"No. He just said thank you and gave me a twenty for handing him our phone.\"</p><p>\"Was he with anyone?\" I asked, eager to receive news of Alexander.</p><p>\"I think I saw him hanging out with a guy in a Dracula cape.\"</p><p>\"Alexander?\" I asked excitedly. \"Was his name Alexander Sterling?\"</p><p>Romeo looked at me as if he had recognized the name, but then turned away to wipe down the bar.</p><p>\"I didn't have time for introductions,\" Elvira said. She turned away from me and waited on a guy dressed in leather waving a twenty.</p><p>Jameson had been here! And possibly Alexander, in the cape he had worn on the last night I saw him.</p><p>I looked around the club for any signs that might help me find him. Maybe Alexander found this place completely bogus. Was this club just full of outcast goths like me, or were any of them real vampires? Then I remembered the way to spot a true vampire was by not looking at them.</p><p>I reached into my purse and pulled out Ruby's compact. Every fanged clubster around me reflected back. I had to think of another plan. I replaced the compact and headed for the door.</p><p>Suddenly I felt a cold hand on my shoulder.</p><p>I turned around.</p><p>\"I think I know who you want to see,\" Romeo said.</p><p>\"You do?\" \"Follow me.\"</p><p>I hung close to my gothic usher, half exhilarated, half terrified.</p><p>He led me up the spiral staircase to the balcony. A shadowy figure sat on a coffin-shaped couch, a large goblet and a candelabra before him on a round coffee table.</p><p>The mysterious figure glared up at me. I felt a sudden chill. I could barely whisper, \"Alexander--\"</p><p>The lone figure pulled the candelabra close, illuminating his features.</p><p>It wasn't Alexander.</p><p>Instead, sitting in front of me was a cryptic-looking teen, his cadaverous yet attractive face almost hidden beneath dripping white hair with red ends, as if they had been dipped in blood. Three silver rings pierced his eyebrow, and a pewter skeleton hung from his left ear. His seductive eyes pierced through me, one metallic green, the other ice blue. The whites were filled with spiderwebbed veins, as if he'd been awake for days. His skin was the color of death. His fingernails were painted black, like mine, and he wore a tattoo on his arm, which read POSSESS.</p><p>It took all my strength to turn away from his intoxicating gaze, as if I were trying to break an unearthly spell.</p><p>\"You look disappointed,\" he said in a seductive voice, forcing me to gaze back at him. \"You were expecting to meet someone else?\"</p><p>\"Yes. I mean...no.\"</p><p>\"Hoping for someone to bond with for eternity? Someone who won't run away from you?\"</p><p>\"Aren't we all?\" I snapped back.</p><p>\"Well, I just may be your man.\" \"I think Romeo was confused,\" I said. \"I was looking for someone who made a phone call from here. An older, bald man.\"</p><p>\"Really? He doesn't seem your type.\"</p><p>\"I was obviously mistaken--\"</p><p>\"One person's mistake is another man's destiny. I'm Jagger,\" he said with a piercing glare that made my blood boil. He stood and offered a pale hand.</p><p>\"I'm Raven, but--\"</p><p>\"You are looking for someone who can help you fulfill your darkest desires.\"</p><p>\"No, I was looking for...,\" I began naively.</p><p>\"Yes?\" Jagger asked, with a cunning smile.</p><p>Something didn't feel right. Hadn't Romeo already told him who I was looking for? Intuition overcame me. Jagger seemed too eager to hear me name someone.</p><p>\"I've really got to go,\" I said, clutching my purse close like a shield.</p><p>\"Please, join me.\" He grabbed my arm and pulled me onto the couch. \"I believe we have a lot in common.\"</p><p>\"Maybe next time...I really have to go--\"</p><p>\"Romeo, get the lady a drink,\" Jagger commanded. \"How about a Death Sentence? It's the club special.\"</p><p>Jagger inched toward me and gently stroked my hair away from my shoulder.</p><p>\"You're quite beautiful,\" he said. I avoided his gaze and clutched my purse in my lap while he continued to eye me. I sensed that this seductive good-looking goth was no more my friend than Trevor.</p><p>\"Listen, you have been--\" I began, trying to stand up, when Romeo returned with two goblets.</p><p>\"Here's to new blood,\" said Jagger with a laugh.</p><p>I hesitantly clinked my goblet with his. He took a long gulp, then waited for me to do the same. With a guy this nefarious, I could only imagine what the drink might have been laced with.</p><p>\"I've gotta go,\" I said, standing up.</p><p>\"He's not like you think he is,\" he said.</p><p>I paused, almost frozen. \"I don't know who you are talking about,\" I replied, and turned to leave.</p><p>\"We'll find him together,\" Jagger said, and rose from the couch to block my path.</p><p>He winked at me, and then grinned, revealing sharp vampire fangs that glistened in the candlelight. I stepped back, and then realized that in the Coffin Club everyone had fangs.</p><p>There was only one way to confirm who or what Jagger was.</p><p>\"Okay. I'll give you my number,\" I said, turning away from him. I reached into my purse and sheltered the compact from his view. \"Just let me find my pen.\"</p><p>My fingers shook as I opened Ruby's compact and angled it in his direction. I closed my eyes and hesitated. I took a deep breath and opened them.</p><p>But Jagger had already disappeared. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I returned to the Village Players Theater just in time for curtain call. I hurried backstage, where I was greeted by a worried Lucy in the dressing room.</p><p>\"I didn't see you in the audience!\" Aunt Libby said in a tone that resembled my mother's.</p><p>\"Aren't you supposed to be concentrating on the show?\"</p><p>\"How could I concentrate when all I saw was your empty seat?\" she snapped.</p> <p>\"A woman next to me kept falling asleep on me,\" I fibbed, \"so I moved to the back row. But you were wonderful!\"</p><p>\"So you did see it,\" she responded, relieved.</p><p>\"Of course!\" I gave her a big squeeze. \"Wild vampires couldn't pull me away.\"</p><p>I fiddled through her makeup kit while she greeted a few fans in the hallway. I couldn't shake my encounter with Jagger from my head. Had I met a second Dracula? Or was Jagger just some tattooed teen thirsting for a date?</p><p>\"You have to meet Marshall,\" Aunt Libby called when she returned to the dressing room.</p> <p>I was peeking beneath the window shade at a lone figure lurking in the darkened alley by the Dumpster.</p><p>\"Raven!\" Aunt Libby called. I turned around to face the Village Players version of Dracula-- a malnourished, overpowdered, middle-aged man with slicked-back, gelatinized gray hair, ultra-red lips that resembled Bozo the Clown's, and oversized press-on fingernails. He wore a traditional satin cape.</p><p>How could an overaged, uncharismatic man play the sexy, seductive Dracula? He must have been a good actor.</p><p>\"I'd like to introduce you to your biggest fan,\" Aunt Libby told him.</p><p>My mind was still on the figure lurking outside. \"Aunt Libby, we really should--\" I began.</p><p>\"I've come to suck your blood!\" Dracula said in a ghoulish voice, lunging at me.</p> <p>I had to keep from rolling my eyes.</p><p>There was a time not too long ago when meeting an actor who played Dracula in a professional production would have been the highlight of my existence. I would have become a gushy groupie in his presence and kept his framed autograph on my bookshelf. Now it was more like meeting a shopping mall Easter Bunny.</p><p>\"Libby has told me so much about you,\" Dracula continued.</p><p>\"Nice to meet you,\" I said. \"We were just--\"</p><p>\"Come, sit down,\" Aunt Libby suggested, offering a folding chair to the ghoulish lead.</p><p>\"Your aunt tells me you are obsessed with vampires,\" he said, draping his cape over the chair and sitting down.</p><p>Actually, I'm dating one, I wanted to say.</p><p>\"Have you been to the Coffin Club?\" he asked me. \"She's too young,\" Aunt Libby reminded him as she sat in her dressing-room chair and began taking off her makeup.</p> <p>\"Have you?\" I asked eagerly.</p><p>\"Yes. For research purposes only.\"</p><p>\"Did you see anything unusual?\" I inquired, like a gothic Nancy Drew.</p><p>\"Everything there is unusual.\" He laughed. \"Kids walk around wearing medieval cloaks and vampire teeth, with metal spears piercing through their eyebrows and lips, and amulets of blood hanging from their necks. I think I was the only one there above thirty. Except for one other man.\"</p><p>\"Older than you?\"</p><p>\"Well, stranger, if you can imagine.\"</p><p>\"I didn't mean--\"</p><p>\"I know. He stuck out, too. But not in the way I did. He could have played Renfield.\"</p><p>\"Creepy Man?\" I blurted out. \"I mean, was he creepy?\"</p><p>\"Well, I guess he was.\"</p><p>Unfortunately it must have been this dime-store Dracula, and not Alexander, whom Elvira had spotted talking with Jameson.</p><p>\"He was quite eccentric,\" Marshall continued. \"He asked if I was aware of any abandoned mansions in the area. Dark, secluded, near a cemetery, with an attic.\"</p><p>\"Are there any? I love old mansions.\" \"I confessed I was starring in Dracula\" Marshall said proudly, \"and I'd been to the Historical Society to research mansions and local cemeteries. I explained to him that he was better off going to the Historical Society than a real estate agent.\"</p><p>Dracula got up to leave. \"It was a pleasure meeting you.\"</p><p>I could still see the figure creeping outside through the partially covered window. When I turned to look at Aunt Libby as she thanked Marshall for his visit, I could see their reflections in the long mirror, as well as the reflection of the window through which I'd been peering. The alley appeared empty. But when I turned back to the window, the figure was still there.</p><p>Alexander?</p><p>I quickly headed for the door, pushing past the exiting Dracula.</p><p>\"Raven,\" Aunt Libby scolded.</p><p>\"I'm sorry,\" I began. \"I think I saw one of your fans outside. I'm going to see if they want to meet you!\"</p><p>I rushed outside, past a smelly Dumpster, some discarded antique chairs, and stage scenery. Fire escapes hung from overhead.</p><p>When I came to the other side of the dressing-room window, the figure had already gone.</p><p>Disappointed, I looked around for any signs. The alley was empty of people. A glistening object on the cracked blacktop underneath the window caught my eye.</p><p>On closer inspection, I saw a pewter skeleton earring lying next to a puddle. I'd vaguely remembered seeing someone wearing an earring just like this. But Alexander wore studs. Then it hit me-- it had been Jagger. I checked all around me, making sure the coast was clear. I picked it up, stuck the earring in my purse, and ran back inside the theater.</p><p>Aunt Libby and I walked to her car with some of the other cast members. With each step, I couldn't help but feel as if someone was watching me.</p><p>I looked up and spotted a small dark object dangling from the telephone wire above the alley.</p><p>\"Is that a bat?\" I asked as she unlocked my door.</p><p>\"I can't see anything,\" she said.</p><p>\"Over there.\" I pointed.</p><p>Aunt Libby squinted. \"I'm sure it's a bird,\" she commented.</p><p>\"Birds don't hang upside down,\" I said.</p><p>\"You're creeping me out!\" she hollered, and swiftly raced around to her side and got into the Beetle.</p><p>Could it be Alexander? Or were my suspicions right about Jagger?</p><p>As my aunt started the car, I looked back at the wire, which was now bare.</p><p>\"What are you doing?\" Aunt Libby asked, back at her bachelorette pad, as I turned on all the lights. \"Are you paying for the electric bill this month?\" She followed behind, turning them off.</p><p>\"We have to keep them on,\" I declared.</p><p>\"All of them?\"</p><p>\"Didn't my dad tell you? I'm afraid of the dark.\"</p><p>She glared at me in disbelief. \"This from a girl who has sleepovers at cemeteries?\"</p><p>She had a point. But I couldn't tell her my most secretest of all secrets. \"The show really spooked me,\" I said instead. \"You gave such a realistic performance, I'm afraid I could be bitten at any moment.\"</p><p>\"You thought I was that believable?\" she asked, surprised.</p><p>I nodded eagerly.</p><p>\"Well, I prefer candlelight,\" she said. She lit some votives and placed them throughout the living room. Her apartment began to smell of roses and flickered with shadows of Italian masks.</p><p>Had I really met a second teen vampire? Maybe Jagger had been afraid I'd spotted his unreflected image in my compact. He might have been spying on me in the alleyway, or watching me as he hung from a telephone wire. I took a deep breath, realizing I was no better than an overreacting gossipmonger like Trevor Mitchell. I should be spending my time planning my continuing search for Alexander instead of pointing fingers to a white-haired goth's mortal existence. Jagger could have dropped his earring on his way home from the Coffin Club. The lurking figure could have been a clubster, weaving back and forth by the Dumpster after having a few too many Executions.</p><p>I picked up Aunt Libby's Lava lamp phone and called my parents.</p><p>\"Hello?\" Billy Boy answered.</p><p>\"It's me. Are Mom and Dad home?\" \"They're next door, visiting the Jenkins's new baby,\" he replied.</p><p>\"They left you alone?\" I asked, ribbing him.</p><p>\"Give it a rest.\"</p><p>\"Well, don't touch my room! Or anything in it,\" I warned, wrapping the telephone cord around my fingers.</p><p>\"I've already read one of your journals.\"</p><p>\"You better be kidding!\"</p><p>\" 'Alexander kissed me!'\" he said in a girlish voice. Then I heard him leaf through pages.</p><p>\"You better--\"</p><p>\" Trevor was right,'\" he continued. \" 'Alexander really is a vampire.'\"</p><p>I froze. How had Billy Boy gotten hold of one of my journals?</p><p>\"Close it right now!\" I cried. \"It's not a journal. It's a story I'm writing for English class!\"</p><p>\"Well, you have a lot of spelling mistakes.\"</p><p>\"Right now, Nerd Boy! Shut it or I'm coming home and melting all your computer games!\"</p><p>\"Calm down, spaz. I'm in my room, leafing through my NASA book,\" he confessed. \"You think I want to go in your messy room? I could be missing for days!\"</p><p>\"I knew that,\" I said, with a sigh of relief. \"Well, tell Mom I called.\" I was amazed how accurately Billy Boy had guessed the contents of my journal. Maybe he should perform crystal-ball readings at the Coffin Club.</p><p>\"Oh, someone called for you,\" he remembered. \"Becky?\"</p><p>\"No. It was a guy.\"</p><p>I held my breath. \"Alexander?\"</p><p>\"He didn't leave his name. When I said you weren't home, he hung up.\"</p><p>\"Did you check the caller ID?\"</p><p>I waited an eternity for his response.</p><p>\"Out of area,\" he finally answered.</p><p>\"If he calls again, ask who it is,\" I demanded. \"And then call me immediately!\"</p><p>Aunt Libby was munching on carrots dipped in hummus while sitting on the floor on a purple corduroy pillow. I was too distraught to eat.</p><p>\"So tell me about your boyfriend,\" she asked, as if reading my thoughts.</p><p>\"Well, he's a goth like me,\" I answered, beginning to tell her the part of Alexander's identity that wasn't secret. \"And he's delicious!\"</p><p>\"What does he look like?\"</p><p>\"Luscious, long midnight hair. Deep, dreamy eyes. He's taller than me, about your height. Thin, not malnourished, but not beefy like he has to be in a gym twenty-four-seven. I just can't believe he left,\" I added, remembering the farewell note.</p><p>\"He left you?\"</p><p>\"No, I mean he left for spring break.\" I scrambled, trying to cover my mistake. \"To visit his family.\" \"I'm glad you found someone special you can identify with. It must be hard for you growing up in that town.\"</p><p>I appreciated that Libby understood what it was like to be different. Because she felt more comfortable in Hipsterville, maybe Alexander had found a place where he felt more comfortable, too.</p><p>\"Aunt Libby, can I ask you a personal question?\"</p><p>\"Of course.\"</p><p>\"Do you believe in vampires?\"</p><p>She laughed. \"I thought you were going to ask about sex.\"</p><p>But I was serious. \"Do you?\"</p><p>\"I once dated a guy who kept a vial around his neck. He claimed it was blood, but it smelled like strawberry Kool-Aid.\"</p><p>\"Did he creep you out?\"</p><p>\"Actually the ones who claimed they weren't vampires scared me more,\" she teased. \"We should get some sleep. We've both had a long day,\" she said, blowing the votives out and putting the carrots away. \"I'm so glad you're here,\" she said, giving me a squeeze.</p><p>\"Me, too.\"</p><p>As soon as Aunt Libby went into her bedroom, I tiptoed through the apartment and turned the other lights back on, just to be safe. I climbed onto the futon, pulled the covers over me, and closed my eyes.</p><p>Suddenly I felt a shadow on me. I squeezed my eyes shut. I imagined Alexander standing over me with flowers, begging my forgiveness for leaving so abruptly. But then I realized it could be Jagger, about to plunge his fangs into my neck.</p><p>I opened my eyes slowly. \"Aunt Libby!\" I shouted with relief.</p><p>\"Still spooked?\" she asked, standing over me. \"You can leave the living room light on.\"</p><p>Libby turned all the other lights off and returned to her bedroom, unaware I was trying to protect her from a tattooed teen of darkness. I pulled the covers back over my head, but still felt as if someone were watching me. I tried to calm myself by thinking of Alexander. I recalled lying in the grass with him, in the backyard of the Mansion, staring at the stars, our fingers intertwined.</p><p>I heard a scratching sound coming from the kitchen. I was probably the only girl in the world who hears a scratching sound and hopes it's a mouse. I imagined myself back at the Mansion, the dark sky brightened by luminous clouds above us, the smell of Drakar cologne in the air, and Alexander kissing me. But when Alexander spoke into my ear, all I heard was that scratching sound.</p><p>I decided to confront it and walked toward the kitchen in my black socks. A white mouse running across my feet was the least of my issues.</p><p>I switched on the kitchen light. The sound seemed to be coming from outside.</p><p>I peeled back the curtain above the sink, expecting to see Jagger's ghost-white face staring back. But it was only a tree branch swaying against the window in the wind.</p><p>Just to be safe, I opened my Tupperware container and placed a clove of garlic on the windowsill above the futon. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The next morning, I was jarred awake by the music of the Doors. The bright sun beaming in through the open windows made my head pound. I was exhausted from the bus ride to Hipsterville, searching for Alexander, and my nocturnal meeting with the inhabitants of the Coffin Club. As I looked outside, the mortal world seemed the same. Jeeps parallel parked. Hipstervillians pushed chic strollers. Birds hung on telephone wires.</p><p>But the morning sun shed new light on last night's events. Maybe my Coffin Club experience was just a dream and Jagger just a concoction of my nighttime imagination.</p><p>I rose from the futon with a gentle laugh, thinking about my overimaginative nocturnal dreams, when I spotted a charm on Aunt Libby's wooden footlocker, next to my bracelets.</p><p>Jagger's skeleton earring. It hadn't been a dream.</p> <p>I held it in my hand. The bony charm stared up at me. If Jagger was a vampire, I wondered what frights it had observed, dangling from his ear. Was it witness to late-night bites on unsuspecting girls? Had the tiny pewter bones seen Alexander?</p><p>I reminded myself that I was doing to Jagger what Trevor had done to Alexander. Trevor had started rumors that the Sterlings were vampires, not because he knew their true identity, but because he wanted to make them a town scandal. Now I was making judgments and jumping to my own conclusions about Jagger without having any facts. I had to spend my energies searching for what I had come to Hipsterville for--a real vampire instead of a wannabe.</p><p>I remembered my conversation with the Village Dracula. I had to get to the Historical Society as soon as it opened.</p><p>I found Aunt Libby in the kitchen cooking eggs-</p><p>\"Good morning, honey,\" she said. \"Did you sleep well?\" \"Like a baby.\"</p> <p>\"I'm surprised you did,\" she said, cutting me off. \"Something in the living room smells funny,\" she said, turning off the stove and placing the skillet on another burner.</p><p>\"My mom packed me some goodies for the bus ride,\" I said, following her into the living room. \"Maybe something spoiled.\"</p><p>\"It seems like it's coming from over here,\" she said, pointing toward the window above the futon.</p><p>She quickly pulled back a broken window shade before I could stop her.</p><p>\"I found it on the floor last night when I went to the bathroom,\" I improvised. \"I thought it was a seashell.\"</p><p>I paused, waiting for her response.</p> <p>She looked at me skeptically.</p><p>\"Well, after watching your show last night, I just couldn't sleep,\" I added.</p><p>\"But I thought you liked vampires.\"</p><p>\"I do, but not at my window.\"</p><p>\"You remind me of your father when he was growing up. Loved scary movies, but must have slept with the light on until college,\" she said.</p><p>\"Then I guess it's in my genes,\" I said, retrieving the garlic from the windowsill and sticking it back in the Tupperware container.</p><p>\"I can throw that away for you,\" she offered, extending her hand.</p><p>\"I want to keep it,\" I said, as I put the container in my purse. \"Until college.\" Aunt Libby laughed, and I followed her into the kitchen. \"I have a list of things we can do,\" she said, as we sat down to breakfast. \"We can start by going to the art museum. There's an exhibition on Edward Gorey I think you might enjoy. We can go to the Nifty Fifties diner for lunch; they make a great bacon cheeseburger. Of course, I've never had it, but that's what I hear. After that, we can go antiquing in the neighborhood. Then I have my show. But you can hang backstage. I'm afraid it might be too scary for you to see again,\" she teased. \"Sound cool?\"</p> <p>\"I'd like to check out the Historical Society,\" I requested.</p><p>\"All that talk about mansions last night with Marshall?\" she guessed.</p><p>\"I think I'll do a report on one for history class.\"</p><p>\"During spring break? I figured you'd rather have a picnic in the cemetery,\" she said, putting down her coffee.</p><p>\"Great idea! Let's do that afterward.\"</p><p>\"I was joking,\" she responded.</p><p>By the time Aunt Libby got ready and I showered and dressed, the morning hours were dwindling. Libby was everything my dad wasn't--while he was an uptight type-A personality, she was a laid- back type-ZZZ. He was fifteen minutes early to a movie, and she was lucky to make it before the credits rolled.</p><p>I couldn't convince Aunt Libby to pack a basket of tortilla- wrapped tofu sandwiches and sit by empty graves, but I was able to trade in the art museum for the Historical Society. I grabbed my Olivia Outcast journal from my suitcase and put it in my backpack, and we finally headed out the door.</p><p>Dullsville's Historical Society was in an unhaunted late- nineteenth-century church. I had visited it only once on a school field trip and spent most of the time exploring the three tombstones in the cemetery until a teacher discovered my whereabouts and threatened to call my parents.</p><p>Hipsterville's Historical Society proved to be more interesting, located in two Pullman railway cars at the old train station.</p><p>Inside, I rummaged through pictures of Victorian houses, original menus from Joe's Eats, and letters from early residents. From the second car emerged a woman wearing a lime green pantsuit with matching sandals and a red-hair That Girl do.</p><p>\"Can I help you?\" she asked.</p><p>\"My niece is visiting and would like to do a report on our historical mansions,\" Aunt Libby said, peering at black-and-white photos of streetcars that hung next to the emergency brake.</p><p>\"Well, you came to the right place,\" she said, and pulled a book from a shelf.</p><p>\"I'm interested in an abandoned estate near a cemetery.\"</p><p>The woman looked at me as if I were a ghost. \"Strange. A man was in here the other day asking about the very same thing!\"</p><p>\"Really?\" I asked, surprised.</p><p>\"Was it Marshall Kenner?\" Aunt Libby inquired. \"He's starring in Dracula.\"</p><p>\"No, Marshall was in earlier in the month. This was a gentleman who was new to town.\"</p><p>My ears perked up.</p><p>She pulled out several more books and leafed through them as Aunt Libby explored the museum.</p><p>\"Here's the Landford Mansion,\" the woman pointed out. \"It's in the far north part of town. And the Kensley Estate, toward the east.\" I studied all the pictures, imagining which one Jameson would have selected. Nothing remotely resembled the Mansion on Benson Hill.</p><p>\"Which one was the man interested in?\" I whispered.</p><p>She looked at me strangely. \"You should do your report on what you like.\"</p><p>I looked again at all the mansions, each one statelier than the last. I wrote down their names and addresses on the back of the Historical Society's brochure and realized it would take me several spring breaks to visit them all.</p><p>As I was ready to close the book, I noticed the edge of a bookmark peeking out toward the back. When I turned to the noted page, I lost my breath. A black-and-white photo of a gloomy nineteenth-century grand estate stared back at me. A wrought-iron gate surrounded the towering house, and at the top of the mansion was a tiny attic window. I envisioned ghosts hiding behind the curtains, too shy to be photographed.</p><p>Underneath, the picture read \"Coswell Manor House.\"</p><p>\"What's this?\" I asked the woman, who was organizing the bookshelf.</p><p>She glanced at the picture. \"I didn't think to mention that one because it's on the outskirts of town. It's been abandoned for years.\"</p><p>\"It's perfect,\" I said.</p><p>\"Weird. That's what that gentleman said, too.\"</p><p>The woman jotted down an address and handed it to me. \"It's on Lennox Hill at the far end of the road.\"</p><p>I dropped a donation in the \"Friendly Funds\" jar as we left the museum. \"That was nice of you,\" my aunt said, as we walked through the parking lot to the Nifty Fifties diner.</p><p>\"I'd have given her my college fund if I could've.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>While Aunt Libby gathered her belongings for the theater and the sun made its final descent, I sat cross-legged on her futon and made notes in my journal.</p><p>My investigation was almost complete. In only a few hours, I would be reunited with Alexander. Once he understood I loved him no matter who or what he was, we could go back to Dullsville and we'd be able to be together.</p><p>Then I wondered what exactly that would mean. Would he want me to be like him in every way I could? And if faced with the choice, would I really want to choose the lifestyle I'd always dreamed of?</p><p>To quiet my mind, I made more notes:</p> <p>Positives of Being a Vampire</p><p>1. Save on electric bills.</p><p>2. Could always sleep in late--very late.</p><p>3. Wouldn't have to worry about keeping a low-carb diet. \"Are you sure you want to stay alone?\" Aunt Libby asked, holding her makeup bag.</p><p>\"I am sixteen.\"</p> <p>\"Your parents let you stay by yourself?\"</p><p>\"I could have been babysitting at twelve, if anyone in Dullsville would have hired me.\"</p><p>\"Well, there's plenty of food in the fridge,\" she offered, heading for the door. \"I'll call at intermission to check in.\"</p><p>Aunt Libby may have been laid back when it came to her own lifestyle, but when I was under her roof she was just like my dad. I guess she would have been like my father and left her hippie days behind if she had had kids, too.</p><p>I quickly changed into my Hot Gothics fashion merch--black- and-white-striped tights and a torn black minidress revealing a blood- red chemise. I applied my standard black lipstick and dark eye shadow. I barely had enough time to put a red rose body tattoo on my neck.</p><p>I checked to make sure the container of garlic was tightly sealed, as I didn't want to expose Alexander to the two-inch weapon I'd use to ward off any lurking vampires. I must have brushed my hair and rearranged my red extensions a million times before I rushed out the door and waited at the bus stop for the number seven.</p> <p>With every passing number eleven or sixteen, I paced the bus stop. I was considering returning to my aunt's apartment and calling a cab when I saw the number seven turn onto the street and slowly lumber toward me. Anxiously, I boarded the crowded bus, a mixture of granola heads and urbanites, slipped my cash into the change receptacle, and grabbed the slippery aluminum pole. I held on to the pole for dear life, trying to keep my balance and avoid bumping into the other passengers as the bus jolted with every acceleration. As soon as the number seven lurched forward and reached the speed limit, it began to slow down again, stopping at every bus stop in town. I checked my watch. It would have been quicker if I'd walked.</p><p>After letting off a few dozen passengers and picking up a few more, the bus driver turned the corner and passed my destination-- Lennox Hill Road.</p><p>I ran toward the front of the bus.</p><p>\"You passed Lennox Hill Road!\" I called in a panic as the bus driver continued accelerating.</p><p>\"There is no bus stop there,\" he said to me, looking in his rearview mirror.</p><p>\"But that's my destination,\" I argued.</p><p>\"I only stop at bus stops,\" he recited, continuing to drive.</p><p>\"If it's a dollar fifty to get on the bus, how much is it to get off?\"</p> <p>I heard a few of the passengers laugh behind me.</p><p>\"Pull the cord,\" the woman said, pointing to a white wire that ran above the bus windows.</p><p>I reached across her and pulled the wire hard.</p><p>A few seconds later, the bus driver slowed down and pulled over.</p><p>\"See that?\" he asked, pointing to a square sign on a pole with the number seven next to the curb. \"That's a bus stop.\"</p><p>I gave him a dirty look and jumped off the bus, dodging an elderly couple trying to board. I ran down the road the bus had just driven up until I reached Lennox Hill Road. I turned the corner and walked past gigantic pristine estates with lush green lawns and purple and yellow flowers until I found an unkempt, overgrown weed-filled lawn. A decaying house sat on it at the end of a cold and ominous cul- de-sac. It looked as if a storm cloud were hovering over it. I had finally arrived at the stately gothic manor house.</p><p>Gargoyles sat on top of the jagged wrought-iron gates. Untamed bushes lined the front of the manor. The dead grass crunched beneath my boots. A broken birdbath sat in the center of the lawn. Moss and ivy grew on the roof like a gothic Chia Pet. I skipped along a fractured rock path, which led to an arched wooden front door.</p><p>I grabbed the dragon-shaped knocker, and it came off the door and fell into my hand. Embarrassed, I quickly hid the knocker underneath a bush.</p><p>I rapped the door again. I wondered if Alexander was standing on the other side, ready to greet me with a colossal kiss. But there was no answer. I banged my fist against the door until my hand began to throb.</p><p>I turned the rusty handle and tried to push against the wooden entrance, but it was locked.</p><p>I snuck behind the dead bushes alongside the front of the manor. The windows were boarded up, but I spotted a slender crack. The ceilings in the manor house were so high, I was surprised that there were no clouds wafting through the rafters--plenty of room for a ghost to fly around in without even being noticed. From what I could see, the walls in the living room were as bare as the room itself.</p><p>Frustrated, I walked around to the side of the manor house and discovered a butler's entrance. I twisted the iron knob on the skinny oak door, but that, too, was bolted shut.</p><p>My heart pulsing hard, I ran to the back of the house. A few broken steps led down to a lone dingy window. It wasn't boarded up, so I eagerly pressed my face to the glass.</p><p>Nothing unusual. I saw a few cardboard boxes, a dusty tool rack, and an old sewing machine. I tried to open the window, but it was stuck. I ran back up the broken steps and stood on the lawn.</p><p>\"Hello?\" I called. \"Jameson? Alexander?\"</p><p>But my words were answered only by the barking of a neighbor's dog.</p><p>I stared up at a single attic window. A tree starved of leaves leaned toward the manor house, one of its branches reaching out just below the window. The huge oak must have been centuries old--its trunk was as wide as a house, and its roots clutched the ground like a spider's legs. I was used to climbing, whether it was over the Mansion's wrought-iron gate or up apple trees in Becky's backyard. But scaling this tree seemed like ascending Mt. Everest in the dark. Clad in combat boots and a minidress, I stuck my heel onto the lowest branch and pulled myself up. I continued to climb at a steady rate, slowing down only to catch my breath or when I needed to feel above me for a limb hiding away from the moonlight. Weary but determined, I scooted along a heavy branch stretching underneath the attic window.</p><p>A dark curtain hid most of the room from view, but I managed to peek inside. I could make out an empty box and a wooden chair. Then, I saw the most amazing sight staring back at me-- resting in the corner was the portrait Alexander had painted of me dressed for the Snow Ball. A pumpkin basket hung over one arm. A two- dimensional Raven grinned, flashing fake vampire teeth.</p><p>\"Alexander!\" I called. I tried to tap against the window, but my fingers were just out of reach.</p><p>\"Alexander!\" I called again.</p><p>I could hear the dog's bark getting louder.</p><p>\"Alexander! Jameson!\" I yelled with all my might.</p><p>Just then, the next-door neighbor opened his back door and stepped onto his deck. He was built like a professional wrestler. \"Hey! You kids back again?\" he called over.</p><p>\"What's going on, Hal?\" a petite woman asked, following him out of the house.</p><p>\"I told you, kids are playing in that house next door,\" he said to her. \"I'm calling the police!\" he yelled, and pulled out a cell phone from his back pocket.</p><p>I scurried down the tree, wanting to avoid being placed in a full nelson or, worse, handcuffs. Plus, I didn't want law enforcement to arrest Alexander and Jameson or force them to find another home-- and this time it might be Romania.</p><p>When I reached the bottom branch, I saw, out of the corner of my eye, a rustling of the dark curtain in the attic window.</p><p>I quickly stepped back to get a better view.</p><p>But the curtain was still.</p><p>Suddenly, a chocolate-colored Doberman pinscher sprinted out of the neighbor's house, down the deck stairs, and scratched against the brown picket fence that ran parallel to the manor house.</p><p>Afraid the dog would wriggle his way through the skinny spaces between the boards and devour me like Kibbles 'n Bits, I took off around the other side of the manor and tore down the road to the bus stop.</p><p>I boarded the westbound number seven, taking a seat in the back behind a college-aged couple. I was excited to find that Alexander was indeed in Hipsterville. I imagined that he was painting portraits in a spooky cemetery. Searching a haunted mansion for furniture to decorate his attic room. Or maybe he was out for a night flight.</p><p>I was still confused why Alexander had come to Hipsterville. It was a small town with eerie abandoned manors, and with enough goths and artists to be hidden among. What else did it offer a lone vampire?</p><p>The couple seated in front of me began making out, oblivious to the other staring passengers.</p><p>I saw their reflections in the bus window. I wondered if they knew how lucky they were. Two humans who could share their nights and days together. Take pictures. Sit in the sun. Then I realized those were just small sacrifices I'd make to be with Alexander again.</p><p>The bus approached the Village Players Theater, and I disembarked with several other passengers. I walked alone down the alley toward the back entrance of the theater, conjuring excuses I could tell Aunt Libby and my parents so I could stake out the manor house for the next few nights until I made contact with Alexander. I saw a figure lurking behind the Dumpster.</p><p>\"I hoped to find you here,\" a deep voice said, stepping out to block my way.</p><p>I froze. It was Jagger. I held my purse close; inside was my Mace and, possibly more important, my container of garlic.</p><p>\"I have information that may be of interest to you.\"</p><p>\"Information?\" I asked skeptically.</p><p>\"About Sterling,\" he said, with a knowing glance. \"Isn't that who you are looking for?\"</p><p>Shocked, I inched back. I knew where Alexander was staying, but I didn't know where he was. The promise of any new leads on Alexander's whereabouts made my heart pulse in overtime. Plus, my curiosity about Jagger's identity still lingered. I had to know how he knew Alexander.</p><p>\"I can help you. I've known him for an eternity,\" he said with a grin. I glanced back at the Village Players Theater. If I went back inside, I was guaranteed to have a safe night with real unreal vampires. Or I could just wait for Alexander outside the manor house--unless he and Jameson spotted me and left for another town. Then I was guaranteed to never see my Gothic Mate again.</p><p>\"You better tell me everything you know,\" I said, clutching my purse to my side. \"Otherwise--\"</p><p>\"You are free to go whenever you like,\" he reassured me.</p><p>I stood still as Jagger began walking down the alley. Curiosity eating away at me, I decided to catch up to him. I followed Jagger down the street and toward a back entrance to the Coffin Club.</p><p>He led me into the warehouse and down a darkened hallway to an empty freight elevator. The rickety door shrieked out in pain when he shut it. Instead of pushing the button for the Coffin Club, he pressed the \"B\" button.</p><p>The elevator slowly lowered to the basement, screeching as if it were a coffin descending into hell.</p><p>\"I thought we were going to the Coffin Club.\"</p><p>The elevator stopped. Jagger opened the door and held it for me as I stepped into a corridor.</p><p>He followed behind me so closely I could feel his warm breath on the back of my neck. We walked down the narrow hallway, the walls adorned with graffiti and the cement floor cluttered with discarded chairs and boxes. The dance floor music pulsed above. When we reached what looked like a wide storage-room door, I could hear the elevator slowly grind its way back up to mortal level. Jagger lifted the metal-gray door above our heads to reveal a windowless apartment.</p><p>I stepped inside.</p><p>\"Welcome to my dungeon,\" he said. Dozens of medieval candelabras filled the spacious apartment.</p><p>And then I saw it. In the far corner lay an open coffin, adorned with gothic band stickers like a mortal teen's skateboard. Dirt encircled the coffin like a walled city.</p><p>My eyes grew wide. \"So you are...,\" I began, but could barely speak.</p><p>\"Oh, the coffin,\" he said. \"Cool, huh? I got it at a vintage store.\"</p><p>\"And the dirt?\"</p><p>\"Saw it in a vampire mag. Creepy, huh?\"</p><p>I didn't know what to think. Even Alexander slept on a mattress.</p><p>\"It's really comfortable. Want to give it a try?\" he asked with sexy eyes.</p><p>\"I'm not tired.\"</p><p>\"You don't have to be.\"</p><p>Jagger confused me. I couldn't figure out if he was a vulpine vampire or just a goth-obsessed teen like me.</p><p>I looked around for any other unusual clues--but everything was unusual. Maps were spread out on the floor. The cement walls were decorated with gravestone etchings.</p><p>Next to the radiator an aquarium, without water, was filled with rocks.</p><p>His kitchen counter and sink looked as if they had remained untouched. Metal cabinets were missing their doors. I was afraid to think what was in the refrigerator--or, rather, who.</p><p>\"You are the first girl I've ever brought down here,\" Jagger confessed. \"I'm surprised. You must meet a lot of girls at the Coffin Club.\"</p><p>\"Actually, I'm new to town. Just like you. Visiting.\"</p><p>The hairs on the back of my neck rose. \"How do you know I'm visiting?\"</p><p>\"It doesn't take a psychic to figure it out. Someone as goth as you would be a regular at the club. Romeo had never seen you before.\"</p><p>\"Uh...I guess you're right.\"</p><p>\"Can I get you anything to drink?\"</p><p>\"No, thank you,\" I replied. \"I want to know--\"</p><p>Jagger walked over to the aquarium. He placed his hand inside and pulled out a huge tarantula.</p><p>\"I just bought him. Would you like to pet him?\" he asked, stroking the potentially poisonous spider as if it were a sleeping cat.</p><p>Normally I would have loved to pet a tarantula, but I wasn't sure of Jagger's motive.</p><p>\"Where's your big-screen TV?\" I asked, noticing the lack of televisions or computers.</p><p>\"I find them offensive.\"</p><p>\"So you don't watch movies? You've never even seen the original Dracula?\" I hinted. \"Nosferatu? Kissing Coffins? Someone as goth as you would seem to have the lines memorized.\"</p><p>\"I would rather experience life than be a voyeur.\"</p><p>He returned the spider to the aquarium. I dug my hand into my purse. \"You left this behind,\" I said, and revealed the skeleton earring in my hand. He smiled brightly as if I were reuniting him with a long- lost friend.</p><p>As he took the charm from my hand, his fingers lingered, gently touching my palm, sending chills through my veins. It took some strength, but I withdrew.</p><p>\"Now that this has been in your possession, it is even more special to me,\" he said, placing it back in his ear. \"Can I give you a reward?\" he asked.</p><p>\"You can tell me about Alexander.\"</p><p>\"Shall I tell you? Or should I just show you,\" he asked, stepping toward me.</p><p>\"Tell me,\" I said, defiant. \"Is he a friend of yours?\"</p><p>\"Maybe yes,\" he said with an inviting smile. \"Maybe no,\" he said with a wicked grin.</p><p>\"Forget it, I'm outta here.\"</p><p>\"I know him from Romania,\" he said quickly.</p><p>\"Have you seen him in America?\"</p><p>He shook his head, his white hair flopping over his blue and green eyes.</p><p>\"Do you know where he is?\" I asked.</p><p>\"What if I do? How much is it worth?\" he asked, licking his lips.</p><p>\"You don't know, do you?\" I challenged. I backed away from him, stepping on a map.</p><p>\"But you know quite a lot,\" he argued.</p><p>I pulled my purse close. \"You knew enough about my Romanian friend to come to the Coffin Club and ask for him,\" he said, approaching me again.</p><p>\"I don't know anything--\"</p><p>\"Then why do you want to find him?\" he whispered softly in my ear as he gently stroked my hair off my shoulder.</p><p>\"I must have been mistaken--\" I said, looking away from his gaze, wanting to run, but not being able to move.</p><p>\"Really?\" he whispered. \"He made you feel like his breath was yours,\" he said, circling me, his words landing softly on the back of my neck.</p><p>\"I don't know what you are talking about,\" I lied, my heart pounding in my chest.</p><p>\"That your flesh and his are one,\" he said, as his lips gently caressed the nape of my neck.</p><p>I could barely speak, my heart racing, the map crinkling underneath my boot.</p><p>He stepped close in front of me, his eyes piercing through my own, and gently touched my onyx necklace.</p><p>He leaned into me and kissed the top of my chest. He whispered, \"That you are just a kiss away from being bonded with him for eternity.\"</p><p>I could barely breathe. My heart raced as he held me.</p><p>\"Get off!\" I cried, wedging my arms between us and pushing him away.</p><p>A map tore underneath my boot. Jagger tried to pierce me with his gaze, but I stared down at my feet. It was a map of Hipsterville. The cemeteries were highlighted in yellow, with several crossed out in black marker. Then I noticed, lying a few feet away on the floor, the other maps--neighboring towns of Hipsterville and Dullsville. Cemeteries were highlighted and crossed out in black.</p><p>I glanced up at Jagger as he tried to lock his blue and green eyes with mine. He gently grabbed my hand like he'd done in the Coffin Club. \"We can find him together,\" I recalled him saying. Then I remembered the note I'd found in Alexander's room--\"HE IS ON HIS WAY!\"</p><p>I backed away from Jagger and reached into my purse. It was worth a shot. My fingers shook as I tried to pry open the container of garlic.</p><p>The container's suction was like Super Glue. I struggled with the lid when Jagger stepped toward me.</p><p>I raced out the door and ran down the hallway. I pressed the elevator button and glanced back. Jagger stepped through his doorway and began running down the hall after me. I could hear the screeching elevator above me, but it was nowhere to be found. I looked up. The number \"3\" lit up; \"2\" lit up. \"G\" lit.</p><p>\"Hurry! Hurry!\" I mumbled, pressing the button repeatedly.</p><p>I could hear Jagger coming closer. Suddenly the \"B\" lit up, and the elevator stopped in front of me. I pulled the rickety door to one side and jumped in. I used all my strength to pull the accordion door shut just as an angry Jagger stepped in front of the elevator.</p><p>I darted back, away from the door, as his gaze caught me. He reached out for the door, realizing I hadn't yet pushed a button. I quickly pressed my finger against the \"G\" button.</p><p>As the elevator began to lift, I leaned against the wall, away from him. \"I hope you find him,\" I heard Jagger call. \"Before I do.\" \"What are you doing here?\" Aunt Libby asked when she found me peeking underneath the shades in her dressing room after curtain call. \"I called you at intermission, but you didn't pick up.\"</p><p>\"I must have been in the shower,\" I rambled. \"But I wanted to see you.\"</p><p>\"You did? That's so cute!\" she said, wiping off her makeup.</p><p>\"I'm having such a fabulous time. But I have something to tell you.\"</p><p>\"Yes?\"</p><p>\"I have to go back home tomorrow.\"</p><p>\"So soon?\" she asked, putting down her makeup sponge.</p><p>\"I know,\" I whined. \"I don't want to leave, but I still have tons of homework to do.\"</p><p>\"When I was in school, spring break was just that--a break.\"</p><p>\"And I'll need to leave early. Before sunset.\"</p><p>\"Still afraid of the vampires?\" she teased.</p><p>The truth was, I wasn't sure--I didn't know who or what Jagger was. The one thing I was sure of was that he was following Alexander.</p><p>It was just moments ago that I had barely escaped Jagger's lair. If I attempted to find out Jagger's reason for his search, I might be putting myself--and, more important, Alexander--in danger.</p><p>Now that Jagger was following me--outside the theater yesterday and waiting for me in the alley tonight--I knew if I returned to the manor house, or anywhere I thought I might find Alexander, I would lead Jagger right to him. Although it broke my heart, I had no choice. I would have to leave Hipsterville. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Aunt Libby and I sat together on a wooden bench outside the Greyhound bus station waiting for the eight o'clock to pull in. There was only one bus each day out of Hipsterville, and it departed just as the sun was setting.</p><p>I looked forward to returning to Dullsville and hopefully Alexander, but I was sad to leave Aunt Libby. I enjoyed our visit together, and I really admired her. She had followed her dream of being an actress and in the process lived independently, with her own style, tastes, and view of life. She saw me as unique and special, instead of as a freak. And most important, she treated me like I was normal.</p><p>I'd also miss the excitement of Hipsterville, knowing there was a place like the Coffin Club for goths to hang out and dance, and Hipsterville's Hot Gothics--a store where I could purchase gothic clothes, spiked jewelry, and body tattoos.</p><p>Libby put her arm around me, and I leaned my head on her shoulder as the bus pulled in.</p> <p>\"I'm going to miss you so much, Aunt Libby,\" I said, squeezing her with all my might before I climbed aboard the bus.</p><p>As I walked down the aisle, I opened my compact to check the other travelers. After everyone reflected back, even a gothic couple snuggling in back, I chose a seat next to the window. Aunt Libby waved to me as we waited for the bus to leave. I could see in her eyes that she would miss me as much as I'd miss her. She kept waving as the bus drove off. But as soon as the station was out of sight, I breathed a sigh of relief. The nefarious, mysterious, feud-seeking shock-goth Jagger was now behind me. Hopefully, a new plan to contact my handsome Gothic Prince Alexander was before me.</p><p>The bus ride back to Dullsville was painfully long. I called Becky from my cell phone, but she was at the movies with Matt. I jotted notes about my encounter with Jagger in my Olivia Outcast journal, but writing gave me motion sickness. I imagined why Jagger was searching for Alexander--maybe it was a feud between the two families over the baroness's Mansion--but it only made me worry about my boyfriend. I dreamed about reuniting with Alexander, but I also couldn't stop thinking about the maps Jagger had lying on his floor.</p><p>It seemed like an eternity until the bus finally pulled into Dullsville's bus stop. I even hoped against hope that Alexander would magically be waiting for me, but instead I was greeted by Mom, Dad, Billy Boy, and his nerd-mate Henry.</p><p>\"You're leaving already?\" my dad asked after we arrived back home and I dropped my suitcase off in my room. \"We want to hear more about your trip.\"</p> <p>I didn't have time for my parents' well-meaning questions. \"How did you like Aunt Libby? What did you think of her performance in Dracula? Did you like eating tofu sandwiches?\"</p><p>I wanted to go to the place where I did my best thinking.</p><p>\"I have to see Alexander!\" I said, shutting the front door behind me. I raced to the Mansion and found the iron gate ajar. Out of breath, I hurried up the long, winding driveway and noticed something peculiar--the front door was also ajar.</p><p>Maybe he'd seen me from the manor house attic window and followed me back to Dullsville.</p><p>\"Alexander?\" I called as I walked inside.</p><p>The entranceway, living room, and dining room were as I'd last seen them, covered and empty of paintings.</p> <p>\"Alexander?\" I called, walking up the grand staircase. My heart beat wildly with each step.</p><p>I whisked through the second floor and up Alexander's attic steps. I reached his bedroom. I could barely breathe. I gently knocked on his door. \"Alexander, it's me, Raven.\"</p><p>No one responded.</p><p>I turned the knob and opened the door. This room also looked like I'd last seen it, bare except for a few remaining items. But on his unmade bed lay a backpack. He had come back.</p><p>I picked up the rustic black bag and hugged it. I knew it would be rude to look through the backpack, especially if Alexander suddenly walked into the room. But I couldn't help it.</p><p>I set it back on the bed and began to unzip it when I heard a noise coming from the backyard.</p><p>I looked outside his attic window and saw a candle flickering in the gazebo. A bat was hovering above the roof.</p><p>I took off, bolting out of his room, down the attic stairs, around the second floor, and down the never-ending staircase.</p> <p>I flew out the front door and raced around to the backyard. \"Alexander!\" I called, and ran into the darkened gazebo, barely able to make out his features in the shadows.</p><p>Then the candlelight flickered. I saw his eyes first. One green and one blue, before he stepped fully into the moonlight.</p><p>I tried to run, but it was too late. Jagger's gaze had already begun to make me dizzy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I awoke on my back, on cold wet grass, with raindrops kissing my face, as if in a Sleeping Beauty slumber. The silvery sky held a bright, shining moon. A spidery tree loomed over me, its skinny, naked branches reaching toward me with witch-like fingers.</p><p>I sat up, my head aching. Then I saw it. A tombstone. Then another. Not one, but hundreds. I saw the baroness's monument. I was in Dullsville's cemetery.</p><p>As I rose, I felt light-headed. I caught my balance on a graveyard marker. I used to seek comfort among the tombstones, but because I was unsure of how I got here, I was anxious to leave before I ended up in an unmarked grave.</p><p>Jagger, wearing black cargo pants with red seams and a white T- shirt emblazoned with the words THE PUNISHER, was standing before me.</p> <p>\"How did you get here? Did you follow my bus?\" I asked, confused.</p><p>\"It will all be over in just a few minutes.\" \"What--my life? Forget it. I'm getting outta here!\"</p><p>\"Not so fast.\" Jagger grabbed my hand and began leading me toward the middle of the cemetery. I tried to pull away from him, but his grip was too strong and my strength had been depleted from whatever means he used to get me there.</p><p>I'd snuck into Dullsville's cemetery many times, and invariably Old Jim, the caretaker, and Luke, his Great Dane, would chase me out. They seemed to be nowhere, now when my life depended on them.</p><p>\"I thought you were looking for Alexander,\" I said, but Jagger ignored me and continued pulling me toward the monuments and tombs. We stopped at a closed coffin laid upon a cement bench. I could hear strange music, a mixture of wailing violins and an underlying harpsichord, coming from one of the tombs. On the coffin, a candelabra flickered among the raindrops, wax dripping down its pewter spine. A medieval goblet sat next to it.</p> <p>It looked like a scene from a gothic wedding.</p><p>\"What's this?\" I asked, my mental fog beginning to wear off.</p><p>\"A covenant ceremony.\"</p><p>\"But where are the guests? I didn't bring a gift,\" I said, giddy from my daze.</p><p>\"The bride doesn't have to.\"</p><p>\"Bride? But I didn't even register yet!\"</p> <p>Jagger didn't smile. Instead he relit a candle.</p><p>A few feet away, I spotted a shovel lying next to an empty grave, glistening in the moonlight. I backed up slowly, inching my way to the shovel until the caretaker's tool lay at my feet. My heart was beating so loudly, I was afraid Jagger would hear it. I took a deep breath. As he centered the candelabra on the coffin, I bent over and reached for the handle. But as soon as I grabbed it, Jagger's boot pinned it to the earth. He stood over me as I tried in vain to pry it from the ground. In the struggle, the shiny new shovel shook, and a few bits of clinging dirt fell off the metal head. I saw myself in the shovel's curve, upside down like a spoon's reflection. However, I didn't see a reflection for Jagger right behind me. I looked back up at him. He smiled a wicked smile. I hastily wiped the shovel with my sleeve and shifted to one side, peering into the shiny metal surface. All I could see were the stars above him, but his boot remained on the handle behind me.</p><p>I gasped.</p><p>\"Something missing?\" he teased.</p><p>I rose quickly and stepped back. \"You--\" I began, breathless.</p><p>I tried to run, but Jagger lunged forward and grabbed my arm. He flashed his fangs at me and licked his lips.</p><p>My reality spun out of control. I was standing face-to-face with a real vampire. One who wasn't Alexander. Jagger was the kind I'd read about and seen in movies--the kind who meant to snatch me away from my family and friends and take my blood as his own. I faced pledging my life to a stranger for all eternity. The radical dreams I'd wished for as just a curious goth were about to come true.</p><p>But this wasn't my dream. I'd dreamed of eternal love, belonging, and fitting in. Not danger, deceit, and evil. Dullsville hadn't been so dull after Alexander had moved into town. After meeting him, I'd realized all I'd ever wanted was to become one of the living--experiencing movies, metal concerts, and love--and not one of the undead. I wanted to sleep in Alexander's arms, not alone in a coffin. I wanted to turn into a gothic beauty, not a creepy bat. And most important, if I had to make the choice to transform, I would only do it for Alexander. \"My parents are expecting me home. They'll be sending out the SWAT team any minute now.\"</p> <p>He held my hand with a strength I'd never felt before. I looked around for anything else to help my escape.</p><p>Jagger led me to the front of the coffin. He picked up the goblet and raised it to the moon, spoke a few words in a language I didn't understand, and then took a long drink.</p><p>\"Now you,\" he said with a wicked grin, offering me the goblet.</p><p>\"Forget it!\" I said, pushing the goblet away with my free hand.</p><p>\"But isn't this what you wanted all along? Why else would you follow Alexander?\" he asked.</p><p>\"Because I love him!\" I said, trying to wriggle free. \"And I will never love you!\"</p><p>\"But you don't have to,\" he said, and forced the goblet to my mouth.</p><p>Drops of thick, sweet liquid spilled against my lips.</p><p>I spit the liquid from my mouth. \"I will never become like you, whoever or whatever you are!\"</p><p>Jagger's face grew strange, as if my words had been a silver stake driven through his heart.</p><p>\"And I say you will!\" His blue and green eyes gazed into mine as if trying to cast a spell. \"With this kiss, I take thee for all eternity.\"</p><p>Jagger flashed his smile, and his white fangs glistened in the moonlight. He leaned into me.</p><p>\"I bite back!\" I yelled defensively, gritting my teeth.</p><p>Suddenly a burst of lightning struck, illuminating the sky and all of the graveyard. I plunged my teeth into Jagger's arm as hard as I could and dug my nails into his bony hand. He quickly released his death grip. I turned to run but slammed hard into something--or, rather, someone.</p><p>\"Old Jim?\" I cried, confused.</p><p>But when I looked up and stared into two midnight eyes, I realized it wasn't the caretaker I'd run into.</p><p>Instead, standing before me was my Gothic Guy, like a knight of the night. His dark, shoulder-length hair was hanging in his face. His white, moonlit skin was covered by a black T-shirt and jeans. The plastic spider ring I'd given him was resting on his finger. His eyes were deep, lonely, adoringly intelligent, just as they were the first time I'd seen them.</p><p>\"Alexander!\" I exclaimed, and fell into his arms.</p><p>\"Just as I thought!\" Jagger proclaimed, as if he'd won a contest. \"I knew she'd bring me to you!\"</p><p>Alexander embraced me hard as if he would never release me. Then he pushed me away. \"You must go,\" he commanded.</p><p>\"Are you crazy? I can't leave you!\" I held his hand tightly. \"I thought I'd never see you again!\"</p><p>He stared into my eyes and warned me. \"You have to go.\"</p><p>\"But I--\"</p><p>\"You shouldn't have brought her into this!\" Alexander told Jagger, with an anger I'd never seen before.</p><p>\"She found me. Besides, I'm surprised to see that you're letting her go so soon, after she came all the way to the Coffin Club to find you...\"</p><p>\"Leave Raven out of this!\" Alexander exclaimed. \"I couldn't have planned my revenge any better than this. I could destroy you and gain an eternal partner with just one bite.\"</p><p>\"You wouldn't dare--\" Alexander warned.</p><p>\"I knew she'd bring you to me, Sterling. You think you're not like one of us, but the truth is you are,\" Jagger argued.</p><p>\"What is he talking about?\" I asked.</p><p>\"Not now,\" Alexander answered.</p><p>\"Why do you think Sterling left Romania?\" Jagger asked me. \"Do you think it was an accident he came to a small town in America where there weren't any vampires?\"</p><p>I didn't really know, after all.</p><p>\"But I found you, Sterling,\" Jagger bragged. \"And I found Raven.\"</p><p>\"She has nothing to do with this,\" Alexander said, stepping in between Jagger and me.</p><p>\"I have nothing to do with what?\" I asked curiously.</p><p>\"Don't worry, Raven, he breaks promises all the time. Right, Sterling?\" Jagger said.</p><p>Alexander clenched his fist.</p><p>\"What promise? Why revenge? What does he mean?\" I asked, confused, wondering what kind of agreement Alexander had made but couldn't keep.</p><p>\"Well, I'm not going to leave her! I'm going to hold on to her for all of eternity!\" Jagger proclaimed.</p><p>He flashed his teeth with a wickedly gnarled grin and leaned in to sink his fangs into my neck. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>I found myself flat on my back again, wet grass underneath me. Raindrops hit my face. I anxiously felt my neck for any wound.</p><p>Alexander leaned over me, his eyes filled with worry.</p><p>\"Are you okay?\" he asked sorrowfully. \"You got in the way.\"</p><p>\"Am I a...?\" I didn't even want to finish my thought.</p> <p>He shook his head and helped me to my feet. \"You have to go!\" he commanded again. \"You shouldn't be here--you're in danger.\"</p><p>I turned to look around for Jagger. But all I saw were grave markers. \"But I may never see you,\" I pleaded.</p><p>\"You must leave now,\" he persisted.</p><p>Alexander was breaking my heart again. If I left, it could be for the last time. How could I be sure Jagger wouldn't harm him? Alexander could disappear into the night forever. But if I didn't listen to his instructions, I might actually be doing Alexander more harm by getting in his way.</p><p>I saw Jagger stumbling by the baroness's monument and wiping his mouth. His green and blue eyes had turned fiery red. His lean muscles tensed. He grinned at me and licked his lips like a rabid animal ready to rip into its prey.</p> <p>I didn't even have time to kiss my Gothic Mate good-bye. I ran without looking back, tears and raindrops dripping down my face, the graveyard mud splashing against my boots, my heart pulsing. Thunder clapped against the trees and seemed to echo against the tombstones.</p><p>I raced to the entrance of the cemetery and climbed over the fence.</p><p>When I turned around, Jagger and Alexander were gone. </p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sobbed as I ran as fast as I could from the cemetery. I could barely see the pavement through my watery eyes. I headed through downtown Dullsville in the pouring rain where drivers in their Saabs, Mercedeses, and Jeeps looked strangely at the sight of a miserable, soaking wet goth girl.</p><p>I ran down the main street and tore through shoppers with umbrellas, knocked into couples coming out of the movie theater, and barreled past patrons escaping from the rain into restaurants. With every flap of a bird's wing or sound of a honking horn, I was startled, thinking it was Jagger following me. I raced on.</p><p>I didn't want to go home. I needed to be alone, away from my family. I didn't want to talk--no one, not even Becky, would understand this unearthly experience. I had to hide out and seek comfort in the only place I had ever really felt at home.</p><p>I hurried through the open Mansion gates, my legs numb and my feet tingly inside my boots. I rushed up the long, windy driveway and around to the back of the Mansion. I glanced toward the gazebo to see if any two-colored eyeballs were staring back at me. When I found the gazebo empty, I climbed through the open basement window and made my way through the deserted Mansion. My tears dropped onto the creaky wooden floors beneath my squeaky boots. I wiped my eyes as I ascended the grand staircase and made my way into Alexander's attic room.</p> <p>I touched the empty easel. I gazed at his bed, still creased from when he'd slept there days ago. I held his black knit sweater left behind on his beaten-up comfy chair.</p><p>I walked to the attic window and gazed out into the lonely moonlight. The heavy rain had ceased. I felt exhausted, abandoned, like a complete failure. Had I just stayed in Dullsville, Alexander would have returned for me. But my impatience had put me, and Alexander, in danger. He had been safely hiding in Dullsville from Jagger's thirsty revenge, and I'd pointed his nemesis right in his direction. As clever as I thought I was, I'd just been a pawn in Jagger's wicked game.</p><p>I heard a floorboard creak behind me. I slowly turned around but could barely make out the dark figure standing in the doorway.</p><p>\"Jagger--\" I said with a gasp.</p><p>The floorboard creaked again as the figure took a step toward me.</p> <p>\"Get out!\" I yelled, backing up. I had nowhere to go. The figure was blocking the doorway, and my only escape was the narrow attic window ledge.</p><p>I stepped away, anxious about making a dangerous escape.</p><p>\"I'll call the police!\" I warned.</p><p>The figure drew closer. I decided I'd have to make a run for it by going around him. I took a breath and counted to myself. One. Two. Three.</p><p>I speedily darted around the figure, and was close to making my escape through the doorway when the figure grabbed my wrist. \"Get off!\" I cried, trying to wriggle away. But when the moonlight gleamed down on his hand, a black plastic spider ring shined back at me.</p><p>I gasped, ceasing my struggle. \"Alexander?\"</p> <p>He stepped completely into the light.</p><p>There he was, like a dream, standing before me. He'd returned. Handsome and now weary looking.</p><p>\"I thought I'd never see you again!\" I exclaimed. My body, tense with fear, melted into him as I wrapped my arms around him. He squeezed me back, so hard I could almost feel his heart beat through my own chest.</p><p>\"I'm not letting go,\" I said, squeezing him harder and smiling. \"Not ever!\"</p><p>\"I shouldn't have...,\" he began, softly.</p><p>I looked up, as if I were seeing an apparition. \"I just can't believe you're here!\"</p><p>He took my hands and raised them to his mouth, kissing the back of them with his full lips, sending shivers through my veins. He gazed back into my eyes and smiled.</p><p>And then he did what I had so longed for him to do. He kissed me. His full lips pressed tenderly against mine, slowly, softly, seductively. It was as if we'd been separated for an eternity.</p> <p>We continued to kiss, passionately, moving from our mouths to our cheeks to our ears as if drinking in each other's flesh. He gently stroked my hair, then nibbled my ear. I giggled as he sat on his comfy chair and pulled me onto his lap. I looked into his eyes, wondering how I could have breathed the last few days without him near me.</p><p>I ran my fingers through his messy, licorice-colored locks. He brushed my hair away from my neck and made his way up my shoulder with sexy kisses. I could feel his teeth, seductively sliding against the skin of my neck. Touching, toying, tingling, giving me playful nibbles. The nape of my neck hung tenderly in his mouth.</p><p>Suddenly Alexander pulled away, a look of terror in his eyes.</p><p>\"I can't,\" he said shamefully, looking away.</p><p>\"What's wrong?\" I asked, surprised by his change in mood.</p><p>Alexander stood up, helping me to my feet. He anxiously drew his hand through his hair and paced the room.</p><p>\"It's okay,\" I said, catching up to him by his easel.</p><p>\"I thought I wasn't like Jagger,\" he said, and sat on the edge of his bed. \"But...maybe I am.\"</p><p>\"You are nothing like him,\" I said. \"In fact, you are the opposite.\"</p><p>\"I just want you to be safe. Always,\" he said, looking at me soulfully.</p><p>\"I am, now that you are here,\" I said, stroking his hand.</p><p>\"But don't you see?\" he said seriously. \"My world is not a safe one.\"</p><p>\"Well, mine isn't either. Don't you watch the news?\"</p><p>His sullen face turned bright, and he laughed. \"I guess you're right.\"</p><p>\"See? I'm more at risk going to school with Trevor than I am kissing a vampire.\"</p><p>\"I've never met anyone like you,\" he said, turning toward me. \"And I've never felt before the way I feel about you.\" \"I'm so glad you came back for me.\" I hugged him around his waist.</p><p>\"This won't happen again,\" he assured me.</p><p>\"How can you be so sure? Jagger seems bent on getting even with you,\" I asked, sitting beside him.</p><p>\"Because he couldn't get even.\"</p><p>\"Wow, so you showed him who's boss? Like in a school yard brawl?\"</p><p>\"I guess...Only in our case it was a graveyard brawl.\"</p><p>\"Is he gone?\"</p><p>\"His family is in Romania. There is nothing for him here now. He can go back and tell them he found me.\"</p><p>I fingered my necklace.</p><p>\"What promise did you break?\"</p><p>\"I didn't break it. I never made it...But we don't have to worry about that anymore,\" he said wearily.</p><p>\"What were all the candles in the cemetery for?\" I asked.</p><p>\"A vampire can take anyone at any time. But if he takes another at a cemetery or some other sacred ground, then she is his for eternity.\"</p><p>\"Then I'm glad you showed up when you did!\" I squeezed Alexander with all my might. \"I'm sorry I led Jagger to you,\" I confessed.</p><p>\"I should be the one apologizing to you. I couldn't imagine you'd come for me,\" he said, staring off into the moonlight. Then he turned back to me. \"But I should have known. That's what I love about you.\" \"Now tell me everything!\" I exclaimed suddenly. \"What's it like being a--?\"</p><p>\"What's it like being human?\" he interrupted.</p><p>\"Boring.\"</p><p>\"How can you say that?\" he asked, holding me close. \"You can wake up in the daylight, go to school, and see your reflection.\"</p><p>\"But I want to be like you.\"</p><p>\"You already are,\" he said with a smile.</p><p>\"Were you born a vampire?\"</p><p>\"Yes. Were you born a human?\" he teased.</p><p>\"Yes. Are there millions of vampires around?\"</p><p>He nodded. \"But we are a minority, so we like to stick together. Obviously there is safety in numbers. We can't reveal our identities or we'd be persecuted.\"</p><p>\"It must be so hard to cover up who you really are inside.\"</p><p>\"It's very lonely, feeling like an outcast. Like you are invited to a costume party, but you are the only one in a mask.\"</p><p>\"Do you have a lot of vampire friends in Romania? I bet you miss them.\"</p><p>\"My dad procures art for his galleries in several countries. So we traveled quite a bit. By the time I made a friend, it was time to leave.\"</p><p>\"What about humans, like me?\" I asked, curling up next to him.</p><p>\"There is no one like you, vampire or not,\" he said with a warm smile. \"It's hard making human friends when you don't attend school, and it's even harder keeping them when they're eating their evening dinner and you are just rolling out of bed.\"</p><p>\"Are your parents upset that you have a human girlfriend?\"</p><p>\"No. If they met you, they would immediately fall in love with you, just like I did,\" he said, and stroked my hair.</p><p>\"I'd love to travel and live in the nighttime and sleep during the day. Your world seems so romantic. Being bonded to one another for an eternity...Flying off into the night together. Thirsting for no one but each other.\"</p><p>\"I feel that way about your world.\"</p><p>\"The grass is always greener, I guess. Or, in our case, blacker.\"</p><p>\"When I'm with you,\" he began, \"I don't care which world we are in, just as long as we're in the same one together.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Wake up,\" Alexander gently whispered in my ear.</p><p>I opened my eyes to find that I had crashed out on the couch in his TV room as he stroked my hair. Kissing Coffins was playing on his oversized flat screen.</p><p>Jenny had desperately entered Professor Livingston's office at the university.</p><p>\"I knew I'd find you here!\" she exclaimed, finding Vladimir seated at his desk, his head buried in a textbook. \"You weren't supposed to come,\" he warned, without looking up, \"to my house or to my study. You have put yourself in danger.\"</p> <p>In the distance, there was an eerie howling.</p><p>\"Why did you let me fall asleep?\" I asked Alexander, lifting my head from his shoulder. \"Did you put a spell on me?\"</p><p>\"You suggested we watch this,\" he replied. \"But you conked out as soon as I pressed 'Play.' Besides, it's late and you've been through a lot.\"</p><p>\"Late?\" I asked, stretching my arms. \"For you it's the middle of the day.\"</p><p>Jenny looked toward the window. \"They are coming for me,\" she confessed to Vladimir nervously. \"They want me to be one of...you.\"</p> <p>Vladimir methodically turned the page of his book. He didn't look up. Another eerie howling was heard in the distance.</p><p>\"I'll walk you home,\" Alexander offered as we rose to our feet. He kindly handed me his black leather jacket.</p><p>\"But I want to stay here,\" I whined.</p><p>\"You can't. Your parents will be worried.\"</p><p>\"I'll tell them I'm babysitting.\"</p><p>\"For a seventeen-year-old?\"</p> <p>He put the coat around my shoulders.</p><p>\"I had better go--\" Jenny started, looking out the window of the study into the fog-layered darkness. \"It was foolish of me to come.\"</p><p>\"You'll be all alone here in this huge mansion,\" I said to Alexander, as I adjusted my wrinkled dress. \"I'm safe. Besides, I've sent for Jameson.\"</p><p>\"As slow as he drives? It'll take him years to get here. I'll stay until he arrives,\" I said, sitting back down.</p><p>\"Wait!\" Vladimir called, his head still focused on his book.</p><p>Jenny stopped at the door. The professor rose and slowly walked to her. \"Since I've met you, I haven't been myself,\" Vladimir confessed.</p><p>The howling continued.</p><p>\"Come on, girl,\" Alexander said, nudging me.</p> <p>\"I was afraid I'd never see you again,\" Jenny said. \"If I leave here without you, I may not be able to find you next time.\"</p><p>I stared at Jenny as if she had just proclaimed my own fear.</p><p>\"But what if I never see you again?\" I asked Alexander, pulling him close.</p><p>\"Is tomorrow after sunset soon enough?\"</p><p>\"I can't leave,\" I told Alexander. \"I thought I'd see you after the Welcome to the Neighborhood party. And the next night you were gone.\"</p><p>\"I left to protect you, not to hurt you,\" he answered in a serious tone, sitting down next to me.</p><p>\"Protect me from what?\"</p><p>\"From Jagger. From me. From my world.\"</p><p>\"But you don't have to protect me.\"</p><p>\"My world is not just filled with romance, like you think it is. There is danger.\" \"There can be risk anywhere. It's not exclusive to vampires. You just have to be careful.\"</p><p>\"But I don't want you to be near danger in any world.\"</p><p>\"I won't if we are together,\" I argued.</p><p>\"I don't want you to think you have to change who you are to be with me,\" he said earnestly.</p><p>\"I know that,\" I assured him.</p><p>\"Or ask that you change.\"</p><p>\"That's why you left Dullsville,\" I realized out loud. \"You were afraid I'd want to become a vampire.\"</p><p>\"Yes. But there was a more imminent danger presiding. A vampire with white hair.\"</p><p>\"Jagger.\"</p><p>He nodded.</p><p>\"Then why did you go to Hipsterville?\"</p><p>\"Hipsterville?\" he asked, confused.</p><p>\"That's what I call it,\" I confessed with a grin.</p><p>\"Of course,\" he said with a laugh. \"I got word from my parents that Jagger had found an apartment in `Hipsterville' and was searching cemeteries in neighboring communities for my grandmother's monument. Once he'd found it, he would know which town I was living in.\"</p><p>\"That was what the note meant,\" I remembered. \"A warning that Jagger was on his way to find you. To seek revenge.\"</p><p>\"What note?\" he asked, confused. \"In your room,\" I confessed.</p><p>\"You snuck into the Mansion after I left?\"</p><p>I flashed him a cheesy grin.</p><p>\"I should have known,\" he said, and smiled back. Then his playful tone turned serious. \"But more important than finding me, he may have found you.\"</p><p>\"Well, he did, but that was my own fault.\"</p><p>\"I was going to head him off at the pass before he came to Dullsville--confront him before he confronted me. Jameson and I found an abandoned manor house so we could hide while I made my plan. But I didn't plan on one thing.\"</p><p>\"I'd follow you?\"</p><p>\"I saw the most beautiful girl climbing down the backyard tree.\"</p><p>\"That was you in the attic window?\"</p><p>\"Yes.\"</p><p>\"So why didn't you--\"</p><p>\"I kept a close eye on you. I had to, didn't I?\"</p><p>\"So why is Jagger out to get you?\"</p><p>A sharp howl came from the screen, distracting Alexander from my question.</p><p>\"We need to get you to the cemetery--to sacred ground,\" Vladimir warned. The handsome professor led her through the dark, marshy woods, riddled with fog. Vladimir held Jenny close as the howling sounds grew louder.</p><p>Alexander and I were fixed on the movie. \"How can we be together,\" Jenny asked, \"if I'm not a vampire?\"</p><p>Suddenly the TV screen went black. Alexander placed the remote he was holding on the coffee table.</p><p>He stood up and held his hand out for me.</p><p>\"How can we be together?\" I asked, rising.</p><p>\"How can we not be?\" he reassured me. Alexander grabbed my hand, and I reluctantly followed him out of the Mansion and toward my house. I felt like a kid at Disney World at closing time.</p><p>The night air in Dullsville felt fresher than ever, the dark sky clearer, the wet grass crisper. \"So why was Jagger seeking revenge?\" I asked.</p><p>\"It's a long story,\" he said, with a yawn.</p><p>Alexander seemed so content forgetting the past, our hands entwined as we walked side by side. But I wouldn't rest until I knew.</p><p>\"I have all night. And you have 'til sunrise.\"</p><p>\"You're right,\" he said, as we walked down the street. \"It was about a promise I never made.\"</p><p>\"A promise?\" I asked.</p><p>\"To take a girl for all of eternity.\"</p><p>\"What girl?\"</p><p>\"Jagger's twin sister, Luna.\"</p><p>\"He has a twin?\"</p><p>Alexander nodded.</p><p>\"Well, who made the promise?\" I questioned aloud. \"My family did the year the three of us were born.\"</p><p>\"Like an arranged marriage?\"</p><p>\"It's more than marriage.\"</p><p>\"So why Luna?\"</p><p>\"When she was born, it was said she didn't respond to the darkness but seemed to flourish in the light. She refused to drink anything besides milk. Desperate, her family took her to a local underground doctor who pronounced her 'human.'\"</p><p>I laughed. Alexander didn't seem to find it funny.</p><p>\"It just sounds strange to me, that's all,\" I said, as we turned a corner.</p><p>\"Well, it wasn't funny to the Maxwells. They were devastated. Luna had to live her life in daylight, while her family lived at night. She never even bonded with Jagger. At the time of the agreement, my family and his were very close. It was understood that when Luna was eighteen, we'd meet for a covenant ceremony and unite together for eternity, ensuring her a place in the vampire world.\"</p><p>\"So what happened?\" I asked, as we cut across the lawn through Oakley Woods.</p><p>\"As I grew up, my family traveled and our families became distant. Because Luna and I lived in different worlds, I never even knew her. When it came time for the ceremony, I had seen her only a few times. She didn't know me, and she was going to be with me forever?\"</p><p>\"Well, you are quite handsome,\" I said coyly. \"So what did you do?\"</p><p>\"When it came time to kiss her for eternity, I leaned over and kissed her good-bye.\" \"That must have been hard for you, being a vampire and all,\" I whispered.</p><p>\"I was doing it for both of us. Of course, the Maxwells didn't see it that way. They felt that I had spurned Luna, therefore offending her entire family. They were outraged. My parents quickly arranged for me to come here with Jameson and live in my grandmother's Mansion.\"</p><p>\"Wow. It really had to have been tough following your heart when it went against your vampire community,\" I said. \"And even more difficult to have been forced to leave Romania because of that decision.\"</p><p>\"When I saw this raven-haired beauty trick-or-treating from my attic window, I knew I'd rather spend an eternity alone waiting to see her again than spend one with someone I didn't love.\"</p><p>Just then we reached my front door. Alexander gave me a long good-night kiss.</p><p>\"Tomorrow after sunset,\" I reminded him.</p><p>\"And not a second later,\" he said.</p><p>Alexander waved to me as I opened the front door. I walked inside and turned around to wave good-bye.</p><p>He had already disappeared, just as I knew he would. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's after midnight,\" my dad warned as I tiptoed past him watching ESPN in the family room.</p><p>\"Dad, I'm sixteen. It's a weekend.\"</p><p>\"But this is--\" he began in a stern voice.</p><p>\"I know, your house. And I'm your daughter, and until I'm on my own I'll live by your rules.\"</p> <p>\"Well, at least you were paying attention.\"</p><p>\"You've been saying it to me since I was two.\"</p><p>\"You've been sneaking out since you could walk.\"</p><p>\"I'm sorry, it won't happen again,\" I said.</p><p>I handed him his soda that was sitting on the coffee table and gave him a good-night hug.</p> <p>\"I'm glad you had a good time at Aunt Libby's,\" he said. \"But I'm also glad you're back home.\"</p><p>\"Me, too, Dad. Me, too.\"</p><p>Exhausted, I crawled into bed without even removing my rain- dampened clothes. I switched off the Edward Scissorhands light on my nightstand and licked my lips. Alexander's kisses still lingered on my mouth. I curled up with my Mickey Malice plush, wishing I were holding Alexander instead. As I lay in bed, I tossed and turned. I couldn't wait for tomorrow's sunset.</p><p>Moments later, I felt a presence stirring in the quiet. I glanced around, but all the shadows were from the furniture. I checked under my bed; even a bat couldn't squeeze between all the junk I had stashed underneath it. I opened my closet door, but the only clothes I found were on hangers or strewn on the floor. I tiptoed to my window and pulled back the curtain, looking out into our backyard.</p><p>\"Alexander?\" I saw a darkened figure walking away from the house, into the night.</p><p>\"Good night, my love,\" I said, pressing my hand to the window.</p> <p>I returned to bed and fell asleep.</p><p>The next morning, I awoke with a jolt. Yesterday's events seemed like a dream.</p><p>When I rose in my stiffened clothes, I realized that those events were real.</p><p>\"Why are you still in your outfit from yesterday?\" my mom nagged when I entered the kitchen. \"Don't they talk about proper hygiene in health class?\"</p><p>I wiped my haggard eyes and stumbled to the bathroom. I peeled off my day-old clothes and stepped into the shower.</p><p>Warm water flowed over my pale skin. My black nail and toe polish looked stark against the clear white tub and tile that surrounded me.</p><p>I was back in Dullsville and Alexander was in his Mansion. We could finally live our lives together. But my boyfriend was a vampire and his nemesis had come to hunt him down. I'd never thought Dullsville could be so, well, not dull!</p><p>My whole life had changed in just a few days. For sixteen years I'd been living the same monotonous existence. My greatest concern had been finding black nail polish in a pastel town. Now it was getting through a sun-filled day alone while Alexander slept peacefully in his Mansion. We wouldn't be able to go for afternoon bike rides, meet after school, or spend our weekend days hanging out. It was hard to imagine that I wouldn't ever be able to share sunlight with him. I was beginning to have doubts that I could handle this new world.</p> <p>\"It was a blast! I bought you this,\" I said, and handed Becky a package as we sat on the Evans Park swings.</p><p>She opened a Hello Kitty journal. \"Cool. Thanks!\"</p><p>\"They have the best stores ever! And I went to a place called the Coffin Club. I met this weird guy.\"</p><p>\"Really? Matt and I just went to the movies.\"</p><p>\"If I tell you a secret, a super-duper colossal secret, do you promise not to tell anyone?\"</p><p>\"Can I tell Matt?\" she asked eagerly.</p><p>Matt, Matt, Matt--who cared about Matt when I was bursting to tell her about my encounter with Jagger and the truth about Alexander.</p><p>\"Why are we talking about Matt when I have the biggest news of a lifetime?\"</p><p>\"Well, you always talk about Alexander,\" she barked back. Her porcelain cheeks flushed ruby red. \"And I listen to you all the time. Just 'cause you went away and had exciting things happen doesn't mean I didn't, too.\"</p><p>I was surprised by Becky's outburst. It had been only a few days since she had hooked up with Matt, but if she felt for him half of what I felt for Alexander, I'd have to understand her intensity. Becky had always been so mousy. Now that she had her own beau, she had become more confident. Our relationship had changed. We had never had anyone before but each other.</p><p>\"Fine,\" I said, reluctantly. \"You're right. I'm glad you are going out with Matt. Someone as awesome as you should have an awesome boyfriend.\"</p><p>\"Thanks, Raven. Now, what were you going to tell me?\"</p><p>I paused, debating if she could handle the vampirey info.</p><p>\"Is Matt going to show up here again?\"</p><p>She nodded. \"He's right behind you.\"</p><p>I guess I had my answer.</p><p>\"So, Monster Girl, how's Monster Boy?\" a male voice called as I left the park. I glanced around to find Trevor in his red-and-white soccer uniform.</p><p>\"I thought I was done with you. Are you always going to be in my face?\" I asked.</p><p>\"As long as you wear black I will be. Have you two made any Monster Babies yet?\" he asked.</p><p>\"No, but when we do, I'll be sure to name one after you.\"</p><p>I walked away, and Trevor continued to follow.</p><p>\"How do you do it? Play soccer, spend your daddy's money, and annoy people, all at the same time?\" I asked.</p><p>\"I could do more than annoy you, if you'd let me,\" he said, coyly fixing his green eyes on me. \"So that line isn't working on the cheerleaders anymore?\"</p><p>If Trevor had ever truly bothered me before, he was now just a pest given what I'd recently been through.</p><p>\"I still think there's something fishy going on in that mansion,\" he said, unrelenting.</p><p>\"Give it a rest.\"</p><p>\"Don't you think it's strange that Alexander's never seen during the day?\"</p><p>\"I wish you weren't seen during the day. Besides, he's homeschooled.\"</p><p>\"My mom told me she spotted that freaky butler man hanging out at the butcher.\"</p><p>\"Yeah. That is strange. The butler eats food. Who knew?\"</p><p>\"He requested 'the freshest, bloodiest meat you have.' \"</p><p>\"Would you prefer they drink your blood?\" I teased.</p><p>He looked at me in shock.</p><p>\"Get a life,\" I said. \"Maybe your mom should be paying attention to you more and gossiping less.\"</p><p>\"You leave my mother--\"</p><p>\"I really don't have time for you or your mother anymore. Maybe it's time you get a new best friend,\" I said, and walked away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Impatient, I arrived at the Mansion before sunset. Jameson's Mercedes was once again parked in the driveway.</p><p>I sat on the uneven front steps, picking at the dandelions and weeds growing between the cracking cement. The door slowly creaked open.</p><p>Jameson greeted me.</p><p>\"I'm so glad you're back,\" I said, squeezing his bony frame.</p> <p>\"I am, too, Miss Raven. I missed the Mansion and our favorite guest.\"</p><p>\"I missed you, too. And I know one fabulous lady who was bummed that you were gone...\"</p><p>\"Miss Ruby?\" he asked, his eyes coming alive.</p><p>\"Are you going to call her?\" I asked.</p><p>\"After what I've done? I couldn't.\"</p> <p>\"You have to! Besides, it wasn't your fault. Just tell her you were unexpectedly called out of town.\"</p><p>\"She'd never forgive me. And she shouldn't.\"</p><p>\"Ruby loved the flowers. Besides, there's a carnival this weekend. She'll need a date. And you'll need one, too.\"</p><p>I could see Jameson pondering the decision, excited about seeing Ruby again, but unsure if he could muster the courage to call her.</p><p>Alexander bounced down the grand staircase, wearing black jeans and a black HIM T-shirt. He gave me a long hello kiss. \"That was sweet of you to come by last night,\" I said, in his arms.</p><p>\"I didn't come by,\" he said, confused.</p> <p>\"You didn't? I saw a guy in my backyard.\"</p><p>Alexander looked worried.</p><p>\"I bet it was Trevor,\" I guessed. \"I saw him after school. I think he still blames me for his plummeting popularity.\"</p><p>\"If you need me to talk to him, I will.\"</p><p>I'd always defended myself from Trevor. It was refreshing to finally have someone who would stand up for me. \"You are my superhero!\" I exclaimed, and gave him a hug.</p><p>\"I found this really cool place.\"</p><p>\"Cool place? In Dullsville?\"</p><p>He grabbed my hand and led me out of the Mansion and down the street.</p> <p>\"It's so ironic that the rumors Trevor started turned out to be true,\" I said to my vampire boyfriend.</p><p>\"About me, or you?\" he teased.</p><p>\"I mean, I thought you were...then I didn't. But then I did. And then when I totally didn't again, I found out you were.\"</p><p>\"Now I'm confused. Am I? Or am I not?\"</p><p>\"That is the question.\" I squeezed his hand.</p><p>\"I just don't want to lose you or put you in danger.\"</p><p>\"I love danger.\" When we passed Dullsville's cemetery, I wondered where we were going.</p><p>\"Just a little bit farther,\" he assured me.</p><p>I would walk to China if Alexander were by my side. I had so many questions burning inside me, I didn't know which to ask first.</p><p>\"Did you grow up with Jagger?\"</p><p>\"Our families were close when we were born. I think he was jealous of Luna. With her living as a human, he knew what he was missing--school, sports, friends. He is scrawny, but I think he really dreamed of being a jock like Trevor. I kind of feel sorry for him. He wasn't able to find something he enjoyed, besides revenge. But then my family traveled. My parents were bohemians, and we really never fit in with our kind. We were what was known as vampire vegetarians.\"</p><p>\"Cool. So how do you survive? Connections with the butcher?\" I joked, referring to my conversation with Trevor.</p><p>\"How did you know?\" he asked, surprised. \"We also have family who have ties to blood banks.\"</p><p>\"Uh...I just guessed,\" I replied. \"My parents were hippies, too. They wouldn't eat anything with eyeballs. But they traded their hippie threads and beaded satchels for Armani suits and briefcases, and they drive their BMWs past PETA protesters on their way to work.\"</p><p>\"Sounds like our parents would make great friends.\"</p><p>\"Just like us.\"</p><p>Alexander squeezed my hand.</p><p>\"I sometimes wonder what it would be like if you changed me. We could stay up all night long, fly into the night, and be bonded for eternity.\" \"I've imagined what it would be like if I were born like you. We could go to the same school, lie out in the sun, have picnics in the park. I'd be able to see us reflected together in a mirror. I'd fill my walls with pictures of us at the beach.\"</p><p>\"We share similar dreams.\"</p><p>\"You're a human who wants to be a vampire, and I'm a vampire who wants to be human.\"</p><p>I gazed up at Alexander with empathy. I hadn't realized he felt as alone in his own world as I did in mine.</p><p>\"It's just over there,\" he said, pointing to an abandoned barn across the train tracks.</p><p>The red barn had seen better days. Boards from the gray roof and side were missing, like teeth on a smiling kindergartner.</p><p>We stepped through the door frame. The door was missing, but the wooden beams that held the barn together still remained intact. Vacant stalls stood on one side, an empty hayloft on the other. Alexander grabbed a gas lantern that hung from a hook on the wall and turned it on. He took my hand and led me toward a darkened corner.</p><p>\"Are we going up into the hayloft?\" I asked coyly.</p><p>\"Follow me,\" he said. \"Don't be afraid. They won't bite,\" he said with a laugh.</p><p>\"Who's they?\" I wondered. I imagined a family of vampires, hiding out in the stable. Maybe long-lost relatives of his.</p><p>I held his hand hard as he pulled me into the corner of the abandoned barn. I could see two slanted eyes staring back at me from the corner. I stepped into the moonlight to discover a powder white mama cat with a litter of snowball white baby kittens--and there in the mix by herself was one teeny black cat. \"She's just like me!\" I exclaimed.</p><p>\"I thought you'd like her.\"</p><p>\"She's the cutest thing I've ever seen! I want her to come home with me,\" I said wishfully, kneeling down and staring at the kitten.</p><p>\"I found them last night.\"</p><p>\"You want me to keep her?\"</p><p>\"She's finished nursing. And the mother can't care for them all.\"</p><p>Alexander and I sat off to the side and watched as the kittens purred and the mama fell asleep.</p><p>\"I'm surprised she isn't hissing at us,\" I said.</p><p>\"She understands we're not here to hurt her, but to help her.\"</p><p>\"So, you're like Dr. Dolittle with a bite.\"</p><p>He grimaced at my joke. \"Do you want the cat or not?\"</p><p>I nodded my head eagerly.</p><p>Alexander picked up the tiny black kitten, who looked like a small ball of yarn in his handsome hands.</p><p>\"It's okay,\" he said, handing her to me.</p><p>I held the tiniest black baby kitten I'd ever seen. She licked her mouth and looked up at me as if she were smiling.</p><p>\"I can keep her?\"</p><p>\"I wanted you to have something to remember me by.\"</p><p>\"Remember you?\"</p><p>\"To keep you company during the day.\" \"That is the sweetest thing!\" I stared down at my Gothic Gift gazing up at me with teeny lime green eyes. \"I'll call her Nightmare.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Where did you get that?\" Billy Boy asked when I brought Nightmare into the house.</p><p>\"Alexander gave her to me.\"</p><p>\"She's so cute. But you'll have to hide her from Dad. You know how he feels about pets.\"</p><p>\"I know, but I'm not bringing a lizard home this time. It's just a kitty.\"</p> <p>\"Where'd you get that?\" my dad asked, coming down the stairs.</p><p>\"Alexander gave her to me.\"</p><p>\"I don't care if the president gave it to you. It has to go.\"</p><p>\"Paul, she is really cute,\" my mom commented, petting Nightmare's head. \"And Raven is certainly old enough to be responsible for a cat.\"</p><p>\"Her age is not what I'm concerned about,\" he warned.</p> <p>\"Dad, didn't I prove enough to you by working at Armstrong Travel? I'm not a little girl anymore.\"</p><p>He paused as I held my Nightmare up to his face. \"Fine. But she stays in your room. I don't want her running all around the kitchen countertops or scratching on my couch.\"</p><p>\"Thanks, Dad.\" I gave him a huge hug and kiss on his cheek.</p><p>\"Now I'll show you your new home,\" I said to Nightmare as I took her to my bedroom.</p><p>I looked around my room. I didn't know where to put her.</p><p>\"I have an old box in the garage filled with clothes from college that would be a perfect bed for her,\" Mom said, peeking in. \"It's above the tools. Bring me the box and I'll repack the clothes.\"</p> <p>\"Thanks.\"</p><p>I started to close my bedroom door when Nightmare began to follow me.</p><p>\"I'll be right back, sweetie,\" I said, putting her in the middle of the floor. \"I'm going to make you a bed.\"</p><p>Nightmare's ears perked up, and she looked at the window. She darted up onto my computer chair and then onto my desk. She stared out the window, hissing. I picked her up and placed her on my bed.</p><p>\"I'll be right back. Sleep here for now.\"</p><p>When I reached my bedroom door, Nightmare was back at my feet, her lime green eyes squinting at me. She hissed at me and pawed at my boots.</p><p>I picked her up. \"Mommy will be right back.\" I kissed my new kitty on the nose, placed her back on the floor, and quickly closed the door. I could hear her scratching against the wood as I ran down the hall.</p><p>I walked to our garage at the end of our driveway. I stood on my dad's toolbox as I searched for the box. I could hear the crickets. There was a lot of rustling in the tree by my bedroom window. I froze.</p> <p>More rustling. It could be a squirrel. Or having just seen Trevor last night, I thought he could be toilet papering my window.</p><p>I turned off the garage light and tiptoed over to the tree. But now the leaves were still. Not a bird. Not a squirrel. Not a soccer snob.</p><p>I headed back to the garage, and then I saw Jagger.</p><p>I gasped.</p><p>\"What are you doing here?\"</p><p>\"I just wanted to see you.\"</p><p>\"I thought you went back to Romania,\" I said, stepping back.</p><p>\"I was hoping you would come with me.\"</p><p>\"Alexander assured me that the feud was over and you were gone for good.\"</p><p>\"That is why you can't tell him,\" he said. \"Otherwise, not only will your safety and Sterling's be in jeopardy, but the whole town's.\"</p><p>\"The whole town?\" I asked.</p><p>\"Don't tempt me,\" he said, licking his lips. \"You wouldn't like to know what happens when a small town finds out a vampire is living among them and dating one of their daughters.\"</p><p>I froze. I remembered how easily Dullsville was sucked into Trevor's rumor, resulting in gossip and graffiti. If the town had proof of Alexander's true identity, there was no predicting what people would do.</p><p>\"Fine, I won't tell him. But you must leave now!\"</p><p>Jagger only stepped closer. \"I'm not going back to the cemetery with you,\" I argued, backing up. \"I'll scream if I have to. My father is inside and he's a lawyer.\"</p><p>\"That won't be necessary. Why spend your life sitting in a mansion with a sensitive artist watching paint dry when we could see the world together?\"</p><p>\"I'm not going anywhere with you!\"</p><p>\"Well, I'm sure you could persuade me to stay in town. In fact, I'm beginning to like it here.\"</p><p>\"I don't want you! Your feud is over with Alexander. Go home already--\"</p><p>\"Feud? I have other things on my mind now. Alexander might be able to deny who he is, but I can't deny who I am.\"</p><p>His blue and green eyes shot through me. I looked away, afraid he'd make me dizzy again. He began to lean into me.</p><p>\"Raven!\" Billy Boy called from the back door.</p><p>My brother ran down the steps holding Nightmare. Jagger stepped back into the shadows.</p><p>\"Billy Boy! Go inside. Now!\" I exclaimed, running toward him.</p><p>\"What's taking you so long?\" Billy Boy asked. \"Nightmare is throwing a freak attack. I found her pawing against your bedroom door.\"</p><p>I blocked Billy Boy's step. Frantically, I turned around, shielding him.</p><p>The backyard was empty. Jagger was gone.</p><p>I pulled Billy Boy inside and locked the door. \"I've never been so happy to see you!\" I said, squeezing my little brother, Nightmare in his hands.</p><p>\"What's wrong with you?\" he asked, cringing like I had cooties.</p><p>\"I just thought I saw the bogeyman.\"</p><p>\"You watch too many scary movies,\" he said.</p><p>\"I sometimes feel like I'm starring in them,\" I replied. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As much as I hated going back to school after spring break, I knew at least my daylight hours brought a safe reprieve from Jagger.</p><p>I returned to Dullsville High a different person than when I had left--as if being the only goth in a conservative town hadn't made me different enough. I couldn't concentrate in class, knowing I was privy to a secret world of vampires.</p><p>Classmates continued to bury their heads in textbooks and anticipate the next soccer game, while I doodled in my journal and couldn't wait for the next sunset.</p><p>I was still an outcast, but I think my classmates got a rise that Trevor had been dethroned from his kingdom. And although they didn't high-five me in the hallway or invite me to their parties, I was actually given a cutter's privilege at the drinking fountain.</p> <p>\"It's a shame Alexander is homeschooled. It would be nice to eat lunch as a foursome,\" Becky said at lunch on the baseball bleachers. \"Yeah, that would rock.\"</p><p>\"But still, we should do something together.\"</p><p>\"How about going to the drive-in?\" Matt asked, as he walked up the bleachers behind me. \"Kissing Coffins is playing tonight. Admission is half price if you wear a costume.\"</p><p>\"Cool! I've always wanted to see it on the big screen. I'm sure Alexander would love to go.\"</p><p>\"And I'll be able to see what happens to Jenny,\" Becky said excitedly. \"I can dress as one of the town's vampires and wear a cape.\"</p> <p>\"And fangs!\" I added.</p><p>Just then Trevor walked onto the field with his soccer-snob groupies. He looked up at Matt, who sat down next to Becky.</p><p>As much as Trevor tormented me and as pathetic as I thought he was, I felt a tinge of pity for him. He was an even sadder case now that he was Matt-less. I watched Matt offer Becky his sandwich.</p><p>\"I'm glad you got traded to our team,\" I said to Matt, who closed his brown bag and gave me a warm smile.</p><p>After school, Becky and I searched through my closet to find her a costume to wear to the drive-in.</p><p>\"Man, you do have a lot of black,\" she said, as I tossed out dozens of skirts and shirts for her to choose from.</p> <p>Becky modeled black tights, a black miniskirt, and a lacy black chemise. \"That's perfect. You'll be one of the members of the vampire gang who tries to convert Jenny. I just need my outfit.\"</p><p>I heard my mom's SUV pull into the driveway, and Becky and I raced to meet her at the back door.</p><p>\"Can I have an advance on my allowance?\" I asked hurriedly.</p><p>\"Calm down,\" she advised. \"Don't I even get a hello?\"</p><p>\"Hello,\" I replied. \"Now, can I have an advance on my allowance?\"</p><p>\"I hope you didn't bid on a Hello Batty toaster on eBay again. I thought we told you--\"</p><p>\"I want to dye my hair blond.\"</p><p>\"Blond?\" she asked, shocked. \"You are not going to ruin your gorgeous black hair.\"</p> <p>\"But it needs to be blond to complete my costume.\"</p><p>\"Are you in a play?\"</p><p>\"Well, sort of.\"</p><p>\"For school?\"</p><p>\"No, I just need your help.\"</p><p>\"Well, I have some wigs from college in the box I emptied for Nightmare. I know there's an auburn one. There may be a blond one, too.\"</p><p>\"Can we go see?\" I begged.</p><p>Mom reluctantly put her purse down on the kitchen table, and Becky and I followed her into my parents' bedroom. She rummaged through an old Harrod's shopping bag. \"Here it is!\" she exclaimed, as if she'd found a sunken treasure. She handed me a weathered blond wig. \"I wore this in college. Your father loved it!\"</p><p>I rolled my eyes. \"I also need a white dress,\" I confessed.</p><p>She looked at me, pleased, as if her rebellious daughter were finally asking to borrow pearls. \"I'll see what I have!\" she replied gleefully.</p><p>She picked up a pair of flared denims with rhinestones from the box. \"Do you believe I once wore these?\" she asked, holding them against her pleated Ann Taylor skirt.</p><p>\"I have a white blouse,\" she said.</p><p>\"Ahh. Here's a white eyelet skirt.\"</p><p>\"Perfect.\"</p><p>My mom stuck the wig on my head, and I held the clothes in front of me.</p><p>\"It's like looking at a teenage version of myself,\" she said fondly.</p><p>I threw the skirt and blouse in the wash, and Becky and I returned to my room.</p><p>\"We are so going to rock!\" I said. \"But we just need one thing to complete our outfits.\"</p><p>I hunted through my dresser drawers, closet shelves, and boxes underneath my bed.</p><p>Halloween was months ago, and in a town like Dullsville it was easier to find a fake Prada purse than fake teeth.</p><p>Frustrated, I banged on Billy Boy's door. He opened it slightly, sticking his Charlie Brown--shaped head out. I could barely see Henry typing at my brother's computer. \"Did you take my vampire teeth?\" I accused him.</p><p>\"Why would I want your nasty saliva near me?\" Billy Boy said, starting to close the door on me.</p><p>\"Well, I can't find them, and I have to have them for tonight,\" I argued, pressing the door back open.</p><p>Henry rushed over to the door. \"I have some,\" he offered. \"Never been used.\"</p><p>Henry and Billy Boy rode their bikes, and I followed with Becky on mine. We must have been quite a sight as we headed to Henry's house at the edge of Oakley Woods--two goths and two nerds riding alongside one another.</p><p>We parked our bikes in Henry's driveway and entered the colonial-style five-bedroom house.</p><p>We were greeted by his housekeeper, who was folding laundry.</p><p>We walked up the pristine wooden stairs to his bedroom. A NO YUPPIES ALLOWED sign hung on his door.</p><p>\"I like that,\" I said.</p><p>A spongy black doormat rested on the floor, and a million dead bolts sealed his door.</p><p>\"What are you hiding inside? Secret recipes of cafeteria food?\" I asked.</p><p>After he unlocked the outside dead bolts, he stepped onto the mat. His bedroom door sprung open automatically.</p><p>Henry had a loft bed, with a metallic blue computer underneath. Stars were pasted on his ceiling, I'm sure in astronomically correct order. A solar system mobile hung from his ceiling fan. A telescope stood by his window.</p><p>He slid open his walk-in closet doors to reveal neatly stacked, clear plastic shoe boxes.</p><p>\"Five dollars gets you samples,\" he said, pointing to them.</p><p>Each box was labeled: ACNE, BLOOD, PIMPLES. PUKE. SCARS.</p><p>\"Who wants to have more pimples?\" I asked.</p><p>\"And I have smells. Here,\" he said, opening a beaker and pushing it under my nose.</p><p>\"Gross!\" I said, repulsed. \"It smells like the bathroom after Billy Boy uses it.\"</p><p>\"Shut up!\" my brother said.</p><p>\"I like to pour this on Mrs. Louis's chair sometimes,\" he said proudly. \"Look around. I have them alphabetized.\"</p><p>\"I should have known.\"</p><p>Becky and I each handed over our money and loaded our pockets with ghoulish goodies.</p><p>When we were finished, Henry held a box before me as if he were holding the Holy Grail. He opened it, revealing two exact replicas of human teeth in the shape of fangs.</p><p>\"With the glue, seven dollars.\"</p><p>I knew I had only six in my purse.</p><p>\"Five dollars and a stick of gum,\" I offered.</p><p>\"Six. And your school picture,\" he countered. I looked hard at him, then at Becky.</p><p>\"But you inscribed it to me!\" she said.</p><p>\"Please,\" I begged, flashing her my puppydog eyes.</p><p>She opened her wallet and handed Henry the picture.</p><p>I handed him the money and left before he changed his mind.</p><p>As I headed out to meet Alexander for our date, I found my parents in the kitchen, paying bills.</p><p>\"I'm going to be out a teensy bit late tonight,\" I advised.</p><p>\"It's a school night,\" my mother said.</p><p>\"I know, but we're going to the drive-in,\" I said with a smile.</p><p>\"Why don't you wait until the weekend?\" my mom asked.</p><p>\"Because tonight's half price if you wear a costume. Becky and Matt are going, too.\"</p><p>\"Becky?\" my mother asked, surprised.</p><p>\"Yes, my little Becky. It'll be our first double date. Besides, I already did my homework, and we have a sub for first bell anyway.\"</p><p>\"Seems like you had all your excuses lined up,\" my father said.</p><p>\"I'll take care of the dishes all week,\" I said to my mother. \"And Dad, I'll wash your car.\" \"Last time you washed my car, you put Wicked Wiccas stickers on it.\"</p><p>\"But you have to admit, it looked cool.\"</p><p>\"And last time you took care of the dishes, you broke Grandma's teapot,\" my mother remembered.</p><p>\"Fine. Then we have a deal,\" I began. \"I'll just go to the movie, and I'll save you trouble by not doing your chores.\"</p><p>\"How did that just happen?\" my dad wondered, as I headed for the front door. \"And when you're finished with that blond wig, your mother needs it back.\"</p><p>I slung my backpack filled with my Kissing Coffins accessories on my shoulder and grabbed a container of garlic powder from the kitchen. I held it tightly in my hand, as if I were holding a can of Mace, as I walked to the Mansion. If Jagger jumped out at me, I wanted to be protected.</p><p>I felt a familiar lurking presence as I turned the corner to Benson Hill. I saw a rustling in a bush and blond strands poking through the branches. I took a deep breath, and I quietly opened the container of garlic powder and threw it hard, directly into the brush.</p><p>\"Ouch!\" a male's voice cried.</p><p>Trevor jumped out of the bush and held his forehead.</p><p>\"What are you doing?\" I shouted at him.</p><p>\"I saw you coming up the road and wanted to scare you,\" he said, rubbing his wound.</p><p>\"You don't have to hide. Your face alone could scare Frankenstein.\" I grabbed the container from the sidewalk and replaced it in my purse.</p><p>I walked away, and Trevor continued to follow me as we drew closer to the gate.</p><p>\"I really don't have time for you anymore,\" I said. \"I'm going to the drive-in.\" And I slipped past the slightly open iron gate.</p><p>\"You have a pretty good arm. You should try out for the baseball team. And tell your gothic boyfriend,\" he called, \"if he wants to apply, they could use a batboy.\"</p><p>I left Trevor and was walking up the Mansion's driveway when I overheard him talking to someone outside the gate. I glanced back and saw my nemesis from behind, standing next to a guy with white hair.</p><p>I stopped. Jagger and Trevor? A dangerous duo.</p><p>I sneaked back down the driveway and hid behind a bush next to the wrought-iron gate.</p><p>\"Hey, watch out, dude!\" Trevor hollered. He must have bumped into Jagger in the darkness.</p><p>I could only imagine Trevor's reaction to the shock of seeing the pale, tattooed, multipierced Jagger walking alone on a darkened street. I wasn't sure if Trevor would hit him or take off running.</p><p>\"Sorry,\" Jagger said in a cool voice. \"I didn't see you coming.</p><p>\"It's so dark around here,\" Jagger continued, shifting his feet.</p><p>\"Yeah, I think the Sterlings knock out the streetlamps on purpose.\" Jagger laughed. \"That babe you were walking with. She's your girlfriend?\" he asked.</p><p>\"Raven? She's my nightmare. No, she hangs out with the dude who lives in the Mansion. I've never seen you around here before,\" he said, scrutinizing him.</p><p>\"I'm just visiting. I'm Sterling's friend.\"</p><p>\"Friend? I didn't think he had any,\" he said with a laugh. \"Well, you better catch him before they go to the drive-in.\"</p><p>\"The drive-in?\" Jagger asked.</p><p>\"Yeah. It's built on an ancient burial ground,\" he whispered, as if revealing a secret. \"I've heard that late at night, you can see ghosts eating popcorn.\"</p><p>\"Burial ground?\" Jagger wondered aloud. \"Perfect.\"</p><p>\"For what?\" Trevor asked, confused.</p><p>\"Uh...a club initiation,\" Jagger rambled. \"But it's a very exclusive club...Maybe in the future you could join.\"</p><p>\"Thanks anyway. Soccer takes all my free time. Besides, Sterling doesn't seem like the type to belong to a club.\"</p><p>\"He's already a member. I just have to persuade Raven to join. Maybe I'll surprise them there,\" Jagger said. \"Can you point me in the right direction?\"</p><p>\"Follow me,\" Jagger's new ally said. \"It's on the way to the game.\"</p><p>As the two left together, my mouth hung open in disbelief. Jagger was planning to have a covenant ceremony tonight at the drive-in, with me as his covenant girl!</p><p>I needed a plan fast.</p><p>I took a deep breath and tried to think. If I canceled our double date, Jagger could return to my house, putting not only me but my family in danger.</p><p>I didn't have much time to find a way to keep Jagger away for good without ending up as his dinner. Why couldn't Alexander and I just enjoy a movie together? Like Kissing Coffins, which reflected my own imminent situation--a movie about the vampire Vladimir Livingston, who tried to save the innocent mortal ingenue Jenny from the depths of the darkened Underworld.</p><p>And then it hit me.</p><p>Jagger was planning to take me tonight at the drive-in? But he couldn't. Not if I was already taken by someone else first. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's hard, you know, without a mirror,\" I commented anxiously in Alexander's room as I awkwardly tried to glue my fake fangs onto my teeth. The soundtrack to Kissing Coffins was blaring in the background. \"Are they straight?\" I flashed him a sexy vampire smile.</p><p>\"Wow!\" he said, impressed. \"Are you sure they are plastic?\" He touched them with his fingers. \"They look so real.\"</p><p>\"Be careful. They aren't dry,\" I snapped. \"Why are you so nervous? It's just a movie.\"</p><p>\"But it's not. I have something to tell you. Promise you won't be mad at me.\"</p> <p>\"Okay. Does it involve another guy?\"</p><p>\"Yes, but not in the way you think. Jagger's still in Dullsville.\"</p><p>\"How do you know?\" he asked, shocked.</p><p>\"I just saw him,\" I confessed.</p><p>\"Where?\"</p> <p>\"Outside the Mansion with Trevor.\"</p><p>\"Trevor? That's the last person he should be talking to.\"</p><p>\"Well, I saw Jagger the other night, too, at my house. But he warned me that if I told you, he would tell everyone about you.\"</p><p>\"He was at your house?\" he asked angrily. \"Did he hurt you?\"</p><p>\"No,\" I assured him. \"But he plans to, tonight, at the drive-in. Trevor told Jagger it was built on sacred ground and Jagger persuaded Trevor to show him where it was. Before, Jagger wanted me just to get even with you. Now I just think he wants me for himself--unless he is convinced that I have already been taken.\"</p><p>\"But--\"</p> <p>\"I'll need you to convince him.\"</p><p>\"But that means--\"</p><p>\"Just like Vladimir saves Jenny in the movie. It will be so romantic.\"</p><p>\"I don't know if I can.\" \"You have to. We have no other choice.\"</p><p>I gave him a reassuring kiss. \"It will be okay. Trust me.\"</p><p>I fluffed my hair. I spun around and modeled my outfit. \"How do I look?\"</p><p>\"I like you as a blond,\" he said, half distracted.</p><p>\"And you look like Vladimir,\" I complimented him, as I smoothed his dark suit and straightened his black cape.</p> <p>\"You look just like Jenny,\" he said.</p><p>\"But I want to see for myself.\"</p><p>I grabbed my purse off his bed, opened it, and reached inside, searching for Ruby's compact.</p><p>Alexander pulled at his stomach. \"I don't feel so well.\"</p><p>\"You're just nervous. I promise you, it will be okay.\"</p><p>\"I really don't--\"</p><p>\"Wait a minute,\" I said, scrounging for a peppermint.</p><p>\"What's that?\" he asked, repulsed when I offered it to him.</p><p>\"It's just a mint,\" I answered. \"Don't they have them in Romania? It settles your stomach.\"</p><p>\"Get it away from me,\" he said, refusing the mint and stepping away.</p><p>Then I smelled something odd coming from inside my purse.</p><p>I stuck my hand inside, and buried underneath my wallet and a huge wad of tissues was the cause. \"Oh no! It's my garlic powder,\" I said, holding the plastic container toward him. The lid had opened.</p><p>\"Put that away!\" he said, holding his stomach.</p><p>\"I'm sorry!\" I said, fumbling and stepping away from him.</p><p>\"Farther. Like in Utah!\"</p><p>\"I didn't mean to--\" I apologized.</p><p>His ghost-white face grew even more gaunt with every breath he took.</p><p>I opened the attic window and threw the plastic container as hard as I could, far into the night sky.</p><p>Alexander was still stepping back from me, his breathing getting heavier.</p><p>\"I'll throw my purse out, if I have to.\"</p><p>But he said nothing as he gasped for air.</p><p>\"Jameson!\" I called, but the Kissing Coffins soundtrack was playing too loudly for anyone to hear.</p><p>I ran out of the bedroom and down the attic steps. \"Jameson!\" I cried. \"Jameson!\" I didn't hear a sound as I barreled through the second floor. I flew down the grand staircase. Why did he have to live in such a big house?</p><p>I burst through the kitchen door and found Jameson putting dishes into the dishwasher.</p><p>\"Alexander!\" I gasped. \"He was exposed to garlic! Call nine- one-one!\"</p><p>Jameson's eyes grew even buggier than usual, making me even more terrified of the tragic state of the situation. But then he collected himself and opened a cabinet door. Lying on the shelf was an antidote. Jameson handed me the shot.</p><p>\"You must give it to him in his leg,\" he ordered.</p><p>\"I must?\" I said, shocked.</p><p>\"By the time I climb those stairs, Miss Raven, it may be too late.\"</p><p>I grabbed the shot from his slender hand and ran.</p><p>My heart raced as I took off up the grand staircase, doubtful I would get to Alexander in time.</p><p>I rushed into the room to find Alexander lying on his back on his bed, his skin turning blue and his eyes growing vacant. His breath was shallow.</p><p>I remembered watching Pulp Fiction. A nervous John Travolta wound up his arm and slammed a shot into Uma Thurman's arrested heart. I wondered if I could be so brave.</p><p>I placed a shaking hand on Alexander's thigh and raised the shot. \"One. Two. Three.\" I bit my lip and jammed the injection into his leg.</p><p>I waited. But Alexander didn't move. How long did it take? Was I too late?</p><p>\"Alexander! Talk to me! Please!\"</p><p>Suddenly, Alexander sat up, rigid, his eyes wide open. He breathed a full breath of air as if sucking in all the oxygen in the room.</p><p>Then he breathed out, and his body relaxed.</p><p>He looked up at me with weary eyes.</p><p>\"Are you okay?\" I asked. \"I didn't mean to--\" \"I need some--\" he tried to say.</p><p>\"Blood?\" I asked, worried.</p><p>\"No. Water.\"</p><p>Just then Jameson came into the room with a tall glass.</p><p>I held the glass to his lips. Alexander quickly drank it down. With every gulp his eyes grew more alive.</p><p>\"Your face looks almost pale again,\" I said eagerly.</p><p>Jameson and I breathed a sigh of relief as Alexander recovered.</p><p>\"Why were you carrying garlic?\" Alexander finally asked.</p><p>\"In case Jagger visited me again.\"</p><p>\"Jagger?\" Jameson asked, alarmed. \"He's here?\"</p><p>Alexander and I nodded.</p><p>\"Then shouldn't we go? Is Miss Raven safe?\"</p><p>I grabbed Alexander's hand. \"Batman saved me from his evil nemesis before. And tonight he will for good.\"</p><p>The closest I'd been to Dullsville's drive-in was when Becky and I were in elementary school. We would sit outside the surrounding fence and watch a blockbuster movie in the crisp grass, eating popcorn and candy we brought from home. If we were lucky enough, the patrons would have their movie speakers turned on full blast. If not, Becky and I would provide our own dialogue and crack up until a security guard shooed us away.</p><p>Never in my wildest dreams did I imagine that Becky and I would be driving through the gates of Dullsville's drive-in with two boyfriends. When the rumors about Dullsville's drive-in being built on an ancient burial ground began, it was forced to shut down. But the only thing excavators discovered buried in the dirt were worms, and the theater had recently reopened. The smell of fresh paint mixed with the night air. Metallic gray speakers hung on stands next to the arriving cars. A yellow-and-white snack bar and picnic tables sat fifty yards behind the last parked car.</p><p>As Alexander drove Matt, Becky, and me through the parking lot, couples were wearing homemade capes and slicked-back hair, while little kids sporting pajamas and bat wings hung out on hoods and roofs of cars. Schoolmates from Dullsville High wore black T- shirts and jeans. It was obvious that no one but Alexander and me had actually seen the film. Alexander and I were the only patrons who came dressed as Vladimir and Jenny; everyone only knew it was a vampire movie, so they just wore black. The moviegoers stared at us as we drove through the crowd.</p><p>We found a spot in the back of the drive-in, and the four of us got out of the car to decide on snacks.</p><p>I had other things on my mind besides popcorn. As the three of them discussed \"to butter or not to butter,\" I tiptoed around the parking lot. Jagger could be anywhere, waiting to sink his fangs into my neck.</p><p>Alexander found me hunting around the bushes.</p><p>\"Come here,\" he said, leading me back to the car. \"He's spoiled enough of our fun. We should at least try to enjoy ourselves. Look around. Tonight, we're not outcasts,\" Alexander said, and gave me a squeeze. He was right. I glanced at the crowd, larger than Alexander's Welcome to the Neighborhood party.</p><p>\"This is way cool,\" I said, for a moment forgetting about the impending danger. Matt and Becky returned with popcorn and drinks. The previews started, and we got back into the car--Matt and Becky in the backseat and Alexander and me in the front.</p><p>I immediately locked the doors.</p><p>\"What are you doing?\" Matt asked. \"It's a drive-in.\"</p><p>\"Keeping out the riffraff,\" I said.</p><p>Just then a preteen boy with straws stuck on his teeth for fangs pressed his face against my window.</p><p>\"See!\" I said, as we all laughed. I leaned against the window, bugged my eyes, and flashed my vampire teeth.</p><p>The boy's mouth dropped open, and his straws fell to the ground. \"Mom!\" he cried, and ran off.</p><p>\"That was awful,\" Becky admonished.</p><p>\"But funny,\" Matt confirmed.</p><p>We munched on our snacks and cuddled as the previews ended and the movie began. All the while, Alexander and I anxiously glanced outside for any vampire activity.</p><p>\"I don't think I can do this,\" Alexander whispered when he caught me focusing on the picnic tables instead of the movie screen.</p><p>\"Of course you can.\" I could see the concern in his eyes. I leaned over and gave him a kiss on the mouth.</p><p>\"Hey, we can't see,\" Matt and Becky said.</p><p>Alexander and I laughed, a great relief from the nervous tension that had been building up in us. I cuddled next to him and, for a while, forgot about Jagger. We got lost in the moment, and Alexander and I recited the lines of the movie together. Three-quarters of the way through the film, at the moment that the vampire Vladimir was bringing Jenny to a graveyard wedding, the screen turned yellow, and the film burned and crumbled. We could hear a flapping sound.</p><p>The crowd began yelling \"Boo!\"</p><p>\"Aw, man,\" I heard Matt say.</p><p>\"It's all a conspiracy to make us buy more popcorn,\" I said.</p><p>We climbed out of the car and stretched.</p><p>\"I could use a drink. You guys want anything?\" Matt asked.</p><p>\"Thanks anyway,\" I said.</p><p>\"I'll go with you,\" Becky offered. Matt grabbed her hand, and they left for the snack bar.</p><p>\"Should we be concerned about them?\" I asked, feeling uneasy.</p><p>\"Jagger wants you, not a soccer match.\"</p><p>I looked around. My heart started to race.</p><p>\"Now I'm getting nervous,\" I said.</p><p>\"Why don't you relax in the car. I'll stand guard.\"</p><p>I opened the driver's-side door, jumped in, and quickly locked the door.</p><p>I turned to lock the passenger door and gasped.</p><p>Jagger was sitting next to me!</p><p>\"You thought I wouldn't recognize you with blond hair,\" he sneered.</p><p>I tried to open the door, but he grabbed my arm. \"I've come to collect what I didn't collect before,\" he said, looking into my eyes, his fangs primed. I pushed him away just as I heard a banging on my window. I looked up to see an enraged Alexander.</p><p>He tried to open my door as I struggled to keep Jagger's fangs at bay.</p><p>Frustrated, Alexander ran to the other side as Jagger automatically locked all the doors.</p><p>\"Help!\" I cried, pushing him at arm's length.</p><p>Alexander returned to my window, balling his fist to punch through the glass, when I managed to wedge my feet in front of Jagger. I stretched one hand toward the window, my fingers reaching as far as they could, and barely touched the lock. With all my might, I managed to lift the knob with my index finger.</p><p>My door flung open, but Jagger pulled me out the passenger door before Alexander could reach me.</p><p>He dragged me away from the car and toward the back of the drive-in.</p><p>But before Jagger reached the exit, Alexander caught up and grabbed his arm. \"Let her go,\" he demanded, \"before I--\"</p><p>Jagger's grip remained tight around my wrist.</p><p>\"I came to do what you could never do,\" Jagger said.</p><p>\"What does he mean?\" I asked.</p><p>Alexander flashed his fangs at Jagger and stepped in between us. \"Don't make me do this in front of those people,\" Alexander said, referring to a few patrons in the distance who were looking at us curiously.</p><p>I backed away, out of reach of Jagger. \"This would never have happened,\" Jagger continued. \"My sister just wanted to be like everyone else. She could have had anyone. But we chose you! And you left her standing all alone!\"</p><p>\"You know why. I never meant to hurt her or your family,\" Alexander defended.</p><p>\"You'll do the same thing to Raven. You really were never like one of us. You may deny who you are,\" Jagger yelled, \"but I won't deny who I am!\"</p><p>He ran toward me and grabbed my arm just as Alexander grabbed the other.</p><p>Then Jagger flashed his fangs and lunged at my neck.</p><p>\"It's too late!\" I hollered, ducking away. \"Alexander already has me.\" I leaned in and bit Jagger's arm.</p><p>Suddenly the parking lot lights dimmed and the movie started again. The vampire Vladimir was leading Jenny by the hand through the cemetery. A gang of vampires was following them, trying in vain to stop the ceremony and take the ingenue for their own.</p><p>Jagger howled out in pain as I pulled Alexander toward the movie screen.</p><p>Alexander resisted. \"Where are you going? We can't turn our backs on him.\"</p><p>I gazed up at the screen. Vladimir was leading Jenny to the tombs. \"We don't have much time.\"</p><p>But Alexander stared back at Jagger, whose pale face was turning red.</p><p>\"Just like we planned. Please, trust me,\" I begged him, tugging his hand. Alexander glanced over his shoulder. Jagger was heading straight for us.</p><p>I could see Becky and Matt coming through the parking lot with drinks in their hands.</p><p>\"Hey, what's going on?\" Becky asked as she got closer.</p><p>\"I can't talk now, but get in the car and lock the doors!\" I commanded.</p><p>Alexander and I hurried toward the front of the lot, where the movie screen was.</p><p>An angry Jagger lurked behind us.</p><p>\"What is Raven doing?\" I heard Becky ask, as she and Matt got into the Mercedes.</p><p>Alexander and I stood in front of the movie screen and our Kissing Coffins mirror images.</p><p>Patrons began hollering, \"What's going on?\"</p><p>I looked out into the crowd, but I couldn't see Jagger.</p><p>Then I noticed him hovering behind a family, only fifty feet away from us. When he caught my eye, he took off toward us.</p><p>\"Hurry!\" I exclaimed. \"We don't have much time!\"</p><p>As Vladimir lifted his beloved Jenny into his arms, I placed my arms around Alexander's neck. He lifted me up.</p><p>The crowd roared, clapping and tapping their horns as we acted out the movie behind us.</p><p>I could see out of the corner of my eye that Jagger was now only a few feet away, coming after me.</p><p>\"Just like the film,\" I whispered. Alexander anxiously looked into my eyes. My fist clenched by my side, primed for what was about to happen.</p><p>\"Bite me, Alexander!\" I cried. \"Bite me!\"</p><p>Jagger reached out. Alexander put his mouth on my neck just as the on-screen vampire did to his bride. I felt a slight pressure on my flesh. I grabbed my neck and cried out. My head slumped back, my body lay limp in his arms. My heart pulsed in overtime as if beating for both of us. I could feel the warm red liquid slowly dripping down my neck, the smell of blood permeating the air around us. Alexander lifted his head proudly, mirroring the on-screen vampire, holding his bride in his arms, a red river flowing from both vampires' lips.</p><p>The crowd cheered.</p><p>I glanced over to Jagger, whose blue and green eyes were now red with rage. Alexander gently let me down.</p><p>I was light-headed. I stumbled to my feet, holding my red- stained neck, as the liquid trickled down my forearm. As the camera moved to a close-up of Jenny's face, I looked at Jagger with a wicked grin and flashed my vampire fangs.</p><p>He began to howl with such a rage his body shook, but his cry was masked by the audience hollering and honking their car horns.</p><p>There was nothing left he could do to Alexander, nothing he could take.</p><p>Jagger's eyes grew redder, his muscles rippled, and he licked his fangs. He withdrew into the darkness and disappeared. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I loved the way you acted out the movie last night!\" Becky complimented me the next day at our lockers. \"I had no idea you planned to do that. You totally rocked!\"</p><p>\"Thanks. I just had to wait for the right moment.\"</p><p>\"Who would have known Vladimir would only pretend to bite Jenny so the vampires wouldn't covet her as one of their own.\"</p><p>\"He does it so the vampires will believe Jenny has bonded eternally to him. They are forced to flee London and return to Romania, never to harm her again.\"</p> <p>\"Yeah, but you would think Vladimir would want to make her a vampire for himself.\"</p><p>\"Well, the lesson is, not all vampires are bad,\" I said with a smile.</p><p>\"They aren't?\" Matt asked, standing behind us.</p><p>\"Yes, just like soccer snobs,\" I teased.</p><p>\"Well, I thought Alexander really bit you. Can I see your flesh wounds?\" he added.</p> <p>\"Isn't that a personal question?\" I kidded. \"Besides, Alexander only pretended to bite me-- just like Vladimir does to Jenny. He gave an award-winning performance,\" I said proudly. \"I think he actually liked acting in front of all those people.\"</p><p>\"Well, the blood looked real, too,\" he said.</p><p>\"My brother's nerd-mate, Henry, has all these special effects. That's where I got these vampire teeth,\" I said, and flashed them.</p><p>\"Why are you still wearing them?\" he asked. \"I can't get them off. I think Henry charges extra for glue remover.\"</p><p>Just then two of Dullsville High's junior varsity cheerleaders stopped at our lockers.</p><p>\"Like, can you tell me where I can get those costumes you wore last night?\" one asked.</p> <p>\"You looked like Marilyn Monroe,\" the other cheerleader said to me. \"And you looked like Elvira,\" she said to Becky. \"I want a costume like Elvira.\"</p><p>Costume? I wondered. Hadn't they ever noticed I'd always dressed like that? I considered telling her about Hot Gothics in Hipsterville, or inviting her to come over to my house to borrow from my closet. But the thought of preppy cheerleaders dressing goth just because they thought it was \"in\" turned my stomach. I'd been an outcast for so long, I might have a hard time being an incast.</p><p>\"You were awesome last night,\" her friend complimented. \"Where did you get that blood?\"</p><p>I was thinking of telling her about Henry, but decided to keep him my secret.</p><p>\"It was real,\" I said.</p><p>\"Ooh, gross!\" they both exclaimed, and scurried away.</p><p>I had to admit, I liked the attention the drive-in performance brought me. Even if I knew it was going to last only as long as a ditzy cheerleader's attention span.</p><p>The bell rang.</p> <p>\"The drive-in's going to have another costume night,\" Matt added. \"And people are already talking about acting out the movie.\" \"Maybe Alexander and I should get a cut of the admissions. Where's my agent when I need her?\"</p><p>\"Who was that creepy white-haired kid who came over to you by the movie screen?\" Becky asked.</p><p>\"I guess someone wanting to play one of the vampire gang,\" I replied, and slammed my locker shut. \"But I thought he sucked,\" I added. \"He wasn't convincing as an evil vampire at all.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was a new girl in Dullsville--me. After all, I'd spent sixteen years living a monotonous existence. Now Dullsville wasn't so dull anymore. A few blocks away from me on Benson Hill lived the love of my life--Alexander Sterling. My boyfriend. My Gothic Mate. My vampire.</p><p>I was reunited with Alexander, and his nemesis was out of our lives. I had to wonder what would be normal for us. I was dating a vampire. I would have to keep a secret I'd never be able to share with Becky, my parents, or anyone. To keep him in my life, I needed a padlock on my black lips.</p><p>Alexander and I would always have to meet after sundown. I would never be able to eat breakfast or lunch with him. We'd have to avoid sitting near mirrors at fancy restaurants and make sure garlic wasn't being minced anywhere in the vicinity.</p><p>And most important, I wondered whether I would have to become a vampire for us to have a future. That evening, I met Alexander at the Mansion door, a backpack slung on his shoulder and an umbrella in his hand.</p> <p>\"Let's go,\" he said proudly, taking my hand.</p><p>\"Where are you taking me tonight? A tomb?\"</p><p>\"You'll see...\"</p><p>\"You were awesome that night. Everyone at school thought you totally rocked! For a moment, I thought you were really going to bite me.\"</p><p>\"For a moment, I really wanted to,\" he said with a wink.</p> <p>\"It must be hard for you, resisting your impulses.\"</p><p>\"You have impulses, too, that you resist, don't you?\" he asked playfully, tickling me. \"Why should I be any different?\"</p><p>I giggled.</p><p>After a few blocks we stopped in front of Dullsville's country club.</p><p>\"You're kidding. My dad belongs here.\"</p><p>\"Well, he has good taste.\"</p> <p>\"I never thought so.\"</p><p>Bushes standing eight feet high lined the property of the golf course, surrounded by a low chain-link fence.</p><p>We quickly climbed over the metal blockade and walked onto Dullsville's golf course. Of all the places I've snuck into before, this was not on my list.</p><p>\"If I get caught sneaking in here,\" I joked, \"this could really ruin my reputation.\" At night, the course seemed mysteriously spooky and gorgeous.</p><p>We walked across the tee, down the fairway, and onto the green, avoiding the sand traps and bunkers just like golf balls.</p><p>Alexander and I sat on the green of the third hole, which overlooked a small lake with a lit fountain. A few weeping willows, which offset the lake, in the darkness looked like they were crying black lace instead of leaves. The course was eerily quiet. The only sounds we could hear were crickets and the gentle splashing of the waterfall.</p><p>\"I like to be surrounded by beautiful scenery--but you overshadow even that.\"</p><p>I gave him a quick kiss.</p> <p>\"I also like to dance in unusual places.\" He opened his backpack and pulled out a portable CD player. He switched it on, and Marilyn Manson began to wail.</p><p>\"Can I have this dance?\" he asked, offering his hand.</p><p>At first we slow danced on the green to one of the morbidly sluggish tunes. We must have looked like quite a sight--two goths dancing in the dark on a golf course.</p><p>As the songs picked up pace, we danced around each other and the flagpole until we were exhausted.</p><p>We ran to the lake and cupped our hands in the water. The light from the fountain caught my reflection in the water. What should have been Alexander's reflection was only ripples of water from where he dipped his hands. I looked up at him. He smiled back joyfully, not even aware of his missing image. I felt a pang of loneliness for him, wondering what it must be like to live a life of empty reflections.</p><p>Breathless, we plopped down on the green and looked up at the stars. The sky was clear except for some clouds in the distance. Lying on the open golf course without hovering trees and glaring streetlights, we could see what seemed like a million stars twinkling just for us.</p><p>Alexander sat up and pulled out two drinks from his backpack.</p><p>\"Gummi worms, spiders, or lizards?\" he asked, reaching back inside.</p><p>\"Worms, please.\"</p><p>We both drank and chewed on the brightly colored candy insects.</p><p>\"What's it like never seeing your reflection?\" I asked, his missing image still on my mind.</p><p>\"It's all I've ever known.\"</p><p>\"How do you know what you look like?\"</p><p>\"From paintings. When I was five, my parents commissioned one of their artists to make a portrait of us. We have it hanging over the fireplace in our home in Romania. It was the most beautiful thing I'd ever seen. How the artist captured the light, the details of my mother's dimples, the joy in my father's eyes, all through gentle strokes from his palette. The artist made me look alive when I felt lonely and grim inside. That's the way this man saw me. I decided then that that's what I wanted to do.\"</p><p>\"Did you like the way you looked?\"</p><p>\"I'm sure I looked much better than if I'd seen myself in a reflection.\" Alexander's voice became impassioned, as if he were expressing his thoughts for the very first time. \"I always felt sorry for humans, spending so much time in front of the mirror. Fixing their hair, makeup, and clothes, mostly to impress others. Did they really see themselves in the mirror? Was it what they wanted to see? Did it make them feel good or bad? And mostly I wondered if they based their self-image on their reflected one.\" \"You're right. We do spend a lot of time worrying about our looks, instead of focusing on what's inside.\"</p><p>\"The artist has the power to capture that. To express what he thinks about the subject. I thought that was much more romantic than seeing myself in a cold, stark glass reflection.\"</p><p>\"So that is why you paint portraits? Like the one of me at the Snow Ball?\"</p><p>\"Yes.\"</p><p>\"It must be hard to be an artist among vampires.\"</p><p>\"That's why I never fit in. I'd rather create than destroy.\"</p><p>Alexander suddenly looked up at the moon. He got up and grabbed a sturdy branch that had fallen from one of the trees and was lying by the lake. He took off his belt and bound the branch to the umbrella handle. He removed the flagpole and stuck the umbrella stick in the third hole.</p><p>\"What are you doing? Want to keep out the moon?\"</p><p>Suddenly I could hear the sound of a sprinkler turning on. Water began to drizzle down over us like a gentle storm.</p><p>I giggled as the cold water hit my legs.</p><p>\"This is so awesome! I never knew a golf course could be so beautiful.\"</p><p>We kissed underneath the sprinkling water until we noticed lightning flashing in the distance.</p><p>I quickly packed up our drinks and CD player while Alexander dismantled the umbrella.</p><p>\"I'm sorry we have to call this short,\" he said as we headed for home. \"Are you kidding? It was perfect,\" I said, giving him a quick hug. \"I'll never look at golf the same way again.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For the next few days, I went to school, hung out with Becky and Matt, dodged Trevor, came home, and took care of Nightmare. After sunset, I spent as much time as I could with Alexander, watching movies, cuddling, and listening to music in the darkness.</p><p>By Saturday, I was exhausted. I slept the day away and met Alexander by dusk at his Mansion. It was the night of Dullsville's Spring Carnival.</p><p>In the past, Becky and I had always attended the carnival together. This time, we would be arriving separately on the arms of our respective dates.</p><p>Alexander and I entered, hand in hand, shortly after sunset. We stepped through the two arches made of multicolored balloons, a white wooden admission booth in between. Alexander approached Old Jim, who was selling tickets; Luke, his Great Dane, was sitting at his feet.</p> <p>\"Two, please,\" Alexander requested, paying for us both.</p><p>\"I see you've been sleeping in one of the vacant coffins,\" Old Jim warned. \"I haven't slept at the cemetery for months,\" I replied. \"Maybe it's--\"</p><p>He looked at me skeptically. \"Well, if I catch you, I have to tell your parents, you know.\"</p><p>Alexander grabbed my hand and led me away from Old Jim and through the balloon-filled entrance. The carnival was spread over Dullsville High's soccer field. There were booths of homemade pies, corn dogs, snow cones, rides like the Ferris wheel and the Scrambler, a fun house, and games of tic-tac-toe, a ring toss, and a dunking booth. The air smelled of cotton candy and grilled corn on the cob. Alexander and I walked through the crowd like the prince and princess of darkness. But he was oblivious to the stares and looked like a wide-eyed kid not knowing what to play with first.</p><p>\"Haven't you been to a carnival before?\" I asked.</p> <p>\"No. Have you?\"</p><p>\"Of course.\"</p><p>\"You made it,\" I heard a familiar voice say. It was my dad.</p><p>I turned around to find my parents eating hot dogs at a picnic table.</p><p>Alexander shook my dad's hand and politely said hello to my mother.</p><p>\"Would you like to sit with us?\" my mom offered.</p> <p>\"They don't want to spend all night with us old fogies,\" my dad interjected. \"You guys have fun,\" he said, reaching into his wallet and offering me a twenty.</p><p>\"I've got it covered, Mr. Madison,\" Alexander said.</p><p>\"I like your style,\" my dad replied, returning the money to his wallet. \"Thanks anyway, Dad,\" I said. \"We'll see you later.\"</p><p>As Alexander and I walked past the booths, patrons and workers stared at us like we were part of the sideshow.</p><p>\"Hey, Raven,\" Becky said, when I found her selling homemade pies at her father's booth. \"Dad had to run home. We sold out of the caramel apples and only have two pies left.\"</p><p>\"Congratulations,\" I complimented her. \"But I was looking forward to some.\"</p><p>\"I'll reserve two for you when he gets back,\" Matt said, as he handed a piece of apple cobbler to a customer.</p><p>\"I think you've found your calling,\" I said to him.</p> <p>We said good-bye to Becky and Matt as they tried to keep one step ahead of their customers.</p><p>On our way to the carnival rides, I spotted Ruby, who was standing in between two booths. \"Hi, Ruby, are you here with Janice?\" I asked.</p><p>\"Oh, hi, Raven,\" she said, giving me a friendly hug. \"No, I'm here with a friend,\" she added with a wink.</p><p>Just then Jameson, minus his usual butler uniform and wearing a dark suit and black tie, walked over with a fresh swirl of blue cotton candy.</p><p>\"Hello, Miss Raven,\" he said, gently handing the candy to Ruby. \"I'm glad to see Alexander is in such good hands, as I have the night off.\"</p><p>Alexander gave the Creepy Man a smile.</p><p>\"I'm glad that you and Jameson are back in town,\" Ruby said to Alexander. \"I am, too,\" he replied, and squeezed my hand. \"Is Jameson treating you tight? I know he can get kind of wild,\" he teased.</p><p>\"He's been nothing but a perfect gentleman,\" she said, but then whispered, \"Hopefully that will wear off as the evening continues.\"</p><p>Alexander and I laughed. \"We'll leave you two kids with your candy. I promised Raven I'd take her on the Ferris wheel.\"</p><p>We cut away from the food booths and past the carnival games.</p><p>\"Raven,\" Billy Boy called from behind.</p><p>We turned around, and my brother ran up to us, holding a plastic bag with a frantic fish inside. Henry followed close behind with his own swimming prize.</p><p>\"Look what we just won!\" Billy Boy exclaimed.</p><p>\"Cool,\" Alexander commented.</p><p>\"He's a cutie,\" I said, tapping the side of the bag. \"Just make sure you keep him out of reach of Nightmare. She's small now, but she'll be growing.\"</p><p>\"Not to fear, I'm going to make a safety roof for their fishbowls,\" Henry proudly proclaimed.</p><p>\"I'm sure you will,\" I said to my brother's nerd-mate.</p><p>\"We're all out of tickets,\" Billy Boy whined. \"Did you see Dad around?\"</p><p>\"Here,\" Alexander said, reaching in his back pocket before I could answer. He handed Billy Boy some cash.</p><p>My brother's eyes bugged out as if he'd just won the lottery.</p><p>\"Thanks, Alexander!\" he exclaimed. \"Yeah, thanks, man,\" Henry said, and they took off back to the goldfish booth.</p><p>\"That was so nice of you. You didn't have to do that,\" I said.</p><p>\"Don't worry about it. Now let's go ride the Ferris wheel,\" he suggested.</p><p>Normally I hated waiting for rides and would cut in line, dragging along a reluctant Becky. Now I enjoyed the wait, because it meant I had more time with Alexander.</p><p>Soon we were ascending into the night sky. We slowly came to the top when the ride stopped, letting off the riders at the bottom.</p><p>\"Do you think it will be difficult because we are different?\" I asked, staring down at the couples.</p><p>\"We are more alike than most.\"</p><p>\"Does it bother you that we are not the same on the inside?\" I asked, looking at him.</p><p>\"But we are in here,\" he said, pointing to his heart.</p><p>\"If I were Luna, would you have left the ceremony?\"</p><p>Alexander looked confused. \"What do you mean?\"</p><p>\"Do you want me to become a...?\" I asked.</p><p>Suddenly the ride started up, cutting our conversation short. We cuddled as our car finally descended to the ground.</p><p>Alexander helped me off the Ferris wheel. We paused, overwhelmed by the choices of food, games, and rides that still awaited us.</p><p>\"Let's do the ring toss,\" he said when we got off. Alexander and I went over to the ring toss booth as a couple finished, walking away emptyhanded.</p><p>I gazed at the stuffed animals as the blue-and-white-uniformed clerk, wearing a black top hat, picked up the rings off the floor.</p><p>\"They're rigged. I never win. I usually spend all my allowance and I don't even get Mardi Gras beads,\" I lamented.</p><p>Alexander placed some money on the counter, and the clerk stood up and handed him three rings.</p><p>\"Harder than it looks,\" I said.</p><p>Alexander stared at the single wooden pole as if he were a wolf staring at an unsuspecting deer.</p><p>He threw the rings in quick succession like a dealer at a casino. The clerk and I were stunned. The three rings were resting around the pole.</p><p>I jumped up and down. \"You did it!\"</p><p>Alexander beamed as the clerk handed me a giant purple bear. I squeezed it hard and gave Alexander a huge kiss.</p><p>I glowed as I held the bear, almost bigger than me.</p><p>\"Snow cones are on me,\" I announced, as we turned to make our way back through the crowd. My stride was broken when I bumped into someone.</p><p>\"Excuse me,\" I said, and placed the bear on my hip so I could see. \"Hey, monster, watch out!\" Trevor hollered, holding two tickets. \"On your way to get your face painted?\" he asked. \"Perhaps you should.\"</p><p>\"Nice seeing you, too,\" I said sarcastically.</p><p>I grabbed Alexander's hand, and we headed toward the snow cones.</p><p>\"Hey, Luna!\" I heard Trevor call from behind.</p><p>Alexander and I stopped dead in our tracks. He couldn't have just said what we thought he said.</p><p>\"Luna!\" Trevor called again.</p><p>Alexander and I looked at each other in disbelief.</p><p>Luna? It couldn't be! Jagger's twin sister? What would she be doing in Dullsville?</p><p>We turned around to find Trevor looking toward the fun house--a huge multicolored rectangular building. On the upper left- hand side of the structure was a gigantic clown's head, his mouth the entrance to the exhibit. On the bottom right-hand side, patrons exited through the red fabric laces of the clown's enormous brown shoe.</p><p>\"That is her,\" Alexander said, shakily pointing to a petite girl standing near the front of the ramp that led to the entrance. She had long, flowing powder white hair and pale porcelain white skin, and she was wearing a pastel pink dress and black boots.</p><p>\"It's like seeing an apparition. The last time I saw her was in Romania.\"</p><p>\"What is she doing here?\" I asked. \"It's not like this town is vacation central.\"</p><p>\"That's what I want to know!\" I handed the bear to Alexander, and we hurried after her, catching up to Trevor.</p><p>\"You know that girl?\" I asked Trevor, my pulse racing.</p><p>\"A friend of Alexander's introduced us and asked me to bring her here. She's really pretty,\" he said in my face. \"Why, are you jealous?\"</p><p>\"Jagger? He's still here?\" I asked, confused.</p><p>\"If you really were a good friend of his, you'd know that.\"</p><p>\"He's not a friend. He's evil. You can't trust him,\" I warned.</p><p>\"Well, he is kind of freaky like you guys, but he said he'd had a falling out with Alexander, so I figured that made him cool.\"</p><p>\"He talked to you more than that night outside the Mansion?\"</p><p>\"What, are you spying on me? He came to a night game and told me his sister was coming to town. He asked me if I'd want to meet her. The coach wouldn't let him on the field, though. That dude has more metal on his face than a pair of cleats.\"</p><p>\"Jagger's not a replacement for Matt, you know,\" I tried to tell Trevor. \"He's nothing like Matt. Jagger's just trying to play you.\"</p><p>\"Sounds like someone is jealous.\"</p><p>\"He's not what you think he is,\" Alexander urgently cautioned.</p><p>\"Listen, it was wonderful talking to you, but I have a date. Besides, you better get back to your cage. I think the zoo has reported you missing.\"</p><p>He took off into the crowd. We began to follow but were stopped when a burly man holding a toddler stepped in our way. I could see Trevor and Luna racing up the red, tongued ramp of the fun house. \"The end of the line is back there!\" the burly man ordered, pointing behind us.</p><p>\"It's urgent,\" I said.</p><p>I peered past the disgruntled fun house customer and saw Trevor handing his tickets to the clerk. They stepped into the clown's mouth and disappeared.</p><p>I grabbed Alexander's hand, and we raced around the man as he wiped ice cream off his child's mouth.</p><p>We hurried up the plank and around the patrons in line. \"Hey, no cutting!\" a few kids started shouting.</p><p>When we reached the entrance, the clerk blocked our way. \"Tickets, please.\"</p><p>\"I don't...\" I reached into my pocket and pulled out a handful of change and put it into his palm.</p><p>\"That's only enough for one.\"</p><p>Alexander pulled out a wad of dollars, stuck it into the clerk's hand, and placed the bear at his feet. \"I'll be back for him,\" Alexander said. He grabbed my hand, and we raced through the clown's mouth.</p><p>We stepped into a room filled with multicolored plastic balls up to our knees. We waded through the balls, trying to move as quickly as possible.</p><p>\"At this rate, we'll never find her,\" I said.</p><p>When we finally reached the end of the room, we saw that to the right of us was a red door, to the left a black-and-white tunnel.</p><p>\"Oh no! It's a maze!\" I groaned. \"Should we flip a coin?\"</p><p>\"We don't have time,\" Alexander said. I followed him through a huge black-and-white tunnel that twisted around us as we walked. I got dizzy, stumbling, holding on to the railing and Alexander for support. We had to walk over a glass bridge. I could see Trevor below. I banged on the glass, but he didn't look up.</p><p>At the end of the bridge, there was a red slide. I went down first, with Alexander following behind. When we rose to our feet, I saw Trevor's blond hair ten feet ahead of me.</p><p>\"Trevor--\" I called.</p><p>But he turned the corner, heading into the next room. I pushed past a family of three and opened a polka dotted door.</p><p>Alexander and I were alone.</p><p>\"Trevor?\" I called.</p><p>The lights went out. I stood frozen. We could hear the maniacal laughter of a clown as soft lights slowly dimmed. And then Luna appeared before us.</p><p>She was beautiful. Ocean blue eyes, puffy pink lips, brilliant baby-doll black eyelashes. Her pale bubblegum-colored cotton dress outlined in fuchsia lace hung on her. Her skinny alabaster white legs poked out of her chunky black knee-high boots, a plastic pink Scare Bear dangling from the zipper. On her upper arm was a tattoo of a black rose.</p><p>Before we could speak, it went totally dark.</p><p>Alexander grabbed my hand just as the room slowly began to brighten, the black walls now glass. Luna was still standing before us.</p><p>I caught my reflection. The wall wasn't glass after all, but a hall of mirrors. Dozens of Ravens reflected on and on. Alexander, still standing beside me, didn't reflect back. There was one other reflection that was missing.</p><p>I was breathless.</p><p>\"What have you come for?\" Alexander challenged her.</p><p>\"Luna!\" I could hear Trevor call from another room. \"Where are you?\"</p><p>Luna smiled a wicked pale smile, two sparkling fangs glistening. I gasped.</p><p>\"Well, if you've gotten your wish--to become a vampire,\" Alexander said, \"then why are you here?\"</p><p>\"Jagger sent for me. Now I want to live the life I was never able to before. Jagger gave me an opportunity to get out of Romania.\"</p><p>\"What about the vampire who bit you? Shouldn't you be with him?\" Alexander argued.</p><p>\"He was just a fling, on unsacred ground. After you left me, I realized I could find someone else--anyone else--to transform me and find true love later.\"</p><p>\"You can find that in Romania,\" Alexander disputed.</p><p>\"You didn't,\" she said with an evil glare. \"Besides, Jagger told me he met a guy who he thought might be perfect for me.\"</p><p>\"Trevor?\" I asked. \"You've got to be kidding.\"</p><p>\"But you can't trust Jagger,\" Alexander argued. \"He's not looking out for your best interest, only his own. He's motivated by revenge.\"</p><p>\"Now that I'm in your world, I see things differently. I saw it in your eyes at the cemetery, Alexander. We both want the same thing,\" she said. \"Vampire or human. I just want a relationship I can sink my teeth into.\"</p><p>The lights went out. I squeezed Alexander's hand tightly. I reached out blindly. I had to find Trevor before Luna did.</p><p>\"Trevor!\" I called. \"Don't--\"</p><p>The light flashed on again.</p><p>Luna was gone. </p> </body></html>"]