["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>The ivory invitation with its elegant calligraphy and lacy embellishments felt more like a humiliation time bomb just waiting to blow up in Madison Daniels’s face than a beautiful wedding announcement. Man, did she have a problem.</p><p>Mitch, her big brother by three years—her only brother—was actually getting married this weekend. Married.</p><p>She was totally happy for him. Thrilled, even. His fiancée, Lissa, was a great gal, and they’d become quick friends. Lissa would never do her brother wrong. A Hallmark movie could be based on the two. Met freshman year at University of Maryland, fell madly in love, got great corporate jobs straight out of college, and the rest was history.</p> <p>No, Mitch and Lissa weren’t the problem.</p><p>And a wedding held deep in Northern Virginia’s vineyards definitely wasn’t the problem.</p><p>Not even her semi-lunatic parents, who owned and operated a very profitable online store called DOOMSDAY “R” US and would likely be hawking gas masks to the guests, were the problem. In fact, she’d take an asteroid with “Earth’s My Bitch” emblazoned on it and headed her way over this.</p><p>Her gaze dropped to the invitation, down to the list of attending bridesmaids and groomsmen, and winced. She blew out a slow breath, stirring the long strands of brown hair that had escaped her messy twist.</p><p>Right across from her name, separated by a few innocent dots and written in crimson ink, was the name of the best man: Chase Gamble.</p> <p>God hates me. That was it. Well, she was the maid of honor, and any of the other Gamble brothers would’ve been fine as best man. But oh no, it had to be Chase Gamble. He was her older brother’s best friend, confidante, homie, whatever—and otherwise known as the bane of Madison’s existence.</p><p>“Staring at the invitation isn’t going to change a damn thing.” Bridget Rodgers leaned a plump hip against Madison’s desk, drawing her attention. Her assistant was a study in how a fashion disaster on some people could work for others. Today, Bridget wore a fuchsia pencil skirt paired with a purple peasant shirt sporting large polka dots. A black scarf and leather boots completed the look. Mysteriously, she actually looked good in what should have been a clown’s costume. Bridget was bold.</p><p>Madison sighed. She could use a little bold right now. “I don’t think I can deal with this.”</p><p>“Look, you should’ve taken my advice and invited Derek from the history department. At least then you’d be having wild monkey sex instead of lusting after your brother’s best friend during the whole wedding. A man who’s already rejected you once, might I add.”</p><p>Bridget had a point. She was crafty like that. “What am I going to do?” Madison asked, glancing out the window of her office. All she could see was the steel and cement of the museum next to her building—the Smithsonian, which always made her chest swell with pride. She’d worked hard to become one of the privileged few who got to work for this amazing cultural institution.</p><p>Bridget leaned down into Madison’s face and caught her attention again. “You’re going to put on your big-girl panties and deal with it. You may have a secret, undying love for Chase Gamble, but if he hasn’t recognized your awesomeness by now the man is clearly mental and so not worth this angst.”</p> <p>“I know, I know,” Madison said. “But he’s just so... infuriating.”</p><p>“Most men are, Sweetie.” Bridget winked.</p><p>“It’s fine he’s not interested in me. Disappointing, but I can deal. And I can even forgive him for changing his mind the one time we almost hooked up. Well, sort of.” She laughed without much humor and stared at her best friend, willing her to understand. “But he’s constantly poking at me, you know? Teasing me in front of my family, treating me like a kid sister, when all I want to do is shake him...and get him naked.”</p><p>“It’s just one weekend—how bad can it be?” Bridget asked. She was trying to add the voice of reason to what was going to be the worst weekend of Madison’s life.</p><p>Dropping the invitation on her desk, she leaned back in her chair and sighed, idly contemplating calling the history department.</p><p>Ever since she could remember, there was Chase. Always Chase. They’d grown up on the same block in the suburbs of DC. Her brother and Chase had been inseparable since, well, forever. Which meant, being the baby of the family, Madison had nothing better to do as a kid than follow behind Mitch and his friends.</p><p>She’d idolized Chase. It was hard not to with his masculine beauty, easy candor, and downright illegal dimples. As a boy and into adulthood, Chase had a fierce protective streak that could make a girl’s heart do a little flutter in her chest. He was the type of guy who would rip off his shirt in the middle of Snowmageddon and give it to a homeless person on the street, but there’d always been this raw, dangerous edge to him.</p><p>Chase wasn’t the kind of guy anyone messed with.</p> <p>Once in high school, a boy had gotten a little too frisky with her in his car parked outside her parents’ house, and Chase had just been leaving when he’d heard her muffled protests as a hand went somewhere she didn’t want.</p><p>After that run-in, the guy didn’t walk right for several weeks.</p><p>And the occurrence pretty much cemented a puppy love that just wouldn’t die.</p><p>Everyone and their mother had known she had it bad for Chase throughout high school and the first two years of college. Christ, it was a well-known theory that wherever Mitch and Chase were, Madison wasn’t too far behind. Sad as it was—and it was pathetic—she had attended the University of Maryland because they had.</p><p>Everything changed her junior year in college, the night he’d opened his first nightclub.</p><p>After that...she did everything in her power to avoid Chase. Not that it worked or anything.</p><p>One would think in a city as overpopulated as Washington, DC, she’d be able to avoid the rat bastard, but oh no, the laws of nature were a cruel, unrelenting bitch.</p><p>Chase was everywhere. She’d rented one of the smaller apartments on the second floor of the Gallery, and weeks later, he’d bought one of the penthouses on the top floor. Even on family holidays, he and his brothers had seats at her parents’ dinner table, since they treated the Gambles like a flock of sons.</p><p>Working out at the gym, he’d be there pumping iron early in the morning while she did her daily pretend-run on the elliptical. And when he got on the treadmill? Oh, wow, who knew calf muscles could be so sexy? It wasn’t her fault that she stared and maybe drooled on herself a little. Had maybe fallen off the elliptical a time or two when he’d lifted his shirt, revealing abs that looked like someone stuck paint rollers under his skin for crying out loud, and wiped his brow with the hem.</p><p>Who wouldn’t be driven to distraction and take a tumble?</p><p>Hell, if Madison went to the local grocery on the corner, he’d be there, too, feeling up the peaches with his wonderfully long fingers—fingers that no doubt knew how to strum a guitar just as well as they knew how to work a woman into the height of sexual frenzy and then some.</p><p>Because she did know—oh, did she ever know how good he was.</p><p>Of course, half of DC probably knew how good he was with those hands of his by now.</p><p>“You have that look on your face.” Bridget raised a brow at her. “I know that look.”</p><p>Madison shook her head in denial. She really needed to stop thinking about his fingers, but there was no escaping her childhood crush—the embodiment of every fantasy she’d ever had. An infatuation she never grew out of and the reason why no other guy lasted longer than a few months, though she’d take that little ditty to the grave.</p><p>Chase was the Antichrist to her.</p><p>A really, unbelievably hot Antichrist...</p><p>Suddenly it was way too warm, and she tugged on the edge of her blouse and scowled at the invitation. It was only four days in the romantic, upscale vineyards. Hundreds of people would be there, and even though she had to deal with Chase during the rehearsal and wedding, she could easily find creative ways to avoid him.</p><p>But the nervous flutter in the pit of her stomach, the excitement that hummed in her veins, was telling a whole different story, because seriously, how was she going to steer clear of the only man she’d ever loved...and wanted to maim?</p><p>“Toss me that employee directory,” Madison said, wondering if Derek might be available after all.</p><p>The drive to Hillsboro, Virginia, on Wednesday morning wasn’t a pain, since everyone else was streaming into the city for his or her daily commute, but Madison was driving as though she was auditioning for NASCAR.</p><p>According to the three missed calls from her mother—who thought Madison had been kidnapped in the big, bad city and was now being held for an ungodly sum of money—the four text messages from her brother wondering if she knew how to navigate the beltway—because apparently little sisters couldn’t drive—and the voice mail from her father warning there was a problem with the reservations, she was late for brunch.</p><p>Who in the hell still ate brunch?</p><p>Thrumming her fingers against the steering wheel, she squinted as the late May sun glared off the exit sign. Yep—as she zoomed on by—she’d missed the exit.</p><p>Damn it.</p><p>Tossing a glare at her cell phone, because she so knew it was going to ring in a hot second, she darted into the other lane and took the next exit so she could backtrack to where she needed to be.</p><p>She wouldn’t be running late and be so...so discombobulated if she had spent last night packing like a normal, emotionally stable woman in her mid-twenties—a successful, emotionally stable woman—instead of bemoaning the fact she had to walk arm-in-arm down the aisle with Chase, because, for real, that was just plain cruel. The fact that Derek had another date that weekend and couldn’t accompany her was like adding insult to injury.</p><p>Her cell phone went off the moment the wheels on her Charger hit the correct exit ramp and she growled at it, wishing the damn thing into the tenth circle of hell. Were there ten circles? Who knew, but she figured by the time everyone got drinks in them and started talking about how Madison used to run around shirtless as a child, there’d be twenty circles to hell, and she’d have visited every one of them.</p><p>Tall black walnut trees crowded either side of the rural route she flew down, shading the road and giving it an almost ethereal feel. Up ahead, the deep blue of the mountains loomed over the valley. There was no doubt, as long as the weather held up, the outdoor wedding was going to be beautiful.</p><p>A sudden pop jerked her chin up and the steering wheel to the left, right, and then left again. Heart racing, she gripped the wheel as she weaved and crossed the centerline like a poster child for DUIs.</p><p>“Damn it,” she muttered, eyes going wide as she regained control of the Charger. A tire had blown—a mother-freaking tire had blown. “Why not?”</p><p>Debating whether or not to attempt the next ten miles on her rim, she strung together an atrocity of curse words that would’ve made her brother blush. She whipped the wheel to the right and coasted to a stop on the shoulder of the road. Throwing the car into park, she debated getting out and kicking the damn car. Instead, she did the mature thing: placed her head on the steering wheel and cussed some more. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was so not starting out well.</p><p>Lifting her head, her gaze slid to her cell phone. She snatched it off the seat, thumbed through her contacts, and quickly hit the call button. After only two rings, someone grabbed the line.</p><p>“Maddie? Where in the hell are you, girl?” Her father’s concerned voice exploded. “Your mother’s about to call the state police, and I’m not sure how much—”</p><p>“Dad, I’m fine. I blew a tire about ten miles out.”</p> <p>Over the sounds of laughter and clanking silverware, her father huffed. “You did what?”</p><p>Her stomach rumbled, reminding her that it was past eleven and she hadn’t had breakfast yet. “I blew a tire.”</p><p>“You blew what?”</p><p>Madison rolled her eyes. “I blew a tire.”</p><p>“Wait. I can’t hear you. Guys, can you keep it down?” His voice got a little farther away from the mouthpiece. “Maddie’s on the phone and she blew something.” The room erupted in male laughter.</p> <p>Oh. My. Freaking. God.</p><p>“Sorry about that, honey. Now, what happened?” her father asked. “You blew a fire?”</p><p>“I blew a tire! A tire! You know those things that are round and made of rubber?”</p><p>“Oh. Oh! Now I get it.” Dad chuckled. “It’s an animal house in here, everyone eating all at once. Did you remember to get that spare tire of yours replaced since your last flat? You know, dear, you should always be prepared. What if you needed to leave town during an evacuation?”</p><p>She was seconds away from smacking her face off the steering wheel. She loved her parents to bits, but she really didn’t want to talk about her lack of planning skills while a room full of men laughed about her blowing anything—while Chase laughed, because she’d definitely picked out his deep baritone in the background. Her belly was already filling with knots at the thought of seeing him soon. “I know, Dad, but I haven’t had a chance to get a new spare tire yet.”</p><p>“You should always have a spare. Have we not taught you anything about preparedness?”</p> <p>Well, wasn’t that a moot point right now? And it wasn’t like a comet had struck her car.</p><p>Her father sighed like all fathers do when their daughters need rescuing, no matter how old they were. “Just sit tight, and we’ll come get you, honey.”</p><p>“Thanks, Dad.” She ended the call and dropped the cell into her purse.</p><p>It was so easy imagining her absurdly large family crowded around the table, shaking their heads. Only Maddie would be late. Only Maddie would blow a tire and not have a spare. Being the youngest in a family that consisted of blood relations and the Gamble horde sucked.</p><p>No matter what she did, she was always little, itty bitty Maddie. Not Madison, who oversaw the volunteer services at the Smithsonian Library. Being a history geek growing up, she considered her career choice fitting.</p><p>Madison tipped her head back against the headrest and closed her eyes. Even with the air conditioner running, heat from the outside had begun to seep in. She undid the first couple of buttons and was grateful she’d opted for lightweight linen pants instead of jeans. Knowing her luck, she’d get heat stroke before her dad or brother showed up.</p><p>She hated knowing she was dragging either of them away from the start of the celebrations. That was the last thing she wanted. And right next to the last thing was the fact there was no doubt in her mind that Chase was probably shaking his head along with everyone else.</p><p>A few minutes passed and she must’ve dozed off because the next thing she knew, someone was tapping on her window.</p> <p>Blinking slowly, she pressed the button to lower the window and turned her head to stare into a pair of cerulean blue eyes fanned by incredibly thick black lashes.</p><p>Oh...oh, no...</p><p>Her heart stuttered and tumbled over itself as her gaze drifted across high cheekbones she was painfully familiar with, full lips that looked tantalizingly soft but could be firm and unyielding. Dark brown hair fell over his forehead, always a shy away from needing a haircut. A strong nose with a slight bump from a break during his college years gave the otherwise flawless male beauty a hard, dangerously sexy edge.</p><p>Madison’s gaze dipped over the plain white shirt that clung to broad shoulders, a rock-hard chest, and a narrow waist. Jeans hung low on his hips and thank God the rest of the view was cut off by the car door.</p><p>Forcing her gaze back to his face, she sucked in a sharp breath.</p><p>Those lips had curved into a knowing half smile that did funny things to her insides. And like a match tossed to gasoline, her body sparked alive and flames licked every inch of her.</p><p>She loathed her immediate response to him, wished any other eligible guy in the tri-state area could evoke the same inferno, and yet was thrilled by it. Absolutely undone.</p><p>“Chase,” she breathed.</p><p>His grin spread and damn, there were those dimples. “Maddie?”</p><p>Her body quivered at the sound of his voice. It was deep and smooth like aged whiskey. That voice should be outlawed, along with the rest of the package. Her gaze dropped again. Damn the car door, because no doubt that package was quite impressive.</p><p>For a brief, unwanted second, she was thrown back to her junior year of college, to the night she had visited Chase’s club for the very first time and stood in his posh office. Full of hope, full of wanting...</p><p>Snapping out of her stupor, she sat up, her spine rigid. “They sent you?”</p><p>He chuckled, as if she’d uttered the funniest thing in the world. “I volunteered, actually.”</p><p>“You did?”</p><p>“Of course,” he drawled lazily. “I had to come see what little Maddie Daniels was blowing.”</p><p>Chapter Two</p><p>About a second after those words left his mouth, Chase realized his mistake, but damn, he didn’t regret them. A fierce, hot, and downright sinful flush stole across her cheeks and down her throat. There was a part of him—a ruthless fragment—that would break legs and crush hands to see how far that blush travelled.</p><p>But like he’d learned before, at the last possible second, Maddie Daniels was a line not meant to be crossed.</p><p>Her pouty lips thinned and anger flared in her hazel eyes, turning them more green than brown. Her eyes shifted colors based on her emotions, and lately he’d seen them green more times than not.</p><p>“That was kind of crude, Chase.”</p><p>He shrugged. Civility wasn’t his middle name. “Are you going to stay in the car or get out?”</p><p>Maddie looked like she would have to be torn from the car. “Am I supposed to just leave it here, along the side of the road?”</p><p>“I called a tow truck, and they’re on their way. If you pop your trunk, I’ll get your stuff.”</p><p>Her gaze finally moved past him, and he felt his chest ease. “Nice car,” she said.</p><p>Chase looked over his shoulder at the black Porsche gleaming in the sunlight. “It’s a car.” One of three he owned. He wished he’d brought his truck instead, but the thing guzzled gas like nothing else. Turning back to the little problem at hand, he stepped aside. “Maddie, are you coming with me or not?”</p><p>She stared up at him, almost defiantly, which was laughable. Maddie was all of five foot three and probably weighed a buck ten. He towered over her and could easily throw her over his shoulder with one arm.</p><p>Their eyes locked.</p><p>With each passing second, pulling her out of the car and throwing her over his shoulder seemed more likely. Maybe he’d give her a spanking he damn well knew she deserved.</p><p>Cock said yes by swelling almost painfully in his jeans.</p><p>Common sense said no with the punch to the gut.</p><p>If Chase was anything in life, he was his father—successful at a young age, determined, wealthy, and carrying the family gene enabling him to fuck up any serious relationship within ten seconds.</p><p>And everyone, even Maddie, knew he was just like his father.</p><p>So it’s definitely time for a better tactic, he thought, taking a deep breath. “There’s a slice of cheesecake your mom put aside with your name on it.”</p><p>Maddie’s eyes glazed over. He’d seen that look a few times before. Chocolate and desserts had given her that post-sex-bliss look ever since he could remember, and that wasn’t helping with the problem in his jeans.</p><p>The car door flew open without any warning, and he narrowly avoided accidental impotency by jumping out of the way.</p><p>“Cheesecake,” she repeated, grinning. “Does it have strawberry topping?”</p><p>He fought a grin. “With a side of chocolate for dipping, just like you love.”</p><p>She popped her hands on her curvy hips and cocked her head to the side. “Then what are you waiting for?” She pushed a button on her keys, and the trunk popped open. “Every second that passes between me and that cheesecake, the more dangerous this trip will get.”</p><p>This trip was already dangerous.</p><p>He stalked to the back of her truck while she grabbed items from the backseat. Only one suitcase rested in the trunk. Maddie was always a light packer. He’d dated girls who couldn’t stay a night away without three outfits and a dozen pairs of shoes. Maddie was low maintenance, a product of growing up with a bunch of rowdy boys probably.</p><p>Grabbing her luggage, he slammed the trunk, then rounded the rear of her car and drew up short. Jesus Christ...</p><p>She was bent over, tugging a long garment bag from the backseat. The thin linen of her pants stretched over the round ass he knew she worked hard for. How many times had he watched her on the elliptical at the gym? Too many times to count.</p><p>He really needed to start working out at a different time.</p><p>But he couldn’t peel his eyes off her for the life of him. Maddie may be tiny, but she rocked some hellish curves, and even though she wasn’t the type of woman he usually went for, she was beautiful in her own way. Perky nose and plump lips, cheekbones covered with a speckling of freckles. Long hair, currently pulled up, normally reached the middle of her back.</p><p>The kind of hair—the kind of body—a man could easily get lost in. Aw, hell, it was more than that. Maddie would make some son of a bitch a happy man one day. She was and always had been the complete package: smart, funny, strong-willed, and kind.</p><p>And that ass...</p><p>Chase pivoted around, inhaling through his nose, half tempted to drop Maddie off, drive into town, and pick up the first chick who looked his way. Or grab Maddie’s rear.</p><p>She brushed past him, casting a weird look over her shoulder. “Are you dazing out on me? Let me guess. Bambi or Susie kept you up late? I can never tell them apart.”</p><p>“You’re talking about the Banks twins?”</p><p>Maddie cocked her head to the side and waited.</p><p>“Their names are Lucy and Lake,” he corrected.</p><p>She rolled her eyes. “Who names their kid Lake? Oh! If you have kids, you can call them River and Stream.” Shaking her head, her eyes narrowed. A knowing look crossed her face. “So you’re still dating them?”</p><p>Honestly, dating wasn’t the term he’d use for the tall, lanky twins. “I’m not dating them at the same time, Maddie. Nor have I.”</p><p>“That’s not what I’ve heard.”</p><p>“Then you’ve heard wrong.” But that look of hers spread. Clamping his jaw shut, he followed her. No point in correcting her assumption because his reputation was probably right up there with his father’s already. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Opening the back door, she frowned. “Haven’t made it to your room yet?”</p><p>He placed her bag in the trunk alongside his own. “Haven’t checked in. I’d only arrived about fifteen minutes before your rescue call went out.”</p><p>She smoothed invisible wrinkles from her pants, chin tucked low. “I didn’t need rescuing.”</p><p>Chase arched a mocking brow. “That’s not how it looks to me.”</p> <p>“Just because I blew—”</p><p>“Say that again.”</p><p>Maddie lifted her gaze to his again, and he felt their soulful depths in his gut. She could always take his breath away with a single look. “Say what?”</p><p>“Blew.”</p><p>She rolled her eyes. “That’s real mature.”</p> <p>“Anyway, you blew a tire and I had to come out here and get you. How is that not me rescuing you?”</p><p>Huffing, she spun around and returned to her car. With her purse in hand, she stalked over to the passenger side of his Porsche.</p><p>He grinned. “You should always have—”</p><p>“I know. A spare,” she said, cutting him off and sliding into the car.</p><p>Laughing under his breath, he climbed in and sent her a sidelong glance. She was staring out the tinted window; her hand clutching her cell phone like a lifeline. He casually adjusted himself and prayed he got himself in check before her family swamped them again.</p><p>The first five miles back to the vineyard where his buddy was getting married were quiet, not terse, but definitely not the most comfortable of experiences.</p> <p>He should just ignore it. “Why are you pouting?”</p><p>“I’m not pouting.” She cut him a dark look.</p><p>“Could’ve fooled me, Maddie.”</p><p>“Stop calling me that.” She dug around in her bag and pulled out a pair of sunglasses. She slid them on and then turned to him. Cute. “I hate it when you call me that.”</p><p>“Why?”</p><p>She said nothing.</p><p>He sighed and went with a safe topic. “Your brother is really happy.”</p><p>Beside him, Maddie relaxed a fraction. “I know. I’m really happy for him. He deserves this, right? He’s so nice that any other girl would take advantage of that.”</p> <p>“He does.” Chase’s gaze flickered off the road. She was staring at him still, and he hated that the sunglasses blocked her eyes. He had no idea what the little terror was thinking behind those dark shades. “Lissa’s a good girl. She’ll do right by Mitch.”</p><p>Maddie sucked her lower lip in and then said, “Mitch will do right by her.”</p><p>A small smile tugged at his lips. “That is true. Though, marrying? Never thought I’d see the day when he settled down.”</p><p>“I really don’t want to hear about his escapades.” She ran a hand over her hair, smoothing the few loose strands which had escaped her chignon. “I haven’t eaten yet.”</p><p>“Would a full stomach be better?”</p><p>She snorted.</p><p>“Remember that girl he was dating his sophomore year in college?”</p><p>Her eyes went wide, and his grin spread. “Oh, God—the one who actually started naming their kids on the first date?” she said, laughing. “What was her name?”</p><p>“Linda Bullock.”</p><p>“Yes!” She popped up in her seat. “She had Mitch scared to death, calling him at all hours of the night. He got so mad when you told me about her.”</p><p>“She camped outside our dorm after one date.” Chase shook his head. “Pretty girl, but man, she was crazy.”</p><p>They were coming up on the vineyards quickly. Before he knew it, Maddie would be surrounded by those who loved and cared for her, and he’d be back with his brothers, watching them troll the guest list for the ladies.</p><p>As if she were reading his thoughts, she glanced at him. “I bet you and your brothers couldn’t be happier.”</p><p>“Why is that?”</p><p>Her lips formed a tight smile. “It’s a wedding, which means easy pickings.”</p><p>“Are you saying I need easy pickings?”</p><p>“Maybe.”</p><p>He chuckled and said, “I think you know better than that.”</p><p>A red blush stained her cheeks under the sunglasses. Seeing her face flame attractively was almost worth going there with her, rehashing memories that needed to stay memories.</p><p>“Okay,” she said. “You don’t need easy pickings. I’m not saying that.”</p><p>“Then what are you saying, Maddie?”</p><p>Frustration rolled off her as she ran her hand across the buttery leather of the car seats in long, languid strokes that made his dick twitch. “Lissa has a lot of pretty friends. Not the Banks twins, but still.”</p><p>Chase nodded and then reached up for the sun visor, pulling out his own sunglasses. “She does.”</p><p>“So, like I said, you and your brothers are going to have fun.”</p><p>“Maybe.” He reached across the seat, tapping his fingers off her forearm to get her attention and point out the long rows of grape vines slicing through the valley on his left. Immediately, she jerked back, and he raised his brows, kind of offended. “Touchy?”</p><p>“No. Sorry. Too much caffeine.”</p><p>Then it struck him. Sometimes Chase forgot that their relationship wasn’t like it used to be, and damn if that didn’t suck.</p><p>She cleared her throat. “So, when are you guys going to get married?”</p><p>Chase barked with stilted laughter. “Good God, Maddie.”</p><p>“What?” Her frown pulled the corners of her lips down. “It’s not an insane question. You all are getting up there in age.”</p><p>Shaking his head, he laughed again. He was twenty-eight, not an old man. Chad, his middle brother, was thirty, and his oldest brother, Chandler, was thirty-one. None of them approached marriage with open arms. Not after seeing what it did to their parents. Or, in reality, what his father did to his mother. It was why the three of them had practically grown up in the Daniels’ household.</p><p>Maddie leaned across the seat, punching him in the thigh with a little fist. “Stop laughing at me, jerk.”</p><p>“I can’t help it. You’re funny.”</p><p>“Whatever.”</p><p>Grinning, he took the next left to the private road leading up to the vineyard. “I don’t know about marriage, Maddie. You know what they say about us.”</p><p>“Who’s going to take a risk on the Gamble boys? Or take a ‘gamble’ on the Gamble boys.” She gave a small shake of her head. “We aren’t in high school or college anymore, Chase.”</p><p>His gaze drifted from the sleek line of her thigh, up to where the buttons of her blouse parted, revealing a tantalizing swell of breast.</p><p>“Yeah,” he said, focusing on the road. His knuckles ached from how tightly he was gripping the stick shift. “We’re definitely not in school anymore.”</p><p>There was a quick grin before she turned back to her window, appearing to soak in the rolling hills, but then she had to go there. “You’re not like your father, Chase.”</p><p>“You of all people should know that I’m exactly like my father,” he snapped back, voice harder than he’d intended.</p><p>Maddie’s gaze swung back to him, her cheeks paling and then flushing. Her mouth opened, but she clamped it shut and turned back to the window.</p><p>He groaned. “Shit, Maddie, I didn’t mean it like—”</p><p>“It’s fine. Whatever.”</p><p>Fine and whatever were words he knew were code for pissed off. They were the same words his mother had used time and time again when his father didn’t come home at night or disappeared on an unexpected business trip.</p><p>Chase cursed again.</p><p>Driving up the winding road, he fought the urge to apologize. It was better this way. For several years, Maddie had been nothing more than Mitch’s kid sister. Yeah, he was protective of her, but that was a given. That one night, so many years ago, had mucked up things between them forever. And if Chase knew anything, he knew there were no do-overs.</p><p>Just like there had been no do-overs for his parents.</p><p>On the way into the main lodge, Madison did her best not to stare at Chase, not to get drawn into that swagger of his, fall into the web he had no idea he was weaving just by being next to her. So she stared straight ahead and ignored him.</p><p>An elderly couple inched their way down the pathway, their hands joined together tightly. The looks they shared were so full of love that Madison felt a pang of envy. That was the kind of love she had dreamed of as a little girl—love that didn’t dull after the decades but only grew stronger.</p><p>The woman’s thick-soled shoes slipped on one of the pebbles. Her husband easily caught her arm, but her purse dropped off her other arm, spilling the contents along the white stones.</p><p>Madison rushed forward, kneeling down as she quickly scooped up the lady’s belongings.</p><p>“Oh, thank you, dear,” the old woman crooned. “I’m getting terribly clumsily in my old age.”</p><p>“It’s no problem.” Madison smiled, handing the purse back. “Have a nice day.”</p><p>Returning to Chase’s side, she found him smiling at her. Not a full smile that showed off those dimples, but a small, private one. “What?”</p><p>“Nothing,” he said with a slight shake of his head.</p><p>The moment Madison stepped inside the cozy atrium of Belle’s Vineyard, her family attacked her. Bone-breaking hugs were given by first cousins, second cousins, a few people she didn’t even recognize, and an uncle. Hugs that lifted her clear off her feet and left her a little dizzy.</p><p>But when she saw her brother beyond the atrium, standing before several long tables covered in white linen, a wide smile broke out across her face and she took off.</p><p>Mitch was tall, like their father, and his brown hair was clipped close to his skull. With his all-American good looks and sweet disposition, he usually had a legion of women swooning at his feet. Many of them included her friends. The single ones were no doubt mourning this weekend, but he’d only ever had eyes for Lissa.</p><p>He caught her halfway and spun her around. “We were starting to think you were boycotting the wedding.”</p><p>“Never!” She laughed, clasping his arms. Not since Christmas had she gotten to see her brother. He and Lissa had moved to nearby Fairfax and with their busy careers, it left little time for family reunions. “I’ve missed you.”</p><p>“Now come on, don’t start crying on me already.”</p><p>She blinked. “I’m not crying.”</p><p>“Good.” He enveloped her in another massive hug. “I think you may’ve grown about two inches.”</p><p>Laughing, she wiggled free. “I stopped growing, like, ten years ago.”</p><p>“Try twenty years ago.” Her father’s booming voice carried from the head of the table. This bear of a man was probably aghast that one of his offspring could’ve auditioned for the Lollipop Guild.</p><p>Over Mitch’s shoulder, Lissa waited with a welcoming smile. Pulling free of her brother, Madison approached the slender blonde and gave her a tight hug.</p><p>“I’m so happy you’re here,” Lissa said, pulling back. Tears filled her gray eyes. “Everything is perfect now. Come, your mom is saving you dessert.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Trailing after her, Madison glanced over her shoulder. Mitch had his hand on Chase’s shoulder and they both were laughing. A heartbeat passed, and Chase looked up, his eyes meeting hers.</p><p>Madison looked away and nearly ran straight into Chandler. Bigger and brawnier than all the Gamble brothers, he was easily the most intimidating. All three brothers shared the same strong features and extraordinary blue eyes, but Chandler was larger than the other two by a good three inches.</p><p>“Careful, squirt,” he said, easing past her. “Don’t want to run over one of the bridesmaids.”</p><p>Squirt? “Thanks, Godzilla.”</p> <p>Then he had the gall to ruffle her hair like she was twelve.</p><p>She swung on him, missing by a mile, which was impressive considering how bulky he was.</p><p>Chandler laughed as he joined Mitch and his brother. So far, she hadn’t spied the middle brother. Chad was a notorious prankster and no one was safe when he was around.</p><p>Megan Daniels sat beside Madison’s father in the large, domed room, and it was hard to believe that her mom was approaching her fifty-sixth birthday. There wasn’t a single gray hair in the mass of her auburn waves.</p><p>“Sit, honey.” She patted the seat next to her. “I saved you some cheesecake.”</p> <p>Without being told twice, Madison took her place and dug in, listening to the flow of conversation around her as everyone else settled back around the long tables. Every once in a while, a cousin twice removed would appear and then some of Lissa’s family. Her parents seemed nice and got along with Madison’s.</p><p>Mr. Grant, Lissa’s father, even smiled when Madison’s dad launched into the next wave of generators that could keep a 1,200-square-foot bunker running.</p><p>Her mother rolled her eyes. “You know your father likes to talk shop.”</p><p>Yeah, but most people’s shoptalk didn’t revolve around an apocalypse.</p><p>With everyone occupied, she swiped the last two cookies off a platter and practically swallowed them whole. If this was considered “brunch”, Madison thought she might just have a new favourite meal.</p><p>“It was really nice of Chase to volunteer to pick you up, honey.” Her mom’s eyes twinkled. “He wasn’t even here for ten minutes, but he left right away to get you.”</p> <p>Madison almost choked on the cookie. “Yeah, really nice of him.”</p><p>Her mom leaned in and lowered her voice. “You know, he’s still single.”</p><p>Clearing her throat, she was thankful Chase was nowhere near the table. “Good for him.”</p><p>“And you used to have the biggest crush on him. It was so cute.”</p><p>Madison’s mouth dropped open to deny it, but Mrs. Grant responded before she could say a word. “A crush on who?”</p><p>“Chase.” Her mother nodded sagely toward the front of the room. “She followed Mitch and him around like a—”</p><p>“Mom,” Madison groaned, wanting to hide under the table. “I did not follow them around like a puppy.”</p><p>Her mother just smiled.</p> <p>“That is so sweet,” Mrs. Grant said, her gaze traveling up to where Chase and the rest of the men stood. “And he seems like a lovely young man. Mitch was telling us how he owns several nightclubs in the city.”</p><p>Mom launched into a detailed account of Chase’s successes, which were quite impressive. Within the last seven years, he’d started several profitable upscale bars, easily placing him as one of the most eligible bachelors in the District.</p><p>But her mother had glossed over Chase’s well-known playboy social life. Madison hadn’t been to any of his clubs since she was twenty-one, since that disastrous night when alcohol and several years of crushing on a guy came to an utterly humiliating head.</p><p>After taking a sip of water, she excused herself to check on her room reservation and strolled between the tables and out into the wide foyer on her way to the reservation desk. Once outside the breakfast area though, she realized she had company.</p><p>Chase fell into step beside her, hands shoved into the pockets of his jeans. He was a good head and then some taller than her, and she always felt like a dwarf standing next to him.</p><p>She arched a brow at him, totally trying to play it cool even though her heart was pounding walking this close to him. “Following me?”</p><p>“Thought I’d change up the pattern.”</p><p>“Ha. Ha.”</p><p>He flashed a grin. “Actually, I was going to pick up my cabin key.”</p><p>“So am I.” Belle Vineyards had several cabins nestled across their estate, and they had reserved most of them for those attending the wedding scheduled for Saturday. She bit her lip, realizing she hadn’t thanked him yet. “Thank you for coming and getting me. You didn’t have to.”</p><p>Chase shrugged but said nothing. They wound their way through the elegantly designed hallways with exposed log walls and eventually arrived at the front desk.</p><p>An older man behind the counter with a nametag reading Bob smiled at them. “How can I help you?”</p><p>Chase leaned against the desk. “We’re here to pick up our room keys.”</p><p>“Oh, for the wedding?” His hands paused over the keyboard, ready to fly. “Congratulations.”</p><p>Madison choked back a laugh. “We aren’t. I mean, there’s no need for congratulations. He and I aren’t like that. We aren’t—”</p><p>“What she’s trying to say is that we’re not the bride and groom,” Chase replied evenly, smirking. God forbid anyone thought that. Geez. “We’re with the bridal party.”</p><p>Chase gave their names while Madison mentally kicked herself for sputtering like an inept teenager, but standing this close to him was more than distracting. His presence, his spicy scent that was part cologne and part male, had her senses firing left and right.</p><p>He always had to stand close. Like right now, there was barely an inch between their bodies. She could feel the natural heat that rolled off him and if she closed her eyes, she was pretty sure she could remember what it felt like to have his arm around her, cradling her to his hard chest as his hand skated under the hem of the dress she’d worn just for him, sliding up...</p><p>Madison pulled herself from the memory. So not going there.</p><p>“I’m sorry,” the clerk said, drawing her attention back to what was important. “There’s been an unfortunate mix-up.”</p><p>Suddenly, she remembered her father’s message. “Has something happened?”</p><p>The clerk’s cheeks turned ruddy. “We had another wedding party that ends on Friday, and, well, to put this bluntly, one of the part-time workers overbooked the cabins, which pushed out the last two reservations made.”</p><p>Which, of course, would’ve been Chase’s and Madison’s reservations, because if they had anything in common, they always did things last minute.</p><p>Chase frowned as he leaned a lot farther in. “Well, there’s got to be a fix.”</p><p>Swallowing visibly, he glanced at the computer. “I was under the impression that a Mrs. Daniels had already addressed this issue.”</p><p>Madison had a really bad feeling.</p><p>“We explained the problem upon her arrival. We only have one cabin available, the old honeymoon suite about to be remodeled.”</p><p>“Honeymoon suite?” Chase repeated slowly, as if those two words made no sense.</p><p>Her stomach dropped.</p><p>The clerk looked visibly uncomfortable. “Two people can definitely room there. Mrs. Daniels said it wouldn’t be a problem.”</p><p>She was going to kill her mother.</p><p>“I’m sorry.” Chase drew up straight, and at over six feet tall, that was a lot of looking up to do. His voice was firm. “We cannot share a cabin.”</p><p>Ouch. Sharing a room with Chase wasn’t on her list of things to do, but damn, she wasn’t the worse possible option.</p><p>“Money is not an issue,” he continued, eyes darkening to a navy blue—a sure sign his temper was about to make an appearance. “I can pay double or triple to get two rooms.”</p><p>Okay, now that was just insulting. She glared at him. “I agree. There’s no way I can stay with him.”</p><p>Chase cut her a look.</p><p>The clerk shook his head. “I’m sorry, but there are no other rooms available. It’s the old honeymoon cabin...or it’s nothing.”</p><p>Both of them stared at the clerk. Madison had a sinking suspicion Chase was about to grab the man, turn him upside down, and shake him until room keys fell out. She could get behind that.</p><p>“Rooms should become available Friday morning, and we will ensure both of you are first in line, but unfortunately, there isn’t anything I can do.”</p><p>Madison ran a hand over her hair, stunned. Rooming with Chase? There was no way. Between gawking at him in close proximity and wanting to beat him over the head when he opened his mouth, she was going to go insane.</p><p>The days leading up to the wedding were supposed to be fun and relaxing. Not a trip into crazy land. And her mom—her nutso, matchmaking mom—had a hand in this. She was going to bury that woman in a bomb shelter.</p><p>Madison peeked at the still-silent form of Chase. A muscle worked in his jaw like he was grinding his molars down to the gum. This was horrific for her, but for him? God, he was probably ready to make a bid for the clerk’s room. No doubt this would put a major crimp in his woman-seducing plans.</p><p>“You have got to be kidding me.” Chase twisted away, placing his hands on narrow hips. He swore under his breath. “All right, give me the damn keys.”</p><p>Madison flushed. “Look, I can—”</p><p>“You can what? Room with your mom, who’s on a second honeymoon with your dad? Or maybe you’d prefer to room with one of the other couples and ruin their romantic weekend?” A note attached to two keys dropped into his open palm. “Sleep in your car, even? We don’t have a choice.” His eyes met her wide ones. “We’re stuck with each other until Friday.”</p><p>Chapter Three</p><p>“Oh, man, you two are not going to make it to the wedding.” Mitch leaned back in his chair, eyes glittering with amusement. “No way.”</p><p>Madison sighed.</p><p>“Why?” her mother asked from the end of the table. “They’ll do just fine.”</p><p>“They’ll kill each other,” Mitch said with a laugh, and then he sobered. “They might actually kill each other.”</p><p>Turning her eyes to the glass ceiling, Madison struggled for patience. “We aren’t going to kill each other.”</p><p>“I wouldn’t make that promise,” Chase muttered, speaking for the first time since they’d left the front desk.</p><p>God, she was two seconds from jumping on his back like a monkey and strangling him. But then he strode off, glancing over his shoulder at her.</p><p>“This train is leaving for the cabin now if you want a ride.”</p><p>Trailing after him, she muttered, “Who hasn’t had a ride?”</p><p>Chase stopped dead in his tracks. “Excuse me?”</p><p>“I said”—she gave him a saucy smirk—“who hasn’t had a ride?”</p><p>He levelled her with a pointed look. “I can think of a few people.”</p><p>Wow. He went there. She refused to allow herself to blush again. “Bet you could count them on one hand, too.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Possibly,” he murmured and started walking again.</p><p>The trip to the cabin—all the way toward the edge of the property, near the thick walnut trees at the mouth of the Blue Ridge Mountains—was silent and awkward.</p><p>The moment she’d made the crack about his sex life, she’d regretted it. Saying things like that only reinforced his misguided belief that he was just like his father. It was the thing she never got about him. She knew deep down that becoming like his unfaithful father was Chase’s own personal nightmare, but he did nothing but barrel down that path with a different girl every week. She skirted around a thorny rose bush leaning into the path.</p><p>He’d been that way since high school—maybe not as bad as Chad, but Chase exemplified the playboy lifestyle.</p> <p>And the fact that Chase was an equal opportunity bed jumper always stung, because he was open for business for everyone...everyone but her.</p><p>Outside the cabin, Chase held the key like it was a snake about to sink its fangs into his hand.</p><p>He hadn’t said a word on the way down. He was pissed; she knew it. What red-blooded single male came to a wedding and enjoyed getting stuck with their best friend’s little sister as their roommate? In an old honeymoon cabin on top of that?</p><p>Madison couldn’t believe it. She literally had the worst luck when it came to him.</p><p>She checked her cell phone and wanted to throw it. No service.</p> <p>Finally, he opened the door and reached along the wall, flipping on the light. Her jaw dropped, and she slapped a hand over her mouth.</p><p>This was a joke. It had to be. “Your brother has to be behind this,” she said.</p><p>Chase shook his head slowly. “If he is, I’m going to kill him.”</p><p>It was no wonder the clerk had said the room was scheduled for renovation. Clearly, someone had done a rush job cleaning the room. There was a faint smell of Lysol and potpourri that lingered in the spacy cabin, but the carpet...the bed.</p><p>Several throw rugs covered the wood flooring. They were every color of the rainbow, but one was a bear rug. An actual bear rug. The walls were painted a vibrant purple and red, and the bed...the bed draped in red velvet and heart-shaped.</p><p>Chase strolled into the room, dropping his keys on a white dresser that looked like something her grandmother would have in her house. He glanced over his shoulder, one brow arched.</p> <p>Madison busted into laughter. She couldn’t help it. “It’s like a seventies love shack.”</p><p>A slow smile stretched across his lips. “I think I’ve seen this room in old-school porn videos.”</p><p>She giggled as she followed him in. A quick peek in the bathroom revealed a tub the size of a pool, perfect for the frisky newlywed couple.</p><p>Looking over her shoulder, Chase shook his head. “You could fit five people in that thing.”</p><p>“That might get awkward.”</p><p>“Ah, true, but it’s definitely big enough for two.”</p><p>“I don’t know,” she said, turning away from the bathroom and strolling past him. Across from the bed were balcony doors that led to a deck and a Jacuzzi. “I never got the whole bathtub-sex thing.”</p><p>“Then you’ve been doing it wrong.” His breath was warm against her cheek, and dear God, wouldn’t he know?</p> <p>Startled by how quietly he had crept up on her, she spun around and swallowed. Images of him wet, naked, and wrapped around her in that bathtub sent a wave of molten lava shooting through her veins and straight to her core.</p><p>Her knees went weak. “I’m not doing anything wrong.”</p><p>“Of course not,” he drawled. “You’ve just had the wrong partner.”</p><p>Madison wasn’t a prude, and just because no man had ever lived up to Chase in her eyes didn’t mean she hadn’t dated. And maybe he was right and she just had the wrong partners, because she couldn’t imagine not enjoying some bath time with him, but no way in hell would she ever admit as much to him.</p><p>Which meant it was time to change the subject and fast. But when she lifted her lashes and found him still staring at her beneath hooded eyes, her breath hitched in her throat.</p><p>Standing this close to him, inches away from a bed that would’ve made Austin Powers proud, was too much. The night in his club resurfaced in a rush of slippery emotions and tangled hopes that never really came to fruition.</p><p>She finally found her voice. “It...has nothing to do with my partners.”</p><p>Chase cocked his head to the side, his intense blue eyes narrowing. “Partners as in plural?”</p><p>Feigning indifference, she rolled her eyes when her heart was racing. “I’m twenty-five, not sixteen.”</p><p>“You don’t have to remind me of how old you are,” he all but growled.</p><p>“Then why do you seem shocked by the fact that I’ve had sex?”</p><p>He took a step forward, and she took one back. “With more than one person?”</p><p>Surely this wasn’t breaking news. “How many people have you had sex with? Five hundred?” she threw back. “Hell, how many in one month?”</p><p>A clear warning formed in those sapphire-gem eyes. “We’re not talking about me.”</p><p>“And we’re not talking about me.” One more step and her back hit the wall. There was nowhere to go. “So, let’s just stop...”</p><p>“Stop what?” He leaned in, his breath tantalizingly warm against her cheek, and he planted his large hands against the wall on either side of her head.</p><p>Madison’s gaze dropped to his lips, and she hadn’t the foggiest idea what they’d been talking about. Something about sex, and God, talking about sex with Chase was not a good idea. Because now she wanted sex. With Chase. She wanted to feel him inside her, only him, always him.</p><p>She wanted so much.</p><p>A liquid fire had spread through her veins, licking at her. Lust rose so quickly, pulsing through her limbs, hitting her fast and hard, leaving her senses spinning. A small part of her brain that still functioned fired off warnings left and right. It was insanity to even entertain the idea of anything going down between her and Chase, but as her gaze moved up, colliding with his, her heart stopped.</p><p>“Tell me,” he ordered, voice low and gravely. “How many boys have you let touch you?”</p><p>Part of her bristled at his demand, but the other incredibly stupid part was thrilled that he cared. “I’ve never been with boys, Chase.”</p><p>Anger and something far more potent flared in his blue eyes. “Oh, so that’s how it is.”</p><p>“Whatever it is, it’s none of your business.”</p><p>He chuckled deeply. The movement brought his lips close to her cheek. “It’s my business.”</p><p>“Explain that faulty logic to me,” she said.</p><p>Chase smiled. “You’re my best friend’s little sister. That makes it my business—all my business.”</p><p>And that was the wrong thing to say. Fire of a different kind now pulsed through her. “Get away.” She started to push off the wall, but Chase leaned in, his chest flush with hers. Her body went haywire. Anger. Lust. Hope. Love. Fear. All her emotions tangled together. “Chase...”</p><p>He said nothing, and all she could now concentrate on was the feel of his rock-hard chest pressed against her breasts. The thin cotton of his shirt and her blouse were no match for the heat that rolled off him or the heat building inside her. Her nipples hardened to aching, wanton pearls, and she dragged in a deep breath, biting back a moan.</p><p>His lips parted.</p><p>There was no hiding her reaction, not from a man like Chase who knew every flavor of woman. And she wanted to be his flavor—his favorite. A tight coil wound deep inside her.</p><p>She was panting now, and he hadn’t even really touched her. She tried to disconnect from her out-of-control hormones, going as far as thinking about the DC Metro, and still, her body was turning on her.</p><p>His breath hitched and then he scowled at her, even as he pressed his forehead against hers. Her lashes fluttered shut and she grew very still, barely daring to breathe as his breath danced over her brow, down her temple, and across her cheeks.</p><p>His lips hovered over hers.</p><p>“No,” he snarled.</p><p>Madison wasn’t sure to whom he was talking, but then his mouth was crushing hers, and her world became him—the touch and feel of his lips pressing down, forcing hers to respond. It wasn’t a gentle kiss or a sweet exploration. It was angry and raw, breathtaking and soul burning. Right now, she didn’t want gentle. She wanted hard and fast, him and her, on the floor, even the bear rug, both of them naked and sweating.</p><p>His tongue was a moist, hot demand inside her mouth, parrying with hers until he took complete control and flicked the tip of his tongue over the roof of her mouth. There was a delicious possessiveness in the way he kissed her, as if he were staking his claim at the same time he was burning away the memories of anyone else for her. And he did. In an instant, there was nobody but him.</p><p>One hand came off the wall and his palm splayed flat against her cheek, glided down the arch of her neck. He held her there, so gently and at odds with the fierceness of his kiss. This was how she always wanted Chase, how she always dreamed it would be, and how she had once had such a brief, divine taste. She moaned, melting into him. Between her thighs, she ached for him. Her body—</p><p>Chase jerked back, and her eyes snapped open, her chest rising and falling raggedly. He stared at her...stared at her like she had done something terribly wrong. And he...he had kissed her.</p><p>Walking backward, Chase shook his head, his hands clenching at his sides. “That...that didn’t happen.”</p><p>She blinked over the wrenching pull in her chest. “But...it did.”</p><p>His striking face went impassively indifferent, and it felt like Madison had been punched in the gut. “No. No,” he said. “It didn’t.”</p><p>And with that, he spun around and stormed out of the cabin, slamming the door behind him.</p><p>Madison blinked slowly. Oh, hell to the no, he did not just storm out of there like a drama queen. She was going to find him and then castrate him.</p><p>She winced.</p><p>Okay, maybe not that extreme, but she’d be damned if she let him kiss her like that and then run.</p><p>Madison was well on her way to getting drunk.</p><p>Not fall-on-your-face or strip-off-your-clothes drunk, although without all the family around that might have sounded fun, but there was definitely a wine-induced headache in her near future.</p><p>Sitting on a bench along the sprawling deck outside the main lodge, she inhaled the scent of mountain air and grapes. Members of her family and Lissa’s chattered around her. The low hum of conversation would’ve normally been soothing as she was a lover of all sorts of background noise, but right now, she wanted to slide through the narrow spaces in the wooden rail around the deck and fade into the night. Taking another long sip, she gazed out over the lawn. Paper lanterns hung from the poles spaced along the pebbled pathway, casting a faint light across the grounds.</p><p>She glanced down at her third glass of Petit and bit back a strangled giggle. Such a lightweight, but the heady thrum in her veins helped ease the mixture of shame and unquenched lust that burned in her stomach. An all-too-familiar feeling after a rather idiotic run-in with Chase. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He had kissed her.</p><p>And then, in the ultimate heart crusher, he’d wanted her to forget it. Been there, done that, and she definitely had the wounded heart to prove it.</p><p>Why had he kissed her if he was so obviously disgusted by the idea? Who knew. Maybe the answer was in the depths of her dark purplish wine?</p><p>Her father’s boisterous laughter brought a faint smile to her face, and she twisted around on the bench. He stood with her brother and two of the three Gamble men. Chase was hiding somewhere else, most likely from her.</p> <p>After he’d kissed her—and she felt the need to keep reminding herself that it had been he who’d kissed her—she hadn’t seen him. Like the child he treated her as, she’d conveniently hid away in the bathroom while he deposited their luggage in the gaudiest cabin ever. Not her proudest moment.</p><p>Madison just couldn’t make sense of any of it, and it wasn’t fair. The last thing she wanted to be dealing with during her brother’s wedding was this. It was a time to celebrate and laugh, not a time to add another notch on the humiliation belt.</p><p>But of course, here she was, grateful that it was dark enough to hide the flush that hadn’t faded yet. Worse still, that kiss had sent her spiraling backward in time to the one night she never wanted to remember, but also didn’t want to forget. Except now she couldn’t stop the onslaught of little vignettes replaying from that evening.</p><p>It had been her junior year in college, and as usual, she was in between boyfriends, still madly infatuated with her childhood crush, and the happy owner of one sexy little black dress that months of her part-time research gig at the university had paid for.</p><p>The opening night of Chase’s nightclub, Komodo, had changed everything. All these years and it seemed like yesterday. The drinks. The dancing. Everyone had been there—her brother, Lissa, Chase’s brothers, her friends. It had been a great night, one for celebrating. The evening had been a raving success, and Madison had been unbelievably proud. So many people had doubted him, but she never had.</p> <p>It had been past closing time. Her brother and most of her friends had already gone home when she found Chase in his penthouse office on the third floor, staring at the landscape of the city. The straight line of his spine, the perfectly tailored cut of his suit across his broad shoulders had stolen her breath. She’d stood there for what seemed like hours but was probably the barest of seconds before Chase had turned to her and smiled...smiled just for her.</p><p>Madison had ventured into his office, complimented him eagerly on the success of the club, and listened to his plans to open two more: one in Bethesda and another in Baltimore. She’d felt special that he had included her in such knowledge. It was like she belonged next to him for the first time and that thrilled her.</p><p>Both of them had been drinking, but neither of them had been three sheets to the wind. Alcohol may’ve been the proverbial courage in the bottle, but it couldn’t be blamed for what happened next.</p><p>She’d moved toward him, only to give him a hug good-bye, but when his arms had returned the gesture and she’d tipped her head back, something amazing and crazy happened.</p><p>Chase had kissed her—gently, carefully, and so sweetly that in a heady heartbeat, she had really thought all of her dreams had been coming true. Before she’d known it, he’d settled onto one of the supple leather couches in his office pulled her onto his lap, and the kisses... Oh, God, the kisses then had been blatantly carnal and claiming, erotically promising. His fingers were quick and deft, moving the zipper of her dress down, revealing her to his heated stare. His hands had been everywhere, skimming over her breasts, sneaking under the dress, discovering for the first time one of Madison’s oddities: She hated wearing panties. And he had gone crazy then, easing her onto her back, his fingers finding her most hidden places and thrusting as his body and tongue mimicked the movements.</p><p>When she had cried out his name, he’d gone incredibly still, his breathing ragged a second before he tore himself away from her and ended up pacing clear across the room like a jungle cat.</p> <p>There hadn’t been much time for her to be confused. Chase had freaked, ushering her out of his office, and the very next day, he’d called her, apologized for his drunken behavior, and promised that it would never happen again.</p><p>And it hadn’t...until several hours ago.</p><p>At least now, he couldn’t blame alcohol. He had no excuse, but he had broken her heart back then, shattered it into a million useless little pieces. As sad as it was, she hadn’t fully recovered from his obvious regret. It stung, left an aching pierce that hit her in the chest when she least expected it.</p><p>Obviously, he hadn’t been as attracted to her as she to him. Sure, there had to have been something there between the two of them, but it was unequal. She wanted more. And he had wanted just a taste, got it, and decided he didn’t want any more, which was usually his MO. And earlier today? Perhaps he’d just been bored. Or maybe he wanted to see if she still wanted him and when he did, he’d discarded her like he had that night.</p><p>Madison sucked in a sharp breath. He wasn’t a bad guy, though; she knew that. He just wasn’t the guy for her.</p><p>Stupid tears burned her eyes, and she blinked them away. Crying over Chase had been an almost nightly occurrence in college, especially when he began dating every woman in the city after the night at his club and the subsequent apology. So many girls that she never bothered to keep them straight. Didn’t help they all looked alike: insanely tall, long-legged, blond, and big chested.</p><p>The exact opposite of Madison.</p><p>Snorting, she took another drink of her wine. Served her right, she supposed. Chase was and always would be a no-Madison-land. The kiss had been a fluke, a breach in sanity.</p> <p>“Madison?” Lissa’s soft voice interrupted her thoughts.</p><p>She looked up and smiled. “Hey there.”</p><p>“You’re awfully quiet tonight.” The bride-to-be sat down beside her, glowing in her white sundress. “Are you worried about your car? Mitch said the tow truck brought it by a few hours ago.”</p><p>“Oh, no, the car is fine. Dad is going to get a tire for me tomorrow. I’m...I’m just letting it all soak in.” Madison’s gaze flitted over the guests. “It’s really beautiful here.”</p><p>“Isn’t it?” Lissa sighed. “Mitch and I visited two summers ago, during one of the festivals that offered a hot air balloon ride. With the aerial view, we sort of fell in love with the place.”</p><p>“I can see the appeal.” Though Madison was much more likely to be married with a baby on the way this time next year than her rosy-red ass getting into a hot air balloon. “You must be so excited.”</p><p>“I am!” Her smile increased in wattage, and Madison couldn’t help but return the expression over the rim of her wineglass. Lissa’s smiles were always infectious. “Your brother is a wonderful man, and I couldn’t be happier or luckier.”</p><p>“I’m sure he’s thinking the same thing.”</p><p>Her eyes misted over. “Yes, I believe so. That’s sort of perfect, isn’t it?”</p><p>A lump suddenly formed in Madison’s throat, so she washed it down with the rest of her wine. “Yes.”</p><p>Lissa’s gaze slid to her. “You look really nice tonight.”</p><p>“Really?” She plucked at the sleeveless, gauzy blue dress that ended just below her thighs. It was a dark cobalt blue, but it had nothing on... She shook her head. So not going there. “Thank you.”</p><p>A loud manly roar rose from where her father stood. Madison turned and her breath got stuck in her throat. Chase had arrived.</p><p>Madison glanced down at her empty glass and groaned under her breath.</p><p>Lissa nudged her. “He’s something else, isn’t he?”</p><p>She raised an eyebrow and muttered, “Something, all right.”</p><p>Mistaking her comment as pleasant, Lissa went on. “Mitch told me how the three of you were the closest out of the Gamble brothers. I can’t believe any of them are single. Each of them is so successful and handsome.” Her smile turned sly. “Your mother said you had a crush on Chase growing up.”</p><p>“Did she?” Madison desperately started searching for the waiter she’d seen earlier carrying a tray full of wineglasses.</p><p>Lissa nodded. “As soon as he heard your car was broken down, he raced off to rescue you.” She giggled, and Madison wanted to punch something. “He hadn’t even been here for five minutes. It was all very sweet.”</p><p>Like before, she refused to read too much into his motivations. Then she spied the crisp white shirt of the server. Bingo!</p><p>“Have you ever considered...?”</p><p>Madison turned hot and then cold. “Considered what?”</p><p>“You know, being more than friends with Chase? I know you two have known each other since forever, but some of the best loves are those that start as friends. Take Mitch and me, for example. We were friends in the beginning.”</p><p>Oh, sweet baby Jesus. Madison started waving her arm at the waiter like a madwoman.</p><p>“Thirsty?” Lissa asked, grinning.</p><p>“Very.” She snatched a glass off the tray with a quick thank-you and a smile, and then considered grabbing two if this conversation was heading where it seemed to be.</p><p>Lissa’s eyes twinkled. “And since you two are staying together here, there’ll never be a better time to explore other possibilities than in such a romantic place.”</p><p>Aw, what the hell. Madison grabbed another glass before the waiter escaped. She was going to need it.</p><p>Chapter Four</p><p>Chase was having one hell of a time listening to what his brothers and Mitch were talking about. Something about the wedding night and performance anxiety. What the hell did his brothers know about the first night as husband and wife? They had just as much experience as Mitch did.</p><p>His middle brother, Chad, had finally shown up and after Mitch’s father had gone to claim his woman for the evening, he started giving pointers.</p><p>“Did you shave your boys?” Chad asked, holding a can of beer while everyone else had wine.</p><p>“What?” Mitch laughed.</p><p>“Shave the boys.” Chad grinned. “The ladies love it when they’re all smooth.”</p><p>There was no doubt in his mind that Chad knew exactly what the ladies loved. Everyone in DC believed Chase was the man-whore of the clan, but in reality, it was Chad.</p><p>“I really don’t want to talk about my balls with you,” Mitch said. “Not now. Not ever.”</p><p>Chase snickered. “Thank God.”</p><p>“You’ll be sorry if you don’t.” Chad smiled that shit-eating grin of his. “You should also bring in some toys. That will...”</p><p>Chase zoned his brother out at that point. He wouldn’t be surprised if Chad already had Mitch’s honeymoon cabin decked out with all kinds of perverse things just for the fun of it.</p><p>Leaning against the railing, Chase took in the group around him. Most had already left, including Mitch and Lissa’s parents. The younger crowd was still up, though—the type of people who’d be at one of his clubs.</p><p>His skin itched. He hated being away for days without the ability to make sure things were running smoothly. His managers were on the up and up, more than able to keep the wheels churning, but even though it would be a slow night, he was having a hell of a time fighting the urge to call and check in every five seconds. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was also having a hell of a time not thinking about what went down in that God-awful cabin. Fuck. What in the hell had he been thinking? Kissing Maddie—again? He glanced at Mitch and could almost feel his balls being castrated. And he’d deserve it. With his reputation, Chase was sure that Mitch wouldn’t be too pleased to know Chase had molested his sister. Though Mitch had never outright condemned the idea—hell, several times he’d actually suggested Chase and Maddie get together—there was no way that was going to happen. And he doubted Mitch would be so supportive if it became reality and one took into consideration Chase’s track record with women and the DNA he shared with his father. Mitch’s suggestions weren’t a green light.</p><p>Folding his arms, he ran his gaze over the sea of faces laughing and drinking around him.</p><p>There she was, by the benches. She had to be on her fourth glass of wine by now due to the amount of empty ones sitting around her, and if she was still anything like he remembered, this was going to be a long, albeit interesting, night.</p><p>Maddie.</p> <p>Little freaking Maddie...</p><p>When he’d kissed her earlier... God, he didn’t know a more responsive woman. The way she arched into him... The breathy feminine sound she made had nearly undone him, and that had been his wake-up call, but she had been so damn hot.</p><p>She was still too damn hot.</p><p>Chase widened his stance, biting back a growl. What had happened this afternoon, like what had happened that night in his club, had been a mistake. A mistake he enjoyed, but something that couldn’t happen again. That was his best friend’s sister...</p><p>Who was now standing on a bench, a half-empty wineglass hanging from her slender fingers as she swayed her hips to the light thrum of music coming from inside.</p> <p>God. Damn.</p><p>One of Mitch’s work buddies stood below her, grinning like he just won the fucking lottery or something. Or, as she raised her arms and her body moved in sensual curves to the rhythm of the music, the guy was thinking his chances of getting laid tonight were pretty high.</p><p>Without thinking, Chase pushed off the railing and took a step toward them. Seconds away from walking right up to her and pulling her off that damn bench, he forced himself to stop. What the hell was he doing? She wasn’t his problem.</p><p>But damn if a part of him wanted her to be his problem.</p><p>Going back to leaning on the railing, he clenched his jaw shut so tightly that his teeth ached. Who was that tool talking to her, coaxing her off the bench? Robby? Bobby? Some dickhead name like that?</p><p>Whoever he was, he reached up, placed his hands on her hips, and lifted her down onto the floor. Her soft laugh travelled across the deck, and every muscle in Chase’s body locked up.</p> <p>“What crawled up your ass, bro?” Chandler demanded.</p><p>Chase ignored him, unable to look away from the situation unfolding before him.</p><p>His oldest brother followed his gaze and chuckled. “What is little Maddie up to over there?”</p><p>“Nothing but trouble,” Chase muttered.</p><p>Chandler laughed. “She’s just having fun. There’s nothing wrong with her dancing with some guy.”</p><p>He so did not agree.</p><p>“She ain’t a kid anymore,” Chandler added, like Chase needed help realizing that.</p><p>Anger pricked at him. “She doesn’t even know that guy.”</p> <p>“So?” And then he seemed to understand. “Aw, man, you’ve got to be shitting me.”</p><p>Chase’s head whipped toward his brother. Any other man would’ve cowered away from the dangerous look on his face, but not his brother. Nothing scared Chandler. “What?”</p><p>“Don’t even try to pretend.” Chandler shook his head and then laughed. “You’ve got it bad for Maddie.”</p><p>He scowled. “You have no idea what you’re talking about.”</p><p>“Bullshit.” Chandler propped his hip against the railing and glanced over his shoulder. “Mitch will probably beat the shit out of you.”</p><p>Like I don’t know that already, but thanks for pointing it out. Chase’s gaze swung back to Maddie. There was still some space between her and the tool, but she was smiling at the guy—the kind of smile that was innocent and sexy as hell all at the same time, and Chase’s gut clenched.</p><p>Chandler clasped his shoulder. “But I think after he knocked the crap out of you, he’d probably thank you.”</p><p>Doubtful. “For what?”</p><p>His brother stared back at him like Chase was an idiot. “Maddie could end up with someone worse.”</p><p>“Wow. Thanks.” A wry grin tugged at his lips.</p><p>“You know what I mean. Once he gets over the idea of you and her, he’d be more than happy about it. He knows you. Trusts you.”</p><p>Yeah, and that was the bitch of it. Mitch trusted Chase, so doing anything with Maddie was spitting in Mitch’s face, ’cause there was no doubt in Chase’s mind things would end badly. “Yeah, it’s not going to happen,” he said finally.</p><p>Chandler was quiet for a long moment as his gaze fixed on the swaying grape trees. “You want to tell me why?”</p><p>“Do I need to?”</p><p>There was another pause and then, “I just don’t get it. Maddie has always loved you—don’t give me that look. Everyone knows it.” His brother flashed a rare grin. “You two would be good together—she would be good for you.”</p><p>He refused to even think about that.</p><p>“And you’re good enough for her,” his brother added quietly.</p><p>Chase thrust a hand through his hair. “Why are we having this conversation? Hell, if anything, her brother should be taking her little ass back to her cabin before she gets into trouble with what’s-his-dick.”</p><p>Chandler chuckled. “Looks like Mitch is taking his fiancée out behind the bushes.”</p><p>And hell if Mitch wasn’t, not that he could blame him. Chase blew out a long breath, considered heading back to the cabin...or sleeping in the car for the night. It was getting late and standing here, watching her—</p><p>Maddie’s laughter rang out like wind chimes as she was lifted into the air, wineglass long forgotten. The guy had his arms around her waist, pulling her closer to him.</p><p>And that was it.</p><p>Chase stopped thinking. Pushing off the railing, he barely registered his brother said something taunting to his retreating back as Chase prowled across the deck and came up behind the guy, ignoring his brother’s distant laughter.</p><p>For a moment, the two before Chase didn’t seem to notice him, but then Maddie’s glossed over gaze drifted beyond the guy’s shoulder. The tool stiffened and then turned around. One look at Chase’s face struck the idiot speechless. Good.</p><p>“Maddie,” Chase said, voice surprisingly calm. “It’s time to go back.”</p><p>She stared at him, her cheeks flushed prettily. “Why?”</p><p>His look should have said he really didn’t need to explain but it was obvious she just wasn’t seeing things clearly. “I seriously think it’s time to call it a night.”</p><p>Maddie pouted and then turned, searching for her glass. “It’s still early. And I’m not ready to go back. Bobby, did you see where I put my glass? It’s around here, I swear.”</p><p>Her refusal must’ve given the little twerp courage because he planted himself in front of Maddie and Chase. “I’ll make sure she gets back to her room safely tonight.”</p><p>“Yeah, that’s not going to happen.”</p><p>Bobby-Dipshit held his ground while Maddie peered into the shadowy corners, searching for her lost glass. “She’s cool, man.”</p><p>“She’s nothing to you.” Chase brushed past the guy, leaving him standing there with his ruined plans for the evening. No way in hell if he was alive and breathing was some guy like that going to end up making Maddie a one-night stand.</p><p>Chase gently wrapped his fingers around Maddie’s arm and pulled her away from where a bottle of wine was chilling in ice. “Come on, let’s go back to our room.”</p><p>He gave Bobby a pointed look, satisfaction settling in Chase’s belly as his words sunk in and Bobby’s eyebrows shot up, his hands raised in surrender as he backed away. Yeah, game over, asshole.</p><p>She started to protest, but then she swayed way to the left, pressing her hand to her mouth and giggling. “I may be a little tipsy. Not too much, but I think I might be well on my way.”</p><p>Chase arched a brow.</p><p>Maddie giggled again as she peered up at him through thick lashes. “You look like you’ve sucked on something sour. What’s your problem? I was just dancing and...”</p><p>“And what?” he growled lowly.</p><p>She scrunched her nose. “Well, I was...huh, I don’t know.”</p><p>He rolled his eyes. “Come on, let’s get you to bed.”</p><p>“Oh, listen to you! Ordering me to bed. For shame,” she said, giggling as she wiggled free from his light grasp. “What would people think? The controversy, Chase.”</p><p>“Maddie...”</p><p>She flounced off ahead, and he sighed, trailing after her. Surprisingly, she was heading for the stairs that led to the pathway and away from the wine, which was a good thing, he guessed.</p><p>Passing Chandler, he cut his brother a look before he could make some smartass comment. And it was on the tip of his tongue, too. One thing Chandler didn’t do was relationships of any sort. His brother dated, sure, but it would be a good day in hell before the eldest brother settled down.</p><p>“Have a good night,” Chandler called out, laughing.</p><p>Chase flipped him off.</p><p>She made it down one step before he swooped in, getting an arm around her narrow waist. She leaned against him, and he led her down the stairs without her falling and breaking her neck.</p><p>Getting Maddie back to the cabin was an experience in patience and reluctant amusement. Several times she broke away from him and started to roam off to God knew where. He doubted she knew. Halfway back to their cabin, she kicked off her heels. Near the cabin next to theirs, she sat down in the middle of the pathway illuminated by the pale glow of the moon.</p><p>“What are you doing?” he asked.</p><p>“Taking a break.”</p><p>Shaking his head, he walked up behind her. “You haven’t been walking that far.”</p><p>“It seems like we’ve been walking forever.” She tipped her back against his knees and grinned. “I’m one of those drunk girls. You know, the kind who sits down in the middle of the street? God...it’s like I’m in college again!”</p><p>He frowned. “Did you sit in the middle of the street a lot when you were in college?”</p><p>“More times than I remember,” she replied with a chuckle.</p><p>“I don’t remember that.”</p><p>She raised a hand and pointed at him, but her aim was wobbly, so she ended up popping herself in the face.</p><p>He winced and grabbed her small hand, steering it away from her face. “Ouch.”</p><p>Maddie didn’t seem to notice that she’d almost knocked out her own teeth. “You weren’t always around, you know.”</p><p>Chase fought a grin as he bent down, got his hands under her arms, and lifted her back up. “Am I going to have to carry you? If so, it would complete my badass knight-in-shining-armor act with you today.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You are not a knight.” She stumbled forward and then spun around, patting him on the chest hard enough to make him grunt. “But you kind of are. You have a good heart, Chase Gamble.”</p><p>Wow. She had blown past ‘just tipsy’. “Okay. I think I might have to carry you.”</p><p>She huffed. “I can walk, thank you very much. I was just tired.”</p><p>“Thought you weren’t tired.”</p> <p>“I’m not,” she argued.</p><p>He stared at her.</p><p>“You’re such a bore.” Maddie staggered ahead and then stopped, tilting her head back on her long, graceful neck. When her hair was loose, it hung clear to her hips when she did that. “The moon is so big.”</p><p>There was something big growing in his pants. And he was pretty sure that made him the worst kind of bastard. But he couldn’t help it. Chase was still a man and, off limits or not, Maddie was...she was just Maddie.</p><p>Looking over her shoulder, she smiled. “I’m really happy for my brother,” she rambled on. “They’re going to have babies, and I’ll get to be an aunt. I can take them to the Smithsonian, teach them about history and...and stuff.”</p> <p>“You’re going to turn those kids that don’t exist yet into nerds.”</p><p>She held up her finger, placing it an inch from his face, and he had an urge to lick it. “Nerds are cool. You are not.”</p><p>Chase laughed as he took her hand, gently pulling her down the pathway. “What kind of stuff will you teach them?”</p><p>“Oh, you know, stuff...like the Civil War and how important it is to take care of our battlefields, preserve history...and I’ll get them to volunteer.”</p><p>“Will you?” They were almost to the door. Just a few more steps.</p><p>She pulled her hand free and pushed him lightly. “Yes, I will. I’m good at my job.”</p> <p>“I have no doubt.” And he didn’t. Granted, he’d never told Maddie he was proud of all she’d accomplished or how in college she’d always been on the dean’s list.</p><p>Maybe he should’ve.</p><p>Confused by that, he followed her to the door. Once inside, she made her way to the edge of the bed and sat down heavily.</p><p>He turned on a small lamp with a fuchsia shade in the corner and then flipped the switch off on the wall. Less light was probably a good thing.</p><p>“So how are we going to do this?” She glanced at the bed and then at him. “Are we having a real sleepover?”</p><p>Chase hardened painfully at the thought of just being in bed beside her. “I’ll be taking the couch.”</p><p>She stared at him but said nothing. Needing to distance himself, he went over to his luggage, pulled out a pair of lightweight lounge pants and a shirt. “I’ll get changed in the bathroom.”</p><p>“Why?”</p> <p>Was he seriously going to have to explain this to her? By her wide eyes, that would be a yes. “Get changed while I’m in there, Maddie.”</p><p>Her lips thinned. “I might have drunk one...or four...too many glasses of wine, but I’m not drunk or stupid.”</p><p>Chase was on the fence about the first. Sending her one last meaningful glance, he went into the bathroom, closed the door, and quickly changed. That was when he noticed her little bag of personal items open on the sink.</p><p>Toothpaste, hairbrush, a few items of makeup. Little stuff, but all hers. He reached out, running his fingers over the handle of the brush. A weird, totally inappropriate image of her stuff spread across the sink in his condo filled his head. An ache sprung in his chest, tight and familiar.</p><p>Man, he needed meds or something. It was a nice fantasy, but it was only a fantasy.</p><p>When enough time had passed, he went back into the main room. Maddie was still on the bed where he’d left her, staring at the bear rug on the floor.</p><p>He sighed. “Maddie, what are you doing?”</p><p>“That rug is really creepy, don’t you think?”</p><p>Moving to the center of the room, he folded his arms over his chest. “It’s not something I’d put in my place.”</p><p>She winced. “I’m going to have nightmares about the thing coming alive and gnawing on my foot while I sleep. Totally ruin my pedi.”</p><p>His gaze dropped to her dainty feet. He wouldn’t mind gnawing on one himself. “Maddie, you should get changed for bed.”</p><p>Standing up, she picked at the edge of her dress. When he’d seen her earlier, he had thought that shade of the blue had been the perfect color on her.</p><p>Maddie sighed. “I sleep naked, so I didn’t bring any night clothes. Didn’t think it would be a problem...”</p><p>Oh, for fuck’s sake.</p><p>Images of her glistening skin, flushed and smooth like satin, sliding under the sheets, filled his head. His body had been strung taut as a bow all night, but now his cock was throbbing. He hungered for her on a primitive, raw level. The things he’d do to her...</p><p>And that was why he wouldn’t do anything. Not to Maddie. She was too good.</p><p>Turning away from her, he frantically searched for a resolution. “I have some shirts that will be long enough for you to wear.” He started toward his luggage, the swollen member between his thighs making it hard to concentrate on anything other than what it wanted, which was to spread those pretty thighs and plunge deep inside her, over and over again. Not gonna happen, boy, so just settle down. He grabbed a dark shirt and turned.</p><p>Maddie stood behind him. “I’m sorry.”</p><p>“Sorry for what? Getting a little tipsy?” Chase shook out the shirt. “Hold your arms up.”</p><p>She obeyed, lifting them into the air. “I’m sorry about all of this.” Her voice muffled as the cotton shirt got stuck for a moment over her head, and he couldn’t help but grin as he tugged it down. “You must hate this,” she said as her head popped through.</p><p>“Hate what?” He yanked the shirt down, and thank God, it was just as long as the dress. Sneaking his arms under the shirt, he fumbled for the zipper in the back. The sides of his arms brushed the swell of her breasts, and he stepped closer without realizing it.</p><p>“Being stuck with me,” she said, tipping her head back to meet his stare.</p><p>He frowned. “I’m not stuck with you, Maddie.”</p><p>She didn’t say anything.</p><p>His fingers found the zipper and he pulled. The dress eased down, pooling around her feet, and his hands... God damn it, his hands were on the bare skin of her back. Like he remembered, her skin was as soft as satin.</p><p>Chase needed to remove his hands pronto and step back, but she swayed forward, placing her smaller palms on his waist, her bare thighs brushing his. Then she placed her cheek against his chest and sighed.</p><p>“I’ve missed you,” she murmured.</p><p>He felt something in his chest lurch. “Baby, how can you miss me? We see each other every day.”</p><p>“I know.” A tiny sigh leaked out. “But it’s not the same. We’re not the same. And I miss you.”</p><p>God, wasn’t that the truth? Ever since that night in his club, things had been different. And right now, he was frozen, caught between knowing he needed to put distance between them and wanting to hold her in his arms. And how many times had he held her like this? Not in recent years, but when she was younger, many times.</p><p>The odd, empty spot in his chest he usually ignored warmed. As a kid, he and his brothers couldn’t stand to be in their cold house, surrounded by their mother’s crushed dreams of marriage and their father’s absence, so being around Mitch, Maddie, and their family had always eased that loneliness.</p><p>Especially Maddie. She had this way of hers, wiggling herself around his heart. Even during the times they hadn’t really talked, she existed in the back of his mind like a constant ghost, haunting him.</p><p>Closing his eyes, he rested his chin atop her head. “I...I miss you, too.”</p><p>She lifted her head and smiled sleepily, staring up at him with so much trust in her beautiful eyes, and God, he bet she’d let him do anything to her, right here and right now. His body screamed for it, demanded it, really.</p><p>With more willpower than he knew he had, he guided her over to the heart-shaped bed, pulled back the covers, and gently sat her down. In a surprising turn of fate, she didn’t argue with him but slid those curvy, sexy legs under the blanket and laid down.</p><p>“Where are you going to sleep?” she asked, lids lowering.</p><p>Chase hovered over her, drinking in the sight. He knew exactly how many freckles she had across her nose and cheeks. Twelve, to be exact. Knew that the tiny scar under her full bottom lip, a shade whiter than the rest of her skin, was from a bike accident when she was seven. Knew those lips, depending on her mood, could be so expressive.</p><p>He looked over his shoulder. The couch was long and narrow, no doubt as comfortable as sleeping on a pile of boards.</p><p>“Chase?” she whispered.</p><p>Forcing a smile, he brushed a strand of hair off her face and then, without meaning to, his hand lingered along her cheek, cupping it. She turned to the gesture and another soft sigh leaked from her parted lips. “The couch has my name on it,” he said.</p><p>“There’s more than enough room here.” She rolled onto her side, facing him. “I don’t bite.”</p><p>The problem was, he kind of hoped she did. “I’m fine.”</p><p>Remarkably, she was asleep before he could say anything else, which was a good thing, because if she offered the bed to him again, he wasn’t sure he could refuse a second time.</p><p>Chase lowered his lips to her cheek and pressed a kiss there before backing away. Turning off the light, he went to the couch and stretched out, doing his best to get comfortable. That ache was back in his chest again, and this time, he knew it wasn’t for the lack of her hugs.</p><p>It was for the lack of her in his life.</p><p>Chapter Five</p><p>With half a bottle of Tylenol trying to work its magic on the wine-induced headache, Madison winced behind her sunglasses as she shuffled alongside her mother. Touring the vineyards sounded fun, would probably have been pretty interesting, too, if she wasn’t certain a psychotic drummer had taken up residency in her head.</p><p>God, she really drank a little too much last night. Dancing on a bench? Having to be escorted back to the cabin by a surprisingly rational Chase? Shamed and more than a little frustrated with herself, she kept close to her family as they piled onto the seats in the back of the bed of a cattle truck, where they’d view the vineyard up close and personal.</p><p>Bobby? Robby? Whatever his name was, he’d ended up in the other car, thank God. She couldn’t even look at him without wanting to hide herself under the hay covering the bed of the truck.</p><p>Every bump went straight to Madison’s temples. She gripped the seat, jaw clamped tight as the vehicle swayed along the narrow road.</p><p>Under the brim of her mother’s wide straw hat, she grimaced. “You’re looking a little peckish.”</p><p>Before she could respond, Chad cut in with a grin. “She drank, like, twenty glasses of wine last night.”</p><p>“Madison,” her mother admonished, her brows slamming down.</p><p>She rolled her eyes. “I didn’t drink twenty glasses.”</p><p>Her father rubbed his trim beard. “How many did you drink?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t know.” She glanced at a silent Chase. “Maybe four...?”</p><p>Her mother gasped, but Lissa giggled as Madison’s brother grinned and shook his head. “What a wino,” he said.</p><p>Madison made a face and then turned. As far as the eye could see, there were grape trees and rolling hills under the bright glare of the sun and blue skies. Luckily the conversation turned from her hangover to wedding plans. Friday night, there would be a rehearsal, since the bachelor and bachelorette parties had been held the week prior. There was a busload of wedding programs that needed to be folded and, wanting to be of some use to the whole shindig, Madison offered to do it before dinner.</p><p>“Thank you!” Lissa exclaimed, obviously grateful. “You’ll probably need some help. There are a lot of programs, plus the little card holders. I’m sure some of the other bridesmaids would love to help.”</p> <p>Being the maid of honor, these were the kind of things she should be doing and she actually wanted to. And the other girls had done so much, stepped in whenever Madison had needed their help. “It’s okay. I can do it. Let them relax.”</p><p>Lissa relented, but she passed a look to Mitch.</p><p>Madison loosened her grip and smoothed her hands over her denim skirt. Sitting across from her was Chase. Even though he hadn’t said more than two words to her since she crawled out of bed, she could feel his eyes on her.</p><p>Last night... Dear God, he’d had to help her change out of her dress and she’d admitted that she slept naked. Well, she definitely added another notch to the humiliation belt. Swearing off wine forever, she stole a quick glance at him.</p><p>Their eyes locked just as the tour guide stopped by a large stone building. Everyone unloaded in a rush. Mitch and Lissa in the front, their arms snug around each other’s waists. Her parents were just as cuddly. Like Chase had said earlier, they were treating the trip like a honeymoon. They hadn’t had a real one after they married, so Madison was glad to see them having so much romance and fun.</p> <p>“Here,” said a deep voice.</p><p>Madison looked up, surprised to find Chase beside her, holding a bottle of water. She took it, offering a tentative smile. “Thank you.”</p><p>He shrugged. “I’ve seen many hangovers worse than what you have, but the water should help.”</p><p>Chase would know, she thought, unscrewing the lid and taking a drink. Besides running three clubs where liquor poured from the ceilings, he’d been quite the partier in college, and then there had been his mother... Chase and his brothers had probably learned how to treat a hangover at an early age. She always found it strange that Chase had gone into the nightclub business, but he was clearly determined to be “like father, like son,” she supposed. His dad had owned dozens of bars and nightclubs. It seemed only natural that one of the brothers would’ve followed suit.</p><p>But Chase... He wasn’t like his father, not really. He wasn’t as cold as the elder Gamble or as selfish. A fine shudder rolled through Madison as she recalled the few times she’d been in the Gamble house. Once when she was just a kid and then when she’d been seventeen. Both times, the house had been sterile and frigid. His mother had been a lifeless shell, living from one wine bottle and prescription pill to the next. The woman had loved the boys’ father to the point of death and their father...he hadn’t seemed to care.</p><p>Discreetly peeking at Chase from behind her sunglasses, she noticed again how out of the three brothers, Chase was the one who resembled his father, but even with the clubs, the girls, and the success, he was the least like him.</p> <p>He just couldn’t seem to stop acting like he was.</p><p>When he glanced at her, she looked straight ahead. Why was she even thinking about this stuff? It didn’t matter, and if she didn’t start paying attention, she’d tumble right down the narrow steps the guide was leading them down into the wine cellar where thousands of bottles were racked and stocked from the floor to the ceiling.</p><p>Something was different about Chase today as he joked with his brothers and Mitch. Like a tension in his shoulders that hadn’t been there yesterday morning had set in. She hoped it wasn’t from sleeping on that terrible couch.</p><p>The air was several degrees cooler in the wine cellar, and she rubbed her arms, chasing the chill away. Since wine storage wasn’t of much interest to her, she roamed off, following the maze of bottles.</p><p>Good Lord, if she were claustrophobic, being down here would be a problem with how tight and narrow and tall the racks were.</p><p>Her flip-flops smacked on the cement floor as she tried to read the names on the bottles. Most of them were unpronounceable to her and honestly, she’d go to the grave before she had another sip of that stuff.</p><p>The voices of the group faded off as her fingers trailed along the chilled bottles. She wasn’t a big drinker, obviously. Last night had been out of the norm.</p><p>Stopping at the edge of the rack, she glanced over her shoulder, suddenly realizing she couldn’t hear anyone anymore. Frowning, she backtracked to where she thought she’d left them, but no one was there.</p> <p>“Crap,” she muttered, hurrying down an aisle.</p><p>This wasn’t happening. They did not leave her. Tightening her grip on the water bottle, she barrelled around the corner, smacked right off a hard chest, and almost landed on her ass.</p><p>Chase snatched her arm before she ended up on her rear. “Whoa. You okay?”</p><p>Blinking, she nodded. “I didn’t know you were there.” She took a step back, ignoring the sudden increase in her heart rate. Her reaction was ridiculous. “Why are you here?”</p><p>He cocked his head to the side. “The group is moving on to lunch.”</p><p>“Oh?” Since she wasn’t bouncing around in that horrible truck, her stomach perked up happily.</p><p>A half grin appeared. “It’s a picnic, I hear, out in the actual vineyards.”</p><p>That sounded incredibly tasty and romantic. “Well, we better hurry, then.”</p><p>Stepping aside, Chase let her walk by. He followed behind her silently, and she wished he’d say something. Anything. But then again, she had no idea what to say, either. The awkwardness that had developed between them sucked. Proof positive why friends of any sort should never cross that invisible line... At least not unless they planned on crossing all the way.</p><p>When they reached the entrance, Chase swore under his breath. “Where in the hell is everyone?”</p><p>A horrible sensation snaked its way through the pit of her stomach as she glanced up and down the empty aisles. There was no sound other than Chase’s soft breath and her pounding heart.</p><p>“They didn’t...?” She trailed off, unable to accept what was happening.</p><p>“No.” He edged around her and pounded up the steps. Another loud curse and banging caused her to wince.</p><p>Madison found him at the top of the stairs, his hands on his hips. “Please don’t say what I think you’re going to say.”</p><p>“We’re locked in.” Disbelief colored Chase’s tone.</p><p>“You have got to be kidding.” She squeezed past him and tried the door, jiggling the handle. Nothing. She wanted to smack her head off the door but figured since her headache had finally eased, that was not a good idea. “They left us.”</p><p>Chase leaned against the cool cement blocks, closing his eyes. “They have to realize we’re missing. They’ll come back. Soon. It won’t be that long.”</p><p>Boy, she hoped so. She was already colder than a witch’s tit, but as five minutes passed and then ten, it wasn’t looking like a rescue was going to happen anytime soon.</p><p>Madison dropped down on the step, chasing away the goose bumps on her bare legs with her hands. “You know, I’m kind of offended that no one has even realized we’re not with them.”</p><p>He chuckled and settled onto the step above her, leaning forward and crossing his hands on his bent knees. His face was nearly eye-level with hers, so now she didn’t have to tilt her head to talk to him. “Yeah, it does wonders for your self-esteem, doesn’t it?”</p><p>“I bet they’re enjoying their lunch, too. Eating finger sandwiches, drinking club soda, and thinking, ‘Hmm, the group seems different, but oh, never mind, we have pickled eggs!’”</p><p>Chase’s deep, husky laugh warmed her belly. “This reminds me of something.”</p><p>At first, she didn’t know where he was going with that statement as she pulled the sunglasses off her head and placed them next to her water on the top ledge. And then it hit her.</p><p>Oh, for the love of all things holy in this world.</p><p>“You were seven,” he said, humor lacing his voice.</p><p>She lowered her head in shame. Chase had this wonderfully selective memory when it came to remembering the most humiliating moments in her life.</p><p>“And Mitch and I were going to the park to play a game of basketball and you wanted to go, but Mitch wouldn’t let you.” Another chuckle filled the pause. “So, you decided to retaliate.”</p><p>“Can we talk about something else?”</p><p>He ignored her. “By stuffing yourself in a chest in the tree house—what the hell did you hope to gain by that?”</p><p>Her cheeks burned. “I was hoping that you guys would come back and miss me, and then you’d feel bad for not letting me play with you. Yeah, I know, not the smartest plan, but I was a kid.”</p><p>Chase shook his head and a lock of dark hair fell forward over his forehead. “You could’ve killed yourself.”</p><p>“Well, I didn’t.”</p><p>“Except we thought you went to the neighbors’ house,” he added, frowning now. “Man, you had to be in that chest for hours.”</p><p>She had. Luckily it had a huge rusted-out hole in the side, but something had gone wrong when she had closed the trunk. It had locked on her. Even with her scrawny arms, she couldn’t reach the latch from the inside. So she had stayed in that damn chest, helpless as night fell and she felt like spiders were crawling over her. She remembered crying for what felt like days and then finally falling asleep, positive she was going to die alone.</p><p>“When your dad realized you weren’t at the neighbors’ and no one had seen you since we’d left for the park, I thought he was going to lock us in one of his bomb shelters.”</p><p>Imagining how angry her father must’ve been, she laughed. Half the reason why she’d been able to tail them so much as a kid was the fact her parents had put the fear of God in Mitch and the Gamble brothers. If Madison wanted to play with them, she got to play and set the rules.</p><p>Too bad it didn’t work that way now.</p><p>“You found me,” she said, closing her eyes.</p><p>“I did.”</p><p>“How?” she asked. It was the one thing she’d never figured out.</p><p>Chase was quiet for so long, she thought he might not remember. “We searched everywhere—my brothers and your family. They’d been in the tree house, but I don’t know why I checked it again. I saw that damn chest we used to sit on and looked in that hole. I saw your red jumper and about had a heart attack. I called your name and you didn’t answer.” A heartbeat passed. “I thought you were dead in there. I had to use that busted old hammer to pry the lock open.” He took a deep breath. “You scared the hell out of me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She bit her lip as she remembered him picking her up and carrying her back to the house. “Sorry. I didn’t mean to scare you guys.”</p><p>“I know. You were just a kid.”</p><p>There was a pause and then she said, “Sorry about last night.”</p><p>He shrugged it off.</p> <p>“No. Really. I was pretty blitzed, and I vaguely remember hitting myself in the face.”</p><p>The skin at the corners of his eyes crinkled as he chuckled. “You did do that.”</p><p>“So embarrassing,” she muttered. “Anyway, I’m sorry you had to deal with that.”</p><p>“Don’t be. It was fun.”</p><p>“Fun?”</p> <p>He nodded. “You were pretty keen on the moon and teaching Mitch and Lissa’s kids about volunteering and stuff—lots of stuff.”</p><p>Madison grinned.</p><p>There was a drawn-in breath and then, “So, you sleep naked?”</p><p>Aw, man...</p><p>“All the time?” Curiosity marked his tone.</p><p>She sighed. “All the time.”</p> <p>“Nice.”</p><p>Peeking over her shoulder at him, she raised her brows. He winked. And then he said nothing else. In the silence that followed, she searched for something to say. “How’re the clubs going?”</p><p>“Good.” He folded muscular arms over his chest. “I’m thinking about opening a fourth in Virginia.”</p><p>“Really? Wow. That’s a lot to handle.”</p><p>“I don’t know. Nothing is in stone yet, but it’s looking good. There’s Father’s clubs, but they seem to be doing well under their own ownership. Never thought to step in and buy them out from the management he had in place. I rather prefer having my own. It means more that way, like it wasn’t handed to me...” His gaze dropped to where she was rubbing her calves, and she stopped, flushing.</p><p>Chase cleared his throat. “Mitch was telling me that you petitioned for more funding for the volunteer department and succeeded.”</p><p>At the beginning of the year, like every place in the world, the Smithsonian was facing budget cuts, and volunteer services was one of the first departments to take a hit. It had taken months to petition, blood and quite a bit of frustrated tears, to finally be awarded a grant that allowed them to continue operating.</p><p>Madison nodded.</p> <p>His eyes warmed with pride, and she felt all kinds of warm and fuzzy from seeing that. “That’s really good.”</p><p>Never comfortable with compliments, she flushed and looked away. “It took a lot of work, but I enjoyed it.”</p><p>“It’s good...seeing you doing something you enjoy.”</p><p>Her chin jerked toward him as she tried to decipher why he had said that, but then realized he probably meant it exactly how it sounded. “Same for you.”</p><p>Chase nodded and then took a deep breath. Madison steeled herself. She knew that sound, knew he was going to say something she probably wouldn’t like.</p><p>“About what happened...yesterday afternoon...?” A muscle pulsed in his jaw. “I shouldn’t have left like that.”</p><p>Surprised, she stared for several moments and then found her voice. “No, you shouldn’t have.”</p><p>He took that in stride. “It did happen, and I shouldn’t have told you it didn’t.”</p><p>She wondered if there was an apocalypse going on outside. Comets falling from the sky. Poles shifting. Icebergs melting. Her parents would be thrilled.</p><p>The tips of his cheeks flushed. “And I’m sorry. I shouldn’t have—”</p><p>“Don’t,” she said, on her feet before she realized it. In the cramped space, there was very little room between them, and her anger was like a third person crowding them in. “Don’t tell me you shouldn’t have done it.”</p><p>His eyes went wide and then narrowed. “Maddie—”</p><p>“And stop calling me that.” Her hands balled into fists. “I think you’ve made it perfectly clear how unattractive you find me.”</p><p>“Whoa. Wait.” He threw up his hands. “This has nothing to do with that.”</p><p>She huffed. “Yeah, because when you’re attracted to someone, you actually enjoy kissing them and afterward, you don’t act like you kissed Adolf Hitler.”</p><p>His lips twitched as if he were trying not to smile, and he stood, too. “For one thing, that’s not how I acted. And secondly, I don’t want to hear ‘kissing’ and ‘Hitler’ in the same sentence ever again, because now I’m picturing you with that little Hitler mustache.”</p><p>“Shut up.”</p><p>“And that’s not hot—not hot at all.”</p><p>His tone was light, playful even, but now her face was burning, and there was no escaping him. “Whatever.”</p><p>Anger darkened the hue of his eyes, turning them cobalt blue, and the mischievous glimmer was gone. “Talking about this—trying to be a decent guy about the situation—was obviously a mistake.”</p><p>“Just like kissing me was yesterday, right?”</p><p>“Obviously,” he shot back.</p><p>Madison flinched, and for a second, she thought she saw regret flicker in his eyes, but then he looked away. Everything came to a head in an instant. Years of confusion and regret mixed together to form a nasty ball of emotion. She tipped her chin up. “Tell me, do you call your other girlfriends after you make out with them and apologize for your drunken behavior?”</p><p>The muscle in his jaw popped out.</p><p>Undaunted, she took a step forward, getting right in his face. “I bet you don’t. They probably get phone calls that don’t include an apology and flowers instead of being left behind like discarded trash.”</p><p>Anger flared in his eyes. “You’re not discarded trash.”</p><p>“Yeah, I guess I’m just not good enough, then. But hey, be happy, because soon we’ll have our own rooms and won’t have to keep apologizing to each other.” She turned away and walked down the steps to find a damn chest to hide in, because tears were burning her eyes and she knew how jealous she sounded.</p><p>She was making a fool out of herself. Again.</p><p>Madison made it down one step before Chase’s hand caught her arm and whipped her back around. He glowered at her. “You don’t have a freaking clue, do you?”</p><p>She tried to pull her arm free, but he held on. “A clue about what?”</p><p>“It has nothing to do with you being good enough or me being attracted to you. Not at all.”</p><p>“I’m not sure who you’re trying to convince, bud. I think your track record with me speaks for itself.”</p><p>One second she was in the middle of the step and the next her back was against the wall and Chase’s body was flush to hers, meeting in all the right places.</p><p>“Tell me,” he said, voice low and thick. “Does it seem like I’m not attracted to you?”</p><p>Oh, oh yeah, he was definitely attracted to her. The breath went out of her lungs and her mouth felt dry. Every inch of his body pressed against hers, and she could feel his erection, long and thick against her belly. Electricity hummed over her entire body.</p><p>“I’m...I’m starting to get the picture,” she said. “It’s a pretty big picture.”</p><p>Any other day, Chase might have laughed, but not now. He was furious and there was more, but she wasn’t afraid. Fear and Chase’s name were two things that would never go together.</p><p>She tried to swallow, to take a breath, but her eyes met his, and there was nothing but aching intensity in his gaze. And she was drawn in, swept away.</p><p>Maybe she really didn’t have a freaking clue.</p><p>Chase’s warm hand slid up her bare arm, to the edge of the tiny strap on her tank top. A wave of small bumps followed his touch, and when his fingers edged under that fragile slip of material, her legs would’ve cut out from under her if he hadn’t been pressed so tightly against her body.</p><p>He dipped his head, placing his mouth to the space below her ear. He nipped her there, just a tiny bite that sent a wave of heat through her veins. And then his lips moved lower, leaving a hot trail behind. “You drive me insane, absolutely freaking insane. Do you know that? I bet you do.”</p><p>Hushing the voice in the back of her head that screamed and ranted a thousand warnings, she gripped his shoulders as her head fell back against the wall, giving him all the access he wanted.</p><p>And he did want.</p><p>Those firm lips of his travelled back up her throat to pause above her own. Her chest rose sharply, and his other hand fell to her hip, fingers digging into the denim as he held her in place.</p><p>Their eyes locked.</p><p>“We shouldn’t be doing this,” he growled, and then he kissed her deeply, stealing her breath as he pulled back, nipping at her lower lip. “Not because I find you unattractive.” His pelvis thrust against hers as if to drive his point home. “And not because I don’t think you’re good enough. You’re too good, Maddie, too damn good, and that’s the problem.”</p><p>Madison didn’t know what he meant by that, and she couldn’t breathe as his thick thigh pushed her legs apart and she gasped as the rough material met her bare, sensitive skin. Finding out why they weren’t supposed to be doing exactly what they were doing took second seat to the ache in her core and the wild rush of feelings she’d harbored for this man for years.</p><p>“God,” Chase groaned as his hips pressed forward. “We’re really going to have to do something about the not-wearing-panties thing, Maddie. Seriously.”</p><p>She closed her eyes and arched her back as her hips swiveled, the friction from his thigh and her own eagerness igniting a fire deep inside her. When she spoke, her voice was breathy and unrecognizable. “Do what?”</p><p>Both of his hands grasped her hips as he lifted her onto his thigh more fully, and she could feel him burning through the thin cotton of her shirt.</p><p>“This is crazy,” he said, which wasn’t much of an answer. Not that she cared.</p><p>His eyes were on fire as he pulled her up against him and kissed her so deeply she felt like he was devouring the very taste of her.</p><p>She looped her arms around his neck, her fingers digging into the soft hair at the nape of his neck. Her body moved against his, and all she could hope for, all she wanted, was for him to not stop. To never stop.</p><p>For him to prove what his body was saying meant more than his words.</p><p>Discarded trash? Those words rang in his ears like a drum. His father had left his mom behind like that—something to rot away in their million-dollar home, surrounded by jewels, furs, pool boys, and everything the woman could want except the one thing she needed—her husband’s love and fidelity. Maddie would never, could never be discarded trash.</p><p>Chase sucked in a ragged breath a second before she fastened his mouth to hers. This was insane, but his control had snapped somewhere between her accusing him of not being attracted to her and her fiery show of temper.</p><p>He couldn’t stop now, knew that he didn’t want to, not when she was so warm and eager against him. His sex surged even harder as her hips rocked and she made those breathy sounds against his lips.</p><p>His hand trailed to her breast, felt the pebbling of her nipple, and all gentlemanly whims went right out the damn cellar along with his common sense. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chase could feel her body tremble as he kissed her, as his hand glided to the smooth, soft skin of her thigh. Even though he was hard as granite in his jeans, he struggled to stop this catastrophe from happening. Because in the end, could he really have her? She was so far above him, and she didn’t even see it.</p><p>But it was like he didn’t have control of his hands. His finger nudged under the straps of her tank top, lowering them down her arms, baring the soft swells to the cold air and his hungry gaze.</p><p>“God, you’re beautiful.” He cupped her breast, losing a little more of himself in her softness as his thumb brushed over the hardened peak. “So perfect...”</p><p>Her breathy moan of denial shattered him as his hand traveling farther south, beyond the flare of her hip.</p> <p>Then her back arched, the skirt sliding farther up her thighs. “Please, Chase, please.”</p><p>How was he supposed to deny her? How could he ever?</p><p>His head dipped to one rosy tip, his tongue flicked out, and he drew her into his mouth. Her skin was too tempting to resist. The taste of her...blew his mind.</p><p>Chase’s hand teased under her skirt, along the curve of her taut ass, to the moist, slick petals of her sex. He drew his finger along her core, and she felt like satin. He was in awe, enthralled and captured by her. Honestly nothing new, but...</p><p>Christ, she was soft and yielding in his arms, and so very damn perfect.</p> <p>And he wanted her, all of her—</p><p>Footsteps on the other side of the door knocked him out of this fantasy like being blasted with a nuclear weapon.</p><p>Jerking back, he caught Maddie before she tumbled down the stairs. She stared up at him, the look on her face so shell-shocked and demanding that he wanted to bar the damn door shut and do this, keep doing this.</p><p>In a miraculous feat, he readjusted her clothing seconds before the door swung open. Spinning on the step, he used his body to block hers, giving her time to regain her composure.</p><p>The tour guide stood there, holding a key. Behind him, Chandler arched a knowing brow. Great.</p><p>“Ah,” Chandler said, “there you are. I’m guessing the little shadow behind you is Madison? We’ve been looking everywhere for you two.”</p> <p>“Well, we’ve been here the whole time. Locked in.” He said it with emphasis and glanced over his shoulder, finding a wide-eyed and flushed face staring back. Steeling himself, he faced his brother’s mocking stare. “Took long enough.”</p><p>Chandler snickered. “For some reason, I have the exact opposite impression.”</p><p>Chase ignored his brother’s snide comment. He was more concerned with how in the hell he was going to keep his hands off Maddie now.</p><p>Chapter Six</p><p>What the hell just happened? Madison was lost. One moment they were arguing and the next, they were kissing and doing way, way more than that. Really hot stuff that had strung her tight as a bow, so close to shattering, and then...</p><p>Then Chase’s brother showed up. Awkward wasn’t even the word for that.</p><p>She was still in a daze when they were ushered to the hillside where the picnic had been set up. Chase had returned to stoic silence while his older brother had a smirk affixed to his handsome face the entire way back, and Madison... She honestly didn’t know what to do.</p><p>She felt like a bipolar zombie—a horny bipolar zombie.</p> <p>Her mom rushed up and squeezed the daylights out of her the moment she was spotted. Madison almost took a hat to the eye. “We were so worried, honey! I thought you fell off the truck or something!”</p><p>Squeezing her mom back, she reassured her. “I’m fine. Just got locked in the wine cellar.”</p><p>“Oh, that’s terrible!”</p><p>Her father frowned. “Actually, in the event of nuclear fallout, the wine cellar may be the best place.”</p><p>“Da-ad.” Madison groaned.</p><p>Mitch grinned from his seat next to Lissa. “At least you had Chase to keep you company. Couldn’t have been that bad and hey, you didn’t kill each other.”</p><p>Madison stiffened.</p><p>Strolling past her, Chandler glanced over his shoulder and winked before adding, “Which makes one wonder what they did do to each other.”</p><p>Tugging down her hair to hide her flaming cheeks, she shrugged and settled on a blanket, busying herself with what was left of the food. Right now, surrounded by family and friends, she couldn’t even begin to analyze what had happened, but she couldn’t stop herself from checking out how Chase was hanging in there.</p><p>He was over with his brothers, his long legs stretched out in front of him, smiling now like he hadn’t a freaking care in the world.</p><p>Okay. So this could be good. At least he wasn’t brooding and coming up with an apology. Her heart flip-flopped. If he wasn’t coming up with an apology, what did that mean? That he didn’t regret what happened? That maybe there could be some sort of future? That maybe she was jumping way ahead of herself? But it was hard not to when she’d loved him for so long.</p><p>God, she sounded like a thirteen-year-old. “FML,” she muttered.</p><p>“What, honey?” her mom questioned.</p><p>“Nothing—nothing at all.”</p><p>After the picnic, the rest of the tour set into motion. Thankfully, she wasn’t left behind again... Or maybe not thankfully, she thought as she glanced over at Chase for the hundredth time.</p><p>When everyone departed from the truck and headed back to their cabins to rest up before the formal dinner that evening, Madison headed toward the main lodge to knock out the wedding programs. Hopefully the mindless task would get her brain back on track. And it was probably a good idea she wasn’t going back to the cabin. Being alone with Chase again so soon would likely end in disaster. She already had a mad case of nerves, having no idea how he was going to act or how she should behave. Would they argue? Would they act like nothing happened? Or would they pick up where they left off?</p><p>Door number three, please.</p><p>Before Madison made it to the steps leading to the sprawling porch, her mother wrapped an arm around her waist. “Honey, are you feeling okay?”</p><p>As frazzled as she was, the truth was bursting to come out. Well, at least a half-truth. They were far enough away from the rest of the group for some privacy, but she kept her voice low. “I really don’t know, Mom.”</p><p>Her mom took off her hat and smoothed her hands over the wispy dark hairs sticking out haphazardly. “Is it the wedding? Work?”</p><p>“No.” Madison laughed. “I’m happy for Mitch and Lissa. It’s not that at all. And work is perfect.”</p><p>“Then what is it?” She clasped Madison’s hand. “You haven’t been yourself since you arrived.”</p><p>She wanted so badly to confide in someone, but what could she tell her mother? She’d die before she admitted what had happened in the wine cellar.</p><p>“It’s really nothing.” She smiled and then her stomach dropped as she caught a glimpse of Chase stretching. In the afternoon sun, he looked amazing. His shirt rode up, revealing the dip and roll of his abs. She had to tear her greedy gaze away.</p><p>Her mom may say and think some crazy stuff at times, but man was she observant. “Yes, I see.”</p><p>“You see what?” Madison frowned.</p><p>Her mom chuckled softly. “Chase—it’s always Chase.”</p><p>As offensive as the statement was, there wasn’t anything Madison could say. Too nervous—too anxious—about what had happened, what might happen between them, she kept her lips glued shut.</p><p>“You two have played cat and mouse for far too long,” her mother said softly.</p><p>More like they played cat and cat. Madison shook her head in denial.</p><p>“Honey, I know your heart has always belonged to that Gamble boy, from the moment you started seeing him as something other than Mitch’s friend—which I think was when you turned ten.” Mrs. Daniels glanced over to where he stood with the guys. She tilted her head to the side. “But he’s always seen his father in himself. Poor boy has no idea that he’s nothing like that jackass.”</p><p>“Mom!”</p><p>“What?” She laughed. “That man was a horrible father and worse husband. What that boy needs—what all the Gamble boys need—is a good woman to show them they’re worth loving.”</p><p>Madison opened her mouth to change the subject, but something else entirely came out. “He’ll never see himself as anything different, and he’ll never see me as anything other than Mitch’s sister.”</p><p>“No, my dear, he already sees you as something other than Mitch’s sister. He just doesn’t realize it yet.”</p><p>Her mother’s words lingered long after Madison settled into the small room in the back of the main lodge, seated on the floor, legs tucked under her. Two heavy boxes sat in front of her. One full of programs and another stocked with little cards and holders.</p><p>Maybe she should’ve asked for help... She was going to be here all night.</p><p>Glancing at the deer head mounted on the wall, she shuddered. Sighing, she reached for the programs and began tri-folding them.</p><p>He just doesn’t realize it yet.</p><p>Could that seriously be the only thing holding him back after all these years? He wanted her, cared for her, but hadn’t come to accept it all yet? There was no way she believed that. And she also didn’t think it was his father’s influence. Either you wanted someone or you didn’t. In her mind, there was no in between.</p><p>She’d considered calling Bridget, but her friend would just rant and rave over how idiotic Madison was being, which she probably deserved. Doing the non-platonic thing with Chase was stupid. But damn it, she had no willpower when it came to him.</p><p>There was a neat stack of ten folded programs by the time someone knocked on the closed door. A second later, it swung open, and Chase stood in the doorway. “Hey.”</p><p>Shocked to find the object of her angst standing in front of her, all she could do was stare and remember how freaking wonderful he’d felt pressed against her. “Hey?”</p><p>Running a hand through his dark hair, he squinted. “Your mother thought you could use some help.”</p><p>Damn that meddlesome woman.</p><p>Taking a deep breath, she plotted about a thousand ways to stitch her mom’s mouth shut. “It’s okay. I got this. I’m sure there are other things you’d rather be doing.”</p><p>He raised one brow suggestively and she blushed. And now she was thinking there were things she’d rather be doing, too. Damn him.</p><p>He motioned at the full boxes. “From up here, it looks like you need help.”</p><p>She shrugged as she folded a program, ducking her head and letting her hair shift forward and cover her flaming red face.</p><p>Inching into the room, he nudged the door shut. “At the rate you’re going, you’ll be here until the wedding.”</p><p>“Hardy-har-har.” She watched him sit down on the other side of the boxes. “Chase, I appreciate this...but you don’t have to.”</p><p>He shrugged and grabbed a program. A frown creased his forehead. “What the hell?” Turning over the stark white paper with crimson lettering, he shook his head. “This layout makes no sense.”</p><p>Laughing softly, she set hers aside and leaned forward. “See these faint dots?” When he nodded, she sat back and picked up her own. “You have to fold them at the dots, going in a different way, like a pamphlet. See?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It took Chase a couple of tries before he got the edges to line up perfectly. As she watched his nimble fingers slide along the crease of the second program, her cheeks heated.</p><p>He looked up, fingers pausing. “So now that I’m here, you’re just going to sit there and...stare at me?”</p><p>Madison blinked and snatched another program. “I’m not staring at you.”</p><p>“Sure.” He drew the word out.</p> <p>“Certain you don’t have something better to do?” Dividing the programs into halves, she again wanted to strangle her mom.</p><p>“Better than annoying you? There’s no such thing.”</p><p>Madison tried to ignore the teasing tone to his words, but it was hard. A small grin broke free and after a couple of moments, they fell into an easy, companionable silence as they worked on the programs.</p><p>The quiet was broken by Chase’s low chuckle, drawing her attention. “What?” she asked, wondering what she had done now.</p><p>“It’s just strange seeing you do this. Crafts aren’t your thing.”</p> <p>Relaxing, she steadied the growing pile between them. “You never struck me as a craft guy, either.”</p><p>He laughed again. “I have no idea what I’m doing.”</p><p>“You’re making sure that Mitch and Lissa’s wedding goes off without any problems.”</p><p>“And helping you.”</p><p>Madison smiled at that. “And helping me. By the way, I’m really grateful you are helping, because this would’ve taken me forever.” Pausing, she placed another on the stack and reached for one more. “But I’m sorry my mom conned you into doing this.”</p><p>Chase’s fingers stilled over the program, and his gaze met hers. It was crazy. Dressed down in worn blue jeans and a black shirt, he was the most beautiful man she’d ever seen. And the moment was sort of perfect.</p> <p>Even with the deer head staring over his shoulder like a total creeper.</p><p>His gaze moved to the program in his hands. “Your mom did mention you were doing this now.”</p><p>His sentence seemed loaded, like she was missing the punch line or something. Tilting her head to the side, she waited. “Okay?”</p><p>“But she didn’t ask me.” The tips of his cheekbones flushed. “I figured you could use the help.”</p><p>Her mouth opened but nothing came out. Sure, he was just helping her fold programs out of the goodness of his heart, so it wasn’t a ringing declaration of love, but still...</p><p>Chase cleared his throat. “And with all this wine laying around, someone needs to keep an eye on you.”</p><p>Madison laughed. “I’m not a wino.”</p><p>“You were last night.”</p> <p>“Was not!”</p><p>He arched a brow. “You were dancing on a bench with some tool.”</p><p>Shaking her head, she smiled. “His name is Bobby.”</p><p>“I think his name is Rob.”</p><p>“Oh.” She bit down on her lip. “Same difference.”</p><p>He leaned forward, tapping her knee with his knuckles. “And you sat down in the middle of the pathway.”</p><p>She remembered. “I was tired.”</p><p>“And you started talking about how big the moon was.” He sat back, grinning. And suddenly... God, suddenly it was five years ago and everything...everything was normal between them.</p><p>Her chest ached, but in a good way.</p><p>“It was like you’d never seen the moon before. Surprised you still don’t think it’s a ball of cheese in the sky.”</p><p>She threw her folded program at him. “I’m not five, Chase!”</p><p>He picked up the paper. “But you were that tipsy.”</p><p>Giggling at his comment, she grabbed the box of programs and realized it was empty. Scooting over, she reached into the other one and pulled out a dozen place-card holders. Disappointment swelled when she realized they’d be done within an hour.</p><p>Madison also remembered what she’d said to him last night as he held her so tenderly in his arms, which was proof that she hadn’t been that drunk.</p><p>She had admitted that she missed him—missed this. Just being together, teasing each other or sitting in comfortable silence. Back in the day, they could go for hours like this. It was why for the longest time, she believed they were meant to be together.</p><p>Seemed silly now and maybe even a little sad, but she didn’t want this moment to end. Most importantly, she didn’t want to miss him anymore.</p><p>Chase watched her stick the little cards into the holders, wondering what had caused the glimpse of sadness that had flashed across her face. The smile was back now, and she was telling him about the project she was delving into at work. He lo—liked her like this best.</p><p>He could easily see her with someone, just sitting around, shooting the shit, and still being incredibly sexy. Maddie had this ease about her, a natural charm that drew people in. Some guy was going to be a lucky son of a bitch one day.</p><p>The cold slice of air that came out of nowhere and shot down his neck was hard to ignore.</p><p>Pushing those thoughts away, he told her about the couple his manager had caught last weekend in the storage room. “Stefan got an eyeful when he went back to get fresh towels.”</p><p>Madison tipped her head back and laughed. “And this was at Komodo? Don’t they have to go through the employee lounge for that? How did they get back there?”</p><p>“One of the waitresses left the door unlocked.” He grinned as her laugh bubbled up again. “Stefan said they had their iPhones out and were filming the whole thing.”</p><p>“Wow.” She snickered. “Amazing multitasking skills.”</p><p>“Jealous?”</p><p>Her eyes rolled. “Yeah, there’s nothing more romantic than getting it on while someone is shoving a phone camera in your face.”</p><p>An image of Maddie under him, naked and writhing, getting it on with a camera, and then without the camera, flashed in his head.</p><p>Yeah, not romantic, but sexy as hell. It suddenly felt stifling in the small room, and he tugged at his shirt collar.</p><p>Maddie’s brows furrowed. “What are you thinking about?”</p><p>“You don’t even want to know.”</p><p>A sweet, hot flush swept over her cheeks, and she quickly returned her attention to sticking the cards in the holders. It didn’t seem possible, but the swelling between his legs was increasing. Jesus. H. Christ.</p><p>Chase stretched out his legs. Didn’t help. “So...”</p><p>She peeked up. “So what?”</p><p>“So when are we going to be doing this for your wedding?”</p><p>For a long moment, long enough to realize what a crap hole he’d just stepped into, she said nothing as she stared at him. Chase started to laugh it off, but then she spoke.</p><p>“I don’t know if I’ll get married.”</p><p>A real fucked up part of him shouted with glee and that was wrong, because she wasn’t his, she would never be, and he wanted her happy. And Maddie could never be happy alone forever.</p><p>“You’ll get married, Maddie.”</p><p>Flecks of green churned in her eyes. “Don’t patronize me, Chase.”</p><p>Leaning back, he held up his hands. “I’m not patronizing you. I’m just being realistic.”</p><p>She whipped a holder out of the box and slammed the card into the poor thing. “Can you read the future? No. I didn’t think so.”</p><p>“I don’t know why you’re getting so bent out of shape.” He reached over and swiped the card holder out of her hand before she bent it. “There’s just no way that some guy is not going to fall head over heels in love with you. You’ll have a big wedding like this, a great honeymoon, and have two kids...”</p><p>Damn, those words felt like nails coming back up his throat. And hell, they seemed to piss her off more.</p><p>Rising to her knees, she grabbed the stack of programs and placed them in their box. “I’ll get married when you get married.”</p><p>Chase let out a startled laugh. “Bullshit.”</p><p>She shot him a glare as she started putting the card holders into the box. “What? You’re above love and marriage?”</p><p>“I’m just not that stupid.”</p><p>Her indignant huff was a clear warning. “That’s right. Just sticking your dick wherever you want is good enough for you?”</p><p>Worked for his father... Well, not really. He watched her for a few seconds, then grabbed the box and pulled it away.</p><p>On her knees, she stopped with two card holders in her little fists. Déjà vu swept over him. Except Maddie had been six, and instead of those silver stands, she’d held two massacred Barbies that he and Mitch had cut the heads off of.</p><p>Chase laughed.</p><p>Her eyes flared green. “What’s so funny?”</p><p>“Nothing,” he said, sobering quickly.</p><p>Maddie’s eyes narrowed. “Give me back the box.”</p><p>“No.”</p><p>“Give me back the box, or I will throw these in your face.”</p><p>He doubted she’d do that. Well, he hoped. “What’s your deal? I don’t see why you’re getting so worked up over my saying some guy will fall in love with you.”</p><p>“Do you think it has anything to do with the fact that a couple of hours ago, I was half naked in your arms and we were seconds away from going at it against a wall?” Suddenly, her eyes popped wide and cheeks flushed. “Forget it—forget I even brought it up.”</p><p>Something in his chest swelled, because even with his thick skull, he got why she was angry, but then the feeling deflated, because it didn’t matter. “Aw, hell, Maddie...”</p><p>“I said forget it.” She stood and relatively gently placed the last of the card holders in the box. “Thanks for your help.”</p><p>“Damn it.” He placed the box aside and shot to his feet, catching her before she made it to the door. Her eyes dropped to his hand and then flicked back to his face. “What happened between us—”</p><p>“Obviously meant nothing,” she cut in. “You were just looking for a place to stick—”</p><p>“Don’t ever say that,” he growled, now pissed off just as much as she was. “You’re not someone I’d be looking to do that with. Got that?”</p><p>Maddie blinked once and then twice. Wrenching her arm free, she swallowed. “Yeah, I think I got that.”</p><p>Before he could say another word, she stormed out of the room, slamming the door in his face. Minutes went by as he stared at the space where she’d stood. When it finally sunk in why she was pissed with that last line, how she’d probably perceived what he’d said, Chase cursed again.</p><p>Thrusting a hand through his hair, he looked down at the neatly folded wedding programs and then to the door. It was better if she believed he didn’t want her. Maybe even better if she believed he did but just for sex, because if he were with her, he’d break her heart.</p><p>Chapter Seven</p><p>Madison was full of restless energy when she returned to the cabin, relieved to find Chase hadn’t somehow beaten her back. There were still two hours left before dinner, and she needed time to work off the anger and pent-up frustration.</p><p>Things had been going great between them, and then he had to bring up getting married, going as far as to say that she would end up with another man. Didn’t he see how cruel that was after what they’d almost done? After what she’d wanted from him for years? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Eyeing the running shoes in her suitcase, she disregarded them for the massive bathtub. She needed chocolate, too, but she’d have to wait for later for that comfort. Stripping off her clothes, she stormed into the bathroom, resisting the urge to slam the door. What was the point when the only things that would hear her were the damn woodchucks outside?</p><p>And why was she so ticked off? Nothing had changed between them. Sure, they had shared two moments of pure insanity, but things were the way they’d always been. Chase just didn’t want her—not badly enough and not enough to get over whatever reasons he had for not being with her.</p><p>Part of her knew it had something to do with his parents’ relationship and not really her at all. All the Gamble boys seemed a little damaged. Chad was too carefree, not taking a damn thing in life seriously. Chandler only did one-night stands, and Chase...Chase was the playboy. He liked relationships, but he just never allowed them to last beyond his self-imposed three-month marker. Short and sweet, he liked to joke.</p><p>Groaning, she ducked her head under the frothy bubbles overflowing the tub and stayed there until her lungs burned. Bubbles lapped at the edge of the garden tub as she resurfaced, pushing long strands of hair out of her face.</p><p>“Maddie, are you in there?” Chase’s deep voice boomed through the closed bathroom door.</p><p>Her eyes widened as her gaze darted around the bathroom. Had she locked the door? And why in the hell did she leave the towel all the way over there, folded neatly on the shelf above the toilet? She gripped the edge of the tub, wondering if she should pretend to be asleep.</p><p>Like that was a stellar plan.</p><p>And like all stellar plans, it backfired in her face.</p><p>The bathroom door swung open, and Chase’s broad shoulders filled the gap. Her mother would’ve called those shoulders door busters and damn if she wasn’t right.</p><p>Madison squeaked and frantically started moving the bubbles up over her chest. Seconds later she realized how stupid that was, considering he’d seen her goodies only a few hours ago, but hell, she wasn’t holding peep shows.</p><p>“Why did you bust in here?” she demanded, striving to sound calm and unaffected by the fact he was near and she was naked.</p><p>Chase folded his arms. “I called for you, but you didn’t answer.”</p><p>“So the next logical step was to bust into the bathroom?”</p><p>He shrugged. “I was worried you were hurt.”</p><p>“In the bathroom?”</p><p>“With you, anything is possible.” He stared at her, not even attempting to look anywhere else like most guys would. But Chase wasn’t most guys. He was a walking contradiction.</p><p>Her gaze narrowed. “Gee. Thanks.”</p><p>Chase said nothing as he stalked into the bathroom and leaned against the his-and-hers sink.</p><p>Madison’s heart rate skyrocketed into uncharted territories. “Um, can I help you with something?”</p><p>His lashes lowered, and she knew where his gaze went—to the rapidly thinning bubbles—and heat zinged through her veins. “I’m not sure,” he said finally. Then his eyes settled back on her face. “We need to talk.”</p><p>“Right at this very moment?”</p><p>“What’s wrong with right now?”</p><p>Was he daft? “I’m in the bathtub, Chase, in case you haven’t noticed.”</p> <p>“Oh, I’ve noticed.” His voice dropped low, husky, and sexy as hell.</p><p>And her body went right into take-me-now land. God, there needed to be an anti-sex pill or something for when she was around him. She eyed the towel across the room and sighed. “Can it wait until I’m done?” They had a few hours left before dinner, so time wasn’t an issue. Being in the bathtub was, however.</p><p>“I’ve seen you naked before, Maddie.”</p><p>Her mouth dropped open. “You have not seen me completely naked, thank you very much.”</p><p>His eyes glittered. “Actually, once before I have, when you were like five. You ran through the house buck-ass naked when you had chicken pox.”</p><p>“Oh, dear God, why do you remember these things?” She was going to drown herself, right here in the tub.</p><p>A half smile appeared. “It was kind of traumatizing.”</p><p>“Yeah, well, this is traumatizing, so we’re even.” Since it appeared he wasn’t leaving, she scooped more bubbles over her breasts. “Okay. What do we need to talk about?”</p><p>“You. Me. What’s been going on between us.” He said it so matter-of-factly she thought she’d misheard him at first.</p><p>But she hadn’t.</p><p>She sunk her hands under the water as she stared at him. He seemed transfixed by where her hands had gone. “There’s something going on between us?”</p><p>Chase’s expression was unreadable as he nodded. “First off, I didn’t mean to...insult you about the not...going there thing. That came out the wrong way.”</p><p>Unwanted hope sparked in her chest.</p><p>“Pretending nothing happened between us within the last twenty-four hours is as stupid as pretending nothing happened three years ago. We can’t keep pretending.”</p><p>Madison’s head bobbed.</p><p>“And I think it’s obvious that I’m attracted to you.” His gaze dipped again, and the bubbles were almost gone. Parts of pink flesh peeped through. “That I want you.”</p><p>Her breath stilled as her heart galloped. Okay. Wow. This was so unexpected, she had no idea what to say or do.</p><p>Chase’s eyes were like chips of heated blue ice that melted her as he continued. “You’ve gotten under my skin, and I’ve done everything to ignore it, because caving to it...it isn’t right.”</p><p>She blinked. “Why? Why isn’t it right, Chase?”</p><p>He moved to sit down on the edge of the tub, so close to her, his presence swamped her. “It’s not what you think, Maddie.”</p><p>She had no idea what she thought anymore. “Then tell me.”</p><p>Drawing in a short breath, his gaze moved to where her feet popped out of the water, the nails painted a crimson red. He didn’t answer.</p><p>Unsure if his lack of response was a good thing or not, she lowered her feet under the water. It was growing colder and she was going to be pickled if she stayed much longer.</p><p>He shook his head, that half smile back again. “Wanting what I want from you...it’s never going to work out. You know my history. You know...what I grew up in. And you’re Mitch’s sister. It’s like spitting in his face.”</p><p>Madison blinked. “You’re not your father.”</p><p>Chase said nothing.</p><p>“And...Mitch does trust you, but you’re not disrespecting him. It has nothing to do with him.” Lifting her chin, she met his eyes. “I understand what you’re getting at, but...”</p><p>“But?” His brows rose.</p><p>Madison took a deep breath. “But we’re consenting adults, Chase. We don’t need my brother’s permission. And you’re your own person.”</p><p>“It’s not just about getting his permission.”</p><p>It struck her then that Chase needed someone to believe in him, because his hang up wasn’t Mitch, it wasn’t even her. And suddenly the comment he made earlier about her being too good made sense.</p><p>He honestly thought she was too good for him.</p><p>Her heart squeezed. Couldn’t he see what everyone else saw, that underneath it all, he was a good guy with standards? Could seeing his father mistreat his mom have warped him to this point, where he believed himself incapable of being in a relationship? Even with her, someone who had known him his whole life? Maybe all he needed was a tiny push over that hang up. And that push would have to be from her, and it would have to be drastic.</p><p>Swallowing, she placed her hands on the cool edge of the ceramic tub and pushed herself up. Water ran in rivets down her body. Soapy bubbles slid over her thighs. The air was cool against her warm flesh, and she couldn’t believe she had done it. Stood completely naked in front of Chase, and if he refused her now, gave her any excuse, she would never be able to come back from that rejection.</p><p>Chase’s nostrils flared as he leaned back, his hands clenching in his lap. “Jesus Christ...”</p><p>Feeling exposed, she fought to keep her arms at her sides and let him look his fill. And boy was he ever looking his fill. Everywhere his gaze went, she felt the heated intensity igniting her flesh. Her skin pricked and flamed. Warmth flooded her, pooling in her core.</p><p>“Towel?” she said, voice husky.</p><p>He stared at her so long she began to wonder if he’d lost the ability to speak. And then she saw it—the moment he cracked wide open, and she was thrilled. “No.”</p><p>Her pulse pounded. “No?”</p><p>Chase placed his hands on her hips. The touch of his skin on hers sent chills over her. She let him help her out of the tub, made no sound as he tugged her between the V of his thighs. She waited with her heart in his hands as he leaned forward, pressing a sweet kiss against the flare of her hip.</p><p>Madison’s chest swelled and heat speared her body as his mouth moved up her flat stomach, his tongue dancing around her navel. She grabbed his shoulders as her head tipped back, and his mouth traveled up...and up.</p><p>Her body went weak at the first touch of his mouth on her breast, hot and demanding. His lips were soft yet firm, lingering and coaxing tiny moans from her parted lips. Her body turned to liquid under his skilled touch.</p><p>“Open your legs for me,” he ordered.</p><p>Beyond control of her own body, she obeyed and jerked when she felt the first light touch of his hand between her thighs. Chase’s fingers were feather light, teasing as he worked her into a state where her hips were moving against his hand, back arching, begging for more. And then he gave her more, slipping a finger inside her and then two.</p><p>Panting, she felt her fingers dig through the shirt he wore, into the hard skin of his shoulders as her body rocked. His thumb moved in circles over the bundle of nerves at the juncture of her thighs. Her body coiled deep inside her core, and she felt herself start to splinter, to come apart.</p><p>Chase removed his hand, and before she could cry out in denial, he pressed his lips to the inside of her thigh. Her heart stopped and then doubled up erratically. It had been long, so very long, since something this intimate had been done to her.</p><p>“I want to taste you,” he growled, nuzzling the inside of her thigh. “Tell me you want me to. Please.”</p><p>“Yes,” she moaned, and then nodded, just in case he didn’t get the picture, because if he didn’t, dear God, she was going to drown him in the bathtub. And wouldn’t that be embarrassing to explain to the police and all the family?</p><p>He slid to his knees, and the first touch of his mouth nearly broke her. It was a gentle sweep of his lips, a sweet, chaste kiss that started off as a slow boil and then exploded as he deepened the touch, his tongue slipping the length of her and then inside.</p><p>Chase burrowed into her flesh, sucking, tugging, and licking until her back bowed and she cried out his name. She was on the verge, hanging over the edge and then her release sped through her, pitching her so high, to a place where only white heat and sensations existed. And he kept going, drinking her in as another climax started and broke apart again, her cries hoarse as her body spasmed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When she came back down, Chase had sat on the edge of the tub again and was holding her in his lap, his cheek resting on her shoulder. His hands traced an idle, smooth circle along her lower back, following the curve of her spine.</p><p>Madison didn’t protest when he leaned back, his vibrant blue eyes hooded. Those dimples appeared on his striking face, and she wanted to kiss them. She wanted to do all kinds of things. Starting with repaying him...</p><p>Madison reached down, wanting to feel his length, but he stopped her. “We still need to talk,” he said, his fingers pressing into the flesh of her hips again as he placed her on her feet.</p><p>Talk? She didn’t think she was capable of forming a coherent sentence. Tiny droplets of water sprayed from her soaked hair when she shook her head.</p> <p>Chase chuckled as he rose. Reaching around her, he grabbed the towel and slowly, carefully dried her off before wrapping the oversized material around her breasts.</p><p>“Now,” he said, pressing a kiss to her forehead, “I can concentrate.”</p><p>She stared up at him, doubting how affected he really was when he could engineer her lust like that and not take any pleasure for himself. Stirrings of unease began in her belly, a not-so-pleasant thing to feel after something so mind-blowingly wonderful. “Well, I can’t.”</p><p>Taking her hand, he led her out of the bathroom to the bed. She sat, clutching the edge of the towel, very unsure of everything again. Especially when his emotions were on lockdown, his face blank, but his eyes...</p><p>He stood before her, legs spread in a powerful, dominant stance. “I want you.”</p> <p>You have me, she wanted to say. “I think we’ve established that.”</p><p>His lips curved at the corners. “And you want me.”</p><p>“Another known fact,” she said. A well-known fact, that is, but there was no need for her to point that out. “Where is this conversation going?” Because she wanted to finish it, strip him naked, and finally get him where she’d always wanted him. Oddly, a heart-shaped bed was never in her fantasies, but she was okay with improvising.</p><p>“And I care about you. I really do.” Chase knelt before her, his eyes meeting hers. “There’s only one option.”</p><p>Hope was back again, beating at her insides like a hyper butterfly. Caring about someone didn’t mean loving her, but Chase wasn’t the type of man to proclaim his undying devotion, especially with the daddy issues. But she could work with this. And of course, there was only one option. Cut the crap and be together. Face her brother, admit that they cared for each other, and deal with it. Together, she could prove to him that he was nothing like his dad. That he was worth everything. Then they could finally discover if there really was a fairy-tale ending for them. And of course, lots and lots of sex in the near future.</p><p>“I agree,” she said, fighting a goofy grin that would make her look like she’d been smacked with the idiot branch.</p> <p>“Good. Great.” His shoulders relaxed. “Because this is what we both need.”</p><p>God, did she ever need this—need him.</p><p>Chase smiled. “And once we do it, then...things will be normal again. It’ll be over.”</p><p>She started to nod in agreement, because she was still knee deep in her fantasy coming true, but what he said slowly sank in. Icy dread drifted over her skin. “Come again?”</p><p>“Having sex,” he explained as he rose and leaned forward, placing his palms on either side of her thighs, caging her in. “We do it. Get it over with. Because obviously we can’t go back to things being normal until we do.”</p><p>That horrible chilled feeling seeped through her skin, leaving her numb. “Being normal?”</p><p>“Yeah, like things were before. We can be friends again.” He placed a large hand on her shoulder, and she flinched. Chase frowned. “No harm. No foul.”</p><p>Madison was having a hard time processing what he was saying. How long had she waited to hear him admit that he cared for her, wanted her, and this...this was added onto the end, like a disclaimer of doom?</p> <p>An ache opened up in her chest.</p><p>He cupped the nape of her neck, tilting her head back. He placed a kiss under her chin, the gesture so sweet and gentle tears filled her eyes.</p><p>Because the gesture really meant nothing.</p><p>“Say something, Maddie.” He let go, moving back onto his haunches.</p><p>She wasn’t sure if she could say anything. A lump had formed in her throat, and it was quickly moving up. Her insides felt bruised, and when she spoke, her voice was hoarse. “So...so that’s the magical fix? We have sex to get it out of our systems?”</p><p>“I wouldn’t call it a magical fix,” he said, head cocked to the side. “But it’s something, right?”</p><p>It was something, all right, and no matter how badly she wanted him, it wasn’t enough. And God, did that sting like a bitch? No, it was worse than a sting. It was like being cut wide open.</p><p>“Wow,” she murmured finally, somewhat dumbfounded. “That’s such a romantic proposition, how could I refuse?”</p><p>His lips formed a tight line. “You don’t need to be a smartass about it.”</p><p>She laughed, but it was brittle sound. “How am I supposed to be, Chase?”</p><p>Standing straight, he took a step back and shook his head. “Maddie—”</p><p>“Let me get this straight,” she said, coming to her feet. Her legs shook. Her one free hand trembled as she crossed the distance between them and stopped. “You’re worried about disrespecting Mitch by being with me and you don’t want to treat me like your dad treated your mom, but somehow, in your head, sleeping with me to get it out of your system is less offensive?”</p><p>Chase opened his mouth, but nothing came out. Maybe he realized his mistake, but it didn’t matter. It was too late.</p><p>Heart breaking into a million stupid little pieces, she smiled tightly. “And even if in some messed-up parallel universe where that would be okay to my brother and you, I wouldn’t ever be okay with that.”</p><p>And then she did something she had never done in her life.</p><p>Madison smacked him across the cheek.</p><p>Chapter Eight</p><p>Well, that hadn’t gone as planned. Not that Chase really had a plan. Over an hour later, his cheek was still stinging like hell and the bathroom door she had slammed shut in his face was still ringing in his ears.</p><p>God, he’d mucked everything up in the worst kind of way.</p><p>As he had sat on the couch, wondering how in the hell he could fix this, he’d heard the water running in the bathroom and knew she wasn’t showering again. Maddie was too proud.</p><p>She’d turned the water on to mask her tears.</p><p>Damn it. The last thing Chase wanted to do was hurt her and damn if he hadn’t. He felt like the worst kind of son of a bitch.</p><p>Finally, she had emerged from the bathroom, eyes puffy but face clear as she stalked past him, dressed in another pretty little dress that matched the green flecks in her eyes, and left the cabin without saying a word, her spine unnaturally stiff.</p><p>He’d tried to stop her, like he’d gone to the bathroom door several times over, but he’d said nothing, because really, what could he say now? How could he fix this? He should’ve just kept his damn mouth shut and let it go.</p><p>By the time he stood from the couch and changed into a pair of dark slacks and a light dress shirt for the formal dinner, he was already running a few minutes late.</p><p>Most everyone had arrived to the dining hall in the main lodge by the time Chase finally trudged in. Mitch and Lissa sat at the head of the table, side by side, holding hands. And then on either side of them were their parents, followed by the... God damn, the bridal party.</p><p>Maddie sat, one leg primly crossed over the other, hands folded in her lap, and spine still straight. The seat beside her was empty.</p><p>The seating was assigned.</p><p>Squaring his shoulders, he headed to his seat, nodding in response to various greetings.</p><p>Maddie didn’t look at him, didn’t say a word.</p><p>He glanced at her from the corner of his eye. Her jaw was tight, lips pressed into a small line.</p><p>Across from him, Chad stood with a glass of wine in his hand. “Now that we’re all here, it’s time for a toast.”</p><p>“And hopefully something to eat,” Mitch said, grinning. Lissa playfully smacked his arm, and he laughed. “Go ahead, Chad.”</p><p>Chad cleared his throat melodramatically. Half the table was leaning forward, dying to hear what he was actually going to say. One never knew with him.</p><p>“I think we can all agree that no one is surprised to be here,” he started out, raising his glass high in the air. “From the moment Mitch and Lissa met, we knew he was whipped.”</p><p>Laughter followed, and at the head of the table, Mitch shrugged, accepting what was true. Even though the two had started off as friends, it had been obvious that Mitch had the hots for the pretty blonde.</p><p>Chase’s gaze met his eldest brother’s. Chandler quirked an eyebrow and then glanced at Maddie.</p><p>“Most of us were taking bets to see how long he went before asking her out.” Chad grinned at Lissa’s surprised expression. “Yep, I said a week. Chandler called two weeks, and good ole Chase said a month and a half.”</p><p>Lissa gasped and then grinned. “Mitch asked me out when we’d known each other close to two months.” Her wide smile turned on Chase. “You won.”</p><p>He shrugged as he toyed with the stem of his wineglass. Although a lot of eyes were on him, a lot of smiles, Maddie stared straight ahead.</p><p>“Betting aside,” Chad went on, “we all knew that Lissa and Mitch were the real deal. No two better people could’ve met. So cheers!”</p><p>Glasses rose and a roar of liveliness filled the room. Chase was surprised his brother had relatively behaved himself during the speech. Then it was his turn, and as the best man, he was honor-bound to humiliate his buddy, but like Chad, he kept it simple: short and sweet.</p><p>The food arrived and the dinner progressed as it should, for the most part. Everyone around him was celebrating the union of two people who deserved it, but him? He was thrilled for them, but...</p><p>Chase glanced at Maddie as she spoke to one of the bridesmaids.</p><p>He was an asshole. There was no way around it, and he knew deep down that she was never going to forgive him for his offer. Not that he blamed her. It was tantamount to offering her money for sex. Worse than anything his father did.</p><p>Appetite vanished, he pushed his plate back and tried to listen to what one of his college buds was saying. But he noted that Maddie stayed away from the wine. At least there would be no repeat of her dancing with the dickhead.</p><p>A possessive feeling surged inside him as he recalled the guy putting his hands on her hips, lifting her off the bench. That guy had no right touching her.</p><p>Chase sucked in a sharp breath.</p><p>Hell, he had no right to touch her.</p><p>When dinner was over, the party broke into small groups and he couldn’t help but notice Maddie steered straight toward her brother and family. Pressure built in his chest, like a sudden weight, settling hard.</p><p>Knowing he needed to fix things, but not sure if he could, he felt his mood plummet from bad to shit, which wasn’t improved when Chad sauntered up to him and dropped a heavy arm over his shoulders. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Little brother,” he said. “You’ve got that look on your face.”</p><p>Chase casually shrugged his brother’s arm off but took the beer he offered with his other hand. “What look?”</p><p>“The same look you had before you knocked the crap out of Rick Summers for getting too friendly with Maddie in the car that one night.”</p><p>Chase didn’t like where this conversation was going.</p> <p>“It’s the same look you got when Maddie was a freshman in college and some guy in your econ class said he wanted to tap that ass.”</p><p>The muscle in Chase’s jaw started to tick. Only Chad knew about that. He’d witnessed it. Recalling the little punk and the horseshit he’d been saying pissed him off all over again.</p><p>“And it’s the same look you got on your face last night when she was dancing with that guy,” Chad went on. He smiled when Chase sent him a look. “Yeah, I noticed. And you’ve sat through dinner like someone kicked your puppy into traffic, burned down all three of your bars, then pissed in your face and shoved a fat one up—”</p><p>Chase laughed dryly. “I get what you’re saying.”</p><p>“You didn’t even smile during my toast.”</p> <p>He rolled his eyes.</p><p>“And man,” Chad said after a moment. “What did you do to Maddie? Because she had the same look on her face the entire time.”</p><p>“It has nothing to do with Maddie.” He downed half his beer. “And I don’t want to talk about it.”</p><p>Chad shook his head and ignored Chase’s words. “It’s always her.”</p><p>He went stock still, staring at the bottle of beer. “Is it that obvious?” he asked on a choked breath. He expected Chad to joke with him, but he remained dead silent.</p><p>“Yeah, it’s that obvious,” Chad said finally. “Always has been.”</p> <p>“Great.”</p><p>Chad smiled then. “So what happened?”</p><p>He took another long draft of his beer and then told Chad a brief, not-so-explicit version of what happened. As expected, his brother stared at him like he was the biggest kind of idiot.</p><p>“I can’t believe you made that offer.” Shaking his head, he laughed. “What did you expect? For her to jump right on that?”</p><p>Honestly, looking back, Chase wasn’t sure what the hell he’d expected. Somewhere between the incident in the wine cellar and seeing her in the bathtub, so absurdly sexy surrounded by bubbles, it had been the best thing he could come up with.</p><p>Chase tugged a hand through his hair. “I don’t know what I was thinking.”</p><p>“That’s the problem,” Chad said. “You were thinking too much.”</p><p>Chase scowled. “That makes zero sense.”</p> <p>“You don’t get it. You’re overthinking this whole thing when you should be doing what your heart is telling you.”</p><p>Chase busted into laughter. “Wow, been watching a lot of Oprah reruns?”</p><p>“Shut up,” Chad said, stretching his arms over his head. Chase could tell he was uncomfortable as hell in the dress clothes. While Chase favored the nicer stuff, Chad was comfortable only in jeans.</p><p>His brother flashed a wild grin. “Okay, how about starting to think with what’s between your legs? Either way, the Mitch thing is bullshit. You know he wouldn’t have a problem with you getting serious about Maddie. Unless you’re only interested in hitting it, and hey, I can understand that; she’s a fine piece of—”</p><p>“Finish that sentence and I’ll shove this bottle up your ass,” Chase warned.</p><p>Chad tipped his head back and laughed. “Yeah, so like I expected, it’s not a one-night thing, so I doubt Mitch would have a problem with it.”</p><p>“Let me ask you a question. If we had a sister, how would you feel if one of our friends was snooping around her skirt?”</p><p>“That’s a bad example.” Chad folded his arms, eyes narrowing on one of the pretty bridesmaids. “Our friends suck.”</p><p>Chase snorted.</p><p>His brother fell silent again, another oddity for Chad. Several seconds passed. “Bro, all of us are a little fucked up.”</p><p>“No shit.”</p><p>Chad let out a dry laugh. “What we saw our dad do to our mother was messed up. Father was a dick, dead or alive. But you know what the messed-up thing is? That we’re still letting him screw up our lives for us, and he’s not even around.”</p><p>Part of Chase wanted to deny it, but he couldn’t lie to his brothers. Of all people, they knew. “I’m just like him.”</p><p>“You’re nothing like him,” Chad said heatedly. “But you make yourself like him. I don’t even know why. It’s like some kind of twisted self-fulfilling prophecy.”</p><p>“There’s that Oprah shit again.”</p><p>“Shut up, asshole. I’m being serious.” Chad placed his hand on Chase’s shoulder. “Out of all of us, you’re the best one and don’t even try to deny it. All your life, you’ve wanted Maddie. She’s been the one thing that kept your ass grounded and for whatever reason, you keep pushing her away.”</p><p>This conversation was starting to go into no-man’s-land. Mainly because it was starting to make sense. “Drop it—”</p><p>“I’m not finished. Hear me out, bro. You’re not Father. You would never treat Maddie like he treated Mom. Hell, those women you date? You even treat them better. If anything, they prove you’re not like him.”</p><p>“What kind of effed-up logic is that?”</p><p>Chad shot him a knowing look. “You’re not leading on a single one of them. You haven’t lied to them. You’re not married and flaunting your whores in front of your wife’s face.”</p><p>A sharp pang of fear—of actual fear—hit him in the gut. What if he did do that? He could never forgive himself. “I’m not married. That could be the reason.”</p><p>“You’d never do that to Maddie,” his brother said. “You know why?”</p><p>“I bet you’re going to tell me.”</p><p>Chad took a long swig of his beer, finishing it off. “Because you have something that Father never had—the capacity to love. And you love Maddie too much to do that to her.”</p><p>Chase opened his mouth to deny it, but damn if the words weren’t there.</p><p>His brother started to back away, brows raised. “You aren’t going to taint her, bro. You aren’t going to screw her up. I think the problem here is that you’re not giving anyone credit, especially yourself.”</p><p>Madison had seriously considered camping out on the floor of her parents’ cabin, but the whole second-honeymoon thing just grossed her out. Most of the wedding party was paired up with the exception of Sasha, who was Lissa’s friend from Maryland, but it looked like she’d be entertaining Chad for the evening.</p><p>That left her great aunt Bertha, and yeah, that was so not happening.</p><p>Besides, she told herself as she entered the dark, empty cabin, I’m not a teenager anymore. She wouldn’t run from Chase. It didn’t matter that once again she had held her heart in her hands and he’d taken it, dropped it on the floor, and stomped on it. All she needed to do was make it through tonight and tomorrow, and then for the rest of the weekend, she’d have her own cabin.</p><p>She changed quickly, grabbing the shirt Chase had dressed her in last night. A pang hit her in the chest when she remembered how sweet he’d been.</p><p>Sweet and sexy, and it meant nothing.</p><p>All he wanted was to have sex with her and get it out of his system.</p><p>What a douche.</p><p>Her hands trembled as she reached for the faucets. Sitting next to Chase for most of the night had been a practice in pure torture. Several times she wanted to turn and say something to him—anything. Or take her glass of water and throw it in his face. The latter would’ve made her feel better, at least for a few moments.</p><p>But there was nothing to be said, and after this weekend, she would go back to her life and finally forget about Chase Gamble.</p><p>Washing her face, she tugged her long hair into a ponytail and went to the bed, settling under the covers. Tonight she didn’t feel bad about him ending up on the couch rejected from the sixties. Served him right.</p><p>Madison rolled onto her side, placing her back to the door, and squeezed her eyes shut. Mentally tallying up the e-mails she’d need to answer and phone calls to be made when she returned to work next week, she tried to bore herself into sleep before Chase returned.</p><p>No such luck.</p><p>When the moon was high, its pale light slicing through the wooden shutters, the door creaked open and his footsteps broke the silence.</p><p>“Maddie?”</p><p>Holding her breath, she pretended to be asleep. Way to act like a grown-up.</p><p>The footsteps drew closer and then the bed dipped under his weight as he sat. Silence stretched out, taut and tense as her nerves. What was he doing? She was half afraid to find out.</p><p>Chase’s heavy sigh overshadowed the pounding of her heart. A second later, she felt the very tips of his fingers brush back the strands of hair lying againt her cheek, tucking them behind her ear.</p><p>“I’m sorry,” he whispered, but she heard him. “I’m sorry for everything.”</p><p>Her breath caught, reminding her that she had indeed been breathing. Madison wasn’t sure what his apology should mean. Should it undo everything? Should it just lay between them, a proverbial white flag so there was some hope for a friendship in the future, because there wasn’t a future without him, no matter what?</p><p>And she wasn’t sure who was to blame the most for this catastrophe. Sure, Chase wasn’t innocent, but it was she—and the feelings that she’d brought into this—that complicated everything.</p><p>Madison squeezed her eyes against the rush of tears and clamped her mouth shut.</p><p>Chase hovered for a few more seconds and then the bed shifted as he moved to stand. Unable to stay quiet, to pretend that this wasn’t happening, she rolled onto her back. “Chase?”</p><p>He froze, one hand planted deep in the covers beside her hip. In the darkness, his eyes looked black, his features stark, strangely open and vulnerable.</p><p>She really didn’t know what she was doing. Her body was at war with her heart and thoughts, and ever since she was a child, she’d had terrible, horrific impulse control.</p><p>She reached up, placing her hand on his smooth jaw. Instead of pulling away, he pressed his cheek into her hand and closed his eyes.</p><p>“This has been a wedding to remember, huh?” he said, his cheek rising against her hand as he gave a little smile. “And there hasn’t even been a wedding yet.”</p><p>Then he placed his hand over hers and slowly brought it to his lips. He pressed a kiss to her palm, and her heart flipped over. “I’m sorry, Maddie. I really am. I don’t know what the hell I was thinking to say that to you earlier. Getting it out of my system isn’t what I want.”</p><p>Her fingers curled around his. Confusion swept through her. “I don’t...I don’t understand.”</p><p>He drew in a deep breath. “I don’t even know what I’m thinking. Chad was spouting all this Oprah bullshit and some of it made sense—as insane as that is.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What?”</p><p>Chase smiled a little, and then his eyes met hers. “I want you.”</p><p>Madison’s breath caught. Hope was back, beating at her insides. With Chase, everything was like a roller coaster. Up. Down. Up. Down. “You said that earlier.”</p><p>“And I meant it.”</p><p>So much confusion still churned inside her, but her heart moved on, creating more space for him. The word that left her mouth pretty much sealed her fate. “Stay?”</p><p>Chase hesitated, his body going so still, so tense that she could feel the edginess rolling off of him. Then he sprang into motion, kicking off his shoes as he unbuttoned his shirt. It fluttered to the floor like a white flag.</p><p>Her heart was in her throat as her gaze flickered over the expanse of his well-defined chest, across the dips of his rock-hard abs. He was beautiful, something straight out of her fantasies. In the pale light of the moon, in the shadows of the cabin, she swept aside her reservations and fear. She existed on what she always had—her love for Chase.</p><p>And in an instant, she believed this was the turning point that had been building for years. There’d be no going back. And if she couldn’t prove that he wasn’t like his father, no one could.</p><p>Chase shifted onto his side, facing her with very little space between them. Neither of them said anything as she twisted toward him, their faces and bodies inches apart.</p><p>Slowly, tentatively, Chase placed his hand to her cheek. His fingers trailing along the arch of her face, down to her parted lips. She felt the light touch in every cell of her body and her response was immediate, consuming.</p><p>His fingers drifted down her throat, to the edge of her cotton shirt. A small smile played across his lips. “Do you know that seeing you in my clothes is a huge turn-on?” He edged his fingers under the collar, brushing them across her collarbone, and her toes curled. “I don’t know why that is, but it is.”</p><p>She wondered if he felt the same when she was out of his clothes. Then she remembered the hard length that had pressed against her in the bathroom and she went with a yes.</p><p>“What do we do, Maddie?” he asked, voice deep and husky.</p><p>Madison swallowed, her body joining her heart and already making up her mind for her. Before she even knew what she was doing, her body moved toward his.</p><p>Rising up on her knees, she placed both hands on his shoulders and pushed him until he was flat on his back. She straddled his hips, biting back a moan when she felt his erection straining through the rich material of his trousers, hot against the V of her thighs.</p><p>“Make love to me,” she whispered. “Please.”</p><p>Chase stilled and then his thick lashes lifted, his stare piercing her. He didn’t answer, but he placed his hands on her thighs, sliding them up to the hem of the shirt. His fingers bunched the material. There was a pause, a moment when the only thing moving was her pounding heart, and then he lifted the shirt up.</p><p>And that was her answer.</p><p>By the time the borrowed shirt joined his on the floor, her mouth was on his and his big, warm body was under hers. The kiss wasn’t soft or gentle. It was deep and scorching, a product of years of pent-up desire on both their sides. His lips swallowed her breathy moans as his hand landed on the small of her back and jerked her to his chest. The feel of his skin flush with hers swamped her senses. Chase kissed her like a man starved, possessed by need...need for her. Madison’s hands clutched his shoulders as he staked his claim.</p><p>A hand tangled in her hair. “If we’re going to stop,” he whispered against her swollen lips, “we need to stop now. Do you understand me?”</p><p>She shuddered as his teeth nipped at her bottom lip. “I don’t want to stop. Ever. Do you understand me?”</p><p>He stilled again, and then with a near-feral growl, he moved so quickly that in a heartbeat, she was on her back, open and vulnerable to him, and he hovered above her. Concentration marked his striking features, emphasizing his full lips.</p><p>Then he was on her. His mouth clamping down on the tip of her breast as he hastily worked on the buttons and fly of his trousers. Madison let out a strangled cry as her back bowed off the mattress.</p> <p>Flesh against flesh, she felt him hot and hard against her thigh, and she gripped his arms, placing tiny kisses all over his face and down his throat.</p><p>Chase caught Madison’s chin, held her as his mouth plundered hers again, kissing her until she writhed and thrashed beneath him. He was in control. Part of her wouldn’t have wanted it any other way.</p><p>Some reality snuck back in, and she placed a hand on his chest. “I’m on the pill, but...”</p><p>A wry smile tugged on his lips. “I got it covered.” He was off her, rummaging around in his luggage for a few moments before he returned with a foil package in his hand.</p><p>Madison arched a brow. “Planning to get laid this weekend?”</p><p>“Not really,” he admitted. “But I always have some with me.”</p><p>There wasn’t any time to let jealousy seep in because her gaze dropped and her stomach hollowed as she watched him slide the condom on his thick shaft. Then his lips were on hers and he was guiding her back, stretching out over her.</p><p>Amazed by the power in his body, she ran her hands down his ripped stomach and around his taut hips. His skin was like satin stretched over steel. Perfect.</p><p>The taste of him was on her lips as the kisses slowed, turned tender as she felt him hot at her entrance. Rolling her hips, she moaned at the feel of him there, close but not close enough. She was so ready, had been ready for what felt like an eternity.</p><p>Rising up on his elbows, Chase stared down at her. His eyes were a heated, vibrant sapphire, penetrating and intense as they locked onto hers.</p><p>“Don’t stop,” she whispered. “I want to feel you inside me.”</p><p>“I couldn’t stop now, even if I wanted.” He kissed her, marking her with all the passion and yearning she had felt for so long. “I need this. Damn it, I need you.”</p><p>And then he plunged into her with one deep stroke.</p><p>Madison let out a keening cry at the feel of him stretching and filling her. None of her fantasies, none of the men she had been with in the past, had ever felt like this, because this...this was completion.</p><p>He stilled, seated deep inside her. One hand came up, brushing the damp hair back from her forehead. “You’re so tight...” His voice was guttural, near animalistic. “Are you okay?”</p><p>She nodded and then wrapped her legs around his hips. Chase tipped his head back, groaning, and then she rocked her hips up. The veins in his neck protruded, as they did in his arms. And then he started to move, slow and languid strokes that drove her crazy. The friction of their bodies moving together, the sounds in the otherwise silent cabin, heightened her pleasure.</p><p>Lost... Madison was lost.</p><p>For so long, he held back while she cried out for more, and when he finally gave it to her, she gasped as his hands clamped down on her wrists, holding her still. He thrust hard, her hips surging to meet his.</p><p>Pressure built inside her, zinging through her veins like bottled lightning. It was too much—too intense. Her head kicked back, her body trembling.</p><p>“Come for me,” Chase whispered against her neck. “Let go.”</p><p>And Madison did. She came apart, shattering around him as she called out his name. Two quick, hard thrusts later and she felt him find his release, his huge body spasming over hers as aftershocks racked his body.</p><p>When it was over, he eased out of her and onto his back, gathering her close so that her cheek rested above his pounding heart. Both of them struggled with their breathing.</p><p>She’d never felt anything like that before and knew she’d never feel it again. Heaven.</p><p>Madison closed her eyes. There was a good chance she’d regret this in the harsh light of the morning and after weeks, maybe months from now. But in a few years, she’d be able to look back and know that she’d had him, if only for one night.</p><p>Chapter Nine</p><p>Lazily, Madison stretched and smiled at the pleasant burn in her muscles. Last night... yes, it had probably been the best night of her life. No lie. After Chase had a few moments to recover, he’d flipped her onto her stomach, drew up to her knees and...yeah, like she said, best night of her life. And her body was already warming, readying for him again.</p><p>Last night had to have been a turning point for them. The way he’d...the way he’d made love to her, it meant something deep, irrevocable, and perfect. She just knew it. Somehow they’d burned down those barriers without words. He had to see he was so much better than his father and he had to know that they were meant for this.</p><p>She rolled over and reached for the warmth of his body and found...nothing.</p><p>Her eyes snapped open.</p><p>The spot next to her was empty, but the scent of woods and something wild lingered on the pillow and twisted sheets.</p><p>Madison turned to the couch, but that, too, was empty. A deep sense of foreboding took root, and she scrambled off the bed, clutching a sheet around her. She checked the bathroom, but he wasn’t there, either.</p><p>He’d left without saying anything.</p><p>Her heart turned over painfully.</p><p>Okay. She was being stupid. He could be doing anything. Getting them breakfast or walking outside, enjoying the clean morning air.</p><p>Hurrying over to the window, she parted the blinds, wincing at the bright glare. The deck was empty. As far as she could see, there was no Chase. Turning around, she shivered as her gaze drifted over the bed. He didn’t leave her, not after a night like that. There was no way, because that...that would be like working it out of your system. That would be like getting what you wanted and then bailing, like guys did on one-night stands.</p><p>Last night wasn’t a one-night stand.</p><p>Her gaze travelled to the couch again, then to where her suitcase was near the small closet and then...her eyes darted back to the suitcase.</p><p>Coldness seeped into her bones.</p><p>His luggage was gone.</p><p>Heart pounding, she crossed the room and threw open the closet door. Two of her dresses and her bridesmaid’s dress hung in the closet, but all of Chase’s stuff—his tux, his dress shirts—were gone. As were his shoes, and she knew if she checked the bathroom, his stuff would be gone from there, too.</p><p>Madison stood in front of the closet until she realized she was shaking.</p><p>He’d left her.</p><p>He’d actually left her.</p><p>In a numb, painful daze, she went back to the bed and sat on the edge. Her throat burned and her eyes stung, but she clamped it down, pushed it all down. Minutes turned into an hour and still he didn’t show.</p><p>He really had left her.</p><p>Her brain had a hard time processing it, but the evidence was clear. She was a fool. Last night she had given in to her body and her heart, and it had come back and bit her in the ass.</p><p>Maybe she should’ve listened to him. He’s warned her—had been warning her all along. He said he was like his father, and he’d proven it.</p><p>And he’d demolished her.</p><p>Chase wanted to strangle the clerk by the time the man had handed over the key to one of the new cabins. He had made Chase wait for damn near a half an hour while the cabin was cleaned, which put him seriously behind schedule.</p><p>Taking his stuff to the new cabin, his eyes gazed at the regular king-size bed with satin sheets. Sheets he could easily see Maddie spread naked upon. That made him think of last night and his cock hardened. He was ready for round three...and then round four. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But he needed to shower first. Although he loved the lingering scent of vanilla—of Maddie—the last thing he needed to be doing was running around smelling like he’d just had sex with Mitch’s little sister.</p><p>Last night had been amazing—Maddie had been amazing. And it was more than sex. It was that connection, that whatever-it-was that went beyond an orgasm. It was something more—special. Once in a lifetime kind of shit. None of the women he’d been with had felt like that, and in that moment, he knew none of them would.</p><p>Now he sounded like he’d been watching Oprah reruns.</p><p>But...but it had to mean something. And he was tired of fighting the need to find out what that “something” was. Tired of denying what he really wanted—had wanted for far too long. Maddie was more than Mitch’s little sister. More than the little girl who’d shadowed him for years. She was everything to him. And he was more than his father’s son, too, because he knew deep down he could never hurt Maddie. Not after last night.</p> <p>And now he was just realizing that?</p><p>He’d mucked up things yesterday with that God-awful offer, but last night...</p><p>It had to be a new beginning.</p><p>He took the fastest shower of his life and then headed back to the lodge. There was a tiny florist shop in the back, and he picked up a dozen roses. Tucking them under one arm, he grabbed a slice of cheesecake from the in-house bakery before making his way back to the Love Shack.</p><p>Chase was hoping Maddie was still asleep. He had a real good idea of how to wake her, with his hands, fingers, and then his tongue. Maybe some cheesecake afterward, but knowing her, she’d probably knock him over to get to the good stuff. No one got between Maddie and the sweets.</p> <p>He climbed out of his car stiffly and strolled into the cabin. His gaze went straight to the bed—the empty bed.</p><p>“Maddie?”</p><p>The cabin was unnaturally quiet. No shower was running. Nothing. Putting the roses and slice of cheesecake down on the end table, his gaze danced around the room. “Shit.”</p><p>Maddie was gone. So was her large suitcase. Peering into the bathroom, he found no trace of her. Her blow dryer and curling iron were gone, as if she’d never been there.</p><p>Cursing under his breath again, he spun around and stalked to the front door. He was going to find her, drag her back here... With his hand on the door, he stopped.</p><p>Two problems: He had no idea where Maddie went. She couldn’t have gone far, but she could be in any number of cabins, and short of banging like holy hell on every door, he needed a better game plan. And two, he didn’t know why she’d left. After last night, it seemed pretty obvious what he wanted, so he couldn’t even fathom why she’d leave, especially when he’d already gotten another cabin for them, one not outfitted with a heart-shaped bed and velveteen blankets.</p> <p>Though, he was going to kind of miss that bed.</p><p>Chase drew back from the door, thrusting his hands through his hair. A game plan for what? Chasing after Maddie? Shit. How the tables had turned.</p><p>He spun around, his gaze falling to the rumpled sheets on that damn bed.</p><p>Double shit.</p><p>Scrubbing the palms of his hands down his face, he then snatched the flowers up and left the cheesecake behind. The first place he went by was her parents’ cabin. They were sitting on the deck, enjoying tea while thumbing through a wilderness survival magazine. Chase shook his head as he fought a grin. The two of them looked like a normal couple on the verge of retirement.</p><p>Maddie’s father looked up first, smiling broadly. “Hey, Chase, what are you up to?”</p><p>“Nothing much,” he said, leaning against the railing. “Hello, Mrs. Daniels.”</p><p>She smiled, shaking her head. “Honey, it’s about time you start calling me Megan. And those flowers! Aren’t they lovely?” Her eyes glimmered. “May I ask who they’re for?”</p> <p>“A lovely person,” he replied.</p><p>“Is that so...”</p><p>Mr. Daniels was on his feet, bringing the magazine over to him. “I’m glad you swung by. You can help end a debate between me and the wifey here.”</p><p>A picture of a man in a flannel jacket standing next to a heard of cows was shoved in his face before he could respond. “Organic beef,” Maddie’s father announced. “I’m trying to tell Megan here that even if an apocalypse happens, most people will still want some meat on their plates.”</p><p>So accustomed to these types of questions, Chase took it in good stride. “I’m sure people will still want a steak.”</p><p>“Exactly!” Mr. Daniels agreed. “So I said we should ‘sponsor’ a herd of cattle and put them up for sale. The lovely wife over there thinks it’s a waste of time.”</p><p>“And money,” Mrs. Daniels added, twisting in her seat to face the two men. “I’m pretty sure the last thing people will be thinking about during nuclear fallout is a medium-rare steak.”</p><p>Chase smiled. “Or a zombie apocalypse.”</p><p>Mrs. Daniels threw up her hands. “That’s what I’ve been saying.”</p><p>Her husband huffed. “When the sun doesn’t shine for three years and you’ve run out of mint leaves to eat, you’ll want a steak.”</p><p>She rolled her eyes. “That would be the last of our worries.”</p><p>“Wait.” Chase stepped in. “How would you be keeping the cows alive if the sun isn’t shining?”</p><p>Mr. Daniels straightened. “Underground bunkers large enough to hold organically grown fields. There are bunkers all over the world, bigger than five or so football field lengths. Like Noah’s Ark—”</p><p>“Chase doesn’t care about Noah’s Ark, so before you get started on that, we’re not going to start selling Build-Your-Own-Arks, either.” She smiled at Chase. “You couldn’t imagine the cost of warehousing something like that.”</p><p>“No, ma’am,” Chase said, grinning.</p><p>Mr. Daniels snapped the magazine shut. “This discussion isn’t over.”</p><p>Sighing, his wife shook her head. “Are you looking for Madison, dear?”</p><p>Taken aback, Chase wondered if it was that obvious. “Well, actually, I was.”</p><p>Mr. Daniels returned to the table, smacking the magazine down. “You lose your roommate?”</p><p>“Seems that way,” Chase said.</p><p>“We haven’t seen her, dear, but you might what to check with Lissa.” Mrs. Daniels took a sip of tea. “They’re probably getting things ready for tomorrow.”</p><p>Thanking both of them, he started up the pathway. If Maddie was with Lissa, he didn’t want to bother her, but...</p><p>Chase found himself at the front desk of the lounge. The clerk stared back at him, clearly not wanting to go for round two already. “Was the new cabin you gave me this morning the only one available?” Chase asked.</p><p>Bob inclined his head, as if confused. “No. There were two. Both were readied this morning.” He started pecking away at his computer. “Was the one we assigned this morning unsuitable?”</p><p>He took a deep breath. “No. It’s perfect. What about the other room?”</p><p>“For Miss Daniels?” he asked, smiling fondly. Obviously Maddie had left a much better impression on the clerk than he had. “She stopped by maybe twenty minutes ago and picked up the key for cabin six.”</p><p>Chase stared at the clerk, feeling as if he’d been punched in the stomach. Anger lit off a firestorm inside him. As irrational as it was, he was pissed and offended. She left him after last night?</p><p>Spinning around, he left the clerk without a second glance, tossing the roses in the trash on the way out.</p><p>Madison was in a weird state of mind. Caught between the remnants of absolute bliss she’d experienced last night and the coldness that had lingered deep inside since she’d left the cabin, she wasn’t sure if she should feel happy or sad.</p><p>Mostly sad, she decided as she stuffed little white bells into the boxes being used for wedding keepsakes. At least she’d had a night to experience. No more wondering what it would be like to be with Chase. Now she knew. It was amazing.</p><p>Her heart ached.</p><p>That afternoon she’d almost called Bridget again, but she figured that conversation was best to have in person. No way would she want to miss all of Bridget’s what-the-hell expressions when she described how she basically straddled Chase and he’d bailed on her the next morning.</p><p>Madison glanced up as one of the bridesmaids dumped a truckload of mints in front of them. She snatched one, starving, since she’d been too wired this morning to eat.</p><p>Lissa giggled. “Are they any good?”</p><p>Popping one in her mouth, Madison nodded. “Minty. Very yummy.”</p><p>“Speaking about yummy,” Sasha, a bridesmaid, said. “I think the Gamble brothers’ nickname should be yummy.”</p><p>Cindy, another bridesmaid, snorted as she glanced at the tall, curvy blonde. “Weren’t you all over one of the brothers last night?”</p><p>Sasha smiled secretively. “Maybe...”</p><p>Good to know Madison wasn’t the only one. She dropped a bell into a box.</p><p>“I can never tell them apart.” Cindy grinned.</p><p>“They’re really easy to tell apart,” Madison replied sharply. “They’re not triplets.”</p><p>“Yeah, but the three of them are sex on a stick—dark haired, beautiful blue eyes, and muscles I’d eat chocolate off of,” Cindy said, passing one of the other bridesmaids a wicked look. “Of course, if only I wasn’t married. Anyway, which one was it? Chase? Chad?”</p><p>Madison’s eyes narrowed.</p><p>“Chad,” Sasha answered, her cheeks flushing. “Though, I wouldn’t mind if it had been Chase, too. Hell, all of them at the same time.”</p><p>The bridesmaids laughed, but Lissa cut Madison a worried look. It probably had something to do with the expression on her face. One that said she was mentally going over how many little metal bells she could shove in Sasha’s mouth.</p><p>“Didn’t you grow up with them, Madison?” Sasha continued, oblivious of the death’s door she was knocking on. “Always at your house and stuff? God, I wouldn’t have been able to control myself, but I’m sure it’s different for you.”</p><p>Madison shoved a bell through the bottom of the box. “Why is that?”</p><p>“Well, I’m sure you’re like a little sister to them,” she explained. “I mean, aren’t you rooming with Chase?”</p><p>Crimson swept across her cheeks. Jesus, was that what everyone thought? She had half a mind to go into great detail about just how un-brotherly things were last night with Chase.</p><p>“Actually, I’m not sure if that’s the case,” Lissa said, smiling evenly. “Madison is close to all of them, but from what I’ve seen...” She trailed off, sending Madison a sly look.</p><p>Sasha arched an elegant brow. “Well, then, kudos to you...”</p><p>After that, the girls pretty much kept mum about the Gamble brothers and Madison, although they did hammer Sasha for juicy details.</p><p>Once the boxes were made, the group broke apart to get ready for the rehearsal. Maddie gave Lissa a quick hug and headed back to her new cabin. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She should be happy with her own space, but it was lonely and quiet. And when she took a bath, there was no hope of a surprise visit from Chase.</p><p>Sinking deep into the tub, she closed her eyes and tried to push him away. Except Chase was consuming her thoughts on a whole new level, because now she knew what his passion felt like, how he tasted, how he felt inside her.</p><p>There was no getting that out of her system.</p><p>When she’d woken up this morning, she had been deliciously sore in areas she’d forgotten about and Chase...Chase had been gone.</p> <p>She blew out a long breath and opened her eyes.</p><p>Leaving that gaudy cabin had been one of the hardest things she’d ever done. Part of her was still there, but her decision to leave had been simple. However, the decision she had to make going forward would be the hardest she’d ever made and she knew would shock everyone.</p><p>“Oh, I can’t believe this is happening.” Madison’s mom grabbed Mitch one more time, blinking back tears. Mrs. Daniels had been dealing out hugs the moment the rehearsal dinner began and there was no end in sight. “My little boy is all grown up.”</p><p>Mitch winced. “Mom...”</p><p>She pulled him back to her breast, squeezing and swaying.</p> <p>Smothering a grin, Madison glanced away and her eyes met her father’s. He winked and clamped a hand on her shoulder. “What do you think she’ll do when you get married?”</p><p>Madison blanched. “Yikes.”</p><p>Her mom shot her a dirty look over her shoulder, and then she finally released her son and turned to a beaming Lissa. “I know you’ll treat my boy right, so I’m going to apologize ahead of time for the waterworks that will ensue starting tomorrow.”</p><p>“Tomorrow?” grumbled Mr. Daniels. “How about since he announced his intent to marry?”</p><p>“Shush it,” her mother said, but she grinned.</p><p>Madison tucked a loose strand of hair behind her ear as everyone started to move into groups. They’d go through the bridal march, a rundown of the vows, and then it was off to dinner. Then tomorrow...tomorrow her brother would get married.</p> <p>She went up to him with a watery smile. “I’m so happy for you. You’re going to make a great husband.”</p><p>Mitch pulled her into his arms. “Thanks, sis.”</p><p>“And father,” she teased lightly.</p><p>He let go, eyes wide. “Dear God, don’t say that yet. I want at least a couple of years without a baby Mitch running around.”</p><p>“Or a baby Lissa.”</p><p>“Ah, a girl? I don’t know if I could deal with that.” He shook his head. “It was bad enough fighting off the boys after you.”</p><p>Madison rolled her eyes. “It was nothing like that.”</p><p>“Whatever.” He dropped his arm over her shoulders. “So, when are you going to settle down? Make Mom and Dad’s lives complete?”</p> <p>Before she could answer, in strode the Gamble brothers. Chad and Chandler flanked Chase, who was dressed in a pair of dark trousers and a loose-fitting buttoned shirt. Strands of damp hair curled around his ears. The tips of his cheekbones were slightly flushed and his eyes were a steely blue.</p><p>He looked absolutely stunning.</p><p>Madison hoped her brother didn’t notice how she stiffened, but of course, luck had never really been on her side.</p><p>Mitch chuckled, but she elbowed him in the stomach and escaped before the herd of brothers could descend on them. She made a beeline for Lissa and the other bridesmaids. Avoiding Chase completely would be out of the question, but as long as they didn’t have any real amount of time alone together, she could do this without breaking down.</p><p>Or getting her heart trampled on even more. And there was only one way to do that. It hurt like hell; it killed a little part of her—the one that still believed in fairy-tale endings—but she had no other choice.</p><p>Chapter Ten</p><p>Avoiding Chase had been successful through most of the rehearsal. Up until they lined up for the bridal procession. She hadn’t been alone with him yet, but there was no escaping him now.</p><p>Madison fidgeted with a strand of her hair, desperately going for the unaffected look, but Chase’s presence beside her was like standing next to the sun, too hot not to feel and too powerful not to look upon.</p><p>Staring straight ahead, she pretended to be engrossed in what Sasha was saying to Chad. It had something to do with safe words, and she really wished she hadn’t heard any of that. The funny thing about Chad and Chandler was how she did see them as brothers of sorts. Hearing that kind of stuff made her want to gag, but Chase was different. He’d always been different.</p><p>“We need to talk,” Chase said quietly.</p><p>She feigned innocence. “About what?”</p><p>His brows slammed down, and she knew right then that he saw through her. He knew her too well. “You know exactly what.”</p><p>Madison didn’t really want to get into the why behind the reason he left her this morning, moved out of the cabin before she even opened her eyes. And if he offered an apology for last night, she would hit him. Seriously.</p><p>Crossing her arms, she refocused on the back of Sasha’s platinum hair. “There’s nothing to talk about.”</p><p>“Bullshit.”</p><p>At the sound of Chase’s growl, Sasha glanced over her shoulder, brows arched, but Madison pretended she hadn’t heard anything.</p><p>Chase shifted closer, lowering his head as his fingers cupped her elbow. She jumped at the unexpected jolt that sent heat zinging through her veins. Against her will, her eyes found his, and she caught his smug grin.</p><p>“That’s what I thought,” he said.</p><p>She didn’t move, couldn’t or just plain wouldn’t. “Thought what?”</p><p>When he spoke, his voice was a whisper against her cheek. “You’re pretending like nothing happened, that you’re unaffected, but I know better.”</p><p>Madison bristled and shot him a glare. “Excuse me?”</p><p>“Oh, don’t pretend now. You’ve been hiding from me all day like a little coward—”</p><p>“A coward? God. You—”</p><p>Up ahead, the wedding planner cleared her throat, interrupting what would have been an epic tirade. “All right, we are going to run through the bridal party,” the planner said, voice clipped and as professional as her tight ponytail and crisp pants suit. “At the start of ‘Canon in D,’ the first couple will lead off and I will give a signal to each additional couple.”</p><p>Couple? Madison jerked her arm free.</p><p>Chase smirked.</p><p>The classic instrumental music keyed up, and the first of the procession started forward, arm in arm.</p><p>Madison fixed an icy glare on Chase. “You’re an arrogant ass,” she finished. “I’m not caught up in you as much as you think I am.”</p><p>“Says the girl who smacked me yesterday and then screamed my name as—”</p><p>“Shut up,” she hissed, cheeks flushing,</p><p>Sasha and Chad went next. The bridesmaid was clinging onto Chad’s arm as if she feared he was about to run off. Smart move.</p><p>Chase offered his arm. “M’lady?”</p><p>Rolling her eyes, she debated ignoring him, but that would draw unnecessary and unwanted attention. Several eyes were already on them. So, okay, more attention.</p><p>Begrudgingly, she placed her arm in the crook of his. “We’re not going to talk about last night. It is what it is.”</p><p>He stared. “You make no sense.”</p><p>“And I drive you crazy. I get it.”</p><p>“Miss Daniels and Mr. Gamble,” the planner called.</p><p>Together, they started forward stiffly. It had to be obvious to everyone present that something was going on between them. Chase looked like he wanted to strangle her. and she had the wide-eyed, deer-in-headlights look. When they reached the end of the aisle, they parted ways. Taking her spot beside Sasha, she glanced over at the groomsmen.</p><p>Chase watched her with an intensity that both unnerved and kindled excitement inside her. Betrayed by her heart and now her body, she forced herself to look away. Confusion swept through her like a cold splash of water. Chase didn’t understand her? Well, they were two peas in a pod, then, because he’d made it clear yesterday he’d only been interested in a one-night stand. And he’d gotten it.</p><p>Unease replaced the confusion rising in her like wisps of acrid smoke.</p><p>After Lissa made her entrance, the practice run went smoothly and quickly. Dinner was being set up in the nearest dining hall, and although she was hungry, her stomach roiled. The air became stale in the lodge, and she felt as if she couldn’t get a breath.</p><p>Excusing herself, she hurried out of the reception hall and toward the back of the lodge. On the deck, she dragged in the fresh, sweetly scented air. She placed her hands on the railing and squeezed until her knuckles ached.</p><p>Before the rehearsal, she’d gone to the edge of the property and made a call that had nearly killed her. Her question had been met with shock and a promise to meet up and discuss a few days after she returned home. Hating what she had put into motion, but knowing there was no other option, she blinked back hot tears. It was the first step in the right direction—one that didn’t include Chase Gamble in her future.</p><p>Chase was frustrated, confused, and a whole lot of pissed off as he stared at Maddie’s retreating back. Off and on throughout the years, he and Maddie’d had their spats. Usually over some lame-ass guy she was dating, and after the night in his club, they’d had moments of awkwardness, but this? Never had it been like this.</p><p>His hands opened and closed at his sides. Part of him—a huge part—wanted to go to her, pull her into his arms, and kiss the common sense back into her, but the other part was wary of all of this, of Maddie. He just couldn’t figure it out. What the hell had he done wrong that had her so spitting mad at him?</p><p>Ever since he discovered her gone that morning and settled in to a new cabin, he wanted nothing more than to go to her. What he was going to do with her once he got her he wasn’t sure, but he was off kilter and out of his element in this.</p><p>His heart thundered in his chest as he crossed the distance between them. Propping his hip against the railing, he folded his arms. “Why are you hiding from me?”</p><p>Those beautiful eyes were closed to him, her lips pinched. “Chase, do we...do we really need to do this?”</p><p>“What do you think?” He paused. “This isn’t like you.”</p><p>She drew in a breath and it sounded sharp to him. Her lashes swept up and he saw that her eyes were glassy. There was that punch-to-his-stomach feeling. “I’m sorry for being such a bitch in there, but I haven’t eaten anything all day, and I think I get moody when I’m low on sugar or something.”</p><p>“Maddie, I—”</p><p>“But we do need to talk about what happened last night.” She smiled, but it seemed forced and ugly on her lips. “You were right.”</p><p>For a moment, shock and surprise held him. “I was?”</p><p>“Yes. Last night needed to happen.”</p><p>Okay, maybe this conversation was going to be better than he realized. Chase started to relax, but she went on, and damn if it didn’t feel like the world was pulled right out from under his feet. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“We needed to get this—whatever it is—out of our systems,” she said, her gaze drifting beyond him to where the setting sun cast an orangey glow over the grape trees. “And we did. Things are normal now, right? We’re still friends. And we can move on. That’s what you wanted—what I want.”</p><p>Taken aback, he unfolded his arms slowly. That age-old saying filled his head. Be careful what you wish for... But it wasn’t what he wished for. He had no intentions of getting what he wanted and moving on. Better yet, what the hell was happening? What did she think?</p><p>“What are you guys doing out here?” Mitch called from the door. “Everyone is waiting for you two to start eating, and you know how Dad gets. He’s about to eat the tablecloth.”</p><p>Blinking rapidly, Maddie laughed as she twisted toward her brother. “We were just watching the sunset, but we’re heading in now.”</p> <p>Stunned, Chase watched her walk up to her brother, hugging him tightly before she disappeared back into the lodge. He stood there, incapable of moving or even processing what had just happened. Why was he so shocked? It was what he’d offered—what he’d initially wanted...initially being the key word.</p><p>Fuck. That was all he could think.</p><p>“You doing okay, man?” Mitch asked, striding away from the door. He stopped in front of Chase, eyes narrowed. “You’re not looking too good.”</p><p>Chase blinked. “Yeah, I’m...I’m fine.”</p><p>“You sure?” Mitch’s gaze turned shrewd. “You’re looking a lot like Madison has been.”</p> <p>Chase stiffened. Denials formed on the tip of his tongue but nothing came out.</p><p>Several moments passed and then Mitch cracked a half smile. “Look, I hate seeing you like this. You’ve always been there for me growing up. Remember when Jimmy Decker stole my bike?”</p><p>Chase laughed at the unexpected memory. “Yeah, I do.”</p><p>Mitch grinned. “You stole it back but replaced it with one that had the hand brakes cut. When Jimmy went down the hill...” He trailed off with a laugh. “You’re the kind of friend who would—”</p><p>“Help bury the body, I know.” He laughed. “By the way, that brake cutting was really Chad’s idea.”</p><p>“Doesn’t surprised me, but seriously, man, you’re a good dude. I don’t know what’s really going on between you and my sister—and don’t tell me nothing is, because I have eyes and I know both of you.”</p> <p>Well, damn...</p><p>“And I don’t know what you’re thinking,” Mitch continued. “I’m not sure I want to, but you’re a good guy, Chase. And my sister has always been in love with you.”</p><p>Chase’s gut clenched. My sister has always been in love with you. Right up until a few seconds ago when she explained last night had meant nothing more than scratching an itch. Just like he’d suggested in the first place... He thought of the roses wilting in the trashcan. Fuck. How he’d planned to christen that updated cabin...</p><p>He cleared his throat, surprised to find his voice so hoarse. “Nothing...nothing is going on with us.”</p><p>“Bull,” Mitch said. “I don’t have any problems with you going after her. So if you are waiting on my permission, then you have it as long as you do right by her.” His eyes met Chase’s. “You get what I’m saying?”</p><p>“I do.” Chase’s voice cracked.</p><p>Mitch clasped him on the shoulder. “Now, come on. It’s time to eat, celebrate, be merry, and all that shit.”</p><p>He felt his head nod, but he’d gone numb, completely cold. The irony of everything was a giant F-U. The obstacles that had always held him back from claiming what he wanted were now removed, and it meant nothing.</p> <p>Pain that felt so very real sliced him in the chest. He took a breath, but it felt like he wasn’t breathing at all. His legs were moving, but he wasn’t feeling them.</p><p>Be careful what you wish for...</p><p>He should’ve, because he got it, and it settled in his stomach like a ten-pound weight.</p><p>Chapter Eleven</p><p>Lissa looked absolutely stunning in her wedding gown. Strapless with a heart-shaped bodice, it was corseted around the waist and slim through the hips, and it floated around her legs like a spring rose blossoming. A fine layer of pearls had been added to the delicate chiffon overlay.</p><p>It was a beautiful dress for a beautiful woman, and if Madison ever got married one day, she wanted a dress like this: fresh but also classic.</p><p>Madison straightened the last pearl in Lissa’s hair and smiled. “You look amazing.”</p><p>“Thank you.” Lissa hugged her and then cast a fond look at their mothers. Both of them were clutching tissues like they were going out of style. “Do you think they’ll make it through this?”</p><p>“I hope so.” Madison grinned, stepping back so that Lissa had a few moments with the one of the bridesmaids.</p><p>Retreating to the window in the room off from the reception hall, she watched the guests file up the pathway. Outside, Chad and Chandler hovered with a couple of friends from college.</p><p>Chase was nowhere to be seen.</p><p>Since she had said what needed to be said, he’d kept his distance from her. Which was what she had wanted, but her chest ached, and she was still so very hungry to just be around him.</p><p>When Chase had come in after she’d left him on the deck, he had said nothing to her. Didn’t even try to approach her once, and after the rehearsal dinner, he’d disappeared with his brother. Obviously he had heard what he needed to and now could rest assured. They were still friends. Everything was normal. The night of passion they shared was already a thing of the past. It was over.</p><p>Well, it would be over when she met with her superintendent.</p><p>Shaking herself out of her thoughts, she focused on what was going on around her. Mitch and Lissa deserved for her to be here with them, fully here and not just a shell of herself sulking over her own love life.</p><p>When it came time to prepare for the bridal march, she was nervous for Lissa and her brother, anxious over seeing Chase, and praying she didn’t trip on the hem of her dress.</p><p>Out in the hallway, she spotted his broad shoulders. Taking a deep, fortifying breath, she manned up and went to his side, just like the other bridesmaids with their escorts.</p><p>As the soft melody played from the white-rose-decorated reception hall, she tapped him on his shoulder. He turned, his expression impassive, eyes a steely blue.</p><p>“You ready?” she asked, smiling until her cheeks hurt. She wasn’t going to do anything that ruined this wedding.</p><p>“Of course.” He offered his arm, and as she tried not to be affected by how the coldness in his voice stung her, she wrapped her arm around his. A moment passed and he said, “You look beautiful, Maddie.”</p><p>A pleasant flush swept across her cheeks and down her throat, almost mirroring the crimson Grecian-style dress. Her heart tripped over itself. She glanced at him and their eyes met for a fraction of a second before she tilted her head to the side, letting the stream of hair shield her face.</p><p>“Thank you,” she whispered. “You look great, too.”</p><p>He took the compliment in the usual Chase fashion and nodded. Awkward silence stretched out between them and it seemed unbelievable that it had ever been any other way. To be honest, Madison wasn’t sure why Chase was giving her the cold shoulder. He was the one who wanted their night to be a one-night stand. He was the one who’d left. All she did was try and salvage a bit of her pride and tell him she agreed. What the heck more did he want from her?</p><p>Heart heavy, she lifted her chin as she heard the cue of the music. Before them, each couple entered the hall, smiling. And then it was their turn. From deep inside, she found the happiness and affection she felt for her brother and Lissa. The smile that spread across her face was genuine, even though her heart was breaking inside.</p><p>Because after this weekend, she really wouldn’t see Chase everywhere like before. A door would be opening this weekend for some while a door would be closing for her.</p><p>Each row was full of family and friends. Standing-room only, she realized, overjoyed to know that so many people loved her brother and Lissa. It did wonders for the melancholy that was threatening to rise up and swallow her whole.</p><p>The arm around hers tensed halfway down the aisle, and she glanced at Chase. His gaze was questioning and concerned.</p><p>But her smile remained throughout the romantic ceremony. Her brother was incredibly cute, turning into this clumsy, near–emotional wreck as he held Lissa’s hand and repeated the words that would bind them together, through sickness and health. And when tears filled her eyes, threatening to ruin all the hard work on her mascara and eyeliner, it was because of how truly in love Lissa and her brother were. Her heart swelled and ached at the same time.</p><p>The way they kept gazing at each other throughout the ceremony stole her breath and when it came to that moment, when the words You may now kiss the bride were spoken, she realized that was what true love looked like.</p><p>Clutching the small white rose bouquet in her hands, she sniffed back tears.</p><p>Guests shot to their feet and cheered. Tears fell freely, and Madison choked on a small laugh as Mitch swept his arm around the waist of his new wife, dipped her low, and kissed her in a way a sister should never see her brother kissing.</p><p>As Lissa and Mitch parted, laughing and smiling at each other, Madison’s eyes met Chase’s. There was a world of secrets in his gaze, a world that had and always would be locked to her. She’d had the briefest, sweetest taste, and she would savor it.</p><p>Silverware clinked, nearly muted by the laughter and hum of conversation from the main table and the smaller round ones surrounding it.</p><p>Chase laughed at something Chad said as he scanned the rows of smiling faces. His eyes stopped on one in particular.</p><p>Maddie.</p><p>Damn, she looked absolutely beautiful. The crimson gown accented her alabaster skin and dark hair, not to mention it clung in all the places that had his blood racing to a certain part of his anatomy. Not that it had stopped racing to that place since he’d first laid eyes on Maddie this weekend.</p><p>God, he wanted to take her away, some place private. His fingers burned to skim the heart-shaped neckline. Watch the peaks of her breasts tighten under his gaze, feel the slight tremble as his hand slipped under the gown.</p><p>Chase shifted in his seat as he watched her from behind hooded eyes.</p><p>A small, tight-lipped smile crossed her delicate features and her eyes seemed to dance under the low lights and candlelight, but he knew something was up with her. He just wished he could figure out where it’d all gone wrong. He could have sworn when he’d gotten up that morning they were both finally on the same page.</p><p>Acid gnawed at his belly like no tomorrow. He tried to convince himself that it was an ulcer. Hell, an ulcer would be better than what really had his insides churning and spinning on themselves.</p><p>All night, Chase had tossed and turned like he’d drunk a bucket of coffee. Maddie’s words lingered with him long after they’d been said. He replayed them over and over again, analyzing them like an obsessive teenage girl. That’s what he’d been lowered to. Damn. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chase leaned back in his seat, idly turning the stem of his flute of champagne.</p><p>The way things had been left between them wasn’t good, and it made him all kinds of itchy giving her the space she obviously wanted.</p><p>He felt like shit, unsure if it were something physical or more. Throughout the day, he’d convinced himself that when he returned to the city, there’d be enough going on to distract him. There was the responsibility of running his clubs to lose himself in; the plans to open a fourth, which meant a lot of meetings to occupy his time; and there were women...</p><p>Chase’s stomach soured at the thought, and he didn’t like it.</p> <p>His gaze slid back to where she sat beside her parents. Shit. He needed to stop staring at her like a lovesick hound. Someone was bound to notice. Hell, people had already noticed, including Mitch.</p><p>Against his will and common sense, he was staring at Maddie again, practically willing her to look up and notice him.</p><p>And she did.</p><p>Chase sucked in a breath, barely aware that Mitch had stood and was giving a toast to his new wife. He wasn’t hearing a damn thing except the pulse pounding in his ears. A simple look from her and his body was already coming alive. He was hard as forged steel. Freaking ridiculous. Aw hell, it was more than that—this instantaneous physical reaction that just wouldn’t go away.</p><p>“To us!” Mitch cheered, holding up his champagne glass. “To our future!”</p> <p>Madison raised hers, her gaze still locked with his. Her lips moved, mirroring the same words he murmured, “To our future.”</p><p>Chapter Twelve</p><p>Chase woke up Sunday morning, covered in a cold sweat. Either he was coming down with the plague or he was having withdrawals from the pollution and smog of DC.</p><p>Or it was something entirely different and it had a name.</p><p>Maddie.</p><p>He rolled onto his side, opening his eyes and squinting at the rays of sun seeping in under the blinds. One look at the clock, and he knew he didn’t have a whole lot of time to lie in bed. Mitch and Lissa would be leaving soon for their honeymoon in the Bahamas, and Chase wanted to see them off.</p> <p>There was also a hidden agenda.</p><p>Chase wanted to see Maddie, and he hoped he could corner her before she left for the city. They needed to talk, and with the wedding celebrations over, it would be the perfect time to do so. No distractions. No family or friends lingering around to overhear the conversation. No way for her to escape.</p><p>Kicking off the sheets that were twisted around his hips, he stood and stretched. It had taken until the wee hours of the night, but Chase had finally figured out what had Maddie running scared. She’d claimed she just wanted to be friends now, but he was calling bullshit on that. If that were the case, she wouldn’t have been so offended when he’d suggested hooking up. And she wouldn’t have been his little shadow for the last several years.</p><p>No. She was lying. Lying to protect herself, and he got that. After all, he’d done nothing to show her that he felt any differently than what he’d been saying all these years, that he was no better than his father. If anything, he’d proven she was right time and time again. The first time had been the opening of the nightclub.</p><p>Stepping under the hot spray of the shower, he cursed. Remembering how delectable she looked in her black dress that night, staring at him with those wide, innocent eyes, and he was hard as a rock.</p><p>He had wanted her then, had come so close to taking her right there on the couch in his office. Her brother hadn’t been the only thing that had stopped him. Maddie had deserved better than that. But when he pulled back and came to his senses, he couldn’t believe what he had almost done. So the next day, like a total ass with good intentions, he’d apologized to her and claimed that he’d been drunk.</p><p>Then he’d gone out with every woman who looked nothing like Maddie, just so he could get her out of his head. He’d masked his desire to be near her as something brotherly, when in reality—which he could admit to now—it was a need to be with her.</p><p>Placing his hands on the wet tile of the shower, he tipped his head back and closed his eyes. Deep down he’d always known how much he cared for her, that it went beyond affection and into the realm of the big L-word, but he never accepted it, never dared to even acknowledge it.</p> <p>But now he did, and there was no way he could let her go.</p><p>Showered, changed, and determined as hell, he headed up to the main cabin, not surprised to find his brothers and most of the Daniels family there.</p><p>Mitch and Lissa were busy saying good-bye while fending off smartass comments from Chase’s brothers. His eyes scanned the crowd of waiting people, searching out the face he needed to see most.</p><p>But he didn’t find her.</p><p>Turning to Mr. Daniels, he frowned. “Where’s Maddie?”</p><p>“You just missed her,” he said, looking over his shoulder as Lissa laughed loudly. Mitch had picked her up and was twirling her around. “She said her good-byes and left for the city.”</p><p>Acid boiled in his stomach. There was no way Maddie would’ve left without saying good-bye to him. No way. But she had. Maddie had left.</p><p>She had left him behind.</p><p>Oh, hell no.</p><p>Chase hadn’t wasted a moment after the happy couple departed for the airport. Hopping in his car, he took off after the little witch. It should’ve only taken less than an hour to get into the city, but luck had not been on his side.</p><p>There was an accident on the toll road that delayed him by forty-five minutes. Then two lanes were closed as he neared the beltway, and another damn accident on the bridge. When he finally parked his car in the garage behind the Gallery, he’d killed the engine and all but ran to the entrance. She could run from him, she could hide all she wanted, but she would see the truth. They couldn’t be friends.</p><p>It wasn’t enough. It could never be enough.</p><p>Maddie had one of the smaller apartments on the lower floors, and he was too impatient to wait for the elevator to come down, so he took the stairs, bum-rushing them like a lunatic.</p><p>He didn’t care.</p><p>All he could think was that Maddie had left without saying good-bye. His Maddie would’ve never done that. She would have stayed and screamed at him. Railed at him. Hell, even slapped him in the face. But no way would she have run unless she was scared and not angry.</p><p>Heart pumping, he pushed open the door to the fourth floor, nearly plowing into a young couple with their ankle-biter dog.</p><p>“Sorry,” he muttered, hurrying past them. Reaching Maddie’s door, he stopped and banged on it like he was the police about to rain down hell on someone. “Maddie? It’s Chase.”</p><p>No answer.</p><p>Growing irritated with the minx, he rapped his knuckles on the door, seriously considering kicking it in. He doubted she’d appreciate that.</p><p>Across the hall, a door opened to an apartment Chase knew had been up for lease. The superintendent stepped out, covered in paint-splattered overalls.</p><p>“Is everything okay, Mr. Gamble?” he asked, using a cloth to wipe his hands.</p><p>Only then did he realize he really did look like a madman beating on Maddie’s door. He lowered his hand and cleared his throat. “I was looking for Maddie.”</p><p>The superintendent smiled fondly. “Miss Daniels isn’t home. She’s out with the realtor, checking into some townhomes across the river.”</p><p>Chase’s heart tipped over heavily. “A realtor?”</p><p>He nodded. “Yeah, Miss Daniels called me yesterday, letting me know she was planning on moving. Something about getting out of the city. I hate to hear that she’s leaving, since she’s such a great tenant, but I hooked her up with a realtor we use. Seemed like she wanted to do this fast.”</p><p>None of it made sense. His brain outright refused to believe it. She adored the city and loved the fact that there was next to no commute to work. She would never leave this city. It wasn’t her—unless...</p><p>As he stared at the superintendent, disbelief gave way to a pain so real he was surprised he hadn’t dropped to his knees. The knowledge sunk in slowly, twisting his guts and turning him inside out. She wasn’t just gone. It was more than simply hiding from him.</p><p>She was determined to leave him before he had a chance to really ever have her.</p><p>Madison sat at her desk Monday morning, frowning as she scanned through the hundred e-mails she’d missed while at the vineyard. Nothing too important, but she clicked on the first one and started to methodically read through it.</p><p>Having no idea how much time had passed, she glanced up when Bridget placed a steaming latte on her desk. She smiled. “Thank you. I so need this.”</p><p>“I can tell.” Bridget sat on the edge of Madison’s desk, holding her drink in one hand and fiddling with her pens with the other. No doubt she’d separate them by color. Blue in one holder. Black in the other. “You look like you haven’t slept in a week.”</p><p>Self-consciously smoothing a hand over her low ponytail, she winced. She’d already filled Bridget in on what had happened at the wedding and her plans for the future.</p><p>“I met with a realtor yesterday afternoon and we checked out some townhomes in Virginia.” She paused, hating how hard it was to even say those words. “I was out pretty late.” And she also hadn’t slept well last night. She loved her apartment—she loved the city—but this had to be done. There was no way she could stay this close to Chase anymore, risk running into him out with one of his turnstile girlfriends. It would kill her.</p><p>Bridget shook her head. “I can’t believe you’re moving.”</p><p>She shrugged as she ran her finger over the thin scratch in the desk’s surface. “I think it’s time for a change in scenery.”</p><p>Her friend looked doubtful. “And it has nothing to do with who shares the same apartment building as you? Or the whole tempting the best man?”</p><p>Madison flushed but said nothing.</p><p>“I know it’s hard for you to see him, but Madison...moving away?” Bridget sighed. “I’m not sure that’s the right move to make.”</p><p>She had her doubts, too, but she’d made up her mind. “I need a fresh start, Bridget. And the only way I’m going to get that is by getting away from him as much as I possibly can. If I have to keep seeing him, I’m never going to get over him.”</p><p>A sympathetic look crossed Bridget’s features. “What are you going to do about family functions?”</p><p>“Other than hope he doesn’t show up?” She took a sip of her latte. “Deal with it? I don’t think it will be so bad when I’m not seeing him every freaking day.”</p><p>“Hmm. You know, for some people, distance makes the heart fonder.”</p><p>“Yeah, well, those people need to be hog-tied and shot.” Madison set her drink down on her desk and toyed with her mouse. “It’s a drastic move, I know, but I need to do this.”</p><p>And she did. Like she’d just told Bridget, she’d never fully get over Chase if she had to keep seeing him; hearing about his exploits; and, at times, witnessing them. Moving out of the city would help.</p><p>All in all she didn’t regret what had happened during the wedding. That night was something she’d cherish for a long time, probably for as long as she lived. And maybe one day, she’d find that kind of passion again. Her chest ached at the thought and a hard lump formed in the back of her throat, but she couldn’t force someone to love her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, at least the wedding was beautiful, right?” Bridget said, returning to the desk she shared in Madison’s office.</p><p>Madison nodded. “It was a wedding to remember, for sure.”</p><p>“Sounds like a Hallmark card.” Bridget laughed as Madison went back to thumbing through her e-mails. “You should write that one down. It would make for a corny—oh, holy crap.”</p><p>Looking up, Madison frowned at her friend. “What?”</p> <p>Bridget’s blue eyes were wide. “Uh, take a look for yourself.”</p><p>Confused, Madison followed Bridget’s gaze and her mouth dropped open. “Oh my God...”</p><p>Through the glass walls surrounding her office, there was no mistaking the dark head prowling directly toward her or the broad shoulders squared with intent and determination.</p><p>Chase.</p><p>What was he doing here? Why? There wasn’t any time for her to come up with those answers, because her door flew open and Chase stood there, tall, dark, sinfully sexy, and a whole lot pissed off.</p> <p>Madison started to stand, but her legs were too weak. “Chase, what are you doing here?”</p><p>Fire lit his eyes as they landed on her. “We need to talk.”</p><p>“Uh, right now?” She looked around her office helplessly. “I think it—”</p><p>“It can’t wait,” he all but growled. “We need to talk now.”</p><p>Bridget started to stand. “I think I’ll give you guys some privacy. There are other desks out there I’m sure need organizing.”</p><p>Madison was already on her feet, smoothing her hands down the cotton of her skirt. Over Chase’s shoulder, she could see plenty of her co-workers staring from their cubicles. This was going to get awkward. “No. You don’t have to leave. Um, Chase and I can—”</p> <p>Before she could finish her sentence, he was in front of her. Without saying a word, he clasped her cheeks and brought his mouth to hers. Too stunned to react at first, she froze as his lips pressed, slowly demanding that her mouth open to his. Then her body melted into his embrace, into the kiss that quickly deepened.</p><p>He pulled her against him, lifting her onto the toes of her shoes. He kissed her with all the passion and desperate yearning she had carried with her for so many years. The way his arms trembled against hers reached deep inside, shattering the freshly built walls around her heart.</p><p>When he pulled back, he kept his arms around her. “Why...why did you do that?” she asked.</p><p>A small half grin played across his face. “Sorry. I had to get that out of the way first.”</p><p>“Wow. I need popcorn for this,” Bridget murmured.</p><p>Madison flushed from the roots of her hair to the tips of her curled toes. Somehow, she had forgotten that her friend was still standing there...plus an entire room full of people watching from the outside through the glass walls. Pulling back, she shook her head. “Chase...”</p><p>“Let me explain something first, okay? Before you run off or start arguing with me.”</p><p>“I—”</p> <p>“Maddie,” he said, eyes glittering.</p><p>“You better let the man talk.” Bridget sat back down in her chair, folding her arms. “I cannot wait to hear what he has to say.”</p><p>Madison shot her friend a death glare, but it looked like she wasn’t going anywhere. Neither was he. “Okay,” she said.</p><p>Chase took a long breath. “There’s no way around saying this, other than just coming straight out with it. I’ve been an idiot—an ass. Time and time again, I’ve done the wrong thing by you.”</p><p>Her mouth dropped open.</p><p>“And this whole time I’d been trying to do the right thing by not being with you. I didn’t want to betray Mitch by hooking up with his little sister. I didn’t want to somehow mess up our friendship either, because you have been such a huge part of my life.” He took a deep breath. “And I never wanted to be like my father—to treat you like he treated my mom. And it was stupid—I get that now. Chad was right. Father never loved our mother, but it’s different for me—it’s different for us. It always has been.”</p><p>The whole time he spoke, he never looked away from her. She opened her mouth to say something but he rushed ahead. “But all I’ve managed to do is screw things up. That night in the club...I wasn’t drunk.”</p><p>Madison shifted uncomfortably. “I know.”</p><p>“It was a lame excuse, and I’m sorry. That night—I should’ve told you how I really felt. And every night thereafter,” he said, taking a step forward. “I should’ve told you how I felt the night in that damn cabin, too.”</p><p>Her heart swelled as hope grew in a tangle of emotions she could never unravel. All of this seemed surreal. Tears rushed her eyes as she reached behind her, grasping the edges of her desk. “And how do you feel?”</p><p>Chase’s smile revealed those deep dimples she loved, and when he spoke, his voice was husky. “Aw hell, Maddie, I’m not good at this kind of stuff. You...you are my world. You’ve always been my world, ever since I can remember.”</p><p>At Bridget’s soft inhale, Madison placed a trembling hand over her mouth.</p><p>Stepping forward, he placed a hand over hers, gently pulling it away from her mouth. “It’s the truth. You are my everything. I love you. I have for longer than I realized. Please tell me my boneheadedness hasn’t screwed things up beyond repair for us.”</p><p>Madison didn’t move for a moment, didn’t even breathe as his words tumbled inside her and wrapped their way around her heart, just as his strong fingers were wrapping around hers. And then she sprang forward, planting her lips right on his.</p><p>He kissed her back desperately and passionately, his arms crushing her to his chest. She could feel the hard heat of him, from the tips of her breasts down to the harder, hotter part of him pressed against her belly. She revelled in his arousal, in the passion in which he held her—even though this so was not the place for it—but she did, because this was the moment she’d been waiting for her whole life.</p><p>This was it. The lump was back in her throat. She barely realized Bridget had quietly slipped out of the office.</p><p>“I want you,” he rasped against her lips.</p><p>Her breath caught. “You do?”</p><p>Chase nodded. “There is no one else—there’s never been anyone else for me but you. You’re it, Maddie. And I swear to you, I will never treat you like my father did my mom. Hell, I couldn’t. I’m just not built like that man.”</p><p>Blinking back hot tears, she wrapped her arms around Chase and breathed in the scent of him. “Oh, God, Chase, I love you so much.”</p><p>His laugh was a mixture of relief and joy as he held her tighter, and she could feel his heart thundering against hers. She placed her lips near his ear and whispered, “I think I need to use a sick day, because there’s something I really want to do right now.”</p><p>Chase’s breath left in an unsteady rush. “I couldn’t agree more, but...”</p><p>“But?” Madison pulled back with a frown.</p><p>He grinned at her. “But afterward we’re going to your parents’ house.”</p><p>“We are?” A smile swept across her lips. Giddy, she looped her arms around his neck. “I’m afraid to even ask.”</p><p>Chase’s smile matched hers. “I think we need to break the news to your parents face-to-face, because this...” He kissed her again, his tongue tangling with hers, drawing a breathy moan. And that kiss went on until her toes curled inside her heels and her heart thudded heavily in her chest.</p><p>Kissing Chase—loving Chase—was something she’d never get tired of.</p><p>Pulling back, his mouth formed a smile against hers and he said, “This is forever.” </p> </body></html>"]