["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sergeant Zerbrowski of the Regional Preternatural Investigation Team, RPIT, and his lovely wife Katie held an annual barbecue at their house for all the cops who could come. They timed it for when the worst of the summer heat was past, but it was still shorts and tank top weather. This year was unseasonably cool, so late August was the date. It was the earliest they’d ever been able to do it. The cookout was family friendly, so light drinking at best, and if you wanted to get drunk, Katie Zerbrowski would hand you your head in a verbal basket before she kicked your ass out the door. Since she was a few inches smaller than my own five foot three, and more delicate looking; it was always fun to see her take on a big, tough, drunk cop and win, but I’d stopped going a few years back. Far too many small children, not my favorite thing, and too much family stuff. When I’d been the only single female at the thing the wives had either tried to fix me up, or the single guys had tried to hit on me, or . . . my social skills hadn’t been up to it, but that had been before Micah Callahan and Nathaniel Graison.</p><p>They’d been to dinner at the Zerbrowskis’ house before, both to a cop cookout and a dinner party, but those had been much smaller events. Katie and Zerbrowski had handpicked the guest list for people who would deal better with the fact that I came with two men, and would have married both if it had been legal.</p><p>I hadn’t intended to brave the big event. I wasn’t a fan of crowds, and I didn’t want to have to alienate cops I’d have to work with later by defending my lifestyle to them, but Nathaniel was Facebook friends with Katie, and she’d been mentioning how much work it was finishing up her second master’s degree along with planning for the big party, so my wonderful domestic boyfriend had offered to help, and just like that we were committed.</p><p>Nathaniel had been cooking for days, mostly sides like potato salad, macaroni salad, and coleslaw, which he’d all managed to make with less mayonnaise, or lite mayonnaise, or something that made it healthier but still yummy. He’d also baked a frosted layer cake and a batch of homemade rolls. If it had been left to Micah and me, it would have all been store-bought, and much less healthy, though eyeing the chocolate layer cake, I was wondering what he’d done to it to make it “healthier.” I was really hoping nothing. I liked chocolate cake.</p> <p>I wasn’t the only one. Matthew, who was four, asked from his child safety seat in the back, “When can we have cake?”</p><p>“After meat and veggies,” Nathaniel said automatically from the backseat. We’d been babysitting Matthew a lot in the last two years.</p><p>I was driving, so I could only glance back at Matthew and Nathaniel. He was holding the cake in his lap, because iced cakes and cars are always chancy. This was the first time that any of the other cops’ wives had really treated Nathaniel like another wife, and he was a little nervous about it. It was cute, and so was he. Okay, he was gorgeous, his face model-handsome where it showed around the sunglasses. They hid the lavender eyes, not blue, but the color of spring lilacs. The blue tank top he was wearing would make his eyes lean closer to blue, but they weren’t. I’d never met anyone else with lavender eyes, but they were just the cherry on the too-pretty-to-be-mine cupcake that was Nathaniel, because the tank top also showed off the muscles in his shoulders and arms, a hint of chest. The shirt was a little loose as it fell around his upper body, because a tank that clung to his body would just be unfair to the other men at the party.</p><p>He had his ankle-length auburn hair back in a braid, but I realized that his hair was only a little more red auburn than Matthew’s browner auburn. How had I never noticed it before? Maybe it was that Matthew’s curls had finally grown long enough to trail over the collar of his blue T-shirt, because he’d persuaded his mother, Monica Vespucci, to let him grow his hair out like Uncle Nathaniel and Uncle Jean-Claude and Uncle Micah. Monica was away on a weeklong business conference. She was a successful lawyer, and the widow of one of Jean-Claude’s employees, Robert, who had been a vampire companion of his for over a hundred years. It made him feel responsible for the family. Monica had no family in town, so he felt we should step in to help her with Matthew. It was a noble thought, but since Jean-Claude was the head of the American Vampire Council, he was usually dead to the world when Matthew had to be picked up from preschool, or taken to dance class, he was unable to be on twenty-four-hour availability when Monica had a deposition out of state or a business conference. Since Monica’s deceased husband had been a vampire, too, it made me realize she’d have been almost in the same boat if he’d lived. Funny, the things you don’t think of when you date vampires.</p><p>Micah was beside me in the passenger seat. He’d chosen a green T-shirt that did cling, but he didn’t muscle up the way Nathaniel did, and he was five foot three to Nathaniel’s five foot nine, so a baggy T-shirt would have made him look even smaller and more delicate. His face was a soft triangle with only a little extra length through the jawline that made him look male and not like a beautiful, dainty woman. With the tighter shirt you could see the leanness of his body, the fine muscles that he got through running, lifting weights, and fighting practice. My muscles came from the same things, except I did weapons drills more than he did, but the regimen had put muscle on my delicate girl frame, too. I actually bulked up easier than he did, but I bulked up for a girl, so that between him not bulking much and me bulking more than most women, we could trade T-shirts, and some of our jeans. Though today he was in jean shorts that wouldn’t have been comfy over the curve of my thighs. Nathaniel and I were both in jogging shorts, because they fit over the more generous thighs we both had. Lush was a word you’d use for both of us, where Micah was lean. I’d never dated anyone before who was small enough to share my clothes. I kind of liked it.</p> <p>We both had long curly hair to just past our shoulder blades, his dark chestnut brown that had been blond when he was a child, mine true black and always had been. Nathaniel had braided Micah’s hair, and braided the upper level of mine, so we’d be a little cooler in the heat. It wasn’t the usual August hot, but it still wasn’t as cool as most of the country. We were both wearing sunglasses against the St. Louis summer sun, but my eyes were just a nice solid brown like Matthew’s, except a little darker. Micah’s eyes were green around the pupil with a circle of yellow outside of it; depending on the light, his moods, his shirt color, they could look more yellow, or more green, but they were chartreuse, a mix of both colors, and not human. He was a wereleopard, and his eyes were the leopard eyes of his beast form, because a very bad man had forced him into leopard form for so long that when he came back to human, his eyes didn’t change back. He wore sunglasses most of the time, knowing how unusual his eyes looked, but surprisingly few people realized what they were looking at. They’d just say, “Pretty green eyes.” People see what they expect to see.</p><p>Cops don’t, but then everyone at the party knew that my two boyfriends were wereleopards. They even knew that Micah was head of the Coalition for Better Understanding Between Human and Lycanthrope communities. He’d become the public face for his minority group. Lycanthropy was a disease, but less than twenty years ago it had still been legal to kill someone on sight for having it. In some western states, even today, if you killed a wereanimal and the blood test proved it, it was deemed self-defense regardless of circumstances.</p><p>I was in the actual neighborhood where Zerbrowski lived now, driving past the three different styles of house in the development over and over, just different colors, different accessories, but it was an American suburb, which meant the houses were all vaguely alike. The Zerbrowski house was the one-story ranch style. Theirs had brick siding and a neatly trimmed lawn that was green enough to show they watered it. The shrubs were neat and trimmed low near the foundation with a small flower bed on either side of the sidewalk that led to the front door. The flowers were a brilliant splash of yellow, white, and red.</p><p>The driveway was full, but there was only one car out in front, and I pulled in behind it. Last time I’d been here the entire street had been full of cars; this time we’d arrived early so that Nathaniel could help the other “wives” with the kitchen stuff. Meat would be grilled outside by Mr. Zerbrowski and any other men he let near his grill. The arrangement was all very traditional, but then most cops like traditional roles. Their jobs can be full of such weird shit I think it makes them cling to the normal stuff. I was a U.S. Marshal for the preternatural branch of the service, which meant I was only involved in crimes that had some preternatural element. When I wasn’t serving an active warrant for the Marshal service, my night job was raising zombies for Animators Incorporated. I’d been doing a lot of historical society jobs lately—you know, raise the dead and just ask them what happened at such and such battle on this date.</p><p>All my jobs were weird shit, so I should have been more conservative than the rest of the police, and once I had been, but that had been before Jean-Claude, master vampire of St. Louis, found me, before I’d started considering vampires friends and lovers instead of just evil walking corpses. Now here I was, showing up with two live-in lovers and a child, all without the benefit of a wedding band. Matthew was with us for a week; it was the longest he’d ever stayed with us and he was taking it as normal. One of the reasons we’d brought Matthew rather than leaving him home with one of his other “uncles” was because Nathaniel realized there’d be other kids. Nathaniel had pointed out that Matthew was pretty isolated from other children once he left preschool. Monica was a busy single parent, she didn’t have a lot of time to arrange playdates for him, so we brought Matthew so he could make friends. I knew there’d be some kids around his age, and lots of older and younger ones. It might be the most children Matthew had ever been around except at a dance recital. The thought was a little overwhelming for me, but a good one for the kid.</p><p>Once the car was stopped I undid my seat belt. That was the signal for everyone else to undo theirs. Matthew could undo his own child safety seat, which is what we called it, since he’d objected to “baby seat” as a term.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nathaniel carried the cake. Micah and I divided up the various lite mayonnaise salads, then Matthew said, “What can I carry?”</p><p>Micah and I looked at each other. I don’t know what I would have said, because Nathaniel beat us to it. “The veggie and fruit tray,” he said, pointing at a large round hard plastic tray, covered with a hard plastic lid over all the individual compartments of carrot and celery sticks, little tomatoes, grapes, melon wedges, apple slices, and sweet colored bell peppers. I knew there were different dipping sauces somewhere, but they’d be put out around the tray later; right now the tray was nearly indestructible. Matthew could have rolled it on its side like a wheel into the house and everything would have stayed in place. It was brilliant, though huge, so that Matthew struggled to see over or around it. He looked cuter than normal with the huge tray, blue T-shirt, little jean shorts, and Spider-Man jogging shoes. It didn’t show from the back, but I knew that Spidey’s eyes blinked red from the front. Matthew’s very serious face let me know that telling him how cute he looked would not go over well. I had the same reaction sometimes, so I couldn’t really blame him.</p><p>I was a little distracted from the cute kid stuff by Nathaniel’s braid bobbing down the length of his body as he walked beside and a little ahead of Matthew. With sunlight on both of them, their hair color was even more similar, and I realized that Matthews’s shirt and Nathaniel’s tank top were almost the same shade of blue. I wondered if that had been accidental. Matthew looked up to Nathaniel and copied him sometimes, but my boyfriend also liked having Matthew around a lot. Nathaniel had even started hinting that he wanted a rug rat of our very own. I was okay if the kid wanted to dress like Uncle Natty, but less okay with Nathaniel wanting them to match. It would feel like just one more bit of pressure from my most domestic of partners.</p> <p>“You’re frowning,” Micah said, leaning in so no one else would hear.</p><p>“Sorry, just thinking too hard, I guess.”</p><p>“What about?”</p><p>But Katie Zerbrowski opened the door and we had to hurry to catch up. I’d worry later about Nathaniel trying to punch my biological clock.</p><p>Katie was barely five feet tall, maybe an inch below. She made even Micah and me seem not so delicate, not so tiny. She had long wavy brown hair that was nearly to her waist, and had had it that long since college. Zerbrowski had told me that with a happy smile and a sparkle in his eye. They’d been married for close to twenty years and were still crazy for each other. They gave me hope that maybe, just maybe, love could last.</p> <p>I was three years and counting with Micah and Nathaniel, and six of dating Jean-Claude, but that six had included a hell of a lot of breakups in our togetherness, and then Micah and Nathaniel had come into my life and something about them helped stabilize things. Funny how the right mix of people can change everything, but there was still a part of me that kept waiting for it all to go to hell. At least I’d stopped poking at it and trying to break it myself, that was a step up. Let’s hear it for therapy and smart friends who intervened when I fell back into old destructive habits.</p><p>Katie had put barrettes in her hair that held it neatly behind each ear, showing off the diamond earrings that Zerbrowski had bought her for their last anniversary. Her summer dress was a soft blue, and she looked as beautiful and fresh as the flowers by their door.</p><p>Zerbrowski called out behind her and walked toward us over the new hardwood floor they’d laid this year. The floor gleamed with polish, and looked as fresh and neat as the rest of the living room. Katie matched the airy spaciousness of the room. Zerbrowski was wearing a pair of khaki shorts and a band T-shirt, much loved and faded. Katie tried to dress him neatly during the week for work, but on the weekends their bargain was that he could be comfortable. Her efforts to get him into nice suits and ties was really pretty wasted since he seemed to attract stains and have his freshly pressed shirts wrinkle as if by magic. Zerbrowski was like a more polite grownup version of Pigpen and Charlie Brown all mixed up together, and Katie was the unattainable little redheaded girl, except that this beautiful woman had seen past the wire-framed glasses and messy hair to find the love of her life, of their lives. Like I said, they made me believe in the whole true love thing.</p><p>They kissed each other automatically before Katie led the way toward the kitchen, and Zerbrowski asked, “There anything else that needs carrying in?”</p><p>“Nope, this is it,” I said.</p><p>We all set the food down on the big island in the neat-as-a-pin kitchen, except for Matthew, who had to go up on tiptoe to try and push the veggie tray onto the countertop. I gave it the little nudge it needed, and it was safe.</p> <p>“All the food looks amazing, Nathaniel,” Katie said.</p><p>“Thanks, I appreciated the chance to help out, and I had help.” He put his hands on Matthew’s small shoulders.</p><p>Katie smiled down at the little boy. “Did you help fix all this?”</p><p>He nodded. “Uncle Natty’s teaching me to cook so I’ll be able to help my girlfriend when I grow up.”</p><p>“I like the sound of that; maybe you can tell my son that women like a man who can cook.”</p><p>“I will,” Matthew said.</p><p>Zerbrowski laughed. “Well, thank you, Matthew and Nathaniel, for helping Katie out.”</p><p>“You know, Zerbrowski, you could have helped her cook stuff,” I said.</p> <p>Katie laughed, and it matched the rest of her, airy and pretty, if a laugh could be pretty. “Oh, no, Anita, the only person less likely to be helpful in the kitchen than you is my husband. I swear, if there was a way to do it, he’d burn water.”</p><p>Zerbrowski pushed his glasses more firmly up his nose and grinned at her. “But you love me anyway.”</p><p>“If you hadn’t been a terrible cook we might never have dated,” she said.</p><p>“I don’t cook and it’s never helped me date—how’d it help you?” I asked.</p><p>They looked at each other, faces alight with a shared secret. He made a little gesture at her.</p><p>She said, “We met at college. Anita probably already knows that.”</p><p>I nodded that I did. He’d actually told me he had to get her drunk for her to agree to a date, but I was pretty sure he was kidding, though sometimes it was hard to tell with him.</p><p>Katie continued, “Zerbrowski says he knew who I was, because he used to sit behind me in American History and stare at my hair.”</p><p>“It’s really pretty hair,” he said, and went around the island so he could put his arm across her shoulders.</p><p>“Thank you, dear, but I didn’t know who he was until the night of the fire.”</p><p>“What fire?” I asked.</p><p>She snuggled in against him, tucked under his arm, hers around his waist, and said, “He set his dorm room on fire trying to make soup.”</p><p>I grinned at them. “How bad a fire?”</p><p>“Soup from scratch is hard,” Nathaniel said.</p><p>Zerbrowski shook his head. “Nope, I opened a can of Campbell’s tomato soup and the next thing I knew the fire alarm was going off, there was smoke everywhere, and flames. The dorm monitor was yelling for us all to get out. I grabbed the hall fire extinguisher and put out the fire I could see, but we still had to evacuate the dorm.”</p><p>All the grownups laughed, even Zerbrowski, but Matthew didn’t get the joke. He looked up at us, clearly puzzled. I didn’t try to explain the humor, I’d learned that humor is a skill set like a lot of socialization, and Matthew just had to learn it as he went. Explained jokes lose their funniness.</p><p>Katie said, “I was coming back from a movie with friends, and we went to see what was happening. I saw my future husband for the first time covered in black soot, hair every which way, his dorm monitor screaming at him, and him waving the fire extinguisher back at him.”</p><p>“Love at first sight?” I asked.</p><p>She shook her head. “No, but he was totally calm in the middle of it all. Everyone else was angry, or scared, or just confused, but he wasn’t.” She looked up at him with that shining look she saved just for him.</p><p>“She thought I was brave,” Zerbrowski said.</p><p>“You were and are,” she said.</p><p>He shrugged, but looked pleased. “She recognized my hair and glasses in class the next day, and started talking to me. I’d spent almost an entire semester trying to get the nerve up to talk to her, and she just comes up and does it for me. It was totally worth destroying the dorm’s kitchen and nearly getting expelled.”</p><p>She kissed him again, and then asked, “How did you guys meet?”</p><p>We all looked at each other, because our stories weren’t cute. Nathaniel said, “I was in the hospital after being attacked by someone who wanted to see how much damage a wereanimal could heal. Anita came to visit another mutual friend. The friend introduced us, and I spent a couple of years trying to persuade her to sleep with me.”</p><p>I stared at him, because it was all true, but so sanitized for the Zerbrowskis’ benefit that I wouldn’t have recognized it. The person who had attacked him had been a paying client, because Nathaniel had still been a high-priced and very specialized male escort when we first met. He’d also done a few pornographic movies, which he’d given me as a gift, thinking it was seductive. Sometimes I thought nothing short of deity intervention had gotten Nathaniel and me together, because when you just listed events, it seemed improbable. Yet here we were.</p><p>“Why wouldn’t you date him?” Katie asked.</p><p>“I don’t remember him asking to date me, at first,” I said.</p><p>“I was just aiming at being her lover, I never dreamed she’d date me for real, let alone be my queen.”</p><p>I moved in so I could go up on tiptoe and kiss him, while Matthew held his hand and the Zerbrowskis beamed at us. Happily married people like seeing happy couples.</p><p>“Oh, that’s so sweet, your queen, and are you her king?” Katie asked.</p><p>Nathaniel smiled at me, but said, “No, Micah is our king.” He looked past me to Micah, who was still standing by himself. I didn’t look behind us at my other sweetie; I watched Katie’s face flinch just a little. She was a good sport about it, but she didn’t really understand how I could be in love with more than one person, and there was that whole male/female/male dynamic, too. Zerbrowski just grinned at us all. If he had a problem with us, I didn’t know about it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Micah had noticed Katie’s momentary expression, because he didn’t come closer to us. That wasn’t okay, because if we were going to be here today, it had to be real, no hiding. I reached my free hand out to him, and after a moment’s hesitation he came to me, to us.</p><p>I kissed Micah, and then there was tension in his hand as Nathaniel leaned down for a kiss, too. It wasn’t that they didn’t kiss each other, but in public it didn’t always go over well. Even I tensed up, because I wasn’t sure if Zerbrowski was that secure in his manhood—or Katie either, so to speak.</p><p>“You guys are just cute together,” Zerbrowski said.</p> <p>I gave him the smile that comment and the genuine look of happiness in his face deserved. Katie hugged her husband and smiled at us. “He’s right, you guys are cute. How did you and Micah meet?”</p><p>We told a version of the truth, but it left so much out that I always thought of it as a lie. Micah had already sanitized the story for the press; since he was interviewed a lot by the media as the head of the Coalition for Better Understanding Between Humans and Lycanthropes, the question had come up before.</p><p>“I came into town hoping to find a city that would understand what I was trying to do with the Coalition. Anita was there when I met the other wereleopards, and it was love at first sight for me.”</p><p>I took his hand in mine. “I had to be persuaded that adding another person to my life was a good idea.”</p><p>“Since I’ve never seen you happier, seems like it was,” Zerbrowski said.</p> <p>I nodded and kissed Micah.</p><p>“So you met Nathaniel and Anita at the same time,” Katie said.</p><p>“I actually met Nathaniel first,” Micah said.</p><p>“And was it love at first sight, too?”</p><p>Micah shook his head. “No, I’d never dated a man before, so I didn’t see Nathaniel that way.”</p><p>“He’s your first . . . boyfriend ever?”</p> <p>Micah nodded, smiling, and gave Nathaniel the look that went with the smile, which made them both lean around me and kiss again.</p><p>“You are all adorable together, but be careful with the public displays of affection around some of the other men, and even some of the wives.”</p><p>Zerbrowski frowned at her. “Katie . . .”</p><p>“I’m sorry, but it’s just the truth. You and Anita must both know what could happen if they did that out in the yard.”</p><p>“They’re not in public yet. They’re with friends, with us,” he said.</p><p>I wanted to give Zerbrowski a hug right then, but he was still hugging Katie, and I didn’t want to step farther away from my men in the middle of all this.</p><p>“No, it’s all right; we live in the Bible belt, Mrs. Zerbrowski. We know we have to be careful in public,” Micah said. His voice was neutral as he said it; if he was insulted it didn’t show in his voice, or face. He was good at hiding his emotions when he had to. We’d both learned to hide.</p><p>“It’s our kitchen and just us right now,” Zerbrowski said. “You don’t have to be careful around friends.”</p> <p>Micah glanced at Nathaniel, but it was our shared boyfriend who put his arm across his shoulders, drawing him closer. Micah hesitated, but slid his arm around Nathaniel’s waist and his other arm across my shoulders, so we were politely cuddled. Nathaniel kept holding Matthew’s hand.</p><p>“Oh, don’t call me Mrs. Zerbrowski, Micah, that’s for work, and my mother-in-law. Please, it’s Katie, and my smart husband is right, we’re friends, and it shouldn’t matter when you’re with friends.”</p><p>“I know that not all the police officers coming today are our friends,” I said.</p><p>“Is Uncle Natty the prince?” Matthew asked. He’d been thinking about what he considered important while the adults had worried about things he took for granted.</p><p>“Prince of what?” I asked.</p><p>“Of you, your prince, if you’re queen and Uncle Micah is king, then is Natty the prince?”</p><p>“Well, actually, Anita is Prince Charming, but when she got promoted to queen I got the title,” Nathaniel said.</p><p>Matthew frowned at him. “I don’t understand.”</p><p>“It’s okay, Matthew. Yes, Nathaniel is my prince,” I said.</p><p>My answer seemed to please him, and he let it go. Matthew was teaching me not to overexplain, to explain just enough to make him happy, and not dig the verbal hole deeper. Talking to children is like testifying in court, answer just what’s asked, don’t elaborate, and don’t volunteer information.</p><p>“Nathaniel and I won’t kiss in front of the other guests,” Micah said.</p><p>“Aww,” Nathaniel said, and did an exaggerated pout at us.</p><p>Matthew said, “What’s wrong with kissing?”</p><p>Micah smiled at him. “There’s nothing wrong with kissing.”</p><p>“I don’t understand,” Matthew said.</p><p>“I don’t think we can explain it to you,” I said. I wanted to be upset with Katie, but I knew the cops that would be here today, and my two boyfriends kissing would not go over well. She was right, but I hated that other people’s insecurities and prejudices made it a risk for the men to touch too much in public. Literally, they risked other men screaming in their faces, or even trying to beat them up.</p><p>“We still have a few things to finish up so the food will be ready,” Nathaniel said. “Why don’t you take Matthew outside.”</p><p>Katie smiled at my prince. “That’s a great idea. Besides, Zerbrowski is dying to show off his new grill.”</p><p>“That’s right, he always grills the meat, and he’s never set anything on fire,” I said.</p><p>“Grilling meat is the only thing he can do without needing a fire extinguisher, but let him near the stove, or oven, and it’s terrible,” she said.</p><p>“I grill vegetables just fine,” he said.</p><p>“I’ll give you that,” she said, and went up on tiptoe to kiss him.</p><p>Nathaniel kissed me and then Micah good-bye. Normally he would have kissed Micah more thoroughly, because he might not get another chance for hours, but we’d started doing less of the tonsil-cleaning kisses in front of Matthew—not just between the men, but between me and the men, or anyone and anyone. Why? Because Matthew liked to imitate, and he’d gotten sent home with a note from preschool. We’d been left having to explain that certain kinds of kissing was grownup kissing, and he had to be a grownup to do it. He’d accepted our reasoning and filed it away on the same list as driving a car, drinking liquor, or being able to lift weights. It made perfect sense to him that it was just one more thing he wasn’t old enough to do, yet.</p><p>Matthew hugged Nathaniel bye, and took my hand in his, then reached for Micah’s hand. We followed Zerbrowski as he led the way through the house. Matthew was almost skipping between us, excited about meeting other kids, and playing outside. I wished I was as happy about being here. I glanced across at Micah and he met my eyes, both of us still in sunglasses. I thought we’d keep them on; it’s always harder to keep the hurt feelings, or anger, out of your eyes than the rest of you. We’d known that coming here was going to be a test of sorts, and it had been brave of Zerbrowski and Katie to invite us, but she’d already shown that her nerve wasn’t as strong as his. She was a teacher, and he was a cop. Of course, maybe Katie was just being realistic, and it was the rest of us that were fooling ourselves. When you live in a way that’s too different from everyone else, you get grief about it. Is it fair? No, but it’s still what happens. I wanted to go home.</p><p>Zerbrowski led us out the back door onto the deck with the other early arriving guests. There were a half dozen kids already playing in the yard. Matthew was so excited that he jumped up and down to get rid of some of the energy of it. There was no going home, no disappointing the kid, or even Nathaniel, who was finally in the kitchen with the other domestic partners. For our big boy, and our little one, we were going to smile and smile and have a good time even if it killed us. Strike that, no killing today, though depending on the level of stupid aimed at us, I was willing to look at a little mayhem.</p><p>Matthew asked permission to go play, we nodded, and off he went. He joined the running and laughing children as if he’d known them all his life. I’d half expected some hesitation, or shyness, but nope, the other kids accepted him just as easily.</p><p>Zerbrowski opened his new grill and began to wax eloquent about it. Micah and I stood with our arms around each other, pretending we cared—or I pretended, maybe Micah would actually grill meat if we had a grill.</p><p>I got greetings from the other cops of, “Hey, Blake . . . Anita, good to see you . . .” then they closed around us introducing me to their wives; so far I was the only female cop here. I introduced Micah as my boyfriend, but felt strange not saying that our third was in the house.</p><p>We got a lot of, “My husband, my other half, my guy, Dan, Saul . . . didn’t tell me you had a little boy.”</p><p>It took us almost thirty minutes of conversation to try and explain that Matthew wasn’t ours, but he spent a lot of time with us. Once we said that he was our nephew and we were Uncle Micah and Aunt Anita, they accepted it more easily. I’d originally been adamant that we weren’t Matthew’s uncles and aunt, so he couldn’t call us that, but it made him happy, and it made conversations like this much easier. I was tired of the topic long before the other women were, because they asked more questions than the guys. They were men and they were cops, most of that combination learns early not to ask too many personal questions. Micah helped me find a shorthand to explain, “His mother’s out of town on a business trip, and we’re the only family in town.”</p><p>Then there was more small talk. I met more spouses of fellow officers in the next few minutes than I’d ever met, and because I was the woman they seemed to expect me to be the chatty one. I wasn’t. Both the men with me today were more easily social than I would ever be. Micah did his best to redirect the conversation away from me and to him, but the women just didn’t seem to understand that I was the “husband,” and that our “wife” was actually in the kitchen with Katie. Of course, we didn’t try to explain that part either. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By the time Micah and I managed to find a way to be by ourselves for a few minutes my nerves were raw and I was sort of clinging to him. I’d forgotten how much I hated get-togethers like this; it was just too many people who were work friends at best, work acquaintances, or near strangers. Touching Micah helped, but it had been years since I’d been at a large party where I didn’t have more of my lovers with me, and those parties had also been vampire and wereanimal events, which meant it wasn’t the same kind of socializing, or they were already my friends. I hadn’t realized how much I relied on touching my lovers, having them help out with the small talk, or having someone to huddle in the corner with and hate the social together. Micah was better at it than I was, but he held me tight, too, his hands stroking my back.</p><p>“You okay?” he asked softly.</p><p>“I’d forgotten how bad I am at these things.”</p> <p>He spoke with his face pressed into the line of my neck. “If it’s our people it’s refreshing.”</p><p>“Some of these are friends, but they aren’t our people,” I whispered against his hair.</p><p>Micah raised his head up, body tense with listening. “That’s Matthew.”</p><p>“What’s wrong?” I asked.</p><p>“He’s angry, yelling.”</p> <p>I didn’t ask him how he heard that over the crowd noise. One of the benefits of being a lycanthrope was better hearing, and we’d discovered that the catweres could hear higher noises than the canines. Small children had high-pitched voices.</p><p>We started down the steps of the deck, going for the side yard and the kids, but Zerbrowski called after me. “Can I talk to you a minute?”</p><p>“We were just going to check on Matthew.”</p><p>“I can do it,” Micah said, “you talk cop stuff.”</p><p>“You sure?”</p><p>He came back to the steps and kissed me. “I’m sure.”</p> <p>He started walking through the crowd, leaving me with a stupid grin on my face.</p><p>“Earth to Anita,” Zerbrowski said.</p><p>“Sorry, what’s up?”</p><p>He grinned at me, and shook his head.</p><p>“What?” I asked.</p><p>“You guys are good together, that’s all.”</p><p>“Thanks.”</p><p>The grin faded around the edges. “But I need you to see something in the kitchen.”</p> <p>“Is Nathaniel all right?”</p><p>“Oh, he’s fine; a lot of the other wives think he’s just fine.” He drew the last “fine” out into that ghetto drawl.</p><p>I frowned at him. “What do you mean?”</p><p>“Haven’t you noticed that we’re missing a lot of the wives?”</p><p>I glanced around and it was mostly men, not all, but suddenly a lot. “So the women have gone inside to talk about things other than guns, sports, and police work. Doesn’t it usually end up divided between cops and non-cops?”</p><p>“Not this early in the day. Come see.” He motioned me to follow him, and I did, wondering what was going on.</p><p>The dining room was what you walked into from the back door, so I could see that the table was covered in food, waiting for Katie to give the “come and get it.” But I knew that the traffic jam of women spilling out into the dining room from the kitchen hadn’t helped cook, because if all of them had helped, or were helping, the kitchen wouldn’t have been big enough to hold them all. Usually, people ask if they can help and if told no, they go outside and visit, drink a few cold drinks from the cooler.</p><p>I heard Katie’s voice higher than normal, calling out, “Ladies, thanks for the offer, but Nathaniel and I have all the help we need.”</p><p>Three women turned and started walking away from the kitchen. They were laughing. A tall brunette said, “I’d love to help Nathaniel out.”</p><p>The shorter brunette woman beside her said, “If I wasn’t a married woman I’d help him out, all right.” She laughed half nervously.</p><p>The third woman, a blonde, said, “I’m married, not dead, I may still take a run at him.”</p><p>The short brunette gave her a play slap on the arm. “You wouldn’t cheat on Tom.”</p><p>“For that, I might.” Her voice had dropped to a low purr.</p><p>The tall brunette saw us standing there, and touched the other woman’s arm. They looked at us a little startled, probably wondering if we’d heard them.</p><p>“Hello, ladies, I’m just checking in with Katie and Anita wanted to check in with Nathaniel. See how our better halves are getting on with the food,” Zerbrowski said.</p><p>By him including his wife and Nathaniel together he made it clear that it was on equal par, wife and . . . partner. The women got it, because they suddenly looked uncomfortable. The blonde decided to tough it out, sticking her chin out definitely, “Nathaniel belong to you?”</p><p>“You make him sound like a puppy, but if you mean is he my boyfriend, yeah, he belongs to me.”</p><p>“Lucky you,” she said.</p><p>“Yeah, I’m a lucky girl,” I said, and fought not to have my eyes go hostile. Her attitude had already gotten on my nerves.</p><p>“You really are,” the short brunette said, taking the blonde’s arm and keeping them all moving.</p><p>Zerbrowski leaned in and whispered, “Stop glaring at them, just let it go.”</p><p>I turned around so I couldn’t keep looking at the women. “It’s just the attitude bugs me.”</p><p>“He’s a good-looking guy, Anita.”</p><p>“It still bugs me.”</p><p>“You jealous?”</p><p>“Not in the way you mean,” I said.</p><p>“There’s only one kind of jealousy.”</p><p>I shook my head. “I’m not jealous as in seeing the women as competition, or being insecure. I know what I mean to Nathaniel, what we have.”</p><p>“Then what?”</p><p>“If a group of strange men had talked about Katie in front of you the way they just talked about Nathaniel in front of me, how would you feel?”</p><p>He stopped walking and just stared into space for a second. He had an odd look on his face. He finally shook his head and said, “I’d have been pissed. I might have made a joke to pass it off, but I would have been pissed.”</p><p>“Yeah,” I said.</p><p>“But you must be used to that at Guilty Pleasures when he dances.”</p><p>“Oh, that and worse, but that’s at his job. He’s trying to be sexy and lusted after, but not here.”</p><p>“How do you know he didn’t flirt with them?”</p><p>“First, he’s cooking. He can focus on that the way I do at the shooting range. Second, he wants to fit in here as one of the ‘wives.’” I made quote marks over the word. “Flirting won’t get him invited to more family-friendly get-togethers.”</p><p>“Katie called me in hoping that the women would be too embarrassed to flirt and loiter in front of another husband.”</p><p>“Did it help clear the women out?”</p><p>“Most of them.”</p><p>“So why fetch me?”</p><p>“Because Katie said to fetch you. She seems to feel that Nathaniel needs some reassurance.”</p><p>There were still too many women in the kitchen. There usually were, at parties like this, because they got tired of the boys club outside, but the energy was different from that. Katie and Nathaniel moved around the kitchen, but the five extra women in the room were in the way.</p><p>Katie said, “Elise, can you please move. I need to get something from that cabinet.”</p><p>Elise was a tall woman. She had let her hair go salt and pepper, but her makeup was flawless, and the bones of her face would make her beautiful when she was eighty, which she so wasn’t. She was either a young forty, or a very well-preserved fiftysomething. She moved out of Katie’s way, but only just enough, because two other women were also leaning against the cabinet and there wasn’t room to move without losing her view of Nathaniel washing dishes in the sink. Katie liked to clean as she cooked, and so he was helping do that, too.</p><p>I glanced from the three to the last two women who were near the door. What had Nathaniel done to get this reaction? Yes, he was gorgeous, but this was excessive. He saw me and the relief on his face was clear, at least to me. Something had happened; I didn’t know what, but something.</p><p>I went to him, and he wrapped himself around me, hugging me very tight, and just held on for a few seconds. It reminded me of my reaction outside with the crowd and the questions, when I’d clung to Micah, but Nathaniel was far more social than either of us. He raised back enough for us to kiss. I expected a good but chaste kiss, considering the audience we had. I was wrong.</p><p>He kissed me completely and thoroughly, his fingers digging and kneading into my back, the way a cat will treat a cushion just before the claws come out and it gets shredded. Micah could have brought just his claws out like that, but Nathaniel would have had to lose human form to do it, and I knew his control was better than that. For him to do anything this catlike here meant he was very nervous, the kiss meant nerves, and maybe a need to prove he belonged to me so the other women would back off.</p><p>I was a little stiff at first with the kiss, because it was way too much for me around the other police, or their wives, but his need and his nervousness made me force myself to relax into him. He’d explain later, and it would make sense. I believed that. I believed in him, and knew he’d have a reason for it.</p><p>He drew back and said, softly, “Missed you.” His eyes were uncertain.</p><p>“I noticed,” I said, and smiled at him.</p><p>Whatever he saw in my smile, my face, took the uncertainty out of his eyes, and replaced it with warmth, happiness, and that look we all get when we look at someone we’re in love with, as if a weight that we carried all our lives lifted when we looked into the face of our beloved.</p><p>“Wow, wish my husband greeted me at the door like that,” a woman with brown hair in two pigtails, halter top, and shorts said.</p><p>I glanced up to find several of the women looking appreciative, but the energy in the room had changed to something softer. I realized that the energy had been almost predatory, the way it can get at Guilty Pleasures sometimes. Women are more sexually aggressive at strip clubs than men, and their energy can be much angrier. I suddenly realized that one or more of the wives must have recognized Nathaniel from the club. It’s hard for most people to treat you like a real human being once they’ve seen you take your clothes off on stage. The wife, or wives, hadn’t been able to resist telling some of the other women and they’d wanted to see for themselves. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>If it had been a female stripper recognized by men it would have been much more covert, because a bunch of men standing there gazing at a woman gets creepy pretty fast, but doing it in reverse the women didn’t see themselves as predatory. It never occurred to them that Nathaniel might be just as uncomfortable as a female dancer would be with the treatment. He was a man, men liked attention from women, or that was the thought. Actually, men can get just as embarrassed as women, and be made to feel just as bad about themselves, they’re just not allowed to admit it.</p><p>“He’s your . . .” the elegant Elise said, and she let the sentence trail off as if she wanted me to fill in the blank.</p><p>“Boyfriend,” I said. “We’ve been living together for three years.” I added that last part to make it clear it wasn’t just hot sex and breathtaking kisses. Duration in a relationship counts for most people, and makes them take it more seriously.</p> <p>“A hello kiss like that after three years together, that’s impressive,” Elise said. Her tone held a certain disdain, nothing I could call her on, but it was there.</p><p>“How long have you been with your husband?” I asked.</p><p>“Five years.”</p><p>“Congratulations,” I said, though I wondered why only five years. She had to be over forty and the hair made me want to say fifty, but some people turn gray early, the face certainly didn’t look fifty.</p><p>She gave a small smile. “Thank you, Anita; it is Anita Blake, correct?”</p> <p>I nodded. “Yeah.”</p><p>“It’s nice to finally meet you, after hearing so much about you.”</p><p>“I hope it was all good things,” I said, smiling, because I was almost sure it wouldn’t be. My reputation for being the bad girl, or even the cop that shot first and asked questions later, didn’t endear me to everyone with a badge.</p><p>“What else would it be?” she said.</p><p>“Food’s up,” Katie said, voice too bright.</p><p>“I’ll leave you to it then,” Elise said and glided out of the kitchen, tall and graceful. The other women trailed behind her.</p> <p>“What was all that about?” I asked.</p><p>“It was terrible, they were so rude,” Katie said, and she went to hug Zerbrowski.</p><p>“Rude how?” I asked.</p><p>“Some of the wives just came in for a quick peek at Nathaniel, and that was all right, but others . . . If it had been men looking at me like that I’d have felt dirty.” She shivered.</p><p>Zerbrowski stroked her hair, as he held her. “You should have called me in sooner.”</p><p>“We should have had Anita come in and kiss him sooner,” she said.</p><p>“You have this effect on women often?” Zerbrowski asked.</p><p>Katie raised her head from his chest and said, “Nathaniel was a perfect gentleman. He didn’t do anything to start this.”</p> <p>“Actually, I did, Katie, just not today,” Nathaniel said.</p><p>They looked at him. I just raised my head and looked up at him while still in his arms. “What do you mean?”</p><p>“They’ve seen me strip. Most people have trouble treating dancers like real people once they’ve seen them take their clothes off.”</p><p>“Seeing you on stage shouldn’t have made them be so rude at our party,” Katie said.</p><p>Nathaniel shifted in my arms and I knew there was more. “What is it, Nathaniel?”</p><p>“I worked a bachelorette party for one of the wives.” He very carefully didn’t say which wife. He would keep his customers secrets even if they didn’t keep his.</p><p>“Why does that matter? It’s still your job and this was my home. It’s disrespectful to us, as well as you.”</p><p>Nathaniel looked down and met my eyes. It was a mute appeal. “I take it that it was a very lucrative party for you?” I said.</p><p>“It was,” he said.</p><p>“They got their money’s worth, I take it?”</p><p>He nodded.</p><p>“I don’t understand,” Katie said.</p><p>I glanced at Zerbrowski. “You ever go to any private bachelor parties that had strippers?”</p><p>“Maybe,” he said.</p><p>Katie frowned at him. “You always tell me, don’t tease Anita right now.”</p><p>He smiled. “Yes.”</p><p>“If you’d gotten a lap dance from a stripper and then she showed up as the girlfriend of one of the cops you knew, how would you react?”</p><p>“Honestly?”</p><p>“That’d be nice,” I said.</p><p>“I’d wonder if the cop knew that his girlfriend used to strip.”</p><p>“Some cops date strippers,” I said.</p><p>“Yeah, but they don’t usually bring them to family-friendly parties.”</p><p>“You can date strippers, but you don’t bring them home to meet the family,” Nathaniel said. He sounded sad.</p><p>I hugged him tight. “You are my family.”</p><p>He rewarded me with that brilliant smile of his, the real one, not the practiced one that the customers thought was the real deal. If he could have looked at them like that on cue he’d have gotten more hundred-dollar tips than he already did.</p><p>“I didn’t mean it that way, Nathaniel. I know you’re Anita’s family,” Zerbrowski said.</p><p>Nathaniel wasted some of the smile in his direction. “Thanks.”</p><p>Then Katie got a strange look on her face, and she paled.</p><p>“What’s wrong?” Zerbrowski asked.</p><p>“Ages ago, they tried to tell me about a bachelorette party that a bunch of the wives went to when Rosetti was about to marry. They told me some details and . . . I told them to stop, I didn’t want to hear it.” She looked at Nathaniel.</p><p>He was very still against me. I looked up at him. His face was guarded, as if he were waiting for something bad to happen.</p><p>“That was you they were talking about?” Katie asked.</p><p>“Probably,” he said, softly.</p><p>She blinked at him, brown eyes very wide. “But they said . . . you . . .” She blushed from neck to the roots of her hair. She finally hid her face against Zerbrowski.</p><p>“Whatever they said, I did not have sex with anyone at the party.”</p><p>She raised her head from Zerbrowski’s chest and blinked at him. The look was enough to say that was exactly what she’d been told.</p><p>“The stories grow in the telling sometimes, but whatever they’ve decided to tell people, sex did not happen. Now, here I am in person, and every woman who heard the story will be wondering if it was true; some were drunk enough they may believe what they were told happened, and whoever lied the most will be freaking out that I’m here.”</p><p>Katie mastered herself enough to say, “I just need a minute. If you could set the rest of the food on the table and watch the pasta in the oven, I’ll be right back.” Katie went out the door with a bemused Zerbrowski trailing after her.</p><p>I looked up at Nathaniel. “If you say you didn’t have sex, I believe you, but what did you do at the party that was so share-worthy?”</p><p>“Nothing illegal.”</p><p>“I knew that, silly you.”</p><p>He smiled. “You never think less of me, do you?”</p><p>“Why should I?”</p><p>“It doesn’t bother you to know that at least five women here have seen me naked.”</p><p>In my head I thought, since you did a few pornographic movies before we met, there might be a lot more people who have seen you naked, but I didn’t say that out loud. If I brought that up, we’d fight, or he’d get his feelings more hurt than they already were, and that wasn’t what I wanted.</p><p>“You don’t take your G-string off in the club,” I said.</p><p>“For enough money I do at private parties.”</p><p>I hadn’t known that, and fought to keep my face from showing it. Then I thought of something else. “Did the lap dances start before or after your thong came off?”</p><p>“Most before, but the bride got one after.”</p><p>“That must have been tricky.”</p><p>“Lap dances without clothes are always tricky,” he said.</p><p>“I’ll bet.”</p><p>“Are you upset?”</p><p>I honestly wasn’t sure, but the only answer I had was, “Not really.”</p><p>“You don’t look completely happy,” he said.</p><p>“Okay, how long ago was this party?”</p><p>“A year ago, maybe a little longer.” His face was very careful as he said it, watching my face for anger. He watched sometimes like that, waiting for me or Micah to get mad at him. He’d been physically abused as a child, and by age seven he’d had to run away after witnessing his older brother’s murder. He’d asked me once if there was a time limit on how long someone could be convicted for murder. I’d told him, no, a person could always been charged for murder, unlike rape, or child abuse, which does have to be reported as a crime within a set number of years. Nathaniel had nodded, and filed the thought away. I didn’t push. His therapist said that Nathaniel had blocked out most of his early childhood in order to survive. What he did remember was so terrible it worried me; I mean, how bad could the rest be? Fresh on the streets at age seven, Nathaniel had been found by a man who liked little boys; he’d fed him, clothed him, taken care of him, and before the age of ten he had pimped him out. Saying Nathaniel had a hard childhood was like saying World War II was a small border dispute. Becoming a headliner at Guilty Pleasures had been such a climb up the social ladder that it seemed wrong to bitch about a little nudity. If things had gone differently and he’d never been found by the local wereleopards, Nathaniel would probably have died of a drug overdose before he ever reached seventeen. The wereleopards had insisted he be drug-free before they made him one of them. I was very glad that he’d lived for us to meet, and that he was in my life.</p><p>“So the bachelorette party was after we were living together?”</p><p>“Yes,” he said, face, voice, body language very careful.</p><p>I nodded. “It’s okay. I mean, it’s weird that the bride and her friends are here, but it’s okay. It’s your job. You’ve been a good sport about me being shot, stabbed, and nearly dying at my job, so I need to man-up and be a good sport about your stuff.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re really not mad about it?”</p><p>I licked my lips, and tried to think how to word it. “I’m not mad. It’s just weird and I’m not sure how to act around the women.”</p><p>“It is weird, and me either,” he said.</p> <p>I smiled at him. “Okay then, we’ll figure it out together, but we should tell Micah when we get outside.”</p><p>Nathaniel agreed, and hugged me, smiling. “Then help me set the food on the table. I’ll check on the ziti in the oven.”</p><p>“Baked ziti, why is it that no party in St. Louis can skip the baked ziti, or baked mostaccioli?” I asked.</p><p>He grinned at me. “I don’t know, but I’m not going to let it burn.” He was already turning to the stove. I started to grab one of the dishes off the kitchen island, but felt the heat in time. I grabbed two potholders lying on the island and carried the dish of baked beans into the other room. I was going to have to remember that a lot of things were too hot to touch without cover. How did I feel about the fact that there were other women here who had seen my love naked? That wasn’t the right question. Nathaniel was like most wereanimals; he didn’t see anything wrong with nudity, so a lot of people had seen him nude. How did I feel knowing there was at least one woman here who’d had a naked lap dance from my sweetie? Nope, still not the right question. I knew that Nathaniel had been far from virgin when we first met. Hell, the first time we met he’d still been working as a high-class call boy, though it beat being a street prostitute, which was where he’d started before someone saw his potential and moved him up. There’d been more than one reason that it had taken a few years for Nathaniel to convince me to date him.</p><p>No, what bothered me was that people had told intimate details about my lover while he was nude and being all sexy. That bothered me, and I knew it was stupid, because lots of his customers talked about him. Hell, there was a blog that encouraged women to wax eloquent about him as his stage name, Brandon, and about other dancers at Guilty Pleasures, to help drum up business. “See what a good time we had with Brandon at Guilty Pleasures”—but that had been distant. I didn’t read the comments, because he was my boyfriend. I’d learned not to take the customers at the club too seriously if I visited on nights that he was working. I’d even been out on a date with him in the past when he’d been recognized by customers, so why did this bother me?</p> <p>I didn’t have a good answer, so I acknowledged that it did bother me and put it away. I’d think about it until we had some privacy to talk about it. I think my request was no more cops’ wives. Was that a reasonable request? I didn’t know, so I kept my mouth shut and helped put food out on the table while Nathaniel moved easily and happily around Katie’s kitchen.</p><p>We finally got outside on the deck and were standing hand in hand when we spotted Micah moving his way through the crowd. We waved and he smiled when he saw us, but suddenly our view was blocked by a large man. He was six feet, broad shouldered, and just a big guy. Large hands were already clenching into fists over and over, almost the way that Nathaniel had been kneading my back, and in a way the hand thing was a way of showing nerves, a fight for control, just like the kneading had been. But this guy wasn’t a wereleopard, he was just that angry.</p><p>I heard a woman’s voice behind him. “Clint, don’t, please don’t.”</p><p>The man was so broad that I couldn’t see around him to the woman, he just blocked out everything standing too close. I moved Nathaniel slightly behind me and he let me do it. I appreciated the men in my life who weren’t fighters, and who would let me step up for them.</p><p>“Jefferson, right?” I said.</p><p>“Get out of the way, Blake, I got no beef with you.”</p> <p>“If you’re threatening my boyfriend, then we got beef.”</p><p>Zerbrowski was beside us. “My house, my rules, Clint, no fighting.” His voice was light, almost cheerful, a tone to calm things down.</p><p>Clint’s voice growled out from between his teeth, his rage was nearly touchable. “He fucked my wife; I’m going to fuck him up.”</p><p>“I didn’t,” Nathaniel said.</p><p>I kept my eyes front on Clint’s very big center of body. Before an arm, a hand, a leg, anything could move, his center had to move, so that’s what I watched. I was already in a subtle fighting stance, which meant I was set to go, but trying not to look like I was ready.</p><p>“You calling my wife a liar?”</p><p>“She may have been too drunk to remember everything, but I swear that we didn’t have sex.”</p><p>Zerbrowski stepped in, not exactly between us, but close, and spoke low. “Clint, I was at your bachelor party, I know what you did with your stripper.”</p> <p>Clint frowned and looked at Zerbrowski. It was like watching a small mountain turn. Zerbrowski was five foot seven, but he looked frail standing next to Clint. I must have looked minuscule.</p><p>“I don’t know what you mean, Zerbrowski.”</p><p>“Yeah, you do, or were you so drunk that you don’t remember what happened that night?” His voice wasn’t cheerful anymore, but low and serious. His face matched his voice, and you could suddenly see the cop who had spent over a decade backing down bad guys.</p><p>“I remember,” Clint said, sullenly. His body was relaxing, the rage fading.</p><p>Zerbrowski was almost whispering now, I doubt that anyone but the four of us could hear. “Did you tell your wife what you did?”</p><p>Clint took a step back, his hands relaxed a little. “You threatening to tell her?”</p><p>“No, and you’re not going to start a fight at my house either, are you?”</p><p>He shook his head. “No, not here.”</p><p>I didn’t like the sound of that, and was debating if I had a threat that might keep him from getting in Nathaniel’s face at the club, but Nathaniel had something better—the truth.</p><p>“Your wife got a lap dance, she didn’t try for more, but she had a friend that did. The other woman got pissed that I wouldn’t sleep with her, not even for the money she was offering. Just by the way she acted in the kitchen I’m betting that she started the rumor, and must have terrified your wife into thinking she’d cheated. I swear to you that all I did was my job, and that doesn’t include actual sex with anyone.”</p><p>Clint was studying Nathaniel as if he’d not really looked at him before except as a handsome man who had crossed the line with his wife. Now, he saw him as something more, though he wasn’t sure exactly what. They were such different kinds of men.</p><p>A thin, petite blonde woman crept up beside Clint. Her makeup was smeared with tears, and her gray eyes were wide and frightened. She started to reach out to touch Clint’s arm, then let her hand fall back before she’d finished the gesture.</p><p>She looked at Nathaniel. “You’re telling the truth, aren’t you?”</p><p>“I swear to you: it was a hell of a lap dance, but it wasn’t that good a lap dance.”</p><p>She started to cry softly, and managed to say, “Why would Elise tell me that what I remembered had only been part of it? Why would she want me to think that we’d . . . That’d I’d been so drunk that I . . .” She put her hands over her face and just cried.</p><p>The elegant Elise from the kitchen had been the bride’s “friend.” She’d been creepy in the kitchen, apparently she was always creepy.</p><p>Clint put his arm around her thin shoulders, and he looked too massive for her, as if the weight of his hand should crush her. “Elise’s the one who told me that the stripper you’d fucked was here. I’m sorry, Crystal, I shouldn’t have believed that evil bitch.”</p><p>Crystal snuggled against him, still crying.</p><p>“Why would she lie?” Clint asked to no one in particular.</p><p>“Look at it this way,” Nathaniel said. “I was living with Anita when I was hired for your bride’s party. If she found out I was doing customers she wouldn’t forgive that. I wouldn’t risk her being that angry at me, not for anyone.”</p><p>Clint looked at me, then at Nathaniel. “Blake does have a reputation. I guess you wouldn’t want her mad at you.”</p><p>“Good to know,” I said, “but why would Elise want Crystal to think she cheated on you? Why would she want to start a fight here?”</p><p>“Some women like to stir the shit, Anita,” Zerbrowski said. “Elise’s always been one of those.”</p><p>“Have you known her long?” I asked.</p><p>“Long enough to know that Nathaniel isn’t the first guy she’s propositioned, but he may be one of the few who turned her down.”</p><p>“She’s beautiful,” I said.</p><p>“In that cold, wicked witch of the north sort of way,” he said.</p><p>“Yeah, she’s not my type either,” I said.</p><p>Crystal said, “She tortured me with the thought that I cheated on you. Why would she hate me like that?”</p><p>Clint went very still, and had a strange look on his face. Crystal couldn’t see it, probably just as well. I wondered if Clint was one of the men that Elise had propositioned. Somehow I wasn’t sure he’d turned her down, but it was so not my problem.</p><p>Zerbrowski had caught it, because he said, “Elise’s always been mean, even to her friends.”</p><p>“People like that don’t have friends, just victims they hang around with,” I said.</p><p>Zerbrowski nodded. “True.”</p><p>Clint and Crystal made up, and she walked away with her husband, relieved, with the tears still drying on her face. Micah walked onto the deck and joined us.</p><p>“I thought me joining the group might confuse things,” he said, and took my hand on the opposite side from Nathaniel.</p><p>“If you’d stepped into Clint at the wrong time, the fight would have been on,” Zerbrowski said.</p><p>I kissed Micah. “I like that you only ride to the rescue when you’re needed.”</p><p>He smiled. “You were all doing fine.”</p><p>“What was Matthew upset about?” I asked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“The other boys were teasing him for being in dance instead of T-ball, or martial arts.”</p><p>“What’d you tell him?”</p><p>“I made sure the little girls heard our discussion. Most of them are in dance and there aren’t enough boys in any dance school, as I’ve learned from Nathaniel and Jason and all the others going to class.”</p><p>Nathaniel grinned. “You’ve got the girls wanting to dance with Matthew.”</p> <p>Micah nodded happily. He turned to Zerbrowski. “Your Kaitlin is how old?”</p><p>“Ten.”</p><p>“She’s quite taken with Matthew, and sad that he’s too short to partner her.”</p><p>“When we take Kaitlin to the ballet she always comes out asking, ‘Where are the boys for me to dance with?’”</p><p>“They’re playing little league, or taking martial arts,” Micah said.</p> <p>People were drifting past us with plates loaded with food. “Time to finally eat some of the food you’ve been making,” I said.</p><p>“We’ve got boys here,” Nathaniel said.</p><p>“They won’t dance with the girls,” Zerbrowski said.</p><p>“Bet they will,” Nathaniel said.</p><p>“What’s the bet?” Zerbrowski asked.</p><p>“If I can get a boy besides Matthew to dance with one of the little girls, you do the rest of the dishes after the party.”</p> <p>Zerbrowski studied his face. “And if I win?”</p><p>“I do the dishes.”</p><p>“You were going to help do the dishes anyway,” Zerbrowski said.</p><p>Nathaniel shrugged. “It’s what I could think of, and dishes are the one chore I don’t like.”</p><p>Zerbrowski grinned. “Okay, you’re on.” He held his hand out and they shook on it. It was a bet.</p><p>Zerbrowski and Katie had rented tables and awnings for the yard. They were on the opposite side from the area they’d left open for the kids to play, and where the swing set was. The size of the yard had been one of their main deciding factors in buying the house, and today showed why.</p><p>There was a kid’s table just like at family reunions when I was little. Matthew was sitting between two little girls, one blonde and curly, the other with brown hair done in braided pigtails. He was chatting happily. The blonde was answering him back; pigtails seemed quieter, just listening. It was weird to have a kid to keep track of at an event like this; hell, it was weird not to be solo. I’d been part of a “couple” for years, but rarely felt welcome to bring my multiple people to ordinary get-togethers like today.</p><p>Micah leaned in from his seat beside me, and asked, “What are you thinking about so hard?”</p> <p>I smiled at him. “It’s just weird to have someone sitting at the kid’s table that’s mine, ours, to keep track of.”</p><p>“Weird bad, or weird good?” he asked.</p><p>I poked a fork into the food on my plate, trying to think the question through rather than just answering it. “Good, I think.”</p><p>Nathaniel leaned in from the other side of me, resting his cheek against my hair for a second, before he said, “I love having Matthew here, and he’s really enjoying the other kids.”</p><p>I agreed that was true. I tensed a little, waiting for him to push on the whole baby thing. He’d made no bones about the fact that he wanted us to have kids. He’d volunteered to give up his job and be a full-time stay-at-home dad.</p><p>The woman with the brown pigtails who had been part of the group in the kitchen sat down in an empty spot across the table from us. I tried not to tense up. “I’m sorry about earlier, I didn’t realize you had a kid. What’s his name? Our Becky and he are getting along really well.”</p><p>“It’s okay,” Nathaniel said.</p><p>“His name’s Matthew,” Micah said.</p><p>I waited for one of them to explain that he wasn’t “ours,” while I worked through the whole idea of this strange woman having seen my sweetie naked and nearly having sex with another stranger. I was okay with Nathaniel’s job most of the time, but every once in a while it got beyond my comfort zone, and I was left not sure how to feel, or act, or . . . It was just one of those weird moments.</p><p>“I’m Jamie, Jamie Appleton, my husband Kevin is around here somewhere.” She looked up as if trying to spot him, and finally found him on the deck with Zerbrowski and a knot of other men talking and laughing. She pointed out a tall man with short, nearly black hair. “That’s Kevin.”</p><p>“Where’s he work?” I asked.</p><p>“He’s in vice, right now, but he’s looking to move.”</p><p>“Where does he want to transfer to?”</p><p>“Homicide, or preternatural,” she said.</p><p>Ah, I was seeing why she was sitting with us now, and why she’d apologized. She was doing politics for her husband like a good spouse does, and I was in a position to give a good word for Kevin Appleton to the preternatural squad if I wasn’t pissed about the whole lusting-after-my-boyfriend thing earlier. Or maybe Jamie really was sorry, and especially so because our “kids” were playing together. Maybe, and maybe Santa Claus was a friend of mine, or was I being too cynical? Maybe, but I doubted it.</p><p>“How long has he been in vice?” I asked.</p><p>“Five years.”</p><p>“Most people need a change after that long,” I said.</p><p>“Would you want to transfer?” she asked.</p><p>I thought about it, and finally said, “I’m not sure. My skill sets are a little specialized to work anywhere else.”</p><p>One of the little girls shrieked. It made us all look up. The little boy across from Matthew was trying to hit him, but the table was too wide, so he’d climbed onto the table and headed for Matthew.</p><p>The three of us were up and moving toward the fight, as were a lot of the adults. Matthew got up from the table and tried to avoid the other boy, but he’d waited too long, and the other boy launched himself at Matthew and down they went.</p><p>It was Zerbrowski’s son, Greg, who got there first, because he’d been forced to sit at the little kids table; at twelve he had resented it. He grabbed a glass of ice water and dumped it on the fighters. By the time we got there, any adult got there, the little boys were silent, wet, and panting, still entangled, but not really fighting anymore.</p><p>I picked up Matthew and a man I didn’t know got the other little boy. They both had dark straight hair, olive complexions, and the same bone structure; other than the man having pale gray eyes and the boy having brown they looked like mirrors of each other.</p><p>Matthew was crying, arms locked around my neck. His curls and shirt were damp as he clung to me. “Matthew, are you hurt?” I asked. I wanted to make him let go so I could check him for injuries, but somehow it seemed more important to hold him right at that moment.</p><p>Jamie Appleton was holding her little girl, Becky. Her face had blood on it. I was betting the other little boy’s foot had caught her as he went over the table. Kevin Appleton was making his way through the crowd.</p><p>Nathaniel was patting Matthew’s hair, trying to get him to look up so we could see him better. Micah hovered around us all, but he kept his attention on the other father. I realized that it hadn’t occurred to me that the fight could spread from the children to the adults. It was stupid of me to let my guard down just because I had a little kid wrapped around me crying, but it was like the feel of him in my arms had hit a switch and all I could think of was, Is Matthew hurt? Is he okay? Other than looking at the boy and man, I hadn’t really seen them as a threat. Stupid, but luckily Micah hadn’t forgotten that everyone can be a potential threat under the right circumstances.</p><p>The dark-haired boy was bigger than Matthew, but I wasn’t sure he was older. The man was asking him, “What happened? You know the rules on fighting, Cyrus.”</p><p>“He’s gay,” Cyrus said, and his face was hateful as he said it.</p><p>The man looked embarrassed. “Cyrus, apologize.”</p><p>Matthew raised a tear-stained face from my shoulder. “Gay isn’t bad,” he said, his lower lip still quivering, tears still trailing down his face.</p><p>The father asked, “What did you say?”</p><p>Micah said, “We’ve taught Matthew that no sexual orientation is bad, it’s just the way that people come into this world.”</p><p>The man stared at Micah. “Why would you . . .” Then he looked from Micah to Nathaniel and me. “Oh, yeah, I forgot.”</p><p>“Forgot what?” I asked, and my tone was enough to make Micah touch my shoulder.</p><p>“That everyone says your boyfriends are . . .” He stopped as if not sure how to finish the sentence.</p><p>“My boyfriends are what?” I asked.</p><p>“Let’s not do this in front of the kids,” he said.</p><p>I said, “We’re teaching Matthew that no sexual orientation is bad, and that love between consenting adults is always precious and should be valued. What are you teaching little Cyrus?”</p><p>The man’s face clouded up, the beginnings of anger, or maybe I’d hit a sore spot.</p><p>Kevin Appleton was holding a napkin to his little girl’s nose. “Your kid bloodied my little girl. What kind of boy kicks a girl in the face?”</p><p>“Cyrus, did you kick her?”</p><p>“No, Daddy, I don’t hit girls.”</p><p>“He did, too,” Becky said, pushing her father’s hand away, so she could point a dramatic finger. “He kicked me, in the face!”</p><p>Zerbrowski and Katie were there now, trying to figure out what to do with their guests, but it was their son, Greg, who said, “Excuse me, excuse me, everybody.”</p><p>Zerbrowski had to use his cop voice to say, “Everybody shut up for a minute.”</p><p>We all looked at him.</p><p>Greg looked a little uncomfortable with everyone staring at him. He had his father’s dark curls, but Katie’s delicate bone structure, so he was a pretty kid, and looked even younger than twelve. “I know what started the fight.”</p><p>“Tell us?” Zerbrowski said, his hand on his son’s shoulder.</p><p>“Cyrus here told Matthew that only gay boys played with girls. Matthew said that he liked to play with girls and boys. He totally didn’t get that he was being insulted. Cyrus asked, ‘What does that mean?’ The little blonde girl told Cyrus that he was being boring just like at school and kissed Matthew on the cheek, that’s when Cyrus tried to hit him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cyrus’s father looked at his son. “Is that true?”</p><p>Cyrus wouldn’t look at his dad, or anyone else. It was hard to look tough when you’re being held in someone’s arms, but he did his best to pull it off, even crossing beefy arms across his chest.</p><p>“Cyrus, I asked you a question, don’t make me ask twice.”</p> <p>“Yes,” he finally said, very sullen.</p><p>“I don’t know what got into him, but I’m sorry.”</p><p>Kevin Appleton said, “When Becky does something wrong she does her own apologizing.”</p><p>Cyrus’s father glared at Appleton, but he said, “Apologize to the little girl, Cyrus.”</p><p>“I didn’t mean to hurt her. I wanted to hurt him!” He pointed his own dramatic finger at Matthew.</p> <p>“Matthew didn’t start the fight, Cyrus, you did. Apologize to both of them, now.”</p><p>He turned a pouting face to Becky. “I’m sorry I hurt you, I didn’t mean to.”</p><p>“I don’t accept!” Becky said. Her eyes were dark and furious. I liked her.</p><p>“Now, apologize to Matthew.”</p><p>“Won’t,” Cyrus said. It was a very firm word, he meant it.</p><p>“Cyrus, apologize, now.”</p> <p>“Won’t.”</p><p>“Maybe if you told him what he’s apologizing for,” Nathaniel said.</p><p>The father looked puzzled. “He knows what he’s apologizing for.”</p><p>“Is he apologizing for the fight, trying to call Matthew bad names, or being jealous?” Nathaniel asked.</p><p>“I don’t even understand that,” the man said.</p><p>“Are you sorry you called Matthew names?” Nathaniel asked.</p><p>Cyrus looked daggers at him, but finally said, “I’m sorry I called you names.”</p><p>“Do you accept his apology?” I asked, Matthew softly.</p> <p>Matthew nodded.</p><p>“Are you sorry you started the fight?” Nathaniel asked.</p><p>“I’m sorry I fought you, Matthew.”</p><p>Matthew shook his head. “I didn’t like that. If Becky cannot accept your ’pology, I don’t accept it either.”</p><p>Someone had found ice to put on Becky’s face. She was crying again, saying, “It’s cold!”</p><p>“We’re really sorry, aren’t we, Cyrus?” his father said.</p><p>“Yes,” Cyrus said sullenly.</p><p>“Can you behave yourself the rest of the day, or do we have to leave?”</p><p>“I don’t want to go.”</p><p>“Then promise me, no more fighting.”</p><p>He promised, but not like he was happy about it, or really meant it. We’d keep a closer eye on Matthew, just in case. Didn’t want to give him back to his mother damaged.</p><p>They went one way. We went the other. I told Greg, “That was quick thinking about the water.”</p><p>He flashed me a grin that was the duplicate of Zerbrowski’s shit-eating one, and suddenly he was so his father’s son. It made me smile just to see it.</p><p>“Thanks, Anita.”</p><p>Zerbrowski hugged him one armed from behind, because he was getting too big for a public hug. “That’s my boy.” They grinned at each other, and it was a good moment.</p><p>The curly-haired blonde came over with a woman in tow who was as blonde and blue-eyed as she was. “Mommy, this is Matthew, he takes ballet just like I do, and he fought Cyrus for me.”</p><p>I was pretty sure that Matthew hadn’t seen himself as defending the little blonde’s honor. I started to say something, but Matthew was looking entirely too pleased with himself for me to spoil the moment.</p><p>The girl was Jeannette, the mother was Jean, and the father was Detective Mitchell Forbes. Forbes had lost most of his hair, so I added five years onto his age, but when I had more time to look at his face, and the toned body that showed in his polo shirt and shorts, I subtracted the five years and put him early thirties at most.</p><p>“Thank you for taking care of our little girl, Matthew. It was very brave of you.”</p><p>I wasn’t sure how I felt about these assumed dynamics, that the girl needed saving and that the boy did the saving. It seemed sexist and under six there really wasn’t much difference in physical potential. Jeannette could have “protected” herself as well as Matthew, with training in martial arts maybe better.</p><p>“You know, girls can protect themselves,” I said.</p><p>Jeanette and Jean looked at me as if I were speaking in tongues, blinking big, blue eyes at me. Then Jean wrapped her free hand through her husband’s muscular arm, still holding Jeannette’s hand in her other.</p><p>“Mitchell and I met because a man got out of hand in a bar and Mitchell saved me. I didn’t even know he was a cop then, just that he was this big, strong, commanding guy.” She smiled up at him with so much love in her face, and he smiled down at her with the same warmth showing. It was a good look, so why did it bug me?</p><p>Nathaniel wrapped his arm across my shoulders. “Anita rescued me . . . from myself.” I think he added the last so they wouldn’t ask what I had rescued him from. Some of the rescuing had included me killing people, which the police tended to frown on.</p><p>I turned and smiled up at him. “Thanks, pussycat, but you’ve saved me, too.”</p><p>He kissed me then, and I realized that it was true. He had picked up a gun and shot someone to save me once, but he’d saved me in so many other ways. Can you really rescue anyone, or anything, without rescuing a piece of yourself at the same time?</p><p>Matthew hugged us both, wrapping his small arms around our necks before we’d moved apart. We hugged him back, Nathaniel’s arms wrapping around me as I held the little guy. Micah’s hand came up to touch the side of his still-damp curls, and Nathaniel opened his arm enough to let Micah into the hug.</p><p>Matthew chimed out, “Group hug!” in a happy voice.</p><p>It made the whole Forbes family laugh. Jeannette said, “Pick me up, Daddy; I want a group hug, too.” That made all the adults laugh, and the Forbeses did their own group hug.</p><p>We ended up with a play date with Jeannette Forbes and Becky Appleton. They were both five and in kindergarten, older women. Matthew was precocious.</p><p>The first lightning bugs came out, and the children ran trying to catch them. It seemed like there were more of the twinkling bugs when I was a little girl. Was that just nostalgia on my part, or truth? I wondered if anyone had done a study on it somewhere. I’d look online and see.</p><p>I made sure all the kids knew that fireflies were catch-and-release only, and that no one tore the insects’ bright abdomens off and pressed them to their skin like macabre jewelry. I’d done that once as a child and felt horrible afterwards. The other kids hadn’t understood why it bothered me, but now I could explain to the next generation that lightning bugs were for looking at, not tearing apart.</p><p>Micah had helped me wrangle the kids chasing fireflies so the ones even younger than Matthew could have a chance to see the blinking lights up close or even have them crawl over small toddler hands. I wasn’t sure where Nathaniel had gotten to, until he came out to the yard and knelt whispering to Matthew. His grin showed in the soft light from the deck. After speaking to Matthew he went up to Becky and Jeannette first, then some of the other girls, and they scattered back through the other children saying something I didn’t quite catch. Then most of the children between three and ten ran toward the house. The number of boys went down as the ages went up, and the numbers of girls remained the same. In fact some of the older boys looked offended. I had a clue what Nathaniel and Matthew were up to, and Micah and I trailed behind them, holding hands.</p><p>Katie, Zerbrowski, and both their children were in the living room with the furniture pushed back against the walls so that the hardwood floor was clear and gleaming under the overhead lights.</p><p>Nathaniel had taken his shoes off, and said, “Kaitlin and I have already stretched.” He held his hand out.</p><p>Kaitlin Zerbrowski had changed into tights, ballet shoes, and a gauzy overskirt. She’d put her long brown hair, so like her mother’s, up in a high, tight ponytail. She looked taller, leaner, in the outfit and moved gracefully to take Nathaniel’s hand.</p><p>Zerbrowski used a remote to turn on the sound system that went with the big-screen TV, but worked just fine with the speakers scattered throughout the room, too. Ballet music that I didn’t recognize was suddenly everywhere in gorgeous surround sound.</p><p>Nathaniel and Kaitlin began to dance. He had partnered some of the older girls at the ballet school where he took lessons, and I knew that he and Kaitlin had come up with some simple choreography. I was betting this was recital music she was already practicing to, and Nathaniel was a quick study. He held her hand while she went up on pointe. He went down on one knee so she could do a beautiful arabesque. He stood and helped her balance for pirouettes. All the while he moved gracefully beside her, and at the end he lifted her overhead, one armed. Kaitlin held her body in perfect position while he did it, which showed that she had core strength that didn’t show in her slender frame. He walked carefully, easily in a small circle around the room, before spilling her through his arms so that she came back to pointe on the floor again.</p><p>The music stopped and everyone applauded. We had quite an audience by that time. Kaitlin was smiling as big as I’d ever seen her, glowing with it. Nathaniel went down on his knees so she could hug him, then she ran to her mother. “Mommy, I told you I could do it! I told you, if I had someone to hold me I could do it just like a real dancer!”</p><p>Zerbrowski shook Nathaniel’s hand and did that one-armed guy hug. “I know this is a dastardly plan to win our bet, but it’s worth it to see her that happy.”</p><p>Nathaniel grinned at him. Matthew was sitting on the floor struggling with his double-tied Spider-Man tennis shoes. Micah helped him take them off, and when he was barefoot he ran to Nathaniel. He picked him up and then said, “Whoever wants to dance has to stretch out.”</p><p>The little girls ran en masse toward them. The boys held back. It was Jeannette of the blonde curls who grabbed one of the boys and pulled him into the group. Kaitlin went through the boys between eight and teens and looked them over like she was at a used car dealership. She declared, “You look in good enough shape.” Or, “You think you’re strong enough to do this?” I was betting that Nathaniel had coached her in the social verbiage as much as the dancing. Greg Zerbrowski got some of the oldest boys on the floor. I couldn’t hear what he said to them, but they gave covert looks to some of the older girls who had walked onto the floor in graceful, laughing groups. Learn to dance, and you can hold girls close without anyone getting mad at you. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They coaxed, bullied, and embarrassed a surprising number of the boys onto the floor. Among them was Cyrus, who Jeannette had dragged onto the floor personally, which meant to me that she knew exactly the effect she had on the little boy. It made me wonder if she’d kissed Matthew to start the fight. Surely not. She couldn’t be that aware this early, could she?</p><p>Nathaniel and Kaitlin led the stretching and limbering. One of the oldest boys, about fourteen, said, “This is some of the stuff we do before baseball practice.”</p><p>Nathaniel said, “Dancing is athletic and you want to stretch out just like you do for baseball, or any other sport.”</p> <p>The stretching reminded the boys of a lot of their sports practices and seemed to put them more at ease. Zerbrowski put on more music and this time Nathaniel and Kaitlin helped Matthew and Becky through a short dance. He braced Becky while she went up on tiptoes, one arm trying to form that round, half circle of arm movement that is one of the first things you learn in ballet, or try to learn. Matthew did his part as the guy half of a ballet couple, which meant he was mostly a prop for the girl, but he did it to the best of his ability, face serious.</p><p>Jeannette wanted her turn next with Matthew. She was a little more graceful than Becky, but she was also taller, so it was harder for Matthew to partner her. Nathaniel picked the taller, beefier Cyrus out of the watching boys.</p><p>“I can’t do this,” Cyrus said.</p><p>“You’re a better height for Jeannette, and you’ve watched Matthew do it, just try and Kaitlin and I will spot you.”</p><p>It was Jeannette coming and taking his hand that persuaded Cyrus to try. Nathaniel helped Cyrus figure out how to stand, how to hold his ballet partner, and Cyrus gave it the same serious-faced concentration that Matthew had. He was actually able to go down on one knee and brace her while she went up on that classic one-legged stance. She was only on tiptoe, not pointe, but the lines of her body were all there. I wondered how long she’d been taking lessons.</p> <p>Kaitlin showed some of the younger boys some basic moves, while Nathaniel paired off the older kids. Greg Zerbrowski managed to magically appear beside a tall, leggy girl who was probably three years older, but most of the older boys were still making fun of it all, so he was the tallest one willing to come forward.</p><p>The girl went up on pointe even without the special shoes to make it happen. You could see the muscles in her thighs and calves like magic under her shorts. Greg held her, braced her, and his body damn near vibrated with the effort to hold on, to give every ounce of strength he had to staying with her. He didn’t have a dance background so he couldn’t “dance” with her, but by God he was a good prop for her to show how well she danced.</p><p>Greg was sweating and out of breath by the time they took their bows, but the girl hugged him tight and said, “That was great, if you took lessons you could dance with us!”</p><p>He blushed, and looked so like his father that it made me grin. One of the oldest boys there that night, sixteen and bulked from weight lifting, probably football, or wrestling for his sport, stepped up next. He had the strength that Greg hadn’t grown into yet, and he held his ballerina easily, though he was less fluid; he definitely didn’t dance, but he was great at holding, bracing, and helping her dance. At the end his ballerina asked if Nathaniel could lift her, because she’d never had anyone strong enough to do it before.</p><p>The boy had said, “Can you show me?” So Nathaniel lifted the girl first, her fall of nearly black hair spilling down his arm as she bowed above him, holding the pose and proving just how strong she was, because holding your body in space like that is one of the hardest things you can do. Then he helped the ballerina and her partner do the move.</p><p>He spotted them, so that if she got dropped she wouldn’t get hurt. The first few times the move wasn’t quite right, so they kept practicing until the lift was strong and sure, and he could hold her almost as steady as Nathaniel had.</p> <p>When they were done and he helped his ballerina to her feet, the kid said, “My arms feel like they do after lifting heavy weights. That was a serious workout.”</p><p>“You’re lifting a whole person above your head, and making it look graceful and fluid while you do it,” Nathaniel said.</p><p>“Wow, is all I can say. I can feel my arm muscles twitching.”</p><p>“That means you gave it your all,” Nathaniel said.</p><p>The dark-haired ballerina laid a kiss on the kid’s cheek. “Thank you so much, I wish we had guys in our school that were as strong as you.”</p><p>He looked at her, and said, “Where do you take lessons?”</p><p>The dastardly plan worked better than expected. I heard several little boys asking for dance lessons, and talking about how hard it had been and that they wanted to be stronger so they could lift the girl.</p><p>The music changed to something slow and not ballet. Zerbrowski took Katie’s hand and led her onto the floor. He was grinning, she was smiling, and they danced smoothly, gracefully, like they could read each other’s moves before they happened.</p> <p>“Zerbrowski, you can dance,” I said.</p><p>“Ballroom dancing lessons were my present to Katie for our thirteenth anniversary. Give me a few years and even I can learn,” he said as he whirled Katie around the floor.</p><p>Nathaniel came to me and held out his hand. What else could I do, I took it, and let him settle me in his arms. I went up on tiptoe since the shoes I was wearing didn’t have the heels of dancing shoes. How did I know how to do ballroom dancing? We’d all learned so that we didn’t disgrace Jean-Claude at the big vampire balls and parties that we sometimes had to do as part of vamp politics. The older and more powerful the vampire, the more they liked spectacle and a show. We’d actually started having a once-a-month dance lesson and ball at Danse Macabre, the dance club that Jean-Claude owned, because he never lost an opportunity to make money off of a necessity. We had to learn the old dances so we could show the other vampires we were civilized. He taught them to humans who wanted to dance with the vampires, politics and capitalism in a nice little package, that was my main vampire sweetie.</p><p>There were actually a few couples that joined us, including Jamie and Kevin Appleton. Greg Zerbrowski went back to his ballerina and offered her his hand. She took it smiling and he led her to the dance floor and showed that his dad had taught him more than just how to throw a curveball.</p><p>Several of the wives dragged their husbands awkwardly to the dance floor, but a number of them refused. Nathaniel kissed me lightly, and handed me over to Micah, who proved that he could dance, too. Nathaniel went to Jean Forbes and asked her husband’s permission to dance with her. Since he’d refused to do it, what could he do but say yes.</p><p>Jean didn’t know how to do this kind of dancing, but Nathaniel was a good partner and led her through the moves while she giggled.</p><p>A lot of the boys went and got dance partners, including Matthew, who was out with Becky Appleton. I wasn’t surprised to see Jeannette Forbes with Cyrus, or that he was a lot less happy trying to do this new dance than Matthew was. It was movement to music and Matthew picked it up better than any of the other younger boys. Some of the little girls were leading their partners through rather than being led, and that was okay, too. Dancing like this was one of the places I was perfectly content to not be in charge.</p><p>Micah moved me effortlessly, our arms forming the framework to hold our bodies in space and time with each other. I’d hated it when we first started learning, but it was actually relaxing now to follow instead of being followed.</p><p>The wives partnered with Nathaniel and Micah, and Zerbrowski and Greg, and even Kevin Appleton. Katie, Jamie Appleton, and I helped some of the husbands out, but mostly they either watched, or drifted away.</p><p>The football player stayed to learn with his dark-haired ballerina. Jean got her husband Mitchell to try. He moved awkwardly, but I couldn’t decide if it was because he couldn’t dance, or couldn’t get out of his way enough to allow it.</p><p>I’d half expected creepy-but-beautiful Elise to try and dance with Nathaniel, but she wasn’t here. I asked Zerbrowski and found out that Clint and Crystal had confronted her about her lie in front of Elise’s husband, and they’d left with a truly spectacular fight starting between them. Apparently, her husband hadn’t known she’d tried to sleep with Nathaniel. Karma: what goes around comes around, and sometimes it bites.</p><p>The rest of us danced. We stayed behind to help the Zerbrowskis clean up after most of the other guests had gone. Zerbrowski did the dishes, whistling to himself as he did it. Like he’d said, seeing Kaitlin that happy had been totally worth it. Matthew fell asleep in the middle of the floor as if his batteries had given out all at once. I thought picking him up would wake him, but he was so deeply asleep that he never stirred as Nathaniel picked him up to carry to the car.</p><p>Katie and Zerbrowski both hugged me bye. Kaitlin and Greg were already in their rooms asleep. Katie hugged both my men good-bye, and Zerbrowski shook Micah’s hand and patted Nathaniel on the shoulder.</p><p>“You made our daughter’s month,” he said.</p><p>Nathaniel smiled. “It was a pleasure, she’s a good dancer, and she was really good helping teach the younger kids.”</p><p>“She wants to have her own ballet school someday—after she’s been a prima ballerina, of course,” Katie said.</p><p>“Of course,” Nathaniel said, smiling.</p><p>We walked out into the humid summer evening, night insects filling the darkness with a high humming buzz. It took two of us to get Matthew fastened into his safety seat, because he was so asleep that he kept trying to slide out, but we got him buckled in and then Micah asked to drive home. He almost never asked to drive, so I gave him the keys. If he’d been one of those men who always insisted on driving I would have fought him, but Micah didn’t try and control, so I didn’t have to fight to keep control. Life is like dancing, sometimes one of you leads, sometimes the other, and if you do it right it’s beautiful, even when it’s hard. </p> </body></html>"]