["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>This wasn’t supposed to happen.</p><p>Not in a million years. Not even one day past forever.</p><p>Because she knew the kind of man he was and she knew he was exactly the kind of man she had sworn she would never allow herself to have.</p><p>Yet it was happening.</p><p>Suspended between complete disbelief and mind-numbing pleasure, Piper Mackay found herself mesmerized by Jedediah Booker’s kiss.</p><p>Her lips parted.</p><p>Her fingers curled around his wrists, though in protest or simply to find something to hold on to, she wasn’t certain.</p><p>What she was certain of—she hadn’t expected this.</p><p>His broad fingers splayed into her hair as his palms cupped her cheeks, holding her in place for his kiss. His lips slanted over hers, rubbing sensuously, and sent spikes of heat burrowing through her senses.</p><p>It wasn’t supposed to be like this.</p><p>It wasn’t supposed to be so sexy.</p><p>The feel of his hard, muscular body against her smaller one, pressing her against the wall at her back, had her knees weakening at the eroticism of the position. The feel of the hardened length of his shaft as it pressed against the towel covering him, throbbing against her stomach, was almost too intense to bear.</p><p>She wanted to touch him.</p><p>She wanted to run her hands over his hard, powerful body and feel the flex of muscle beneath the darkly tanned flesh. She wanted to do more than stand, frozen, on the verge of fleeing in fear as his tongue flicked against her lips, teasing her to taste him in turn.</p><p>Just one taste.</p><p>She could take just a moment to experience what she had promised herself she would not tempt.</p><p>The wild, erotic promise of Jed’s possession.</p><p>Her tongue peeked out, touched his, then lingered.</p><p>A moan slipped free; completely against her will and her better judgment as she allowed his lips and tongue free rein in the kiss they were initiating.</p><p>A deep, rough male growl sounded in his throat as his hands slid from her face and moved quickly to her hips. Before she could process the move, before she could make sense of it, Piper found herself lifted, her legs parting, the soft material of her skirt falling back over her thighs, and the broad, fiery heat of Jed’s cock throbbing, hot and naked, free of the towel, against the silk of the panties shielding her sex.</p><p>She could have protested.</p><p>She would have protested.</p> <p>But it was so good.</p><p>Everything was just so good.</p><p>The lush eroticism of the kiss, the heat of his hands against her flesh, the seductive, sensuous pleasure beginning to blaze through her senses. It was so good that resisting was impossible.</p><p>His hands clenched on her rear, kneading the rounded curves as his hips rocked against her, sending shudders of pleasure racing through her.</p><p>He slanted his lips over hers, one hand sliding from the curve of her ass, and she found herself gripping his thighs with her knees as his hand pushed beneath the soft cotton shirt she wore.</p><p>Piper fought to breathe.</p><p>She was lost in a world of sensation and pleasure. He held her to him as his hand slid up her side, calloused palms rasping against her flesh just before his fingers curled around the bare mound of one breast.</p><p>Finding the hardened tip with his thumb and rubbing against it, he found another way to throw her senses into complete chaos. Her nipples were so sensitive, so responsive, that even her own touch had the power to make her gasp.</p><p>Jed’s touch, so much more experienced and knowing, had the power to do much more.</p><p>His touch against the ripened bud had the power to bring her nearly to release. Playing with the little bud, he rolled his thumb over it before gripping the pebble-hard tip between his thumb and forefinger. Sharpened spikes of sensation tore along the nerve endings to her clitoris before slamming into her womb.</p><p>Piper tightened her thighs against his hips, rocking with him, rubbing herself against the broad thickness of the heavy cock throbbing against the heated folds of her sex. Sharp waves of hunger rushed along nerve endings that seemed newly awakened, created only to respond to Jed’s touch. Sensitized and now greedy for sensation they throbbed and ached for more and more.</p><p>It was so good.</p><p>It was too good.</p><p>“Piper, sweetheart . . .”</p><p>His breathing was as rough as her own, ragged; he was fighting to draw in air as he tore his lips from hers and buried them at her neck.</p><p>Tipping her head back, Piper fought to increase the sensation of his lips brushing against the sensitive flesh at the curve of her shoulder. The feel of the tip of his tongue tasting her and awakening a sensual hunger she hadn’t known existed inside her.</p><p>Digging her nails into his bare shoulders, she told herself just a few more seconds. She would allow herself to experience the pleasure, the incredible building heat burning through her body, for just a few more seconds.</p><p>His teeth raked against the side of her neck as she felt his body tighten further. A low groan of male pleasure echoed at her ear.</p><p>“I could lose myself in you, Piper,” he groaned in building lust. “So fucking easy.”</p><p>Oh, God, what had she gotten herself into?</p><p>She had known not to enter his room.</p><p>Some part of her had known he was still there.</p><p>The temptation had been overwhelming.</p><p>Like some damned ninny in a suspense novel, she had crept right in. At the very moment she had closed the door behind her, certain he must be gone, he’d stepped from the bathroom, obviously having just left the shower.</p><p>Had she had the good sense to leave?</p><p>Hell, no.</p><p>“Jed.” Whispering his name, she fought to hold on to him, fought to remember why this was a very bad idea.</p><p>“Piper. Sweetheart . . .”</p><p>The room was spinning—no, Jed was moving. Wrapping one arm around her hips, he turned, bearing her to the bed and laying her back against the sheets he’d slept on the night before.</p><p>The subtle scent of male warmth and the dark hint of the cologne he wore lingered on the bedclothes, surrounding her and sinking into her senses. She felt surrounded by him, overwhelmed by him, and unwilling as well as unable to fight against the pleasure clouding her mind.</p><p>Before she could even consider protesting, the soft cotton shirt she wore was pushed over her breasts and the sensitive, tight peak of her nipple was suddenly surrounded by the wet heat of his mouth. It happened so quickly, with such heat that her senses immediately exploded with sensation.</p><p>Piper jerked upward, a moan rasping from her lips as her eyes closed in rising pleasure.</p><p>The lash of his tongue over the sensitive peak sent sensation spiraling from her hardened nipple straight to the clenched, aching depths of her vagina. The tight, swollen bud of her clit pulsed with need. Heat flushed her body, and the slick dew of arousal dampened the swollen folds of her sex and the silk of her panties.</p><p>Pushing her fingers into the overlong strands of his hair to hold him to the tingling, heated bud of her nipple, Piper felt herself giving up—giving in.</p><p>The pleasure was too intense.</p><p>The need that had risen over the past year since her sister had moved out of the inn their mother owned to live with her fiancé was only burning with a greater, fiery hunger.</p><p>Had she been insane when she had taken her mother’s offer to move into Eve’s suite just days after Jed had moved into the room beside it?</p><p>Had she known this would happen?</p><p>God, she had.</p><p>She’d known she would end up in his bed, and she knew he’d break her heart.</p><p>He wouldn’t be able to help it. He would destroy her.</p><p>That thought, that fear, had a reality check suddenly clicking in her mind.</p><p>“Jed. Jed . . . not a good idea,” she cried out, even as she lifted her hips to grind the mound of her sex more firmly against his cock while he palmed both breasts.</p><p>“My best idea yet,” he muttered, his voice hoarse as one hand slid to the bend of her knee to lift it higher along his hip.</p><p>His hips pressed and rolled, grinding his shaft more firmly against her clit and soaking her panties with her juices as he used both hands to press her breasts together. His lips moved from one hardened nipple to the other, licking and suckling, pulling repeated moans from her lips as her ability to fight against the pleasure dissipated.</p><p>She’d dreamed of this.</p><p>She’d fantasized about it for far longer than the past year.</p><p>“God, I love how you taste,” he muttered, his head lifting, his lips coming back to hers as he gripped her nipples between fingers and thumbs and played with them erotically.</p><p>His tongue pressed against her lips, parted them, met hers, and stroked against it with heated demand.</p><p>He wasn’t asking for anything, definitely not the right to have her.</p><p>He considered her his due.</p><p>That thought sent a wave of trepidation racing through her, only to disintegrate beneath a harder, deeper kiss as one hand left her breasts to stroke her thigh.</p><p>“Damn, Piper.” He tore his lips from hers to blaze a trail of fire down her neck to her breasts once again as strong, knowing fingers pressed beneath the elastic of her panties.</p><p>Lifting her hips, angling them to the fingers pressing closer to her clitoris, Piper could feel the slickened fall of damp warmth spilling from her, preparing the sensitive flesh for his touch.</p><p>She was so ready for him. So ready to have his fingers delve into the feminine folds that ached for his touch that she felt poised on a pinpoint of agonizing arousal.</p><p>He was so close to touching her clit. So close to caressing that heated bud of sensitized nerve endings that she could swear she could feel the warmth of his fingers as they neared her.</p><p>So close . . .</p><p>A heavy knocking at the door had them stilling.</p><p>Piper struggled to open her eyes, meeting his gaze as his head jerked up from where his lips had strayed to her midriff.</p><p>“Hey, Jed, we have to run.” Elijah Grant was on the other side, his knuckles rapping against the glass of the patio doors across from the bed once again. “You ready?”</p><p>“Please,” she whispered, suddenly desperate that she not be seen here, with him, all but naked and fucked in his bed.</p><p>Oh, God, what was she doing?</p><p>Jed could see the sudden panic flaring in her gaze. The instant withdrawal the second she consciously realized just how close she was to having given in to him wasn’t lost on him. The hunger that kept them bound to each other wasn’t going to go away. No matter how hard he fought it, no matter how desperately she denied it.</p><p>“Give me ten minutes,” he called out to Elijah. “I’ll meet you at the bikes.”</p><p>She was trembling beneath him.</p><p>The feel of the subtle tremors racing through her delicate body had the power to piss him off as nothing else could. It was like this every time he neared her, every time the hunger flared between them. She would tremble, get that look of wariness in her eyes, and instantly retreat.</p><p>He was damned sick of her retreating.</p><p>“Why are you scared of me?” Focusing his gaze back on her, careful to keep his voice too low to carry beyond the room, he demanded an answer.</p><p>“I am not scared of you.” Determination and fiery stubbornness filled the deep sea green of her eyes and tightened the kittenish features of her face.</p><p>“Then what are you scared of?” Lowering his voice further, Jed brushed his lips against the swollen curves of Piper’s while fighting the nearly overwhelming need to steal another kiss. To forget his partner was awaiting him and that now was not the time to make slow, easy love to her.</p><p>He would never pull himself from her if he did.</p><p>Elijah could walk in on them and it wouldn’t stop Jed from having her.</p><p>“Don’t you have to go to work or something?” she muttered instead as she pushed at his shoulders. “Let me up, Jed, before Elijah starts picking the lock.”</p><p>Elijah sure as hell wasn’t above it if he thought the situation warranted it.</p><p>“What makes you think he would pick the lock?” He knew Elijah would do it, but what made her think he would?</p><p>Piper rolled her eyes up at him.</p><p>“Do I really look that stupid to you, Jed?” Mockery filled her gaze as he levered himself from her body. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He watched silently as she hurriedly pulled the shirt over the swollen mounds of her breasts and pushed the material of her skirt back down her legs before sitting up quickly.</p><p>A second later she was standing and sliding her feet back into the sandals she had somehow managed to lose. Or had pushed from her feet as he picked her up moments ago.</p><p>“You don’t look stupid at all.” Arching a brow, he strode to the chair across the room where he’d laid his clean clothing earlier.</p> <p>Pulling boxer briefs over his legs and then the raging erection that refused to soften, he sat down, never taking his eyes from her, and pulled white socks over his feet.</p><p>She wasn’t saying anything more.</p><p>Her arms were crossed beneath her breasts in a classic defensive posture as he almost gave in to the urge to sigh wearily.</p><p>Standing, Jed picked up an ink pen from the table next to him before moving to her once again.</p><p>She always carried her date book, with a small sketch pad in it, with her. At the moment, it was tucked in the side of the cleaning carryall she’d placed on the floor when she entered the room.</p> <p>Bending, he pulled the five-by-seven leather-bound journal from the side pocket, flipped it open, then quickly scrawled his cell phone number in the back. The sketch pad enclosed with it was filled with colorful sketches of clothing designs and scrawled with notes. He would have loved to flip through the new designs he only glimpsed, but knew from experience she’d become immediately defensive.</p><p>“What’s that for?” she questioned warily as he finished.</p><p>Tucking the book back in place, Jed straightened and stared down at her with a sense of heavy disappointment.</p><p>“When you decide you can give me a chance to prove that I have no intention of tying you down, Piper, then give me a call.” Yeah, he knew at least part of her problem.</p><p>Strong men, men born with the same arrogant determination her Mackay brother and cousins possessed.</p><p>Capping the pen, he tossed it to the bureau close to the bed, then turned and moved back to the clothing he’d abandoned moments before.</p> <p>He was aware of her watching him as he pulled on his jeans, secured the belt he’d already pushed through the belt loops, then pushed his arms into the white, long-sleeved dress shirt he’d chosen to wear.</p><p>White was for meetings; dark colors were for on the job. And all of it was bullshit, despite the sense of fulfillment he was getting from it. Far more fulfillment than the daily lies and undercover crap he was forced to practice.</p><p>“Why would I be afraid you could even come close to tying me down, Jed?” she finally asked, her lips curling into an amused little smile of disbelief. “Really? Do you think I’m attaching more to this”—she waved her arm toward the bed—“than what you intend?”</p><p>Using the chair once again, he sat down, pulled on his boots, and never took his eyes from her.</p><p>“Let’s hope you were,” he told her as he finished and rose to his feet once again. “Because, trust me, Piper, I have more intentions than you could ever imagine.”</p><p>There was the fear.</p><p>It flashed in the bright green of her eyes and tightened her expression as she fought to hold back the response. Hell, she was fighting to hide that fear from him, and he hated it.</p><p>“Good Lord,” she muttered, suddenly reaching down for her bag. “I’m out of here. Remind me to make damned sure you’ve left before I come in to clean your room again.”</p> <p>“I wouldn’t put chains on you, Piper.”</p><p>She paused, her hand on the doorknob, her face turned from him as her head lowered.</p><p>“I don’t know what you’re talking about.” The edge of anger in her voice wasn’t nearly as well hidden as he was certain she would have liked.</p><p>“Yeah, you do, Piper.” He rejected the instant denial she gave the moment she turned her back on him. “You think if you take me as a lover then you’ll be exchanging your brother’s protectiveness for one far more permanent.”</p><p>“My brother’s protectiveness? Is that what you call it?” She turned back to him then. “Trust me: They named my brother well when they nicknamed him Dawg. He’s tenacious, and guards his territory like a junkyard dog. And he sees every damned one of his sisters, as well as our mother, as his territory. It wouldn’t matter who we took as lovers, he’d still be hovering over us like a damned pit bull.”</p><p>There was no anger or heat in the words, only a sense of regret and uncertainty. In the past year, her life hadn’t exactly been her own, as her brother did everything in his power to ensure the danger that had threatened her older sister didn’t touch the younger ones.</p><p>“Nevertheless,” he said softly. “I wouldn’t put ties on you. I wouldn’t treat you as though you didn’t have the good sense to understand whether your life was in danger or not, and the intelligence to know whether you can live life as usual, sit tight, or just plain hide.”</p><p>She watched him warily. “You’re the same type of male Dawg, Rowdy, and Natches are.” She finally informed him, and it was clear she believed it to the bottom of her soul. “Having you for a lover would be like sleeping with human handcuffs.”</p><p>God help him, he swore he could see the pain and disillusionment filling her very soul. It was in the weariness of her voice and the soul-deep certainty that filled it.</p><p>“I would defend you with my life,” he admitted. “But I would also defend your right to a life, Piper. When you decide you’re tired of being a frightened little girl rather than the independent woman I know you are, then let me know. Perhaps once you’ve figured out which you are, then we can resume all the pleasure we were interrupted in this morning.”</p><p>Her shoulders tightened, defiance and denial immediately flashing in her gaze.</p><p>Jed didn’t hang around to hear her argument or her reasons for her beliefs; they would just piss him the fuck off.</p><p>He knew the past year had been hell on her and her younger sisters. Eve, the eldest, had pranced from the suite she’d lived in for the past five years and moved in with the government agent she was now engaged to, perfectly content to fight her battles of independence and keep her opinions private within the secured houseboat they were currently living in at the lake.</p><p>Eve had left her younger sisters to face the fallout with her brother and cousins. Her sisters, though, had never been given a full explanation of why that overprotectiveness had suddenly increased, or when it would end. Though he knew Piper had her suspicions.</p><p>Jed couldn’t explain what had happened either, not yet, not until he knew Piper understood his intentions where she was concerned.</p><p>But hell, in order to make her understand them, he was going to have to figure them out himself.</p><p>One thing was certain: He intended to have her in his bed. And he sure as hell didn’t intend to let her go anytime soon once he had her there.</p><p>Hell, why couldn’t he imagine ever letting her go, period?</p><p>ONE</p><p>ONE MONTH LATER</p><p>She was going to cave.</p><p>Piper could feel it coming. She could feel that bond of pleasure Jed had created four weeks before tightening between them, pulling them together.</p><p>She’d taken Eve’s suite on the first floor of Mackay’s Bed-and-Breakfast Inn after her sister had moved in with her lover, Brogan Campbell.</p><p>Brogan had been staying in the suite next to Eve’s for the two years he had been there doing whatever it was he was doing. She had a feeling he was a hell of a lot more than a building contractor or supervisor or whatever the hell he claimed to be. She was all but certain he was a covert agent and working directly with her mother’s lover, Timothy Cranston.</p><p>And she highly suspected both Jedediah Booker and the other contractor staying at the inn, Elijah Grant, were Brogan’s partners.</p><p>There had been strange things going on in Somerset—hell, in Pulaski County, period—for the past few years: thefts that didn’t make sense, strangers who knew far too much about the people and the mountains where Piper now made her home. And far too many “disappearances” of several of the criminal elements in the county.</p><p>It was damned freaky.</p><p>And she knew Jed was involved in it.</p><p>She watched them, she listened to the gossip and rumors that moved through the county, and she had a hell of an ability to tie together things that at first might not appear connected.</p><p>It was a talent she’d often heard Dawg had as well.</p><p>It didn’t matter what kind of talent she had. She could be as fully trained as any agent who had ever worked with her brother and he’d still treat her like a five-year-old.</p><p>And so would Jed.</p><p>Pulling the older-model Jeep into the driveway of the post office, she set the parking brake before turning off the ignition and moving from the vehicle.</p><p>Sliding the small orange notification card from her purse, she looped the bag’s strap over her shoulder and pushed open the glass door leading into the building.</p><p>“Hey there, Piper.”</p><p>“Piper, how’s it goin’ . . .”</p><p>“Hello, Piper, missed you last weekend. . . .”</p><p>“Hey, Piper, Dawg going to let you come out and play this weekend?”</p><p>She heard it every time she ran into the usual crowd of summer weekend partiers. Because Piper, normally the life of the party, had been absent or joined by her brother or cousins every time she tried to slip out to one of the lake parties. A Mackay always arrived within minutes of her showing up, and what was the point of staying if she was being guarded? She returned the greetings, answered where she had to, and waited patiently in line to sign for the certified letter she’d been notified was waiting for her.</p><p>The New York City address hadn’t really meant anything to her; neither had the name of the sender: S. Chaniss.</p><p>Accepting the envelope from the young clerk behind the counter, Piper thanked her quietly before making her way back to the Jeep.</p><p>Closing herself in and restarting the ignition, Piper flipped on the AC and quickly tore open the envelope.</p><p>She scanned the letter first; then, as disbelief set in and her heart began racing furiously, she read it more slowly.</p><p>Her hand began to tremble. Excitement began to build.</p><p>She’d been making her own clothing designs since she was a child, and for nearly as long she had been sewing those designs together. She’d learned early how to use a needle and thread, and she’d torn her fingertips to ribbons as a child to perfect each and every stitch.</p><p>Now . . . now someone had noticed them. Someone of such renown in the fashion world that she had never imagined he would show an interest in her work.</p><p>Eldon Vessante, one of the biggest names in the New York fashion scene, had, for several years, been bringing in hot new designers, up to three a year, and staging exclusive runway shows for them.</p><p>By mentoring new talent he’d made an even bigger name for himself, and each designer he’d mentored was still a hot topic among the fashion world. And their designs were still being worn by models, movie stars, and the rich and famous.</p><p>Piper had sent several of her designs to the Vessante panel more than a year ago.</p><p>No one knew she had submitted the required six designs to the Vessante team. She hadn’t even told her mother. Hell, she’d forgotten about it months ago when no response had been forthcoming.</p><p>His assistant had sent the letter—she quickly checked the date—two days ago?</p><p>Oh, my God—they had chosen her designs!</p><p>She wanted to scream.</p><p>She wanted to jump out of the Jeep and announce it to everyone on the street as they made their way into the post office and various businesses that lined the sidewalk.</p><p>She wanted to call her mother and Dawg. . . .</p><p>Whoa.</p><p>Bad idea.</p><p>Very, very bad idea.</p><p>She really wanted to call Jed, and that was an even worse idea, because there was no way, despite his promise, that he wouldn’t let Dawg in on where she was going and what she was doing.</p><p>She read the letter again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The excitement was about to get the best of her.</p><p>This was her dream. It was that one-in-a-million shot to realize every dream she’d ever had of what she could accomplish with the talent she had.</p><p>And she couldn’t tell anyone.</p> <p>She lifted her head, moving her gaze from the letter to stare through the Jeep windshield, her excitement suddenly overshadowed by a heavy sadness. If she dared to say anything to anyone, then she would end up with more bodyguards on that trip than the queen of England. And wouldn’t that make a hell of an impression?</p><p>If she thought for a moment that Dawg, Rowdy, or Natches would consider just one of them accompanying her, then it might have swayed her. She knew better, though. For the past summer, they seemed to be everywhere together. Piper had even gone so far as to ask them whether they were married to their wives or to one another.</p><p>She’d even questioned why. Why had her sister been kidnapped the summer before? Who had done it? Why had they done it? All she’d received in answer was a closed expression and change of topic. And the certainty that her brother and cousins, along with Timothy Cranston, were involved in something far more dangerous than they wanted their sisters to be aware of.</p><p>Carefully pushing the letter back into the large envelope it had arrived in, she turned it over and stared at the address once again.</p><p>S. Chaniss, the address read. New York City.</p> <p>There was no way anyone at the post office could really place exactly whom the letter was from or what it contained. Hiding it and the contents from curious eyes wouldn’t be too hard.</p><p>Putting the Jeep in gear and pulling from the post office parking lot, she turned the vehicle toward home.</p><p>This sucked.</p><p>The rebellious resentment that had been brewing inside her for the past year flamed through her senses with a suddenness that made it nearly burst into full-fledged anger.</p><p>It simply wasn’t fair. She should have been able to shout this accomplishment far and wide. At the very least she should have been able to race to the boutique where she sold many of the unique clothing designs she created.</p><p>She couldn’t even do that.</p> <p>Her fingers tightened on the steering wheel as she drove out of town and made the turn toward Mackay’s Bed-and-Breakfast Inn.</p><p>As the renovated farmhouse came into view, Piper couldn’t help but acknowledge the fact that had it not been for her brother Dawg, then her mother would have died and she and her sisters would have been worse than homeless.</p><p>They’d been abandoned by Chandler Mackay long before the Department of Homeland Security had found the small house he’d purchased for her mother when he’d brought her from Guatemala. When they’d been thrown from that home, her mother, Mercedes, had been horribly ill with a lung infection the doctors had been unable to treat.</p><p>It was only after Timothy Cranston had brought them to Somerset and introduced them to Dawg that their lives had changed. Dawg had ensured that her mother’s medical care was paid for while Piper and her sisters had found security, and they had all found a family unlike any Piper could have imagined.</p><p>There was another side of that coin, though.</p><p>With the security, acceptance, and love the Mackays had given her and her family there was the heavy-handed overprotectiveness her brother and male cousins exhibited.</p><p>It was so heavy-handed that for the past year she and her sisters—except the eldest, whom Piper actually blamed their present state on—had no hope of actually living outside the stifling watchfulness they were suddenly surrounded with.</p><p>Slip out to a lake party and what happened? Before they could finish their first beer either Dawg, their cousins, or one of their cohorts—Sheriff Mayes, Chief of Police Alex Jansen, or some other tough-assed Mackay male friend—was there with an eagle eye.</p> <p>Forget even considering the unmentioned search she had begun for a lover. She was fated to remain a virgin for the rest of her days, evidently.</p><p>At twenty-four, Piper considered herself far too old to have not taken a lover. And as much as she would have loved—loved—to have taken Jedediah Booker to her bed, the last thing she needed was one of her brother’s watchdogs keeping a leash on her.</p><p>Pulling into the inn’s parking lot, Piper tried to push back the regret and the hunger she couldn’t keep from building inside her body. The sensitive flesh between her thighs felt swollen, aching for a touch. Her clit actually throbbed, and she knew damned good and well that only a man was going to put out that particular fire.</p><p>God help her, she didn’t want a man as restrictive and just as protective as her brother and cousins. She wanted a lover, a friend, and a partner. She didn’t need a keeper.</p><p>It was Saturday night.</p><p>She had a week to make plans to slip from Somerset and make her way to New York. She was going to have to essentially escape. If that was possible. Because if Dawg had even a suspicion she was leaving town for any reason, then he would have one of his buddies and/or employees or agent-type acquaintances on her ass so fast it would leave road rash on her senses.</p><p>That, she didn’t need.</p><p>She knew the world she wanted to move within, and she knew for damned sure that neither her brother and cousins nor their overprotective friends would move well within it.</p><p>So, how to escape a town where the Mackays had eyes and ears everywhere?</p><p>Everywhere.</p><p>No doubt it wouldn’t be easy.</p><p>It would require a small amount of lying through her teeth.</p><p>Piper smiled.</p><p>Hell, she could do it.</p><p>She was, after all, a Mackay.</p><p>TWO</p><p>“You are up to something.”</p><p>Piper froze at the sound of Jed’s voice as she answered the call on her cell phone.</p><p>Lowering the smart phone, she glared at the number.</p><p>Piedmont’s Pizza.</p><p>“Since when did you begin using the phones at pizza houses?” Mockery filled her voice and she knew it.</p><p>A chuckle rasped across her senses. Even through the phone lines it had the power to weaken her knees.</p><p>“For some unknown reason my caller ID refuses to behave properly,” he drawled. “Perhaps they had the number before me.”</p><p>Yeah. Okay. She’d let him get away with it, but she was highly dubious of the explanation.</p><p>“What do you want?” She tried for a vein of irritation in her voice, but she couldn’t help the fact that she was pleased he’d called.</p><p>And she shouldn’t be. He was bad news and she knew it, especially where her determination to hold on to the secret of her upcoming trip was concerned.</p><p>She’d wanted to tell him so badly—him more than anyone else, she was beginning to think.</p><p>“I want to know what you’re up to, of course.” His voice lowered, the question carrying an interesting sexual connotation.</p><p>Or did she just want to imagine there was something sexual there?</p><p>“What do you think I’m up to?” she countered, rather than denying the statement.</p><p>He was like her brother: He’d never believe an instant denial. It was their mind-set or something. They knew the sound of a denial in truth and in deception. And Piper wasn’t much of a liar.</p><p>She much preferred simple evasion.</p><p>“What do I think you’re up to?” Amusement filled his voice.</p><p>The sound of it had a smile tugging at her lips.</p><p>“Yeah, what do you think I’m up to?” she repeated. “Surely you have an opinion on what it could be.”</p><p>He was fun to talk to; she’d known that years ago, after he’d first taken up residence at the inn.</p><p>“Sweetheart, when it comes to a Mackay, it could be anything and everything,” he drawled.</p><p>“You’re talking about my sisters, not me,” she surmised playfully, though her tone was completely serious. “I’m the quiet Mackay, remember?”</p><p>She almost gave in to a light laugh at his disbelieving snort. “Quiet one? Nah, you’re just the sneaky one.”</p><p>She shook her head at him as she began folding her silk-and-lace panties and bras and placing them in the small suitcase.</p><p>“Shouldn’t you be in bed asleep?” she asked as she noticed the time was well after midnight. “I thought you worked on Mondays?”</p><p>“Inspections tomorrow,” he told her. “My foreman and the job supervisor know what they’re doing. I think I’ll take the day off.”</p><p>Oh, great. Just what she needed: Jedediah suspicious and possibly keeping an eye on her.</p><p>“The job is near completion then?” His company, along with several others, was building the new industrial office park and warehouses outside of town. Jed’s family’s company, Booker and Son’s Construction, had won the bid to build several of the huge industrial buildings.</p><p>“About halfway,” he answered her. “You get to put up with me another couple of years whether you like it or not.”</p><p>“I think Mom has adopted you,” Piper reflected as she carefully folded one of the frilly skirts and its matching bag that she’d made into the luggage next. “You’ve been here since the inn opened.”</p><p>“Yeah, and she gave us a hell of a deal for the long term,” he agreed.</p><p>“I’ll tell her to consider raising the rent,” she threatened, holding back her own laughter as his chuckle echoed across the line.</p><p>“I think she wants to adopt me and Elijah,” Jed teased her. “She likes us.”</p><p>“Not after Brogan took Eve out of the house,” she informed him. “She’s still not happy over that one.”</p><p>Neither were Dawg and their cousins, Piper thought. As a matter of fact, “irate” was a mild description of how they felt about it.</p><p>Mercedes Mackay was taking it particularly hard, though. Letting her daughter go hadn’t been easy for Mercedes, despite the fact that she dearly loved the man Eve was currently living with.</p><p>“We’re not related to the bastard,” he said with a grunt.</p><p>“Aren’t you?” she questioned him lightly. “You could have fooled me. You, Elijah, and Brogan play a good game, Jed, but I’m starting to wonder if you’re not brothers or something. The three of you are definitely cut from the same cloth.”</p><p>“Meaning?” Now, wasn’t that tone just slightly arrogant?</p><p>“Dominant, domineering, stubborn, intractable, opinionated—shall I go on?”</p><p>“Hell,” he muttered, though she caught the slight vein of amusement in his tone. “I was just hoping for a little sex, Piper, not a complete assassination of my character here.”</p><p>“Phone sex? Why, Jed, I’m a good girl,” she exclaimed as though scandalized. “I can’t believe you’d call me for such a thing.” Her voice dropped. Piper let it become breathy as she allowed herself to remember his kiss, his touch. “It’s none of your business if I’m lying here playing with just the most amazing little toy.”</p><p>“Huh?”</p><p>His surprised little exclamation had satisfaction curling her lips.</p><p>“Shame on you, Jedediah Booker,” she chastised him, barely holding back her laughter. “My momma would be heartbroken to know what a dirty dog you are. Just simply heartbroken.”</p><p>“What kind of toy?” The growl in his voice had her stomach tightening. “Come on, Piper; just tell me what it is. What are you doing with it?”</p><p>The wicked, sensual, sexual pitch of his voice made her wish she were playing with a toy.</p><p>“Why, that’s just none of your business, Mr. Booker,” she informed him with all the sweet Southern-belle charm she could inject into her tone. “I guess you’ll just have to find some other way of satisfying your curiosity.”</p><p>“I can pick the lock on your door,” he told her then. “I’ll steal the damned thing.”</p><p>“Even if it’s you I’m thinking of when I use it?”</p><p>She disconnected the call.</p><p>Tightening her thighs as her clit pulsed in time with the throb of need in her vagina, Piper covered her face and fought back the highly unwise action of answering the phone again as it buzzed repeatedly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was dangerous.</p><p>Jed was far too dangerous.</p><p>She might be as bold and just as damned adventurous as any Mackay, but Piper liked to think that unlike her older sister, she also had enough common sense to keep from jumping into the fire.</p> <p>Nope, the frying pan suited her just fine.</p><p>Pulling in a deep breath, she finished packing the suitcase and garment bag she’d chosen to take to New York with her.</p><p>She would catch the train in Louisville, and once she got to New York City she’d rent a car.</p><p>She didn’t much care for driving in Manhattan, but sometimes a girl just had to do what a girl had to do. If she dared to rent a car in Somerset or in Louisville, then the chances were far too great that Dawg would find out. He had too many friends in far too many places. And she knew firsthand that he was on a first-name basis with every reputable car-rental agency in a five-county radius.</p><p>That meant just getting to New York City without her brother or her family learning she’d left would be chancy enough.</p> <p>Luckily, there was one friend she could depend on.</p><p>She couldn’t tell her mother, her sisters, Tim, her brother or cousins, or her nearby friends or neighbors—she sighed at the thought of it—but she’d managed to make a few friends among the tourists who traveled through Somerset each summer and stopped at the small boutique her designs sold in. Once they sold, it wasn’t unusual for the buyers to contact her, interested in other unique wardrobe items. From those buyers, she had made several friends.</p><p>Those tourists didn’t live in Kentucky, and they had no idea how powerful her brother thought he was. A quick call to one of them, Amy Seavers, had resulted in a fake ID and a train ticket, as well as a ride to the train station.</p><p>She was all set and ready to go. All she had to do was slip out with her bags and be waiting at the designated location when Amy’s sister, Gypsy, arrived.</p><p>Blowing out a hard breath, Piper glanced at the patio doors, her heart beating hard and fast with the thought that Jed didn’t make idle threats. There was no doubt in her mind that he knew exactly how to pick the locks on her doors. There was no doubt he would pick them if he were in the right mood.</p><p>She rather doubted he’d learned that trick in the construction business. Just as she doubted her sister’s fiancé, Brogan Campbell, was slipping into the upper story of the inn in the middle of the night because he missed anyone there.</p> <p>Hell, no. Those nights Piper had watched the shadowed figure easily pull himself to the second-floor balcony and slip through the glass doors that led to Tim’s office, she’d known exactly why he was there.</p><p>Timothy liked to tell anyone and everyone who dared to ask that he was retired. Learn the definition of the word, he’d growled at the lawyer who’d shown up several weeks before in regard to the deaths of several suspected homeland terrorists the summer before.</p><p>Piper had heard the words “Eve” . . . “kidnapping” . . . “boat,” and “Campbell” just before he dared to say, “Special Agent Cranston.”</p><p>She bit back a smile at the thought of how quickly Tim had cut him down and informed him in no uncertain terms that retirement was a glorious thing.</p><p>Retirement, her ass. Timothy, or Tim as she and her sisters often called him, was about as retired as Dawg and her cousins were. Just retired enough to be able to claim they weren’t involved in anything, but involved enough to ensure they all knew exactly what was going on in their little corner of the world.</p><p>Closing the cases quickly, Piper moved to the closet and stored them out of sight, just in case Jed decided to make a midnight visit.</p><p>If he saw her bags and realized they were packed, he would immediately demand to know where she was going. Once he knew . . . hell, she may as well take out an ad.</p><p>There wasn’t a doubt in her mind that Jed would tell Dawg just as fast as he could make the call. Then Dawg and her cousins would arrive and insist on accompanying her.</p> <p>If she allowed it to happen.</p><p>There wasn’t a chance in hell she would allow it, she thought wearily. The very thought of it was enough to send a shudder racing through her body.</p><p>She closed the door and moved toward the bed, then came to a hard stop.</p><p>Swinging around, Piper moved to the door that led to the sitting room of the suite and swung it open as her heart began pounding with enough force that she swore she could feel it in her throat.</p><p>And there he stood.</p><p>She crossed her arms beneath her breasts and leaned against the doorframe that connected the sitting room with the bedroom.</p><p>“What the hell are you doing here?” It was all she could do to fight back her amusement as well as the surge of sexual intensity sweeping through her.</p><p>He wasn’t wearing a shirt.</p><p>The broad, muscled expanse of his chest was bare. A light covering of dark blond curls feathered over the dark flesh and arrowed into the snug band of his jeans. And he was aroused.</p><p>Standing in the middle of her sitting room, bare chested and barefoot, he stared back at her with pure sensual intent burning in his dark, navy blue eyes.</p><p>“You’re dressed,” he accused her, his voice rough as he paced closer to her. “I thought you were naked and playing with toys.”</p><p>“No, you didn’t.” Piper could feel herself trembling from the force of the need racing through her. “That’s just an excuse, Jed.”</p><p>“Yeah, it’s just an excuse,” he agreed as he stopped before her. “An excuse for this.”</p><p>She hadn’t expected it to happen so fast—that his lips would be on hers, his fingers curving around the back of her neck, holding her in place as his lips took possession of hers.</p><p>She hadn’t expected she would weaken so fast. That her nails would dig instantly into his shoulders, that she would lean into him, against him, so eager for him that her body was quivering in excitement.</p><p>What the hell was this? What was he doing to her?</p><p>Then thought became impossible. Any possible chance of a denial evaporated as pleasure began to build with a fiery force.</p><p>Oh, hell, yes.</p><p>Desperate to get closer to him, she wrapped her arms around his neck as he lifted her against him, holding her close in his arms as he lifted her from her feet.</p><p>She was weightless.</p><p>Gravity couldn’t touch her, and neither could the reality of common sense.</p><p>“Whoa. Oh, hell, no!”</p><p>Piper found herself suddenly spun around, released, and pushed protectively behind Jed in a move so powerful she knew she’d never figure out how he managed it. But one minute she was in his arms kissing him for everything she was worth, and the next second she was pushing past him to confront her big brother.</p><p>The big lug.</p><p>He was staring at them as though he had never witnessed such a thing.</p><p>“Forget what a couple kissing looks like?” she snapped as he suddenly lost that surprised look and turned a glare on Jed instead.</p><p>Moving to Jed’s side rather than behind him, Piper crossed her arms over her breasts and stared back at Dawg furiously. “When are you going to learn to knock at the doors to our suites rather than barging in, Dawg Mackay?” she demanded. “I could have been naked or something.”</p><p>“In the living area?” he demanded, outraged. “And I’ve never knocked, dammit. You have a bedroom for this crap anyway.”</p><p>“It’s my suite,” she informed him. “I could be naked in either room if I want to be. And why should I have to do everything private in my bedroom? I had the door locked. I did not tell you to unlock it. Try knocking.”</p><p>He didn’t even look at her. He was too busy glowering at Jed.</p><p>Neither man blinked.</p><p>“I was going to say good night,” he snarled, finally sparing a short glance her way before turning back to Jed with a killing look.</p><p>“Good night, then.” She waited for him to leave.</p><p>Jed was glaring at Dawg just as fiercely as Dawg was glaring at Jed, and she was getting tired of it.</p><p>Dawg’s disapproval was clear.</p><p>Piper sighed in irritation.</p><p>“Both of you get the hell out of my room,” she suddenly ordered, anger beginning to flare inside her. “Get out. Go away. Leave me the hell alone.”</p><p>She had a ride to catch, and she had no intention of missing it. Especially not so she could babysit two grown men who were suddenly acting like two dogs over a bone.</p><p>Jed turned his glare on her. “We weren’t finished.”</p><p>“The hell you weren’t,” Dawg answered for her.</p><p>Propping her hands on her hips, she turned a fierce stare on both of them.</p><p>“Get out of my room,” she snapped again. “If I have to ask one more time I’m calling Mom and Tim and you can deal with them.”</p><p>“That little bastard Timothy doesn’t scare me in the least,” Dawg informed her, his celadon gaze sparking with anger.</p><p>“Well, Mom does scare you,” she reminded him. “And trust me, if she knew what was going on right now she’d have both your heads.”</p><p>They both grimaced and began retreating.</p><p>Jed moved for the connecting door as Dawg backed to the door that led to the hall. As each door closed Piper moved to it quickly and locked it securely.</p><p>Good God, how the hell was she supposed to slip out of the house and out of the state with this mess going on?</p><p>One thing was for damned sure: if she’d had second thoughts about how her brother or even Jed would act if one of them were to go with her, then she had her answer now.</p><p>They’d act just as they were: like two Neanderthals with nothing better to do than beat their chests and roar out their aggressions.</p><p>Not what she needed this week.</p><p>Oh, God, she didn’t need it this week.</p><p>The week she was going to find the dreams she’d worked for all her life.</p><p>She was slipping out, making her way across the darkness of the porch, two traveling bags in hand.</p><p>Jedediah lowered his head for a second before lifting his gaze and forcing himself to watch her make her way from the inn. Curling his fingers into fists, he held back the urge to follow her. To stop her.</p><p>If he stopped her, he’d be no better than her brother or her cousins. They were doing all the wrong things for all the right reasons, but that didn’t make it bearable for the impulsive, bright, beautiful little star they were smothering.</p><p>Crossing his arms over his chest, he leaned against the heavily leafed tree he hid beneath and just watched her. There was no need to follow her. She wasn’t headed to a party, a friend’s house for a night out, or even one of the local bars.</p><p>He’d known that when he’d talked to her on the phone as he’d watched her through the closed-circuit wireless camera that had been installed in the bedroom when her sister occupied it. It hadn’t been removed when Eve had moved out.</p><p>As he had watched her pack he had known she was heading out of town.</p><p>With a friend? Most likely a lover, he thought wearily, wondering at the sense of possessiveness tightening his gut.</p><p>Hell, he’d waited too long to secure her to him, left it too late. He’d sensed that as he watched her packing earlier.</p><p>He was always careful when checking on her. He never interfered, never looked in on her when there was a chance of embarrassing her if she found out he was watching.</p><p>Sometimes, he just wanted to see her. See her relaxed, sleeping, or amused. Sometimes, he just wanted to make certain she was safe, nothing more. He’d seen her packing, though, and he’d been unable to resist calling her, hoping she’d confide in him. Hoping that talking to him, remembering the pleasure they’d shared, would change her mind if she was heading out to stay with a lover.</p><p>It hadn’t.</p><p>She disappeared around the side of the house.</p><p>Lowering his head, he stayed in place. He didn’t dare move, even under the pretense of returning to his own room. Because he knew he wouldn’t make it there.</p><p>Hell, no, he’d end up following her, and he’d make her hate him when he couldn’t help himself and persuaded her to stay. Persuaded her in a way that would ensure her pleasure—and her hatred. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Fuck, it was hard letting her go.</p><p>Rubbing at the ache in his chest, frowning at the tightness there, he wondered at the feeling he’d identified years before as a premonition, a warning of danger.</p><p>Who or what could be in danger?</p> <p>Maybe it was better that Piper was leaving for a few days after all. Her sister had nearly died the year before because she was too close to his partner, Brogan Campbell.</p><p>God help anyone who dared to threaten Piper Mackay. He would kill. Perhaps not for the first time, though it would definitely be the first time he’d killed over a woman.</p><p>She was worth killing for.</p><p>She was worth dying for.</p><p>The brilliance that was Piper Mackay couldn’t be contained. She was wild and free, bright and burning, and there were already too many men determined to tame that fire. To lock it in. To take the freedom she fought so valiantly for.</p> <p>He refused to become one of them.</p><p>Jed forced himself to move, to walk slowly and easily across the stretch of lawn that led to the inn and the suite he had taken next to Piper’s.</p><p>She was gone and he had no choice but to let her go.</p><p>That didn’t mean he liked it.</p><p>It sure as hell didn’t mean it was easy.</p><p>THREE</p> <p>Amy’s sister, Gypsy Seavers, was waiting exactly where Piper had directed her to the day before.</p><p>The small clearing just past the inn was far enough away that if the other woman had turned her lights off before pulling in, then there was no way in hell Tim could possibly see them. Yet it was close enough for her to jog to, even carrying the two bags she had brought with her.</p><p>“Trunk’s open.” Gypsy’s voice came from the other side of the vehicle as Piper moved for the car.</p><p>By the time she reached the trunk, Amy’s sister was standing next to it, lifting it for her as Piper threw her bags in. She took a good look at Gypsy’s face in the trunk’s light. Just to be certain she was who she was supposed to be, Piper told herself, realizing some of Dawg’s lectures on safety might have actually stuck in her mind.</p><p>The second Piper moved back from the trunk, Gypsy had it closed and was moving around her to the driver’s side.</p><p>“Ready to roll?” the other woman asked, glancing back as Piper watched her.</p><p>“Ready to roll.” A quick nod and Piper was opening the passenger door and sliding inside quickly before pulling it closed.</p><p>Gypsy’s door didn’t so much as squeak as she closed it and restarted the vehicle.</p> <p>She resembled Amy, Piper decided as the car pulled back out onto the main road and headed toward town.</p><p>The same amber or caramel hair, streaked with much lighter strands by the sun. She was slender, compact, and the jeans and racer-back T-shirt she wore showing off her lightly tanned, well-toned upper body made her appear smaller and more fragile than her diminutive five-foot-four frame already did.</p><p>“Amy and I were betting you wouldn’t make it out after she told me who your brother and cousins were.” Gypsy flashed her a quick, rueful grin. “I don’t know if I would have followed through after I learned Natches Mackay was your cousin if I hadn’t already promised.”</p><p>Piper stiffened, turning to stare back at Gypsy warily. Great, she knew Natches. Piper wasn’t even going to bother asking how yet. Only one question was uppermost in her mind. “Did you contact him?”</p><p>“Natches?” Flicking her a questioning look, Gypsy efficiently navigated the curvy mountain road that led to the interstate.</p><p>“Yeah.” Piper could feel that sense of freedom slowly disintegrating.</p><p>“Not hardly.” Gypsy grimaced. “Picking you up might piss him off at me, but calling him and letting him know would only add a shadow of distrust to my name if he ever actually meets me.”</p><p>Neither the resignation in Gypsy’s voice, nor her explanation, made sense.</p><p>“What do you mean?” Piper shook her head. “Wouldn’t it be the other way? He wouldn’t trust you if he learned you had helped me? Wouldn’t he trust you more if you contacted him?”</p><p>“Doesn’t work that way.” The other woman rejected the suggestion, her expression still a bit stiff, with an air of secretiveness. “I promised I’d help you before I knew who your cousin was. You don’t appear to be in any trouble, and my own sources verified how protective your brother and cousins are. If I called him without cause, no matter how much he would love to know where you are and who you’re with, then he’d count that as a betrayal of confidence. I’d be deemed untrustworthy, unless you were in trouble.” She threw Piper a quick, amused look. “Are you in trouble?”</p><p>“No trouble,” Piper promised her, breathing out a sigh of relief. “I just don’t need company, you know?”</p><p>She hoped Gypsy understood. Just as she hoped the other woman didn’t call Natches later.</p><p>“Sometimes a girl just has to do what a girl has to do. And sometimes she just has to do it alone,” Gypsy agreed as the lights from the dash emphasized the unsmiling expression she wore.</p><p>“Exactly,” Piper stated. “The New York fashion scene isn’t a place where any of them would get along well. It would be like placing a herd of bulls in a roomful of china. Forget the china shop. They would raze the shop and head for the warehouse.”</p><p>Gypsy gave a small, surprised laugh at the description before her amusement was quickly pulled back.</p><p>“I’ve heard that about Natche.” She gave a light laugh. “He was a legend in Afghanistan while he was there. One of the best damned snipers the Marines had, and better at covert intelligence than he had any right to be.”</p><p>Yeah, that sounded like Natches.</p><p>“How do you know him?” Piper asked. “Are you with Homeland Security, too?” That would be just her luck.</p><p>“Not hardly.” Gypsy’s lips tilted into a crooked smile. “I was with the Marines myself. Many of Natches’s missions in Afghanistan and Iran are used as training points now.”</p><p>Piper had heard Tim mention that several times, while Natches seemed rather proud of it.</p><p>“What are you going to do when they find out you’re gone, then?” Gypsy asked as Piper stared into the darkness and wondered what the trip would have been like with Jed.</p><p>“Hopefully, they won’t find out,” she stated irritably. “Because, trust me, New York City would never be the same if those three showed up there.”</p><p>She shuddered to even imagine the chaos the Mackay cousins could still manage to create.</p><p>“Best-laid plans and all that,” Gypsy pointed out. “Surely you have a plan, just in case?”</p><p>“I’m a Mackay; what do you think?” She grinned back at her friend’s sister.</p><p>“I think you have one,” Gypsy reflected. “But I think you’re not so sure of it, and I think you’re really afraid it won’t work.”</p><p>“And what makes you think that?” Unfortunately, she was right.</p><p>“Six years in the military. The last two in the investigative side of the military police. I can hear it in your voice, and I can see it in your face. You’re a piss-poor liar, aren’t you, Piper Mackay?”</p><p>“Unfortunately, that’s far too close to the truth,” Piper agreed.</p><p>It didn’t surprise her to learn Gypsy Seavers was some sort of investigator. She had that air of secretiveness and quiet watchfulness. “I left Mom a note. She’ll find it in the morning, and I begged her not to say anything. And for the first time in my life I lied to my mother. I told her I needed to get away from the male portion of the family and I was staying with friends.” She grimaced at the lie. “What she’ll actually end up doing is anyone’s guess.”</p><p>“And how long do you think it will take for your brother and cousins to find you?” Rueful amusement reflected in Gypsy’s voice.</p><p>They would find her far too soon if she didn’t get very lucky.</p><p>“Let’s hope it takes a while,” Piper suggested, terribly afraid that if she wasn’t very, very lucky, then her brother and cousins would find her far too quickly.</p><p>“What the hell do you mean, she’s not here?” Dawg rubbed his hand along the back of his neck in irritation as he faced Mercedes the next morning, barely holding back a glare. He needed to talk to Piper about what had happened the night before. Catching her with Jed Booker had reminded him all over again of what had happened with Eve the summer before. He didn’t want another sister in danger because of her association with one of Timothy’s agents. He also didn’t want her endangered because she was trying to hide it from him. And he definitely didn’t want to piss Mercedes off as he tried to find out where the hell she had gone.</p><p>Timothy, the quarrelsome little bastard, got all kinds of out of sorts if he managed to upset Mercedes over her “babies.” But he’d be damned if those sisters of his weren’t going to drive him to drink.</p><p>Their antics were making him seriously consider a nunnery for his daughter.</p><p>“Dawg, give her a break,” Mercedes ordered, though her voice was calm as she moved around the kitchen and cleaned up from that morning’s breakfast preparations. “You’ve hounded her, Lyrica, and Zoey for almost a year now. Everywhere they go, everything they do, and everyone they talk to is reported back to you so you can fuss at them over their friends, potential dates, and acquaintances. I warned you last year they were going to get sick of it. Piper just got fed up with it first.”</p><p>Her arms crossed over her breasts as she stared up at him, her expression tight with defensiveness as her determination to stand in his way became more than apparent.</p><p>“And you know why I’ve done it,” he reminded her. “Hell, I remember a time when you were all for it.”</p><p>Now that those stubborn, independent young women were crying on “mommy’s” shoulder, she was backtracking from the protective atmosphere just as quickly as she had agreed to it.</p><p>“A year ago.” One hand propped on her rounded hip as she faced him with fiery dark eyes. “When there was a chance she was actually in danger. Even you admit there’s nothing going on now, no one is watching you or the girls, nor is there any apparent backlash from what happened last summer. I believe, Dawg, you can’t let yourself accustom to life without that danger. It’s not fair to make the girls live such a life as well.”</p><p>He was not going to allow her to draw him into this argument, not after having this exact confrontation with Christa after returning home the night before, furious at finding Jed in Piper’s room, and Piper in Jed’s arms. His own wife had been quick to rip a strip of his hide, first for not knocking, and second for daring to butt his nose into his sisters’ sex lives again.</p><p>He did not want to know his sisters had sex.</p><p>He especially didn’t want to know who they were having sex with.</p><p>“Where’s she at, Mercedes?” He wasn’t going to give her the satisfaction of this argument. They’d already been down that road far too many times.</p><p>“I’m not telling you.” Pure stubbornness pulled at her expression.</p><p>As much as those girls looked like they could belong to him or his cousins, Rowdy and Natches, he had to admit there were times, like this, when he realized they looked just like their mother.</p><p>“Then I’ll have Alex put out an APB on her,” he warned, trepidation beginning to tighten the back of his neck.</p><p>Hell, he hadn’t expected levelheaded Piper to be the one to test her safety first.</p><p>“No. You will not. Attempt it. Dare to take this from her, Dawg Mackay, and I promise you neither I, my daughters, nor Timothy will ever allow you to forget it.”</p><p>He turned away from her, rubbed at the back of his neck, and grimaced in frustration.</p><p>“I don’t feel good about this,” he muttered as he turned back to her. “Mercedes, I don’t feel good about this at all.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The anger beginning to brighten her brown eyes dimmed, but he could see the concern in them as well.</p><p>“I don’t like it myself,” she admitted quietly. “She didn’t tell me where she was going, Dawg; I found out by accident. All she told me was that she had to get away. She slipped out in the dead of night because she trusted none of us to allow her the freedom she hungers for. Let her have her freedom, before we smother her to death.”</p><p>“A freedom that has the potential to get her killed?” he asked her wearily. “I understand the need, Mercedes, more than you know. But you know what nearly happened to Eve last summer. If someone targets one of the other girls in retaliation, and there’s no one there to protect them, what do we do then?”</p> <p>“We pray that doesn’t happen,” she whispered as the concern in her gaze threatened to turn to pure fear. “But you also have to understand, Dawg: Piper’s not a liar; nor is she one to make decisions such as this rashly. She was driven to it.”</p><p>He had driven her to it. He could hear the accusation in her tone.</p><p>Christa had warned him more than once that the girls were going to rebel against his protection and begin making decisions that would only endanger them. He hadn’t believed they would do so without first confronting him.</p><p>His sisters were fighters; they weren’t cowards.</p><p>“How can you be certain she’s safe?” he finally asked her worriedly.</p> <p>“I can’t, Dawg.” Her smile was gentle, compassionate. “All I can do is pray that if she’s in trouble she’ll call me. That and trust in the man Timothy has watching her.” She winked at him. “Watching her, Dawg. Allowing her to do what she has to do, what she wants to do, while an impartial third person stands ready to protect her rather than standing between her and what she needs. That’s the difference.”</p><p>He shook his head, worry tearing at him as he stared down at her, wishing, just as he had over the past six years, that he’d been able to protect Mercedes and the sisters he’d grown to love so much from his father’s cruelties before he had died.</p><p>He hadn’t known about them. No one had known about them but Chandler Mackay, and Chandler had done nothing to ensure their protection should anything happen to him.</p><p>“They’ll still get hurt.” That was part of what he couldn’t bear. “If not physically, then otherwise. They’re too trusting, Mercedes, and too innocent. If we don’t watch out for them—”</p><p>“Then they might get their feelings hurt or their hearts broken?” she suggested as she turned and began cleaning the stove. “We can’t keep them from getting hurt, Dawg. It’s life. You know that as well as I do.”</p><p>No, he damned well didn’t know that.</p> <p>They were innocent, gentle, and deserved far more than he knew they had waiting for them if no one was close enough to protect them.</p><p>“You do know it, Dawg,” she stated as she turned back to him, watching him as though she could read the silent denial raging through him. “You don’t like it. You don’t want to admit it, but you know it.”</p><p>He refused to accept it.</p><p>“I won’t let them get hurt, Mercedes. I promised you that when you brought them home to me. I told you I’d look out for them.”</p><p>He had promised them he would look out for them, and he was breaking that promise.</p><p>She shook her head slowly. “There’s only so much you can do, Dawg.” The compassion in her expression tightened his chest as he suddenly wished he had brought Christa with him for this confrontation. Maybe she could have talked some sense into Mercedes. On the other hand, she would have probably agreed with her.</p><p>“Dawg, give her this time, she needs it,” Mercedes said softly. “More than you know, she needs it.”</p><p>She needed it.</p> <p>But what happened if it was the chance an enemy needed to strike out at her?</p><p>What was he supposed to do then?</p><p>FOUR</p><p>Piper loved New York City.</p><p>The pace, the energy, the sense of excitement that seemed to permeate every corner of the city sank into her senses. Her heart beat faster. Blood rushed quick and furious through her veins, and the ordered chaos, the shopping throngs and ever-present sea of faces channeled a chaotic pace inside her own body and filled her with elation.</p><p>The first time Dawg and his wife, Christa, had brought her to the city had been to introduce her to the many and varied bolts of fabrics and exquisite costume jewelry and fake gems available in the small, out of the way shops and fabric stores there. Rhinestones, glittering crystals, clear sapphire – and emerald-colored stones—the choices seemed almost unlimited.</p><p>Now, five years later, she still found the little shops and stores impossible to leave once she began searching for the items she needed for each design—those already sketched and those that built in her imagination as she found hidden bolts of unique or discontinued fabrics, bows, ribbons, and glittering stones.</p><p>It was the first place she’d headed the minute she had rented her car that morning after arriving at the hotel.</p><p>The black four-door sedan was actually much smaller than she preferred for a four-door, but the latest trend in economy and fuel efficiency had also inspired a new generation of car designs that she simply wasn’t as fond of.</p><p>Driving in New York City wasn’t always safe, but it was rarely dull. Piper found her senses tuning in to the traffic, the bystanders, the lights and sounds of the streets as she drove outside the city toward the mountains that Eldon Vessante’s assistant had directed her to. The interview would take place at Vessante’s estate, rather than the hotel, and though she hadn’t anticipated the drive, she found it relaxed her, at least. Her nerves were less than settled at the thought of the upcoming meeting.</p><p>As she drove out of the city and entered the less congested interstate, she could feel her excitement building.</p><p>The change in time and location of the meeting was unexpected, especially considering the fact that his assistant had seemed less pleasant than she had when Piper had spoken to her the first time.</p><p>Following the onboard navigation, she found herself turning from the highway and moving onto a two-lane road that climbed slowly into the surrounding mountains. Another turn and she passed the sign for Vessante Way, the designer’s estate the assistant, S. Chaniss, had told her they were meeting at.</p><p>Piper was feeling more confused than excited as she pulled into the curving driveway in front of the three-story estate and gazed up at the stone steps leading to the massive double front doors.</p><p>There were no attendants present. No one was rushing to park her car, and only a small, bright red little sports car ahead of her was present.</p><p>Stepping from the rental car, she pulled free the wide portfolio she’d brought with her and gazed around the heavily forested area for long seconds before moving slowly to the steps.</p><p>As she reached the top, the doors swung slowly inward to reveal a towering butler.</p><p>Standing at six and a half feet at the very least, his brown gaze icy, his expression implacable, he gave every indication of being ex-military, and as hard as granite.</p><p>“Ms. Mackay.” He nodded down at her with a slight inclination of his head. “Mr. Vessante is awaiting you in the drawing room.”</p><p>The drawing room? Those actually still existed?</p><p>“If you’ll follow me.” It may have been worded as a request, but the tone was a straight-up order.</p><p>Her brother and cousins had ensured that she recognized the difference.</p><p>Before he turned away, his gaze raked over her with a glint of sudden curiosity, or familiarity. She’d met a lot of men over the years whom her male kin knew, and she was certain she had never met this man, yet that look gave her the uneasy feeling that he knew her.</p><p>Turning, he indicated she should follow him.</p><p>Dressed in black, perfectly creased slacks and a pristine white shirt that didn’t have a single wrinkle, he led her through the wide, steel-colored marble foyer that seemed to extend a mile or more. Reaching the end of the room-size entryway, he turned sharply to the right and a set of doors at the end of the short hall.</p><p>A sharp rap of his knuckles was answered in seconds. The butler gripped the doorknobs, pushed the doors open, then stood back for her to enter.</p><p>The heavy Gothic design of the room was a shock. Piper stepped from the more contemporary foyer and tried to control her amazement as she stared around the room. Dark, heavy woods, leather furniture with carved clawed feet, and thick, dark draperies over the windows that blocked the early summer sunlight and sent a rush of trepidation rushing through her.</p><p>She jumped, startled at the heavy snap of the doors closing behind her before swinging forward again. From the corner of the room, a light chuckle drew her startled gaze and she watched as Vessante rose and moved slowly into the center of the room. He approached her slowly, his head tilted to the side, icy blue eyes regarding her mockingly.</p><p>“You seem nervous.” His tone was less than sincere as he attempted to put on a friendly expression.</p><p>What was going on here?</p><p>“Where are the other designers?” Piper blurted, then winced. Not exactly the most graceful greeting, but this private meeting wasn’t what she’d been expecting at all. She had to force herself to stay in place as he moved within inches of her, his gaze dropping to her breasts as his right hand reached out.</p><p>Piper accepted the handshake, the sensation of his damp palms giving her a slightly queasy feeling.</p><p>Something wasn’t right here. As a matter of fact, something felt very wrong.</p><p>“The others couldn’t make it.” Pitched low, his tone still grated against her senses.</p><p>He wasn’t much taller than she was. At five-seven, Eldon Vessante was so skinny he was bony. There was an effeminate air about him that the overly long white-blond hair did nothing to dispel.</p><p>His face had a skeletal appearance, with high, sharp cheekbones and a long blade of a nose. The photographs she had seen of him had definitely given him more of a substantial air.</p><p>God, he reminded her of a rat.</p><p>Where had his reputation as a playboy come from?</p><p>“I see you brought your portfolio.” He glanced to the large, square design folder she carried.</p><p>“Yes, I did.” Gripping the folder with both hands now, she wondered at the sick feeling of panic growing inside her. “I assumed your assistant and the other designers with your company would be here.”</p><p>She wished they were.</p><p>She hated the feeling of being trapped, alone with him.</p><p>“We don’t need them, my dear,” he drawled, the slight, feminine pout of his lips more apparent as he smiled slightly.</p><p>He might not need them, but she did.</p><p>“Come, shall we sit and discuss our new venture?” With a wave of his hand he indicated the sitting area on the other side of the room. “I wasn’t really considering another designer this year.” He turned as though her acquiescence were a foregone conclusion. “One must be certain to choose carefully. To ensure the market doesn’t become overly glutted, you understand.”</p><p>Piper followed, but she did so warily, listening to the precise, self-important tone of his voice rather than the words themselves.</p><p>“You’re not contributing to the conversation, my dear. That’s quite rude of you.”</p><p>Eldon paused in the middle of the sitting area, one hip jutting forward as he lifted his left hand, palm upward, as though giving her the floor.</p><p>“I was listening,” she excused her nonparticipation, still watching him carefully as she moved into the sitting area.</p><p>“Have a seat, please.” He gestured to the sofa with an outstretched hand. Piper perched on the edge nervously as he remained standing.</p><p>“Would you like coffee? Or perhaps tea?” he asked, still standing with one hip jutting slightly forward, the position, as well as her own, ensuring her a perfect view of his thighs, should she want to look.</p><p>She didn’t. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, thank you.” Clearing her throat and glancing around the room she wished she could push back the panic attack still threatening to shorten her breathing.</p><p>She hadn’t had one for years, not since arriving in Kentucky, actually. Now her insides were shuddering, her throat tightening, the unreasoned fear rising inside her like a fast-moving sickness.</p><p>“Why not?” The hand he had been extending went to his hip in a classically feminine gesture of irritation that did little to ease her apprehension.</p><p>Blinking back at him, she fought to come up with an answer other than the fact that the thought of anything in her stomach made her want to throw up as the panic built inside her.</p> <p>“Tea,” Eldon stated, finally shifting his stance and brushing the thin strands of white-blond hair back from his rodentlike face. “You look like the tea sort.” Shifting his attention from her to the door, he yelled, “Broecun!”</p><p>The door opened.</p><p>His expression as impassive as moments before, the bodyguard, butler, whatever the hell he was, stepped just inside the room.</p><p>“Mr. Vessante?”</p><p>“Have Leda bring in a pot of tea, please.”</p> <p>Cold, cold brown eyes flickered over her for the briefest moment before he backed out of the doorway, closing the doors behind him.</p><p>Piper tightened her grip on her portfolio.</p><p>Eldon moved closer, taking a seat on the sofa with her. It placed him far too close to her.</p><p>“Shall we talk terms then?” he asked, the ice blue of his gaze suddenly hardening.</p><p>“Of course.” She nodded.</p><p>She’d just as soon get this done and have it over with. Lifting the portfolio closer, she was suddenly stopped by the touch of Eldon’s hand on her wrist.</p> <p>Her stomach tightened as dread began to wash over her.</p><p>“I don’t need to see the designs. They’ll be accepted if you play the game properly.”</p><p>Ahh.</p><p>Her stomach pitched alarmingly.</p><p>“Excuse me?”</p><p>His smile was oily and far too sinister.</p><p>“I think you heard me perfectly, actually,” he said softly. “We’ll enjoy a nice cup of tea; then we’ll retire to my suite. Be a nice little fuck until I grow tired of you and we’ll see about that show you want so badly.”</p><p>This wasn’t happening.</p> <p>This couldn’t be happening.</p><p>“Are you insane?” Had she really said that aloud?</p><p>Eldon sat back slowly, his expression tightening further, but thankfully his hand lifted from her wrist.</p><p>“You don’t want to piss me off, Ms. Mackay,” he warned her, his tone low, echoing with anger.</p><p>“I don’t?” She really didn’t, but the churning in her stomach assured her she was going to end up doing just that.</p><p>“Do you want that runway show, darling?” He stared back at her with such a chilling lack of emotion that a shudder raced down her spine.</p><p>Did she want that runway show?</p><p>She was shaking her head before she realized it and rising slowly to her feet.</p><p>“You are insane,” she decided, much calmer than she should have been while facing a madman. “Business isn’t done like that anymore.”</p><p>A mocking laugh parted his lips as he rose slowly to his feet.</p><p>“Don’t be a fool, Piper,” he warned her, his hip jutting once again, as if he hoped she’d glance at his sock-stuffed crotch.</p><p>She’d gone to high school; she knew what it looked like.</p><p>“Looks like I’m going to be a fool.” Clutching the portfolio tighter in her hands, she backed away from him.</p><p>She’d not just gone to high school; she’d been raised in East Texas, and she damned well knew better than to turn her back on a rattler.</p><p>Unfortunately, he was advancing on her.</p><p>“The opportunity of a lifetime?” he asked silkily. “You’re letting it ride right on by you.” He gave a little waving motion with his hand. “Are you sure you want to do that?”</p><p>Was she sure?</p><p>Gripping the doorknob, she turned it and pulled the door open quickly.</p><p>“Am I sure I want to tell you to shove your offer up that sock-stuffed ass of yours?” she asked archly as she escaped into the foyer.</p><p>He paused, but only for a second.</p><p>Piper saw the blow coming and only barely managed to evade it as his fist came flying out.</p><p>“Bitch!” he snarled.</p><p>“Bitch? Because I know the difference between a sock and a dick?” She sneered back at him, quickening her pace as she walked backward.</p><p>“You’ll never get out of that backwoods town where you’re hawking that shit you sew together,” he snarled, his face flushing a brilliant red as his eyes bulged to the point that they threatened to pop out of their sockets.</p><p>“And you’ll never be anything but a fake dick,” she threw back at him as Broecun entered the foyer from another room, leaned against the doorframe, and folded his arms over his chest lazily as he watched.</p><p>Asshole—he could have at least appeared surprised rather than plain amused.</p><p>“Bitch!”</p><p>She watched Eldon’s muscles bunch, knew he was going to move, and she knew she would never be able to evade the punch.</p><p>Jed was going to be pissed.</p><p>Dawg would go ballistic.</p><p>They would both travel to New York and start taking off heads if she came home with just the faintest bruise that came from a male hand.</p><p>She tried to evade it.</p><p>She jumped, tried to run, but she was too damned scared to take her eyes off him.</p><p>Just before his fist launched, it stopped.</p><p>She didn’t know who was more surprised, her or Eldon, when he found his fist suddenly captured in the hard, huge hand of Broecun.</p><p>“Get out of here, girl.” Hard, emotionless, the order was voiced without heat or any sense of warning.</p><p>Still, Piper turned and ran for the front door.</p><p>She couldn’t believe this. She couldn’t believe the chance she had dreamed of had come to this.</p><p>To lose it all because of some asshole with a sock for a dick.</p><p>FIVE</p><p>Pulling into the back lot of the rental car agency, Piper was still fuming hours later.</p><p>It was too late to be in an area that appeared deserted in New York City, and far too late to do anything but turn the car back in.</p><p>At least the cab she’d called was waiting for her.</p><p>She’d stopped to let the driver know she just had to park the car; then she’d be ready to leave.</p><p>What she hadn’t anticipated was that when she’d thrown her portfolio and her purse to the back of the car earlier, she’d also managed to knock the bag containing her morning purchases over on the back floorboard.</p><p>Rhinestones and colored crystals were scattered along the carpet, twinkling merrily beneath the interior lights as she scooped them up and threw them back into her bag without bothering to return them to the small plastic bags they’d been in when she’d bought them.</p><p>That took far too long, as far as she was concerned. The damned cab was charging by the frickin’ half minute, if she remembered her last trip to New York correctly.</p><p>She had only so much cash on her, and her own credit card was barely going to cover her hotel room. The trip was supposed to be all expenses paid, but Piper knew the type of man Eldon Vessante was now. No doubt he had already called the hotel and informed them that he wasn’t paying for anything. That meant she’d better have her own card ready and waiting when she walked through the front doors.</p><p>Tossing the last of the colored crystals and stones into her bag, Piper stepped back, slammed the door, then hurriedly locked the car before rushing back to the front of the rental agency.</p><p>Depositing the keys in the night box, she all but ran to the taxi and gave the driver the address to the hotel.</p><p>Just as the vehicle pulled out, the first raindrops began pelting the yellow-and-black vehicle.</p><p>“It’s finally raining,” the driver commented as he turned at the corner and headed for the hotel. “You in town for long?”</p><p>“Not really.” She stared straight ahead, fuming.</p><p>“Business or just a visit?” he asked then, obviously in the mood to chat.</p><p>Every cabdriver she’d ever known had spent their time either on their cell phone or talking to the company about waiting fares. This one would have to be the chatty type.</p><p>“A little of both,” she answered, staring out at the rain as she tried not to cry.</p><p>Not yet.</p><p>She’d made certain she hadn’t cried on the way back to the rental agency. God forbid she get pulled over for any reason, even this far away from home, because she knew it would take less than an hour for Somerset’s chief of police, Alex Jansen, to learn about it. What Alex knew, his wife, Janey, would be quick to find out.</p><p>And Janey, being Natches’s sister and Dawg’s cousin, would find it impossible not to tattle.</p><p>Piper should have known better. She should have known it couldn’t be this easy. She’d worked far too long and too hard for it to happen as she had imagined once she’d received that letter from S. Chaniss.</p><p>“If it walks exactly like a duck and quacks exactly like a duck, then watch out for the explosion, because no two ducks walk or quack exactly the same,” she’d once heard Dawg say with a laugh.</p><p>She should have been prepared for the explosion.</p><p>The cabdriver chatted about the rain while Piper answered where she had to. She was aware the trip back to the hotel took much longer than it had going from the hotel to the rental agency, but she always added in for the detours and “scenic routes” the cabbies took to add to the time and mileage they charged, no matter where they were.</p><p>There was only so much of a delay he could make, though. It may have seemed like hours before he was pulling into the front of the well-lit hotel, but it had actually taken no more than fifteen minutes. Which was way too long, considering it was close to midnight and the streets, with the exception of Times Square and a few other tourist-heavy areas, were all but deserted of traffic.</p><p>Pushing his fee and a larger tip than he deserved through the small opening in the divider between the passenger’s and driver’s areas, Piper stepped from the cab and moved quickly into the hotel.</p><p>“Ah, Ms. Mackay.” The young, blond receptionist caught her attention. The girl’s expression was apologetic, her pale blue gaze faintly concerned. Just as Piper expected.</p><p>“Yes?” She should have kicked Vessante while she had the chance.</p><p>“The manager would like to speak to you.” The receptionist’s smile was compassionate. “He’s coming now.”</p><p>As she stepped to the reception desk, the night manager moved from his office and slid behind the desk as Piper waited.</p><p>Stocky, his face weathered with laugh lines at the corner of his eyes, his brown gaze was concerned and compassionate. It was firm, though. He knew what he had to do, and he may hate it, but he would do it.</p><p>“My apologies, Ms. Mackay,” the manager, Charles, appeared genuinely apologetic. “I’m aware your stay was to be taken care of by another party, but.” He grimaced. “I’m terribly sorry, ma’am, but I was informed before your arrival that that is no longer the case and the party is now refusing to pay.”</p><p>She couldn’t let the manager finish demanding the payment. It wasn’t his fault, and she could tell this was one part of his job he definitely didn’t like.</p><p>“I’d prefer to take care of my room myself, Charles.” She smiled back at him as relief gleamed in his gaze.</p><p>He was a nice guy; she liked him. He had checked her in during the wee hours of the morning and ensured she had a cab waiting that morning to take her shopping. He’d arranged her morning coffee and joked with her about the weather when she’d stepped into the lobby to leave for her shopping trip.</p><p>Taking her date book/planner from her purse, Piper opened it and pulled her credit card free before laying it on the gleaming marble counter in front of the young woman standing at his side. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Thank you.” The young woman—Brittany, her name tag claimed—ran the card before giving her a bright smile as the payment went through. “Will you be staying with us the full length of the reservation?”</p><p>So much for Dawg being unaware where she had stayed.</p><p>Piper shook her head as she slid a tip to the girl. “I’m checking out tonight. Could you please have a car waiting in about an hour to take me to the train station, and send the bellhop up for my luggage?”</p> <p>She should never have gone shopping that morning. There were bags of additional materials in her room that she would now have to try to stuff into the single extra duffel bag she’d packed rather than purchasing another, as she’d planned.</p><p>“I’ll make certain of it.” Brittany’s smile was too cheerful.</p><p>Piper quickly turned and headed for the elevators as she tucked her card back into the planner’s clear zippered pocket.</p><p>As she did so, a phone number caught her eye.</p><p>Jed Booker. The number was scrawled under his name in the neat, no-nonsense handwriting he used.</p> <p>She should have invited him to come with her, she sighed wearily to herself. Eldon Vessante would have never tried anything so stupid if Jed had been with her. She had a feeling Mr. Vessante would have been far less likely to stuff that sock in his pants, or to make such an outrageous demand.</p><p>He would have simply told her he had changed his mind the first chance he had, which would have suited her fine.</p><p>Stepping into the elevator, she told herself it didn’t matter. If it was meant to be, it would be; it was that simple.</p><p>That phone number glared back at her, though, until she snapped the planner closed. She didn’t push it back into her purse, however. She held on to it even though she’d already both memorized the number and programmed it into her smart phone.</p><p>Yes, if she had brought Jed, she had no doubt the night would have been far less disappointing and much more interesting.</p><p>One thing was certain: Jed so did not stuff his crotch with anything but what God had given him. And God had been generous.</p> <p>Rudy Genoa stared at the disgusting, bloodied face of the car rental agency manager with bitter fury.</p><p>He was tied, in a rather clichéd style, to an old-fashioned wooden office chair, because he was too damned cheap to buy the nice, if inexpensive, computer chairs that were so easy to find.</p><p>It had worked to restrain him, though.</p><p>Duct tape secured his wrists to the arms of the chair and his ankles to the legs. His face was swollen and pale beneath the blood that marred it. The top of his balding head was splattered with his blood, calling attention to the fact that perhaps he’d lost more hair since the last time Rudy had seen him several months ago.</p><p>Chester’s head lolled to the side a bit, while small, bloody bubbles filled and deflated at his nostrils with each breath.</p><p>He really was a distressing sight, but it couldn’t be helped. Rudy was furious. The loss of the delivery had the potential to do far more than just embarrass him. The loss of that delivery could bring some very nasty individuals into his town looking for him. The type of men one preferred not to piss off. Even one with Rudy’s power.</p><p>He couldn’t believe the stupidity.</p><p>This was what you got for trying to trust family to do a job right.</p> <p>“Did you think I would just let this go, Chester?” Rudy asked as he straddled the chair he’d pulled over to the balding, overweight little bastard.</p><p>“Rudy, please.” Sloppy, bleeding, one eye swollen shut, his lips split by the heavy fist that had pounded into them, Chester wept pitifully. “I did like you said; I swear. It was that new girl. She rented the car out.”</p><p>“And now the delivery that came in with that car is missing,” Rudy stated softly. “We checked it thoroughly.”</p><p>“Please.” Chester choked. “You owe me, Rudy. You owe me. I’ll get them back. I swear I will.”</p><p>He owed him.</p><p>Rudy agreed with his cousin for a change.</p><p>A six-year stint in prison for a crime he had been nowhere near had earned Chester a hell of a boon. But this . . .</p><p>Rudy shook his head as he propped his arms on the back of the chair he was straddling. Six years in prison for the rape of Rudy’s rival’s mistress came nowhere close to the millions of dollars in diamonds, sapphires, and rubies that were now missing.</p><p>The slightest awareness of another presence behind him had Rudy waiting patiently, the familiar lack of sound in his son’s movements pleasing.</p><p>“I checked the security tapes. She arrived about ten minutes before we did, messed around in the backseat, looks like she knocked over a bag onto the back floorboard. We found a receipt pushed beneath one of the seats for a craft seller for colored crystals and stones. There’s a chance the woman doesn’t know what she has.” There was no opinion either way in the boy’s voice.</p><p>Well, perhaps Andre wasn’t a boy anymore, but as his mother would say, he would always be Rudy’s boy.</p><p>“And her name?” Rudy asked.</p><p>At his son’s lack of an answer, Rudy turned to stare back at him with a frown. Rarely had Rudy seen this expression on Andre’s face.</p><p>That look of concern.</p><p>Trepidation began to tingle in Rudy’s gut.</p><p>“Piper Mackay, from Somerset, Kentucky.” The words were a harsh rasp of anger from a man who rarely allowed himself to show any emotion. “The investigation I did on the family after Marlena’s disappearance says she’s James ‘Dawg’ Mackay’s sister.”</p><p>But now, Rudy knew why his son had hesitated to give him the information.</p><p>Dawg, Rowdy, and Natches Mackay had not just been instrumental in foiling Marlena Genoa’s plot to kill John Walker Jr. for breaking their engagement, but had also managed to kill Gerard Andrews, the sponsor backing her acceptance into the Genoa family.</p><p>“Coincidence?” Rudy asked.</p><p>“She’s staying at a hotel no more than two blocks from here,” his son answered. “Chester knows the manager there, from what I’ve gathered.”</p><p>Andre didn’t confirm or deny the theory of coincidence, though Rudy knew he didn’t believe in such a thing. Rudy believed, though. He’d seen far stranger occurrences in his lifetime that could be explained no other way.</p><p>“This is a complication.” Rudy sighed, turning back to glower at Chester. “Why is she here, in the city?”</p><p>“According to our contact at the hotel, she’s a clothing designer. She was here for a meeting with a backer,” his son informed him as Rudy stared at Chester, his eyes narrowed with a fury he found hard to control. “Getting into her room won’t be a problem. Once I get in, I’ll restrain her and reacquire our property. That should be the end of it.”</p><p>“Take two men with you,” Rudy ordered as he glanced at the brute standing behind Chester. “Send them in. This is a matter you oversee, not one you do yourself.”</p><p>The boy had a tendency to micromanage shit.</p><p>“I’ll take care of it,” Andre promised, and Rudy knew he could depend on him. Of all the men he commanded, it was Andre he trusted above all others to ensure the job was taken care of quickly and correctly.</p><p>“Very well.” Rudy sighed. “And, Andre, don’t let your men kill the girl. Make it look like a random burglary. We don’t need the Mackays and their government sidekicks in our town.”</p><p>“Agreed.” Andre nodded shortly before turning and leaving the room once again.</p><p>Rudy turned back to Chester.</p><p>“See, it wasn’t my fault, Rudy. It was that girl you hired. She let the car out and I told her not to,” Chester whined. “You don’t have to kill me.”</p><p>“True,” Rudy agreed, ignoring the hope that suddenly filled his third cousin’s abused features. “This is very true.”</p><p>The girl was Rudy’s illegitimate daughter. She was his favorite child, and this incompetent fool thought to place the blame on her? The poor bastard had just signed his own death warrant.</p><p>His gaze flicked to the heavily muscled ex-boxer, the Brute, as Rudy called him, standing behind the other man. The one whose fists had made hamburger out of Chester’s face earlier.</p><p>The large head nodded as the ex-boxer, Jones Morley, read the silent look in Rudy’s eyes. The weapon he carried with its silencer attached came up as Rudy moved away from the other man.</p><p>A second later, a heavy pop sounded behind him, and Rudy knew he would never have to worry about Chester screwing up again.</p><p>The nerve of him anyway, blaming an innocent child for a mistake that should have never happened.</p><p>“I hardly think my precious little Asta was at fault in the least,” he said as Jones followed him from the room. “What do you think?”</p><p>“Asta’s no dummy,” the other man stated, bringing a glow of pride rushing through Rudy. “I kind of doubt she would have rented the vehicle if she was told specifically not to do so.”</p><p>Moving ahead of him, Jones quickly opened the door leading from the office and stood back as Rudy stepped through.</p><p>“Get rid of the body,” Rudy ordered the two men waiting outside. “Then return to the house.”</p><p>Striding from the office, Rudy left the building and walked quickly to the black SUV his driver, Danny, was standing beside.</p><p>The moment the doors to the office had opened, his nephew, Danny, was striding around the vehicle. Tall and imposing, Danny was as much a bodyguard as a chauffeur. Dark Italian heritage was reflected in his features, while strong American stock was reflected in his tall, stout body. Before Rudy could reach it, his door was open, the comfortable leather interior and an even more comfortable silk-skinned mistress awaiting him inside.</p><p>The mistress held no appeal for him tonight, though. The potential for disaster was rising with each minute that Andre hadn’t called him to report he had the gems. Every second those jewels were out of his possession, the closer disaster came in the form of some very nasty members of the Russian Mafia.</p><p>The Mackay woman would end up destroying Rudy’s base of power if he wasn’t extremely careful.</p><p>Or rather, the woman’s family would.</p><p>That damned brother, Dawg, and her cousins, Rowdy and Natches, and the men and women they called friends who were part of the Department of Homeland Security were dangerous. Especially that little misfit Timothy Cranston.</p><p>They were a force no criminal wanted to call the attention of. Rudy’d lost a very influential lawyer and a rather promising family member he was very fond of to the Kentucky natives.</p><p>His niece Marlena Genoa, and her sponsor back into the family, Gerard Andrews, had been taken out with such efficiency it had been shocking.</p><p>They had gone to Kentucky to seek retribution against Marlena’s ex-fiancé when he had broken their engagement five years before. Neither had returned, and Marlena’s body had never been found.</p><p>Poor Marlena. First her father had turned against the Genoa family, effectively ensuring she was no longer part of the base of power and wealth Rudy controlled. Then, she had let the prominent fiancé she had managed to snare slip from her fingers. Which wouldn’t have been so bad if she hadn’t promised to secure him, and his father’s prestigious law firm, for the Genoa family. When a promise was made, it must be kept. Or retribution must be established and restitution made. Once John Walker broke their engagement, the Genoa family demanded restitution, a small portion of the promised funds and prestige John Walker would have brought to the family, or Marlena had to seek retribution to prove she was strong enough to be part of the Genoa family in an age of betrayals, double dealing, and technological deceptions.</p><p>The family needed insurance that she would never do as her father had and turn on them—turn evidence over to the authorities and attempt to destroy the family. She was to have killed John Walker and Sierra Lucas before the life insurance policy she had taken out on him, and he had forgotten about, expired. The funds would have been given to the Genoa family, and the blood on her hands would have given at least a small assurance of her loyalty. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She had done neither. She had instead gotten a highly successful and very beneficial attorney killed and she had ended up, most likely, under Timothy Cranston’s control.</p><p>A very, very bad place to be.</p><p>If Rudy wasn’t very careful, if his son wasn’t even more careful, then they would soon find themselves facing that bastard Cranston and those hick Mackays in the worst possible way. That was something Rudy intended to avoid at all costs.</p> <p>He’d had the family investigated after Marlena’s disappearance and Gerard’s death. What he had learned made him wary. The shadowed vendetta that had played out against his organization for a year afterward still had the power to keep him awake at night.</p><p>The authorities had watched his family much too closely, his sources among the law enforcement agencies began disappearing, but when his son had been jerked out of England after leaving the family and nearly imprisoned, Rudy had known they had made enemies the family could ill afford. Word on the street was that the Genoa crime organization had shaken the wrong tree in Kentucky and they were going to pay for it.</p><p>It was a tree he had no intentions of shaking again in a way that meant he, or anyone in his organization, could be identified.</p><p>The only good thing that had come of it? Homeland Security had pissed Andre off enough to return home and ensure that they could never do so again. He was now learning the ropes and moving in as Rudy’s right hand. And a very effective right hand he was.</p><p>The bodies Andre disposed of were never seen again. There was no evidence to lead back to Rudy, Andre, or the family, and no loose lips spilling family business secrets.</p> <p>It was a good life.</p><p>Unless those gems weren’t in his possession when the owners came looking for them.</p><p>Resignation burned a hole in his gut.</p><p>Fuck. He was going to have to go after a Mackay.</p><p>He wasn’t frightened of the Mackays, but he was definitely on guard against them.</p><p>So much so that he would have gladly let the disappearance of those stones go, unless the Mackay girl tried to sell them. He would have washed his hands of them if the men arriving soon to collect them would have been willing to do the same. Or if perhaps they would have taken the task of collecting them from Kentucky.</p> <p>That wouldn’t happen, though. At least, not until they wiped every last trace of the Genoa family from existence.</p><p>Yes, this definitely had the potential to be very, very dangerous. And that potential was growing by the minute.</p><p>SIX</p><p>Andre Genoa stared at the hotel from the driver’s seat of the dark gray van with a growing sense of fury as he disconnected the call he’d just taken.</p><p>Son of a bitch. He didn’t need this, not right now. Not at this point in the game.</p><p>“Marcel says she’s just called for a bellhop, Dennis,” he told the man he’d chosen to retrieve the jewels. “You’ll go up. When she answers the door, load her belongings. Maneuver her cart into the elevator first, where Marcel will be waiting for you. He’ll block her while the doors close. Take the cart to the room service elevator and out the back entrance. I’ll be waiting for you there. We’ll just take everything, then go through it later.”</p><p>Dennis was the less violent of the two men, and the one known to be the most protective of his daughter and wife. He was Andre’s best bet in ensuring Piper Mackay wasn’t harmed.</p><p>“Got it, boss.” Nodding his head, Dennis opened the door and slid from the front passenger seat.</p> <p>As the door closed behind Dennis’s bulky form, Nate Ryan, his best friend and partner, moved into the seat, his gray eyes narrowed against the lights of the vehicles moving along the busy street as Andre pulled out of the parking space and headed toward the hotel’s back entrance.</p><p>“This doesn’t feel good, Andre,” Nate murmured as they turned down the small street used for deliveries. “It doesn’t feel good at all. Who chose Marcel to head to the hotel ahead of us?”</p><p>“No, it doesn’t,” Andre murmured. “Rudy didn’t say anything about sending extra men in.”</p><p>He hoped it was just indigestion, but something warned him this task was a hell of a lot more dangerous than the Mexican food they’d eaten earlier.</p><p>Marcel tended to give him indigestion, though. The man was a self-important moron. His arrogance had only grown in the past year, after Rudy and Boris Cheslav had chosen him as an emissary between the two families. Marcel had saved Boris’s ass a few years back when he’d learned that a relative of the family working an important drug buy was actually a DEA plant. Boris had immediately moved the other man into the upper level of his organization.</p><p>When Boris had approached Rudy with the request to handle the jewels coming into the city, he’d revealed the fact that Marcel, Rudy’s third cousin, was actually one of his men, and would be their contact during the transaction. Which meant Andre couldn’t get rid of him, as much as he would love to.</p><p>Marcel was fucking untouchable until the agreement Rudy had made with the Russian family was completed. If the other man disappeared, then the suspicious, highly paranoid Russian might just slip the leash his own son had on him, and strike out at the Genoa family. They couldn’t risk that.</p><p>Pulling the van into place, Andre glared at the back entrance of the hotel, willing Dennis to hurry, to complete the theft of the girl’s belongings quickly.</p><p>“A fucking Mackay,” Nate sighed beside him then. “What are the chances?”</p><p>What were the chances. For a man that didn’t believe in coincidence, he was suddenly being given supposed proof that they existed.</p><p>“The chances are pretty much fucking nil,” he growled. “After we get back, find out why she’s here, and start tying up loose ends. I want to know every fucking move she’s made, everyone she’s talked to, and every breath she’s taken since she made the decision to come to the city alone. Dawg Mackay is too fucking paranoid to let one of his sister’s travel here without a baby-sitter. And Timothy Cranston would die and go to hell before he’d let one of them travel anywhere alone without a shadow.” He turned and glared at Nate. “I haven’t found her shadow yet. That means, she doesn’t have one.”</p><p>Nate’s expression hardened. “Someone playing with us again?”</p><p>“That’s what my gut’s telling me.” Andre made the realization in a flash. “Someone’s definitely playing with us, and I want to know why.”</p><p>The planner Jed had scrawled his number in lay on the table next to the door, where Piper had thrown it after having to force herself not to call him. Again.</p><p>She wanted to call him.</p><p>She wanted to rail about the decision to travel to New York alone, and she wanted to curse Eldon Vessante to the pits of hell, and she needed someone to listen to her. Unfortunately, she couldn’t think of anyone she could call whom she could trust to keep the details to themselves.</p><p>Even Amy, the friend whose sister had given her a ride to the train station, couldn’t be totally trusted. If Amy even suspected Piper might be harmed, or had been, then she would call Dawg in a New York minute.</p><p>Amy might not know Dawg. She may not have a very high opinion of him after some of the stories Piper had told her about his protectiveness, but Amy had become a good friend over the past few years. She returned to Somerset each summer just to see Piper’s new designs, and over the course of those visits, they had become close.</p><p>Besides, Amy also trusted her sister, Gypsy, and Gypsy was a female version of the Mackay men. Pure military, tough, and suspicious. She would convince Amy to call the Mackays, if she didn’t just call Natches herself.</p><p>The only bright spot in the night was that she had been able to get a ticket on a train departing in two hours. It would put her in Louisville five hours later, and from there the price for a rental car home wouldn’t give away the fact that she had been in New York City.</p><p>Dawg would have pups if he ever found out she had traveled there alone. He was so damned protective and controlling of his sisters’ lives that he had even fully vetted their roommates at college. She and her sisters had become so disgusted over the choices he had given them that they had opted to just share an apartment together.</p><p>Piper hated it.</p><p>She hated having to look over her shoulder at every party she went to and every event she attended. Even worse was how often her dates and potential lovers looked over their shoulders.</p><p>The few men Piper had actually considered sleeping with had run so damned fast once they’d realized who she was related to that there hadn’t been a chance of finding out whether they were as compatible as she had thought they might be.</p><p>The men who hadn’t run had been far too much like the male Mackays for her to even consider, once she realized the traits they shared with her family members. She was terrified of ending up with a man just like Dawg, or worse yet, a man who reported to him.</p><p>That would be so humiliating.</p><p>She couldn’t imagine anything worse than being in a relationship where she couldn’t trust her lover to have more loyalty to her than he had fear of her brother.</p><p>Would Jed really fear Dawg, though?</p><p>She couldn’t imagine that happening, but she could imagine him reporting to Dawg simply because he believed her brother would have the right to know what she was doing, when, and where.</p><p>She glanced to the planner again as she finished packing her duffel bag with the items she’d bought before leaving for the meeting with the bastard who had tricked her into coming to New York. She’d literally upended her purse to get all the little packages of stones and colored glass into the duffel, and stuffed all the fabric and notions in after them.</p><p>It would serve Eldon right if she did tell Dawg exactly what he had done. Dawg and her cousins would be in New York City so fast no one would dare realize they were gone. And they would beat the skinny, rat-faced little pervert to a pulp.</p><p>The thought of it was immensely satisfying, but she knew she could never do it.</p><p>Shaking her head at the pleasurable image and heading across the room to collect her planner, she was brought up short by a knock on the door.</p><p>The bellhop was quick. She had called the front desk and asked them to give her an hour before sending him up, but she didn’t mind leaving a little earlier than she had planned. It would give her a few extra minutes to settle onto the train and feel a little sorrier for herself.</p><p>Mockery curled her lips. If there was one thing she didn’t do well, it was feel sorry for herself.</p><p>Dawg wasn’t really a prison warden, though in the past year, she admitted, there were often times she accused him of being one.</p><p>Checking the peephole quickly, she saw a large form dressed in the familiar hotel jacket and quickly opened the door.</p><p>For the second time that night, her world went to hell.</p><p>She had seen Eldon’s attack coming; she wasn’t expecting this one.</p><p>The second the door parted from the frame it slammed inward with such force Piper found herself thrown back into the room, where she crashed into the room service cart delivered earlier.</p><p>Dishes and food were suddenly flung across the floor as the cart took her weight, and Piper let out a piercing scream.</p><p>Don’t be quiet, Dawg had always advised her and her sisters. There was nothing an attacker hated worse than having attention called to his actions.</p><p>And evidently it was the truth.</p><p>“Shut up, bitch.” Enraged, the apelike figure dived for her as Piper fought to scramble away, using every breath she had to scream her lungs out.</p><p>A heavy fist caught her shoulder, causing her face to slam into the side of the dresser.</p><p>For a moment, her senses were rattled, light flashing before her eyes and exploding in vibrant color as she fought back the dizzying darkness gathering beyond the lights.</p><p>A hand attached to her upper arm with bruising force, jerking her from the floor as a hoarse demand was growled in her ear.</p><p>“Where is it?”</p><p>Where was what?</p><p>She screamed again, struggling against him as she tried with every blow to bury her fist or a foot into his balls. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her knee connected, drawing an agonized grunt a second before she was thrown into the wall hard enough to send her bouncing to the bed.</p><p>Voices were raised, outraged, cursing.</p><p>Piper was struggling to make sense of it as the sudden explosion of a weapon discharging shocked her senses into an abrupt return to reality.</p> <p>Every bone and muscle in her body hurt.</p><p>Dizziness assailed her, washing through her and weakening her as she struggled to lift herself from the bed.</p><p>Was she shot?</p><p>Oh, God, Dawg would kill her if she managed to get shot while escaping to New York. She would hear all kinds of “I told you so”s. Her sisters would of course blame her for the additional security that would follow. . . . Who the hell were those men rushing into her room?</p><p>Oh, God, they were big. . . .</p> <p>There were too many of them. . . .</p><p>Too big, and too many.</p><p>Darkness rushed over her, drawing her into a pit of icy nothingness. The complete lack of sensory information was like being buried alive.</p><p>She was aware, yet she wasn’t.</p><p>There, yet she wasn’t.</p><p>And one question haunted her through it all: Exactly what was it her attacker had been demanding?</p> <p>Where are they, you little cunt?</p><p>Where was what?</p><p>Who?</p><p>“Lady? Lady you okay? Someone call an ambulance; she’s hurt. She’s hurt—”</p><p>She’s hurt.</p><p>Who was hurt?</p><p>Oh, yeah—it was her.</p><p>She was hurt.</p> <p>Then the darkness deepened; that nowhere place grew, sucked her in, and enfolded her until nothing and no one else could penetrate.</p><p>Jed came awake instantly, before the first, faint vibrating tremor of the phone against the wood nightstand eased away. The second vibration didn’t have the chance to begin before he flipped the cell phone open and brought it to his ear.</p><p>“Booker,” he answered.</p><p>“Jed Booker?” the male voice asked, faintly quizzical, highly uncomfortable, and not yet fully mature.</p><p>“It is.”</p><p>“My name is Bret. Bret Jordan. You don’t know me, but I found your name in this lady’s journal—”</p><p>“Piper.” He was out of the bed instantly and dressing. “What happened?”</p><p>“Well, me and my friends were staying at this hotel in New York City when the lady in the room next to us started screaming. When we ran to her room this guy was beating the crap out of her. He got away with her purse, but her day planner was still lying on a table and it had your name in it. If you know her, the doctors really need some info.”</p><p>“Where is she?” Jed growled the single word, having dressed as the kid made his explanation.</p><p>He was given the name and address quickly as he jerked his boots on his feet, grabbed his weapon and keys, and headed for the door.</p><p>“Look, are you family or something?” he was asked then. “They really need to treat her, but she’s unconscious—”</p><p>“Comatose or unconscious?” Jed was in the pickup he kept parked at the inn for those times when he needed something besides the Harley.</p><p>This was one of those times.</p><p>There was a moment’s mumbled conversation. “Man, the nurse won’t tell me. She says family—”</p><p>“I’m her brother,” he lied instantly. “Her only family. Now, is she comatose or unconscious?”</p><p>“Here’s the nurse.”</p><p>The nurse was, fortunately, more informative.</p><p>Identifying himself as her brother to the nurse, he waited what seemed like an eternity as she found the doctor. Pulling from the inn’s parking lot, he drove at the legal speed limit until far enough from the inn to avoid drawing Timothy’s attention, then hit the gas and increased his speed.</p><p>Until he hit the highway he wouldn’t be safe from detection, just from being stopped for speeding. Sheriff Mayes’s deputies would immediately report the truck speeding if they saw it, just as any Somerset cop would report directly to Chief of Police Alex Jansen.</p><p>As he got to the city limits, the doctor finally, thankfully, took the phone.</p><p>Piper was stable, thank God. He wouldn’t have to call Dawg after all. She was currently severely bruised, concussed, and unconscious, but in stable condition. The hospital needed permission to treat her, though, the doctor explained.</p><p>Jed lied once again and told them he was her brother, gave the doctor permission to treat Piper, then asked her to put the young man who called him on the phone once again.</p><p>“You didn’t give the nurse the planner to call—why?” he asked instantly, suspiciously.</p><p>“I don’t know.” Jed could almost see the uncomfortable shrug he imagined the young man made. “We were the ones who rescued her; I guess we kind of feel responsible for her until someone else gets here. You know? And that dude that attacked her tried to shoot us as he ran out of the room. The police around here are nuts, too. They didn’t even bat an eyelash, so no one’s watching to make sure the guy doesn’t come after her again.”</p><p>“I’ll be there in approximately three hours,” Jed told him. “Can you wait?”</p><p>“We’ll be here until you get to her,” Bret promised. “But if you could get here faster, it would be good. I heard the nurse say someone else already called the hospital and asked about the lady attacked at the hotel, so whoever attacked her could be planning to come back.”</p><p>“How many are with you?”</p><p>“Just me, my best friend, Matt, and his girlfriend, Olivia,” Bret told him. “We’ll wait on you. No one’s going to bother her while we’re here.”</p><p>“Thank you.” Jed wasn’t reassured, but he had to admit he was damned glad to know she wasn’t alone.</p><p>“Well, if it was my sister, I’d want someone to wait on me,” the boy admitted. “Drive careful. We’ll be here.”</p><p>Careful?</p><p>Jed hit the interstate and pushed his foot on the gas as he disconnected the call, then made another.</p><p>“Control,” a well-modulated feminine voice answered.</p><p>“This is Agent Booker,” he stated before quickly giving his control number. “I’m en route to agency airfield in Louisville, Kentucky. Advise all law enforcement to allow disposition and advise agency pilot to have transport ready. Destination New York City.”</p><p>“We have you on satellite, Agent Booker,” Control advised him. “All law enforcement will be advised and turned away. Proceed with caution to airfield Delta-Bravo-Tahoe, where a pilot will be advised to be waiting in hangar six-four-zero.”</p><p>“Understood,” he responded. “Agent Booker out.”</p><p>No doubt Timothy would question him once he was given the report of Jed’s midnight race to New York City, but that could be days away, possibly weeks, until Timothy called and requested agent maneuver reports. Though that was something he rarely did.</p><p>The landscape sped by; the roads, luckily, weren’t busy in the hours after midnight until four in the morning or later. It gave him the space needed to travel safely at the speed needed to reach the airport just outside Louisville and to still the sudden, unheard-of terror piercing his heart.</p><p>What the hell was Piper doing in New York City?</p><p>Whoever the hell she’d been sneaking out to meet had obviously abducted her, hadn’t they? Piper surely wouldn’t leave the state without letting her brother, Dawg, know she was leaving.</p><p>Or would she?</p><p>Damn her.</p><p>He’d been driving himself insane in his attempt to figure out where she had gone without resorting to official channels or contacts to learn her secrets. She’d left without telling him with whom or where she was going. It was obvious she didn’t want to share the information or the identity of her lover.</p><p>She hadn’t wanted to share it then; she would share it now.</p><p>She would share it or he would be on the phone to Dawg.</p><p>Piper and her sisters didn’t think there was anything worse than having their brother or male cousins pissed. Piper was about to find out there was something far worse.</p><p>There was Jed, and he wasn’t about to let an attack against her go.</p><p>This had nothing to do with protectiveness or control. It had nothing to do with an attempt to dominate her life. What it had to do with was the fact that someone had dared to hurt her, and he would make certain that someone had the favor returned.</p><p>Piper stared at the nurse in disgust.</p><p>“You can’t make me stay here,” she informed the middle-aged, kindly looking nurse as the woman stared back at her with concerned hazel eyes.</p><p>Standing at five feet, four inches if she was lucky, her gray-and-brown hair pulled back from her face in a tight braid as the small wrinkles at the corners of her eyes drew in with her frown, the nurse watched her in disapproval.</p><p>“You’ve had a concussion, Ms. Mackay, and I doubt you feel much like walking right now, let alone traveling to the train station. If you’ll just calm down, the doctor will be in soon; he can check you and let you know what damage has been done.”</p><p>“I already know what damage has been done,” she muttered angrily. “Trust me; I can feel every bruise.”</p><p>And she could. Every single bruise, scratch, and jab that had been plowed into her undefended body.</p><p>“I’m certain you can,” the nurse agreed compassionately. “But that concussion could be dangerous. Your brother’s due at any time—”</p><p>“Excuse me?” Piper knew she’d just lost her breath as trepidation began to race through her system.</p><p>Oh, God.</p><p>No.</p><p>Not Dawg. Surely to God no one had actually called Dawg.</p><p>“Your brother Jed.” The nurse smiled again. “His name and phone number was in your day planner, thank goodness.” She moved to the bed and, as Piper stared back at her in shock, actually managed to wrap the blood pressure cuff around her arm. “Your purse was stolen. If it hadn’t been for his name and number in your planner, then we’d have had no idea whom to contact.”</p><p>Her brother Jed, not her brother, Dawg? No doubt Jed had called Dawg. Dawg, Rowdy, and Natches were probably just ahead of his arrival and blowing fire and brimstone. And once they stepped into the hospital, hell would have no fury like the Mackay men pissed off.</p><p>“God, this isn’t good.” Lying back against the hospital bed, Piper closed her eyes wearily. “How long ago did you talk to him? Forget it.” She gave a quick shake of her head. “Doesn’t matter; he could be here in two minutes or in two hours.” Opening her eyes, she levered herself up on the bed. “Where are my clothes?”</p><p>Nurse Dade widened her eyes in surprise. “Ms. Mackay, where your clothes are doesn’t matter,” she informed Piper. “You need to rest.”</p><p>“I’ll find the damned things myself then.” Piper sighed.</p><p>She really didn’t feel like finding anything, especially her clothes, but sometimes a girl just had to do what a girl just had to do, right?</p><p>“Ms. Mackay, you’re in no shape to leave the hospital alone.”</p><p>“Nurse Dade, you really have no idea the forces of nature getting ready to rip through this hospital,” she informed the nurse as dread began to fill her. “The Four Horsemen of the Apocalypse have nothing—and I mean absolutely nothing—on my brothers. Famine, pestilence, war, and disease are a kiddie playground in comparison, and I have no intentions of hanging around for the fallout.”</p><p>Nurse Dade’s eyes widened. “Sweetie, I talked to him myself.” She gave a small, nervous little laugh. “He was as nice as he could be. I think you may have hit your head harder than the doctor thought.”</p><p>Struggling from the bed, Piper ignored the nurse’s disapproving glare as she shuffled to the small cabinet next to the end of the bed.</p><p>Aha, clothes.</p><p>“Ms. Mackay, this isn’t advisable.” The nurse sighed as Piper struggled past the roommate who had been listening in amused interest. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It’s not advisable to be here when Dawg Mackay arrives either.”</p><p>“Who is Dawg Mackay?” The nurse was all but laughing at her. “His name is Jed.”</p><p>“You really don’t want to know. Trust me.”</p> <p>“You’re going to hurt my feelings, sis. That just wasn’t nice.”</p><p>Piper came to a slow stop no more than a few feet from the bathroom door when Jed stepped slowly into the room.</p><p>His voice was gentle, amused, and patient. The look in his eyes was damned scary, though.</p><p>Scary, that was, if her attacker ever had the misfortune to stare into them.</p><p>She could see murder in those eyes. As Jed took in the bruised, swollen condition of her face, the hesitancy in her stance as she stood before him, then the livid bruises on her arms, the navy blue of his eyes flickered with a deep, black rage.</p> <p>Shaking his head slowly, he advanced on her, all lean-hipped, predatory male grace and dark intent.</p><p>“How far behind you is Dawg?” Resignation slumped her shoulders.</p><p>If she had been on a leash before where her brother was concerned, no doubt it would feel like prison even before they left the hospital.</p><p>“Oh, I’d say about twelve hours or so,” he drawled, then leaned close, staring into her wide eyes as he whispered, “He doesn’t know, sweet pea. Want to keep it that way?”</p><p>Piper nodded. Oh, God, she really wanted to keep it that way.</p><p>“Then you’re going to cooperate, right?” he suggested softly.</p> <p>Piper nodded again.</p><p>To keep Dawg in the dark?</p><p>Oh, hell, yes, she would cooperate.</p><p>At least to a point.</p><p>After all, she’d hate to mar the Mackay reputation for cooperating only when it suited their own interests.</p><p>Right now it suited every single interest she could think of, though.</p><p>“Good then.” He straightened, his hands settling with airy gentleness just above her shoulders. “Turn around, march right back to that bed, and we’ll just wait for the doctor, shall we?”</p><p>She moved for the bed.</p> <p>“That’s a good girl,” he commended her as Nurse Dade smiled with an awestruck girlishness Piper found nauseating.</p><p>Good girl, was she? she thought, sitting back on the bed carefully as she glared up at the smirking, far too self-satisfied Jedediah Booker.</p><p>Oh, she’d just show him what a good girl she wasn’t.</p><p>As soon as the doctor released her, that was.</p><p>SEVEN</p><p>Jed hadn’t prayed in years, but as he drove from the small airfield outside Louisville the next evening, he found himself praying for patience.</p><p>He’d found a chance to question Bret Jordan and his friends Matthew Grace and Olivia Camfield. From their report, they’d heard Piper screaming in the suite next door and had come to investigate. Her door had been opened and a man they described as a “mountain” had been pounding on Piper as though he intended to beat her to death.</p><p>He also had the bastard’s description. The three had been amazingly observant and were able to provide several valuable details in regard to the assailant’s appearance. One of his contacts in the city had made a visit to the hotel and questioned the staff before going to the room and doing the job it seemed the police hadn’t, collecting what evidence of the attack had been left.</p><p>And there was the reason for the prayers. Patience wasn’t his strong suit. The second he had Piper safely at home he’d launch his own investigation. God help the bastard who had dared to touch her.</p><p>Once the assailant was found, Jed prayed he could keep from attempting to kill him with his bare hands. From showing the “mountain” what it meant to really hurt.</p><p>“Why didn’t you tell Dawg where I was?” Piper finally deigned to speak to him, something she hadn’t done since they’d left the hospital unless he’d simply left her no other choice.</p><p>“I promised to keep your secrets, Piper; I meant it.” Glancing at her, he drove the truck he’d parked at the airfield the morning before toward Somerset. “I won’t tell Dawg anything I know you’d want me to keep to myself.”</p><p>The flight back had been short, but Jed hadn’t wanted to arrive back in Kentucky until well after midnight. He’d spent the day getting her ready to leave and ensuring someone was investigating her reason for being there and why she had been attacked.</p><p>He hoped—hell, no, he was praying—that Dawg wouldn’t be anywhere near the inn when they arrived.</p><p>She shifted against the leather seats, no doubt trying to find a comfortable position.</p><p>His fingers tightened on the steering wheel as he fought back the anger he was determined she wouldn’t see.</p><p>“And that’s why you didn’t call Dawg?” She obviously didn’t want to believe him.</p><p>“That’s why.”</p><p>Dawg would have charged into New York City with Rowdy, Natches, and no doubt Chaya, Natches’s wife; the chief of Somerset’s police force, Alex Jansen, and Pulaski County sheriff Zeke Mayes; as well as Special Agent Timothy Cranston and Piper’s mother, Mercedes Mackay, ready to kill.</p><p>Dawg wouldn’t have left the city until Timothy had buried her attacker. If that attacker hadn’t been found, then Piper would have returned under such heavy guard she would have been smothered before ever reaching Kentucky again.</p><p>Silence descended between them, one that stretched until they had nearly reached the exit to Somerset.</p><p>“There’s no way to hide the bruises,” Piper stated, her voice low. “Dawg’s going to see them.”</p><p>Yeah, he would; there was no way to hide the damage to her face, though thankfully, her left eye was no longer swollen shut.</p><p>“What are you going to tell him?” Taking the exit to Somerset off the interstate, he knew Piper’s time was definitely running out.</p><p>Dawg had all but haunted Mercedes and Timothy, demanding to know whether Piper had called her mother yet. Elijah, Jed’s partner, had called earlier in the afternoon to report Dawg had contacted several agents at the surrounding airports and had her name run for flights out.</p><p>He’d told her earlier about the conversation he’d overheard between Mercedes and Dawg, as well as the fact that Dawg was questioning everyone he could think to question about her whereabouts.</p><p>“You can’t hide this from him, Piper,” he warned her when she didn’t answer him.</p><p>“I know I can’t,” she answered wearily.</p><p>The tiredness in her tone coincided with that unfamiliar tightness in his chest—something he experienced only with Piper.</p><p>“He’s been beside himself with worry,” he told her. “Christa’s accused him of running headlong into a stroke as he attempts to protect all of you.”</p><p>“If he would just wait until we need protecting.” Frustration immediately tightened her body as she pushed both hands through her shoulder-length black hair before clenching them in the deep waves.</p><p>God, he would kill to feel all that lush, warm silk against his body. Against his thighs as her lips parted and his dick pierced the heated dampness beyond. That particular portion of his body throbbed in painful hunger as the need for her began to grow impossibly.</p><p>Impossibly, because he hadn’t believed he could hunger for her more than he already did.</p><p>Impossibly, because she was hurt, bruised, and no doubt the last thing on her mind was sex. She was definitely exhausted. She’d slept the whole of the flight, waking only as the plane taxied to the private hangar DHS leased.</p><p>“Why won’t he wait until we need him, Jed?” she questioned with hurt anger. “Why can’t he just let us live a little bit?”</p><p>“Because he’s seen the monsters.” Jed knew exactly why. “He knows what’s out there, Piper, and the nightmares haunt him now—the fear of not protecting the four of you, of being off guard and missing a threat, gives him nightmares. That’s why he’s driving himself to a stroke. That’s why he has trouble letting you live your life. Because he knows that in that one moment that you relax your guard, that’s when the monsters strike and attempt to steal everything you love in life.”</p><p>“Did they steal something you love?” she asked.</p><p>How had she guessed there was more to his life than he’d allowed her to see so far?</p><p>“Not quite.” Glancing at her, he saw the need in her eyes—not a sexual need or a physical hunger.</p><p>She needed to see more of him than he’d allowed so far.</p><p>Intimacy. That connection that had the ability to bind two people together or tear them apart.</p><p>“No one knows I have a sister.” He had to force himself to share with her something that even Timothy Cranston was unaware of.</p><p>“You hide your family.” She nodded as though it made sense.</p><p>“Well, my mother hid me from them first,” he admitted with a flicker of amused remembrance. “She didn’t want my father to know about me, didn’t want me to be threatened by his career in covert intelligence or his enemies. Father knew about me, though. When I was old enough, he found me, and drew me in like he does so many others and gave me one task: Protect my sister.”</p><p>He could laugh about it now; at the time, it hadn’t been nearly so funny.</p><p>“You say that as though it were an impossible task,” she observed curiously.</p><p>“You would have to know Mary Elizabeth to be amused,” he said with a grunt. “She taught me a long time ago that you can’t surround those you love in bubble wrap and expect it to work. First they burst the bubbles; then they find an escape route. Once they escape, they don’t tell you where they’re going or why.”</p><p>Piper watched as that crooked little smile she loved touched his hard lips and gleamed in his dark blue eyes.</p><p>“You tried to surround her in bubble wrap then?” she asked. “Guess you learned the hard way, huh? I wish you could teach Dawg and my cousins the fact that it simply isn’t possible to lock us away until it’s time to bury us.”</p><p>“That’s your job, sweetheart.” He sighed as she watched him, her gaze meeting his for the second he glanced at her, yet feeling the effects of the amused heat in his eyes for that tiny moment in time.</p><p>“How is that my job?” She couldn’t imagine teaching Dawg anything. The man gave stubborn a bad name.</p><p>“Most sisters start when they’re babies,” he admitted. “But you’re on the right track. Live, laugh, have fun, and go head-to-head with him whenever you have to. But don’t disappear on him again, Piper. Do it again, and next time I promise I’ll help him find you.”</p><p>“And what makes you think you can find me if Dawg can’t?”</p><p>“Because Dawg doesn’t want to admit you would actually leave the state without telling him,” he pointed out as guilt flayed her once again. “I don’t have that problem. I saw you leave the inn when you snuck out. I heard the car stopping just down the road. I knew why you were doing it, though. I didn’t follow; I didn’t run a check on the car. I went back into my room and stared up at the ceiling the rest of the night, wondering who was the man you left with.”</p><p>The man?</p><p>Piper almost smiled. She could hear the probing question he was doing nothing to hide.</p><p>“It wasn’t a man,” she admitted. “It was the sister of a friend giving me a ride to the Louisville train station. I tried to cover my tracks so Dawg wouldn’t follow me.”</p><p>He nodded once.</p><p>“It didn’t work out so well.” She sighed, completing the thought.</p><p>“No, but I’m going to assume the circumstances were unusual,” he stated.</p><p>“How the hell do I know?” She still didn’t understand why, who, or what. “One minute I’m waiting on a bellhop and a ride to the train station, and the next second I’m being pounded on, then waking in a hospital with a concussion and so many bruises that breathing hurts.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There was the faintest memory of a demand. A demand for what, she wasn’t certain. It wasn’t even a memory, not really. It was a confusing collage of something, amid a blast of pain, fear, and her own screams.</p><p>“Did you remember the people next door who rushed in to help you?”</p><p>She didn’t remember the rescue at all.</p> <p>“I remember meeting them at the hospital after I woke up.” She answered him, wishing she could hold on to whatever it was her attacker had said in those chaotic moments. She had a feeling if she could just remember . . .</p><p>“They were good boys,” he told her gently. “A lot of young men would have waited, or been too wary of poking their noses in where they weren’t wanted.”</p><p>“Oh, they were wanted.” She breathed out roughly.</p><p>God, what would she have done if they hadn’t poked their noses in?</p><p>Watching the landscape roll by, Piper realized they were only miles from the inn now.</p> <p>“Do you think Dawg will be there?”</p><p>He was going to be so hurt, and she knew it. He wouldn’t understand her need to breathe, to have done this alone, even though it hadn’t been the chance she had believed it was.</p><p>“Why were you in New York, Piper?”</p><p>She’d wondered how long it would take him to get to the one question she knew he wanted to ask.</p><p>Forcing back tears of disappointment and humiliation, she let a bitter smile pull at her lips. “I thought I was going to get an offer for a showing of some of my designs,” she finally admitted.</p><p>“Thought you were?”</p> <p>“It didn’t work out.” Staring down at her hands, she wondered whether he would consider it no more than she had deserved for the childishness she had displayed in the deceptive way she left.</p><p>“What happened, baby?”</p><p>The gentleness in his voice and the fact that he hadn’t told Dawg when the hospital had called him had her raising her eyes as she shifted in her seat to look at him.</p><p>Thank God it was dark. The last thing she wanted was for him to see the tears she had to blink back.</p><p>“There’s this famous designer sponsor,” she told him, clearing her throat to hide the hoarseness of the hurt she fought to hide. “He showcases several designers a year, helps them put on a show, and he’s never had one who didn’t become successful. I received a letter from him last week that he wanted to meet with me after seeing some of my designs that I sent in.”</p><p>He nodded, showing he was listening as they moved ever closer to the inn.</p><p>“I could have had the show and sponsorship if I’d agreed to be his little sex toy until he got tired of me.”</p><p>As though revealing that much opened a floodgate, Piper told him about Eldon Vessante, and the fact that his pants and his opinion of himself were overstuffed.</p> <p>His expression never changed; the tension in his body didn’t visibly increase. None of the signs of vengeful anger that Dawg and her cousins were known to display were present.</p><p>“Two attacks in one day then.” He breathed out heavily, the concern in his voice easing something inside her she hadn’t known had been knotted with tension.</p><p>Piper nodded. “Fortunately, his butler or whoever he was, was there. Some guy named Broken or something. A hell of a name for a person. He kept Eldon from actually hitting me and helped me get away.”</p><p>“Do you think this Vessante guy was behind the attack at the hotel?”</p><p>Piper shook her head. “I don’t remember what was said, but he wanted something.” She wished she could remember, wished the harshly grated demand would come into focus within her memories. “I can’t remember what he said, Jed, or what he wanted, but it didn’t have anything to do with Eldon Vessante.”</p><p>Broecun.</p><p>Fuck.</p><p>The security field was a close-knit one, especially for those agents of John Broecun’s caliber. Jed knew Piper had taken the sound of the name literally, but Jed knew the other man, as well as the spelling of his name. And he knew if Broecun was with this Eldon Vessante, either the man was important to some very influential government types, or he was under investigation by them.</p><p>At least he had a place to start, and a face to shove his fist into. Eldon Vessante may not have been behind Piper’s beating, but the only reason he hadn’t been was because Broecun would have stopped him.</p><p>Broecun wouldn’t stop Jed from teaching the other man how to treat a woman. And blackmailing Piper with her dream of a big-time fashion show and an exclusive sponsorship was something Jed would exact a little atonement for.</p><p>“Well, you’re home now.” He pulled into the Mackay Inn’s lot, parked the truck, then shut it off. “Let’s see if I can sneak you into the house and get you settled before Dawg gets his first report that you’re home.”</p><p>He sure as hell didn’t need Dawg around right now, or Timothy Cranston. He’d talk to them both in the morning instead. Dawg and his cousins were going to have to step back a pace or two, regardless of whether or not they liked it. If they wanted to know the trouble—or potential trouble—his sisters got into or were headed for, then the girls couldn’t be afraid to let him know what they were doing.</p><p>Her fear of being smothered during what she believed was an important event had almost cost Piper her life; he wouldn’t allow it to harm her more in the future.</p><p>“I’m scared for him, Jed,” she whispered as he cut the engine, then turned back to her, confused.</p><p>“Scared for whom, honey?”</p><p>“For Dawg.” He could see the tears in her eyes, the faint tremble of her lips in the dim light of the moon.</p><p>“Dawg and his cousins take care of themselves and one another just fine, Piper,” he promised her.</p><p>She shook her head at his statement. “That’s not what I mean.”</p><p>“What do you mean?”</p><p>“He’s going to be very alone,” she told him softly. “He’s becoming out of control, Jed. He makes me frightened of him when he starts standing over us like guard dogs. He can’t keep telling us what to do or how to live. I know Lyrica and Zoey, too. If he doesn’t stop, I swear, we’ll all end up leaving. We talk about it more and more often. He may well be headed for a stroke, but Lyrica, Zoey, and I are headed out of town if it keeps up.”</p><p>“He worries, Piper.” His hands clenched on the steering wheel in an instinctive protest at the thought of her leaving.</p><p>“I would have been in your bed a year ago if he hadn’t been watching us all like hawks. I’m terrified to show any interest in a man, and God forbid I should actually consider taking a lover after the grief he gave Eve.” The words were out of her mouth before she could hold them back.</p><p>A wave of heat flushed through her at the sudden, brilliant gleam of lust that lit his gaze.</p><p>He may not have tightened with the information she’d given him about Eldon’s attack, but the moment she mentioned being in his bed, his entire body seemed to jerk in abrupt interest.</p><p>Or perhaps “interest” was far too tame a word. It was as though every thought, every emotion, every particle of his being was suddenly intently, greedily focused on her.</p><p>“Did Dawg order you to stay away from me, Piper?” he asked her calmly, but what she saw in his gaze was anything but calm.</p><p>She shook her head slowly. “No, but who I sleep with isn’t up for debate, Jed. And I won’t let it become a family point of interest that I’m fighting my brother over the man I want for a lover because he disapproves of him as he did with Eve. It shouldn’t be like that, and I can’t stand the thought that Dawg would turn it into such a battle.”</p><p>He’d nearly broken Eve’s heart.</p><p>Her sister had finally told her of the fight she’d had with Dawg when she had taken Brogan as her lover. Dawg had gone so far as to use the worst sort of emotional blackmail to keep her from giving in to the man she’d been fascinated with for years.</p><p>Piper had been terrified he would try the same tactics with her. If he had tried such a guilt trip with her, she would have gone ballistic. Eve had had far more patience than Piper could have ever found in the same situation.</p><p>“I was beginning to wonder if you even wanted to find yourself in my bed.” He reached out, his palm cupping the uninjured side of her face.</p><p>“I didn’t say you wouldn’t have to seduce me now,” she informed him tartly, despite the heat rushing through her body at his touch. “I simply said I may have ended up there sooner.”</p><p>“You call that little tease a month ago being in my bed?” He came closer, his gaze focused on her lips as Piper brushed her tongue over them, wishing her attacker had kept the back of his hand away from them.</p><p>“You call that a little tease?” she whispered roughly. “I’m going to have to show you a real tease, Jedediah Booker, so you’ll know the difference.”</p><p>“And exactly what would you call a little tease, Piper?” he asked, his lips moving close, oh, so close to hers.</p><p>“What you’re doing right now, maybe?”</p><p>She could barely breathe.</p><p>Okay, she was sore, swollen, but her lips weren’t really that swollen. Most of the blows had actually been against the side of her head, according to the doctor. Not that she remembered a whole lot after she had been slammed into the dresser, due to the concussion.</p><p>“This is a tease?” His lips were only a whisper against hers.</p><p>“Please, Jed,” she sighed his name roughly. “Don’t tease this time.”</p><p>Don’t tease this time.</p><p>Jed stared down at her, seeing the shadow of bruises against one side of her face, the faint swelling of her eye and her lower lip.</p><p>“I don’t want to hurt you, Piper.” He sighed, drawing back. “And I don’t want you coming to me out of fear. When the bruises have healed, then we’ll talk.”</p><p>Before he could change his mind, Jed forced himself from the truck and strode to the passenger side of the pickup. Pulling her door open, he did as he had at the hospital: Rather than allowing her to walk to the inn, he simply scooped her from the seat and carried her to the front porch.</p><p>Turning from the front door, he was heading for the side of the house when a shadow detached itself from the corner and the front door opened.</p><p>“God, no.” Piper buried her head against his shoulder as he recognized the height and breadth of the shadow before he actually glimpsed the hard lines of the savagely hewn male features in the dim light of the moon.</p><p>“Well, at least they’re not trying to run,” Natches drawled as he moved to Dawg’s side.</p><p>“I don’t know; I think I’d rather he’d run.” Amusement filled Rowdy’s voice as Jed let his gaze lock with Dawg’s.</p><p>“Now’s not the time, Dawg,” he warned the other man. “Let her rest first. Morning’s soon enough.”</p><p>Piper grunted against his shoulder. “Good luck with that one,” she muttered, her voice so low it barely reached his ear.</p><p>“Yeah, Jed, good luck with that one.” The low, slow cadence of Dawg’s voice had the hairs at the back of Jed’s neck lifting in warning.</p><p>Dawg was pissed, and he was suspicious. His gaze slid to Jed’s hold on her slight body, narrowed and intent, his look taking in the protective hold and Piper’s determination to hide her face.</p><p>“Put her down, Booker,” Dawg ordered, his voice dark and warning.</p><p>“Don’t do this, Dawg.” There was no weakness in Piper’s voice as her head lifted quickly, her obvious sense of security with the darkness surrounding them apparent.</p><p>Jed could have told her the mistake she was making, if he had had a chance.</p><p>What he saw instead was Dawg’s face.</p><p>The widening of his eyes, the paling of his flesh, the immediate awareness that one side of his sister’s face wasn’t shadow, but swollen and obviously bruised. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Just as quickly, Piper saw the reaction as well, if her sharply indrawn breath and the tension invading her body was any indication.</p><p>“No.” The harsh order that left her lips as Dawg stepped forward surprisingly had him stopping in his tracks. “It’s none of your business, Dawg.”</p><p>Rowdy and Natches were quick to move around them, their reactions no less as shocked as Dawg’s.</p> <p>“None of my business?” Dawg all but wheezed, his expression tortured, as his cousins, positioned for a much better view, stared at her in horror as the sensors on the motion lights caught the movement and flipped on overhead.</p><p>“Oh, my God, Piper . . .” Agonized, Dawg’s voice roughed to a harsh, gut-clenching rasp.</p><p>Anguish filled the three men’s gazes and tightened their expressions as they stared down at her, obviously fighting to process the bruised condition of her face.</p><p>As though in one movement, their heads jerked to Jed, their gazes piercing as they stared at him.</p><p>Hell, his face was likely to take the brunt of six fists pounding on it before the night was over, because he was damned if he could give them what he knew they were silently demanding.</p> <p>An explanation.</p><p>Now.</p><p>“She’s your sister,” he told Dawg, his gaze connecting with the other man’s, knowing he could make an enemy of him in this second. “You want answers, you’ll have to get them from her.”</p><p>“Let me down.” Piper struggled in his arms.</p><p>Put her down? Was she insane? The second Dawg saw her limping, he’d go damned ballistic.</p><p>“Fuck! I’ll be damned if I will.” Tightening his hold on her, he moved forward, more than surprised as the Mackays parted and allowed him to pass.</p> <p>Pulling her keys from where he’d tucked them into his jeans at the hospital, he called back to the three men following them, “Her bags are in the truck, if you want to make yourselves useful and bring them in.”</p><p>At least one set of footsteps paused behind them.</p><p>“Like hell,” Dawg growled. “She can have them later.”</p><p>Jed shrugged.</p><p>“I should have stayed where I was,” she whispered. “Why didn’t I stay where I was?”</p><p>“They would have found out,” he warned her. “Want me to tell you how many contacts Timothy has on the police force there?”</p><p>“Where?” Dawg snapped behind him. “I thought you were just the fucking chauffeur?”</p><p>Holding her securely as he unlocked her door, Jed glimpsed her expression from the corner of his eye and restrained a sigh. She was shutting down fast. He could feel it, and he hated it. When Piper shut down, her rational and logic went out the fucking window, especially if she was dealing with her brother. She didn’t do confrontations well, though he knew she would never admit to it. She buried her fear instead and faced the world with a brutal ice that sliced her deeper than it did those she was facing, once she had time to think and consider what she said during those moments.</p> <p>Stepping into her bedroom, he strode to the bed in the center of the small suite, laid her on it, then watched in resignation as she jumped from the mattress to face the three men entering the room behind them, the moment he placed her on it.</p><p>“Go home, Dawg.”</p><p>The lights flipped on, and for the first time Dawg had a full, unobstructed view of her face.</p><p>“God, Piper.” It was Natches who breathed out the protest. “Sweetheart, what the hell happened to you?”</p><p>Dawg looked like he had taken a blow to the balls and was having trouble catching enough breath to even fold to the floor.</p><p>“Don’t the three of you have wives and children of your own to torment?” She questioned them harshly as she tugged at the soft cotton material of the blouse she had worn home.</p><p>The light, neutral tone of the gray blouse did nothing to hide the damage done to her fragile face, or where it extended along her shoulder and into the scooped neckline of the garment.</p><p>It was one of her creations, he knew—one she was exceptionally proud of. Unfortunately, the light color only emphasized the darkness of the bruises.</p><p>“Who did this?” Dawg grated, his voice harsh.</p><p>Piper drew herself up, the last hint of any emotion leaving her face.</p><p>“I said leave.” The demand in her voice was impossible to miss.</p><p>Just as arrogant, just as condescending as Dawg could be himself, she faced him with icy refusal, her gaze never flickering beneath the fury in his.</p><p>“Dawg, let her rest.” Jed placed himself between them. “Ordering her isn’t going to get you anywhere.”</p><p>Dawg’s fists clenched at his sides, the need to strike out, to take vengeance, clear in his expression and the tension in his large body.</p><p>“Get out of my way, Jed.”</p><p>“Get out of her room!” Jed countered, determination hardening his voice. “You’re not going to yell at her, and you’re sure as hell not going to attempt to force answers from her. Just go home and see if you can’t ask nicely next time.”</p><p>Who was more surprised, he wondered, when the three Mackays did just as he ordered—turned and left without another word—himself or Piper?</p><p>“This isn’t good,” Piper muttered, suddenly aware that she could have pushed her brother right over an invisible line none of them had known existed. “Dawg never just leaves.”</p><p>Jed turned back to her. “I think you should have told him, baby. But we’ll see what hardheadedness gets you first.”</p><p>The smile he gave her was as chilly and polite as her tone was to her brother, but far more mocking.</p><p>She stood there staring back at him, the vulnerability he could see her fighting—and the need and the hurt hiding behind the chilly facade—breaking his heart.</p><p>He turned and left, just as the Mackays had. He had no other choice. Because as pissed as her brother and cousins were, she had no idea he was even more so.</p><p>She had left without him, faced danger without him, and been determined to handle it all on her own—without him. And now, even knowing he would have to face the full force of the Mackay fallout, she wasn’t volunteering enough information to her brother and cousins to even give him hope that Dawg, Rowdy, and Natches wouldn’t try to kick his ass to hell and back.</p><p>And he still couldn’t imagine betraying the trust she had placed in him. Even knowing the enemies he could make, the budding friendships that could be destroyed. The Mackays were strong friends to have, but they could be brutal enemies, too. But, Jed had realized the second he had walked into that fucking hospital room that nothing mattered more to him than being with Piper. Protecting her, touching her, having her.</p><p>Nothing else mattered.</p><p>No matter what.</p><p>EIGHT</p><p>Dawg stood next to the pickup, his wrists hanging over the edge, his head bowed, and he had no idea how to unknot the burning fist growing in his chest.</p><p>Where was Christa? God, why hadn’t he brought Christa with him? She could have talked to Piper, could have made her understand that he had—he had—to make certain whoever hurt her never—fucking never—hurt her again.</p><p>He felt as though every breath he was trying to take was restricted.</p><p>“Fuck, hurts to breathe,” he muttered.</p><p>“No shit,” Rowdy was hoarse.</p><p>Natches wasn’t speaking.</p><p>As he wiped his hand over his face, car lights sliced into the parking lot, drawing his gaze as he found himself staring at the little car he’d bought Christa several months before.</p><p>As it pulled to a stop behind the truck, it wasn’t just Christa who stepped from the car. Rowdy’s wife, Kelly, and Natches’s wife, Chaya, moved slowly toward them.</p><p>It was Natches who moved first.</p><p>Two steps and Natches was pulling Chaya into his arms, burying his face against her neck and holding on tight as Christa moved slowly to Dawg.</p><p>“Jed called,” she told him. “He told us everyone was safe, but you might need us?”</p><p>Her hand, so delicate and fragile, settled against his arm.</p><p>“What’s wrong, Dawg?”</p><p>His throat was so fucking tight. Hell, he hadn’t felt like this since the night he learned Christa had lost their child so long ago. Like tears were burning in his gut and refused to be shed.</p><p>“Someone beat her.” His voice was grating, so rough he barely recognized it as he turned to her and pulled her to his chest. “Christa, someone beat her face and she won’t let me help.”</p><p>He couldn’t understand it.</p><p>It was tearing him apart. His guts were being ripped straight out of him and he couldn’t make it stop.</p><p>“Who? Who, Dawg?”</p><p>“God. Piper,” he snarled, so furious with her, so broken inside he had no idea how to find all the pieces. “Piper, Christa. She just fucking disappears, then comes back, her face swollen and bruised, and she won’t let me help.”</p><p>“Did you offer to help, baby?” she asked gently, her expression understanding, knowing. “Or did you demand?”</p><p>He had asked. Hadn’t he?</p><p>“You demanded, didn’t you, Dawg?” she guessed. “All ready to charge ahead and exact vengeance.”</p><p>“Someone hurt her.” It didn’t make sense that she wouldn’t want vengeance.</p><p>“Come on, Dawg. Let’s go home.”</p><p>He shook his head fiercely. “You have to make her tell me—”</p><p>“Dawg, you can’t make Piper do anything.” She sighed. “She’s home; you know she’s safe. Give her time to come to you.”</p><p>He shook his head.</p><p>“You’re just going to piss her off,” Chaya stated as Natches lifted his head from her shoulder and moved away several paces. “She’s too strong to break down and cry, or let herself be treated like a child. You’ve hassled her for a year; now it’s time to go home.”</p><p>“She won’t stay safe.” He shook his head; it didn’t make sense to him.</p><p>“And here she’s a Mackay. Go figure,” Christa murmured.</p><p>“We’ll find him.” This time it was levelheaded, “think about it first” Rowdy. “We’ll find him, Dawg, and when we do, he won’t be able to hit another woman.”</p><p>Natches, Rowdy, Chaya, and Kelly moved to the truck Dawg had driven to the inn as Dawg moved to the car with his wife. For the first time, Christa noticed, she didn’t have to fight over driving.</p><p>Dawg moved to the passenger seat as she slid under the wheel.</p><p>“I need to go home.” He breathed roughly. “I need my girls.”</p><p>Her and his daughter.</p><p>She held back the secret she’d learned earlier. The news that their daughter would have a brother or sister. News that she feared would only make Dawg more protective, even as it made him more loving.</p><p>The drawback?</p><p>His feared inability to protect those he loved was breaking his heart, and that was breaking her heart. Because there was nothing she could do to ease his pain or to make those he loved, besides herself, understand the demons that tormented him.</p><p>Perhaps it was time she, Kelly, and Chaya had a talk with the stubborn and just as determined Mackay sisters.</p><p>ONE WEEK LATER</p><p>“Good morning, Mr. Samson; I hope you enjoyed your breakfast?” Piper met Guido Samson in the hall outside his room and gave him a warm smile.</p><p>The new lodger was a bit portly, his black hair thick, with a slight wave in the shortened length that was brushed back from his face to reveal a hint of gray at the temples. Dark, swarthy, just showing the lines of advancing age, he looked to be in his late fifties, though Piper bet he was in his early sixties.</p><p>He’d been at the inn four days and was already making his presence known, mostly by pissing Tim off. It seemed Guido couldn’t help but flirt outrageously with Mercedes Mackay.</p><p>“Ah, Miss Mackay.” He stopped, holding his hand out to her.</p><p>As Piper extended hers he took it, raised it to his lips, and pressed a light kiss to it with charming ease before releasing it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And here is your young man.” He looked over her shoulder, a broad smile pulling at his lips as Piper swore she could feel Jed coming up behind her.</p><p>“Morning, Mr. Samson.” The deep, controlled drawl—controlled hunger, anger, and determination—sent a shiver racing down her spine.</p><p>That tone had only intensified over the past days, just as the gleam of determination in the navy blue gaze had only hardened and, at certain times, intensified.</p> <p>“Ah, Mr. Booker, good morning,” Guido greeted him. “I am out for a day of sightseeing. I believe my son, Rhylan, is arriving this evening and hopes to find the best spots for a few days of fishing.”</p><p>“The fishing here is excellent, Mr. Samson; I’m certain your son will find plenty of excellent spots.” Edging around Guido’s portly frame, Jed curled his fingers around Piper’s upper arm. “Excuse us, please. Piper and I need to talk.”</p><p>“Of course,” Guido murmured, amused. “Young people have many things to discuss privately.”</p><p>His soft chuckle followed them up the hall as Jed led her to her room. Opening the room and stepping in, Piper quickly pulled her arm from his grip.</p><p>“Since when do we have things to discuss?” Piper asked roughly as the door closed behind them, very well aware of the fact that he let her go. She wasn’t free because she wanted to be; she was free because he let her be.</p> <p>Crossing her arms beneath her breasts, she glared at him, wishing she could push back anger, guilt, or any of the other emotions tearing through her, as she could with her family.</p><p>She could stare back at Dawg and freeze any response to the knowledge that he was frightened for her, hurting for her, worried about her, or just plain pissed off at her.</p><p>Her sister Eve had always been so thankful to be accepted and loved by her brother and cousins that she would have done just about anything—anything but deny the man she loved.</p><p>Lyrica, a year younger than Piper, had such a guilt complex that she worried constantly that she would never be good enough, act properly enough, or be strong enough to be part of the Somerset Mackays. God only knew what their youngest sister, Zoey, felt. She rarely talked about it, and if asked would just laugh and say she was where she belonged. But Piper had always felt there was so much more beneath that statement.</p><p>Of the four of them their eldest sister, Eve, had handled Dawg best. They all loved him, but each of them had different ways of dealing with him.</p><p>Him, or any other man.</p> <p>Unfortunately, the defenses Piper had built over the years didn’t work with Jed.</p><p>“Have you talked to Dawg yet?” he asked.</p><p>Piper looked away and shrugged. “He hasn’t been around for a while.”</p><p>Guilt was lashing at her now.</p><p>God, she remembered the look on his face when he’d seen the bruises on hers. He looked as though someone had died. Or something inside him had died. She hadn’t seen him since.</p><p>“I’m going to talk to him,” she promised.</p><p>What the hell was it with Jed Booker?</p><p>He was just staring at her. There was no force, no guilt-inducing comments, just those dark, dark blue eyes watching her with that silent, deep curiosity.</p> <p>“Are you?” Jed asked.</p><p>It was a simple question. No mockery, no sarcasm, nothing offensive, but Piper could feel the guilt growing inside her.</p><p>“You don’t understand what he’s like, Jed,” she burst out, pushing her fingers through her hair in frustration as she turned and stomped to the other side of the room before turning back. “This is how he gets you. He knows how to work every damned one of us.”</p><p>“Does he, Piper?” he asked her quietly. “Or is he just struggling with his inability to protect four girls he loves nearly as much as he does his own daughter? Four girls whose abandonment and hardships as children torment him?”</p><p>She shook her head fiercely. “That wasn’t his fault.”</p><p>“Fault doesn’t matter, Piper,” he said calmly, moving to her, making her all too aware of the sudden sensitivity of her body whenever he was around.</p><p>His voice was steady, every movement deliberate, but his eyes were like deep pools of sexual heat. His gaze licked over her as his hands curved against her bare shoulders. They slid down along her arms, then back up, the rasp of the calluses against her softer flesh so erotic she was forced to bite back a moan.</p><p>“What does matter, Jed?” she asked, unable to break her gaze from his. “Should I give in to him as Eve tried to do, and refuse to end up in your bed? Should I promise not to live or have a life so Dawg can sleep at night?”</p><p>Tears filled her eyes at the thought. “Don’t you think I’ve learned how I have to handle him by now? If I don’t defy him, then I won’t have a chance at having a life myself.”</p><p>“And there are those times you could defy him and lose your life, Piper.”</p><p>“Then he has to learn to talk to us.” Frustrated anger hoarsened her voice as it tore through her emotions. “Why do we have to automatically give in and bury our heads against life or risk dying? Jed, I can’t do that. If I’m in danger then I have to know, and I have to know why. Just as you would.”</p><p>His gaze flickered and she knew he understood that.</p><p>“If I go to Dawg, then he’ll see it as a weakness; don’t you understand that? I’ll be giving in and he’ll take full advantage of it. Not out of cruelty.” She held her hand up to delay whatever argument she could see brewing in his expression. “Not out of manipulation. That’s his instinct,” she argued. “Just as it’s yours.”</p><p>It was the way they were, the type of men they were. If Dawg didn’t come to her first, seeking answers, then he wouldn’t be in a frame of mind to discuss what had happened to her while she was away. He would dictate her security instead and try to lock her so far out of sight she would have a hard time finding herself, let alone anyone else finding her.</p><p>“You forget: I came for you.” His head lowered as he voiced the reminder, his lips brushing against her ear and causing her eyes to close at the pleasure of the touch. “No questions, no demands. I came for you, Piper, and I’m the one forced to field questions from your friends and family. If I have to take Rowdy or Natches Mackay’s fist for you, because I keep refusing to answer their questions, then you are going to owe me. Big-time.”</p><p>The words were a breath of warning against her neck as Piper felt her knees weaken.</p><p>Lifting her hands from where they hung at her sides, she tentatively gripped his upper arms, feeling the play of his biceps beneath her fingers.</p><p>“They won’t hit you.” She knew her brother and her cousins. They were hard men, but they weren’t unfair.</p><p>“Perhaps I should have a taste now.” His lips brushed against her jaw. “Show me what I’m going to take that punch for, Piper.”</p><p>Her head turned; her lips parted.</p><p>She’d dreamed of his kiss since that first one six weeks before. Each day, each time he spoke to her, teased her, silently rebuked her, had built the need for it.</p><p>She needed his kiss.</p><p>She needed his touch.</p><p>Her lips accepted his, parted, and Piper found herself dragged into a chaotic storm of pure heat.</p><p>Pleasure raced across her flesh like ribbons of electric sensation. From her lips to the tip of her toes and back to the crown of her head, his lips against hers created a reaction she couldn’t have expected.</p><p>She should have expected. She’d felt it before. But how was she to know that the first time hadn’t been just a fluke? She had never predicted the intensity of the pleasure to repeat itself or—incredibly—to begin building higher, stronger.</p><p>Faster.</p><p>Jed barely controlled the gut-deep groan of instant, overwhelming hunger.</p><p>Son of a bitch, it couldn’t be this good. There was no way this unusual depth of pleasure was real.</p><p>He’d convinced himself it had been a figment of his imagination, but as he lifted Piper against his chest and bore her to the bed, he knew the pleasure was doing just that.</p><p>It was burning brighter, hotter, and deeper than anything he’d ever known.</p><p>She wasn’t doing anything different. It wasn’t that experience filled each tentative lick of her tongue against his or each heated brush of her body against his.</p><p>Piper was anything and everything but experienced, and he knew it. He’d made it his job to know everything about her that a man could dig up.</p><p>But he hadn’t known the effect she’d have on him.</p><p>A low moan slipped past his lips. Her knees were hugging his hips, the thin material of her panties beneath the ankle-length silky skirt she wore rubbing against the denim of his jeans as it covered the tormented length of his dick.</p><p>God, he was hard.</p><p>So hard he felt as though his cock were seconds away from becoming pure steel, throbbing furiously, his testicles drawn tight beneath it. He knew he wouldn’t last long. Hell, he’d be lucky if he got inside her before he embarrassed himself and spilled his release into his jeans.</p><p>Laying her back on the bed, Jed couldn’t force himself to break from the kiss that seemed to be feeding the flaming lust burning between them.</p><p>Fuck, it was good.</p><p>She was good.</p><p>She was as sweet as sunrise and as hot as the Texas heat waves he remembered from his childhood.</p><p>Rolling his hips against hers, the hardened length of his cock pressing against the tender mound of her pussy, Jed worried at his lack of self-control.</p><p>She wasn’t experienced. Hell, it would surprise the hell out of him if he learned she wasn’t a virgin. But she had the power to strip him down to the core of who and what he was. A male animal. A sexually hungry, sexually determined, sexually intent male animal, and he couldn’t seem to pull himself back.</p><p>That powerlessness was so alien to his character, to his very nature, that shock resounded to the depths of his senses.</p><p>Yet it wasn’t enough to stop him.</p><p>One hand pushed beneath the loose, sleeveless top she wore. One of her own creations yet again: a soft white silk with a handkerchief hem that perfectly matched the hem of the skirt.</p><p>Tiny, tiny mother-of-pearl buttons held the material over her rapidly rising and falling breasts as his hand slid beneath the top, his palm cupping the underside of one breast perfectly.</p><p>The excuse for a bra was little more than silky lace, easily pushed aside by his fingers as his thumb searched out the hardened little point of her nipple.</p><p>It was swollen tight and hard, and the caress he gave it had Piper arching to him, a muted cry falling from her lips as pleasure arced between them like a live electrical connection.</p><p>With his free hand Jed struggled to undress her. The tiny buttons were instruments of torture as his fingers fumbled and slipped on them. It seemed to take forever, but finally he released the captive tip of her nipple to lift her to him and push the blouse from her shoulders.</p><p>Reaching behind his neck, he gripped her wrists, pulling them free of the hold she had on him and dragging them down to allow him to remove the blouse and lacy bra.</p><p>Hard, sipping kisses kept them connected as he hurried to undress first Piper’s lush, heated body, then his own harder, fiercer one.</p><p>If he didn’t have her, if he didn’t sink his cock inside her soon, then he was going to die of the hunger clawing inside him.</p><p>“So fucking pretty,” he growled against her lips as he finally had her naked beneath him, had himself naked and ready to take her.</p><p>But the silken peaches-and-cream flesh distracted him.</p><p>He meant to spread her thighs and sink inside her while he still had the control to take her slow and easy.</p><p>He made the mistake of lifting himself from her, releasing her lips to rise above her, his gaze lowering to the full, tempting globes of her breasts.</p><p>Tiny hardened cherry red nipples topped the firm flesh, and the temptation to taste them was too much to resist.</p><p>“You’re killing me,” he groaned. “God help us both, Piper; I’m dying for you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The need to taste her had his mouth watering, the hunger obliterating everything else. His head lowered, lips parting, and when he captured one tight, swollen peak, he swore he could feel her losing control along with him.</p><p>Piper jerked at the sudden suction of his mouth against the overly sensitive tip of her breast. The sensation was so sharp, so brutally erotic that her hands rose quickly to his shoulders, her nails biting against his flesh.</p><p>She had to hold on.</p><p>Oh, God, it was so good.</p><p>She whipped her head against the comforter beneath her, her hips lifting against him, feeling the brush of the heavy width of his cock against her thighs—there were so many sensations. So much pleasure.</p><p>The tugging of his mouth around the tender bud of her breast was an agonizing pleasure. One hand cupped the curve of her flesh as the other moved slowly down her waist to the rounded curve of her thigh.</p><p>“Part your legs,” he ordered hoarsely as his lips moved to the opposite peak. “Ah, God, let me in, baby. Let me have you.”</p><p>She was really going to do this, wasn’t she?</p><p>There was no turning back; she could feel it.</p><p>After years of wondering why she’d been unable to take a lover, the mystery was now solved.</p><p>She hadn’t taken one because she’d needed Jed. She’d waited for him, ached for him—somehow she’d known he was out there; she’d known he’d come for her.</p><p>Her legs parted, urged by the powerful fingers at her thighs as his lips lowered and covered the other hardened tip of her nipple. Suckling it, he lapped at it with his tongue, then rasped it with his teeth.</p><p>Piper felt as though she were being devoured.</p><p>That thought was amended as his lips began a path down her torso. Hungry kisses, tasting licks set fire to her senses. Caresses stroked pure exquisite pleasure to her nerve endings and had her waiting in painful anticipation as he moved ever closer to her trembling thighs.</p><p>“You know what I want, baby.” He groaned as he found her belly button and felt her tremble in response. “I want all those sweet juices gathering at your pussy.”</p><p>Her breath caught and held in her chest as his lips moved farther, kissed, stroked, licked.</p><p>A breath of air brushed over the bare flesh of her pussy, the dew-slick folds sensitizing further at the thought of the coming caress.</p><p>She couldn’t help but watch.</p><p>His gaze caught hers for long, erotic moments before his eyes dropped, drawing her eyes to the swollen folds.</p><p>His lips parting, Jed’s head lowered, his tongue reaching out for her, then burying in the slick, swollen flesh of her pussy.</p><p>“Oh, God. Jed.” Her hands slid into his hair, gripped and held on tight as her upper body jerked upward in response.</p><p>Spreading her knees farther, Piper dug her feet into the bed and lifted her hips, pressing closer, muted, hoarse cries leaving her throat as his tongue began a sensual, delicious dance in the plump, slick flesh he’d found.</p> <p>He pushed his hands beneath her hips to lift her closer, and Piper lost the strength to hold her shoulders and head from the bed. Falling back, she strained against the pleasure, eyes closed, reaching for the brilliance of the supernova of fiery heat she could feel building in her pussy.</p><p>Wicked and erotic, his tongue lapped at the juices spilling from her vagina before easing up, licking and stroking, pushing her further, deeper into the maelstrom gathering inside her. Rasping, probing, the devilish instrument of torturous ecstasy began licking around her straining clit, testing the swollen tenderness, inciting it to a desperate ache that had her crying out for release.</p><p>When his lips covered the distended little bundle of nerves, Piper felt the shock of it explode through her system. Shuddering, her hips jerking against his hold, against the sucking heat, she felt her senses begin dissolving in a release of such pure ecstasy that she swore she could feel herself flying.</p><p>Drawn tight, arching to him, racked by primal internal shudders of a climax that shocked her to her woman’s core, she fought to cry, to scream out the pleasure, only to find enough air to give a low, ragged moan.</p><p>And still it wasn’t enough.</p><p>For all the strength and power of the climax gripping her, still, that building ache in her pussy drove her to reach for more. To beg for more.</p><p>Her eyes jerked open as he pulled himself to his knees.</p><p>Eyes wide, Piper’s gaze focused on the thick, engorged crest of his cock. He quickly pulled the condom from the side table, tore it open, then rolled the protective sheath over himself, before he came over her once again.</p><p>“Jed . . . ?” She could feel the trepidation building inside her.</p><p>“I have you, Piper.” She was only barely aware of the words whispered at her ear as he buried his lips in her neck. “It’s okay, baby; I have you.”</p><p>Everything inside her stilled then.</p><p>The feel of the hard, thickened crest of his penis pressing into the quivering entrance of her vagina held her poised on a rack of desperate need and building fear.</p><p>“Jed. Jed, I haven’t—” A groan tore through her as the throbbing width of his cock breached the clenched opening of her pussy.</p><p>“I know, sweetheart.” His head lifted. “Look at me, Piper. Let me see you.”</p><p>She forced her eyes open, watching his eyes as he stared down at her, the blue so dark it now appeared black.</p><p>“Hold on to me.” He groaned as her hands clenched in the comforter. “Hold on to me, sweetheart.”</p><p>Lifting her hands, she gripped his upper arms, stared into his eyes, and felt him advance further before pulling back.</p><p>“Wait.” The protest was instinctive.</p><p>“Shhh, I’m not going anywhere,” he promised, his lips lowering to hers. “Just hold on to me. Just for a second.”</p><p>The muscles of his hips bunched, the head of his cock throbbed inside her, and a second later a hard, heavy thrust had the iron-hard length powering through the shield of an innocence she knew she’d saved for him.</p><p>His lips caught her cry at the shock of the entrance.</p><p>Holding the kiss, he pulled back, then pushed inside again, burying deeper as pleasure and pain began to build with equal intensity.</p><p>Lifting her legs to get closer to each heavy thrust, Piper gave herself to him, knowing that from this moment on, she no longer completely belonged to herself.</p><p>Each hard thrust inside the clenched depths of her pussy pushed inside her with increasing strength, faster, to an edge of a fiery abyss she was both terrified of and reaching for.</p><p>Pleasure radiated through her body, stoked by each piercing impalement of his cock inside her, stretching her, burning the sensitive depths with the heavy heat of his possession.</p><p>Moving over her, stroking inside her with quick, deep thrusts of the steel-hard, heated flesh, Jed pushed her harder, faster. Her hands clenched on his arms as the flared crest parted her flesh and drove to the depths of her before quickly retreating, then stroking over flesh so sensitive that the pleasure was agonizing with each stroke.</p><p>Each thrust was harder, faster. Each was hotter, more demanding, until that abyss reached out for her, the flames exploding around her and tearing through her senses with such blinding ecstasy that she knew she would never be the same.</p><p>Harsh, quaking shudders of sensation attacked her body. Unprepared for their strength, for the sheer destruction of her senses, Piper could only do as he’d told her: She held on tight.</p><p>She gasped, crying out his name as her body clenched and shuddered beneath him, her pussy tightening around his shuttling cock until he thrust in hard and deep and gave himself to his own pleasure.</p><p>She hadn’t imagined it could be like this. She’d never conceived of such pleasure, of such deep, overwhelming waves of pure ecstasy streaking through her, possessing her.</p><p>She wouldn’t have believed that in one moment of rapture her soul would open and her heart would give itself totally, completely, to a man as fierce, as hard, and yet as gentle as Jedediah Booker.</p><p>NINE</p><p>Eve had told her that once Brogan had touched her, once she had learned what real pleasure, real intimacy were, then she’d been caught.</p><p>Hook, line, and sinker, sister. Eve had grinned unrepentantly the day Piper had berated her for moving from the inn and leaving her, Lyrica, and Zoey—well, mostly her and Lyrica—to face the fallout.</p><p>The fallout being Tim, Dawg, Rowdy, and Natches becoming so damned protective that Piper, Lyrica, and even Zoey—the most spoiled of the sisters—were feeling the bite of the males’ overprotectiveness.</p><p>Lying in Jed’s arms that afternoon, Piper wondered what she was getting herself into this time, and just how it would affect not just her, but also her unattached sisters.</p><p>“Stop thinkin’,” Jed drawled, and for just a second there was a hint of the Texas upbringing he’d once told her he’d had.</p><p>“You’re starting to sound like a cowboy.” Turning against his chest, she propped herself up and stared at him from where she lay against his shoulder.</p><p>Jed grunted lazily. “Yeah, it creeps out now and again.”</p><p>“This is the first time I’ve actually heard it,” she pointed out. “I was starting to wonder if you’d lied to me about being born in Texas.”</p><p>That Texas drawl was unmistakable. And she’d never heard it pass his lips.</p><p>So why now?</p><p>She was almost glowing at the possibility that perhaps sexual satisfaction and male contentment had managed to relax him enough that he’d lost a moment’s control over something it seemed he’d deliberately suppressed.</p><p>“I don’t lie to you.” The simple statement had her stomach tightening in a feeling akin to, but not exactly, the panic attacks of the past.</p><p>This wasn’t panic. It was terrified anticipation, petrified hope. It was something it shouldn’t be; that was for damned sure.</p><p>“You’ve never lied to me?” Forcing the disbelief into her voice wasn’t easy.</p><p>It was almost impossible simply because she wanted so desperately to believe him. Wanted to believe him, and she was too scared to allow herself to do so.</p><p>“I’ve never lied to you, Piper. And I never will.”</p><p>Was he lying to her? He had to be lying to her.</p><p>“I won’t lie to you,” he continued. “But that doesn’t mean there aren’t questions I can’t answer. If I can make the commitment not to deceive you, then I expect you to make one not to ask the questions you know would be off-limits.”</p><p>Could she ask for more than that?</p><p>She didn’t know whether she could, or whether she should, but she knew she had to.</p><p>Sitting up, she tucked the sheet around her breasts and stared down at him silently for long moments. With one forearm lifted and tucked beneath his head, his dark navy blue eyes so intent and serious, with long strands of dark blond, gold, and tawny hair falling over his forehead, he resembled the men he employed on the construction job that she knew he used as a cover. Rugged and hard, lean and naturally muscled.</p><p>“How am I supposed to know what questions are off-limits?” Tilting her head to the side, she watched him curiously now, wondering whether this was how Eve and Brogan made their relationship work. Did they have an understanding that there were parts of his life and what he did that she couldn’t question?</p><p>Could she live with that? Really?</p><p>She loved Jed. She’d known that for a while now.</p><p>But did she love him enough to abide by such a rule?</p><p>“I think you’ll know which questions those are.” His gaze dropped to her breasts as they rose over the edge of the sheet.</p><p>“I think that if those are the rules, Jed, then I have to know who and what you are. If that information is off-limits, then you may as well climb that cute ass right out of my bed before one of us gets pissed off.”</p><p>God help him, but he loved her.</p><p>Jed stared up at Piper Mackay and knew she owned parts of his heart and soul that he hadn’t even known existed. There was no denying that they belonged to her, either, because as he watched her, he knew he’d trust her with every secret he had inside his soul. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He’d trust her with them, but he’d never tell her some secrets. The secrets that were far too dangerous to her safety should she know them.</p><p>Because he knew beyond a shadow of a doubt that to save her, he’d betray each and every one of those secrets, and he knew she’d do the same for him.</p><p>“I’m an agent for the United States Federal Protective Service,” he told her. “We’re tasked with protecting and investigating any threats to the possessions of the United States government and, in some instances, government employees. You knew I was an agent.” She nodded her head slowly. “What did Eve tell you happened last summer?”</p> <p>“That several former members of the Freedom League believed Dawg had something Chandler Mackay had stolen years ago, and they kidnapped her to attempt to make him turn it over.”</p><p>Jed nodded. That was the story they had come up with, not that the majority of it wasn’t true. It was. It just wasn’t the full explanation; neither did it include Eve’s fiancé’s part in the situation, or Jed’s and Elijah’s.</p><p>“Those members were stealing confidential files from military and government offices to locate a cache of gold Chandler hid years ago. They believed Dawg would know where it was stashed.”</p><p>Dawg probably did know where it was stashed, Piper thought. Hell, he probably had it hidden himself once he found it.</p><p>She knew he’d taken to keeping the things Chandler had stashed away as he found them, out of pure spitefulness toward the government, once he’d learned how Piper, her mother, and her sisters were treated after Homeland Security had found them.</p> <p>“I guess telling me the truth means you intend to stick around for a while?” she asked, trying to hold on to the charade she’d played since meeting him.</p><p>That unspoken lie that what he did or where he went wouldn’t matter to her.</p><p>Uncurling his arm from beneath his head, he slid his hand behind her neck and pulled her to him.</p><p>“What do you think, Piper?” he growled against her lips. “Do you think there’s a chance in hell that I’ll ever let you go now?”</p><p>He didn’t give her a chance to answer him. The teasing brush of his lips turned serious, burned through any objections she might have, and left her too hungry, her body too heated to deny him.</p><p>Possessiveness rang in his tone, gleamed in the midnight blue of his eyes, and filled the power and dominant strength of his kiss.</p> <p>Did she think he would let her go now?</p><p>Not for a while, perhaps.</p><p>Not until the hunger began to dim. Not until the flame of lust began to cool. And wasn’t that the way of it?</p><p>The questions, the uncertainties and insecurities of the emotions raging through her became suppressed by a pleasure she couldn’t deny.</p><p>A pleasure she didn’t want to deny.</p><p>His lips rubbed against hers, his tongue licking at hers, tasting her and allowing her to taste him in turn.</p><p>The wild, erotic flavor of his kiss was one she was certain she would never be fully prepared for. The heat and wonder, the incredible pleasure and full, chaotic sensory overload were unlike anything she had ever known before his touch.</p><p>She’d waited for this since she’d first realized how sensual a male’s touch could be, or how pleasurable a kiss could be. She’d waited for this kiss.</p> <p>She’d waited for Jed.</p><p>Easing back, Jed slid kisses from her lips to her jaw as his arms wrapped around her, pulling her closer to his aroused body.</p><p>Heat surrounded her. Flames licked over her nerve endings and pierced her pussy with a force that had the tender muscles clenching violently.</p><p>The feel of her juices easing along the sensitive portal, and the fierce ache in her clit as it built rapidly, pulled a low, desperate moan from her lips.</p><p>She needed him. She ached for him.</p><p>Smoothing her hands along his shoulders to the heavy strength of his biceps, Piper held on tight as she felt herself being lowered to her back. Anticipation began to build, along with pleasure and the driving need for more.</p><p>Always for more.</p><p>Surely the day would come when the instantaneous need for his possession would ease. When he would touch her and she would at least have a moment to think, to consider, before her hunger for him overrode any other consideration.</p><p>At the moment, she couldn’t imagine it happening, though.</p><p>His lips slid along her neck, and she felt the rasp of his beard, the feel of his hand stroking against her stomach, moving higher, cupping her breast. Each sensation built in pleasure and in heat until Piper was moaning beneath him, her hips lifting, pressing the mound of her pussy against the hard muscle of his thigh as he came over her.</p><p>“I get drunk on you, Piper,” he muttered against her breast, his lips brushing against the tight, sensitive peak of her breast a second before his tongue rasped over it with erotic hunger.</p><p>“Please, Jed,” she whispered, desperate. “Don’t wait.”</p><p>She wanted him now. Foreplay could come later.</p><p>He moved closer, his legs parting hers as his head lifted from her breast.</p><p>Piper forced her eyes open.</p><p>She wanted to watch, wanted to see him take her.</p><p>She was on the verge of begging when the world suddenly upended.</p><p>One second she was lying beneath Jed, anticipation tearing through her senses.</p><p>In the next second it felt as though she were flying through the air before she landed against Jed’s hard body, only to be rolled quickly to the floor.</p><p>Everything happened so fast. Too fast.</p><p>Wide-eyed, shocked, she let her gaze follow his hand as he reached beneath her bed, jerked out a lethal black handgun, then leveled it over the top of the bed with steely-eyed intent.</p><p>As she rolled to her stomach to push herself from the floor, she heard the lazy, less-than-amused drawl.</p><p>“Jed, do you have a fucking death wish?”</p><p>Dawg didn’t sound pissed, but he didn’t sound approving either. It was a dangerous tone of voice that assured all those listening that his mood could swing either way.</p><p>He was ready to talk, and in true “Dawg” style, he was barging right in.</p><p>Lips tightening, Piper jerked the sheet Jed had dragged off the bed as they rolled, and wrapped it quickly around her naked body. Peeking over the side of the bed, she growled back at her brother.</p><p>“Why are you sneaking into my bedroom?”</p><p>Dawg’s brow lifted. “Little sister, I wasn’t sneaking. Your door was unlocked.”</p><p>“The hell it was.” Struggling with the sheet with one hand to keep it around her, Piper used the other to push her hair back from her face as she glared at Dawg.</p><p>She was all too aware of Jed moving to his feet, completely at ease with his nudity and not the least bit ashamed as he collected his clothes. Dawg’s expression tightened, his mood shifting toward that dangerous mark.</p><p>“Don’t call me a liar, Piper,” Dawg warned her then. “I said the door was unlocked. Trust me; it was unlocked.”</p><p>“I locked that door earlier, Dawg,” she told him, suddenly aware that something simply wasn’t right where his entrance was concerned. “I remember securing it. And neither Jed nor myself has gone out of it since.”</p><p>Dawg’s gaze narrowed. “I wasn’t exactly quiet when I pulled in and called out to Mercedes to tell her I was coming around to your room.” His gaze swung to Jed as he laid his shirt across the table before securing the belt on his jeans. “I guess there’s not a chance in hell you heard anything?”</p><p>Jed cleared his throat. As he glanced at her, Piper felt her face flushing heatedly.</p><p>She knew exactly why they hadn’t heard anything.</p><p>“Figures.” Dawg grunted, drawing Piper’s attention back to him. “You’re certain the door was locked?”</p><p>Tipping her head to the side, she stared back at him with mocking disbelief. “Really, Dawg?”</p><p>They both knew she was certain. Piper was the one often found checking all the doors and windows in the middle of the night, to be certain no one could slip into the suite.</p><p>Lifting his hand, he pushed his fingers through his hair in agitation before staring back at her, his celadon gaze filled with concern. “Piper, please God, tell me what’s going on before someone does more than bruise your face.”</p><p>She knew that door had been locked, which meant someone had unlocked it at a time when they would have believed she was otherwise occupied.</p><p>They were there looking for something.</p><p>She just had no idea who or what they were searching for.</p><p>TEN</p><p>Staring into her brother’s face and seeing the fear and worry for her reflected in his gaze, Piper was forced to admit that her suspicions regarding the attack couldn’t be ignored any longer. There wasn’t so much as a sliver of a chance that the attack in New York had been random, and she knew it.</p><p>It hadn’t been an accident that her room was the one a burglar had targeted. She hadn’t been randomly picked out of a crowd and then followed to her room. She wasn’t just a faceless nobody someone had decided to torment.</p><p>And the nightmares . . .</p><p>Those vague, shadowy horrorscapes she drifted into once she fell asleep couldn’t be ignored either. Just as the unlocked door couldn’t be overlooked. Someone was desperate enough to get to her that they had picked the lock on her patio doors in broad daylight.</p><p>Breaking contact with Dawg’s fierce look, she glanced at Jed, and knew he had reached the end of his patience as well. If she didn’t tell her brother now, then he would.</p><p>“As you know, I slipped out of town last week.” She sighed in resignation as she stared back at her brother once again. “A friend drove me to Louisville, where I caught a train to New York City to meet with someone interested in my designs. I was getting ready to leave to come home when I asked the front desk to send up a bellhop to help with my luggage. I had bought lots of materials at the fabric stores.” She waved her hand toward her worktable. “It wasn’t the bellhop who arrived. When I opened the door, I got a faceful of fist, and if it hadn’t been for the kids in the adjoining room, the damage would have been much worse.”</p><p>Dawg sat down slowly in the chair beside him before wiping his hands carefully over his face.</p><p>“I need to get dressed.” She breathed out roughly. “You can question me when I get back.”</p><p>Gathering her clothes, she strode quickly to the bathroom and snapped the door closed behind her before leaning against it and dragging in a ragged, fear-filled breath.</p><p>She knew she had locked that door.</p><p>She remembered locking it, just as she remembered Jed checking those locks when he’d risen from the bed after they had caught their breath.</p><p>What if she had been alone and Dawg hadn’t shown up?</p><p>What if she had been attacked again? Or one of her sisters, or her mother?</p><p>God, what had she managed to draw back to Somerset and her family?</p><p>Dawg stared at the closed bathroom door before turning his gaze on Jed.</p><p>The other man was playing with one of the little glass gems Piper was so fond of. She’d bought a shitload of stuff, evidently, while she had been in Manhattan. Enough that she’d not wanted to carry it all herself to the cab.</p><p>She had instead opened her door to some bastard pretending to be a bellhop.</p><p>“What do you know, Jed?” he finally questioned the other man.</p><p>Listening to Jed’s account of the night the kid had called him, and his arrival at the hospital, Dawg had to admit that his gratitude toward the other man was overwhelming.</p><p>There was no doubt in his mind that Piper would not have called him or one of their cousins. She was so wary of their protective tendencies, and so certain, according to Jed, that the attack had been random, that she would have never watched her back.</p><p>Fortunately, Jed had been watching it for her.</p><p>“Did you suspect she would be followed?” Dawg asked when he finished.</p><p>“If I had suspected it, she would have called you long before now,” Jed informed him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jed turned his head as the bathroom door opened and Piper walked slowly from the room.</p><p>It was then that Dawg saw the expression that transformed Jed’s face.</p><p>Hell, he’d hoped it hadn’t gone that far.</p> <p>No, he’d known it had gone that far, he amended as he watched Piper’s gaze meet her lover’s and saw the unconscious devotion that filled her face and eyes as well.</p><p>Those two were already so fucking bonded that he doubted even death would separate them. And he was certain neither of them was even fully aware of how deep it went.</p><p>Jed straightened as Piper moved from the bathroom. Intending to reach out for her, he was more than a little surprised when she moved to him instead.</p><p>Snagging his arm around her waist and pulling her to him, Jed ignored Dawg’s dark expression and instead gave Piper the silent security he knew she was reaching out for.</p><p>“Do you remember anything the attacker said? Anything he did? Any odd scents, or an accent?” Dawg asked her as Jed felt the subtle tremor that raced up her spine.</p> <p>“He said something.”</p><p>Jed tightened at the admission but didn’t berate her. It was the wrong time to do so, with Dawg standing there watching so closely.</p><p>It would hurt her to be embarrassed in such a way in front of her brother. And it would embarrass her, at the very least subconsciously.</p><p>“What did he say?” Dawg urged as he pulled his cell phone free and, Jed suspected, hit the record feature.</p><p>“That’s just it; I don’t remember what he said.” Frustration filled her voice, thickened it and hinted at her inability to make sense of whatever she remembered. “He was demanding something, and I didn’t know what the hell he was talking about.”</p><p>Jed rubbed her lower arms gently, forcing himself to hold back the fury burning in his chest.</p> <p>“You can’t remember a single word?” Dawg questioned her again, his tone smoother than it had been moments ago, less angry, as though he too sensed the effect their anger had on her.</p><p>“Something about a car.” She sighed, shaking her head as another tremor raced up her spine. “I just can’t remember, Dawg.”</p><p>“I have a few contacts in the city,” Dawg murmured. “And a few spread out through the police department. I’ll make some calls and see what I can find out.”</p><p>“I’m sorry, Dawg.” Guilt was lashing at Piper’s senses now.</p><p>Dawg was doing everything he could not to explode, to hide his anger.</p><p>Those bright celadon eyes seemed darker than normal, his expression almost haggard, and she realized the past week had been just as hard on him, perhaps, as it had been on her.</p><p>“For what?” he asked then.</p><p>“I shouldn’t have reacted as I did when you saw my face. I was terrified you’d try to lock me away somewhere, though. You don’t know how scary you get when you’re in protection mode.”</p> <p>“That’s still a possibility.” He grunted as he leaned back in the chair and crossed his arms over his broad chest.</p><p>The black T-shirt he wore stretched across his powerful biceps created an impression of vast strength. “The nightmares have been brutal, Piper.”</p><p>And they had been, she knew. The Mackay wives, Christa, Kelly, and Chaya, had arrived the day before and, along with her sisters and mother, berated Piper for refusing to tell any of them what happened.</p><p>Christa had told her that Dawg had been awakening from nightmares ever since, certain that Piper was in grave danger, and he had no idea how to protect her.</p><p>“I love you, Dawg.” What more could she say? “You, Rowdy, and Natches saved us. But you’ve also smothered us this last year. Smothered us to the point that there’s no privacy at all. And I just couldn’t handle it any longer.”</p><p>He leaned forward, his arms dropping from his chest and resting against his knees as he clasped his hands between them.</p><p>“Piper, if I ever end up having to bury one of you because I faltered or because I didn’t know one of you was in danger, I don’t know if I would survive the guilt. You’re a Mackay. Your sisters are Mackays. Trouble and danger will always follow the four of you because of the covert jobs you hold. Unless . . .” He gave Jed a long, hard look. “Unless there’s someone strong enough, someone dangerous enough, to deflect it.”</p><p>Oh, Jed was strong enough. And he was dangerous enough. . . .</p><p>“Perhaps you should teach us properly how to protect ourselves, Dawg. I’m certain you and Jed would like to sleep sometime. And I do like going to the ladies’ room without some hulking male standing outside the stall.”</p><p>She shot him a tight, hard smile as irritation flashed in his expression, and Jed’s arms tightened around her.</p><p>Dawg could only shake his head. “God, and here I thought you were the least stubborn sister.”</p><p>“Just the quietest one,” she amended the thought. “Trust me, Dawg: No matter the impression Eve gave you, neither Lyrica, Zoey, nor myself are willing to live like fugitives or witness protection candidates. You’re going to have to come up with a solution other than some strong, forceful caveman to keep us from attracting trouble.”</p><p>“No kidding.” He grunted, rising to his feet. “I’m going to get out of here and make a few phone calls, catch up with Natches and Rowdy, and see what we can figure out.” His gaze sliced to Jed’s. “Make sure she’s either not in this room, or that her locks are secured against anyone determined to get in.”</p><p>She felt Jed shift behind her and glanced back.</p><p>He was staring at her worktable again, only this time, as he released her, his fingers went to the dark green glass jewels scattered amid the red and clear cut crystals.</p><p>“Those will be so pretty on the dress I’m designing.” She sighed.</p><p>He rolled several in amid another batch whose color didn’t seem as deep or rich.</p><p>“Where did you get them?” He picked a few up before moving across the room and handing them to Dawg.</p><p>Piper watched them curiously.</p><p>“A craft shop in New York, in the Garment District.” She shrugged, catching Dawg’s eye. “You’ve taken me there before.”</p><p>Dawg rose slowly to his feet, his gaze on the pieces of colored glass.</p><p>Closing his hand quickly around the stones he held, he flipped the cell phone open again and made a call.</p><p>“I need you down here in Piper’s room, ASAP. And if you have a jeweler’s loupe or a strong magnifying glass, bring it with you,” he ordered—Tim, Piper assumed.</p><p>She rather doubted he was ordering one of her sisters or her mother down here.</p><p>Flipping the phone closed, he moved to the table next to her bed and flipped on the light.</p><p>Holding his hand beneath the brightest area of the lamp’s glow, he turned the stones with a finger, studying them carefully.</p><p>“What the hell is going on?” Piper whispered as trepidation began to rise inside her.</p><p>The panicked feeling that tightened her stomach shortened her breath and left her with the sensation of being unable to fill her lungs.</p><p>“Piper.” Dawg lifted his gaze as Timothy rushed into the room, magnifying glass in hand. “These aren’t glass.” Lifting his gaze to Timothy Cranston, he motioned him over. “Tell me what these are.”</p><p>Dropping the stones in Timothy’s hand, Dawg stared down at him with a dark glower.</p><p>Holding his hand beneath the light, Timothy moved the magnifying glass over his hand and studied the colored objects with a frown.</p><p>“Where did you get these?” he asked Dawg, never taking his eyes from his palm.</p><p>“Piper brought them home from New York.” The growl in Dawg’s tone was a dangerous rasp. “She says she picked them up at a craft store.”</p><p>Timothy didn’t bother to lift his head or his gaze from the magnifying glass.</p><p>“She didn’t get these at a craft store,” he murmured. “Where else did you go?”</p><p>“What are they?” she questioned him warily.</p><p>“Emeralds, rubies, diamonds, and sapphires, Piper. These aren’t pretty crystals and colored glass, sweetheart. Now, tell me where else you went.”</p><p>Piper shook her head, swallowing tightly.</p><p>Diamonds, emeralds, rubies, and sapphires?</p><p>God, no wonder she’d thought they looked so much more brilliant after she got them home than they had when she first picked them out at the craft store.</p><p>“I rented a car and drove outside the city for a meeting, but I never had that shopping bag out of the car. When I returned the car, everything had fallen out of the bag to the floor, and the stones I bought were scattered on the back driver’s-side floorboard.”</p><p>Timothy jerked his head around to glare at her then.</p><p>“A rental car?” he questioned her, his tone icy.</p><p>Piper nodded slowly. “It was a rental.”</p><p>“What was the name of the agency?” Tim asked.</p><p>“Riley’s Rentals.”</p><p>Tim nodded slowly before lifting his gaze to Dawg’s. “That’s Genoa property.”</p><p>Genoa property.</p><p>Piper had heard of the Genoa family and the Mackays’ run-in with them six years ago, just before Piper and her family were brought to Somerset.</p><p>The crime family had first butted heads with the Mackays when a family member, the niece of head of the family Rudy Genoa, had come for vengeance against John Walker Jr. and his lover, Sierra Lucas, for a broken engagement.</p><p>Marlena and her associate, Gerard Andrews, had been responsible for the half million dollars Rudy Genoa had advanced them to ensure Marlena caught John Walker’s attention and kept it.</p><p>Expensive clothes, salons, and an apartment on Park Avenue. She’d been plucked, polished, and perfected—until the night John had learned she was also fucking his friend and fellow attorney, Gerard Andrews. The same man who had assured the Genoa family that if John married Marlena and had a child with her, then the attorney would willingly put his name behind the defense of Genoa family members in court.</p><p>“How did they get in my car?” she whispered.</p><p>“The Genoa family’s rumored to be bringing jewels, gold, and cash into the States for another family—a Russian crime family they’re trying to build ties with. The Russians are shipping the contraband into Italy, where the Genoa family has ties, and then members of the family are taking over. Homeland Security and the FBI have been trying to figure out exactly how they’ve been doing it. If Riley’s Rentals is involved, then they’re likely shipping them in vehicles that are coming through as cargo. Riley’s has a reputation of shipping vehicles overseas and back again for wealthy clients. No agency has been able to tie them to anything illegal, though, until now.”</p><p>“What do we do?” Panic was beginning to edge through her senses as fear began to build.</p><p>“We’ll take care of it, Piper.” Jed’s arms tightened around her as Piper felt the fear beginning to overflow her tenuous control.</p><p>What had she managed to get herself into? Why had she allowed this to happen? She could have just told Dawg, Jed, and Tim what had happened and they would have figured this out a week ago. Before someone had attempted to break into her room.</p><p>“Don’t worry, Piper. We have the contacts to fix this,” Dawg promised her as he turned back to her. “You stay with Jed; Timothy and I will take care of things.”</p><p>This wasn’t what she wanted.</p><p>“I didn’t want you to have to risk yourself,” she whispered. “None of you. I just wanted to be able to take this meeting without everyone breathing down my neck.”</p><p>“You were being protected for a reason, Piper,” Jed stated as Dawg and Tim began to move toward the patio door, where Dawg was pointing out where the lock had been picked.</p><p>“For a reason I was never allowed to understand.” Turning, she faced him, her gaze meeting his, irritation flooding her as fear and confusion fueled the panic tightening her stomach. “Maybe, Jed, if something—anything—had been explained to me, then I would have been more prone to listen a little more closely.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Now you’re sounding like a child.” He sighed.</p><p>“Why shouldn’t I?” she mocked him. “That’s how I’m treated. Treat me like an adult and see if I don’t try to act like one.”</p><p>ELEVEN</p> <p>Nothing could possibly be easy, Piper thought as midnight rolled around before she was able to extricate herself from her mother, sisters, cousins, and various family members.</p><p>“Dawg couldn’t just keep his mouth shut?” she muttered as Jed escorted her into his room. “He could have kept all this to himself for a little while longer.”</p><p>“Dawg usually knows what he’s doing,” Jed assured her, locking the door behind them before turning and striding through the living area. “Stay here; I want to check out the bedroom again.”</p><p>Crossing her arms over her breasts, she watched as he disappeared into the bedroom, closing the door behind him.</p><p>So Dawg usually knew what he was doing, did he?</p> <p>“You are aware that Dawg is the one whom Tim accuses of constantly living by the seat of his pants, right?”</p><p>She didn’t quite catch Jed’s response, but it was something along the lines of, “That’s when Dawg is at his best.”</p><p>At his best, her ass.</p><p>It was when he was most dangerous.</p><p>She was still standing there glaring at the door when it opened and Jed walked through, his chest gloriously bare, his shirt conspicuously absent.</p><p>She didn’t need this right now.</p> <p>Hell.</p><p>Tightening her thighs, Piper fought to hold back the ache beginning there. The swelling of her clit, the throb of her pussy. The fiery, desperate need to be filled by the hard thrust of his cock.</p><p>Dark blond hair fell over his brow, while the navy blue of his gaze seemed to deepen and gleam with heated hunger as he stared back at her.</p><p>“He didn’t have to tell the whole damned family,” she muttered, her mouth drying out as he paced closer.</p><p>“Would you want to know if one of your sisters were in danger?” he asked softly.</p><p>Dark, thick lashes lowered over the gleam in his eyes as predatory awareness filled them.</p><p>He knew she wanted him.</p><p>It wasn’t as though she could hide the hardness of her nipples as they pressed into the thin material of the blouse she wore. Or the heavy pulse of blood in her throat.</p> <p>His gaze, heavy with latent lust and intent, flicked to the throbbing of the vein at the side of her neck, then back to the hard tips of her nipples.</p><p>Sensation raced over her flesh as heat built in her womb and fired a need she still had no idea how to handle. Hell, she didn’t even know how he managed to do this to her. What she did know was that resisting him wasn’t going to happen.</p><p>“You didn’t answer me, Piper.” He stopped just in front of her, his wide chest separated from the hard tips of her nipples by no more than a breath of space.</p><p>“What was the question again?” Oh, Lord, she was supposed to keep up with the conversation?</p><p>With him walking around with his broad naked chest? Oh, dear Lord, she didn’t think so.</p><p>“Would you want to know if your sisters were in danger?” he asked again.</p><p>“I remember the question.” She glared back at him, determined to bluff her way through having not heard it the first time. “That’s not the point, so why answer?”</p><p>A knowing smile curled his lips.</p><p>“Really?” Settling his hands on her hips, he brought her body flush against his.</p><p>Broad, fiercely erect, the length of his cock pressed against her belly behind the denim covering it.</p><p>“Really.” Trying not to appear too greedy to touch him, she let her fluttering fingers press against his chest.</p><p>“Beside the point, huh?” he asked.</p><p>Piper closed her eyes, hoping to find some measure of control against the hunger flooding her system.</p><p>“It really is.”</p><p>Closing her eyes didn’t help.</p><p>Oh, God, it only made it worse.</p><p>Jerking them open, she fought to catch her breath as his lips settled against the side of her neck for a heated kiss.</p><p>“Jed, what do you do to me?” she whispered, needing to know, to understand why she couldn’t deny the fire raging between them.</p><p>“The same thing you do to me, sweetheart, maybe?” His teeth raked against her neck as he finished the question, bringing a low, keening moan from her throat as she arched her neck.</p><p>“Do I make the world burn for you, too?”</p><p>Jed lifted his head, staring down at her, amazed by the question.</p><p>God, was that what he did for her? Did he make the world burn down around her? Because he swore that was exactly what it felt like to him as well.</p><p>It felt as though the world were burning down around him, and nothing mattered but the flames edging closer toward them.</p><p>“Baby, the world doesn’t even exist for me when I’m touching you.” Were those words really falling from his lips?</p><p>What the hell was she doing to him?</p><p>Moving his hands from her waist, he lowered them to the belt that cinched her waist loosely and released it. He dropped it to the floor, and his fingers moved to the buttons of her blouse.</p><p>Was that him actually fumbling with a button as his lips touched hers?</p><p>But, hell, her kiss was fire itself. It was the flame burning the world around him and searing him with pleasure. It was the fuel feeding it, and the only hope he had of surviving the effect on his senses.</p><p>Parting her lips further, tasting the teasing heat of her tongue against his, Jed had to force his fingers to work. To remove each button from the exquisite softness of the blouse she’d made with her own delicate fingers.</p><p>Fingers that were curling against his chest, blunt little nails rasping against his flesh as she dragged them to the jeans riding low at his hips.</p><p>Hell. She was tugging at his belt, releasing it, dragging it apart slowly as he deepened the kiss and drew in the rich essence of her feminine need.</p><p>The last button parted, the material separating and slowly drifting from her shoulders as he pushed it back from the rapid rise and fall of her breasts.</p><p>Soft, silken lace encased her breasts in a bra as light as air. Sliding the clip between her breasts open and pulling the fabric from the swollen weight of the firm curves, he was forced to pull his lips back from hers, to drag in air as the button of his jeans released.</p><p>His self-control was going to hell in a handbasket.</p><p>“Come here, baby.” Swinging her up into his arms, he strode quickly through the sitting room to the bedroom door.</p><p>Opening it and pushing through, he moved to the bed he’d turned back when he’d entered the room earlier to check the doors. Laying her against the cool white sheets, he moved his hands to her delicate legs, where the skirt she wore had fallen back above her knees.</p><p>The midcalf length of the full skirt shouldn’t have been so damned sexy, but it had tormented him all day with the knowledge that it covered flesh softer than the material over it.</p><p>Stroking his hand down one leg to her fragile feet, he removed the sandals covering one before moving to the next.</p><p>“Beautiful.” Running his hands back up the inside of her legs, he parted them gently, watching as the paisley print of the skirt fell back to her thighs. “Do you know how hard it was to keep from dragging you to this bedroom today? To keep from pushing my hands beneath this skirt to find all the sweet, hot flesh beneath?”</p><p>Piper arched beneath him, watching through lashes that refused to open fully, fighting to breathe through the incredible pleasure pouring through her.</p><p>Pushing his hands beneath the skirt, he curled his fingers beneath the elastic of the low-rise bikini underwear she wore and began pulling them down with exquisite slowness.</p><p>“Jed, you’re teasing me,” she accused him, her body tortured with the need for his possession.</p><p>“I’m teasing me.” Hot, rich lust echoed in his voice, filled the dark sound with wicked hunger as he pulled her panties free and tossed them to the floor.</p><p>Pulling back, he rose quickly beside the bed, and before she could do more than draw a sharp breath, he’d shed the denim and snug boxer underwear containing the fierce width of his straining erection.</p><p>Heavy veins throbbed forcefully along the shaft as he came to her, while the wide crest, flushed and dark with lust, gleamed with a layer of precome.</p><p>Rather than pushing her legs immediately apart and coming into her, as she’d expected, he lowered himself carefully over her. Rough with an overnight shadow of a beard, his cheek brushed against the side of her breast.</p><p>“So pretty,” he whispered as her hands gripped his shoulders, her legs parting to encase the muscular strength of his thighs.</p><p>Arching to him, Piper bit back a demanding moan. She needed to feel his lips against her breasts. Needed to feel the heavy draw of his mouth and the flick of his wicked tongue.</p><p>“You’re going to make me beg, aren’t you?” she demanded, a moan slipping into her voice as his lips brushed against the tight, sensitive point.</p><p>“Never.”</p><p>She would have, if he would just—</p><p>“Oh, God! Oh, Jed. Yes. Please.” Her hands lifted to his head, her fingers fisting in his hair as she strained against him, arching into the heated possession of his mouth as it wrapped around the sensitive peak of her breast.</p><p>The tender bud of her nipple throbbed in agonizing pleasure as he drew on it. Fierce, pleasure-sharp spikes of sensation raced to her clit and the depths of her vagina as the feel of silken warmth eased from the clenched portal.</p><p>Drawing on the tender flesh, he flicked his tongue against it with lashing warmth. Pleasure struck repeatedly at her womb, clenching her pussy and pounding through her clit with exquisite sensation.</p><p>“Oh, God, Jed, it’s so good.” She arched closer, desperate to feel his touch between her thighs. Piper’s senses became focused on nothing else but each fiery, rapturous tug of his lips and each suckling motion of his hot mouth as his fingers eased slowly, teasingly up her thigh.</p><p>“Jed, please.” Begging was so not beneath her as his fingers brushed against the silken folds of her pussy.</p><p>He parted the intimate lips, his touch too slow, almost taunting as she arched and ached for more.</p><p>The pad of his finger rubbed against the clenched entrance; he ignored the desperate motion of her hips as she fought to force his finger inside her.</p><p>“Greedy, baby,” he whispered, the tips of two fingers now rubbing against the entrance to her pussy.</p><p>“Greedy?” She panted. “More like tormented. You’re tormenting me, Jed.”</p><p>“I’m loving you.” The words were whispered against her midriff as his lips moved lower and one hand pushed her skirt higher. “I’m loving you, Piper.”</p><p>Before she could counter his declaration, his lips lowered and covered the straining, tortured bud of her clitoris.</p><p>“Oh, God, yes.” Twisting against the sudden grip he had on her hips, Piper’s hips jerked in reaction. “Jed. Oh, Jed, yes, please.”</p><p>Lavish licks surrounded the straining bundle of nerves as Piper cried out, pleading, begging, desperate for release now.</p><p>Nudging at the little bud, licking at it, suckling it into the heat of his mouth, he pushed her toward an abyss of ecstasy that threatened her sanity.</p><p>As he stroked and laved the sensitive bundle of nerve endings, the fingertips stroking at her entrance began to slip inside, stretching her flesh and opening the little portal. Swift, heated flares of sensation raged through her flesh, striking at her womb, at her clit, and stealing her breath.</p><p>The feel of his fingers pressing inside her, separating the tender tissue and caressing hidden nerve endings, had muted cries escaping her throat as she fought for release.</p><p>She didn’t want to wait.</p><p>She’d waited long enough.</p><p>She’d waited twenty-four years for this man, for this pleasure, and waiting one second longer for her release seemed entirely uncalled-for.</p><p>“Jed, please.” Her fingers kneaded his scalp as her hips lifted, her thighs spreading wider as his fingers fucked slow and easy inside her. “Please don’t make me wait.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A muted groan of male pleasure was her only answer as his tongue rolled over her clit, pressed against it, and threatened to ignite the explosion she was reaching so desperately for.</p><p>God. She couldn’t wait much longer. She was going to melt into a mass of pure sensation at any second. Waiting was only intensifying the painful eagerness now building inside her.</p><p>“More.” Lifting to him, rolling her hips against the invasion of his fingers inside her vagina, against the probing, wicked tongue and suckling lips at her clit, Piper fought to hold on to her sanity as the need became a driving, desperate ache to fly into the heated rapture she could feel awaiting her.</p> <p>“Please. Jed . . .” She couldn’t take much more.</p><p>Oh, God, he was going to pay for this. She was going to make certain he paid for this.</p><p>His lips lifted; his fingers eased back.</p><p>Forcing her lashes open, Piper watched as he dragged himself to his knees before bending to the side of the bed and reaching for a condom.</p><p>The heavy length of his cock jutted out from his body, flushed and eager and tempting a hunger she’d never had the chance to give in to.</p> <p>She had the chance now.</p><p>Her body was humming for the penetration she knew he was preparing for.</p><p>But she wanted . . .</p><p>As he straightened before her, Piper pushed herself into a sitting position.</p><p>“Not yet.” Her fingers curled around his wrist as he moved to roll the condom over the throbbing, flared crest of the fiercely erect shaft.</p><p>“Piper, baby.” The warning in his voice was clear. “I don’t know if I have the control for this.”</p> <p>“Sure you do.” She breathed out, one hand curling around his erection, marveling at the fact that her fingers couldn’t encircle it, yet her body could accept each hard thrust made into it by the fierce shaft. “Just like I did.”</p><p>Leaning forward, she tasted him.</p><p>A hard, primal groan sounded above her as her tongue licked over the engorged crest.</p><p>Parting her lips, she covered the width of his cock head, taking him into her mouth as her lips hugged the hard flesh and drew on it with pleasure.</p><p>Salty, male.</p><p>The explosion of taste had a moan tearing from her throat, vibrating against his dick and sending Jed’s senses into overdrive.</p><p>Damn her, she was destroying him, and he couldn’t stop her. She was sucking his control straight from him by the simple act of sucking his dick as though it were a favored treat.</p><p>With her tongue lashing at his cock and her lips tightening around it, her wicked, seductive fingers cupping his balls in one hand as the other stroked the heavy width of it was nearly more than he could bear.</p> <p>“God, Piper, I’m going to come, babe.” He groaned with a desperation he swore he’d never felt before this woman.</p><p>Her tongue rubbed at the head of his cock. It probed at the oversensitive nerve endings just beneath the head, then sucked the engorged heat with such pleasure he swore he was going to lose control and spill his release into her suckling mouth.</p><p>He had to tighten his fingers, had to grip her hair and try to force her head back from the shaft.</p><p>Her eyes darkened.</p><p>Seeing her staring up at him with the light green of her eyes darkening imperceptibly was nearly too much for the tenuous control he was barely holding on to.</p><p>Yet he couldn’t stop.</p><p>His hips moved even as he told himself he’d hold still.</p><p>He watched the head of his cock pull back, sink inside. Watched as he fucked her mouth and those pert, pretty lips reddened.</p><p>He watched until he couldn’t take it any longer.</p><p>Pulling free despite her protesting moan, Jed moved back, and before she could react, he managed to turn her to her stomach, his hands gripping her hips and lifting them before him.</p><p>“Damn, your ass is so pretty.” Sliding his hands back to the rounded globes as he positioned his cock at the slick, heated opening of her little pussy, he couldn’t help but marvel at the pleasure slicing through his senses. “I love this pretty ass, Piper.”</p><p>“You’re killing me,” she cried out desperately.</p><p>“Then we’ll go together.” He groaned as he pushed the head of his cock into the fiery heat of her juice-laden cunt and had to clench his teeth to fight back the release building in his balls. “God, Piper, we’ll go together, baby, because I never knew pleasure could be this fucking good.”</p><p>He couldn’t hold back.</p><p>He couldn’t hold on.</p><p>Gripping her hips firmly, Jed pulled his cock back, then in one fierce thrust buried the eager erection halfway inside the gripping, lush little pussy he was certain would steal his sanity.</p><p>Pure, unadulterated ecstasy began building in his senses.</p><p>Blood pounded in his veins, and on the second thrust, nothing else began to matter but the pure, mindless race to shattering rapture.</p><p>Piper tried to scream.</p><p>As the fierce, pleasure-pain sensations began whipping through her pussy, attacking her clit and racing through her senses, she swore she would never survive the cataclysmic pleasure building through her flesh.</p><p>She couldn’t struggle against it; hell, she didn’t want to.</p><p>She gave herself over to it, reaching ever harder for it, poised on the edge of an abyss she wanted nothing more than to fly into.</p><p>“Jed, please.” She forced the cry past her lips. “Harder. Please. Please fuck me harder.”</p><p>She wanted that release.</p><p>She wanted it now.</p><p>God, if she had to wait she might not survive it.</p><p>Fingers curling into the sheets beneath her, she held on tightly. She thrust back to him, panting for air, as flames burned through her system, licking across her flesh and attacking the rapidly rising sensitivity of her clit and the aching depths of her overstretched vagina.</p><p>As she fought to break the bonds holding her to reality and to jump headlong into the flames, she felt Jed above her. His lips were at her neck, stinging nips and heated kisses attacking the bend of her shoulder a second before he caught the tender flesh between his lips and delivered a heated kiss that became a catalyst to pure ecstasy.</p><p>The explosion tore through her.</p><p>Rapture ripped her from her place in reality and threw her headlong into the cataclysm of flames awaiting her. Destructive, the tidal wave of pure ecstasy overwhelmed her; as she flew through that place of searing sensation, she found the man who had taken her there.</p><p>Piper felt him inside her, covering her, not just taking her body, but sinking inside her soul.</p><p>His groan echoed around her.</p><p>His cock buried deep one last time, pulsed and throbbed; then her muscles clenched around him further as he found his own release.</p><p>Crying out his name, locked in a world of blinding color and overwhelming rapture, she could do nothing but trust him to hold her, to keep her secure as the pleasure pounded through her, tore past the deepest reaches of her heart and invaded the very depths of her soul.</p><p>She was his.</p><p>There was no denying it. There was no fighting it.</p><p>She belonged to him.</p><p>But as she felt him sinking inside the abyss with her, Piper knew he belonged to her as well.</p><p>He was hers.</p><p>There was no denying her, just as she knew there was no longer any chance of denying him.</p><p>For the first time in her life, she knew exactly what it meant to belong.</p><p>Now if she could just live long enough to enjoy it.</p><p>TWELVE</p><p>“What now?” With a towel wrapped around her, her damp hair lying along her shoulders, Piper stepped from the bathroom after showering, the reality of the danger facing her threatening to overwhelm her optimism.</p><p>The chest-tightening panic was returning, waiting, preparing her for Jed to walk away. . . .</p><p>Like her father had walked away and left her, her mother, and her sisters unprotected and alone. Just as she was afraid Tim and Dawg would walk away.</p><p>Was that why everything inside her shut down whenever she and Dawg moved toward a confrontation? To prepare her heart, to steel herself against the abandonment?</p><p>“We wait and see,” he answered, the towel he’d wrapped around his waist earlier still in place.</p><p>He hadn’t dressed.</p><p>Heated need for his touch was threatening to weaken her need for answers as she watched him toss their dirty clothes into the hamper next to the bathroom door.</p><p>“Since when do you sit around and wait on anyone or anything, Jed?” she asked, frowning at the feeling that there was much more going on than simply waiting. “What are you and my brother up to?”</p><p>Tightening in response to some imperceptible feeling of dread, her heart began to beat at a sluggish pace.</p><p>The impending panic was a result of the look on his face, the darkening of his navy gaze that made his eyes appear almost black.</p><p>“We’re not just waiting; we’re watching,” he finally stated, his expression hardening just enough to warn her that she was going to hear something she didn’t want to hear.</p><p>“What are you watching?”</p><p>“Your room.” Jed paced to the television, retrieved the remote, and hit the power button.</p><p>Watching the screen, she was surprised as he reached behind the unit, and a second later, the split view of the screen showed both her bedroom as well as her sitting room.</p><p>“Brogan had the cameras installed just after he started sleeping with Eve,” he revealed. “He was afraid his or Dawg’s enemies would attempt to strike out at her, or take her from him. There were cameras in her room, and GPS on her car and her cell phone.”</p><p>The cameras had been there since before Brogan and Eve moved from the inn? And they were still there?</p><p>“I was supposed to move them,” he told her. “And I was going to until I learned you were taking her room after she moved in with Brogan.”</p><p>“So you’ve watched me when I didn’t know you were?”</p><p>Controlling her? Maneuvering her?</p><p>Was he so much different than she had begun to believe he was?</p><p>“Only once or twice.” Broad shoulders shrugged as he watched her carefully. “The night you were packing to leave for New York.”</p><p>Holding the towel close to her breasts, she sat up, watching the view on the television, wondering what she should feel.</p><p>Was the need to deny that he would do such a thing to control her normal? Was she simply trying to make excuses for him?</p><p>“Why?” she whispered. “Why were you watching me?”</p><p>He rubbed at the back of his neck, frustration tightening his face. “I worried about you. I wanted to see you. Hell, Piper, you’ve made me fucking crazy since I’ve moved in here, as you’ve tempted me, then run from me. There were days I wasn’t certain I could keep from playing the caveman I knew you were waiting for me to reveal lurking inside me.”</p><p>Biting her lip, she glanced to the screen again.</p><p>“So why show me now?”</p><p>“Because I don’t want any secrets at all between us any longer,” he stated. “Not secrets like this.” Flipping his hand toward the screen, he moved to the dresser and pulled his clothes from the chair next to the bed as she watched, then began dressing angrily.</p><p>“I don’t want to take your fucking freedom,” he growled at her as he shoved the white-and-gray-striped shirt into the waistband of his jeans and quickly buckled his belt. “I don’t want to control what you think or feel or what you do.” Glaring at her, he sat down in the chair next to the bed and pulled on dark leather boots. “I just want you.”</p><p>He just wanted her?</p><p>“And now you’ve had me,” she said, feeling kind of hollow inside. “Did you change your mind about wanting to control me and my life?”</p><p>Had she made a mistake? The one mistake she had sworn she would never make—had she fallen in love with a man unable to resist the urge to completely take her life over?</p><p>The look he shot her was one of such scorn that anger immediately flared inside her.</p><p>What the hell did he expect her to think?</p><p>Stomping to the end of the bed, where he’d laid the clothes he’d collected from her room earlier, Piper pulled on her own jeans, soft cotton tank camisole, socks, and sneakers. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Maybe I should just return to my room.” She felt a bit hollow inside now, as though some part of her had just been cruelly ripped from her chest.</p><p>He wasn’t saying he loved her. He wasn’t mentioning caring for her. There was no hint of commitment or anything other than the fact that he had been watching her and she had driven him crazy.</p><p>“What the hell do you want from me?” she asked as she finished dressing and turned back to him, aching inside with the knowledge that she could be losing what she hadn’t even known she’d so desperately needed.</p> <p>“I want you to stop being frightened of me, to start with,” he demanded.</p><p>“Then don’t pull this crap on me.” Turning on him fully, her arms propped on her hips, Piper confronted him as she had never confronted her brother. “For God’s sake, Jed, I never knew what the hell you’ve wanted from me. You flirted, you smiled, yet you never asked me out or gave me so much as a hint that you wanted more than a one-night stand. Or is that all you wanted?”</p><p>Heated anger was brewing inside her, rising to the surface and threatening to break free of the shield she normally kept surrounding it.</p><p>“What do you think I wanted?” Dark emotion filled his expression and his eyes, warning her of the thin ice she might be stepping onto.</p><p>She’d never heeded the warnings from Jed, though, so why start now?</p> <p>Why should she even attempt to make excuses to herself, let alone to him, Dawg, or anyone else? she thought furiously as she watched him hit the remote, turning the television off before throwing the remote to the bed.</p><p>“You think I’ve driven myself insane trying to hold back, trying to ensure you have the space you need to deal with your brother and decide what you want with me, just to stop with a fucking one-night stand?” Jed growled.</p><p>He moved so fast there was no avoiding him.</p><p>His hands were on her shoulders first, jerking her to him before one arm wrapped around her waist to hold her against his hard body while his free hand slid into her hair, clenched, and pulled her head back.</p><p>“You make me feel like a fucking caveman,” he rasped. Power, hunger, and something much deeper echoed in his voice and gleamed in his eyes. “Son of a bitch, Piper, you make me feel things I’ve never felt before, and I have no idea how to fucking deal with them.”</p><p>Her eyes widened.</p> <p>“What do I make you feel, Jed?”</p><p>His lips parted, but what he would have said, she didn’t know.</p><p>“How very sweet.”</p><p>That voice.</p><p>Grating. Harsh.</p><p>She knew it. It echoed in her head and slammed through her memories with the force of a sledgehammer.</p><p>Jed’s eyes narrowed as he released her, turning as he used one arm to keep her behind him.</p><p>It was the nightmare she’d had nightly since the attack in New York. The face she could never remember. The vision of horror and pain she hadn’t been able to escape.</p> <p>The man was pockmarked, a scar running through the left side of his upper lip and bisecting a weak chin. Thinning dark brown hair and muscular shoulders combined with mean, cold hazel eyes and a gun leveled at Jed’s chest.</p><p>“You’re a stupid man.” Jed seemed to sigh, but she could feel the dangerous fury building in his body.</p><p>“How do you figure that?” Thin lips curled into a sneer as bulky shoulders shifted beneath a light jacket that strained across them. “I slipped in on you, didn’t I?”</p><p>“Did you?” Was that amusement in Jed’s voice?</p><p>The other man chuckled. “Why don’t you just move away from the little girlie there,” he suggested. “She can run over to the next room and collect all those jewels she got in New York and bring them back to me. I might let you live if she hurries. And if she brings them all.”</p><p>Jed was slowly shaking his head. Piper gripped his waist with one hand as the other balled into a fist and pressed against his back. Fear rose inside her and threatened to steal her breath. An ugly flash of life without Jed slammed through her imagination and left her fighting back tears.</p><p>“How do I know you don’t have someone waiting in her room?” Jed asked, as though he hadn’t just been watching the complete emptiness of her suite.</p><p>“Doesn’t matter; we’ll both want the same thing,” the man stated, his voice harsh as he advanced another step. “Now, does she go after those jewels or do I kill you? Then her.” A smile twisted his lips as the mocking question passed them. “Or I could just hurt you a little bit to show her I mean business.” He aimed the gun at Jed’s kneecap.</p><p>“No need to go that far,” Jed drawled, as though it were all a game. “She can just do as you ask.”</p><p>She knew Jed’s voice. She knew the passion-rich sound of hunger in it as well as the icy slide of a warning. And the warning in his tone was unmistakable.</p><p>“I thought that might be the case.” The intruder’s smile was a terrifying grimace as he glanced to Jed’s side to peek around at her.</p><p>He chuckled with a grating rasp. “It’s nice to see you’ve healed from our last meeting. I’ve always thought it a rather wasted effort to add more damage before the old bruises have healed.”</p><p>And he appeared to enjoy the thought of adding those bruises.</p><p>He had every intention of killing them. Piper could see it in the pure anticipation in his gaze. Cruelty was inherent in the man’s face, and in her memory of his heavy blows landing against her undefended body.</p><p>“Go on, Ms. Mackay,” he ordered her softly, waving the gun toward the door between Jed’s room and her own. “Collect all the jewels now. Miss any and he’ll die.”</p><p>“How would I know?” Licking her dry lips, she didn’t have to pretend pure terror; it was there, slapping her in the face. “They’re mixed in with the rest of the stones.”</p><p>Evil hazel eyes narrowed. “What do you mean? Mixed in with the other stones?”</p><p>“The stones I bought at the craft store.” Forcing the words past her lips, she tried to hold back the quaver in her voice. “I thought they were the fake stones I’d bought.”</p><p>For the briefest second surprised disbelief filled the man’s gaze before a cackle of laughter left his lips.</p><p>“Son of a bitch.” The laughter was almost a wheeze. “Why am I even surprised? You look about that stupid, bitch.”</p><p>Stupid?</p><p>The gun still aimed at Jed’s knee was all that kept her mouth shut as she stared back at him.</p><p>He might think she was stupid, but she knew he was fucking ugly. She could fake smart if that were true, but there was no way in hell he could fake pretty, she thought mockingly, fighting to hold back her fear.</p><p>She wasn’t stupid, though. What she was, was doing everything she could to buy enough time for Jed to figure their way out of this one.</p><p>“Well, I suggest you learn how to identify the real stuff and separate it from the fakes really fast,” he suggested, his voice lowering and echoing with cruelty. “You have about four minutes to get that cute little ass back in here before I start putting holes in your man.” He waved the gun at Jed’s knee before lifting it to Jed’s heart and smiling back at her.</p><p>Everything inside her was shaking, trembling in fear now, while Jed’s complete stillness had wariness growing inside her.</p><p>He was up to something; she could feel it.</p><p>She knew Jed. He wasn’t moving; nor was he taunting.</p><p>“I’ll just get them all.”</p><p>“Make sure you turn the lights out,” Jed suddenly advised her.</p><p>Piper paused.</p><p>“What fucking lights?” Fury echoed in the gunman’s voice. The lights went out and the darkness exploded around her.</p><p>Piper found herself thrown to the floor a breath before the explosive report of a weapon echoed through the room.</p><p>Riding close on the sound of the gun’s discharge, shattering glass from the mirror above the dresser began raining down on her, biting sharply against the bare flesh of her arms.</p><p>She covered her head until the stinging storm ceased, then scrambled across the room on her hands and knees, glass pricking into her palms and knees as the sound of an enraged fight could be heard ahead of her.</p><p>She had to find Jed.</p><p>“Stay in place, Piper,” Jed yelled out a second before a hard grunt was heard. “Stay where you are, dammit.”</p><p>She pushed herself against the wall as she glared into the darkness, her hand pressing against a large shard of the glass on the floor. Curling her fingers around it, she lifted it, holding it against her just in case she might need it.</p><p>A second later a shadow hurled itself toward her as though propelled by some unseen force.</p><p>Or Jed’s fist.</p><p>The wide body of her assailant—or her would-be killer—slammed into the wall beside her.</p><p>Fury surged through Piper at the knowledge of who it was bouncing against the wall. Gripping the glass tighter in her hand, she struck out and buried the arrowed point of the glass into the brute’s back. Or maybe it was his shoulder?</p><p>She wasn’t certain which.</p><p>The second she slammed it home she tried to move out of his way. The fist was faster than her self-preservation instincts, though. A hard fist in her direction slammed into her shoulder, throwing her off balance and sending her pitching to the floor, her hands scraping against the glass that covered the carpet.</p><p>“Dammit, Piper.” Affectionate frustration filled Jed’s voice and covered that underlying well of complete fury she sensed.</p><p>She couldn’t see a damned thing, but suddenly Jed was picking her up and throwing them both to the side as the report of the weapon blasted through the room once again.</p><p>An animalistic growl left Jed’s throat as he pushed her halfway beneath the bed, then jumped across it.</p><p>The gun went off again as raised voices outside the room could be heard. A high-pitched male scream sounded, and then for the space of a few short seconds, there was unbearable silence.</p><p>Piper stared across the bed, desperate to see Jed’s shadow moving, to see some kind of movement that she could attribute to him.</p><p>Without him, she was lost.</p><p>She felt lost.</p><p>Terror squeezed her heart like a furious vise and left her breathless as she glared over the bed, determined to see him alive. She had to see him alive.</p><p>Her lips parted to call out to him at the same moment the lights flipped on, shocking her senses.</p><p>Piper dropped down and beneath the bed, rolling to peep from beneath the bed skirt at the overly large feet suddenly rushing around the room.</p><p>“Dammit, Piper.” Hard hands shoved beneath the bed and gripped her wrists, and she glimpsed Jed’s bruised face as he pulled her from beneath the bed and dragged her against the hard width of his chest.</p><p>Piper pressed one hand against his heart as she pressed her face into his neck, concentrating on the beating of his heart against her palm.</p><p>He was alive.</p><p>That was all she could think, all she could allow herself to focus on.</p><p>He was alive.</p><p>“Hell!” Tim’s voice echoed above her with his characteristic mocking frustration. “Only a Mackay could cause this kind of commotion and still fucking live through it.”</p><p>“Hey.” Dawg’s protest was a rasping growl. “I think I resemble that remark.”</p><p>“Resent, Dawg,” Rowdy repeated the response he’d been repeating for years. “You’re supposed to resent that remark.”</p><p>“I’ll resent it when it stops happening.” Dawg sighed.</p><p>Lifting her head from Jed’s shoulder, Piper looked around, her eyes widening.</p><p>The large mirror over the dresser was shattered and lying in bits and sharp pieces in front of the oak dresser. The window across the room was missing a wide section and spiderwebbed with long cracks.</p><p>The flat-screen television was missing its screen and hung lopsided now, its pieces littering the floor. The chair was upended, along with the bedside table, lamp, and clock. Amid all of it, unconscious or dead—she didn’t care which—the broad form of the man who had attacked her in New York lay sprawled, still and silent. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know this one.” Tim kicked at a limp, thick leg, his expression reflective. “Marcel Genoa. He’s one of Rudy Genoa’s fists, and Marlena’s cousin.”</p><p>“I thought we had that organization taken care of, Timothy?” The question rumbled from Jed’s throat, the irritation in his voice heavy.</p><p>A stranger’s voice intruded into the conversation then. “It’s according to your definition of ‘taken care of,’ Agent Booker.”</p> <p>Piper’s head jerked up as Jed rose to his feet immediately, lifting her along with him to his side. But no one was moving to defend themselves.</p><p>“Mr. Samson?” Swallowing tightly, she moved her gaze from Rhylan Samson, Guido Samson’s son, to the men filling the room around her.</p><p>Rhylan stepped into the room, his thumbs hooking into the pockets of his jeans, lean, muscular shoulders shifting beneath the dark gray silk shirt he wore.</p><p>“Marcel was a bit of a wild card who we were unaware was lurking in the dark,” Rhylan said, moving one hand to close the door behind him before lifting the other to prop both on his tapered, muscular hips.</p><p>Staring down at Marcel Genoa, he shook his head wearily. “We’ve been looking for him since the attack on Ms. Mackay.”</p> <p>“You could have informed us,” Timothy snapped, his gaze swinging to Piper. “It’s not as though she was forthcoming with the information.”</p><p>Piper refused to flush.</p><p>“Perhaps, Tim, if I’d been allowed an opinion or a choice in the past year where my security was concerned, then maybe I would have been forthcoming with the information.”</p><p>“She’s not going to stop blaming us,” Dawg muttered behind her. “Let it go, Tim.”</p><p>Letting it go was the best choice her male family members could have made.</p><p>Rhylan chuckled at the response, his gaze moving to Jed’s. “Good luck, Agent Booker. You may need it if you continue dealing with Mackays.”</p> <p>“I rather doubt it.” The confidence in Jed’s voice had Rhylan inclining his head with a grin.</p><p>“What’s going on, Rhylan?” Tim asked.</p><p>“Why the hell do all of you seem to know this man far better than a few days’ stay would warrant?” Piper asked. Wasn’t it just like Dawg and their cousins, along with Tim, to know it all while leaving everyone else in the dark?</p><p>She was fucking sick of being left in the dark.</p><p>“Piper. There’s information you can’t have, and there will be times your questions will not be answered.”</p><p>Tim lifted his gaze to Jed as Piper felt her chest tighten in pain. She was the one who had carried the bruises, who could have died. Who deserved this information more than she? “Take her to her mother; she’s waiting in the hall. We’ll figure this out—”</p><p>“No.”</p><p>Piper had never been so happy to hear that rough, growling refusal come from Jed’s throat as she stared back at Tim in recrimination.</p> <p>Tim grimaced, his face appearing more lined, his expression more concerned than ever.</p><p>“You know the delicacy of this information—”</p><p>“Drop it, Cranston.” Rhylan breathed out roughly as he gave his head a hard shake. “He’s right. She’s the one who’s been in danger, not the rest of you.” He turned to her again. “I’m sorry, Ms. Mackay; you were caught in a web of deceit that had nothing to do with you, other than the fact that you were in the wrong place at the wrong time, and ended up with belongings we were unaware were in that car. The jewels you inadvertently ended up with are the belongings of a particularly sadistic Russian mobster. They’ll be returned to him, so we can then track where they end up and what they’re being used to pay for.” He turned to Tim. “If you’ll gather the jewels together for me, I have the paperwork you need.”</p><p>Timothy’s lips thinned as the situation was explained to her. “That’s information that could get her killed, Rhylan.”</p><p>“Only if she tells anyone what she knows,” Rhylan objected. “And I think she’s proven she knows how to keep her mouth shut.”</p><p>No, he was wrong; she didn’t need to hear this particular argument.</p><p>Jed had tensed to a breaking point, and Dawg, Rowdy, and Natches looked as though they were facing the gallows at the thought of her hearing whatever information this man had to give.</p><p>“Mom’s waiting for me.” Turning to Jed, she felt the tension slowly easing from his body. “I’ll be in the kitchen.”</p><p>“I’ll be there soon.”</p><p>His head lowered, and his lips touched hers with a gentleness that filled her soul with a warmth that went far beyond arousal, need, or hunger. It filled her with a knowledge she hadn’t understood until now.</p><p>As Jed released her she moved quickly to Dawg, threw her arms around him, and immediately felt him enfold her in his arms.</p><p>“I understand,” she whispered in his ear quickly. “I never understood how you feared for our safety until now, Dawg.”</p><p>“Understood what, sweetie?” How could she have ever thought it was just arrogance and male superiority that caused him to hover over her and her sisters so closely?</p><p>“Why.” Her arms tightened around his shoulders. “Why we have to stay safe for you.” Leaning back, she stared into his eyes and saw the bleak knowledge he held in his soul.</p><p>The knowledge of all the ways she could die, and all the ways he couldn’t protect her, her sisters, and her mother if he weren’t always diligent.</p><p>It was the curse of loving men such as this, whether they were lovers or the best damned brother and cousins anyone could have.</p><p>His jaw bunched, emotions whipping through the light green of his eyes and clenching the muscles of his face before he nodded sharply.</p><p>A quick hug to both Rowdy and Natches, and Piper hurried from the room.</p><p>As Tim had said, her mother was waiting in the hall, but she wasn’t alone. With her were Lyrica and Zoey, and moving up the hall Eve and Brogan strode toward them quickly.</p><p>Brogan’s gaze surveyed her swiftly before he nodded and moved past her, leaving Eve to give her a firm hug as their mother wrapped her arm around Piper’s waist.</p><p>They were all safe—this time.</p><p>But they were Mackays. The sisters were Dawg’s, Brogan’s, and now Jed’s weaknesses. They would always live beneath the shadow of the Mackay males’ strength, as well as the strength of the men they loved.</p><p>A strength that had acquired enemies for them through their dedication to justice.</p><p>Flashing a grin first to Lyrica, then to Zoey, she warned them with amused reflection, “I’d acquire ninja training if I were you. Otherwise they’ll never stop hovering. So give in, or get tough.”</p><p>Lyrica slumped against the wall.</p><p>Zoey just stared back at her with eyes a fierce celadon and an expression of complete rejection of such a thought.</p><p>“We’re Mackays,” Zoey stated then. “We don’t give in.”</p><p>“Hell, no.” Eve laughed lightly.</p><p>“Not in this lifetime,” Lyrica assured them all.</p><p>“It looks like it’s time to get tough, then,” Mercedes stated as she had so many times in the past, her smile bright and filled with anticipation as they turned and moved quickly to the kitchen.</p><p>Coffee, a sweet, and a game plan. That was how they dealt with the problems life had thrown at them for as long as Piper could remember. Her mother would prepare hot drinks, some sweet she had baked, and they would figure out the best way they could handle the situation. The best way to get tough and fight back against whatever problems they faced.</p><p>It was time to get tough.</p><p>THIRTEEN</p><p>The Mackay women had learned how to fight back—if not in strength then with their intelligence—fight silently, and fight with success years before Chandler Mackay had died. They had perfected the art.</p><p>Until now, Piper, her sisters, and her mother had been certain they could make their male family members back up and stop hovering so closely. Piper could see now that it wasn’t going to happen.</p><p>But she could also see why.</p><p>With Eve sitting with them, coffee and a slice of Mercedes’s coconut cream pie in front of them, they began to plot and to plan.</p><p>Not for their freedom.</p><p>Not for their independence.</p><p>They were plotting, planning, and they would do all they could to defend all they loved, however they had to.</p><p>No matter what it took.</p><p>TWO DAYS LATER</p><p>Stepping into the upstairs bedroom Piper’s mother had moved them into, Jed closed the door quietly behind him and stared at the woman still sleeping deeply.</p><p>The quilt had been pushed to the bottom of the bed and nothing but a soft cotton sheet covered her naked back.</p><p>Piper was stronger than he’d ever imagined. Stronger and more fierce than he’d ever given her credit for.</p><p>In the past two days she’d given them as many details as she could remember about the rental agency, the young girl who had given her the car, as well as the location of the packets of jewels as she’d found them.</p><p>Her purse had fallen from the backseat, knocking over the shopping bag containing the rhinestones and crystals she had bought that morning. She’d thought nothing of the packets she’d found beneath the seat. She’d simply gathered them all together and thrown them into her bag before rushing to the cab waiting for her.</p><p>Why should she think anything of it? They were the same plastic packs the crystals and rhinestones she’d bought were packaged in.</p><p>There was nothing unusual about finding the packets, and nothing that could have tipped her off that she had anything that wasn’t hers.</p><p>Now Homeland Security had answers they’d been searching for for years: how the Russian mob was smuggling the gold, jewels, and drugs that were funding the criminal organization they were building—and the terrorists it was suspected were backing them—into the United States.</p><p>It wasn’t over, but neither was it a threat to Piper any longer, and that was all that mattered to him: making certain she was no longer in danger.</p><p>Now that the task was completed, his body was reminding him of another task that needed to be taken care of.</p><p>Two days without her touch, without having her, and his cock was like an iron wedge in his jeans, demanding relief.</p><p>Unbuttoning the shirt he wore and shrugging it from his shoulders, he allowed it to fall, forgotten, to the floor. Stopping at the bed near the stool positioned at the footboard, he sat down to remove his boots.</p><p>Standing seconds later and releasing his jeans, he shed them and the boxer briefs he wore, discarding them on the floor where he stood. A smile curled his lips, the fingers of one hand gripped his dick, and he moved to the side of the bed to pull the sheet from the silken body of the woman he reckoned he loved more than life.</p><p>As the sheet cleared the rounded globes of her pert ass, her hips shifted and she rolled to her back. Jed felt his breath still in his chest for precious seconds as he stared down at her, still marveling that such beauty was laid out for him, tempting him, hungry for him.</p><p>Firm, cherry-tipped breasts drew his gaze. As he watched, she parted her creamy thighs, revealing the sheen of slick dew on the lush folds of her pussy. Above, the moist, swollen little bud of her clit peeked out at him and tempted his tongue as her nimble little fingers stroked up his thigh before cupping the taut sac of his balls.</p><p>Fuck, her fingers were like hot silk.</p><p>Cupping, stroking, fondling the tense flesh beneath his hard dick, she drove him to complete distraction and had him panting as she slowly sat up on the bed. Her fingers moved from his balls, brushed his fingers aside, then slowly curled around the tortured length of his dick.</p><p>He clenched his teeth, fighting for control, yet a moan still slipped past his lips as he watched her lips part as she eased forward and slowly—fuck him, so damned slowly—covered the engorged crest of his cock and sucked it inside.</p><p>It was like being immersed in white-hot pleasure. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Hell, this wasn’t just pleasure. It was pure fucking rapture.</p><p>The deep draws of her mouth had shards of incredible heat raking across the too-sensitive flesh, while her wicked little tongue flicked and tasted the throbbing head she held captive.</p><p>Thick lashes closed over her green eyes as he buried his fingers in the thick, black length of her hair. Creamy cheeks hollowed as she suckled him like a favored treat, moaning around the width of the throbbing head and lashing at it with her hungry little tongue.</p><p>“Ah, fuck.” The words were dragged past his lips as she began stroking the tortured shaft with warm, silken fingers. “Piper, sweetheart, I’m going to end up coming in your mouth instead of that hot little pussy.”</p><p>She moaned around the head, a hot little sound of hunger and need that had his stomach tightening as he fought to hold back his release. He wasn’t ready to come. Not yet. Fuck, he just wanted to feel this a little longer. Just wanted to luxuriate in the pure ecstasy of each suckling motion of her mouth, each lick of her tongue and stroke of her fingers.</p><p>Staring into her face, seeing her pleasure and arousal, was more than he could stand. He could feel his balls tightening. The head of his cock flexed and clenched in her hungry mouth, and before he could push back the driving spikes of tortured pleasure, a spurt of release washed over her tongue.</p><p>It was like giving her a taste of rapture rather than a taste of his seed.</p><p>Desperate moans fell from her lips. Her fingers milked the hard shaft as her lips and tongue searched for more of the rich, male taste, clearly eager—no, craving—more.</p><p>Pulling back took every ounce of control that he possessed.</p><p>Watching the slow release of his cock from the hot moisture of her mouth was like tearing out a piece of his soul.</p><p>But there was so much more pleasure to be found.</p><p>Coming to her, he covered her lips with his, his tongue slipping past her lips and dancing against hers as he moved between her thighs. With one hand he quickly rolled the latex condom over his cock, then twisted against the hold of her thighs and found the slick entrance he was searching for.</p><p>It was pure heat raining down on the head of his cock as he tucked it against the clenched opening of her heated cunt.</p><p>Soft as luxury, as hot and tight as pure sin itself, the clenched tissue milked at the head of his cock, tightening with each shallow thrust, then spasming with delicate greed as he thrust heavily inside her.</p><p>Control.</p><p>God help him, just a little control, because he wanted nothing more than to sink inside her and hold himself there forever.</p><p>“I love you, Piper.” The words were torn from his lips, pulled from his soul, and whispered against her lips as he thrust inside her, hard and deep, burying himself to the hilt in the milking grip of her pussy. “Sweet God, I love you.”</p><p>Piper felt her breath catch.</p><p>Holding tight to the strength of Jed’s shoulders as she fought to adapt to the width of the iron-hard cock throbbing inside her, she hadn’t expected the declaration. Nor had she expected the emotion that filled it.</p><p>Forcing her eyes open, meeting his gaze, and seeing the love in his eyes had her own gaze dampening.</p><p>“I love you, Jed,” she whispered, her breath hitching, her heart catching at the depth she knew that her love filled her.</p><p>There wasn’t a cell in her body that wasn’t filled with the ever-deepening love she felt for him.</p> <p>Tears blurred her vision and wet her cheeks, and as his lips lowered to hers once again, the tears infused their kiss.</p><p>Piper caught her breath as his hips shifted, his cock retreating from the tightened depths of her pussy. His kisses fed the hunger raging inside her. Each fierce, deep thrust of his cock sent searing pleasure racing through every nerve ending.</p><p>Her clit, swollen and throbbing, ached for relief as each thrust of his hips pressed his pelvis into it, and each heavy penetration inside her tender cunt pushed her closer to release.</p><p>She was on the verge of begging.</p><p>Oh, God, it was like being immersed in pure pleasure.</p><p>Flames burned inside her, whipped over her flesh. They tore through her pussy, wrapped around her clit, and with each stroke inside her pushed her closer—</p><p>“Jed, please,” she begged, her neck arching, knees lifting to grip his hips tighter, to push closer with each stroke inside her. “Oh, God, please. Fuck me harder. . . .”</p><p>A harsh groan rasped from his throat.</p><p>One hand gripped her hip as he buried his face at her neck, stinging kisses pressing against her flesh as the pace increased. Rapid-fire thrusts impaled the tender, sensitive flesh. The heat built inside her, raced through her womb, struck at her clit and in the depths of her pussy. Blinding, white-hot, and intense, the orgasm exploded inside her, flinging her from the edge of reality and tossing her into a chaotic storm of pure sensation that seemed never-ending.</p><p>Like a supernova, it expanded and burned, searing everything in its path as Jed buried himself deep inside her, stilled, then, with a heavy growl against her neck, gave in to his own release.</p><p>What she felt in that moment shouldn’t have surprised her: The feeling that suddenly she and Jed inhabited the same soul, the same body, the same storm of emotion and pleasure, shouldn’t have been a shock. But she had a feeling it was something she would never get used to. It was something she would never tire of experiencing.</p><p>It was a bonding, she realized as tears spilled from her eyes once again. A bonding she would never be free of. One she never wanted to be free of.</p><p>“I love you, Piper.” His voice was a mix of hope and desperation as he held tight to her. “Beyond my last breath, I love you.”</p><p>Beyond his last breath, and beyond forever itself . . .</p><p>They loved.</p><p>EPILOGUE</p><p>It was that deepest part of the night.</p><p>That time when sound carried its best and revealed the secrets others would prefer remain hidden.</p><p>For Lyrica, it was that time of night that haunted her the most. The time that seeped into her soul, filled her with chaos, and left her staring into the darkness and hearing the secrets she had no desire to know.</p><p>It was that time when she ached for what she now knew she could never have, yet was forced to acknowledge that settling for less wasn’t going to happen.</p><p>It was that time of night when, no matter the locks on the doors, or how tightly the windows were closed, still he found a way to her. . . .</p><p>“Pretty Lyrica,” he whispered from the darkness. “Did you really think I’d let you hide . . . ?”</p><p>“Please—don’t.” She shook her head, helpless as she felt his weight on the bed, watched his shadow come over her as he slowly drew the sheets back from her naked, aching body. “Please . . .”</p><p>“You’re mine . . .” </p> </body></html>"]