["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> It isn’t a first kiss. It isn’t even their first kiss. But it feels like one.</p><p>Not because it is fumbling or awkward. Not because she doesn’t know where to put her hand, or he doesn’t know where to put his nose. None of those. They slot together like puzzle pieces. As Allyson and Willem kiss for the first time in a year, both are thinking the same thing: This feels new.</p><p>Though perhaps thinking is not the right term, because with a kiss like this, thinking goes out the window and something more instinctual takes over: inner voices, gut instincts. “Knowing it in your kishkes” is how Willem’s saba would’ve described it.</p><p>In his kishkes, Willem is marveling that Allyson found him, as Yael found Bram. He doesn’t know how it happened, only that it did happen and that it means something.</p> <p>Allyson is doing a mental fist pump and an I told you so. She’d spent a year looking for him, looking for the girl she was with him. And then last night, watching Willem perform Orlando in Vondelpark, she’d been certain she’d found them both, certain the words he was speaking were meant for her. Forever and a day. She’d felt it. Right in her gut. But listening to that inner voice was new to Allyson. She’d spent nineteen years of her life ignoring it, listening to pretty much everything but it. So when she’d seen Willem with another woman, looking luminously happy with another woman, she’d gone away.</p><p>Only not really. Because here she is, at his flat, where he is kissing her, and she is kissing him right back. And the kiss feels like something completely new. But it also feels like something deeply known. Which would seem to be a contradiction. Only it’s not. The truth and its opposite are flip sides of the same coin, Saba always said.</p><p>• • •</p><p>Nothing goes on forever. Not even second first kisses. Not even those as hard-won as this. Outside the window, a tram bell chimes. It is like an alarm clock, crystallizing the moment from fuzzy to real. Allyson and Willem break apart.</p><p>Allyson isn’t quite sure what to do next. She is supposed to be catching a flight to Croatia. This stop at Willem’s flat was a detour, the kiss a happy surprise. But now what?</p> <p>Willem takes her backpack, as if answering the question, as if completing the transaction. Then he offers her a coffee.</p><p>He would like to kick himself. This girl he has not seen in a year, this girl he’s thought about, dreamed about, looked for, for a year, this girl he just kissed (he’s still a bit dazed from that kiss) . . . and his first words to her are those of a waiter.</p><p>But then he remembers something. “Or a tea. You like tea, don’t you?”</p><p>It is the smallest thing. She likes tea. She drank tea on the train to London, when they’d first started talking, about hagelslag of all things. She drank it again on the train they’d taken to Paris together, later that morning.</p><p>Tea. One day. A year ago. He remembered.</p><p>A little voice in Allyson’s gut (it’s her kishkes, only she doesn’t know that word yet) is yelling: See?</p> <p>“Yes,” Allyson says. “I would love some tea.” She’s not really thirsty. Five minutes ago, nerves had left her with a mouth as dry as paper, but the kiss has taken care of that. But this feels like more than a beverage being offered.</p><p>“Tea,” Willem says. He can see that the offer has unfastened something in her face, as when she’d jokingly solicited a compliment from him last year, and he’d told her she was brave and generous and openhearted. Back then he’d been guessing. Now he is remembering. He remembers it all. He wants to tell her. He will tell her.</p><p>But first, tea.</p><p>Willem starts toward the kitchen. Allyson isn’t sure whether to follow him, but then he turns around and says, “Wait here,” and then a few steps later adds, “Don’t go anywhere.”</p><p>She sits down on the low leather couch. It is a nice apartment, all bright and sunny and modern. Does he live here? She hasn’t thought about where he might live. About him living anywhere. When she’d met him, he’d lived out of a backpack.</p><p>In the kitchen, Willem tries to collect himself as he makes drinks. (He watches the kettle; the adage is true, it refuses to boil.) He digs through the cabinets for the tea that he recalls his uncle Daniel saying he kept for Fabiola, his soon-to-be wife, the soon-to-be mother of his child, whom he is now with in Brazil. Willem makes himself a coffee—using the instant because it is faster and it has already taken too long for the water to boil.</p><p>He puts it all on a tray and returns to the lounge. Allyson is sitting on the sofa, her sandals off, neatly placed under the coffee table. (The sight of her bare feet. What this is doing to Willem’s blood pressure. She might as well have taken off all her clothes.)</p><p>He puts the tray down on the coffee table and sits on the couch, but on the opposite side from Allyson. “I hope chamomile is okay,” he says. “It’s all my uncle has.”</p> <p>“It’s fine,” Allyson says. Then, “Your uncle?”</p><p>“Daniel. This is his flat. I’m staying here while he’s in Brazil.”</p><p>Allyson almost tells him she thought he lived in Utrecht, that was where she’d tracked him down before the trail went cold. Or she’d thought it went cold. Until she’d accidentally heard about As You Like It being performed in Vondelpark last night and she somehow knew that Willem would be in it.</p><p>Accidents. All about the accidents. She wants to tell Willem this, is working out how to start without sounding like a complete lunatic, when he says: “Daniel used to share this flat with my father, Bram. When they were young. And then my father met a girl while he was traveling. They spent a day together. Not even a day, a few hours, and a year later, she showed up here. She knocked on the door.”</p><p>Like you just did, Willem thinks, but he doesn’t say that. He doesn’t want to sound like a complete lunatic.</p><p>“Your mother,” Allyson says.</p><p>“Yes. My mother. She’s in India right now.” He thinks of her. He cannot wait to tell her this. He takes a small moment to savor that, being eager to tell his mother something. Then he goes back to savoring Allyson, and her bare feet, which are right here. He never thought he had a thing for feet, but he is beginning to reconsider.</p><p>Allyson remembers Willem talking about his mother and father. It was during their conversation—argument? debate?—about love when Willem had smeared the Nutella on her wrist and licked it off. Allyson had challenged Willem to name one couple who hadn’t just fallen in love but had remained in love, had stayed stained. Yael and Bram, he had said.</p><p>“Yael and Bram,” Allyson says now, not even having to reach for the names.</p><p>She remembers Willem’s sadness last summer. And immediately she knows, maybe she knew then, that there is no more Bram. Which isn’t to say there is no more stain.</p><p>Yael and Bram. Something in Willem’s chest catches. He’d been right. He is known to this person. Has been from the very start.</p><p>He looks at her. She looks at him. “I told you I would remember,” Allyson says.</p><p>Before he’d kissed her that night in the art squat, she had told him that she’d remember everything about their day in Paris. That she would remember him.</p><p>Willem had made no such promises. But he can taste, touch, hear, and smell every last detail of that day together. “I remember, too,” he says.</p><p>• • • </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There is so much to say. It is like shoving all the sand of the world into an hourglass. Or trying to get it out.</p><p>But Willem’s phone keeps ringing. He keeps ignoring it, until he remembers he promised he’d call Linus back right before he opened the door to her.</p><p>“Oh, shit. Linus.” He goes to fetch his mobile. Five missed calls.</p><p>Allyson looks curious. He tells her, “I have to make a call.”</p> <p>She thinks he will go into the other room to do it, but he doesn’t. He sits down next to her.</p><p>The conversation is in Dutch so Allyson doesn’t understand what he’s saying, anyway. She can’t really make much out from the look on his face, either: a half smile. A shoulder shrug. She’s not sure if the news is good or bad.</p><p>Willem hangs up the phone. “I’m the understudy for Orlando in a play. Shakespeare again. As You Like It,” he begins.</p><p>“Understudy?” Allyson asks. “I thought you were Orlando.”</p><p>Only for last night’s performance. And tonight’s. That’s what Petra had decreed, Linus has just told him. Next week Jeroen, the actor Willem replaced, will come back, ankle cast and all, for a final weekend of performances. After this evening, Willem’s services will no longer be needed, as actor or understudy. But he’s on for tonight. In fact, they need him to come listen to notes before the 7:00 call. He is about to explain this all to Allyson, but then he stops himself.</p> <p>“You knew?” he asks.</p><p>And then she says, “I was there.”</p><p>He shouldn’t be surprised. Hadn’t he felt her there? Hadn’t he spoken his lines to her? But after all the false hopes of the last year, and after that letter Tor had told him about, he’d thought he had conjured her. Maybe he had. Maybe he had done such a fine job of it, he’d conjured her right into existence, into his uncle’s flat, where she is now sitting, with her feet resting in his lap.</p><p>How did that happen? He vaguely remembers grabbing her ankles and laying her feet across his legs, casually, as if they were a blanket, but he can’t be sure. It all feels like a dream and yet as natural as breathing. This is what you do. Put Allyson’s feet into your lap.</p><p>“You were fantastic,” Allyson tells him. “Magnetic. It was like you were Orlando.”</p><p>Willem had felt a kinship with Orlando, a bereaved young man inexplicably fallen in love with a girl who came and disappeared like a wisp of smoke. But the girl came back. (The girl came back.)</p> <p>“I always thought you were good,” she continues. “Even when I saw you perform last year, the night we met, but it was nothing like last night.”</p><p>The night they met. He’d been doing Twelfth Night with Guerrilla Will, playing Sebastian. They hadn’t spoken, but he’d tossed her a coin at the end of the play. It was a flirtation, an invitation. God, he’d had no idea then.</p><p>“A lot has happened this year,” Willem tells her.</p><p>When Allyson smiles, Willem is reminded of a sunrise. A bit of light, then more of it, then a burst of brightness. A sunrise is something you can see all the time and still marvel at. Maybe that is why her smile feels so familiar. He has seen many sunrises.</p><p>No, that is not why it feels familiar.</p><p>Allyson meanwhile is remembering. Why this person? All the things she has told herself, or other people have told her—infatuation or Paris or good acting or lust—no longer hold water, because she remembers so viscerally and feels it anew. It’s not any of that. It’s not even him. Or all him. It’s her. The way she can be with him.</p><p>It was so new that day: the liberation of being honest, of being brave, maybe a little stupid. She’s had a bit more practice at it now, the past few weeks alone in Europe, a lot of practice. She knows this girl pretty well now.</p><p>“A lot has happened to me too,” she tells Willem.</p> <p>• • •</p><p>They tell the story in bits, in tandem. The parts already known: Willem being concussed. The parts guessed: Willem being beaten by the skinheads; Allyson fleeing back to London in misery. They share the frustration of never finding out each other’s true names, their whole names, email addresses. They remedy that. (Willem Shiloh De Ruiter. Allyson Leigh Healey, etc. etc.) Allyson tells Willem about the letter she wrote him last March, when she finally allowed herself to wonder if maybe the worst hadn’t happened, if maybe Willem hadn’t abandoned her.</p><p>Willem tells Allyson about only just finding out about the letter’s existence last month, trying to track it down, and only yesterday finding out what it said.</p><p>“How is that possible?” Allyson asks. “I got the letter back four days ago.”</p><p>“You got it back?” Willem asks. “How?”</p><p>“When I went to your house. Your old house, in Utrecht.”</p><p>Broodje’s place, on Bloemstraat, where he’d spent the dark days following his return from Paris, healing from the beating, from everything, really.</p><p>“How did you know to go there?” he asks. “To Bloemstraat.” He hadn’t lived there when they’d met, and he hadn’t given her any contact information. This was something he had regretted.</p><p>Allyson is embarrassed now, at the lengths she went through to find him. She doesn’t regret going through them, but she understands how overzealous it might look. In her discomfort, she starts to pull her feet away. But Willem won’t let her. He holds them fast. And this small gesture gives her the courage to tell him. About venturing to Paris. About tracking down Céline. About going to the Hôpital Saint-Louis. About Dr. Robinet and his kindness. The address, which led her back to the house in Utrecht. And to the letter.</p><p>“I kept the letter. I actually have it in my backpack.”</p><p>She leans over and pulls out a creased envelope. She hands it to Willem. There are generations of addresses here. Tor’s house in Leeds, the original Guerilla Will headquarters (how had she found that?), forwarded to Willem’s former houseboat in Amsterdam, since sold, and forwarded on to Bloemstraat.</p><p>“You can read it if you want,” Allyson offers.</p><p>“Seems beyond the point,” Willem says. Though that isn’t why he doesn’t want to read it. Tor had instructed someone to email him and tell him what the letter said. He doesn’t have the stomach to read the whole letter in front of Allyson.</p><p>But Allyson takes the envelope back, unfolds the letter inside of it, and hands it to him.</p><p>Dear Willem:</p><p>I’ve been trying to forget about you and our day in Paris for nine months now, but as you can see, it’s not going all that well. I guess more than anything, I want to know, did you just leave? If you did, it’s okay. I mean it’s not, but if I can know the truth, I can get over it. And if you didn’t leave, I don’t know what to say. Except I’m sorry that I did.</p><p>I don’t know what your response will be at getting this letter, like a ghost from your past. But no matter what happened, I hope you’re okay.</p><p>The letter is not what he thought it would be. Not what Tor suggested it was. It takes Willem a moment to find his voice again, and when he does, he speaks to the Allyson who wrote the letter as much as to the girl sitting here. “I didn’t just leave,” he says. “I’m glad you didn’t forget. And I wasn’t okay.”</p><p>“I know that now,” she says. “I think part of me knew it then, too but I wasn’t brave enough to believe it. I was okay that day but I wasn’t okay generally. I am now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Willem folds the letter, carefully, like it is sacred text. “I am, too.”</p><p>He hands the letter back to Allyson. She shakes her head. “I wrote it to you.”</p><p>He knows exactly where he will keep it. With the photo of him and Yael and Bram from his eighteenth birthday. With the photo of Saba and Saba’s sister, Willem’s great aunt Olga, who, like this letter, he only recently discovered had existed. This letter from Allyson will join the important things, thought lost, now found.</p><p>“I still don’t understand,” Willem says. “I went to the house on Bloemstraat last month and the letter wasn’t there.”</p> <p>“That’s weird,” Allyson says. “Saskia and Anamiek never mentioned seeing you.”</p><p>“Who are they?” Willem asks.</p><p>“They live there.”</p><p>“Ahh. Well, I didn’t meet them. I let myself in with my key.”</p><p>Allyson laughs. “That explains it. They didn’t know you, either, though they knew of you. And also . . .” She pauses and then forces herself to finish. “Ana Lucia.”</p> <p>“Ana Lucia?” Willem asks. He has not thought much about her since their spectacular blowout before Christmas last year. “What about Ana Lucia?”</p><p>“I met her.”</p><p>“You met Ana Lucia?”</p><p>Allyson remembers the girl’s fury. Another student at Ana Lucia’s college had told Allyson that Willem had been cheating on Ana Lucia with a French girl all along. When she’d heard that, it had seemed to confirm everything bad Allyson suspected about him.</p><p>“How did that go? Willem asks.</p><p>“Well, she didn’t punch me.”</p> <p>Willem winces. “She wasn’t so happy to see you,” he says.</p><p>“I didn’t get it. I’d never even met her before.”</p><p>“You have. A bit.”</p><p>Allyson shakes her head. “No. I think I’d remember.”</p><p>“In Paris. In the Latin Quarter.”</p><p>Allyson’s mind spins and lands on the carousel of postcards that she had pretended to look at while Willem chatted with some girls he’d known from home. Ana Lucia was one of them?</p><p>“But why would she hate me?” Allyson asks, remembering her own jealousy at any girl Willem seemed vaguely interested in. But jealousy was one thing. Ana Lucia had literally thrown Allyson out of her dorm room.</p><p>“Because she caught me buying the airplane tickets to find you.”</p> <p>Airplane tickets? Find me where? Allyson mind scrambles to incorporate this new information. It still doesn’t make sense. Willem had gone to Spain to meet the French girl he’d been cheating on Ana Lucia with. Allyson had suspected it was Céline, even though Céline had told Allyson she had not seen Willem since the day he was with Allyson in Paris. At the time, Allyson had believed her.</p><p>And just like that, Allyson understands it. How jealousy contorts things. She thinks of Céline, how jealous she had been of her, and how wrong about her. She was Ana Lucia’s Céline.</p><p>There was no French girl. There was an American girl he met in France.</p><p>“So you didn’t go to Spain?” Allyson asks.</p><p>“Spain?” Willem says. “No. I went to Mexico.”</p><p>• • •</p><p>The more questions are answered, the more are asked. But now Willem has to leave to meet Petra and Linus. Neither Allyson nor Willem wants to part. For now, they wish they could both stay like this, talking.</p><p>He would like to bring her with him now, to put her in his pocket. Except he must face Petra, his cantankerous director, who he knows is furious with him about last night’s performance. He ignored her direction to play the part safe, to play it as Jeroen had played it. Instead, he had done what his friend Kate had suggested. He’d done it his way, found his own Orlando and in doing so, opened up a vein of himself on that stage. It had been the most exhilarating experience of his life. Well, until the knock at the door today.</p><p>Much as he would like to keep Allyson close by, he knows it is unwise to parade her in front of Petra. Though he cannot wait to introduce her to Kate. He will introduce her to Kate tonight. And Broodje. And W and Henk and Max. All the people who led him back to her.</p><p>“I am in trouble with the director,” Willem explains. “Maybe it’s better if we meet later.”</p><p>There is something then that hangs between them. Meeting later is what got them into this predicament in the first place. Willem stepping out for a bit. Accidents happening. And a year before they found each other again.</p><p>They both seem to recognize the moment. But they also know now is not then. And as if to prove it, Willem slides a key off a ring and gives it to Allyson. She stares at it in her palm. So does he.</p><p>A year ago I had a backpack, and now I have a key, he thinks.</p><p>A year ago we didn’t give each other our names, and now he gave me a key, she thinks.</p><p>(Also, Willem has just glanced at the birthmark on Allyson’s wrist, giving himself an urgent desire to taste it again. Between her feet and her wrist, he is having a hard time getting out the door.)</p><p>(Speaking of feet, Allyson is looking at the zigzag scar on Willem’s foot—left foot—and remembering she wanted to find out how he got it. Along with his birthday and his favorite ice cream flavor and ten thousand other things there don’t seem to be enough time for.)</p><p>So for now Willem tells her to make herself at home. Eat what is in the kitchen. Use the computer. There is WiFi. Skype. Have a rest. His bedroom is the yellow one. He likes to picture her in his flat.</p><p>“Here is my cellphone number,” he tells her. He writes it on a pad. He resists the urge to write it on her arm, to tattoo it there.</p><p>He is about to leave, but stops in the doorway. They are now mirror images of how they were a few hours ago, Willem in the flat, Allyson in the hall. Neither is sure what this means.</p><p>What they are sure is that they want to kiss. Both of them do. There is a pull, it feels almost like a chain, linking them.</p><p>“I’ll be back here at six,” Willem promises.</p><p>“Six,” she repeats. It’s after four now. She has officially missed her flight to Croatia.</p><p>He starts to close the door behind him. Then opens it again. “You’ll be here?” He is nervous now about leaving. He can’t help it. The mirror images. The Universal Law of Equilibrium. Last year, he vanished. This year, it could be her.</p><p>Except he thinks he has stopped believing in this universal register of deposits and debits, of good things coming at a cost. And when Allyson closes the door, promising that she will be there, he allows himself to believe it.</p><p>• • •</p><p>There is news to share. They each share it.</p><p>Willem, in a rush, texts Kate, whom he just saw a few hours ago when she was on her way to meet her fiancé at the airport. She was bringing him to meet Willem so Willem could get his seal of approval to join their theater group.</p><p>I have big news, he writes. I’m Orlando tonight.</p><p>He writes a version of the same to Broodje, who, along with Henk is helping W move into a new flat with his girlfriend, Lien. He knows all of them will get the message and all of them will come, even though they all came last night, because that is how his friends are.</p><p>He is riding his bike to the theater when he realizes that they will all think the big news is that he was given one more chance to do Orlando. Though in reality, he was fired. He is going on tonight out of necessity. He can almost taste Petra’s disgust at having to put him back on the stage. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That isn’t the news. The news is Lulu, of course. Allyson. But tonight, they will all come. And they will find out.</p><p>Then he thinks of Yael. His mother, so far away from him these past few years, until that day in Paris last year that set everything in motion. It’s the middle of the night in Mumbai, so Willem texts her.</p><p>I found her. He stops. Maybe it is more accurate to say she found him. But that is not what he is feeling. He is feeling that he found her. So that is what he writes.</p><p>He doesn’t elaborate. He knows his mother will understand.</p> <p>• • •</p><p>Back in Willem’s flat, Allyson has texted Wren. CALL ME ASAP!!! And then she decides to be nosy. Not to snoop exactly, but to look around.</p><p>The living room does not offer clues. Even had Allyson not been told this apartment belonged to Willem’s uncle, she would’ve been able to tell it was not Willem’s. She goes into the bedroom in the back. The yellow one. The bed is unmade, and it smells of Willem. Somehow she knows this.</p><p>She feels shy, tentative, as if she is invading. But she remembers Willem telling her, exhorting her, as much as someone as Willem exhorts, to make herself at home. The key to the flat is still in her pocket.</p><p>She sits down on the bed. It’s low to the ground, the view looking up out the window. There’s a small bookshelf. She smiles when she sees a copy of Twelfth Night there. She leafs through it, remembering how she avoided reading it in her Shakespeare Out Loud class. She thinks of Dee. She hasn’t talked with him since Paris. She calculates the time difference. It’s a little past 8:00 a.m. in New York. Maybe she can Skype him.</p> <p>The laptop is on the bookshelf. When she takes it, she accidentally knocks over a large envelope. Out spill several photographs, newspaper clippings, some of them very old. There’s also a picture of Willem, a younger Willem, his face slightly less chiseled, but still Willem. He is flanked by a man and a woman. The woman is small, dark, intense, and the man is her opposite, all tall golden smiles. These must be Yael and Bram.</p><p>She feels a little as if she knows them. And sorry she never did.</p><p>She carefully puts the photographs back in the envelope and puts the envelope in a safe corner of the bookshelf. That is when she hears the sound, instantly familiar. It takes her a moment to locate it, inside the pocket of the jacket she saw Willem wearing after the play last night.</p><p>She pulls it out. Her old gold watch, last year’s high-school graduation gift. She’d hated it, so heavy and perfect, but it’s kind of endearing now, all scuffed up, the face of it cracked. She turns it over. The GOING PLACES engraving had seemed so burdensome when her mother had given it to her, but now it seems kind of prophetic, like the most perfect thing to have wished for her. She wants to tell her mother about this revelation and stops for a moment to savor that, wanting to tell her mother something.</p><p>That said, she doesn’t want the watch back.</p><p>In that Paris park, she’d given it to Willem, given time to him, and in exchange she became the girl in the Double Happiness story. His mountain girl, he’d called her.</p> <p>She’d known he kept the watch. Céline had told her as much when she’d confronted her in Paris last week. But she’d made it sound as though Willem had kept it to pawn it. But he’d kept it to keep. To keep her.</p><p>Allyson holds the watch in her hand. She feels the vibration of its ticking and is full in a way she can’t really explain.</p><p>• • •</p><p>Willem is trying hard not to laugh.</p><p>Petra is berating him, telling him he made a mockery of the company last night. This might be true, but Willem also knows the performance was a triumph. Which is perhaps the real mockery. But he lets Petra give him all her notes. Tell him all the beats he got wrong, how he mangled the language, how he confused the audience.</p><p>“Tonight you will play the part as Jeroen plays it, as an understudy must play it,” she commands. It is the same direction she’d given him yesterday, when he was called up to step in for Jeroen after the lead actor broke his ankle. It was the direction that had almost derailed him, until Kate had persuaded him to take the risk. “Go big or go home” was how Kate put it. But Willem had come to understand it as “Go big and go home.” That’s how it had felt. Last night he had thought the going home was to acting, to a new home in New York City, to an apprenticeship with Ruckus Theater Company, which Kate runs with her fiancé. But today it feels as though home has come to him.</p><p>“Are we clear?” Petra asks after she has smoked her way through two cigarettes worth of criticisms. “You will do as your director tells you.”</p><p>He would do as his director told him, but Kate was his director now. “I will perform the role as I did last night,” he tells Petra.</p> <p>Petra’s face goes purple. It doesn’t bother Willem one bit. What can she do? Fire him?</p><p>She stomps her feet. She seems like a little girl denied her dessert. He tries to keep a straight face, tries not to laugh, tries not to notice that Linus appears to be holding in a chuckle of his own.</p><p>• • •</p><p>Dee is laughing, too.</p><p>At the story his girl has just finished telling him. It’s almost too crazy to believe, which is how you know it’s true.</p><p>“Too bad Shakespeare’s dead,” Dee tells Allyson. “Because that’s a story he’d wanna steal.”</p><p>“I know, right?” Allyson says.</p><p>Dee’s mama drops a cup of coffee onto the desk. He can smell bacon frying in the kitchen. “That our girl?” she asks.</p><p>Dee isn’t sure when Allyson went from being his girl to their girl, but he opens the screen so his mama can say hello, too.</p><p>“Hey, baby,” she says. “How you doin’? “Want some waffles?”</p><p>“Hi, Mrs. D—”</p><p>Dee’s warning face travels four thousand miles in a split second.</p><p>“I mean, Sandra,” Allyson corrects. “I’d love some. Not sure you can Skype food.”</p><p>“Some day, I wouldn’t put it past them,” she says.</p><p>Dee angles the computer away. “Mama, I haven’t talked to my girl in a week. You can have her when she comes home.” Dee turns back to the screen. “Am I still picking you up at the airport?”</p><p>“You can. I think my mom was going to drive down, too. She said you could come back with us.”</p><p>“When’s this party starting,?” Dee asks.</p><p>“I’m meant to be flying home tomorrow afternoon. I’m actually meant to be in Croatia right now.”</p><p>“You got a lotta ‘meant to’ going on,” he says.</p><p>“I know.” Allyson laughs. “Truth is I don’t have a clue what I’m doing.”</p><p>She might not have a clue but Dee knows the signs and symptoms of a girl in love. She’s practically glowing, and without the benefit of the cucumber-and-yogurt facial he has planned as part of his welcome-home pampering spa day. He’s got a whole list of activities, but mostly he just wants to sit in the same room and talk. He misses her. Dee didn’t know you could miss a friend as much as he’s missed Allyson this summer, but then again, he’s never had a friend like her.</p><p>“You never did have a clue. At least now you’re owning your ignorance,” Dee teases.</p><p>“You know me so well!” Allyson jokes, but she touches her hand to the camera so it appears on the screen and Dee knows she’s not joking, not really. He reciprocates by putting his hand on her screen. They let the gesture say the unspoken things: Thank you for getting me here. Thank you for understanding me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I miss you,” Allyson says.</p><p>It’s just what Dee needs to hear. “I miss you, too, baby.”</p><p>Mama swoops back behind him, forcing herself back into the screen. She blows Allyson kisses. “He does. My boy is pining.”</p><p>“I miss him, too.”</p> <p>Sandra sticks her head right in front of the camera. “How’s that map working out?”</p><p>She had bought Allyson a laminated map of Paris as a bon voyage present. The gesture had embarrassed Dee at first, along with the bon voyage party his mama had insisted on throwing for Allyson, even though she’d never met her. “Feels more like what you’re really doin’ is throwing me a hooray-you-finally-done-made-a-friend party,” Dee had said. His mama had raised one formidable eyebrow and retorted, “And why can’t I do both?” (Dee lost the argument. The party had been delightful.)</p><p>“Mama, she ain’t in Paris anymore. She’s in Amster—” Dee starts to say.</p><p>But Allyson cuts him off. “The map was perfect,” she says. She explains how the map had given her the idea to check the Paris hospitals, which had led her to Wren and to Dr. Robinet and to the house on Bloemstraat and now here. “So you see, I wouldn’t have found my way here without it.”</p><p>• • •</p> <p>Broodje is shattered. He was up most of the night drinking, celebrating Willem’s debut as Orlando. He woke up after three hours of sleep with a Queen’s-Day-level hangover, only to remember he and Henk had promised W they’d help him move.</p><p>They’d spent the day lugging boxes up four flights of steep stairs. (W would have to be moving into the top-floor flat. Broodje had remarked that if they weren’t hungover, the flat would’ve been garden level. W spent fifteen long minutes poking holes in the logic of such a statement.)</p><p>Now Broodje is back at his flat. Not his, exactly. His for the next two weeks until he moves back to Utrecht with Henk. He doesn’t really want to go to Willy’s show again tonight, but he will because it’s Willy. At least he has a few hours free to rest. All he wants to do is take off his dusty, sweaty clothes and climb into bed.</p><p>He is already pulling off his shirt when he walks in the door.</p><p>And then he screams.</p><p>“Oh, shit, sorry,” he says, putting the shirt back on. “I didn’t know Willy had company.”</p> <p>It’s a bit of a déjà vu this, walking in on one of Willy’s girls. It used to be like this all the time. But not for a while. Not for a really long while.</p><p>“Sorry,” the girl says. “I didn’t know anyone was coming.”</p><p>Then Broodje looks at the girl for a longer moment. “Wait, I know you. You were at the play last night. In the park.” He’d invited her and her friend to come to the party. He’d talked more to the friend, who was very cute, though he still missed Candace, his sort-of girlfriend, but she lived in America so they were trying to figure things out. When did Willy hook up with the friend?</p><p>“You’re Broodje,” the girl says.</p><p>“Yeah, that’s right,” Broodje says. He is tired and hungover and his muscles ache and he doesn’t want to entertain one of Willy’s girls. “Who are you?”</p><p>“I’m Allyson,” she says. Then she seems to reconsider. “But you might know me as Lulu.”</p><p>Broodje looks at her for a minute. And then he tackles her in a hug.</p><p>• • •</p> <p>When Willem comes home, he finds his best friend and the girl his best friend tried to help him track down sitting together, eating. Broodje has emptied the kitchen, it seems: cheese, crackers, sausage, herring, beer. He is feeding Allyson, which is what Broodje does with people he loves. Willem sees Allyson has received a fast pass to his best friend’s heart.</p><p>“Willy!” Broodje calls. “We were just talking about you.”</p><p>“You were?” Willem says. He steps forward and his instinct is to kiss Allyson. He does not want to enter or leave a room without kissing her. This, too, is something new. But he doesn’t because this is all so new, even though the way Broodje and Allyson are sitting there, smearing cheese on crackers, it seems like they’ve been doing this for decades.</p><p>“I was telling Lulu, sorry, Allyson, what a sad sack you’ve been all year.”</p><p>“Not all year,” Willem says. (Though, really, it was almost all year.)</p><p>“Okay. Maybe not in India. I wasn’t with you in India. He went to India for three months to see his ma,” Broodje explains to Allyson. “He was in a movie over there.”</p><p>“Are you famous in India?” Allyson asks.</p><p>“I am Brad Pitt in India,” Willem says.</p><p>“And maybe not since he came back. But shit, after he got back from Paris, he was a mess. And in Mexico, when he couldn’t find you—”</p><p>“Okay, Broodje,” Willem says. “No need to give away all the family secrets.”</p><p>Broodje rolls his eyes. “Far as I’m concerned, she’s family now.”</p><p>• • •</p><p>Speaking of family, Allyson loves watching Willem with Broodje. Not that she needs reassuring exactly, but seeing him with Broodje is reassuring.</p><p>“I was going to take you out to eat,” Willem says to her. “But Broodje beat me to it.”</p><p>“We can still go if you want,” Allyson says.</p><p>“I have to be at the theater in less than an hour,” Willem says. “We can go out after? Just us.”</p><p>“Not just you,” Broodje says. “W, Henk, Lien, they’re all coming. And they will all want to meet her.” He nods to Allyson. “You are like the business we all invested in and now you’re paying off so . . . you can be alone later.”</p><p>“Wren called, too. The friend I was in Amsterdam with” Allyson says. “She wants to meet up.”</p><p>And, Willem thinks, there would also be Kate and her fiancé.</p><p>Allyson and Willem look at each other, the invisible chain connecting them pulling hard. Why hadn’t they taken more advantage of those quiet hours this afternoon? Why had they just sat there, her feet in his lap, when there was a perfectly good empty apartment here?</p><p>Except Allyson wouldn’t have exchanged those hours with Willem for anything in the world.</p><p>And neither would Willem.</p><p>• • •</p><p>All too quickly, they part again. Willem will go ahead to his call at the theater. Wren is meeting Allyson and Broodje at the flat. Everyone will meet at the park, and after the play, they will all celebrate.</p><p>Saying good-bye is less fraught this time. They have done it now once, like normal people: leave, come back. It builds confidence.</p><p>This time Willem kisses her good-bye. It is quick, a peck on the lips. It is not nearly enough. He wants all of her. From her lips to her feet.</p><p>“I’ll see you after the play,” Allyson says.</p><p>“Yes,” Willem says.</p><p>But they both know they will see each other sooner than that. That they will find each other during the play, once more, in the words of Shakespeare.</p><p>• • •</p><p>Wren arrives not long after Willem has left. She squeals and hugs Allyson, squeals and hugs Broodje. She kisses the saints on her bracelet. Jude, patron saint of lost causes. Anthony, patron saint of lost things. She kisses all the saints. They all came through. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I knew it,” Wren says in that fluty voice of hers. “But I thought you were going to find him on the train, like you did the last time.”</p><p>“I sort of found him at the train station,” Allyson says. And then she explains how she’d been about to catch the train to the airport when she’d opened the packed breakfast Winston, the guy from their hotel, had made for her. And it was the hagelslag that did it. The bread with chocolate sprinkles, the very first thing she and Willem had talked about. It had been the sign, the accident, the nudge to go to Willem.</p><p>“How did you know where to find him?” Wren asks</p><p>“Because you told me the address, and that the name of the street was a belt.”</p> <p>Wren turns to Broodje. “You told me that.”</p><p>“Foreigners can never remember Ceintuurbaan otherwise,” he says.</p><p>“As opposed to the many other pronounceable street names here?” Allyson asks.</p><p>They all laugh.</p><p>They clean up the mess from the snacks and prepare to make their way to Vondelpark. Somewhere in the back of her mind, Allyson knows she has a flight home out of London tomorrow, at 4:00. She will have to figure out how to get there. She has a few hundred dollars left. If she has to blow it on the fast Eurostar train, so be it. It was a last-minute impromptu decision to go to Paris from London that had gotten this entire ball rolling. It took two hours to get from one world to another. She is fairly confident she’ll be able to get back in time.</p> <p>When Broodje goes to have a quick shower, Wren pats the sofa next to her. “Did you find out who the woman was, the one with the flowers from last night?” she asks.</p><p>Allyson hasn’t. Last night, seeing Willem with the woman had been a deal breaker. It had seemed to confirm everything she suspected about him, the way that Ana Lucia’s fury had. But now Allyson doesn’t really care who that woman is. She has seen Willem. She has spent an afternoon with him. She knows that what happened to her last year, in a way, has happened to him.</p><p>“I didn’t,” she tells Wren.</p><p>“You could ask Broodje.”</p><p>She could, but she doesn’t want to. It no longer matters.</p><p>She can almost hear Melanie’s scoff from across the Atlantic. Melanie had been with Allyson last summer when she’d met Willem, had been suspicious of him from the start, had not been able to understand why Allyson wouldn’t let go of that one guy, that one day.</p> <p>Whatever. She isn’t listening to Melanie. Or her mom. Or Dee. Or Céline. Or Ana Lucia. She is listening to herself. And she knows that everything is okay.</p><p>“You know what we should do?” Wren says, that manic mischievous smile of hers spreading across her face. “We should get him flowers.”</p><p>For a second Allyson thinks this is some sort of duel, to win against the red-haired woman from last night. But then she understands what Wren means. They should get him flowers. At the flower market. Where Wolfgang works.</p><p>• • •</p><p>They ride on Wren’s bicycle, Allyson sidesaddle on the rack behind. (She thinks this might be her favorite thing about Amsterdam. She wants to import the tandem sidesaddle riding back home.) It is early evening when they arrive at the flower market, but a Saturday night, and bustling. Wolfgang is there, wrapping up a big bouquet of lilies.</p><p>When he looks up and sees them, he doesn’t seem the slightest bit surprised, even though Allyson is supposed to be in Croatia. He just winks. Allyson waits for the crowd to disperse and when there’s a break, she hugs him. The smell of him, tobacco and flowers, feels so good and familiar that it doesn’t make sense that she only met Wolfgang three days ago (except that it does).</p><p>“She found him!” Wren announces. “She found her Orlando.”</p><p>“I was under the impression she found what she was looking for already last night,” he says in that rumbly heavily accented voice.</p> <p>Wolfgang looks at Allyson, a silent understanding passing between them. He is right. Last night, even when she’d thought Willem was a ghost she’d been chasing, she still felt like she’d found what she’d been looking for. Something harder to lose. Because it was connected to her. Because it was her.</p><p>“It turns out, I found us both,” Allyson tells Wolfgang.</p><p>“Double good news then,” he says.</p><p>“Double happiness,” Allyson says.</p><p>“That too,” Wolfgang says.</p><p>“We are going to see him perform Orlando again. Can you come?” Wren asks.</p><p>Wolfgang says that one night of Shakespeare is enough for him. And he has to shut down the stall tonight. But he’ll be free after ten.</p><p>“Then meet us after,” Allyson says. “A bunch of us are going for dinner. You should be there.”</p><p>She thinks of what Broodje said, the dinner like a banquet for the investor’s circle. Wolfgang should be there. So should Dee. And Professor Glenny. And Babs. And Kali and Jenn, her roommates last year. Maybe she’ll hold another investor’s dinner when she goes home.</p><p>“I wouldn’t miss it,” Wolfgang says. “Now, would you like some flowers?”</p><p>• • •</p><p>At the amphitheater at Vondelpark, Allyson spots Broodje. He has saved several seats, up front this time. He is with a group of people, a guy even taller than Willem, a short-haired girl, another guy. He has brought a basket of food and several bottles of beer.</p><p>He kisses Allyson and Wren three times, cheek-cheek-cheek. And then he turns to the group. “Everyone. This is her. Lulu. Only she’s really Allyson. And this is her friend Wren.”</p><p>They all sort of stare at each other. The girl speaks first, sticking out her hand. “I’m Lien.”</p><p>“Allyson.”</p><p>“Wren.”</p><p>Lien stares at her. “You really do look like Louise Brooks.”</p><p>“Huh?” Wren says.</p><p>“The silent film actress,” Allyson explains. “My hair was like hers then. That’s why Willem called me Lulu.”</p><p>Lien looks at her, remembering that Louise Brooks movie Willem dragged them all to. She’d known then something was up with Willem. No one had believed her when she’d said he had fallen in love.</p><p>They believe her now.</p><p>• • •</p><p>W is having a hard time understanding.</p><p>After all the methodical work they put into it, calling all the American tour companies, finding the barge captain in Deauville, the charts of all the connections, this didn’t make sense. Willem going off to Mexico to look for her hadn’t made sense either. It would’ve been one thing had the girl visited a small town during a quiet time of year, but a resort area at Christmas? The odds were ridiculous. But at least that adhered to a logic. The Principle of Connectivity, albeit stretched very thin.</p><p>But he doesn’t understand this. All the looking they had done, and from what Broodje had said, the girl had done her own looking. But then she’d just happened upon him at the play last night? The play Willem was not even meant to be performing in? He’d been the understudy until last night.</p><p>It doesn’t make sense. It doesn’t make any sense at all.</p><p>• • •</p><p>Backstage, Willem is thinking about accidents again. And things that seemingly don’t make sense, except they do. Like right out there in the fifth row. All of them, together. That makes sense.</p><p>He doesn’t see Kate yet, but she has texted that she and David will be there but must leave right after the play. David is catching a late flight back to London, and she’s seeing him to the airport. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Willem’s cast mates slap him on the back, offer congratulations from last night, and condolences for next week. He accepts them both.</p><p>Max is by his side, as always. She is the other understudy, for Rosalind, and Willem’s best friend in the cast. “You win some, you lose some. And sometimes you win and lose at the same time. Life’s a bloody cockup,” Max says.</p><p>“Is that Shakespeare?” Willem asks.</p><p>“Nah. Just me.”</p> <p>“Sounds like the Universal Law of Equilibrium,” Willem says.</p><p>“The what?”</p><p>When Willem doesn’t answer right away, she says, “Sounds like a bunch of shite.”</p><p>“You’re probably right,” Willem agrees. And then he asks her if she’ll come out after the show.</p><p>“I’m still hungover from last night,” Max complains. “How many parties does one man need?”</p> <p>“This is different,” Willem says.</p><p>“How is it different?” Max asks.</p><p>Max has become one of his closest friends these past months, and yet he hasn’t told her a thing. There is nothing to do now but to tell her everything.</p><p>“Because I’m in love.”</p><p>• • •</p><p>Kate and David arrive just before curtain. She’d meant to come straight from the airport, but when she’d seen David, she had been overcome. It was a bit silly, really. It had only been a few days since she’d seen him, and they’d been together for five years. But she’d been feeling roiled since last night. A good Shakespearean performance was known to have aphrodisiacal effects. So when David arrived, she’d hustled him back to her Major Booger hotel and had her way with him. Then they’d fallen asleep and gotten themselves massively lost on the way to the park (someone should mention to city planners that Amsterdam was laid out like a rat’s maze, albeit a very pretty rat’s maze) and now here they are.</p> <p>I hope I haven’t oversold it, Kate thinks as the lights go down. She has essentially promised Willem an apprenticeship based on last night’s performance, but David has to agree. She is sure David will agree. Willem had been that good. But she is nervous now. They’ve offered apprenticeships to foreigners before, but sparingly, because the visa paperwork and union issues are such a headache.</p><p>Willem enters the stage. “As I remember . . .” he begins as Orlando.</p><p>Kate breathes a sigh of relief. She hasn’t oversold it.</p><p>• • •</p><p>It is better than last night. Because there are no walls. No illusions. This time, they know exactly who they are speaking to.</p><p>“The little strength that I have, I would it were with you”.</p><p>She is his Mountain Girl.</p><p>“What would you say to me now, an I were your very very Rosalind?”</p> <p>No more pretending. Because he knows. She knows.</p><p>“Fair youth, I would I could make thee believe I love.”</p><p>She believes. They both do.</p><p>“I would kiss before I spoke.”</p><p>The line is a kiss. Their kiss.</p><p>“For ever and a day.”</p><p>For ever and a day.</p><p>• • •</p><p>“Holy shit,” David says to Kate when it is over.</p><p>Kate thinks I told you so, but doesn’t say anything.</p><p>“And this is the hitchhiker you gave a ride to in Mexico?”</p><p>“I keep telling you, he wasn’t a hitchhiker.” David has been giving her grief about giving a ride to a stranger for months now. Kate keeps reminding him that all people are strangers, initially. “Even you were a stranger to me once,” she’d said.</p><p>“I don’t care if he was three-legged ape,” David says now. “He’s unbelievable.”</p><p>Kate smiles. She loves lots of things, but she especially loves to be right.</p><p>“And he wants to apprentice with us?”</p><p>“Yep,” Kate says.</p><p>“We can’t keep him off a stage for long.”</p><p>“I know. He’s green. The training will do him good. And then we can sort out union issues and get him up there.”</p><p>“He’s really Dutch?” David asks. “He has no accent.” He stops for a second. “Listen to that. They’re still applauding.”</p><p>“Are you jealous?” Kate teases.</p><p>“Should I be?” David teases back.</p><p>“That boy is hopelessly in love with some American girl he found and lost in Paris. As for me, I’m hopelessly in love with some stranger I met five years ago.”</p><p>David kisses her.</p><p>“Do you really have to go back tonight?” Kate asks. “You could come out after with Willem really quickly and then we could give the squeaky bed at the Major Booger another go.”</p><p>“Just one?” David asks.</p><p>They kiss again. The audience is still applauding.</p><p>• • •</p><p>Allyson notices the kissing couple. It’s hard not to, because people are starting to meander out of the theater and they are still kissing. And because, much as she’s looking forward to getting to know Willem’s friends, what she really wants to do is what that couple is doing.</p><p>And then the couple breaks apart, and Allyson gasps. The woman! She’s the woman from last night. The one she’d seen Willem with. The one she’d thought he was in love with. As of this afternoon, she no longer thought that. And now she really doesn’t think that.</p><p>“Who is that?” Allyson asks Broodje, pointing to the woman.</p><p>“No idea,” Broodje says. Then he points to the stage door. “Look, here comes Willy.”</p><p>Allyson feels paralyzed all of a sudden. Last night, she’d stood at that very stage door and Willem had breezed right by her, into the arms of that other woman. The one who is now in the arms of that other man.</p><p>This is not last night. This is tonight. And Willem is walking right toward her. And he is smiling. Wren thrusts the bouquet Wolfgang prepared (an enormous bouquet; it almost capsized the bike on the ride to the park) into her arms.</p><p>The bouquet is smashed in about five seconds. Because Willem doesn’t seem to give a shit about the flowers or the crowd of people waiting for him. He seems to be heeding Orlando’s words tonight.</p><p>“I would kiss before I spoke.”</p><p>And for the second time in a day, he does.</p><p>And, oh, what a kiss. It makes the one this morning seem chaste. It makes the flowers smashed between them bloom all at once. Allyson could live in that kiss.</p><p>Except she hears laughter behind them. And a voice, an unfamiliar one, though Allyson knows at once that it belongs to the redhead.</p><p>“I take it you found her then,” the voice says.</p><p>• • •</p><p>It takes ages for them all to troop out of the park. There are so many of them: Willem, Allyson, Broodje, Henk, W, Lien, Max, Kate, David. Wolfgang and Winston, the guy from the hotel whom Wren has been spending time with, are joining them later. The logistics are complicated. This one left a bike back there. This one is meeting them over here.</p><p>But it’s the introductions that take longer.</p><p>Kate is a theater director. Whom Willem met in Mexico, while he was looking for Allyson.</p><p>David is her fiancé, whom Willem has never met, who is going on about how good Willem was tonight, the vulnerability he brought to Orlando, what a brave way to play it.</p><p>Wren is the friend Allyson met in Paris and bumped into again in Amsterdam. “I wouldn’t have found you if it weren’t for her,” Allyson tells Willem. “I was about to give up but she made me go to the hospital you were at.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Willem thanks Wren.</p><p>Wren curtsies.</p><p>W listens to all the introductions and still doesn’t understand.</p><p>Neither does Max. “This is too bloody confusing. Can someone draw a chart?”</p> <p>“That’s not a bad idea,” W says.</p><p>“I was kidding,” Max says. “What I really need is a drink.”</p><p>• • •</p><p>Wolfgang has arranged for a table at a café run by a friend of his in a neighborhood off the shrinking red light district. It is on the Kloveniersburgwal, not far from the bookstore where Willem found the copy of Twelfth Night, and where the bookseller inside told him about the auditions for As You Like It that were happening at the theater around the way.</p><p>It takes about an hour for them to get there, because they all walk together, instead of splitting up into taxis and trams and onto bikes. No one wants to be separated. Something about the night feels magical, as if a bit of Shakespeare’s fairy dust has settled over them.</p> <p>Wolfgang is waiting at the table, along with Winston, a pitcher of beer between them.</p><p>Everyone sits down. Allyson snaps a picture and texts it to Dee. Wish you were here.</p><p>She is about to put her phone away but then she texts the photo to her mother. I am having the best day of my life, she writes. She hesitates before hitting send. She is not entirely sure how welcome this message will be, from a bar, no less. But she thinks (hopes) her mother will be happy that she is so happy. And with that in mind, she presses send.</p><p>Wolfgang has ordered a bunch of food, pizza and pasta and salads. It starts to arrive, along with lots more booze.</p><p>Willem has hardly eaten all day and is famished. But Allyson is sitting next to him, and with everyone jammed at the table, she is right up close. And then she slips off her sandals under the table and sort of nuzzles her foot against his.</p><p>He loses his appetite, for food anyway.</p> <p>The conversation is disjointed. Everyone wants to tell their part of the tale, and they tell it out of order and, as the booze flows, with increased drunkenness.</p><p>Allyson and Willem sit back and listen to this story.</p><p>“I didn’t even know her, but I knew I was supposed to go with her to the hospitals,” Wren is saying.</p><p>“I knew something was up as soon as Willem came back,” Lien says.</p><p>“Hey, I did, too,” Broodje says.</p><p>“No you didn’t,” Henk says.</p><p>“I did. I just didn’t believe it was a girl.”</p><p>“I knew something was up because he didn’t want to shag Marina,” Max says. She looks at Allyson. “Sorry, but have you seen Marina? Rosalind?” She shakes her head. “Maybe I’m biased because I’d like to shag her.”</p> <p>The table laughs.</p><p>“You have nothing to worry about,” Kate tells Allyson. “He was a miserable mess in Mexico after he didn’t find you.”</p><p>“He was even worse after the food poisoning,” Broodje says.</p><p>“You got food poisoning?” Kate asks. Willem nods. “The mystery meat? I knew it!”</p><p>“I got really sick right after you dropped me off,” Willem says.</p><p>“You should’ve called me,” Kate says.</p><p>“I ended up calling my ma, in India, and that’s why I went over, so it was a good thing, the food poisoning.” Sickness leading to healing. The truth and its opposite again.</p><p>“At least it paid off in the end, because at the time, that Mexico trip seemed like a disaster,” Broodje says. “At that New Year’s party, you were a mess, Willy.”</p><p>“I wasn’t a mess.”</p><p>“You were. You had girls coming at you and you didn’t want any of them. And then you lost your shoes.” Broodje looks at the gathering. “There were these giant piles of shoes.”</p><p>The hair on the back of Allyson’s neck goes up. “Wait, what?”</p><p>“We went to this party on the beach, in Mexico. New Year’s Eve.”</p><p>“With the piles of shoes?”</p><p>“Yeah,” Broodje says.</p><p>“And the Spanish reggae band. Tabula rasa?” Allyson asks.</p><p>It’s noisy in the bar but it goes quiet for a second as Allyson and Willem look at each other and once again understand something that they somehow, somewhere already knew.</p><p>“You were there,” she says.</p><p>“You were there,” he says.</p><p>“You were both at the same party,” W says. He shakes his head. “I cannot even begin to calculate those odds.”</p><p>She’d been thinking of him. But it had felt like ridiculous wishful thinking. Delusional wishful thinking.</p><p>He’d been thinking of her, too. In the water, he knew she was close, but not that close.</p><p>“I cannot believe you were at that party!” Henk says. “I cannot believe you went all the way there and you didn’t find each other.”</p><p>Kate and Wolfgang have only just met. But for some reason, they catch each other’s eyes.</p><p>“Maybe they weren’t ready to find each other,” Wolfgang begins.</p><p>“And so they didn’t,” Kate finishes.</p><p>“That makes no sense whatsoever,” W says.</p><p>Except that even W—mathematical, logical, analytical W—somewhere understands that it does.</p><p>• • •</p><p>The night goes on. Pitchers of beer. Bottles of wine. The novelty of the Allyson-Willem hunt takes a backseat to more prosaic matters. Soccer. The weather. There is a debate about what Wren and Winston should do tomorrow. Allyson tries not to think about leaving tomorrow.</p><p>It’s not that hard, because Willem’s hand has snuck under the table where for the last hour, it has been playing lightly on the birthmark on her wrist. (Allyson never knew her wrist had so many nerve endings. Allyson’s wrist has turned to jelly. Allyson can’t really think of much except for Willem’s hand, her wrist, except perhaps for the other places she’d like his hand to go. Meanwhile, both her feet are now completely wrapped around his right ankle. She has no idea what that is doing to him.)</p><p>Wolfgang gets up to leave first. He has to work tomorrow, not so early, because it is Sunday, but early enough. He kisses Allyson good-bye. “I have a sense I will see you again.”</p><p>“Me, too.” Allyson has a feeling she’s coming back to Amsterdam. She’ll have to get a job on campus, pull double shifts at Café Finlay during school breaks to afford the ticket. The thought of coming back makes her happy, but she can’t really think about the year of not being here. So she doesn’t. She just concentrates on her wrist, the little circles Willem is drawing, which are reverberating through her body in ever-growing waves, like when a pebble is tossed into a pond.</p><p>Kate and David, who have been doing their share of under-the-table canoodling, use Wolfgang’s departure to make their own excuses. There are hasty kisses good-bye.</p><p>Before she leaves, Kate says to Willem: “I’ll be in touch on Monday. We’ll have to start working on your visa paperwork right away, but we can get it expedited and probably have you out for October.”</p><p>“Definitely,” David says.</p><p>Willem has known since yesterday, since before he even asked Kate if he could join up with Ruckus, that this was the right thing, that it would happen, but now with David’s enthusiastic support, it has become very real.</p><p>“What visa paperwork?” W asks after Kate and David leave. Dutch nationals don’t need visas for tourist trips to the States. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At that moment, Allyson snaps out of her wrist-related haze (maybe because Willem has stopped caressing her wrist).</p><p>Willem has not had time to tell anyone about his apprenticeship with Ruckus, not his friends whom he will leave behind, and not Allyson, for whom the move has different implications. Which is maybe why he feels so nervous now. He isn’t sure how she might react. He doesn’t want her to feel pressured, like the move means he has expectations. (He has hopes, of course, especially now that he knows how close she is to where he will be, but hopes are different from expectations.)</p><p>Willem doesn’t realize he’s left them all hanging until Broodje says, “What’s going on, Willy?”</p><p>“Ahh, nothing. No, not nothing. Something big, actually.” The faces are expectant, even those of Wren and Winston, people he did not know of until tonight. “Kate and David run a theater company in New York City, and I’m going to be an apprentice there.”</p> <p>“What does that mean?” Henk asks.</p><p>“I’ll train with them, build sets, do whatever is needed, and eventually, perhaps, perform. It’s a Shakespearean theater company.” He looks at Allyson now. “I forgot to tell you that.”</p><p>He forgot to tell her everything. He was terrified to. He is terrified now. The ominous silence hanging over the table isn’t helping. And Allyson having unraveled her feet from his ankle really isn’t helping.</p><p>Maybe they aren’t so in sync. Maybe what for him is good news, a reason to hope, is just too much too soon for her.</p><p>He vaguely hears people around the table offering congratulations.</p> <p>But he can’t process it. He is looking at Allyson.</p><p>And Allyson is not congratulating him. She is crying.</p><p>• • •</p><p>Allyson sees Willem’s face, his panic, and she knows he is misreading her. But she is helpless to explain right now. Words have left her. She is emotion only.</p><p>And it is too much. Not Willem moving to American, not Willem moving a bus ride away from her. It’s that this happened at all. How it happened.</p><p>Allyson has to say something. Willem is looking so upset. The table is so quiet. The restaurant is quiet. It seems like all of Amsterdam is holding its breath for them.</p> <p>“You’re moving to New York?” she says. She keeps it together for an entire sentence before her voice cracks and she dissolves into tears again.</p><p>It’s Winston who gently touches Willem on the shoulder. “Maybe you two should go now.”</p><p>Willem and Allyson nod, dazed. They offer halfhearted farewells. (It doesn’t matter; good-byes with these two aren’t to be trusted anyhow) and leave amid promises from Wren to call in the morning and Broodje to crash at W and Lien’s place tonight.</p><p>• • •</p><p>Silently, they walk to the bike racks outside in the narrow alleyway. Willem is desperately trying to think of something to say. He could tell her he doesn’t have to go. Except he does have to go.</p><p>This isn’t about her. It was catalyzed by her, and she’s woven up in it, but this is ultimately about him and his life and what he needs to do to make himself whole. He’s stopped drifting, he’s stopped being tossed around by the wind.</p><p>But he doesn’t have to see her. It doesn’t mean that. He’d like it to mean that. But it doesn’t have to.</p><p>Allyson is thinking about accidents again. Which aren’t accidents at all. Allyson’s grandma has a word for it: beshert. Meant to be. Allyson’s grandma and Willem’s saba could’ve had entire conversations about beshert and kishkes.</p> <p>Except Allyson doesn’t know about Saba (yet) or about kishkes (officially speaking, though she knows what they are and how to listen to them and she will never ever stop doing this). And she doesn’t have the words to tell Willem what she needs to tell him.</p><p>So she doesn’t use words. She licks her thumb and rubs it against her wrist.</p><p>Stained.</p><p>Willem grabs her wrist, rubs his own thumb against it. Does the same to his own wrist, just to make it clear.</p><p>Stained.</p><p>They slam into the wall then, kissing so intensely that Allyson levitates off the ground. (It feels like the kiss that is making her airborne, but really it is Willem’s arms, which have grabbed Allyson’s hips, though Willem can’t even tell that he’s lifting her because she feels weightless. Or like part of him.)</p><p>They kiss, mouths open, tears flowing, tongues licking. It is a devouring, consuming kiss. The kind of kiss that never comes off.</p><p>Willem’s knees press between her skirt and he can feel the warmth under there, and things are about to get pretty crazy in this alleyway. Even for Amsterdam.</p><p>A cyclist passes by, ringing his bell, reminding them that they are actually outdoors, in public. Neither wants to stop. But there is an empty flat somewhere with a bed and somehow, while still kissing her, Willem manages to unlock his bike.</p><p>Allyson had thought riding sidesaddle with Wren was fun, but with Willem it is something else altogether. She remembers the illegal bike ride in Paris, when she sat in the seat and he pumped in front of her and how much she’d wanted to touch him. She hadn’t. She wouldn’t. And then they’d gotten pulled over by the police. But this, here, is perfectly legal. And there is a place for her to sit, and she can wrap her arms around his waist all she wants. She can nuzzle against his back and lick his vertebrae if she wants to. (She does, so she does.)</p><p>At the stoplights, she hops off the bike and he turns to her and they start kissing again and sometimes stay that way until the light turns green and cyclists and motos beep at them to get out of the way.</p><p>It is a torturously labored ride home like this. Allyson is desperate for it to end and would like for it to go on forever.</p><p>Willem is just desperate for it to end. He is so full of wanting that it is painful and Allyson keeps lifting his shirt and licking his back, which she shouldn’t do while he’s riding a bike because he might pass out. (But she shouldn’t stop, either.)</p><p>And finally they are back outside his flat and he can barely keep his hands steady to lock his bike and he is about to attack her in the hall when he remembers condoms. He doesn’t have any, hasn’t needed any in months, so he drags her to a store that’s still open and he buys a three pack.</p><p>“Get the nine pack,” Allyson says, and he almost explodes right there.</p><p>And then they are outside his building. And f**k because Mrs. Van der Meer is downstairs walking her dog and he doesn’t want to make small talk with her, but they do and he introduces Allyson, and Mrs. Van der Meer wants to talk to her about her trip to California back in 1991 and Willem has to position Allyson in front of him because it is like being twelve-years-old again, the lack of self control he has, but also at least with Allyson standing in front of him, against him, it’s bearable (and it is also unbearable).</p><p>Mrs. Van der Meer’s dog yanks on the leash and she goes out and they go in and he can’t even wait. They are on the stairs and she is under him and he’s got that wrist of hers in his mouth (finally!) but it’s not enough, he wants all of her (the feet!) and they both know they need to make it up to Daniel’s flat but the last stretch is the hardest, but somehow they do and Willem can’t find his key and at this point he is going to take her in the hall because he doesn’t care, and honestly, neither does she, but then she remembers she has the key! He gave her the key. It’s in her back pocket. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They don’t even take the key out of the lock. They don’t even make it off of the floor.</p><p>A year is a long time to wait.</p><p>And Allyson and Willem, they feel like they’ve been waiting a lot longer.</p><p>• • •</p> <p>Only later, after they have pulled the key out of the lock and put back on their clothes only to take them off again and try things more slowly this time and are having a 3 a.m. snack in Willem’s bed, do things calm down enough for them to talk. They talk about things like birthdays and ice-cream flavors (March, August, chocolate for both) and scars (he fell on the deck of his family’s houseboat, the one his father built; he has much to tell her about Bram). They speak of Willem’s apprenticeship and Allyson’s college. They spend a fair amount of time discussing the geography and transportation options of the American Northeast.</p><p>“Four hours from New York to Boston on the bus,” Allyson says. “One hour to Philadelphia on the train.”</p><p>“I like trains,” Willem says as he nibbles her ear. “Busses, too.”</p><p>“And I could come to Brooklyn on weekends,” Allyson says shyly. Only not that shyly. Her hand is drifting down under the covers. Willem is glad she steered him away from the three pack. “And October is like nothing.”</p><p>“It’s practically tomorrow,” Willem murmurs.</p> <p>“I think today has become tomorrow.” Allyson pauses. “Which means I’m supposed to fly home today. I have to get myself to Heathrow in like ten hours. Is that even possible?” (She hopes it isn’t possible.)</p><p>“Anything is possible,” Willem says. “You can take a train, or one of the budget airlines. Though we should probably book something now.”</p><p>He thinks about reaching for his computer, but at that moment, her hand has reached what it was looking for and he is useless. He closes his eyes. The girl he sees behind his lids is the girl who is in his bed. He has no desire to do anything to send her away.</p><p>Last year in Paris, she asked him to stay on with her, for just one day. He had wanted to, but he’d been ambivalent, too. And that ambivalence had cost him.</p><p>Or maybe it hadn’t. He thinks of what Kate and Wolfgang said. Maybe last year wasn’t their time. But now is. He knows it. Right in his kishkes.</p><p>“Do you have to go back right away?” he asks her.</p> <p>She has the flight booked. And school starts in September. Though September is not for a few weeks, and flights can be changed.</p><p>“Can’t you stay,” Willem begins. “For just one—?”</p><p>Allyson doesn’t wait for him to finish the question—hour, day, week—because her answer is the same.</p><p>“Yes.” </p> </body></html>"]