["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>In the course of space colonization, there arose a need for humans with enhanced abilities. Men and women who could survive harsh conditions, who were superb warriors, gifted hunters, and brilliant scientists.</p><p>Some enhancements were technological in nature: an array of implants with various functions. Their effect ended with the death of the person who carried them. Other improvements were biological and these enhanced capabilities persisted, lingering in the bloodline, changing and mutating into new abilities in the offspring of the original carrier. It was quickly realized that the advantage of these biological enhancements lay in their exclusivity. Thus, the biologically enhanced united and shut down all further biological modification.</p><p>Collectively known as kinsmen, these exceptional beings gave rise to several dozen families, which now form the financial elite of the colonized planets. The kinsmen strictly control their numbers and their loyalty to their families is absolute. Like the Sicilian mafia families and feuding Corsican clans of the old planet, the kinsmen exist in tense competition with each other. It is that competition that rules the economy, begins and ends wars, and drags human civilization to greater technological and scientific progress.</p><p>“Place your hands on the panel in front of you.” The bodyguard, in a sleek grey uniform of Canopus Inc., nodded at the plasti-steel console that sprouted from the luxurious rug like a mushroom on a thin metal stalk.</p> <p>Meli smiled. Four high-caliber gun turrets swiveled on their mounts on the ceiling, tracking her every movement as she rested her fingers on the panel, a thin bracelet sliding down on her right wrist. She had already passed through a number of metal detectors and submitted to a search and a chemical sniffer. Only one final test remained.</p><p>Light slid along her fingertips as a complex array of scanners feverishly assessed her temperature, heat, and chemical emissions, sampled the composition of her sweat and oil on her fingertips, and probed her body for foreign influences. A long moment stretched. A calm female voice with the crisp unaccented pronunciation of the computer announced, “Implant scan, class A through C, negative. Biological modification negative.”</p><p>The guard relaxed slightly. The tense line of his shoulders eased. A person like her had no chance against a bodyguard equipped with a combat implant that sharpened his reflexes and increased his strength.</p><p>“You may step down,” he permitted. “Follow me.”</p><p>She walked behind him to the large wooden door polished to an amber gleam. Maruvian pine, unthinkable luxury. The guard tapped a code on his wrist. The door slid aside, revealing a second, steel partition. The steel wall split in half and parted. Meli strode into a spacious office. The door whispered shut behind her.</p> <p>Three people waited in the office: an older man behind a desk cut from a single block of malachite, and two bodyguards, a woman and a man, both lean and sharp, positioned at the walls on opposite sides of her.</p><p>She smiled at them as well.</p><p>The man behind the desk leaned forward slightly. Agostino Canopus, thirty-eight, a kinsman, fourth son of Vierra Canopus, Arbitrator Second Class. Of average height, he sat with the easy authority of a man completely confident in his position. His hair, a dark copper, was cut and styled with artful precision. His skin was perfect. His eyes, two dark chunks of green, fastened on her. In a split second she was evaluated, measured and approved.</p><p>“Sit down.” Agostino indicated a plain stool bolted to the floor with a casual sweep of his hand.</p><p>Meli sat.</p><p>“You came here to become a retainer of Canopus family,” he said. “Why?”</p> <p>“Power.”</p><p>In the financial world, where most disputes were decided by arbitration, the arbitrators wielded unprecedented influence.</p><p>Agostino nodded. The answer seemed to satisfy him. “Your test scores are exceptional.”</p><p>She accepted the compliment with a nod. “So is my reaction time.”</p><p>His eyebrows came together. “What...”</p><p>She whipped off the chair. Obeying her mental command, a long ribbon of transparent green whipped from the narrow bracelet on her wrist. The ene-ribbon slashed the female bodyguard, whipped across the door, and kissed the male bodyguard across the chest. Before Agostino’s lips shaped the next word, Meli sat back onto the chair. Behind her two bodies slid apart, cleaved in two. The air smelled of fried electronics. She had disabled the control panel on the door.</p><p>Agostino surveyed the door. “You’re a melder.”</p><p>“Yes.”</p> <p>Melders like her were an extremely rare commodity. The mutation that permitted her to operate an energy ribbon came along once in every fifteen million, and most possessing it never discovered their abilities. In the world of combat implants and biochemical modifications, melders were the extraordinary natural-born freaks.</p><p>Agostino leaned back, one leg over the other, pleating his long fingers on his knee. “What’s this about?”</p><p>“The Galdes family sends its regards.”</p><p>Ten days ago he had presided over the arbitration between Galdes and Morgans. He’d ruled in favor of Morgans, finding no wrongdoing in the hostile takeover of Galdes’s Valemia Inc.</p><p>“It was a fair arbitration,” Agostino said.</p><p>“You’ve falsified the evidence.” She kept her voice calm and pleasant. “You’ve altered the earnings estimates for the third and fourth quarters and assisted in hiding of Morgans assets prior to takeover, creating an appearance of weakness. Your actions irreparably damage prestige of Galdes family and cut their income by one twelfth. You drove Arani Galdes, former CEO of Valemia, to commit suicide.”</p><p>He didn’t miss a beat. “Nobody can blame me for her death.”</p><p>“I can,” she told him.</p><p>“Ah.” He inclined his head in a shallow bow. “So it’s personal. Your retina scans do not trace back to Galdes. You aren’t a kinsman. Why take a suicide so close to heart? Was she your lover?”</p><p>“My cousin.”</p><p>His eyebrows crept up. “You’re an excise.”</p><p>He turned the word into an expletive, saying it the way one might mutter “cursed” or “leper”. Even after twelve years it still stung a little. For a kinsman, family meant everything. Nothing could be worse than being disowned and cut off.</p><p>“Of course.” Agostino snapped his fingers. “Your family cast you out, so you can commit atrocities on their behalf, and none of your actions can be traced back to them. You still have fond feelings for your cousin. My apologies. I didn’t seek her death.”</p><p>His gestures grew animated. She could almost feel the wheels turning in his head. He thought he saw a crack in her armor. Meli sighed.</p><p>“Your sacrifice is admirable. But I could offer you so much more. Your parents, your siblings, they threw you aside. What kind of family does that? Don’t you want revenge?”</p><p>“It was my choice.”</p><p>He stared at her, stunned. “You chose...? Why?”</p><p>She reached into her business suit and produced a thin sheet of plasti-paper. On it a young dark-haired woman laughed, wearing a crown of flowers. Meli slid the plastic across the table to him.</p><p>“What’s this?”</p><p>“My cousin Arani. I wanted you to see her before you died.”</p><p>“Reconsider!”</p><p>“You’re my last kill,” she told him. “After you, I will retire.”</p><p>His face snapped into a hard mask. “There are six guards outside that door, not including automatic defenses. Even if you kill me, you’ll never get out alive.”</p><p>She gave him a bright smile as the ene-ribbon whipped from her wrist. She was still smiling when the top half of his skull slid to the floor.</p><p>No matter the hour, no matter the circumstance, Angel always looked perfect. Debonair in his tailored rust jerkin, with crispness to his lines and inborn poise so many spent years training to mimic, he seemed the very essence of a kinsman. His hair was a soft brown streaked with copper, his face was amiable and handsome, and his eyes were dark, just like hers. When he smiled from the display, it was as if the sun had risen. Fortunately, Meli had long ago become immune to his charm. After all, she had seen him in diapers.</p><p>“No more jobs,” she told him. “I’ve retired.” Two months had passed since Agostino Canopus died on the marble floor of his office. She liked her quiet and the sense of liberation retirement brought. No more jobs. No more death.</p><p>On the screen her brother leaned forward. “This is a personal request, Meli. From Father.”</p><p>Meli closed her eyes. Angel had interrupted her morning exercise and since his call wasn’t an emergency, she saw no reason not to continue. Around her the small house lay quiet, serene in the light of the early morning. A delicate lemony scent of brugmansia floated through the open screen door. She was aware of minute noises: water gurgling in the pipes, two bees buzzing in the small garden on her right, a faint whistling of the draft generated by the climate control system...</p><p>“Please, do him this favor.”</p><p>“I’m done, Angel,” she murmured. “We’ve spoken of this. The family has no right to ask me.”</p><p>“Father knows that. Believe me, he wouldn’t request this of you unless the need was dire.”</p><p>She said nothing. Angel, while diplomatic, suffered from an eloquent man’s malady—faced with silence, he felt compelled to fill it, even when it was in his best interests to keep his mouth shut.</p><p>Moments dripped by. Angel cleared his throat.</p><p>“Raban, Incorporated has dropped the price of the condenser units to below fifteen thousand standard dollars. It’s a calculated move to edge out the competition. The condenser production is still the main source of our revenue. We can’t underbid them. We can’t even match them. The profit margin is too narrow for us to survive. They can take a loss, but we don’t have the reserves to ride it out. We’re a small family. We’ll go bankrupt. And you know what happens to families that go bankrupt.”</p><p>Without funds, a family couldn’t pay its soldiers. The competition in New Delphi was too cut-throat for the family without soldiers to survive for long. The city housed twenty-one kinsman families of note, metropolis divided between them like slices of a pie, in both economic and geographic sense. The Galdes’ slice was rather small, but their soldiers were renowned for their expertise and loyalty. Their martial prowess was what had kept the family afloat this long. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Please, Meli. You’re still a Galdes. Even if you did retire.”</p><p>Why did she feel guilt? She owed them nothing. She’d spent twelve years murdering on their behalf. She just wanted to be free now. Free and alone. Her father knew this. She’d made it abundantly clear during their last communication.</p><p>She didn’t bend her rules, as the family learned the first time they tried to force her to kill a target without a sufficient reason. This job had to be special. Something she could refuse.</p> <p>The curiosity got the better of her. “Who is the target?”</p><p>“Does this mean it’s a yes?”</p><p>Meli sighed softly. “The target, Angel.”</p><p>She supposed it had something to do with Raban, Inc., but she had excised herself from Galdes family years ago. Their business dealings remained a mystery to her. She had no idea who owned Raban, Inc.</p><p>She heard the barely audible click as Angel tapped the keys on his end of the screen.</p> <p>A faint tug on her senses from the left. She didn’t hear it, didn’t see it, but felt it with some innate sixth sense, or perhaps an imperceptible combination of all five.</p><p>Meli struck.</p><p>Her eyes were still closed, but in her mind she clearly saw a ribbon of transparent green snapping from the bracelet on her hand. She felt the energy sear the target and smelled fried electronics.</p><p>“Good God,” Angel said.</p><p>She opened her eyes in time to see the manta ray shaped disk of interceptor crash to the floor in a smoking ruin. Quiet and equipped with small caliber cannon, robotic interceptor units had long become a favorite in security. Their state of the art sensory systems ensured that they located intruders quickly and the absolute silence of their flight made their detection nearly impossible until their ammunition bit the back of the target’s neck. She made it a point to kill at least one a month, to relieve tension and practice her strike on a moving target. It helped her stay sharp.</p><p>“It always rattles me when you do that,” Angel said. “Here is the file.”</p> <p>A small icon ignited in the corner of the screen, indicating a downloaded file available for viewing. He hesitated. “I think you might enjoy this one. A bit of poetic justice, one might say. Give it a thought, Meli. Please. For me.”</p><p>Angel touched his fingertips to his mouth, pressed them to his forehead, and bowed his head. The screen turned neutral grey, signaling the end of transmission.</p><p>Meli sighed. “Open file.”</p><p>The icon grew to fill the screen with a facsimile of a manila folder. The folder opened. A picture of a man looked at her. Ice burst at the base of her neck and slid down her spine.</p><p>Celino Carvanna.</p><p>Two hours later Meli sat in the garden. Around her, dahlias bloomed in a dazzling display of a hundred shades. The delicate pink of Adelaide Fontane, the white frilly Aspen, the gaudy riot of orange that was Bodacious and her favorite, the Arabian Night, its sharpened petals a deep intense red of a Burgundy wine.</p><p>Beyond the small plot lay a narrow street, typical to Old Town, where streets were narrow, houses old, property values low, and residents still kept an occasional garden. Beyond the street lay a throughway. If she rose and approached the fence, she would see the steady current of aerials gliding through the air. A left turn on the throughway would bring her to the heart of New Delphi’s financial district. A right would take her to the Terraces, where tourist shops and cafes catered to the upscale clientele eager for a touch of the “old planet” and the memories of provinces that lay beyond the city.</p><p>The city was the center of the South, the technological and economical hub of the subcontinent. Divided into territories between kinsmen, it served as their battleground. But those who had grown up in the provinces surrounding New Delphi never forgot their true home.</p> <p>Meli had bought the house for the garden and filled it with dahlias, permitting only a few brugmansias and two pink silk trees for fragrance. It was her bright, cheerful haven, her little celebration of life and color, and affirmation of her own humanity. Her proof that she could nurture life as well as take it.</p><p>The file lay on her lap, downloaded into her notebook. She had read it, committing every word to memory. She had printed Celino’s photograph. His face was a glossy smoothness underneath her fingertips.</p><p>She moved her hand and looked down on the god of her adolescence. He hadn’t changed as much as she expected. The years had sharpened his face, honing his features with a lethal precision. A perfectly carved square jaw. A crisply defined nose with a small bump. His cheekbones protruded, the cheeks beneath them hollowed, making the contours of his face more pronounced. His eyebrows, two thick black lines, combined with the stubborn set of his wide, narrow-lipped mouth, gave his face a grim, menacing air. But it was the eyes that elevated his appearance from merely harsh to dangerous.</p><p>Dark grey, they matched the fabled bluish steel of Ravager firearms. Perceptive, powerful, they betrayed an intellect sharp enough to draw blood but revealed no emotion. Not even a minute glimpse of his inner self. She vividly remembered staring into their depths, trying to gauge what he felt for her, if anything, and finding only a hard opaque wall.</p><p>Every time she looked into those eyes, a jolt of adrenaline tore through her.</p><p>Meli forced herself to look at him again, trying to separate herself from the adolescent flutter of her pulse. That flutter, the slight pain in her chest, the rapid chill, all that was but a bitter memory of a little foolish girl, hardly more than a child. Her little foolish hopes and dreams had long turned to dust.</p><p>She had to evaluate him for what he was—a target.</p><p>In her mind a younger Celino sprang from her memories: handsome, tall, with a lazy, self-indulgent smile, standing on a verandah with a short blade in his hand, inviting the party guests to throw polymer drink cans at him. He was barely seventeen then. He looked incredible poised against the backdrop of the flower beds that gave the province of Dahlia its name. As a barrage of the multicolored containers hit him, he sliced at them in a blur, severing them with his blade. When he was done, the tile around him was drenched. Celino, on the other hand, remained perfectly dry.</p><p>Carvannas had a reputation for their knife skills, superb even among the kinsmen.</p><p>The man who looked at her from the photograph now wouldn’t show off. Tempered by a decade and a half in the kinsmen family feuds, he would watch, calculating the odds, until the right moment came, and then he would seize it without hesitation and squeeze out every advantage. He had survived four known assassination attempts and likely a dozen or more that remained secret. She tapped the notebook screen, calling up the only recorded attempt. She had viewed it twice already.</p><p>The premiere of Gigolo. A brightly lit street. Red carpet stretching into the mouth of Miranda Theater. Adoring crowds shouting their worship at the stars and their escorts.</p><p>A sleek, bullet-shaped aerial slid up to the ropes. The door swung up. A metal step unfurled from the underside of the vehicle, permitting the passengers to exit in comfort. Celino stepped out. Tall, lean, and overwhelmingly masculine in the traditional Carvanna black doublet stretched by his broad shoulders. He had matured well. Too well, Meli reflected.</p><p>He bent lightly, offering his hand, and immediately feminine fingers rested in his palm. A woman stepped out. She wore a glittering silvery sari that stopped a shade short of vulgar. In spiky heels, she stood only a couple of inches shorter than Celino, six two to his six four. A fountain of blonde hair spilled down her back all the way past her butt.</p><p>Celino led her down the carpet. They seemed perfectly matched—her glamorous light to his brooding darkness. A painful needle pierced Meli’s chest. Old dreams, she reminded herself.</p><p>She sensed the attack a moment before it came. Celino’s head jerked as the crowd on the right erupted and four men dashed at him. The magnetic disruptors installed by theater security made any metal projectiles unusable, and the attackers opted for dark red monomolecule blades.</p><p>Celino thrust his date behind him with a powerful shove and attacked so quickly, he blurred. He was preternaturally fast. Meli tapped the screen, slowing the recording by twenty-five percent. He held a simple metal knife. His swipe drew a bright red gash down the first attacker’s throat—beautifully done. A vertical gash opened a bigger hole in the carotid without slowing down the strike. It was nearly impossible to hit the artery that way—like aiming at a piece of lubricated IV drip dancing around in the wind. Meli had factored in the enhanced strength and speed, but Celino seemed to have enhanced reflexes as well. Or perhaps a targeting implant. Or both.</p><p>The second cut grazed the second attacker’s arm pit, severing another vein. The third assailant received a sideways swipe to the kidneys. That strike took a quarter of a second longer than Celino had planned. She saw him change his strategy in mid-move, hammering a kick to the fourth man’s neck. She rewound half a second, slowed the feed to half speed, and watched Celino’s black boot connect with the man’s neck. She couldn’t hear the telltale crunch, but she saw the man’s neck line jerk sharply. Celino’s kick had broken the vertebrae of his attacker.</p><p>She shut down the notebook. In a purely physical confrontation, Celino would kill her. She had absolutely no doubt of that. She was a small woman—he towered over her by a foot, outweighed her by at least eighty pounds of hard muscle, and he had enhancements she couldn’t match. Judging from Celino’s performance, very few people would be able to match him blow by blow. Add to it bodyguards, who always accompanied him. And Marcus. One couldn’t forget Marcus. Only one generation removed from old planet, Marcus was ill suited to traditional enhancements. Instead he had done horrible things to his body in the name of service. A walking poison, he killed with a mere touch. Celino had saved him years ago and Marcus was devoted to Celino like a dog.</p><p>To kill Celino Carvanna, she would have to get close to him and separate him from his guards.</p><p>Father was right. None of the people at Galdes disposal could take out Celino Carvanna. In fact, of all the millions that inhabited New Delphi, she alone was uniquely qualified to take him on.</p><p>Father, in his wisdom, also reasoned that she would do it. If not for the sake of Galdes, then for the sake of sliding the tomb stone atop her broken heart. He believed she would hate Celino Carvanna. After all, Celino had humiliated the Galdes family. He ruined her life, obliterating her future. Of course, she had to hate him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Meli recalled the file. Celino chose to oversee a number of projects for Carvannas, including Raban, Inc. and Sunlight Development. He was active and ruthless, and his leadership brought his family to its prominence. He made the Carvanna millions. For all practical purposes, he was the Carvanna family. His death would plunge his clan into chaos and destroy the value of their stock.</p><p>Angel had managed to obtain Celino’s calendar for the next two weeks, at astronomical cost, no doubt. Celino scheduled an inspection of the new development to the south. That meant a flurry of meetings and formal dinner engagements, which, if the new Celino was anything like his younger self, he would loathe it with great passion. He was both too active and too smart. Time may have taught him patience with less agile minds, but it could hardly teach him how to escape boredom in their presence.</p><p>She had reviewed his recent development projects. Celino built beautiful places, full of sunlight and flowers, all of the modern technology seamlessly married with the provincial earthiness. Meli smiled. One could remove a man from the provinces, but one couldn’t take the provinces out of the man. He would strive to escape tedium of formality, which meant he would likely stay in his villa on the Terraces and lunch below, among the cafes.</p> <p>Revenge was sometimes best served hot.</p><p>Celino strode down the tiled curve of the Red Terrace. Built into the side of a towering cliff, now honeycombed with metal and plastic-sheathed tunnels, the Terraces consisted of seven platforms, layered one under another, each about a mile long and two hundred yards at their widest. The platforms jutted in gentle curves from the former cliff, housing small shops and eateries. The bottom terrace sat roughly three thousand feet above the plain, while the Red Terrace, where he stood, was situated three levels above it. He wasn’t sure about the exact altitude, but the view was magnificent.</p><p>The residents of New Delphi were used to heights, but even Celino, as he stopped by the faux wooden rail, was momentarily overcome by the enormity of the landscape. Far below him a vast plain rolled into the distance and beyond it blue cliffs rose, made ethereal by the ocean of air.</p><p>Celino resumed his walk, aware of Marcus following like an unobtrusive shadow a few feet behind. Two of his men, Romuld and Ven, stalked behind Marcus.</p><p>The breeze brought a whiff of a shockingly familiar aroma. He stopped. He smelled crisp dough with a slight buttery taste and a tantalizing scent of roasted passion raspberry, the only variety of the old planet berry that grew in the southern provinces. The aroma swirled about him and instantly he was five years old, stealing the still warm cone of pastry from the dish and eating quietly under the table, thrilled at his own sneakiness.</p> <p>“What is it?” Marcus asked softly.</p><p>“Passion cones.” Celino accelerated, heading toward the source of the scent, until he reached a small cafe with a red overhang. A sign proclaimed A Taste of Dahlia. He rarely entered unfamiliar places. Why risk an ambush?</p><p>Celino glanced past Marcus at Ven. “An order of passion cones.”</p><p>The bodyguard ducked into the shop.</p><p>Celino shrugged. Funny how the memory played tricks. He could practically taste the pastry from the scent alone.</p><p>Ven emerged from the cafe. Empty handed.</p> <p>Celino stared.</p><p>“The owner says the cones aren’t his to sell,” Ven said. “I told him to name the price, but he refused.”</p><p>Celino growled. He wanted the damn cones. He strode into the shop.</p><p>The cafe was small, barely more than a counter and six tables. The floor was faux wood, the furnishings vintage Dahlia: sturdy old furniture that would last another century. Only two of the tables were occupied. The patrons watched him like terrified rabbits.</p><p>Behind him Romuld activated the scanner that sat over his left eye. A sheet of green light swept over the tables and people sitting at them. Romuld said nothing. The place was clean.</p><p>An older man hurried to Celino’s side, nervously wiping his hands with a towel. “Sir?”</p><p>“Passion cones,” Celino said.</p><p>The older man twisted the towel in his hands. “You see, the business is a bit slow. It’s a weekday and off-season.”</p> <p>Celino frowned.</p><p>The man stammered. “There is a woman. She rents one of my stoves once in a while, because I have the old iron ovens. The old province kind. She pays well. She was the one who made the passion cones. So I can’t sell them. I’ve asked.”</p><p>The trip down the memory lane suddenly became a challenge. “Then I will ask her myself.”</p><p>The man nodded and pointed to the back. “Through that door, sir.”</p><p>Celino crossed the floor and ducked through the low doorway. A spacious kitchen stretched before him, filled with the tantalizing aroma of freshly baked dough.</p><p>A woman sat at a large table, in a pool of golden light streaming from the window. She wore a sun dress the color of burgundy. Her hair was gathered into a thick dark braid that glinted with copper in the sunlight. In her hands was an electronic reader.</p><p>She looked up at him, her dark eyes like two bottomless pools on a face tanned to golden perfection. Celino stared.</p><p>The woman blinked against the green sweep of Romuld’s scanner and raised her eyebrows.</p><p>“I’m told you made the cones,” Celino said.</p><p>“Technically, I’m still making them.” Her voice was sensuous and confident, and completely unimpressed with his surliness. She checked her reader’s clock. “Thirty seconds left.”</p><p>“I’d like to purchase them.”</p><p>“Are you a Dahlian?”</p><p>“I don’t see how that can be of any consequence.”</p><p>She rose. She was shorter than he, maybe five four. The thin dress hugged her chest, outlining large, full breasts and a narrow waist. The wide cut of the skirt hid her hips, but judging by the rest of her, her butt was round and plump. She grasped a heat-resistant towel, forced open the stove door and pulled a tray of cones into the light. They looked perfect, golden crispy brown.</p><p>“If you were a Dahlian, then you would know that passion cones must be baked with love and given freely. Mothers make them for their children, wives make them for their husbands, and young girls bake them for their lovers. It’s bad luck to sell them.”</p><p>She set the tray atop a stone block and used the tongs to transfer the cones to a small cloth-lined basket. He liked the way she moved, easy, graceful, gliding.</p><p>“That’s an old superstition.”</p><p>“Superstitions add texture to life.”</p><p>She picked up the basket and brought it to the table, and once again he stared, mesmerized by her curves and her bottomless eyes.</p><p>“How much?” he asked and wasn’t sure if he was asking how much she wanted for the cones or how much she would charge to let him have a go at her ripe body.</p><p>“Not for sale.” A little sly light danced in her dark eyes.</p><p>Cones or you, he wondered. Her eyes told him the answer: both.</p><p>He changed his tactics. “By the same tradition, it’s bad luck to turn away a guest from your table. Especially one who arrived in the middle of the meal.”</p><p>She laughed softly. “So you’re from Dahlia after all. I’ll make you a deal. I will share my cones. But I have no pink wine to go with them. If you...”</p><p>He simply jerked his hand and the sound of rapidly retreating steps announced Ven’s departure.</p><p>“A bit imperious of you,” she said, amused.</p><p>He pulled out a chair and sat at the table opposite her. “It’ll save us time.” He glanced at her reader. A Chronicle of the Reign of Charles IX. “Prosper Mérimée?”</p><p>“Indeed.”</p><p>He didn’t think anyone except him read the long forgotten old planet author. “Stories of a more savage time. When men were men and women were...”</p><p>“Hauntingly beautiful bronze statues of Venus who crushed them in their sleep?”</p><p>Celino frowned. She didn’t simply read the novel, she had read the short stories as well.</p><p>“I’m afraid I prefer Colomba to Carmen,” she said. “So if you want to discuss the opera, you’re out of luck.”</p><p>He viewed opera as a garish and vulgar spectacle.</p><p>Ven entered and placed a bottle of Dahlian Pink on the table. He had activated the icer on the side of the bottle and a delicate feathery frost painted the glass.</p><p>“We’ll need mugs,” she murmured. “Ascanio! Can I trouble you for a couple of mugs?”</p><p>Mugs. How...provincial. He hid a smile.</p><p>The proprietor scurried into the room, deposited two heavy clear mugs onto the table, and escaped.</p><p>Celino popped the cork and poured the wine. A lush pink splashed into the mug. She tasted it. Her eyes widened. “Cerise!”</p><p>“Indeed.”</p><p>“Had I known you would pay for the cones with luxury wine, I would’ve surrendered immediately.”</p><p>“Surrendered” conjured an image of her naked in the sheets. Surprising. It had been a long time since he reacted that way to a woman. And she wasn’t even beautiful. She seemed to have none of the refined elegance he usually sought.</p><p>Where did she come from? What was she doing here? Besides baking passion cones.</p><p>He pulled his combat knife from the sheath on his belt and offered it to her handle first. “I believe it’s customary to share the first cone.”</p><p>She took the knife without care, gripped it like a hammer, oblivious to the fact that her fingerprints registered on the handle, and chopped a cone in two. Whatever she was, knife artistry wasn’t in her talents. She cut like a cook.</p><p>She returned his knife and pushed half a cone toward him. “May you prosper.”</p><p>“And you as well.” His mouth automatically shaped the response to the old greeting.</p><p>She bit into her cone. Celino tasted his, waiting for the three-second diagnostic. No alarms blared in his implant. No poison. He bit a piece, savoring it this time. It tasted like heaven. Neither too sour, nor too sweet. Perfection. He ordered passion cones from time to time and the premier bakeries of New Delphi had nothing on this woman.</p><p>His teeth caught something solid. “Lemon rind?” he said in disbelief. To the best of his knowledge, only his mother put lemon rind into the cones. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You found out my secret.” Her pink tongue darted out of her mouth to lick at a smudge of the filling off her bottom lip. He wondered if her mouth tasted of cones and pink wine.</p><p>“Would your men like some?”</p><p>“No,” he said.</p> <p>“They’re on duty?”</p><p>He nodded and attacked the second cone.</p><p>He had eaten three before Marcus leaned over to him. The meeting with the land owners started in less than twenty minutes. Barely enough time to reach the conference hall within his hotel.</p><p>He didn’t want to leave. He wanted to sit with her in the sunny kitchen, drink pink wine, eat cones, and think of her in his bed.</p><p>“Ah. You have to run,” she guessed.</p> <p>“Indeed.” He rose. “Thank you. The cones were divine.”</p><p>She handed him the basket. “Take them.”</p><p>He hesitated.</p><p>She rose and pressed the basket into his hands. “You’re leaving the wine with me. It’s only fair.”</p><p>Outside the sunshine made him blink. He slipped the knife out and handed it to Romuld. “Find out who she is.”</p><p>Meli sat alone in the kitchen. She poured herself another mug. The wine was perfect, delicate, its bouquet leaving a symphony of complimenting flavors on her tongue.</p> <p>A small part of her had hoped Celino would recognize her. But he didn’t. That was how little her existence meant. She was nothing but a forgotten speck in his past life.</p><p>Meli drank the wine.</p><p>It had started with a veil.</p><p>She vividly remembered it. It was a diaphanous indigo veil that hid the bottom part of her face, leaving only her eyes exposed. When her mother had slipped it onto her, adjusting the band to fit under the knot of her hair, Meli could still see her features in the mirror, but her face seemed broken in half. There was the tan half with her eyes and then there was the lower half under the veil that seemed to belong to someone else.</p><p>“Why?” she asked.</p><p>Mother sat on the bed. “You are betrothed. The veil lets everyone know that you’re off-limits.”</p><p>The enormity of it failed to penetrate. “But I’m only ten.”</p><p>Mother sighed. “I voted against it. I think it’s a critical error in judgment and I think it will come back to haunt us all. But I was outvoted by the family counsel.”</p> <p>Even at ten, Meli knew that family counsel was law.</p><p>“Who am I marrying?”</p><p>Mother snapped her fingers. The display hidden in the surface of the mirror ignited. “Engagement,” her mother said briskly. A file appeared, opened, and an image of Celino Carvanna filled the screen.</p><p>“But he’s old!”</p><p>“Don’t be melodramatic. He’s only sixteen. In eight years, when you marry him, you will be eighteen and he will be twenty-four. See, the difference is much less pronounced. And when you’re twenty-two and he’s twenty-eight, you’ll barely notice it.”</p><p>Meli stared at Celino’s face. He was handsome. She had seen him a few times at the garden parties. But he didn’t know she existed. “But he isn’t interested in me in that way.”</p><p>“Darling, you’re ten. Trust me, if I had any inkling that he was interested in you in that way at this point, they’d have to kill me and your father both to go through with this engagement. He is a very young man. Right now woman to Celino means a set of breasts and a plump bottom.”</p><p>Mother took her hands into hers.</p><p>“You’re not a woman yet, Meli. But one day you will be. You won’t be beautiful, but you will be attractive and men will flock to you. Me, your aunt Nez, your grandmother, we all have that something that makes men turn their heads and do silly things to entice us into their beds. Don’t worry, darling. He will notice you one day. You will hit him like a brick.”</p><p>The veil itched her chin. Meli scratched. “But why do I have to do this?”</p><p>“Because our family and the Carvannas have formed an alliance. On our own, we’re both too small to be a significant player in New Delphi, but together we can be a force. Our territory will double. We’re sharing technologies and manufacturing facilities. And your betrothal to Celino cements it together the way seal foam cements sections of the spacecraft together.”</p><p>“What if I don’t want to?”</p><p>Mother gathered her into her arms. They sat together looking at Celino.</p><p>“I will have to do it anyway, won’t I?”</p><p>“Yes.”</p><p>“What if he won’t like me?” Meli said softly.</p><p>Mother fell silent. “I have to be honest with you, Meli. He probably won’t like you. And it has absolutely nothing to do with you. As I said, he’s a very young man. He’s just now coming into his own. Before the engagement he could see freedom on the horizon: independence, however small, from the family. His own aerial. His own place. Freedom to find women and choose his destiny. Our family counsels took all of it away from him with this engagement. The world of his possibilities has been narrowed. He’s a gifted, independent boy and he will be bitter about this development. That we can’t help. And that’s why I didn’t want this engagement. I don’t want you to be married to a man who will think of you as a burden.”</p><p>Mother patted her hair. “But not all is lost, sweetheart. We have it in our power to change his perspective. We must get him to see you not as a rock about his neck but as an ally. Someone who will be on his side no matter what. Someone who will understand him, and listen, and be able to converse with him at his level. A sheltered harbor in his life. You already have a lot in common and we have eight years before you have to marry him. That’s time enough to become expert on all things Celino.”</p><p>And so Meli studied. She learned the recipes Celino liked and practiced cooking them until they were perfect. She read the same books he had read and analyzed them, although she didn’t always form the same impression of them. He was interested in business and she had received private tutorship from the candidate of sciences of New Delphi Business Academy. She’d learned the significance of implants, the genealogy of both families, and the frequency of random inborn talents within them. She knew which cologne Celino wore, what colors he preferred, what holofilms he was likely to quote. There were times when she resented him, even hated him, but part of her understood it was self defense against the engagement neither of them had wanted, and the other part, the part that grew stronger and stronger over the years, noticed how brilliant he was, how clever and sharp, and ruthless. As he cut down the competition left and right, she grew to admire his ferocity. And the woman in her began to notice how unbearably handsome he was.</p><p>He had left the province shortly after their engagement. Before his departure they were brought together and left alone for a few moments on a balcony. He was spectacular in his Carvanna black, and she was a skinny kid with half her face hidden by a veil.</p><p>“I’m sorry about this,” he said.</p><p>“Me too,” she mumbled.</p><p>“I want you to understand it wasn’t my idea. I’m not a pervert.”</p><p>He walked away from her, leaving her alone on the balcony pondering his words.</p><p>He took to New Delphi like a fish to the ocean. Meli received frequent updates of his legendary financial maneuvers. He was a genius. But he had his flaws: impatience, insensitivity, inability to slow down. Meli had catalogued his weaknesses, knowing she would have to compensate for them.</p><p>One evening while in the armory she picked up an ene-ribbon wrist brace and discovered she was a melder. Her mind and body had the power to activate and wield an ene-ribbon. It was an exceedingly rare talent. The chances of it occurring in their bloodline were one to two million. She was brought to the melder adept in the city and trained at a great expense to the family. Her father had insisted that this fact be hidden from the Carvannas, and Celino in particular. She imagined he began to suspect that not all was well with his future son-in-law.</p><p>By twenty Celino had doubled the Carvannas’ liquid capital. She saw him infrequently, for a few moments during his visits to the ancestral home. He avoided her and their interaction was limited to a few brisk exchanges. They could barely manage a conversation. The older she grew, the more she stammered in his presence, seized by a kind of giddy exaltation born from the knowledge that one day he would be hers. Celino was utterly oblivious to her crush. He was never impolite but she had come to expect no warmth from those visits. None was owed to her.</p><p>Meli would change that. She knew she would.</p><p>Then in June, almost exactly six years to the day of the engagement, came the crushing news: The Carvannas reneged on their agreement, severing all financial ties with Galdes. The engagement was off. The blood oaths were undone. The Carvannas cut them loose and it was done at Celino’s insistence.</p><p>It took Meli about a minute to fully digest all of the implications of the disaster and then she sank on the floor, shaken to her very core by despair. It took her almost five hours to work up the courage to go see him. Meli had no future with him, but if she acted now, before he escaped her reach, she could still have a future.</p><p>She put her crushed heart aside and donned a black dress. She came alone, unarmed, still wearing her veil, and Carvanna retainers parted to let her pass. A single soldier led her to the pavilion on the hill. A huge blocky building, it served as the training hall for Carvanna kinsmen for over a century. She walked inside alone and stood at the battle line drawn on the floor.</p><p>Celino was in the middle of the floor, a knife in his hand. His torso and feet were bare and he wore only the wide dark practice pants. The lights were off. Shutters shielded the windows, permitting only the narrow rays of sunset that made a grate of light and shadow on the floor. He moved through it, silent, quick, strong like a predatory cat. His knife flashed, rending invisible opponents.</p><p>She watched him a minute, crossed the battle line, and stepped into his path. He moved toward her, a dervish of spinning kicks and knife strikes. He didn’t look capable of stopping, but she knew better and stood her ground until his knife halted an inch from her throat.</p><p>He looked at her with cold eyes. “You’ve wasted your time.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I came to convince you to marry me.”</p><p>He sighed, his sweat-slicked chest rising. “I know. It’s not your fault. It’s not my fault either. But they chained me with this engagement and I can’t live my life on a chain. For six years I did nothing but work. I ate, lived, and breathed numbers. I gave up on the pleasant diversions a man of my age should enjoy. I did it because I wanted to be free. A week ago my contribution to the family exceeded profit generated by Galdes.”</p><p>“So you delivered an ultimatum: your freedom or your absence.”</p> <p>“In essence, yes. I promised them prosperity if they followed my wishes or my excision if they didn’t. It’s business. I simply outbid your family. I’m worth more to my kin than this alliance.”</p><p>“I understand your desire for freedom. But please understand my point. By marrying me you would—”</p><p>He waved his hand. “Don’t you have any dignity? I have worked for half a decade to escape you. Do you really think you can change my mind by begging? If you were beautiful, perhaps I would consider it for a moment. I’ve seen you without your veil and you can’t even offer me that. But even if you were golden, even if you were the most elegant and refined being on the planet, I would push you aside. I value freedom more.”</p><p>“Celino!” She needed him to listen, damn it.</p><p>“A bit of advice—take off that ridiculous rag.” He headed out the door. She rushed after him but he had vanished into the night. Her sixteen-year-old heart lay broken on the floor.</p> <p>She wrote him several letters, both through the feed and, when he deleted those unread, on actual paper. Her pleas had gone unanswered.</p><p>Her god rebelled against his worshipper and he had no mercy to spare.</p><p>It happened just as she calculated. Although her engagement was technically broken, until Celino married she remained off limits to kinsmen. First, she had been groomed for another man. Second, Celino might have changed his mind and decided to marry her and no kinsman wanted to offend New Delphi’s newest financial shark. Had her family enjoyed greater influence, she could’ve found a husband, but none of the smaller families dared to take a chance, knowing the Galdes clan lacked resources to shield them from Celino’s wrath. By twenty, having watched an endless stream of leggy blondes pass in and out of Celino’s public life, Meli realized that Celino would never marry. He enjoyed his freedom too much. He had turned her into an old maid.</p><p>Meli refused to remain a liability. After all she was a melder. She channeled her frustration into the lethal kiss of the ene-ribbon. After her mother’s death, she excised herself from the family, developing a separate life so she could be their silent blade. Over a decade she had killed many to protect her family, always in self-defense and always after a careful study. She had two liaisons, but they were brief and failed to repair her.</p><p>Meanwhile, Celino outgrew godhood and became a titan. The Carvannas prospered and grew under his leadership, while the Galdes stagnated.</p><p>Now they wanted her to assassinate the man who had doomed her. A man she knew intimately well.</p> <p>A man whose eyes made her heart skip a beat, despite his unintended cruelty, despite the years, despite the gulf between them and her deep, logical desire to feel nothing for him.</p><p>Meli rose. The next few days would prove infinitely fascinating.</p><p>Celino awoke early. He lay in bed, staring at the ceiling above him. Around him the bedroom was luxuriously silent.</p><p>He dreamt of the woman in the red dress. He dreamt of her ripe golden body in his bed and of dripping honey onto her plump nipples and then slowly licking it off while she laughed. He awoke hard like a rock.</p><p>It was a ridiculous adolescent fantasy.</p><p>“Romuld. Audio only.”</p><p>The huge screen on the wall ignited with pale blue. “Sir?” Romuld said softly.</p><p>“The woman?”</p> <p>“The lab lifted two partials from the knife. No match in the aerial database.”</p><p>So either she didn’t own a vehicle, or it wasn’t registered.</p><p>“The scan showed no implants or Class C or above modifications.”</p><p>She wasn’t a fighter. He already knew that.</p><p>“The owner of the shop reported that she stops by occasionally, never more often than twice a month, rents a stove, and bakes pastries. He says it’s highly unlikely she will return within the next week or two.”</p><p>“What did she bake the last time?”</p><p>“Apple pie.”</p><p>Celino cut off the transmission.</p><p>And so she breezed into his life and slipped away again. Perhaps she thought she would never see him again. She was wrong. He wanted her and when he wanted something, he always got it.</p><p>A woman like her, a lovely, earthy, provincial woman like her, where would she go in New Delphi?</p><p>“Naria. Audio only.”</p><p>A moment passed and then his sister’s voice filled the room. “Celino?”</p><p>“Where do you shop when you come to the city?”</p><p>“Well, good morning to you too!” A child’s laughter rang through transmission. “Where do I shop? Let’s see...”</p><p>He patiently listened to the long list of children’s clothing stores and designer boutiques. Wrong Carvanna. “What about Aunt Rene?”</p><p>“Rynok Market. She loves that place.”</p><p>“Thank you.”</p><p>He ended transmission and called up Romuld. “Rynok Market. Find the woman.”</p><p>The presentation of the site manager dragged on. Celino had caught the gist of it within the first five minutes—the site fell behind schedule and it was the fault of the crew, the supplier, the weather, and cosmic gods. The site manager was completely innocent of any wrongdoing and bore no responsibility for anything whatsoever. Celino intended to fire him after his speech, but he permitted the man to state his case.</p><p>The display of his personal unit ignited. Romuld’s face came into view and his voice spoke into Celino’s ear through the audio link. “She’s here.”</p><p>The image blurred and shifted into an aerial view of the market. Romuld had launched a sweeper unit. It hovered above the crowd, unnoticed, its camera sweeping the faces of patrons. The camera zoomed in and Celino saw her. She wore a green dress with a red skirt. It made her look like an upside-down flower. Her hair was down, a windblown mess of dark happy brown. Her face wore a deadly serious expression as she bargained for a bunch of herbs with a vendor. The vendor threw his hands up in exasperation. She raised her eyes to the sky. The vendor shook his head. An ancient ritual of haggling proceeded merrily along, both parties having entirely too much fun for their own good, until finally she walked away from the booth, her bundle of herbs deposited into a small expandable satchel.</p><p>“Stay on her,” Celino murmured silently, his voice fed into Romuld’s audio piece by his implant. “I want to know where she lives.”</p><p>“Should I tag her?”</p><p>“No. Just follow.”</p><p>The meeting came to its inevitable conclusion ten minutes later. By the time Celino resolved the issue and ascended to the dock housing his aerial, Romuld had sent him her address. She lived only a few minutes from the market, in Old Town.</p><p>She owned an old house, pre-second expansion. It perched behind an impact-proof plastor fence disguised as a wall of rocks. As he flew over it and circled the house, he saw the backyard. Filled with bright color, it suggested a garden. He had expected her to have a garden.</p><p>Celino landed on the small parking space, noting that no fresh scuffs marked the slab—she didn’t own an aerial—and made his way to the door. For a moment he considered knocking, then shrugged, and attached the small disk of the lock breaker to the plate above the electronic lock. The lock breaker’s display flashed a couple of times, but remained red. No dice.</p><p>Celino tried the door. Unlocked. Utterly ridiculous.</p><p>He let himself in.</p><p>A small house lay before him. A typical rectangular front hallway. He saw her shoes sitting in a neat row. Straight ahead the hallway ran into the kitchen. He heard a female voice humming and rhythmic strikes of the knife against the cutting board.</p><p>On his left the hallway opened into the living space, a large square room, proof of the house being built during the time when people still prized hard copy recordings and pseudo-paper books and needed ample space to store them. The room was mostly empty now and furnished in cool blue. Two soft chairs, a pile of floor cushions in the corner opposite a modestly sized screen on the wall. And at the far wall a sliding plasti-glass door stood wide open, only a thin mesh separating the house from the garden.</p><p>Celino strode into the kitchen. He could’ve sworn he made no sound, but she raised her head. Dark eyes glanced at him and he stopped, arrested by their unexpected beauty. Velvet, brown like the finest coffee, lit from within by her vitality and intellect, these eyes simmered the blood in his veins. With a single look she had awakened a feral need smoldering beneath the surface. He went hard. He would have this woman. She just didn’t know it yet.</p><p>“What are you doing in my house?” She seemed neither afraid, nor disturbed, rather slightly indignant that he dared to enter without permission.</p><p>“You never told me your name.” He forced himself to move and sat leisurely in the chair opposite her. The kitchen smelled of subtly spiced stock. A mess of minced herbs lay on the cutting board before her.</p><p>“I suppose I best call city security to throw you out.”</p><p>“Do you think they can?” Not likely. A squad of elite “busters” wouldn’t be able to remove him from her presence.</p><p>She surveyed the breadth of his shoulders. “Perhaps. You’re rather dark and menacing. Are you enhanced enough to support this promise of violence?”</p><p>“Yes.”</p><p>“I see.”</p><p>She lifted the lid off the pot, releasing a cloud of aromatic flavor into the kitchen, and scraped the herbs into the soup. “What is it you want?”</p><p>“You.”</p><p>“Why?”</p><p>He frowned. “I’m not sure. But I’m plagued by dreams involving your breasts and honey.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her eyebrows crept up. He caught a hint of blush on the tan smoothness of her cheeks and found it at once elating and erotic.</p><p>“It’s quite adolescent of me, I know,” he said.</p><p>“You break into the house of a complete stranger, force yourself into her kitchen, and suggest that she should surrender her breasts to you so you can satisfy your honey dripping fetish. What woman could pass on that invitation?”</p> <p>“You haven’t had many lovers, have you?” He watched her blush fade. It suddenly seemed important.</p><p>She blushed again and he smiled, satisfied in her answer. She pointed at the front door with an oversized spoon. “Out.”</p><p>“What will it take? What should I do to have you?”</p><p>“I think you might be a raving lunatic.”</p><p>He smiled. “But you aren’t afraid of me.”</p> <p>She sat in her chair. “No. You don’t strike me as a man who would rape.”</p><p>“Despite me being dark and menacing.”</p><p>“You like to win.” She took a sip from her glass. “And forcing yourself on me would mean you failed in your conquest.”</p><p>In two sentences she deftly dissected his soul. “I’m Celino Carvanna. Name your dream and I’ll make it happen. And then, if you’re so inclined, perhaps you could fulfill mine.”</p><p>“A rather melodramatic declaration, don’t you think?” She smiled. Her mouth was soft, her lips pink like the sweet wine they drank.</p><p>“Women usually respond well to drama and decisive declarations of lust.”</p> <p>“I’m not that sort of a woman. Unfortunately for you, I’m not for sale.” She leaned her elbows on the table and rested her chin in her hands. “So far you failed to terrify me and failed to buy me. I’m terribly curious what path you will attempt next.”</p><p>In his mind he lunged across the table and crushed her mouth with his. “Perhaps I will praise your cooking.”</p><p>“Ah. Flattery. A bit predictable, but it often works.”</p><p>“Do you find me attractive?”</p><p>She looked him over. Her gaze touched his chest, hidden by black doublet, slid up to caress his shoulders, then his thick neck, lingered on his cheekbones and finally rose to meet his stare. Her eyes were liquid chocolate and he felt a thrilling tension run through him.</p><p>“Yes,” she said, slightly surprised. “I do.”</p><p>“Will you let me kiss you?”</p><p>“Probably not. But I will share my soup with you, since you’re in my kitchen and I’m starved. You seem to be comfortable with rudeness, but I can’t let go of my manners and eat in front of you while you stare at me with your iceberg eyes.”</p> <p>“Iceberg eyes?”</p><p>“Glacial. The bowls are behind you.”</p><p>Celino rose. The wall was dotted with standard hidden shelf covers. He tapped the closest one. A shelf slid out of the wall, offering a row of neatly placed bowls. He plucked two and pushed the shelf back into the wall.</p><p>She ladled the soup into the bowls. “Would you like to eat in the garden?”</p><p>She led him through the house into the garden. Flowers greeted him in every shade and shape imaginable. Dahlias. In his youth, he had spent countless evenings on the balcony of Carvanna house, sitting in a chair, puzzling over a financial riddle, and when he would look up to clear his head, the riot of dahlias blooming in the garden greeted him just like this.</p><p>“Take a chair,” she offered.</p><p>He sat and drank his soup from the bowl. It was delicious, spicy and tart, with an undercurrent of fiery peppers that nipped on his tongue.</p><p>They sat together, saying nothing even when they both finished their meal. A feeling of profound calm descended upon Celino. He let the peculiar refreshing serenity sweep through him, bringing him a deeply rooted happiness at simply being alive.</p><p>The audio piece piped into his ear for the third time. He was catastrophically late. He rose, bowed to her, and left without a word.</p><p>And there it was, Meli reflected. He found her. Less than twenty-four hours. She expected nothing less from Celino Carvanna.</p><p>He fantasized about dripping honey on her breasts. A small, satisfied smile curved her lips. It took almost eighteen years, from the skinny ten-year-old girl to the twenty-eight-year-old woman, but Mother proved right. She hit him like a brick.</p><p>And she managed to hide that a single glance from him made her entire body hum like a tightly wound string under the hand of a virtuoso guitar player. Celino Carvanna was honeyed poison in her wine. The same delicious fear she had experienced in his presence as an adolescent returned full force, only she was no longer an inexperienced child. She used this fear now, turning it into seductive tension, letting him sense just enough to spur him into open pursuit. Celino was a predator and every predator responded to prey who seemed to run. And when she finally let him catch her, their battle would drive him out of his mind.</p><p>She supposed she should be ashamed for still wanting him. Her father would certainly be ashamed if he knew. But her mother would not.</p><p>Love was a rebellious emotion, Meli decided. It defied constraints of reason. She no longer cared about the twenty-two year old who, in his rush to freedom, trampled her. She discarded him long ago, except as fuel for revenge. His temple lay in ruin, his statue shattered, his hymnals burned. She would never again worship him or any other.</p><p>But the man he had become stirred a deep longing in her. He was darkness. His eyes were ice. He didn’t walk, he prowled, confident, powerful, dangerous. He had learned patience and achieved his dreams. And yet, hidden beneath the layers of menace and terrifying competence he remained deeply alone. Just like she did.</p><p>He was seductive and it was beyond her not to respond.</p><p>A small calculating part of her was glad of it. Celino would sense any insincerity. Luckily for her, when she finally kissed him, she would be perfectly honest in her want. There would be nothing false in her, not in the way she would shiver under the touch of his hands, not in the way she would part her legs for him, letting him drive himself inside her. She would revel in him, drink him in, and every moment of her pleasure would be genuine.</p><p>And when he belonged to her, she would finally repay a decade worth of pain in a single brutal dose of reality.</p><p>Meli smiled.</p><p>Celino lasted two days.</p><p>Shrouded in the comfortable gloom of the evening, her reader on the pillow before her, Meli sensed him at her doorstep before his hand touched the handle and shivered in anticipation. “Lamp,” she whispered and a small light ignited in the corner, diluting twilight with soft yellow glow.</p><p>A moment later he pushed her door open and loomed in the doorway, a shadow woven of night.</p><p>“Don’t you ever lock your door?”</p><p>“If I did, how would you get in?”</p><p>She had no idea how fast he could move. Before the door had a chance to swing shut, slapped by his powerful hand, he knelt before her in the pile of her floor pillows. She raised her hand and drew her fingertips down his cheek. The warmth of his skin sent a tingling pulse into her hand. It fanned the hungry fire in the depth of her. Her insides tightened. She imagined him claiming her, sliding into her, hard and hot, and she kissed him.</p><p>The taste of his mouth intoxicated her. He sealed her lips with his. His tongue slid into her mouth, stroking hers in the liquid rapid rhythm. The fire within her burst into inferno. Her head swam. He released her, and she slid her arms about his neck, molding herself against his iron chest. “Just like that,” she whispered into his ear. “Take me just like that.”</p><p>She licked the corner of his jaw and saw that the ice in his eyes had melted into radiant hungry heat. His hands grasped her tunic and effortlessly ripped the tear-proof fabric. Her soft breasts swung free. She rose to her knees and arched herself against him. His mouth trailed a path of heat from her neck, over her clavicle and down. His hand cupped her right breast, stroking it, squeezing, guiding her erect swollen nipple up. His mouth closed over it. He licked her, painting searing heat across her nipple. She dug her fingers into his back. “More. More.”</p><p>He licked her again and she purred for him. She was wet and hot and pliant, dying a little with each stroke of his tongue. His hands slid down her back inside her light pants and the thin shimmer of her underwear to cup her butt. He squeezed her and pushed her back gently onto the pillows. She fell for him.</p><p>Celino growled like a hungry animal and pulled her clothes off her. She lay before him, in the cushions, her chest rising, her thighs spread. He stared, as if unable to believe that all of her was his.</p><p>She lifted herself up enough to grasp his black shirt. “Off,” she breathed. “Every last thread.”</p><p>He pulled off his shirt. His chest was carved by a savage sculptor, each line hardened to perfection by years of martial practice. His skin was bare of hair and in the soft light his torso was golden like a block of amber, and just as amber, when she drew her hand across it, it sent a spark through her. She kissed the shield of ridged muscles on his stomach, reached for his trousers, unfastened them, and slid her hand inside, down the hard shaft of his erection. He growled, thrusting, and she dipped her head and drew her tongue across the top of him, sucking gently.</p><p>Celino jerked back from her, shedding his boots and pulling off his trousers in a violent frenzy. She laughed happily, thrilled that he wanted her, and then he grasped her, still laughing, knocked her back onto the pillows, pinning her down with his weight, and kissed her on the mouth, turning her laughter into a low throaty moan. She locked her hands on his muscular back, feeling every inch of his enormous body pressed against her, rigid with need. He kissed her again and again, on the mouth, on the neck, caressing her until everything faded except him. She wanted him, needed him, and yet he teased her with his mouth and his hands, until she could stand it no longer. Finally his iron thigh edged her legs open. He clasped her hands with his and thrust inside, into her moist heat.</p><p>A jolt of nearly unbearable pleasure ripped through her. She gasped, but he gave her no time to come to terms with it. He thrust into her again and again, deep, smooth, hard, each push propelling her higher and higher until at last she burst with pleasure. She laughed, unable to contain rapture, opened her eyes, and saw him come with her first squeeze, his eyes filled with ecstasy of her climax and his release. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He eased himself from her and she curled next to him, her head on his chest. His arm trailed down her back and pushed her closer to him. For a long time they lay intertwined and she listened to his heartbeat until she finally fell asleep.</p><p>She awoke in the night because he wanted her again. And then again. Some time in the early hours of the morning she called him a savage, but he laughed and seduced her once more with ridiculous ease.</p><p>In the morning he discovered he was late, but he stayed for breakfast. Meli served him shockingly sweet coffee in tiny cups, with a side of red arna berries still on the vine and spicy sweet bread.</p> <p>He barely touched any of it. His grey eyes looked at her with warmth. He took her hand into his and kissed it.</p><p>His tenderness caught her unprepared. She was prepared for a brisk dismissal, but he didn’t seem to want to let her go. In making her strategy, she never counted on his affection or on the stirrings of absurd pleasure that affection made her feel.</p><p>“You’re making me feel self-conscious,” Meli said. “Did I finally cook something you hate?”</p><p>“Come with me.”</p><p>Meli shook her head. “I have my world. You have yours.”</p> <p>A shadow of former hardness iced over his eyes. “Am I dismissed then?”</p><p>She kissed him on the lips, surprising herself with her tenderness. “I wouldn’t do well in your ivory financial tower. I will wait for you here instead. Come to me tonight.”</p><p>He pulled her in his lap. “I could persuade you to come with me.”</p><p>She smiled. “Ah, the power of sex. Perhaps, you could. But why would you, knowing I don’t want to go?”</p><p>“So I can have you to myself.”</p><p>“You can have me anyway. Tonight.”</p> <p>He kissed her neck and she shivered.</p><p>“Promise me you will lock your door while I’m gone.”</p><p>“I promise.” She whispered the combination into his ear.</p><p>“At least tell me your name.”</p><p>“Meli.”</p><p>Celino knew someone had entered his aerial the moment he closed the front door of Meli’s house. He waited until the vehicle’s door slid open and Marcus’s pale features greeted him.</p><p>“I came close to sending out a search party, my lord,” the Anglican said softly when Celino slid into the driver seat.</p><p>“You would have rescued me from one of the best nights of my life and then I would have had to kill you. I’m a savage, you know.” He guided the aerial straight up, eased it into the flow of traffic and let the autopilot take over. “What have you found out?”</p> <p>“A lot and nothing. The house is registered to Meli Asole Grey.”</p><p>“It’s a false name,” Celino said. Asole and Grey were two characters from Scarlet Sails by Alexander Green. It was a ridiculously obscure old planet book. The only reason anyone would know of it would be by studying the works of the Seventh Romantic Revivalists, who considered Scarlet Sails the purest expression of romanticism. He recalled suffering through Seventh Romantic Revival somewhere between twelve and thirteen. He deeply hated it. “She has an excellent education.”</p><p>Marcus nodded. “A trace of the name produced nothing. She simply appeared out of thin air about eight years ago. She doesn’t own an aerial. She has no health card. Her bank balance is modest, never over three thousand a month. She receives regular deposits from a closed fund held at Colonial Bank. The account is rated B. Hacking their security grid to see who put it there will be long, dangerous, and expensive.”</p><p>“Do it. Does she own the house?”</p><p>“No. It’s owned by Colonial. She makes standard rate payments.”</p><p>“Buy it. Do it through Fontaine, Inc.”</p><p>Marcus hesitated. “Most likely, she is kin. She is either on the run and doesn’t want to be found or she has excised herself from her family.”</p><p>Celino frowned. The excision was rare. An excised kinsman severed all ties with their family, sometimes of his own free will, sometimes because his family judged him to be harmful to their wellbeing. An excise lost all claim to his inheritance, family profits, and protection. It was a drastic step, never taken lightly. He had threatened excision years ago to free himself and assert his dominion over the family, and he had given the matter a great deal of thought before taking the plunge.</p><p>Meli was a mystery. An enchanting mystery. He had never before had a woman who laughed in joy when he brought her to an orgasm. He wanted to do it again.</p><p>Occasionally excision was done to provide the family with deniability. Great thieves and assassins had been excised, so they could act as a shadowy arm of their families. The family reaped the rewards, while the excises alone shouldered all of the consequences. He considered that possibility, turning it over in his mind.</p><p>She could’ve killed him last night. He’d gone to her confident in his ability to defend himself, but he hadn’t counted on how absorbing she could be. She occupied his attention completely. He had fallen asleep holding her. He slept well too, what little of it he had done last night.</p><p>It was highly unlikely that an assassin would possess none of the enhancements customary to her profession.</p><p>“Keep digging,” he said. He would do some research himself. Tonight.</p><p>Celino spent the next night with her. And the next.</p><p>On the third morning he surrendered to his fate and cleared his schedule for the rest of the week. He hadn’t taken a vacation in five years.</p><p>They spent a lazy day together. He snooped through her reader. He thought she had excellent taste until, predictably, he found Scarlet Sails.</p><p>“It’s an abominable book,” he told her.</p><p>She smiled. “I like it.”</p><p>He opened his mouth to argue but she put her fingers on his lips. “I don’t require you to like it. Only to accept that I’m different from you.”</p><p>Later, after they made love in her bed, and she lay next to him, her head resting on his biceps, she said, “Tell me about your lovers.”</p><p>“They were many and unremarkable,” he said. “None of them were like you.”</p><p>“How am I different?”</p><p>“If I lie, will you know?”</p><p>“Yes.”</p><p>“Perhaps, that’s your answer.”</p><p>Her knuckles punched his ribs and he laughed.</p><p>“Cheater.”</p><p>“Men don’t speak of things like this.”</p><p>She turned on her elbow and put her head on his chest. “Tell me.”</p><p>“You set me on fire,” he told her. “While you poured me that soup in the kitchen, I had to fight not to lunge across the table and kiss your mouth. But I’ve felt that way before, sometimes with women who were merely passing acquaintances. I feel comfortable with you. I know it sounds pedestrian, yet it makes you priceless to me. Being with you is effortless.”</p><p>“Is that so?” she asked softly.</p><p>“You’re so like me. Sharp, smart, and practical. And so unlike me. I’m a cold ruthless bastard and you are warm and happy. And soft.” He trailed his hands down the curve of her breast. “And lovely.” He teased her nipple. “Enchanting. Alluring...”</p><p>“You don’t say...”</p><p>He kissed her and whispered into her ear. “And all mine.”</p><p>“Not all,” she told him and left the bed.</p><p>“What of your lovers?” he asked her later when they sat in the garden sipping pink wine he had brought. “How many did you have before me?”</p><p>“I’ve had a few.”</p><p>“Too many.”</p><p>“How do you know?”</p><p>“More than zero is too many.”</p><p>She laughed.</p><p>“Tell me about them.”</p><p>“There were two. The first was a much older man. I was twenty-one and he was almost forty. I had chosen him very carefully. He was very kind and he was going off planet in a few days. I wanted my first time to be special and worry free.”</p><p>“Was it?”</p><p>“It was pleasant. He was skilled, but I was self-conscious and we lacked passion.”</p><p>“What about the other man?”</p><p>“He was a wanted criminal. I thought he was a dashing rogue.” She sipped her wine. “We were together for almost a year. You know a part of me. He also knew a part of me, the part I no longer want to be.”</p><p>A sharp spike of jealousy pierced Celino’s chest.</p><p>“Your eyes are frosting over,” she noted.</p><p>“What part of you did he know that I don’t?”</p><p>“The part I will keep to myself for now. You don’t need to worry, Celino. The man is dead. He proved himself to be just what I thought he was—a rogue—and his greed got him killed.”</p><p>She sat there, frowning.</p><p>“What’s bothering you?” he asked.</p><p>“You.” She glanced at him. “You make me feel happy. I like being with you.”</p><p>“Why does that worry you?”</p><p>“I’m afraid I might disappear.”</p><p>“I don’t understand.”</p><p>“You will.” She nodded. “One day.”</p><p>He would uncover all her secrets, sooner or later, he promised himself. He only needed patience and time.</p><p>They made love in every corner of the house. They spoke of books and ate the food she made. She surprised him with a keen understanding of finances and he amazed her with his knowledge of dahlias. He secretly ordered a necklace of blood onyx that cost more than the latest luxury aerial. He had it delivered to the house, but she refused to take it. He cooked for her instead and she was delighted.</p><p>He had never met a woman so rich, in her warmth, in her mind, in her vitality. And she had given all of herself to him. He felt blessed.</p><p>His bliss lasted for three days. On the fourth, the terra plant in Ogavia exploded.</p><p>Meli stood before the screen.</p><p>“I will be back in twenty-four hours,” he had said. “Wait for me. Please.”</p><p>She could still feel his good-bye on her lips.</p><p>This was it. This was her chance and she wouldn’t get another. Her instincts told her that once he returned, he would mount a full assault to bring her into his life completely and she was no longer sure she could resist. She was in love with Celino Carvanna. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She had to bring it to the brutal conclusion now or forever give up on her revenge. She had promised herself at the start of the mission that she would remain strong and finish it, but she’d grossly underestimated her own heart.</p><p>It would be so easy to surrender. To simply let him carry her off, to become his. He would never have to know the truth.</p><p>Twelve years, she reminded herself. Twelve years of rejection and quiet pain, of feeling broken as if a vital part of her was lost. Twelve years of controlled anger.</p> <p>A storm was locked inside her and it was tearing her apart.</p><p>She cried and when her sobs exhausted her, she washed her face and once again faced the screen.</p><p>You can’t smelt happiness from a lie. She knew him, but he did not know her.</p><p>She had to end it.</p><p>Celino was enraged. The first time Meli had ignored his call, he dismissed it. Perhaps she was in the shower or out at the market. He was in the middle of a smoking ruin awaiting excavation of the reactor and his time was limited to a few precious seconds.</p> <p>The second time she refused to accept him, he called the man he had left watching her house. The man’s personal unit was set to Do Not Disturb.</p><p>Worry shot through him. Ignoring the explanation of the diagnostic engineers, he stole a minute of precious time to queue up the camera he had planted in the garden on his personal unit. The camera captured the door and he saw Meli move past the screen inside. He pinged her again and watched her ignoring his call.</p><p>Perhaps his man was inside. Perhaps she had invited him in. Maybe he was in her bed.</p><p>His face must’ve turned dark because people around him fell silent. He moved and they scurried out of his way, reading death in his eyes.</p><p>An hour later, when he ended the investigation and entered his aerial, he saw a notification of a private message. He locked the doors and brought it up. A “recording disabled” warning popped up—the message would play only once. He wouldn’t get a chance to keep it or replay it. “Accept,” he ground out through his teeth.</p><p>Meli filled the screen. Her hair was pulled back. She wore a grey tactical vest over grey shirt. He had no idea she owned one.</p> <p>“Your man is in the kitchen. I tranquilized him, but he should come to his senses by the time your crew gets here. I’m leaving you, Celino.”</p><p>Pain lanced him.</p><p>“This is the end. You will never see me again. A man once told me that even if he met the most elegant and refined being on the planet, he would push her aside, because he valued his freedom more. This is me pushing you aside, Celino. After years of waiting, I’m finally free of you.”</p><p>He forced himself to punch through the pain clawing at him and concentrate on her words. They seemed hauntingly familiar but he couldn’t recall if he had said them or if they were said to him. He knew he had heard those words spoken before.</p><p>“Thank you for my freedom. I will strive to never think of you again. Farewell.”</p><p>The screen went dark. He felt oddly calm. Empty. Cold. He sat before the dark screen, patiently waiting to feel something. Anything at all.</p><p>Finally a spark of emotion flared in him. He puzzled over it and recognized what it was. Hot, blinding rage.</p><p>It took him less than an hour to cover the distance that typically demanded two and a half. He nearly burned out the aerial’s engine. When he dropped out of the sky at reckless speed to land on the slab before her house and stepped out of the cabin, his crew recognized signs of danger and gave him a wide berth. Only Marcus dared to approach him. Celino looked at his face. The Anglican shook his blond head. Meli had escaped.</p> <p>Inside the house was gutted. The linen, the pillows, every scrap or fabric or cloth was gone. Her terminal was missing, removed from the wall. The kitchen lay barren, every item sanitized.</p><p>Celino found the biotech. “Tell me you have something.”</p><p>The woman shook her head. “The place is sterilized. She did a complete sweep, probably using a bioscanner. There are no traces of biologicals except for the plants in the garden.”</p><p>He growled. He’d had countless opportunities to obtain a DNA sample, but he consciously had set them aside, determined to reconstruct her secrets from conversation alone to satisfy his cleverness. Back then, he thought he had all the time in the world.</p><p>Now she had obliterated every trace of herself and vanished.</p><p>He would find her. He would find out why.</p><p>The garden flashed in his head. He had seduced her on the soft grass in the garden three days ago. He remembered sun on her face and her succulent body against the green. She smiled at him from the depth of his memory and he steeled himself against another stab of pain.</p><p>Celino strode into the garden and knelt on the patch of grass. Any liquid traces of their coupling had long vanished. He scanned the area, his vision heightened by his fury, and saw a single long hair tangled in the dahlia stems. She’d missed it. The signatures of the plants had dampened her bioscanner and the hair had gone unnoticed.</p><p>He untangled it gently, as if it were made of the most precious metal, and took it to the biotech. “Run a match against kinsman database.”</p><p>He waited next to her while the DNA sequencer purred, comparing the hair to the known families.</p><p>“Appalachi, three percent,” she reported. “Patel, seven point two. Vinogradov, four percent...”</p><p>Garbage, he thought furiously.</p><p>“Galdes, seventy-nine point one percent.”</p><p>He whipped around. The genetic makeup within the families varied to a significant degree. Anything over seventy percent was considered a definitive match.</p><p>A terrible suspicion flared in his mind. But he wanted proof.</p><p>He spun to Marcus. “I want access to the Galdes files. I don’t care how many alarms you set off or what you have to do.”</p><p>Three hours later he stood behind his best two hackers peering at the triumvirate of data screens. If he could do anything in his current condition, he could inspire fear. They had breached the security of the Galdes files in record time.</p><p>Only the top of the family would have access to an excise. “I want all outgoing transmissions from Lyon, Azare and Angel between the tenth and seventeenth.” A week’s range, extending back from the first time they met.</p><p>A long list filled the screens. “Eliminate all known Galdes terminals.”</p><p>The list shrank to a fifth of its size.</p><p>They hit gold an hour into the viewing. When Meli’s face filled the screen, he almost didn’t register that they had found what he was looking for.</p><p>“...a difficult task,” Angel said.</p><p>Meli’s eyes were calm. “No more jobs. I’ve retired.”</p><p>“This is a personal request, Meli. From Father.”</p><p>He watched her close her eyes. She carried on the conversation, waiting for something, standing absolutely still.</p><p>A smooth disk of interceptor slid from the hallway behind her. Her eyes remained closed.</p><p>The interceptor slid closer, its cannon adjusting to the target.</p><p>A translucent green ribbon struck from her, impossibly fast. The interceptor crashed to the floor, smoking.</p><p>“Good God,” Angel’s voice intoned.</p><p>“A melder,” Marcus hissed. His eyes had gone wide. “I’ve let you walk into the house of a melder without a guard.”</p><p>“You couldn’t have known.”</p><p>“I’m...”</p><p>“I don’t hold you responsible,” Celino snarled. “You couldn’t have known.” He turned back to the screen. “Replay the last ten seconds.”</p><p>He watched her slice the lethal machine in a half. Precise. Elegant. Economical in her movements. She was beautiful.</p><p>And yet she didn’t kill him. For days he had been at her mercy, but never once did she attempt to attack him. Having watched her in action, he was certain he wouldn’t have survived.</p><p>Why?</p><p>“Retina match to the Galdes personnel files,” he said numbly. “Anything with security B or above.”</p><p>Meli’s eyes filled the screen. The computer analyzed the tiny patterns, the personnel files cycled on the left and then a match filled the other half of the front screen. The girl on the screen was much younger. Eighteen at most. Her eyes shone, incandescent with hope. His rage died, frozen into a solid block of ice.</p><p>“Identify,” he said, barely recognizing his own voice.</p><p>“Imelda Anara Galdes. Daughter of Lyon Galdes, sister to...”</p><p>“Enough.”</p><p>Celino closed his eyes, rubbing the bridge of his nose with his fingers. He remembered the source of her words now. He had thrown them in her face twelve years ago.</p><p>“There are hidden files attached under her name,” one of the hackers said.</p><p>He forced himself to look up. “Bring them up.”</p><p>Two files. Engagement and Excise.</p><p>“Leave me.”</p><p>They filed out of the room, all except Marcus. “Leave me,” he repeated. The Anglican bowed and retreated from the room.</p><p>Celino sank into a chair.</p><p>“Engagement,” he said grimly.</p><p>A picture of his younger self looked at him. He scrolled past it impatiently. A list of the books from his library, each title with his personal notes. She seemed to have added her own. “Celino: liked it but the main character lacked discipline. Meli: agreed.” Next title. “Celino: garbage. DNF. Meli: tedious beginning but worthwhile finish.” By Scarlet Sails, he had written: Pure sap. She added her own note, “Celino, you’re an idiot.”</p><p>A list of holofilms, again annotated with two sets of notes. His school notes, pages and pages and pages of them. She studied him as if he was one of the ancient masters and she a disciplined devotee. She had access to his notes. She must’ve made a friend among the Carvannas.</p><p>He scrolled. A collection of recipes. A recipe for passion cones. A note scribbled with a stylus on the screen marked the corner. “Don’t forget the lemons, Meli!” He recognized his mother’s small script. His own mother had conspired against him.</p><p>No wonder he felt at ease with Meli. She knew him, intimately knew him. She’d read his notes and his ramblings and peered into his mind. Why had she done it? He searched his mind and stumbled onto the answer that shook him. She had done so they would be happy. She had expected to be his wife. She understood he would resent her and so she strove to become more than his burdensome spouse. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He scrolled past years of his school work. His financial machinations. She had analyzed these as well. On Rhomian acquisition she had written, “Brilliant. Proof that Bavani can stick his Way of Management up his arse.”</p><p>Other notes followed, punctuating the records.</p><p>“Continues to lack in patience.”</p> <p>“I can’t believe he has done this.”</p><p>“Either he’s a financial genius or a ruthless brigand, who simply doesn’t care. Perhaps both.”</p><p>He wanted to read on, fascinated, but he wanted to find her more. “Lyon’s schedule, next twenty-four hours.”</p><p>It was surprisingly easy to capture Lyon Galdes and both of his sons. They didn’t expect a brazen assault in full daylight. He had led the crew himself. They took the three men just outside Cantina restaurant. Bound and gagged, the Galdes were stuffed into the armored aerial and whisked away without an incident.</p><p>In the air he loosened Angel’s gag. “Your sister. Where is she?”</p> <p>“I don’t know,” the youngest Galdes snarled. “She was supposed to kill you. Why aren’t you dead?”</p><p>“That’s what I would like to know.”</p><p>He questioned them all in turn and once he slid open the door and held Angel by his legs upside down above a thousand-foot drop, he became convinced they were telling the truth. They had no idea where Meli had gone.</p><p>Celino had them tucked away in his compound. Thirty hours had passed since her transmission. He hadn’t slept or eaten and still he had no idea where she was.</p><p>He had to think like her. If he were her, where would he go?</p><p>It came to him finally. He took a fresh aerial from his garage and headed to Dahlia.</p> <p>The old training hall was dimly lit with portable lanterns. Four interceptors hovered, slowly transversing its length. In the center Meli stood, wearing a light T-shirt and loose pants. Her eyes were shut.</p><p>Celino stopped short of the battle line. He didn’t know how she had gotten past the guards, but nothing she did any longer surprised him.</p><p>She opened her dark eyes and looked at him. The interceptors came within censor range and streaked to her from four sides.</p><p>“I never intended to kill you,” she said. The translucent green ribbon snapped from her hand with ungodly speed and four dismembered metal husks crashed to the floor. “I wanted you to know what it felt like. Angel’s intel is always excellent. The opportunity was too good to pass on it.”</p><p>“I was cruel,” he said. “I still am.”</p><p>“I know.” She walked across the floor to the first interceptor, picked it up and tossed it into a plastic bin. She still had the same gliding smoothness to her movements that drove him wild. He trailed her on the safe side of the battle line.</p><p>“Why are you here?” she asked.</p><p>“You have my heart. Where would I go without it?”</p> <p>“Home, Celino.”</p><p>“Not without what is mine.”</p><p>She paused and looked at him with her velvet eyes. “I was never yours.”</p><p>“When I made you climax and laugh, when you fell asleep in my arms, when you smiled at my jokes and reached for me, you were mine.”</p><p>“What you think of as love are the last splashes of your dying lust. Don’t you have any dignity? Do you really—”</p><p>“—think you can change my mind by begging?” he finished for her. He crossed the battle line and strode to her, his movement stalking and sleek. He knew every inch of the old gymnasium. He was a predator in a familiar territory. She tensed as he came near and he stopped a few feet away from her. “I didn’t come here to beg. You were promised to me and I came to claim you.”</p><p>She sighed. “I’ve forgiven you for breaking the engagement a long time ago. I have never forgiven my family or yours for forcing it on us, but I’ve forgiven you. You were fighting for your freedom. I respect that.”</p><p>“Then why are you punishing me?”</p><p>“Because you wouldn’t listen to me, Celino. Had you married me for one day and divorced me the next, I would be free. I would have proof that you no longer wanted me. That’s what I had come to ask of you that night. One day. You didn’t have to consummate the marriage, you didn’t have to attend the wedding, you had only to sign the damn paper and then, twenty-four hours later, sign another. I would’ve been released. Free to choose a mate, free to make my own future, just like you.”</p><p>“You were anyway,” he said, puzzled.</p><p>“Nobody wanted me, Celino!” The ribbon struck from her hand, mincing the closest interceptor into electronic gravel. “They were afraid that one day you may change your mind, show up on their doorstep, and demand restitution for stealing your bride. You didn’t even marry. The rest of the kinsmen didn’t expect you to lay claim to me but they couldn’t ignore the possibility that you might do it. Just like you’re trying to do it now.”</p><p>It finally dawned on him. He bought his freedom with hers.</p><p>“I never meant for it to happen.”</p><p>She faced him. “I hope that you truly love me. I hope it hurts.”</p><p>“It does. I had no idea it could hurt this much.”</p><p>She snapped her wrist brace open, sank to the floor, and let her weapon slide from her hand. “Go away, Celino.”</p><p>“I can’t. If I could rip out my heart and give it to you to make you happy, I would. I’m not a good man. I’m a coldblooded, brutal, terrible bastard. But I feel human when you’re near me and I know you feel at peace in my presence. Be with me, Meli. I swear I will do everything in my power to make you happy. I will protect you. I will be your sheltered harbor. You will never have to hide from me.”</p><p>She shook her head in apathy. “You don’t even know me.”</p><p>“I know that you think Magyar’s Revenge started slow but finished well and you consider me a fool for not forcing myself to read past the beginning chapter. I know that you don’t lack in patience and that you consistently forget that the constant of standard return on the planet is 4.58, not 4.56. That’s why all your calculations differed from mine on the breakdown of Parson Takeover.”</p><p>It had taken him eight hours to reach Dahlia and he had taken a booster shot to keep himself awake so he could memorize her notes.</p><p>She glanced at him. “You hacked the Galdes database. I thought those files were destroyed.”</p><p>“I did and they aren’t. I know the details of every assassination you have ever done. They requested sixteen of you and you did eleven, all of which were retaliations for violence done to your family. I think the risks you took with Garcia were idiotic.” He knelt by her. “I also kidnapped your father and your brothers. I would’ve tortured them if I thought they knew where you were.”</p><p>She laughed softly, but without humor. “That is an odd way to endear yourself to me.”</p><p>“I never claimed to be kind or virtuous. But for you, I will be.” He swept her into his arms, holding her back against his chest, wrapping her with his body. She jerked away from him, but her advantage lay in precision, not in strength, and he restrained her with laughable ease. “I love you, Meli. I didn’t love you when you were sixteen, but I love you now. I’m sorry. I’m sorry I ruined your life. But I will help you build a new one. Be with me.”</p><p>“Let me go.”</p><p>He growled his frustration. “You’re sentencing us both to misery. In the name of what, Meli? Haven’t you been miserable enough? Wouldn’t a more fitting punishment be sentencing me to a lifetime of making you happy?”</p><p>“Let me go, Celino.”</p><p>“I can’t,” he whispered and kissed her hair.</p><p>He couldn’t force her. He couldn’t bind her to himself if she didn’t want him. His muscles tensed. He went rigid, fighting against a sharp physical need to hold her, snarled, and finally opened his arms. She rose. “I have lived with this for over a decade. You broke me, Celino. You stole my future and my family treated me like a leper. I had excised myself to escape their pity. You can’t fix it with one night of reading through my old thoughts.”</p><p>He watched her walk away and felt his heart shatter for the second time.</p><p>In the morning, Celino Carvanna retired.</p><p>Celino sat on the second-story wrap-around balcony on a large lounger couch. A reader lay in his hand. A frosted glass of tea rested next to him. Below him dahlias bloomed. Two years had passed, but he still felt a sharp spike of pain when he looked at them. They reminded him of her. He forced himself to glance at them once in a while. Perhaps he had become masochistic, he wondered, raising his gaze.</p><p>Meli stood among the flowers.</p><p>She wore a simple sun dress of vivid red. She had cut her hair. Short and layered, it framed her face in a light cloud.</p><p>She had bypassed his guards. It didn’t surprise him.</p><p>Meli crossed to the house and took the stairs up to the balcony. When she finally sat in a chair next to him, tucking her feet under her, and he caught a slight scent of citrus from her hair, he decided she was real.</p><p>“I should’ve never let them do it to me,” she said. “Even at ten, I should have known better. I should’ve never dedicated myself to becoming an accessory to you.”</p><p>“You did what any child would have done. Your parents suggested it, encouraged it, and praised you when you excelled at it. The responsibility is theirs and mine. Unfortunately, I turned out to be a self-absorbed arrogant asshole,” he said. “Both times.”</p><p>“The Carvanna finances are suffering. They are threatening to excise you, because you refuse to rescue them from themselves.”</p><p>He wondered how she had found out that bit of highly guarded information. “They also demand that I turn over my personal funds to the family to bail them out. They won’t excise me. They’re too attached to the possibility that I might change my mind and return from retirement.”</p><p>She arched her eyebrows. “Will you?”</p><p>He shook his head. “‘I’ve lost the taste for it.”</p><p>“You lie. I’ve read the INSA file.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grimaced. “It takes a special kind of worm to attempt a hostile takeover of a hospital network run by a charity. Even at my worst, I wasn’t that heartless. It was a one-time pro-bono rescue.”</p><p>A little light danced in her eyes. “And Vinderra Wineries?”</p><p>“They were going under and I’ve always enjoyed their wine. Alfonso was taken in by an unscrupulous accountant. It was simply the matter of professional pride.”</p> <p>“And the fact that he has six children had absolutely nothing to do with your involvement?”</p><p>“Precisely.”</p><p>“And the Arid Foundation account?”</p><p>“It was a pleasant diversion. I was bored.”</p><p>“Your family is quite serious, you know.”</p> <p>He shrugged. “I couldn’t care less.”</p><p>They sat in silence.</p><p>A cynical thought occurred to him. “Did my family pay you to force me from my retirement?”</p><p>“No. I doubt I could.” She smiled at him, and Celino felt his throat close. “You enjoy being the caped crusader of the financial world entirely too much.”</p><p>“I’ve served the family long enough. What I do now is my own affair.”</p><p>She laughed. “That look was pure Celino. You almost never look like that anymore.”</p> <p>“You’ve been watching me?”</p><p>She nodded and pointed to the east. “I live over there. I bought Nicola’s orchard.”</p><p>He stared at her, incredulous. “How long ago?”</p><p>“Six months.”</p><p>Fury swelled in him. She had been living next to him for half a year and nobody told him about it. Marcus had to have known.</p><p>“Why are you here?” he ground out.</p><p>“Because I love you,” she said. “I did my best to shame myself into denying it, but I can’t. I ran half across the planet and then came back so I could live for glimpses of you at the marketplace. I’m so utterly pathetic.”</p><p>“So why come back now?”</p> <p>“Because I know how excision feels,” she said softly. “I didn’t want you to go through it alone.”</p><p>She moved to rise. He covered the distance between them in a fraction of a blink and swept her off her feet, crushing her to him. The scent of citrus swirled about them, the heat of her body ignited his, and he sealed her mouth with his, hungry for a taste. She threw her arms around him.</p><p>“I’m no longer Celino Carvanna,” he said, kissing her. All that he was, all the power, respect, prestige that came with being the head of a kinsman family, he had left it all behind.</p><p>“And I’m no longer Imelda Galdes,” she whispered, her voice a breath in his ear.</p><p>“I fly to New Delphi every month to that damn eatery, hoping to see you there. I bought your house and I sit in your garden, like some sort of imbecile, hoping you’ll come through the door.”</p><p>Celino tasted salt and realized she was crying. He swallowed, pressing her tighter to him. A curious feeling claimed him, a powerful lightness. He felt strong, capable, and yet impossibly content. “I love you,” he said, his voice a raspy growl. “Promise me you won’t vanish this time.”</p><p>“I promise,” she said and kissed him back. </p> </body></html>"]