["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Savannahput down her briefcase in the immaculate powder room of Kensington &amp; Associates and straightened before the mirror. When meeting with piranhas, it was important to look appetizing but not attainable. She wanted the hunger to be there, but restrained, her opponents recognizing the attractive armor for what it was. A mask for a predator as scary as themselves.</p><p>A necessary step when the piranhas were Matthew Lord Kensington and his management team, and the subject of the meeting had yet to be disclosed. He’d simply issued an invitation to discuss a business opportunity over drinks at his office on Friday night. Knowing Matt, that meant glasses of water evenly spaced around the formal conference room table.</p><p>She checked her makeup, the arrangement of her streaked blonde hair, the smooth fit of her mid-thigh skirt and the blazer over it. While her father hadn’t believed in using blatant sex to close a deal, he’d had no problem with strategically using the arsenal one had at hand, and that included one’s looks or charm.</p> <p>She had been blessed with an abundance of the former and he’d encouraged her to use it, though always sparingly.</p><p>Geoffrey Tennyson’s Rule Twelve: People keep class and elegance around them. Trash gets thrown away after it serves its purpose.The lace of her bra was faintly visible through her white silk blouse if one looked hard enough, and she’d enjoy seeing Matt strain his eyes.</p><p>Their negotiations had always been cordial and lucrative, but she’d seen the flare in his gaze when he thought he’d pressed an advantage on her, the tightening of his sensual lips when she’d proved him wrong. She knew he loved it, how they sparred at a table and never could come away claiming anything other than a mutual victory. He craved that, she suspected, hungered to take something from her she wasn’t willing to give. It made things flutter inside her to play the game, to fence and win a draw. Often she went home aching for something nameless, something she was afraid was the desire for him to outsmart her just once, to make her surrender.</p><p>If she was totally honest, her interactions with Matt were as close to having sex as she ever got.</p><p>Savannah shook herself out of the odd direction of her thoughts, and was appalled to find the crotch of her panties damp. Appalled, but not surprised. He might be surprised though, if he knew how often she’d curled into a fetal ball between her expensive sheets, her thighs squeezed together as she thought of that hard body between her legs, pounding into her, his hands clamped on her wrists, mouth ravaging her neck.</p> <p>Perhaps it was the time of night making her think this way. A meeting at eight in the evening on a Friday turned her mind to frivolous thoughts, though she didn’t know why. It wasn’t as if she’d be doing frivolous things. While she might have planned an outing with a carefully chosen escort to a gallery showing or movie premiere, that would have been to further the interests of Tennyson Industries.</p><p>Otherwise, she’d have been home, reviewing the upcoming week’s schedule and analyzing her recent decisions for flaws or holes.</p><p>Another of the twelve rules her father had drilled into her to guide every action and reaction. They’d been posted on her bedroom wall like the Ten Commandments, ever since she was old enough to read.</p><p>Tennyson Rule Eight: A good captain never stops going over every inch of the ship. Every once in a long while she might give herself a Friday night off to watch a movie she’d rented. She’d view it from the couch in her father’s study...her study, now that he was gone.</p><p>This might have been such a night. It had been a hard week and she was feeling a bit...well, the armor was a little thin.</p><p>Even her disciplined soul wasn’t immune to the flood of anticipation that infused this Friday night with the sense of possibilities. The whole weekend stretched ahead like an adventure.</p> <p>Mardi Gras had happened this week, and this corporate tower was still feeling the powerful vibrations from the celebration as much as the streets of New Orleans. Several strands of colorful beads and a feathered mask were placed as decoration on the vanity counter. It always bemused her why her father chose to keep their corporate headquarters here, versus New York or Chicago, but whenever she asked, he’d only said that New Orleans was a place where anything was possible. He’d met her mother here, and she suspected the truth was to be found in that. She had died shortly after Savannah was born, of a virulent cancer that had been discovered while she was pregnant.</p><p>Refusing treatment to protect her unborn child, Portia Tennyson had died nearly six months after the birth of her daughter. She left Savannah a locket containing a curl of her hair and a tiny folded piece of paper, with the scent of lavender and a short message.</p><p>You were worth it.</p><p>Her father had never liked her wearing the necklace, so until his death she kept it in her bedside table.</p><p>She took a deep breath, closing her eyes. Yes, a wise captain would have chosen tonight to stay on the ship, fight the battle Monday when there were fewer titillating portents in the air. The wild desires and dreams that Mardi Gras madness stirred up like a fairy dust storm could impair her judgment seriously.</p><p>Especially with this particular man.</p><p>Regardless, she’d accepted the invitation and chosen to come alone.</p><p>She always negotiated with Matt and his Intimidation Team by herself, as if underscoring that she had no fear of any of them. Having spent most of her teen years apprenticing in Tennyson’s corporate and manufacturing offices, she had no apprehensions about discussing any aspect of the business on her own. She’d been accepted a year early to a prestigious Ivy League school, finished the coursework and passed the bar a year before her classmates. Serving the four subsequent years as a trial lawyer with a ruthlessly aggressive Washington firm her father had chosen had seasoned her enough to serve as his CFO. She’d had five years at his side in that capacity before he’d died, leaving her a relatively young but extremely capable CEO of a Fortune 500 company whose wealth and power was based in the male-dominated world of steel manufacturing.</p> <p>Plus, if the desolate truth was known, she’d become attached to working with Matt’s team on their many mutual interests. She wanted to keep them to herself. As though she’d adopted them as her family.</p><p>Or not so much like a family as something more, something even stranger.</p><p>She choked on a laugh. She was definitely off her game tonight.</p><p>Maybe Matt knew that Friday night, when the empty weekend yawned before her, was her most vulnerable time. The bastard seemed to know everything else. Their buildings, corporate high-rises, were just across the street from one another, and she wouldn’t put it past him to have planted spies in her ranks.</p><p>Well, it was her challenge to show him he wasn’t as smart as he thought he was. Then she could fill her weekend with victorious gloating.</p><p>Savannah gave herself one last appraising look. The jacket of the pale tan suit followed the shallow curve of her back, nipping in at the waist to flare out in two layers, like a modest bustle of an old-fashioned Victorian dress. The snug linen skirt revealed a teasing picture of the back of her thigh with the slit in back.</p><p>Modest and professional, even to the faint whiff of perfume, the outfit was perfectly appropriate for a woman to be wearing after five in the evening.</p><p>She’d left her hair clipped up on her head, but had loosened a few tendrils, giving her a softer look. She wanted to tease.</p><p>“Boys, you’re goners,” she decided, but she knew there was only one man who mattered.</p><p>She clipped down the hall in her slender heels, the echo loud in the quiet building. Other evidence of the festivities that had occurred earlier in the week caught her attention as she passed open office doors.</p><p>Sparkling beads hanging on doorknobs or left across a desktop.</p><p>The inexpensive plastic masks.</p><p>The security guard had indicated they were waiting for her on the top floor.</p><p>When she rounded the corner and saw the conference room door open, she had to suppress a smile. While there were no water glasses on the table, a crystal pitcher and a tray of tumblers were within easy reach on a side credenza.</p><p>Then her attention flickered to the man sitting at the head of the table, and her amusement was swept away by something entirely different.</p><p>Matt Kensington was a powerful man on Wall Street, even from the distance of New Orleans. But what made him even more potent was that he was a physically dominating man.</p><p>Over six feet tall, he had dark eyes, raven hair and a swarthy Italian complexion provided by his mother.</p><p>However, his father’s Texas roots ensured he had none of the prettiness of Italian men that could suggest weakness. Just all of their sexual charisma.</p><p>Her blood hammered harder in her arteries when she saw he was alone, not flanked by his usual four-man management team. Though, regardless of who was in attendance, Matt always overwhelmed a room with his presence. Or maybe he just overwhelmed her.</p><p>Tennyson’s Rule Two: Always be brutally honest with yourself.</p><p>Otherwise, you won’t know the difference between the truth and a lie from anyone else.</p><p>Every detail of Matt spoke of power and discipline. From his charcoal gray suit that fit his broad shoulders to perfection, to the white line of his cuffs and the gleam of his Yale class ring. Even his manicured nails in no way diminished the capable strength evident in those hands. His bent knee, visible over the edge of the table, hinted he had his foot braced on a leg of the table so he could lean his chair back. The pose was casual.</p><p>Disarmingly so. She couldn’t help it that her gaze strayed over the column of his thigh.</p><p>He rose as he always did, an act of Southern courtesy she’d teased him about with appropriate feminist acidity. He did it for all women, but somehow the way he did it for her, with his gaze locked on hers as he rose, always set butterflies in her stomach into a tailspin. He didn’t smile, those firm lips and aristocratic nose an inspiration for a sculptor trying to depict a warrior king.</p><p>It was an apt comparison. The elegance of the board room was a façade. Strip it away, make it the walls of a tent, then prop armor, shields and swords against the wall, and its nature would not change. It was the domain of a conqueror, and every time she came here, she felt it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His desire to claim, control, invade.</p><p>He’d managed the last, for he’d captivated her mind, but she could accept that.</p><p>Tennyson Rule Three: Accept your weaknesses and, if you can’t fix them, compensate for them.</p> <p>Cleopatra had been no different. She always knew she walked the knife edge between holding the reins and being the spoils of war. Savannah surmised that the Egyptian monarch had kept to the upper side of the knife by being queen first and woman second. If she’d ever forgotten that, had let her woman’s desires completely take her over, her allure to a man of power like Marc Anthony and Caesar would have been fleeting, a piece of candy consumed and forgotten.</p><p>Savannah ignored the twist of pain and fatigue such a thought gave her.</p><p>An emotional reaction, and one she wouldn’t indulge. Men like Matt sought the powerful woman, but a woman wanted a man with whom she could be just a woman occasionally.</p><p>The problem was that Savannah only wanted a man like Matt.</p><p>The chicken and egg dilemma of human nature.</p> <p>She gave a mental shrug, set her briefcase on the table. “Where are your child prodigies, Matthew?”</p><p>His wunderkind, they were called.</p><p>Lucas. Jon. Ben. Peter. The young, hungry men who supported him in the world of manufacturing, now a very dynamic area since technology changed the production playing field almost on a daily basis. They were all attractive twenty- and thirty- somethings who worked hard in the office and played hard in the gym.</p><p>She wondered if, like a wolf pack, they showered and slept together, and was instantly amused and aroused by the visuals conjured by the thought.</p><p>Yes, Savannah, you’re definitely in a strange mood tonight.</p><p>Matt had yet to speak, and there was something in his eyes. Something similar to what she’d recognized there before. But tonight it was more direct. Unleashed. For a despicably weak moment, she was glad the length of the table was between them.</p> <p>Okay, Savannah, enough daydreaming. Time to get a grip or he is going to eat you alive.</p><p>And that was entirely the wrong thought, because it summoned a flood of images so powerful they shuddered through her body. She closed her hands on the briefcase to cover the reaction, as if it were a shield she could use against his overpowering attraction.</p><p>“You call me Matthew just to irritate me.”</p><p>“Would you prefer Mr. Kensington? Or perhaps Lord Kensington?” She added the last in a saccharine tone.</p><p>It was a standing joke in the corporate circles, the use of his middle name, bandied about equally as an admiring quip or a bitter insult.</p><p>He did not laugh. In fact, he seemed to consider the notion, then his gaze centered on her in a way it had never done before. Perusing her in detail, his attention moved from her face to her throat, pausing over the frantically beating pulse, before continuing down to her breasts, the indentation of her waist, the flare of her hip, just visible to the right of the briefcase. She suppressed the urge to shift out of view.</p><p>“If you like,” he said at last. His grin was quick and unexpected. Feral.</p><p>Pure sex. And it made her focus flounder in a wash of heat. “But I think I prefer Master, or my lord, if you’re using it.”</p> <p>She blinked. “I’m sure you would.”</p><p>“While we’re on the subject, your name is an interesting one.” He seated his hip on an edge of the table.</p><p>The way he was looking at her across the dimly lit room made her feel the table was not that much of a barrier after all, and that the protection of her briefcase was laughable at best.</p><p>“It doesn’t suggest a hard-edged business woman, someone able to shrivel a man’s testicles with a glance, though I have seen you do that. Almost as often as I’ve seen you arouse my men with the simple scent of your perfume, or a glimpse of those killer legs. Particularly when you lean back and cross them so modestly, and you show just the hint of the lace top of your stocking before it’s gone, like a mirage to a man dying of thirst.”</p><p>Savannah stayed stock-still, her fingers gripping the handle of her case. “Are you making a point, Matthew, or have you lost your mind?”</p><p>“We’re discussing names, I believe, and my point is that a name very much reflects who a person is, deep inside. Savannah suggests a soft, giving woman. When I look at you, Savannah...” He paused, lingering over the name, making a flush rise on her neck. “...I see you waking up in my bed, the cotton sheets caught between your calves, that soft, luscious body molded by a satin sheath with spaghetti straps. One of those straps is falling off the shoulder, so your breast is almost completely exposed, though just not quite. And when I come to you, touch you, make you smile, all that fine, beautiful hair is rumpled and framing your face...”</p><p>His gaze flickered over the loosened tendrils that she suddenly wished she had not drawn free of her usually impeccable twist.</p><p>She pulled the briefcase off the table, a jerk of motion so he wouldn’t see that her hand was shaking.</p><p>Men did not affect her that way. “I don’t know what this is, Matthew, but it’s not a business meeting. I’m leaving.”</p><p>“Sit. Down.”</p><p>The snap of his voice caused her to jump, which made her angry, frosted her voice. “I beg your pardon?”</p><p>He straightened off the table, one lithe, quick movement, but his steps toward her were measured, the intent but slow paces of a wolf stalking prey. Or in his case, a shark, those dark glittering eyes promising no mercy.</p><p>“You heard me. Sit your pretty ass down, now, or I’ll wear it out so you can’t sit for a week.”</p><p>Shock gripped her, both at the words and at the serious intent in his eyes, which told her he very likely meant the astounding thing he had just said.</p><p>She should be giving him a disdainful look, turning and making her exit, but she couldn’t make her feet move. As if his words were a lightning bolt that had immobilized her in a crackle of powerful current that charged her entire body, all the cells vibrated with apprehension and something else, something rising in her, responding to him and his ridiculous words.</p><p>He took another step toward her.</p><p>Then another. “You drive a man to distraction. Not just the sneaky bit of leg, but that drape of neckline revealing a tiny cup of lace just barely holding your breast in when you lean forward to make a point.</p><p>The way you touch your hair just behind your ear, lightly, or moisten your lips when you talk.”</p><p>“Stop it,” she whispered. “Stop.”</p><p>But he didn’t. Not his forward movement or his words. “That’s the thing. You’re teasing my men, but you’re challenging me. From the first moment we met, you’ve known you were mine. Every negotiation has been a dare, a taunt. You want me to prove I’ve got what it takes to make you submit, claim what’s been mine all along.”</p><p>Why was her pulse pounding like she was hearing a terrible truth instead of the ravings of a lunatic?</p><p>“You’re a tough nut to crack, aren’t you, little girl?” He was almost around the table, and still she couldn’t move. His footfalls were silent, hushed in the carpet.</p><p>“Don’t call me that.”</p><p>“Oh, that’s right.” He nodded, dark brows drawing down like the shadow of a hawk’s wings. “You’re not a little girl. You’ve never been a little girl. Groomed from birth to take the reins of your father’s empire.</p><p>Daddy’s closer all your adult life, and then you stepped right into his shoes when he died. You’ve never allowed yourself to be vulnerable, never allowed yourself to be a woman, never daring to risk it.</p><p>You’ve become so good at it you don’t even know you have a warm, wet, soft pussy, aching for a cock.</p><p>My cock.</p><p>“Tell me, little girl. What would you do right now if I turned you over my knee and gave you a spanking?”</p><p>She’d gone from shock to fury, and she didn’t care what game he was playing or the fact her panties were soaked and her hands were damp with nervous perspiration.</p><p>Yes, she had a subliminal awareness of what the slit of a skirt or a glimpse of cleavage would do to powerful men, had even enjoyed fleeting thoughts of them struggling to focus, though she’d never gone so far as he had intimated. She’d never imagined the crude reality of erections distracting them under the table.</p><p>That subliminal awareness was part of the charge. Sex and negotiation.</p><p>Power. Control.</p><p>Her eyes widened at the connection, the understanding of her own body’s unexpected response. This was the same as a negotiation, only he’d taken it to a whole new level. A level on which she had almost zero experience, and he knew it.</p><p>Her eyes narrowed and her lips firmed. He’d changed the game level, but not the game itself.</p><p>She didn’t know what Matt was up to, but she’d beaten him before. She could beat him at this as well, whatever it was. Make it to a draw, with both parties satisfied. Business played the way they normally played it was as much of a rush as sex, and the line could get thin between the two. She understood that, gripped the truth of it like a lifeline to steady herself.</p><p>“What would I do if you tried to spank me? I think I’d leave a nice set of scars down that handsome jaw of yours.”</p><p>“You like to fight, don’t you? Let’s really fight, then.” His voice dropped to a rumble that sounded suspiciously like a growl. “Tear at me, leave behind the civilized façade that we pretend to have at this table. Go for it. Fight me. Because come hell or high water, I’m going to have you tonight. Take you right here in this room, and have you call me Master.”</p><p>“I think those giant balls you’re rumored to have are going to be rolling around the floor first.”</p><p>“Hmm.” One black brow now arched and the dark eyes glittered like coal exposed to candlelight. “I’ve never heard you be crude, Savannah. But you probably don’t realize that’s not really your way, do you?</p><p>You’ve been meeting someone else’s expectations so long you’ve never developed an identity of your own.</p><p>Geoffrey engineered the perfect chameleon, straight from his loins. If you’d submit to me, maybe you could find out who you really are.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Using personal insults to get a woman to spread her legs for you.</p><p>That’s a unique come-on. I’ve got things to do, Matthew. Good night.”</p><p>“You’re not leaving.”</p><p>As he loomed over her, oddly she chose that moment to notice how white his shirt was, fresh and pressed. She knew how that would smell, the clean starch of a well- laundered shirt. The smell of him beneath it. His hair was shaved perfectly at the nape and she wondered how that would feel beneath her fingertips, how those big, restless hands would feel on her body, what he could do to her with that unsmiling mouth. She could almost feel her skin prickle in anticipation of the rasp of the five o’clock shadow.</p><p>She was a chameleon. He was right about that. Tennyson Rule Four:Never show fear.</p><p>She couldn’t go around him, and she had a momentary, dangerously appealing image of a desperate feint to scurry for the elevator. She quelled the ridiculous image and the apprehension that had fueled it, and set her briefcase deliberately back on the table. She faced him, her back straight, hands at her sides.</p><p>“Fine, then. You’re right, Matthew.</p><p>We’re two adults. We have a sexual attraction. It’s obvious. Let’s relieve it. We’ll have sex, get it out of the way. I’m sure you’ve indulged the itch as often as I have on a boring Friday night.”</p><p>Coal became fuel with fire. She was reminded of that by the expression that flared in his dark eyes, even though his voice remained mild.</p><p>Dangerously so.</p><p>“That’s good, Savannah. Very good.</p><p>But I don’t want to scratch an itch.”</p><p>He closed that last step and his arm went around her waist, his other to her hair. He yanked out her barrette in a rough motion that sent her hair tumbling down, around her face and over one eye. She would have shaken it back, but he immediately had a fistful of it and yanked it, letting her feel the brute strength that was his to command.</p><p>“You won’t make any more references to anyone you’ve ever fucked. You’re mine, Savannah.”</p><p>“Go to hell,” she snapped, and gasped as his mouth came down on hers, hard, hot and hungry, his hands still tight on her hair and waist.</p><p>At the first touch, she knew she’d lost the edge. He was pure male beast, heat and superior strength. All the images she’d fantasized late at night in her lonely bed, with him as the center feature, now flooded her senses. Fantasy combined with reality to make her weak, out of control. His tongue caressed hers with a skill that let her know what he could do with it elsewhere, but he wasn’t seducing her. He was taking over, demanding unconditional surrender.</p><p>But you only surrendered unconditionally if you had no weapons left, and she sure as hell wasn’t there yet.</p><p>She bit down on his tongue, got her hands in between them and shoved at his face to break away. When she wrenched away, he tore her blouse open, revealing flesh barely confined in the shelf cups of the lacy bra, as he had described them. Savannah slapped him, used her nails with pleasure to draw blood. He caught her wrist before she could jerk back and, despite her struggles, he brought that hand back to his face, rubbed her fingertips in the welts. Taking three of the fingers into his mouth, he slowly sucked at his blood and her flesh, freezing her in place with the sheer ferocity of the gesture, the flame in his eyes as he did it.</p><p>She had known he was fit, toned. She hadn’t realized he was so bloody strong. Catching her other wrist, he swung her around and pinned her against the wall, pressing his body against the full length of hers, lifting her. As he came up against her, he insinuated his knee between hers so her snug skirt rode up at pressure of his leg. With her toes stretched to hold onto the floor, her pussy was her center of gravity, pressed hard against the muscular length of his thigh. She automatically tightened her muscles to hold her balance, and the feel of that, the close relation it had to clamping her thighs around his hips, made her breath leave her. She yanked at her wrists, her legs thrashing, but he simply held her in place. She bent her fingers back into claws, prepared to strike if he gave her the chance.</p><p>With his gaze never leaving hers, he brought one set of those sharp fingertips back to his face.</p><p>She stopped struggling, realizing she was just wasting energy she might need when he shifted his grip and</p><p>gave her another opening. It was senseless to fight him on ground where he had the advantage. She had to wait for the weak moment.</p> <p>At least that’s what she told herself, to explain why she suddenly went so still, like a frozen rabbit, as the hunter took her hand into his mouth again, stroking the tender crevices between her fingers with tender touches of his tongue, down to the palm. Down to the sensitive pulse point of her wrist. Her hand now curled over his eye and nose, her nails within a lash length of his vulnerable brown iris, and she could not make herself move. Her heart hammering against her ribs, she could only stare at him.</p><p>“This is rape,” she managed.</p><p>“No, it’s not. You’re not trembling because of that. You’re the type of woman who’d fight a mugger to the death to keep his filthy fingers off your Rolex, and just be pissed off if he pulled a gun.”</p><p>He feathered the knuckles of his free hand down her cheek, startling her.</p><p>“If there’s one thing about you that scares me, Savannah, it’s that.”</p><p>“I’m not afraid of you.”</p><p>“Yes, you are. You’re afraid I’ll make you do and feel things you don’t let yourself feel. You’re afraid if you expose your throat, I’ll rip it out. You don’t believe you can trust anyone, especially a lover.”</p><p>“We aren’t lovers, Matthew.”</p><p>“You are such a liar.” The offensive words were spoken softly, like a caress against her skin, putting her further off balance. Pressing her up against the wall, he rubbed his thigh, slow and strong, against her mound.</p><p>Her feet left the floor, his grip on her wrists her only way of staying upright, a precarious position that made her thighs clamp harder around his, increasing the pressure of her clit against lean muscle.</p><p>“We’ve been lovers since the moment we met, the first time we sparred at a conference table.” His face and lips had somehow gotten closer, so his cheek was now almost against hers, his five o’clock shadow sliding along her jawline, his breath tickling her ear. “Every offer and counteroffer has been a thrust and withdrawal, a teasing foreplay that you felt as much as I did. You think I didn’t notice when you’d lean back in your chair and cross your legs, like you were listening to me make a point, but I saw the slight tightening of your thighs. You were aroused and indulging the sensation, giving your pussy a sweet, secret squeeze.”</p><p>Savannah drew in a shuddering breath as he pressed his lips just beneath her ear, his hair brushing the side of her face. Her hands balled into fists of need rather than anger.</p><p>“Or that time you stood at my shoulder, leaning over to point out something in a report. You had your hand on the back of my chair, and your blouse fell open just a bit, like the petals of a flower, showing me that ripe breast. I inhaled the smell of your perfume, imagined you touching yourself there with the wand of your perfume bottle first thing in the morning. When I let out that breath, the heat of it touched you.</p><p>Your nipple got tight. When you straightened, I saw it pressing against your blouse, even through your bra.”</p><p>“I don’t know what you’re talking about.” She jerked her head away from his mouth and swung, knocking him smartly in the temple. Seizing his ear between her teeth, she bit.</p><p>He snarled and she twisted, thrashed, threw them both off balance. She managed to scramble off his thigh, but her heel twisted and she went to one knee. He was on her in a second.</p><p>Amazingly, she thought she heard him chuckle, but that turned into an oath as she palmed her fist and elbowed him in the chest when he tried to pounce on her. She spun to her feet and had a flash of that clean white shirt she’d admired earlier as he caught her by the hips and lifted her, maneuvering her onto her back on the slick surface of the table.</p><p>Keeping himself between her thighs, he locked her wrists down with his hands as he leaned over her, breathing hard.</p><p>The position rucked her skirt all the way to her hips and his eyes coursed over the lace thigh-highs, the swatch of white lace panties. “Class and elegance, wrapped in a fuck-me-if- you-got-the-balls package.</p><p>So what about it, Savannah?” He moved against her, and his hard cock rubbed the damp crotch of her panties through his trousers. “Have I got the balls to fuck you, make you scream for me? Whether you want to or not?”</p><p>He was taunting her, and she wanted to hate him, be repulsed by him. “I’ll scream if I want to scream.</p><p>You won’t have anything to do with it.”</p><p>She bit back a gasp as he released her wrists and caught her by the back of the neck, one large palm supporting her skull as he lifted her up against his chest, bringing them eye to flashing eye.</p><p>“You’ll scream for me, even though you don’t want to. You’ll beg, despite the fact every cell of your stubborn, rebellious mind will be telling you not to do so. Before this evening is over, you’ll belong to me, heart, body and soul, and you’ll be cursing me, even as you accept that you’ll never be free of my claim on you again.”</p><p>“Stop it, Matt.”</p><p>“No.” But his tone gentled, as if, by her use of the shortened version of his name, she had alerted him to her desperation, the sudden vulnerability that leaked through her armor and made her doubt herself.</p><p>“You know what I fantasize about sometimes, Savannah? I’m sitting at the head of that table, listening to my team give me a report on something... Hell, anything. Could be the weather in Shanghai, for all I care.” A light smile touched his lips, simple, startling her with its ease in comparison to the intensity of the past few moments. “I have you sitting on my lap, and you’re completely naked, your arms bound behind your back.</p><p>That tight little ass of yours is squirming against my cock because I’m fondling your breasts, just idly stroking the curves, caressing the nipples, pinching them, watching you get more and more aroused.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He slid his arms around her back, anchoring her against his chest, banding her to him with those long arms. His mouth took hers again. She pushed against his shoulders with the heels of her hands, but he only deepened the kiss, widened her mouth with the pressure of his, delving deep into her, his tongue exploring every moist crevice. She could have pulled his hair, twisted, done several things to buck the embrace, but being in Matt Kensington’s embrace did not suggest battle. It screamed for surrender.</p><p>Savannah ignored that path, but compromised with a momentary cessation of hostilities to experience the most potent mouth she’d ever tasted, or been tasted by. Not that she’d really tasted many, but this one had to be exceptional. She came to that conclusion from the simple realization that if there were men’s mouths more potent, there would have been reports of women dying from experiencing them like this.</p><p>When he lifted his head and they stared into each other’s eyes, his lips wet with her mouth, she could not say her body was her own. It seemed to have melted into soft pliancy against every hard curve of his, and her pussy throbbed against the hard reminder of his cock. A disturbing reminder, a return to the reality of what he wanted from her today. The impossible.</p><p>She was making more of this than there was. Her hormones hadn’t been indulged often enough, and Matt had hit the right buttons. She repeated it to herself fiercely, though her mind screamed that she had just drop- kicked Rule Two, always be honest with yourself, right out of the ballpark. Or was it Rule One?</p><p>As if he were reading her thoughts, his voice dropped to a rough whisper. “You said a moment ago you’re willing to have sex. Why are you fighting me?”</p><p>She managed a shrug, not an easy body language to pull off with her body shaking and her chest heaving with the exertion of their struggle. “If you want to fill tonight’s dance card, then I had to make sure you worked for it.”</p><p>His lips curved up in something that would have been a smile if it wasn’t so cold and deliberate. “You deny there’s anything special between us.”</p><p>It was a statement, not a question.</p><p>“That’s your arrogance talking, Kensington. Nothing is between us but lust and about a hundred million in costs in three start-up ventures.</p><p>You want me, and it’s the hunt that’s got you so worked up.</p><p>Tomorrow, when we’ve sated it, you won’t even remember. We’ll get an equal thrill from seeing that steel prices went down.”</p><p>“Then I suppose I’ll have to show you that, even though your body can be pleased in other ways, your mind and heart have only one avenue to fulfillment. I’m going to straighten up now and lay your wrists on the table on either side of you.” He unfolded her arms from her chest between them and did just that, stretching them out and placing her wrists against the smooth table surface. “I want to unfasten your bra and see your breasts. If you move your wrists, lift them from the table, I will spank you.</p><p>I’ll turn you over, pull those pretty panties to your knees and make your ass rosy with the palm of my hand.</p><p>I’ll enjoy it.”</p><p>His voice lowered, his eyes glittering with purpose. “So do me a favor and disobey.”</p><p>She set her jaw, lifted her chin.</p><p>“You’re a pig. If you’re going to do this, don’t play your sick games.</p><p>Just do it. You might be better than my...vibrator, but I doubt it.”</p><p>“Just any guy will do, if his cock is hard enough?”</p><p>She managed to keep her voice from breaking, but she suspected only a lifetime of discipline made it possible. “I’m sure you can get me off easy enough. You’ve had the practice. I’m just another Friday night paper doll fuck to you, same as you are to me. Change the hair, clothes, shoes. Same person, forgettable after it’s over.”</p><p>“I see.” With a warning glance to reinforce his earlier threat, he spread open her torn blouse. It was a back fastening bra, but he simply took hold of the piece connecting the cups in the front and tore it, holding the tension on the two separated cups so she was arched off the table. His cock, still pressed against her through his clothing, slid an inch along her panties at the change in position.</p><p>When he looked at her exposed breasts, to her shame, the nipples were elongated and erect, as if begging for attention.</p> <p>As he lifted her, her wrists slid along the table, but did not leave it, as if they were chained to the table in reality. Her hips wanted to move, to writhe against him to relieve the painful build up of pleasure vibrating along the nerves between her pussy and abdomen.</p><p>She tried to keep an indifferent look on her face, though she was perilously close to losing control completely. What she wanted to do was scream, fight him with everything she had just to get away from him and what he was doing to her. He seemed determined to take her choice away from her. Her body</p><p>and mind were getting lost beneath that intent gaze and sexy firm mouth, both of which gave her imagination a thousand ideas, just watching them as he studied her.</p><p>“I knew this would be difficult.” His gaze never left the quivering slopes of her breasts, the upward tilt of her rib cage. “And I prepared for it. You say you’ll fuck me because I’ve turned you on, but it could be me or any other guy to scratch your itch. Is that right?”</p><p>“Are you having a hearing problem?”</p><p>she retorted. “That about sums it up.”</p><p>“Then I guess I’ll have to back you down and prove you wrong.” He bent close to her. “You want me with a hunger so bad you’ll tear my flesh off my bones to crawl inside me. I know it, have known it for months, and so have you.”</p><p>“You—”</p><p>“Do you want me to hurt you, Savannah? Is that preferable to me being gentle, tender with you? Cherishing you? You won’t make me rush this. And one other thing.” She felt like a desperately cornered mouse staring into a hawk’s eyes. “I won’t let you out-negotiate me. There is no draw. Tonight you’ll surrender to me completely and give me everything I ask for. And I’ll make you glad you did.”</p><p>“You wish,” she said, more faintly than she’d intended. A light smile touched his mouth, but something else was in his eyes, more frightening than hard purpose. He cupped her face in both hands. “You can fight me, scratch at me with your nails or that biting sarcasm of yours, but I won’t hurt you, Savannah.</p><p>Except in ways that will bring you pleasure. And I’m not ever going to let anything else hurt you again.</p><p>You’ve already had your quota of pain for one lifetime.”</p><p>“No.”</p><p>“Yes. And it’s time for you to realize that.” His hand reached under her, one hand coming around her back to hold her up as he smoothly unbuttoned the top button of the skirt, lowered the zipper, his fingers sliding down the satin-covered crease of her buttocks as if they had every right to be there.</p><p>She did want to have sex with him, so why not just help him along, get it over with? Why stay rigid under his touch now?</p><p>Because he wanted more than that, and he wasn’t asking. He was taking, stripping off more than her clothes, and it frightened her in a way the physical discrepancies in their strengths did not. She understood everything about how this moment had come about, had enough of a history with him to know tonight wasn’t about rape. He wouldn’t force her if her body said no, but he had to realize, when his hand slid lower, smoothed over her pussy and found the crotch of her panties wet to the touch through the satin, that her body was screaming for him.</p><p>To hell with it. As he pulled her slightly forward to get the skirt down past her hips, her feet touched the floor. She reared up, stomped on his instep with the spike, managing to land a blow in between the side opening of the expensive shoe and the thin black dress sock, a poor protection.</p><p>He swore, flipped her and plastered his hand against the center of her back, used his weight to bear her back down onto the table. Holding her there that way while she thrashed uselessly, he bent, pulled off first one shoe and then the other, tossed them across the room. He stripped her skirt off, sliding it down over her kicking feet. Then, with a violence that dropped her stomach to her knees, he tore the remains of her blouse from her, leaving her in stockings and panties only. He stripped the bra down her arms, but</p><p>instead of taking it off, he used the garment to tie her wrists behind her back.</p><p>“Kensington, what are you doing?”</p><p>“Something I’ve been planning to do for a while. A great while, so that I planned it out to the last minute piece. I’ve heard you admire my attention to detail.” He paused, holding the pressure on her body to keep her still. “Actually, that’s my interpretation. The rumor was that you called me first cousin to the Grinch, who didn’t overlook even a last crumb for the Who mouses.</p><p>Which shocked me only because I didn’t think you’d ever been allowed to read Dr. Seuss.</p><p>“I intend to impress you with my level of detail tonight. Often, and well.”</p><p>He yanked her to her feet, turned her to face him. “But first, I’m going to explain some things to you.</p><p>Just consider this one of those corporate trust retreats where you stand on a stage and fall back into your co-workers’ arms.”</p><p>“I always hated those things.”</p><p>“I’ll bet.” He produced that sexy, easy smile again, which kept tempering these moments between absurdity, terror and wonder. “We hate them because of the hypocrisy, because we know there’s no peppy corporate organizer in the real world, inspiring fuzzy feelings in people so they’d want to catch strangers in their arms. But didn’t you despise it even more because you wanted it to be true, a group of people willing to take care of you, to catch you when you fall?”</p><p>She wished he had left her shoes alone. Standing before him in her bare feet was discomfiting, and not just because it increased the difference in their heights. It increased her awareness of his gaze traveling over her bare breasts, thrust out because of the restraint of her arms behind her back. He traced a finger along the sensitive crease of her thighs, along the lace of her white panties. She was trembling, which she also hated, so she focused on being still, standing like a statue before him, determined not to give him anything other than the responses of her body, which she could not control under his touch, and the disdain of her expression, which she could. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s good.” He reached her face at last. “You’re the strongest woman I know. But you’re going to learn you don’t have to be tough with me.</p><p>“Here are the rules. You can give up at any time, admit I was right, that I do affect you. That you’re absolutely crazy about me.” That smile grew broader, even more arrogant and infuriating. “And then, if you want, we can call it an evening. You can walk away and I’ll let you. For tonight.” That smile shifted, became more of a threat with the devastating promise implied in it. “But both of us will know I won. So, just say the word. And you’re free to go.”</p><p>She smiled back, a quick, feral gesture, and rammed her knee into his groin.</p> <p>It was a suicidal move, all in all. She was by herself, with her hands tied, with a man who physically outmatched her several times over.</p><p>Her hands were tied, her clothes scattered in tatters on the floor.</p><p>But she didn’t intend to run. She merely took one step back, threw out her chin and waited.</p><p>He’d made it a competition, and she didn’t quit or surrender. She intended to walk away with every hair in place, figuratively if not literally.</p><p>She’d call tonight an amusing diversion of sex games to his face, her sophisticated indifference intact.</p> <p>It didn’t matter that the pit of her stomach was quivering with nerves or that she was way beyond the deep end of the pool. She was in the middle of the ocean with no land in sight. A long time ago, she’d learned to mask fear, turn the energy that fueled it into her weapon. With this level of trepidation, she should be able to come up with a nuclear missile.</p><p>He’d bent over at the waist, no choice there for any man. When he straightened, he did it slow. Pure fury was in his gaze, and something else, that indefinable look again, the one that frightened her far worse than the threat of physical retribution.</p><p>“That’s not going to be enough to drive me away, Savannah,” he said softly.</p><p>He unbuckled his belt, his gaze remaining on hers. Savannah flicked her gaze over the action, came back to his face. “Well, it’s about time you got to the fucking part, isn’t it?” She tried to say it casually. “Most men aren’t into this much foreplay and conversation.”</p><p>“The cynical wisecracker. That’s the face I saw through first, did you know that?” He slid the strap free, dangled it loosely in his hand, his other hand over the fastening of his trousers. Her action apparently hadn’t dampened his enthusiasm. She could see his erection pressing against the placket of his zipper, and she had to force herself not to wet her lips. She couldn’t fight the dampening of her pussy, which responded to the sight, oblivious to her admonitions.</p><p>“But I didn’t get the whole picture until a few weeks ago. Do you know what happened then?”</p> <p>“Why should I care?”</p><p>He shook his head at her. “It was two in the morning. I was coming home from a client’s fundraiser, and I stopped at a traffic light. A diner on the corner was still open, and I looked over, thinking about getting a cup of coffee.</p><p>“I saw a girl sitting on a barstool at the counter. Wearing jeans and a sweatshirt that were too big for her.</p><p>Sipping a fountain coke, laughing at something the late-shift waitress was saying to her.”</p><p>Savannah’s throat constricted, but it didn’t matter. She wasn’t going to say anything. She wasn’t going down this path with him. This was just sex.</p><p>Rough, kinky sex, the kind she’d heard about. She could take it, as long as she stayed away from danger signs. Like the one that was going up right now, with every word he spoke.</p><p>“Something about her caught my eye, and then it hit me. The light changed and I didn’t even notice. I was looking at Savannah Tennyson, the indomitable femme fatale of Tennyson Industries, as some of my staff call you. Fondly, I might add.</p><p>When the waitress left you, you went back to playing with your straw in the Coke. You looked out the window, but you didn’t see me. There was something in your face. A softness, a wistfulness, and I realized just how lonely you really are. An incredibly independent, dynamic woman sitting alone at two in the morning in a diner, so she doesn’t have to be home during the loneliest time of night.”</p> <p>“Stop it, Matt.” Her fingers clenched against the soft fabric of the undergarment binding her wrists.</p><p>“This isn’t funny. You want to fuck, we’ll fuck. Don’t pretend you give two damns about me, just to get into my pants.” She shifted her expression to pointedly look at her mostly naked body. “You’re already there, and I’ve told you I’m agreeable. So quit the dramatics, before you piss me off and I get out of the mood.”</p><p>“You talk like you have a choice.”</p><p>She yelped as he grasped her arm. In one effortless motion he had taken a seat in a chair and pulled her down on his lap. Face down, her hips crooked over his thigh, her ass in the air, her head hanging down so she saw the bottom of the chair, the backs of his legs.</p><p>“Kensington, you son of a—”</p><p>Crack!</p><p>Total shock was her first thought, followed by the pain as he slapped her buttocks, hard. He hadn’t held back, or if he had, she sure as hell didn’t want to know what he had in reserve.</p><p>“I told you, I won’t tolerate that type of language from you. You’re not that kind of person. You won’t pretend to be something you’re not around me.”</p><p>“No, I’m the kind of person who’s going to personally shoot your fucking balls off if you don’t—”</p><p>Whack!</p><p>She was right, he did have some in reserve.</p><p>“I’ll use the belt if you keep it up, Savannah. You want to go for round three?”</p><p>“You like abusing women, Matthew?” She made her voice go cold, though she was perilously close to tears. Not from the pain. That would have been bad enough. This was something else, something the pain was breaking loose in her chest, something terrible dislodging its claws from its secure place in her vitals where. As long as its claws didn’t move, she could bear its weight. If it started moving around, stirred by whatever it was he was doing to her, she’d start screaming and wouldn’t be able to stop. What was wrong with her?</p><p>“No. No, I don’t.” His touch turned even more dangerous, for instead of punishing, it became a caress.</p><p>Stroking her abused buttocks, he traced his fingers down the crease through the panties so the fabric rippled over her tender skin. His other hand remained flat on her back, keeping her in place. “There are things I could do to bring you more pleasure than you’ve ever known, if you’d just let me. I’d make love to you for hours, let you sleep in my arms without worry. Put fresh flowers in your room every morning before you wake so they’re the first thing you see. Take care of you.”</p><p>“I don’t need anyone to take care of me.”</p><p>“I know. Which makes it all the more important that someone does.”</p><p>“Stop fu...messing with my head!”</p><p>He chuckled, and she despised her cowardice, but her nerve endings were still screaming from his last smack, and she wasn’t eager for a repeat performance. She pitied the backsides of his progeny, if he ever had any.</p><p>He continued that gentle, maddening stroking, at odds with his inexorable hold on her. “Would you like to see a recent modification we made to this room?”</p><p>“Would it matter if I didn’t?”</p><p>His arms shifted, turned her so he held her cradled in one arm. She felt small there, tucked in against him, unsettled because it was not an unpleasant place to be at all. His thumb slid under the lace edge at her hip as his hand moved up her thigh, and her breath caught in her throat at the potency of that touch. How could something so light cause such heat to spread through her blood, like an oil fire?</p><p>He removed his touch for a moment, reached under the table.</p><p>“Sit still.”</p><p>She twisted her head, startled as he slipped a Mardi Gras mask over her forehead. She had a momentary impression of its face, painted with exotic slashes of color and trimmed with feathers, before he had it seated over her eyes. Lifting her hair, he secured the band under it, so the elastic tie followed the back line of her ears across the nape of her neck.</p><p>Tassels sewn along the cheek edge of the mask fell to her jawline, caressing her face.</p><p>“What’s that for?”</p><p>“Sshhh. Spirit of the holiday. Watch this.” He reached for the table control panel this time.</p><p>She heard a whirring of gears, and the sound reminded her this room had five video conferencing monitors mounted in the ceiling that could be lowered to the eye level of the meeting attendees. As she lifted her gaze to follow the noise, she saw those were gone. What was coming down from the ceiling was a contraption of soft black straps and nylon mesh, connected to something that looked like an upholstered bench without legs, only far more narrow than a bench.</p><p>“Notice that it’s connected with wires to the ball bearings that slide along the circular track, the same system as we used for the video conferencing units,” Matt confirmed.</p><p>“It gives more options for movement.</p><p>And access.”</p><p>He was lifting her, and with her arms bound behind her back she couldn’t stop him. He made her feel weightless, as if it were nothing for him to carry her. He put her on her feet beside the table. Then his hands were on her face, making an adjustment to the mask. Suddenly she was blind, darkness covering the eye holes.</p><p>“Matt, what are you—”</p><p>“I think it’s best for this to be a surprise,” he said gently.</p><p>“No. I don’t like this.”</p><p>“You’re just afraid. You don’t have to be afraid.”</p><p>“I’m not,” she snapped. She felt desperate, like a cat squalling and clawing inside a burlap bag, knowing that she was about to be thrown into the river with nothing but a brick for company. The fear wasn’t rational.</p><p>She could tell him to stop, he’d told her she could quit at any time. But she couldn’t quit. Not in this type of game. Not with him. She swallowed, biting down on her tongue ferociously to calm herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Matthew, save your sex games for whatever bimbo you’re screwing right now and just get this over with.</p><p>I can be a lot more fun with my hands free. I’ve...got plenty of lovers who will vouch that I’m worth the time in the sack.”</p><p>She heard him sigh, and then his hand was against her back, pressing her down to the table, making her lie there on her stomach. His thighs brushed the back of hers, and she choked on feminine fear. My God, he’s going to... No, not like this.</p><p>One of the nylon straps was under her upper arm, telling her the contraption was just to her left. There was a sliding sound, a click of metal, and for a moment she thought he was adjusting the device. Then she realized he had picked up something to her right. Something he had laid on the table earlier, before he pulled her over his lap. She swore.</p><p>“Goddamn it, Matt—”</p><p>“Two things,” he said in a hard voice. “The cursing, and referring to lovers you’ve never had, and never will have.”</p><p>Snap!</p><p>The belt was like a lick of flame, striking her across both buttocks. She cried out, startled, her mind not able to keep up.</p><p>“Matt, don’t. I’m sorry.”</p><p>“No, you’re not. You’d gouge my eyes out if you could right now.”</p><p>Snap.</p><p>Her body quivered with the pain, but she clenched her teeth, even as she felt the first tear spill out.</p><p>“Why are you doing this?” She lost her resolve, her voice breaking.</p><p>“Why can’t you just...not do this? Why does it have to be like this?”</p><p>“Sshhh...it’s okay.”</p><p>His body covered hers, completely blanketing her, his legs against hers, his pelvis against her hips, the pressure of his cock firmly against her aching ass, his waist against the small of her back, his chest against her shoulder blades, his neck and jaw against her temple. For some reason, instead of wanting to bite him in retribution, she wanted to press her face into the curve of that warm male neck, feel the rough scratch of his afternoon shadow, his breath moving the soft hair along her face. She needed oxygen, or her entire body was going to decompress from the pressure. Tennyson Rule Four: Show no fear , was about to fly out the window.</p><p>“How did you imagine it would be with us? You and me?” His voice was a husky whisper.</p><p>Like you described. Forever, making love to me forever, with fresh flowers in the room...The thought was almost as shocking as her next thought. She’d also imagined it somewhat like this. The heat, the wildfire and sexual violence mixed with exhilaration. Not this tearing emotional pain. But one couldn’t come without the price of the other.</p><p>She was a negotiator, a closer. She knew the cost of the biggest deals.</p><p>And tonight was a very big deal, though she kept trying to minimize it.</p><p>Matt was ruthless at the negotiation table when he wanted to be, and he wasn’t holding anything back.</p><p>All the wildness of the past few moments faded back as a stillness settled over them, the sacred,</p> <p>unassailable intimacy of two bodies that wanted to be together, no matter what her mind denied. The press of his weight against her perversely soothed the vibrating pain of her bottom. His hand reached up, stroked back her hair, freed a piece caught in an uncomfortable position in the mask.</p><p>“Trust me, Savannah. Tell me you want me, what I’ve always known.</p><p>Then we don’t have to do this.</p><p>Just surrender.”</p><p>She shook her head. “I can’t. Please, Matt. Just...don’t.”</p><p>“No.” He nuzzled her ear, and she couldn’t help moving her cheek against the touch. “This is a deal I’m going to win, that we’re both going to win. You’ve got a lot of starved passion in your body, and I’m going to devote tonight to appeasing its hunger. And when your lust is sated, there will be only one truth, one you won’t have any excuse to deny.</p><p>There’s only one man that can give you what’s pounding for release in that heart of yours.” His hand slid down, his fingers probing beneath the crotch of her panties, making her shudder. “Your pussy knows the touch of its Master. It wants my cock buried up to the hilt in it. Before the night’s over, you’ll beg me to fuck you.”</p><p>“So you can say bad words, but I can’t,” she said petulantly.</p><p>“I said it in a way that makes your nipples hard and your mouth go soft.”</p><p>His dry chuckle reverberated in her ear. “The way you said it made me doubt you had love in your heart.”</p><p>She bit down on a retort. The cool smoothness of the table pressed against her bare upper body as he rose, keeping a palm on her back to hold her in place. He began to remove her jewelry. Her earrings, her bracelet, the ring she wore on her left index finger. He was stripping her of everything, and the quaking in her stomach acknowledged the power of it, the meaning, even as her mind refused to embrace it.</p><p>“Cleopatra at least had an asp,” she said.</p><p>“I don’t intend to drag you in chains through the streets of Rome.”</p><p>“No...” She jerked as his hands settled on her neck, on the locket. She cursed herself for the emotional reaction, but his hands gentled. He still removed it, but his knuckles stroked her neck soothingly.</p><p>“It will be right over here. I won’t let anything happen to it. I promise.”</p><p>And everyone, friend and foe alike, knew that he kept his promises. She relaxed slightly, on that point at least.</p><p>He loosened the bra from around her wrists, but before she could take advantage of that, he was replacing it, strangely enough, with a pair of gloves. He worked them over her cold fingers and she discovered from the touch of the air they had open finger holes. Lacings on the back of the right and the palm of the left allowed him to lace her two hands together so they were flat, sandwiched together at the small of her back, the knuckles of her left hand against the dip there. Then he put a set of cuffs on her wrists, as if her inability to move her fingers apart was not enough.</p><p>He shifted her quivering body onto the upholstered narrow bench piece of the device he’d lowered from the ceiling. It ran from the base of her throat to just above her pubic bone. It wasn’t as wide as she’d thought it was, perhaps about five inches.</p><p>Supporting her sternum, it separated her breasts, pushing them out so they were on either side of it. She tensed as Matt’s hands moved over her breasts, but his intention was to extend four bars, two on each side, that were apparently joined to the bench at its base to swivel out as needed. She felt a moment of trepidation when he positioned the bars at the top and bottom curve of her breast on either side, and then he began doing things with the straps in that area.</p><p>Things that compressed those bars together, holding her breasts snugly, so her nipples pressed harder against the table surface, immediately increasing their sensitivity to any friction.</p><p>“That feels good, I know, but I won’t make them any tighter. You need to have good circulation, because I’m going to have you in this for a while.”</p><p>Two extensions came out near her hips to give them a wider area of support on the bar, and then one more set at her shoulders for the same purpose.</p><p>As he made all the adjustments, she found her breath was getting more shallow, not from constriction, but from a dizziness swamping her, her arousal compounding exponentially with every action he took to make her more confined, less able to control anything. With constant gentle touches and quiet reassurances, he balanced the panic that caused, and the power of the arousal took care of the rest. It seemed perversely okay for her body to be reacting the way it wished, now that he was transferring all power and control to himself.</p><p>He increased that helpless sensation tenfold when he went behind her and produced another set of bars from beneath the back end of the bench.</p><p>She felt them extend and press against the line of her thighs.</p><p>Swallowing against a rising tide of panic and arousal, she couldn’t suppress a shiver as his fingers hooked into the delicate swatch of panties and removed them, sliding them down her legs and off her feet before he gently adjusted her knees outward. These bars had a cuff at the end of each one, into which he guided her knees. He locked the top part of the cuff at her thigh just over the knees and then slid a bar into a lock hold between the two cuffs. Her legs were now spread and held open.</p><p>“I’m going to lift your feet off the floor now,” he warned her. “Ah, sweetheart. Your pussy’s absolutely gushing. You’re loving this, aren’t you?”</p><p>She couldn’t reply without her voice shaking, and she couldn’t risk that.</p><p>Her fingers clutched one another, tangled in the lacings. Another set of cuffs went on her ankles, and then he gently bent her legs to a ninety degree angle and connected the ankle cuffs with another straight bar to the cuffs just above her knees, like the hypotenuse of the two sides of the triangle formed by her calf and thigh.</p><p>Why was she so violently aroused by being restrained? Why on earth would she, a master of controlling her life, be so completely seduced by the lack of it? She could not ask, imagining that smug look he’d have in his eyes if she admitted the confusion. Of course something this unsettling had to be a weakness.</p><p>She was sure she could play sex games with the best of them. This was no more frightening or dangerous than any hostile corporate takeover.</p><p>He’d think her stupid and naïve if she said she’d never had any restraints during sex, not even some innocuous silk scarves. But why couldn’t she stop her shaking?</p><p>She started out of her thoughts as another motor engaged and suddenly the straps were tightening across her body, the bench pressing firmly against her, taking her weight as the contraption began to retract, lifting her.</p><p>“Matt—”</p><p>“Don’t worry. I’m just moving you all the way onto the table.”</p><p>As good as his word, he stopped the motor after just a moment. Another lever engaged and she was moved forward, over the table she assumed.</p><p>An assumption confirmed when there was another adjustment downward, and he had her settled completely on the rich mahogany.</p><p>In the position which the harness system held her, she was on her bent knees, her upper body sloped downward so her cheek rested on the table, her backside exposed in the air, a disturbing and ignominious position she began to protest, but then he was touching her face, telling her he had moved to the opposite side of the table, directly in front of her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Open up, baby,” he murmured, and with his thumb at her jaw and the corner of her mouth she had no choice. The moment she parted her lips he slid a ball of soft rubber into her mouth, preventing further speech.</p><p>He strapped it securely around her head, and now she could not speak or see.</p><p>Her breath rasped around the ball in shock and panic. His hands smoothly stroked her head, her quivering back.</p><p>“Sshhh...sshh...you’re fine. You’re beautiful. Don’t be afraid. Not of this. Not of me.”</p><p>She couldn’t think of any moment she had been more afraid, but it wasn’t the sick fear she’d experienced when her father had made her ride amusement park rides that terrified her, teaching her not to indulge weakness. This fear tangled with a desire so strong she wasn’t sure she’d be capable of speech if her mouth was unobstructed.</p><p>His hands continued to caress, reassure even as he put a strap across her forehead and under her jawline, testing their fit. His touch moved to her shoulders, and he attached those facial straps to the horizontal restraint there, so her head and neck had a support to hold them up comfortably, in a physical sense at least. The inability to duck her head or shield her face in any way was somehow much less comfortable. Her backside and spread pussy were still the highest part of her body, which enhanced the feeling of total exposure and vulnerability to him. The motor engaged, suggesting he had a remote control, and her upper body was lifted up about an inch so her chin was not pressed uncomfortably on the table.</p><p>“I can adjust any part of your body up and down, to just the right height for what I want to see or do to it. Tilt the bar like a seesaw, put your hips even higher in the air, so I can see your pussy and ass better.</p><p>Straighten you up to your knees, so I can see your beautiful breasts in that parallel restraint. If you start getting a tingling or a numbness anywhere, you let me know.”</p><p>How? How on earth did he expect her to do that with her ability to speak denied?</p><p>He was behind her again, and his finger trailed down the sole of her right foot, tickling her through the sheer stocking. She wiggled the foot in reaction, curling her toes, and his low chuckle was more sensual reaction than humor.</p><p>“That’s the signal, Savannah, if you’re in any type of physical discomfort. Wiggle your right foot.</p><p>I’d say curl your toes, but I intend to give you the type of pleasure tonight that makes them curl, and I don’t want to misread you.”</p><p>His voice continued, stroking her even when his hands were not. “I had this suspension system made for you specifically. Knowing where you get your clothes custom-tailored, I obtained your exact measurements.</p><p>The length of your body overall, then from just beneath the breasts to the hips.” He caressed these parts of her.</p><p>“They made the steel bench and support extensions strong, so you’d be completely supported while you were suspended, and I talked to a master suspension artist about</p><p>pressure points to be sure you’d be fully supported, safe. We made this on our own shop floor.” His hand passed over her still smarting flank.</p><p>“We had the covering on the bench made of the softest material available, because you have such delicate skin. I didn’t want you to feel any discomfort, except for the discomfort I want you to feel. The straps are a new synthetic we’re working on for restraining people in hospitals when certain surgical procedures require it for their protection. They’re lined, made so they won’t chafe you even when you’re straining against them.”</p><p>He bent down, touched his lips to her ear. “I’ve taken away your sight, your ability to wield that vicious tongue of yours, your freedom of movement.</p><p>Not to punish you. Not to frighten you. I’d rather cause you pleasure than pain any day, though one certainly can be the avenue to the other. But I want you to feel .</p><p>Feel it all. Get past your mind, back to your heart. Because I’m there, waiting for you. I’m going to leave you no place to retreat except there, until you have to admit it’s me that you’ve wanted for months now, same as I’ve wanted you. And you’ll know why and how I knew your body would respond like this to sexual domination, to my mastery over you.”</p><p>She wanted to tell him ‘“Fuck you”, but she had neither voice nor eye contact to convey it, nor the freedom of her arms to make a suitably rude gesture. And she wasn’t sure she had the strength to force the words past her lips, even if she wasn’t gagged.</p><p>Not with her body reacting as if it was gripped by some type of overwhelming palsy, where she was no longer in control of the most basic movements or speech. Even now she had an inexplicable desire for him to stay bent close to her, where she could smell the nuances of musky male heat that her flared nostrils recognized so distinctly as Matt.</p> <p>Then, unbelievably, she heard a door open.</p><p>Chapter Two</p><p>“Good evening, gentlemen.” Matt’s voice was abruptly smooth and professional, and above her, telling her he had straightened, taking that reassuring scent further from her face. “Come in. Feel free to sample the refreshments offered on the table, remembering the rules we discussed.”</p><p>There was a whirring of gears, and Savannah felt the straps along her sides tighten, begin to lift her from the table. The upper body lifted a few more inches, the lower body much more significantly. When the gears stopped, she realized, to her horror, that Matt had lifted her up just enough so the tips of her breasts brushed the table surface. Her hips were still higher than her head, only now her knees barely brushed the table, taking away a sense of grounding. With her legs held open by the steel bar, the bench separating and displaying her breasts, she was baldly displayed to... How many pairs of feet did she hear? She realized abruptly it had to be his team, all four of them.</p><p>“Any cock will do, right?” Matt had bent down, was whispering in her ear again. “At any point, this can be over.” A cloth pressed into her open right palm and she automatically gripped it, making both sets of fingers curl over it, due to the lacings holding the two hands together.</p><p>“That’s my handkerchief, your white flag of surrender. If you’ve had enough, if you’re ready to admit that I’ve had you pegged right from the beginning, you drop it. As long as you hold it, I’m not granting you a moment of mercy.</p><p>“Whenever we do a hostile takeover, we itemize the obstacles, group them until we know how many gates we need to take to get to the prize. We’re fairly sure there are about five gates we’ll have to crash through to get you to surrender. You’re going to come often and hard tonight. Not when you want to, but when I want you to, when each of these men wants you to, because that’s our will.”</p><p>His palm slid along the side of her face, his thumb flicking the tassels of the mask along her cheek, causing the sensation of watered silk flowing across her skin’s surface. “They all know who you are, of course. But psychologically, I think the mask and the blind provide you a sense of anonymity that will give you the space to let yourself truly go. At a certain point, I’ll want you to see us, see how you affect us. But for now, I want you to forget that you think this is a battle, and just imagine what you would do if this was all, not against you, but for you. To give you pleasure, to bring you where your deepest desires, the ones you don’t even admit you have, want to take you.”</p><p>She heard his words, understood them, but all she could think about at the moment was there were four ambitious young men in the room.</p><p>Men who had put in a full day, probably starting at the crack of dawn.</p><p>Now in the early evening, ties discarded and sleeves rolled up, they wanted something to help them unwind for the weekend. And she didn’t think they were thinking of an old movie in the study and a healthy dose of ice cream like she had been planning.</p><p>“She’s beautiful, isn’t she?” Matt slid his hand up the slope of her back to her raised ass, stroked down her hip.</p><p>“There are only a few rules, if you’ll recall, and I’m going to restate them here, where Savannah can hear them.”</p><p>Rules? They had discussed this like...some takeover strategy?</p><p>“Rule number one, I won’t repeat. You heard it clearly enough before and she’s not ready to hear it right now.”</p><p>She suspected it was not the same Rule One she knew.</p><p>Tennyson Rule One,the most important one of all, the one her father had spent her entire life teaching her. There is no such thing as failure. Only quitters.</p><p>His tone altered, his words more pronounced, deliberate. She picked up the tension and could envision that shift in vocal cadence had drawn their attention from the display of her bare body in the same way wolves of the pack took their attention from a kill when the leader laid back his ears, lifted his lips in a snarl.</p><p>“You can play with her in as many and varied ways as you wish that will give her pleasure, but you can’t fuck her pussy. Understood? And if you touch her, you have to make her come. For each time you make her come, you get an extra percent share in this company, of my own stock.</p><p>The man who makes her come the fastest tonight, from the time of the initial touch, will get a five percent share.”</p><p>His hand shifted back to her head, slid down the side of her face, touching her lips, their stretched state around the ball making them even more sensitive to the stroke. She would have bitten off his thumb if her mouth wasn’t obstructed by the gag.</p><p>They were making her into a game? It was one thing to play with Matt, but if she were free now, and had known what the plan was, she would have screamed rape, torn his eyes out, done whatever was necessary to get out of this room.</p><p>Big talk, Savannah. And every word he’s just spoken has made you even wetter between your legs.Had she lost her mind? What was the matter with her? And why did it bother her so much that he was offering a stock incentive? Was she seriously entertaining an ego in this outlandish situation?</p><p>Tennyson Rule Six: The body and heart do what they please, but it is the mind’s choice to follow.So basically, it didn’t matter if her body was responding or not, her outrage could still be intact. Of course, she was aware that her attempt to use the rules of a lifetime to keep her head on straight was faltering </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>miserably.</p><p>“She’s very special.” His voice softened to a purr. “Don’t frighten her. Show her what it is to be desired and loved by more than one man, gentlemen. Take her beyond her wildest notions of desire. She’s waited a long time, and she deserves to have it done right.”</p><p>Something within her trembled hard at the words, especially when his hand tightened on her hair, reminding her that he was convinced she belonged to him, then the grip loosened and he stroked his knuckles down the inside of her shoulder blade, a sensation she hadn’t thought could be so incredibly intimate.</p> <p>“She’s never felt a man’s all- consuming passion, so strong he’d kill just to be inside of her. This is the deal of a lifetime, gentlemen.” He paused for a significant moment.</p><p>“Don’t let me down.”</p><p>Then his touch left her and he walked away. She heard him, strained her ears to figure out where he was going, suddenly panicked at the idea that he was leaving the room altogether. Instead, she heard him move to the head of the table, take out his chair. A moment later, another man’s hands touched her.</p><p>It made sense it would be Lucas, his CFO. Every breath in this room was like taking in the primal odor of a wolf’s den, and in a pack, dinner was served in pecking order.</p><p>Savannah could barely breathe around the gag in her mouth. She had gone from active trembling to a vibration that kept her shivering as if from a flu, and it grew even more intense as Lucas touched her.</p> <p>It wasn’t that any of these men were strangers. It was just that Matt had always dominated her fantasies.</p><p>In this situation, Lucas was an unknown quantity, the equivalent to a stranger emotionally.</p><p>She knew it was Lucas, for several reasons. One was that scent. Lucas wore a light cologne fragrance that reminded her fantastically enough of Egyptian pharaohs. The heat of the desert, the power of kings.</p><p>The kohl used to outline piercing eyes, aristocratic brows. Bodies inviting touch in their light robes, cuffs of beaten gold emphasizing powerful wrists and muscular biceps.</p><p>She could visual him in reality well enough, but the image that came to mind was not of him in this conference room, in office clothing.</p><p>Lucas was as tall as Matt, with a lean, athletic build developed from his primary extracurricular activity, cross-country bicycling. The pale gold of his hair spoke of the many hours out in the sun. He biked to work, a ten-mile trek, and one hot summer day she’d pulled into the parking deck for an early morning meeting at Kensington in time to see him parking the bike. He’d removed the helmet, and the hair that was a little long, just past his ears, had been casually pushed back, blond mixed with dark streaks from perspiration.</p> <p>He stripped off the short-sleeved skin-tight cycling shirt and started toweling off. She knew from casual inferences that he kept his change of office clothes in the building, but she had not known he performed this drying ritual first.</p><p>She’d sat in the front seat of her car, two rows away in the shadows, ready to duck her head as if searching through her briefcase if he looked up and caught her watching, because she could not keep herself from her inexcusable ogling. Something about watching all the sculpted muscles of that body move in the simple act of removing sweat held her motionless, her body pulsing with a rhythm that she wanted to ignore. The rhythm of wanting.</p><p>Two ladies from his office had passed by, one whistling and both engaging in some flirtatious banter with him. He’d grinned, held his shirt in front of him in mock horror as if protecting his modesty. She’d heard the other wunderkind ribbing him about the fact he shaved all his body hair. She liked the dark hair that curled at the base of Matt’s throat, intimating a nice pelt beneath his ironed shirts. However, watching Lucas towel off that smooth golden skin made her realize that women didn’t have to have just one</p><p>preference. Just like chocolate, there were many favorites to appreciate.</p><p>Savannah had wished she’d been settled enough to get out of her car, walk past him, make some friendly remark as they did, but all she’d thought of was how warm that skin would feel under her touch, what it would be like to be touched by those hands...</p><p>Well, she was about to find out.</p><p>Those strong, gentle hands were stroking her ass, lingering touches that told her he was examining her in detail from that angle. The pulse that had been jerking in her throat from trepidation settled uneasily back into the rapid cadence of arousal, the conflicting emotions keeping her body vacillating between need and nerves.</p><p>“She smells exquisite,” Lucas observed. His finger traced up the back of her thigh, to the inside, and her muscles clenched, straining against the cuffs that made closing her legs impossible. “You’ve already made her pussy wet, Matt.” Male amusement entered his voice, teasing his boss. “Or maybe we’re responsible for that. I think I’d like a taste.”</p> <p>She felt his body shift, his warm breath slide down her spine. It filtered between the clench of her buttocks, the moist heat of his mouth coming closer, closer. A moment later, his warm, firm lips closed over her clit, his hair tickling the inside of her thighs. Her head jerked against the restraint, her eyes widening at the sensation. A moan came around the ball gag, and she’d not told her vocal cords to make any such noise.</p><p>“Lick her slow and easy, Lucas.</p><p>She’s never had a man do this to her.</p><p>Let her find out how hard she’ll come under a lover’s slow touch.” Matt’s voice.</p><p>“Screw the five percent,” Lucas murmured against her skin, making her shudder. “I’d rather eat this pussy as long as I want. She’s sweet, like honey.”</p><p>His mouth lifted away and she could almost sense how his nostrils flared as he took a deeper breath, for she felt the shift of the rhythm of breath inside her thighs. She made a quiet whimper, a plea. Though she didn’t know for what.</p><p>“Do you know how much my men care for you, Savannah?” Matt asked, his voice a calming stroke of reassurance. “After the negotiations we’ve had, the long hours we’ve spent here, sometimes until the morning sun struck the office windows? We know you’ve felt the synergy among all of us.”</p><p>“It was something you did one night that made us start thinking of this.”</p><p>Lucas picked up the thread from Matt. “At about two in the morning, long after we’d all shed our coats, loosened our ties, you got up, unbuttoned the one button of the pale green jacket you were wearing, and slipped out of it. Laid it with perfect precision over the chair. Every movement elegant, ladylike. But then, you put your hand to the small of your back, kneaded it, stretched it. You raised your other hand and let down your hair. Not a calculated move at all. You just pulled the clip free, ran your fingers through it to ease the pull on your scalp, kept up that kneading on your back. You rolled your shoulders, turned and came back to the table. You had no clue how riveted we all were, as aroused as if you’d just stripped. The human woman inside the inhuman armor revealed. An armor you’ve created solely from the core of strength inside yourself.”</p><p>Stop it, she wanted to say, though she knew he wouldn’t listen, would never obey her commands the way her body was obeying the stimulation of his words.</p><p>“On our playing field, you’re a knight who obeys the same code of honor we do.” Matt spoke now.</p><p>“We’ve worked together five years, our two companies, and in the past two years, since your father died, we’ve worked even more closely together. Every man has grown to care for you, desires to protect you.</p><p>Desires you, period. When we were talking about it early that morning, Lucas made the comment that, somewhere along the way, we’d decided you were ours.”</p><p>“Like a sister, but definitely not.”</p><p>Now there was a smile in Lucas’s voice, and she heard a chuckle from the others, those who’d yet to approach her, but if Matt’s words were heeded, would be doing so soon.</p><p>“This is hard to explain, complicated,” Matt said. “But we suspect you don’t really have to hear the words, because your body already knows the truth, and your heart is close behind.”</p><p>It was as if they knew she had a desperate need for a rational explanation of what was happening to her, but the explanation they were giving her was not the one she needed to keep her insides from breaking up into pieces.</p><p>“You always come alone to us.” Matt observed softly. “You don’t want to share us. We think you consider us yours as well.”</p><p>Lucas’s breath hovered just above her hips, making her lower belly clench with need. “That may be true, but there’s only one of us she’ll let all the way into her soul. There’s only one of us she’s in love with.</p><p>And we all know it.”</p><p>His thumb followed the valley of her spine, and he wouldn’t stop telling her things her mind couldn’t digest, a combination of disorienting sensations. “I wanted to lay you down on the sofa that night,” Lucas said, his voice a rumbling purr. “Rub your back, your shoulders, until the tension went out of them, until my touch put you to sleep. I imagined you’d look like a princess lying there, your fist tucked up under your chin, your golden curls falling around your face. When you finally slept, your legs would draw up, and you’d turn on your side. There would be a gleam of dim light on your stockings, and I’d reach up under the skirt...”</p><p>His hand slid down her flank, over her buttock, to the top of the thigh- high. “...and ease them off, for your comfort.”</p><p>His hands did just that, his fingers insinuating themselves under the lace top of the left stocking, taking it down the contours of her thigh, the back of her knee, working it gently past the hold of the cuffs at thigh and ankle.</p><p>The nylon whispered over the sole of her foot. He removed the other the same way, with painstaking, breathtaking slowness. Then, barrier gone, Lucas set his lips to her calf.</p><p>She had brashly told Matt she’d have sex with him. But this wasn’t sex.</p><p>This was seduction. Matt had locked her into some strange dream. She was beyond wondering whether he really would release her if she asked him to do so. All she knew was the slow rub and heat of Lucas’s mouth on her calf. Oh God, the back of her knee. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nibbling kisses, each one like a tiny massage, arousing sensual response and emotional pain that held her in a strangling grip. Tears were moving down her face, and she didn’t know why, couldn’t stop them, and she hoped the mask would absorb them so the men wouldn’t see them roll beyond it, down her chin.</p><p>Lucas’s large, fine-boned hand was on her other thigh. He slid his hands into the cuffs holding her spread open and made an adjustment that spread her even further apart, so she choked around the gag at the sensation of increased vulnerability. His hair brushed her leg, that soft, straight hair.</p><p>“What do you put here?” He tilted his head, just the tip of his nose brushing that sensitive pocket of bone</p><p>formed between the juncture of her thigh and her pussy. The heat of his breath tickled the fine hairs of her mound, and arousal made her feel as if there were a shimmer of electrons on her skin. The room became warmer, it seemed. “It smells like baby powder, Matt,” he said quietly.</p><p>“Like she trims her pussy with a razor and soothes her skin with baby powder. And some lavender here.</p><p>Maybe lotion. I love the way women put different fragrances on themselves.” He rubbed his nose against her clit deliberately, shooting sparks of sensation straight into her womb. His mouth was so close, so close to her. She’d never had a man...do that to her, but she’d watched the movie The Big Easy on one of her “off” nights. Savannah remembered Ellen Barkin’s sensuous expressions in the scene that implied Dennis Quaid’s Cajun character was doing what Lucas’ proximity suggested. She’d sat, still and motionless in the study, her pillow hugged up to her body, wondering if the scene accurately reflected what a man’s skillful mouth could do between a woman’s thighs.</p><p>“Like a flower garden,” he said dreamily. “Something different every time you inhale.”</p><p>Without warning or hesitation, he put his mouth fully over her, his tongue delving deep within her. She surged forward, shocked by the heat of his lips and tongue, but of course with the bindings, she could go nowhere.</p><p>She could see nothing, and she found she wanted the anchor of Matt’s eyes, something to focus her, his reaction to Lucas’s servicing her with his mouth. Something that would help her keep resistance and basic lust to the forefront, but with her ability to speak removed, her eyes blinded by the mask, she could only face the reality of Lucas’s miraculous mouth and what it was unleashing within her.</p><p>He sucked on her clit, made appreciative, wet noises against her, and her hips responded, lifting and rising the infinitesimal amount permitted by the restraints, creating glorious friction, and she strengthened her efforts, following instinct to drive it to a pinnacle.</p><p>“None of that now.” It was Matt’s voice, Matt’s hand now on her back.</p><p>A more erotic stimulation she couldn’t have anticipated, to have one man’s mouth between her legs and another’s hands upon her. He did something with the waist strap and suddenly Lucas adjusted his position.</p><p>Motors hummed, and her knees left the table fully, perhaps a couple inches, so she couldn’t move in a rhythm, only sit, helplessly squirming and gasping against the gag as Lucas’s mouth returned, his tongue delving deep within her pussy again, thrusting, rolling her clit, licking.</p><p>“I can smell her, now,” Jon spoke from the end of the table.</p><p>“Same here.” Peter responded directly in front of her. “She’s got a sweet pussy, just as you said, Lucas.”</p><p>“I want her to come, Matt,” Lucas said, lifting his mouth from her just a fraction.</p><p>She shook her head. No. No... But hadn’t she just wanted that? But no, not like this, not when everything was up to them.</p><p>“I think she’s refusing you, Lucas.”</p><p>Matt’s cool voice came from the end of the table again. “Make her come in the next two minutes. Despite her best attempts to resist. Mouth only.”</p><p>“Done,” Lucas said softly, and moved in to close the deal.</p><p>She expected him to redouble his physical effort, had tensed and braced herself against it, and so was surprised when there was a pause, the noise of wheels. He’d taken a seat in a chair, pulled it up between</p><p>her legs. The fine hair over his temples brushed the inside of her thighs as he moved in close again.</p> <p>“You know...” He administered a tiny lick on her clit that made her shudder. “Eating pussy is my very favorite thing to do with a woman. I love the smell, the taste, the feel of her thighs as she sits on my face.</p><p>I love squeezing her ass in my hands as I shove her hard against me, taking away her choice, pushing her into that pleasurable abyss. I love to listen to her scream as she falls. I love knowing when she falls to the bottom, it will be my arms there to catch her.</p><p>We’ll be here to catch you,” he whispered huskily. “All of us. Stop being so afraid. Don’t you know how much you mean to Matt, to all of us?”</p><p>She made a noise of forceful and furious protest against the gag.</p><p>“Didn’t sound flattering, Lucas.” Ben spoke this time.</p><p>“One minute,” Jon warned.</p><p>“More than I need, though nowhere close to how much I want.”</p><p>Lucas put his mouth over her clit, sucking her back into the heat and wet. He began to lick her, strong, sure strokes, not too fast, pushing up against the volatile area, starting at the bottom, pushing up on it again, scoring her lightly with his teeth.</p><p>That bite and push again, as if pressuring that tight bud of flesh was like nudging a switch.</p><p>Things were happening inside her, things that defied description. A spiral of reaction that had strings drawing taut everywhere, her whole body starting to hold itself tight as if in some form of self-imposed paralysis. Her breath darted in and out through her nose, her teeth sinking into the ball. Something gathered, gathered, just out of reach. No, she couldn’t reach for it...couldn’t stop herself from lunging for it...</p><p>“Come for him, Savannah.” Matt snapped out the order. “Now. At my command.”</p><p>The orgasm exploded from somewhere between Lucas’s mouth and her pussy and erupted through her.</p><p>Going over that pinnacle, her brain reversed its will. Instead of freezing her in place, now she was wriggling gracelessly, helplessly. In her suspended restraints, screaming against the gag, she made words that could only be heard in her own mind, shocking her.</p><p>Touch me...touch me... Never stop.</p><p>She wanted Matt. But he could not hear her wish with the gag, and what little mind she continued to control told her to be glad.</p><p>It wasn’t just about the battle of wills. If she threw open the door to her heart, he could deny her. Leave her with her wishes echoing against the walls, empty and desolate, like a house where everything was gone, leaving only the harsh regret of memory. Like a child being told that little girls who ran to their Daddy to get hugs wouldn’t amount to anything except a takeover acquisition for some man.</p><p>She felt suddenly like the men in the room were all weapons turned against her, the sword of Eden, turning in every direction, shining upon her weakness, her every shortcoming.</p><p>With so little sexual experience, she didn’t know if this was normal, this flood of overpowering emotions that made her feel completely adrift on an unfamiliar ocean. Flailing, she tried to pull herself out of that darkness, onto the far more rational thought that this was similar to eating too much chocolate, or taking</p><p>one too many Valium to help her sleep. Those things made her body no longer in her control, subject to macabre dreams or frenetic nervous energy she could not rein in. It was a physical, chemical reaction. It said nothing about herself, who she was or what she truly wanted.</p><p>Lucas kept his nose and mouth pressed hard against her pussy, continuing to eat her out. Running his tongue over her clit, he dipped into the well between her legs, making a noise of pleasure at the taste of her come on those sensuous lips. His hair brushed her thighs, the planes of his face touching her as he continued the soft nibbles through the hard aftershocks. She bleated at each touch like a lost sheep, a sheep who in this moment had no doubt who the shepherd was who held her fate. She wanted to see Matt with the fervor of a dying wish, and her hand clutched into fists to keep from dropping that kerchief, from begging with her body what her mouth was thankfully prevented from saying.</p><p>No. She wasn’t that far gone. This was a whole new situation, like the first time she handled opening a plant on her own. There would be some weak moments, some stumbling as she figured out her approach to get the upper hand with the players who didn’t think she had the right to the upper hand.</p><p>There is no situation in life that cannot be explained by the same principles we use in business.Geoffrey’s voice resounded in her mind, hammering the point home. “If a person is making you feel something you don’t want to feel, take the reins away from them. If you can control yourself, you can control the situation, bring the tiller back to your hand. Keep your wits about you and wait for the opportunity.”</p><p>Sound advice, though she was certain even her dispassionate father could not have predicted this situation. And somehow, hearing his voice in her head now, thinking of applying his logic to this situation, swept her with a desolation that made her wish to be free of them all, her father and these men and Matt, in her bed with the covers over her head. And then the most unnerving thought of all intruded on the image.</p><p>What if Matt were there, putting his knee on her bed, lying down on top of her covers, curving that powerful body around her? Scooping up the covers and her into the heat and warmth of him, providing a shelter that was simply that, a place to draw strength and sanctuary, demanding nothing she was not willing to give? Or take it a step further...accepting something she’d always wanted to give but had been afraid to offer, mainly because no one had ever come right out and asked for her heart.</p><p>Get a grip, Savannah. He’s won the round, that’s it. He wasn’t proving anything except that she could enjoy oral sex, like any independent, healthy woman. What woman in her right mind wouldn’t enjoy this, even if she had been dragged kicking and screaming to it? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It meant nothing. Nothing.</p><p>Abruptly the gag was removed and a mouth was on hers, hard, hungry, as Lucas kept up with his soothing and stirring kisses along the insides of her quaking thighs. All her arguments shattered, because it was Matt’s mouth on hers, Matt’s scent filling her nose, Matt’s warm skin so close, that rough, handsome jaw that she ached to touch.</p><p>Sheer fulfillment flooded into an emptiness yawning open in her chest like a wound. His lips were the healing touch, reassuring her, yet spinning her off her axis once again so that something within her screamed in fury and desperation.</p> <p>Giving in to it, her lips pulled back from her teeth in a snarl and she bit, latching down on his bottom lip.</p><p>Instead of him jerking away, allowing her to rip and tear at him as he was ripping and tearing at her insides, his hands cupped the back of her head, holding her still. Despite her painful vise on his bottom</p><p>lip, he kept his mouth crushed over hers, his tongue plunging along her clenched teeth, his own lips persuasive, gentle. Responding not with matching ferocity, but with devastating tenderness. When his touch slipped forward to caress the sides of her throat, her cheek, she realized she had let go. The acrid taste of his blood lingered on her tongue.</p><p>“You’re doing beautifully,” he said in a whisper against her, his breath touching her cheek just below her mask. “They all love you, don’t you know that? You can’t do anything to drive us away. We’re your family.</p><p>Your lovers, your friends, the adversaries that challenge and stimulate you. Your real social life, not the theater and charity events, the occasional dinner with a man just for show.”</p> <p>She shook her head. No. She would not let this outrageous situation become that personal. She wanted an end to it, to go home.</p><p>Which meant she had to admit they had broken her, that she was as soft and vulnerable as Matt claimed she was. Capable of being hurt, manipulated. That he affected her so strongly that she couldn’t see this through to the end he had planned.</p><p>She went rigid, refused to let her body respond. After a moment, she heard a sigh, felt him draw away.</p><p>“Do you know it’s often the women who are strongest in public that most desire a man’s Mastery behind closed doors, Savannah?”</p><p>She shook her head, in protest or denial she couldn’t say, but she had no words with her body throbbing with the aftermath of the climax and the sense of loss his withdrawal caused. Lucas had pulled back as well, and now stimulation came in audible form only. Matt’s voice, hearing the shifts of their bodies around her, the rustle of clothing, the sound of their breathing.</p><p>“You have this overwhelming desire to surrender, to submit to a man strong enough to Master you. It’s like an aphrodisiac to the man who senses it. I know the exact moment I recognized it in you. It was like a punch in the gut. Or a light bulb going on.”</p> <p>She heard the smile in his voice, and cold fingers gripped her vitals. Just by speaking the word, he had evoked the memory. A memory she had replayed over and over in her mind, not understanding why it was so fascinating to her. But he had known, and now so did she, despite her strongest desire to deny it.</p><p>“I know you remember it.” His voice took her back with him to the uncomfortable recollection. “I know I do. I’ve relived it every day since it happened. It led us to this moment.</p><p>Didn’t it?”</p><p>* * * * He’d come back from the dinner break early, ostensibly to make a couple of phone calls, but there was always the possibility that he would see Savannah and could spar with her for a few enjoyable moments.</p><p>It made him frown, though, knowing he would find her in her office. She went on business luncheons, attended banquets and gala events with the right escorts, but never did he see her sitting on the edge of one of the downtown fountains, eating a sandwich and taking in the pigeons’ play, engaging in idle people watching. Or, even more shocking, out with a girlfriend, laughing, having some female conversation.</p><p>Doing some playful male-bashing.</p><p>“She’s not a woman, she’s a fucking robot,” he’d heard one competitor say. “Geoffrey Tennyson didn’t spawn her, he had her built in one of his plants.”</p><p>It had made Matt angry, and he’d made sure to scuttle the man’s plans for overseas expansion with him.</p> <p>Lucas had pointed out it was an emotional, rather than a fiscally intelligent act, and he had not disagreed with that assessment. Nor had it erased his satisfaction in doing it. He wondered often if Savannah realized she had a circle of devoted knights trying to protect her from harm when she wouldn’t even let them into the inner circle of her life.</p><p>Geoffrey was gone, and what protection the man had provided, as well as the damage he had done, was gone. She was as alone in the world as a person could get. He wanted her in his world, and she wouldn’t even give him an opening to make a move in that direction.</p><p>He rounded the corner, his peripheral vision sharpened so he could see if she was in her office. The door was open, her desk light on. And she was standing on top of her desk.</p><p>She hadn’t taken off her shoes, and he assumed it was to give her extra height to reach her objective, though he shuddered to think about her stepping on her unstable wheeled office chair in those skinny heels.</p><p>He detoured. Determining in a few strides what she was doing, he quickened his pace.</p><p>Apparently a bulb had burned out in the incandescent ceiling lighting she preferred to fluorescent.</p><p>Anal-retentive plague that she was, she was changing it herself, rather than waiting to have a maintenance person with solid shoes and a ladder do it tomorrow. She was on the ball of one foot, the other off the ground, straining, her right breast clearly outlined against the fabric of her turquoise turtleneck. The ceiling was too high for her to use one hand to steady her upper body, and as she worked to free the panel over the light fixture, she was precariously balanced. When it came free with a jerk, she overbalanced.</p><p>Matt got there in time to clamp his hands on her hips, his palms curled over the hipbones, his fingers on the soft curves.</p><p>“What are you doing? Get down from there.”</p><p>She was flustered, and he didn’t often get to see that. She backed out of his hold, and he nipped the panel from her fingers, taking it to the floor.</p><p>“I’m trying to change a light bulb.”</p><p>“I can see that. Get down.”</p><p>“I just need to—”</p><p>“Get. Down. Now.”</p><p>Instead of coming back with another sharp retort, he saw something incredible happen. A moment of confusion. Nervous tension.</p><p>Something came over him, too, an instinct, and the remarkable feeling that a door had just swung wide open. And he wanted to test it.</p><p>“You heard me, Savannah,” Matt said softly. “Come here. Now.”</p><p>It was a long moment. Then she shifted her gaze away from his, down , and moved toward his reaching hands, her neck and cheeks flushed.</p><p>Still reeling from the revelation, he almost missed his cue, but he recovered in time to take her elbow as she reached down for him. He gripped her waist and she put her hands after a brief hesitation on his shoulders, curiously docile as he lifted her clear of the chair, pushing it out of his way, and lowered her to the floor.</p><p>It was a moment before he found his voice, and he managed to make it gentle, since she was blinking at him with the startled look of a deer, not anything like the Savannah he knew.</p><p>“Don’t you attend the corporate safety seminars you torture your employees with?”</p><p>He saw the snap as the spell was broken. She even took a defensive step back, looked around herself, and that familiar disdain and faint irritation took over her features.</p><p>“We fulfill all OSHA requirements, Kensington.”</p><p>“Oh, yeah. That was definitely an OSHA-approved maneuver.” He flicked a hand out, caught a loose lock of her hair, enjoyed her look of shocked anger at the casual familiarity.</p><p>“I know you think you have to live up to your Savannah Cyborg image, but you don’t have to be and do everything yourself, you know.”</p><p>He actually saw a split second of hurt at the nickname that was used too often for her not to have overheard it countless times before. It made him angry with his clumsiness. And with her, for being so worthy of the name, but only in how she closed herself off to any advances of affection or friendship.</p><p>“You delegate administrative tasks to your assistants. Why can’t you let other people help you with things?”</p><p>He let his concern for her show, hoping to amend that inadvertent barb. “Damn it, if you’d fallen, there’d have been no one to see you fall.”</p><p>“That’s the plan,” she said dryly.</p><p>“Better to bust your backside when no one’s looking.” Some of the spunk was returning, but in the shift of her eyes, he saw she knew something significant had happened.</p><p>He wondered if she understood what she had revealed, if she even knew it about herself.</p><p>The thought brought out a fierce possessiveness in him, a desire to crush anyone who’d taken advantage of such a sweet gift. He enjoyed the many faces and forms of sex, and having an excess of alpha in his personality, he’d often let the natural Dominant in him take over with his casual lovers who liked BDSM.</p><p>The idea of exercising it in a less casual mode with the woman who’d become his obsession was so intoxicating he had a hard time keeping his cock settled in his trousers. Fortunately, she chose that moment to distract him.</p><p>“Fine.” She tossed her head, presented him with a bulb from her desktop. “You want to do maintenance, here’s your chance.</p><p>And don’t worry. I’ll stand right here and catch you if you fall.”</p><p>Typical Savannah. In the time he’d had two thoughts, she’d marshaled her defenses and reorganized her strategy. He thought if Napoleon had had her, the world would have undone the Tower of Babel and everyone would speak French now.</p><p>The Russian winter couldn’t have defeated nerve that cool. But he’d seen the heat just for a moment in her eyes, in that soft expulsion of breath as he set her down. He’d also felt the warmth of her skin beneath her clothes. Maybe she would have melted the ice in Russia, if she couldn’t match it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grinned at her, fast and reckless, enjoying her, and her look of startled surprise at his reaction. He became less amused and more absorbed as her gaze lingered on his mouth, changing the look in her eyes. Testing, he took the bulb from her fingers and had to grasp it quickly to keep from losing it as she did her best to let go before he touched her fingers.</p><p>“Careful, don’t drop it,” she admonished, a snap to her voice.</p><p>He gave her an even look, toed off his shoes and slid onto the desk. His height helped him reach the bulb with a few inches to spare, and he unscrewed it and put in the new one, blinking as it came to life in his eyes.</p> <p>“Jesus, Savannah, you could have turned off the light first.” He took the panel from her and replaced it.</p><p>“Then how would I know the bulb worked while I was up there?”</p><p>He looked down and found her staring at his feet.</p><p>“What?”</p><p>“You...” Her lips pressed together, and then he saw a corner curl up in a tiny, shy, totally out-of-character smile. “You have a hole in your sock.”</p> <p>He sat back down on the desk, brought one leg to the floor and put his ankle on his knee, blinking around the flash image still popping within the spectrum of where he focused his vision. There was in fact a small hole worn just over his big toe. Not big enough to push through, or notice when he got dressed this morning.</p><p>“So I do.” He looked up at her, at the unusual expression on her face.</p><p>“What is it?”</p><p>“I just never think of you as someone with holes in his socks.”</p><p>“Come here.” Before she could evade him, he caught her hand, tugged her over. As he did, he put both feet on the floor so she was eased between his thighs. He took his fingers and carefully raised the hem of her skirt on the right side a few inches, so she could see what he had seen when she stood on her desk.</p><p>A pencil-thin run in her stocking, starting just above the knee.</p> <p>“And I don’t think of you as someone with a run in your stocking.”</p><p>She looked up at him, but the rest of her body didn’t move. She was suddenly as still as a wild animal again, and he was even more aware of the feel of skin and silky nylon beneath the pads of his fingers.</p><p>His hand shifted, slipped up several more inches and encountered a lace top, the short skirt hem forming a folded crescent around his wrist. Her scent filled his senses.</p><p>She jerked back as though he’d slapped her when his fingers touched bare skin. Moved back so quickly she bent her heel and would have stumbled if he hadn’t straightened just as fast and caught her by the waist, a touch she threw off as soon as she regained her balance.</p><p>“The office isn’t a dating pool, Matthew. Go get yourself a one-night stand from a club like a regular guy.”</p><p>He seized her by the elbow and whipped her around so fast that the shock was still in her face when he put her up against the wall and his body against hers. His fully aroused body. She felt perfect, her little</p><p>pussy rubbing against him as she squirmed. It fulfilled his intention to let her know how she affected him, though it was more direct than he’d planned. Nevertheless, he pressed his cock harder against the juncture of her thighs.</p><p>“If you’re going to flirt,” he snapped.</p> <p>“Expect to get a response.”</p><p>“I wasn’t flirting.” She shoved at him. Panic flickered across her face as she realized what he already knew, that she was ineffective against his strength. Though she tried to mask it, he felt her shiver down through her legs and arms. “Let go of me.”</p><p>It registered like another fist in the gut. The trembling of her body, the emotion in her face, the wonder and desire followed by the panic and confusion. It was the shock of the truth, more than her demand, that had him easing his touch, gentling it.</p><p>For he was a very sexually experienced man. Enough to recognize a woman with none.</p><p>She’d never known a man, never handled his lust or accepted it into her body. Savannah Tennyson, the cold-blooded CEO of Tennyson Industries, was a virgin at the age of thirty-five.</p><p>* * * * “I can see from the way you’re holding your mouth, the tense line of that classic jaw, that you remember that night as vividly as I do. I knew a couple things after that.” Matt’s fingers sent tingling jolts of pleasure down her neck as he drew short lines on the soft skin just beneath the straps holding her head up. “That you craved a man’s Mastery, and you were untouched. And to a man like me, already in love with you, there was no way I was going to settle for less than total possession. Then came Lucas’s summation of the situation, and we know the best way to take a fortress is to trick our way in, or use a battering ram.</p><p>The only way to keep it is to win over the inhabitant, make her admit she can’t do without you. So here we are.”</p><p>...already in love with you... He said it with such simple assurance, with no guile in his voice... What did she know about love? There had never been any such ship on her radar. She had no idea what it looked like, felt like. Her feelings for Matt were sexual, a strong sexual obsession. Professional admiration warring with animosity, most of the time. And he was using his knowledge of that to take advantage of her, to make her another conquest.</p><p>She couldn’t explain why the simple telling of a story about a light bulb had made her body, so recently roused to climax, aroused again, the dampness between her legs heating with new moisture. Her nipples were so taut their light contact with the table was almost painful. But that was a physical reaction, not an emotional one. Wasn’t it?</p><p>“You want me to believe that Matt Kensington would let himself fall prey to a weak illusion like love?”</p><p>She scoffed, though she didn’t like the harsh sound of her voice. “The idea of love is only used as a weapon.”</p><p>“We’ll see,” he said after a long moment. There was a forced lightness to his voice. “Jon is going to give you pleasure next.”</p><p>His hands lingered on her face, and she felt his reluctance to leave her side. It infuriated her. The whole situation, his ridiculous, patronizing assumptions, his gall in saying...</p><p>God, why did he say that? Already in a tailspin, now she was diving out of control, all her thought processes lost, and all she could fall back on was frightened fury.</p><p>He returned to his chair, but from the creak of its frame, she suspected he’d turned away, was looking out over the panoramic view of the city. She’d gotten so familiar with his habits that, even blinded, she knew what he was doing.</p><p>It was something he did when he was contemplating something that disturbed him, and the fact that mattered to her made her even angrier.</p><p>“If you’re ballsy enough to do this to me,” she grated. “You should be ballsy enough to watch your men grope me.”</p><p>The frozen stillness that settled over the room told her the arrow had hit its mark. There was the sound of the chair again as he turned, and she imagined him laying his hands on the table. One palm flat, fingers straight, the other laid casually upon it, like a lion lying at the edge of a meadow, watching a deer with every appearance of casual regard, all the while mulling whether he was hungry enough.</p><p>She’d seen the pose, knew it elicited tremendous discomfort in his prey.</p><p>She wasn’t sure she could be even more disturbed than she was at this moment, but she wasn’t going to give him the satisfaction of thinking he’d unsettled her further, not after his declaration and his peeved withdrawal when she hadn’t fallen fawning at his feet in gratitude.</p><p>“Jon. Proceed.”</p><p>Chapter Three</p><p>“Can I have the lighting aimed at the center of the table, please?” Jon spoke, revealing that he was behind her. Directly behind her.</p><p>If Matt was known as the fearsome Lord Kensington, Jon’s nickname was Kensington’s Archangel.</p><p>Savannah remembered the first time she’d heard him speak and she, like everyone else, had done a mental double take. Words came from his mouth in such fluid, resolute tones that it was nearly impossible to imagine arguing with him over anything, even if he calmly indicated the sky had orange polka dots and grass sprang out of the ground purple.</p><p>With the inexorable strength of water, he could break down financials into their most elemental pieces as quickly as he could an engine’s components, revealing every flaw, and not use any visuals to get complicated points across. In the most turbulent conditions, Jon could bring absolute silence and attentiveness to a room the moment he began to speak.</p><p>But it was not just his voice that gave him that power. It was his expressions, his body language. He always brought to mind the words of Han Suyin: “There is nothing stronger than gentleness”. It was an honor just to agree with Jon, because he seemed to take so much joy in a person’s accord.</p><p>The others teased him, because his passion was reading enlightenment texts. Not the new age and self-help works with their generalizations and crunchy granola messages carried over from the sixties. The ancient works of Eastern gurus or Greek philosophers. He would bring up excerpts during their meetings, amusing them all, but the observations were never trite.</p><p>Savannah had noted that often those quotes served a purpose. With them, Jon gently reminded all of them that their negotiations to win more stock shares or acquire companies could never be treated as a Monopoly game. That jobs, livelihoods and</p><p>local economies were involved. He provided perspective and, according to him, helped them all keep their karma slate clean. No one disputed it.</p><p>There was a different kind of beauty to him. Slender, not tall, with luminous blue eyes and a black mane of silk that fell like feathers over his forehead and past his shoulders.</p><p>Pale, for his interests kept him in offices and laboratories most of the time. Holding a dual Master’s in accounting and mechanical engineering, he could slip from one topic to another as smoothly as he now began to touch her with the cool firmness of his hands. Down the crease between her buttocks and lower, where she was still wet and dripping from her climax, something she’d chosen to ignore until he reminded her of it. The embarrassed flush on her cheeks was something she could not stop or hide, particularly when Jon’s request was met and the spotlight warmed her skin. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Typically it was used to highlight marker boards set up on easels on the table. Now it highlighted every bit of data concerning her.</p><p>She heard his footfalls as he came around the table, the roll of the chair a moment before she felt the touch of his hands on her face. He removed the mask’s blinder section so she could see. She blinked a moment, despite the dim light of the conference room.</p><p>“Savannah, I’m so glad we decided to do this.” In his magical way, he almost made her feel like she’d had a hand in planning the evening. “I’d like to do something to give you pleasure, something I’ve invented.</p> <p>You’ll be the first woman I’ve tested it on, and I’d like your permission.”</p><p>His long, clever fingers stroked her forearm, making her shiver.</p><p>She was wrong. She had fantasized about these five men, in one way or another, for months. Matt had always been central, but they’d been steamy appetizers. They’d been her sex life, all in the realm of her mind.</p><p>What does it do?Her eyes asked the question she couldn’t bring herself to ask. Of course Jon read it easily.</p><p>Every man in the room was an expert at reading body language. Even with the gag, they’d likely understood her every wish. Though Matt alone seemed to have a clear window to her darkest fears, with no curtains to keep out his shrewd gaze.</p> <p>“It brings a woman to climax almost immediately, and keeps her there, through programmed adjustments of the angle, for a prolonged period of time, to satisfy her fully. It stimulates her between the legs and the buttocks both.”</p><p>“I’m not sure. I’m... I’ve never... done that.” She’d actually never done any of this, but she’d never contemplated anything in that back area, even in her fantasies. She didn’t know if that was naïveté or revulsion, but she didn’t feel revolted about the idea now. Just nervous.</p><p>“It will be very gentle,” he promised.</p><p>“Not invasive at all. And I’ll stop if you want me to stop.”</p><p>It was strange, feeling as if she were alone with him, but at the same time being aware of the others that were listening. Of Matt in the shadows, watching over it all, his presence a pulsing awareness in her body.</p><p>He’d known Jon would be perfect at this juncture, after that first hard climax. To slow her panic, after having lost her infamous control. The handkerchief was in a ball in her sweaty palm, her fingers clutched tightly on it, as if her subconscious was afraid she’d drop it by accident and be misunderstood.</p> <p>She’d seen Matt choose a moment of intense conflict to have lunch brought in by a pretty, cheerful office assistant, diffusing tension. Or he’d suggest a break, and they’d adjourn to the roof garden to enjoy the spectacular view of the city. It changed the moment, made his opponent feel cozened, good about giving Matt and his team nearly everything he wanted. He did it so strategically that the calculation was obscured. Even recognizing it, she felt its effect stealing over her own senses, as if that emotional part of her could care less about what her rational mind knew.</p><p>She could set him back on his ass by denying Jon now, but she was curious, extraordinarily, intensely so, about what Jon had devised.</p><p>It was as if her body, so long suppressing its enjoyment and exploration of physical desires, now could not get enough. A lever had been flipped, suggesting she could safely do and explore everything tonight.</p><p>Had Matt known that? Provided her a unique way of losing her virginity? And when that moment came, would it be him, in front of all of them? Or would it be all of them?</p><p>Somehow, despite the titillation that such a thought should cause, based on how aroused she was, the idea did not please her. She could not block the vision that rose within her of more private desires. Just her and Matt, the ruthless hands becoming gentle, the weight of his body bearing her down, taking her into its shelter...</p><p>She reined back that thought. It didn’t matter if it was him, or the whole group. In fact, there was no reason to get emotional about this situation at all. Tennyson Rule Eleven: Unpleasant experiences at the hands of your enemy become lessons to turn against him later. While she wasn’t certain she’d call this an unpleasant experience, and Matt was an unpredictable business partner versus an outright enemy, she’d known her physical innocence combined with her looks was a handicap in an industrial world dominated by men. She’d put on a good façade, and managed to do well enough without full understanding, but by losing her innocence here tonight, in these many ways, Matt was really doing her a favor, giving her a leg up.</p><p>“I really want you to be the first woman to try it,” Jon repeated the appeal.</p><p>“But I just...climaxed.”</p> <p>“It won’t matter,” he said. While she’d been subconsciously aware for some time of the sexual undercurrent between herself and all of them, seeing the desire unmasked in his direct gaze slammed it home so that she could not draw a deep breath under the intensity of it. “That’s its magic. By the time I give you the full setting, your body will be more than ready, and when you come...” That light smile touched his lips. “Let’s just say we could go through the entire first quarter financial report and you wouldn’t hear a word of it.”</p><p>It was an intensely erotic image. Her body, writhing and straining through climax after climax in the center of the table, while business was conducted as usual. Only she could vividly imagine the way that the words would drift off to silence, into a sexually charged stillness as the attention of every male was absorbed by her display. Their bodies, so marvelously different from a woman’s softness, becoming even more hard, aroused, waiting to be unleashed.</p><p>The way this team interacted during meetings to go over market trends, cost analyses and production reports often reminded her of a dinner scene from Seven Brides for Seven Brothers . Ben gesturing with a carrot stick off the vegetable tray, making a side riposte, Lucas coming back with a quelling retort and then continuing his point with barely a break in stride. Peter pacing, working the latest MENSA-level brainteaser in his hands as he considered the issues of contention and fired thoughts from different sections of the room. Matt interjecting a vital piece of information, seemingly out of left field, but which tied everything together. Jon smiling at them all and working the numbers.</p><p>As their latest cooperative ventures had required more and more frequent meetings with her, they’d included her in the banter, in such a natural way that it had taken her awhile to recognize the tone of her inclusion was somewhat different, low-level flirting dynamics. Something she found she liked, even if she parried it with appropriate cynical retorts.</p><p>She’d enjoyed being surrounded by them so often, being the one-woman beneficiary of their mingled scents, voices, the feel of their heat and strength around her as palpable as physical touch. Once, she’d even caught herself letting out a breath when she sat down among them, as though she’d arrived somewhere she could relax. Be at home.</p><p>“That might be a bit distracting, to all of you.” Her voice shook with nerves. “You could miss a crucial piece of information, lose your advantage.”</p><p>“We could at that.” His lips curved.</p><p>“Maybe we’d make you participate, get you to go through your numbers with us, answer our questions. See if we couldn’t catch you in a mistake, make you lose that infamous cool of yours.”</p><p>“I’d hardly call it infamous.”</p><p>“Honey, you don’t know the half of it.</p><p>Don Blatovsky said you were ice from inside out, though he put it in less than flattering terms.” Jon’s eyes took on a gleam. “Which is why Peter utterly destroyed him in racquetball.”</p><p>There were a series of chuckles around the table, male sounds of satisfaction that made her feel... protected. Championed.</p><p>“Plus, he didn’t have this crucial bit of information.” Jon leaned forward, bringing his face close to hers as his hand slid across the table, under her suspended body, and found her pussy.</p><p>He dipped into her heat and wetness, making her gasp. “There’s no ice here. In fact, there’s heat enough to burn.” He smiled at her from inches away, those glowing eyes dominating her vision. “I’m waiting for your answer to my original question.”</p><p>She had to struggle to remember. “I’d like to try it.” Then, because it made her feel raw to see the warmth in his eyes, and sense the pleasurable approval of all men at the table, she added, “Maybe I’ll buy the first one off the line. The Who-Needs-A-Man vibrator.”</p><p>Jon withdrew his hand, brushed his knuckles over her cheek so she smelled herself on his skin. “Honey, I’ve never seen a woman who needed a man more than you do. You’ve needed one your whole life.”</p><p>Before she could fashion a reply to that appalling and confusing statement, he had removed the device from his suit pocket. After all that talk, she would have expected a complicated design. Instead, it was innocuous and sleek, and appeared to have three main pieces. An oblong disk of a soft material, a curved shaft, and a circular piece about the size of a silver dollar. The circle looked like a tiny wagon wheel, with a short, thick piece of rubber as the hub and a pinwheel of silver spokes. A network of slim straps tied the whole thing together.</p><p>He laid it on the table before her and rose. Placing his hands together before his chest in an attitude of prayer, he bowed, nearly touching his forehead to hers, then straightened. “I see the divine in you, the face of love, and I honor it.”</p><p>At her curious look, he gave her his angelic look. Not quite a smile, but then the expression didn’t need it to convey the same delicious feeling inside of her. “That’s the namaste.</p><p>It’s from Hindu culture, used in various ways, but in Tantra it’s a way to begin lovemaking, a reminder that coming together with a lover in true sexual intimacy is a way to spiritual development.”</p><p>The knowledge he gave her of its meaning caused that delicious feeling to spread out through her torso into her limbs. It should have seemed incongruous to be restrained the way she was and yet to feel so suddenly... cherished, but she couldn’t deny the reaction. Lucas’s mouth on her body, Jon’s quiet approach, even Matt’s watchful regard abruptly became something else. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This night, for all its volatile moments, had the quality of a ritual.</p><p>And suddenly she felt like the center, like she was being worshipped, an incredible thought that she nevertheless could not deny.</p><p>“I was trying to resolve how to stimulate and please a woman in all her most erogenous areas at the same time, without overloading her nerve endings.” The inventor part of his personality took over and she was almost amused to see it in his body language. “I want to incorporate some stimulation to the nipples eventually, but right now I wanted to keep it to the areas below the waist.</p><p>Matt, if you could come and help me?”</p><p>An involuntary ripple of need surged through her as she heard Matt leave his chair, move behind her. Jon gave her cheek a reassuring caress and then joined Matt, where she could not see them.</p><p>“Touch her here,” Jon’s voice said softly. She quivered harder as Matt laid his palms on the curves of her ass, his thumbs inserting between them and then spreading her open, causing her breath to catch and hold in the back of her throat while a hard spasm of sensation rocked through her, like an aftershock of climax.</p><p>“She likes it very much when you touch her, much more than when we do. Hold her open like this.”</p><p>Such a simple, truthful statement from Jon, no slyness. Almost as if he were trying to reassure Matt. Did Matt need such reassurance?</p><p>“I don’t want her hurt.” Matt’s voice was rough, odd. “Is that lubricated enough?”</p><p>“It is. She’ll feel nothing but pleasure, I swear it. Savannah, what you’re feeling now is my finger. I’m very gently placing some lubrication in your anal passage. I’m only going to be putting some pressure on your sphincter, not going all the way in, but I want you to be comfortable.”</p><p>There was a gentle, rubbing sensation around the rim that made her buttocks tremble under Matt’s grip.</p><p>Instinctively, she lifted toward Jon’s touch. God, it felt...good.</p><p>“Now, let that breath you’re holding out slowly, for a count of five. One, two...”</p><p>She followed his direction, and felt something rounded, smooth and slick ease into the opening of her rectum.</p><p>Not deep, as he had said. It just stretched the opening, made her want to squirm with the stimulating sensation. He’d seated the short rubber hub in her passage, she realized. The “wheel” was placing the firm pressure against the rim of the opening.</p><p>“While many women enjoy getting fucked in the ass, the sensation is ninety percent psychological and</p><p>ten percent stimulating the opening,”</p><p>he confirmed her reaction. “With a device like this, therefore, I’ve focused on the sensitive nerves there.</p><p>Plus, we agreed your ass would be Ben’s specialty. Just like your breasts are Peter’s area of expertise.”</p><p>Savannah froze at that remarkable statement. “Don’t worry.” Jon’s hand stroked her back. “You’ll love having him there, and this, as well as Peter, will help you prepare for him.</p><p>Now, Matt, with your permission, I’d like to take it from here. Savannah, this next piece will stimulate your clit. “ Jon’s long fingers slid up her thighs.</p><p>With her legs spread apart, she felt the trepidation again, but no one had hurt her yet, physically, and she decided to rely on the empirical data she had and tried to relax.</p> <p>“Good girl,” Jon murmured. His fingers moved under her, past the pussy. The material of the oblong piece felt like good quality linen, now viscous with some type of adhesive. He completely hooded her clit, pressing firmly, making her breath rasp as the two sensations twined together and pulled pleasurable tension down even lower in her stomach. “The adhesive is a warming oil, so it won’t feel much different from your own fluids after a moment, and it’s fragrant, a vanilla smell to make it pleasant to your nose, though I personally prefer the smell of a woman’s aroused cunt to any other scent on earth.”</p><p>He withdrew and shifted, placing the flat of one palm against her lower back, just at the rise of her buttocks.</p><p>Something touched the opening of her pussy, the shaft piece, she realized.</p><p>“Now, the phallus.</p><p>It’s up to you how deep I’ll go. I don’t want to break anything that’s not mine to break.”</p><p>It took her a moment to understand, then she gave a nervous half laugh.</p><p>“The gynecologist took care of that years ago.” She felt shy about saying it, but she did it, forcing herself to try and be as sophisticated as they were being about all these things she’d never done, things she’d never even realized could be done.</p><p>“Just...don’t go any deeper than you know...you know.”</p><p>“All right, then. You tell me if I cause you a moment of discomfort.” There was the glide of something within her opening, and then pressure. She tensed. Jon immediately stopped, his palm obviously on her back to register such a reaction. “I think an additional distraction might be good.</p><p>This is low setting.”</p><p>Savannah sucked in a breath as current ran through the hood over her clit and through the pinwheel. The oblong clit piece hummed against her in a wave rhythm, like experiencing a tongue and a vibration at once. And the anal piece...there were tiny electrons of sensation leaping all over there. She couldn’t track them all, but it robbed her of the ability to retain any control over her voice. She was making soft moans of pleasure, unable to stop herself, and she wished for the gag, so the embarrassing noises would be muffled.</p><p>Jon eased the phallus in on one of the tiny undulations she could not help making, and seated it against a dense spot that reacted immediately, almost spasmodically, to the touch.</p><p>“Perfect. God, you’re perfect. That’s it, honey. The current goes through the spokes of the wheel and all around the rim, and there’s a different rhythm pulsing through the hub, the part that’s inside you. It’s key to the whole thing, because the flow and speed of the vibration alters constantly in all three pieces, so they keep stroking you, over and over, but in different ways. When you finally go, that lack of consistency will prolong the orgasm, much like when a man changes the angle of his cock during lovemaking between the clit and G-spot.”</p><p>She knew nothing of those things, only that his words were goading her further.</p><p>“Jon,” she gasped.</p><p>“Hang with me.”</p><p>Being an engineer, and therefore very detail-oriented, he was making some more adjustments. His hands moved quickly over her now, and she felt the satin ribbons of the straps tighten over her thighs, between her legs, so the components were held firmly against her anus and in her pussy. The clit piece was left alone, and its greater freedom to vibrate against her made all three sensations even more excruciating.</p><p>“Oh, God...” She was so close. It was going to be hard and intense, more than she could handle, but she wanted it, craved it like the relief of an excruciating pain being taken away.</p><p>Jon wasn’t in the mood to let her go so quickly. Abruptly, the vibration stopped.</p><p>“No,” she blurted out. “No. ”</p><p>Matt stepped into her field of vision, his hand cupping her face, his expression dangerous with brutal male desire, telling her he was not there to soothe, but to see her agony.</p><p>With no outlet for her passion, she bit him anew, this time his palm, too wound up to exercise restraint. She tasted his blood again and reveled in it, the taste of life.</p><p>He growled in response and buried the fingers of his other hand in her hair, but not to yank her away. In the same instinctive way she knew how to breathe, she knew he wanted to grip her with such brutal force at this moment, make her feel his dominance over her. She snarled against his flesh. It eased the grip of her jaw and he drew the hand back, showing her that she had marked him. She wanted to mark him everywhere. That gorgeous chest, flat abdomen, hard thighs, his feet, his...</p><p>“Start taking her up, Jon,” he muttered.</p><p>“Five minutes at low setting,” Jon responded behind her, his voice thick with his own reaction. His hand slid over her buttock, squeezed hard and she whimpered at the bolt of electric reaction. Matt’s spanking had made her hypersensitive there, in a way that made pain irrelevant. Pain or no pain, it was all pleasurable. “That will build her reaction, make it even more intense.”</p><p>The three pieces activated again.</p><p>They weren’t just vibrating. The dildo began a slow, measured stroking, like a man’s cock must, only still not deep enough, making her want to struggle, pull it in, even as the terror of what that desire meant swept through her.</p><p>Matt stepped back, though his attention never left her face, and then he was outside the range of her vision. She could feel him to the left of her, and Jon was before her again.</p><p>With his beautiful face, the long sensitive fingers, the curve of his mouth, Jon would never need a device such as this to get a girl to go to bed with him. But with it, women would elevate him to the stature of a god, bow down and worship him. At the moment, she’d cheerfully volunteer to be High Priestess of the cult of Jon.</p><p>“Now,” he continued. “Before I raise the setting, I’m going to put the gag back in your mouth. I want something seated on your tongue to keep you from biting through it, though I’d love to hear you scream for us. I’m going to draw up your head a little higher, because we all want to see your face.</p><p>That will enhance the sensation of your bondage, your slavery to us, to Matt.” At that amazing statement, one she would not have expected from Jon, he put his fingers along her cheek again, pushing the ball gently against her teeth. “A most cherished slave. One we couldn’t do without.</p><p>Open up, honey.”</p><p>She didn’t have much choice with her head held rigid and his thumb cleverly inserting into the hinge of her jaw, making her obey.</p><p>“Put her on display in the center of the table so we all can enjoy watching her reach climax again and again,” Matt commanded.</p><p>The gears whirred at the far end of the table and the mechanism began to lift her even higher into the air and move her forward, toward the center. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With her knees and ankles connected by the straight bars, and the cuffs holding open her thighs, her legs remained bent and spread, as if she were on her hands and knees, only she had her hands bound behind her back, her head slightly lower than her raised hips. She felt the table recede, and when she came to a stop, the heat of the spotlight told her she was about three feet above the table, allowing the men in the room to examine her from every angle, including the parts of her stretched by Jon’s wondrous torture device. It was demanding even now that she twitch her hips in futile attempt to establish a rhythm with the three alternating pumping, stroking and vibrating currents, all individually tailored to maximize response from the three erogenous zones. She couldn’t move much, but the little amount she could her body was using, making her feel the weight of her breasts quivering with her shameless, involuntary movements.</p><p>“Matt, I’m ready for my turn.” Peter’s voice came at her from the table level, suggesting he was sitting just to her right, just below her breasts. “I want to suckle those pretty tits and make her come just from that alone.</p><p>Jesus, she’s built. “ There was a hoarseness to his voice, the savagery of desire, and she felt it pushing on her from all sides, every man’s need in the room swamping her, mixing with her own arousal until she could think of nothing so exciting as being buried beneath them all, helpless beneath their hands, mouths...cocks. What would it be like to taste each of them, feel one or more of their cocks stretching her mouth, while the others shoved into her wherever they could find an opening?</p><p>Did she really have that thought? “All in good time. Lucas.” Matt’s voice filled her like the warmth of a promise. “Give her some visual stimulation.”</p><p>“With pleasure.”</p><p>She was turned on the track, rotating like displayed artwork. She was stopped when she faced Peter and Ben. Peter’s gaze devoured her breasts in a way that made them tremble and ache. Just beyond the two men the panels of the wall slid back as Lucas operated a switch, revealing a grid of twelve screens, which Matt and his team used to monitor different stock markets and news channels at once, as well as manage video conferences.</p><p>The dozen different images that flickered to life now were montages of her recent experiences in this room. She saw not only herself, but the men when she had not been able to see them. Lucas’s expression as he had run his palm down her back.</p><p>Peter, watching her strangled cries with rapture on his face. Jon, placing the devices within her most private areas with quiet capability, his lips firm with concentration.</p><p>Matt. His eyes intent, flamed with raw passion, presumably while Lucas went down on her. His quick, predatory strength as he tied her, then stood over her while she lay flat on the table. There was an expression on his face at that moment that she did not dare give a name, because it had no place in this room, she was sure.</p><p>Definitely not lodged in her heart like an arrow.</p><p>She wished she had the blindfold back, or that the straps holding her head were not so relentless, as she saw images of herself. From the back, her buttocks clenching as Lucas’s blond head worked his magic between her thighs, the pale line of them on either side of his face, the pink soles of her feet outside his shoulders. Then a shot after she had been fully restrained in the harness and was listening to the entry of the men. The press of her lips not just suggesting trepidation, but sensual excitement.</p><p>Jon doing his namaste to her, the easing of her jaw revealing her change in feelings at that moment.</p><p>Embarrassing close-ups when he placed the items against her pussy and anus.</p><p>But the worst was a clip from the beginning, when she was still mostly clothed. Matt’s first kiss, her body visibly softening into his as his hands wandered possessively down her body.</p><p>“Waiting five minutes like this, doing the low setting, is also a Tantric practice,” Jon said seriously, behind her again. Heat rose in her face, because now she knew exactly what he was looking at. Her attention was caught by Ben’s gaze, his eyes the color of green sea glass, multifaceted, jewel-like, a rich compliment to the sculptured jaw and firm, unsmiling lips.</p><p>Out of all of them, she knew the least about him, Matt’s legal pit bull.</p><p>Remembering what part of her body Jon had said was reserved for him, she flicked her gaze nervously back to the screens, not able to handle any greater level of anxiety at this moment. She focused on the comparatively soothing quality of Jon’s voice instead.</p><p>“Prolonged pleasure makes not only the climax but the spirituality of the moment even more intense.” His voice was as compelling as a priest’s. “When I turn it on full, Savannah, I suggest you fight it. Fight it with everything you’ve got. The best things in life are those you hold off from enjoying as long as possible.</p><p>“You’ll understand that best at the end of the night, when you finally stop fighting Matt. You’ll discover an intensity ten times greater than anything we do to you, because it’s something he has that none of us can offer you, no matter what pleasure we bring you tonight. Something that you won’t see until you accept that you’re more than worthy of it. And when you do, Matt will be the luckiest man in the room.</p><p>Here we go.”</p><p>She was turning now, the suspension straps moving along the circular track, taking her around the table.</p><p>It was a disorienting experience that managed to sway her body and increase the effect of Jon’s device within her. When she stopped, she faced the head of the table, her gaze locked with Matt’s. She knew he could see every expression of her countenance, tense with desire, her lips pressed hard around the ball gag, throat working against the forces that were going to overwhelm her in no time, take her back to that place where Lucas had taken her. Only, if Jon’s device worked, it was going to keep her there, in screaming, mindless pleasure, where everything was beyond her control. And Matt was going to see it all, every vulnerable moment.</p> <p>She would fight, but not for the reason Jon suggested. Her body didn’t rule over her mind and, her father’s tenet be damned, she wouldn’t learn a lesson from failure because she wouldn’t fail. She wasn’t going to be made to do something just because someone wanted her to do it.</p><p>She realized she sounded a little desperate, even in her own head, and another rule came to mind. Never lose emotional control, even in your thoughts. Discipline is bone-deep, not just skin-deep. She had no idea what number it was, though she remembered thinking once it was somewhat redundant with Five, which she couldn’t remember at the moment, either.</p><p>The clit hood started pulsing harder, rippling strokes like the tide rolling up over a shore after a large vessel had passed, the tongue sensation electrical. The slight roughness of the linen and the fact there were no straps holding it firmly against the clit, the adhesive doing that work, meant it created even more friction as her hips rocked the very tiny amount her bonds allowed her. She tried to stop the movement, but then the other two areas were turned on at the higher setting Jon desired, and she was lost.</p><p>Oh God, oh God, oh God.It was everywhere, inside and outside, radiating from the top of her head to the end of her toes. In that moment, if she could have spoken, she would have said things that would have embarrassed her far more than having Matt see her face, which was unthinkably embarrassing in itself.</p><p>The electric current ran along the spokes of the wheel firmly pressed against the opening of her rectum, and that short rubber stem rotated very gently, sliding against the opening of the sphincter muscle, rocking the wheel like a spinning top, so it was stroking the rim of her in a way that made her strain against those straps.</p><p>And the phallus... Jon had it perform several seconds of simple vibration, his fingertips briefly touching her, verifying how wet she was before he set it in motion again. Slow short glides in and out of her, stroking her pussy lips, with a rotation movement that kissed that dense spot within again and again and again, the mere brush of an electrical tongue.</p><p>She fought. She gave it all she had, in total panic, shutting her eyes, unable to look at Matt, her breath rasping around the gag so harshly the saliva escaped, making the ball slick. She bit it hard, desperate to hold back.</p><p>She lasted seven seconds, and then the storm crashed down on her.</p><p>Against the gag, the scream that ripped from her throat reverberated back in her chest, choking her, accelerating the rate of her heart. Her body was shuddering, vibrating, convulsing, bucking impossibly against straps too snug to allow her room to buck. Whereas the climax Lucas had given her had given her the sense of falling backwards into the embrace of a bed piled high with pillows and quilted covers, this was like catapulting from an airplane, that terrifying feeling of falling, spinning out of control toward bone-breaking impact. She wanted to undulate against something, something solid, something that would rock back against her, ease this tearing need in her.</p><p>And it went on and on. There was no pinnacle. She kept thinking she had hit it, and then she’d launch straight across to another peak, the tiny wheel at her anus, the busily stroking dildo and enthusiastically vibrating clit piece alternating their rhythm and patterns as Jon had said they would, giving her no relief, only merciless pleasure for the enjoyment of the men watching, all at the command of one man.</p><p>Look at me, Savannah.</p><p>Did he say it? Whisper it in her mind? She opened her eyes and met Matt’s dark gaze, raging with the fires of heaven and hell, with everything she could want from both and in between. Jon was right. At this moment, she had no rational thought.</p><p>She utterly and totally wanted Matt’s Mastery. She wanted to be his. And if she could speak, she would have begged for it.</p><p>Tears slid down her face, her nose running from the excruciating pleasure of the multiple climaxes.</p><p>When they finally began to lessen in intensity, she thought her stomach and buttocks would forever be in a state of clenched response, all muscles tight as stretched rubber bands from the onslaught of the orgasms.</p><p>However, as the sensations drifted away, leaving her shuddering and sniffing helplessly, everything went limp with exhaustion. The place between her legs still pulsed, almost quivering with exertion. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Her pussy is as full and juicy as the prettiest peach you’ve ever seen.</p><p>Lucas?” Jon’s soft voice, not quite steady itself.</p><p>Oh...no...yes. Lucas’s mouth ever so gently closed over the distended area, and she let out a guttural, animal sound of near pain, exhausted pleasure. He licked her tenderly as Jon worked around him, eased out the dildo, which felt slick enough to be dripping. It was Lucas who held open her buttocks as the anal piece was removed. Through it all, she stared at Matt, her body heaving with gasping breaths.</p> <p>When he rose, leaned toward her, her mind dragged her gaze where it wanted to go, to see the enormous erection straining against his slacks.</p><p>“Do you want my cock?” It was a throaty demand that she respond, his voice beyond civility, commanding her. Prying open her fingers, he took away the handkerchief, using it to wipe her nose and around the corners of her mouth. That tender cozening perversely seemed to underscore his right to impose his will upon her, rather than lessening the force of his demand. When he didn’t give back the handkerchief, she knew she was being told her choice to call an end to it all had been rescinded.</p><p>“Answer me, Savannah. Do you want my cock?”</p><p>She nodded as much as she could.</p><p>Not just that. All of you. Everything.</p> <p>But she couldn’t say it, even if the gag weren’t there. He caught the strap holding the gag, ripped it away, pulled the ball from her mouth in a rough move. She didn’t expect it, the way his hand gripped her jaw, her throat, in a hold just a step below bruising. No more than she expected to delight in the pleasure of the pain.</p><p>“Say it. Say it now.”</p><p>“Yes.” She was hoarse, her lips and throat dry.</p><p>“Lower her,” he ordered. “Leave her ass in the air so Jon can get her ready for Ben. Just her head, to the level of my cock. And spin her, so she can take me deep.”</p><p>Her eyes widened as Peter and Ben moved to either side of the table.</p><p>Their arms went under her body and they tightened the straps that held her to the bench. Jon slipped the S-hooks of the suspending chains and they turned her and replaced the chains so she was facing the ceiling. The long narrow bench supporting her front simply held her torso straight as the chains were adjusted. Her head was lowered, lowered, lowered, Matt’s fiery gaze staying pinned on her even as the back of her skull touched the edge of the table, while her lower body went to approximately a forty- five degree angle above her, her legs still spread for Jon to do...whatever Matt had just told him to do. She couldn’t remember, not with Matt’s crotch this close to her face.</p> <p>“I took her lower body down a little bit.” Lucas this time. “We don’t want all the blood to rush to her head and make her faint. She’s still pretty spun up.”</p><p>“Remember to move your foot if you feel faint. Mouth me. Let me know you want my cock in your mouth.”</p><p>She didn’t think, didn’t review any rules for this situation. Her mouth opened and closed over the fabric of his slacks, her lips pressing hard against the thick width of him, her tongue reaching out to lick and wet the straining cloth, as she made noises of animal hunger in her throat.</p><p>“Jesus Christ.” Matt unfastened his pants and shoved them and a pair of black jersey boxers down to his hard thighs. The organ was so close to her that she couldn’t see it clearly, but her nose brushed the heat, smelled the animal musk of him. He seized the chains holding her, pulled so her head tilted over the edge of the table and she was essentially upside down.</p><p>He reached past her, took something Jon was offering,</p><p>a lubricant of some kind, and rubbed it over the broad head.</p><p>“Open up, Savannah.”</p><p>She barely had her lips parted before he shoved into her mouth, stretching her lips as she’d imagined, as she’d craved. He seated himself deep, and then stopped, holding his cock against the back of her throat, moving it slightly, as if he were rubbing it against her. She gagged, and his fingers stroked her throat, soothing her, and then the gagging desire was gone, though he pushed in deeper, against her tonsils.</p> <p>“Another of Jon’s many tools,” he growled. “Benzocaine to coat the back of the throat, so you can take me deep. You want to take me deep, don’t you? In your throat, in your ass, in your pussy. You want me everywhere.”</p><p>The tears were starting again, for the pleasure and truth were coming together, tearing her apart. She couldn’t see through them, in the literal or figurative sense, so she simply tilted her head more, giving herself up to this moment.</p><p>Matt withdrew slightly, then moved back in. She stroked him with her lips, just wanting to taste him, feel him. With no experience at all, she simply licked him with her tongue, sucked on him to get that taste, that scent in her mouth, her throat, her nose, where she could keep it. She imagined the earth of a humid jungle would smell like this, exotic and mysterious, brutal and honest. She even scored him with her teeth, tasting the meat of him.</p><p>She was vaguely aware of Jon, applying something soothing onto her clit, just inside her pussy lips and around her anus, something she supposed would keep her from getting raw before the next assault.</p><p>But then another sensation invaded, something less pleasant. She fought against it, and the fighting made it worse. Dizziness, black spots on her vision. She kept on, furiously, desperately sucking on Matt, not wanting to lose the odd sense of comfort in the act of servicing him, but it was overtaking her, sweeping her body, turning her shudders into a sick trembling...</p><p>She wouldn’t wiggle her foot. That would be failure. And she needed this, didn’t want it to stop...</p><p>“Matt.” Peter’s sharp voice seemed to come from far away and she made a noise of wailing protest as Matt withdrew from her. Suddenly his arms were under her, lifting her, making the chains holding her upper body go slack, lay cool against her skin as he brought her head even and then slightly above the rest of her body. She opened her eyes, saw his face close above hers, the concern in his strong face.</p><p>“I should have known you wouldn’t ask for help when you should,” he muttered, his hands impossibly tender against her temples.</p><p>She wanted to say she was sorry for making him angry, but his lips were soft on hers, making it all right.</p><p>Making nothing necessary but to simply be.</p><p>Just like she had felt at her father’s funeral, if only for one moment.</p><p>It wasn’t an entirely unexpected thought to have right now. Matt had given her that one moment, just as he had made this night something far different than she anticipated.</p><p>Overwhelmed, she let herself spin comfortably down a gray tunnel, into that memory.</p><p>Chapter Four</p><p>Among all the offers of sympathies, the unwelcome press of strange hands and bodies near her—acquaintances, hangers-on, a few genuine friends of her father’s who had little to offer to her beyond their formal support as she stepped into her father’s corporate shoes—Matt had been close. She remembered the heat of his body near her throughout those long several days. The supporting touch of his hand, the only contact she had welcomed, at the small of her back.</p><p>After the funeral and memorial service, deep into the third or fourth hour of the never-ending wake at her father’s sprawling estate, she had escaped to her room for a few minutes. Burying her face into her pillow, she’d screamed, beating the mattress, wishing for tears that never came. Though she stayed in there a good thirty minutes, trying to compose herself, she’d been undisturbed. It was only when she took a deep steadying breath, checked her hair and makeup and stepped back out in the hallway, that she’d found out why.</p><p>Matt sat on the top stair, with a brandy loose in his hand and a plate of untouched funeral food. Keeping watch. Keeping them at bay, the barbarians away from the gate.</p><p>“I don’t need a watchdog, Kensington,” she said uncharitably, frightened of how relieved she was to see him there.</p><p>He lifted a shoulder, took in everything about her at one glance.</p><p>“Humor me. It gives me an excuse to stay away from them.” He picked up a carrot from the plate, took a bite.</p><p>“God, I hate these things.”</p><p>“The vegetables?”</p><p>“No. When I die, I’m going to have a fast cremation and leave instructions for Lucas to throw a street party in my honor for a few thousand drunken revelers who have no idea who I am and couldn’t care less. They’ll toast my memory because I bought the drinks, and the people who love me won’t be put through a dog and pony show.”</p><p>“Nobody loves you, Kensington.”</p><p>He smiled. “You do.” He patted the step beside him. “At least the food’s good. Come have a taste.”</p><p>She found herself quite willingly moving toward him. “Is Morris Johnson still downstairs?”</p><p>“Of course. He and his executive staff. Trying to schmooze up to the CEO of Bank of America and eating as much free food as he can get his hands on.”</p><p>“If we slip a laxative into his crab dip, I’ll bet we get a great interest rate on our next six-month cash loan from BoA.”</p><p>“How diabolical, Miss Tennyson.</p><p>Remind me not to eat anything you’ve provided next time we’re having an important meeting.”</p><p>“I thought that’s why you employ Ben. To be your official royal taster.”</p><p>“Cute.”</p><p>She lowered herself beside him, in the small space his large frame and splayed knees allowed, but it felt good, not crowded. She absorbed his warmth with a welcome shiver.</p><p>“Cold?”</p><p>“A little. It was overcast at the graveside.”</p><p>“I’m sure Geoffrey arranged it. He did like the appropriate setting for all occasions. Here.”</p><p>“I can go get a sweater.” Her words died as he shrugged out of his coat, bringing a whiff of his cologne to her delicate nostrils, and laid it around her shoulders.</p><p>“There.”</p><p>Suddenly, she was struggling not to weep. Why did she want to weep now, when she felt nothing in her room except rage? She made a snort that sounded suspiciously to her own ears like a sniffle. “I guess if we were in high school, you’d ask me to go steady now. Give me a broken coin and we’d each wear half.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A corner of his mouth lifted in a smile, and he reached over, tugged free a tendril of her hair trapped under the collar. “I was on the wrestling team. You’re the football quarterback type. You’d have turned up your nose at the likes of me.”</p><p>“Wrestling?”</p><p>“Absolutely. You know how punishing football is on the adolescent bone structure? At least, that’s what my mother told me, over and over again, ad nauseum , when I whined to sign up. We compromised with wrestling.”</p> <p>“Matt Kensington, whining?” She leaned back against the opposite wall, which made her knee brush his.</p><p>The contact felt right, so she didn’t take it away and he didn’t seem to notice.</p><p>“Like the proverbial girl. But something tells me you never whined.”</p><p>She gave a half laugh and some of the coldness returned. She crossed her arms over her breasts, gripped the edges of the jacket closer to her, letting go of the ball of tissue in her hand so it fell into her lap. The coat smelled of him. She pictured a closet of such suits, all smelling like this, and her falling into them, holding on in the quiet, tranquil darkness of his closet.</p><p>“Geoffrey didn’t believe in it. He taught me that if you want something, you strategize how to get it. You never beg. And if you fail, you accept the failure, analyze it, go back and win what you lost back.”</p> <p>He nudged her knee with his own.</p><p>“What’s that in your lap?”</p><p>“Just a tissue...” She looked down at his puzzled expression and instead of the tissue, she saw a tiny rag doll, little bigger than the length of her hand. She’d left it on her bed earlier, hadn’t realized until this moment that was what she had clutched in her hand as she screamed into her pillow, and apparently had held onto when she left the room. “Oh.” She lifted a shoulder, tried for a casual look, even as her hand settled protectively over it under his shrewd gaze. “At my father’s corporate Christmas party, one of his business associates brought a little gift for me as the ‘lady of the house’. When I was six,” she added, at the twinkle in Matt’s eyes. Her eyes could not linger on his face, so she looked back down, fingered the</p><p>doll. “He knew nothing about me of course, was just trying to win favor with my father.”</p><p>He had no clue that fawning on Geoffrey’s child meant nothing to Geoffrey.</p><p>“But I liked it.” Extraordinarily liked it. Kept it with her that night, slept with it hidden under her covers where her father couldn’t see. But Geoffrey had known. “One night, I was tired over something, and I whined, I guess as children can do, and he punished me by taking it away. I found it in his closet when I was looking for a suit for him...for this.”</p> <p>“He never gave it back?” Matt raised an eyebrow.</p><p>She shrugged. “Of course not. As I said, he’d told me whining didn’t get you anywhere. It meant the things that mattered got taken away from you, and when you lose things from your own actions, you must learn from them.” Savannah shook her head.</p><p>“Don’t look at me like that, Matt. I know it sounds dysfunctional, and maybe it is, but you know, kids from good income brackets get about everything they want these days, and for the most part, they are whiny, self-indulgent, spoiled brats whose parents don’t know how to say no to them. Geoffrey may not have been a loving, affectionate father, but he taught me everything I know about how to be successful. How to be hungry only by choice.”</p><p>Reaching out, Matt put a hand to her face, startling her. She was immobilized by how good it felt, that human contact freely offered, pressed against her skin. “You were the best thing that ever happened to him,” he said quietly. “He had all the money in the world, and he got his most valuable acquisition the day you were born. And not just because you could run his company better than he could run it himself.”</p><p>Savannah didn’t know what to say to that. She looked toward the bottom of the stairs. “It’s odd no one’s walked by here to disturb us.”</p><p>“I told them there was free food in the main courtyard. It drew them off.</p><p>Here.” He offered her his plate.</p><p>“As I said, the food’s quite good.”</p> <p>“Of course.” She shook her head at it.</p><p>“Geoffrey already had his menu planned out. It wouldn’t be less than perfect. Hungry by choice, remember?”</p><p>“The best kind of hunger there is,” he said. Suddenly, she knew exactly where his knee pressed against hers, and what hunger he was talking about, because it had her lower extremities in a perilous grip.</p><p>“I want to give you something for later.” He broke the charged silence between them. Withdrawing the handkerchief from the breast pocket of his jacket, he folded it into her hand, his own remaining over it.</p><p>“What, is my makeup running?”</p><p>“No. It’s for when everything about this day hits you, and you finally cry, even if it’s for no other reason than you don’t feel like crying and that breaks you down.” He rose. “Keep the coat until you’re warm.</p><p>I’ll get it back later.” Then he leaned down and kissed her forehead, just a gentle brush of lips, his hands holding the lapels so she was in a light embrace within the jacket. “I’m here if you need me, Savannah.</p><p>I’m always here. Come down when you’re ready. Lucas and Jon are in the foyer hallway, keeping people from coming this way. You don’t have to come down at all if you don’t want to.”</p><p>“Of course I do.” The dangerous temptation of such an image broke the spell. She rose to her feet, slid the jacket off her shoulders and handed it back to him. “I don’t need this.” But she kept the kerchief. It was a gift, after all.</p><p>She was on the step above him, so their positions put them at eye level.</p><p>His expression had hardened with an emotion she couldn’t read as he studied her face. In a surprising move, he suddenly slid an arm around her back and legs, swung her up in his arms and turned, carrying her down the steps.</p><p>“Matt,” she hissed. “What are you doing?”</p><p>At the bottom, he let her feet touch the floor, but he held her elbow another moment. “That was to remind you that someday, you might need someone else to carry the load for a while. And you can trust me to get you where you need to go, no matter how steep the hill is. Up or down.”</p><p>He left her there, amazed, speechless.</p><p>Oddly happy and hurting at once. And that was when she used the handkerchief for the very first time.</p><p>* * * * She’d kept it folded under her pillow ever since.</p><p>The fuzziness receded and she became aware of her surroundings again. They’d adjusted the chains so she was level and turned her over so she was once again on her stomach.</p><p>She was lying on the table, still bound, but the straps had been loosened back to their prior snugness, rather than the snugness that had been necessary when she didn’t have the back support. They’d also let her head down so her cheek was on the table.</p><p>Matt was sitting in the chair, leaned forward, his face no more than a foot from her.</p><p>“I guess we got a little carried away.</p><p>You carried us all away. You were something else.”</p><p>She coughed, her voice raw from her screaming. “But I’m still tied up. So you’re not done with me yet.”</p><p>“I’ll never be done with you.” He drew even closer, so the depths of his brown eyes were all she could see. “You’ve scared yourself, and you’re retreating again. I can see it.</p><p>I’m not going to let you. I’m going to feed you.”</p><p>A weak chuckle, somewhere close to a sob, broke from her abused throat.</p><p>A throat that remembered vividly what it was like to have him slamming against the back of it. “You can’t bribe me with food, Kensington, at least not unless you plan to keep me like this for several days without food and water.”</p><p>“An intriguing possibility.” He cocked his head. As sensation returned to all her limbs, she realized he was stroking her forehead, playing with her loose hair. “Actually, while manufacturing this invention and renovating the room for it, I’ve thought about it a great deal.</p><p>Imagining what it would be like to have my woman suspended in it every day, accessible to me whenever I wanted to play with her nipples, slip my fingers or cock into her wet cunt. Put her on display for business associates who come in here for meetings, a mesmerizing centerpiece for my conference table.</p><p>I think my competitors would give me anything for the privilege. But just to look at you. No man other than those in this room tonight will ever touch you again. You’re mine.”</p><p>That harshness came to his eyes again, and just as naturally as command came to him, resistance to capitulation flooded her. But this time she had no sarcasm to offer, just simple denial. “No,” she whispered.</p><p>“Yes,” he responded, just as quietly.</p><p>He supported her skull in his hands as he readjusted the straps so her head was lifted, her facial expressions exposed to them all again. The chains tightened and she was raised from the table, only this time she was only lifted about two feet, and it was her upper body that was raised higher than her lower, so her breasts thrust out at Matt at eye level, in a blatant display that roused an embarrassing heat along her throat and face. His eyes followed the track of it, and when his gaze got to her face, his own fire was a match for it.</p><p>“Here.” Lucas slid a small plate to Matt’s elbow and Peter placed a gold-edged wineglass next to it.</p><p>Savannah smelled the rich scent of red Merlot.</p><p>“You need to eat and drink,” Matt said. “We don’t have a good strategy for getting rid of your body if you die from too much pleasure.”</p><p>His eyes glinted with humor, and she bared her teeth at him. He brought the tumbler to her lips, cradling her cheek with his hand, touching the corner of her mouth, compelling her lips to part. The angle was awkward with her position, and before she could take more than a sip, he took it away.</p><p>“A better idea.” There was a pause while he took a swallow. She wondered and imagined and then hoped, and then his mouth was there, sealing over hers, opening, letting the wine on his tongue spill onto hers, his hand still along her face, the grip of his hand moving along her throat as if to help her swallow the liquid. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She didn’t drink much, having a low tolerance for alcohol, and just this swallow was made more potent by the method of delivery, by his care for her, by the stroke of that tongue on hers. He pulled away reluctantly, and then she smelled one of the snacks they often brought in for meetings from the gourmet deli down the street. Goat cheese flavored with thyme, wrapped in a finger-sized, seasoned flatbread.</p><p>“Your favorite, I believe,” he said, those eyes watching every inflection on her face, his own expression still a little intimidating, reminding her that he was not going to brook resistance. Savannah decided she was going to let him win this minor point to fortify herself and regroup.</p><p>She wanted to try a different strategy.</p> <p>An experiment, really.</p><p>She ate the entirety of it from his hand, even obeying the sensual urge to clean the soft cheese off his fingertips, taking the taste of his skin with it, those strong fingers resting in her mouth.</p><p>The tension and lust poured off him as she did it, and she knew her experiment was successful. It wouldn’t be easy, but with the power of that knowledge, she knew she could turn this to her advantage, make him her slave if she wanted to.</p><p>But something else came with the thought. Anguish. She didn’t want to make Matt a slave. She wanted his harshness, his power, his command.</p><p>She wanted the tender protectiveness and chivalry as well, and wondered if there were even more gentle sides to him than he’d yet revealed to her, aspects of his personality that might exist in a softer world, one outside these corporate walls.</p> <p>“God, you make me insane, Savannah,” he muttered.</p><p>Join the club, she thought. “How did you know these were my favorites?”</p><p>It was Lucas who spoke. “You don’t eat much that we have brought in. Or at least you didn’t at first.</p><p>But then we started noticing the things you would eat, more than once.”</p><p>“We wouldn’t touch any of those,”</p><p>Peter put in. “And made sure that portion of the tray was closest to you.</p> <p>Then we figured out if we ordered more of that type of snack, you’d eat more.”</p><p>Southern etiquette. Never eat the last one.She remembered a gradual increase in the food she’d eaten at their sessions, an ample variety of her preferences present.</p><p>“We made it a competition, coming up with foods we thought would become your new favorite.” Peter laughed, caressed her bare calf from somewhere out of the range of her vision, reminding her forcibly of the view he had of her spread legs. “I knew you’d love those chocolate cream finger cakes.”</p><p>“I lost a five hundred dollar bet on it,” Lucas grumbled good-naturedly.</p><p>“I was sure you’d pick the caramel creams.”</p><p>“When Ben baked the cakes himself and slid them on the tray like they came from Dean and Deluca’s ? Not a chance.”</p><p>Savannah choked. “Ben baked...”</p><p>“It isn’t the sleazy lawyer routine that gets him women. It’s his culinary skills,” Jon added.</p> <p>“Yeah, like you don’t use the lost angel thing to seduce women.” Ben snorted outside of her vision.</p><p>“Five hundred dollars on whether or not I’d eat a sweet?”</p><p>Matt dabbed at the corner of her mouth with one finger, put a missed bit of goat cheese on her tongue.</p><p>“We always have a betting pool running on something. At the end of the month, the winnings go to the preferred charity of the final winner.”</p><p>“What’s your chosen charity?” she asked.</p><p>“A man’s charities are a private thing. Not manly to discuss,” Lucas interjected.</p><p>“And I think our guest has recovered enough,” Matt said, his eyes studying her face.</p><p>Anticipation sprang up in her, thick as heated blood.</p><p>She wasn’t sure she could take anything else. Emotionally, she felt as delicate as an eggshell, just Matt’s words creating a shiver through her body. But wetness touched her thighs, her pussy leaking a tiny drop, her body’s betrayal of her interest. It was as if Matt’s multiple-layered strategy had already trained her body to such a level of sensual awareness that the mere suggestion of sexual activity could get her revved up again.</p><p>He rose, his fingers whispering across her cheekbone, and leaned over where she could see him touch the table controls. The motor engaged and she was moving along the track, down the table, and as she turned in that direction she saw she was going to the very end, where Peter had moved and now waited, just to the right of the rounded table end.</p><p>Peter would have looked more at home at a monster truck rally. With a corner lift to his mouth at almost all times, as if he were sharing a private joke, he had a soft Southern drawl and a way of wearing his clothes that suggested he’d be most at home in jeans and a T-shirt from a seventies’ rock band. His fingers would tap restlessly as they conducted their meetings and at times she’d hear him humming a heavy metal tune under his breath. He wore his hair cropped in a short military cut that emphasized the strong lines and corded neck of a bodybuilder. He wasn’t a bodybuilder, but an Army reservist.</p><p>He spent a great deal of time staying in shape to serve his country if called. He’d taken a leave from Kensington to volunteer for a year tour in Afghanistan. During that time Matt had casually mentioned many were sending shoebox care packages to the soldiers. He’d left her a copy of the instructions that were circling the corporate offices, encouraging participation. In the margin, he’d noted how to get one specifically to Peter, if she wanted to have her staff make up one for him.</p><p>Before she knew it, she was collecting items, especially as she had watched the news reports and thought of Peter’s face, the laughter so often in his gray eyes, the strength in those broad shoulders, a strength that the media footage made clear could be erased in an instant by the fragile reality of mortality.</p><p>Moist towelettes, sample-size toiletries, a pack of playing cards she’d found that had images of New Orleans integrated into the depictions of numbers and royal personages.</p><p>She remembered he had a weakness for ice cream and put in a bag of hard candy that boasted fifty-one flavors similar to ice cream.</p><p>The latest Dean Koontz novel and a Nightcrawler X-Men comic book.</p><p>The others called him Nightcrawler, because they claimed he preferred trawling the New Orleans nightlife over sleeping.</p><p>And then she put in something she hadn’t expected to buy. On one of her layovers, when she was browsing in an expensive airport jewelry shop, she’d seen a gold St. Christopher medal. She’d purchased it with not a thought for the three-figure price, because it didn’t matter. Getting him back safely did.</p><p>She’d never done something so... nurturing before. Filling the list in the privacy of her home, she didn’t involve her staff. She even mailed it herself.</p><p>She’d never prayed. She suspected there was a God out there, but had always imagined Him like her father.</p><p>Not Someone from whom she could seek support or comfort, just Someone who expected the best, or dire consequences would result. But in that moment, when she took the medal home and tucked it in the box, finishing the care package, she offered something that she supposed was like a prayer to that saintly figure. Please keep him safe. Bring him home.</p><p>When Peter did get home, at the first meeting where she’d seen him again, he’d been wearing it. He’d ruffled her by putting his arms around her and hugging her, a close hold that he prolonged five still seconds before he let her go, looked in her eyes and nodded. Then he asked her one question.</p><p>“Have you tried the God-awful chai tea Jon’s trying to make us drink today?”</p><p>He always wore the necklace.</p><p>“I love your breasts,” Peter said simply, bringing her back to the present. He had sat down, and had his elbows on the table, his chin resting on his fists, as if they were two children, facing each other on their stomachs on the limb of a tree.</p><p>The whole world fallen away below, so that the only things around them were things that could fly or flutter, crawl to great heights to see the world from a higher perspective. “I try not to stare, because I know women think men are creeps when they stare at their breasts during conversation, but since you and I don’t have to talk directly that often in meetings, it’s seemed okay to stare at them.”</p><p>It startled a smile out of her, and he returned the favor, showing her white teeth so symmetrical she knew an orthodontist had been part of his youth.</p><p>“Of course, sometimes it ticked Matt off.” He grinned more broadly. “You like lace, just a bit on the edges.</p><p>You’ve never worn a bra for us that didn’t have it.” His finger reached out, traced one bare curve, the line such lace would follow if it had been there. In her raised position, her breasts were right before his face, at the level of his mouth, and she could not block the images that thought evoked. This position also put her where she could still see the wall screen. New images had been picked up. Her writhing, screaming response to Jon’s stimulus, all muted, but no less potent, particularly when Peter’s large callused hands reached forward now and began to fondle her. She was getting very, very attached to the magic of men’s hands. At least the different textures and types of touch these men had.</p><p>He traced the crease under the left breast, started up the opposite curve, making her feel his appreciation of her shape, her fullness. Her nipples ached, but he did not touch them, just the soft flesh around them.</p><p>“You’re too thin,” he observed in a warm voice that implied no judgment, no criticism. “You don’t eat enough, though you’re in good shape. You use your corporate gym daily, I know. When I’ve crossed the city overwalk between our two buildings, I’ve seen you running the track on the tenth floor. Covered in a light sheen of sweat, wearing a black sports bra that holds you so tight and immobile, no give. Much like your life, don’t you think?”</p><p>“And all of your lives are so perfect,” she said, but with much less acidity than she would have had a few hours ago.</p><p>“Well, I can’t think of a moment much better than this one.” He gave her a charming look and then continued on, unperturbed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I can’t stand it when women diet themselves down to zero cellulite thighs and a tiny ass. They lose their breasts, the curves of hip and bosom that make them a woman. I wish we could go back to the fifties, and see women who were firm and healthy, with generous breasts, soft asses, whose thighs were like soft pillows for a man’s hands. I’d be in heaven.”</p><p>“Sounds like I’m a disappointment to you, then.”</p><p>He chuckled and weighed one breast in each hand, pressing her nipples to the heated cup of his palm, eliciting a soft whisper of pleasure from her.</p> <p>“Not in the least. You’re a beautiful woman.” The Southern accent got deeper, richer. “While you and Matt spar, or Jon drones off one of his never-ending financial reports—”</p><p>there was a snort from the end of the table, “—I’ve imagined them a lot of different ways.</p><p>“Bare, like this, nothing clothing them but the touch of my hands.</p><p>Anticipating the feel of your nipples in my mouth when I close my lips around them and suckle them.” He gave them a gentle pinch, a mere pressure, and she arched, moaning.</p><p>“Or in a beautiful satin bra, with sheer cups so I can see the suggestion of your nipples and the color of your skin behind the cloth. The kind with underwiring that pushes you together, makes that deep cleft that I want to run my tongue down, like the cleft of a woman’s cunt lips.</p> <p>“Or a shelf bra that your breasts are just barely tucked into, the plump tops rising high like the smooth tops of freshly baked cinnamon rolls.</p><p>You’ve worn that style before, and the images it conjured have made me nearly insane. I want to sprinkle powdered sugar over the top of them, lick it all off.”</p><p>She was shuddering, and his touch had turned into a gentle kneading, slow, torturous, a manipulation of the sensitive globes even as his thumbs idly, all too infrequently, passed over the distended nipples.</p><p>“And then there’s the bra with cutouts for the nipple, so you can have all the support and shapeliness a bra provides, but your nipples are as prominent under a shirt as if you’re not wearing one at all. No man can resist looking, hoping for a rain shower to soak the cotton, make them even more noticeable.</p><p>“Nipple jewelry is also something I’d love to see on you. D-rings and barbells for piercing, dangles, chains to attach them to one another and adorn the neck. Weights with uncut gemstones. All of which stimulate the nipples and keep them distended, aching for touch.” His hands kept up their complex composition on her, and she thought he would make her come, just from the combination of words and skillful fondling.</p><p>“There are hundreds of ways to appreciate a woman’s breasts, and every day I think of a new way. If I had you to myself for an entire afternoon, I’d lay you out on my bed, apply a henna paste to your tits, decorating them with a Celtic design.</p> <p>And then when I was done, and it was dry so I could touch you, when your body was screaming for fulfillment, I’d place your breasts in a parallel bar restraint like this and tease you with my teeth and tongue until you screamed for release. But not release from that bar.</p><p>Release from the passion you would be feeling.”</p><p>His voice dropped to a rough whisper, a sensual friction against her senses. Her entire breast tingled as if she could feel the weights he spoke of, the touch of the henna paste, the squeeze of those bars distending her, making her more aware of touch, of the need to be tasted.</p><p>“Would you like me to suckle your breasts, Savannah?” Peter asked. “I want to, very much. Tell me you want that.”</p><p>“Yes,” she managed. “I want that.”</p><p>“Good.” His mouth curled up at the corners. “Because I was going to do it whether you agreed or not.”</p><p>He leaned forward, his face even with her breasts, and looked up at her. “While I’m doing this, Ben is going to be preparing you for a very different sensation. Together we’re going to rouse you to the pinnacle of climax, but hold you there longer than you think is possible, until we reduce you to mindless sense again, the pure being that you are, nothing else.”</p><p>“I’m not sure I can take much more...” The weak words were out of her mouth before she could stop them, appalling her, but the totally male smile from Peter ran fire through her, obliterating the cold frisson of fear.</p> <p>“You can take it. You’ll have to, because it’s not a choice.”</p><p>He lowered his head, covered her with the heat of his mouth, and swamped her with the sweet satisfaction that her nipple had been craving, so sharp that she cried out as he drew it in, teased it in the wetness, pressing on it with his lips. He brought his hands up, framed the rack of her breasts and squeezed just in front of the grip of the bar restraints, causing a moan, an outright whimper.</p><p>She’d never had each part of her so focused upon, so worshipped and cozened as it had been in the past several hours. Her entire body, every expanse of skin and the restless nerves beneath, desired something, a level of fulfillment Peter had just indicated they would not deliver. But it didn’t matter, because the spiraling need felt so good that she shamelessly angled her hips in wanton display. Peter deepened his suckling, making appreciative wet noises as he drew succor from her.</p><p>Her fingers ached from clenching into one overlapped fist, the desire to touch, to hold his head closer, denied to her.</p><p>She shifted her gaze and saw Matt standing in front of the screens, a silhouette against the many images</p><p>of her time in this room. Someone had dimmed the lights so she was in spotlight again. Feeling his claim on her as if he had uttered it like a war cry, she understood then the appealing fantasy of a slave girl being prepared for the warlord’s pleasure. For she knew in looking at him, she was not being shared equally among friends, but pampered, her body made malleable for claiming by the man who had fully intended to have her from the first.</p><p>And that time was drawing very close.</p><p>Peter’s teeth scraped her left nipple and the shudder of reaction went all the way to her womb.</p><p>Then Ben touched her. The man who turned the legal screws when Kensington’s rights were challenged in any situation. It made sense Matt would pull him into this last phase, to ensure there was no challenge left in her. Though Matt underestimated her if he thought that was possible. She would go down fighting.</p><p>She had to. Didn’t she?</p><p>Ben’s hands were slick as they touched her backside. She smelled an oil, heated musk like opium, and he was sliding it down her buttocks, oiling them, somewhat as Jon did, but then suddenly, he was working his fingers and the oil into her anus, and slid past the resistance before she could react.</p><p>“My apologies, Savannah.” His voice was a sexy baritone with the faintest hint of Cajun accent because of his parentage. He’d spent most of his formative years in New England, including the acquisition of his law degree at Yale, where he and Matt had met. “I didn’t want to warn you because you would tense up, and I don’t want to cause you pain.”</p><p>She highly respected Ben, because while he was in fact as aggressive as the proverbial pit bull, like all of Matt’s team, he played as fair as he played hard. When she’d been privy to meetings where they’d been on the same side of the fence, she’d noted that Ben did not hesitate to tell Matt whether or not Kensington could do something. Matt followed his direction most of the time, never undermining Ben’s expertise with CEO ego.</p><p>It was more difficult to relax with Ben touching her, however. She’d had to acknowledge she had a more affectionate and intimate bond with each of the other four than she would have admitted prior to tonight. But Ben had been more distant throughout her relationship with Matt. The man she knew least was obviously preparing to invade the area she’d explored or fantasized about the least, mentally or physically. Jon had barely entered her there, and with Ben’s firm though gentle hands, she understood implicitly that he was planning a full invasion, as the last step in Matt’s plan to completely break her down.</p><p>Her resulting anxiety created a strange dichotomy of sensation, trepidation shooting like a distracting arrow through her reaction to Peter’s mouth, teeth, tongue and hands.</p><p>“Stop,” she rasped. “Don’t.”</p><p>Peter’s mouth slowed, but did not still. Instead of nips and eager sucking, now he laved her softly, tugging her in slow, lazy sucklings in his mouth so her pussy, already wet, flooded with new heat, moisture Ben picked up on his fingers to rub over the outside of her pussy, stimulating her there, and then raised his touch to use the rest to lubricate her back opening.</p><p>“Matt.” She reacted, didn’t think of appearances. “This is scaring me.”</p><p>Her voice quavered slightly, but for once in her life, it did not embarrass or appall her. There was no room anymore for the cold pit viper she was described as being. She was just Savannah, a woman aroused and captivated by the five men in the room, captured by the demands and desires which had roused her own. It was the first time she’d been afraid of the physical portion of the evening. She had been afraid of what they would do to her, afraid of where they would and wouldn’t stop, where that would leave her when it was over. Afraid of Matt. Of his relentless determination, so much greater than she had ever suspected, to have what he wanted.</p><p>Afraid that she, in the end, did not have the strength to resist him or hold him at arm’s length, stay safely behind a shield so he couldn’t get to who she was. She also was afraid the night’s events revealed all too clearly that he had figured that out a long time ago.</p><p>Ben’s strokes became even more gentle, his palms turning so she felt the caress of his knuckles on her buttocks.</p><p>“There’s nothing to fear.” Matt spoke quietly. Firmly, which told her he wouldn’t alter the plan for her fear, but with a note of tenderness in his voice that she recognized as similar to a parent reassuring a child. “It will be all right. Trust me. Trust us.</p><p>You’re trembling with pleasure even now.”</p><p>“Is he going to...” She licked dry lips, and was surprised when Peter’s covered her mouth, moistening them, just a light touch, there and then gone, before she could savor it. Not a kiss, just a very functional action, meeting her needs. Only Matt had kissed her on the mouth. The significance of that struck her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes. But not his cock. You’ve never been stretched there before and that would be painful. But his fingers will bring you pleasure, as well as the gift he’s brought for you.”</p><p>And before she could think of another word, Ben’s oiled hands were spreading open her cheeks assertively, so he would see her anus in embarrassing detail.</p><p>“Very pretty.” Amazingly, she felt his lips brush over the opening, then he licked her there, probed, his roughened jaw tickling her buttocks, the tops of her thighs. Peter blew heated breath on her left nipple, closed his mouth over it again, his right hand continuing its tortuous kneading and gentle pinching of the other breast.</p> <p>She was aroused, but at the dual sensation, something turned over inside of her stomach, some tightly wound spring, and something was catapulted into her chest, choking her with need and desire at once, flooding her body, an exquisite sense of pre-climax. It was so close she could see it, but she wasn’t there, she was just at that perfect viewpoint to see how amazing and steep the cliff edge was that awaited her, as Ben and Peter bore her toward it like a cherished sacrifice. Her gaze fastened on Matt’s, and she was invaded by a wild thought. He was the god of this volcano, the volcano of molten response ready to erupt within her, held back only by their skill and his command, the knowledge of it in that sensual gaze.</p><p>She needed his power around her, over her, spreading her wide, filling her, taking her sacrifice.</p><p>He was watching her shifts in emotions, the reactions of her body, and somehow she knew part of that attentiveness was because he was ready to move and act as needed if the line was crossed and fear or pain entered the picture in a way not intended. Matt would never hurt her, or allow someone else to do so.</p><p>That had to be insane thinking, brought on by the physical and emotional duress of her climax. Even her father had made that clear to her.</p><p>Rule Nine: The people who claim to love you can hurt you worse than those who don’t. Don’t let anyone past your guard, and you’ll know what to expect from friends, lovers or children, as well as enemies. It won’t matter which mask they wear.</p> <p>Underneath, every person operated on self-interest, and that would obliterate any sentimental attachment when challenged by stress.</p><p>She’d seen him proven right, again and again. People were what they were. He hadn’t meant it as a qualitative judgment. Geoffrey hadn’t gotten sentimental or emotional. He’d been protecting her in his way, or rather protecting Tennyson Industries, but at times she had wondered if certain returns were worth the pain.</p><p>She expected her father would have said, “It depends on how much you’re willing to pay”.</p><p>“You’re tensing, Savannah,” Ben observed. “I want you to do something for me.”</p><p>“Wh— What?”</p><p>“I want you to tell me a fantasy you have when you’re afraid. How do you make yourself feel safe?”</p> <p>Safe? Had she ever felt safe?</p><p>Certainly from the common things of the world like thieves and muggers, but she’d never felt safe from emotional attack, not in a world with Geoffrey Tennyson, though she’d loved him. She’d had different fantasies to comfort herself when the stress of always having to be on her toes got to her. But over the past couple of years, one fantasy had dominated and erased all the others.</p><p>She couldn’t tell them that one.</p><p>“I won’t pull down the blinder, but close your eyes,” Ben insisted. “Then say it as you’d say it if we weren’t here. We don’t have any secrets here.”</p><p>Of course they knew she was afraid to say it. Maybe they even suspected what it was, which made it absurd for her to pretend otherwise.</p><p>“My fantasies are always shadows,”</p><p>she murmured. “Just impressions, just for a moment, then gone, as if I’m afraid someone will come into my mind, turn on the lights and catch me doing something I shouldn’t be doing.</p><p>Worse, the lights will be harsh, and make something I want to be beautiful become something ugly.”</p> <p>“What’s the fantasy?” His hand gently probed her, making her suddenly wish to weep. He shifted his thigh against the back of hers.</p><p>“You may get emotional when I do this.” Again, he seemed to read the confusion of her mind as if she had expressed it. “That’s normal, because a lot of issues are held in this region.</p><p>Tell me the dream. Your fantasy.”</p><p>“To be held,” she whispered. “... Someone...comes to me, to my bed, and holds me.” She couldn’t be specific. A lifetime of protecting herself couldn’t be undone in one night, though if anyone could do it, she suspected they were in this room.</p><p>The “Someone” was Matt. She didn’t know why it was him in the fantasy, but it always was, ever since she’d met him.</p><p>Peter was brushing his cheek against her breasts now, a comforting gesture. She felt an almost maternal, fierce need to have her hands free so she could touch his head, his hair, hold him to her, perhaps rub her mouth, her cheek against his hair, smelling his varying scents. Nurture as well as be nurtured.</p><p>“I’m in my bed, and...that someone comes to me. He’s there, sliding in behind me, but not just to hold me from behind. He turns me, so I’m in the shelter of his body, facing him, my face tucked beneath his chin, his arms around my back, and all I have to do is just...be. He sees me. He doesn’t say anything, or want anything I’m not willing to give. He fills me in my heart, my mind and body. He’s there, with me, for</p><p>me.”</p><p>“And you’re comforted.”</p><p>For that short period of time. Until the alarm goes off. “Yes.”</p><p>One of Ben’s fingers slid within her, the oil taking it easily deep into her rectum. His other hand squeezed her right cheek, a sexual gesture as well as one of comfort. “Breathe deep, Savannah,” he said.</p><p>As she drew in a breath, he kept speaking in that deep, musical voice.</p><p>“I love women with tight asses. I have thick fingers, and I love the feel of them clenching around me. And I think you’ll enjoy this even more.”</p><p>He leaned forward, his soft Pierre Cardin dress shirt brushing her back, and in the oiled hand he held before her, just to the right of Peter’s head, he clasped a strand of gleaming freshwater pearls.</p><p>Her father had given her jewelry to appropriately decorate her for the functions they attended. Not once in her life had she been given jewelry as a true gift, something offered for her pleasure. She certainly could afford to buy herself something like that, but this...</p><p>“Ben...they’re beautiful. I...can’t...”</p><p>“They’re yours,” he said simply, and then he was bending over her, laying a kiss, tender and lingering, on the nape of her neck. He trailed the pearls down her spine, left them in a coil in the small of her back. “I’ll use them for your pleasure, then I’ll take them with me tonight, get them cleaned and return them to you, so you can always remember how they were used when you wear them.”</p><p>“And how is that?”</p><p>“I’m going to double them over, and insert them into your rectum. As Peter rouses you to even greater pleasure with his mouth and his gift , I’ll slowly draw them out. It’ll make you crazy.”</p><p>Before she could think of a response to that, Peter was turning, taking a velvet box from Lucas.</p><p>“We’ve all brought you gifts tonight.”</p><p>Lucas leaned his hip against the table next to Peter. “Jon is giving you his device, the prototype, to keep for your private enjoyment. Ben has brought you the pearls. Peter and I picked these out together.”</p><p>“One from each of us.” There was laughter in Peter’s voice. “I think you’ll like them.” He withdrew what looked to be a pair of genuine diamond chandelier earrings, and then she realized they were not earrings.</p><p>He leaned forward, covered her with his mouth and wet her again, then his fingers were there, placing the jewelry on her distended nipple.</p><p>“Tell me when it’s uncomfortable.</p><p>It’s an adjustable clamp.”</p><p>She only had a moment to be fearful of that particular word in association with her nipples before he was tightening the screw on the jewel.</p><p>The pressure was exquisite, wringing a whimper from her throat, and he looked at her face, registered that the noise was pleasure, and he took another turn. “I’m going to stop there, darlin’. You’re aroused enough to like the feel of it, but it will be painful if it’s at too tight a setting for long. Now the other one.”</p><p>“I’m taking the pearls into you, Savannah. Take in another deep breath for me.”</p><p>Ben again. Good luck in that, when she could barely draw an even breath, let alone a deep one. Peter slid his tongue over and around her curves as if washing them, nudging the jewels, tugging on them, his fingers twisting the slick nipples, causing wrenching bolts of pleasure to rocket from her nipples to anus and back again. The diamonds brushed the lower curves of her breasts like feathers of sensation.</p><p>She drew in the breath, tried to hold it, though her pussy was so wet she could feel that the soft curls were drenched, cool against her skin.</p><p>“Now let it out. Slow. Count of five.</p><p>Just like with Jon. One, two, three...”</p><p>She obeyed, and she felt Ben’s fingers gently push round, smooth pearls into her. They were lubricated with the oil of his fingers, and she began to move against the straps, she couldn’t help it. It was equal reaction to both stimuli, so aroused she couldn’t find a rhythm, only this desperate movement. Ben began to play with the beads, pulling on them slightly, not taking them out, just turning them around, wiggling them a bit, and then his finger amazingly joined them, a thumb she thought, for she felt impossibly filled, her pussy contracting as he began to move the digit incrementally inside of her, tiny back and forth pressures as his thumb stretched her opening.</p><p>Savannah cried out, her hips jerking, shuddering, her cunt weeping for a release being held just out of reach.</p><p>Neither man touched her clit, and in the air, she had nothing she could grind against, the damn bench on which she rested stopping just above her pubic bone. She still could have forced herself down against it, pushing against the loose skin just above the pussy to somehow massage the clit, but as if Peter knew that, his hand slid under her belly, between the board and her body, and held her away from it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She didn’t know when she had lost an anchor on her senses, control of her bodily or mental functions.</p><p>She only knew that she was completely adrift, rolling in a heated, searing cloud of sensation and emotion, immersed, just a blink before the panic of climaxing. The men’s furor had increased, as if picking up on her desperation. Their own animal instincts responded, pressing the advantage, the sensual parallel to closing in on a kill, feeling the bloodlust take over, without the blood.</p><p>She saw their faces and her own reaction grew more primal. She wanted to see them below the waist.</p> <p>She was disappointed that Lucas sat with his hip on the table, that portion of his anatomy turned away from her.</p><p>Jon and Ben were behind her, and Peter was pulled up to the table so he could more easily tug at her breasts.</p><p>Matt had moved outside her range of sight.</p><p>Then she remembered the screens.</p><p>When her eager gaze shot to it, she saw some of what she wanted.</p> <p>Lucas’s body was highly aroused, his profile intent upon her. Jon likewise tipped back in his chair, watching Ben’s work, his cock straining against his khaki slacks, unembarrassed in his blatant arousal.</p><p>And Ben...well, if the size of his erection against his charcoal summer wool trousers was any indication of his true size, she was glad it was pearls and not him inside of her. All of the men were as much or more aroused than she, and suddenly she again had that amazing desire to satisfy all of them, to be as open to their raging needs as to her own.</p><p>There was a current close-up of Peter suckling her nipple, nothing of her visible but her breasts. Straining the curve of her throat, she arched more in response to the visual stimulation as his hands framed and squeezed her, giving him more to suckle.</p><p>“Please,” she gasped, emitting a short scream as Peter’s tongue went from a swirling rhythm with the sucking pressure of his mouth to a hard flick, bouncing the weight of the jewelry against the nipple. Ben replaced the thumb caressing her opening with his tongue, tickling the tender inside flesh of her buttock with alternating pressure of teeth and tongue. Then the pearls started to come out.</p><p>Pop, pop, pop...At each expulsion, she made a guttural noise of reaction, her nostrils flaring, seeking air.</p><p>Clit stimulation or not, her pussy had reached its capacity. It contracted, squeezing around nothing, preparing to let her go, pushed passed endurance. Her mouth opened on a long, desperate cry, through which Matt’s voice cut like the smooth power of a shark’s passage.</p> <p>“Stop.”</p><p>Chapter Five</p><p>She’d never brought herself to climax with knowledge. Once, when she’d watched a romantic movie with a mysterious hero, she’d found herself rocking on the couch, her hand somehow finding itself between her legs, just a tentative pressure, and all of a sudden there was a snap of sensation that shuddered through her, hard and fast, somewhat unsatisfying but intriguing and shaming all at once.</p><p>She willed the two men not to listen, knowing from earlier experience tonight that what had been coming was that pop a million times over, like a sparkler compared to a full Fourth of July fireworks show.</p><p>Unfortunately, Ben’s mouth and the last pearl withdrew, as did Peter. He gave her breasts a lingering caress as he pulled away, a gentle tug on one of the diamond jewels. She had a brief glimpse of his aroused countenance, his wet lips, before he slid the blinder of her mask back in place as if on signal from Matt. She fought him, thrashing her head, snapping at his fingers, but Peter had the advantage of mobility, if not of calm.</p><p>Hearing the ragged edge of his breath, the tremor in his fingers, she wished she could see his reaction like she had the others. It had been hidden by the table’s height, but she knew it would be there, as enormous as her own need.</p><p>Ben’s lips brushed a fleeting caress on her left ass cheek, a tiny nip of teeth that made her jump a little, before he stroked the small of her back with a slick finger and withdrew.</p><p>Like a creation of flame, she vibrated with energy, all her exposed secrets throbbing with the need for more fuel, more friction. She felt like weeping or screaming or both, a wanton creature with no desire for control, only possession.</p> <p>She shouldn’t have recognized herself, this strange, mad creature who had been brought to this pinnacle so easily these three times now, but she did. She knew the face, she’d seen it inside the mirror of her mind, a reflection she never let out. A Savannah that had crept out of hiding, willing now to roar out every desire, every secret, every shameful need, to a roomful of men who had coaxed that alter ego out. It was dangerous, frightening thinking, and some rational part of her said this whole evening was a terrible mistake, from which she’d never be able to reclaim her life, but at the moment all she cared about was the aching want between her thighs, and within her heart.</p><p>Fill me with what I never believed existed.And if she was wrong and it didn’t exist, she knew whatever sense of Savannah she had outside of her father’s mold would die. She would die, in all the ways that mattered. But that was perhaps better than living with the emptiness, the lonely pain.</p><p>“Savannah, are you listening to me? Can you hear me?”</p><p>Matt’s voice penetrated the roar of arousal within her, and she jerked her head, whether in a nod or negative, she didn’t know.</p><p>“I knew we could offer you passion tonight, make you understand what could be yours if you were willing to trust and be vulnerable. You’ve given every man in this room an incredible gift. No matter what happens in the next few moments, what choice you make, I want you to know that.” He hesitated, and the raw quality of his voice, the rough desire and emotion mixed, caught more of her attention.</p><p>She wondered where he was going with this, but hoped it was somewhere that would ease this craving need.</p><p>And soon.</p><p>“You’ll walk out of here as cherished and respected as you were when you walked in. Every man enjoys teaching a woman the ways of pleasure, especially a woman he loves, and every man in this room loves you. I wanted you to experience a wide range of sensual possibilities and fortunately, each man here has very individual specialties.”</p><p>What was the phrase she often heard her secretary use to describe something blatantly obvious? Boy, howdy. She was close to being hysterical, she realized, and tried to take some deep breaths, get a grip on her raging body.</p><p>“I wanted you blindfolded now, because I want you to search only your heart for the answer to this next question. You can go back to the reality of your life as it was before you walked in here tonight. There will be no recriminations, no sense of favoritism. It will all end here.</p><p>Everything will be the same tomorrow. You’ve won the right to choose.”</p><p>“Choose?” The word felt awkward, somehow unwelcome on her tongue.</p><p>She didn’t want to have choices.</p><p>When she lost control, she’d been given mind-altering pleasure, made even more intense by the fact she no longer had to worry about whether Savannah Tennyson was making the right decisions. She realized in a heartbeat the significance of Rule Five.</p><p>Discipline is a 24/7 exercise. Lose a grip on it even for a moment and you could lose everything you’ve worked for.</p><p>Get out of my fucking head.</p><p>The reaction froze every system in her body, even shut out Matt’s voice and her surroundings for a blink of time. Everything tonight had been a surprise, something unexpected. But that vicious thought, targeted at her father’s memory and coming out of her subconscious like a snarl from behind the gates of Hell, was the biggest shock of all.</p><p>She did have choices. For the first time in her life she was aware that choices existed for her , Savannah, and she was free to make them. Peter, Lucas, Jon and Ben had helped her see that. And Matt. Matt.</p><p>“I want to see,” she said sharply.</p><p>“I want you to think,” he responded.</p><p>“I need you to think very carefully about something, and I want you to have no distractions.”</p><p>When he was delivering a deal breaker, his voice would change, modulate, and just like a regular poker opponent, she recognized it.</p><p>This was dead serious, no bullshit, no games.</p><p>“Here are your choices. Choice number one. You’re obviously in need of physical release. Jon has brought a larger invention, something that will fill you as fully as a man’s cock. Every man here would enjoy watching it give you the level of orgasm your body is ready for.</p><p>“Choice number two. You can choose to call it over. We’ll clear the room. I’ll untie you, help you dress, and tonight will never be referred to again, by any of us. Or...” There was a slight pause, and she waited, not sure how she felt about either option and hoping there was another, one that this straining need in her would recognize as the right one and eagerly embrace.</p><p>“Choice number three. Your final choice. You can choose one of us to do what Jon’s invention will do.”</p><p>It took a minute to sink in. “You mean...”</p><p>“Any one of us.” His voice was firm, resolute now. “The rest of us will go.</p><p>The man you’ve chosen will stay with you, meet your desires, whether they be physical or emotional. He’ll make sure you get home safely afterward. No demands after that.”</p><p>“No demands,” she said hollowly.</p><p>“None.”</p><p>Unexpected pain landed like a load of bricks on the shuddering waves of pleasure still gripping her, which made her feel like a dog that had been kicked by a beloved master, uncomprehending of why, making the pain that much worse. But the analogy cleared up the source question, and she struggled to channel the pain into fury and lash out.</p><p>It built in her, so suddenly that she felt lightheaded, all the blood rushing to her face, but at the same time she was swept by a desolation so exponentially fierce that she couldn’t draw breath from anger, or control the direction of her thoughts or words.</p><p>“So you don’t want me,” she said.</p><p>“What?”</p><p>It was a very rare moment to catch Matt Kensington by surprise, to the extent it could be heard in his voice.</p><p>“This was all...a nice game. Fun... amongst colleagues.” She managed to create a sharp laugh, like a razor blade along her own skin. “I can’t thank you all enough for devoting your evening to fulfilling every woman’s erotic fantasy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was at an atavistic level of need, to the point where action could be the only communication, but Matt had restrained her so there was nothing she could do to influence events.</p><p>Roused to a painful, raw state by Ben’s pearls and clever fingers, Peter’s mouth, by everything they’d done and shown her tonight, her insides were like the slopes of a California hillside under pummeling rain. Mudslides were roaring to life, revealing the primal underside of her earth, smothering her civilized façade. The images still flickering on the wall stimulated her body still, even without the benefit of her sight.</p><p>Anguish squeezing her lungs, she choked against the hard, relentless force of strangulation. There was nothing left but a burning ache, desire and loss come together in a head-on collision at fatal speed. She</p> <p>tasted tears on her lips, and knew she should be horrified by her weakness, but they had forcibly dissolved that concern an orgasm or two ago.</p><p>“Savannah.” Gentle hands removed the blinders, and Lucas was there, his eyes thoughtful, a little sad, but with a light that suggested he had hope for them all. “You’ve rendered him speechless. I think he’s one step from apoplectic.”</p><p>She looked at Matt through her tears and suddenly wished she was untied.</p><p>Out of a sense of self-preservation.</p><p>Matt looked more angry than she’d ever seen him. Not a cold controlled anger, either—the enraged passion of a man pushed past some boundary of restraint.</p> <p>“This is your own fault,” Lucas said, unperturbed.</p><p>She glanced back at him, startled, realized he wasn’t talking to her.</p><p>“Just tell her straight out, for Chrissakes.”</p><p>“Leave us, then,” Matt said.</p><p>Savannah felt a sudden surge of fear, but Lucas laid a hand on the tender area between her shoulder and neck.</p><p>He lowered the harness so she was on the table. Ben helped him free her legs. Hands straightened her, caressing her thighs, bringing her feet back to the floor. The suspension device and all its components were removed from around and beneath her. With gentle pressure, Lucas kept her upper body on the silken mahogany. He slid off her mask, though, laid it aside and smoothed her hair back, his thumb brushing over the path of a tear. He leaned down, kissed her temple. “You’ll be safe with him.”</p> <p>“Lucas.”</p><p>“Going.” He straightened, made a quick gesture with his head and they all left, melting into the shadows and stepping out the door, four men who had profoundly altered her reality in the space of an evening.</p><p>Now she faced what her destiny would be tomorrow.</p><p>Despite Lucas’s not-so-subtle hint, she pushed her body up. Naked though she was, she felt less vulnerable facing Matt with her back straight. And her clothes were folded over the chair not more than a yard from her.</p><p>She discovered two things immediately. One was that Lucas had had a practical reason for encouraging her to stay down. The body she had walked in with several hours before had suddenly become heavy and unbalanced, her knees trembling, her vision blurring and tilting as blood rushed back into her torso.</p><p>The second thing was that Matt moved a lot faster and more silently than she anticipated. With her head spinning, she wasn’t even aware of his approach, but suddenly he was there, the heat of his hands on her hips, the faint scratch of his slacks pressing against the back of her bare legs, his white shirt against her shoulder blades, the silk of his tie a caress against her spine.</p><p>It got very quiet between them, and Savannah could only hear the sound of her own harsh breathing, the echo of her words, obviously laden with hurt, lingering in the room. She had no choice but to lean, but in truth, it was a relief to feel him there. That he was still angry she’d no doubt, but he obviously wasn’t intending to take it out on her in some frightening way.</p><p>She hoped.</p> <p>“I don’t know you enough to trust you like this,” she mumbled, but still she didn’t move. If anything, she</p><p>settled back against him as he took a more secure, possessive grip on her waist, his hold sliding forward so his arm was over her abdomen, his palm over the opposite hip as he raised his other hand, applied gentle pressure until her head was on his shoulder, the upper slope of his chest.</p><p>“Yes, you do,” he said quietly.</p><p>He’d gotten her to admit she wanted him, not as a moment of passing lust, not to act on a curious attraction. All the desires he had roused through his men had culminated in one raging truth—that it was him she wanted, him whom she now leaned against, the only one she trusted enough to reveal such a need. From the very beginning, she had denied it in every way, that he was the culmination and solution.</p><p>He’d exposed the lie by not offering what she had expected him to offer to close the evening’s deal.</p><p>She’d been outmaneuvered, and now there was just the frightening truth between them. He held all the poker chips, and he could tear her to shreds. But she still had his desire for her to bargain with, shift some of the balance to her side of the table.</p><p>“So what does Lucas want you to tell me?” She leaned her head into his touch, nuzzled him with her lips deliberately. He pulled loose, lowered his grip, closed it over her throat. Feeling her fragile pulse beating against that powerful hand made it beat harder.</p><p>She looked up into those dark eyes, sensual lips, imagined them moving over her. That’s it, Savannah.</p><p>Focus on what he could give her on the surface, two bodies satisfying each other. What was beneath didn’t matter. Couldn’t matter.</p><p>“I’m sorry I was catty,” she said abruptly. “You set this up and we all enjoyed ourselves. I just went all female on you for a moment.”</p><p>“Did you?” He cupped her chin and held it so she was locked into looking up at him, into his unfathomable gaze.</p><p>“You know I did. It was a slip, that was all. It won’t happen again.</p><p>There’s no reason we can’t enjoy each other—”</p><p>“And keep all our commitments tomorrow, meet every appointment.</p><p>Savannah, I am not your bloody fucking father.”</p><p>Her body went rigid. The anger was still there, blasting her with its heat, but his eyes held something else, something close to pain, that she’d never seen in his eyes before. A part of himself he was deliberately revealing to her. He turned her, his hands closing over her shoulders.</p><p>“Well, I certainly hope you aren’t him,” she managed. “Otherwise, what just happened in this room—”</p><p>His grip tightened further, nearly dragging her to her toes.</p><p>“Matt—”</p><p>“Just shut up, before I decide to strangle you.” He placed his finger on her lips. “Listen to what I’m saying. Look into my eyes and stop being afraid of what this is. It wouldn’t have hurt you so much, my proposal to let you choose anyone, if it weren’t real, what you’re thinking.”</p><p>“Let go of me,” she said.</p><p>“Never again.” He shook his head.</p><p>Shook her. “We wouldn’t want you to go all female on us, would we? Hell, don’t stop there. Let’s not be human while you’re at it. Why should you have needs, desires and, God forbid, express anger or pain where someone else can see it? I want a human woman with a healthy mixture of weaknesses and strengths, who sometimes laughs inappropriately, or gets in real fights with me. Someone from whom I beg for forgiveness, even if I know I was right, because I know making her happy is more important to me than being right.</p><p>Someone who doesn’t want to be alone.”</p><p>“I’ve been alone all my life.”</p><p>“Lonely all your life.”</p><p>“Yes, goddamn you.” She shot it back savagely, and there was a rough, tearing quality to her voice, somewhere before a shout and a snarl. She startled him enough she managed to pull away, back up several steps, and snatch up her blouse. “Yes, I have been, Matt.</p><p>Boohoo for me. The princess in the tower, given everything she wants except her daddy’s love. So what? You’re going to make it all better? Is that what the hell this is all about?”</p><p>“Yes.”</p><p>“Well, tough, because it doesn’t work that way.”</p><p>“Yes, it does. It can. It should.” He took a step toward her, like a man approaching a wild and dangerous animal, not with fear, but respect and caution, not wanting to harm the creature. “I love you.</p><p>It’s as simple as that. And if you’re willing to give that a try, even give it just a moment of belief in your heart, I promise I won’t let you down. You won’t feel lonely anymore.”</p><p>“You’re out of your fuck...idiotic minds, all of you.” She nearly screamed at the amusement that came into his eyes at her avoidance of cursing. “Don’t you dare laugh at me, Matt Kensington.” She snatched the belt off the table, flung it at his chest.</p><p>He caught it, the amusement turning into annoyance. Good.</p><p>“You’ve stripped me down, great.</p><p>You blithely tell me you love me, without taking off one piece of clothing, metaphorical or otherwise.</p><p>For all I know, it’s just a good con, the whole thing, because as far as I can tell, you haven’t even broken a sweat tonight. So, tell me what Lucas wanted you to say. Get off of your high horse and tell me what this is all really about. “ “It’s about asking you out on a goddamned date.”</p><p>He shouted it so fiercely it echoed through the room. She even imagined she heard the windows of the high- rise rattle.</p><p>“What?” It was such an unexpected statement, she had to grope for something to say, particularly when he continued to glare at her without further explanation. “Matthew, this is not your average first date.”</p><p>He chuckled at that, but it was a harsh sound. “You’ve got that right.</p><p>‘Didn’t break a sweat.’ Jesus Christ.</p><p>I ought to wring your neck.” He rubbed a hand over his face, through his dark hair until it stood on end in a very appealing tousle. “This entire night, the idea of it, started because I wanted to get involved with you, and I didn’t think anything short of something this dramatic would work. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If you’d accepted my invitation to go out on a date, and treated me in that clinical, detached way you do those other losers I’ve seen you attend political functions and movie premieres with, I think I’d have had to kill you.”</p><p>She stared at him a very long moment, and there was no motion in the room except for the flickering light of those many different screens, showing the story of her life for the past few hours.</p><p>She lowered her gaze to the blouse she was holding. It was an odd contrast to her pale naked body, and the soft glitter of the lovely chandelier nipple jewels. She liked the way those looked, and how Matt’s eyes kept straying to them.</p> <p>Savannah struggled past those thoughts, to what was going on in her own head. To what she knew she had to be brave enough to say, if she truly wanted to believe Matt’s words.</p><p>It was five minutes before she found the courage, and to his credit, he waited, motionless, through the extraordinarily long pause.</p><p>“You know,” she said, her voice thick, not her own. “One day I was in the elevator with this young girl doing summer work in the mailroom.</p><p>She had on the prettiest pair of sandals. I kept staring at those shoes, and I thought... ‘I bet she really enjoyed buying those. I bet she likes looking at the way they look on her feet.’ And it made me feel so sad...”</p><p>“Savannah.” He took a step toward her, but she closed her eyes, shook her head. “And I knew then, though I didn’t admit it to myself. I’ve never bought clothes, shopped for fun, done anything out of a sense of spontaneous whimsy.” She took a deep breath, raised her head and met his eyes squarely.</p> <p>“You’re right. You’re all right. I was Geoffrey Tennyson’s cyborg, from the day my mother died. So you are all absolutely right. As much as I’ve fantasized about you, and wanted you, I would have treated you exactly that way. I wanted to be cruel to you tonight, finish up with all this and walk away, but I can’t. I want you, Matt. And admitting that terrifies me.”</p><p>“And love?”</p><p>She lifted an uneasy shoulder. “I don’t know what that is. I do know...” her voice lowered and he came to her, so when she raised her head, she was looking directly up into his face, her bare body erotically almost pressed against his fully clothed one. “I know you’re the ‘someone’ in the fantasy to comfort myself. Every time. You always have been, since the day I met you.”</p><p>Reaching down, she picked up his hand. After only a brief hesitation, she brought it to her lips, pressing her face into his palm. Something seemed unusual and she raised her face enough to look at a wound on his palm. A deep wound, like a puncture.</p><p>His blood had coagulated, but the wound was hot to the touch, sticky.</p><p>“What—”</p> <p>His other hand touched her face, tracing the light impressions she could feel where the mask had pressed against her face.</p><p>“I kept digging my hand into the screw set under the table to keep myself from breaking down and releasing you. I almost broke, every time one of them touched you, every time you came, every time I heard the fear in your voice. I wanted this to be the right thing. And I told myself I was sure. But every time you got upset...” A tremor ran through his hand, amazing her. “Don’t ever make me go through that again.”</p><p>“Make you—” She saw the trace of a smile in his eyes, a moment before her knees gave out on her.</p><p>“Whoa.” He caught her at the waist as she gripped his coat lapels for balance, and before she knew what he was about, he’d lifted her off her feet and was headed to the couch.</p><p>“I didn’t feed you enough, I think,” he observed.</p><p>Not to mention what three or four mind-blowing orgasms in one night can do to someone.</p><p>He laid her down on the couch and then straightened, retaining one of her hands in his, studying her.</p><p>“Matt,” she whispered. “Matt,” she repeated softly, seeing what was in his dark, intent eyes. She was afraid to put her arms around him, afraid to stroke her fingers through his hair, afraid to do anything.</p> <p>Struggling against all her natural instincts to curl into a protective fetal ball and deny what she was so scared and hopeful was the truth.</p><p>Never lose control.Her father had told her, from her very first tantrum.</p><p>You give the enemy the advantage when you lose control. And it took her very little time to understand he meant that to apply to everything, because to him there wasn’t any time that wasn’t about business, the business of life, the ultimate corporation. You ruled your life and everyone around you with iron control, or you opened yourself to defeat, to takeover. To failure.</p><p>To the disappointment in her father’s face.</p><p>Oh, God.To think that her whole life, the compass she followed each day, had always pointed to that.</p><p>One tyrannical man’s expectations, a man who was dead.</p><p>Nobody could possibly understand how hard it would be to let that go, when her whole life had been structured on it. The idea of turning to something different was the same as detonating a bomb that would blow up her foundation, her world. She’d been called a Daddy’s girl, but that implied something soft, with golden curls, like Lucas had described.</p><p>She’d been his weapon, his tool.</p><p>But tonight had been about who she was, Savannah. And by making it about that, Matt had told her clearly, through action, that it was her he wanted. Not the weapon of Geoffrey.</p><p>Her. And though she might not have much of an idea of who Savannah Tennyson was, when she looked into Matt’s eyes, she saw he knew. As if his eyes were the mirror she’d never been able to find to show her what her true face was. And there she finally had the truth of why he was always the center of her comfort fantasy. Of every fantasy.</p><p>“You really do love me.”</p><p>His hand reached out, smoothed her hair from her temple, tilted her chin so she had to look up at him, into his unsmiling, devastatingly handsome countenance.</p><p>“And you love me, sweetheart. I’ll wait for you to know it, the way I do.”</p><p>It was such a reflection of her own thoughts, she had to stifle tears. “We don’t...we haven’t even gone out on a date. I’m not counting tonight, Matthew.”</p><p>“I beg to differ.” He caressed her hand, playing idle finger games with her, a wonderfully intimate pastime that fascinated her. “Over the past two years, we have had over thirty- eight dates. We’ve played the same fencing games that dating couples play. We’ve even spent the entire night together, several times. We’ve ordered food.”</p><p>Her mouth turned up into a shy smile.</p><p>“Matt, you’re as dysfunctional as I am. Those are meetings, not dates.</p><p>Next thing you’ll say is that the video we saw on the new line of hydraulic nailers was the same as going to a movie.”</p><p>“I laid an arm over the back of your chair. I would have tried to cop a feel, but figured you’d chew my arm off at the shoulder.”</p><p>She laughed then, and it wasn’t as hopeless a sound as she expected it to be.</p><p>He removed his hand from hers, began to loosen his tie.</p><p>“What...what are you doing?” Her throat had gone dry, knowing exactly what he was doing. The trembling in her thighs increased, and all the passion stroked to life but unfulfilled by Peter and Ben flared as if there had never been a lull. Every cell of her body begged.</p><p>“You know what I’m doing. You’re mine. And notions of twentieth- century promiscuity be damned, we both know the way I intend to stake my claim on you, make you mine forever.”</p><p>Chapter Six</p><p>“Have you thought of just asking?”</p><p>she asked softly, stilling him in the act of unbuttoning the third button of his shirt, exposing the fine dark hair of his chest that her fingers longed to stroke, tangle in, clutch when his body slid into hers.</p><p>“You know the rules of negotiation.</p><p>Never give them a chance to say no.”</p><p>A full smile curved her lips this time, and she watched his eyes settle on her mouth with erotic intent. “Be brave, Matthew.”</p><p>Matt seemed to weigh her words, every aspect of the moment, down to the ticking of the clock and the hum of the lighting.</p><p>“Don’t calculate the risk, Matt,” she said, the silence driving away her tentative assurance, making her eyes prick with the threat of tears. “This is so hard for me. Please, just... believe...”</p><p>In something larger than us both.</p><p>His eyes softened, and the crucial moment of connection was made, a moment of such impact she almost heard the click. “You’re right.” He dropped to one knee beside her. “I am very much in love with you, Savannah. I’ve wanted you from the very first moment I saw you. Since the moment we met, you’ve stirred me up, made me think thoughts so fantastic you’d laugh at them.”</p><p>“Like what?” She touched his face, grateful that he stayed still, letting her fill with wonder at the simple pleasure of feeling his jaw beneath her fingers, knowing from his expression he wanted her hand there.</p><p>It was a miracle to be wanted. She wondered if he could possibly understand that.</p><p>“You’re crying,” he said softly, and she nodded.</p><p>“You haven’t told me an example of fantastic thoughts.”</p><p>“Forever thoughts. A house. A dog. A shared portfolio.”</p><p>She laughed then, a quick hitch into a sob. His gaze on hers, he stayed on one knee beside her, but finished unbuttoning his shirt, drawing her attention down to his hands. Her body’s urgent hum increased, disrupting her emotional focus. She had never felt so many different things at once. Her fingers trailed down his neck, followed the opening in his shirt to feel a man’s chest, again for the first time. A shudder ran through his body. A new miracle. She lifted amazed eyes to him.</p><p>“You’ve brought me to a place I’ve never been tonight, Matt,” she admitted. “And I’ve no idea where to go at this point but to lead with my feelings, even knowing that I’m giving you every opportunity to cut me to ribbons. I want you. Please.</p><p>Just don’t...” It took every ounce of courage to say the words, and she was proud they came out, not as a trembling plea, but a quiet, steady request. “Please don’t hurt me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She wasn’t talking about the act. She knew he understood that. She’d never asked anyone for protection or defense. Instead, she’d become a master at preventing people from hurting her. She’d crafted herself into a knight forever trapped in her mail, the metal becoming her true skin while everything inside withered away from lack of sunlight, stimulation...touch. He’d broken her out of the mail, and she was shivering, naked, completely vulnerable. Completely alive.</p><p>“Never.” His voice was rough with emotion, and he came close, held her face cradled in his hands as he pressed his forehead to hers, touched her lips with his mouth. She cupped her hands over his strong, warm ones. “I’ve wanted you to say that to me for so long,” he murmured against her mouth. “To hear that you trust me enough to ask it. Never, sweet Savannah. I’ll destroy anyone who causes you a moment of pain.”</p><p>The totally male, totally unrealistic promise nevertheless squeezed her heart into her throat, stopping her breath as much as when he straightened and slid out of the shirt, his tanned skin a golden gleam beneath the room’s dim light. He had beautiful musculature under the fine layer of male fur, and she could not help following the sleek lines of him down to the waistband of his slacks.</p> <p>“Do you want more?” he asked quietly, his hand at the fastener.</p><p>A tiny smile curved her lips. “My specialty is production. What do you think?”</p><p>He chuckled, but she did raise one hand, holding them just a moment.</p><p>“Just...go slow. You’re kind of overwhelming. Actually, this whole night’s been a bit overwhelming.”</p><p>“I know,” he said, a trace of regret in his voice. “If I were any kind of gentleman, I’d wait, but Savannah... God, it’s like a vampire thing. I have to make you mine by dawn or I’m afraid I’ll lose you, that I’ll see you tomorrow and you’ll be back behind your armor, convincing yourself it didn’t mean what it meant, any of it.”</p> <p>His heated gaze traveled up her bare body, spreading fire. “But if you feel the soreness, the stickiness of my come drying between your legs, the smell of me on your skin, see a red blush on your jaw in the mirror tomorrow from the rasp of my beard, you won’t.”</p><p>“It’s a signed deal, then,” she whispered. She lifted her arms. “Will you come and just...lie on me a few minutes, before you take everything off?”</p><p>He had bought a man’s couch for his boardroom, so it was a good seven feet long and nearly three and a half feet wide. He tossed the small cushions scattered on it, except for one, which he adjusted under her head and shoulders, making her comfortable, before he stretched out upon her as she had requested.</p><p>His finger trailed along her thigh with gentle pressure so she widened their span to accommodate his hips</p><p>and long legs between them. She liked how he adjusted the pillow beneath her, scooping his arm under her shoulders, holding her face close to his chest, his chin brushing the top of her head as he saw to her comfort.</p><p>What would it be to get used to that, someone caring how she felt, not because she was responsible for thousands of people’s livelihoods, not because she was a legacy, but because he cared?</p> <p>And what would it be to care for him the same way, hold his hand at a movie, stroke his brow after a trying day, see him laugh at something on television, see that toe poke out of the end of its sock?</p><p>“How’s that?” he asked in that sensual, bedroom-hushed voice. “Am I too heavy?”</p><p>The pressure of him on her was like the pressure of too much happiness on her heart, something so unfamiliar it was almost painful. It was a feeling close to heaven. His arms curled on either side of her head, her vision totally dominated by his handsome face, the dark eyes, that incredible mouth. Daring, she lifted her chin, reaching, and like a miraculous telepathy, he came down to meet her, with a soft, gentle kiss that was perfect. She parted her lips, shyly tasted him with her tongue, touching his lips, then his tongue, and felt the new sensation of his body tightening in response to the provocation. The friction of him against the juncture of her thighs, separated only by the trousers, pressed insistently, male power and strength held back only by his caring toward her. She closed her eyes as the kiss deepened, and a hundred things flashed through that darkness, things that had always been there, that she had refused to see. A hundred ways he had supported her, contributed to her reputation, respected her. She had focused on the battles, never allowing herself to see what else was there.</p><p>A million kindnesses. She remembered now, in stark detail, tiny things. Him reaching toward the center of the table, filling her water glass when it was almost empty, though his was full, underscoring that he was doing it as a courtesy to her.</p><p>Silly, but now it seemed full of meaning. The many times he’d called her during the week, to discuss this or that detail on their mutual business interests, but in some subtle way he’d lifted her spirits by making a dry joke or witticism about something they both understood. The fact that he’d sent her flowers every Friday since her father’s death.</p><p>She loved roses. She supposed he’d found that out from her office assistant. He’d sent her the first bouquet right after her father’s death.</p><p>She’d thanked him for it, assuming it was the usual condolence gesture.</p><p>Then they’d kept coming, every Friday for the past two years. She hadn’t acknowledged those bouquets at first, figuring if she ignored them he would stop sending them. He didn’t. In all those two years, he’d never sent her the same shade, and never a dyed flower. Always beautiful palettes of hybrids from gardens all over the country. One bouquet had even been shipped from England. At some point she’d started saving one bloom from each delivery, getting them pressed and preserved, and added them to a dried bouquet she kept in her bedroom.</p> <p>Often, it was what she studied as she lay down at night, somehow not feeling so alone by the simple act of gazing at them.</p><p>“You’ve always been there for me, since we first met.” She accepted it.</p><p>Said it out loud.</p><p>“Not as often as I should have been. I should have done something like this a long time ago.” He bent his head, put his lips beneath her ear and cruised down her neck. She arched, pulling on her bottom lip with her teeth as the movement rubbed her body against his, the soft skin of her inner thighs sliding against the outside of his, instinctively pushing her aching center against his hardness. She was amazed at her own wantonness, unleashing itself now that she...</p><p>He raised his head as if he felt her reaction to her own thoughts.</p><p>“Savannah?”</p><p>“I trust you, Matt. I’ve never trusted anyone, not in my entire life. I think that’s why tonight was...possible. I kept asking myself why I wasn’t screaming and fighting you, why I wasn’t dialing 911 when I got free, and this was it. You knew, didn’t you? Since that day on the desk, like you said.”</p><p>He nodded, his heart and his desire for her in his gaze. “I knew.”</p><p>“And that I would...” She suspected “enjoy” wasn’t the proper word. “... respond to this type of thing?”</p><p>She wasn’t worldly about sex. She just knew it felt good, that she craved more.</p><p>“Yes.” He kissed her nose, lingering so she closed her eyes, savored. “I knew you were mine the first time I saw you, and I knew you’d be willing to be submissive to the right man, the man you could trust to take care of you when you have to be in control of everything else.</p><p>“You’re a strong, strong woman. The most basic way to prove that to you, the way the predator in you would understand, was to take you down the way another predator would. Make you expose your throat and concede my dominance over you.” He tilted her head back with a thumb to her chin, and set his teeth lightly to her jugular, flicking it with his tongue.</p><p>“As your mate. The one who cares for you and needs you the most. Who would never hurt you.”</p><p>The words were offensive, but the truth behind them was so primal, so intuitive and beyond the realm of political correctness, her pulse leaped, not in anger, but in response, and her thighs relaxed, accommodating him further, sending exactly the message he had said he would pull from her. Total submission.</p><p>“I...I don’t want to be free to choose any longer, Matt.” She got out the words, and she meant them so deeply, it was hard to form them. “I want to belong to you.”</p><p>With an almost feral growl of need, he lifted up from her, just enough for there to be a space. “Open my slacks.”</p><p>With trembling fingers, she found the hook fastener, slipped it, took down the zipper, her wrists brushing the hard heat beneath. He reached back, pushed them off his hips.</p><p>“Matt,” she said softly, not daring to look him in the eye. “Will you...can I feel all of you at once? Will you be...”</p><p>“Naked?” His eyes smiled at her, though his jaw was tight with his desire for her. “Anything for you.</p><p>Anything you ask, I’ll give you.”</p><p>He lifted off her, meliorating her immediate sense of loss by taking her hand as he rose, kissing her knuckles in a gallant gesture that ran electricity down her arm, tightening her breasts and the wet folds of her sex.</p><p>Then he took off his shoes, one by one, pulled off the black dress socks, making her smile when he put his hand in one to show her the hole in the toe. His slacks were open during the process and her eyes were drawn to the play of his well-defined stomach muscles just above the band of his underwear, the black soft jersey boxers. He slid the slacks off, tossed them over one of the conference room chairs, then removed the boxers as well. He saved his watch for last, and she was able to watch the play of muscles in his arms and chest as he bent his elbows to perform the removal task, and look her fill at his bare body. He made no move to adjust his stance, keeping his blatant arousal, his whole body, open to a thorough appraisal.</p><p>She was shy about him watching, and he must have noticed. “Look all you want,” he said gently.</p><p>“There’s no shame in wanting to look, and the way you’re looking at me just makes me want you more. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This is as much your body to look at as yours is mine. I’m all yours, sweetheart.”</p><p>The heavy sac of his testicles rested against his thighs, the long, stiff cock jutting from a nest of soft, dark curls, midnight like those on his head. The outline of his hip suggested he had as fine an ass as she’d always suspected from surreptitious study of it when he was clothed.</p><p>“Did you know that I looked, sometimes?” She couldn’t take her gaze away, and in a spontaneous gesture, she wet her lips.</p> <p>He groaned, gave her a half laugh.</p><p>“Yeah, I did. A lot of times I caught you eyeing my ass. Once I caught you studying my crotch.” Her gaze shot up, sparking, and he laughed outright.</p><p>“Well, you did. It was the airline contract.”</p><p>“Well, those were very tedious negotiations,” she defended herself.</p><p>She was getting cold. She wanted him here, on her again, to feel that comfortable, solid weight pressing her into the couch. “You don’t have to remove the watch.”</p> <p>“Yes, I do. It can catch a nipple or a hair unexpectedly, and I don’t want to cause you a moment more of discomfort than I have to. Savannah, have you ever used anything inside of yourself? A vibrator?”</p><p>At her confused look, he explained, in a husky voice. “I need to know how tight you’ll be, honey. So I don’t hurt you.”</p><p>She shook her head, flushing. “Of course not. Good grief, Matt, I have a houseful of domestic staff.</p><p>What would they think if they heard it or...found it?”</p><p>He smiled, propped an arm on the couch and came back down on her with an animal-like deftness that took her breath. He used his knee to nudge her a little further apart, and then put the other hand between them, stroking through her labia, finding her slick and warm. Savannah gasped on a moan, and his eyes darkened.</p><p>“What will they think the first time I take you to bed there, make you scream and tear the wallpaper because I have your wrists cuffed between the slats of the headboard? Ah, sweet Christ, your pussy just rippled against my touch. Feel me, baby.” And he slid his fingers into her, slow, pressing upward so she felt the flesh of his palm against her clit as he explored her pussy.</p> <p>“Matt.” She gripped his biceps, holding on, her neck straining, her head against his shoulder as her body struggled beneath him.</p><p>“Beg your Master to take you, Savannah. Tell me you belong to me again.”</p><p>A lifetime of distrust somehow had no ability to withstand the flood of emotion that his words evoked, the overwhelming lust gripping her body, a different intensity than even what she had experienced with his men.</p><p>That had been physical, she realized.</p><p>This was more, a longing for fulfillment on all levels.</p><p>Now she understood what Jon had meant, the pleasure that would be ten times greater than anything else that had occurred tonight, if she recognized and accepted it.</p><p>Surrender. Love. Full submission to the man she loved, an intense emotional and physical pleasure like she’d never known swamping her at the simple verbal declaration.</p><p>But she had one last holdout, one last need to be met, and she would ask it, because she knew now she</p> <p>could trust his answer.</p><p>She managed to get her hands from his arms up to his neck, caressing his jaw, so their eyes were locked in a moment that was simple, mutual absorption.</p><p>“If I tell you that, will you keep me, forever and ever? Never leave me? Never leave me in any way, never stop loving me?”</p><p>Please don’t be my father. Don’t live in the same house and let your heart not be there.</p><p>He took his fingers from her, making her shudder, and closed his hand on one of hers, laying it to his heart. “I will never leave you, not in any way, Savannah,” he said, his voice laden with emotion. “From today forward, for all eternity. You’re marrying me this weekend. I’m never going to let you know loneliness again. There’s a diamond ring in the pocket of my slacks, and it’s going on your finger before you leave this office tonight.</p><p>That was my gift.”</p><p>The tears welled up then and as he bent to kiss one off her cheek, he shifted, his eyes still locked on hers, and his cock seated itself in her channel, just the head. Her muscles closed around him in a fist of reaction, tightening his features.</p><p>“Don’t tense up, honey.”</p><p>“Who’s tense?” she gasped. “Please Matt, just do it. I need you inside me now.”</p><p>He slid his arm under her waist, tilting her up to him, and nodded.</p><p>“Hold onto my shoulders, then.”</p><p>She did, spurred by the hoarseness of his tone, the obvious desire for her expressed by every part of him, even parts she could not see, but could feel, surrounding her, empowering her.</p><p>Her passageway was ready for him, but he eased in, using small strokes.</p><p>She felt in wonder the sensations of his flesh brushing her inner thighs, the hard flesh of his abdomen, his soft hair rubbing against her belly and chest. She slid one hand down, following the plane of his back, and curved her fingers over his buttock, digging her nails into him in reaction as he stroked her again.</p><p>He growled, his body tensing under her touch, and he came all the way into her in one inexorable deep stroke, a claiming she gladly welcomed, binding her to him.</p><p>She could hear her father’s voice in her head. It’s what all men want, Savannah. A woman’s capitulation to their desires. It’s a hunt, a game to us, a deadly game. Once they win, they may indulge you or even themselves that their emotions are involved, but that passes.</p><p>He’d never allowed for the reality of love, and so, being a good daughter, she’d never allowed herself to believe in it. But she knew now her woman’s heart must have protected some tiny spark of belief, like a fairy captured inside her hard ironclad soul, and kept alive all these years by the things she’d noted subconsciously. The old couple walking hand in hand in the park, not part of a slick diamond commercial, but real. The always painful sight of a young father in the office, holding his wife protectively and proudly in the circle of his arm as he introduced the new baby daughter to his co- workers. Or in the hospital, when her father was dying, she remembered a room where two men sat, one dying of AIDS, the other holding his hand, rubbing ice on his dry lips.</p><p>She’d only touched her father when he was in the final coma, beyond consciousness. She’d briefly held his hand, wondering if she’d feel a tightening of his grip. If she had, she knew it would have been a physical reflex only, but she could have pretended it was a response to her.</p><p>The flowers, the times Matt had called, the time at the funeral, those had been gentle insinuations into her life. A taming more than a hunt, teaching her patiently to trust him, so when he chose to claim her, she walked willingly into his arms, into his thrall.</p><p>“Say it again,” she said softly. “Say it so my heart will hear it.”</p><p>He had stilled within her to give her time to adjust, and he pressed his cheek to hers, his breath in her ear.</p><p>“You’re mine, Savannah. Now and always.”</p><p>He withdrew slightly, then moved back in, and pleasure rippled through her abdomen. She raised her legs higher, tightening them over his hips, drawing him deeper. He filled her everywhere with this act of joining, and it was so easy, so clean. She wrapped her arms more tightly around his shoulders, feeling all his power, now all hers, as much as she was his, as he raised his hips, lowered, raised, lowered.</p><p>Controlling her, sliding along her passage, building up a fire that had the power of a detonation. He was deliberately teasing it to the surface, making her cling tighter, her breath growing harsher against his neck.</p><p>Her nails dug in again and her teeth as well, tasting his heated flesh, the cord of muscle along the line of his broad shoulder.</p><p>“That’s it,” he muttered. “Let it go.”</p><p>What had occurred earlier was earth- shattering, on the field of matter. This was a feeling beyond anything she had ever known or imagined, this incredible emotional and physical coupling. She had no experience to know if casual sex felt like this, but if so, she was sure sex done in love would kill the participant. This had to be love. Had to be. In their entire relationship, she’d never known Matt to lie to her about anything.</p><p>If he said he loved her, he did.</p><p>“Let go, honey,” he urged again.</p><p>“Trust me. Let go. You’re mine, all mine, and I’ll never let you go.”</p><p>Her arms held him tighter.</p><p>“You’re so strong and fragile both,”</p><p>he said. “So delicate. Such soft curves, your hair against my face, your perfume. I’ve never been so aware of a woman.”</p><p>“Never?” She thought of the many she’d seen him with, though she knew she’d been out with a similar number of men and they’d meant nothing to her.</p><p>He raised his head. “Never, Savannah. This is the way it is for a man in love. You’re in control of my destiny now. You’re a goddess to me, but you’re also terrifyingly mortal. I couldn’t stand losing you.”</p><p>“But what if...” She bit her lip as he moved, and his eyes gleamed with amusement and lust, as she struggled to get the words out, to meet his playful challenge. “What about in five years? When you know everything about me?”</p><p>He groaned, half chuckled as she tightened muscles on him, testing her own power. “How could any woman think that revealing herself to a man would destroy her mystery, her allure?” He bent, caught her lips, touched them with his tongue, spoke against her mouth. “Love has a million rooms to discover, sweetheart, and I’ll spend the next ten lifetimes and not know everything about you. I’ll only crave more.”</p><p>Her body trembled on the precipice.</p><p>In her mind, she saw the old couple again, the young parents, the gay couple soon to be parted by death.</p><p>People bound together willingly, to share all the moments good and bad.</p><p>Because that was what life was about. Not strategies and concessions, deals and coups. She saw her father’s face, saw its coldness and lack of understanding.</p><p>Saw it at the end, crumpled in pain, the shields that had kept him from the knowledge of love the only thing left intact. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>What Matt offered might be Purgatory or Heaven, but she was willing to risk either to escape her cold, emotionless room in Hell.</p><p>“Enough talk,” Matt whispered, and he began to move in her again. Long, slow strokes, one arm beneath her body, holding her to him so she felt him pressed all along the length of her, his thighs rubbing the inside of hers. She pressed her face into his neck, heard the rasp of his breath against her ear as he lifted and lowered his hips, and her hands crept down, felt his buttocks clench, release, clench, release with each slow pump into her. Her body trembled, swept by heat, and her breath began to match his rapid rhythm.</p><p>“Your pussy knows its Master, doesn’t it, Savannah?”</p><p>“Yes...yes...” She couldn’t hold her head up, dropped it back, and his mouth took her throat as she felt her hair brush her shoulder blades. God, he was so powerful, so all- consuming. Ah, God...</p><p>“Take me, Matt. Please make me yours, all yours.”</p><p>His strokes grew stronger, his gaze more intent, never leaving the clasp of hers, and as the pleasure swept up through her, inhibitions left and she said the words he’d said she’d say, words she wanted to say, just as the climax began to break over her.</p><p>“I am yours, Master. You’re my... Master...”</p><p>It was a swirling tornado of images and emotions and physical completion, all spinning her up into the relentless fist of the orgasm. His relentless body stroked her without breaking rhythm, nothing to stop the flow of a tidal wave up through her pussy and lower abdomen, spearing out through her limbs, making her clutch him even more tightly, cry out against his skin, seeing their bodies bathed in the flickering light of the muted television sets. The screens had picked up this moment, so she saw the two of them on the couch, the muscles rippling along his back, buttocks and thighs as her slender legs clamped around him, her fingers digging into his shoulders.</p><p>“Yes, baby. Let me hear you.”</p><p>Her voice was a long, smooth utterance, like a wolf howling in low, urgent demand, her need for her mate calling him to her. Everything she longed for was in that one, prolonged note of desire. And as her hands tightened on him, Matt’s body stiffened and then slammed forward into her urgently, over and over. His grip shifted to the couch arm so he did not shove her head into the arm with the force of his movements, his rapid pistoning into her, the hot spill of his seed inside her womb.</p><p>He had chosen not to use any protection, she realized, and that too was another statement of his claim on her. A very significant one.</p><p>He came to a gradual slow halt, keeping up slow strokes that made her mewl with pleasure, until at last he stilled, laid his forehead against hers. She reached up, cupped the back of his head in her hands, felt the damp line of perspiration on his nape.</p><p>Her heart was so full, she wanted to give him something, something he’d know she was giving to him, sealing her belief in his words, his desire for her.</p><p>“I read it last year.”</p><p>Matt raised his head, looked down at her. He curled her in the crook of his arm, turned them so he was lying on his back and she was in the shelter of his arm on the wide couch. He touched her faintly smiling lips and she saw it coaxed a smile from his own. “What?”</p><p>“The Grinch. That’s how I knew about the Who Mouses. I was Christmas shopping and there was a storytelling hour going on in the corner of the bookstore. I lingered in the shelves nearby and listened to it.</p><p>So I guess I didn’t technically read it.</p><p>I heard it read.”</p><p>She reached up, surrounded him with her arms and squeezed. A hug. A basic, wonderful hug he reacted to by closing his own arms around her and hugging her back.</p><p>With a groan, he hauled them both to a sitting position, moved her so she was cradled against his lap, her bottom down against his wet cock, which stirred against her as he snugged her down on it.</p><p>“You’re...” A faint blush rose in her cheeks.</p><p>“Getting hard for you again.” He tipped her chin, held it so she looked directly into his piercing eyes. “I have so much need stored up for you, I’m probably going to have to close down the whole damn fortieth floor for a week to preserve your reputation while I keep you here, ravishing you over and over again.”</p> <p>She didn’t know how to respond to that, but her body did. She saw by the intentness of his gaze that he registered the shudder that ran through her.</p><p>“So,” he said lightly. “You’ll marry me, then?”</p><p>“You’re giving me choices, now?”</p><p>She narrowed her eyes. “If I changed my mind, would you invite your team back in for a renegotiation?”</p><p>He laughed then, a male sound of appreciation that coated her with heat, and she pressed against him instinctively, making his eyes darken with renewed desire.</p><p>“From now on, I think we’ll keep our negotiations strictly a two-person executive session. Kiss me. And for once, don’t be afraid of anything.”</p><p>She reached up, brought her lips to his and lost herself, and it was the easiest thing she’d ever done, to obey his command, now that she’d surrendered herself to him. She deepened it, played with his tongue, enjoyed the feel of his canines pricking. Shuddering at his growl, she whimpered in delight when he shifted his grip and put her under him once more, parting her legs and putting himself against the opening of her pussy, making it obvious that his cock was close to being able to take her again.</p><p>“Tell me what you want, Savannah.”</p><p>His voice was harsh with lust, but his eyes were asking for more.</p><p>For everything.</p><p>Cleopatra couldn’t ever give up being perceived as a woman of power. Be just a woman, and no man like Marc Antony or Matthew Kensington would want her.</p><p>That’s what you think, Daddy.</p><p>Tennyson Rule Seven: Never be afraid to face your destiny.</p><p>“I want...” God, she suddenly wanted everything. “I want to live somewhere else. I want to have a yard, and...learn to garden. I want to have mismatching pictures.”</p><p>His eyes told her he understood, which brought forth the thing she suddenly wanted the most. She pressed her face into his neck, her lips against his thudding pulse.</p><p>“I want to be your wife.”</p><p>His arms tightened around her.</p><p>“Those rules, the ones Geoffrey posted on the wall of his office that you haven’t taken down? They come down tomorrow. From here on out, your life is governed only by one rule, the one I wouldn’t tell you at the beginning, but that I’ve told you several times now. Do you know what it is?”</p><p>His lips were very close to hers, sending spirals of pleasure through her lower extremities, making everything tighten with need for him again. She opened herself to him further, felt his cock slide into her tender opening.</p><p>“That I’m yours,” she whispered throatily. “Yours, forever and ever.”</p><p>And you’re mine as well.</p><p>“Close.” He looked at her, his sensuous mouth serious and firm, and she wanted it on her again. “Rule One, the first and last rule you’ll ever need, Savannah, to get through anything. Are you paying attention?”</p><p>“Yes,” she whispered. But instead of letting him say the words, she spoke them first against his lips.</p><p>“I love you.” </p> </body></html>"]