["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>1</p><p>Chicago, Illinois</p><p>Tension and magic filled the air like invisible smoke, swirling around us with the weight of ancient mysteries. We stared at each other across the small table like foes across a battlefield, weapons honed and at the ready.</p><p>But we weren’t enemies.</p> <p>We just weren’t anything else, either, exactly.</p><p>“Are you going to play sometime tonight?” he said. “I mean, if you’re scared, I can give you a little more time.”</p><p>“You can’t rush genius,” I said, looking over the fan of cards in my hand at the man who sat across from me.</p><p>He was tall and lean with light brown hair long enough to tuck behind his ears or flop into his eyes. His eyes, blue and usually glazed with happiness, smiled back at me. He looked young—fresh-faced and eager—but he had the skills of a warrior and the heart of a tiger. Quite literally.</p><p>Jeff Christopher was a shape-shifter and a member of my family’s Pack, the North American Central.</p> <p>I crossed one leg over the other, my skirt, tights, and dark boots not doing nearly enough to combat the chill in the air. Little Red, the bar where we played cards, was much beloved by the North American Central Pack. But it was old, dingy, and exceedingly cold.</p><p>Tonight we were nearly alone, except for my aunt Berna, who stood behind the bar furtively—or so she thought—reading Twilight for the fourteenth time, and the wail of Robert Johnson on the jukebox across the room. But the sun had barely set. Soon enough, more of the city’s shape-shifters would fill the bar with leather, magic, and muscle.</p><p>I pulled the four of clubs from my hand and dropped it onto the first of three piles of cards on the table. Jeff glanced at it, then looked at me with calculation.</p><p>“Problem?” I asked.</p><p>“I don’t want to lose again.” He grinned. “My manly ego can’t handle it.”</p><p>“Your manly ego doesn’t care as long as I don’t beat you at ‘Jakob’s Quest.’ ” That was his favorite video game. He was a master at it, as he was with most things related to tech.</p> <p>“True,” he said. “But we’re, what, twelve games to nine now?”</p><p>“Twelve to eight,” I said, biting back a smile. And he wouldn’t make it to nine, given the cards in my hand. “But nice try.”</p><p>He snorted, picked up the four, and stuffed it into his deck, then debated which card to give up. If he was picking up a four—a basically useless card—he must not have many options.</p><p>Jeff made his decision, dropping a three onto the table. It was a good choice; threes were even more useless than fours. But it still wouldn’t be enough.</p><p>And now, I thought, it’s time to pull the trigger and put him out of his misery.</p><p>I slid a card from my hand, and placed it on the middle of the three piles with a snap of its corner.</p><p>“I call the crown,” I said with a grin, the ace of diamonds shining victoriously.</p><p>Shock flashed in his eyes; he hadn’t known I held the ace—much less the ace of diamonds, the penultimate card in Call the Crown, a favorite game of the NAC.</p> <p>Jeff looked up at me again, smile blooming. “I was sure that thing was in the handmaiden deck.”</p><p>“It was. I pulled it in the third round.”</p><p>His eyes brightened with amusement. He had such an innocently handsome face, but it belied his strength and passion. Like me, he was fiercely loyal to the Pack.</p><p>I was Fallon, the only daughter in the Keene family. Gabriel, the oldest, was Apex of the Pack. I was second oldest, and I was followed in age (and alphabet, because my mother had had a weird sense of humor) by Eli, Derek, Christopher, and Ben. Adam had once been the baby, but he’d betrayed Gabriel, the family, and the Pack. He was no longer a Keene.</p><p>If anything happened to Gabriel, I was next in line for the crown. That made me the first possible female Apex in the history of the North American Central. Technically, Gabriel’s son, Connor, was the heir apparent. But he wasn’t even a year old yet, and control of the Pack couldn’t pass to an infant. For now, that made me the runner up.</p><p>It also made me the biggest shape-shifting prize in the country.</p><p>I put the rest of my cards on the table and gathered up my winnings. The tabletop, one of ten or fifteen around us, was etched with time and sticky with decades of beer and whiskey. It took two passes to collect the quarters we’d anted.</p><p>“And that makes thirteen,” I said, sliding them into my jacket pocket.</p><p>“I’m pretty sure I’ve won nine,” Jeff said with a smile, pulling the rest of the cards into a tidy deck. “We’re still close. Nearly evenly matched.”</p><p>He’d meant the cards . . . and us. The game in which we’d both been pawns. My stomach tightened.</p><p>“I’m sorry,” he said, reaching over and putting a hand over mine. He must have sensed my dismay.</p><p>The contact sent a jolt of magic and emotion through my body, that sense of belonging and familiarity that Jeff Christopher triggered with every touch and heartrending smile.</p><p>But he wasn’t for me. And that’s what it all came down to.</p><p>I pulled back my hand, glanced at my watch. “No worries. But I should be going.”</p><p>He tried for a smile, but it wasn’t convincing. “Are you going to turn into a pumpkin?”</p><p>“I have to meet someone,” I said, and those few words were enough to make the cheer in his eyes fade away.</p><p>His doubt only lasted a moment; his eyes steeled with determination, and he settled them on me. “Someone?” he asked, but he didn’t wait for me to answer. “A potential mate, you mean.”</p><p>The Pack believed every Apex needed a companion, a man or woman strong enough to help the Apex hold the Pack. Since I could one day be that Apex, it fell to my family to identify potential mates. A doomsday plan in dating form.</p><p>Brains and brawn were popular traits, but they weren’t the only qualifications. Each family of shape-shifters took a specific animal form. The Keenes were wolves, the same form as the first known shape-shifters, Romulus and Remus, and thus the most prestigious. Wolves were the First Animals of the First Pack.</p><p>The shifting was magical, but the form was all about genetics. And that’s what it really came down to.</p><p>Jeff Christopher, brilliant and charming, was a beautiful and powerful animal: sleek fur; wide, predatory eyes; heavy paws; long, swishing tail.</p><p>Jeff was a tiger.</p><p>Pack protocol—Pack tradition—said shifters who transformed into different animals shouldn’t be together. Sure, some people ignored the rules. But those people weren’t members of the Apex’s family, and they certainly weren’t second in line to the throne. I didn’t have the luxury of rebellion.</p><p>Gabe and Jeff had been friends for some time. I’d met him a few months ago. Gabe trusted and respected Jeff, who worked with Chuck Merit, a former cop who’d been hired by a former mayor to help supernaturals in Chicago. Chuck Merit’s agency was no longer official, but Jeff and his sorcerer colleague, Catcher Bell, still volunteered to solve supernatural dilemmas.</p><p>Gabe hadn’t stopped our friendship or complained about the time we spent together, believing we’d drift apart eventually. And as each season passed, the number of potentials Gabe trotted in front of me increased. Jeff was good people. But there were rules.</p><p>“The price of Jeff Christopher is too high,” Gabriel was fond of saying. “You cannot have him and the Pack both.”</p><p>Jeff knew about the tradition; every shape-shifter did. I think he’d hoped Gabriel would change his mind, or the Pack would. That hadn’t happened. But cold, hard facts hadn’t done anything to diminish the fiery spark between us.</p><p>“Don’t go,” he said, slipping from his chair across the table to the one beside mine. His unique scent moved with him—the deep and heady aromas of jungle and his warm and velvety cologne. So did his magic. It was usually bright and almost cheerful, shining like ripples of sunlight across water. But the mood had darkened, and so had his magic, the power that electrified the air like the moment before a storm.</p><p>He touched my hand again, sending a shock of magic up my spine. I fought hard against the promise of it. Our relationship hadn’t been exactly platonic, but there were lines we hadn’t crossed.</p><p>“I’m a Keene,” I reminded him . . . and myself. “It’s tradition. It’s part of the Pack, part of who we are.”</p><p>“It’s a lame tradition. And I’ll tell that to Gabe’s face.” His expression was fierce, but I knew better. Jeff Christopher was as loyal as they came.</p><p>“It’s the right thing to do,” I said, but even I could hear the quiet whisper of doubt in my voice.</p><p>He reached up to brush a lock of my wavy hair behind my ear. “You’re not just a Keene. You’re allowed to be Fallon, too.”</p><p>Magic blossomed between us, an invisible arc that enveloped us both, sending goose bumps along my arms.</p><p>I swallowed down a bolt of lust. I pushed down the obvious interest from the wolf that prowled inside me, felt her keen disappointment when I stood up and pushed back my chair, which squealed in protest against the sticky and stained linoleum floor. The wolf didn’t care about Jeff Christopher’s form. That he was magic—ferocious and male—was enough for her.</p><p>There was no denying Jeff Christopher and I had good magic. But magic didn’t win every battle. Sometimes family had to win, because it was the only victory a girl could afford.</p><p>“They’re counting on me,” I said, avoiding his eyes, afraid he’d see my doubts, even though I’d pushed them as far down into my gut as possible. “And you know the other option.”</p><p>Abdication. I could have Jeff Christopher if I gave up my claim to the Pack, my spot in the line of succession. But I’d also be giving up my family, rejecting the training and education I’d received as a potential Apex.</p><p>I cared about Jeff, but he wasn’t for me. We weren’t for each other. It might have been one of the great tragedies of my universe, but that didn’t make it any less true.</p><p>“One of these days I’m going to start taking your rejections personally.” Jeff’s voice was confident, but there was pain in his eyes. Still, he put up a good front. “Today’s not that day. I’ll see you, Fallon.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His voice drew my gaze back, and the promise in his eyes was unmistakable.</p><p>“I’ll see you,” he said again, his guarantee.</p><p>2</p> <p>The Pack was based in Memphis, but our family had decamped to Chicago earlier in the year. We’d made a promise to help Chicago’s vampires manage the supernatural crises that emerged once they’d announced their existence to the world.</p><p>We’d looked for place that reminded us of home, and found a farmhouse long past its prime but with plenty of room to roam and bedrooms for the lot of us. The house wasn’t in the best shape—the once-vibrant cornflower blue paint had faded to a watery blue-gray—but even tired around the edges she was beautiful. An enormous round porch wrapped nearly half the front of the house—a must-have for a family with Southern roots—and a turret with a conical roof jutted proudly from one side. The rest of the facade was a jangle of windows, shutters, and dormers.</p><p>The interior of the house still carried the scents of the generations that had come and gone. Each generation, each year, layering one smell over another like geological strata. Bundles of herbs hung to dry in the kitchen. Soft, old-fashioned perfume. Dirt and grass from long days of work.</p><p>I think that’s ultimately why Gabe had picked the place—because memories still lingered in the house, and they took the places of the Pack members we’d left behind in Memphis.</p><p>I walked inside, hung my black peacoat on the baroque rack by the front door, and glanced into the antique mirror that hung there for a final check.</p> <p>I had plenty of earrings and ink, and my taste in clothes ran toward black and gray, muted colors, and interesting layers. My dark blond hair waved with curl I’d gotten from my mother. My brandy-colored eyes were lined with kohl, and my cowl-necked sweater was dark, with long pointed sleeves, and fell nearly to the hem of my black pleated skirt.</p><p>As I prepared to meet another potential mate, a wolf in human clothing, I gave myself an honest appraisal. My eyes were sharp and clear, my mouth just wide enough to seem cheeky. I had good teeth, a great laugh, and a public school education that had done me plenty well. That didn’t mean the potential would feel the same way. And even if I wasn’t thrilled about the prospect of meeting him, no one liked rejection.</p><p>I tucked a lock of hair behind my ear, blew out a breath, and walked into the living room.</p><p>The entire family was in attendance amongst the faded velvet furniture: my brothers—Gabriel to Ben—plus Tanya, Gabe’s wife, and Connor, his son and the prince in waiting. But as I ticked them off my mental checklist, I realized there wasn’t a suitor in sight. Maybe he changed his mind, I thought with a thrill, and I could meet Jeff for pancakes, or we could watch a movie at his place.</p><p>The family huddled around Gabriel, tall and tawny-haired, with amber eyes that occasionally swirled with magic and broad shoulders. He was a presence, always. Occasionally the biggest man in the room, always the most imposing.</p><p>Eli had our mother’s dark hair and blue eyes. Gabe, Ben, and Christopher, had the blond-brown hair and amber eyes of my father’s side of the family, and Derek was a mix of the two, with dark hair and amber eyes. My parents had been a strange and beautiful pair—his sundrenched athleticism against her small, exotic beauty.</p> <p>Like my parents, Tanya was Gabriel’s physical foil. Absolutely beautiful in a soft and natural way, with cheeks that always seemed to glow healthy pink and dark hair currently pulled into a topknot. She bounced Connor in her arms and winked at me.</p><p>“Hey, sis,” Ben said, slinging an arm around me. “I thought you were out with Jeffrey tonight.” Ben wasn’t a fan of the mate-parading tradition.</p><p>“Gabe wanted me to meet someone,” I said, sliding my eldest brother a glance. He ignored the jab, kept his gaze on the box that sat on the pedestal table in front of him.</p><p>“A potential?” Ben asked, glancing at Gabriel. “You didn’t mention that.”</p><p>“He’s not here for you,” Gabriel said, then looked at me. “You’re just in time for the unveiling.”</p><p>“What are we unveiling?”</p><p>“The old man’s brought the crown out of storage,” Eli said, stepping forward.</p><p>“Ah,” I said with a smile. “For Connor’s initiation.”</p> <p>The initiation was another Pack tradition, an opportunity for the actual heir apparent to be formally inducted into the NAC. Tomorrow, Connor would get a crown. Tonight, I got a blind date.</p><p>The prince won that round.</p><p>Wordlessly, Gabriel opened the box. The coronet, delicate and golden, with arches across the top, gleamed like a star’s corona, nestled on a cushion of purple velvet.</p><p>Magic, heavy and ancient, spilled into the room.</p><p>Gabe lifted the crown, the etchings along the band catching the light and sprinkling it around the room. The history of the world was drawn there, the origin story of the men and women whose shadows unified the worlds of men and animals. The artist was long forgotten, but his or her craftsmanship lived on. As did the magic that had been spelled into it.</p><p>“I think Connor might be a little small for it,” Christopher said.</p><p>“Not if he’s got Gabe’s gigantic melon,” Ben said, reaching out and knuckling the top of Gabe’s head. Only Ben could have gotten away with the gesture without pulling back a nub. He was the happiest of the Keenes, the one who smiled the most. And now that Adam was gone, he was the baby.</p><p>“Every melon in my family is fine,” Gabe said, handing the coronet to me and running a hand through his hair to settle it again.</p><p>The crown was heavier than I’d expected, and the metal was warmer. It had adorned generations of Pack leaders, Keenes and otherwise, and as the story went, had absorbed their magic along the way. Maybe that explained the weight.</p><p>“You think you can get the giraffe away from him long enough to get that thing on his head?” Christopher wondered.</p><p>The giraffe had become Connor’s favorite toy. He bathed with it, slept with it, played with it. And when it was taken away for cleaning or dinnertime, the young prince made his displeasure known to all.</p><p>Gabriel looked at him with a considering glance. Connor smiled back, kicking his feet merrily against his mother and holding his giraffe with drool-covered, pudgy baby fingers.</p><p>“Doubtful,” Gabriel said. “But it cost a fortune to get a guarded courier to bring it from Memphis. He’ll wear it with or without the giraffe.”</p><p>When Gabe extended a hand, I offered the coronet back to him, happy to have it out of my hands. We had no scepter, no ermine cape, no crown jewels. But we had the coronet. And as long as the Keene family held the crown, we held the Pack.</p><p>It wasn’t just a symbol of the NAC; it was the heart of the Apex’s power. It allowed the Apex to reach the individual members of the Pack and call them together. It was a profound power—the ability to compel shifters to the side of their alpha—and one that had to be judiciously used. There weren’t even many who knew what it could do; there wasn’t much to be gained by advertising its power.</p><p>Many Pack members, including our extended family, had stayed in Memphis. We’d left the crown and its weighty power in their trusted care. Now that it was here, the burden was ours to protect it.</p><p>“You’re putting it in the safe?” Christopher asked.</p><p>We’d stored emergency supplies inside an ancient steel safe we’d hauled out of a building in Memphis that was being demolished.</p><p>“Seems the best place for it,” Gabe said, returning it to its cushion and closing the box again. “Although there are spiders downstairs. I do not like spiders.”</p><p>Gabe had faced pissed-off shifters, irritated vampires, and worse. But spiders were his mortal enemies. To be fair, the basement’s spiders were large and in charge.</p><p>“We know,” Ben said, clapping him on the back. “We all have our burdens to bear.”</p><p>“Enough,” Gabriel said. “We have company.”</p><p>We all looked to the doorway, where a man nearly blocked it completely.</p><p>He was built like a linebacker. Shoulders wide as mountains, every muscle defined beneath a leather jacket, snug cotton shirt, and jeans. He had dark, wavy hair and gray eyes beneath a hooded brow; his mouth was lush. He had the kind of good looks people would describe as “rugged,” and he certainly looked like he could handle himself.</p><p>He tugged leather gloves from his hands and stuffed them into the pockets of his jacket.</p><p>“Patrick York,” Gabe said.</p><p>Gabriel hadn’t told me whom I’d be meeting today, and I hadn’t bothered to ask. But I absolutely hadn’t expected this.</p><p>There were three other Packs in the U.S.: Consolidated Atlantic, Western, and Great Northwestern. Within those packs were a few big, old families, including ours and the Yorks, led by patriarch Richard, Patrick’s father. But while we controlled a Pack, the Yorks were members, and not very active ones. The family lived in Wisconsin, which put them in the territory of the NAC Pack, but they hadn’t attended a Pack convocation in years.</p><p>If Patrick York was here to meet me, that was changing. And the pressure was on.</p><p>“Patrick, meet the family,” Gabriel said. He pointed us out in turn. “Christopher, Ben, Eli, Derek, Tanya, Connor. And Fallon.”</p><p>I offered a wave, my stomach clenching with nerves.</p><p>Patrick smiled at me, his gray eyes intense. “It’s nice to meet you.”</p><p>“You, too.”</p><p>“How was your drive?” Ben asked.</p><p>“Good, thanks. Hasn’t started snowing yet, although I think it’s coming.” His gaze fell on the box on the table, and his eyes widened. “Is that what I think it is?”</p><p>“All four pounds of it,” Gabe said, giving him a considering glance. “You want to hold it?”</p><p>“Oh, no,” Patrick said with a grin, lifting his hands and stepping back. “Definitely not. I don’t want any part of that.”</p><p>“Who wouldn’t want part of a crown?” Ben asked, patting Gabe on the back. “All the power. The fame.” He glanced around the living room, which had seen better days. “The glamour.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m sure it’s lovely, but I’m happy to take your word for it. You preparing for Connor’s initiation?”</p><p>“We are. Would you like to join us?” Initiations were usually family affairs, but Gabe knew when to extend the olive branch.</p><p>Patrick shook his head. “Thank you, but I don’t want to intrude. And I’m only in town for the night. Leaving in the morning.”</p> <p>He was, he’d meant, only in town to meet me. Which somehow made the potential mate thing feel even more tawdry.</p><p>Gabriel smiled. “You’ll have to stay longer next time, get a feel for Chicago. It’s a great town.”</p><p>“Looked like it coming in,” he said. “At least the parts I saw from the car. I’ll see a bit more of it on the way to the hotel.”</p><p>Gabe nodded. “Since you’re only here for a little while, we should get out of your hair.” Gabe looked at the rest of the family, who made awkward throat clearing noises. Ben winked at me, picked up the box, and headed out of the room.</p><p>The air—and the magic in it—thinned.</p> <p>“They’re . . . intense,” Patrick said.</p><p>I shrugged. “I have a lot of brothers. It’s the worst case scenario for potentials.”</p><p>He looked at me with curiosity. “You are not at all what I expected.”</p><p>I wasn’t sure how to take that. “What did you expect?”</p><p>“A debutante, I guess.” He looked me over, took in hair and clothes. “Less serious. More giggly.”</p><p>“I am definitely not giggly. But I can kill a man in forty-two different ways.”</p> <p>“Forty-two. That’s impressive. I appreciate a woman who can take care of herself.” He looked around the room. “I have a car outside. Would you like to go for a drive?”</p><p>Fraternal magic—hopeful and concerned—seeped in from the next room. Space seemed like a good idea.</p><p>“More than you can possibly imagine.” I headed for the door.</p><p>3</p><p>I’d donned my coat on the way out, but that hardly battled back the chill in the air. The air was cold and heavy, unusually still. I agreed with Patrick; snow was coming.</p><p>A sleek, black SUV sat in the gravel drive in front of the house. A man in a slick black suit—head shaved, eyes dark and piercing—held open the back door.</p><p>Patrick gestured to the driver. “Tom Webb, this is Fallon Keene. Fallon, Tom Webb. He’s been helping the family for many years.”</p><p>I didn’t know the details of the Yorks’ business, but it had something to do with timber. If Patrick had a driver, I guessed business was good.</p> <p>Webb smiled, but his eyes were still appraising. I read loyalty in the look, the fact that he took my measure and considered whether I was the right woman for the Yorks’ favorite son.</p><p>I slid into the backseat, and Patrick followed.</p><p>“Nice ride,” I said when Tom had closed the door behind us.</p><p>Patrick’s grin was sheepish. “Thanks. I need the space.” He gestured toward his long legs, which filled the foot well. His shoulders practically filled his half of the backseat.</p><p>“Where should we go?” Patrick asked.</p><p>It was dark, and February. There was only so much that one could see of the city from the backseat of a car. “Well, if you’ve never been to Chicago, I’m honor bound to at least get you a look at the skyline.”</p><p>I leaned toward the front seat. “Head left, and when you get back to the main road, turn right. There’s an historic marker about three miles down. Pull in when you see it.”</p><p>“Got it,” Tom said. The tinted screen rose, separating the front and back seats, and we pulled away from the house and back onto the long, gravel drive.</p><p>Patrick looked at me with interest. “Archaeology field trip?”</p><p>“Not exactly,” I said. “You’ll see when we get there.”</p><p>“I’m always up for an adventure,” he said with a smile. “Tell me about yourself. Other than the fact that you’re next in line for control of the North American Central Pack.”</p><p>His tone was sarcastic, which helped me relax. There’d been plenty of other potentials—men with whom I’d shared coffee or pizza—whose first questions were about Gabriel, the kingship, the Pack. They’d slipped through Gabriel’s screening and were interested in me only because I could help them get closer to him.</p><p>Potentials like that gave the process a bad flavor. But I’d become adept at scaring them away, at feigning enough crazy to give them second thoughts. And if they became too handsy, a knee to the balls put them in line again.</p><p>“I’m twenty-seven. I like music. I live for coffee and good bagels. I believe in fairy tales, but not fairy godmothers.”</p><p>“That list sounds well-practiced.”</p><p>“I’ve met my fair share of potentials.”</p><p>“And nobody was interesting?”</p><p>“Everybody’s interesting in their way.” I shrugged. “But a relationship needs more than interesting.”</p><p>“The spark,” he said, looking out his window. “It needs the spark.”</p><p>I had the sense from his tone that he’d had the spark before. Since he was in the car with me, I presumed he hadn’t managed to capture it.</p><p>“That’s one way to put it. What about you?”</p><p>He shrugged. “I’d say I’m the outdoorsy type. I like to fish. Hike. Chop wood.”</p><p>“You’re a lumberjack.”</p><p>He laughed heartily. “Yeah. I guess you could say that.” He flexed an impressive bicep. “Keeps a man in shape.”</p><p>“So I see.”</p><p>“Can I ask you a question?”</p><p>I nodded.</p><p>“Is this—is this what you really want? I mean, this whole potential thing?”</p><p>I looked out the window, watched farmland pass as Tom took the road at a leisurely pace. “I want my family to be safe. And I want the Pack to be solid. Healthy. Having a mate the family approves of goes a long way.”</p><p>For the four-hundredth time, I wished Jeff was a different kind of animal. But he couldn’t change who he was any more than I could change myself, put myself into a different family, or make the Keenes average.</p><p>Jeff was not the point, I reminded myself, and made myself focus on Patrick. I’d made a commitment to see this through, so it deserved my full attention.</p><p>I looked back at Patrick. “What about you? Do you want this whole potential thing?”</p><p>“I want a connection. I want my family to be happy.” He fidgeted with a gold signet ring on his right hand, which bore a complicate crest. “My father’s getting older. He’s not well.”</p><p>“I’m sorry to hear that.” Shifters were generally a healthy bunch; transforming into animal form cured most things that ailed our human forms. But animals became ill, too, and there was no easy cure for that.</p><p>“I guess that adds to the pressure to find someone.”</p><p>Patrick laughed mirthlessly. “That’s one way to put it. If I hear the word ‘legacy’ one more time, I’ll probably punch someone.”</p><p>“I’ve done that.”</p><p>He looked at me with amusement. “Really?”</p><p>“Yep.” I crossed one leg over the other, kicked the top one. It was a habit usually caused by too much caffeine. Today, I could blame old-fashioned nerves.</p><p>“Robin Swift sent a friend of his family.” Robin was Apex of the Western Pack. “Took me to dinner at the most expensive restaurant in Chicago—or so he told me. Six or seven times. And while we’re there, gave me a lecture about respecting legacies.”</p><p>“And you punched him in the restaurant?”</p><p>I grinned. “No, I punched him when he told me my only purpose was to bear his children and then stuck a hand up my shirt.”</p><p>Patrick grinned. “You land the punch?”</p><p>“Broke his nose.”</p><p>“Good girl.”</p><p>We slowed, and I looked up to see the familiar metal plaque on the side of the road. Tom turned the car into the short drive, which dead-ended at a chain link fence.</p><p>“What now?” Patrick asked.</p><p>“Still a surprise,” I said, climbing out of the car when Tom opened the door. Patrick offered whispered instructions to Tom, then followed me through the open gate. We crunched through snow across the small field, where a vine-covered chimney stood sentinel, the only part of the building still standing.</p><p>Hands in his pockets, Patrick stared up at the chimney. “What was this place?”</p><p>“A Jesuit mission, then a church. Once upon a time, at least.”</p><p>He ran fingers over the rough stone, something I’d done a dozen times. “How’d you find it?”</p><p>“Full moon,” I confessed with a smile. “I couldn’t sleep, so I ran until I couldn’t run anymore. I ended up here.”</p><p>“There’s a lot of history here,” Patrick said, glancing around. “A lot of power.”</p><p>I nodded. “Sometimes I wondered if I found it, or it found me. But this actually isn’t what I wanted to show you. This way.”</p><p>He fell into step behind me, and we walked in silence up the small rise on the other end of the field. By the time we reached the top, I was finally warm.</p><p>“This is why we’re here,” I said when he stepped beside me, and I heard the sharp intake of breath.</p><p>Chicago lay in front of us like a blanket of light, buildings rising across the horizon like a heartbeat had been charted across the sky.</p><p>Memphis would always be home to me, but I certainly understood the appeal of the Windy City. Architecture, food, politics. It was an important part of the building of America, even if it still bore the scars.</p><p>“This is an impressive view.”</p><p>“Yeah, I like it. And I like Chicago. It’s not home—not yet—but I like it.”</p><p>“Lot of energy,” Patrick said.</p><p>“Yes,” I agreed. “There is. You’re from Wisconsin?”</p><p>He nodded. “The family’s from Wausau, middle of the state. Most of them still live there. I’ve got a cabin on the lake north of Sheboygan. It’s quiet, especially in winter. No tourists. Speaking of tourists, are many people coming in tomorrow for the initiation?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The abrupt change of conversation had me looking back at him, wondering about his motive. But if he was digging for details about Connor or the event, his body didn’t give it away. His gaze was still on the horizon.</p><p>Still, I chose my words carefully. “Mostly close friends and family.”</p><p>“The ceremony will be at a church?”</p> <p>“St. Bridget’s.” The location wasn’t a secret, especially since Gabriel had already invited him. “It’s in Ukrainian Village.” We hadn’t chosen the spot because of the religious affiliation, but because it was in the heart of our favorite neighborhood, and a common location for Pack meetings. We had a connection to it.</p><p>He nodded, but I could tell the answer hadn’t satisfied him.</p><p>“Does it bother you that he gets the crown? Instead of you, I mean?”</p><p>I guess that’s what had really been on his mind. “No,” I said. “Should it?”</p><p>He lifted his hands again. “No offense meant. I just think, if it had been me, I’d be pissed. My chance being taken away. You don’t have to respond to that. And I didn’t mean to upset you. I’m genuinely curious.”</p> <p>He was silent for a moment, and when I looked back at him, found him frowning at the skyline.</p><p>“I’m in a completely different situation,” he said. “My life, like yours, has been built around family, but the dynamics are different. You’re part of the Apex’s family. For the rest of us, that’s a big deal. You’re the big deal. So I just wonder if someone else being handed the crown feels like a big deal.”</p><p>It was a big deal. But not the way he meant.</p><p>It was a big deal that Tanya and Gabriel, after several years and more mourning than I’d have wished on anyone, had gotten pregnant. A big deal that Connor had been safely born after a difficult pregnancy. A big deal that I had a healthy and happy nephew.</p><p>“Family is family,” I simply said. “And Pack is Pack.”</p><p>An hour later, the SUV pulled up to the house again.</p> <p>Patrick looked at me. “I enjoyed meeting you, Fallon. I’ll be staying at the Hotel Meridian. They’ve got a fantastic bar, and I’d love to invite you for a drink.”</p><p>“I don’t think I’m up for that tonight, with the initiation tomorrow. But thank you for the offer.”</p><p>“You’re sure I can’t change your mind?” Without waiting for a response, Patrick moved in, pressed his mouth to mine, made his best argument. His lips were soft, and the hand he lifted to my face undeniably strong. He cupped my jaw as he deepened the kiss.</p><p>Magic, comfortably animal, pulsed across my body, lifting goose bumps on my arms. My magic lifted, rose to meet it, and filled the car with energy when Patrick deepened the kiss.</p><p>Our magic was clearly compatible. But that’s as far as it went. There was no angelic choir. No sudden music. Not a single tingle or twitch of the nonmagical variety.</p><p>The part of me that wanted to keep hanging out with Jeff was thrilled. Another potential met, put away.</p><p>But the part that was obliged to family and Pack felt guilty. Was I not trying hard enough? Sabotaging any chance these guys might have had to win me over?</p><p>Patrick pulled back and looked at me. “I get the sense your heart’s not in this.”</p> <p>I didn’t have the words to respond, but he was absolutely right. My heart was elsewhere, mostly thinking about a tiger probably pacing the halls of his apartment.</p><p>“I’m sorry,” I said.</p><p>He smiled. It was such a great smile. It just did absolutely nothing for me.</p><p>“No hard feelings,” he said. “The heart wants what the heart wants.”</p><p>I slid toward the door, and when Tom opened it, stepped outside again.</p><p>“I hope you find him,” Patrick said.</p><p>“You and me both,” I murmured.</p><p>The house was quiet and dark. For the first few potentials, the entire family had waited in the parlor for me to come home and report. After ten, they’d stopped waiting up.</p><p>We’d long since passed ten.</p><p>I took off my boots and hung up my coat, then headed upstairs to my second-floor bedroom. The world may have been chaotic, but my bedroom was not. It was simple, clean, and organized—my respite from Pack life. Like my clothes, the room was decorated in shades of black, white, and gray. A white four-poster bed was the focal point, near a bureau I’d painted a black and white chevron pattern.</p><p>I pulled open the top drawer of the bureau and perused the contents. T-shirts and pajama bottoms for winter, skimpier nighties for hot nights or special occasions. Unfortunately, they still bore the tags.</p><p>“Someday,” I grumbled, pushing them aside and pulling out a heather-gray T-shirt, the lingering scent of Jeff’s cologne filling the room. The shirt was one of his, with a chartreuse “Jakob’s Quest” logo across the front. He’d let me borrow it after I’d been soaked in a downpour, and I’d forgotten to give it back.</p><p>Or I’d decided not to.</p><p>I tugged it over my head, pausing while I was cocooned in cotton and Jeff, savoring the scent of him, wondering what it would be like if he’d been there with me.</p><p>I’d imagined the scene a thousand times before: turning off the light, lying down on cool sheets, his body beside mine, arms ready to wrap around me.</p><p>But that was just a fantasy. Tonight, again, the bed was empty—Jeff replaced, as always, by the cold weight of tradition.</p><p>I dreamed I straddled the crux of the farmhouse roof, one leg on each side, a hammer in hand. The shingles, gray with age, were falling away from the roof like scales, floating to the ground like feathers. I used the hammer to beat them back down, but the work was useless. They lifted and rose away, leaving the bones of the house bare beneath them.</p><p>“Fallon!”</p><p>My eyes opened. I wasn’t on the roof. I was in my own room, sprawled on my stomach, an arm and leg hanging over the side of the bed. There was no hammer, but someone was pounding fiercely on the bedroom door.</p><p>“Hold on,” I said, flipping off the sheet and sitting up, squeezing my eyes shut until my head stopped spinning. I’d slept like the dead, and my head throbbed like I was hung over.</p><p>“I’m coming,” I said when the beatings continued, and stumbled to the door.</p><p>I yanked it open and found Gabriel in the doorway, a haggard expression on his face. There were shadows beneath his eyes.</p><p>“It’s, like, six in the morning,” I said, squinting in the sunlight. We didn’t sleep much, although we tended to sleep those hours in the early light of day. “What do you want?”</p><p>“Your ass downstairs. The coronet is gone.”</p><p>I pulled on enough clothing to turn the T-shirt into loungewear and headed downstairs in sweatpants and bare feet.</p><p>Adrenaline pumped, making my blood run and brain race. But I was still groggy, and the sensations mixing together made me feel like a college freshman after an all-nighter.</p><p>Christopher, Derek, and Ben were already in the living room, once again around the open box.</p><p>“Where’s Eli?” I asked, as I joined the circle.</p><p>“Kitchen,” Ben said.</p><p>I peered inside in the box. It was empty. Even the purple cushion was gone.</p><p>Fear warred with exhaustion and irritation. “I thought we were putting the crown in the safe,” I said.</p><p>“We did. The box was down there,” Gabriel said. “Empty.”</p><p>“At least there weren’t spiders in their place,” Ben lightly said.</p><p>Gabriel’s slanted look actually seemed to chill the air in the room. “The safe was open. Someone managed to pick the lock.”</p><p>“Who figured out it was gone? And why the hell were they in the basement at six o’clock in the damn morning?” I was not a morning person. And I was real damn grouchy before coffee.</p><p>“Nobody figured it out.”</p><p>I glanced at the doorway. Jeff stood there, hair tousled, a leather jacket over a T-shirt and jeans. He looked pissed, and magic spilled across the room like a horde of angry insects. He walked toward us, but didn’t even spare me a glance.</p><p>I assumed he was mad because I’d ditched him the night before. But I’d done what I had to do, and I’d explained that to him. He knew the deal. I didn’t have time for a tantrum, especially not right now. We were in crisis mode.</p><p>Ben glanced between us, settled his gaze on me, the question in his eyes obvious. But I shook my head. The coronet was missing. Our focus was on the Pack.</p><p>Always on the Pack.</p><p>“The alarm on the safe went off. It’s set to send me a message,” Jeff said.</p><p>Ben frowned. “Why did it alert you?”</p><p>“Because I had him install the security system,” Gabriel said.</p><p>“I didn’t get a message the doors or windows were breached,” Jeff said, glancing at him. “I take it the alarms weren’t turned on?”</p><p>“We’re way the hell out here,” Gabriel muttered. “Since when do we need to live in a security state?”</p><p>“Since you’re the Apex of the Pack and you moved the crown up here,” Jeff countered. “It’s important.”</p><p>Gabe’s magic spiked. “I’m well aware of the importance of the goddamned crown. I don’t need the reminder.”</p><p>Wisely, Jeff bit back a response.</p><p>Eli walked into the room, two steaming cups of coffee in hand. I held out hope one of them was for me, and thanked my lucky stars when he handed it over.</p><p>The first sip was hot, full-bodied, intoxicating. I gave him an appreciative nod. Eli and I were closest in age, and we’d spent more time together than probably anyone else in the family. He knew about my coffee obsession, and enabled it. Which made me love him more.</p><p>“When was it taken?” Ben asked.</p><p>Jeff checked his phone. “Forty-two minutes ago.”</p><p>Christopher rubbed his face. “Five-thirty in the damn morning? Who wakes up to steal a crown at five-thirty in the damn morning?”</p><p>Ben made a sarcastic sound. “Someone who wants a crown and doesn’t want to get caught.”</p><p>“Suspect list?” Eli asked. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Everyone from Louisiana to Minnesota who wants the damn thing?” Christopher suggested.</p><p>“Only one of those people was here yesterday.”</p><p>We all looked back at Jeff, who stared back at me. Angry. Betrayed. I guess he’d taken it personally after all.</p> <p>My stomach curled from the hurt in his eyes.</p><p>I tore my gaze away and looked at Gabriel. “He means Patrick.”</p><p>Is that why Patrick had come here? Not to meet me, but to get closer to the crown? He wouldn’t have been the first potential mate with an agenda.</p><p>“He was here to meet Fallon,” Ben offered, stepping closer to me as if that could protect me from the pain.</p><p>Jeff looked at Gabriel. “He was here because he wants to get closer to the crown. And there are two ways to do that.”</p> <p>Get the crown—or get the girl?</p><p>Gabriel turned back to him, arms crossed and angry magic radiating from his body. “Is there something you’d like to get off your mind, whelp?”</p><p>Magic rose between them, furious and hot, spinning around the room like a dervish. Both of them angry, both of them worried. Neither of them about to admit it aloud.</p><p>The last thing we needed was an intra-Pack dispute. We had bigger things to worry about.</p><p>Eli stepped between them, beating me to it. “Let’s all take a breath. The Yorks are good people, quality people. Patrick didn’t even want to look at the crown yesterday. He seemed plenty sincere about that.”</p><p>“So he knows how to act,” Christopher said. He looked at me. “You were with him. What do you think?”</p> <p>All eyes turned to me, including two blue ones that didn’t look especially pleased about it.</p><p>“I don’t know.” I pushed my hair behind my ears and caught Jeff’s glance at the T-shirt I’d forgotten I’d been wearing.</p><p>I felt his rush of magic—possessive and pleased. He didn’t comment; but he didn’t need to. I’d slept in his shirt. Didn’t that say enough?</p><p>But this was not the time, so I pushed it back. “He seemed less interested in the crown than my feelings about it,” I said. “But who knows?”</p><p>Jeff pulled a tablet from his pocket, began typing on the screen. He always had a gadget in hand, and this small and sleek rectangle was his new baby. “I’m going to check the camera.”</p><p>“There’s a camera?” Eli asked.</p><p>“It’s part of my standard security package,” Jeff said, eyes on the tablet.</p><p>We stood silently while he played with the camera interface. “Here we go,” Jeff said after a moment, and we circled around him.</p> <p>The image on the tablet was distorted by the fish-eye lens, which had been mounted above the door, but there was no mistaking the man on the screen: Patrick York walked to the front door and slipped inside. Twelve minutes later, he walked out again.</p><p>I felt sick. Nauseated at the betrayal, humiliated at the ruse. I wiped a hand across my lips, as if I could wipe away the kiss he’d offered. He’d kissed me, and then snuck back into our house and stolen the Pack’s most precious item.</p><p>But it had all happened so quickly. I grabbed what remained of my pride, held tight. “Surely he couldn’t have gotten to the safe, unlocked it, and gotten out in twelve minutes?”</p><p>“He could have if he’s trained,” Christopher said, shrugging when we looked at him. “What? So I know how to work a lock.”</p><p>Ben slanted his head. “We can’t actually tell if he’s taking anything with him.”</p><p>“What else would he be taking?” I asked. “He had no reason to be back in the house. No reason other than the crown.”</p><p>Without waiting for an answer, I walked to the window and lifted the sash. The breeze was frigid, but a relief as hot tears of embarrassment slipped down my cheeks.</p><p>I wiped them away as sneakily as I could. God forbid any of them should see me cry.</p><p>“I can call Catcher,” Jeff said. “Or Merit. Or the Chicago Police Department. But I’m guessing you want to keep this in-house.” Merit was Chuck Merit’s granddaughter, a vampire of Chicago’s Cadogan House. Much like her grandfather, she spent a lot of time solving supernatural problems.</p><p>“In-house,” Gabe said. “We don’t need the attention.” His tone dropped, deepened, and was rough by worry. “Is there a chance he knows how to use the crown?”</p><p>Silently, Eli glanced at Jeff.</p><p>“Jeff knows,” Gabriel said. “I told him.”</p><p>“Security,” Jeff said.</p><p>“In that case,” Eli said, “I don’t know how he would. The information would be hard to come by, and Yorks have been out of the loop for a very long time. I doubt they’re even friendly with anybody who knows. Did he mention anything to you, Fallon?”</p><p>When I was sure my face was dry, I turned back, looked at my brothers. “No. Not a word.”</p><p>“This is a disaster,” Ben said.</p><p>I knew he meant the theft, but I still felt responsible. All of this trouble, the drama, because of tradition. Danger to the Pack, Jeff pissed, my brothers worried. Our role in the Pack at risk. All of that because tradition had put a thief right under our nose. And because a man we’d trusted with that tradition had betrayed us all.</p><p>Humiliation began to give way to anger. And there was only one healthy way to deal with anger.</p><p>“I’ll go,” I said, moving back to the group. “I’ll find him, I’ll kick his ass, and I’ll bring back the coronet.”</p><p>“I’ll go with you,” Ben said, but Gabe shook his head.</p><p>“People will wonder why we’re sending half the family on a crusade hours before the initiation.”</p><p>“I’ll go with her.” We all looked at Jeff. “They won’t suspect us going together.”</p><p>Because we were always together. And that said volumes.</p><p>Gabriel looked between us, considered. “Do it. I’ll call Richard in the meantime.”</p><p>“Is that wise?” Eli asked. “If he’s in on it . . .”</p><p>“Patrick said his father was sick. I don’t know if he’s up for plotting to take over the Pack.”</p><p>“Or maybe this is his last effort to become Apex,” Ben said.</p><p>“I’m calling him,” Gabe said. “If he’s involved, there’s no point in denying it now. If he has the crown because he wants the Pack, I doubt he’ll hold that in.”</p><p>“Patrick’s staying at the Hotel Meridian,” I said. “That’s the first place to go.”</p><p>Gabe checked the grandfather clocked that ticked in one corner of the room. “The initiation’s at six o’clock. Find the coronet, bring it home. Or we hand the Pack over to someone else.”</p><p>4</p><p>I dressed and met Jeff downstairs, where he waited by the front door.</p><p>“I’ll drive,” I said, and he didn’t argue. My car was small—a coupe that could be easily parked in Chicago, but had enough horsepower to zip around traffic. Or mow down a potential with a traitorous agenda. Not that I had violence on my mind.</p><p>Jeff didn’t respond or say anything else until we were in the car and ten minutes into the drive. And then he surprised me.</p><p>“I’m sorry,” he said. “I was an ass. You don’t deserve that. Not when you’re trying to do the right thing by your family. It’s just . . . you don’t know what it’s like for me.”</p><p>I goggled. I knew exactly what it was like—because I was the one living under the weight of it. “I know exactly what it’s like for you. You don’t know what it’s like for me.”</p><p>“Then tell me. Don’t pull away.”</p><p>“I don’t pull away.”</p><p>“You do pull away. You hide behind your family.”</p><p>“I do not.”</p><p>“You do.” His voice softened. “You do, Fal.”</p><p>I sighed, feeling suddenly tired. “We’re adults, not children. Sometimes adults don’t get what they want. Even if it hurts,” I added after a moment.</p><p>His voice was quiet. Hopeful. “And what is it that you want?”</p><p>I knew what he wanted me to say. What he needed me to say. But I couldn’t. Because if I admitted it to him, to myself, that I wanted him, that I cared for him and needed him, then I’d be admitting that everything else had been a lie. That every date with every potential had been a farce, that I wasn’t really trying to find a match for the good of the Pack.</p><p>So I didn’t say anything.</p><p>Jeff made a low growl and ran his hands through his hair. “I swear to god, Fallon. Sometimes . . .”</p><p>“Sometimes what?”</p><p>He sighed hugely. “Sometimes life is not fair.” He was quiet for a moment, then looked over and smiled at me. “Will I get in trouble if I ask how the date went?”</p><p>“So much trouble,” I said, but couldn’t help smiling back. And when I did, the world seemed to right itself again. “It was dull until, you know, he broke into my house and stole my family’s birthright.”</p><p>“So you probably won’t be going out with him again. Which means I have a chance.”</p><p>The hotel was located in Gold Coast, a swanky neighborhood just north of the bustling Loop. The building that housed it matched the area’s ivy-covered townhouses, but the lobby was modern and sleek, decorated in shades of white and cream. The attendants at the front desk, both men with slicked back hair, wore buttoned shirts with rolled sleeves, suspenders, and bow ties. It was either very hip or very pretentious; I wasn’t entirely sure which.</p><p>We walked to the counter. The attendant—Cash, according to his name tag—smiled at us.</p><p>“Welcome to the Hotel Meridian. Are you checking in?”</p><p>“We’re looking for a guest, actually. Patrick York?”</p><p>“Ah, yes.” He glanced down at his screen, typed a few characters on a slide-out keyboard. “I’m afraid Mr. York has already checked out. Just a few minutes ago.”</p><p>I stifled a curse.</p><p>Cash looked up, apologetic. “Is there anything else I can help you with?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jeff and I looked at each other, and I opted for frankness. “We believe Mr. York may have inadvertently taken something that belonged to my family.”</p><p>Cash’s eyes went wide. “Really.”</p><p>I nodded. “Since he’s gone, would it be possible for us to take a look at his room? I know it’s an inconvenience, but it would make my family feel a lot better.”</p> <p>He grimaced. “That’s not exactly policy.”</p><p>“The guest has checked out,” I reminded him. “So there’s no breach of the policy. We just want to see if perhaps there’s anything he might have left behind.”</p><p>Jeff put his hand on the counter, a folded hundred-dollar bill tucked subtly between his fingers. “We’d appreciate it very much.”</p><p>Cash’s eyes stayed flat, but he took the money and handed us a keycard. “Sixteen twenty-eight,” he said, gesturing with a bladed hand toward the elevators. “Help yourselves.”</p><p>The elevator was empty, and it moved slowly and steadily up the side of the building, adding or subtracting a guest here or there. When we reached the sixteenth floor, we followed the arrows to the right, checking the room numbers until we reached 1628.</p> <p>“Got it,” I said, holding out my hand for the key card. Jeff handed it over, and I unlocked the door and pushed it open.</p><p>“Damn,” Jeff said, stepping inside behind me. “I think the Yorks have money.”</p><p>If the suite was any indication, he was right. A central hallway led to a bathroom, a bedroom, and a sitting area with a view of the lake. The furniture was high-end, the linens fancy. Silk curtains in wide vertical stripes were tied back at the windows. The room hadn’t yet been cleaned, which gave us better odds of finding some hint of what he’d been up to.</p><p>“Probably so. He had a driver yesterday.”</p><p>“Fancy,” Jeff said. “I’ll take the bedroom. You look in here.”</p><p>I walked to the small desk, opened the drawer, and rifled through complimentary stationary and Chicago-centric magazines. I found another guest’s discarded receipt for the observation deck at the Hancock Tower, dated more than a month ago, and a cellophane-wrapped peppermint.</p> <p>Nothing had been lost between the couch cushions, nothing stuffed into the pillows. I found only dust bunnies under the couch, and the wastebasket was empty.</p><p>The sitting room checked, I walked to the door of the bedroom.</p><p>Jeff had pulled the sheets, pillow, and duvet from the bed and was methodically checking them.</p><p>“Nightstands?” I asked.</p><p>“Not yet,” he said, without looking up.</p><p>I walked to the far side of the bed, pulled open the drawer. The usual Bible was there, and a small notepad. Nothing else. Ditto the nightstand on the other side.</p><p>When I’d checked both, I stood up, put my hands on my hips, and surveyed the room. I wasn’t sure what I’d expected to find; it wasn’t like he’d have forgotten to take the crown with him, or left crown crumbs in a Hansel and Gretel–style trail.</p><p>“Fallon.”</p> <p>I looked up. Jeff stood on the other side of the bed, motioned me to approach. The bed had four short posters. And in the corner of the poster at the foot of the bed, on the side closest to the door, was a scrap of dark fabric.</p><p>It was wedged tightly, caught on the end of a bedspring that had poked through the cover. I carefully lifted it, held it up.</p><p>It was purple velvet, the same fabric used on the cushion that protected the crown.</p><p>“Jesus,” Jeff said. “I was hoping it was a coincidence. That really sucks.”</p><p>“Yeah,” I agreed. “It really, really sucks.”</p><p>I ignored the flickers of humiliation, sat down on the bed, pulled out my phone, and sent a picture of the fabric to Gabe and a status report. While we waited for a response, I tucked the fabric in my pocket, evidence of the crime.</p><p>Jeff sat down beside me. “I can kick his ass if you’d like.”</p><p>I smiled mirthlessly. “I’d like. But I still think it’s weird. I mean, I know don’t know him very well, but I wouldn’t have suspected this. Breaking into the house? Stealing the crown?” I shook my head. “He was so mild mannered.”</p><p>“If your date didn’t go well, maybe he thought it was his only other option. Did he say anything that suggested he had a plan?”</p><p>I shrugged. “He asked about the initiation. Wondered if it bothered me that Connor gets the crown instead of me.”</p><p>Jeff snorted. “I’m surprised you didn’t kick his ass for that. Or maybe you just gave him your ‘most displeased’ look.”</p><p>“My ‘most displeased’ look?”</p><p>“Yeah, you know.” He adjusted to face me, dipped his chin, and gave me a good stiff stare.</p><p>“I do not do that.”</p><p>“Oh, you do,” he assured. “You’re very opinionated.”</p><p>“I’m not opinionated. I’m just right. Frequently.”</p><p>“And most displeased when you’re wrong. Especially if I’m right.”</p><p>A headache was beginning to throb behind my eyes, and his word games weren’t helping. I closed my eyes and rubbed my temples. “What a crappy day.”</p><p>“Royally,” Jeff said, snickering at the pun. “But I can make it better.”</p><p>I nearly laughed at the bravado in his voice, but Jeff moved too quickly. Before I could protest, his lips met mine, cutting off argument. He leaned forward, his mouth insistent, a hand against my cheek. He kissed me hungrily, greedily, like a man long denied.</p><p>I let him kiss me. I let him seduce me with bites and kisses, and the hand that caressed my cheek. And then I kissed him back, my fingers stealing into his hair, pulling him toward me.</p><p>His magic rushed forward. Where Patrick’s magic had mingled with mine, Jeff’s danced, teased, and enticed. It rose to envelope both of us, hinting at the fire we could so easily start . . .</p><p>Until I remembered where we were, and what we were doing there.</p><p>The spark banked.</p><p>I stood up, knees shaking, and moved away from him, my heart beating against my chest like a timpani drum. “Jeff, we can’t. I can’t.”</p><p>“You can,” Jeff said, rubbing his hands over his face in obvious frustration. “But you won’t.”</p><p>“That’s not fair.”</p><p>He looked up at me, grief in his eyes. “None of this is fair, Fallon. For either of us.”</p><p>My phone rang.</p><p>We stared at each other until the third ring, when I forced myself to check the screen. It was Gabriel. “Hello?”</p><p>“I spoke with Richard. He knows nothing about the crown or the initiation. I think he was being honest. But he admitted he’s been concerned about Patrick.”</p><p>“I’m putting you on speakerphone,” I warned. “What do you mean, he’s concerned about Patrick?”</p><p>“I’m not entirely sure. I’m also not sure how clearly he sees things.”</p><p>“Because of the illness?”</p><p>“Yeah. He doesn’t have the strength he used to. I’m not sure he’s got the memory, either. He knows he’s fading, and he’s worried how Patrick will handle it.”</p><p>“If we’re right and he took the crown, he’s not handling it well,” Jeff said. “We need to figure out where he’ll go next.”</p><p>“Richard said he was coming home.”</p><p>“Which one?” I asked, thinking of our conversation. “He’s got two—family place in Wausau, and a cabin near Sheboygan.”</p><p>“You’re closer to Sheboygan,” Gabriel said. “You go there. I’ll send Damien to Wausau.”</p><p>Damien Garza was one of Gabriel’s go-to Pack members, a quiet man with a penchant for solving messy Pack problems.</p><p>I looked at Jeff, who nodded.</p><p>“We’re on our way.”</p><p>Patrick hadn’t given me his address, but I had Jeff for that. In addition to his gaming skills, he was a master of the Web. He could find a needle in a binary haystack and did, in this case, offering up Patrick’s address and prepping the GPS.</p><p>Jeff and I didn’t speak a word about the kiss, and didn’t say much of anything for the drive north. But the tension in the air was unmistakable. I knew we were going to have to talk about it sooner or later, but not right now. Business first.</p><p>The cabin was part of a woodsy neighborhood beside the lake, a cluster of houses and cabins probably used by Chicagoans to escape the city in the summer. But this was winter and the lake was frozen; most of the houses looked empty, the snow still in drifts around their doors.</p><p>Patrick York’s house, a log cabin A-frame, was easy to spot—the drive was shoveled, and smoke rose from the chimney.</p><p>We parked a hundred feet down the road, got out of the car, and looked at each other.</p><p>“If he’s got the crown, he’ll want to keep it. We should be prepared for a fight.”</p><p>Jeff nodded. “You bring a weapon?”</p><p>“I am the weapon.”</p><p>He gave me a cutting look.</p><p>“Blades,” I said. “Just in case, I have my blades.” I had two daggers, engraved and gorgeous, tucked inside my boots. “You?”</p><p>“Same.” He zipped up his leather jacket, nodded, and we trekked back to the cabin in the woods. As we walked, snow began to fall, large and beautiful flakes that quickly covered the ground in a fluffy white quilt.</p><p>We reached the end of the driveway and paused at the mailbox.</p><p>“I don’t see a backdoor,” Jeff said. “Either he’s going through a window, or he’s coming with us.”</p><p>I nodded and turned to walk toward the door, but Jeff grabbed my hand before I could move. A bolt of lust and magic speared through me, followed immediately by a wave of regret.</p><p>“Be careful,” he whispered, releasing my hand and falling into step beside me.</p><p>Patrick York opened the door in a T-shirt and jeans, a white kitchen towel in hand. The smell of breakfast—bacon, eggs, cheese—wafted through the room.</p><p>It took my brain a moment to catch up. What kind of thief started cooking after stealing a crown? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Patrick beamed at me, surprise in his eyes that faded to suspicion when he caught sight of Jeff.</p><p>“Fallon. What are you doing here?”</p><p>“Patrick, this is Jeff Christopher. He’s a member of the NAC and a friend of the family’s. Can we come in? We need to talk. It’s Pack business.”</p> <p>He looked confused, and rubbed his hands on his towel before moving aside to let us in. “Sure.”</p><p>We stepped inside, and Jeff closed the door behind us. The interior of the cabin was pretty, the hewn-wood walls exposed, the furniture made of logs and covered in plaid fabrics. Fishing equipment hung on the walls beside antique posters advertising vacations on the Great Lakes.</p><p>Patrick put the towel on a table and crossed his arms. “What’s this about, exactly?”</p><p>“We don’t have time to be subtle, so I’m going to get to it. The crown is missing. The evidence suggests you took it.”</p><p>The weight of the accusation seemed to actually push him, and he took a step backward, his gaze switching between me and Jeff. “I’m sorry—you think I stole the crown? The Pack’s crown?”</p> <p>“Did you?” Jeff asked, with hostility he hadn’t bothered to mask.</p><p>“No, I didn’t.” He looked at me. “I told you I had no interest in the crown. And I sure as shit wouldn’t steal something that didn’t belong to me. Is this because we talked about the initiation?”</p><p>“It’s because we have video of you coming back to the house. Breaking in, and then leaving again.”</p><p>Patrick closed his eyes and was quiet for a very long moment. “Damn it,” he finally said. “I knew that was going to cause trouble. Knew it, and ignored my instincts.”</p><p>He gestured toward a set of coats and jackets that hung on the opposite wall, and at my nod, walked to the black jacket he’d worn last night. He reached into the pocket, and pulled out a pair of leather gloves.</p><p>The same leather gloves he’d taken off when he’d first arrived at the house.</p> <p>“I must have dropped one, and didn’t realize it until we’d nearly gotten into the city. They were my father’s, and I didn’t just want to leave it there.” He looked at me apologetically. “I just thought it would be easier if I didn’t wake anyone.”</p><p>So he didn’t have to see me again, he meant.</p><p>Jeff didn’t care about the reason; he wasn’t buying the excuse. “So you maintain you came back to the house and broke in to retrieve a leather glove.”</p><p>Patrick glared at Jeff. “I don’t maintain it. That’s exactly what I did.”</p><p>“According to our video, you’re the only one who came into the house or left,” I said.</p><p>“And you have cameras on every door and window?”</p><p>I glanced at Jeff, who shook his head. “Just the front door.”</p><p>“There you go. I may have been the only one in and out of the front door, but clearly someone else came in and out of the house. Look, I’m sorry the crown’s missing. I’m sure that creates a political shit-storm for your family. But you’ve got the wrong guy.” He gestured to the room. “Do I look like I’m getting ready to take over the Pack? Does this look like I’m getting ready for a coup d’etat? I’ve got food in the oven, for god’s sake.”</p> <p>“What about this?” I pulled the scrap of velvet from my pocket, held it in my outstretched palm.</p><p>He leaned forward to look at it. “I don’t know what that is.”</p><p>“It’s from the cushion that held the crown,” Jeff said.</p><p>“And what’s that’s got to do with me?”</p><p>“It was in your hotel room at the Meridian.”</p><p>“My hotel”—he began, then trailed off. A flush darkened his cheeks. “Ah. This is . . . awkward.” He cleared his throat, looked at me apologetically. “When I got back to the hotel, I had a drink at the bar. I met someone. I didn’t plan on meeting someone, but it happened.” He paused. “I didn’t go back to my room, if you know what I mean.”</p><p>I was going to start referring to the last twenty-four hours as the Night of a Thousand Humiliations.</p><p>Jeff, however, wasn’t humiliated. He was pissed. “You reject Fallon Keene and then go off with some bar skank?”</p><p>We both turned to stare at Jeff.</p><p>“Jeff.”</p><p>“What? I don’t care if he’s a York or Keene or Old McDonald. He needs to learn some damned chivalry.”</p><p>Patrick had at least eighty pounds on Jeff, but that didn’t stop Jeff from taking a menacing step forward.</p><p>“Whoa,” Patrick said, lifting his hands. “You’ve got the wrong idea. Fallon’s the one who wasn’t interested, not me.”</p><p>Jeff’s brows perked up. “Oh?”</p><p>“Hey, idiots, we have a missing crown,” I reminded them, ignoring the sudden grin on Jeff’s face. “Can we get back to that?”</p><p>Patrick looked at me. “The point is, I wasn’t in the room.”</p><p>“It was booked under your name,” Jeff said. “They knew you’d checked in and out. If you didn’t stay there, who did?”</p><p>Emotions cycled across Patrick’s face, from denial to confusion to anger. “Tom,” he finally said. “I gave the room to Tom.”</p><p>“Who’s Tom?” Jeff asked.</p><p>“The driver,” I said, as the weight of truth settled around us.</p><p>Patrick shook his head. “He wouldn’t do that to the family. Put us in that kind of position. Create that kind of danger for us.”</p><p>“Maybe he isn’t doing it to the family,” Jeff quietly said. “Maybe he’s doing it for the family. To get the Yorks into power.”</p><p>Patrick shook his head. “My father’s sick. He doesn’t have the energy, and he’s not interested in the crown.”</p><p>“He doesn’t have to be interested,” I said. “Maybe Tom is interested enough for the both of you.”</p><p>Patrick wanted to deny it; that was clear in his face. But he worked it out, considered, and ultimately nodded.</p><p>“I told him he didn’t need to go to the city with me. But he offered, wanted to come. It was a big deal, he said, for me to have an opportunity to meet Fallon Keene. I guess it was an opportunity for him.”</p><p>“Where is he now?”</p><p>“He went into town for supplies.”</p><p>As if on cue, a car door closed outside.</p><p>“How do you want to handle it?” Patrick asked.</p><p>“Get him into the house. We’ll have an easier time handling him in here than if he’s tramping around Wisconsin.”</p><p>Patrick nodded. I slipped into the kitchen, and Jeff stayed in the living room, backing into a corner on the far side to block any effort for Tom to slip outside again.</p><p>The door opened and Tom stepped inside, a bag of groceries in hand, fresh snow on his cap and shoulders. “Got the goods, boss.”</p><p>He looked up like prey scenting predator, probably recognizing the foreign magic that permeated the cabin.</p><p>Patrick stepped into the room. Jeff moved to the front door, blocking it with his body.</p><p>Tom took one look at the room, and his eyes went cold.</p><p>“Tom,” Patrick said. “They’re here to talk to you. They say you have the crown.”</p><p>Tom’s eyes flattened. “I don’t know what you’re talking about.”</p><p>I stepped into the room. “Let’s not make this more complicated than it should be.”</p><p>He looked at me dismissively, then turned his gaze to Patrick again. “That crown should be yours. You deserve it. Should have it. Your family’s older. Worked harder. Got more to show for it.”</p><p>Patrick looked completely bewildered. I didn’t think anyone could fake that kind of surprise, so I scratched him off as a potential accomplice.</p><p>“You’re talking about treason,” Patrick said.</p><p>“I’m talking about what’s right,” Tom insisted, jabbing his index finger into the air like it punctuated his words. “You know who should be ruling the Pack? You. Not Gabriel fucking Keene.”</p><p>I moved closer to him. “Where is it, Tom? Where did you put the crown?”</p><p>He looked at me, lip curled. “What, Gabriel can’t fight his own battles? Has to send his little whore to do it?”</p><p>Light and magic burst through the room.</p><p>Jeff shifted, a tiger emerging from the cloud of magic where a man had stood, twelve feet of white and black fur and muscle. He opened his mouth and roared, ivory teeth bared, the sound vibrating the glass in the windows.</p><p>I took another step forward. “Here’s the thing, Tom. That’s Jeff Christopher, one of Gabriel’s favorite shifters. He’s a good friend, and he doesn’t really care for insults. And I don’t think he’s eaten in a few hours.” I glanced at Jeff. “Hungry much?”</p><p>He growled ominously.</p><p>Tom glanced between us, then grabbed the nearest piece of furniture—a tall shelf—and pushed it over toward us. Glass and wood and knick-knacks hit the floor with a crack, as Patrick and I jumped back to avoid the fall.</p><p>Tom bolted, running back out the door and down the driveway. Another flash of light and he shifted into a lean, black wolf, then took off into the darkness.</p><p>“Go!” I told Jeff, who burst through the door after him.</p><p>I glanced back at Patrick. “Stay here in case he comes back. And call Gabriel—tell him what’s happened.”</p><p>Patrick nodded and pulled out his phone, glancing carefully away when I yanked off my clothes and threw them into a pile. The magic of shifting, unfortunately, didn’t do much for clothing. You wanted to keep it, you took it off first.</p><p>Naked in the doorway, snow biting at my skin, I jumped . . . and let the magic cover me. By the time I hit the ground, I was in my animal form. A gray wolf, eyes the same amber as my own. My mind stayed human, but my senses were animal. The world opened into smells and sounds that I couldn’t have detected in my human form, including the trail of scent and magic that now led into the woods in front of us. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I dashed forward, snow crunching beneath my paws, and moved into the woods. There was no path but the one they’d cut through the snowy underbrush, limbs snapped and bent from the force of their bodies. I pushed for speed, ears straining for the sound of them . . . and heard nothing until a feline roar</p><p>Jeff, I thought with panic, paws pounding faster and faster across snow, my heart tripping like snare drum. A few feet more and I found them on the ground in a tangle, white and black fur against the newly fallen snow. Blood spattered the ground beneath them as they rolled. Jeff was considerably larger, but Tom was smaller, more agile.</p><p>They rolled, Tom biting at Jeff’s back haunch until Jeff shook him off. Tom bounced and rolled, while Jeff bared his teeth and screamed his frustration into the night.</p> <p>My turn, I thought. Head down, I paced forward, teeth bared. Tom rose, shook off the fall, and showed his teeth again, daring me to attack. His muzzle was bloodied, which only infuriated me more.</p><p>I jumped, landing on his back, clawing and biting to make him submit. He rolled, pressing me back into snow until he yipped again and jumped away, a hank of Tom’s fur and skin hanging from Jeff’s muzzle. You played with the big cats, you were bound to get hurt.</p><p>I rolled and rose as Jeff leapt for Tom again, sinking claws into the back of Tom’s neck and tossing him forward like a stuffed animal. But Tom still didn’t stop. He climbed stiffly to his feet again, eyes narrowed and lips curled back in a chilling imitation of a smile. Facing me, he padded forward, one slow step at a time, violent intent in his eyes.</p><p>He bounded forward, and I braced myself for the impact. But the weight came from a different direction. Jeff had rushed forward, pushing me out of the way, so their bodies, so large and powerful, met with a thunderclap of sound, front legs in the air, scraping at fur and flesh.</p><p>They scuffled, several hundred pounds of battling animals, and hit the ground with the impact of an earthquake, pitching across the ground with the force of a tank. I tried to scramble out of their way, but wasn’t fast enough. Tom bucked and I caught the force of his back feet, which spun me backward.</p> <p>I hit a tree, head slamming into the bark, and the entire world flipped upside down. My vision tripled, and sound became a raging tide.</p><p>Minutes passed while I lay in the snow, only dimly aware of shuffling, running, roaring. And then, finally, soft nudges against my haunch.</p><p>I lifted my head. Jeff rubbed his massive head against me like a house cat. He looked up at me with the face of a tiger, but the concern in his eyes was very Jeff Christopher.</p><p>He made a grumbly sound, nudged my hip again. I rolled and tried to climb to my feet. It took two attempts before I managed to stand, all four paws on the ground.</p><p>The woods were quiet and still, snow still falling in large, heavy flakes. Tom was gone. Jeff had let him go in order to ensure sure I was alright.</p><p>He nudged me again, more gently, a hacker in the body of a big cat who’d come to my rescue, who stood no insult where I was concerned, who wanted me despite everything else.</p> <p>When the sound in my head quieted to a dull roar, we padded back through the forest.</p><p>We merged again on the main road, the air white with snow. The black SUV Tom had driven was gone, any tracks covered by snowfall.</p><p>We returned to the house and changed back into human forms and clothing.</p><p>Patrick sat on the plaid couch, hands clasped in front of him. He stared at the floor, shock still clear on his face.</p><p>“I talked to Gabriel,” he said, looking up when we walked back into the room. “He said he’d talked to my father. He’s going to send Damien to check on him.” He looked up at me, fear in his eyes. “I don’t want my father hurt.”</p><p>Damien Garza had a reputation for ruthlessness. “He won’t be, if there’s no reason for it. But if this is treason . . .” I didn’t need to finish the statement. All shifters knew the cost of treason. Some families, like mine, better than others.</p><p>I sat down on the couch across from him, and Jeff followed. “Tom said he wanted the crown for your father. Do you think your father would have sent him here? Condoned what he’d done? Helped plan it?”</p><p>“No,” Patrick said. “There’s no way. He doesn’t care about politics, and even if he did, he respects Gabriel. If he’d had something to say, he wouldn’t say it like this.”</p> <p>“His illness?” Jeff asked.</p><p>Patrick glanced at him. “His health is deteriorating. But not his mind. And not his sense of loyalty.”</p><p>And I appreciated Patrick’s loyalty to his family, but we’d need more than words and assurances.</p><p>Holding the crown meant holding the power to control the Pack. The risk was too high to trust a hunch. “We’ll see what Damien has to say.” I glanced around the house. “You checked here?”</p><p>“High and low,” Patrick said, “while you were out there.”</p><p>“It must have been in the vehicle,” Jeff said.</p><p>Patrick nodded. “I didn’t even hear him leave. The snow, I guess. Where do you think he’ll go next?”</p><p>I glanced at Jeff, who nodded back at me. We were both thinking the same thing.</p><p>“He wants your family in charge of the Pack, not mine. And we’re about to welcome the Apex-in-waiting into the Pack. If I was him,” I said, “I’d hit the initiation.”</p><p>Time ticked down. We returned to the house and found the family in the front parlor already dressed for the ceremony, which was less than two hours away.</p><p>“Damien’s got an eye on the house in Wausau,” Gabe said, rolling his shoulders uncomfortably in a black suit jacket that barely contained his muscular bulk. “Richard’s there, and the rest of the family. They were shocked and appalled by what Tom’s done.”</p><p>“Did they suspect anything?” I asked.</p><p>“Not according to Richard. Tom’s always been loyal, but never crazy. Damien believed them.”</p><p>And we had no other idea where Tom might be. “Damn it,” I muttered.</p><p>Gabriel looked at me with swirling amber eyes. “Is there something you’d like to say, Fallon?”</p><p>I caught Jeff’s gaze and found sympathy there. Somehow it made me feel worse.</p><p>“He’s still got the crown, and that’s my fault.”</p><p>“How is his treason your fault?”</p><p>“I wasn’t able to bring him in.”</p><p>“Did you steal the crown? Hand it to him? Step aside in the battle because you were afraid?”</p><p>“No, of course not.”</p><p>Gabriel nodded. “Okay, then. You fought a battle, and you lost it. It happens. We’re shifters; not superheroes. The point is stepping up after the loss, preparing for the next one. Berating yourself because you didn’t win is a waste of time and energy. He’s gone underground. But he’ll show tonight.”</p><p>I intended to ensure that was true. “We can walk the perimeter,” I suggested. “Scout the church for weak spots.”</p><p>“And we’ll need extra guards in the sanctuary,” Eli said.</p><p>“Actually, I think that’s a bad idea.”</p><p>We all looked at Jeff.</p><p>“You think guards are a bad idea?” Gabe asked. “Why?”</p><p>“Because they might scare him off. Look, he’s got the crown. He’ll be planning to make a stand—otherwise, what’s the point of going to all that trouble? And, yeah, the ceremony makes obvious sense.”</p><p>He leaned forward. “We know when and where he’ll try to use the crown to claim control of the Pack. That gives us home field advantage. Let him come. We’ll be ready.”</p><p>Gabriel looked at him, eyes glowing like sunlit amber. “We’ll be ready,” he agreed.</p><p>5</p><p>St. Bridget’s was gorgeous, a church of fairy tale proportions and fantastical architecture. The building, also located in Ukrainian Village, was constructed of pink-peach stone with turquoise turrets, and the interior was just as colorful, with lots of wood, marble, and inset stone.</p><p>Right now, it was the site of vampire-worthy scheming. We’d guessed Tom would take a stand. Instead of trying to keep him out, we’d let him come in, crown in hand. And then we’d take him out.</p><p>At Jeff’s suggestion, a small corps of trustworthy shifters took positions outside in the dark, hidden from view but keeping an eye on the church and its access points. If—or when—Tom tried anything, we’d have eyes on him.</p><p>The interior of the church would have the same setup. A few friends of the family, all shifters, sat in the pews as if preparing to witness Connor’s initiation. But they were armed and prewarned—and they were as excited as shifters could be about the possibility of a good, solid brawl.</p><p>Jeff and I, both dressed in respectful black, stood on the church’s front steps, peering into the darkness. The snow still fell, powdering the neighborhood in white.</p><p>“You’re nervous,” Jeff said.</p><p>“It’s not every day I use my family as bait.”</p><p>“They can handle themselves,” he said. “It’s a good plan.”</p><p>“I know. And it was your good plan.”</p><p>He nodded, and we stood in silence, so much unspoken between us.</p><p>“We should go inside,” Jeff said. I turned to walk into the church, but he took my hand and pulled me against his body. Before I could object, his lips were on mine, mouth insistent.</p><p>He kissed me there on the steps of the church, with snow falling like tears around us. When he pulled away a moment later, my breath was short.</p><p>“Jeff,” I said, but he shook his head, leaned his forehead against mine.</p><p>“Every time I breathe, I breathe for you. Every time I speak, I speak for you. And every time I howl, I howl for you.” He pressed his lips to mine, so softly. “This isn’t over,” he said, and walked inside.</p><p>My hands and knees shaking, I followed him.</p><p>Gabriel stood in the back of the church with Eli. The rest of my brothers had taken their seats, dressed in suits as if we’d planned to proceed as normal. But Tanya and Connor were secure in an anteroom with Berna and a few of her minions. She didn’t look like much of a threat—squat figure, bleached hair—but she was, as Gabriel liked to say, a wolverine when it came to her family. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Any sign?” Gabriel asked us.</p><p>“Not yet,” Jeff said. “But I have to think he’ll be along soon enough.”</p><p>“He’ll be along,” Gabriel said. “If he’s brassy enough to walk away with the crown, he’s brassy enough to try and make the initiation his. Take your positions.”</p> <p>Jeff nodded and took his place on the other side of the aisle. I walked to the second pew and slid across slick wood to join Ben and Christopher.</p><p>Gabriel stepped up to the dais in front of the church and looked out over the shifters who’d come to witness history.</p><p>“The Pack exists only because its members allow it. The Keenes rule only because the Pack allows it. My father kept this Pack safe, and we have tried to do the same, to enforce the Pack’s will. We are lucky enough to have given birth to a new generation. To the twelfth generation of Keenes to hold the Pack.” His gaze went cold. “And one way or the other, he will be brought into the Pack in his rightful place.”</p><p>The doors burst open, magic rushing inside like water. The crown’s magic was unmistakable. But when I looked back, it wasn’t Tom who wore the coronet.</p><p>It was Patrick.</p> <p>I was too stunned to move, to speak. He’d played me. Played all of us. He’d feigned innocence, pretended shock at Tom’s reaction, and faked interest in me. Fury rose, hot and needle sharp.</p><p>“Patrick,” Gabriel said. “I’m disappointed.”</p><p>Patrick swaggered forward, the coronet glinting atop his dark hair. “Why? Because someone outsmarted you? Because you’re not the only one who thinks he can run the Pack?”</p><p>Gabriel’s expression stayed flat, but his magic had surged forward, filling the air with heat and power. “Because you used people. Because you betrayed your father and your Pack. And because you think any of those things qualify you to be Apex.”</p><p>Patrick smiled thinly. “I’m wearing the crown. That’s the only qualification I need.”</p><p>“That’s an unfortunately short-sighted view. A leader needs soldiers. Where’s Tom? Or the rest of your family?”</p> <p>Patrick’s eyes narrowed, but just for a moment. “Tom did his part. He’s done. And my family is irrelevant.”</p><p>“Family is never irrelevant,” Gabriel said. “Family is Pack, and Pack is family.”</p><p>“Speaking of which,” Patrick said, “where’s yours? No wife? No kid? I guess you can’t have an initiation without a crown.”</p><p>“Oh,” Gabriel said, his tone deceptively smooth, “don’t worry yourself, whelp. There will be an initiation yet.” He let out an ear-splitting whistle, and we fell into place. The shifters emerged from the foyer, the balcony, the sanctuary’s hidden wings, surrounding Patrick and the crown.</p><p>Patrick’s expression didn’t change. If anything, he looked excited by the challenge. “Twenty to one odds,” he said. “You want to grab five or ten more shifters for yourself to make it even?”</p><p>His arrogance was staggering. Is that what he thought made a good Apex? Exaggeration and brute force?</p><p>But Gabriel didn’t move. It was Jeff who stepped forward to face down Patrick.</p><p>Gabriel smiled. “I’m afraid I’ll have to get in line. Mr. Christopher has dibs on you, my friend.”</p> <p>“Fallon’s tiger pet? This should be fun.”</p><p>Jeff’s eyes were cold and hard. “Not fun so much as incredibly satisfying.” He flexed his fingers menacingly, rolled his shoulders.</p><p>“You want to fight like humans?” Patrick asked, mild amusement on his face. He thought he’d lucked out. Thought fighting Jeff’s lean human form would be an easier victory than fighting the tiger.</p><p>As if the man was somehow less tenacious, I thought with the smallest hint of a smile.</p><p>“Oh, I wouldn’t want you to lose that crown by shifting,” Jeff said. “I think we can take care of this the old fashioned way.”</p><p>“I’m game,” Patrick said, motioning him forward.</p><p>Jeff didn’t waste any time. Patrick braced himself, turning his body to the side to prepare for Jeff’s onslaught.</p><p>“I’ve got a twenty on Jeff,” Ben murmured to Christopher, both of whom sat on the pew in front of me.</p><p>“No deal,” Christopher said. “I’m not betting against the house.”</p><p>A wise decision. I’d seen Jeff fight before, knew he was a capable soldier. But this battle was about emotion. It was about Gabriel, the Pack, the crown . . . and me.</p><p>They began like boxers, circling each other, fists clenched and ready to go. Patrick opted for brute force, tried to land three punches before he realized Jeff was faster. Patrick tried an uppercut, and Jeff used the shot against him, landing a sidekick in on unprotected right.</p><p>Patrick spat out a curse, but stayed up. “You’re a tenacious little thing, aren’t you?”</p><p>“Your words,” Jeff said, dodging to avoid another jab. “Not mine.” He nailed Patrick with a punch to the stomach that sent him shuffling backward.</p><p>But it only incited Patrick’s rage. He balanced himself, surged forward, pulled Jeff to the ground. They grappled, bowled down the aisle, knocking flower stands and hymnals to the ground.</p><p>Patrick belted him, a shot across the face that split his lip, sending the scent of blood into the air.</p><p>Suddenly struck by fear, I started to rise, but Ben put a hand on mine, shook his head. “Let Jeff handle this.”</p><p>Jeff shifted his body weight, rolled Patrick again, ended up on top of him . . . and then punched him square in the face.</p><p>Patrick’s eyes fluttered back, and his head bounced on the marble floor with a sick thud.</p><p>Chest heaving, Jeff stood up and ripped the coronet from Patrick’s forehead. “I believe that belongs to someone else, you son of a bitch.”</p><p>After Patrick was taken away and Jeff got cleaned up, Berna escorted Tanya and Connor into the sanctuary. With Gabriel, they stepped to the front of the church together.</p><p>While Tanya held Connor, Gabriel held the coronet, in both palms, as if gauging its weight. The church was utterly silent, all of us waiting for word from our alpha.</p><p>After a moment, he looked up at us. “I had a plan of things to say. Things I’ve considered for a very long time. Things I figured I’d eventually say to my sister, or perhaps a daughter. Now, my son. This is just a piece of metal,” he said, holding it up, light glinting off the engravings. “But it is also so much more than that. It’s a reminder of who we are, of the promises we’ve made to each other.”</p><p>Gabriel reached out, placed the crown carefully on Connor’s head. It was much too big, but canted backward just managed to stay on.</p><p>Connor’s eyes went huge, and he went still, as if stunned by the weight of the crown on his head. Probably a good lesson.</p><p>“I hereby initiate Connor Devereaux Keene into the Pack. May he live long, fight fiercely, love well.”</p><p>The shifters whooped and yelled their joy, clapping fiercely at the child who stood before them, eyes wide and grinning at the commotion made on his behalf.</p><p>Gabriel put an arm around Tanya, pulling her close as the crowd celebrated their family. They were happy, a unit bound by love and magic.</p><p>And I felt only sadness. Why couldn’t I have that? A chance at happiness? A chance at love and family? Why did prejudice have to figure into it?</p><p>I looked at Jeff, found his gaze on me, eyes wide in understanding.</p><p>And there in the pew, in the church of our Pack, he reached for my hand, and I let him take it.</p><p>Jeff rose, and when the first wave of shifters who’d offered their congratulations had stepped aside, moved to Gabriel.</p><p>“We need to talk.” His voice was quiet, but earnest.</p><p>Gabe looked at Jeff, then me. “Why don’t we step into the hallway?”</p><p>As we moved from the sanctuary to the classrooms and offices, the grandness of the chapel gave way to utility and function. The hallway smelled of crayons, rubber toys, and fruit punch, the walls dotted with posters, children’s art, and the occasional smudge of finger paint.</p><p>We walked into a classroom, and Gabriel closed the door behind us.</p><p>The room filled quickly with magic—tense, angry, and ready to boil over.</p><p>Jeff swallowed, took a step toward Gabriel. “I love your sister.”</p><p>I stared at him. I hadn’t expected him to lead with love.</p><p>“Oh?” Gabriel asked. “Do you?”</p><p>“You know I do. The whole damn family probably knows I do. Hell, there probably aren’t any supernaturals in the city who don’t know it.”</p><p>Gabriel’s eyes stayed cool. “I’m not entirely sure what you expect me to do about that.”</p><p>“What I expect? I expect you to stop this potential bullshit so she can be happy.”</p><p>“She’s a member of my family, and second in line for the Pack. You both know what that means.” He slid his dangerous gaze toward me. “You know the price.”</p><p>I stared at my brother, fury rising for the second time tonight at an arrogant wolf. “Jeff, can you please give us a minute?”</p><p>He kept his gaze on me, but paused.</p><p>I nodded again, offering reassurance, and he left the room and closed the door behind him. A scream building in my chest, I slowly looked back at my oldest brother.</p><p>“I am sick of you trying to control me and my life.”</p><p>Gabriel snorted. “Are you of the misguided opinion that you’ve somehow meekly followed orders?”</p><p>The snark in his voice rankled, and I had to fist my hands to keep from pummeling him. “The sarcasm isn’t helping.”</p><p>“No, it probably isn’t. So how about the truth: You have a role to play, and you know it. Sure, you like spending time with Jeff. He’s a great guy. He’s loyal to the Pack. Always ready to serve. But he’s not a potential. He can’t be.”</p><p>I swallowed, mustered my courage. “Then I’m done with potentials.”</p><p>Magic spilled into the room, angry and biting like insects. I worked not to flinch.</p><p>“Excuse me?” Gabriel asked, very slowly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It would have been easy to back down. To tuck my tail and slink out of the room, and let things be the way they’d been before. But that left me lonely and dishonest to myself, to Jeff, and to the potentials. So I gathered up my courage, and put it out there.</p><p>“I’m done with potentials. I’m not going to meet any more of them. I’m going to date who I want to date, regardless of the type of shifter he is. And I’ll give up my place in the line of succession if that’s what it takes.”</p><p>He looked at me, jaw clenched and twitching. “Is this your way of rebelling?”</p> <p>“Of course not.” It was, of course, but not in the way he meant. It was a rebellion against what we’d been taught, about who I’d been taught to be. But it wasn’t a rebellion for the sake of rebellion. It was about, for the first time, being true to myself.</p><p>“I’ve done my part to protect the Pack, the crown. But it’s time to think about my future. I love him.” Tears rose to my eyes at the power of the admission. “He’s the other half of me, and I’ve known that for a long time. But I haven’t admitted it, and that’s not fair to him or me or anyone else.” I paused, looked up at my big brother, and the leader of my Pack. “I’ll give up the Pack for him. Because he’s worth the price. I’ll abdicate.”</p><p>Of course Jeff was worth the price. He was the one who’d loved me regardless. The one who’d fought by my side despite the humiliation of potentials and dates. The one who made me laugh at myself, who understood me better than anyone in the world.</p><p>It felt like a weight had lifted from my shoulders. My body felt lighter. My soul felt lighter. For the first time in my life, I felt like Fallon. Just Fallon, because he’d given me permission to be myself.</p><p>For a long time, he just looked at me. And then one corner of his lip lifted. “Okay.”</p> <p>I stared at him. “Okay? That’s it?”</p><p>“I wasn’t aware you were entertaining other answers.” He tilted up my chin, searched my eyes. “I love you, Fallon. And so do your other brothers. And so did Mom, and so did Pop. You are exactly who you’re supposed to be. No more, no less. And you always will be, whether the coronet is yours or not.”</p><p>“What about the Pack?”</p><p>“The Pack is the Pack.” Gabe gestured toward the door. “You were in that chapel. They know love. They know respect. That’s the foundation of the Pack. And if you can’t love—if you can’t be brave enough to put love first, even if you have to sacrifice to do it—you do the Pack no service. Cowards do the Pack no service.”</p><p>I nodded, but put a hand on his arm. “You aren’t going to tell them now, are you? This is Connor’s night. This can wait.”</p><p>He grinned. “Connor won’t remember a single damn thing about tonight. But you’ll remember the look of sheer panic on Eli’s face when we tell him he’s next in line.”</p> <p>The gleam in my eyes probably wasn’t especially graceful. But he was right. “Oh, yes,” I said. “Tonight is the night.”</p><p>We walked back into the room, every shifter in the sanctuary turning to face us. Gabriel put a hand at my back, rubbed supportively.</p><p>“There’s news to share,” Gabe said. “Our favorite Keene has made a decision about her future.”</p><p>I pushed the words out in a rush, lest I lose the nerve. “I hereby abdicate. Give up my position in the line of succession.” I let my gaze find Jeff, whose eyes had gone fierce. “For love.”</p><p>Noise erupted around me. I must have expected anger or disappointment, because their congratulations completely floored me.</p><p>Ben picked me up, swung me around the room. “We’ve been waiting for this, sister.”</p><p>I looked for Eli, searched his gaze for anger. As the shifter next in line, the decision would affect him most of all. But if I’d added pressure, he certainly didn’t look it.</p><p>When Ben released me, I walked to him. “I should have talked to you first—” I began, but he shook his head, put a hand on my shoulder.</p> <p>“You’re allowed to have a life, Fal. You don’t have to ask me for permission to do that. Or any other yahoo in the room.”</p><p>“You’re sure?”</p><p>“Without a doubt,” he said, and for the first time, I saw in his eyes that same golden swirl of knowledge that I’d often seen in Gabriel’s. He may never lay claim to the Pack, but if he did, he’d be prepared.</p><p>Eli embraced me, kissed the top of my head. “I believe someone’s waiting for you.”</p><p>He released me, and I looked in the direction of his gaze.</p><p>Jeff stood apart from everyone else, eyes shining with love and face beaming with happiness. I don’t think I’d ever seen him that happy.</p><p>He grinned, held out a hand.</p><p>I walked to him, biting my lip to hold back a grin that felt like it would have split my face. But he was impatient. He stepped forward, met me in the middle, and cupped my face in his hands.</p><p>“I love you, Fallon Keene. I’ve loved you since the moment I saw you. And I will love you every day and night for the rest of my life.”</p><p>Tears blossomed. “I love you, too.”</p><p>With my family cheering and applauding around us, Jeff Christopher kissed me.</p><p>And for the first time, all was right with the world.</p><p>He’d made me wait in the living room, and I stood in front of the giant fish tank that stood opposite the picture window, watching clown fish dart back and forth across the water.</p><p>When the bedroom door opened, I glanced back. Jeff stood in the doorway in a pair of silk boxers. I’d only seen him naked when we’d shifted, but that meant I wasn’t exactly paying attention to his nakedness.</p><p>Jeff may have been lean, but he was well-hewn. He had the body of an endurance athlete, every inch and plane smoothed with muscle.</p><p>“My eyes are up here, Fallon.”</p><p>I took the admonishment, looked up at him with a grin, and found him smiling back with me.</p><p>He held out a hand and beckoned me forward. And I followed him. In the doorway, he kissed me softly, then gestured toward the room.</p><p>“Madam, your palace.”</p><p>The bed was covered in pink rose petals, and a bottle of champagne was cooling in a sterling silver stand. A woman’s throaty voice crooned softly in the background.</p><p>“This is . . . impressive,” I said.</p><p>“Just wait.” He turned off the lights, and two dozen candles sprang to life around the room, which now glowed softly.</p><p>“Magic?” I wondered.</p><p>He grinned. “LEDs. I connected them to a circuit”—he began, but waved off the thought. “It doesn’t matter. The point is, we’re here. And I wanted this to be romantic. Just for us.”</p><p>I nodded, but the intimacy in his eyes made me feel suddenly shy.</p><p>He took my hand. Squeezed it. “Are you all right?”</p><p>“I’m fine,” I said, and looked away to avoid the intimacy in his eyes. But he tipped my chin back to meet him again.</p><p>“Honesty between us,” he said. “Just me and you. Okay?”</p><p>I looked at him, remembered the trust I’d already put him, and nodded. “Just nervous. It’s me and you—and we’re—well, you know.”</p><p>He smiled. “I know. But it’s me and you. And we don’t have a timetable.”</p><p>He led me to the bed and tugged the belt on the robe he’d let me borrow. It fell to the ground, revealing the long, black negligee I’d worn beneath it, a slick fall of bias-cut silk.</p><p>“You look . . . absolutely amazing.” The adoration in his eyes left little doubt of his sincerity.</p><p>“Thank you. You look pretty delectable yourself.”</p><p>He put his arms around me, drew me forward against the long line of his body, and kissed me. And this time, there was no restraint, no fear, no caution. His kiss was possessive—and also victorious.</p><p>We tumbled onto the bed, Jeff apologizing when he tangled in the silk that fell to my ankles. He rolled me atop him, plucked a rose petal from my hair, then pulled my mouth to his and kissed me again.</p><p>His lips were so soft, the kiss so tender. But somehow, missing something.</p><p>He drew back, pushed the hair away from my face. “Are you alright?”</p><p>I propped my arms on either side of his head. “Honestly, I still feel a little ungainly right now.”</p><p>He squinted, scratched at his temple. “I kind of know what you mean.”</p><p>He sat up, surveyed the room. “I think maybe this isn’t us. I mean, don’t get me wrong—I like romance as well as the next guy.” He picked up a handful of rose petals, and let them fall like water from his hand. “I’m just not sure this is our kind of romance.”</p><p>I looked around at the scene he’d prepared. It was all perfect, and right out of the romance playbook. But maybe not our particular romance playbook. “I think you’re right. What do we do?”</p><p>He looked over at me. “Do you think you can juggle?”</p><p>As it turned out, I could juggle. With some instruction.</p><p>He’d stuck to boxers, but I’d switched out the negligee for another “Jakob’s Quest” T-shirt for the lesson, and we’d reassembled in the living room, where we had plenty of space to maneuver.</p><p>Jeff was a marvel. Having seen him in full gaming frenzy, I didn’t doubt he had great hand-eye coordination. But watching him whip beanbags through the air in smooth and fluid arcs was seriously impressive.</p><p>He taught me to toss one, then two, and I was feeling optimistic. But tossing the beanbags he’d pulled from a drawer with syncopation just wasn’t happening.</p><p>I smiled at the pile of beanbags on the floor. “I can’t do this.”</p><p>“You can,” he assured me, standing behind, hands at my waist to ensure I was standing up right and kept my elbows at my side.</p><p>The beanbags hit the floor again . . . and then again . . . and then again.</p><p>And then, by some miracle of gravity and inertia, I had it. The bags moved like competing waves, slipping by each other—and somehow landing in hand, where I tossed them into the air again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I got it,” I said through clenched teeth, afraid to move. “I think I got it.”</p><p>“You got it,” he said behind me, his excitement a buzz of magic at my back.</p><p>And then . . . I didn’t have it.</p> <p>One of the bags bounced awkwardly off my hand, and when I instinctively reached for it, I tossed another off course. It plopped into the fish tank with a gurgle, the fish darting to their corners like boxers at the bell.</p><p>Jeff punched both arms into the air. “Touchdown!” he screamed out, like I’d just made the winning throw at the Super Bowl.</p><p>I burst out laughing . . . and couldn’t stop. I laughed until tears flowed from the corner of my eyes, until I was on my knees on the carpeted floor, until my stomach was aching from it.</p><p>“The crowd goes wild!” Jeff shouted, running around the living room in a victory lap, pumping his arms in the air. He spiraled back to me, and held out his hand, fisted to hold an imaginary microphone.</p><p>“Ms. Keene, you’ve just scored your fourteenth winning touchdown in this record-setting game. How are you going to celebrate?”</p> <p>Still hiccupping with laughs, I mopped at my cheeks and looked up at him, grinning foolishly. Grinning adorably.</p><p>This, I realized, was us. Not playing at a kind of movie and magazine romance that didn’t really interest us.</p><p>But laughing together. Learning together. Loving together. That was our particular romance. And it was a heady brew.</p><p>He was still crouched in front of me when I saw the sudden intensity in his eyes, that shift from humor to seduction. This time, I didn’t shy away.</p><p>I reached out, put a hand to his cheek, and swooned when he closed his eyes, lips curving with pleasure. I leaned forward, pressed my lips to his and kissed him softly. Just a small kiss, a small enticement.</p><p>He opened his eyes, surprise on his face. “You’ve never kissed me like that.”</p> <p>I frowned. “Like what?”</p><p>“Like you needed to do it.”</p><p>Love swamped me, ferocious in its desire to make him see what I’d known for a very long time. That he’d always been the only one, even if I’d denied it.</p><p>I put my hands on his face, met his gaze. “I need you. I’ve always needed you. I just didn’t allow myself to admit it.”</p><p>He growled low in his throat, and his mouth was on mine before I’d even processed the sound. It was less a kiss than a battle, and we both intended to win.</p><p>We pulled clothing with animal ferocity, tearing at them like they were burning us alive. I found his elastic waistband and released him, and he fell, heavy and hard, into my hand.</p><p>“Jesus, Fallon,” he said against my mouth, as I handled him well and thoroughly, his body fairly vibrating with pleasure. “I need to be inside you.”</p><p>He stripped me of the clothing that remained and stared down at me.</p> <p>“Jeff?”</p><p>He held up a finger. “Un momento. I’m savoring this moment. Committing it to memory.” He slid the flat of his hand down the middle of my body, then lifted it again to cup my breast.</p><p>My body sang with pleasure, eyes drifting shut from the sensations that I’d imagined for so long, finally real.</p><p>His mouth clamped on mine again, and he pressed me down to the thick carpet beneath us, his arousal between our bodies, eager for action. With hands and fingers he teased and entreated, his kisses brutal. I dug fingers into his back, pulling him closer.</p><p>“Jeff. I need you.”</p><p>He growled, low in his throat, and without argument or delay, spread his body over mine and thrust powerfully. He made a noise that sounded like relief, but relief wasn’t on his mind, not for me.</p><p>Sweet and geeky Jeff, lover of games, knew how to move. Each nearly brutal motion rode the line between pain and pleasure as his mouth tortured mine. Our magicks rose again, keeping pace as pleasure swamped us, and exploding through the room when we cried out the other’s name.</p><p>It was twenty minutes before I could feel my legs again. I glanced at him beside me, smiled. “I’m not sure how we’re going to improve on this.”</p><p>He didn’t even pause. “I have several very specific ideas.”</p><p>I couldn’t help but laugh, and had the sense he’d been saving that response for a very long time.</p><p>“Oh?” I turned to my side to face him, propping myself on an elbow. “And what ideas are those?”</p><p>“Costumes.”</p><p>“You’re not serious.”</p><p>“Princess Leia. Wonder Woman. Silk Spectre. Mystique. Hit Girl. So many options.”</p><p>“I’m not putting on a costume to satiate your prurient fantasies,” I said, lying back on the floor again.</p><p>And then I thought about who he was, and who I was, and our kind of romance. “But if you’re willing to play Bruce Wayne, I might reconsider.”</p><p>He was. So I did. </p> </body></html>"]