["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>FATHERS AND SONS</p><p>GORDON AND ILONA ANDREWS</p><p>I floated for eternity in a sea of agony. Sometimes if I concentrated and blocked out the pain I could hear her voice, from far away. I focused on the sound, willing myself slowly toward it. Finally, after how long I didn't know, I came around and could even make out a bit of what she was saying.</p><p>\"...seems like a decent guy. Now they are stuck...\"</p> <p>He had someone, she had someone, nobody was talking, and Kate did not know what to do.</p><p>I opened my eyes. She looked tired and battered. Still, I had never in my life seen someone more beautiful. Nor had I ever been happier to be near her. For some reason the answer to her dilemma came to me far easier than all the things I really wanted to say.</p><p>\"Have you tried the Second Chance Law?\" I asked quietly. Her eyes did not open. Maybe we were sharing a dream. I explained as best I could and hugged her as hard as I was able.</p><p>Finally she looked at me.</p><p>\"You stayed with me,\" I whispered. She said something I could not quite catch, but it didn't matter as much as her being there to say it. I smiled and fell back to sleep. Real sleep this time- no red haze, just darkness. I knew she would be there when I came back to the world. No matter what. Eventually I woke again. Something was in my arm and I wanted it out. As I located the source of my irritation, Kate came into the room carrying what smelled like soup.</p> <p>\"What is this shit?\" I demanded as I pulled the IV needle out of my arm.</p><p>\"It kept you alive for eleven days,\" she informed me.</p><p>Almost two weeks! I had laid like that for nearly two God damned weeks, and she had stayed with me. It was not the IV that had kept me alive. The truth of it stunned me.</p><p>She handed me the soup. I set it aside and pulled her close. We held each other for a time. Soon however, Derek's familiar knock broke our reverie and short-lived reunion.</p><p>\"Kate,\" he inquired quietly, clearly asking permission to cross the threshold. With an authority in her voice that I had never heard, she instructed him to enter.</p><p>The kid did so. \"I have a wolf out here who wants to see you. He says it's an emergency. Probably another challenge...\"</p> <p>Challenge? For me? Every muscle in my body tensed. Really, were they fucking crazy? I almost died and they are queuing up to get a piece of what is left of me. I glanced at Kate and her face said it all. She wore a look of weary resignation and the fractured pieces fell into place.</p><p>Not me. They were challenging her.</p><p>Hell no. This shit was going to stop right now.</p><p>Derek saw me and abruptly fell silent.</p><p>\"Bring him in. Don't tell him that I'm awake.\"</p><p>The young wolf closed his mouth, turned and departed quickly to carry out my command. He had always been a smart kid.</p><p>\"Help me up?\"</p><p>Kate grabbed my hand and pulled me upright. I would be damned if they would see me laying in bed like a weakling. My body screamed for food. I picked up the bowl she'd brought earlier. The sooner I got some nutrients in, the faster I'd bounce back.</p> <p>As I sipped the soup, Jaime Alicia strode into the room as if he owned it. So eager to harm my mate and take what was mine. One of Clan Wolf's best fighters and a boxer in his youth, he was tall and well built. I had seen him fight; he was strong and fast. I was also sure that Kate could cut him into little pieces before the soup got cold. I would never admit it, but she was damn good with that sword of hers. Not that she would have to- he would be dead before he touched her.</p><p>None of them would ever harm her again. I would see them all dead first.</p><p>Jaime stared at me, his jaws slack.</p><p>I finished my soup and spoke. \"Yes?\"</p><p>The wolf dropped into a crouch and stared at the floor. Had he hesitated for a second I would have pulled his lungs out through his chest. Claw, reach in, yank out. It would be easy and I would enjoy it immensely. I could smell his fear. I wanted to roar at him.</p><p>\"Do you have anything to say?\"</p><p>With his gaze still firmly affixed to the floor, he shook his head no. Now we knew again who was who and what was what. Order needed to be restored and the rest of them needed to be reminded why I was the Beast Lord.</p><p>\"The Council is due for a meeting in three minutes. Go down there and tell them to wait for me, and I might forget you were ever here.\" For his sake I hoped he never forget how close he was to a savage and painful death, because I would not give him a second chance.</p><p>He walked out. The floor went one way, I went the other. Kate grabbed at my arm to steady me, but her leg gave way and we crashed together onto the couch. We were a long way from top form, but it would have to do. Together, even in our current state, were more than a match for any of my subjects. Well, as far as they knew.</p><p>Almost as if she realized what I was thinking, Kate asked, \"Are you sure you're ready for a Council meeting?\"</p><p>I turned to her, willing my face into a mask of determination and menace. \"They better be ready for me.\"</p><p>We had to make a show of strength. We could not continue to be seen as anything less than the Beast Lord and his Mate, undisputed masters of the Pack.</p><p>It is the nature of our kind that we value power and violence above all else, ruthlessly exploiting any weakness. Authority must be exercised at all times or lost. My people did not have to love or even like me, but by God they would obey me. If they had forgotten why I was feared, I would remind them. If I had to kill a few as an example, then so be it.</p><p>I made my way to the bathroom. I fell twice, but my strength was returning. The soup was kicking in. A couple of minutes later I was ready to make it down to the Council room on my own. On our way, Barabas, one of the Pack lawyers and one of B's favorite troublemakers, fell in behind us and kept pace.</p><p>I stopped. \"Barabas, have you come to challenge me too?\" I knew even as I said it that the challenge from him was unlikely. Barabas was slightly crazy and could be insubordinate at times, but he was not stupid.</p><p>His usual look of amusement evaporated, replaced by one of complete shock and disbelief. \"No, my Lord, I am bound to the Consort.\"</p><p>Apparently the entire place had gone to hell while I was asleep. I turned to Kate and waited for some sort of explanation.</p><p>She shrugged. \"I made a deal with B, and she gave him to me as a sort of adviser. I will tell you all about it later.\"</p><p>I wasn't sure I wanted to know; B never did anything out of altruism alone. She wanted something. I dimly recalled Kate telling me about it, but the details escaped me. Had she assisted Kate in some way? A thought struck me. \"Barabas, how many members of the Pack have challenged my mate while I slept?\"</p><p>He paused, clearly attempting to recall, finally he turned to Kate and asked, \"Twenty-two?\"</p><p>She nodded silently.</p><p>\"How many alphas?\"</p><p>\"Only the Jackals, my Lord. The others were rank and file, not even betas.\"</p><p>\"You killed the jackals?\"</p><p>She nodded.</p><p>\"Both?\"</p><p>She nodded.</p><p>Barabas cleared his throat. \"And she dared the rest of them to come and fight her. The dare wasn't accepted.\"</p><p>Of course. You didn't get to be an alpha by being dumb. After the Jackals had been killed, the others had been content to let their subordinates wear her down. Mahon could have stopped it, but did not. He had never made a secret of his disapproval of Kate, but to stand by and allow her to be injured in my absence... he and I would speak of this later. Perhaps it was time for my adoptive father to retire.</p><p>I would deal with the rest of the Council shortly. As we approached the door, I could hear them mumbling and whispering inside. Were they bored? Irritated? I could fix all of that. I took a deep breath, opened the door and roared at my subjects as if I had every intent of ending their lives in the next several seconds.</p><p>The sudden silence was deafening. Oh yes, Daddy is home and he ain't happy. Playtime was over.</p><p>As my alphas sat in stunned silence, I pulled out a chair for my mate and then seated myself at the head of the table. No one spoke. I scanned the faces seeking a challenge. Not one of them had the courage to meet my stare. They all knew that an example would have to be made and none were eager to be the first.</p><p>I leaned forward and in as calm a tone as I could manage, demanded, \"Explain yourselves.\"</p><p>Silence.</p><p>\"I am waiting for one of you to tell me why you stood by and did nothing while my mate was assaulted on a daily basis.\"</p><p>Finally Jim spoke. \"I knew she would be okay. Curran, she had to prove that she belonged.\"</p><p>\"Yes,\" Mahon rumbled. \"Nobody expected that she would be allowed to sit at your side without spilling some blood, my liege.\"</p><p>Yeah, actually I kinda did. Last time I had checked I was in charge around here. It was time to gently remind them of that. My eyes were on fire and every one of them knew what that fire meant.</p><p>I leaned forward and repeated, \"Allowed?\"</p><p>I let it sink in.</p><p>The realization of it hit them. They just told me what I was allowed to do. I heard the new alpha male of the Jackals take a deep breath and hold it.</p><p>I stared at them. \"I will say this only once. I am the one who allows. I allow all of you to live and I allow you to rule your own clans as you see fit. Whether or not I continue to do so depends solely upon what you say and do in the next few moments. Be very careful.\"</p><p>It was Aunt B who spoke next. \"Clan Bouda provided the Consort with both counsel and protection from unlawful challenges. No one who answers to me harmed her.\" She glanced over at Daniel and his mate. \"The same cannot be said of the dogs, however.\"</p><p>Of course. She wouldn't have lifted a finger to stop the wolves from digging their own grave. The hatred between the boudas and the wolves went a long way back. Wolves had greater numbers, but boudas played the game better.</p><p>\"We broke no laws,\" Daniel protested. \"Everyone knows the alpha of the Bouda Clan cut a deal with Beast Lord's mate.\"</p><p>Jennifer, his mate, nodded. \"Yes, because she wanted special status for her degenerates.\"</p><p>A slow smile crept over B's lips. \"We all know how much the alpha of the Wolf Clan loves his mate and defers to her. Out of curiosity, how many of his wolves was he willing to sacrifice to indulge her?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"The human had to prove herself like we all did,\" Daniel said. \"It is the law. It is fair.\"</p><p>They spoke of her as if she wasn't even there, instead of sitting at my side.</p><p>\"Fair, really?\" I asked. \"Who among you has faced twenty-two challenges in two weeks?\"</p> <p>None. Not even Mahon, our Executioner, had killed so many so quickly.</p><p>Speaking of law. I addressed Jennifer directly. \"If I recall correctly, Daniel, despite being chosen upon the retirement of his predecessors, had successfully faced a number of challenges before choosing you as his mate. However, you have never been challenged. Do you know why that is? Because according to the law the two of you are so fond of quoting, whoever challenges you will also have to fight Daniel. The alphas fight as one. If one of the alphas is injured, it has been an unspoken courtesy among the Pack to wait until both are on their feet before a challenge is issued. It is the matter of honor. If you take another's place, you must win it fairly. You did not afford my mate the same courtesy.\"</p><p>\"She killed my sister,\" Jennifer ground out.</p><p>Good, let's get it all out there. Settle things once and for all. \"True, your sister went loup and attacked her. Kate didn't cause it and killed the one who did. Your anger is misplaced. As a matter of fact, she did you a favor. If you were any kind of alpha, you would know that putting your sister down was your responsibility. It was your burden to carry. You are the next of kin.\"</p><p>Jennifer clenched her teeth. I measured every word carefully. I couldn't challenge her, because the challenge had to come from the ground up. But if I said enough, she would challenge me.</p> <p>\"My mate assumed your burden and instead of gratitude, you hate her for it. She is the constant reminder of your weakness. You want to fight her, but you can't. Instead you goad others into doing what you can't bring yourself to do. It is your greatest failing. However, because I am merciful and just, I will offer you a chance to atone.\"</p><p>\"I will not apologize or bow to her. I'll die first.\" Jennifer snapped at the air like a mad dog.</p><p>We'll just see about that. \"Again, you misunderstand. What I offer is a chance at the revenge you seek, but properly this time. Challenge us. Couple to couple, as it was meant to be.\"</p><p>I gave the rest a warning glance. \"No one will interfere. Just the two of you against the two of us. It is the law.\"</p><p>Kate tensed next to me. I found her hand under the table and gave her gentle squeeze to reassure her that I was just bluffing and that it would be alright. Well, not really, but I was confident that even as we were, we could take them, and all the rest if need be. As long as they believed we could do it, we wouldn't have to.</p><p>Jennifer began to rise - she really was either stupid or crazy -and Daniel grabbed her arm, almost too quickly to see, and yanked her back. She landed in the chair, hard.</p> <p>She opened her mouth. He gave her a flat stare. She shut her mouth and dropped her gaze. Her face turned red. So he was unwilling to let her throw away her life or his own. I had expected as much.</p><p>Daniel bowed his head in a slight nod. \"Clan Wolf begs the Consort for her forgiveness. We are sincerely sorry for any offense we may have caused. We wish to express our continued loyalty and obedience to the Beast Lord and his Mate.\"</p><p>Well said. Perhaps there was hope for him after all.</p><p>\"What about the rest of you?\" My gaze lingered for a moment on the alphas of Clan Rat. Thomas and Robert Lonesco shook their heads in unison.</p><p>Thomas, the older and larger of the pair, spoke. \"We have no dog in this fight.\" He smiled a little, showing very even white teeth. \"We did not vote for her because we did not know enough about her. We made amends.\"</p><p>Kate leaned in and said softly, \"After I killed the Jackals, they sent me chocolate.\"</p><p>Good, in truth I actually liked them both and would have regretted killing them.</p><p>I looked at the aforementioned Jackals replacements.</p> <p>The female, Tracy, spoke. \"We have no problem with the Consort. We are indebted to her for our current position.\"</p><p>I had expected as much. All that was left was Clan Nimble and Mahon's heavies. The old bear I would deal with privately. Clan Nimble was a sort of anomaly within shapeshifter society. Its alphas, an older Asian couple, ruled not because they were the strongest, but because their age and wisdom was highly respected by their subjects. It did not hurt, of course, that their devoted betas were a vicious pair that was feared by the rest of the clan and many in the Pack. They kept their elders from harm and it was understood that they themselves would take their place as alphas, when the time came.</p><p>The alpha of clan Nimble stood, drew himself to his full height, and then bowed deeply without his gaze ever leaving me. He held the bow then straightened and proclaimed in a very formal tone, \"Clan Nimble remembers the understanding his Majesty has shown to us, and would never dishonor itself by repaying that kindness with treason or betrayal. The Consort has fought admirably and earned a place of respect at our lord's side.\"</p><p>Okay, a simple \"we got your back\" would have sufficed but if he felt more comfortable with formality, then so be it.</p><p>\"We respect Clan Nimble and hold its friendship in high esteem.\" Ahh, that got him, he almost smiled, bowed once more, and sat again.</p><p>Almost done.</p><p>\"So, it's all settled then. Unless there is anything else, you may depart in peace. Mahon, you stay.\"</p><p>The rest filed out as quickly as they could while maintaining a semblance of dignity.</p><p>Kate turned to me. Her eyes asked me, \"Do you want me to stay?\"</p><p>Silently I shook my head. \"No, you don't want to be here for the next part.\"</p><p>I watched the Council of the Pack run from the room with their tails between their legs. One by one, they fled, careful not to look at me or the Bear. Finally the last of the shapeshifters went through the doorway. It was just the two of us.</p><p>I looked at Mahon the way an alpha looks at the subject. Mahon crossed his massive arms.</p><p>\"It comes to this, then.\"</p><p>I didn't answer.</p><p>\"It's about time. I've been waiting for this, boy. It needs to be sorted out.\"</p><p>Good, we understood each other. \"Do you want to settle this here, old man, or do you have some place in mind?\"</p><p>Mahon considered it for a long moment. \"We're going to need space. This place is too small.\"</p><p>\"Up on the fourth floor balcony, then.\"</p><p>The balcony, a flat top of one of the smaller towers, was a stone square, about twenty by fifty yards. In spring and summer we used it for outdoor dining and gatherings, but in winter it was deserted. It would provide us with plenty of room and give us some privacy as well.</p><p>This thing between Mahon and me wasn't going to be an exhibition. It wasn't a fight to the death either, but if any of the Pack happened to witness it, it would become one. I would have to kill Mahon, and I did not want to do that. Mahon wasn't my father, but I was his son.</p><p>This was between the two of us and when it was over we would know once and for all who was the strongest.</p><p>I walked through the doorway. He followed. Outside the room Derek saw me and stepped away from the wall. I glanced at him, said, \"Follow me,\" and kept walking. The kid fell in step behind us. We would need a guard to keep the rest of the Pack from sticking their noses where they didn't belong and it couldn't be Jim or Kate. Jim was my best friend. He would interfere. Kate... This was something I didn't want Kate to see. Derek would do what he was told and would keep the rest out.</p><p>The three of us made our way to the fourth floor. A solid wooden door barred the way to the balcony.</p><p>I looked at Derek. \"You stand here. Nobody gets on the other side of this door.\" I held his gaze for another long moment to make sure I had his attention. \"No one.\"</p><p>\"Yes, m'lord.\"</p><p>I opened the door and Mahon and I walked outside. The cold air hit my lungs.</p><p>The door shut behind us.</p><p>Darkness had fallen. The sky was black and vast, and the small lights of stars pierced it with cold light. Behind us the grey towers of the Keep blocked the moon, but it was there, spilling light on the snow-strewn clearing around the Keep. Beyond it, black woods rose.</p><p>The balcony stretched before us, covered with untouched, white snow. Before this was over, we'd paint it red.</p><p>\"How do you fancy doing it?\" Mahon asked.</p><p>\"Not like this and your half form sucks,\" I told him. \"I want you at your best. You better bear out.\"</p><p>\"In that case, you better come at me in your warrior form. It will give you a better chance.\"</p><p>\"No need,\" I answered.</p><p>He laid his hand on my shoulder and said quietly, \"My son, if you hesitate or hold back, I will break you.\"</p><p>You will try. \"No more talk.\"</p><p>I let go. Heat flooded me. There was a tremendous warmth. It was like being stretched on a rack while being set on fire. And then everything pulled: bones, tendons, muscles, skin stretched tight. The hazy veil I didn't notice fell away and suddenly the world was painfully clear. I smelled it all, the wind from the icy sky, the hint of smoke from the Keep's kitchen, the dry stone, the clean snow, and the fur of a huge bear waiting to break my back.</p><p>Bear. Familiar scent. Safe. The same scent I smelled years ago, when I had no place to go and Mahon told me I had a home. He was huge then, big and rough, taller than me by almost a foot. \"You can stay here, boy. We'll treat you like our own. You don't have to call me Dad. Just Mahon will do.\"</p><p>Across the balcony, the Kodiak shook his head. He was huge, nearly twelve feet tall, and he weighed almost a ton.</p><p>Going toe to toe with him was out of the question. I shook, testing the shift. Everything had fallen into place. I wasn't at full power, but that was fine. I was too pissed to take a rain check on this fight.</p><p>The shaggy giant beast reared up onto his hind legs and roared at me. That's right show me that big soft belly. I opened my mouth and roared back, drowning him out. Bring it, fat boy.</p><p>My best bet would be to bleed him. Dart in, bite or claw, then out again before those big paws can connect. Don't let him grab or hold me. If he could, Mahon would pull me into a hug and crush my head between his jaws. And if I was really lucky, he'd come at me just like this, on hind legs, gut out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I dug the snow, testing the ground. My paw found ice sheathing the stones. Slick.</p><p>Come on, Bear. Come at me.</p><p>He dropped to all fours and shuffled toward me with his head lowered. Damn it.</p> <p>If I let him, he would try to muscle me to the ground. I'd killed a bear before, and it was the hardest fight of my life.</p><p>Mahon kept moving, head down, shifting in, rocking from side to side. The bear shamble. It looked clumsy, but it let him use the thick layer of fur and fat that sheathed his forward quarters like a shield. And a flank attack wouldn't go unpunished. Shambling or not, he was fast.</p><p>We never fought, not like this, but I had been watching him kill for the last fifteen years, and I knew that he would use that big head like a sledgehammer. Getting head-butted by a bear was like being kicked by a horse. He'd knock me down and then put all of that weight on me.</p><p>It was time to dance. I let him get within five feet of me. Mahon lunged. I dodged to the side and buried my claws in his head and neck. Mostly what I got was fur and fat, but it hurt him. The Bear shook, trying to fling me off. I hung on and took a big bite out of his ear. The familiar taste of blood flooded my mouth.</p><p>Mahon bellowed in pain.</p> <p>Yeah, that's gonna leave a mark.</p><p>Suddenly my paws left the ground, and then we were moving. He drove me back, like hammer drives a nail. God, he was fucking strong.</p><p>There was nothing I could do about it, except to let go. I released my hold. Too late. The wall slammed my back and the full bulk of the Bear smashed into me.</p><p>Ouch.</p><p>\"</p><p>The wall shook. On the other side of that wall Curran was getting a beat-down and he'd locked me out and left the boy wonder in position by the door to make sure it stayed shut.</p> <p>The room was full of shapeshifters. The alphas, the betas, anyone with any sort of rank had shouldered their way in.</p><p>Jim loomed over Derek. The boy wonder had grown, but Jim still had about three inches of height on him and he squeezed everything he could out of them. \"Move.\"</p><p>Derek didn't answer.</p><p>\"It's an Order.\"</p><p>Derek stared straight ahead. The message was clear. Jim would have to kill him before he let that door open.</p><p>This was pointless. I pushed my way out of the room into the hallway. Barabas emerged from the room behind me. I dragged myself down the hallway, away from the crowd. My leg was on fire. For once I wished that I had brought the stupid cane, so I could move faster. We turned the corner.</p><p>\"Is there another point from where I can get to the balcony?\" I whispered.</p><p>\"Get, no. See, yes.\"</p> <p>\"Take me there.\"</p><p>\"There are stairs,\" Barabas warned.</p><p>\"Take me there or I will throw you out of the window.\"</p><p>\"Right this way, Alpha.\"</p><p>I bit the bridge of Mahon's nose. Welcome to the lion's jaws.</p><p>He snarled in pain and dropped back.</p><p>I fell into the snow, rolled back up, and ran, putting some distance between us. My ribs ached. Heat flowed, knitting the fractured bones together. No major damage, but one more like this and I was done.</p><p>I had to bleed him. In and out. If I sliced his skull enough, the Lyc-V would repair the damage, but not before Mahon would bleed. Enough blood in his eyes, and he'd be a lot easier to handle.</p><p>The bear shambled over. I dashed in, claws ready.</p><p>Fifty million fucking stairs, each step shooting a burst of pain into my hip, until I wanted to claw my leg bloody just to get at the source of it.</p><p>Come on, Kate, push. Push.</p><p>\"Sorry about this,\" Barabas said.</p><p>\"Sorry about what?\"</p><p>He picked me up and dashed up the stairs. Two seconds and we burst out of a small iron door onto the tiny stone balcony. We were in one of the side towers, at a ninety-degree angle to the main keep. Two floors below us, an enormous bear and my lion squared of on the bloody snow.</p><p>Oh Curran. You stupid, stupid man.</p><p>Barabas lowered me to the floor.</p><p>Mahon was breathing hard. His shaggy flanks rose up and down, expelling clouds of most vapor through his nose. Blood drenched his sides. Curran limped slightly, favoring his left hind leg.</p><p>Curran lunged, a blur. I held my breath. He danced close, sliced at Mahon's face, and withdrew, avoiding a swipe of the colossal bear paw by a hair.</p><p>Curran was trying to bleed Mahon out, but the Lyc-V was healing him faster than he could hurt him. Sooner or later Mahon would catch him. And an hour ago Curran had been unconscious on his bed.</p><p>\"Get me down to that balcony,\" I ground out.</p><p>\"I can't,\" Barabas said. \"It's too far.\"</p><p>I couldn't jump the distance, not with my leg. \"Throw me.\"</p><p>\"There are fifty yards between us and them, not to mention the thirty-foot drop,\" Barabas said. \"Your dead body would land between an enraged bear and a blood-mad lion. It's my duty to assist you in any way I can, but suicide isn't on the menu.\"</p><p>My knee gave out. I sagged onto the stone rail and watched Curran fight. It was all I could do.</p><p>He was going to catch me. My side hurt like hell and my vision was a little blurry. Mahon had swatted my head with his paw twice. It felt like being hit by a car. I couldn't take any more big shots to the head. I had to take him down and end this.</p><p>Mahon swiped at me. I snapped at him and backed away.</p><p>I had to goad him to go into a bear rage. If he rose on his hind legs, I had a chance.</p><p>I smelled Kate. She was here. Somehow she was here. If I took my eyes off Mahon, he'd clobber me. Why couldn't she just do what she was told one damn time, just one damn time?</p><p>Mahon charged.</p><p>I dodged left, straight into the wall. He thought he had me and closed in: huge, fast, unstoppable. I bounced off the wall, flipped, and landed on top of him. Hello, old man. My claws pierced his hide and I sliced through his fur with all four sets of claws, peeling it off him from the head to his big shaggy ass.</p><p>Mahon bellowed in pain.</p><p>I leaped free and bit his nose. The bear paw caught my side. I took the hit- it hurt like hell- and swatted at his nose, cutting it. One, two, three. Again. Again.</p><p>He charged me again, his head lowered. I veered right, closed my jaws on his injured ear and bit the rest of it off. The Bear roared, in pain and fury.</p><p>I spat the ear out and knocked it toward him with my paw. No, you can keep it. Doesn't taste that great.</p><p>The massive Kodiak bellowed like a foghorn and stood up.</p><p>Yep, that did it, now he was good and pissed.</p><p>With an earth-shattering roar he lumbered toward me, all bear, no human thought or strategy now, motivated by pure rage and pain. It would be his undoing or mine.</p><p>Mahon rose on his hind legs. Curran limped away. His side was bleeding-a bad sign. The Lyc-V wasn't keeping up with the repairs.</p><p>Mahon kept moving. Curran backed to the edge of the balcony. No place to go.</p><p>If I lost him here, to this idiotic fight, after I fought and guarded him for two weeks, after I cried and thought he was dying, I would find him in the afterlife and I would murder him again.</p><p>Mahon swung, too wide. Curran ducked under the huge claws, shockingly fast, and dug his own claws into the bear's left hind leg and bit down hard.</p><p>I knew how much pressure those jaws could unleash. He bit through the fur and the muscle, and then Mahon's leg folded like a broken toothpick, as the huge feline fangs crushed his bones.</p><p>Curran twisted and kicked out with his back legs, a move no lion could ever think of without a human brain driving it. His battered body swung and his back crashed into Mahon's uninjured leg. For half a second, the bear remained upright by sheer force of will, and then he crashed, falling backward, like a giant with his legs cut.</p><p>Oh my god.</p><p>Curran rolled out of the way before the enormous bulk could crush him. As he lay on his back, Curran placed his front paws and weight on his chest. The massive leonine head dipped down. Curran opened his mouth. His jaws closed on Mahon's neck and held it, easy, almost gently.</p><p>A huge brown paw rose and fell.</p><p>It was over. Curran won.</p><p>I lay in the snow, exhausted. My body flowed into the familiar human form. Everything hurt. My body felt too hot, like I was burning from inside out.</p><p>\"Good fight, boy,\" Mahon boomed from somewhere to the right. \"I'm proud of you.\"</p><p>\"Shut up.\"</p><p>The snow was melting around me. The icy liquid felt good on my skin. Well, that's downright pleasant. I could lay here for a while, as long as I didn't have to move.</p><p>\"Still think she is worth it?\" Mahon asked quietly.</p><p>\"Of course. She is my mate.\"</p><p>Mahon sighed. \"So you decided then.\"</p><p>\"Do you think we'd be laying here bleeding in the snow if I wasn't sure?\"</p><p>\"Good point.\"</p><p>I picked up a handful of snow and put it on my face. Mmmm... That's nice.</p><p>\"I hoped she would be one of us,\" Mahon said.</p><p>\"Well, you can't always get what you hope for. I hoped my own people wouldn't try to murder my mate while I lay dying.\"</p><p>\"It never came to that,\" Mahon said. \"She is stronger than any of us knew.\"</p><p>\"I knew.\"</p><p>\"I figured.\" Mahon sighed again. \"She will never understand us completely.\"</p><p>\"It's not always about you. This time it's about me. She understands me and that's enough.\"</p><p>Some sort of commotion was taking place behind the door.</p><p>\"We're never doing this again,\" Mahon said.</p><p>\"That's up to you. Any time you need me to remind you...\"</p><p>Mahon chuckled. \"I've raised you too well.\"</p><p>The door flew off its hinges and slid across the snow, Derek on it. Well, couldn't say the kid didn't try.</p><p>Martha stormed onto the balcony.</p><p>\"Oh-oh,\" Mahon murmured.</p><p>Mahon's wife stared down at us. Her hands went to her hips. \"Which one of you idiots wants to explain to me what the hell is going on?\"</p><p>With great effort I raised my arm and pointed in Mahon's general direction. \"Him.\"</p><p>Kate appeared in the doorway. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"What did you do to the boy?\" Martha demanded.</p><p>\"What did I do to him? What did he do to me!\"</p><p>Kate knelt by me. I raised my hand and touched her cheek.</p> <p>\"You are an idiot,\" she told me.</p><p>\"I know. Martha already pointed that out.\"</p><p>\"Is it settled?\" Martha demanded. It didn't seem aimed at me so I didn't answer.</p><p>\"Yes,\" Mahon said.</p><p>\"Good. Get up.\"</p> <p>There was some movement and then the two of them shambled off back to the door and the light of the Keep. As they passed us, Mahon dipped his head. \"M'lord. M'lady.\"</p><p>Then they were gone. Derek followed them, carrying the door.</p><p>\"You want to leave?\" Kate asked.</p><p>\"Not yet.\"</p><p>She sat in the snow next to me. I put my arm around her, puling her close. Derek fit the door back in place. We were all alone. Just us, snow, and the stars.</p><p>\"That was a nice move with the jump,\" she said.</p> <p>\"You saw?\"</p><p>\"I saw.\"</p><p>I smiled. \"I kicked his ass.\"</p><p>\"Yes, you did. That snow has to be freezing. You need help getting to your feet, ass-kicker?\"</p><p>\"That's my line.\"</p><p>She laughed quietly. \"I can't carry you, you know.\"</p><p>\"Give me another five minutes. I should be able to walk.\"</p><p>We sat in the snow and watched the stars. Tomorrow I'd have to deal with all of their shit again. But tonight was ours. We earned it.</p> <p>THE END </p> </body></html>"]