["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>July 1997, Genetics Council, Wolf Breed Labs</p><p>Mexico</p><p>Wolfe growled in fury, his teeth bared, his body taut, ready to spring as they pushed the young woman into his cell once again. She carried his scent now, proof that she was his mate. The mark he had given her the day before was still vividly evident on her upper shoulder.</p> <p>“You’ll do as I demand this time, Wolfe, or Hope will take the beating instead of you,” Delia Bainesmith told him coldly.</p><p>“She’s your daughter,” he howled out in fury. “How can you do this to her?”</p><p>“She is a lab rat, no more, no less than are you,” she informed him smugly. “Now breed her. She’s ovulating, and we’ve made certain she’s ready. Fuck her, my little wolf, or she’ll be the one who pays.”</p><p>The Bitch walked away, her laughter echoed behind her as Hope whimpered in sexual distress. They had given her an aphrodisiac, ensuring she would accept him.</p><p>“Please, Wolfe.” Her slender body shook with tremors of arousal. “It hurts.”</p> <p>“I can’t, Hope.” He couldn’t look at her. “I won’t.”</p><p>She was just a child, barely seventeen. He wouldn’t scar her, either physically or emotionally with what he knew was coming.</p><p>“She’ll beat me,” she whispered.</p><p>“She won’t get the chance.” He knew that.</p><p>“She said you mated with me. How did you mate with me, without taking me?”</p><p>He could almost hear the tears whispering over her pale cheeks.</p> <p>“I marked you, Hope.” He couldn’t stop his eyes from going to the proof of his ownership. “No other will touch you. No other will have you. That mark and the scent it places on you is mine alone. Don’t make the mistake of ever allowing another man in your bed. Because I’ll kill him.”</p><p>Cold, hard rage shuddered through him at the thought. He had killed one soldier already over her. The one who had dared to fondle her breasts as they tore her clothes from her the day before.</p><p>“I’m sorry she did this. It’s my fault, for loving you.” As always, she would try to take the blame on her slender shoulders.</p><p>“No, Hope, it is my fault,” he told her bleakly. “Mine for ever desiring to try to hope for more.”</p><p>Explosions ripped through the compound. Gunfire exploded around the small house Hope was locked into; the smell of burning buildings, the sounds of horrified screams echoed in her head.</p><p>“Wolfe!” She screamed his name out. Huddled in the bedroom on the opposite end of the house, terrified it would go up in flames at any minute, she prayed he would find her.</p><p>The ground rocked, plaster showered from the roof as she pressed herself closer to the huge dresser that she prayed would deflect the ceiling should it fall. She screamed out Wolfe’s name again. He would come for her soon.</p><p>The sound of the front door slamming had her on her feet, racing for the doorway. Her abrupt halt just inside the living room had her rocking on her heels. Her mother stood there, furious, shaking, her normally austere composure crumpled.</p> <p>“Wolfe,” Hope couldn’t stop her cry, her unasked question.</p><p>“The son of a bitch is dead. They all are,” she sneered. “They hit the Labs first, and it’s an inferno. Forget it, Hope, save yourself now. Don’t worry about that mongrel excuse for a man.”</p><p>Hope slid to the floor, the wall supporting her body, her mind unable to accept, unable to process the meaning of her mother’s words.</p><p>“He’ll come for me,” she whispered.</p><p>Cruelty echoed in Delia Bainesmith’s demented laughter.</p><p>“Wishful thinking, daughter. That bastard will never cum again. Too bad. You might have enjoyed it.”</p><p>CHAPTER ONE</p><p>Six Years Later, July 2002</p><p>Albuquerque, New Mexico</p><p>Hope Bainesmith knew when she received the phone call from her mother that it wasn’t going to be a good day. The woman hadn’t bothered to call her for years, had taken no interest in her life other than the monthly medical tests Hope was required to take. So the phone call that morning had caused her no small amount of concern.</p><p>“Have you seen Wolfe?” Hope’s knees had weakened at the question. She collapsed into the kitchen chair, stilling the pain that raged in her chest.</p><p>Wolfe. Her hand touched the mark at her upper shoulder. Her body throbbed in remembrance. It was that mark that made the monthly tests necessary. An odd quirk of nature, given to a man that was created by science. The small bite had allowed a minute amount of an unknown hormone into her blood. It marked her pheromones and acted as a very mild aphrodisiac. She had been in arousal hell ever since. Hence the reason for monthly medicals.</p><p>“Wolfe’s dead, mother. Remember?” She reminded the creature who spawned her. “How could I see him?”</p><p>There was silence over the line. Hope knew her voice reflected the grief she still lived with on a daily basis. It had been nearly six years but she could still remember with brutal clarity the attack on the Labs, the engulfing blaze and the horrendous screams from those trapped inside.</p><p>“We never recovered a body,” Dr. Bainesmith reminded her, her cultured voice cool and autocratic.</p><p>Hope could just see her petite, pretty mother, her black eyes as cold as ice, her Asian features a cool mask of studied indifference. Nothing mattered but the project at hand, and nothing else would matter. But Wolfe wasn’t a project anymore, she wanted to scream, and neither was she.</p><p>“There were a lot of bodies you didn’t recover,” Hope pointed out painfully. “Wolfe’s dead, let him rest in peace now.”</p><p>She hung up the phone carefully, fighting the tears that filled her eyes. The instinctive longing welled inside her at the oddest times. Wolfe was dead. No amount of grieving could bring him back. There was no justice to be found—no matter what she did—in his death.</p><p>Her mother refused to accept it. Wolfe was her creation; she considered him and his Pack her property. He had defeated her with his death, and Hope knew the other woman could not accept that she would no longer command the army she had envisioned. A pack of savage, intelligent soldiers with the instincts and intelligence of an animal.</p><p>The world was still in shock, even now, years after the broadcast of the first Breeds, felines in that case, announcing their lives. Those men and women, created by science, had been genetically altered with the DNA of savage cats. They had been created to kill. “Disposable soldiers,” one announcer had reported. The Breeds they were called, for want of a better name. It was during the broadcast of that announcement that the labs in Mexico had been raided by Mexican and American agents. It had been a brutal, bloody battle, one that would have done any drug lord proud. But it wasn’t drugs they sought; it was the human experimentations and the scientists and soldiers who made their lives hell that the agents wanted.</p><p>Hope shuddered at the memories of screams, the erupting flames and gunfire echoing around the house she hid in. She had screamed Wolfe’s name over and over during those hours. Certain he would have escaped. But had he escaped, he would surely have come for her. He had claimed her, swore she belonged to him. He wouldn’t have left her there to die.</p><p>Sighing deeply, she collected her jacket and backpack and headed for class. Her day was full, her life was heading somewhere for a change. She couldn’t allow the memories to destroy all she had gained in the past years.</p><p>Exiting her small apartment, she noticed the white cleaner’s van in the parking lot, but paid it little heed. She noticed the large men moving about outside its opened doors, but the sight was a common one. What she wasn’t expecting was the hard grip one of them took of her arm as she passed. For a brief second surprise flared in Hope’s chest as one of the tall men stepped before her, a growl emitting from his lips, his gray eyes swirling with anger. She gasped, then blinked as something stung her arm.</p><p>“Wolfe,” she whispered his name in desperation as she felt the shocking, abrupt departure of consciousness.</p><p>CHAPTER TWO</p><p>Hope awoke disoriented, groggy. She blinked up at the ceiling and stared at the heavy beams that crossed it. This wasn’t her bedroom. She looked around, taking careful stock of the large room. The heavy logs that made up the walls told her she was in a cabin. The scent of a fire burning, the low hum of voices assured her she wasn’t alone. She shifted against the mattress, intending to rise from the bed and demand a heated explanation. Fury flared in her as she tried to move but couldn’t.</p><p>Her legs and arms were tied to the four corners of the bed like a damned virginal sacrifice. She was still dressed, but only barely. Her shirt had been unbuttoned to the waist, her jeans unsnapped, the zipper lowered. Her body hummed with arousal, ached in ways it hadn’t for years. Wolfe. Only his touch, only the stroke of his tongue, the caress of his lips could put her into such burning arousal.</p><p>He had touched her. She stifled a sob, closing her eyes as she let the knowledge soak into her brain. He was alive, and he had dared to touch her while she was unconscious. Her eyes flew open again. The tips of her breasts were so sensitive she could swear that just breathing irritated them. Her abdomen was heated, a spot on her hip sang with sensation. Her blood pulsed through her veins, a rapid tattoo of lust had her shifting against her bonds, trying to clench her thighs to relieve the ache that centered in her very womb.</p><p>He had touched her with his mouth, tasted her. She almost whimpered. She held the sound back though, knowing well his exceptional hearing. He would know she was awake, and he would come to her. Tears stung her eyes. He was alive, all these years he had been alive and he had never come to her. Had not contacted her. He had left her suffering. Her lips thinned, her eyes narrowed. Damn him, he knew what he had done to her the night her mother had locked her in his cell. He knew he had marked her as his mate, ensuring that no other male, normal or Wolf Breed, would take her with her cooperation.</p><p>She still carried the scar of that mark on her shoulder. A sharp bite, then gentle strokes of the tongue that infected the area with a hormone so potent that it took very little, and no time at all for it to make its way to the bloodstream.</p><p>She had been in misery that night, so hot, needing him so desperately that she had pleaded with him for hours. But that one touch, that one caress was all he allowed her, and he had been furious with himself, and with her, when he realized what he had done.</p><p>Of course, the Bitch had been overjoyed, certain that it would be only a matter of time before Wolfe proved her theory that the Breed’s DNA would in fact find a way to procreate. Their females were barren. There was enough evidence to support the theory that the mutated sperm the males carried would change once again to ensure breeding. Her daughter had been chosen as the first lab rat for the procedure.</p><p>Hope had never cared much for the cold, sarcastic woman that she knew as her mother. But when she had learned the calculated plan to use her so coldly, she had begun to hate her.</p><p>“I see you’re awake.” Her eyes flew open as his cool, dark voice greeted her from the open doorway.</p><p>He was older, but still so handsome he took her breath away. His hair was black, cut shorter in the front and tapering down below his neck, brushing his shoulders. He wore a blue cotton shirt tucked into jeans and a wide belt cinched at his hips. Below, the fabric bulged with the pressure of his erection.</p><p>Hope swallowed with no small amount of difficulty. He was more intimidating than ever before. But he was alive. So alive he took her breath with his presence.</p><p>“You tied me up. You touched me while I was unconscious,” she accused him, suddenly furious he had allowed her to be tormented for six long years. “You’re no better than the bastards who created you, Wolfe.”</p><p>The words, born of hurt and fury could not be taken back, and she had no desire to do so. How dare he leave her hurting, aching all these years? How dare he kidnap her and frighten her, rather than coming to her as he should have? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She watched in shock though, as complete fury filled the thundercloud color of his eyes.</p><p>“And you, my sweet sacrifice, are no better than the bitch that bore you,” he sneered. “Do you think I wanted to be re-captured, forced to breed and see my children raised as I was? Did you honestly believe the plan the two of you hatched would come to fruition?”</p><p>Hope stared up at him in confusion. How could he believe she would plan anything with her mother when she hadn’t even known he was alive?</p> <p>“What plan?” she bit out. “I made no plan with her.”</p><p>His lips twisted in a sneer as he entered the room, closing the door behind him. God, she was burning alive for him. She could barely think for the need to touch him, to be touched by him, now that he was close to her. His very presence caused sharp pangs of lust to ripple through her pussy.</p><p>“You won’t lie to me for long, Hope,” he told her softly, his gray eyes going over her body as they darkened with lust. “I promise, before this night ends you’ll beg to tell me the truth.”</p><p>The sensual promise in his voice made her breath catch. His hands went to his belt, releasing the catch with slow, measured movements. Her eyes widened as he began to pull it from the loops. She began to wonder if he had something in mind for her rather than the fucking she needed so desperately.</p><p>“You wouldn’t dare beat me,” she finally gasped.</p> <p>He dropped the belt to the floor, smiling in amusement as his fingers then went to the buttons on his shirt. Hope trembled. She could feel her cunt heating further, the muscles of her vagina clenching in preparation. Her heart sped up, beating a harsh, driving pulse against her breast.</p><p>“I may spank you, but I promise not to beat you,” he said, his rough voice silky, brooding. “But you can halt any punishment at all, Hope, by telling me the truth. Tell me how she knew of the mating frenzy, and how she knew you would be the one I would choose as my mate. Tell me why you allowed another man to touch you, allowed her to taunt me with the proof of it.”</p><p>“Are you crazy?” she practically yelled at him. “How the hell am I supposed to let another man touch me when all I do is puke if they try?”</p><p>That infuriated her more than anything else. The few times she had tried to date, tried to get over him, it had turned into a disaster within an hour.</p><p>“So innocent and outraged.” His smile sent a shiver up her spine, but did little to alleviate the need in her cunt. “One last chance, tell me how that bitch mother of yours knew we had not perished in that fire?”</p><p>Her need for him was making her crazy. If he didn’t fuck her soon, she would be a screaming idiot. She had waited long enough—six torturous years dreaming of him, aching for him.</p> <p>Hope blinked up at him. He was shrugging out of the shirt, his broad, muscular chest gleaming in the dim light of the bedroom. His muscles rippled, tightened. His face was tense as his fingers fell to the snap of his jeans.</p><p>“I don’t know,” she whispered.</p><p>She couldn’t take her eyes off his movements. He would shed his jeans next, revealing the extent of his arousal. She remembered well how thick and long it was, a temptation, even to the teenager she had been so long ago.</p><p>The scientists had kept them naked. She remembered watching Wolfe move about the compound, unashamed of his nakedness, even during arousal. So tall and broad, he moved with an innate grace that had drawn her attention time and again.</p><p>His hands hooked into the waist of the material as he kicked his feet free of whatever shoes he was wearing. Within seconds, he was gloriously naked. His cock rose to his abdomen, tight, hard, thick and engorged. The bulbous head was purplish, flaring just a bit thicker than the shaft, and throbbing with arousal.</p><p>“Oh, God,” she whispered breathlessly.</p><p>He moved to the bed, kneeling beside her, staring down at her with a cold, hard expression. He meant to be a bastard, she knew, but she could see the heat licking in the dark shadows of his eyes. He wasn’t unaffected, and the engorged cock wasn’t his only reaction to her. She was his mate, and whatever he did, she knew he wouldn’t hurt her. At least, not physically.</p><p>CHAPTER THREE</p> <p>For a moment, his expression softened.</p><p>“Do you know how long I have waited to touch you as I want to?” he growled, his voice harsh as his hands went to her shirt to finish unbuttoning it. “Do you have any idea how hard it was to maintain my control before, and not take the innocence of the child you were?”</p><p>Hope felt herself trembling, her flesh sensitizing as she felt the heat of his hands, the hard promise of his body.</p><p>“I offered,” she whispered. No, she hadn’t, she had begged. She had cried and pleaded with him to take her after he left that mark on her upper shoulder.</p><p>“And so you did,” he agreed, his voice lethal, his eyes swirling with anger as he stared down at her. “I wanted only to protect you, Hope. How did you repay the sacrifice I made to ensure that protection?”</p><p>His hand circled her neck. He applied no pressure, but she knew he wanted her to know that the threat was there. All she could feel was the fire of longing, though. It zipped through her veins, bubbled in her cunt.</p><p>“What did I do?” She shook her head, seeing rage in his eyes, rage and lust and a spark of pain. “I didn’t do anything, Wolfe.”</p><p>She couldn’t understand the rage she glimpsed in him as she denied betraying him. How could she betray him? Even her soul knew she belonged to Wolfe.</p><p>“You betrayed me with another man,” he snarled. “Don’t bother to lie to me, woman. You have lain beneath others. Took them into your body and let them fuck you rather than waiting for me to come to you.”</p><p>Hope felt the blood drain from her face.</p><p>“That’s not true,” she gasped, horrified. How could he believe such a thing? “I swear it’s not, Wolfe. I’ve never been with another man.”</p><p>He shook his head with a sharp negative movement. His lips twisted with bitterness, with bleak fury.</p><p>“You would think I could still smell the betrayal on your body, the scent of another’s seed. I am so captivated by your beauty, by my own need, I can’t even smell the traitorous scent.” He seemed angrier with himself now, as though his senses refused to see what was there, merely because he did not want to believe it.</p><p>“Because there is none,” she bit out, furious. “What do you have to do, rape me to figure it out? Damn you, I’m still a virgin. It wouldn’t take a rocket scientist to figure it out.”</p><p>She knew well his possessive instincts. After his refusal to take her, her mother had taunted him outside the cell. Two of the Lab’s soldiers had held her, fondling her as Wolfe was forced to watch.</p><p>Wolfe had sat in the cell; cold, hard, the shifting colors in his eyes dangerously alive. Her mother had finally relented and had Hope released. After Hope was thrown back in the cell with him once again, she stalked away from them.</p><p>Wolfe had held her, comforted her, but still refused to take her. The next time he was released from the cell, the two soldiers who touched her had died.</p><p>“You are no longer a virgin, Hope,” he finally said heavily, his expression filled with disgust. “How do you even hope to convince me of such a lie?”</p><p>His gray eyes glittered with anger. He stared down at her as though she had just informed him that he had mistaken her for someone else. She shook her head, anger building inside her.</p><p>“How can you say that? Do you think that just because you forgot so easily about me, that I could do the same thing? Too bad I couldn’t mark you as well. Maybe then you wouldn’t have forgotten so easily.”</p><p>“And you think you did not?” He growled. “I have the proof of your betrayal, Hope. The pictures the Bitch sent me of you trapped between their bodies, your face twisted with pleasure.”</p><p>The possessive rage was thick, dangerous. His body was tight with it, his eyes glowing in fury.</p><p>“Pictures can be faked,” she threw back at him furiously. “I am still a virgin, the proof is there—”</p><p>“And do you think I did not check that first thing?” he asked her coldly. “Do you think I am such a fool I would not know if the obstruction was there or not? I have checked, Hope, and there is none. You can stop lying this moment.”</p><p>Hope stilled. She stared up at him, uncomprehending. His rage was a tangible thing, and yet so was his pain.</p><p>“What do you mean?” she whispered in confusion. “It’s there.”</p><p>He shook his head, a snarl of fury on his lips, though his voice stayed level this time.</p><p>“Why do you think your pants are open? Why do you think the demand of your body is so much worse than before? I checked. I slid my finger easily inside you, Hope, deep inside. Your sweet pussy gripped me tighter than a glove, but there was no obstruction. You are no virgin. Did you not think I would check to be certain? Do you think I would not give my mate the benefit of a doubt where that bitch’s claims are concerned? I beg you to cease your lies. Tell me what I want to know, now.”</p><p>And Wolfe wouldn’t lie. Of course, he would have checked first. He never made claims he wasn’t certain of. He was coldly logical, always in control of himself and his facts. It had been one of the things that drove her mother insane at the Labs. How easily he could show her for the vicious, incompetent monster she was. She had lost nearly all support for her control of the Labs within the Genetic Council that backed it, before the raid had taken it apart.</p><p>“You made a mistake.” There was no other explanation, though she feared there was.</p><p>She felt tears gather behind her eyes. She wouldn’t shed them, not now where he could see and would ridicule them. Pain bloomed in her heart, in her soul. She knew as sure as she lived that if what Wolfe said was true, then her mother had somehow arranged the hymen to be broken during her last visit to the doctor. She remembered being more tender than usual, more uncomfortable during the physical exam than she normally was.</p><p>Her scream of denial was a silent one. She stilled, fighting to breathe, to get through the pain one second at a time. That was all she could do.</p><p>“There is no mistake.” He punctuated his words by ripping the shirt from her arms then tossing the tattered remains to the floor.</p><p>After the first flinch, Hope merely lay still, staring up at him. He was so coldly furious, enraged at what he saw as her deception. It wouldn’t matter if she had found a way to be with another man, she wouldn’t have done so. Wolfe held her heart and soul.</p><p>Her breath hitched in her throat as he stared down at her now. She wanted so desperately to allow her tears to fall, but she couldn’t. Not yet. Not now. Later, when he no longer watched her, when she could no longer see the cold detachment in his eyes.</p><p>“Did you bring me more clothes?” She kept her voice even, cool. She couldn’t lose control now. She wouldn’t.</p><p>He narrowed his eyes on her.</p><p>“You will need no clothes until you tell me the plans the Bitch has made for me and my Pack and how damaging the information is that she has on our whereabouts,” he told her, his voice hateful, cold and hard.</p><p>Hope swallowed past the knot of betrayal in her throat.</p><p>“I don’t know any of her plans,” she whispered. “I didn’t even know you were alive until you kidnapped me. She hasn’t spoken your name in all these years until she called this morning and asked if I had seen you.”</p><p>“Wrong answer.” He lifted a knife from the bedside table and cut her bra away. “Try again.”</p><p>Hope was silent. She stared up at the ceiling, fighting to breathe through her pain as he cut her jeans and panties from her body next. She had no clothes now, no pride.</p><p>She prayed for detachment, but when his hand cupped her between her legs, two fingers burying into her damp slit, she was unable to stop her needy cry or the arch of her body.</p><p>“Your pussy is so wet, so slick for me,” he growled. “Tell me, sweet Hope, did you get this wet for the men who have fucked you since I marked you as my own?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His voice was rough and angry, but his touch was gentle, arousing. She felt her juices flow over his fingers, her cunt contracting painfully with the need for release.</p><p>“There have been no other men,” she said, fighting to breathe through the intense sensations whipping through her body. “I swear it, Wolfe.”</p><p>His fingers parted the folds of her cunt, then she felt a wailing cry shatter her body as the two fingers slid deep and easily into her vagina. They stretched her, filled her, making her hungry cunt clasp them desperately. But there was no obstruction.</p><p>CHAPTER FOUR</p><p>“Where is your virginity, Hope?” He was lodged deep inside her now, and he had met no resistance. “I will not punish you for the betrayal of your body. I know the games that bitch mother of yours plays. But if you do not tell me how she plans to strike against the Pack, then I will punish you, and I will not stop until you give me what I want.” He pulled back, then thrust inside her firmly once again.</p><p>Hope lost her breath. It was such near bliss. Pleasure arced over her body, through it; lightning heated her skin as she strained toward the building pressure centered at his tormenting fingers.</p><p>“I swear to you, Wolfe. I swear, she hasn’t told me anything,” Hope panted, her head twisting on the pillows, her hips fighting to drive his fingers inside her again.</p><p>“How can I believe you, beloved?” he questioned her gently. “You will not even admit to the loss of your virginity. Lies spill from your lips like honeyed caresses on a heated night.”</p><p>A tear spilled from her eye. She stared resolutely at the ceiling above her, fighting her pleas, but she couldn’t still her body as easily. Her hips jerked as his fingers thrust slowly inside her cunt once again. The biting pleasure/pain from the smooth thrust was like fiery fingers of near ecstasy. Damn him, he knew what he was doing; she could hear it in his controlled breathing, feel it in the tormenting thrusts inside her.</p><p>“I’m not your beloved.” She shook her head, fighting not to beg. “I’m nothing to you.”</p><p>Silence greeted her words. His fingers stilled inside her, then slid free.</p><p>“Why would you say such a thing?” he asked her harshly, angrily.</p><p>Hope glanced at him in surprise. He was frowning down at her, his expression dark, confused at her feelings, as though his actions spoke differently. As though he were loving her rather than punishing her. Not that her body knew the difference right at that moment.</p><p>“How could I believe otherwise,” she whispered. “I’m supposedly your mate, but when those fires swept through the compound, you didn’t come for me. Afterward, you never gave me so much as a sign that you lived. I was nothing to you, Wolfe, until you thought I had something you needed. Until you couldn’t stay away from me any longer.”</p><p>And that hurt most of all. She had spent six years in pain, physical as well as emotional. Her nightmares were those of the months she was with him at the lab. Seeing him beaten, seeing her mother take pleasure in marring his body, ridiculing the honor that was such a part of him. It had infuriated the doctor that he refused to rape the women brought to him for breeding. That he would not perform for her sadistic pleasures. But what enraged her mother more thoroughly was the fact that she couldn’t break him, no matter how hard she tried.</p><p>“Why?” she asked him desperately. “Why didn’t you come for me, Wolfe?”</p><p>He didn’t speak; rather he trailed his moist fingers from her cunt, along her abdomen, then ringed her hardened nipples with the juices from her body. Hope felt her face flush as he watched her. Her nipples were throbbing for attention now. Her clit felt swollen, desperate; she could barely breath she was so aroused.</p><p>“You are all that truly matters to me,” he whispered regretfully, his gaze meeting hers hesitantly. “Since you were seventeen years old, staring up at me with big, innocent blue eyes, you have been my world.”</p><p>Her throat tightened in pain. He sounded so sincere, so deeply honest that she wanted nothing more than to believe in him. And she knew suddenly that it was how he felt as well. He wanted to believe, but the lies her mother had set in motion made that impossible.</p><p>“Then why didn’t you come for me?” she asked, then cried out in such sensual arousal she felt faint as he brought his fingers to his mouth, tasting her juices with a growl of hungry need.</p><p>“Your taste makes me hungry for more, sweet Hope,” he told her, his voice dark, throbbing with sexual intensity.</p><p>“Wolfe, I’ll beg you, if that’s what you want,” she whimpered. “Please don’t do this to me. Fuck me and get it over with, or don’t touch me. Please. I swear to you, you’re making a mistake.”</p> <p>He gripped a nipple between his thumb and forefinger. Hope couldn’t contain the cry of pleasure that swelled in her chest. She arched, shaking, needing to at least tighten her thighs to relieve the pressure in her cunt, but unable to do even that much.</p><p>“All I want is the truth, Hope. Tell me what she plans.” He rolled her nipple between his fingers, his grip a firm little pinch that made her desperate for more. How could she bear it? He would kill her with his touch.</p><p>“I don’t know.” She tossed her head in desperation.</p><p>“Tell me then what you do know,” he whispered. “Tell me the names of the men who have fucked you. Tell me, Hope, so I can find some trust in you, somewhere.”</p><p>She whimpered in agony.</p><p>“How can I give you what doesn’t exist,” she cried out as she felt his fingers tug her hard nipple. “Wolfe, please—”</p><p>He moved closer to her then, kneeling at her breasts, moving the silk enclosed steel of his cock over her hot nipples. Hope groaned, arching into the caress. She was desperate, needing him, willing to go to any lengths to have him. She couldn’t bear the arousal, so hot and deep, clenching at her cunt, making her womb spasm in need.</p><p>He moved back from her, a smile tilting his lips.</p><p>“Can you handle hours of my touch with no release, Hope?” he asked her. “I will not deny myself. I will cum, but you will not. I’ll play with your pretty pussy, suck at your sweet breasts, kiss you until you are dying for the release that only I can bring you. But if you do not give me what I need, then I will be damned if I give you any measure of satisfaction.”</p><p>“No,” Hope wailed out, shaking her head, knowing she couldn’t bear it. “I don’t know, Wolfe. Don’t make me lie to you, please. If you do this to me, I’ll lie to you. I’ll tell you anything you want to hear to make you fuck me.”</p><p>“But, sweetest, I already know the truth.” He bent to her, his lips outlining hers as she stared up at him in surprise.</p><p>Then her eyes closed on a ragged groan as his tongue swept into her mouth. His kiss was just as dark, just as erotic as it had been six years before. His tongue caressed hers, licking at her until she stilled it by suckling at it lightly. His moan was deep, a near growl as she drew on it. She could taste the dark spice that was uniquely his; feel her blood sing with pleasure, her heart rate increase with anticipation.</p><p>His head tilted as the kiss took on a desperate quality. He licked at her lips, nipped at them, drew her tongue into his mouth and sucked at it as he groaned torturously. Hope arched to him, her head lifting, desperate to draw him closer to her, to allow the pleasure of his kiss, his life to sink into her soul, to convince her he was here. At last she was with him. He was furious, outraged and filled with betrayed possessiveness. But he was alive, and her heart sang with the joyous knowledge.</p><p>Then he was pulling away from her, his breathing as harsh as hers, his chest rising and falling laboriously. Hope fought to understand what he was doing. Fought to make sense of why he was doing it as her body throbbed, heated and ached like a virus gone mad.</p><p>“Why are you doing this?” If he knew the answers he wanted, then why torment her in such a way?</p><p>“You betrayed me when you allowed another man entrance into what was mine,” he snarled down at her. “Mine, Hope.”</p><p>She licked the moisture of his kiss from her lips, nearly groaning at the erotic male essence she could literally taste.</p><p>“I didn’t. But even if I had, Wolfe, you let me believe you were dead.” Her breath hitched in her throat as he rose above her, his cock coming nearer to her parted lips. “You have no right to this anger, because I had no idea you were alive.”</p><p>She had never tasted his erection. Had never tasted any man’s. Suddenly she wanted him in her mouth, wanted to suck his cock as she had his tongue, draw on him until he couldn’t help but find his release in her mouth.</p><p>He moved closer, the thick head rubbing over her lips. Hope groaned, opening her mouth for him, feeling him push into the heated depths of her mouth with a slow, measured thrust. She closed her lips on him, hearing the cry that ripped from his chest. His cock throbbed against her tongue as she laved it, her mouth suckling at it firmly.</p><p>He allowed her the freedom to suck at him, to draw the pre-cum from the small slit in his cock before he pulled back from her a second before ejaculation.</p><p>“So shy as you suck me,” he whispered. “You make it hard to believe you have never had another.”</p><p>“There has been no one else,” she cried out. “No one, Wolfe. And you could not object if there had been. Where the hell were you?”</p><p>He shook his head, his black hair flowing over his bare shoulders.</p><p>“You knew I lived. She would have told you I lived,” he bit out. “You would have known I was coming for you when I could safely do so. Yet you conspired to deceive me.”</p><p>He moved back and his lips went to her breast as though he could deny himself no longer, his tongue stroking over her hard nipple enticingly. He groaned roughly, his hand framing the swollen mound.</p><p>“Please,” she whimpered, arching against him. She needed him to take her deep in his mouth. To suck her nipples with hard, hot draws of his lips.</p><p>He drew the small, hard tip into his mouth and began to suck it as she needed. Her groan was torn from her chest. It was so good. She could feel the pleasure traveling in a heated path to her stomach, her cunt. Both clenched in violent reaction to the hot lash of his tongue. Her vagina heated further. She could feel her juices spilling from it, coating the plump lips and soft folds that quivered for attention.</p><p>“When you are ready to tell me, Hope, then do so. Until then, I will play with your body to my heart’s content. And trust me, I will find my release, without allowing you to attain your own.”</p><p>CHAPTER FIVE</p><p>He moved over her body then, his lips going to her other breast, attending to it as he had the first. Hope shuddered, her body convulsed in desperate pleasure. She bucked against him; the fiery sensations assaulting her were more than she could bear. Dear God, she could never handle half an hour of this, let alone the time it would take to convince him she was telling the truth.</p><p>She whimpered as his lips traveled down her abdomen, his body settling between her spread thighs. She was open to him, her legs stretched out nearly as far as they would go, leaving her cunt vulnerable to his touch.</p><p>He licked her first. She lost her breath when his tongue swiped through the generous proof of her arousal. The syrupy juices coated her cunt, matting the tight curls and spilling down to her anus. And he was making a meal of it. He lapped at her pussy; his tongue spreading heated ecstasy as he traveled through the cream-laden slit, sucked at her swollen clit, then plunged his tongue into her vagina.</p><p>Hope screamed. Her hips came as far off the bed as the ropes would allow; desperate, shattered pleas erupted from her throat as her cunt convulsed. But he wouldn’t allow the full climax. His tongue retreated as he uttered a tense chuckle, then moved to her clit. He licked it lightly, stroked it, sucked it into his mouth as she begged brokenly. Small, lightning-tinged explosions rocked her body, but gave her only a small relief.</p><p>She needed to cum. She needed a mind-numbing, screaming, sanity-destroying orgasm before she disintegrated in flames. His tongue was burning her alive; the way he lapped at the juices that ran from her pussy, humming his enjoyment into her clit, stabbing his tongue deep inside her vagina. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Then his fingers were moving to her anus. Her eyes widened as one slid in slowly. She jerked against the ropes, shocked by his whisper of encouragement as he began to move the digit back and forth. Soon, another joined the first, until she felt the muscles behind stretched, fire searing her back entrance, lust rising to a crescendo that had her begging. And still he didn’t stop.</p><p>He moved from her then, walking to the small bedside table as she screamed out her frustration. He lifted a tube of lubricating jelly from the drawer, his eyes heavy lidded, sensuality marking his face as he watched her. When he returned to the bottom of the bed he loosened the ropes at her feet, but the adjustment only allowed for a certain measure of movement. Then he returned to kneel between her thighs.</p><p>His fingers returned to her anus, now liberally coated with the gel. He eased her for long minutes, stretching her, preparing her, making her crazy. Then he lifted her legs until they bent over his arms as he positioned his cock.</p><p>“Did they take you here, Hope?” he whispered as the head of his cock lodged at the entrance to her ass.</p><p>He slid in before she could answer. A slow, measured thrust that had her arching to him, the bite of fire, the lance of pleasure/pain making her tighten against his erection as he slid to the hilt inside her.</p><p>She was stretched. Full. She gasped for breath, adjusting to his thick cock, fighting the licking flames of searing lust that rose to engulf her body.</p><p>“So tight,” he growled, thrusting lightly. “So sweet and hot and tight, Hope.”</p><p>She bucked in his arms, her head twisting against the sheets as her body tightened, pleading for more. Then his fingers were parting her cunt, sliding deep inside her, thrusting in counterpoint of his cock as he began fucking her anus.</p><p>He slid nearly free, slowly, his movements smooth and all the more arousing for it. She clenched at the retreat. The thick head nearly came free of her ass, causing her to gasp in protest. She cried and pleaded as he pushed in deep, his fingers fucking her pussy, his thumb rasping her clit.</p><p>She was close. So close. She breathed in roughly, feeling the waves building, higher, higher—</p><p>“Ah, not yet, love.” His cock slid from her quickly as he moved away from the bed.</p><p>Shock held her frozen for long, agonizing minutes.</p><p>“You bastard!” she screamed out in frustration as he disappeared into the bathroom. “You perverted, rotten son of a bitch.”</p><p>She would kill him, she raged. When she got free she would claw his eyes out, cut his dick off. No, on second thought she would tie him down and torture him just as he had tortured her.</p><p>“Such language,” he called out as she heard water running, then shutting off. “I’ll have to be certain to punish you for this as well.”</p><p>He was grinning when he returned to her, his gray eyes lit with sexual mischief.</p><p>“Come, Hope, tell me what I want to know and you can climax. That’s all you have to do. Just give me the answers I seek.” He spread his hands mockingly before him in invitation.</p><p>“You bastard, I’ll kick your ass when I get loose.” She kicked at him now, but the ropes didn’t allow enough room to actually touch him.</p><p>He chuckled. He lifted her legs once again, then, with his eyes locked to hers, he pushed the hot, rigid length of his cock into her weeping pussy. Hope bucked against the agonizingly slow entrance. He stretched her almost painfully, sinking his full length into her, searing her with a desire so desperate she was afraid it would destroy her.</p><p>“Please,” she whimpered.</p><p>“Tell me,” he demanded. “Give me what I want from you, Hope.”</p><p>He pulled free of her as she screamed out a denial, then sank in with a hard, sure thrust that had her cunt gripping him hard, tightening around him, on the edge of a release so explosive she feared for her sanity. Only to pull back again, his cock slipping from her grasping, aching vagina as he lowered himself on the bed.</p> <p>He stretched out between her thighs again, burying his mouth immediately in her pussy. The stunning pleasure of his tongue lapping at her, thrusting inside her, licking the sensitive walls of her cunt had her screaming out in an agony of desire. His tongue plunged inside her, licking greedily until the tremors began once again. He would move away from her then, question her again. When she had no answers he went to her breasts, sucking them, nipping at them, drawing on the sensitive nipples until she was screaming any answer she could think of. And still it wasn’t what he wanted.</p><p>“Wolfe. God, I swear, Wolfe,” she screamed out what seemed hours later.</p><p>Perspiration soaked her hair, trickled over her neck, between her breasts. Her throat was hoarse, tears soaked her cheeks and sobs trembled through her body. She was one huge impending orgasm. The need was desperate, her stomach cramping so badly he would have to stop, ease her through the pain, only to begin again. And again. She was mindless, unable to make sense of her surroundings, time or anything else but the desperation to climax.</p><p>“Damn you, Hope.” He rose up from her body, his muscles gleaming with sweat, his expression twisted into lines of arousal. “Just tell me who fucked you. Just give me their names. That’s all I ask. Just that.”</p><p>She threw her head back, crying out, wailing at her inability to give him what he wanted. She had already given him names, every male name she could think of, and she still hadn’t given him what he wanted.</p><p>“I swear,” she screamed out desperately. “I swear, Wolfe. I swear. There was no one.”</p><p>Her stomach cramped again, drawing a ragged cry of pain from her throat as he moved quickly to rub the clenched muscle with a broad hand. She breathed harshly through the charley horse-like pain. She couldn’t curl her body into a better position to fight the pain, she couldn’t move any more than the ropes had allowed hours before.</p><p>“Hope.” He smoothed her damp hair back from her forehead, his expression indescribably gentle. “Just one name. I swear I won’t hurt him. Just tell me who.”</p><p>CHAPTER SIX</p><p>Wolfe knew he couldn’t hold out much longer himself. He hadn’t climaxed yet, despite his earlier vow to her that he would. He suffered with her; he ached so desperately it was torture. His cock was a burning brand of need. He didn’t dare push it into her mouth again, nor did he dare to fuck her tight little ass as he had earlier. He was on the edge, and he was terrified of hurting her.</p><p>He couldn’t go any further. He lowered his forehead to hers, watching the tears that ran across her cheeks, wanting to cry with her. He hadn’t wanted to do this to her. Not like this. But her defiance only fueled his determination to make her submit.</p><p>“Enough,” he whispered, his thumb wiping away the tears, only to have more take their place.</p><p>What had happened to him? Why had he pushed her so far, tortured her in such a way with her own body? As he watched her he knew; knew to the bottom of his soul that somehow, Hope too had been betrayed. Not just by the Bitch, but now by him.</p><p>The frenzy of lust, pain and feelings of betrayal had turned him into more than an animal; he had become no better than the mother who had robbed her of her childhood, and gave her as mate to a man who was as much animal as he was human.</p><p>The ‘mating frenzy’ was no easy thing to control, even without the intense possessiveness those pictures had inspired. It had nearly destroyed him at the Labs, clawing at his gut, demanding he take her, make her his, despite her youth, her innocence.</p><p>Adding to it, the soul-destroying evidence of those pictures showing that she had allowed another to touch her had awakened a demon inside him that he never knew existed.</p><p>“I love you,” she whispered, her voice hoarse as she sobbed weakly. “I’ve always loved you, Wolfe. Always. I would not betray you. Please. Please fuck me.”</p><p>He sighed roughly. He had the proof she would do exactly that, and yet, he could do nothing but believe her.</p><p>“If I fuck you now, Hope, I will be but an animal taking you.” He couldn’t do that to her. Couldn’t take the chance that he would hurt her. “I don’t want that. Let me leave you long enough to find my control. To be certain I will not hurt you.”</p><p>Mockery twisted her exhausted expression.</p><p>“What difference does it make,” she whispered, too tired to beg anymore. “Do whatever you want.”</p><p>Wolfe dragged his body painfully away from her. There wasn’t a chance in hell he could tolerate jeans. He jerked a pair of sweat pants from the recessed closet instead and pulled them on. His cock was a monster, straining against the material, howling for release.</p><p>Wearily, he released the ropes that bound her, then watched as she curled into a tight ball. Her back was to him then, her buttocks gleaming gently, the slick, hot entrance to her body open and clearly accessible. He clenched his teeth in agony as he jerked his shirt from the floor and tossed it to her.</p><p>“Put this on. We must talk, Hope.”</p><p>“About what?” She cried out, turning to stare up at him in fury. “Let’s talk about six years of hell. Of fucking grief and pain only to learn it was for nothing. Nothing, Wolfe.”</p><p>He flinched at her words, but drew in a thankful breath when she rose from the bed, her body shaking from both her lust and her anger.</p><p>“Can I take a shower or do I need permission?” She ignored the shirt, standing before him, gloriously naked, furiously aroused.</p><p>“Shower,” he sighed. “I will await you in the other room. We will talk then.”</p><p>Or they would have. She paled dangerously, clutching her stomach and sinking back to the bed.</p><p>“Hope.” He rushed to her, his hand going to her abdomen, feeling the tight bunch of muscles there that he knew would be agonizing. She panted through the pain, clutching at him, staring up at him pleadingly.</p><p>“Oh, God. Please. I’m begging you,” she gasped. “It hurts, Wolfe. The arousal hurts so bad I can’t bear it.”</p><p>She dragged his hand to her weeping pussy, crying out, her body arching as he pushed two fingers roughly inside her. The contraction eased, her cunt tightened.</p><p>He couldn’t wait a fucking hour, but more important, neither could she. He pulled away from her long enough to remove the sweat pants, then unable to control himself, he pushed her to the bed, turning her quickly to her stomach, pulling her hips up to meet his cock as he mounted her.</p><p>“No,” she cried out, clawing at the sheet as he pushed her legs apart. “Please, you promised, Wolfe. You promised, no more teasing.”</p><p>“No more teasing,” he growled. “No more, baby. Here I am.”</p><p>He plunged home with one quick, hard stroke.</p><p>CHAPTER SEVEN</p><p>Hope felt the swift invasion, the parting of flesh that had never known such a thick intrusion, the instinctive tightening of her muscles on the broad, hot cock that plunged inside her. She lost her breath; she lost any control of her body. She tilted her hips to take more, fighting for breath as he began to thrust inside her with smooth, pistoning strokes.</p><p>His erection was like a fiery brand. He fucked her with strong movements of his hips, holding hers with hard hands as he thrust inside her. The pressure, already built to unimagined heights, began to tighten further. She was so close, so close. She was terrified to attempt to give into it. If he pulled away now, she wouldn’t survive it.</p><p>Her cunt was one long tremor after another, the muscles convulsing, preparing for the orgasm rising to rip her apart.</p><p>“It will happen this time, baby,” he swore as she tightened in preparation for him to pull back from her. “No more teasing, Hope. Cum for me baby. Let it go, because I’m going to cum for you.” He thrust harder, deeper. “I’m going to fill your pussy with my seed, Hope. Cum for me, now.”</p><p>She had to trust him. Her body couldn’t stand it again. If he pulled away, she knew her heart would shatter. She felt her muscles begin to tighten, her pussy to throb, convulse. Her body began to tremble in reaction as her orgasm neared. It would kill her, but she would willingly die for it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Then it tore through her. She no longer had the energy to scream, but a low, continuing cry tore from her throat as it began. Energy hummed along her body, from her vagina, her clit, her very womb. It began to wrap around her, exploding her, destroying her. She shook from his hard thrusts, convulsing around his cock as he began to cry out with his own release.</p><p>“Fuck. No. No.” She heard his bitter curse an instant before she felt the change.</p><p>Hope’s eyes widened as she felt his cock harden further, and further. As though midway up that stiff stalk, it was becoming even more engorged. It stretched the tight muscles of her cunt, separating them more fully. And it wasn’t stopping. It kept swelling as Wolfe kept thrusting in shallow strokes, lodging it tighter and tighter inside her until it felt locked in, and the pull and tug began to trigger climax after climax as she felt his sperm begin to erupt from the tip of his cock.</p> <p>Her vagina was on fire. A liquid, melting hotbed of sensations she couldn’t process all at once. She was stretched further than she imagined possible; Wolfe’s cock pulsing, her cunt gripping and tightening as shudder after shudder raced through her.</p><p>Wolfe was crying out behind her now. A sharp burst of heated seed would erupt, then stop. He would tug again, and another would release. Over and over, she lost count of his eruptions, and her climaxes. It continued for long, long minutes, the heat, the hard throb of blood where flesh was locked into flesh, the pump of hot semen until her body collapsed in total exhaustion, tiny orgasms still trembling through her like energized aftershocks.</p><p>Wolfe fell over her, breathing harshly, his body still jerking spasmodically as he attempted every few seconds to pull his cock from the fiery hold she had on it. Instinctively, Hope knew what was happening. It was too bizarre to be true, but she knew it could be no more than the tight swelling that accompanied canine mating. A knot formed along the cock, locking the male inside the female, ensuring that his seed was given chance to take root.</p><p>If she had the strength, she would have laughed. She should have known, as he should have known. The feline breeds had experienced their own animalistic qualities. The barb locked them into their female. She should have known that Wolfe, as intensely male, as dominate as he was, would bring with him his own brand of assurance.</p><p>“We’re locked together, Hope.” He breathed roughly, shocked, his body still shuddering in pleasure.</p> <p>“Hmm, it would appear.” She shivered around the hard protrusion once again.</p><p>“This has never happened before,” he groaned against her shoulder, his tongue licking at the small scar that marked her as his.</p><p>She climaxed again, a soft flare of pleasure as she felt the pressure begin to recede. Then long seconds later she groaned as he pulled free, his engorged dick stimulating her sensitive vagina.</p><p>He fell onto the bed beside her, breathing roughly. His arms dragged her against him, holding her tight to his chest as his lips pressed against her forehead, caressed her cheek, then settled roughly on hers. He kissed her, not as a man starved to possess, but as one desperate for atonement.</p><p>Her lips opened to his, gentling him. Their tongues twined together, then slid apart as he raised his head to stare down at her.</p><p>“I nearly went mad without you,” he whispered, breaking her heart with the pain in his voice and in his eyes. “I knew you were safe the day the Labs were overrun. I set the explosions in the cells and ran with the others. I had to get them to safety, ensure their lives before I could come for you.”</p> <p>She pressed her lips together as she fought her pain and her tears.</p><p>“I thought I had lost you forever.” She touched his lips with trembling fingers. “I merely existed, Wolfe. I would have preferred to fight the fight with you. To have been a part of your freedom. All of it.”</p><p>He shook his head heavily. “I could risk our lives because I had to. Not yours. You were too important to me, Hope. Without you, I had nothing. No prayer, no hope of ever attaining happiness. You are my hope. All of it.”</p><p>A tear slid from her eye, only to be caught by his calloused thumb.</p><p>“You are free now.” He grinned. “Are you still going to kick my ass?”</p><p>Hope breathed out in a weak attempt at laughter.</p><p>“I’m going to kick it really hard as soon as I get my breath,” she assured him. “Next time, I get to tie you up, and let you see how it feels.”</p><p>His eyes flared with a measure of worry. She considered it for long moments, knowing he would do it, for her. She finally shrugged. “Hell, I guess you need your hands free, huh?”</p> <p>“It would make it much easier to love you,” he assured her with dark promise as his hands caressed her back, twined in her long black hair. “And I can love you well, my Hope.”</p><p>“Tell me what happened.” She needed to know why it had taken him so long to come for her.</p><p>Wolfe sighed deeply.</p><p>“When we escaped, it was with no money, no supplies, nothing but our instincts.” He shrugged heavily, grimacing at the thought of those early days. “We barely survived before I was able to arm us and train the males sufficiently to fight. Then we began hiring ourselves out. Kidnappings, search and rescue. A few stints as hired guns in petty wars. Our reputation didn’t take long to grow. We computerized, took only the assignments we were assured were not tricks of your mother’s, and grew more secure.”</p><p>“When did she find you?” She needed to know how long her mother had allowed her to live, grief stricken, in pain without him.</p><p>“Within two years. She made her first attempt to recapture us through a kidnapping she arranged. When that didn’t work, she began sending me pictures of you. Last year I received several, via my Internet connection, of you with several other men. I went insane, Hope.”</p><p>His simple words vibrated with agony and loss.</p><p>“I visit the gynecologist monthly, because of the effects of the ‘mating’,” she told him hesitantly. “Last month, I was sore, hurting afterwards. She must have had him rupture the hymen to ensure your belief in it.”</p><p>Would he believe her? She stared up at his quiet face, seeing none of the disgust, the fury that had been there earlier.</p><p>He shook his head. “I should have known. I should have thought. But all I could think about was another touching you. I have not been stable these last months beloved.” He kissed her lips gently, an apology, an unspoken plea in his eyes that she forgive him. And she could do no less.</p><p>“Well, after such incredible orgasms, I guess I can forgive you,” she whispered with a sensual smile. She was more than ready for another.</p><p>Hope frowned then as his eyes closed with weary resignation, and though he appeared relaxed, she could see his muscles slowly tightening as though his body was preparing for a blow. His arms tightened around her as he took a harsh breath a second before she heard her mother’s sneering voice.</p><p>“So it would appear the animal has made an appearance. You knotted her good, Wolfe. You should be proud. I’ll enjoy training your brats to obey me a bit better than you did though.”</p><p>Terror shot through Hope. She turned to roll from beneath him, to keep him from sheltering her body with his own, but he controlled the movement with a tightening of his arms around her.</p><p>“I love you, Hope,” he whispered a second before he raised his head, staring in cold fury at the woman who had invaded his life once again as she leaned casually against the framed doorway.</p><p>CHAPTER EIGHT</p><p>“Hello, Bitch. Why am I not surprised to see you here?” His voice was filled with disgust at the vision he saw before him.</p><p>Wolfe looked over at the small, diminutive woman who stepped into the room. She was dressed casually in a pullover sweater, twill pants and loafers. The very picture of a successful doctor, if you discounted the lethal pistol in her hand, and the gleam of vicious triumph in her black eyes.</p><p>“I knew the altered pictures of those men fucking her would bring you out,” she chortled gleefully. “Did you really think my frigid daughter would allow one man to touch her, let alone two at a time? Her doctor had to rupture her hymen, she was so damned cold. Really, Wolfe, you two made it frighteningly easy to capture you.”</p><p>He smiled. The trap was sprung, just as he had anticipated. But he was more than thankful to the monster for clearing up the matter of his sole possession of Hope.</p><p>“Yeah, I did, didn’t I? Perhaps you were the easy one though,” he suggested with a smile.</p><p>Delia Bainesmith’s eyes narrowed.</p><p>“You always were a rogue,” she sneered. “Never obeying orders, always attempting to escape. You were mine. My animal, my possession. I created you.”</p><p>Her voice echoed with her fury, her insane belief that he should always be in her control.</p><p>“You created me, but you will never own me,” he promised her lethally. “You forget, Bitch. You used the DNA of a wolf, not the lap puppies you should have. No man or woman controls the wolf.”</p><p>“Then I will control the whelps you’ve bred on my traitorous daughter,” she sneered, raising the gun, her finger tightening on the trigger. “And I’ll kill you.”</p><p>He flipped the switch on the wall behind him before she could react. The gun flew from her hand, clattering over the floor as she was knocked off balance by the falling sandbag and imploding plaster from the ceiling.</p><p>It was the opening he needed. Wolfe jumped from the bed, reaching down for the gun as she flew at him, a dagger in her hand, maniacal hatred contorting her expression. He heard Hope cry his name out in fear, her voice filled with tears, with terror. He flung himself away from the monster, angling one leg out in a quick, arching motion, taking a swipe at her feet as she passed by. A startled cry erupted from her throat as she fell.</p><p>Wolfe jumped to his feet, gripping the gun as he pointed it at her, watching her carefully. It was then he saw the blood oozing slowly from beneath her body. Hope must have seen it as well. He heard her breath catch, glimpsed her pale, horrified face.</p><p>He went to the scientist, once the terror of the labs he had been confined to. He turned her over carefully, grimacing at the sight of the dagger lodged between her breasts.</p><p>“Bastard.” Blood bubbled from her mouth as she stared at him in hatred. “Ruined it. You ruined it all.”</p><p>Wolfe glanced up at Hope. Shock lined her expression, wiping all color from her face. The woman’s gaze followed his. She sneered at the child she had bore.</p><p>“Animal. No better than a dog—” she gasped. Her eyes widened, then dimmed.</p><p>“Wolfe.” The others were rushing through the cabin now, voices raised in fear. “Wolfe dammit, she got by us—”</p><p>They came to a sudden halt inside the bedroom. The three women and three other men, all out of breath, were smeared with blood, but triumphant.</p><p>“Did you get the soldiers?” he asked them quietly as he moved to Hope, drawing the blanket around her silent body as he picked her up from the bed.</p><p>“All of them,” Jacob reported. “We didn’t kill them though.” He nodded to the still form of the scientist.</p><p>“Get her out of here,” he ordered them. “Find a deep, dark hole and bury the bitch in it. She won’t get a chance to hurt anyone else.”</p><p>He carried Hope into the living room, sheltering her body with his as he felt her low sobs against his chest.</p><p>“I won’t grieve for her,” she whispered tearfully. “I did that when I was a child.”</p><p>“It’s okay to grieve, Hope,” he assured her sadly. “Grieve for what never was if you need to. But let it go.”</p><p>He sat down on the couch, cradling her to him.</p><p>“She would have killed you,” she whispered. “She would have killed me as well, eventually.”</p><p>He smoothed her hair back from her face, grieving for her.</p><p>“Can you forgive me for her death? Forgive me for what I put you through? For not trusting you?” He touched her with adoration, with pain, with thanksgiving. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For a moment her expression went blank, then a most curious light of female knowledge lit her eyes.</p><p>Wolfe narrowed his eyes on her.</p><p>“What?” He asked her.</p> <p>“I climaxed,” she whispered.</p><p>He grinned. “Yes, you did. Quite well, too.”</p><p>“No.” She shook her head. “While you thought you were torturing me, those screams of agony were actually orgasms. Not big ones, but enough.”</p><p>He frowned. “That’s not possible. Do not try to salve my conscience, Hope.”</p><p>She laughed. She dared to laugh in his face.</p> <p>“Want to try it again in a few days, so I can prove it?” she offered.</p><p>Heat flared in his body. His cock hardened.</p><p>“Do I get to tie you up again?” he asked her, definitely interested.</p><p>She shrugged. “If you want to.” But he could see the excitement in her eyes.</p><p>Wolfe sighed deeply. “Why do I get the feeling, Hope, that you have effectively turned the tables on me without my knowledge?”</p><p>Her sapphire eyes gleamed up at him.</p> <p>“Maybe because I did. And I won’t grieve over her, Wolfe. I was more terrified for you. I thought for certain she would hurt you. Maybe kill you. I couldn’t live with it, if she had. I would have died with you.”</p><p>He touched his lips to hers as he stared into her eyes.</p><p>“I love you,” he whispered against the tender curves. “Always, Hope. I will always love you.”</p><p>Her eyes drifted close on a drowsy sigh of contentment. He held her tightly to his chest, thanking God every second that she was safe, that the Bitch was dead. Their lives would be safe now, and he needed that for her.</p><p>“Wolfe.” Jacob stood beside him, watching him quietly. “We’re going to take her body back to her soldiers. When they awaken, they can do whatever the hell they want to with her.”</p><p>“Did they find the cabin as well?” He couldn’t risk that knowledge.</p><p>“Hell, they didn’t make it ten feet from the truck. The Bitch wouldn’t have found it if you hadn’t left orders to let her through.”</p><p>Wolfe nodded. He hadn’t meant to kill her, but he knew they were all better off with her death.</p> <p>“We will leave you with your woman then. When should we return?” Amusement lit Jacob’s light blue eyes.</p><p>Wolfe grinned. “Weeks perhaps,” he answered him tiredly. “I have time to make up for, my friend. Several years at least.”</p><p>Hope slept in his arms, unaware of her mother’s body being carted out of the cabin. As the door closed behind Jacob and the others, he sighed deeply. He had his Hope, just as he had always dreamed of, prayed for. His life would now be complete.</p><p>Jacob refused to look back at the couple as he left the cabin. Anger and need rode him hard, arousal was a steady beat of blood in his cock to torment and torture him. But it wasn’t the woman Wolfe held that kept Jacob’s dick in a constant state of readiness. It was the one who awaited him outside.</p><p>As he closed the door behind him, Faith moved from her position at the end of the house, her black eyes watching him warily as he stalked toward her. She was a wolf breed, the slender, compact lines of her body were lightly muscular, her breasts high and firm beneath the black t-shirt she wore with black jeans. Her reddish brown hair was a raggedly cut cap of silk and framed her slender face in a way that gave her a vulnerable, untouchable look.</p><p>“They’re all right?” she asked as he neared her.</p><p>Jacob growled, baring his teeth in warning as she stepped back from him. She was always stepping back, never forward.</p><p>“Were they not, you would have known,” he bit out, furious with her once again.</p><p>“Well, bite me, why don’t you,” she snapped, her brows lowering in a frown. “It was a reasonable question.”</p><p>“From a most unreasonable female,” he accused her harshly. “Return to the cabin and rest. You have not slept in days and I’m tired of the shadows under your eyes.”</p><p>“You rest.” Her body came to attention immediately, anger pulsing through her, scenting the air. “Do I tell you how often to sleep?”</p><p>He turned to her, fighting the need to reach out to her, to drag her to him.</p><p>“Do as I said,” he snapped.</p><p>“Fuck you, Jake, you go to sleep...“</p><p>“Do not worry, the day will come when you will do just that, Faith. Until you can handle it, I suggest you run now, and run fast, or you may learn what it feels like to have your mate mount you without your permission.” Fury snapped in his body. Her continued defiance roused the beast and made it howl.</p><p>He watched her pale. Terror flashed in her eyes a second before she ran. He cursed violently, dragging his hands through his hair as he tamped down the beast that demanded he run her down. He couldn’t. He never could. She was his mate, and yet he would be forever denied her touch. His ravenous, grieving howl echoed through the mountains now, as it echoed through his soul.</p><p>The End </p> </body></html>"]