["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>Because I was the newest cook at the school, they had given me the least desirable shift, the one from midnight until dawn. It was my job to wash any of the pots that had been left to soak after dinner, to sweep up the kitchen, to mix the ingredients for bread and let the dough go through its first rising. Rhesa, the young woman who had held this position before me, had gladly given up these tasks; she now came in with three other women to make the evening meal for the hundred and fifty souls who lived at the school. I could tell she both pitied me for being stuck with the night duties and felt a certain smug satisfaction at finally having someone below her in the staff hierarchy. She was the kind of person who—if she lasted long enough to be named head cook—would treat everyone below her with snobbery and contempt.</p><p>But the truth was, I liked the night hours. I liked the solitude, the quiet, and the autonomy. And I relished the chance to explore.</p><p>The Gabriel School was an odd place, no question about it. It was one of a dozen such institutions established sixty or seventy years ago by the former Archangel and his wife as places for abandoned street children to get an education. While a few of these schools could be found in major cities like Semorrah and Luminaux, ours was located on the very edge of the desert that snugged up against the Caitana Mountains. Not only was it situated between sands to the south, mountains to the west, and ocean to the east, it was served by a single infrequently traveled road. In other words, it offered little chance for anyone who lived there to escape somewhere else.</p> <p>That choice had been deliberate, I assumed, since most of our students had some experience with crime, and many had not come here of their own free will. The theory was that, if they were forced to stay at the Gabriel School long enough to learn a trade, they would eventually become skilled craftspeople who could be gainfully employed, and everyone would benefit.</p><p>The problem was, a small school in an inaccessible location wasn’t an easy place for teachers and cooks and housekeepers to leave, either, if they got tired of the hard work, the cramped accommodations, or the lack of excitement. But I didn’t mind. I didn’t feel trapped. I planned on staying at the Gabriel School for a good long time. For one thing, I was tired of running. For another, I had nowhere else to go.</p><p>By the time I had been at the Gabriel School for a month, I had pretty well established a routine. I would go to bed in the morning and rise early in the afternoon to enjoy a few daylight hours to myself. I joined the cooks in the kitchen just as they finished serving dinner, and I completed the cleaning by myself after they drifted back to their rooms. Then I had a couple hours of freedom before it was time to begin assembling ingredients for the morning bread.</p><p>I spent those hours exploring the school. The first few weeks were chilly enough to keep me indoors, investigating locked storerooms (easy enough to break into), musty closets, and stairwells that led to underground rooms that everyone else had forgotten. I found a hidden cache of fine wine, a strongbox of gold, and historical documents about the school that were more interesting than you would have supposed. More than once I happened upon romantic liaisons between workers or a pair of students, though I was stealthy enough that none of these trysting couples ever realized I was there. I only watched long enough to be sure that no one was unwilling, and then I quietly backed away.</p><p>The fourth week I was there, the weather decidedly improved, and I ventured outside to look around. The Gabriel School owned about ten acres enclosed by a high wrought-iron fence whose narrow metal bars were so rusted through in spots that they would hardly keep an intruder out or a fugitive in. Of the six main buildings, one housed the workers, two housed the students, and two served as classrooms, kitchen, dining hall, library, and other public spaces. The last one was a barn/stable/storage facility where we kept barrels of dried fruit, shelves of canned vegetables, three cows, five horses, and two ancient carts. There were all sorts of interesting cubbyholes and bins and haylofts in the barn, and I planned to investigate them all.</p> <p>But the very first night I spent ghosting around the grounds, it wasn’t the barn that captured my attention. It was the tall, narrow building at the top of a small hill on the other side of the fence. The house where the headmistress lived. By day it appeared drab and dispirited, with lugubrious gray drapes visible in the ground-floor windows, black ones on the second story, and weathered old boards covering up the openings on the attic level. By night—especially a night such as this one, with a full moon intermittently obscured by flat, listless clouds—it had a sort of wild, sinister allure. I found myself standing with my back to the workers’ dorm, my hands wrapped around two of those iron bars, staring up at its eerie silhouette.</p><p>It appeared as if everyone in the place was asleep, for no lights showed on any level. Not that too many people inhabited the Great House, as it was called. The headmistress lived there alone except for a housekeeper and a footman, who rarely mingled with staff at the school. And none of us—not student, not teacher, not cook—was permitted to enter the Great House. If an emergency arose and we needed to summon the headmistress, we would ring a brass bell that hung inside the compound. No such emergency had occurred since I had been on the campus.</p><p>The instant I had been told of the prohibition against entering the Great House, I had been seized with a desire to do just that. I knew that the day would come when the headmistress fell sick or had to travel, when her servants were off on errands that could only be entrusted to them. There would come a day when that odd, offputting, off-limits structure would be safe to roam.</p><p>Not tonight, however. I stood there another few moments, tracing the outlines of the house with my gaze. A last ragged wisp of cloud shredded away from the moon, and the whole house was lit with a faint phosphorescence. I stayed another moment just to admire the interaction of moonlight and shadow, wishing I was a skilled enough artist to capture the slant of the roof, the narrow structure of the building, the pool of darkness against the front door.</p><p>Suddenly, against the moonlight, a shape on the roof lifted and resettled itself.</p><p>Primal terror sent a delicious thrill down my back. I wasn’t afraid, just startled, since I had not realized anything else in the world was awake and roaming. Some night creature must have nested on top of the house. An owl, perhaps, although a large one; I was almost certain I had seen the sweep of feathers. I stood utterly still, straining to peer through the dark. Yes—there it was again—the distinctive serrated edge of a spread wing, appearing just above the roofline and then disappearing again.</p> <p>A very large owl. Perhaps it was a falcon, used to hunting in the dark, or some kind of night bird I wasn’t familiar with. We were near the Caitanas—the god alone knew what kind of creatures might make their homes in the mountains.</p><p>I waited another five minutes, another ten, resisting an inner voice that insisted I must return to the kitchen now or be late starting the bread. But no mysterious midnight predator lifted its wing above the roofline again, waking my admiration and my curiosity.</p><p>I turned to hurry back toward the kitchen, already thinking up a story to explain my tardiness if the dough wasn’t done in time. But a sound behind me spun me around to gape at the Great House, dark and featureless in the cloud-crusted moonlight.</p><p>It was a single note, liquid and pure and anguished, like the most gorgeous, the most despairing foghorn lowing off a storm-racked coast. I would have said it was music, except it was weeping; it was a song with a single tone, and that was agony. The sound went on and on, sustained by a solitary breath, and then it abruptly stopped. The rest of the night had fallen deathly silent, as if no bird, no insect, no furtive mouse could move or speak in the presence of such beauty and remorse. The world had been struck dumb.</p><p>I stood there, mute and motionless, my whole body clenched with waiting. But though I remained silent and still for another thirty minutes, I never heard another sound, never caught another glimpse of that tortured creature. Finally, shivering and uneasy, I made myself turn away and creep through the compound toward the kitchen. I had to confess that I was wishing it was already dawn.</p><p>I have always known how to get information without making anyone wonder why I wanted it. So that evening, when I joined the other workers in the kitchen, I took up a station near the head cook, Deborah. She was a big woman, not especially nice, but talkative; she would gossip about anybody as long as you didn’t ask her a question outright. That mistake would cause her to sniff loudly and accuse you of having a nasty mind. She appreciated hard work, so she was inclined to like me, and I was careful not to cross her in even the smallest way.</p><p>Today I worked beside her, scraping dried gravy off of a platter, and manufacturing noisy yawns until Deborah finally noticed.</p><p>“Jovah’s bones, Moriah, you look like you’re about to fall over!” she exclaimed. “Didn’t you sleep last night?”</p> <p>“Not very well,” I admitted. “I got a scare while I was working down here all alone, and I was so edgy I couldn’t close my eyes.”</p><p>“What scared you?” asked Judith. She was a thin, weary woman in her midthirties who had come to the Gabriel School five years before with a small son in tow. My guess was that Judith had once been an angel-seeker and her son was one of those hundreds of children fathered by an angel but unfortunately mortal. A more unscrupulous woman would have dumped him in the streets of Velora or Cedar Hills—to enter a life of crime and no doubt end up here at the Gabriel School, anyway—but clearly Judith had not been capable of the necessary ruthlessness. We hadn’t had more than an hour of conversation together all told, but she was the person I liked best in the entire compound. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I glanced over my shoulder toward the hallway that led to several doors, one of them guarding the root cellar. “Last night. Three times. That door would creak open as if someone was coming upstairs. I kept going over to push it shut, and it would come open again. Then I kept thinking I could feel someone staring at me, but I’d turn around, and no one was there.” I offered a small shudder. “It just—made me uncomfortable.”</p><p>Judith nodded. “That happened to me a couple of times when I worked in the kitchen overnight. I just learned to ignore it.”</p><p>Rhesa, who was scrubbing spills off the great iron stove, glanced over her shoulder uneasily. “That door never swung open while I worked here alone.”</p> <p>“There’s plenty of places around this school that give me the shivers,” said a heavyset, vacuous man named Elon. He was middle-aged and wholly devoid of personality; I sometimes wondered if he’d arrived as a student when he was sixteen and never had the energy to leave. “I don’t like the barn at night. Or the library.”</p><p>Deborah snorted. “Not one of them is as peculiar as the Great House,” she said.</p><p>I pretended to frown. “Why? What’s wrong with the Great House?”</p><p>Rhesa grimaced at me. “It’s creepy.”</p><p>“Well, it’s old and tumbledown,” I said. “And I know none of us is supposed to go over there.”</p> <p>“And haven’t you ever wondered why?” muttered Elon.</p><p>I shrugged. “I thought Headmistress liked her privacy.”</p><p>Deborah snorted again. “She likes to keep everyone in the school safe,” she corrected. “That place is haunted.”</p><p>I wasn’t the only worker who exclaimed aloud at this. Haunted! You’re saying there are ghosts at the Great House? Who are they?</p><p>Deborah waved a hand for silence and we all fell quiet. “I’ve been here twenty years, and I’ve never set foot in that building,” she said dramatically. “And I heard tales about it from the day I arrived. People would see lights flashing in the upper windows. They’d see shapes moving on the roof. There would be sounds—terrible, groaning sounds—and the noise of glass breaking and voices shouting. But only at night. In the morning, it would all be peaceful again.”</p><p>She glanced around as if to make sure she had everyone’s attention, but we were all rapt. “Of course, you’d think all those disturbances were caused by a ghost, but that’s not what people believed. They said there was a live man there—sick—hurt—maybe mad—cared for by the woman who used to be headmistress, back when I was a girl. A man everyone would recognize, if they could see his face.” She nodded for emphasis.</p> <p>“Who was it?” Rhesa demanded.</p><p>Deborah dropped her voice to a whisper and we all leaned in to hear. “The old Archangel.”</p><p>“Gabriel?” Elon asked.</p><p>Deborah shook her head. “Raphael,” she breathed.</p><p>She met with stares of disbelief. “That can’t be,” Judith said. “Raphael died when Mount Galo came down.”</p><p>“And he was ancient,” Rhesa added.</p><p>Deborah frowned, clearly not liking our skepticism. “Everyone believed he died when the god threw the thunderbolt against the mountain,” she said in a stronger voice. “But he didn’t. He was disfigured and crippled, but he survived. And he was brought here to this remote place to live out his days in obscurity.”</p><p>“But Rhesa’s right,” Judith objected. “He was fifty or more when the mountain was destroyed, wasn’t he? And that was almost seventy years ago. So even if you came here twenty years ago—”</p> <p>I could see her struggling with the math, but I had already done the calculations. Twenty years ago, Raphael would have been roughly a hundred years old. And even if he had survived those legendary events, he would have been mightily bruised and broken. Every schoolchild learned the story of the time Jovah smote Mount Galo and almost destroyed the world. As the god required, all the people of Samaria had gathered in the mountain’s shadow on the Plain of Sharon, prepared to sing the annual Gloria to prove to the god that they were living in harmony. But Raphael had been unwilling to hand over his title of Archangel to Gabriel. He claimed there was no god. He claimed that Jovah would not, as promised, strike the mountain, and then the river, and then the world, if the Gloria was not sung. But when twilight fell, so did the thunderbolts, and the mountain was blown apart. No one had ever seen Raphael or any of his followers again. Not even, I was pretty certain, the former headmistress.</p><p>But it was interesting to contemplate the idea of some angel taking refuge in the upper stories of the Great House. That would explain the shape of wings. That would explain the heart-wrenching snatch of music. Angels pray to Jovah through song—they fly into the heavens and plead for him to send rain or sunshine or medicines or grain, whatever is most needed at the moment. All of them possess voices so beautiful you might weep to hear them.</p><p>So I was prepared to believe I had spotted an angel on the roof of the Great House. It just wasn’t Raphael.</p><p>Deborah was trying to convince the doubters. “Angels live a very long time,” she said firmly. “A hundred years would be nothing to one of them.”</p><p>Judith—who I suspected had more experience with angels than Deborah did—said, “Maybe, but I never heard of any of them living a hundred and twenty years. Even if it was Raphael there at some point, he can’t possibly be there now.”</p><p>“No, but his spirit is,” Deborah snapped, clearly annoyed. “It haunts the place.”</p><p>“Still?” I asked, trying to sound frightened instead of speculative. “That is—do people still hear voices and—and see shapes?”</p><p>“I never have,” Elon said.</p><p>“Me, either,” Rhesa added.</p><p>I glanced at Judith, and she shook her head. Judith was a thoughtful and observant woman. If she hadn’t noticed any spirits lurking around, then there hadn’t been any on the premises for at least five years.</p><p>“Sometimes the spirits lie quiet,” Deborah said. “And sometimes they are stirred up again. You should feel grateful that you live at the Gabriel School during a time when no ghosts are walking. And as long as all of us stay behind the fence, the ghosts should remain quiet, and everything will be fine.”</p><p>Rhesa turned back to the stove, already grumbling. “Well, I don’t mind not poking around the Great House, but I’m awfully tired of staying here all the time,” she said in a voice scarcely better than a whine. “There’s nothing to do. I want to go to Telford or Stockton, or even Breven, just for a day or two.”</p><p>“I wouldn’t mind a trip to Stockton myself,” Judith said. “If I don’t get another pair of shoes pretty soon, I might just as well go barefoot.”</p><p>That quickly turned the conversation from spirits to shopping, but I didn’t mind. I had learned what I needed to know.</p><p>The Great House—isolated, mysterious, and brooding—served as more than just the lodgings for whoever was current headmistress of the Gabriel School. It was a haven for broken angels who needed somewhere to rest and recover. I strongly doubted that a ruined old Raphael had ever lived in its upper stories, but I was willing to bet that, over the past seventy years, an assortment of angelic occupants had taken refuge there.</p><p>And one was living there now.</p><p>I wondered if it was one I knew.</p><p>I would have to be very, very careful.</p><p>For the next three weeks, I was obsessed with watching the Great House, trying to get another glimpse of the angel, while making very sure he did not catch sight of me. I kept up my usual routine, except now instead of using any free hours to explore the rest of the compound, I spent them patrolling the patch of fence that served as a border between the school and the house. We were not quite done with winter, so the weather veered from temperate to frigid and back to mild. Some of the nights were so cold I could only stand to be outside for ten minutes.</p><p>Twice during that period, I saw the angel again.</p><p>The first time was probably a week after our conversation in the kitchen. The half-moon still produced enough light to see by, and the weather was moderate enough to make a midnight stroll bearable. As before, I came to a standstill and wrapped my fingers around the iron bars, though this time I stood in the shadow thrown by one of the school buildings, so that I would be difficult to see. I stared up at the Great House, willing it to spill its secrets.</p><p>And I saw a shape rise up from the rooftop as if conjured by faith and longing. It was an angel, all right—there was no mistaking the silhouette. An angel who stood with his head thrown back and his arms upraised and his wings swept back, in an attitude that could not have more plainly bespoken supplication. He stood that way for five minutes, for ten, and then turned abruptly away with the banked rage of a man who knows his prayers will not be answered. Suddenly he pitched to his knees, tripped up by some obstruction on the roof that he had overlooked in the chancy light.</p><p>Or—no. Tripped up by something he had not noticed because he could not see. I watched as he rose cautiously to a standing position. I saw him stretch his arms out, as if seeking a wall or handhold; I saw him glide his right foot forward, as if testing the surface ahead for other hazards he might have missed. The fall seemed to have disrupted his sense of orientation. He tilted his head, as if listening for the way the evening breeze played around the surfaces of the roof, then felt his way slowly toward a specific point. It must have been a door that led to the interior, because almost instantly he dropped out of sight and did not reappear. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The angel was blind? Oh, as he had proved so often in the past, Jovah had an interesting sense of humor. No need for me to worry that the angel might recognize me. No need for me to fear him at all.</p><p>The thought rekindled my desire to somehow gain access to the Great House, only this time I had a clear goal: I wanted a chance to view the angel from a closer range. I couldn’t even explain why I wanted to do it, except that it gave me a tremendous sense of freedom to think I could stand in the same room with an angel and not be afraid for my life. It equalized things somehow; it gave me back a measure of dignity. The balance of the world would be righted, and I could abandon the past.</p><p>Probably not; but maybe I could gaze at him in silent mockery and simply feel a sense of triumph and relief.</p> <p>The next time I glimpsed the angel, I heard him sing.</p><p>I had been to all three of the angel holds; I had briefly lived in Luminaux, the Blue City that spills over with music and art. Once I had traveled to the Gloria and heard the sacred mass performed by angel choirs. I knew how easy it was to grow drunk on the music angels can make.</p><p>But I had never heard anything to match the sound of that angel’s song.</p><p>This time there was more than that single sustained cry. This time there was a melody of sorts, bitter and drowned and beautiful, and every separate ravished note struck me like a copper blow. It was like being hammered by mournful metal; I felt his music pock my skin and dimple my bones. I felt it run like scattered silver through my veins.</p><p>If there were words, I couldn’t distinguish them. I couldn’t have said if the angel was singing a line from a traditional requiem or improvising a dirge on the spot. All I knew was that the sound made me want to fall to the ground, weeping. Instead, I turned away and blundered through the yard, back toward the school, back toward the kitchen, back to the safety of silence.</p> <p>CHAPTER 2</p><p>Three days later, I found my way into the Great House. Jovah’s hand at work, I almost believed. The god had formed the habit of making my oddest prayers come true. Maybe to make up for the fact that he had once tried to destroy me.</p><p>I had been sleeping when the messenger appeared that morning, but Judith told me he arrived on a wheezing horse and carried exciting news. The headmistress’s daughter was about to be delivered of a baby, and she desperately wanted her mother on hand. The footman had hitched up the two most reliable horses, and within an hour he was driving her down the rutted road, heading toward a tricky mountain pass and west toward Castelana. There were no easy routes to any of the river cities from this side of the Caitanas, so I had to believe they would be gone at least two weeks.</p><p>During that period, there would be only one servant minding the Great House, a middle-aged woman who must surely sleep some of the time. I was not wild about the idea of sneaking through the manor under cover of darkness, to be startled by every creak and groan, but it might be my best option.</p><p>But then good fortune struck. Or disaster, depending on your perspective.</p><p>I had been awake for a couple of hours and was standing outside in the cold air before heading to the kitchen to help clean up the evening meal. I had taken my usual shaded post beside the fence that overlooked the hill leading to the Great House, and I was scanning its porch and windows. So I happened to be watching when the housekeeper stepped through a side door to shake out a rug. I saw her slip in a patch of mud and tumble to the ground, her hands bracing as her feet went flying. I saw her struggle to stand—almost accomplish the feat—and then drop to the ground again, clearly in pain. I watched as she slowly and with great determination inched back toward the stoop, up the three steps, and across the threshold. She was on her bottom the whole time, pulling herself along with her hands and sheer willpower.</p> <p>I paused a moment to admire her fortitude. Then I made my plans.</p><p>It was necessary first to put in an hour in the kitchen, working beside the other cooks until they had all headed off to their beds. It was close to midnight before I slipped outside, let myself out of the tall gate at the front of the complex, and climbed the path leading up to the manor. I forced myself to remain calm, to breathe evenly, as I crested the hill and headed to the side of the house where I had seen the housekeeper fall.</p><p>I stood outside the door, took one more deep breath, then stepped inside as if I belonged.</p><p>I was instantly inside the kitchen, a much smaller room than the one at the school, but meticulously maintained. It was blessedly warm after the chill outside, and I could catch the aromatic odors of meat and potatoes warming in the oven. Late as it was, the housekeeper was still awake and trying to cope with her crisis. She was sitting on the floor, her back to a wall, her legs stretched out, and a scatter of cloths all around her. She looked up in astonishment as I strolled in, all brisk confidence and breezy certainty.</p><p>“Oh, dear, I thought I saw you fall, but I couldn’t get free until just now,” I said in a sympathetic tone, dropping to a crouch. “What happened? Did you twist your ankle? Or worse?”</p><p>She stared at me, speechless for a moment. I put her at about fifty, with years of hard labor showing in her thin face, but she looked tough enough still to heave a table at me, if only she could get close enough to grab the legs. Her hair was an indeterminate brown and pulled back in an impatient bun; her eyes were a narrowed green, dense with intelligence. I had the strange thought that if she and Deborah were to engage in some kind of head servants’ brawl, this woman would win handily.</p><p>“Who are you?” she finally demanded. Her hands were bunched up in the cloth on either side of her skirt. I figured they were knotted against pain, but she might easily have a weapon concealed in a pocket. She didn’t strike me as the type who often allowed herself to be helpless.</p><p>“I’m Moriah. I work down at the school,” I explained. Going to my knees, I scooted down toward her feet. “Can I see? I’m not a healer, but I know enough to bind your leg if it’s sprained, or set it if it’s broken.”</p> <p>“It’s not broken,” she said sharply. And then, “You’re not allowed to be here.”</p><p>“I’m not,” I agreed, pulling up her hem so I could look at the damage. It was instantly clear that her left leg was the one that had given way on her. She’d managed to get her shoe off, but the whole ankle and half the foot were already showing a dark purple bruise, and the skin had puffed out in protest. “Ouch. That must hurt.”</p><p>“It does,” she said grimly, then repeated, “You’re not allowed to be here.”</p><p>“But if I leave, no one will wrap this for you, or help you into bed, or make sure you’re fed in the morning, and you could fall again and strike your head and die,” I answered cheerfully. “So let me just take care of this and get you something to eat and try to make you comfortable, and then I can leave before anyone realizes I’m here.”</p><p>She was silent a moment, clearly unwilling, but realistic enough to realize she would be in very bad shape without assistance. “Very well,” she said. “But you can’t tell anyone you’ve been here.”</p><p>“I won’t,” I promised. I glanced over with a smile. “What’s your name?”</p><p>“Alma,” she said reluctantly.</p><p>A soft name for such a strong woman! “Well, Alma, I apologize in advance if I hurt you. Now let’s get this taken care of.”</p><p>In less than an hour, I had wrapped her foot, helped her sit at the table long enough to eat a meal, and supported her as she hobbled into a small bedroom that opened off the kitchen. She did most of the work of stripping off her clothes and pulling on a nightshirt, but the exertion cost her a great deal; her face was drawn with pain by the time she lowered herself to the bed.</p><p>I glanced around as if looking for any final chores I should take care of. “Now, I’ll just bring dinner to the angel and then come down and clean up the dishes,” I said in a matter-of-fact voice. “Then tomorrow—”</p><p>“What did you say?” she interrupted.</p><p>I gave her my most innocent look. “I’ll take dinner to the angel—”</p><p>For the first time, she looked both nonplussed and alarmed. “How do you know—why do you think—”</p><p>“I’ve seen him. At night, on the roof. Heard him, a couple of times. I don’t know what’s wrong with him, but I assume he’s come here for help or healing. And maybe he can make it down two flights of steps to feed himself dinner and maybe he can’t.” I tilted my head to one side and watched her, my expression inquiring. Well? Can he ? And if he can’t, will you let him go hungry?</p><p>Her green eyes burned as she stared back at me, and I watched her internal struggle play out on her face. Clearly this was not a woman who easily betrayed a trust, but she could not reconcile her two warring mandates: Take care of the angel and Keep the angel’s existence a secret. But, really, she had no choice, and I saw the capitulation in her face a second before she spoke.</p><p>“All right. Take a tray of food to him on the third floor. He drinks water with his meal, no wine. Bring down his dirty dishes from breakfast. If he needs something else, he’ll ask for it, but don’t speak to him first.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I knew the answer already, but I wanted my guess confirmed before I actually risked showing my face to an angel. So I asked, “Won’t he wonder why I’m bringing him dinner instead of you?”</p><p>She shook her head and eased herself back onto her pillows. There were a lot of them. The bed was surprisingly plush, given her situation and the severe plainness of the rest of the room. I liked the thought that she allowed herself a single indulgence. “No,” she said, “he’s blind.”</p><p>I had to turn away to hide my smile. “I’ll be back in a few moments,” I told her as I stepped into the kitchen again. I was so delighted with the way my plan had gone so far that I was almost humming as I fixed up a platter.</p><p>It turns out it’s not easy to carry a heavy tray up two flights if the stairs are narrow and twisty and the only illumination is a small lamp you added to your tray at the last moment, when you realized the house was too old and remote to run on gaslight. I was a little breathless when I arrived at the attic level and found myself in a narrow corridor that ran along one side of the house. Three doors led off the hallway; the two that were closed I guessed to be a bedroom and a closet. The third one stood open in a rather gloomy invitation into what appeared to be a large sitting room. It seemed to take up most of the top story and to be intended as a public space, so I stepped inside with assumed confidence.</p> <p>A quick look around showed me shadowy groupings of chairs and small tables, boarded-up windows, and a curving iron staircase that had to lead to the roof. In one corner, a large stringed instrument leaned against a wall. There appeared to be stacks of books and papers on the floor, though they were disordered, as if no one had touched them in a long time.</p><p>In the center of the room, not quite facing me, was the angel. He was sprawled in one of those special cutaway chairs designed to accommodate angel wings, though he sat in it so carelessly that he appeared to be in danger of slipping out and crashing to the floor. His head was flung back to rest on the top of the padded back; his wings puddled on either side of him like dirty garments he had cast off after a tiring day. It was hard to tell by lamplight, but the clothes he was actually wearing appeared soiled as well. His white shirt looked wrinkled and stained, and his dark trousers sported a visible rip all the way down one seam. He was barefoot.</p><p>His face was in profile to me so at first all I could tell about his features was that his chin was firm, his nose was straight, and his cheekbone sleekly planed. He must not have liked the feel of whiskers on his face, because he had shaved recently, but his dark hair was long and disordered, spilling over the back of the chair in tangled knots.</p><p>I stood for a long time, holding the tray, staring at him. It was rare to see an angel—one of the most haughty, disdainful, unlikable creatures in all of Samaria—humbled and miserable. I wanted to enjoy the sight for as long as I could.</p><p>Then my hand trembled, or I shifted my weight and the floor creaked beneath me. At any rate, he suddenly realized I was there. He didn’t lift his head, just turned it enough so that he appeared to be looking in my direction. It was too dark for me to discern what the trouble was with his eyes. From here they looked like pools of shadow fringed with sweeping lashes.</p> <p>“The breakfast plates are on the table,” he said in an indifferent voice that was still musical enough to make me catch my breath. He didn’t seem to realize or care that I had arrived after midnight with his evening meal. “You can leave dinner there if you like. I’m not hungry.”</p><p>I located the table he meant, but set my tray in a different spot because the breakfast dishes took up all the room. Then I regarded him again for a moment before I asked brightly, “So what exactly happened to you?”</p><p>The astonishment on the angel’s face was comical. He jerked upright and glared in my direction, his wings quivering in indignation. “Who are you? Where’s Alma?” he demanded.</p><p>I felt a grudging admiration that he knew the servant’s name; so many in his position wouldn’t. “She sprained her ankle and can barely make it around the house, let alone up the stairs,” I said, still in that cheerful voice. “I volunteered to help her out.”</p><p>“No one is supposed to enter this house without my approval,” he said, frowning heavily. “No one asked me if you could come here.”</p><p>“Well, the headmistress and the footman are gone, and Alma’s laid up downstairs, so no one could really ask about your preferences,” I said. “As long as Alma’s off her feet, you’ll have to accept my help—or feed yourself—or starve.”</p> <p>At my tone, his features gathered in a scowl. “Who are you?” he repeated.</p><p>“Moriah. I’m a cook at the school.”</p><p>“You’re insolent for a cook.”</p><p>It was all I could do to keep from replying, You’re pathetic for an angel. Instead I said, “I suppose you’re used to being treated with more deference.”</p><p>“With civility,” he shot back. “With the sort of politeness anyone would extend to a stranger.”</p><p>There was a difference; even I had to acknowledge that. “I’ll be nice if you will,” I said. “Why don’t you eat? That way I can take all the dishes down at once. We don’t want rats coming for the scraps.”</p><p>I could tell by his expression he realized this was sensible, but he said, “I told you. I’m not hungry.”</p><p>He sounded like a petulant girl who hadn’t gotten her way on some trivial matter and was determined to sulk about it until everyone noticed. “Maybe not,” I said. “But I’m afraid if you won’t eat now, you’ll be very hungry by the time I can make it back here tomorrow night. You really should eat something.”</p> <p>He hesitated a moment, not done sulking, but gave in. “Oh, very well.” I expected to have to guide him toward the table where I’d left the tray, but he came to his feet and headed unerringly in its direction, dragging his chair behind him. His wing tips trailed on the floor, completely unheeded, like the cloth belt from a robe that had fallen open when the sash was untied.</p><p>“How did you do that?” I asked when he sat down and began feeling for the silverware. “Find the food?”</p><p>“I could smell it,” he said. He picked up a fork and took a bite of potatoes.</p><p>He had not invited me to join him, but I settled into a chair across the table from him and studied his face. “You must have a keen nose.”</p><p>He considered that while he chewed and swallowed. “Now, maybe,” he said. “It’s not something I ever noticed before.”</p><p>“Now—you mean, since you lost your sight?”</p><p>“Yes,” he said bitterly, “that’s exactly what I mean.”</p><p>“How did it happen?” I asked. Maybe he decided my tone was curious, rather than rude, because he didn’t seem offended, though he finished another mouthful of food before he answered.</p><p>“I was blinded,” he said, “by a thunderbolt from the god’s hand.”</p><p>My eyes opened wide, because that was terribly dramatic. “The god was angry at you? What had you done?”</p><p>He shook his head, chewing again. For someone who claimed to have no appetite, he was tearing through dinner at a rapid clip. “Not angry. There was a prayer for lightning, and he responded with lightning.” The angel took a drink from his water glass. “And destroyed me.”</p><p>My brows drew down. That was a pretty sketchy story. “Were you the one praying for lightning?”</p><p>He shook his head, his expression bleak. He couldn’t see now, but it was clear he was watching some internal vision. “A boy. I was teaching him some of the elemental prayers. How to beg Jovah for rain, how to ask him to stop the rain. How to pray for thunderbolts.”</p><p>I’d never given it any thought, but the entire sky must light up with a dazzling display whenever those particular songs are being taught. “I’m surprised the whole lot of you aren’t blind by now,” I remarked, “with prayers like that on the loose.”</p><p>The angel shook his head again. “We know the risks, and we contain them,” he said. “We know never to sing the whole melodies all the way through. We teach the first half of the prayer, then we work on different songs, then we go back to the plea for lightning. Everyone is always very careful.”</p><p>“Then what happened?”</p><p>“Aaron was young. And confident and careless and curious. Maybe he didn’t believe something as simple as a song could call something as terrible as a thunderbolt. Maybe he was showing off. I don’t know. But he didn’t end the song where he was supposed to. When I realized he was still singing, I ordered him to stop, but he wouldn’t. We were in a small building in Cedar Hills—there were twenty students in the room. I started shouting at all of them to get out, get out, and then I ran back to Aaron, to wrestle him to the ground, to make him stop.” The angel shrugged. “But the prayer was complete. The lightning bolt came. The building was demolished.”</p><p>“And you were blinded,” I finished. “Did you get injured as well?”</p><p>He nodded. “I have burns across my back and one down the side of my ribs. Scars now, but bad ones at the time.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What about Aaron?” I asked. “Was he blinded, too?”</p><p>The angel was silent.</p><p>“Dead, then,” I said with a sigh. “Well, there was a terrible lesson.”</p> <p>The angel laid down his fork. “The world is full of terrible lessons,” he said.</p><p>I could hardly argue with that. “When did it happen?”</p><p>“Two years ago.”</p><p>“And you’ve been here that whole time?”</p><p>He shook his head. “No. I stayed in Cedar Hills—oh, six months. It took that long to heal, to learn how to—” He shook his head again. How to navigate the world as a blind man. “But I found it too painful to be around other angels. So I have moved from place to place, looking for peace.”</p> <p>I glanced around the room, full of shadows and regret. “And found it here?”</p><p>He gave a small bark of laughter. “Hardly. This is just a stop. A quiet place where no one will bother me while I try to think of what to do next.”</p><p>“Well, sitting here in solitude all day, doing nothing except thinking about the past, seems like the worst possible way to find peace,” I said.</p><p>“You don’t know anything about it,” he snapped.</p><p>“Do you think you’re the only one who’s ever had grief in his life?” I demanded. “Pick five people at random on any street in Samaria, and you’ll find that they’ve suffered at least as much as you have. And most of them are getting on with their lives, not sitting in some dark room and moping.”</p><p>While he had told his story—and I had listened with a certain sympathy—he had seemed to forget how irritating I was, but he was remembering pretty fast now. He came to his feet in one swift movement, and his wings swept behind him with a kind of grandeur.</p> <p>“I appreciate your insights,” he said in an acid voice. “Some other day, perhaps, we can discuss the tragedies you have survived.” He gestured toward the door; I was interested to note that he knew precisely where it was. That unwary step that had caused him to trip on the roof must have been a rarity. “But I’m tired. Please take all the trays with you as you go.”</p><p>Just to annoy him, I stacked the dishes as noisily as possible. He’d left half his breakfast untouched, but he’d done a good job on the dinner; maybe a little argument was what he needed to stimulate his appetite. Pausing in the doorway, I said, “I’ll be back tomorrow night at about this time. Late. If you get hungry before then, can you make your way downstairs?”</p><p>“Yes,” he said shortly. Unsaid went the rest of the sentence. But I don’t expect to be hungry. I’m never hungry. I’m too sad to eat.</p><p>“Then I’ll see you tomorrow.”</p><p>I paused long enough to give him time to say I’d rather starve to death than spend another minute talking to you. But he didn’t. He merely stood there, obviously waiting for me to go. I was sure that, no matter how quietly I moved, he would be able to tell when I had left the room.</p><p>Alma was sleeping when I checked on her, which made me realize she must be in even worse shape than I’d thought. Otherwise, she would have managed to stay awake long enough to give me a furious scold for spending so long in the angel’s room. There were medicinal herbs in the school’s infirmary; I would have to bring her some tomorrow night when I returned to take care of the angel.</p><p>When I returned to take care of the angel.</p><p>My plan had been to trick my way into his presence so I could prove to myself I had no reason to fear him. Instead it seemed I would be bringing him meals and employing edgy banter to prod him out of his melancholy. The situation was so preposterous that, if I hadn’t been worried about waking Alma, I would have laughed out loud. Instead, I washed the dishes as quietly as I could and made sure the fire in the oven was out before I finally left the house for the night.</p> <p>I slept badly—so busy reviewing my conversation with the angel that I kept fending off sleep—and spent the next day sleepwalking through my chores. I managed a quick unobserved visit to the infirmary, where I secured a container of manna-root salve and a roll of bandages so I could rewrap Alma’s ankle. Finally I joined the others in the kitchen as they began cleaning up after the evening meal and scrubbed at the pots as I waited impatiently for all of them to go to bed.</p><p>Again, it was close to midnight before I could slip outside and hurry up the hill to the Great House. Alma was waiting for me, seated at a kitchen worktable and facing the door. She was a determined one, I gave her credit for that, for she’d found a way to move around the kitchen well enough to put together a simple meal. There was bread cooling on the table and a covered pan warming on the stove.</p><p>“How’s your ankle today?” I asked as I stepped inside.</p><p>She made a face. “Hurts even worse than yesterday, though I wouldn’t have thought it possible.”</p><p>“Let me look at it before I go upstairs,” I said. “I brought some salve and better bandages.”</p><p>I could tell she didn’t like it, but she allowed me to examine her injury again. No wonder she was in so much pain. The great purple bruise had spread down toward her toes and up toward her knee, acquiring some interesting tints of red and yellow. But I didn’t think there was a broken bone. I turned it gently and prodded it in the likely spots, and she didn’t cry out.</p><p>“It’s going to be a while before you can put any weight on this,” I said. “But maybe the manna root will make you feel better.”</p><p>It did, almost instantly, as it usually does. I’ve always thought that manna was the best of the god’s tangible gifts. She looked both relieved and grateful as the salve went to work, and I saw her surreptitiously flexing her toes. Hoping that the absence of pain was the same thing as healing. Of course, that’s never true, no matter how you’re hurting.</p><p>“How was the angel when you saw him last night?” she asked.</p><p>“Short-tempered and feeling sorry for himself” was my prompt reply.</p><p>That widened her green eyes, then narrowed them in consternation. “You talked to him? I told you not to bother him.”</p><p>I shrugged. “I had to explain who I was. And then we exchanged a few more words. He struck me as a very bitter man.”</p><p>“Anyone might be, under the same circumstances,” she said, but she didn’t sound convinced. I was willing to bet that Alma had met her share of adversities and refused to buckle under any of them.</p><p>“Maybe,” I said. I made a neat pile of the salve and bandages, then stood up and began gathering dinner items. “I’m impressed that you were able to cook a meal,” I said, peeking under the lid of the pan. It appeared to be dried meat made tender again by baking in juice and onions, and it smelled delicious.</p><p>“It took me the entire day to assemble everything,” she said. “And I made the easiest meal I could think of.”</p><p>“Well, he certainly liked what you cooked yesterday,” I said, filling up a plate and adding a good chunk of the bread. “He ate it all.”</p><p>“He did?” She sounded pleased. “Usually I bring back half of what I take him.”</p><p>I had picked up the tray, but now I paused with a couple more questions. “How long has he been here?” The angel had not answered when I asked him the same question.</p><p>“Six or seven weeks.”</p><p>“And how does he occupy his time?”</p><p>“The headmistress usually spends part of the evening with him, but I don’t know what they talk about. And sometimes when he’s alone, I hear music.”</p><p>“Singing?”</p><p>“Never. Some kind of stringed instrument, but I don’t know what.”</p><p>“And other than that, he just sits up in that room by himself all day, doing nothing? Sweet Jovah singing, it’s a wonder he hasn’t thrown himself off the roof by now.”</p><p>She frowned. “I’m sure he has plenty to occupy his thoughts,” she said stiffly.</p><p>“Nobody’s thoughts are that interesting,” I said and headed toward the door. Just on the other side of it, I turned back. “What’s his name?”</p><p>Alma was still frowning. “You may address him as angelo, if you need to speak to him at all.”</p><p>“Of course,” I said smoothly, though I had never used the honorific in any of my infrequent conversations with angels, and I wasn’t about to start now. “But what’s his name? Just so I know it.”</p><p>“Corban,” she said.</p><p>“Very well,” I said. “I’ll go take Corban his dinner.”</p><p>CHAPTER 3</p><p>Like Alma, the angel was waiting for me, or so it seemed: He had turned his chair so it faced the door, and his whole posture was alert. Even his wings were less dispirited, arching behind his back as if they had been plumped and groomed. It was obvious he had heard me climbing the steps and could tell by the cadence of my footfall exactly when I crossed into the room.</p><p>“I’m back. Moriah,” I said. “Are you hungry tonight?”</p><p>“A little,” he said.</p><p>“You should try to eat everything, since it cost Alma some effort to make it for you,” I said. “Her ankle is still very painful.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It smells quite good,” he said, shifting his body to track me as I crossed the room. Still dark and gloomy up here. I would have to bring up multiple lamps and leave them in strategic spots to brighten the place up.</p><p>“I’ll tell her you said so. Here. I’ve set everything out.”</p><p>Corban came to his feet and crossed the room, but hesitated before he sat down. “Will you dine with me?” he asked abruptly. “It feels very odd to eat while someone watches me.”</p> <p>I was starving, and I’d actually put more food on the plate than it seemed likely he’d finish, with the thought that I could sneak a few bites. I laughed.</p><p>“I will,” I said, “if you don’t mind me eating with my fingers.”</p><p>He offered a smile—small and twisted, but the first one I’d seen on his face. “I doubt I’ll notice.”</p><p>We took our places on opposite sides of the small table, the plate between us. I had moved the lamp over, as well, and now I studied him by its flickering light. He was a handsome man, or he would be, if his face wasn’t so closed and woeful. His features were fine, almost delicate, his cheekbones prominent enough to throw their own shadows. His eyebrows were so feathery they might have been painted on with a light hand, and again, he had found the energy to shave himself. He also appeared to have combed his hair. At any rate, it was not quite the mess it had been the day before.</p><p>His eyes were a blank and liquid black that seemed to be swirled with streaks of white. But that might just have been the reflections of the flames dancing on the wick.</p> <p>“It’s impossible to tell just by looking,” I said.</p><p>He looked startled and then displeased. “What is?” he said, though he clearly knew what I meant.</p><p>“Your eyes. They don’t look burned. And there’s no scarring on your face.”</p><p>“Jovah spared me disfigurement,” he said sardonically. “One of his many kindnesses.”</p><p>“What about pain?” I said.</p><p>“Very little now. At the beginning, when the burns were fresh—that was bad.”</p> <p>I finished up a mouthful of food and greedily took another. Even working with dried meat and limited materials, Alma was a good cook. “So you lost your sight, and you have some scars,” I said, when I’d swallowed another bite. “Were you harmed in any other way?”</p><p>“Those seem to be sufficient evils.”</p><p>“So your wings weren’t injured. You can still fly.”</p><p>His expression showed how stupid he thought me, or how cruel. The wings in question fluttered forward a bit, then back, reminding me of nothing so much as the lashing tale of an unhappy cat. “I can’t see. Of course I can’t fly.”</p><p>I glanced at him in surprise. “Really? You haven’t tried it since you were blinded? You might need one of your angel friends to go aloft with you, talk you through it, but I’d think you could fly if someone acted as your guide.”</p><p>Corban was silent a moment, his face creased with displeasure. At first I thought he was annoyed at me again, but then I realized he was angry at an old memory. “I did try flying with a guide—once—shortly after the accident,” he said at last. “But it was terrifying. I had no sense of direction—I don’t just mean north and south, I mean up and down. Once I was high enough, it was hard to tell where the ground might be below me. When the wind blew, even a little, I lost my bearings. It was like being—” He seemed to search for words. “Like being caught in a rockslide when a mountain is falling. I was tumbled in all directions. I couldn’t see, I was filled with panic.”</p><p>“Where was your friend?”</p><p>“Nearby, watching me flail, thinking if he remained silent I would be forced to figure out my circumstances, which would help me gain confidence. He did come to my aid when it seemed likely I would crash, and we both walked away from the episode shaken. We have only spoken once or twice since.”</p> <p>“Well, obviously he was the wrong one to try that with,” I said. “And maybe it was too soon.”</p><p>“I don’t think the fear will leave me no matter how long I wait.”</p><p>I shook my head. I couldn’t seem to break the habit, even though he couldn’t see me. “No, I mean—you seem to have keen senses of smell and hearing, and maybe those developed after your accident,” I said. “Maybe your other senses have grown more acute as well. Maybe you have a better sense of direction. You seem to walk around the room well enough without running into furniture. Maybe you wouldn’t fly into trees, or come up on the ground too fast when you tried to land.”</p><p>I had surprised him; the expression on his face was considering. “Maybe,” he said.</p><p>“So you should try to fly again.”</p><p>A ghost of a smile crossed his lips. “We seem to be missing an essential element,” he said. “An angel who can fly beside me and help me find my way.”</p><p>“Couldn’t you invite one of your old friends to visit you here?”</p><p>“I could, but I can’t think of one I would trust enough to guide me in a flight.”</p><p>“Why do you consider them your friends, then?”</p><p>The question seemed to catch him off guard. “They are—they were—people with whom I shared certain experiences,” he said. “Certain attitudes. A position in life. We were all alike. None of us were ever comfortable with—” He struggled to express it. “Weakness. In others. We didn’t have weaknesses of our own.”</p><p>Everything he said just reminded me how much I had disliked all the angels I had ever met. “You’re all arrogant bastards who think you rule the world,” I said. “You don’t have compassion for others because you never needed it for yourselves.”</p><p>He looked both affronted and rueful. “That’s not exactly—but to some extent—perhaps,” he said.</p><p>“So has adversity made you kinder, do you think?” I asked.</p><p>He looked like he’d never thought about that, either. “I don’t know,” he said stiffly. “In the past two years, I haven’t been in many situations where I was asked for kindness.”</p><p>“No, you’ve spent all your time sitting here, brooding in the dark.”</p><p>“Well, it seems pointless to brood in the light,” he shot back.</p><p>I threw my hands in the air. “What do you do all day?” I demanded. “Surely you must do something besides sit here in the dark and feel miserable.”</p><p>I had annoyed him again, but I wasn’t sure that was a bad thing. His face took on more color, his gestures were livelier, when he was arguing with me. That couldn’t fail but amuse me somewhat. Never before had my abrasive personality looked to have such a beneficial effect on someone. Particularly an angel.</p><p>“Some of the time I play music,” he said. He gestured to the instrument against the wall. So he knows where he is and where everything is placed inside this room, I thought. “Some of the time I write it.”</p><p>“You’re able to put the notes down on paper?”</p><p>“I misspoke,” he said deliberately. “I compose the music. I hear it in my head, and I practice it on the cello. I also have a flute, though I’m not as adept with it.”</p><p>“Good. I was afraid you did nothing but mope. I’m glad you’ve found a distraction.”</p><p>“Yes, since your own capacity for compassion makes you sympathetic to all Samaria’s creatures.”</p><p>It was so unexpected that I laughed out loud. “I have plenty of compassion for people who deserve it,” I assured him. “I just don’t happen to feel sorry for you.”</p><p>“I must assume that the individuals you pity are truly wretched.”</p><p>“You’re right,” I said cheerfully. “I think most people give up too easily, when—if they showed a little determination—they could improve their circumstances. I’m not saying it’s easy. But you almost always end up somewhere better than you started.”</p><p>“Which makes me—for the first time, I might add—curious about your life.”</p><p>I laughed again, but came to my feet and started gathering the dishes. Every speck of food was gone. I’d eaten some of the meal, but honestly, he’d beaten me to most of it. Sparring with me seemed to be good for his appetite.</p><p>“And it’s an interesting tale, but there’s no time to tell it,” I said. “I have to get back to the kitchen and finish my shift.”</p><p>Corban came to his feet, too, his attitude suggesting he was listening to me arrange the plates and silver. “What do you look like?” he asked abruptly.</p><p>“I’m beautiful” was my immediate reply. “My hair is black as night and my eyes are so blue people can see their color from across the room. And I’m tall. And voluptuous,” I added for good measure.</p><p>His expression was thoughtful; he was assessing my words. “Not tall,” he decided. “Maybe—” He held his hand out so it was about level with his chin. “This height.”</p><p>He had gauged it exactly. “Very good,” I said dryly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So I suppose the rest of it is a lie as well.”</p><p>“I can’t see that it matters what I look like.”</p><p>He looked interested. “Are you that hideous?”</p> <p>“No!” Now I was the irritated one; how had that happened? “I’m ordinary. My hair is that dirty brown color that so many people have. My eyes are brown, too. My face is too round. I weigh a little more than I’d like. But I do have a good figure,” I couldn’t resist tacking on at the end. If he was picturing me from my description, he may as well include the good bits.</p><p>“How old are you?”</p><p>Old enough to know better than to even remotely consider flirting with an angel. “I’ll be thirty-two a couple weeks after the Gloria. How old are you?”</p><p>It was meant for impudence, but he didn’t seem to mind. “Thirty-five. Or a hundred and thirty-five, depending on the day.”</p><p>That made me laugh. “I don’t think I’m ever older than seventy, even during my worst weeks. But sometimes I feel sixteen, so I suppose it evens out.”</p> <p>“How did you end up at the Gabriel School?”</p><p>I was done gathering the dishes, and I was certainly done with this conversation. “That’s part of the story that’s too long to tell,” I replied, edging for the door. “I’ll be late with my chores if I’m gone much longer.”</p><p>“Will you be back tomorrow?”</p><p>I quashed the desire to say Do you want me back? Stupid, to try to make a sad and heartsick angel confess some need for me. Who was the pathetic one now? I made my answer casual to cover up my self-disgust. “As long as Alma’s unable to climb steps, I suppose I’ll be back,” I said. “And since I don’t think she’ll miraculously heal overnight—yes, I’ll be here tomorrow.”</p><p>He didn’t say, Good. He didn’t say I’ll look forward to talking to you again. He just said, “Very well,” and turned away from me before I was even out the door.</p><p>The next day was much the same, except I got to bed earlier, slept better, and rose later. I didn’t mind nocturnal hours, but if I was going to fill them with twice the usual activity, I needed to husband my energy. Once again, I made hasty work of my most important chores, then climbed clandestinely to the Great House and spent a little time with Alma. Her ankle was still a swollen purple mess, but the salve had greatly reduced her pain, and she thanked me three times for bringing it.</p> <p>Tonight’s meal smelled just as appetizing, but it made me think. “Do you have enough food on hand to continue like this?” I asked. Usually Alma or the footman came down to the school once or twice a week to take supplies from our storerooms. These were supplemented every week by deliveries from Telford, including a few live pigs and chickens that Deborah and Elon slaughtered and dressed.</p><p>“For another week, I do,” she said. “And I don’t have to worry about water—it’s piped into the house and drains into an underground line.”</p><p>I’d noticed that no one had asked me to run a pump or empty chamber pots, for which I was deeply grateful. We had a good plumbing system at the school, so I’d gotten out of the habit of thinking about how precious water was when it wasn’t readily available.</p><p>“I don’t think I can sneak bags of potatoes and whole chickens up here,” I said thoughtfully. “If the headmistress isn’t back soon, you might have to let Deborah know you need help.”</p><p>She nodded. “I already realized that. I can’t walk down the hill yet, but I think I can wave from the porch and catch someone’s attention.”</p><p>“Good. I’ll be on the lookout in case no one else notices.”</p><p>I finished assembling the tray, and a few minutes later I was carrying it into Corban’s room. “Here’s your dinner,” I said.</p><p>But I was speaking to an empty room.</p> <p>I looked around harder, just in case he was lurking in a corner, but he was nowhere to be seen. It was late, of course; maybe he had already gone to bed. Or was he simply avoiding me, less entertained by my needling conversation than I had supposed?</p><p>But almost immediately I registered the temperature of the room, far chillier than it had been on my earlier visits. I set down the tray and followed the swirls of cold air to the trapdoor above the spiral metal staircase that I assumed led to the roof.</p><p>He knew I was coming. He had left the trapdoor open. He must expect me to follow him. I grasped the railing and ran up the curving flight of stairs, into the star-cooled night.</p><p>Corban was standing in the far corner, posed as if he were gazing out at the ground below. A quick glance showed me that the whole roof was hemmed in with a half wall, just high enough for a medium-sized person to lean an elbow on. A few knobby pipes poked up from below, and chimneys on two sides added interest to the architecture. Otherwise it was a plain rectangular space, flat as a floor, with little to recommend the view.</p><p>By the light of the full moon, I could pick out the curls in Corban’s hair and the interlaced quills of his wings. He was facing away from me, and I had an excellent view of the way his wings sprang from his back to make their distinctive bell shape. I could see his hands braced against the half wall. His fingers were balled into fists; there was tension in the line of his shoulders.</p><p>I was certain he had heard my arrival, and I was too contrary to speak first. So we waited a few moments in silence while I studied the silhouette of his body and he contemplated some thought too private to share.</p><p>When he did speak, he sounded irritated already. “You don’t like to make things easy for people, do you?”</p><p>That made me grin. “Honestly, I don’t,” I said.</p><p>He pivoted, his wings making a lovely, majestic sweep. “You don’t even say hello. You don’t even let me know you’re here.”</p><p>“You knew I was here.”</p><p>“That’s not the point.”</p><p>“You think I’m rude?”</p><p>“I think you’re—” He searched for the right words. “Deliberately provoking.”</p><p>I grinned. “That’s about as accurate a description as I’ve heard.”</p><p>“My question would be, why? Is it your goal to make people dislike you?”</p><p>“Do you dislike me?” I responded.</p><p>His brows twitched together. “I was talking about other people.”</p><p>“I can be accommodating when I feel like it,” I said. “I can get along with people if I want to.”</p><p>“So you reserve this provoking behavior for me.”</p><p>“Not just you. I was very insubordinate with the housekeeper at my last job, for instance.”</p><p>“Ah. So you like to challenge authority—or people who believe their station in life puts them above you.”</p><p>“Yes, but you can see that I only harm myself by such behavior. I lost that position a couple of months ago. And the one before it.”</p><p>“Yet you don’t try to be more submissive. More conformable.”</p><p>“There is a certain contrariness at the base of my personality,” I allowed. “It is so hard for me to act the way people expect me to act, even if it’s in my own best interests.”</p><p>“How, I wonder, would someone come by such a trait?”</p><p>Oh, there was a story it would take half the night to tell. “I was born with it, I believe,” I said lightly.</p><p>“But I don’t,” he said.</p><p>I was lost. “Don’t what? Don’t believe me?”</p><p>“Dislike you,” he said. “Most of the time.”</p><p>“I can try harder to be annoying,” I offered.</p><p>“I’ll let you know if that becomes necessary.”</p><p>It was peculiar to have an angel tell me he didn’t dislike me—though that didn’t mean he liked me, and, at any rate, it scarcely mattered, since I doubted my future held many more intimate nighttime conferences with this one. Because I didn’t know how to answer him, I changed the subject. “So why are you out here on the roof?”</p><p>“I was thinking about something you said.”</p><p>“Really? What’s that?” I rubbed my arms. It was probably ten degrees above freezing and I’d only worn a light jacket since I hadn’t expected to be outside any longer than it took to climb the hill.</p><p>“Flying.”</p><p>“Really? You think you might be ready to attempt it again? You think you can sense the buildings and the trees—”</p><p>“Not that, not yet,” he interrupted. “I don’t even know if my wings can support my weight.”</p><p>“Well, we aren’t very far from the ground up here,” I said. “Three stories. You could jump off the roof and just try to glide down. You’d be careful because you know the ground isn’t very far away.”</p><p>“That’s a possibility,” he said gravely. “But I want to try something else first. Coming back to the roof.”</p><p>“That seems harder,” I commented.</p><p>“Yes,” he replied. “A better test.”</p><p>“And you’re not worried about losing your bearings?”</p><p>“You’ll have to help me, of course. You’ll have to call out to me. I would not get so far from the house I would lose the sound of your voice.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I was washed with a sense of pleasure so irrational that I immediately tried to destroy it. “You trust me to do that? What if I decide to remain silent, just to confuse you?”</p><p>I had thought to baffle him or enrage him or make him so uneasy that he instantly abandoned his plan. But he was getting as good a measure of my personality as I was of his. “In that case,” he replied, “I will come awkwardly to ground—perhaps injure myself—attempt to make my way safely back to the house without your help—and then refuse to see you again. Which would cause you to lose what I have come to believe is your very real pleasure in visiting with me for however long this arrangement lasts.”</p><p>I was silent for a beat. “That was good,” I said. “You thought this through before I even arrived tonight, didn’t you?”</p> <p>He was smiling—a real smile, pleased with himself, a little smug, but I had to admit I liked it. “I did,” he said. He had started pacing slowly around the perimeter of the roof, as if trying to get an exact feel for its dimensions. I kept turning slightly to keep him in my sight. “I don’t think you would betray me in such a fashion. If I ask for your help, and you promise it, I don’t think you’ll renege.”</p><p>Oh, yes, a very good measure of my personality. “What do you want me to do?” I asked.</p><p>“Stand in the middle of the roof. Where there are no pipes or poles that will trip me up when I land. They are too small for me to sense, and they have brought me down more than once before this. I will go aloft—I will circle—and then I will come down to the sound of your voice.”</p><p>“How far out will you be able to go and still hear me?”</p><p>He cocked his head, as if listening. “It’s a still night,” he said. “Sound should carry some distance. When your voice grows faint, I’ll circle back.”</p> <p>“So you want me to stand here the whole time you’re in the sky, shouting out nonsense like an idiot?”</p><p>“That shouldn’t be too hard for you,” he said.</p><p>Before I could respond with indignation, he laid a hand on the half wall and vaulted up to a crouch. I was suddenly flooded with a very real fear. “Corban—” I began, but I couldn’t think what to say. Be careful. As if this was an enterprise where caution was possible. Are you sure you’re ready? As if I hadn’t been the one pushing him to try this very feat. Good luck. As if I was afraid he’d fall....</p><p>He straightened in one quick, graceful motion, his wings spread to help him keep his balance. For a moment he stood there motionless, limned against the moonlight, a distinctive shape with such primeval power that I felt my breath catch in my throat.</p><p>And then the great wings spiked downward, sending a current of wind billowing over the roof, and Corban was airborne.</p><p>My fear mutated to outright terror as he seemed to list and stutter against the faint breeze. I could see his wings beating frantically, his arms chopping through the air as if he was fighting to realign his weight. He made one sloppy circle overhead, dipping dangerously close to the corner of the house, before he was able to gain a little altitude. I saw his body straighten out, his arms stop thrashing—and then it was as if he had it. He remembered the trick. He was flying.</p> <p>He widened his arc, climbing upward at the same time. From this odd vantage point, directly underneath him at intermittent points, I could see the laboring of his wings, feel the faintest draft from his passage. It was so impossible and yet so beautiful, the sight of an angel in flight. I felt an awe, a sense of wonder, as if the god had stepped down and rested his hand upon my shoulder.</p><p>Corban’s range expanded to an even greater distance. I had the impression that he had grown giddy with motion and, like a drunk man, lost all fear or capability for rational behavior. “Corban, not so far!” I called out, remembering for the first time that I had a responsibility in this little drama. “Corban, can you still hear me?”</p><p>For an answer, he canted his body over so that his wings were almost perpendicular to the ground and made a tight spiral back in my direction. “Corban!” I shouted. “Can you still hear me?”</p><p>He passed over my head and waved and kept flying.</p><p>I twisted to watch his progress and continued to call his name out at regular intervals, adding the occasional That’s too far and Come back this way now. It’s hard to know what words to employ when you’re acting as a human foghorn. The part of my brain that wasn’t taken up by fear was swamped with embarrassment at being in such a ridiculous position, so I started singing a children’s lullaby at the top of my lungs. He might mock me for my untrained voice, but at least I didn’t have to think about the lyrics.</p><p>For all his seeming rashness, it was clear Corban truly was listening to me. He strayed farther than I liked, but almost immediately came back, as if he had discovered the outer border beyond which my voice would not carry. I wasn’t sure I could have heard him from the same distance, but I knew his ears were sharper than mine.</p><p>The wind picked up force and I was terrified that it would blow him off course, but after a shaky moment, he seemed to remember how to ride the draft. So all I need to worry about is whether I’m going to freeze to death, I thought, rubbing my arms again and stamping my feet for warmth. I got tired of the lullaby and switched to a tavern ditty. I wondered if he could catch the words, or only the snatched phrases of my melody. I wondered how long he planned to stay out on his first flight in two years. I wondered if he kept circling the house because he was afraid to try to land.</p><p>Almost as soon as I had the thought, I realized that he was flying in a narrower and narrower curve, dropping downward as he closed the distance. I abandoned music and began shouting directions. “Corban! This way! You’re about twenty yards up now and twenty yards out. All right—now you’re just above the wall, you need to come in closer. That’s right—and a little lower—”</p> <p>He adjusted some angle of his feathers and suddenly went into a whole different mode of travel, hovering instead of flying. His body swung from a horizontal to a vertical position, his legs pointed down as if he were feeling for the surface with his toes. His wings, which had been outstretched and quiescent as he glided, were now beating the air again with great energy, holding him in place just a few feet above the roof. I was so close to him I was buffeted by every stroke; my hair whipped around my face.</p><p>“Almost there—drop down a few more inches—”</p><p>He put his hands out, as if reaching for me, and I unthinkingly grabbed them. Many things happened at once. His feet hit the roof hard and he stumbled into me, clutching my shoulders for support. His wings lashed around us both, helping his balance, maybe, but adding to my clumsiness and confusion. For a moment, the world was a chaotic ball of motion and feathers and unexpected heat as our bodies crushed together and we both staggered and tried not to fall over.</p><p>And then the angel came to rest with his arms around me and his wings draped over my shoulders and the moon ladling silver over us both. I could feel his rapid heartbeat, the heavy suck and release of breath as he gasped for air, but for a moment what astonished me most was the sheer radiant warmth of his body. I knew, but I had forgotten, that angels’ blood ran at a higher temperature than a mortal’s, to keep them warm when they flew at high altitudes. I was so cold that I wanted to burrow in, practically dig for shelter against his skin.</p><p>Instead I waited another heartbeat, until I was steady on my own feet, and then stepped back just enough to free myself from his arms. His wings still lingered on my shoulder blades, the feathers tickling my throat.</p><p>“You did it!” I exclaimed. “Were you scared? Are you excited? What did it feel like?”</p><p>“Terrifying. Exhilarating. I thought I would fall—there at the beginning—I couldn’t get the height, I thought I would crash down, but I didn’t. I caught the updraft, and then I remembered, I remembered all of it, as if it had only been a day since the last time I flew—”</p><p>“You went pretty far,” I said in an encouraging voice. “Maybe a hundred yards out and almost as far up. Could you tell how much distance you were covering?”</p><p>“No, but I think with practice I could,” he said. “Or maybe I could devise some kind of numerical system—flying at a steady rate for a count of five hundred would mean I had covered a certain set mileage—”</p><p>“That sounds like you want to keep trying,” I said.</p><p>“Yes! There are a lot of things I could experiment with. Pressure, for instance. The air feels different when you reach a certain altitude, so if I make careful assessments of how it feels at different levels, I’ll be able to tell how high I am.”</p><p>I couldn’t help laughing. “That’s ambitious for someone who hasn’t even been aloft for almost two years!”</p><p>He grinned. “I know—I must start slowly and build up my strength and gauge how much I really can do. But—I can’t describe to you—just the sensation of being in flight—I have missed it so much.” He came closer and his voice took a deeper tone. “And I have you to thank for giving me the courage to fly again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Oh, no, no, no. I could not have gratitude and earnestness from an angel. I was not used to that from anybody. “Think how relieved I am that this night went so well,” I told him. “If you’d come crashing to the ground and snapped one of your wings—well, that would have been my fault.”</p><p>“I wouldn’t have blamed you,” he said, still in that serious manner.</p><p>“Are you joking? You’d never have stopped blaming me!” I exclaimed. “You’d have spent the rest of your life in some attic, sitting in the dark and cursing my name, hating me even more than that angel who wouldn’t help you fly when you first lost your sight.”</p> <p>He took just enough affront to step back a pace; the last feathers of his wing slipped silkily from my shoulder, leaving me even colder than before. “But unlike that old friend, you were exceptionally helpful,” he said, and his voice had the slightest edge. “I had counted on you to keep calling, but I hadn’t expected songs. And such songs! ‘The Shy Angel-Seeker of Sweet Semorrah’? The last time I heard that piece sung, I was keeping very questionable company.”</p><p>“You’re keeping questionable company now. You just didn’t realize it before.”</p><p>“Oh, I realized it,” he replied. “I just haven’t had much latitude in my choice of companions.”</p><p>I snorted in amusement. “Well, I don’t mind if you make fun of my song selection,” I said. “Just don’t make fun of my voice. You can’t expect a mortal to sound like an angel.”</p><p>He looked surprised. “In fact, I was impressed with the quality of your voice,” he said. “Am I wrong, or are you an angel’s daughter?”</p> <p>And then I did the stupidest thing. Instead of answering, I caught my breath, as if he had offered me the gravest insult, then turned around and practically ran for the stairwell. I had closed the trapdoor, not wanting the blind angel to put a foot wrong as he tried to land, and now my frozen hands couldn’t pry it up fast enough. With a pouncing motion and a swirl of feathers, Corban caught my arm and hauled me to my feet before I could escape.</p><p>“Moriah—I’m sorry—I didn’t mean to offend you,” he said.</p><p>“I’m not offended,” I grated out through chattering teeth. I tried to jerk free but his hand tightened automatically. High body heat and exceptional strength—oh, angels had far more than their share of advantages. “I’m tired of the conversation.”</p><p>“You’re cold,” he said in a wondering voice, suddenly registering the temperature of my skin. He lifted his free hand to wrap around my other arm. “Why didn’t you say so before?”</p><p>“Well, first, I was watching you fly. Then I was hearing you talk about how much fun it was to fly. Then I was arguing with you. So there hasn’t been time.”</p><p>Unexpectedly, he released me and then drew me against his chest once more. His wings overlapped behind me, a plush cocoon. “We need to get you warmed up.”</p> <p>“We could do that inside,” I suggested. It was hard to make that sound convincing when I was snuggled up against him, luxuriating in the heat of his body.</p><p>“In a minute,” he said. “Why don’t you like to talk about the fact that you’re an angel’s child?”</p><p>I had braced myself for the question, and this time I had my armor on. “Why might that be?” I said in a scathing voice. “Oh, maybe because my mother was an angel-seeker. That’s not something to be proud of. Maybe because I was one of the hundreds of children abandoned every year by women who don’t want to be burdened with the care of a mortal child. Maybe because I don’t want your pity or your disdain.”</p><p>He was silent a moment. “And how did you come to be at the Gabriel School?” he asked finally.</p><p>I laughed and tugged myself free. Jovah’s bones, but it was cold up here once a person stepped outside the protection of an angel’s wings. “Only the latest stop in a highly adventurous life,” I said. “I’m going downstairs. Your dinner’s probably cold by now, but I’d think you’d have built up an appetite.”</p><p>This time the recalcitrant door opened without a hitch, and I was quickly down the curving staircase into the blessed warmth of the attic. Corban, who had clearly learned to navigate the steps without being able to see them, was right behind me.</p><p>“Are you going to stay and eat with me?” he asked.</p><p>“No. I’ve been gone too long as it is.”</p> <p>“Are you coming back tomorrow?”</p><p>I wanted to and I didn’t want to, and the fact that I wanted to really made me not want to. But I hated the idea that someone else might come to the Great House and discover the blind angel. “I suppose,” I said ungraciously. “Someone has to look after you.”</p><p>“Can you come back earlier or stay longer? The more I fly, the more I can build up my strength.”</p><p>“I don’t think so,” I said. “I’m just sneaking over here now.”</p><p>“Sneaking? Why?” he asked.</p><p>“Because no one knows there’s an injured angel hiding in the Great House,” I said tartly. “I thought that was on your command. We’ve all been warned away. People think the place is haunted, so everyone’s afraid of the house anyway.”</p><p>“So why did you start coming over?”</p><p>I let out my breath on a gusty sigh and offered a partial truth. “Because I’m the kind of person who always goes where I’m not allowed,” I said. “I thought you’d have figured that out by now.”</p><p>He was smiling slightly. “I have. I just wanted to hear you say it.”</p><p>I made an infuriated sound at the back of my throat. If I was as irksome to others as the angel was to me, I finally understood why some people despised me. “So, yes, I suppose I’ll be back,” I said as I made my way toward the door.</p><p>“And we can practice flying again?” he said.</p><p>He sounded so excited, so hopeful, that I couldn’t bear to give an equivocal reply. “Yes,” I said. “You can practice flying again.”</p><p>CHAPTER 4</p><p>When I entered the kitchen the next evening to help clean up after dinner, everyone fell silent to stare at me. I hid my instinctive apprehension behind a curious expression. “What’s wrong?” I asked.</p><p>“The housekeeper at the Great House wants to see you,” Deborah said, her eyes speculative.</p><p>I relaxed a little. Alma must have found a way to signal for help. “She does? Why?”</p><p>“She says she knows you,” Elon piped up. “You worked together at some shop in Luminaux. She spotted you in the yard the other day and she recognized you.”</p><p>“Alma’s here?” I exclaimed. She had made it very easy for me to follow her cues. “I didn’t know that! I lost track of her a long time ago.”</p><p>Deborah said, “She asked if I could spare you for the next few days, since she’s had an accident and can’t move around too well.”</p><p>“Oh, no! What happened?”</p><p>“Fell and twisted her ankle,” Elon said. “And she’s all alone in the house, what with the headmistress being gone.”</p><p>“She hobbled out to the porch and waved a red cloth till someone noticed her,” Judith added.</p><p>“Everyone was afraid to go up and see what was wrong, of course,” Rhesa said. “I mean—the house is haunted! But we sent one of the boys, and she asked for you.”</p><p>“She wants you to come up every evening and help her make her dinner and keep the house tidy,” Deborah said. “You’ll have to stay a few hours, I suppose, but you won’t need to spend the night.”</p><p>The words froze me to the spot. Alma probably didn’t need me for more than half an hour a day; in fact, as long as she had food in the house, she probably didn’t need me at all. Alma was not the one who had requested my presence....</p><p>“No, I’d hate to spend the night there,” I agreed. “The place is so—spooky.” I managed a convincing shiver.</p><p>Judith spoke up, her voice deceptively mild. “I suppose someone will have to take over your shift in the kitchen at night,” she said. “I don’t see how you can do it all.”</p><p>“Yes, Rhesa will have to go back to night duty for the time being,” Deborah agreed.</p><p>Judith grinned at me behind Deborah’s back—we both hated Rhesa—and Rhesa started whining. “But I hate the overnight shift! Isn’t it somebody else’s turn?”</p><p>“Stop complaining!” Deborah said briskly. “It’s just for a few days, I’m sure.”</p><p>I was less sure, but I wasn’t about to say so. I was both unnerved and a little excited to think that Corban had gone to such effort to secure my help on a protracted basis. Of course, he really had no one else to ask. It wasn’t particularly a compliment to me that I was the only one he knew in the entire Gabriel School.</p><p>“When should I go up to the Great House? Now? It’s so late already.”</p><p>“She said you should come no matter what time it was, so just head on over.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It’s not fair,” Rhesa muttered under her breath, but Deborah gave her a minatory look, and she subsided.</p><p>No, it’s not fair, I wanted to tell her. Angels are selfish and high-handed. They don’t care who else is inconvenienced as long as their own needs are met. You can’t gainsay them, so your only choices are to do what they want or to run away.</p><p>But I found that I didn’t want to run away from this particular angel.</p> <p>Now that I didn’t have to creep to the Great House unobserved, I was able to bring fresh supplies to Alma when I climbed up to the house a few minutes later. She was sitting in the kitchen, sipping tea, and I complimented her on her ruse as I put potatoes in the pantry and a crock of butter on the table.</p><p>“So what’s the name of this place we both worked in Luminaux?” I said. “In case anyone asks me.”</p><p>“I actually managed a dress shop there, so we might as well claim that,” she said. “Have you ever even been to Luminaux?”</p><p>I put my hands against my chest in a mock swoon. “The Blue City! The most wonderful place in all of Samaria, as far as I’m concerned.” It was an artisans’ town, full of musicians and potters and jewelers and painters, and I would live there again in a heartbeat. If I thought I’d be safe.</p><p>“So you’ve moved around a little,” she said.</p> <p>I nodded. “At various times, I’ve lived in Semorrah and Castelana and Velora. But I was in Monteverde longer than I was anywhere else.”</p><p>I could tell that caught her attention—most mortal women who spend much time near the holds turn out to be angel-seekers—but she didn’t ask any questions.</p><p>“Just so you know,” she said, “it was the angelo who requested your assistance. I could have gotten along perfectly well on my own.”</p><p>That made me grin, but I said, “So what did he do? Shout down the stairwell at you?”</p><p>She shook her head. She still looked a little unnerved. “He came downstairs, bringing the dinner dishes with him. That’s the first time he’s been down here since—maybe since he arrived. I was worried he’d bang his head on a door frame or snag one of his wings on a nail, but he managed very well.”</p><p>“Yes, he’s not nearly as helpless as he’s let himself believe,” I said.</p> <p>I read agreement in her expression, but she couldn’t bring herself to criticize an angel. “Anyway, he said he’d learned you were pulling double duty and he wanted that to stop—but he wanted you to keep bringing him his meals.” She gave me a shrewd look. “He doesn’t like strangers, but I suppose he’s gotten used to you.”</p><p>I suppose he likes your company. What exactly have you been doing to charm the angel out of his misery? “I guess I’d better take him his dinner, then,” I said, loading up the tray.</p><p>Alma gestured. “I made enough for both of you. I think it makes him more cheerful if he has company while he eats.”</p><p>Oh, her sharp eyes didn’t miss a thing. But all I said was, “Glad to hear it. I’m hungry.”</p><p>Corban was waiting for me when I made it to the top story—not sitting, as before, but on his feet, as if he had been pacing impatiently until I arrived. “Good, you’re here,” he said. “Did you remember to bring a coat? It’s cold again tonight.”</p><p>His eagerness made me laugh. “Yes, and a sweater underneath it,” I said. “But if you’re planning to be outside for a long time, could we eat first? I don’t want to starve any more than I want to freeze.”</p><p>He hesitated, then said, “All right,” and moved to the central table. I could almost read the thought in his head. He didn’t want to waste the time it would take to consume the meal, but he didn’t want to seem indifferent to my needs; he was trying to be considerate of someone else. Probably for the first time in his life, I thought as I joined him at the table.</p><p>We ate quickly and were back on the roof within twenty minutes. The moon was just past full tonight, and the clouds were thicker; there was a little less light than the night before.</p> <p>That didn’t matter to Corban, of course. He strode straight for the wall on the northern corner and placed his hand on its rough surface. “Just like yesterday,” he said and propelled himself up to pose for a moment on its narrow shelf. He shook out his wings as if to shake off water or dust, then pumped them twice.</p><p>And then he was flying.</p><p>Again, for the first moment or two, I was so enthralled by the sheer impossible gorgeousness of flight that I forgot my own role. I ran to the wall just to watch him swoop and caracole through the air. He didn’t seem troubled by the previous night’s shakiness; the launch was smooth, the arabesques confident. More quickly than he had the night before, he climbed upward and spiraled outward, and I was seized with fear that he would drift beyond the reach of my voice before I even remembered I was supposed to be singing.</p><p>So I drew a hasty breath and offered the first melody I could think of, which happened to be a Manadavvi ballad. I didn’t even realize what it was until I was through the first verse, and then I was disgusted with myself. It was sure to elicit even more questions from him than the tavern song, if he recognized it. But maybe he wouldn’t. I made myself finish all three verses, just to prove I would, and then picked something as different as I could think of. An Edori love song. Let him comment on my eclectic tastes. That was better than having him ask why I was familiar with Manadavvi customs.</p><p>Before the evening ended, I was thinking it was lucky I did know such a wide range of songs, because he stayed out more than an hour. I never entirely lost sight of him against the overcast sky, but more than once I was certain he had gone too high or ranged too far to be able to hear me. I guessed that the distance was deliberate. He wanted to prove to himself that he could slip the tether of my voice but still make it back to safety. I hoped he was right. I couldn’t imagine what I would do if he disappeared in the night and I had no idea where he had come to ground.</p><p>But no such disaster occurred. Just as I was beginning to think my voice would give out completely, I saw his silhouette pass directly over the imperfect circle of the moon and then drop rapidly toward the ground. Too rapidly, it seemed to me—when he was within hailing distance, I abruptly stopped singing and started shouting.</p><p>“Corban, slow down! You’re too close! You’ll crash!” I heard him laugh right before he did something that caused his descent to slow dramatically. Now he was hovering a yard or two above the roof, and the night air was windy with the sweep and drag of his wings.</p><p>I took a deep breath. “All right. You’re about five feet up. Come down slowly. I’m putting up my hands—reach out for me—just a little nearer—”</p><p>And there. His fingers closed around mine; his body was still so inclined toward flight that he lifted me to my toes, like a boat tugging against its mooring and almost pulling it loose from the pier. Then all at once his feet were solidly on the roof and the sudden cessation of motion caused us to stagger, almost into each other’s arms. There was a hectic moment of feathers and body heat and dizziness, and then we both straightened and I stepped away. He let go of my hands.</p><p>“That was even better than last night!” he exclaimed. “I remembered things—how to bank into a turn, how to slip into a downdraft. It all seems so—so effortless. I can’t believe I was afraid before.”</p><p>I couldn’t help laughing. He hardly seemed like the same person I had met a few nights earlier. Maybe it was the moonlight, so enchanted by the sculpture of his wings that it could not resist gilding them with radiance, but he seemed to glow with energy or excitement or hope. Even his skin seemed to hold a faint light. By contrast, I seemed to be hidden in shadows. Even if Corban hadn’t lost his sight, I doubted he would have been able to see me.</p><p>“Excellent,” I said. “The more you practice, the more familiar it will become.”</p><p>But some of his buoyancy faded as his face showed dissatisfaction. “Well, I can’t learn much by flying in circles over the school,” he said. “I have to go farther. I have to fly for longer periods.”</p><p>“Maybe you need to establish routes that you can take from the house to specific destinations,” I said. “Routes that have markers that let you know where you are.”</p><p>He was listening closely. “Yes. For instance, when I fly about ten minutes in that direction”—he pointed straight north—“there’s a distinct noise that I catch whenever the wind blows. It sounds like—clattering.”</p><p>Oddly, I knew exactly the spot he was talking about. I had passed it on my journey to the Gabriel School, and I had convinced the driver to pull over so I could investigate. “It’s an abandoned mine,” I said. “There are four or five collapsed buildings, and an old windmill that once must have pumped water to the surface. Half of the blades are missing, but when the wind blows, they spin enough to hit one of the old buildings.”</p><p>“So I know where I am when I’m over that,” he said. “Then if I can find a landmark that’s nearby, I can go out another few miles—” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And eventually you can fly from point to point to anyplace in Samaria.”</p><p>But that was going too fast for him. He shook his head. “It just doesn’t seem possible,” he said. “So many factors would have to be considered. The effect of the wind—the possibility of being blown off course—the fact that any man-made structure could be destroyed at any time and I would lose my point of reference. I could fly for miles in the wrong direction and be completely lost.”</p><p>I flung my hands in the air. My fingers were practically icicles by now. “Fine! Find reasons it won’t work instead of trying to find ways it will,” I said. “I’m going inside before I freeze to death.”</p> <p>“It’s just that there are obstacles,” Corban argued, following me to the trapdoor and down the stairs. “I want to fly again, but I have to be careful.”</p><p>I went straight to the table where our scraps of dinner remained and gulped down a glass of water. The singing and the arguing had left me parched. “Fine,” I said again. “I think you’re right to take it slowly. But I don’t think you should give up.”</p><p>“I’m not giving up,” he said. “I just need more help. You have to come with me.”</p><p>I almost choked on my last sip of water. “Come with you where?”</p><p>“The next time I fly.”</p> <p>I stared at him, unable to answer.</p><p>Oh, I’d been carried in an angel’s arms before. But not far, and not lately, and not of my own free will. I had no desire to repeat the experience. “No,” I said shortly. “But that’s the right idea. You can go anywhere you want if you bring someone with you to tell you where you are.”</p><p>My words had roused his curiosity; he cocked his head. “You’re afraid to fly with an angel?” he asked. “You? You’re not afraid of anything. And you don’t think anyone else should be, either.”</p><p>“I’m not afraid,” I said stiffly. “Just not interested.”</p><p>“You sound afraid.”</p><p>“Perhaps you’re not as good at reading emotions as you like to think.”</p> <p>“Is it the height? Some people are too petrified to even stand on top of a tall building.”</p><p>“I don’t mind reasonable heights. Corban—”</p><p>“Have you ever flown before? It’s utterly magical. It’s not just being in the air, so high above everything, it’s the speed and the motion and the sense of—of—limitlessness. It seems like exactly the sort of thing you would love.”</p><p>I was silent.</p><p>He knew precisely where I was, though, because he came a step closer to where I stood by the table. “You have flown,” he decided. “And you didn’t like it. Why not? Some angels are careless about the comfort of their human companions, I know. They go too high—they forget how cold it is for mortal flesh.”</p><p>“And certainly you were never one of those thoughtless angels,” I said, hoping my sneering tone would make him drop the topic. “You’ve always been so considerate.”</p><p>But he came closer still, brushing aside my words. “That can’t be it. I can’t see you suffering in silence, even to please an angel. You would have spoken up if the issue was merely discomfort.”</p><p>I set down my water glass, turned away, and began stacking the dirty dishes on the tray. “I’m going to take these down to the kitchen—”</p> <p>He caught my arm and turned me back to face him. His darkened eyes were half closed, as if to aid his other senses in picking up information I didn’t want to impart. “So you were in an angel’s arms, but you didn’t want to be,” he mused. “Maybe you were embroiled in some kind of legal dispute. Perhaps—were you being brought to an angel hold for a trial? Or even a sentencing?”</p><p>Again I refused to answer, but I knew he could feel me trembling. I didn’t even bother trying to pull away; his grip was too tight, and I already knew how strong he was.</p><p>“An adjudication,” he decided. “Your word against someone else’s. What was the accusation? And who was your accuser?”</p><p>“I’ll tell you if you let me go.”</p><p>He smiled, genuinely amused. “If I let you go, you’ll run from the room.”</p><p>“Corban, this is an old story.”</p><p>“But one that still haunts you,” he said. “I want to hear it.” When I still didn’t answer, he prompted, “At least tell me where the trial occurred. If an angel was transporting you, you must have gone to one of the holds.”</p><p>“The Eyrie,” I said reluctantly.</p><p>His eyebrows rose. “And your case was put before the Archangel?”</p><p>“Yes.”</p><p>“Impressive! Who was your accuser?”</p><p>“My employer. A Manadavvi lord who owned property up by Monteverde.”</p><p>“And what was the crime?”</p><p>I took a deep breath. “Attempted murder.”</p><p>That surprised him so much he actually released me. I almost bolted for the door, but I knew it was pointless. Even if I made good my escape, he would just insist on hearing the tale some other day. He would give me no peace until he knew the details—or until I left him, and the Gabriel School, behind.</p><p>I was so tired of running.</p><p>“I tried to kill a man,” I said in an even voice. “And my only regret is that I was unsuccessful.”</p><p>Corban nodded and, to my surprise, pulled out one of the narrowbacked chairs. “I think this is a story I have to hear straight through,” he said, dropping down and arranging his wings behind him. “So why don’t you sit and tell it from the beginning?”</p><p>I slowly took a seat across from him. He poured more water, first for himself, then for me, not spilling a drop. It was the first time I’d wished that Alma had included wine with the angel’s dinner.</p><p>“A few years ago, I got a job working in a Manadavvi household—”</p><p>“From the beginning,” he interrupted. “Farther back than that.”</p><p>Sweet Jovah singing, he wanted to trace the entire route of my life. I grimaced, though he couldn’t see me, and began speaking with exaggerated patience. “I told you. I was an angel-seeker’s daughter, and for years I ran wild on the streets of Monteverde. One day I was begging for bread at a bakery when the owner said she needed extra hands in the kitchen, and if I’d work for my keep she’d train me in a profession. I was smart enough to say yes, and I stayed with her for thirteen years.”</p><p>I shrugged. Dorothea had been practical, honest, exhausted, and not particularly warm; I’d never come to love her, and she’d never loved me. But I respected her, and I learned a lot from her, and I explored every building and byway in Monteverde when I was making deliveries for her business.</p><p>“When she got old enough to retire, she sold the bakery to her nephew and helped me look for another situation. The nephew and I had never gotten along,” I added. Not since I’d kneed him in the groin after he tried to slip a hand under my shirt. “I ended up taking a position in the household of a Manadavvi lord—a good job, anyone would have thought.”</p><p>“But it didn’t turn out that way.”</p><p>“It started out pretty well,” I said. “The pay was good, the work was no harder than I was used to, and I got along with most of the other servants.” I had become particularly friendly with a woman about my age with antecedents even fuzzier than my own. I always assumed Olive was the bastard child of a Manadavvi landowner and one of his housemaids. She had that Manadavvi look to her, all high cheekbones and flawless skin. All the grooms and footmen were wild for her, but she was good at holding them off. It was going to be marriage or nothing for Olive. She didn’t want to go her mother’s route, that was plain; she talked about saving enough money to start her own business in Monteverde or one of the river towns. Actually, we talked about pooling our resources and going into business together. It was the first time I could remember having a dream.</p><p>“I can guess what happened,” Corban said quietly. “The lord took an interest in you, rather forcefully, and you protested.”</p><p>I made a small snorting sound. “Oh, no, I wasn’t built to catch an aristocrat’s eye,” I said. “And I knew how to dress and how to behave so I didn’t get the kind of attention I didn’t want. But another girl—Olive. She was the one the lord couldn’t stop thinking about.”</p><p>We developed the habit of working in pairs, and I at least always kept a knife concealed under my skirts. But Olive wasn’t afraid of him; she didn’t seem to realize he was dangerous. She avoided him when she could, but she didn’t lie awake at night and worry what he might do to her.</p><p>As she should have.</p><p>She also didn’t spend her free hours sneaking around the ancient, labyrinthine mansion, exploring which stairways led where and which servants’ doors opened onto private suites. As I did. There was a day I could have navigated that entire fifty-room house if I had been as blind as Corban. I knew passageways that I swear no one but me remembered. Even the mice had forgotten them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What happened to Olive?” Corban prompted when I had been quiet too long.</p><p>I didn’t want to say the words, didn’t want to remember the scene, didn’t want in my mind, again, those images of horror. So I spoke as quickly as I could. “He brought her to his room one night against her will. She struggled, he reacted, and by the time I found them, she was no longer breathing.” I took a deep breath, because I had somehow run out of air. “By the time I left them, he was bleeding so much that I thought he would surely die.”</p><p>For a moment, the silence between us was absolute. Well, there’s the worst of it, I thought. There’s the truth that defines me. Try to hurt me and I will hurt you back. No matter who you are, no matter how much it costs. And I’m always on guard, waiting for the next blow to fall.</p> <p>I waited in some defiance for Corban’s expressions of disgust and outrage. I realized—much to my fury—that my attitude was tinged with regret. Now he will order you from the room. Now he will never wish to see you again. Who cared? He was an angel, self-absorbed and self-righteous and allying himself with power, like all the rest of them. My story would shock him, I was certain, but not because a Manadavvi lord had committed murder in the name of lust. He would be shocked because a servant girl had thought she had the right to fight back.</p><p>I couldn’t even look at him as I waited for him to denounce me.</p><p>His voice, when it came, was threaded with amazement. “That was you?” he demanded. “You’re the one who cut up Reuel Harth?”</p><p>I risked a quick look at him and saw nothing but astonishment on his face. “You know him?”</p><p>“Knew him. Everyone did. You’ll be happy to know he’s dead now.”</p> <p>I took a quick breath. “Did he suffer?”</p><p>Corban’s mouth opened in a soundless laugh. “Not as much as you’d like, I imagine, but his last three years were unpleasant enough. His face was heavily scarred, you know, from whatever weapon you used. And his reputation was wholly shredded. He was ostracized by Manadavvi and angels alike.”</p><p>“Because he raped a servant girl?” I said scornfully.</p><p>“Because he killed her,” Corban corrected me. “I see you have the lowest possible opinion of Samarian justice, but the Archangel has reasonable ethical standards, and she had never liked Reuel to begin with. She was happy to levy a steep fine and censure him in public—she would have liked to do more, but Reuel wouldn’t confess to the crime and there was no absolute proof that he’d strangled that poor girl. The servants were mostly afraid to give testimony and his wife wouldn’t speak at the trial at all.”</p><p>“I could have told them—” I began in a hot voice, and then abruptly fell silent.</p><p>“Exactly. But the woman who had come to her friend’s aid so dramatically—and who had been brought to the Eyrie specifically to speak accusations against Reuel Harth—somehow disappeared before the trial began.”</p> <p>I crossed my arms and glared at him, but I felt a gaping hole open in my stomach. The Manadavvi lord escaped some measure of punishment because I had run away? Had I been the one to betray Olive after all?</p><p>He answered my unspoken wail of remorse. “It wouldn’t have made much difference, I expect. The fine might have been heavier—the condemnation more sharply worded. But the end result would have been much the same.”</p><p>“Thank you,” I whispered.</p><p>“I always wondered, though,” he said. “How did you get out of the Eyrie? There’s the new road that lets people go up and down the mountain, but it was still under construction when the trial was going on. I assume you weren’t kept under lock and key—but back then, the only way to get off the Eyrie was in an angel’s arms. How did you manage to disappear?”</p><p>“I went exploring,” I said shortly. I was so shaken by the various revelations of the evening that I was having trouble finishing the conversation in a normal tone of voice. “And one day I found this—I can’t explain it—this open shaft in the back of the hold. With a contraption that moved up and down from the top of the mountain to the base. I figured out how to use the ropes and pulleys to ride the thing down to the ground.”</p><p>“Rachel’s escape route!” Corban exclaimed. “Of course! She was Gabriel’s angelica, you know, and she was afraid of heights, so she didn’t like to be flown down from the Eyrie. I’d forgotten that cageand-pulley system even existed.”</p><p>“Well, I found it,” I said. “And then I hid myself in Velora until everyone stopped looking for me.”</p><p>I could tell by Corban’s expression that he was doing a rough calculation. “But that was—what, three years ago?”</p> <p>“Four.”</p><p>“And all this time you’ve been running? Thinking the angels—or the Manadavvi—were still looking for you?”</p><p>“Yes,” I said.</p><p>“And that’s why you’re here. At the Gabriel School. Which, as far as I can tell, is at the very edge of civilized existence. You’re still running.”</p><p>“I suppose.” I was suddenly so tired I could barely muster the strength to answer.</p><p>But Corban was energized. He leaned forward, his face alight. I had the sense he might take my arm again, so I scooted back, out of reach. “Well, you don’t have to hide anymore,” he said. “Reuel’s dead and the angels aren’t hunting for you. You can go where you want. Do what you want. Lead a normal life again.”</p><p>Laughing faintly, I pushed myself to my feet. I figured I’d better leave while I still had the strength to walk home. “I don’t know that I ever led a normal life,” I said. “And I’m perfectly happy at the Gabriel School. All I need these days is a place to rest.”</p><p>He stood up so quickly he almost knocked his chair over. “Wait. I want to ask you—”</p><p>I had headed for the door, but now I pivoted back to face him. “We’re done talking about my life,” I said sharply. “I’ll come back tomorrow, and every day after that, but not if you keep asking me questions. Do you understand? I’ll help you as long as you need me, but if you don’t respect my wishes, I won’t work with you anymore. And if you try to make me come to you anyway, I’ll leave the school. I’m not afraid to run away. I’m not afraid to start over. I’m not afraid of anything.”</p><p>I could almost see the words forming on his lips, something like You’re afraid of things in your past that give you pain. But he didn’t say them. His need for my assistance was greater than his desire to pry into my life. “I won’t ask any questions,” he said quietly.</p><p>“Then I’ll see you tomorrow,” I said.</p><p>If I had had the strength, I would have run from the room.</p><p>CHAPTER 5</p><p>I had to force myself to go back to the Great House the following day. I had tossed and turned all night, torn between hating myself for revealing so much to Corban and experiencing a fierce jubilation at the knowledge that Reuel Harth was dead. I was also haunted by images of Olive’s torn and twisted body, images of Reuel Harth’s blood seeping into the bedclothes, and other memories that I usually managed to stuff to the very back of my mind.</p><p>I closed my eyes against the pictures in my head, turned over on my mattress, and punched my pillow into shape. I vowed never to tell that story again. I was grateful that, when sleep finally arrived, it came unencumbered with dreams.</p><p>I yawned through most of the day, but a growing sense of trepidation made me grow more alert as the sun went down. Even if Corban kept his promise, my confession would lie between us like a sucking swamp. One misstep, one incautious word, and either of us could be pulled back in. Our conversations would be awkward, fraught with knowledge, laced with tension.</p><p>I shook my head and forced myself to stand straighter. Not that our conversations have been easy so far, I reminded myself. He was an angel and I was a servant girl with a violent past. You’re lucky you’ve been able to manage to exchange any words at all.</p><p>My mouth quirked in a bitter smile. I was certainly right about that.</p><p>By nightfall, I was headed back up the hill, bringing a freshbaked loaf of bread from the school kitchen to spare Alma that task, at least. She was up and hobbling around the kitchen, looking as cheerful as I’d seen her.</p><p>“I’m feeling much better,” she assured me. “I even made it upstairs once, though my ankle hurt for the rest of the day.”</p><p>I raised my eyebrows. “That’s very encouraging! Soon you won’t need me here at all!”</p><p>She cast me a quick sideways glance while pretending to keep all her attention on the soup she was measuring into two large bowls. “I won’t, but the angel might,” she said. “He was very pleased to see me when I made it to the top of the steps—until he realized I was me and not you. Then he managed to be polite, but I could tell he was disappointed.”</p><p>It was clear she thought there was more to our relationship than there was. “I’m no angel-seeker,” I said bluntly. “I’m not trying to seduce him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alma was neither shocked nor offended. “I didn’t say you were” was her mild response. “Though I’m not sure such a thing would be bad for either of you.”</p><p>I made a derisive sound. “My life is complicated enough. I don’t need to add the indiscretion of falling in love with an angel.”</p><p>Her smile—so rare and so unexpectedly mischievous—caught me by surprise. “Oh, I don’t know. There’s nothing quite like taking an angel lover. Some things are worth the inevitable pain.”</p><p>My eyebrows could hardly go any higher. “Someday we’ll have to sit down and talk about your interesting past.”</p> <p>Still smiling, she waved a hand to speed me to the door. “Someday,” she said. “Right now, you’ve got more important things to do.”</p><p>I climbed the stairs and entered Corban’s room with a breezy step, determined to pretend as if there had been no wrenching confidences the day before. Evidently he had made the same decision, for he met me at the door with a brisk but friendly greeting.</p><p>“Good, you’re here,” he said, turning immediately toward the central table. “Let’s eat quickly so we can go outside.”</p><p>“This will be a good night for flying,” I noted, some of my tension easing at his reasonable tone. I set the tray down and served us both. “The moon’s still close to full, there’s only a light breeze, and it’s a little warmer than it’s been the past few nights.”</p><p>“I hope you brought a jacket, even so,” he said, spooning up some soup.</p> <p>“Yes, thanks so much for your concern.”</p><p>“Because I want you to come with me when I fly.”</p><p>I suddenly remembered the part of the previous night’s conversation that had led to my emotional confession. I laid down my spoon and said, “I told you, I don’t want to do that.”</p><p>“Yes, I know, you hated it when you tried it, but you have to admit that wasn’t a typical incident,” he said. He was very carefully not specifying why I had been in an angel’s arms once before, and I grudgingly gave him credit for that. “Flying is—an indescribable thrill. And so many mortals never get the chance to experience it. Shouldn’t you attempt it at least once, with someone you trust—to wipe out that old memory, if nothing else? And maybe to find yourself enthralled and delighted? Moriah, don’t you want to go flying?”</p><p>His voice was so passionate and at the same time so pleading that I had to laugh. The pictures he conjured were sorely tempting, but all I said was, “What makes you think I trust you?”</p><p>“Well, I know that I trust you,” he replied, sounding a little hurt. “I’ve had to, these past few nights. I would be distressed to learn you didn’t feel the same about me.”</p> <p>“Oh, that was very good,” I told him. “You practiced that, didn’t you?”</p><p>He grinned. “Not out loud.”</p><p>“Corban, I—”</p><p>“Will you?” he interrupted. “Please? I have to keep pushing myself, testing myself. Maybe, once I get stronger, I can hire someone to be my guide, but right now I’m not ready to do that. You’re the only one who can help me. And I really want to do this.”</p><p>“You’re a manipulative bastard, has anyone ever told you that?” I demanded.</p><p>“No, because I never had to manipulate people back when I could see,” he said. He didn’t seem offended at my insult. “I could just do what I wanted without asking for help. But now you’re forcing me to beg—to humiliate myself—as a kind woman would not do—”</p><p>“You don’t sound humiliated. You don’t even sound humble.”</p><p>“But you’re kind, aren’t you, Moriah?” Now his tone was wheedling.</p> <p>I exhaled an exaggerated, long-suffering sigh. “Let me finish my meal,” I said. “I need to fortify myself against the night air.”</p><p>“Yesssss!” he exclaimed and slapped a palm to the table. Then, in case that seemed too triumphant, he hastily added, “Thank you most humbly. I hope you will enjoy the experience, but I know you’re a little anxious—”</p><p>“Just eat,” I said. “Let’s not waste any more time.”</p><p>Fifteen minutes later, we were back on the roof. I had buttoned my jacket to my throat and pulled on a pair of gloves Corban lent me, but even so, I wasn’t really warm until he picked me up and settled me against his chest. It wasn’t just his body temperature that sent a spike of heat through my blood. It was excitement—amazement—nervousness. Attraction. I’d never been this close to a man and not kissed him.</p><p>“Put your arms around my neck,” he directed. “I’m unlikely to drop you, but that might make you feel more secure.”</p><p>“Unlikely?” I managed to ask, not sounding too breathless.</p><p>I could see his grin in the lavish moonlight. “Well, it’s been a while since I’ve flown with a passenger.”</p><p>“Jovah’s balls,” I muttered, then, more urgently, “Corban, if you’re not sure you’re ready for this—”</p><p>“I’m ready,” he said and leapt into the air.</p><p>I muffled a squeak and tried not to cower in his arms. His whole body was nothing but strain—muscles bunching, wings working, every bone and tendon pulling skyward. I didn’t see how he could do it, didn’t see how he could possibly lift from a stationary position to an upward arc, carrying a heavy burden, and it was all I could do not to bury my face against his chest so I wouldn’t have to watch as we tumbled headlong to the ground. But the powerful wings drove down, sending great gusts of air all around us, and suddenly we were clear of the roof, we were suspended above the dark sprawl of the school, we were high over the narrow snake of the road, we were flying.</p><p>I wrapped my arms more tightly around Corban’s neck and gazed around in rapt astonishment.</p><p>The world had never seemed so strange or wondrous. The ground below was a patchwork of variegated textures—corrugated forest, silky sand, a linen weave of grass. Everything was shadowy and mysterious, only half illuminated by the spectral moonlight. It was a landscape from a dream, unreal and beautiful.</p><p>“Oh, Corban,” I breathed.</p><p>“Not so terrifying after all, is it?” he replied.</p><p>“It is terrifying—but in a wonderful way,” I said. “I can’t explain it.”</p><p>“You don’t have to,” he said. “I know.”</p><p>He canted to one side, dipping his left wing, and suddenly the winding ribbon of the road disappeared. “Wait,” I said, slightly panicked. “I haven’t been paying attention. Don’t go so far. I have to keep track of where we are.”</p><p>He leveled out, lower to the ground, and spoke in a soothing voice. “We haven’t gone very far yet. Even if we had to land and try to get our bearings, we would only be a mile or so from the house. Do you see anything you recognize?”</p><p>“Turn around. Back that way. No, that way. If I could find the road—”</p><p>In less than a minute, it reappeared and I let out a sharp sigh of relief. “All right, let’s go back to the school so I’m sure I know where we are. And then we can set out for someplace else. The wreck of the old mine?”</p><p>“The ocean?” Corban said.</p><p>“Not tonight,” I said. “It’s too far away, and I’m still getting used to this.”</p><p>He seemed disappointed. I waited for him to try to cajole me, but he had promised not to disregard my comfort, and so he acquiesced. “Some other night, then,” he said. “Where are we now?”</p><p>“Back over the school. Turn to your left and you’ll be facing straight north. Can you find the mine from here without my assistance?”</p><p>“Yes,” he said and plunged through the unresisting air.</p><p>For this short flight, I didn’t need to watch for landmarks. The northbound road stayed always on our left, a comforting and reliable presence. Faster than I would have believed possible, we were close enough to hear the eerie, intermittent sound of the old windmill slapping against the broken roof of the collapsed mine. Corban hovered directly above the wreckage, and I peered down in fascination at the angles and splinters of the abandoned buildings.</p><p>“So when you’re here, you can still catch my voice from the roof of the Great House?” I said.</p><p>“I can’t actually hear you this far out,” he admitted. “But I know the approximate direction I have to go to return, and once I’ve flown for about five minutes, I can pick up your voice.”</p><p>“How do you know which way to come back? I would be wholly turned around if I couldn’t see the ground.”</p><p>I felt his shoulders move in a shrug. “It’s automatic, I suppose. I’m always aware of which direction the wind is blowing. If it’s at my back when I fly out, I know it needs to be in my face when I return.”</p><p>“But the wind shifts.”</p><p>“It does, but the general pattern is stable enough to steer by.”</p><p>“We should put something on the roof of the Great House that makes noise all the time,” I said. “Bells, maybe. Chimes. Something that could guide you back if I wasn’t there.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why wouldn’t you be there?”</p><p>“I’m just trying to give you more options. Something else to rely on.”</p><p>He didn’t answer, but I could tell he didn’t like the idea. It was odd to think he trusted me so much he was not interested in investigating substitutes.</p> <p>“Show me how well you can get back without any direction from me,” I said after a moment of silence. “And let me know when you think we’re close to the house. I want to see how accurate your sense of distance is.”</p><p>“Not yet,” he said. “Let’s go a little farther out. I want to see if there’s another point I can find once I make it this far.”</p><p>I wasn’t positive this was a good idea, but I saw the look of concentration on his face and decided to keep quiet. Corban took a moment to assess something—the feel of the wind, maybe—and then drove his wings down hard enough to gain altitude. I could still see the road from this height, which kept me somewhat relaxed. He leveled out and began flying steadily in a more or less northern direction. I kept my eyes trained on the ground, looking for landmarks, which were mighty sparse in this rocky, sandy, barely habitable stretch of northeastern Samaria. Corban drifted slightly to the west, which was fine by me; we crossed over the northbound road, but it was still visible on my right. I knew that as long as I never lost sight of it, we could always find our way home.</p><p>We had been flying for perhaps twenty minutes when Corban began turning his head from side to side like a hunting dog trying to catch an elusive scent. “Something’s changed,” he said.</p><p>I listened as hard as I could, but I couldn’t hear anything except the rhythmic sweep and gather of Corban’s wings. “You must have the sharpest ears in the country,” I commented.</p> <p>“It’s not a sound, it’s a—temperature. And a change in air density.” He jerked his head toward the left. “What’s over there?”</p><p>I slewed around in his arms to peer at the western horizon, which was dense with unrelieved night. “Nothing. Just darkness and shadows and—oh! The mountains!” I squirmed, trying to get a better look at the solid blackness. “We’re almost at the Caitanas. That’s why the air feels different.”</p><p>“The Caitanas,” he repeated, sounding pleased. “I could follow them all the way up to Windy Point. I’d know where I was then.”</p><p>Windy Point was an old angel hold that Gabriel had destroyed shortly after the god had brought down the mountain. It certainly must have been exciting to live in the days when Gabriel was Archangel. “It doesn’t exist anymore. How would that help you?”</p><p>“The hold was leveled, but pieces of it remained intact when they were blasted off the mountain,” Corban said. “You know why it was called Windy Point, don’t you? Because it was this drafty old cave and every time the wind blew, you could hear it moaning through the walls. Even now, if you’re right over the peaks where the hold used to be, there’s a constant whistling and shrieking. Really spooky the first time you hear it.”</p><p>“Sounds unnerving,” I agreed. “But Corban, it has to be sixty or seventy miles from here. I’m not sure you have the strength to go that far in one trip.”</p> <p>I felt his muscles cord with silent dissent, and then he made a little sigh of agreement. “You’re right. It’s too far, at least right now. But maybe in a few days—”</p><p>“Or a few weeks.”</p><p>“We can try it.”</p><p>“It’s a good goal,” I said. “But I just realized something.”</p><p>“What’s that?” he asked. He had dipped his wing down again and was making a long, lazy loop to turn us back in a southerly direction. I was impressed; he seemed to have accurately gauged where the mountains were and how to retrace our route.</p><p>“You need to live in a place where there’s a steady, dependable source of sound so you can always find your way home. Right?”</p><p>“Well, I don’t want to live in the wreckage of Windy Point, if that’s what you’re suggesting.”</p><p>“No. But there is a hold in Samaria you could always get back to if all you needed was music.”</p> <p>He was silent a moment. “The Eyrie,” he said. “I hadn’t thought about that.”</p><p>I had lived at the hold for nearly a week as I awaited my trial and went exploring its curving gaslit hallways. There was an open central plateau where someone was always performing music—an angel singing a solo, a small choral group offering harmony, a few flautists trying out a requiem someone had written just that morning. Apparently they all signed up for shifts to ensure that there was never a moment of perfect silence at the hold. I had expected to find the incessant music annoying—just another example of angels flaunting their superior talents—but instead I had found it comforting. There were days I had actually wondered what it must be like to live there and feel welcome, from time to time, to join the others in an impromptu concert.</p><p>But I hadn’t stayed long enough to find out.</p><p>“Well, it seems like the perfect place for you,” I said. “And you could find some nice young angel-seeker who’d fly with you whenever you wanted to leave.”</p><p>“That makes it an even more appealing notion,” he said dryly. “I’ll have to give it some consideration.”</p><p>I pretended to laugh, but the truth was I felt a little sad. Not that I had ever expected this strange midnight relationship with the blinded angel to last more than week or two, but it was the most interesting, the most enjoyable interlude I had had in years. I would be sorry to see him go. Sorry to see my life return to its usual parameters of drudgery and defensiveness and worry.</p><p>Well, at least I could cross worry off my list of activities. Among the gifts Corban had bestowed upon me was the knowledge that Reuel Harth was dead and the angels didn’t want to apprehend me for crimes against him. I could leave the Gabriel School, if I wanted. I could travel anywhere, look for any kind of work. I could live, as it seemed I had not for so long, in the light. It shouldn’t matter that an angel was unlikely to be beside me.</p><p>Ridiculous to even entertain those thoughts. I gave my head a tiny shake and concentrated on the landscape below. “Do you know where you are?” I asked Corban.</p><p>“I think so. Another few miles and then I turn to my right to find the mine.”</p><p>“Good. I won’t say anything unless you ask for my help.”</p><p>But he didn’t. He made the broad, easterly turn a bit earlier than I would have suggested, but soon enough, the road was within view again, and not long after that, we could hear the familiar clatter of the windmill. Corban spent a few moments circling the mine site, and I realized the percussion of the blades must sound slightly different from different vantage points, because he obviously was trying to orient himself according to their noise. But soon enough he had the cues he wanted, and he set off southward on a course perfectly parallel with the road.</p><p>We were within a half mile of the house before he showed indecision. “By this point, I’ve usually been following your voice for ten minutes, so I haven’t needed other markers,” he said. “I know I’m close, but I can’t find the house without help.”</p><p>“Still, I’m impressed by how you’ve managed so far,” I told him. “Just keep going in the same direction—drop a little lower—we’ll be there in a few moments.”</p><p>It was clear that he found it much harder to judge his distance to the roof when I was in his arms than when I was on the surface and he was navigating by the sound of my voice. He came down harder than either of us expected, and almost tripped on one of the pipes, so there was a dizzy moment of both of us stumbling and trying to catch our balance before we finally came to a complete halt.</p><p>“Definitely a good idea to install chimes,” I said breathlessly. “Maybe string them around the whole perimeter so you know exactly where you can land.”</p><p>“Something to work on for another day,” he said. “So did you like it? Wasn’t it magnificent?”</p><p>“It was amazing,” I said. “I can’t imagine an experience to compare. You must have missed flying very much.”</p><p>“More than I realized. To think I’ve gone two years without it—” He shook his head and then spoke in a deeper tone. “And I have you to thank for making it seem possible again.”</p><p>Oh, no; I still was not interested in the angel’s earnest gratitude. Heartfelt has always been a word that made me shudder. “And to think, I was only trying to irritate you by insisting you should try to fly,” I said lightly. “I wonder if I’ve done this much good all the other times I was being difficult and annoying.”</p><p>He laughed, but I could see a look of puzzlement on his face. Or maybe it was speculation. Why does Moriah always turn the subject when I try to be serious? “I doubt it,” he said. “You’re annoying so often. The odds aren’t in your favor.”</p><p>Now it was my turn to laugh. “I’ll be back tomorrow—with a compass, if I can find one,” I said, heading for the trapdoor. “Then we can go where we like.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’ll be waiting for you.”</p><p>I spent the next three nights flying with the angel.</p><p>I’ll be honest, I could have been dreaming for every minute of those excursions. Who sees the world from such a perspective, barely lit by moonglow, decorated with slabs of stone and stands of miniature trees and the occasional lonely flicker from an isolated homestead? None of it seemed real, not the landscape, not the motion, not the fact that I was held against an angel’s heart. And if it was not real, I might as well enjoy it, might as well let my wonder well up unimpeded, my delight spill over without reservation. I might as well drop my usual guards, cast aside cynicism and suspicion. I might as well look around me with a childlike sense of awe.</p> <p>One night we flew south, above the desert, where the sands unrolled below us as if they stretched, empty and untouched, to the end of the world itself. Once we flew west, above the uneven hump of the Caitanas with their sharp, stark points. Even I could feel the cooler air rising from their stony peaks as if exhaled by the mouth of a chilly god.</p><p>Once we flew east, just to the edge of the ocean, where the restless waves rushed back and forth over a narrow stretch of beach, roiling the sand, then smoothing it clean. The wind was stronger here than at any other place during our travels. Corban found it harder to hold to a steady hover; instead, he was pushed in all directions by its mercurial currents. I actually found myself afraid, during a particularly energetic gust, that he would be tossed against one of the rocky overhangs or dashed into the water. I clung to his neck and cried, “Fly back toward land!” He nodded, pushed himself upward to gain altitude, and retreated from the shoreline. We decided there was no need to make that particular journey again.</p><p>I had collected a few musical oddments from around the school—ancient, rusted bells from a festive horse bridle; something that looked like a nautical buoy; and a set of glass chimes whose connecting strings had rotted straight through—and I repaired them and set them up around the perimeter of the roof. It didn’t take much wind to set any of them in motion, and Corban agreed that these would serve to guide him home if he ever took off without me.</p><p>“Though I don’t know why I would,” he said as we returned from our outing to the sea.</p><p>“Well, maybe you’ll accidentally drop me some night, and you’ll have to make your way back here by yourself,” I said.</p> <p>“I won’t accidentally drop you,” he exclaimed. “And if I did, I’d come down to find you instead of returning here.”</p><p>“Well, that’s good to know,” I said.</p><p>I had opened the trapdoor, and enough light spilled out to let me see him shaking his head. Why can’t Moriah ever be serious? “Of course, I might throw you to the ground some night when you’re being particularly exasperating,” he said, following me down the stairs.</p><p>“Oh, you’d have done that long before now if you were going to,” I said cheerfully. “You’ve gotten used to me by now.”</p><p>“I don’t know—does anyone really get used to you?”</p><p>I laughed. “I’ll have to think that over.”</p> <p>“So, where shall we go tomorrow night? I think we should head north again—past the mine, toward Windy Point.”</p><p>“Maybe,” I said. “But the moon’s already only half full. It’s getting smaller and rising later, so it’s harder for me to see landmarks. We might have to stay close to home for a while or risk getting lost.”</p><p>His face showed a quick frown. “If you’ve got the compass—”</p><p>“Which I also can’t see in the dark.”</p><p>“Well, maybe we don’t need you to see. If we go to the mine and north from there, I think I can find my way.”</p><p>“In which case, you don’t need me anyway,” I said.</p><p>His frown deepened. “Of course I need you,” he snapped. “I think I know where I am, but I could easily miscalculate.”</p><p>“We’ll see,” I said. “But we might have to stay close to home and fly for strength, not distance, until the moon starts waxing again.”</p> <p>“Very well,” he said reluctantly. “We’ll talk about it tomorrow.”</p><p>But we didn’t talk about it the next day, because everything changed; and a few days after that, everything changed again.</p><p>CHAPTER 6</p><p>Over the past four days, I had continued to spend a few hours in the kitchen, though now I went in early enough to help with the work of preparing dinner. I rarely encountered Rhesa, but I guessed she had complained incessantly to Deborah, because within two days the head cook was asking me when I thought Alma would be well enough for me to resume the overnight shift. I knew Corban was not yet ready to announce his existence to the rest of the world, but pretty soon I would either need to return to my old post or lose my job. Or explain exactly what was taking up all my time at the Great House.</p><p>The day after the flight to the ocean, all those options were put on hold. I made my way down to the kitchen in midafternoon to find the place in chaos. Deborah was the only cook in evidence, though she was attended by a small army of students who were rushing between stove and table and pantry, trying to do her bidding.</p><p>“No, not the clotted cream—sweet Jovah singing, don’t you even know what milk looks like? Yes—that jar there. And yes, I meant the potatoes, not the turnips! Moriah! Thank the good god you’re here. I was about to send someone to wake you up.”</p><p>“What’s going on? Where are the others?”</p><p>“Sick. All of them. With something”—she patted her stomach—“that has made them vomit through the night. And about twenty of the students have come down with it as well.”</p><p>“Oh, no,” I said. “I suppose everyone will get it eventually.”</p><p>“I suppose,” she said. “But as long as we’re healthy, we need to do the work of four. I’ve already sent a note up to Alma saying that you can’t be spared tonight.”</p><p>I put on an apron. “Obviously not,” I said. “Let’s get dinner ready.”</p><p>The illness made its way quickly through the school. About half the students and three-quarters of the staff succumbed over the next few days, though most of them recovered after a couple of bad nights. But two older men, one a teacher and one a handyman, couldn’t seem to shake it. They came down with a fever as well as the stomach disorder, and they languished on their beds, refusing to eat or drink.</p><p>Judith, who had some healing skills, had turned nurse the minute she recovered enough to get out of bed. I had no interest in tending the patients, but I didn’t mind doing the extra laundry and scrubbing down the sickrooms.</p><p>“I’m worried about David,” Judith told me on the afternoon of the third day. We were folding what seemed like a thousand towels that had just come through the wash. “Jonathan’s beginning to improve, but David is getting worse, and I’m almost out of drugs to give him.”</p><p>“Maybe we should hoist a plague flag,” I suggested. People in settlements all over Samaria would catch the attention of angels flying nearby by raising distress signals—called plague flags, though it didn’t really matter what disaster they portended. “Ask an angel to pray for more medicine.”</p><p>“I thought of that,” she said. “But I don’t know that anyone would see it. We’re so remote here—and most of the angels are likely to be headed for the Plain of Sharon.”</p><p>Startled, I did a quick calculation. Spring had tiptoed to the border of winter while I had not been paying attention, and the equinox was almost here. “You’re right! It’s less than a week till the Gloria.”</p><p>“So I don’t think we can expect help from any angels,” she ended with a sigh. “I’ll do what I can for him.”</p><p>I didn’t answer as I continued to fold linens. I wondered if Corban would be willing to sing a prayer to Jovah if the situation was dire. I didn’t know much about it, but I believed angels usually offered their prayers from a high altitude, and Corban had never gone too far off the ground since he began flying again. I didn’t know if he was afraid of the winds or the disorientation, but I had to confess I didn’t like the idea of getting way above land, either.</p><p>Meanwhile, since that first week when I had spotted him on the roof of the Great House, I hadn’t heard him sing a note. That was odd, because angels were all steeped in music; they couldn’t live without it, or so it seemed. Corban had told me he composed songs in his copious free time, but I’d never heard him play, either. I wondered if he had abandoned music in a bitter response to the god he thought had abandoned him.</p><p>But surely if he thought a man’s life was at stake . . .</p><p>I decided that, if David took a turn for the worse, I would ask Corban if he was willing to petition the god. And if he said no, I would mock him and shame him until he agreed. And then he would fling himself aloft and offer his prayers to Jovah and be successful and feel proud of himself and fall in love with me because I always pushed him beyond his fears—or he would be tumbled off course by a swift, unfriendly wind, and fail to sing a note, and return to land full of doubt and self-loathing and never wish to speak to me again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Well, then. Always something to look forward to.</p><p>I was still asleep early the next morning when there was a frantic pounding at my door and the sound of someone calling my name. My schedule had changed again during this time of illness, so I had gone to bed around midnight, but I still was not ready to rise with the sun.</p><p>“Moriah! Come quickly! He’s gone!”</p> <p>For a moment, I didn’t recognize the woman’s voice and couldn’t think who he might be or why I would care if he was missing. But I dragged myself out of bed and opened the door to say “What?” in an aggrieved tone.</p><p>Alma stared at me, her lined face a study in worry. “Moriah, Corban’s not in his room. I don’t know where he could be.”</p><p>Instantly I was wide awake and flooded with fear. “Jovah’s balls, he went out on his own,” I whispered. “Let me get dressed.”</p><p>Five minutes later, looking a fright, I brushed past an interested crowd of observers in the hallway and towed Alma down to the ground level of the dorm. I declined to answer the questions tossed out by a handful of students and staff. What’s going on? Who’s missing? I glared at a few people and they eventually stopped trailing behind us as I pulled Alma all the way to the stable. I noticed she walked with a slight limp, but she kept up with me well enough.</p><p>Once we were inside the stable, I turned to Alma. I was so full of fear that most of my breath had been squeezed out. It was hard to appear calm, hard to speak, but I focused fiercely on figuring out what I should do. “When did he leave?” I asked.</p> <p>She looked bewildered. “I don’t know. He was there when I brought him dinner last night, but gone when I went up with his breakfast this morning. I didn’t even hear him come downstairs.”</p><p>I shook my head. “He didn’t. He’s been practicing flying. He left from the roof.”</p><p>“Flying? But he can’t see!”</p><p>“He navigates by sound.” I paused, pressing my lips together to hold back a whimper of terror. “Or with my help. I suppose he got tired of waiting for me and decided to see how far he could get on his own.”</p><p>“Dear sweet Jovah,” Alma whispered. “He must have gotten lost—and come to ground somewhere—how will we ever find him?”</p><p>That was clearly the question. “I think—it seems likeliest—he would try to make it to the place he can always find. The old mine up the road. I’ll go there first and then make wider circles around it until I find him.”</p> <p>“I’ll come with you,” she said.</p><p>I hesitated, but if Corban was seriously injured, I’d never be able to get him back here on my own. I was already debating whether I would bring a wagon or merely saddle a horse—it would be easier to cover ground from horseback, but impossible to bring back an injured angel without a wagon.</p><p>“All right,” I said. “I’ll hitch the horses. You get supplies. Food and water and maybe some bandages. Meet me at the gate as soon as you can. Don’t tell anyone where we’re going.”</p><p>She paused long enough to give me an incredulous look—It will be hard to keep the angel a secret once we bring him back in a wagon—but just nodded and hurried off.</p><p>In less than fifteen minutes, we were on our way, heading north on the rutted road. I tried to block from my mind all the horrifying images that clamored to get in, pictures of the angel bruised and broken on the open ground, bloodied and unconscious on a peak in the Caitanas, adrift on the ocean, his great wings spread like seaweed along the surface of the water. How could he have been so reckless, so stupid? Damn arrogant angels, they think just because they want something, they can reach out their hands and take it, I thought angrily. They don’t have to wait patiently, like ordinary men, or obey the laws of the physical world.</p><p>But they did. They did.</p><p>We were probably still a mile from the mine when I started shouting Corban’s name. If he was alive, if he was conscious, he would be able to hear me from a fair distance and call back. When I paused to give my throat a rest, Alma lifted her own voice. “Angelo! Angelo! Where are you?”</p><p>About an hour after we set out, we approached the ruins of the mine. I pulled the wagon over so Alma and I could jog over to it through the sandy soil. It was immediately clear how Corban might have lost his bearings here. Sometime in the past week, the elements had wreaked additional damage to the fallen buildings; the windmill had wholly collapsed. There was no longer any rhythmic tapping noise to tell Corban he had arrived at his destination. He must have flown confidently in this direction, been puzzled at the missing sound, wondered if he’d misjudged his route, turned around, tried to get back to the house, felt a rising self-doubt that made him question any choice he made, and ended up thoroughly lost. He could be anywhere within a five-mile radius.</p> <p>“Corban!” I shouted, but there was no answer.</p><p>“Are you sure this is where he came?” Alma asked.</p><p>“I’m not sure of anything.”</p><p>I thought for a moment. It seemed likelier that he had overshot the mark than undershot it—anyway, if he was behind us anywhere along our route, he would have heard us calling. I hoped. “Let’s go north,” I said. “At least another five miles.”</p><p>She nodded, and we returned to the wagon. I drove more slowly for the next hour as we peered around, both hoping and fearing to see a crumpled ball of feathers lying along the side of the road. I had given up the notion of shouting his name and now I began singing, hoping the sustained, persistent notes would catch his attention even if he was in a groggy, hallucinatory state. After a few moments, Alma added her voice in a sweet alto harmony. Without conscious thought, I had opened with another Manadavvi ballad, and I raised my eyebrows when it turned out she recognized it. She shrugged and smiled and kept singing.</p><p>Just as I was wondering if it was time to widen our search east or west, we heard a voice cry out my name. I jerked on the reins and we both fell abruptly silent, listening hard. There it was again, faint and exhausted. Moriah!</p><p>My heart leapt. Praise be to Jovah, at least he was alive. “Corban!” I shouted, throwing the reins to Alma, grabbing a flask of water, and jumping out of the wagon. “Keep calling me! I’m on my way!”</p><p>His voice came from the eastern side of the road along a stretch that had mostly shaken off the sand of the desert and arrayed itself in stunted trees, prickly bushes, and a hardy vine that covered soil, stone, shrub, or tree with an utter lack of discrimination. Not the worst place for an angel to come down in an uncontrolled fall, though I tripped a half dozen times on a leafy runner or a tree root. “Corban!”</p><p>It was five minutes before I found him, huddled in the stippled shade of a squat tree just now unfurling its pale green leaves. His wings drooped behind him, so flat you could mistake them for a cloak thrown behind his shoulders, and his legs were thrust straight out on the grass. Not until I was close enough to see his face could I make out the scratches and bruises on his skin. But I didn’t see any gouts of blood, any sticks of bone protruding through the flesh. He’d made a rough landing, maybe, but not a disastrous one.</p><p>I skidded to my knees beside him, grabbing his shoulders in a shaking grip. “Corban, are you all right?” I demanded.</p><p>His hands came up to lock over my wrists. “Moriah, you found me,” he said in a whisper. And then he burst into tears.</p><p>I had never in my life seen a man cry.</p><p>No one has ever come completely undone in front of me; no one has ever been willing to display, before my cynical eyes, ungovernable weakness or need. I had seen this angel hurt and angry, I had spied on him in his despair, but I had not realized he could be so vulnerable as to weep in my presence.</p><p>Without another word, I took him in my arms and drew his head against my breast, comforting him as best I could with the soothing words I had never before had cause to use.</p><p>It was a moment before his own words came, halting and disjointed, muffled against my jacket. “—But I couldn’t find it—and then the wind came—and I was lost and I didn’t know—but I thought I could get back—but there was no sound, it was gone. And I was afraid—Moriah, so afraid—”</p><p>“Sshhh,” I said, patting his head, where the long curls were knotted from a rough wind and a night in the open. “Here. Have some water before you tell the rest.”</p><p>He took a ragged breath. “I’m so thirsty. Thank you, thank you—”</p><p>I didn’t speak again until he had practically emptied the flask with quick, greedy swallows. “You must try to compose yourself,” I said, my voice more brisk. “Tell me how badly you’re hurt. Alma and I came in a wagon and we can—”</p><p>“Alma’s here?” he demanded, sitting up straighter and actually wiping his sleeve across his nose. I had never seen him make such an inelegant gesture. “Where?”</p><p>“I left her with the horses. She’s the one who let me know you were missing, so you must be properly grateful to her. But the road is a little distance that way. Can you walk?”</p><p>He took another shaky breath. I could see him trying to impose an iron calm. I wondered how much practice he’d had doing that during the darkest days after his blinding, how often he had let himself give in to grief before pulling himself back together. Not often, I guessed. “I don’t think anything is broken,” he said. “I came down hard, but I didn’t crash. But I didn’t have any idea where I was—or how to get back—” He pressed his lips together. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“The windmill has fallen over completely—that’s why you couldn’t hear it,” I said. “Even so, you’re not too far away. You did a good job navigating with absolutely no clues.”</p><p>“I didn’t think you’d be able to find me.”</p><p>“Well, I did,” I said. He was still holding on to me with one hand, so now I stood and drew him up beside me. He was unsteady for a moment, but didn’t cry out in pain and fold back to the ground, which I took as a good sign.</p> <p>“What about your wings?” I said, for they still hung behind him, limp as laundry. “Were they injured?”</p><p>He shook his head and spread them out to their fullest extent. I saw a few bent quills, a couple of patches where the feathers might have been scratched off by an overeager branch, but from what I could tell, he was remarkably unscathed. If he’d been able to figure out which way to go, he could have made his way home.</p><p>“We brought the wagon in case you were hurt,” I said. “But if you want, we’ll just drive it back to the school, singing the whole way. You can take flight and follow us home.”</p><p>He gathered his wings tightly behind him and shook his head. “I’ll ride,” he said in a quiet voice. “I’m never flying again.”</p><p>It was, of course, a cause for goggling eyes and disbelieving cries when Alma and I returned to the Gabriel School with the angel hunched in the back of the wagon. He had accepted the food we’d brought and gratefully finished off a second flask of water, but once we had gotten under way, he had refused to speak in anything but monosyllables. It was a return to the depressed, despairing Corban I had met two weeks before, and I was not sure I would be able to jolt him out of his melancholy a second time.</p> <p>And obviously, this was not the day to try.</p><p>I pulled over when the school was just around the next bend. “It’s broad daylight, and people will be watching for our return,” I said. “Would you like us to leave you somewhere safe until nightfall, when I’ll come back for you?”</p><p>His arms rested on his updrawn knees, and his face tilted downward as if he were staring at the floorboards. He shrugged. “I don’t care.”</p><p>I glanced at Alma. “You don’t care if everyone sees you being helped from the wagon? If everyone knows that there’s an angel living in the Great House, and that he’s broken?”</p><p>I used the word deliberately, but he barely flinched. “No.”</p><p>“Corban, are you sure? It’s no trouble to come back for you after sundown.”</p> <p>“I’m sure,” he said, and slumped back against the side of the wagon. He didn’t speak another word for the rest of the drive.</p><p>I stopped again at the front of the Great House and let Alma help him up the shallow stairs. I kept my hands lax on the reins and most of my attention on the school grounds, where an afternoon break meant dozens of students and ten or twelve teachers were milling around outside, playing games, enjoying the spring sunshine, and watching the angel stumble into the house. Most of them looked from me to the angel and back at me.</p><p>I sighed and tsked at the horses, guiding them downhill toward the stable. I didn’t feel up to the exclamations and the demands for information and the repeated protestations of amazement. Despite the fact that I was unspeakably relieved that Corban’s adventure had been no worse than it was, I felt as listless and exhausted as the angel himself.</p><p>I didn’t see Corban for four more days. I did try. I took supplies up to the Great House once a day, paused to speak briefly to Alma, then headed up the stairs to knock on the angel’s door. Then I kept knocking, sometimes for ten minutes or more, until he called, “Go away!” By that, and the fact that he continued to swap the breakfast and dinner trays Alma left on a table outside his door, I knew he was still alive.</p><p>I had managed to give the thinnest possible explanation to Deborah and my fellow cooks. I knew there was a sick man in the house, but I didn’t know it was an angel. Yes, I suppose he must have been there for weeks. No, I don’t know what’s wrong with him. No, I don’t know what happened when he tried to fly. Yes, it certainly is a tragedy.</p><p>They kept asking questions, but I never volunteered more information. Besides, I didn’t see the other workers too often, because I was back on the solitary overnight shift. Most of the staff and students had recovered from the first wave of the stomach sickness, but now the disease was making the rounds for a second time, and Rhesa was among those who succumbed. I didn’t mind resuming the night duties while she lay on her bed, fevered and miserable. The schedule suited me well enough—and afforded me the greatest freedom.</p><p>On that fourth night, all my chores done and the bread prematurely mixed and kneaded, I took off my apron, crept out of the school, climbed the hill, and quietly let myself into the Great House. The door to Alma’s room was closed, though I wouldn’t have put it past her to be lying awake, listening for my footsteps. You should come back some night, she had said just the day before. Make him talk to you. She hadn’t gone so far as to say she would leave the door unlocked, but she had left the chain off. It had been simple to get inside.</p><p>The harder task would be making it through the door at the top of the stairs. I knocked for a few minutes, not expecting an answer, and I didn’t get one. So I set the lamp on the table and picked the lock, which yielded without a fight. Then I retrieved the lamp and stepped into the room.</p> <p>Corban stood in the center, his body tense, his wings quivering behind him in visible indignation. He looked wretched—his clothes disarrayed, his hair unkempt, even his face unshaven. The room was a mess, with clothes littered across the floor, a few plates stacked on a corner table, the cello on its side as if it had been kicked over. All that was missing was the smell of alcohol and vomit, and he would have been entirely dissolute.</p><p>It was clear he was not going to speak first. I took a moment to survey the room. “Well,” I drawled finally, “I see you managed to control your frustration with your usual genteel restrain.”</p><p>His hands balled into fists and he took a step forward. “Yes, your mockery is all that’s been missing during my week of agony.”</p><p>“It hasn’t been a week,” I said. “It’s been four days. Have you lost your sense of time along with your pride?”</p><p>The anger on his face deepened. I could see he was fighting the urge to respond. My guess was he had promised himself he wouldn’t speak at all, and he hated me for goading him into one unwary reply already. Oh, but I had just begun.</p><p>“I swear, I’ve never met anyone worse than you at coping with adversity,” I said. “The slightest setback, and you instantly stop trying.”</p><p>“The slightest setback?” he demanded. “I fell from the sky! I could have broken my neck—been paralyzed—even killed! It was catastrophe, not—not inconvenience.”</p><p>“As far as I’m concerned, if you’re not dead, you have no excuse for giving up,” I said.</p><p>“Oh—that’s right. I want to take advice about moral courage from the woman who tried to murder a man and then spent the next four years running from the crime.”</p><p>I had expected him to throw that in my face; I was braced for it. So I laughed, which only infuriated him more. “Well, at least my instincts for survival are well honed,” I said. “Unlike yours.”</p><p>“You don’t understand—you’ve never understood,” he exclaimed, losing a little more of his self-control. He gestured broadly. “Flying was my life. If I cannot fly, I cannot be any of the things I was meant to be! I’m useless! I don’t care about survival because there’s nothing to survive for.”</p><p>“Well, I’ve never had much use for angels, but surely you could find some constructive way to pass your time,” I said unsympathetically. “There are plenty of blind people who make lace or throw pots or weave fabric or sort objects or do any number of valuable tasks.”</p><p>He gaped at me as if he could not believe even I could be so insensitive. I grinned and went on. “But surely you have some more specialized skills! You’re a musician. Can’t you teach singing or playing? There’s a whole school of young people just down the hill. Start a class. You might discover a prodigy.”</p><p>“I have little aptitude for teaching,” he ground out.</p><p>I remembered that he had been blinded while teaching a young angel how to sing the prayer for thunderbolts, so I abandoned this tack. “Well, then,” I said in a considering voice, “what else could you—I know! Aren’t angels desperate to populate the world with more little angels? Couldn’t you hire yourself out as a sort of stud service?”</p><p>It was the most outrageous thing I could think to say. His face went slack with shock, but he was too affronted to answer.</p><p>“We could bring girls in from the holds,” I said in an inspired tone. “Cedar Hills is the closest, of course, but angel-seekers would come from the Eyrie and Monteverde, too, if they knew they didn’t actually have to vie for your attention. You’d just give them each an appointment—an hour, a half hour, whatever you were comfortable with—then send them on their way.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s the crudest thing I’ve ever heard anyone say.”</p><p>“Really? But it seems so practical! You have a—well, I won’t exactly call it a talent—you have a commodity, and many people desire it, and you could find some worthwhile purpose in your life by exploiting it. I don’t see the drawbacks.”</p><p>“You’re so vulgar,” he said and turned away.</p> <p>I came close enough to put a hand on his arm, but he kept his back to me. “Are you shy? Is that it? Out of practice? There are a couple of workers down at the school who used to be angel-seekers, unless I miss my guess. I’m sure one of them would be glad to help you through the awkward parts.”</p><p>Now he swung around to face me again. “And who else at the Gabriel School used to be an angel-seeker?” he flung at me. He was angry enough now that he wanted to hit back, and hit back hard. “You? Did you try bedding angels when it turned out your friend was the only one who could catch the attention of a Manadavvi lord?”</p><p>I gasped, and then I slapped him so fast I wasn’t even aware of forming the intention. He grabbed my wrist before I could strike him a second time. He twisted me closer, my arm bent against his chest so I could not get leverage to punch him with my other hand; his grip was astonishingly strong.</p><p>“That’s obscene,” I panted. “Reuel Harth was a murderer.”</p><p>“But you don’t deny the secondary charge,” he purred. “So you were an angel-seeker—either before or after you had your adventures at the Manadavvi compound.”</p> <p>“Oh, no, I wasn’t,” I spat out at him. “I find you all worthless and weak, despite the fact you think you’re gifts straight from Jovah’s hands. Until I met you, I never wanted to speak to one of you, let alone take one as a lover—”</p><p>“And now that you’ve met me?” he whispered. “You want me as a lover?”</p><p>“That’s not what I meant to say—”</p><p>But it didn’t matter what I meant to say. He jerked me even closer, wrapped his other arm around my shoulders, and covered my mouth with a hard kiss. My skin went up in a blaze of heat; my bones melted against his body. I felt his wings settle around me, caging me, trapping me, exciting me with their delicate, whispering touch. I wrenched my head back to gulp for air, and then lunged forward again, locking my lips to his. Somehow I had gotten my right hand free, or he had released me, because now I had both of my arms around his waist, under his shirt, and I began sliding my palms up and down his hot skin. My fingers reached the ridged, muscular juncture where his wings met his shoulder blades, and I rubbed my thumbs across the roughened skin. He moaned with pleasure and shuddered in my grip.</p><p>“If you’ve never slept with an angel,” he murmured, “how did you know to do that?”</p><p>“Instinct,” I laughed against his mouth. “Anything that seems too private to touch—should be touched. In circumstances like this.”</p> <p>He kissed me again. “I thought you didn’t come here so you could take me as a lover.”</p><p>“I came here to drag you out of your bitterness and isolation. If seducing you is the only way to do it, well, I’m prepared to make the sacrifice.”</p><p>Now he laughed, but the sound was shaky. “I can’t—I’m not—I’m not thinking clearly right now and any decisions I make—any choices—might not be rational—”</p><p>I deliberately leaned in to rub myself against him. It was immediately clear other parts of his body were also responding to my touch. My fingers tiptoed up his spine again to caress the hard mass of tissue guarding the muscles of his wings. Again he gasped, then he drew me so close that I was lifted off my feet.</p><p>“Let’s not be rational,” I suggested. “Let’s do things that will embarrass both of us in the morning.”</p><p>He did not bother answering that. He merely carried me across the cluttered room to a door that led to an equally messy bedroom, kissing me the entire way.</p><p>If you’ve never made love to an angel, I highly recommend the experience.</p><p>There was no light, or only what little seeped in from my lonely lamp, yet that seedy, cramped room seemed lit with fey radiance. I writhed beneath him, my arms twined around his neck, his wings reared up over both our heads like a divine canopy. I felt sheltered, protected, free to open myself to him completely because no danger could make it past the haven of his wings. My hands explored his ribs and hips while his body worked above mine, driving me to frenzy and then to satisfaction. When he cried out and collapsed upon me, gasping for breath, I kissed his cheek and murmured into his hair.</p> <p>“Oh, I think you’ve definitely found your purpose in life. No need for all this trauma and despair.”</p><p>He laughed into my ear. “I don’t think you can be sure yet,” he whispered. “We’ll need to experiment a few more times.”</p><p>And we did.</p><p>CHAPTER 7</p><p>When I woke up the next morning, my first thought was that I was glad the angel was blind. Sweet Jovah singing himself into laughing hysteria, I must look like a mad street beggar, my hair in tangles, my lips puffy from too many kisses, my face pale from lack of sleep. But, oh, the angel curled up beside me, his cheek still resting on my naked shoulder—he looked sublimely serene. I could not remember the last time I had seen Corban’s face so peaceful. He still bore traces of neglect from four days of wretchedness, but they just served to add a scoundrel’s charm to his everyday symmetrical beauty. I felt his whiskers scratch my bare skin, and I couldn’t help smiling as I gently combed a finger through his knotted hair.</p><p>My second thought was that it wasn’t exactly morning.</p><p>I frowned as I glanced at the boarded-up window, which nonetheless allowed a few rays of energetic sunlight to muscle in. It had to be well past noon, and it seemed odd that Alma had not come upstairs before this to check on the angel. If she had heard me creep in during the night, she might have realized that I was still on the premises and decided not to intrude on us. But surely she had become alarmed by now and wondered if she might have missed my exit later. She knew how fragile Corban was. She would not leave him alone too long.</p><p>No one at the school would expect me to make an appearance for another hour or two; I was safe from inquiry there. But Alma’s absence was troubling.</p><p>I kissed Corban on the top of his head and gently disentangled myself. After pausing for five minutes to clean myself up, I ran downstairs. I didn’t catch the sounds or scents of cooking as I stepped into the kitchen. “Alma? Are you here?”</p><p>No—and she hadn’t been any time this morning. The room looked exactly as it had the night before when I had paused to light my lamp. There was no pot on the stove, no fire in the oven. The place looked clean, but deserted.</p><p>“Alma?” I headed directly to her bedroom, the one that opened off the kitchen, and knocked impatiently on the closed door. “Are you in there?”</p><p>I heard a sound—a muffled word, or perhaps a pillow falling to the floor. “I’m coming in,” I said and pushed the door open.</p><p>Alma lay coiled at the edge of the mattress, one hand trailing over the side to be able to make a quick grab for a bucket nearby. The room smelled of vomit and she looked like death. “Oh, you poor thing,” I exclaimed. “You’ve caught that wretched sickness!”</p><p>I took a half hour to clean her up, fetch fresh water, change her nightgown, and try to make her comfortable. She was grateful but listless, and her skin was hotter than an angel’s to the touch. My apprehension grew.</p><p>“I’m just going to put together a quick meal for Corban, then I’ll see if there are any drugs left at the school,” I told her. “I’ll be back as soon as I can.”</p><p>She nodded and shut her eyes. I threw together a tray of food and dashed upstairs. Corban was just emerging from the bedroom, his hair wet from a quick cleansing, his face lit with a private smile.</p><p>“So you didn’t abandon me in the middle of the night,” he said. “When I woke up and you were gone, I was afraid you were ashamed or sorry.”</p><p>I set down the tray and went straight over to put my arms around him, lifting my face for a kiss. He responded with alacrity; apparently he didn’t have too many regrets, either. “Not sorry, not for a minute,” I said, leaning briefly against him. “But I went downstairs to find Alma, and she’s seriously ill, so I’ve been taking care of her.”</p><p>He was immediately concerned. “Ill? What’s wrong?”</p><p>“Same stomach disorder that swept through the school earlier in the week, I think, but it looks like it hit her hard.” I hesitated. “I’m not very good in a sickroom. I might need to bring someone else in to nurse her.”</p><p>He considered for only a moment. “Of course. I suppose everyone already knows—” He gestured. About me.</p><p>“They know there’s an angel here, but they don’t know your story.” I grinned. “I am very good at not sharing information when I want.”</p><p>He kissed me and pushed me toward the door. “I’m aware. Go take care of Alma.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I lingered a moment, my palm centered on his chest. “I’m sorry for the things I said last night,” I said. “Well, the meaner things. But it frightened me to see you so lost. And I sound cruel when I’m afraid.”</p><p>“Just don’t apologize for the kinder things you said—later,” he replied. “I like to delude myself that you meant them.”</p><p>I laughed, pressed my fingers against his lips, and departed.</p><p>Downstairs, I checked on Alma again. She was either asleep or in a dead faint; she didn’t wake when I shook her. By the time I left the house, I was running.</p> <p>It was harder than I expected to lure Judith from the school to the Great House. Alma was not the only one who had fallen deathly ill overnight. The old handyman David was comatose, three more teachers had become violently sick, and the effort of caring for them all had left Judith pale and exhausted. And fearful.</p><p>“There’s nothing I can do for any of them,” she told me as we stood outside Alma’s room after Judith had made a quick examination. We had roused Alma enough to make her swallow a pill, but it was the last one in the infirmary. “All that’s left is broth and kindness.”</p><p>My own worry was intensifying to the point of panic. “We have to raise a plague flag,” I said.</p><p>She nodded somberly. “We did that last night. But the Gloria is tomorrow. Angels aren’t likely to be flying this way again for another few days.”</p><p>“So they’ll arrive in a day or two and pray for medicine then.”</p> <p>Her face was pinched. “It might be too late. For Alma—for all of them.”</p><p>I felt as if she’d punched me. “What?”</p><p>“When fevers run so high, sometimes people don’t recover. Or if they do, they’re seriously damaged. It’s as if such a hot temperature burns the body out and leaves only a shell behind. I’ve seen it more than once.”</p><p>I stared at her for a moment, then bolted for the stairs.</p><p>Corban was seated in the cutaway chair, his back to the door and the cello between his knees. He was picking at the strings very softly, creating a melody that sounded like raindrops dancing on platters of bronze. It was a merry sound; I took a moment to be surprised that Corban was capable of something so lighthearted. If he was feeling a surge of genuine happiness, might I be in any way responsible?</p><p>No time to ask. “Corban,” I panted, breathless from my run. “You have to go aloft and pray.”</p> <p>He spun around in his chair, his face registering surprise closely followed by dread. “I can’t,” he said.</p><p>I crossed the room and knelt before him. “You have to. Judith—she’s from the school—she says Alma could die. And there are others down at the school. They’re all sick. They’re all in danger. Their fevers are too high, and their bodies won’t recover. And we have no drugs left.”</p><p>“A plague flag—”</p><p>“Tomorrow is the Gloria.”</p><p>He winced at that, no doubt thinking that if times were different, he would be assembling on the Plain of Sharon with all the other angels. He turned away, carefully leaning the cello against the wall. “I can’t do it,” he said.</p><p>I reached for his nearest hand and cradled it between both of mine. “I’ll help you,” I whispered. “I know that the best way to catch Jovah’s attention is to fly very high, but I’ll come with you. I don’t care how cold it gets. I don’t care how far off the ground it is. I won’t make you go alone and I won’t let you get lost.”</p><p>He tore his hand away and jumped to his feet. “It’s not just the flying, it’s the singing,” he said, gesturing in agitation. “I haven’t—Moriah, the last time I prayed to the god, he sent a thunderbolt! He blinded me!”</p><p>I rose more slowly. “You didn’t sing that prayer. It was that boy.”</p> <p>He turned away and began pacing, unerringly avoiding chairs and tables but tripping on discarded shoes and clothes that lay in his path. “Yes, but Jovah sent the thunderbolt anyway! He must have known I was in the room! He could have chosen not to strike me!”</p><p>“You think he would send lightning again? Even if you pray for medicines?”</p><p>He whirled around in my direction. “I think I cannot bring myself to ask for anything from a god I cannot trust. I cannot pray, I cannot supplicate. I am too angry to ask him for anything.”</p><p>Oh, sweet Jovah, this was not a complication I had anticipated. I had thought I could talk him through his fear, but what he felt was fury for a god who had betrayed him. “I understand, I think,” I said, my voice halting. “I don’t think it would have mattered who was about to die. I wouldn’t have been able to ask Reuel Harth for help to save them.”</p><p>Corban caught his breath at the comparison, but he didn’t speak.</p><p>“But Jovah didn’t harm me,” I went on in a low voice. “Can you teach me the song? Can you carry me up toward the heavens so I can sing it to him? Can you let me ask him, if you can’t do it yourself?”</p><p>It seemed like an hour that we stood there, facing each other, both of us so tense that our hands clenched and our shoulders hunched and our faces were creased with concentration. I didn’t know if a mortal could sing the holy songs. I didn’t know if I could learn them. I didn’t know if Corban could forgive his god even enough to let me try. But I knew I would keep pleading until I heard Judith’s weary steps on the stairs as she climbed up to tell us the terrible news.</p><p>At last Corban took another shuddering breath and pressed his hand to his forehead, as if pushing all his rioting thoughts back inside. “I won’t sing to the god,” he said in a quiet voice, “but I’ll sing to you. Put on a coat. It’ll be very cold.”</p><p>Nothing—not three sweaters, my coat, Alma’s coat, and a pair of the headmistress’s boots I found in her closet—could keep me warm as Corban hovered so high above the ground that I could no longer make out landmarks below. I felt ice at the edges of my eyes where the tears leaked out. My cheeks felt ready to crack from cold. It wasn’t just that the temperature was so bitter, but that the wind was so strong. I couldn’t imagine how Corban held himself relatively steady against its incessant buffeting, but in fact, he seemed to be riding the merciless currents without effort; clearly his body remembered this particular skill.</p><p>The cold wasn’t actually the worst of it. There was no air at this altitude, or so it seemed. I found it nearly impossible to inhale. I felt myself gasping and growing light-headed with insufficient oxygen. I couldn’t believe that Corban would be able to get enough air to pray.</p><p>But he drew an easy breath and began to sing.</p><p>This was nothing like that mournful tune I had overheard one night as I spied on the Great House. This was a marching army of a song; this was a piece that burst into houses and ransacked drawers and upended cabinets, searching for treasure. This was a song on a mission.</p><p>True to his word, Corban did not lift his voice to the god. He held my body tightly to his and sang the piece to me. I felt the melody surge inside my skull, charge down my spine, bivouac in my elbows and knees. His voice was a confident baritone—foggy on some of the higher notes, from having gone so long unused—but rich and bright and warm. If I had been a god, I would have given him anything he asked for.</p><p>He sang the prayer straight through four times, and each complete rendition took about ten minutes. By the end of the second round, I thought my feet had turned to ice and sheared off and plummeted to the ground. By the end of the third one, I thought that the only part of my body still hoarding a small flame of warmth was probably the center of my rib cage. By the time he was almost done with the fourth performance, I was numb all over. I had resigned myself to a frozen death. As if to underscore my fate, the air around us began to coalesce into icy chunks, and slivers of wicked sleet burned my skin as they hissed past my cheeks.</p><p>Corban finished the fourth song with a musical flourish, decorating the last note with an unnecessary trill. I waited in desolate silence for him to begin the prayer for a fifth time, but he shouted, “That’s done it! We can go back now.”</p><p>That was when I realized that the hailstorm around me wasn’t ice, but pellets of medicine being flung to the ground. Corban might have sung to me, but the god had answered.</p><p>It was even harder to explain away the angel’s presence once he had stepped forward in such a spectacular fashion. The ground around the school was littered with hard granules; students and teachers spent all day scooping the grains up and racing to carry them back to the infirmary for Judith to dispense. All the patients responded remarkably well to their healing powers, even David recovering quickly enough to sit up in bed two days after he had swallowed the first pill. Alma, too, was soon on her feet, eating and drinking normal food, and apologizing for the inconvenience she had caused.</p><p>I was back in the kitchen, fending off more questions, acting as if I was as astonished as everyone else. It turns out the angel is blind! That’s why he’s been here all this time. But Judith asked him if he could pray for drugs, and he said he would if someone would go with him. Yes, I was terrified to be so high in the air! And it was so cold! But I would do anything for Alma, you know—and all the others, too, of course. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not surprisingly, the other workers—especially the women—began fighting for the chance to visit the Great House, whether to check on Alma or carry up supplies or bring the news that the headmistress was finally returning at the end of the week. The students, even the teachers, looked for excuses to stroll along the line of fencing that overlooked the hill, and one or two enterprising boys actually snuck up to the house and climbed the ivy to reach the roof and wave down at the rest of us.</p><p>I tried to convince Corban that he should visit the school and introduce himself to his many admirers—perform a concert some night, perhaps, or at least hold an informal session where students could pepper him with questions. He wasn’t ready for the human contact yet, but he was willing to put on a remote show in daylight. He came out to the roof once or twice a day and took off in a low spiral, staying close enough that he could always hear the bells and chimes that would guide him home. The whole school turned out for these maneuvers—classrooms emptied out, dust mops and cook pots were left unattended so that everyone could watch the angel glide and dive through the scented spring air.</p><p>I knew it wouldn’t be long before these displays no longer satisfied Corban. He was still distrustful of his god, but he was remembering what it felt like to be an angel in Samaria—a creature of grace and glory and allure. He would figure out soon that he was almost healed; he would realize that there were many other places he would rather be. Places where he could use his gifts and exploit his strengths. Places where he belonged.</p> <p>Therefore I wasn’t surprised, the day before the headmistress’s return, to find him pacing on the rooftop, deep in thought. I had continued to visit him every night, and we had shared a great deal of laughter in between the moments we slept and the moments we made love. But I could feel him pulling away, and I knew, when he turned to me so eagerly, what he was about to say.</p><p>“Moriah, I have something very important to discuss with you,” he said, taking my hands and clasping them against his chest. The gibbous moon made a skewed halo behind his head.</p><p>Once again, I was glad he was blind and couldn’t read the heartache on my face. Now the trick was to keep it from my voice. “What could it possibly be?” I asked in a voice of exaggerated breathlessness.</p><p>He laughed. “You think you know, but you don’t,” he informed me.</p><p>“Let me guess. Your triumph a few days ago has led you to realize that even though you can’t see, you’re still an angel. You can still carry out all the tasks the god set aside for you. And you’ve realized you can’t perform these tasks while you’re hiding away in some musty old mansion. You need to return to an angel hold—the Eyrie, at a guess.”</p> <p>“You’re wrong,” he said, a little smug.</p><p>I lifted my eyebrows. “Cedar Hills, then.”</p><p>He shook his head. “I thought about both of them, but neither one will do. Because you won’t come with me if I go to an angel hold.”</p><p>I stared at him in wordless astonishment.</p><p>“See, I did surprise you. You’re right that I realize it’s time to leave the Gabriel School. But I don’t want to go by myself.”</p><p>“Corban—”</p> <p>He raised his voice to drown mine out. “And now you’re going to tell me that I don’t really know what I want. You’re going to tell me not to confuse gratitude with love. You’re going to say, ‘You think you can’t function without me, but once you’re back in the world you know, you’ll find me an inconvenience or an embarrassment. You need to go on to your new life without me.’”</p><p>I had nothing to say; he had got it right, almost to the word.</p><p>“But I know what I want, and who I want, and what I need to go forward from this point,” he said in a persuasive tone. “I know you won’t lie to me. I know you won’t let me lie to myself. I know you won’t fail me, no matter how hard things get. I know I love you.” He still had my hands wrapped in his, but now he overlapped his wings behind me and with their insistent pressure drew me closer to his body. “And I believe you love me.”</p><p>I tried to keep my arms stiff against his chest, resisting as much as I could, though we were only inches apart. “Well, I’ve tried not to love you,” I said in a mutinous voice. “Everybody falls in love with angels, and I wanted to be different.”</p><p>“But you didn’t succeed.”</p><p>I sighed and stopped pushing myself away from him. Instantly his wings brought me closer, and he dropped a kiss on my mouth. “I didn’t succeed,” I admitted.</p><p>“And you have no particular reason to stay here at the Gabriel School.”</p><p>I knew he could feel the movement as I shook my head. “I told myself no more running—I had found a good place here and I should be grateful—but I knew I wouldn’t be able to stay once you had gone. It would be too dull. And there would be too many memories.”</p> <p>“So where did you think you might go?” he prompted.</p><p>“Someplace I could find work. Maybe start my own business. Now that I know the angels—and the Manadavvi—aren’t looking for me, I thought I could go to one of the bigger cities. Semorrah or Castelana.”</p><p>He shook his head. He was smiling. “That’s not where you want to live.”</p><p>I laughed up at him. When had all the stars come out? The night sky was dense with gaudy sparkles, like a tradesman’s wife overdressed for a fine occasion. “What city do you think I’d choose?”</p><p>“The most beautiful place in all of Samaria,” he said. “A city where I can write music—and perform it—a city where every merchant prospers and every artist flourishes. Both of us can do what we like and be happy there.”</p><p>There was only one place like that. “Luminaux.”</p><p>“Yes.”</p><p>“But Corban—”</p><p>Again he kissed me, just to make me stop talking, I think. “Yes, I’m sure,” he said. “I don’t want to go back to the holds. I don’t want to take up that old life. I am not yet ready to forgive Jovah for what he did to me. But I do want to go somewhere an angel is appreciated and where a musician can hone his craft. So the only question I have left is—”</p><p>“Will I come with you?” I interjected. If he could speak for me, I could speak for him.</p><p>“Yes. Will you?”</p><p>It was a risk. He might think he loved me unconditionally, he might believe he would never tire of me, but two people had a tendency to wear on each other, and I was more wearing than most. But I could bear it if he left me, as long as he left me in Luminaux, I thought. And maybe he wouldn’t leave me. I guessed I wouldn’t know unless I made the experiment.</p><p>“Yes,” I said. “Just let me get my coat.” </p> </body></html>"]