["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When Jack Killigrew’s phone rang, it usually meant someone’s life was on the line. Since he was on leave from the U.S. Marshals Service office in Albuquerque, the only calls he would be receiving were in his capacity as a Special Operations Group deputy. As such, he was a last resort and on call twenty-four hours a day. His twelve-man response team was activated only after the shit had already hit the fan.</p><p>There were a lot of emotions that filtered through Jack when he was called in, but relief wasn’t usually one them. Right now, however, he’d give just about anything for an excuse to head in the opposite direction.</p><p>His fellow deputies would laugh if they knew how edgy he was getting with every mile that passed. As a SOG deputy marshal—a Shadow Stalker—he squared off with hardened criminals and suicidal terrorists as a matter of course. He hunted and apprehended the country’s most-wanted fugitives. He did his job with mechanical precision, never breaking a sweat. The guys called him “Iron Jack,” the man who’d do anything. He faced death as if he had nothing to lose or nothing to live for.</p><p>Yet the thought of facing Rachel Tse was shredding him.</p> <p>“Killigrew,” he answered via the hands-free Bluetooth control in his steering wheel. He’d already noted the lack of a shoulder on the two-lane road. With agricultural fields on each side of him, turning his long Chevy Silverado around wouldn’t be easy.</p><p>“Jack.”</p><p>Christ. The voice on the other end of the line reverberated through him like a gunshot report.</p><p>“Rachel,” he replied gruffly, slowly recovering from the husky sound of her voice. “Everything all right?”</p><p>“Yes.” She said the word breathlessly, which made him hard. “I was wondering if you’d be here in time for lunch.”</p> <p>“Lunch?” God, he was screwed. His best friend’s widow was winded from pulling together a birthday party for his eight-year-old godson and he was getting a boner.</p><p>It had been two years since he’d last seen her, but apparently time didn’t matter. He’d put off this reunion as long as he could, but the time had come to deal with it. Steve’s last request had eaten into him far enough to become hazardous. Jack couldn’t allow his own personal crap to jeopardize his team any more than it already had.</p><p>“Jack? Did I lose you?”</p><p>“I’m here. I was just calculating the possibility of my arriving in time for lunch. I don’t think it’s going to happen.”</p><p>There was a pause, as if she sensed the lie.</p><p>He hated bullshitting her, but he couldn’t see her today. He needed time to get his head on straight. He hadn’t taken a leave of absence in years and without work to occupy him, he found himself thinking too damn much about her. Visions of her blond hair fisted in his hands . . . her taut, sweet nipples tightening against his tongue . . . her long, lithe legs spreading in invitation . . .</p> <p>Getting that obsession under control was a necessity if he had any hope of convincing her she was off the hook as far as he was concerned. He was still reeling from Steve’s request that he look after her if she was ever left alone. Jack realized his friend must have known how he felt. As careful as he’d been to hide his longing, something must have betrayed him.</p><p>And that killed him. No man should have to deal with knowing his best friend is in love with his wife.</p><p>“Where are you?” she pressed.</p><p>“I haven’t reached King City yet.” Jack had passed King City long ago and was about twenty minutes away from Monterey. He would pick up the keys to his cottage in Carmel from the property managers who rented it out for him, then grab a six-pack of beer and hunker down for the night. He’d get his bearings and be better capable of facing her in the morning.</p><p>“Let’s make it dinner, then. Riley’s spending the night at a friend’s house so I can wrap his gifts without him peeking. It’ll be just you and me. We can catch up.”</p><p>Just her and him. At night. With Riley gone until morning? Yeah, right. Jack could imagine the mess running through Rachel’s head now. She’d been crazy about Steve. Madly in love. If she thought Steve wanted them together, she’d make it work, even though he scared the shit out of her. Part of his job was reading people, and as focused on her as his instincts were, there wasn’t a damn thing about her he didn’t register. When he walked into the room, she became skittish—nostrils flaring, eyes widening, body moving restlessly. Her primal reaction aroused every predatory sense in his body, making him edgy and sharpening his hunger for her.</p><p>“How about I take you two out to breakfast in the morning?” His voice was rough with desire. “Then I’ll help you finish setting up for his party.”</p><p>“All right. But if you make it into town sooner, call me. And be careful on the road.”</p> <p>It wasn’t a casual warning for Rachel. Steve had been killed by a drunk driver on the way home from work one night, changing all of their lives forever.</p><p>Jack hung up. Shifting on the seat, he adjusted the fit of his jeans, which was now extremely uncomfortable. Ahead of him, the road to perdition wound its way through the tiny town of Spreckles.</p><p>It was going to be a long week.</p><p>two</p><p>Jack twisted off the top of his fourth beer and tossed the metal cap in the trash. Then he headed back out the open sliding glass doors to his small fenced-in patio. His bare feet sank into the sand and he drank deeply, absently admiring the streaks of orange and pink flaring across the sky. As the sun dipped below the horizon, the temperature fell along with it. It was much cooler here than Albuquerque, but thoughts of Rachel kept him warm enough to go shirtless.</p><p>He was beginning to think drinking had been a bad idea. The alcohol wasn’t smoothing the jagged edges of his lust at all. He was acutely aware of the fact that Rachel was home alone right now and he was only a short drive away. If he left now, he could be inside her within thirty minutes. He had no doubt he could seduce her. He also had no doubt that she’d regret it in the morning.</p><p>It wasn’t her fault he was strung out from wanting her. She’d never led him on or enticed him. Rachel was shy and quiet unless she was surrounded by people she felt comfortable with, an aftereffect of being raised by an aunt who reminded her daily what a burden she was. At least in his childhood, when he made himself invisible, he’d been left alone. She had been verbally abused and tormented no matter what she’d done.</p><p>His cell phone rang and he cursed as he withdrew it from his pocket. The caller ID told him it was Brian Simmons, a fellow deputy and a guy who’d saved Jack’s ass more than once.</p><p>“Killigrew,” he answered.</p><p>“So, have you seen her yet?”</p><p>“No.”</p><p>“Man, that would have been my first stop. She owns a cake shop; she might be huge and your problem would be solved.”</p><p>“Riley e-mails me pictures. No such luck.” And the fact was, Jack doubted it would make a difference to him if she had put on weight. He was attracted to the whole package, not just her looks. Besides, a few weeks sharing his bed would take care of any extra pounds.</p><p>“Well, then, you should think about what you’re throwing away. First off, there are those cupcakes of hers. If she stops sending them, the guys might have to hurt you. Second, I’d give anything to be with Layla right now. It kills me knowing she’s out there somewhere in WitSec—hopefully, still in love with me—and I can’t have her. You don’t have that problem; you’ve got permission. And although I haven’t seen much evidence of it, I’m sure you must have some charm to you. Lay it on her and see what happens.”</p><p>Jack knew he wasn’t what Rachel needed. He had nothing to offer her. Steve had a large extended family that enfolded her with open arms; Jack had only his job, and her and Riley. Steve was the steady and dependable type, a chiropractor who’d come home for dinner every night and was there for breakfast in the morning; Jack never knew when he’d be leaving or when he could come back. Rachel had lived with enough neglect and abandonment as a child. She didn’t need it in her adult life as well.</p><p>“She deserves better than me,” Jack said.</p><p>“Yeah, you’re right.”</p><p>Against his determination to be in a shitty mood, Jack’s mouth curved. “Fuck you, too.”</p><p>“Call me if you need anything.”</p><p>“Same to you.” Jack shoved his phone back in his pocket and was lifting his beer to his lips when he heard a car door shut in what sounded like his driveway.</p><p>Pivoting in the sand, he canvassed the public beach just beyond his short picket fence. His attention narrowed on the side of his house just before a lipstick red dress rounded the corner. The slender body it encased caught his eye next and held it.</p><p>“I guessed you’d be out here,” Rachel said, waving. She headed toward the gate with a square cake pan in one hand.</p><p>Jack wanted to do the gentlemanly thing and let her in, but he couldn’t move. She’d cut her hair short and wore it in sexy, tousled curls that exposed her slender neck and emphasized her fine-boned features. As she passed by him, he saw the back—or, rather, lack of a back—to her dress. Held up by thin straps, the material dipped down to the upper swell of her buttocks, betraying the lack of a bra.</p><p>Jesus. She’d lost her mind coming around him dressed like that.</p><p>“What are you doing here?” he asked without finesse, his gut aching from a soul-deep longing. He rubbed at the center of his chest with the bottom edge of his bottle but found no relief.</p><p>“You said no to lunch and dinner but didn’t decline dessert.”</p><p>She came through the gate, her long legs on display thanks to the short skirt and two-inch slit at her right thigh. There was no hesitation in her approach, which changed the rules of engagement. She’d never outright avoided him, but she hadn’t gone out of her way to be near him either.</p><p>Lifting onto her tiptoes, she balanced herself with a hand over his heart and pressed a quick kiss to his cheek. “You look fabulous, Jack,” she murmured. “It’s really good to see you again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jack wondered if she was aware of the soft note of invitation in her words or how it made his heart race beneath her palm. He didn’t want her under a sense of obligation. He didn’t want to be the tie that bound her to memories of her past with Steve. And he sure as hell didn’t want her martyring herself in his bed.</p><p>“But,” she went on, stepping back, “I’m not so sure you’re happy to see me.”</p><p>He took the opportunity to breathe, sucking in the salt-tinged air in an effort to clear his head. “I’m just surprised but in a good way.”</p> <p>Rachel smiled. Her fingertips slid down his arm to his wrist, then circled the neck of his beer bottle. She tugged it loose and took a long pull, her lips wrapped around the top and her throat working with each swallow.</p><p>His mind fell straight into the gutter.</p><p>He turned as she skirted him and went into the house. He hadn’t bothered to turn the lights on and she didn’t, either. Instead, she used the fading sun as a guide to reach the kitchen island. A moment later a flare in the shadows preceded the igniting of a candlewick. The property management company had scattered groupings of seashell-covered candles all over the house, part of the nautical theme they’d utilized throughout.</p><p>“I’d forgotten how charming this place is,” she called out to him.</p><p>Jack debated the wisdom of following her inside, knowing the leash on his hunger was tenuous at best. “I can’t take credit for it. It’s staged by professionals to appeal to the vacation renters.”</p> <p>“I wish you’d reserve more time here for yourself.” She lit another candle. “We’d love to see you more often.”</p><p>“I’m thinking about it.” Knowing it would be ridiculous to keep shouting at her from outside, Jack entered the living room. “I’d like to start spending more time with Riley, now that he’s older.”</p><p>“He’d love that.” Turning away from him, she searched the cupboards.</p><p>“The plates are to the left of the fridge,” he directed. He watched the way the hem of her skirt lifted a couple tantalizing inches as she reached upward. Feeling like a randy dog, he looked away, then couldn’t resist looking back again. “What have you got there?”</p><p>She looked over her shoulder and her mouth curved. “Better Than Sex cake.”</p><p>Jack searched for a sign that she was joking. “Whoever came up with that doesn’t get out much.”</p> <p>Her laughter hit him like a punch to the gut. He’d always loved that carefree sound. It said so much about her. She made him laugh, too, with her e-mailed stories about hysterical run-ins with customers. He’d startled his fellow deputies more than once by laughing aloud at something she sent him. She brought light into his life, which made him even more aware of the darkness he could bring into hers.</p><p>It figured he would fall for the one woman he was the worst possible fit for.</p><p>Kicking off her low-heeled sandals by the island, she padded over with a single plate in her hand. “I make a cupcake-sized version of this at the store. It’s one of my most popular flavors.”</p><p>“Everything you make is popular. You’re an awesome cook.”</p><p>“Thank you. I can’t grill, though, so I’m relying on you to handle the hot dogs and burgers tomorrow.”</p><p>“Put me to work. That’s one of the reasons I’m here.”</p><p>One dirty blond brow rose with challenge. “Don’t complain later when I take you up on that.”</p><p>Again, there was a suggestive undertone to her words. He forced his gaze away and down at the cake, noting what looked to be caramel drizzle over the top. He wanted to drizzle caramel all over her body and tongue it off slowly. Endlessly. Licking through it to the sweeter flesh beneath.</p> <p>“Here.” She stabbed at the cake with the fork in her hand and lifted a bite to his lips.</p><p>He opened his mouth. The cake was rich but not too rich. “Very good,” he praised, happy to see her cheeks flush with pleasure. “But it’s not better than sex.”</p><p>Her blue eyes sparkled with silent laughter. “Prove it.”</p><p>three</p><p>The tension that gripped Jack at her bold statement was so tangible Rachel felt it. She waited with bated breath, her heart skipping at the scorching look he raked her with. That sharply focused intensity had been too much for her when she’d been younger.</p><p>Dear God . . . he was gorgeous. Impossibly sexy. Standing there in only button-fly jeans with the top button undone. He was leaner than she remembered, his features more angular. She bet he wasn’t taking care of himself. He was likely working too hard and not eating often enough. There wasn’t an ounce of extraneous flesh on him. Every muscle was clearly, deliciously defined. His arms, his pectorals, his abdomen.</p><p>He could drive a woman crazy, especially with that air of danger clinging to him. It was evident, just by looking at him, that there were very few things he wouldn’t do if necessary. There were scars all over him—a puckered bullet hole by his shoulder, slashing scars across his abdomen, an old burn mark on his forearm, just to name a few.</p><p>As long as Rachel had known him, he’d always lived life on a razor’s edge, first as a U.S. Army Ranger and now as a deputy marshal. Any woman who loved him would have to accept the hazards inherent in the work he did. His job would always be his mistress. It would pull him from his wife’s bed at all hours of the night, luring him into deadly situations while the scent of his desire still clung to her skin.</p><p>Rachel hadn’t believed she could ever take on a man like him, but she’d underestimated her capacity to grow and change. Since she and Jack had first met, she’d had a wonderful eight-year marriage. She had persevered through an ectopic pregnancy, the death of her mother and beloved husband, the launching of her own small business, and the terrifying process of learning how to be a single mother.</p><p>She was no longer the woman who’d been married to Steve Tse. She was now the woman who’d survived him, and they were two very different people.</p><p>The woman she was today was more than capable of tackling a challenge like Jack Killigrew. And by God, she intended to.</p><p>He finally spoke. “What did you just say?”</p><p>Rachel wondered if he knew the impact his low, whisky-rough voice had on women. “It’s been a long time for me, Jack.”</p><p>“Hell.” He retreated. Shoving his hands through his short dark hair, he turned his back to her. “You shouldn’t have drunk that beer.”</p><p>Lord have mercy. The way he moved and spoke was intensely sensual. Just the flexing of his muscles was totally erotic.</p><p>She became even more determined to have all that virility focused on her. “I don’t need false courage to hit on you.”</p><p>He glared at her over his shoulder. “This isn’t you.”</p><p>“It’s me now. You’ve stayed away for two years. A lot has changed.”</p><p>Pivoting, he faced her again. “I figured you and the Tses would close ranks while you dealt with Steve’s death. I stayed out of the way.”</p><p>Rachel set the plate and fork down on the glass-topped end table. “I’m glad to hear that’s why you’ve been so distant. I thought maybe it was me.”</p><p>His jaw clenched and she knew she’d struck a cord. The confirmation hurt more than she’d thought it would.</p><p>“I would have asked you to be here,” she said, “if I could have used you. I feel comfortable doing that. Even before—when Steve was still here—I knew I could count on you.”</p><p>He snorted. “You never quite got used to me.”</p><p>“You’re larger than life, Jack. I’ve never met anyone like you before or since.” Her arms crossed. The raw magnetism and intense carnality that once overwhelmed her now set her libido on a steady simmer. She hadn’t realized until she started dating again that she was comparing her dates to Jack and finding they left her cold. “You are rarely entirely comfortable with me, either,” she shot back.</p><p>“So why do this? Why ask me this?”</p><p>Rachel was confused. He was looking at her like he wanted to nail her to the nearest wall, but he sounded like that was the last thing he was interested in. “Have you looked in a mirror lately? Do you hear the sound of your voice, all gravelly and sexy as hell? Are you completely oblivious to the bad-boy vibe you give off? Because I’m not blind or deaf.”</p><p>Jack’s dark and steady gaze was knife-sharp. His brows were drawn together in a fearsome glower, but she wasn’t intimidated. She was quickly picking up on the fact that he became the most fierce when his equanimity was threatened. Which meant, for better or worse, she got to him.</p><p>“You’re physically attracted to me,” she said, daring him to deny it. “So what’s the problem?”</p><p>He mimicked her pose, crossing his arms and displaying powerful biceps. “I’m flattered, but we’ve got too much baggage—and a future with Riley between us—to make casual sex work.”</p><p>Why would anything casual delve into baggage?</p><p>She looked away, hiding the spark of hope she felt. Jack knew damn well there was nothing casual about the sexual tension between them, and that scared him. Of course, he wouldn’t be the first drop-dead gorgeous guy to have commitment issues. In all the years she’d known him, he had never once had a steady relationship. If an event required a date, he’d bring one, but Rachel never saw him with the same woman more than once.</p><p>Needing to think, she picked up the plate and moved back to the kitchen. She took a bite of the cake and contemplated her next move. This was her first-ever seduction; she had no Plan B to fall back on. Giving up wasn’t an option.</p><p>“Rachel?” Jack’s voice was soft in the semi-darkness.</p><p>She ate a little more. “Hmm?”</p><p>“You got awfully quiet.”</p><p>“I’m thinking.”</p><p>He exhaled harshly, his head falling back until he was staring at the white-washed wooden beam ceiling. “I’m sure if you gave dating a shot, you’d find someone you liked.”</p><p>“I like you.” She spoke around another bite. She had long admired his fierce loyalty, but over the last two years since Steve passed on, she’d come to know Jack even better via his role as Riley’s godfather. Through the e-mails and phone calls he shared with her son, she discovered Jack possessed a deep capacity to love and nurture, a marked patience while teaching, and the ability to be open-minded and nonjudgmental. And she damn well couldn’t discount how just the sound of his voice turned her on. “But I have been dating.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His head snapped upright. “Who? Do I know him?”</p><p>“Do you care?”</p><p>“Of course I care. I want to make sure you and Riley are all right.”</p> <p>Rachel met his gaze directly. “I would never put Riley in jeopardy over a guy.”</p><p>“I didn’t mean it like that.”</p><p>She eyed him surreptitiously, noting his edginess while she felt amazingly calm. He made her feel safe enough to be bold. He didn’t yet know what that meant to her, but she intended to show him.</p><p>Jack moved toward the open sliding glass door. “What you and Steve had was special.”</p><p>“Once in a lifetime,” she agreed. She’d been the right girl to Steve’s right guy at the right time. And she felt that way about Jack. She was so sure they were what each other needed; it didn’t seem possible that she could be wrong. If he just gave her a shot, maybe he’d see she was the missing ingredient in his life. And if she ended up being the one in their relationship who loved the other one more, that was okay with her.</p> <p>“You just have to give it some more time. And be a little open-minded.”</p><p>“Oh my God.” She set her fork down. “Are you giving me dating advice? No offense, but what the hell do you know about having a serious relationship?”</p><p>Jack leaned his back into the doorjamb and shoved his hands in his pockets, giving her a breathtaking silhouette of long legs and firm pectorals. “Nothing at all. I just know Steve is going to be a hard act to follow. You might have to make some compromises, but you can be happy again. You can find a good guy for you.”</p><p>“You mean I might have to settle.” She straightened and pushed the plate away, ignoring the urge to clean up after herself. Damned if she’d fall into mommy role right now. She was dressed to kill and primed. And she was playing to win, even if that meant playing a little dirty. “I’ve never settled on the wrong guy in my life, and I’m not going to start now.”</p><p>“Then what the hell are you doing here?” he said coldly.</p><p>“Going down in flames, apparently.” She reached for both spaghetti straps of her dress. If he needed to believe she could handle a no-strings-attached one-night stand, she could give him that impression. Then she’d work her way into him from the outside. She just had to start somewhere, and standing on opposing sides of the room wasn’t cutting it. “But hey, if that’s the way this is going to end, I might as well make sure I gave it my best shot.”</p> <p>Flicking the thin straps off her shoulders, Rachel held her breath. Her dress slithered down her body and puddled on the floor.</p><p>four</p><p>Jack stared, stunned and aching, as Rachel went from dressed to mouthwateringly naked in a split second. He swore. His knees weakened. He was grateful to be leaning against the house. There wasn’t a scrap of material on her. No bra, which he’d known, and no panties to cover her waxed pussy, which he was grateful he hadn’t known about or she’d have been bent over the couch already.</p><p>Sucking in air like he’d just run for miles, he devoured every inch of her pale body with a ravenous gaze. The proud angle of her chin and shoulders, her small but lushly curved breasts, her flat stomach, and her mile-long legs. She turned in a circle with her arms outstretched, showing off her elegantly curved spine and perky little ass.</p><p>“Last call,” she said, facing him again. “If this doesn’t catch your interest, I’ll head out. You can keep the cake.”</p><p>Christ, she was sassy and bold. Jack had no idea who the woman standing in front of him was. It damn sure wasn’t the Rachel he remembered, a woman who’d coped with her vindictive aunt by staying away from home as much as possible. Staying away from home led to her being assaulted when she was sixteen. Steve didn’t elaborate and Jack hadn’t pried. That one word was more than enough.</p><p>The walls started closing in. Sweat misted his skin and the knot in his gut tightened painfully. He could’ve said no to the old Rachel. With this one, he was a goner.</p><p>Her seduction was the worst sort of perdition. He was terrified he was going to fuck this all up and push Rachel and Riley away, the only people he really considered his family. The people he called on holidays and sent gifts to. The people he thought of when the chips were down and he needed a reason to get his ass out alive, if worse for wear. If he lost them, he’d have nothing. He’d forever be worried that they might be in trouble or need something, and his assistance wouldn’t be welcomed.</p> <p>“You’re killing me here, Rachel,” he said gruffly.</p><p>“Well, it’s only fair.” Her arms lowered to her sides. “I’m dying for you.”</p><p>He straightened. He was going to ask her why she was here and if she said Steve’s name, he was walking out to the beach and not stopping until the sun came up. If she didn’t mention Steve, well . . . he couldn’t turn her away. He would take her to bed and try to find some closure. He’d say as much as it was possible to say, do all that it was possible to do, and somehow find a way to act in the morning like nothing had changed between them. He prayed that would ease the way for them to move forward without any awkwardness. If there was the added bonus of her feeling like she’d closed the door on her past with Steve and could move forward unencumbered, he could live with that, as long as he didn’t have to know about it.</p><p>“Why me?” he bit out.</p><p>Her arms fell to her sides. She met his gaze head-on and said, “Because I want to be with someone I feel connected to. Someone who isn’t going to fumble around and leave me hanging at the end. A man who knows his way around a woman’s body and doesn’t need me to tell him what I want.”</p><p>That was it, then. He was a dead man walking.</p><p>Jack strode forward in a controlled rush, his focus narrowed on Rachel and his goal of getting inside her as swiftly as possible. He was highly conscious of how short a time he had with her. A lifetime wouldn’t be long enough and he’d been given only a handful of hours.</p><p>As he zeroed in, he could see her tremble, but her gaze didn’t waver. When he caught her waist in his hands and lifted her, she gasped but didn’t recoil. Instead, her slender arms wrapped around his neck and she buried her face in his throat. He was damp with perspiration, but she didn’t seem to care. She nuzzled against him, her tongue darting out and licking. Impossibly, his cock swelled further. He was so hard it hurt, his dick throbbing in his jeans, demanding relief from his torment.</p><p>He headed toward the hallway leading to the bedroom, holding her partly away from him so they actually stood a chance of making it that far.</p><p>Rachel had other ideas. Using her arms for leverage, she pulled up enough to sling her legs around his waist. The brush of her satin-soft pussy against his abdomen caused him to stumble. He aimed for the wall to the right of the hallway entrance, one hand reaching out to cushion her back from the impact.</p><p>“Oh God,” she breathed in his ear. “You make me so hot.”</p><p>“Rachel.” He pressed his temple to hers and closed his eyes, fighting for control. His chest was heaving with gasping breaths, keeping him ever aware of her breasts flattened against him.</p><p>Her fingers pushed into his hair, tugging forcefully until his head lifted. She crushed her soft mouth against his, holding him at the angle she wanted. When his lips parted for a sharp inhalation, she took advantage. Her tongue darted inside, licking and stroking in a hot wet kiss.</p><p>Jack groaned, abandoning hope of reining himself in. She was going at him full throttle, her thighs flexing around his hips, her torso undulating against him. If he hadn’t wanted her so badly, it would have been molestation. Or a mauling. As it was, he was so damn turned on by her enthusiasm he was about to come in his pants. After what she’d been through in her youth, the fact that she trusted him enough to be so open and aggressive roused every possessive and protective instinct he had. As much as he’d loved her before, it was nothing compared to what he felt for her now.</p><p>He tore his mouth away. “Rachel . . . sweetheart . . . slow down. Let me get a grip.”</p><p>“Noooo,” she moaned, pressing kisses along his whisker-rough jaw until she reached his ear. “Hurry up. If you don’t get inside me soon, I’m going to self-combust, I swear. Or go off without you. This caveman thing is sexy as hell.”</p><p>He would have laughed if he hadn’t felt like he was drowning. She had no idea what she was asking for, but she was about to get it.</p><p>RACHEL sank her teeth into Jack’s earlobe and tugged on his hair. The dark, exotic scent of his heated skin made her feel wild and uninhibited. And the edge to his voice, the strain evident in his tone and the tension in his body, incited her into pushing him as far as he would go.</p><p>As far as she would go, and beyond . . .</p><p>She was acutely aware of the nearby open sliding glass door and the proximity of the public beach beyond it. Distantly, she heard voices and music. If the lights had been on in the house, she and Jack would have been on full display. As it was, they were shrouded in darkness while the outside was bathed in the faint light of the rising moon. Still, the risk of discovery was thrilling.</p><p>Jack steadied their entwined bodies with one knee against the wall. His hand stroked down her back to her buttocks, where he squeezed the firm swell of one cheek, kneading it, making her really damn glad she’d done all those lunges and squats in preparation for this night. She’d trained like she was preparing for a marathon, expecting a night in Jack’s bed would be equally strenuous.</p><p>God, she couldn’t wait, and she felt conflicted about that. It had been twelve years since any other man but Steve had made love to her, and Jack was so very different. There was nothing comfortable or familiar about his touch, yet it was just what she needed. Just want she wanted. His hands felt as if they should be on her, touching her. Not because he was so confident about it, but because it just felt right.</p><p>When his hand slid lower, she froze, every muscle tensing in anticipation of his touch going just where she ached for it. Everything was happening so fast, yet not fast enough.</p><p>“Shh,” he soothed, nuzzling beneath her ear with his lips. Spreading his fingers, he reached between her parted legs from behind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rachel sensed the change in him. It felt like the calm before a storm, when the temperature increased, the wind stilled, and the air became heavy with expectation. She shivered, so damn worked up she felt as if the slightest touch could set her off. Her skin felt too tight and hot. Her chest too constricted.</p><p>Leaning his head back, he looked at her with heavy-lidded eyes. Watching her, as two fingers slipped inside her.</p><p>The sound that escaped her was thready with need. Her pussy rippled with greed, sucking at the two thick male fingers sliding in her to the knuckles. The tension bled away, her muscles slackening as pleasure coursed through her veins.</p> <p>“You’re so tight.” His voice was rough as sandpaper. His fingers withdrew to the tips, then thrust deep. Her quivering thighs lost their grip on his hips.</p><p>Jack pulled free of her clinging pussy and cupped the backs of her legs, bending down to help her feet touch the floor. She fell back against the wall with her eyes closed, her palms pressed flat against the wainscoting, her breathing quick and shallow.</p><p>He caught her face in his hands and kissed her, his mouth slanting across hers with a ferocity he hadn’t displayed earlier. Whatever resistance he’d felt before was gone, replaced by a sharply focused determination that made her heart race.</p><p>She’d had it so wrong. There was no way she could have prepared for this. As his mouth moved along her cheek to her throat, suckling and nibbling the tender skin, she felt herself unraveling. All the stability and structure she’d forged for herself melted away beneath the scorching heat of Jack’s single-minded desire. There was no hesitation in his approach, no tentativeness in his touch, no caution in the command he exerted on her body.</p><p>His hands moved from her jaw to her shoulders, then down her arms. As the liquid heat of his mouth surrounded a tightly puckered nipple, he gripped her rib cage in his hands and pulled her to him, arching her backward so that her breasts thrust toward him like a gift.</p> <p>Her eyes flew open, focusing on the shadowed ceiling above her. The feel of Jack’s tongue fluttering over her nipple was so exquisite, she thought she might orgasm. Her stomach quivered and her hips writhed. Her clit pulsed with need.</p><p>“Suck me,” she begged, needing a quick release to take the biting edge off her lust.</p><p>He did as she asked but not in the way she needed. Not fast and not gentle. Every slow, hard suck radiated downward, intensifying the hunger gripping her in an iron fist. The hot tugging at her breast was echoed in her womb, with sharp rhythmic contractions spurring her need to climax and driving her insane.</p><p>“Faster.”</p><p>His mouth moved across to the neglected nipple, his teeth scraping over the hardened crest, pausing at the tip to flicker his tongue across it.</p><p>“Jack. Please.” Her head fell to the side, her flushed cheek pressing against the cool drywall. “More.”</p> <p>“Beautiful,” he murmured. “Soft and sweet. Too sweet to rush tasting them.”</p><p>“They’re smaller than you like,” she gasped.</p><p>His next suck was so strong it brought pleasure bordering on pain. She whimpered and dug her short fingernails into her palms. He drew hard on her again, then soothed the throbbing point with soft licks.</p><p>“You’re what I like.” His hands moved in counterpoint to the recent fierceness of his mouth, his thumbs stroking tenderly across the crease beneath each breast, gentling her. Two sides of the same man—one careful and reverent, the other rough and wild. “Every inch of you.”</p><p>Urging her back against the wall, his hands slid down past her waist to her hips, his knees bending as he moved lower. He kissed the moist spot between her breasts. “This inch.”</p><p>His tongue followed his downward path, licking along the center of her stomach to dip his tongue in her navel. “And this one.”</p><p>When he gripped her buttocks in each hand and pulled her hips forward, electricity raced across her skin. He nuzzled against her bare mound. “Definitely this one.”</p><p>“Jack . . .” She didn’t know how she’d survive it if he put his mouth on her. She didn’t know how she’d survive if he didn’t.</p> <p>“Hold yourself open for me,” he ordered, his voice husky. “Let me see you.”</p><p>Her gaze locked with his. Although he spoke with command, there was a softness to the way he looked at her that prevented shyness or second guessing. Inhaling deeply, she reached down and exposed her pussy . . . and so much more of herself than he could possibly know.</p><p>five</p><p>“Very pretty.”</p><p>The admiration in Jack’s voice flowed through Rachel in a warm rush of pleasure. He blew a gentle stream of air over her and she whimpered.</p><p>“And so sensitive,” he murmured. “Your clit is peeping out at me, greedy thing.”</p><p>“Tease,” she accused.</p><p>“Teases don’t deliver.” Licking his lips, he leaned in. “I’m going to make you come so hard the neighbors will hear you.”</p><p>He paused for an endless second, making her wait. When she was about to scream, he stroked the flat of his tongue across her. Biting back a cry, Rachel fought to remain standing. Her hands shook as she kept herself spread for him, her knees threatening to buckle.</p><p>“You better hold on to me,” he warned darkly, then he dove full force for the aching flesh between her thighs.</p><p>Wielding the point of his tongue like a lash, Jack caught the tip of her distended clitoris and fluttered over it with lightning quickness. She climaxed with a low moan, the orgasm tearing through her senses with a force she never knew she could withstand. Her body was wracked by violent shudders, her toes curling painfully into the hardwood floor.</p><p>And he didn’t let up. His grip on her ass tightened and he tongued her like a man possessed, his hungry growls throwing her headlong into a second climax directly on the heels of the first. Incited by his wildness, she caught his head by the sweat-dampened roots of his hair and rode his working mouth. She took what she needed, grinding against his wickedly skilled tongue. Shameless in her pleasure, she didn’t care who heard or saw her. The only thing that mattered was Jack and what he was doing to her.</p><p>When the rush ebbed, it took all of her energy with it. She sagged into the wall, gasping for air and trembling.</p><p>Jack stood and lifted her over his shoulder, then turned back toward the couch. When she regained the ability to speak, she was going to tell him again how hot his caveman tendencies were to her. Or maybe she’d just show him . . .</p><p>He sat her down on the armrest of the couch and stepped between her knees. With a hand behind her head, he urged her backward, balancing her so that her torso hung suspended over the cushions.</p><p>With no leverage whatsoever, Rachel could only accept what he gave her—the teasing glide of his tongue along the seam of her lips . . . the nip of his teeth at her jaw . . . the questing of his fingers as they parted her again and pushed through oversensitive tissues . . .</p><p>“Jack.” Rachel caught him by the belt loops, arching helplessly into his grip.</p><p>His fingers curved upward inside her, stroking, searching. She writhed, her abdominal muscles so tense they cramped. The anticipation was a torment all its own, as was the illicitness of their location. The couch was set in front of the sliding glass doors to take advantage of the ocean view. The slanting moonlight ended at the base of the sofa, only an inch or two away from the shadows where Jack fucked his fingers into her.</p><p>“There.” His mouth curved wickedly as he tapped against her G-spot. “Let’s see what happens first: I make you come, or you get into my pants.”</p><p>Rachel really wanted to win. She wanted to see what he looked like, what he felt like. But she was a mess. Emotionally. Physically. And he had a head start. As she fumbled to rip open his button fly, he pressed and rubbed with his roughened fingertips. Fingertips that were strong enough to hold his entire body weight while rock climbing, yet were achingly gentle with her.</p><p>She’d barely freed his cock from the restrictive denim when the orgasm hit her. Moaning, she instinctively tried to pull away from the overload of sensation, but he held her immobile and made her take it. He leaned over her as she quaked, pressing his lips to her ear and crooning words she could barely hear over the rushing of blood in her ears. Let go . . . I have you . . . You’re safe with me . . . His hand thrust and twisted between her legs, the relentlessness so at odds with the gentle tone of his voice. It felt so much like a feral sort of claiming, a branding, a demand that she surrender to him completely.</p><p>That man will never accept anything less than one hundred percent of a woman’s soul, her much wiser mother-in-law once said. Rachel used to wonder what kind of woman would be strong enough to share so much of herself. Now, she knew. She went slack in his arms, embracing her newfound fortitude and turning herself over to the passionate side of Jack she’d fantasized about.</p><p>“Rachel,” he murmured, the one word filled with an aching tenderness. His fingers left her.</p><p>She exhaled audibly. “I want to feel you. Inside me.”</p><p>“I don’t have any condoms.”</p><p>“It’s okay. I got back on the pill two months ago, the day after you made plans to come out here.”</p><p>His breath hissed out between his teeth.</p><p>Rachel cupped his cheek. “You never stood a chance.”</p><p>The kiss he gave her was fierce and passionate, relaying so much more than lust and desire. She clung to him, soaking up the flood of emotion from a man known for his reserve and austerity. This was why she could blossom for him, why she felt fearless and audacious. They were so much alike in that way, their still waters running deeper than most.</p><p>Jack broke the kiss, breathing heavily. He moved her with unsteady hands, turning her so she draped bonelessly over the couch arm, her back to his front.</p><p>She’d never felt more emotionally raw or physically vulnerable. When she heard the rustle of his jeans, her hands fisted beside her head. She stared sightlessly out the open patio door, feeling the cool evening air flowing over her damp skin. There was no longer any tension in her, no resistance, no aggression. When Jack cupped her inner thigh, she widened the spread of her legs of her own volition, needing a deeper physical connection to him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His hand stroked down her spine, then up again. “You okay?”</p><p>Rachel gave a jerky nod.</p><p>He brushed her sweat-soaked bangs away from her forehead and pressed a kiss to her shoulder blade. “Can you take more?”</p> <p>She reached behind her to cup the back of his thigh. Feeling the bunching of his jeans, she realized he’d only bothered to push them down just enough to gain the access he needed. The image of how they must look—she, drowsy and naked; he, tautly focused and partially dressed—sparked a renewed flare of desire. “Yes.”</p><p>Jack straightened and a heartbeat later she felt the broad, plush head of his cock tuck into the clenching opening of her pussy. He was so hot and hard as steel. The feel of him made her bite her lip while the first slow push had her clawing at the white slipcover.</p><p>“Easy.” He restrained her hips with a firm yet gentle grip. “Just relax. You’re nice and soft now. Let it happen.”</p><p>He couldn’t know what he was asking of her. As the wide crown breached the tautly stretched entrance to her body, the intense feeling of possession was overwhelming.</p><p>“Oh God . . .” she breathed, every nerve ending electrified by the leisurely thrusts with which he worked his cock into her.</p> <p>If she hadn’t been so languid, Rachel doubted she could have taken him. As it was, the stretching was so acute she swore she could feel every ridge and vein, every beat of his racing pulse. It was like nothing she’d ever experienced. She was grateful to be facing away from him, needing to shield the raw emotion she knew must be visible on her face. She couldn’t scare him away now. Not after this.</p><p>Bending his knees, Jack pushed the final few inches inside her. She buried her face in the sofa cushion to muffle her plaintive moan. He was so thick and hard. Every shuddering breath she took made her feel how deep he was.</p><p>She felt his tongue slide upward along her back, then a sharp possessive bite at her shoulder.</p><p>“Rachel,” he whispered, reaching beneath her to cup her breasts in his large hands. Clutching her to his heaving chest, he began to move. Withdrawing partway, then gliding home. Being far too careful, as if she was breakable. Although she felt as if she might shatter, she didn’t want his restraint. Not when she’d started falling apart the moment he’d touched her.</p><p>She threw her hips back at him. “Fuck me. Don’t play with me!”</p><p>Jack stilled, which allowed her to feel the fine tremors in his hands and thighs. As deliberate as he seemed, his body betrayed him—he was leashed, but only barely.</p> <p>As much as she was able, she tightened her inner muscles around the rigid cock throbbing within her.</p><p>He cursed and gripped her tighter. “Rachel . . . damn it.”</p><p>“Now!”</p><p>Hunching over her, he pulled his hips back, then slammed deep. The weight of his heavy sack smacked against her clit, sending fire racing along her skin in a prickling wave.</p><p>“Is that what you want?” He flexed inside her, teasing nerve endings she hadn’t known she possessed. “How hard do you want it?”</p><p>“Yes—”</p><p>He was fucking her before she finished. His hips thrusting and churning, shafting her tender pussy with hard, heavy drives.</p><p>She climaxed with his arms wrapped around her, holding her as she sobbed with the pleasure. He groaned as she rippled around him, joining her, jerking violently with every hot thick spurt. His cheek pressed tightly to her temple and the scent of his skin surrounded her, filling her mind along with her name.</p> <p>As he emptied himself inside her, it was her name he repeated in a jagged litany, spoken in a serrated voice that pushed her over the razor’s edge of infatuation into something far more dangerous.</p><p>Somehow, she’d managed to get under his skin. She intended to stay there.</p><p>six</p><p>Jack tucked one arm behind his head and watched as the ceiling lightened incrementally with the rise of the sun. Rachel lay sleeping on the bed beside him, the white cotton sheet tangled around her torso. Her lips were slightly parted, as if in expectation of a kiss, and he fought the urge to wake her and have her again.</p><p>He wasn’t certain what time she needed to get up to prepare for Riley’s party, but it was barely six, so he figured she could sleep for at least another couple hours yet. She needed it. There were dark shadows beneath her eyes. Her breasts were reddened by the scratch of his whiskers. When she’d been curled on her side, he saw the faint indentation of his teeth in her shoulder.</p><p>Damn it. She was too tender and soft for him to lose control with her—both emotionally and physically. Jack scrubbed a hand over his face. And he’d made a gross tactical miscalculation. In the light of day, he was no longer willing to be a one-night stand.</p><p>She’d been planning on going to bed with him for months . . .</p><p>Fuckin’ A. Just thinking about it tore him up.</p><p>Yes, Rachel deserved better than him, but he could make some adjustments and sacrifices, he could learn what she needed and give his best shot at delivering. He could show her that he could make love to her slowly, sweetly. Take his time. Let her set the pace. He had no option other than to try; he couldn’t pretend last night never happened. Maybe she’d come into it because of Steve, but he could give her a reason to stick with it.</p><p>Too wired to sleep, Jack slipped carefully from the bed and dressed for a run. He hit the beach and tried to clear his head.</p><p>He’d never been good with words.</p><p>Now he needed to find the right ones to change the rest of his life.</p><p>RACHEL woke to the sound of the shower running. She smelled coffee and smiled, relishing the intimacy of sharing her morning with another adult. Rolling to her side, she searched for a clock and found one on the nightstand on Jack’s side of the bed. It was turned away from her, so she crawled over and moved it. Seven forty-five.</p><p>Beside the clock was Jack’s badge and billfold. She stared at the silver star, feeling a rush of pride and respect. He was a Shadow Stalker, a member of the U.S. Marshals Service’s elite Special Operations Group. He’d explained the nickname to her once—the Shadow Stalkers unit hunted dangerous fugitives, or “shadows,” and waited in the shadows of federal courthouses during high-profile cases. His job suited him so well that she couldn’t imagine him doing anything else. She certainly would never ask him to give it up, even though the thought of losing him terrified her.</p><p>Reaching for the badge, she accidentally knocked the wallet to the floor. It landed on its back and flopped open. Her smiling face stared up at her.</p><p>She got out of bed. Bending down, she picked the billfold up. It felt wrong to pry, but she couldn’t resist. Whose image did he carry with him? Who were the important people in his life?</p><p>Rachel turned each plastic photo protector slowly, touched to see pictures of Steve and Riley along with ones of her. But when she reached the end and found only one photo that wasn’t of her family—one with several guys in bulletproof vests and sunglasses—she frowned. There were no pictures of parents or siblings, or nieces and nephews. No photos of himself with anyone.</p><p>Her heart broke a little. “Jack,” she whispered, wondering if he felt as alone as he suddenly seemed to her.</p><p>She’d known that Jack grew up in foster care, but she’d assumed he formed some lasting connections with someone. Anyone. Was it possible he hadn’t?</p><p>If she and Riley were all he had, no wonder he was wary and reluctant. It certainly wasn’t from lack of desire.</p><p>Standing, she walked to the master bathroom. She gave a cursory knock, then cracked the door open. “Hey.”</p><p>“Good morning.”</p><p>His voice was warm and purring. The shower was enclosed with frosted glass, affording her just enough of a glimpse of his perfect body to light her up. She could get used to this.</p><p>“Coffee’s brewed,” he said. “I picked up some of that sugar-free hazelnut creamer you like.”</p><p>Sweatpants and a sweat-stained T-shirt lay piled on the floor. She couldn’t believe he’d exercised after their exertions the night before. She felt like an underachiever. She also felt loved and cared for.</p><p>Jack paid attention to her and the things she liked in ways she hadn’t fully appreciated until Steve was gone. The flowers he sent weekly were either calla lilies, stargazer lilies, or tulips—her favorites. How did he know that? Perhaps Steve mentioned it. But her favorite Luzianne chicory coffee, which had to be ordered? Or her favorite hand cream, Japanese Cherry Blossom Shea Cashmere, the smell of which was usually hidden by her perfume? Even Steve, the one person who’d known her better than anyone, couldn’t remember that.</p><p>Maybe Jack’s attention to detail was just part of who he was and the job he did. After all, the U.S. Marshals Service was responsible for the Witness Security Program. Maybe the little things he remembered about her were things he’d pick up on anyone, part of the process of wiping a person’s identity and erasing identifying habits. But maybe something more personal was involved. She hoped so, because she’d started falling in love with him over those gifts and how they made her feel. After years of having everything she loved denigrated and belittled by her aunt until she didn’t enjoy anything at all, Jack had taught her to celebrate the things that made her happy.</p><p>Smiling at the thought, she bent down and picked up after him, grabbing his clothes and taking them out to the hamper in the bedroom. It wasn’t a task she was particularly fond of usually, but she was beginning to think Jack could use a little looking after. Besides, he’d made the coffee. She was willing to trade quite a bit for the pleasure of waking up to freshly brewed coffee.</p><p>“Would you totally gross out,” she asked, returning to the bathroom, “if I use your toothbrush?”</p><p>“Go for it.”</p><p>Rachel was rinsing her mouth out when Jack turned off the water in the shower. Straightening, she turned and faced him, determined to catch the view. The door slid open. A dripping wet and gorgeously naked Jack appeared, and she gave an appreciative whistle. He was perfectly sculpted from head to toe. And the package in the middle, impressive even while semi-erect, made her hot and needy. She could seriously get used to this. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His mouth twitched with suppressed amusement as he reached for the towel hanging on the wall. He’d shaved and looked less rogue warrior and more GQ cover model. She loved both looks on him.</p><p>“Wait.” She stepped closer, licking her lower lip.</p><p>Jack’s eyes filled with a heat that made her flush. His arm dropped back to his side. “I’m all yours.”</p> <p>JACK held his position despite the seemingly endless insurgence.</p><p>As if Rachel sensed his wariness, she’d brought him a beer earlier, hiding it from the multitude of underage eyes with an insulated bottle cozy. He didn’t touch it, knowing from experience that it was best to stay razor sharp when surrounded by unknowns.</p><p>From the safety of the grill, he eyed the dozen or so eight-year-olds running around the patio of Rachel’s small two-story condominium. It was a madhouse, but he didn’t feel as out of place as he’d expected he would. That was certainly because of Rachel, who smiled at him often and made a point of including him.</p><p>“Jack.”</p><p>He turned his head and smiled down at Riley, who looked so much like his dad. Riley had the same smiling sloe eyes and cheerful grin, the same quick laugh and desire to help others. “Hey, sport. Having fun?”</p> <p>“Totally. I have a question.”</p><p>“Shoot.”</p><p>“My Aunt Stella says you like my mom.”</p><p>He glanced at the picnic table, where most of the Tse family was gathered. “I do.”</p><p>“Like her like a girlfriend. You know, kissing and stuff.”</p><p>“Oh?” Jack focused on the burgers and hot dogs grilling in front of him.</p> <p>“She says guys only pay attention to what kind of coffee creamer a girl likes when she’s his girlfriend.”</p><p>Not knowing how to reply, Jack just nodded slowly and shot another glance at Rachel. She was talking about him to the Tses. He hoped that was working in his favor.</p><p>“So it’s true?” Riley pressed. “Is my mom your girlfriend?”</p><p>“Uh . . .” Jack blew out his breath. “How would you feel about that? Is that bugging you?”</p><p>“No. Will you be coming around more? I think you should come around more.”</p><p>“I’m going to be working on that. I’d like to spend more time with you. There are some things your dad and I used to do together—fishing, golfing, taking some Sea-Doos out to Havasu . . . I think you’ll enjoy those same things.”</p><p>“Sea-Doos?” Riley’s dark eyes lit up. “Really? That would be so cool!”</p><p>“We’ll have to make plans, then.”</p> <p>Riley ran off, shouting at his friends, but skid to a halt a few feet away and came back. “Watch out for Aunt Stella,” he said in a stage whisper. “She says if mom doesn’t snatch you up, she will. She’s cool, but . . . well . . .”</p><p>“Got it.” Jack somehow managed to keep his face impassive. “Thanks for the tip.”</p><p>Watching his godson run off, Jack rocked back on his heels and felt hopeful. If the Tses were endorsing him, he had a chance in hell. He’d take it.</p><p>His cell phone rang and his light mood sank like a stone. Pulling it out of his pocket, he answered, “Killigrew.”</p><p>“Hey, Jack.” Gary Lancet’s grim voice was like a cold shower. “I’m sorry to interrupt you on leave, but I figured you’d kick my ass if you found out after you got back.”</p><p>Jack set down the tongs he’d been using to turn the hot dogs. “What is it?”</p><p>“One of Terry’s old collars went to his house. Fucked the place up and killed his dog. Callie’s a mess.”</p><p>“Jesus. Are she and the kids okay?”</p><p>“Yeah, they’re shaken up but fine. It’s a miracle they weren’t home at the time. Her damn radiator hose took a shit on the way back from picking them up from school. Otherwise . . . Well, it could have been a lot worse.”</p><p>Looking at Rachel and the festive scene around him, Jack finally felt the sensation of being the odd man out. He should have felt it earlier. His life, such as it was, didn’t fit here. He’d forgotten that for a while. The grisly reminder was a timely one. He hadn’t yet laid his heart on the line; retracting it would have been a lot harder than just bailing early. “Am I needed?”</p><p>“We’ve got it covered. I just knew you’d want to know.”</p><p>“Absolutely. Tell Terry to call me if he needs anything. I still have some things to wrap up here, but nothing that can’t wait.”</p><p>“I’ll keep you posted.”</p><p>Jack hung up and stared at the phone for a long minute. Just imagining what Terry must be going through made his gut knot. Thinking about a close call like that happening to Rachel and Riley about doubled him over. Sweat beaded his forehead despite the coolness of the northern California weather. He rubbed at the tightness in the center of his chest. “Shit.”</p><p>Rachel’s voice came from behind him. “Is everything all right?”</p><p>He turned, grateful for the sunglasses shielding his eyes. “Something’s gone down back home.”</p><p>“Oh.” She bit her lower lip. “Do you have to go?”</p><p>Facing her disappointment only strengthened his resolve to stop being selfish. He had to think of her first. “Not yet.”</p><p>Her chin lifted. “I’d understand if you had to go. Riley would, too.”</p><p>“You shouldn’t have to understand.”</p><p>One of her brows arched. “Really? Says who?”</p><p>“Let’s not do this now.”</p><p>“Later, then. Right after this is over.”</p><p>It was already over. Not that it ever really had a chance to begin.</p><p>RACHEL picked up the last bit of torn wrapping paper that had blown beneath the patio table and straightened. Her house was almost back to normal . . . except for the brooding deputy attacking her gas grill with a steel brush.</p><p>Jack had grown strangely quiet since taking that phone call a couple hours before. He managed smiles for Riley, who’d loved every one of the too-many gifts Jack had given him. Gifts that were craft sets or science projects or models. Things that were taught or built. Rachel took note of the fact that a man who worked with death and destruction was fostering a love of discovery and creation in her son. But Jack was unable to muster even a ghost of a smile for her. Instead, when their gazes met, he looked . . . ravaged.</p><p>She shoved the trash in the garbage bag beside her and yanked on the handles to seal it. Then she approached Jack, coming up behind him and wrapping her arms around his lean waist. Even though he’d seen her coming, he tensed when her arms encircled him. She was grateful her mother-in-law and Stella had taken Riley to Target to spend his gift cards. It gave her the chance to get things straightened out with Jack.</p><p>She slid her hands beneath the hem of his shirt and caressed his washboard abs. “Stella tells me I need to keep you around and exploit your mad grilling skills.”</p><p>He set one hand over hers, stilling her movements. “Flipping burgers isn’t enough to fix my faults.”</p><p>“Oh my God, you have faults? What a relief! I was beginning to think you were perfect.”</p><p>Jack set the brush down and turned carefully to face her. “Rachel.”</p><p>She pushed up his sunglasses to reveal his eyes. They were completely shuttered. “What was the phone call about?”</p><p>“Nothing you should have to worry over.”</p><p>“Bullshit. Whatever was said to you has you pulling back. Since I’m the one you’re pulling back from, I deserve to know why.”</p><p>Exhaling harshly, he pulled off his sunglasses and hung them from the collar of his T-shirt. “One of the guys on the team had a scare today.”</p><p>Rachel listened to his voice as he told her what happened. It was tight and clipped, his jaw taut. Someone he cared about—one of the very few—was hurting now and that was hurting Jack.</p><p>“You know you can talk to me about anything, right?” Her fingers stroked soothingly across his nape. “The good, the bad, and the ugly. It helps to get it out.”</p><p>“I don’t want you involved in stuff like this.”</p><p>“I’m already involved.”</p><p>“You don’t need this crap in your life,” he said harshly. “Riley doesn’t need it.”</p><p>“We need you,” she retorted, “and you and the job are a package deal.”</p><p>“You’ve got me.” His dark gaze was stormy. “I’ll always be here for you, just as I’ve always been. We just need to keep things simple.”</p><p>That was ridiculous. What they had was totally complicated. He was complicated, and he was used to keeping his circle of friends small and tight. Letting her in probably scared the shit out of him on a level he didn’t even recognize. Because then he could lose her, one way or the other.</p><p>He was going to figure out, real quick, that she had absolutely no intention of getting lost.</p><p>seven</p><p>“Simple, huh?” Rachel backed away from him and headed into the house. She needed a beer. Maybe two. “As simple as living in the same town?”</p><p>Jack followed her. “As simple as keeping things the way they have been until last night.”</p><p>She wondered if he heard how gruff he sounded, how defensive.</p><p>Reaching the fridge, she pulled out two beers and set one down in front of him. They faced each other across her kitchen counter with equally wary and examining glances.</p><p>“You don’t get to make that decision by yourself, Jack.” She twisted off the top of her beer and took a swig.</p><p>His gaze narrowed. He had his game face on, dangerous and inscrutable. “I’ll make the decision if it keeps you safe.”</p><p>“I think the person you’re trying to save is yourself.” She pointed at him with the neck of her bottle. “I scare you.”</p><p>“Thinking of something happening to you scares me.” He opened his beer and drank, watching her as he swallowed.</p><p>“So, you ride off into the sunset, and I’m here safe and sound . . . until I get carjacked at the gas station. Or robbed at the store.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not the same thing,” he argued. “The level of inherent risk with me is much higher.”</p><p>“Shouldn’t I be more worried about you not coming home than the reverse?”</p><p>“I know what I’m getting into when I go to work. You didn’t sign up for this.” Jack ran his hand through his hair. “The last thing I want to do is bring more traumas to your life. You and Riley need someone who comes home every day. Someone who leaves their work at the office. Someone—”</p> <p>“Like Steve?” she interjected. “A guy who never had a moving violation in his life. No speeding tickets. A guy who never drove without his seat belt on. Who would have thought he’d die in a car wreck? No one. Terrible things happen to unsuspecting people every day. It’s part of living, Jack. There’s no way to go through life risk-free.”</p><p>“I’m not bringing the shit from my job to your doorstep. Period.”</p><p>Rachel’s foot tapped on the tile floor. “You think I didn’t know what I was taking on when I seduced you? I’m a grown woman with a child who depends on me. I don’t jump without looking. You seem to be forgetting how well and how long I’ve known you.”</p><p>“Steve didn’t know the gritty details of what I do. If he had, he never would have wanted you anywhere near me on a permanent basis.”</p><p>Her gaze moved to the photo of Steve and Jack on the mantel in the next room. She could barely make out the details from where she stood, but the image was indelibly etched on her mind; she could see it with her eyes closed. Both men were dark-haired and brown-eyed. Both were tall and fit. But that was where the similarities ended. Steve’s handsome Asian features reflected his fun and easy charm, while Jack’s gaze was shadowed and his smile guarded. Steve had been content with the simple things in life—like her. Extroverted and spontaneous, he was known and liked by damn near everyone; Jack was hard to know and harder to understand.</p> <p>Yet she loved them both madly.</p><p>Rachel looked at him. “You were the brother Steve never had. He trusted you with his life. But I don’t make my decisions based on conjecture about what my deceased husband would think of them.”</p><p>“Don’t you?” he challenged softly, his eyes so dark they looked black. “Tell me Steve isn’t the reason you came over last night.”</p><p>“Steve isn’t the reason I came over last night.” She lifted her chin. “I loved my husband. I couldn’t have loved him more. He was everything to me and if he were alive right now, what happened last night would never have happened. But he died, and I came to terms with that. I changed. My needs and wants changed. And now, when I look at you, I don’t think about him. I don’t think about you in relation to him. Half the time, I don’t think at all, because I’m too busy appreciating the view. If you gave me some kind of best friend pity fuck last night, that’s on you. Don’t try and say that’s where I was coming from.”</p><p>Jack was oddly still . . . except for the rapid tempo of his breathing and the fevered brightness of his eyes, both of which betrayed far more volatile emotions.</p><p>Rachel frowned, catching on to the fact that she was missing something. She didn’t believe he’d made love to her for any other reason than that he’d wanted to, but she was beginning to think he hadn’t attributed the same motivation to her. “What’s going through your head?”</p> <p>“It doesn’t matter. I was wrong.” He looked down at his bottle, which he twisted and turned atop the counter. There was a softness to his features that tightened her chest.</p><p>“Most especially in thinking you could put on the breaks and slide into reverse.” She bent down and leaned to the side, catching his lowered gaze. “There’s only forward, Jack. I stopped looking back a while ago.”</p><p>JACK stared at the vibrant woman looking at him in a way he’d never allowed himself to even dream about and knew he was done. He was never going to be able to say no to her. Not now. Not in the future. He wanted to give her everything, make her happy, keep her safe.</p><p>As if she knew what he was thinking, she said, “The safest place I can be is right next to you.”</p><p>“Not when I’m the reason you’re endangered to begin with.”</p><p>“So you spend some of your off-duty days teaching me how to shoot a gun until I’m dangerous. You help me pick out an outrageously expensive and comprehensive alarm system for the house.”</p><p>“Which house?”</p><p>“Both. For now.” She smiled. “And you wear a bulletproof vest all the time. No crazy heroics.”</p> <p>“All the time?”</p><p>“Except when I want you naked.”</p><p>His mouth twitched. “I was hoping that would be all the time.”</p><p>“After last night, that is all the time.”</p><p>“Then I’ll be wearing body armor only rarely.”</p><p>“If you want me to kick your ass and deny you sexual favors, try it.”</p><p>Jack lifted his beer to his mouth to hide a smile. It was inappropriate considering the seriousness of the discussion, but Rachel always had that effect on him. She made him happy in spite of himself.</p><p>“You can talk to me about anything, Jack,” she said softly, all levity gone. “You can ask me anything, and I’ll try to come through for you. But you can’t tell me to let you walk away. I can’t do it, I can’t let you go.”</p><p>He swallowed and looked around the condo she’d bought after Steve died. It was the perfect size for her and Riley. The kitchen boasted new stainless-steel appliances and was big in relation to the overall square footage, which suited someone who baked for a living. The window over the sink had curtains with cupcakes on them—a housewarming gift from Steve’s mom.</p><p>“You have a good life here,” he noted. “You’ve got family nearby and a new business. Riley has his friends and classmates.”</p><p>“I do have it good.” She set her elbow on the counter, then her chin in her hand. “You do realize, don’t you, that I never could have done what I did last night with any other man? I can’t even imagine throwing myself at anyone else. Even with Steve, I waited for him to make the first moves. I was always afraid I’d stir up more than I could handle.”</p><p>Jack forced himself to breath deep and easy, trying to slow the rapid beating of his heart. “I was rough with you. I’m sorry.”</p><p>“No, you’re in love. And I loved every moment with you. I wouldn’t change one thing that happened last night. I told myself I was strong enough to take you on, and now I know I can.” She smiled gently. “That’s not a surprise is it? That you’re in love with me?”</p><p>“No. I knew.” He watched as something hot and tender swept over her face. “I also know loving someone means wanting what’s best for them. I’m not good for you.”</p><p>He held up a hand when she opened her mouth to speak. “Hear me out. Any minute now, my phone could ring and I will have to go. Christmas, your birthday . . . I can’t promise I’ll be here. Once I leave, I won’t always know when I’ll be back. One of these days, you’re gonna wake up and realize you want someone around full-time.”</p><p>Rachel straightened. “I’ve been getting by on my own with Riley for two years. I don’t need a man around just because. I don’t have any problem going to bed alone. What I want is you. Not some interchangeable guy; not someone like Steve. Look at it this way: I already have the cake. You’re the icing on top, with sprinkles, candied fruit, and chocolate drizzle.”</p><p>“And I’m just as bad for your health,” he muttered.</p><p>“I want you going straight to my hips. I want the sugar rush and the toe-curling deliciousness. I’ve earned it.”</p><p>She licked her lips and his dick went hard, remembering what that mouth had done to him when he’d stepped out of the shower that morning.</p><p>Taking a deep breath, Jack laid it out there. “You’re asking me to risk losing you and Riley completely. I can live with what we’ve got now, but nothing at all . . . I don’t think I’d survive it.”</p><p>Rachel rounded the counter. “I’m deliberately keeping this light, because I don’t want to scare you off. I’m saving the heavy stuff for later, when you can’t run. I was thinking you should be handcuffed to the bed before I tell you that you’re stuck with me for the rest of your life and I’m the last woman you’re ever going to bed with.”</p><p>She walked right into him, hugging him tight. He had to restrain himself from squeezing her too hard. God, he was crazy for even thinking this could work.</p><p>“In the meantime,” she went on, “we’ll start with a race to see who can acquire the most frequent-flier miles by the end of the year, and work from there. Week by week, you’ll learn that not being able to live without me means living with me. Eventually, you’ll get used to not being alone and we’ll both become familiar with this new take-no-prisoners version of myself that you inspire.”</p><p>“You’re making this sound easy,” he murmured with his lips to the crown of her head, “but it’s not.”</p><p>She leaned back to look up at him. “No, we’re going to have to work on it and make some sacrifices and take risks. What I’m saying is it’ll be worth it. The difficult part’s already over—we both fell hard. It’s onward and upward from here.”</p><p>“Take no prisoners.” He shook his head and a small laugh escaped him. God, he was scared shitless. He didn’t know how to bring something precious and fragile into his life.</p><p>“Except for you.” Her hands slid up his back. Her lips whispered across his jaw.</p><p>Jack lifted her feet from the floor. “I want to be good for you.”</p><p>“You have been. You are. You will be.” Her teeth scraped lightly over his earlobe, sending a surge of heat and longing through him. “I’m going to show you all the ways I’ve grown stronger because of you. Because of things you’ve done for me and said to me. Because of how you look at me. For a long time, I didn’t understand why you look at me the way you do, but I knew you saw something in me I wasn’t seeing. I can’t tell you how many times thoughts of you motivated me when I wasn’t sure I could get something done.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>He kissed the top of her shoulder, which was bared by the asymmetrical shirt she wore. “You can do anything you set your mind to.”</p><p>“I’m setting my mind to returning the favor. Together, we can overcome anything—our pasts, your job, a long-distance relationship. I’ll send you Better Than Sex cupcakes to tide you over between days off.”</p><p>“I thought we established that the name is false advertising.”</p> <p>“God, did you ever,” she breathed, wrapping her arms around his neck. “But I enjoyed your argument so much, I’d be happy to have you repeat it.”</p><p>He closed his eyes and pressed his forehead to hers. Right now, he had all he’d ever wanted. They would plan the next steps together. After that . . .</p><p>Onward and upward, she’d said.</p><p>Jack’s arms tightened around her. Onward and upward. </p>  </body></html>"]