["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>\"It's over, Don Orlando.\" Maggie O'Brian lowered her gaze. The tears that blurred her vision had little to do with the role she was playing&amp;#151;Jessica Goodwin, mortal doctor, hopelessly in love with a vampire. Like any good soap opera actress, Maggie turned her back to the person she was addressing and looked sadly at the camera. \"You must never come here again.\"</p><p>\"Don't say that!\" Don Orlando rushed to her side and sank gracefully to one knee. He seized her hand and kissed it. \"My darling Chiquita, I could never let you go.\"</p><p>Chiquita? What sort of cheesy person was writing this nonsense? Maggie inwardly cursed the writer while trying to ignore the way Don Orlando was brushing his lips against her knuckles. Sweet Mary, now he was nibbling her fingers.</p> <p>But it meant nothing. He was only acting. Rumor had it he'd nibbled a lot more than women's hands in the last few years.</p><p>The tear that rolled down Maggie's cheek was worthy of a daytime Emmy. Unfortunately, her lack of a pulse during the day precluded her from attending the ceremony. And how could they give Emmys to a group of actors they didn't know existed? Only a few mortals employed at the Digital Vampire Network knew about vampire soap operas, and they were sworn to secrecy. The mortals knew if they blabbed, they would pay in blood. Literally.</p><p>Maggie yanked her hand from Don Orlando's grasp. \"I'm sorry, but it was never meant to be.\"</p><p>As Don Orlando rose, he flipped his black silk cape over one shoulder, revealing half of his muscled torso and a thatch of very black, very thick chest hair. Maggie knew this movement caused Vamp viewers at home to sigh in ecstasy. She should know. She'd been one of them. And if Don Orlando executed the famous double flip, throwing both edges of his cape over his shoulders to reveal his entire chest in its muscle-rippling glory, his female fans were known to swoon. No doubt, a few male ones, too.</p><p>Maggie wandered to the empty desk of her pretend office. \"How many times must I tell you? This is a hospital. You shouldn't come here without a shirt.\"</p> <p>\"I couldn't wait to be with you.\" His voice sounded as smooth as his black silk cape. \"And the nurses never complain.\"</p><p>\"You'll catch a terrible cold.\" She glanced at him over her shoulder. \"Why, it's snowing outside. It's almost Christmas.\"</p><p>He shrugged his massive shoulders. \"Mortal diseases do not frighten me. I will heal during my daily death-sleep.\"</p><p>Maggie pressed a hand against her chest and gazed at camera number two. \"I swore an oath to protect life. How could I fall in love with one of the Undead?\" She whirled to face him and pressed her hands on the desk behind her. This pose was designed to highlight her ample bosom. \"That's how you seduced me, isn't it? You used some sort of insidious vampire mind control.\"</p><p>\"It was you who seduced me with your pure and noble heart.\" His gaze lingered on her breasts. \"I could not help myself.\"</p><p>\"I must resist you. Somehow.\"</p> <p>He bowed. \"I am Don Orlando de Corazon, the greatest lover in the vampire world. No woman, alive or undead, can resist me.\"</p><p>\"But I must!\" Maggie strode toward camera number two. \"I've worked so hard to get where I am today. Years of med school, endless hours in the ER. And now, I'm a famous brain surgeon. People need me.\"</p><p>\"I am very proud of you, my Chiquita.\"</p><p>\"Don't say that! I have a reputation to maintain. I need the respect of my peers. How can I have an affair with an undead trumpet player from a mariachi band?\"</p><p>He lifted his chiseled chin. \"I'm a very good trumpet player. And the greatest lover in the vampire world.\" He swaggered toward her, a hand on the low waistline of his tight black leather pants.</p><p>Maggie turned away with a gasp. \"Don't tempt me, Don Orlando!\"</p><p>\"Come away with me!\" He pulled her into his arms. \"We will make beautiful music together.\"</p><p>\"No, no, no!\" She shook her head in rhythm to her cries.</p> <p>\"Yes, yes!\"</p><p>She planted her hands on his chest to push him away. The ring on her right pinky finger gleamed under the stage lights, bright gold against the coal black chest hair.</p><p>He embraced her tighter. \"Kiss me and tell me you don't love me.\"</p><p>She turned her tear-streaked face to camera number one. \"You're so cruel to make me suffer. Please let me go!\" She shoved hard at his chest.</p><p>He stumbled back. \"Aagh!\"</p><p>\"Aagh!\" Maggie's higher-pitched scream joined his when she realized what had happened.</p><p>Grimacing in pain. Don Orlando pressed a hand against his now bare chest. And dangling from Maggie's right hand like a dead rat was the mat of black chest hair.</p><p>\"Aagh!\" She shook her hand. \"Get it off!\" It flopped wildly around her hand, tangled in her pinky ring.</p><p>\"Dammit, woman!\" Don Orlando winced as he rubbed the red welt on his hairless chest. \"You nearly ripped my skin off.\"</p><p>\"Cut!\" Gordon, the director, yelled. \"Makeup! We need Orlando's hair glued back on.\"</p><p>Maggie looked at Don Orlando's bare chest, then at the furry pelt dangling from her ring. It was fake? Sweet Mary, she should have known. How many men had body hair like an English sheepdog? She ripped it from her ring and offered it to its owner. \"Sorry. I didn't mean to hurt you.\"</p><p>Don Orlando's mouth curled up, and he tapped the red splotch on his chest. \"Want to kiss it and make it better?\"</p><p>\"No!\" Maggie tossed the chest-toupee at him. \"Why do you wear such a silly thing?\"</p><p>He actually looked embarrassed. For about half a second. \"They thought I would look sexier with more hair.\" He gave her a lopsided smile. \"Though right now, I'd be happy if I just had some skin.\"</p><p>Maggie smiled back. For about half a second. Her amusement died when he checked out the makeup girl with a leering grin.</p><p>\"Hola, pretty senorita,\" he murmured to the makeup girl. She blushed as she painted his chest with adhesive.</p><p>\"Shall we adjourn to my dressing room?\" He winked. \"We could bring the glue and get all sticky.\" She giggled.</p><p>Maggie clenched her fists to keep from slapping him. Sweet Mary and Joseph, she was angry. She'd been angry ever since she'd found out that her adored hero, Don Orlando de Corazon, was nothing more than a womanizing pig. And now, she realized it was even worse. He was a totally fake womanizing pig.</p><p>She stalked toward the refreshment table and poured herself a glass of Chocolood. The mixture of synthetic blood and chocolate was as close to comfort food as a lady vampire could get. She frowned at the black strand of hair still caught around the little gold cross on her pinky ring. She untangled the hair, remembering how her father had given her the ring at her First Communion when she was seven. Back then, in 1872, the ring had fit her fourth finger perfectly. She'd loved her pretty white dress, the first dress she'd ever owned that wasn't a hand-me-down from her older sisters.</p><p>As the eighth child out of twelve in an Irish immigrant family, Maggie had known hunger and poverty. But she hadn't known about the secret world of the Undead until she'd joined them involuntarily at the age of nineteen. Horrified, she'd tried to go home, but Da had reacted poorly. She'd shown him the ring and how the Holy Cross didn't harm her. Why would her beliefs change just because she was dead? She was still her father's darlin' Maggie May. But Da had disowned her, declaring her an unholy creature from hell.</p><p>Maggie sipped her Chocolood, ignoring the pain that still needled her. She didn't want to believe her father was right. She'd been attacked. How could a merciful God blame the victim?</p><p>But then, she'd learned that in order to survive, she would have to bite others. Victimize them. And the fear that her father was right grew like a festering wound. Thank God synthetic blood had been invented. It was so much easier to pretend she was a good person now. She wore the cross-shaped ring on her hand to convince herself her heart was still good, even if it stopped beating each day at dawn.</p><p>Five years earlier, something stupendous had finally put an end to Maggie's dreary existence. Some clever vampires had discovered that a Vamp's image could be recorded using digital technology, and the Digital Vampire Network had been born. Vampires all over the world were a much happier lot now that they were entertained with the vampire Nightly News and Live with the Undead, a celebrity gossip magazine hosted by Corky Courrant. DVN also introduced their wonderful soap operas&amp;#151;As a Vampire Turns, All My Vampires, and General Morgue.</p><p>Then, he had arrived. Four years ago, a new actor had appeared on As a Vampire Turns, and for the first time in Maggie's long life, she was hopelessly in love. Don Orlando de Corazon had burst onto the television screen with a flourish of his black silk cape and a gleam in his dark, passionate eyes, and Maggie was lost. He was the one. The only one for her. And if only he could meet her, he would instantly recognize her as his soul mate. It was her love for him that had given her the courage to audition at DVN. When she'd actually won a role on As a Vampire Turns, it had looked like her dream had come true.</p><p>But her dream had become a nightmare. Before her first day on the set, she'd learned the truth. Each night on her gossip magazine, Corky Courrant exposed Don Orlando for his raunchy, womanizing ways. And Maggie was stuck playing Dr. Jessica Goodwin, one of Don Orlando's many conquests.</p><p>She'd tried to focus on her acting skills and her new career. But each time she had a scene with him, her heart stuttered in her chest. How could she ever hope to get over him when he kept declaring his undying love for her? But it was all fake. Sweet Mary. even his chest hair was fake!</p><p>\"Places!\" the director yelled. \"Let's finish the scene.\"</p><p>Maggie took a deep breath. This was it. In this scene, Don Orlando was supposed to kiss Dr. Jessica. Her first kiss from Don Orlando. It's not real. He probably didn't even know her real name. She stepped into her pretend hospital office, and the makeup girl quickly retouched her powder and lipstick.</p><p>\"Let's start with 'Kiss me and tell me you don't love me,'\" Gordon announced. \"Roll 'em.\"</p><p>Maggie's breath hitched as Don Orlando strode toward her.</p><p>He swept her into his arras. \"Kiss me and tell me you don't love me.\"</p><p>\"You're so cruel to make me suffer,\" Maggie whispered, her knees growing weak. She clung to his shoulders. \"Please let me go.\" Please, kiss me. I've waited four years for this.</p><p>He studied her face as he gathered her tighter in his arms. She closed her eyes and wilted against him. When his lips brushed hers, her body trembled. His mouth was warm and gentle. If only he could be the hero she had dreamed of. If only he could love her. If only he could see the goodness in her and cherish her the way she needed. If only miracles could really happen.</p><p>\"That's great!\" the director announced. \"Cut and print!\"</p><p>With a groan, Don Orlando deepened the kiss. He ran the tip of his tongue over her lips, then feathered soft kisses across her cheek to her ear.</p><p>\"Cut!\" Gordon yelled.</p><p>\"Can you feel it?\" Don Orlando whispered in her ear, then gently suckled her earlobe.</p><p>\"I said cut! Come on, we've got other scenes to do.\"</p><p>Maggie could barely hear the director. Partly because Don Orlando's tongue was in her ear. And also because her heart was pounding incredibly loud. Sweet Mary, he was as wonderful as she'd imagined.</p><p>He nibbled down her neck. \"You're so beautiful. My sweet&amp;#133; Jessica.\"</p><p>With a gasp, she stiffened. She shoved him back. \"My name is Maggie!\"</p><p>Don Orlando smiled. \"Shall we adjourn to my dressing room, sweet&amp;#133; Maggie?\"</p><p>She slapped him hard.</p><p>He stepped back, his eyes wide with surprise. \"What&amp;#151;why?\"</p><p>\"Everything about you is a lie. You're not the world's greatest lover. You're the world's greatest fraud! You're a pig and a&amp;#133; a poser!\" She spun and stomped off the set.</p><p>In his dressing room, Don Orlando grimaced as he peeled the mat of fake hair off his red, raw chest. The world's greatest fraud. Maggie had seen right through him, dammit.</p><p>The first time he'd met her, when she was auditioning, she had gazed at him with such adoration in her blue Irish eyes. She hadn't wanted to use him for her career or profit. Her undemanding acceptance had been the sweetest sensation he'd felt since becoming a vampire four and a half years earlier.</p><p>He'd asked the director to hire her and give her a role that fitted her. Someone with a pure and giving heart. Someone like Dr. Jessica Goodwin. Not only was the doctor the epitome of goodness, she was madly in love with him, Don Orlando.</p><p>But by the time Maggie took her job, she was cold and indifferent. She ignored his attempts at flirtation. He'd tried to show her tonight how he felt with the kiss. And what a kiss! The way she'd melted in his arms, he knew without a doubt that her indifference was feigned. She still adored him. He'd wanted to shout her name to the heavens, but he'd thought the cameras were still rolling, so he'd called her Jessica instead.</p><p>And now, she was upset. He needed to apologize and win her back. If only she would look at him once more with adoration in her eyes. It would make his phony existence so much easier to bear. He pulled on a black silk bathrobe over his bare chest and leather pants and strode down the hall to Maggie's dressing room. What could he say to impress her? Anything but the truth. He wanted her passion, not her pity. He knocked on the door.</p><p>\"Come in.\" Maggie's face drooped with weary annoyance when he entered the small room.</p><p>Damn, he should have brought flowers. For the world's greatest lover, he could sure be an idiot. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Maggie remained sitting in front of her dressing table. \"What do you want?\"</p><p>I want you to love me. No, Don Orlando would never act like a needy wimp. He was macho and aggressive, and it worked. He had stacks of fan mail in his dressing room that confirmed it. Women loved Don Orlando de Corazon, and Maggie would, too. \"I could not stay away. Margaret Mary O'Brian, you have bewitched me.\"</p><p>She snorted. \"So you saw my name on the door. Should I be impressed that you know how to read?\"</p><p>\"Ever since we first met, your lovely name has been etched into my heart.\"</p> <p>\"That sounds painful.\" She leaned over to remove her high-heeled shoes. \"You can cut the melodrama. The cameras are gone.\"</p><p>\"But my passion continues to burn like a raging fire. I have vowed to make you mine.\"</p><p>Her eyes flashed with anger. \"No woman in her right mind would want to be yours. The waiting line is too long.\"</p><p>He winced inwardly. Maggie must be listening to the lies Corky Courrant was spreading on her show Live with the Undead. \"My heart belongs only to you, my sweet Chiquita.\"</p><p>\"I'm not your banana!\" She threw a shoe, aimed at his head.</p> <p>With vampire speed, he dodged the missile. It clunked against the door. \"Ay, caramba, such fiery passion! It sets my loins ablaze!\"</p><p>\"You set my stomach a-hurling!\" She torpedoed the second shoe at him, and it hit him squarely in his chest.</p><p>\"Ouch!\" The stiletto heel had stabbed his raw skin. \"Why are you so angry with me, Maggie?\"</p><p>\"Are you dense? Do you really expect me to be flattered by your slimy attempt at seduction?\"</p><p>\"Slimy?\"</p><p>\"What is this sick compulsion of yours to take every woman in the world to bed?\"</p> <p>\"That's not true.\" He gave her his signature sexy look, the one that coupled a lopsided smile with an arched eyebrow. \"There is no need for a bed. We can be&amp;#133; creative, no?\"</p><p>\"Aagh!\" She jumped to her feet, grabbed a hairbrush off her dressing table, and tossed it at him.</p><p>He muttered a curse as he dodged the brush. Why didn't the act work on her? It did on everyone else. Realization struck him just as a flying, black demi-boot bounced off his head. \"Dammit, you're different. You don't like Don Orlando.\"</p><p>With a sigh, Maggie slumped onto her chair. \"I'm sorry. As old as I am, I should know not to throw things when I'm angry.\"</p><p>He stepped toward her. \"Are you angry because I called you Jessica when we were kissing? I can explain. I thought the cameras were still rolling.\"</p><p>Maggie's cheeks turned pink as she looked away. \"It's not about the kiss. It's&amp;#133; you and all the women&amp;#151;\"</p><p>\"You shouldn't listen to everything Corky says on her show. She's not telling the truth about me.\"</p><p>\"Then it's not true that you had an affair with her?\"</p> <p>He winced. \"Well, that part is true.\"</p><p>\"And you cheated on her?\"</p><p>\"Well, yes, but there were good reasons.\"</p><p>Maggie snorted. \"Reason number one being Tiffany? How many other reasons did you have?\"</p><p>\"It's not what you think.\" Dammit, he didn't want to tell her the truth. Who would believe it? \"I have this problem&amp;#133;\"</p><p>\"I know. Your trousers. They keep falling off.\"</p><p>\"No. It's&amp;#133; me. I don't like to be alone.\"</p><p>She snorted. \"Pardon me while I cry.\"</p><p>\"Maggie, I've been in New York for four years, and I was faithful to Corky till about six months ago. It was one time, when I was angry and frustrated, and Tiffany&amp;#151;\"</p><p>\"Wait a minute.\" Maggie stood. \"Corky makes it sound like you've been with hundreds of women. Thousands.\"</p><p>\"She's furious. She's exacting revenge on me.\"</p><p>\"Why should I believe anything you say?\" Maggie paced across the small room. \"You're a total fraud.\"</p><p>He leaned back against the door. \"I know Don Orlando isn't real. But he saved me. He gave me a reason for living. He made people love me.\" He sighed. \"Even you loved me once.\"</p><p>Maggie slowed to a stop. \"I thought I did, but it was all pretend.\"</p><p>He swallowed hard. \"Pretend is all I have.\"</p><p>\"Nonsense. There has to be a real you.\"</p><p>If only there was. He turned and grabbed the doorknob to leave. \"I'm sorry. I&amp;#133; I wanted you to like me, but&amp;#151;\"</p><p>\"I might like you if I ever got to know you.\" Maggie strode toward him. \"Who are you really?\"</p><p>He leaned his brow against the door and squeezed his eyes shut. He couldn't do it. He couldn't let her see the gaping void inside him. \"I'm Don Orlando de Corazon, the world's greatest&amp;#151;\"</p><p>\"Stop it. If you want me to like you, you have to be honest with me. You have to be your true self.\"</p><p>\"There is no&amp;#133;\" His eyes watered. He couldn't do it. He couldn't subject her to the emptiness. It was hard enough for him to bear. It was the reason he hated to be alone. It was like being with nothing.</p><p>Maggie touched his arm. \"What's wrong?\"</p><p>He took a deep breath. \"I know Don Orlando is fake. Corky invented him so I could be a star. I'm sorry he offends you.\"</p><p>\"Then don't be him,\" Maggie whispered. \"Be yourself.\"</p><p>He snorted. \"I wish I could. I wish I could be worthy of you. I wish I had a soul.\"</p><p>\"Everyone has a soul.\"</p><p>\"Not me. I'm nothing but an empty void.\"</p><p>She stepped back with a frightened look. Of course it scared her. It scared the hell out of him.</p><p>He shrugged. \"Maybe Corky can explain it. If she's willing to be honest with you. She might enjoy spilling my ugly secret.\"</p><p>Maggie gave him a worried look. \"What secret?\"</p><p>\"I can't be myself when I don't know who I am. The stupid role I play is all I have to keep me from slipping into a black hole of nothingness.\"</p><p>\"You mean depression?\"</p><p>\"No.\" Don Orlando grasped the doorknob. \"I have amnesia.\"</p><p>Chapter 2</p><p>After work, Maggie usually teleported to her friends' nightclub called Horny Devils. Her roommates had started the business after winning five million dollars on DVN's first reality show. But tonight, Maggie was too agitated to enjoy the fun. The pain she'd seen in Don Orlando's eyes just before he left haunted her. She paced about her dressing room, replaying the last scene in her head. Could he really have amnesia? Could Corky be lying about the hundreds of women he'd seduced? Maggie didn't know which was harder to believe&amp;#151;a faithful Don Orlando or a forgetful one.</p><p>She needed more information. And the source for all information at DVN was Corky Courrant, former torture expert at the Tower of London during the reign of Henry VIII, and now, the ruthless media queen of the vampire world.</p><p>Maggie headed toward the main offices of DVN. No matter how hard she tried to dismiss Don Orlando from her mind, the man continued to intrigue her. She'd always sensed an aura of mystery about him, and apparently, she was right. He was a mystery, even to himself. He acted cool and confident, but there was a sad vulnerability lurking beneath the facade.</p><p>With a sigh, Maggie realized she'd always been a sucker for lost souls. It had been that same compassion that had driven her to join the Salvation Army in 1884, which had resulted in the attack that had turned her into a vampire. Her friends called her soft heart a blessing, but she suspected it was more like a fatal flaw. Now, once again, her compassionate nature was leading her into the unknown.</p><p>She knocked on a door that boasted a huge sign&amp;#151;Live with the Undead, starring Corky Courrant.</p><p>\"Come in!\" Corky's strident voice screeched.</p><p>Maggie ventured inside.</p><p>\"Oh, it's you!\" Corky's eyes lit up. \"Maggie something.\"</p><p>\"O'Brian.\"</p><p>\"Whatever. I was just watching you slap the shit out of Don Orlando. It's fabulous!\"</p><p>\"Excuse me?\"</p><p>Corky aimed her remote control at a television and pushed a button. \"One of the cameramen just gave me this footage.\" The scene Maggie had played earlier with Don Orlando came on the screen. They were kissing while the director was yelling cut.</p><p>Maggie's mouth fell open. \"How did you&amp;#151;\"</p><p>\"Listen.\" Corky lifted a hand to hush her. On the TV, Maggie slapped Don Orlando, then started calling him names. Corky burst out laughing, her massive breasts bouncing. \"I love it! I'm opening my show tomorrow night with it.\"</p><p>Heat rushed to Maggie's face. \"But that shouldn't have been recorded. Gordon said cut&amp;#151;\"</p><p>\"So? The guys always keep recording when Don Orlando's in the scene. They know I pay good money to catch the bastard in an embarrassing situation.\" Corky used her remote to turn off the TV. \"So, you want to be interviewed for tomorrow's show?\"</p><p>\"Well, I&amp;#151;\"</p><p>\"I don't interview just anybody. But you're smart enough to know what a scumbag Don Orlando is, so I'm giving you a chance.\"</p><p>\"Thank you. That's very kind of you.\" Maggie suspected she'd get more information by playing along. \"I think it's just disgusting the way he cheated on you.\"</p><p>\"And after all I did for him!\" Corky's eyes blazed with anger. \"I made him famous. I made him rich. I made him a household name in the vampire world.\"</p><p>\"Amazing.\"</p><p>\"Yes, I am. He was nothing when I took him in. Nothing!\" Corky's voice cracked with strain.</p><p>Maggie winced. \"I heard he doesn't even have a real name.\"</p><p>\"He doesn't! He was a worthless bum, wandering around New Orleans. He didn't even know what year it was.\"</p><p>\"Then it's true. He has amnesia.\"</p><p>\"So?\" Corky waved a hand in dismissal. \"I made him better than he could ever be on his own. I taught him how to dress, how to act, how to make love. He owes everything to me. If I hadn't come along, he'd still be lying in a gutter somewhere.\"</p><p>\"How terrible.\"</p><p>\"He was pathetic! But I brought him here and made him a star. All out of the goodness of my heart.\" Corky pressed a hand to her breasts, indicating there was a heart somewhere beneath the huge implants. \"Plus forty percent of his gross earnings.\"</p><p>Maggie blinked. \"Forty percent?\"</p><p>\"Why not? I put a lot of time into him. And it's in the contract. The bastard can cheat all he wants, but I still get my forty percent.\"</p><p>Maggie was beginning to see why Don Orlando was upset with Corky. She was using him like a slave. \"I guess he's been cheating on you for a long time.\"</p><p>\"Ha! I know everything that's going on around here. I can make or break careers, Missy, and believe me, I do.\" Corky smiled smugly. \"No one but that stupid bitch Tiffany has ever laid a hand on my Don Orlando. They wouldn't dare.\"</p><p>Sweet Mary! He'd told her the truth! \"Then he hasn't been with hundreds.\"</p><p>\"No, of course not. That's&amp;#133; artistic license. Whenever I claim some bimbos have been with him, they play along. They like the attention. So, do you want that interview or not?\"</p><p>\"Oh, yes. I'd love it.\"</p><p>\"I thought so.\" Corky smirked as she lounged back in her chair. \"Be at Studio Two tomorrow night at eight. And be ready to spill all your nasty gossip about Don Orlando.\"</p><p>\"Of course.\" Maggie opened the door to leave, then hesitated. \"Do you ever wonder who he really is?\"</p><p>\"He's a lowlife pig. What else is there to know?\"</p><p>Everything, Maggie thought. Where did he come from? Did he have a family somewhere? \"I know some guys from MacKay Security and Investigation. I bet they could find out who he is.\"</p><p>\"Why bother?\" Corky began leafing through a stack of papers, clearly bored with the turn of the conversation.</p><p>But Maggie had done enough acting to know what was needed. The proper motivation. \"You want to humiliate him, right?\"</p><p>\"Yes.\" Corky took the bait, dropping the papers on her desk. \"Do you know something embarrassing about him?\"</p><p>\"Not yet. But imagine how awful he would feel if you dredged up some terrible secrets from his past.\"</p><p>Corky's face lit up with a wide grin. \"I love it! We could do an expose, revealing his wretched past. Could you get one of those investigators to go to New Orleans for me?\"</p><p>\"Yes. And I could go as the director. I have experience. I was an assistant director on the reality show last summer.\" Maggie figured this would be the best way to control the content of the report, so it didn't deteriorate into a vicious character assassination. Don Orlando might want to know who he was, but he didn't deserve the sort of massacre Corky had in mind.</p><p>\"Great!\" Corky tapped her long fingernails on the desk. \"I'll talk to Gordon so you can get a few weeks off.\"</p><p>Maggie grinned. It was really happening. She was going to New Orleans to unravel the mystery of Don Orlando. \"I think Don Orlando should go, too. We might uncover something that will trigger his memory.\"</p><p>\"Hmm.\" Corky frowned. \"I don't know. I like to keep him working, so I can make money.\"</p><p>Slave driver. \"But if we discover something really awful, we can record how embarrassed he looks.\"</p><p>Corky perked up. \"Right. Okay, I'll make all the arrangements.\" She reached for the phone. \"See you tomorrow.\"</p><p>Maggie smiled as she strode back to her dressing room. She would call Connor to see if he could spare one of his undead Highlanders from MacKay Security and Investigation. And she imagined how thrilled Don Orlando would be. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's a bad idea,\" Don Orlando protested the next night.</p><p>Maggie huffed. \"Don't you want to know who you are?\"</p><p>\"Not with a cameraman following me around to record every miserable discovery, so Corky can ridicule me before the entire vampire world. No way. It's not happening.\" Don Orlando marched down the hall to Studio Four where As a Vampire Turns was recorded every night. His long black cape swirled around the tops of his black leather boots.</p> <p>\"But I'll be the director.\" Maggie followed him. \"I won't allow you to be ridiculed.\"</p><p>He snorted. \"Right. I saw you on Corky's show tonight.\"</p><p>\"I had to play along. I did it for you.\"</p><p>He stopped and faced her. \"For me? You spent ten minutes on her show, describing the joy of slapping me on the face.\"</p><p>Maggie blushed. \"Corky had us on tape. I could hardly deny doing it.\"</p> <p>\"If you enjoy it so much, go for it.\" He turned his cheek. \"You know I deserve it.\"</p><p>Maggie bit her lip to keep from smiling. \"I'd rather find out who you are. And then, I might want to slap you again.\"</p><p>\"I'm sure you will. I was a bum, Maggie. Hasn't it occurred to you that my wretched past may be better left alone?\"</p><p>\"Why are you assuming your past is wretched? You're a young vampire, aren't you?\"</p><p>He opened the studio door and motioned for her to enter first. \"I was transformed about four and a half years ago.\"</p><p>The refreshment table was crowded with people, so Maggie led him to a quiet corner. \"Don't you see? As young as you are, you could still have family somewhere. Wouldn't it be wonderful to find them? You could even spend Christmas with them.\"</p> <p>\"Right. I can see it now. Merry Christmas, everybody! And by the way, did I tell you I'm a vampire? No need to pass the gravy, just bare your neck&amp;#151;\"</p><p>\"Don't be silly! You would never bite your own family.\"</p><p>\"That's just it, Maggie. Maybe I would. Maybe we'll find out I'm a worthless piece of scum. At least now I only pretend to be one. What if reality is worse than the act?\"</p><p>She made a grab for his arm, and ended up with a fistful of black silk. \"I don't believe that for one minute. If you were truly an awful person, you wouldn't worry so much about it.\"</p><p>He tilted his head, studying her. \"You believe I could be a good person?\"</p><p>\"Yes. And I believe your family would be overjoyed to find out you're still alive&amp;#133; sorta.\"</p><p>\"And what if having an undead family member is more than they can handle?\"</p><p>Maggie's hand dropped from his cape. Get out of my house, you unholy creature!</p> <p>\"Maggie, are you all right?\"</p><p>She shook her head, trying to dispel the memories.</p><p>He touched her arm. \"You look so pale all of a sud&amp;#151;\" His eyes narrowed. \"What happened to you and your family?\"</p><p>She swallowed hard. \"It was a long time ago. I&amp;#133; you have to believe everything will be fine. This is the twenty-first century. People are more open-minded now than they used to be.\"</p><p>He stepped closer. \"Did your family turn you away?\"</p><p>She winced. \"I don't want to talk about it.\"</p><p>\"Oh, Maggie, I'm sorry.\" He took her hand in his. \"They should have realized what a kind heart you have.\"</p><p>Her heart started to pound. Did Don Orlando see what her father had missed?</p><p>He lifted her hand to his chest. \"That's why you're helping me, isn't it? Because you have a sweet and generous spirit. I sensed it the first time we met.\"</p><p>Maggie couldn't think. She was melting under the soft, searching gaze of his golden brown eyes.</p><p>\"Maggie,\" he whispered and raised her hand to his mouth.</p><p>\"Oh, there you are!\" Gordon strode toward them.</p><p>Maggie jerked her hand from Don Orlando's grip and spun to face the director. \"Hello.\"</p><p>\"Corky told me about your trip to New Orleans,\"</p><p>Gordon said. \"She wants you two to leave tomorrow night.\"</p><p>Don Orlando stiffened. \"I haven't decided if I'm going&amp;#151;\"</p><p>\"You have to go.\" Maggie gave him a pleading look.</p><p>\"I was just talking to the writers,\" Gordon continued, \"and we have it worked out so you can leave. They'll get the new script to us in thirty minutes, and we'll shoot it tonight.\"</p><p>\"How will they explain our absence?\" Maggie asked.</p><p>\"It was easy.\" Gordon crossed his arms. \"Dr. Jessica is going to South America to disconnect a pair of twins who are attached at the head. Since you're a world-famous brain surgeon, they wanted you, and you agreed to do it free of charge.\"</p><p>Don Orlando nodded. \"That makes sense. She has such a kind heart. She would always help someone in dire need.\" He lightly touched Maggie's hand with his fingers.</p><p>She glanced at him. Was he referring to her character or to her? Her breath caught when his fingertips gently stroked the length of her fingers. They were standing side by side, their hands hidden in the folds of his cape.</p><p>\"What do you think, Maggie?\" Gordon asked.</p><p>\"It's&amp;#133; fine.\" She was finding it hard to concentrate. Don Orlando wasn't actually holding her hand. He was exploring it. \"What will happen to Don Orlando?\"</p><p>Gordon grimaced. \"That was trickier. He gets so upset about you leaving, he crashes his car into the giant bull on Wall Street, and ends up in a coma.\"</p><p>Maggie blinked. \"A coma? But wouldn't he recover during his death-sleep?\"</p><p>Gordon shrugged. \"It's television. Don't expect it to make sense. We can make the coma last a few days or it can go on for weeks, depending on how much time you need. And we can make the viewers frantic, worrying that he might die at any minute.\"</p><p>Don Orlando nodded. \"I'm okay with it.\"</p><p>\"Great! I'll see how the writers are doing.\" Gordon strode away.</p><p>Don Orlando turned to face her. \"I don't want a cameraman.\"</p><p>Maggie smiled. \"Then you're coming with me?\"</p><p>\"If it's just the two of us, yes. I trust you.\"</p><p>\"Well, Ian MacPhie is coming, too. But you can trust him.\"</p><p>\"I don't know him.\"</p><p>\"He works for MacKay Security and Investigation. I knew him when I lived at Roman Draganesti's house. He looks like an innocent fifteen-year-old, but he's over four hundred, and he really knows what he's doing.\"</p><p>Don Orlando took a deep breath. \"I can't believe I'm agreeing to this. If we find out something awful, Corky will broadcast it to the entire vampire world.\"</p><p>\"She'll never know. Ian and I can keep a secret. Besides, there's not going to be anything awful to discover. It'll be wonderful, believe me.\"</p><p>\"You're an angel, Maggie. I had given up all hope till I met you. And now, I have one hope.\"</p><p>\"That you'll find your family?\"</p><p>\"That would be nice, but since I can't remember them, I don't miss them.\" He took her hand in his.</p><p>\"Then what do you hope for?\"</p><p>He lifted her hand to his lips. \"I hope that when we find out who I am, I'll be worthy of you.\"</p><p>Chapter 3</p><p>Two nights later, Don Orlando arrived at Horny Devils with his duffel bag. By the time his eyes adjusted to the flashing lights of the nightclub, he was surrounded by a crowd of scantily clad lady Vamps who screeched to be heard over the loud music.</p><p>\"Oh, Don Orlando! I just adore your show! And your cape!\"</p><p>\"Why are you wearing a shirt?\"</p><p>\"Can I have your autograph?\"</p><p>A dozen cocktail napkins were thrust at his face. He reached into his inner coat pocket for a pen while he scanned the renovated warehouse for Maggie.</p><p>\"Me first!\" A napkin grazed his nose. A blond Vamp dressed like a cheerleader stepped in front of him, blocking his way.</p><p>He blinked. There was something disconcerting about a cheerleader with fangs.</p><p>She curled a hand around his arm, her long fingernails digging in like grappling hooks. \"Do you need a girlfriend?\"</p><p>\"No, thank you.\" He wished he could publicly claim Maggie as his girlfriend, but she'd probably throw another shoe at his head. Still, she had to care about him, right? She'd arranged this trip to find out who he was. Where was she?</p><p>\"Enough, ladies!\" A striking woman with purple hair shouted over the loud music. \"You don't want to miss our new dancer.\"</p><p>With a triumphant yell, the cheerleader released him and skipped toward the stage. The other women joined her, bouncing to the rhythm of a pounding drum. The stage curtains were whisked back to reveal a man wearing an Indian headdress, war paint, and little else. The women screamed.</p><p>Don Orlando breathed deeply. Thank God he was no longer the center of attention. He smiled at the purple-haired woman. \"Are you one of Maggie's friends? I'm supposed to meet her here.\"</p><p>\"She's in the office, waiting for you.\" The woman assessed him with narrowed eyes. \"So, you're the famous Don Orlando.\"</p><p>\"How do you do?\" He extended a hand.</p><p>She took it and yanked him toward her so suddenly, the strap of the duffel bag slid off his shoulder. \"My name is Vanda, and if you hurt Maggie, I'm coming after you.\"</p><p>\"I would never hurt her.\" Not intentionally, though he was worried that she could find the truth about him disappointing. He shoved his duffel bag back onto his shoulder.</p><p>\"Let me in!\" A young voice bellowed at the front door.</p><p>\"Get lost,\" the bouncer yelled. \"You're underage.\"</p><p>\"I'm 479 years old, ye moron.\"</p><p>\"Hugo!\" Vanda shouted. \"He's okay. Let him in.\"</p><p>The huge guard stepped back, grumbling. \"Well, he looks like he's twelve.\"</p><p>\"Do not,\" the youthful-looking vampire hissed as he strode into the club.</p><p>No, he didn't. Don Orlando figured he looked more like fifteen. Black curly hair framed his smooth face, and a red plaid kilt swished about his knees as he walked toward them. \"You must be Ian MacPhie.\"</p><p>\"Aye, and ye must be Don Orlando.\" He shook hands, then turned to Vanda. \"Ye're looking as lovely as ever.\" He took her hand and attempted to kiss it.</p><p>With a laugh, she pulled her hand away and ruffled his hair. \"Come on. Maggie's waiting.\" She strode to the office.</p><p>\"Thanks for helping with the investigation.\" Don Orlando noted the Scotsman's eyes were riveted on Vanda's swaying hips.</p><p>\"I like to stay busy. It keeps my mind off&amp;#133; things.\" Ian glanced at the wiggling women in front of the stage.</p><p>Don Orlando suspected those \"things\" were women. It had to be hard to be stuck for all eternity with the raging hormones of a fifteen-year-old boy.</p><p>\"I talked to the New Orleans coven master last night. He should be calling shortly. And I have the phone numbers of every coven master in America.\" Ian patted the leather pouch that hung from his waist. \"We'll be able to teleport to any major city.\"</p><p>\"That's good.\" Especially since Don Orlando had no idea where he was originally from.</p><p>Vanda stopped at a door with the words office painted on front. \"Good luck finding out who you are.\" She turned to Ian. \"You behave yourself in New Orleans, sweetie.\"</p><p>He gave her an exasperated look. \"I'm older than you.\"</p><p>She laughed. \"I know, but you look so sweet.\" She patted his cheek, then walked away.</p><p>Ian groaned, then pushed open the door.</p><p>\"Don Orlando, Ian!\" Maggie grinned as they entered the room. She was standing by the desk, holding the phone. \"Colbert GrandPied just called. They're awake in New Orleans.\"</p><p>\"Good. I'll go first.\" Ian stepped close to Maggie and leaned toward the phone. \"Colbert, keep talking. I'm on my way.\"</p><p>Ian's form wavered, then vanished. Don Orlando understood the maneuver in theory. A Vamp could teleport long distances by using someone's voice as a beacon. Still, he had never executed the feat on his own before. He'd been half-starved and confused when Corky had teleported him to New York years earlier.</p><p>\"Are you ready?\" Maggie asked.</p><p>He hovered near the phone, listening to Colbert's French-accented voice. A wave of dread washed over him. What was he doing, going back to New Orleans? It was the home of his worst nightmare, where he'd lost his memory and mortality.</p><p>\"Maggie,\" he whispered, \"this is difficult.\"</p><p>Her pretty blue eyes widened with concern. \"Don't worry.\" She lay the receiver down and punched on the speaker phone. Colbert's deep voice filled the room. Having run out of things to say, he was now singing \"Au Claire de la Lune.\"</p><p>Maggie slipped a tote bag onto her shoulder, then took hold of Don Orlando's hands. \"I'll go with you. Every step of the way.\" She smiled. \"You'll be sick of me before this is over.\"</p><p>\"No, never.\" He tightened his grip on her hands and focused on Colbert's melodic voice. \"I don't deserve you, Maggie.\"</p><p>\"You deserve happiness.\" Her body slowly disappeared.</p><p>Happiness is being with you was his last thought before everything went black. He could still feel her presence and hear Colbert's voice becoming closer and louder. The thud of his feet on solid ground signaled his arrival. Ian was there, standing next to Colbert. Maggie's image shimmered, then sharpened into her real body, her hands still clasped in his own.</p><p>\"Bonsoir, mon ami,\" Colbert nodded at him, then studied Maggie. \"Enchante, ma petite. And you are?\"</p><p>Mine. A rush of Possessiveness swept over Don Orlando. He knew Colbert was famous for seducing beautiful women, so he sidled close to Maggie and draped an arm around her shoulder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Smiling, she glanced at him, then turned to Colbert. \"I'm Maggie O'Brian. Thank you for letting us stay with your coven.\"</p><p>\"My pleasure, cherie.\" Colbert bowed gracefully. \"Ian tells me you have come to discover Don Orlando's true identity.\"</p><p>\"Yes.\" Don Orlando dropped his duffel bag on the floor as he glanced around. They appeared to be in an abandoned warehouse. Empty, broken crates littered the floor. The smell of coffee competed with the odors of mold and dust. This was far from the elegant wine cellar he remembered. \"You moved?\"</p> <p>\"Oui.\" Colbert sighed. \"Our beloved wine cellar was flooded with the last hurricane. So much was ruined&amp;#151;many of our valuable antiques and all our lovely coffins.\"</p><p>\"I'm so sorry,\" Maggie murmured.</p><p>\"I was fortunate to find this old coffee warehouse.\" Colbert pointed at the far walls. \"You can still see the watermark where the ground floor flooded, but we discovered the second floor was safe and dry. More importantly, it has no windows and no other exits. The government gave us a few cots and blankets, but it is not the same as the old days.\"</p><p>\"Wait a minute,\" Don Orlando interrupted. \"You received government aid?\"</p><p>Colbert shrugged. \"I filled out the proper paperwork.\" He gestured toward the second floor. A small balcony surrounded the closed door. \"That is where we hide during the day.\"</p> <p>Ian pointed at the heap of broken wood beneath the balcony. \"Was that the staircase? Ye tore it down?\"</p><p>\"Oui. So no mortal can disturb us during our death-sleep.\"</p><p>Ian nodded. \"A good plan. Now, if you doona mind, I'd like to get started with the investigation.\"</p><p>\"But of course.\" Colbert smiled slightly at Don Orlando. \"I must confess, I have long been curious about the identity of our Bootsie.\"</p><p>\"Bootsie?\" Maggie asked.</p><p>Don Orlando winced. This was going to be embarrassing.</p> <p>\"We didn't know what to call him,\" Colbert explained. \"So we named him after the pair of boots he was wearing.\"</p><p>\"What kind of boots?\" Ian asked.</p><p>\"Alligator, I believe.\"</p><p>\"No, I mean what kind,\" Ian pressed. \"Were they work boots, hiking boots&amp;#151;\"</p><p>\"Ah.\" Colbert nodded. \"They were cowboy boots.\"</p><p>Don Orlando blinked. \"I&amp;#151;I'm a cowboy?\"</p><p>\"You don't remember your boots?\" Maggie asked.</p><p>He gritted his teeth. \"No, if you recall, I have amnesia.\"</p> <p>She huffed. \"I know, but you must have been wearing them when you were transformed, after you already had amnesia.\"</p><p>\"I see your point, cherie,\" Colbert conceded. \"But Scarlett and Tootsie didn't like the way Bootsie was dressed, so they changed his clothes before transforming him. He was unconscious at the time, so it is no wonder he cannot remember.\"</p><p>\"Scarlett and Tootsie?\" Maggie turned to Don Orlando with an irritated look. \"Two women transformed you?\"</p><p>Don Orlando groaned. \"It's a long story.\"</p><p>\"Wait,\" Ian interrupted. \"Do ye still have his old clothes?\"</p><p>Colbert rubbed his dimpled chin. \"Perhaps. We grabbed as much as we could when we evacuated. I'll have to ask Giselle.\"</p><p>\"Do that,\" Ian ordered. \"We might discover some clues from his clothes. And I need to interview Scarlett and Tootsie.\"</p><p>\"Must you?\" Don Orlando grumbled.</p><p>\"But of course.\" Colbert smiled at Don Orlando. \"They've been eagerly awaiting your arrival. They're practically swooning from all the excitement.\"</p><p>\"They're always about to swoon,\" Don Orlando growled.</p><p>Colbert laughed. \"I'll fetch them and find Giselle. A bient&amp;ocirc;t, mes amis.\" He levitated to the second-floor balcony, then opened the door. \"Scarlett, Tootsie, he's here!\"</p><p>High-pitched squeals responded.</p><p>Maggie shot Don Orlando an annoyed look. \"You didn't tell me you had girlfriends here.\"</p><p>He considered climbing into one of the empty crates.</p><p>\"He's here! Our little Bootsie is back!\" A slim male Vamp ran onto the balcony. His eyes lit up when he spotted Don Orlando, and his scarlet-tinted lips broke into a wide grin.</p><p>Don Orlando grimaced. The hurricane hadn't destroyed Scarlett's clothes. He was wearing his usual white leather miniskirt and black fishnet stockings. His red satin bustier matched the red feather boa around his neck. His large feet were crammed into red patent leather pumps.</p><p>\"Sweet Mary and Joseph,\" Maggie whispered. Her tote bag fell to the floor.</p><p>\"Damn,\" Ian muttered, stepping back.</p><p>\"Woo-hoo, Bootikins!\" The Vamp waved at Don Orlando with the end of his boa. He glanced back. \"Tootsie, stop worrying over your lipstick. You're keeping Bootsie waiting.\"</p><p>\"I'm coming!\" A deep male voice boomed from the upstairs room.</p><p>\"Don't rush yourselves on my account,\" Don Orlando yelled.</p><p>Maggie turned to him, grinning. \"Tootsie and Bootsie? You must have made a lovely couple.\"</p><p>\"Don't go there.\" Don Orlando muttered. \"Believe me, I didn't.\"</p><p>\"Bootikins!\" A male Vamp, wearing a red velvet costume, leaped onto the balcony. White fur trimmed the short skirt, neckline, and sleeves. A big white pompom hung from his red Santa hat, and his elf shoes were adorned on the tips with jingle bells. \"Bootsie, you look gorgeous.\" He struck a pose. \"Don't you love my new outfit? I look just like a Rockette.\"</p><p>\"Yeah, right,\" Don Orlando grumbled.</p><p>Scarlett and Tootsie floated down to the first floor, the boa fluttering and bells jingling. They landed gracefully, then rushed toward Don Orlando. He stood still as they each embraced him and kissed his cheeks.</p><p>\"What?\" Scarlett whimpered. \"No hugs or kisses for us?\"</p><p>Don Orlando patted his shoulder. \"It's good to see you again.\"</p><p>Tootsie dabbed at his eyes with a lacy hanky he'd pulled from his sleeve. \"Our little boy has come home. I'm going to swoon, I just know it.\"</p><p>\"There, there.\" Scarlett gave Tootsie a stern look. \"We mustn't upset Bootikins now that he's home.\" He turned to Don Orlando with a trembling smile. \"We're so proud of you! Our little Bootsie, a famous TV star.\"</p><p>Tootsie sniffled. \"I just love your cape.\"</p><p>\"Oh, me too!\" Scarlett stepped close. \"But we wanted to talk to you about that. Must you always wear black, sweetie? I think scarlet or plum silk would be so smashing.\"</p><p>\"Excuse me.\" Ian raised a hand to get their attention. \"We need to get down to business. Now, is it true that ye're the ones who transformed Don Orlando?\"</p><p>\"Oh, my!\" Tootsie eyed Ian. \"Your young friend with the sexy kilt and adorable accent is so serious and&amp;#133; aggressive.\" He shuddered. \"I don't know whether to be appalled or excited.\"</p><p>Don Orlando cleared his throat. \"Allow me to introduce my friends from New York. This is Ian MacPhie and Maggie O'Brian.\"</p><p>\"Oh, yes!\" Scarlett grabbed Maggie's hand and shook it. \"You're Dr. Jessica from As the Vampire Turns. We think it's marvelous how you're going to South America to help those poor conjoined twins.\"</p><p>\"But I&amp;#151;\" Maggie started.</p><p>\"I start crying every time I think about it.\" Tootsie wiped his eyes. \"Tell me, was the surgery a success?\"</p><p>Maggie gave Don Orlando a confused look. \"Ah, yes, the twins are doing great.\"</p><p>\"Oh, God bless them!\" Scarlett pressed a hand to his flat chest.</p><p>\"I'm so happy, I'm going to swoon from joy,\" Tootsie added.</p><p>\"Could we get back to business?\" Ian asked. \"No swooning until I can interview you.\"</p><p>\"Oh, he's so forceful.\" Tootsie shivered.</p><p>\"You're such a lovely girl.\" Scarlett touched Maggie's chin-length black hair. \"You know, not many of us can look good in a bob. But if I may suggest, some blue highlights would be so lovely for you. Don't you think so, Tootsie?\"</p><p>\"Yes, it would bring out the blue of her eyes.\"</p><p>\"Business!\" Ian shouted. \"Before the sun rises, please.\"</p><p>\"Oh, you're an animal,\" Tootsie purred as he slinked over to Ian. \"Like a fierce young Scottish wildcat.\"</p><p>\"Touch me and I'll break yer arm,\" Ian growled, folding his arms across his chest. \"Now, we're here to discover the true identity of&amp;#133; Bootikins.\" His mouth twitched.</p><p>Maggie giggled.</p><p>Don Orlando glared at them both.</p><p>\"Which one of ye found Bootsie first?\" Ian asked.</p><p>\"That would be me,\" Scarlett confessed. \"Tootsie and I were taking our nightly stroll around Jackson Square. I'd already had some bottled blood for dinner, so I wasn't very hungry. But then I saw sweet little Bootsie sitting on the steps of the cathedral. He. looked so sad and beautiful with his wavy black hair and big golden brown eyes, I couldn't help myself. I thought, perhaps, a little nibble wouldn't hurt&amp;#151;\"</p><p>\"You bit him?\" Maggie looked appalled.</p><p>\"Well&amp;#133; yes.\" Scarlett blushed a becoming shade of scarlet. \"But Tootsie bit him, too.\"</p><p>Tootsie gave his companion a recriminating look. \"Well, I couldn't let you have all the fun. Besides, he looked so marvelously tragic, like a dying Camille. How could we resist?\"</p><p>Scarlett sighed. \"I'm afraid we got a little carried away.\"</p><p>\"A little?\" Don Orlando glared at them. \"You put me in a coma.\"</p><p>\"But only because we liked you!\" Tootsie exclaimed.</p><p>\"We didn't do it right away.\" Scarlett blew red feathers away from his mouth. \"You were fine when we tried to erase your memory. That's when we discovered you had no memory at all.\"</p><p>\"And that's when Scarlett came up with the plan,\" Tootsie added.</p><p>\"My plan?\" Scarlett huffed. \"You went along with it.\"</p><p>\"What plan?\" Ian demanded.</p><p>Tootsie hung his head. \"I know we shouldn't have&amp;#151;\"</p><p>\"No, you shouldn't have,\" Don Orlando growled.</p><p>Scarlett's red lips trembled. \"We said we were sorry.\"</p><p>Tootsie dabbed at his eyes with his hanky. \"We begged you to forgive us, but you left for New York with that horrid woman and wouldn't forgive us. You wouldn't even talk to us.\"</p><p>\"Oh, how sad.\" Maggie patted Tootsie's shoulder. \"I'm sure he's forgiven you.\" She gave Don Orlando a reproachful look. \"You have, haven't you?\"</p><p>\"Maggie, they murdered me!\"</p><p>She shrugged. \"So, you were having a bad day.\"</p><p>\"What?\"</p><p>\"I don't mean to sound cold.\" She squeezed his arm. \"But we were all murdered at some point. It's the nature of our existence. If you want to be happy, you need to get over it and forgive them. You could have a wonderful future ahead of you.\"</p><p>Tootsie nodded. \"You should listen to her. She's a very wise doctor.\"</p><p>\"Just look at how she saved those twins in South America,\" Scarlett added with a sniff.</p><p>Don Orlando sighed. Tootsie and Scarlett kept confusing Maggie with the doctor she played on TV, but they were right. In her own way, Maggie was healing him. And she was right. An eternity of bitterness would make him miserable.</p><p>He glanced at Tootsie and Scarlett. They were both sniffling, their bottom lips trembling, and their eyes watery with regret. \"All right, I forgive you. In fact, I'm downright delighted to be a vampire.\"</p><p>\"Really?\" Scarlett wiped a tear from his rouged cheek.</p><p>\"Yes.\" Don Orlando turned to Maggie and clasped her hands in his. \"If I hadn't become a vampire, I would have never met this beautiful, courageous, and wise woman. Maggie, you were definitely worth dying for.\"</p><p>Her mouth fell open and her eyes widened. When he tugged her forward, she willingly came into his arms. He held her tight and kissed the top of her head. So what if he had no memories? He could build an eternity of memories with Maggie.</p><p>\"Oh, my!\" Scarlett fanned himself. \"This is so romantic.\"</p><p>\"Oh, yes!\" Tootsie pressed a hand to his forehead. \"I'm going to swoon.\"</p><p>\"No ye're not,\" Ian ordered. \"Ye never told us about the plan.\"</p><p>\"Oh, you're so demanding.\" Tootsie shuddered. \"You're like a Scottish terrier with a bone.\"</p><p>\"Mmm, a very large bone.\" Scarlett smiled slyly as he regarded Ian's kilt.</p><p>\"The plan?\" Ian growled.</p><p>\"Well, there's no need to get all huffy.\" Tootsie gave him an injured look. \"We simply wanted to make Bootsie like us.\"</p><p>\"Like a vampire?\" Ian asked.</p><p>\"No.\" Don Orlando glared at his makers. \"They wanted to make me just like them. They took my comatose body back to the wine cellar and put me in a damned dress.\"</p><p>Tootsie scoffed. \"You needn't growl at us. You said you've forgiven us.\"</p><p>\"And it was a very nice dress,\" Scarlett added. \"An ivory silk gown with extensive beadwork on the bodice.\"</p><p>\"It was a freaking dress,\" Don Orlando growled. \"I woke up the next night to find out I was undead and wearing a dress!\"</p><p>Maggie covered her mouth to hide a smile.</p><p>\"It wasn't funny,\" Don Orlando grumbled.</p><p>\"I'm sure you looked very nice.\" Maggie wrapped her arms around his middle, and he forgot all about being angry.</p><p>\"So.\" Ian gave the two male Vamps a disapproving frown. \"Yer plan was to take a mortal with no memory, transform him, and convince him that he was a gay transvestite?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tootsie huffed. \"You needn't make us sound so Machiavellian. We gave him our best gown.\"</p><p>\"A Vera Wang,\" Scarlett added. \"And the big brute ripped it when he tore it off.\"</p><p>Ian arched an eyebrow at Don Orlando. \"I take it their little experiment dinna work?\"</p> <p>\"No. Even without a memory, I knew I was straight.\"</p><p>Ian's gaze lifted to the balcony and his mouth fell open. Don Orlando wasn't surprised. Giselle usually had that effect on men. She was standing on the balcony, dressed in a shimmering white gown, her white-blond hair cascading down her back. In her arms was a bundle of clothes.</p><p>\"Bonsoir.\" She smiled as she floated down to the ground floor. \"I have located Bootsie's old clothes.\" She sauntered past them to a small seating area.</p><p>Two Louis XVI chairs and a gold satin settee surrounded a scarred coffee table. Giselle dumped the clothes on the table, then perched on one of the chairs. Scarlett and Tootsie rushed over and sat together on the settee. Maggie and Ian followed them. Don Orlando gathered his duffel bag and Maggie's tote bag and set them on the floor next to the vacant chair.</p><p>\"Thank ye for finding the clothes.\" Ian smiled and extended a hand to Giselle. \"I'm Ian MacPhie from New York.\"</p> <p>\"Enchantee.\" She removed her hand from his grip before he could kiss it.</p><p>With a sigh, Ian turned to examine the clothes on the table.</p><p>Scarlett lifted a plaid Western shirt between his thumb and forefinger and shuddered. \"How horrid.\"</p><p>Don Orlando picked up the boots. They were worn and scruffy. Had he really been a cowboy?</p><p>\"This is interesting,\" Ian removed a belt from the pile and studied the buckle.</p><p>\"It's huge.\" Maggie moved closer to Ian to get a better look. \"What's that embossed on front? A wild horse?\"</p> <p>\"A bronco.\" Don Orlando blinked when he realized the word had escaped without forethought. He must really be a cowboy.</p><p>Ian turned the buckle over. \"There's an inscription. FORT WORTH LIVESTOCK SHOW AND RODEO 1999. This could be useful.\" He turned to Giselle. \"Is there a computer here I can use?\"</p><p>\"Yes, on the second floor.\" She rose. \"I'll take you.\"</p><p>\"Thank you.\" Ian followed Giselle to the balcony, then they levitated to the second floor. Scarlett and Tootsie dashed over at vampire speed to get a glimpse under Ian's kilt.</p><p>Don Orlando cleared his throat. They gave him sheepish looks.</p><p>Ian glanced down from the balcony. \"Ye four should keep working. The clues are there, if ye think hard enough.\" He followed Giselle into the upstairs room and shut the door.</p><p>\"What clues?\" Tootsie's shoes jingled as he and Scarlett trudged back to the settee.</p><p>\"I've always wondered how I got amnesia.\" Don Orlando sat in one of the antique chairs.</p> <p>\"His mind was a complete blank when you found him?\" Maggie asked Tootsie and Scarlett. They nodded.</p><p>\"Then the amnesia must have happened that night,\" Don Orlando concluded.</p><p>\"Exactly,\" Maggie agreed. \"It must have just happened or you would have had a little memory. And it must have happened very close to where you were found.\"</p><p>\"Somewhere in the French Quarter?\" Tootsie offered.</p><p>Maggie turned to the male Vamps on the settee. \"Did Don Orlando have a head injury of any kind?\"</p><p>\"No, he was perfect.\" Scarlett grimaced. \"I always suspected it had something to do with\"&amp;#151;he lowered his voice to an ominous whisper&amp;#151;\"the Dark Arts.\"</p><p>Tootsie gasped and pressed a hand to his chest. \"Don't make me swoon.\"</p><p>Don Orlando sat back as a feeling of dread seeped into his pores.</p><p>\"You mean magic?\" Maggie asked. \"Or witches?\"</p><p>Scarlett and Tootsie exchanged a worried look and shuddered.</p><p>\"They mean voodoo,\" Don Orlando whispered.</p><p>\"Is that real?\" Maggie asked.</p><p>\"It's real if you believe in it,\" Tootsie whispered.</p><p>Maggie glanced at Don Orlando. \"Do you believe in it?\"</p><p>\"I don't know. I can't remember.\"</p><p>\"Well.\" Maggie lifted her chin. \"I'm not afraid. And it stands to reason that if the amnesia is the result of some kind of spell, then there must be another spell that can undo it. We should locate the local practitioner and see what he can do.\"</p><p>Scarlett's mouth fell open. \"You're not getting me to see a voodoo priestess.\"</p><p>Maggie gave him a stern look. \"Not even for Bootsie?\"</p><p>Tootsie grabbed Scarlett's hand and held tight. \"We can take you to the French Quarter where the local shops are, but we don't want to go inside.\"</p><p>\"Very well.\" Maggie stood. \"Let's go.\"</p><p>Don Orlando smiled. What a fierce little fighter she was. He couldn't imagine living through eternity or even a single night without her. His smile faded as he realized the full impact of his feelings. He was in love with Maggie O'Brian.</p><p>She gave him a worried look. \"Are you all right?\"</p><p>\"Never been better.\" He took her hand. \"Let's go.\"</p><p>Chapter 4</p><p>\"Sweet Mary, my feet hurt.\" Maggie leaned against an old streetlamp. It must be after three in the morning, and they'd been to one shop after another. Scarlett and Tootsie had abandoned them on Bourbon Street when they spotted a club with scantily clothed gentlemen dancing on the bar.</p><p>Don Orlando's gaze ran over her short black skirt, her legs encased in black hose, and her black high-heeled shoes. \"You could cause a traffic accident with those legs.\"</p><p>She scoffed. \"I'm too short.\"</p><p>\"You're beautiful.\" His gaze locked onto her pink sweater.</p><p>The cad. Maggie was still surprised that he'd never had a girlfriend during his stay in New Orleans. Tootsie and Scarlett had confirmed that. She also understood why he'd run off to New York with Corky. The poor guy had simply wanted a life and an identity other than Bootsie, the failed social experiment.</p><p>Sweet Mary, she liked him. More than liked him. He was sweet and caring. Strong, yet vulnerable. And most of all, he thought she was special. Beautiful and kindhearted.</p><p>With a sigh, she glanced down the street. A recent rain had left puddles in the uneven pavement. The air was warm and thick against her skin. She was worried now. Worried that she was hopelessly in love with Don Orlando. What if they found out he was married?</p><p>\"I think we did all the shops on this street,\" she murmured. They'd been simple tourist shops, selling T-shirts, feather boas, beads, and masks. She pushed away from the streetlamp. \"Where's a voodoo priestess when you need one?\"</p><p>\"Don't know.\" Don Orlando took her hand. \"Let's find Tootsie and Scarlett.\" He led her down the sidewalk.</p><p>\"Are we going the right way?\" They'd ventured up and down so many streets, Maggie was all turned around.</p><p>\"Yep. Bourbon Street's over there.\" Don Orlando pointed to the right. \"Here's a side street where we can cut through.\"</p><p>They turned onto the dark narrow street, lit by one storefront window.</p><p>\"Did we check this place?\" Maggie slowed to examine the goods in the store window. The usual stuff&amp;#151;beads and boas. Little stuffed alligators wearing Santa hats. \"Oh, look.\"</p><p>Don Orlando chuckled at the large box of voodoo dolls. \"The economy pack. Twenty-four voodoo dolls at one low price.\"</p><p>\"Sweet Mary. You could take care of all your enemies in one fell swoop. Let's go in.\"</p><p>He gave the door a shove, and it opened. A tiny bell tinkled overhead. \"Hello?\"</p><p>Maggie followed him inside. The door swung shut with another tinkling noise. The narrow store was dimly lit. One side held the usual touristy stuff, but the other wall was covered with glassed-in shelves. She eased closer for a better look.</p><p>\"Ugh!\" She stepped back. The shelves held glass jars filled with things that looked like pickled animals and body parts.</p><p>\"Looks like we found the right place,\" Don Orlando said.</p><p>\"That depends on what you seek,\" a male voice spoke from the back of the room.</p><p>Maggie gasped and edged closer to Don Orlando.</p><p>There was a scratch of a match, then a small flame traveled from one candle to another till three large ivory pillars illuminated the back of the room. The candles rested on a counter, and behind them, a bald black man stood.</p><p>Don Orlando cleared his throat. \"Can you help us?\"</p><p>The man bowed his head. \"Those who come at three in the morning are generally in need of my help.\" His voice had a deep, hypnotic quality to it. \"Come forward so I may see you.\"</p><p>Maggie followed Don Orlando as they neared the counter and the glowing pool of candlelight.</p><p>Suddenly, the black man stiffened. \"Pierce?\"</p><p>Don Orlando halted. \"Are you talking to me?\"</p><p>\"Of course, man. Don't you remember&amp;#151;\" The man's eyes widened. \"Oh, God, you don't.\" He ran a hand over his bald head. \"Store's closed. Come back tomorrow.\" He blew out a candle.</p><p>\"Wait!\" Don Orlando ran toward him. \"You know who I am.\"</p><p>\"No, no. I mistook you for someone else.\" He blew out a second candle. \"Go now. The store is cl&amp;#151;\"</p><p>\"No!\" Don Orlando grabbed the last lit candle and held it away from the store owner. \"Tell me who I am.\"</p><p>The man shook his head. \"I told you, man, I don't know.\"</p><p>\"You do.\" Don Orlando passed the candle to Maggie, then reached over the counter, grabbed a handful of the man's shirt, and lifted him off the floor. \"You will tell me.\"</p><p>\"Damn,\" the store owner wheezed. \"How'd you get so strong? Okay. I'll tell you.\" He gasped for air when he landed back on the floor. \"Sheesh, man. You don't even remember your name?\"</p><p>\"I remember nothing.\"</p><p>\"Damn!\" The store owner hit the counter with the flat of his hand. \"I told her she was making the potion too strong, but does she ever listen to me? Nooooo. Three bat wings she put in the potion, not two like the book says. Three! And that eye of newt?\" He raised his hands, shaking his head. \"She should have never added that. I told her she was asking for trouble.\"</p><p>\"Enough!\" Don Orlando grabbed the candle from Maggie and set it down with a thud. The flame lurched and flickered wild shadows across the gruesome glass jugs. \"Who am I?\"</p><p>\"You're Pierce. Pierce O'Callahan.\"</p><p>Don Orlando gave Maggie a stunned look. \"I'm Irish?\"</p><p>The store owner muttered another curse. \"I told her she was making it too strong. She's always causing me trouble.\"</p><p>Don Orlando glared at him. \"Who are you?\"</p><p>\"Durand Derange.\" With a sigh, he turned to the wall behind him and flipped on the lights.</p><p>The jars looked even more ghoulish under the flickering, purplish fluorescent light. Maggie could detect animal feet and eyeballs. \"How did you erase Don Orlando's memory? I mean, Pierce.\" It would take a while to get used to his new name.</p><p>\"More importantly,\" Pierce added, \"can you make another potion to restore my memory?\"</p><p>\"Ah, man. I don't think so. Once it's gone, it's gone.\"</p><p>Pierce leaned over the counter. \"The woman who made the potion, can she undo it?\"</p><p>Durand's gaze flitted to his left. \"I don't know where she is. She left before the hurricane and hasn't come back.\"</p><p>\"Who is she?\" Pierce ground out.</p><p>\"My sister. Desiree.\" His gaze slipped to the left again.</p><p>Maggie glanced to his left and spotted a photo frame stuffed between two jars. She eased over for a closer look.</p><p>\"Desiree is crazy, you know. Whatever she wants, she gets.\" Durand shrugged. \"And she wanted you, man.\"</p><p>That figured. Maggie groaned inwardly. Even as a mortal, Don Orlando, or Pierce, would have attracted a ton of girls. The photo on the dusty shelf showed a beautiful young woman with glowing bronze skin, wearing a white sun dress. Beside her stood a little girl, also in a white dress. \"Is this Desiree?\"</p><p>\"Don't look at that.\" Durand dashed over, grabbed the photo, and stuffed it under the counter. He glanced back at Pierce. \"I told you who you are. You should go now.\"</p><p>What was he hiding? \"Why don't you let Pierce see the photo?\" Maggie asked. \"It might jog his memory.\"</p><p>\"No, no.\" Durand shook his head. \"The photo cannot help. She erased herself completely from his memory.\"</p><p>\"Why?\" Pierce thumped the counter with his fist. \"What could I have possibly done to deserve amnesia?\"</p><p>\"Nothing, man.\" Durand shrugged. \"Desiree was visiting a cousin in Dallas, and they went to a rodeo. That's where she saw you and decided she had to have you. Don't ask me why. She's never wanted a cowboy before.\"</p><p>\"Then I was a cowboy?\" Pierce asked. \"In a rodeo?\"</p><p>\"Sure, man. I hear you were really good.\"</p><p>\"And Pierce started dating your sister?\" Maggie asked.</p><p>\"No, no.\" Durand shook his head. \"Pierce didn't even know who she was till she slipped a love potion into his beer. Unfortunately, she always makes her potions too strong.\"</p><p>\"So, she tricked Pierce into loving her?\" Maggie balled her hands into fists. It was a good thing Desiree was out of town.</p><p>\"Yeah,\" Durand continued. \"Poor old Pierce was completely under her spell. When she got tired of him and came home, he followed her here. Eventually, she got so tired of him, she decided to erase herself from his memory.\"</p><p>Maggie clenched her fists tighter. How could any woman possibly grow tired of Don Orlando? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Pierce cursed under his breath. \"She didn't erase just herself. She erased everything!\"</p><p>\"I'm sorry, man.\" Durand lowered his head. \"I told her that eye of newt was too much.\"</p><p>\"And you really don't know where she is?\" Maggie considered slipping inside his mind to see if he spoke the truth.</p> <p>\"She left before the hurricane. Met some bigwig from Hollywood who said he'd make her a star.\" Durand scowled. \"She left me to clean everything up. Left me all alone to work this damned store.\"</p><p>Pierce's laugh sounded pained. \"Sounds like a great gal. I'm glad I don't remember her.\" He strode toward the front door.</p><p>Maggie started toward the door, but something prickled at her senses. She was missing something. She slowed to a stop and glanced back at Durand. \"Who's the little girl in the photo?\"</p><p>He gulped. \"Don't know what you're talking about.\"</p><p>\"The little girl in the photo, standing next to Desiree.\" Maggie wandered back toward Durand. \"Who is she?\"</p> <p>\"She&amp;#151;she's a cousin. We have so many.\" He grabbed a ring of keys from under the counter. \"I need to lock up now.\"</p><p>Maggie focused her thoughts and concentrated on Durand's bald head. With a swoosh, she invaded his mind.</p><p>He gasped and stumbled back. The key ring fell and hit the floor with a jangle. Maggie walked toward him as she sifted through the images in his mind.</p><p>Durand retreated till he bumped into the back wall. \"Oh, God. You're one of the nightwalkers.\"</p><p>\"Then you know what we can do,\" Maggie whispered. She scoured his mind, finding images of Desiree with a baby.</p><p>\"Damn.\" Durand glanced at Pierce. \"You're one, too? That's how you picked me up.\" He grabbed ajar from the shelf behind him and poured a line of red dust along the counter.</p> <p>Instantly, Maggie was shut out of his head. How had he managed that? \"Who is the little girl?\"</p><p>Pierce joined her. \"Tell us the truth, Durand.\"</p><p>Durand lifted his chin. \"You can't make me talk. You can't cross the brick dust, even with your minds. You can't hurt me.\"</p><p>\"And you can't hide from us forever,\" Pierce growled. \"Show me that photo.\"</p><p>\"Damn.\" Durand shifted from one foot to another. \"Desiree is always causing me trouble. You won't hurt her?\"</p><p>\"I have no interest in your sister,\" Pierce said softly. \"Show me the photo.\"</p><p>With a resigned sigh, Durand handed Pierce the photo frame. \"The little girl is named Lucy.\"</p><p>Maggie peered at the photo. \"She's beautiful.\"</p> <p>Pierce stroked a thumb gently over the little girl's face. Her facial features were very much like his. \"Am I the father?\"</p><p>Durand grimaced. \"Yes, you are.\"</p><p>Back at the warehouse, Maggie was relieved to find that Colbert had installed two bathrooms on the second floor&amp;#151;one for males and one for females. As she showered, her thoughts centered on Don Orlando. Make that Pierce. Pierce O'Callahan who had a beautiful little girl named Lucy.</p><p>Her heart twisted. Oh, how she had wanted children! But it was impossible with a womb that was literally dead during the day. She lowered her head under the nozzle and let hot water pound on her. How could she be so selfish? She should be happy for Pierce. She turned off the water and toweled herself dry. After all, this had been the purpose of her mission, right? To discover his true identity and hopefully, find his family? She should be happy. Then why did she feel like crying?</p><p>Maggie removed her winter pajamas from her tote bag and put them on. Then, she combed her wet hair, grabbed her tote, and headed for the cot Colbert had assigned her.</p><p>She spotted Pierce with damp hair from his recent shower, seated at the computer and looking at something Ian had discovered on the Internet. Ian was standing nearby, talking to Giselle. He leaned close and whispered in her ear. Suddenly, she stepped back and slapped him.</p><p>Maggie gasped. Other Vamps exchanged amused grins.</p><p>\"I do not consort with children!\" Giselle stomped toward the ladies' restroom.</p><p>Maggie stepped aside to let her pass, then dashed toward Ian. \"Are you all right?\"</p><p>He shrugged like he didn't care, though his reddened face indicated differently. \" 'Tis always the same. Either they're no' interested because they think I'm a child, or they are interested because they think I'm a child, which is even worse.\"</p><p>\"I'm so sorry,\" Maggie murmured.</p><p>Pierce stood and patted him on the shoulder. \"It's my fault. I should have warned you. Giselle is Colbert's woman. She would have slapped any guy who made a pass at her, no matter what his age.\"</p><p>\"Oh.\" Ian straightened his shoulders. \"Thank you.\"</p><p>Maggie smiled at Pierce, grateful for his attempt at making Ian feel better.</p><p>Ian took a deep breath. \"Let's get back to business. I have confirmed that Pierce O'Callahan won the bareback riding competition at the Fort Worth rodeo in 1999.\"</p><p>Maggie gave Pierce a stunned look. \"That's impressive.\"</p><p>He shrugged. \"I don't remember it.\"</p><p>\"And I've located the O'Callahan ranch in Texas,\" Ian continued. \" 'Tis about an hour's drive south of Dallas, so tomorrow night, we'll teleport to Dallas. The coven there is expecting us, and they've agreed to let Pierce borrow a car so he can drive to the ranch. Do ye remember how to drive?\"</p><p>\"I don't know.\" Pierce ran a hand through his damp hair, frowning.</p><p>\"Ye'll probably remember once ye're behind the wheel,\" Ian said.</p><p>This was it, Maggie thought. No wonder she felt like crying. Tomorrow night, Pierce would drive to his family's ranch, and they'd welcome him back with open arms. Her job would be over. She would return to New York alone.</p><p>\"Ian, could you help me find my daughter?\" Pierce asked.</p><p>\"Of course,\" Ian replied.</p><p>\"I'm going to bed. Good night.\" Maggie wandered toward her cot while Pierce and Ian made plans to find the missing Lucy. She passed the coven's Christmas tree, noting the gaily wrapped presents underneath. And she felt all alone.</p><p>She settled onto her cot. Pierce no longer needed her. He had a daughter and a family. She snuggled deeper under her blankets. The sun must be close to rising. She could already feel the pull of death-sleep. Around the room, Vamps settled into their cots and turned off their bedside lamps. The only light left was the white star on top of the Christmas tree.</p><p>\"Do you mind if I move closer?\" Pierce whispered.</p><p>She rolled over to see him pushing his cot next to hers.</p><p>\"I can't thank you enough, Maggie.\" He eased into his cot and pulled the blanket up to his waist. He dragged his shirt over his head and tossed it to the foot of his cot. His shoulders were broad, not that she was looking. The light was too dim. She had to squint to make out the brown, curly hair on his chest.</p><p>\"You do have chest hair. Is brown your natural hair color?\"</p><p>\"Yes.\" He stretched out on his cot. \"Corky thought I'd look sexier with my hair dyed black and a huge amount of chest hair.\"</p><p>Maggie yawned, feeling another tug from the encroaching death-sleep. \"Corky's silly. I like you just the way you are.\" Correction: I love you.</p><p>\"You're an angel, Maggie.\" He reached across to her cot and clasped her hand. \"You've given me my life back. And a purpose for living. I know now what I need to do. I need to find my family and daughter.\"</p><p>And there was no mention of her in his lofty goal. Maggie withdrew her hand. \"I'm very happy for you.\" She rolled over so he wouldn't see the tears in her eyes.</p><p>For once, Maggie welcomed the painless oblivion of death-sleep.</p><p>Chapter 5</p><p>Pierce slanted a worried look at Maggie who sat in the passenger seat of the SUV he'd borrowed from the Dallas coven. She'd hardly spoken the entire trip, except to read Ian's directions or consult the map of Texas in her lap. Something was bothering her, he could feel it, but he didn't know what.</p><p>He checked the rearview mirror. For the last twenty minutes, they'd traveled alone on this Farm Road. \"How much farther to go?\"</p><p>She picked up Ian's directions. Thanks to a full moon and her superior Vamp vision, she was able to read. \"We should be coming up on County Road Three any minute now. Once we turn right there, we'll be on the O'Callahan ranch.\"</p><p>\"Great.\" Pierce reached between the bucket seats and opened the small ice chest. \"We'd better eat first.\"</p><p>\"Okay.\" She retrieved a cold bottle of Chocolood.</p><p>He opened a bottle of synthetic blood type O. \"Cheers.\"</p><p>She didn't respond, just sipped her Chocolood and gazed out the window.</p><p>What the hell was wrong? Pierce guzzled down half his bottle, then plunked it into the cupholder. \"Maggie, are you disappointed that I turned out to be a rodeo cowboy from Texas?\"</p><p>\"No. I&amp;#151;I'm very happy for you.\"</p><p>\"You don't sound happy. I thought you'd like an Irish boy. I'm the sort of guy you could take home to meet your parents.\"</p><p>\"Except that my parents died over a hundred years ago. And they would never approve of anyone who's undead. Even me.\"</p><p>\"I'm sorry they rejected you. You&amp;#151;you never told me how you were transformed.\"</p><p>She sipped from her drink, refusing to look at him. \"Here's the turn.\" She pointed at a narrow road up ahead.</p><p>\"I hope you can tell me sometime.\" He hoped her transformation hadn't been a violent one. He wanted her to be able to trust and love. But he could wait till she was ready. That was one good thing about being a Vamp. He could wait a hundred years if he needed to.</p><p>He turned the SUV onto the County Road. Ian had been right. Once he sat behind the wheel, his driving skills had come back. He looked around the countryside, and a surge of pride swept through him. They were now on O'Callahan land.</p><p>\"I was a volunteer with the Salvation Army,\" Maggie whispered. \"We went into a bad area by the docks, and I got separated from the others. Night fell, and I was lost.\"</p><p>Pierce turned toward her. \"You were attacked?\"</p><p>\"It was more like&amp;#151;\" She gasped.</p><p>He looked forward and flinched. Something had dashed into the road. He stomped on the brake.</p><p>Maggie screamed. They screeched to a halt just as a large animal leaped into the thick brush on the right.</p><p>Pierce sat still for a while, waiting for his heart to stop pounding. \"What the hell was that?\"</p><p>Maggie took a deep breath. \"I thought you were going to hit it.\"</p><p>He eased the SUV forward and spotted movement by a large oak tree. \"Look! There it is!\"</p><p>He'd seen the wolflike animal run on four legs, but now, it reared up on its hind legs and howled at the moon.</p><p>\"It's huge,\" Maggie whispered.</p><p>The shaggy animal dropped to all fours and loped away.</p><p>Pierce shook his head. He could have sworn there were no wolves in this part of Texas. He drove forward, keeping an eye out for wild animals. A fence began on the left side of the road, the planks in sore need of a fresh coat of paint. Two brick columns flanked a narrow road. A rusty wrought-iron arch connected the two columns. Across the arch were two words&amp;#151;O'CALLAHAN RANCH.</p><p>This was it. Home. He turned onto the driveway and spotted a house at the end of the long drive.</p><p>It was a large, white Victorian with dark shutters and a three-story turreted tower on the left. The rest of the second floor was topped with a gabled roof. Lights from a Christmas tree twinkled in the wide bay window on the right. Steps led up to the front door and a wraparound porch. The whole house sat on top of a partially visible basement. Even in the moonlight, Pierce could tell the house needed a coat of paint, and one of the shutters was hanging crooked.</p><p>A sudden, dreadful feeling came over him that the ranch had suffered because of his disappearance. Would his family be angry when he reappeared after five years?</p><p>\"It's beautiful,\" Maggie whispered.</p><p>She liked it? That was a relief. \"You're okay with how this is turning out? I mean, me being a rodeo cowboy from Texas?\"</p><p>\"With a secret baby?\" She glanced at him with a smile. \"You know, it sounds like something from a DVN soap opera. And Pierce is a perfect name for a vampire. Very fangish.\"</p><p>\"Yeah.\" He stopped in front of the house and studied the rundown building. \"Maybe I get to save the ranch.\"</p><p>\"Or maybe you're a long-lost prince from Europe.\"</p><p>He snorted as he removed the keys from the ignition. \"Or maybe my father is actually an Arabian sheikh in hiding.\"</p><p>Maggie laughed. \"And I bet you have an evil twin.\"</p><p>Right at that moment, the front door slammed open and a tall man strode onto the porch.</p><p>Maggie gasped. \"Sweet Mary! He looks just like you.\"</p><p>A twin? Pierce's mouth fell open.</p><p>The man whisked a shotgun up to his shoulder and shouted, \"Get the hell out of here!\"</p><p>An evil twin? Pierce exchanged a shocked look with Maggie. \"Duck down and stay low.\" He reached for the door handle.</p><p>\"What are you doing?\" Maggie scrunched down in her seat. \"He'll shoot you.\"</p><p>\"I don't think he can kill me.\" Pierce eased open the door. Though it would hurt like hell.</p><p>\"I told you to go away!\" The man cocked the shotgun.</p><p>\"Wait!\" Pierce edged around the front of the SUV. The headlights had yet to go off, so he stood in the pool of light. \"Don't you know me?\"</p><p>The man stumbled back with a gasp. The shotgun fell from his hands and discharged with a loud ka-boom. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Pierce ducked behind the SUV. Maggie screamed.</p><p>\"Sweet Jesus!\" The man ran down the steps, then halted abruptly before reaching the ground. \"Pierce, are you okay?\"</p><p>An older, thin woman dashed onto the porch. \"Patrick, what the hell are you doing? So help me, if you shoot Bob, I'll&amp;#151;\"</p> <p>\"No!\" Patrick pointed at the SUV. \"It's Pierce! He's back!\"</p><p>\"What?\" The woman stared at the SUV, her mouth agape.</p><p>Pierce straightened and gave a small wave. \"Hi.\"</p><p>\"Pierce!\" the woman screeched. She turned back to Patrick and shoved him. \"You shot at your own brother?\"</p><p>\"I didn't mean to. It was an accident.\"</p> <p>\"I'm okay. Really.\" Pierce headed toward the porch.</p><p>The woman charged down the steps and threw her arms around him. \"Pierce! You're alive!\"</p><p>Sorta. This didn't seem like the best time to dwell on undead details. He returned the woman's hug. \"Mother?\"</p><p>She pushed back with a confused look. \"I ain't your Ma.\"</p><p>\"Oh, sorry.\" He stepped back.</p><p>\"Don't you remember me? I'm your Aunt Betty.\"</p> <p>\"Ah, it's nice to meet you. You see, I have&amp;#151;\"</p><p>\"Well, I never.\" Aunt Betty planted her fists on her hips and glared at him. \"First, you run off without a word to anyone, leaving us here in the lurch for five long years, and now, you act like you don't even know us. Of all the high-falutin'&amp;#151;\"</p><p>\"I have amnesia!\"</p><p>His brother gasped.</p><p>His aunt scrunched up her long thin nose. \"Is that like milk of Magnesia?\"</p><p>\"No, Aunt Betty,\" Patrick muttered. \"Amnesia. It means he can't remember anything.\"</p><p>Maggie exited the SUV. \"It's true. Pierce has suffered from amnesia for almost five years.\"</p><p>Aunt Betty narrowed her eyes. \"And who the devil are you?\"</p> <p>Pierce wrapped an arm around Maggie's shoulders. \"This is my good friend, Maggie O'Brian.\"</p><p>\"Humph.\" Aunt Betty sniffed. \"You remember her name.\"</p><p>Patrick opened the front door and yelled, \"Ma! Pierce is back!\" He let the door slam shut and waited on the porch.</p><p>Pierce wondered if there was bad blood between him and his brother. Patrick hadn't even bothered to shake his hand. \"Are we twins?\"</p><p>Patrick laughed.</p><p>Aunt Betty snorted. \"Don't you know you're the oldest?\"</p><p>\"He has amnesia,\" Patrick reminded her. \"You're three years older than me, Pierce, though you sure don't look like it.\"</p><p>Of course. When he'd become undead, he'd stopped aging.</p><p>A short, dark-haired woman ran onto the porch and gasped when she saw Pierce. \"Santa Maria!\" She dashed down the stairs. \"Pierce Alejandro! I thought I'd never see you again.\" She pulled him into an embrace and burst into tears.</p><p>Pierce Alejandro? He gave Maggie a shocked look over his mother's head. He was part Hispanic, after all. Maggie grinned.</p><p>He patted his mother's back. \"You are my mother, right?\"</p><p>\"Clam.\" She stepped back. \"You don't remember?\"</p><p>\"He has amnesia,\" Patrick yelled from the porch.</p><p>His mother looked confused. \"You don't remember us at all?\"</p><p>\"No, that's why I was gone for so long. I only found out yesterday that my name's Pierce O'Callahan.\"</p><p>His mother looked even more confused. \"Then who were you before?\"</p><p>\"He doesn't remember!\" Patrick shouted. \"He has amnesia!\"</p><p>\"Actually, I do remember the last four and a half years. It's everything before that's a total blank.\"</p><p>Aunt Betty scowled at him. \"So you've been cavortin' around the countryside while we were here starvin' to death?\"</p><p>\"We're not starving!\" His mother protested, then gave Pierce another hug. \"Don't worry, pobrecito. You're home, and now, everything will be fine.\"</p><p>He patted his mother on the back. He was beginning to suspect they did expect him to save the ranch. But how could he when he remembered nothing about ranching?</p><p>\"Y'all had better come in,\" Patrick yelled from the porch. \"It's not safe out there.\"</p><p>Pierce reached for Maggie's hand. \"Mother, I'd like you to meet Maggie O'Brian. She's been helping me find out who I am. Without her, I would have never made it home.\"</p><p>Maggie's eyes glistened with tears. \"I was happy to help.\"</p><p>His mother grabbed her in a tight hug. \"Thank you, thank you. You are an angel to bring my son back to me.\"</p><p>Maggie returned the woman's embrace.</p><p>\"You must call me Dorotea,\" Pierce's mother announced. \"And you are always welcome in my home. God bless you, child.\"</p><p>\"Don't just stand there!\" Patrick shouted from the porch. \"Hurry, get in the house!\"</p><p>There must be some kind of danger. Why else was his brother standing guard with a shotgun? Pierce led Maggie up the steps, following his mother and aunt. As soon as he reached the porch, his brother grabbed him in a bear hug.</p><p>\"I'm so glad you're back.\" Patrick pounded him on the back.</p><p>Pierce grinned, relieved that he and his brother were on good terms after all. \"What's the deal with the shotgun?\"</p><p>\"Nothing.\" Patrick slanted a nervous look toward his mother and aunt. \"But you shouldn't be outside tonight.\"</p><p>Pierce exchanged a confused look with Maggie as they filed into the foyer. Then, they followed his mother and aunt into the living room on the right.</p><p>\"Come, sit down.\" Dorotea gestured toward a long tan sofa with plump cushions.</p><p>Pierce and Maggie sat together on the couch. Patrick took a position next to the Christmas tree in front of the bay window. On the opposite wall, a large bookcase took up the whole wall, stuffed with books, knickknacks, and an old television. His mom and aunt sat across from him in two maroon wing-back chairs.</p><p>Maggie frowned at Patrick's gun. \"Is there something wrong? We saw a strange creature on the road. Pierce almost hit it.\"</p><p>Dorotea gasped.</p><p>Aunt Betty jumped to her feet. \"What kind of creature?\"</p><p>\"I'm not sure.\" Maggie twisted the cross-shaped ring on her little finger. \"It was large and sorta wolfish looking.\"</p><p>\"And you hit it?\" Aunt Betty shrieked.</p><p>\"No, no,\" Pierce assured her. \"The animal was fine. It just gave us a shock.\"</p><p>\"Oh.\" Aunt Betty sat back down, her face pale.</p><p>Patrick muttered a curse while gazing out the window.</p><p>\"What's going on?\" Pierce asked.</p><p>\"You must be hungry.\" Dorotea stood and headed for the door. \"I'll get you something to eat.\"</p><p>\"No, thank you,\" Pierce replied. \"We ate on the way.\"</p><p>Dorotea halted halfway to the door. \"Something to drink?\"</p><p>Maggie smiled. \"We just finished some drinks in the car, but thank you very much.\"</p><p>\"Oh.\" Dorotea returned to her chair. \"So, tell me, Pierce. What have you been doing while you were gone?\"</p><p>\"I was in New York City.\"</p><p>\"He's a famous actor,\" Maggie added.</p><p>Aunt Betty sniffed. \"Not too famous. I've never seen him in anything.\"</p><p>\"I play Don Orlando de Corazon on a soap opera on DVN.\"</p><p>\"Oh, how wonderful!\" Dorotea beamed at him. \"I'm afraid we don't get that channel. We could never afford cable.\"</p><p>Pierce leaned forward, bracing his forearms on his knees. \"Be honest with me. Is the ranch in trouble?\"</p><p>His mother sighed. \"We're having some difficult times, but it'll pass.\"</p><p>Patrick snorted. \"It'll never pass.\"</p><p>Aunt Betty crossed her arms, frowning. \"It ain't Bob's fault. He can't help it.\"</p><p>\"Who's Bob?\" Pierce asked.</p><p>\"My husband, your uncle.\" Aunt Betty glared at him. \"He taught you how to ride. Don't you remember anything?\"</p><p>\"Give him a break,\" Patrick growled. \"He has amnesia.\"</p><p>\"Well, I hope he remembers how to tend cattle.\" Aunt Betty glowered back. \"What with you too afraid to leave the house.\"</p><p>Patrick stiffened. \"I can't help it. It's the curse.\"</p><p>\"Superstitious nonsense.\" Aunt Betty pursed her lips.</p><p>\"A curse?\" Pierce asked.</p><p>\"Don't worry about it.\" Dorotea rushed over to Pierce and perched on the sofa arm next to him. \"We're so grateful you're back. And just in time for Christmas!\"</p><p>\"I bet Pierce is too smart to believe in a curse,\" Aunt Betty muttered.</p><p>He wasn't so sure about that. After all, a potion from a voodoo priestess had wiped out his entire memory. \"What curse?\"</p><p>\"A biting curse.\" Patrick lay his shotgun down on a deacon's bench against the wall. \"Don't ever leave this house. If you do, I'm warning you, you'll get bitten.\"</p><p>Dorotea whispered loudly in Pierce's ear, \"Your brother's afraid to leave the house.\"</p><p>\"It's not fear.\" Patrick frowned at them all. \"It's common sense. How did Dad die three years ago?\"</p><p>Dorotea sighed. \"He was bitten by a rattlesnake several miles from home. Pobrecito. He didn't make it home in time.\"</p><p>\"I'm sorry.\" Pierce patted his mother's hand.</p><p>\"And what happened to Uncle Bob and Rosalinda?\" Patrick continued. \"I'll tell you what. They were bitten!\"</p><p>\"Who's Rosalinda?\" Pierce asked.</p><p>\"Your sister.\" Dorotea frowned at him. \"You don't remember her, either?\"</p><p>\"For God's sake, the guy has amnesia!\" Patrick raised his hands in frustration.</p><p>\"Sorry.\" Dorotea smoothed back Pierce's hair. \"I keep forgetting.\" Suddenly, she removed her hand. \"Santa Maria. Is it contagious?\"</p><p>\"No,\" Pierce assured her. \"You're perfectly safe.\"</p><p>Patrick snorted. \"Yeah, as long as we don't get bitten.\"</p><p>Pierce exchanged a worried look with Maggie. This was probably not the best time to admit they were vampires. \"Where is Rosalinda? I'd like to meet her.\"</p><p>\"She's gone&amp;#133; out,\" Dorotea mumbled.</p><p>\"She'll be fine,\" Aunt Betty whispered. \"She always makes it back home.\"</p><p>Patrick grabbed the shotgun and went back to the window. \"We always stay up on nights like this.\"</p><p>What the hell was going on? \"Where is she?\" Pierce asked.</p><p>Dorotea shrugged, then her face brightened. \"It's so wonderful to have you back for Christmas! Surely, things have turned around now, and God is blessing us.\"</p><p>Pierce glanced at the clock on the bookcase. Four-fifteen A.M. It would take an hour to drive back to Dallas. \"Well, actually, we need to be going.\"</p><p>\"No!\" Dorotea stood. \"You must stay for Christmas! And forever! There's no place like home. We won't let you leave.\"</p><p>\"I'm really sorry,\" Maggie ventured, \"but Pierce needs to give me a ride back.\"</p><p>\"Nonsense!\" Dorotea circled the coffee table to sit next to Maggie. \"You must stay, too. You're the angel who brought my son back to me. You'll always be welcome in our house.\"</p><p>Maggie blinked. \"Thank you. Thank you so much.\" She gave Pierce an apprehensive look.</p><p>He figured she was worried about finding a place for their daily death-sleep. The Dallas coven's underground headquarters would be much safer. \"I'd better take you back.\" Her face paled. Were those tears in her eyes? Dammit, he'd said the wrong thing.</p><p>\"You cannot go!\" Dorotea stood once more.</p><p>\"His daughter!\" Aunt Betty jumped to her feet. \"He must stay to see his daughter.\"</p><p>Pierce's mouth fell open. \"My&amp;#151;my daughter? She's here?\"</p><p>\"Yes!\" Dorotea grinned. \"Can you bring her down, Betty?\"</p><p>\"Of course. Just a minute.\" Aunt Betty dashed into the foyer. Her steps pounded up the stairs.</p><p>Dorotea clasped her hands together at her ample bosom. \"She's sound asleep, waiting for Santa Claus to come. But an even greater miracle has happened! Her father has come home.\" She frowned as Pierce rose to his feet. \"You don't know you have a child? Shame on you. I raised you better than that.\"</p><p>\"For God's sake!\" Patrick shouted. \"He has amnesia!\"</p><p>\"No, I do know about Lucy,\" Pierce confessed. \"But I only found out last night. And I thought she was with her mother.\"</p><p>Dorotea grimaced. \"That terrible woman. She doesn't deserve Lucy. She dropped off la pobrecita like an unwanted gato. Just because the man she was with didn't want a child.\"</p><p>Maggie gasped. \"That's horrible!\"</p><p>\"I know.\" Dorotea cocked her head when steps sounded on the stairs. She held a finger to her lips. \"We never talk about it in front of Lucy.\"</p><p>\"Of course not.\" Pierce moved toward the foyer, anxious to meet his daughter for the first time. His heart leaped up his throat when he saw her on the stairs. Her curly black hair was disheveled, her big brown eyes drooped with sleepiness, her mouth was plugged with two fingers, and her Sesame Street pajamas were twisted askew. He'd never seen a more beautiful child in his life. His heart filled till it was heavy with love, then settled back into his chest with a sense of contentment.</p><p>Maggie and Lucy. He loved the most precious girls in the world.</p><p>Aunt Betty helped the sleepy little girl down the stairs. \"We all adore her.\" Even Betty's pinched, narrow face had softened. \"She's brought joy back into this house.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I can believe that.\" Pierce knelt down to greet his daughter.</p><p>Lucy stopped in front of him and removed her fingers from her mouth. \"You're not Santa Claus.\"</p><p>\"No. I'm your father.\" And she was the only child he and Maggie could ever have. Their undead status precluded any more. \"I think you're a miracle.\"</p> <p>\"No, I'm Lucy.\"</p><p>With a grin, he hugged her.</p><p>\"Did you come with Santa Claus?\"</p><p>\"No.\" He straightened. \"I came with an angel.\" He pointed at Maggie on the couch who was watching with tears in her eyes.</p><p>Lucy wandered into the living room and stopped in front of Maggie. \"You're pretty.\"</p> <p>A tear ran down Maggie's face. \"I think you're beautiful.\"</p><p>\"I'm sleepy.\" Lucy climbed onto the couch and rested her head in Maggie's lap.</p><p>Maggie gently stroked the girl's hair. Pierce felt his heart expand. For the first time in his memory, everything was right. He was blessed.</p><p>\"What a lovely picture you two make.\" Dorotea headed for the bookcase. \"I should get the camera.\"</p><p>\"No!\" Pierce rushed toward the couch. Shit! If his mother had a 35 mm camera, he and Maggie wouldn't show up in it.</p><p>Maggie gave him a frantic look.</p> <p>\"The&amp;#151;uh, the flash might wake up Lucy,\" he grappled for an excuse.</p><p>\"Yes.\" Maggie nodded. \"Perhaps we can look at your old photos? Maybe it'll jog Pierce's memory.\"</p><p>\"Good idea!\" Dorotea grabbed a photo album from the bookcase.</p><p>Pierce exhaled with relief and sat next to Maggie.</p><p>Dorotea perched on the sofa arm and thumbed through the photo album. \"Ah, here's one of my favorites.\" She lifted the album so Pierce and Maggie could see. \"Halloween. Rosalinda was a princess. Patrick was Robin, and Pierce was Batman.\"</p><p>Maggie slanted an amused glance at Pierce. \"A black cape?\"</p><p>\"Yes.\" Dorotea smiled. \"Pierce was always fond of capes.\"</p><p>Maggie grinned. \"How interesting.\"</p> <p>Pierce wondered if somehow his subconscious had held on to certain things. Like capes. And a natural preference for short women with dark hair. Like his mother and Maggie.</p><p>Patrick wandered over to look at the picture. \"I remember those costumes. We used to wear them when we played in the cave. Pierce would say, 'To the bat cave, Robin.' \"</p><p>Dorotea scoffed. \"And the two of you would come home stinking of bat guano. You ruined those costumes.\" She flipped pages in the album till she located another picture. \"Here they are the next year. Patrick was Spiderman, and Pierce was Zorro.\"</p><p>Maggie laughed. \"Another black cape?\"</p><p>Dorotea continued through the album. \"Most of these are Pierce with his horses. He was winning medals by the age of ten. Then in high school, he discovered another passion.\"</p><p>Maggie's grin faded. \"You mean girls?\"</p><p>\"Oh, no,\" Dorotea chuckled. \"He was shy around the girls. It was the marching band he loved. And music.\"</p><p>Pierce blinked with surprise. \"I know how to play an instrument?\"</p><p>\"Of course.\" Dorotea tipped the album toward them. \"Here he is in his band uniform. Doesn't he look handsome?\"</p><p>\"Very handsome.\" Maggie leaned closer. \"Sweet Mary, you're holding a trumpet.\"</p><p>A trumpet? Pierce exchanged a surprised look with Maggie. No wonder Don Orlando had played the trumpet in a mariachi band.</p><p>Dorotea continued to show them photos while Lucy slept soundly, cuddled up to Maggie.</p><p>\"It's getting late,\" Maggie whispered, then projected her thoughts into his head. We could teleport to Dallas, but that would be hard to explain to your family.</p><p>You're right. He glanced at the clock. Five-fifteen. \"Maggie and I are tired from our journey. Is there a place we can sleep? A dark place with no windows?\"</p><p>\"No windows?\" Dorotea closed the photo album on her lap.</p><p>\"There's a bed in the basement,\" Aunt Betty offered. \"But only one.\" She pursed her lips in disapproval.</p><p>\"There are a few windows in the basement.\" Dorotea returned the albums to the bookcase. \"But they're very small. I'm sure they won't bother you.\"</p><p>\"I&amp;#151;I have a skin condition,\" Maggie explained. \"Any exposure to sunlight would be very painful.\"</p><p>Betty snorted. \"I thought you looked too pale. In fact, both of you look too pale. A little sun would do you good.\"</p><p>Pierce winced. \"This may sound strange, but we both have an illness that requires a lot of rest and complete darkness.\"</p><p>Betty scoffed. \"Sounds like hanky-panky to me.\" Patrick chuckled. \"There's always the cave.\"</p><p>\"Don't be silly,\" Dorotea fussed. \"There are a million bats in that cave. And mounds of stinky bat guano.\" Patrick nodded. \"With our luck, one of those bats would bite them.\"</p><p>Dorotea's face lit up. \"The storm cellar! It's very dark.\"</p><p>\"That sounds good.\" Pierce stood. \"Where is it?\"</p><p>\"Close to the garage. It's where we go if there's a tornado warning.\" Dorotea wrinkled her nose. \"But it's not a fit place to sleep. There's no electricity or heat.\"</p><p>\"It'll be fine,\" Maggie insisted. \"Thank you.\" Pierce gently lifted Lucy's head so that Maggie could get up. He slid a pillow under Lucy's head and kissed her brow. \"See you tomorrow night, little one.\"</p><p>Dorotea shook her head. \"This is terrible. How can we let you sleep in that cold hole in the ground when we have perfectly good beds in the house?\"</p><p>Aunt Betty harrumphed. \"I doubt they'll be cold.\"</p><p>\"We'll be fine, Mother,\" Pierce assured her. \"We really do need total darkness. And we need to sleep all day tomorrow undisturbed.\"</p><p>\"All day?\" Dorotea asked. \"But tomorrow's Christmas. You should watch Lucy open her presents. And dinner will be at three in the afternoon.\"</p><p>Pierce gave Maggie a worried look. \"We're&amp;#133; very tired.\"</p><p>Aunt Betty snorted.</p><p>\"I'm serious,\" Pierce insisted. \"I want your word that none of you will enter the storm cellar until after sunset.\"</p><p>Dorotea ran a hand through her graying black hair. \"Very well. We'll have Christmas dinner at seven in the evening.\"</p><p>\"Thank you.\" Pierce kissed his mother's cheek. \"Now, take us to the storm cellar.\"</p><p>Chapter 6</p><p>Maggie stopped by the SUV while Pierce and his mom went to the storm cellar. She stuffed two bottles from the ice chest into her tote bag. She knew Ian and the Dallas coven would be worried, so she called Ian on her cell phone.</p><p>\"Don't worry about locating Lucy. She's here.\" Maggie spotted Patrick watching her from the bay window. \"There's something weird going on here.\"</p><p>\"Like what?\" Ian's voice sharpened.</p><p>\"I don't know. Can you check the local papers for anything like a strange creature on the loose?\" She turned toward the SUV just in time to see a furry animal jump out from behind a rear wheel. \"Sweet Mary!\" Maggie retreated with a gasp.</p><p>\"What is it?\" Ian demanded. \"Is it the bloody creature?\"</p><p>Maggie pressed a hand to her chest. \"No, it's a rabbit.\"</p><p>The rabbit hopped toward her, wriggling its nose and studying her with big brown eyes.</p><p>\"Ye frightened me over a wee bunny?\" Ian asked. \"I was ready to teleport there and slay a vicious monster.\"</p><p>Maggie laughed. \"It startled me.\" She stepped toward the bunny, but it scampered to the house and wedged through some broken latticework underneath the front steps.</p><p>The house was in need of repair, and Maggie knew Pierce would be determined to help his family. But she wanted to help, too. She wanted to belong here like he did. Dorotea had welcomed her, but Pierce was the one who needed to ask her to stay. And all he'd done so far was offer to take her back to Dallas.</p><p>She needed to prove her worth, and an idea had occurred to her in the house. \"Ian, can you check the price on bat guano?\"</p><p>\"Bat guano?\"</p><p>\"Yes. Let me know tomorrow night.\" She hung up and hurried to the storm cellar. A howl in the distance made her shiver. No wonder the bunny went into hiding.</p><p>Dorotea was standing by the hatch and gave Maggie a hug. \"Are you sure about this?\"</p><p>\"Yes. We'll be fine.\" Maggie swung her tote bag onto her shoulder and stepped onto the ladder. Below, Pierce lit her way with a flashlight. Halfway down, Dorotea closed the hatch.</p><p>\"Alone at last.\" Pierce set the flashlight on a shelf.</p><p>Maggie set her tote bag on the cold linoleum floor and removed the bottles of blood. \"I brought us a snack.\"</p><p>\"Great.\" Pierce opened a bottle and drank. \"You're the best, Maggie.\" He set his bottle on the shelf next to the flashlight and began unrolling the sleeping bags.</p><p>Did he really believe she was the best? If he did, why didn't he proclaim his love and ask her to marry him? No, he just squatted there on the floor, unzipping sleeping bags.</p><p>Oh well, it was late. She could already feel a slight tug from the death-sleep. He was right to get things ready.</p><p>She looked around the small cellar. Along one wall, there were shelves filled with jugs of water. On the opposite wall, a unit of shelves jutted out to provide a small space behind it. The shelves were filled with canned goods and supplies.</p><p>She slipped behind the shelving unit and removed her pajamas from the tote bag. They were damp from the cold bottles she'd stashed there. She wrinkled her nose. If she had any nerve at all, she'd prance out from behind these shelves completely nude and show Pierce she really was the best.</p><p>She groaned inwardly. She knew nothing about seduction. Her one encounter with seduction had been over a century ago when a male vampire had used mind control to steal her blood, her virginity, and finally, her mortality. He'd been gentle enough, but still, he'd controlled her. He'd made her think it was pleasurable, but the next night, when she awoke, she was undead and appalled. It hadn't seemed so pleasurable then.</p><p>Over the next hundred years, she'd engaged in psychic vampire sex a few times, but she'd never wanted to make love again in the physical way. She'd never wanted to risk that sort of emotional vulnerability with a man. Until now.</p><p>She quickly undressed and slid on the damp pajama bottoms. What if Pierce rejected her? He was always thanking her, but she wanted his love, not his gratitude. He also referred to her as an angel. Did that mean he didn't desire her as a woman?</p><p>She felt another pull from death-sleep. If she was going to seduce him, she'd better do it quick. She slipped on her pajama top and peered through two huge cans of baked beans to see what he was doing.</p><p>He was sitting on the sleeping bags, watching her.</p><p>She gasped, her old-fashioned upbringing reappearing. \"How dare you!\"</p><p>He grinned. \"Don't worry. There's a big box of toilet paper in the way, and I completely missed the good parts.\"</p><p>Maggie's heart raced. He was interested in her as a woman. She eased out from behind the shelving unit.</p><p>His gaze drifted over her. \"You look beautiful, Maggie.\"</p><p>\"In flannel pajamas?\" She smoothed her hand over a damp patch. \"They're a little wet.\"</p><p>\"Then you should take them off so you don't catch cold.\"</p><p>She snorted. \"Now that sounds too much like Don Orlando.\"</p><p>Pierce shook his head. \"Don Orlando is gone.\" He stood. \"There's just you and me.\"</p><p>Her heart beat faster. She looked down at the floor and saw what he'd done. He'd opened all the sleeping bags and stacked them flat on each other to create one mattress. Two pillows rested at the head, and blankets at the foot.</p><p>A wave of heat poured lazily through her. \"Are you planning to seduce me?\"</p><p>\"Yes.\" He unzipped his jeans and dropped them to the floor. \"I know you deserve better, Maggie. You deserve the finest suite at the Plaza or the Ritz.\"</p><p>\"I'm okay.\" More than okay. She watched his muscles bunch and ripple when he yanked his T-shirt over his head.</p><p>\"And you deserve better than a poor cowboy who apparently has a strange family.\"</p><p>\"I like your family.\" Her breath caught when she spotted the huge bulge in his cotton briefs. Sweet Mary and Joseph, he wasn't thinking of her as an angel now.</p><p>He stuck his thumbs in the elastic waistband and tugged the briefs down slowly. \"I don't mean to rush you, darling, but we don't have much time before the death-sleep takes us.\"</p><p>She licked her lips. Yes, she wanted him, but what about love? Why couldn't he say what she needed to hear? She turned away just as his briefs hit the floor. \"Do you love me?\"</p><p>\"God, yes.\" He grabbed her and turned her to face him. \"I have always loved you, Maggie. I loved you as Don Orlando. And I adore you as Pierce. I don't know how I could face eternity without you. Hell, I couldn't face one night without you.\"</p><p>\"Oh, Pierce.\" She cradled his face in her hands. \"You had me with 'God, yes.' And I love you so much.\"</p><p>His mouth came down on hers with a hunger that took her breath away and melted her knees. Before she knew it, they were stretched out on the makeshift mattress, and Pierce was covering her face and neck with kisses. She smoothed her hands down his back, loving the heat of his skin and the bulge of his muscles.</p><p>\"We have to hurry.\" He unbuttoned her pajama top.</p><p>\"I understand.\"</p><p>\"So beautiful.\" He took a nipple into his mouth.</p><p>It was beautiful. Maggie had never realized how beautiful real love-making could be. She could hardly breathe. Hardly think. Her skin burned wherever he touched her. And heat, demanding heat sizzled between her legs. \"Hurry.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He pulled off her pajama bottoms and settled between her legs. \"Forgive me for taking you so fast.\" He plunged a finger into her core and stroked her.</p><p>Maggie squealed. \"Oh, God, you're forgiven.\"</p><p>\"You're so wet.\" He spread her moisture around the sensitive folds, then tasted her.</p> <p>She jolted, raising her hips into the air. Sweet Mary, he was the greatest vampire lover in the world. She spiraled out of control. His tongue continued to torture and delight her, feast on her and devour her. She screamed when the climax shattered her, immersing her in a flood of sweet throbbing sensations.</p><p>\"Pierce me.\" She wrapped her arms around his shoulders and her legs around his waist.</p><p>He entered her. \"I wish we had all night.\" A look of fatigue crossed his face.</p><p>She felt it, too. Death-sleep was coming, tugging at her consciousness. \"Just a little more. Please.\"</p><p>He gritted his teeth and plunged again and again.</p> <p>She lifted her hips to meet each thrust. Just a little more time. Please. She felt the spiraling sensation building within.</p><p>He quickened his pace, his breathing harsh. Then suddenly, with a deep plunge, he stiffened and groaned. He collapsed, his head beside hers. \"God, I love you.\"</p><p>\"I love you, too.\" As death-sleep pulled her under, she felt one final sweet throb where their bodies were still joined.</p><p>Pierce awoke with the usual jolt that reverberated through his body. He opened his eyes as Maggie shuddered back to life.</p><p>A scream erupted behind them.</p><p>Maggie's eyes flew open, and she screamed, too. Pierce looked over his shoulder. A young woman at the foot of their bed squealed, then grabbed his mother. Dorotea screamed.</p> <p>\"Enough!\" Pierce pulled the blanket up to cover himself and Maggie as he flipped over into a sitting position. Dammit. They must have come in before sunset.</p><p>\"I thought you were dead!\" The young woman pointed at him.</p><p>Dorotea pressed her palms together in prayer. \"It's a miracle!\" She dropped to her knees and burst into tears.</p><p>The young woman knelt beside Dorotea, hugging her. She shot Pierce a confused look. \"I could have sworn you were dead.\"</p><p>\"Who are you?\" Pierce demanded.</p><p>\"Your sister, Rosalinda. Mother told me not to come till after sunset, but I couldn't wait. I had to see you again, but then, I thought you were dead.\" She covered her face and sobbed.</p><p>Great. He'd started his new life by traumatizing his family. He glanced at Maggie to see how she was doing. Her face was pale, and she was busily buttoning her pajamas. His mother and sister were so upset, he could hear their hearts pounding, smell the blood racing through them. He glanced at the half-empty bottle on the nearby shelf. He needed to eat soon.</p><p>\"Why are you screaming down there?\" Aunt Betty yelled from the hatch opening.</p> <p>\"They're alive!\" Rosalinda stood, still crying.</p><p>\"What?\" Aunt Betty yelled. \"They're not dead anymore?\"</p><p>\"They're alive!\" Rosalinda moved to the base of the ladder and looked up at her aunt. \"Call nine-one-one and cancel the ambulance.\"</p><p>\"It's a miracle.\" Dorotea crossed herself as she struggled to her feet. \"A Christmas miracle.\"</p><p>\"I can explain.\" Pierce groaned inwardly. Could he really?</p><p>\"No need.\" Rosalinda laughed, wiping the tears from her face. \"It's pretty obvious what you've been up to all day.\"</p><p>Maggie winced. \"Actually, we were&amp;#133; asleep most of the day.\"</p><p>\"Yeah, right.\" Rosalinda snorted.</p><p>\"We were unconscious,\" Pierce added.</p><p>\"For thirty minutes?\" Her eyes suddenly widened. \"Wow. I wish I had orgasms like that.\"</p><p>Dorotea gasped. \"Rosalinda!\"</p><p>A pang of hunger shot through Pierce. He needed to get them out of here quick. \"Please, go to the house. Maggie and I will be there soon, and we'll explain everything.\"</p><p>\"Very well.\" Dorotea exchanged a pointed look with her daughter. \"We all have some explaining to do.\"</p><p>After they left, Pierce grabbed the bottle from the shelf. He guzzled it down while Maggie drank from her bottle. With the edge off their hunger, they began to dress.</p><p>He zipped up his jeans. \"I don't know how to tell them.\"</p><p>Maggie took his hand and squeezed it. \"I'll be there with you. For good or bad.\"</p><p>\"Thank you.\" He kissed her hand. \"Ready to go?\"</p><p>\"Yes.\" She swung her tote bag onto her shoulder and followed him up the ladder.</p><p>As they walked toward the house, Pierce spotted his brother on the porch.</p><p>\"You're okay?\" Patrick ran down the steps, but halted on the last one. A look of shame crossed his face. \"I wish I wasn't so damned afraid. You two come in. Dinner's ready.\"</p><p>\"Just a minute.\" Maggie ran to the SUV and retrieved the last two bottles of blood.</p><p>As soon as they entered the foyer, Lucy ran up to them with a big grin. \"You want to see what Santa Claus brought me?\"</p><p>\"In a little while.\" Pierce picked her up and kissed her cheek.</p><p>Lucy giggled. \"You sleep too much.\"</p><p>\"I'm afraid so.\" Pierce carried her into the dining room. She wiggled down from his arms and climbed into a chair with a booster seat.</p><p>A tall man in overalls came forward. \"I'm your Uncle Bob. I'm glad you're back.\"</p><p>\"I'm glad to be back.\" Pierce shook his hand. \"And this is Maggie.\" He wrapped an arm around her.</p><p>Dorotea, Rosalinda, and Aunt Betty finished loading the table with food&amp;#151;turkey, dressing, mashed potatoes, and salad.</p><p>Uncle Bob took a seat at the end of the table. \"I hope you two are hungry. The gals have been cooking all day.\"</p><p>Pierce exchanged a worried look with Maggie. She quietly set their bottles of blood beside two plates on the table.</p><p>\"Everyone sit down.\" Dorotea sat at the other end of the table with Lucy on one side and Rosalinda on the other. Patrick sat between his sister and aunt. Pierce took the seat next to Lucy, and Maggie sat beside him.</p><p>\"Let's say the blessing,\" Dorotea announced, and everyone reached out to hold hands. \"Thank you, Lord, for giving us Lucy who has brought so much joy into this house. And thank you for sending us Pierce and Maggie. My son, who was lost, has been returned. Amen.\" Dorotea crossed herself with tears in her eyes.</p><p>\"Now, everyone eat.\" Uncle Bob piled his plate with turkey meat, then passed the platter to Maggie. She passed it on to Pierce who put some meat on Lucy's plate.</p><p>\"What's wrong?\" Dorotea asked. \"Aren't you two eating?\"</p><p>\"We're on a special diet,\" Maggie murmured as she opened her bottle of Chocolood. She poured some into her glass.</p><p>\"Well, I never,\" Aunt Betty muttered. \"After all the work we did, slaving over the stove.\"</p><p>\"Food's great.\" Uncle Bob wolfed down an entire turkey breast in two gulps.</p><p>Pierce opened his bottle and took a sip. \"The night I lost my memory, something else happened, too. I was attacked.\"</p><p>Patrick looked up from his plate. \"You were bitten?\"</p><p>\"Yes.\"</p><p>\"Damn!\" Patrick hit the table with his fist. \"I knew it. It's that damned curse.\"</p><p>\"Please don't curse at the table,\" Dorotea murmured. \"Go on, Pierce. What happened?\"</p><p>He swallowed hard. This was it. \"I was transformed. Into a vampire.\" He glanced quickly around the table, but was met with nothing but blank looks. At least, they weren't screaming. Or trying to stab him with the silverware.</p><p>\"Are you sure, dear?\" Dorotea asked.</p><p>\"I didn't think such a thing existed,\" Rosalinda mumbled with her mouth full.</p><p>\"It's true,\" Maggie said. \"Pierce and I are both vampires.\"</p><p>Silence descended around the table as everyone stopped eating. Pierce wondered when the screaming would begin.</p><p>\"Ah, well.\" Dorotea shrugged. \"Nobody's perfect.\"</p><p>\"That's the truth,\" Aunt Betty muttered.</p><p>\"Pass the potatoes,\" Uncle Bob said.</p><p>Pierce blinked, then passed the bowl to his uncle. \"You're not upset? Maggie and I are sorta&amp;#133; dead during the day.\"</p><p>\"Ha!\" Rosalinda smiled smugly. \"I knew I was right.\"</p><p>Patrick frowned. \"You're not going to bite us, are you?\"</p><p>\"No. We drink synthetic blood.\" Pierce demonstrated by taking a swig from his bottle.</p><p>A ringing sound came from Maggie's tote bag. She retrieved her cell phone and excused herself from the table. Even though she was talking quietly in the foyer. Pierce could tell with his super vamp hearing that she was talking to Ian.</p><p>Everyone else resumed their eating. Uncle Bob was gnawing on a turkey leg. Rosalinda was nibbling at a salad.</p><p>\"I suppose we should fix up the storm cellar and make it more comfy for you,\" Dorotea said as she cut up her meat.</p><p>\"That would be nice. Thank you.\" Pierce took a deep breath, greatly relieved. \"You're all taking the news very well.\"</p><p>Aunt Betty shrugged. \"We're family.\"</p><p>\"And we thank God you made it home,\" Dorotea added.</p><p>\"I have some money saved up,\" Pierce said. \"We could use it for repairs.\"</p><p>\"Oh, that's wonderful!\" Dorotea exclaimed.</p><p>\"Or we could buy more cattle,\" Aunt Betty offered.</p><p>\"Why should we?\" Patrick muttered. \"They'll just get eaten like all the others. We're doomed. Nothing can save us.\"</p><p>\"Don't say that.\" Betty sniffled. \"He can't help it.\"</p><p>Uncle Bob hit the table with his fist. \"I've worked this ranch since I was a young boy. I helped build it with my bare hands. Do you think I enjoy being the one to destroy us?\"</p><p>\"There, there.\" Betty embraced her husband.</p><p>\"What's going on?\" Pierce asked.</p><p>His family grew silent.</p><p>\"Good news!\" Maggie returned, smiling. \"I know how you can save the ranch. You can make a bundle selling bat guano for fertilizer.\"</p><p>\"Maggie, you're brilliant!\" Pierce grinned at her. \"Can you still love me when I'm a guano farmer?\"</p><p>She laughed. \"Of course.\"</p><p>Uncle Bob cleared his throat. \"I'll be happy to help you shovel that guano.\"</p><p>\"Thanks.\" Pierce turned to Patrick. \"You could help, too.\"</p><p>Patrick turned pale. \"It's not safe to leave the house.\"</p><p>\"I won't let anything hurt you, Patrick. Trust me.\" Pierce grabbed the fork beside his plate and bent it into a circle.</p><p>Patrick's eyes widened. He tried to bend his fork, but couldn't. \"Wow, you're really strong.\"</p><p>\"I have superior strength, vision, and hearing. I can levitate, teleport, and control people's minds if I have to. You would be safe with me, Patrick.\"</p><p>He glanced at Uncle Bob. \"Can you control an animal?\"</p><p>\"I suppose. Will you help me, Patrick?\"</p><p>He gulped. \"I'll try. But we can't do any work on the night of a full moon.\"</p><p>\"Why not?\" Pierce asked.</p><p>\"Because whenever there's a full moon, we lose another cow,\" Uncle Bob said sadly.</p><p>\"You can't help it,\" Betty whispered. \"If you didn't take one of ours, you'd go to the neighbors, and they'd shoot you for sure.\"</p><p>Uncle Bob was killing the cows? Pierce tilted his head, confused, then suddenly remembered the wolflike creature. Maggie gasped and looked at him. She was thinking the same thing. They turned to stare at Uncle Bob.</p><p>He sighed. \"That was me you almost hit on the road. I change every time there's a full moon.\"</p><p>\"I didn't think werewolves existed,\" Maggie whispered.</p><p>\"I didn't think vampires existed\" Bob replied. \"But I'm not really a werewolf. There ain't no wolves in this part of Texas. It was a coyote that bit me.\"</p><p>Pierce blinked. \"You're a were-coyote?\"</p><p>\"Yep.\" Uncle Bob nodded.</p><p>\"It's the curse,\" Patrick moaned. \"We'll all get bitten. Rosalinda was bit, too.\"</p><p>Maggie gasped. \"You're a coyote, too?\"</p><p>She put down the carrot stick she'd been munching on. \"Actually, it was a jack-rabbit that bit me.\"</p><p>Maggie gasped again. \"You're the rabbit from last night?\"</p><p>Rosalinda nodded with a smile. \"I was curious about you.\"</p><p>\"Now, all our secrets are out.\" Dorotea gave Pierce a worried look. \"Are you still happy you found your family?\"</p><p>\"Yes. I'm happy you can accept me the way I am.\"</p><p>His mother smiled sadly. \"We love you, no matter what. That's how it is in a family.\"</p><p>Pierce stood and pushed back his chair. \"Then I hope there's room for one more in this family.\" He knelt beside Maggie's chair and took her hand in his. \"I love you, Maggie. Can you give up the glamorous life of a television star to be the wife of a poor guano farmer?\"</p><p>\"Yes!\" She slipped out of the chair and into his arms. \"Yes, I can.\"</p><p>Epilogue</p><p>One month later</p><p>\"It's over, Don Orlando.\" Maggie stood over the fake hospital bed on the set at DVN. Pierce lay there silently, pretending to be in a coma.</p><p>\"I can never see you again.\" She turned away from the bed and faced camera two. \"I've decided to leave the country. There are so many sick people in South America. They need me.\"</p><p>Maggie spun around to face Don Orlando. \"But before I leave, there's one thing I must do.\" She took his hand and leaned over the bed. \"I have to tell you how I truly feel. It was always impossible for us. You're the greatest vampire lover in the world, while I'm a famous, mortal brain surgeon. Our love could never be.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She sat beside him, clutching his hand to her breast. \"But I will always love you, Don Orlando.\"</p><p>He moaned and turned his head.</p><p>Maggie leaped to her feet, releasing his hand. \"Oh my God. It's a miracle! He's coming out of the coma!\"</p> <p>\"Dr. Jessica,\" he whispered, opening his eyes. \"You've come back to me.\" He grabbed her hand.</p><p>She swayed away from him, directing a forlorn look at camera one. \"I must go. I'm leaving for South America tonight.\"</p><p>\"Then I will come with you.\" He sat up in bed.</p><p>\"And leave your mariachi band?\"</p><p>\"They can come with me. I hear there is a shortage of mariachi bands in South America.\"</p> <p>She sat next to him on the bed. \"But you're famous here. You would give that up for me?\"</p><p>\"I love you, Dr. Jessica. Wherever you go, I shall go with you.\" He pulled her into his arms.</p><p>\"I love you, too, Don Orlando.\"</p><p>\"Then my life is complete.\" His mouth covered hers.</p><p>Maggie wrapped her arms around him and savored this last kiss with Don Orlando.</p><p>\"That's great!\" the director yelled. \"Cut!\"</p> <p>Pierce deepened the kiss, invading her mouth with his tongue. Maggie moaned and snuggled closer.</p><p>\"I said cut!\"</p><p>Pierce planted kisses down her neck and nuzzled her ear. \"I love you, Mrs. Maggie O'Callahan.\"</p><p>She sighed with contentment.</p><p>He pulled back and gave her a rakish Don Orlando look, one dark brow raised. \"Shall we adjourn to my dressing room?\"</p><p>With a laugh, Maggie walked off the set with her husband, the greatest lover in the vampire world. </p> </body></html>"]