["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>Romania, 1476</p><p>He was coming for her. She knew it. Esperetta of the house of Dracul could hear him out in the cold darkness. Unseen. Fearsome. Threatening.</p><p>And he was getting closer.</p> <p>Closer.</p><p>So close, she could feel his breath on her skin. See his evil eyes as he relentlessly stalked her through the night while she ran from him, hoping to find some way to escape.</p><p>He wanted her dead.</p><p>\"Esperetta...\"</p><p>There was magic in that deep, sultry voice. It'd always had a way of making her weak. Of lulling her into a stupor. But she couldn't afford that now. Not after she knew him for the monster he really was.</p> <p>She stumbled through the darkness as the fog seemed to wrap itself around her, slowing her down, pulling her back toward where he waited to devour her. The cry of wolves echoed on the wind that sliced through her dirt-stained gown and cloak as if she were naked in the woods.</p><p>Her breathing labored and painful, she tripped and fell against a wall of solid black steel. No, not steel.</p><p>It was him.</p><p>Her hand was splayed over the frightening gold emblem on his armor of a coiled serpent that mocked her with its venom. Terrified, she looked up with a gasp into those deep, dark eyes that seemed to penetrate her. But that wasn't what scared her. It was the fact that she was in her white burial gown. The fact that she'd clawed her way out of her own grave under the weight of the full moon to find herself alone in the church cemetery. She'd stared down at the tombstone that had held her name and death date for almost an hour before she'd found the courage to leave that place.</p><p>No longer in Moldavia as she'd been when she went to sleep, she was in a small village outside of Bucharest. In the churchyard by her father's castle, where she'd been born.</p><p>Needing to understand what had happened to her, she'd made her way toward her father's home, only to find an even worse horror than waking in her own grave.</p> <p>She'd seen her husband kill her father before her very eyes. Seen him gleefully hand her father's head off to his Turkish enemies. Screaming, she'd run from them, out into the night.</p><p>And had run without stopping until now. Now she was in the arms of a man whose black armor was covered in her father's blood. A man she'd sworn to love for all eternity.</p><p>But it wasn't this man she'd loved. This was a coldhearted monster. A liar. He might bear the same imposing height. The same long black wavy hair and sharp, aristocratic features, but it wasn't Velkan Danesti who held her now.</p><p>It was the devil incarnate.</p><p>\"Let me go!\" she snarled, wrenching herself away from him.</p><p>\"Esperetta, listen to me!\"</p><p>\"No!\" she shouted, moving away as he tried to touch her again. \"You killed me. You killed my father!\"</p><p>He scowled at her and if she hadn't seen his darker side for herself, she might even believe the sincerity he feigned. \"It's not what you think.\"</p> <p>\"I. Saw. You. Kill. Him.\"</p><p>\"Because he killed you.\"</p><p>She shook her head. \"You lie! You're the one who gave me the poison. You! Not my father.</p><p>He loved me. He would never have hurt me.\"</p><p>\"Your father stabbed you through the heart when he saw you dead to make sure you weren't feigning.\"</p><p>Still, she didn't believe him. He was lying and she knew it. Her father would never have done such a thing. When Velkan had given her the sleeping balm he'd told her that it would make her sleep so soundly that no one would know she was alive. He'd promised that no one would bury her, since that had always been her fear. Side by side, they were supposed to awaken from their sleep so that they would be free to stay together forever.</p><p>But she hadn't awakened in her bed. She'd awakened in her grave.</p><p>Now, she knew what he'd planned all along. To kill her and her father so that he could avenge his own father and take their lands for his family. Velkan didn't love her. He'd used her and like a fool, she'd played into his hands and cost her father his life.</p><p>She ran for the woods again only to have Velkan overtake her.</p><p>She tried to pull away, but he held her arm in a fierce grip.</p><p>\"Listen to me, Esperetta. You and I are both dead.\"</p><p>She frowned at him. \"Are you insane? I'm not dead. I only slept as you said I would. What madness are you trying to convince me of?\"</p><p>\"No madness,\" he said, his eyes burning into her. \"When we wed, I bound our souls together with my mother's sorcery. I told you that night that I didn't want to exist without you and I meant it. When your father killed you, I swore vengeance against him, and after he killed me, a goddess came and offered me a bargain. I sold my soul to her so that I could avenge you by killing him. For you. I didn't understand when I made the bargain with Artemis that it would involve you, too. Because I live, you live. We are joined together. Forever.\" Then he did the most unbelievable thing of all. He opened his mouth to show her a set of long, sharp fangs.</p><p>He was an upyri!</p><p>Her heart pounded in terror. It couldn't be! This wasn't her beloved husband, he was an unholy demon. \"You're in league with Lucifer. My father was right. All of the Danestis are an evil who must be purged from this earth.\"</p><p>\"Not evil, Esperetta. My love for you is pure and good. I swear it.\"</p><p>She curled her lip at him as she pried his grip from her arm. \"And my love for you is as dead as my father,\" she spat before she ran through the fog once more.</p><p>Velkan forced himself to stand still and not follow her again. His bride was young and she'd been through a shock tonight.</p><p>She would return to him. He was certain of it. In all the violence and horror of his life, she'd been the only thing he'd ever had that was good and gentle. She alone had touched his long dead heart and caused it to live again. Surely, she wouldn't stay angry at him. Not when all he'd done was protect her.</p><p>She would see the truth and she would return to him.</p><p>\"Come back to me soon, my Esperetta.\" And then he uttered the one word that had never left his lips before. \"Please.\"</p><p>Chapter One</p><p>Chicago, 2006</p><p>\"Just out of curiosity, can an immortal choke to death on a bagel?\"</p><p>Retta Danesti cut a vicious glare to her best friend as she tried to swallow the bite that was lodged painfully in her throat. As a shape-shifter who'd befriended her almost four hundred years ago, Francesca was well aware of the fact that Retta's husband had sold their souls to the goddess Artemis and by default made Retta immortal.</p><p>And Francesca's latest news had stunned her so badly, she'd sucked a piece of bagel down her windpipe, where it burned like fire.</p><p>Francesca pounded her gently between the shoulder blades. \"C'mon, babe, I knew it would piss you off, but I didn't mean for it to kill you.\"</p><p>Retta reached for her bottled water and finally cleared her throat even though her eyes were tearing up unmercifully. \"Now what did you just tell me?\"</p><p>Francesca put her hands in her lap and gave her a level stare. \"Your husband is opening the Dracula theme park in Transylvania next summer and the key attraction is the mummified remains of Vlad Tepes—Dracula himself. Apparently Velkan's going to release the body to scientists so that they can verify the remains through tests and prove that it really is the impaler of medieval legend.\"</p><p>Every part of Retta seethed. \"That rank bastard!\" She cringed as she realized several heads in the deli turned toward her.</p><p>Francesca lowered her voice and spoke behind her hand. \"He doesn't really have your father's remains, does he?\"</p><p>Retta recapped her water as she wished a thousand vile things on Velkan's head. Including pestilence and plagues that would cause a certain part of his anatomy to shrivel up and rot off. \"It's possible. After all, Velkan killed him and was probably the one who buried him.</p><p>Although I doubt he has the head since he gave that to my father's enemies.\"</p><p>She clenched her bottle even tighter. \"Damn him! First he gives Stoker that ridiculous book, then he starts the tours, then the Dracula restaurant and hotel, and now this. I swear, God as my witness, I'm going to get an ax and kill him once and for all.\"</p><p>Francesca's light blue eyes were warm with concern. Even though she was a wolf in animal form, those eyes were very catlike when she was human. The only thing the human Francesca shared with her wolf counterpart was her thick, dark chestnut hair. And speedy reflexes. \"Calm down, Retta. You know he's only doing this to get under your skin.\"</p><p>\"And it's working.\"</p><p>\"C'mon, he wouldn't really do this.\"</p><p>\"To get back at me? Yes, he would.\" She ground her teeth in frustration as she continued to call down the wrath of hell on his head. For centuries Velkan had done nothing but strike at her and her family. \"I hate that man with every fiber of my being.\"</p><p>\"Why did you marry him then?\"</p><p>That was something she didn't want to think about. Even five hundred years later, she could still see the night they'd met clearly in her mind. She'd been on her way home from the convent, for a visit with her father when her party had been attacked by Turks. They'd killed everyone but her and were well on their way to raping her when all of a sudden her assailants had been beheaded.</p><p>Too scared to scream, she'd lain on the ground, covered in their blood, waiting for her own death as she looked up at the men in armor who were routing the few attackers who'd managed to run.</p><p>Dressed in his dull black armor that held a gold serpent emblem, the knight who'd killed her would-be rapists had quickly wrapped her in his fur-lined cloak and picked her up from the ground. Without a word to her, Velkan had carried her on the back of his destrier to his home, where he'd made sure she was well tended and fed.</p><p>She could still remember the sight of his fierceness, the raw power that had bled from every part of him. He'd worn a black basinet helm that'd been fashioned to look like a bird of prey so that it inspired fear in his enemies. And it had definitely scared her to the core of her soul.</p><p>She'd had no idea of his features until later that night when he'd come to check on her. But it wasn't his handsomeness or his strength that had captivated her, it'd been his uncertainty around her. The fact that this man who'd been so intrepid and strong before the Turks had actually trembled when he reached out to touch her.</p><p>It'd been love at first sight.</p><p>Or so she thought.</p><p>Her heart aching from the memory, Retta curled her lip as she banished that memory and reminded herself that in the end Velkan had betrayed her and murdered her father. \"I was young and stupid, and had no idea what I was letting myself in for. I thought he was a noble prince. I had no idea he was barely one step up from a monkey.\" She grabbed the printed-out page that Francesca had brought to lunch from Yahoo! News. \"I take that back and I deeply apologize to all the primates of the earth for insulting them. He's not worthy of monkeydom. He's a slimy slug trail.\"</p><p>Francesca dipped her french fry into ketchup. \"I don't know, I think it's kind of sweet that he keeps doing these stunts to get you to come see him.\"</p><p>Yeah, right. \"That's not why he's doing this. He's trying to torture me and get back at my father. This isn't about tender feelings. It's about a man who's ruthless. A man who, even after five hundred years, can't let my family rest in peace. He's an animal.\" Sighing, Retta tossed the paper back to the table and reached into her purse for her Treo phone.</p><p>\"What are you doing?\"</p><p>\"I'm booking a flight to Transylvania so that I can kill him in person. Then I'm going to stop these antics once and for all.\"</p><p>Francesca snorted. \"No, you're not.\"</p><p>\"Yes, I am.\"</p><p>\"Then make it two.\"</p><p>Retta would have questioned that, since shape-shifting Were-Hunters could teleport from one location to another, but for some reason Francesca had always liked to travel with her.</p><p>Of course, if Retta were smart, she'd make Francesca teleport her, too, but she hated to travel that way, even though it was virtually instantaneous. She might be immortal, but Retta liked to pretend she was as normal as possible. Besides, if Were-Hunters didn't know the area and shifted to it, they could hit a tree or manifest right in front of someone. Both experiences had nasty repercussions.</p><p>She paused in her dialing to watch Francesca pour more ketchup. \"Why are you coming?\"</p><p>\"After all these years of listening to you rant about Prince Dickhead, I want to meet him for myself.\"</p><p>\"Fine, but remember to avert your gaze from his. He'll suck the goodness right out of the marrow of your bones and leave you as morally bankrupt as he is.\"</p><p>Francesca let out a low whistle. \"Dang, remind me not to make you mad. I mean, really. How bad can he be?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Trust me. They don't come any worse than him. And you're about to see just how right I am.\"</p><p>Chapter Two</p><p>Retta had forgotten the beauty of her homeland. But as they made their way up the narrow mountain pass toward the hotel where she and Francesca would stay, old memories slammed into her. Even with her eyes wide open, Retta could still see this land as it had been when there were no power lines or modern buildings to mar it. No roads except for dirt paths worn by horses as they traversed the Wallachian landscape on their way to villages and Bucharest.</p> <p>God, how she missed the mountains of her childhood. As a young woman, she'd spent countless hours staring out at them from the windows of her convent. No matter the season, they'd always been breathtaking—like a piece of heaven that had fallen to earth. It had never failed to capture her imagination and make her wonder what it would be like to fly over the mountains and explore distant countries.</p><p>Of course in her human lifetime that had been an impossible dream. Since her death, she'd traversed the entire globe trying to escape Velkan's cruelty.</p><p>As they rode in the taxi, they passed many thatched cottages that seemed lost in time.</p><p>Some she could have sworn were here five hundred years ago when she'd fled this land to escape her husband.</p><p>She'd vowed that night to never return.</p> <p>Yet here she was. And she was every bit as uncertain now as she'd been then. Her future every bit as unclear. The only thing that had kept her going back then had been Francesca's friendship. Francesca had joined her in Germany as Retta had been making her way from Wallachia to Paris. They'd met in a small inn where Retta had stopped for food.</p><p>There had been an awful rainstorm that had come up suddenly while she dined. It was so bad that her driver had refused to go onward until it stopped. Because of that, there weren't any rooms left for rent. Francesca had been kind enough to share her room with Retta.</p><p>Since that fateful night, they'd been virtually inseparable. There was nothing she'd treasured more over the centuries than Francesca's loyalty and wit.</p><p>\"You okay?\" Francesca asked.</p><p>\"Just thinking.\"</p><p>Francesca nodded as she looked out the window. \"Is it the way you remembered it?\"</p> <p>She didn't comment as she realized the driver was looking at them in the rearview mirror.</p><p>\"Goat!\" Retta shouted in Romanian as the animal darted into the road in front of them.</p><p>The driver slammed on the brakes, causing her and Francesca to tumble forward in their seats. They both let out \"umphs\" as they hit the back of the front seat and had the breath knocked out of them. Exchanging looks of aggravation, they resettled themselves back into place.</p><p>Francesca fastened her seat belt.</p><p>The driver smiled at them from the rearview mirror. \"You are one of us, eh?\" he said in Romanian. \"I thought you looked like a natural daughter.\"</p><p>Retta didn't respond. How could she? He'd die to know just how natural a daughter she was.</p><p>After all, it was her infamous father who had made this little corner of the world such a tourist spot.</p><p>That thought made her ache as she remembered the turbulent time of her mortal years. This land had been covered in blood as battle after battle was fought between the Romanian people and the Turks. Between her family and her husband's as they vied for political power.</p> <p>She'd foolishly thought that by marrying Velkan she could ease the war and hostility between their families so that they could focus on the land's invaders.</p><p>That mistake and the well-known tragedy of their lives during the fifteenth century was what would lead a man called William Shakespeare to write Romeo and Juliet roughly a hundred years later. And just like his couple, their secret marriage had led to both their deaths.</p><p>But it'd been her husband's black sorcery that had led to their resurrections and immortality.</p><p>Damn him! Even after all these centuries she couldn't forgive him. Besides, what few times she'd weakened, he'd always done something to renew her anger.</p><p>She pushed that thought aside as they reached the hotel. She got out first while the driver went to pull their suitcases from the trunk. Retta looked up at the quaint hotel with its highly arched roof and stylized black trim. Dusk was setting as she took her suitcase from the older man and paid him his fee.</p><p>\"Thank you,\" he said.</p><p>Retta inclined her head as she and Francesca made their way toward the hotel's blackwood stairs.</p><p>Francesca frowned at a flyer that was on a bulletin board at the base of them. It was identical to several others except for the fact that it was written in English. \"Did you see this?</p><p>Dracula tour begins in an hour at the old church.\"</p><p>Retta seethed. \"A pox on both his testicles.\"</p><p>Francesca laughed at that. \"That's harsh.\"</p><p>\"Yes, it is. But he deserves a lot worse. Bastard.\"</p><p>\"May I help you with your bags?\"</p><p>Retta jumped at the deep, thickly accented voice that appeared suddenly. Where the hell had he come from? Turning around, she met the gaze of a handsome man in his late twenties who stood just in front of her. A man who looked enough like Francesca to be her brother—right down to the dark chestnut hair and strikingly blue eyes. \"Are you with the hotel?\"</p><p>\"Yes, my lady. My name is Andrei and I will be here to serve you in any manner you wish.\"</p><p>Francesca laughed, but Retta had a sneaking suspicion that his double entendre wasn't from trying to speak a different language. He knew what he was offering. \"Thank you, Andrei,\" she said coldly as she handed him her bag. \"We just need to check in.\"</p><p>\"As you wish... madame?\"</p><p>\"She's a madame, I'm a miss,\" Francesca said, handing him her suitcase as well.</p><p>\"I knew I should have left you in Chicago,\" Retta mumbled as Francesca winked at the handsome Romanian. Yet she wasn't flirting with him, which for Francesca was a first.</p><p>\"I am sure you will both enjoy your stays here at Hotel...\"—he paused for effect before he rolled the next word with true Romanian flare—\"Dracula. We are having a special tonight.</p><p>Staked steak with a tart raspberry sauce and minced-garlic mashed potatoes for keeping away those evil vampires.\" There was a devilish gleam in his eyes that Retta didn't find charming or amusing.</p><p>Rather, it just pissed her off.</p><p>\"I imagine the garlic will keep away much more than vampires, eh, Andrei?\" she said sarcastically.</p><p>He didn't speak as he led them up the stairs to the hotel's doors. There was a stereotypical winged vampire head on each door that opened into the blood-red lobby. There were pictures of different Hollywood depictions of Dracula everywhere, along with sketchings and paintings of Retta's father.</p><p>And her \"favorite\" was the golden cup in a case with the plaque that declared it to be the cup her father had set out in the central square of Tîrgoviste. He'd proclaimed his lands so free of crime that he'd put it there to tempt thieves. Terrified of him, none had ever dared to touch it. It'd stayed in the square all throughout his reign.</p><p>Right next to that was what appeared to be a stake with dried blood on it and a plaque that said it was the one her father had used to skewer a monk for lying to him. Bile rose in her throat.</p><p>\"Ever feel like you've walked into a nightmare?\" Retta asked Francesca.</p><p>\"Oh, c'mon. Enjoy it.\"</p><p>Yeah, right. The only thing she would enjoy was kicking Velkan's balls so hard that they came out of his nostrils. Hmmm... maybe she was her father's daughter after all. For once she understood her father's deep need to torture his enemies.</p><p>Andrei led them across the lobby. \"Would you like tickets for tonight's tour?\"</p><p>Retta spoke without thinking. \"Like another hole in my head.\"</p><p>He frowned at her.</p><p>\"That's American slang for 'no thank you,'\" Francesca said quickly.</p><p>\"Strange. When I was in New York it was slang for 'no fucking way.'\"</p><p>\"You were in New York? When?\" Francesca asked in a stunned tone.</p><p>\"A year ago. It was... interesting.\"</p><p>Something strange passed between them.</p><p>Retta shook her head. \"It must have been quite the culture shock for you.\"</p><p>\"It took a little getting used to, but I enjoyed it there.\"</p><p>\"What made you come back?\" Retta asked.</p><p>His gaze bored into hers as if he knew who and what she was. \"Once Transylvania is in your blood, it never leaves you.\"</p><p>Retta disregarded that. \"Tell me, Andrei. Do you know a Viktor Petcu?\"</p><p>He arched one handsome brow. \"And why would you wish to speak to him?\"</p><p>\"I'm an old friend.\"</p><p>\"I somehow doubt that, since I know all of his old friends and I would have remembered a woman so beautiful in his past.\"</p><p>Someone tsked.</p><p>Retta turned toward the counter to find a woman moving to stand before the old-fashioned ledger that was there. Appearing around the age of forty, she was dressed in the traditional Romanian peasant blouse and loose skirt. Tall and quite striking, she was someone Retta hadn't seen in over five hundred years.</p><p>Surely it couldn't be...</p><p>\"It is not Viktor she wants, Andrei,\" the woman said, indicating Retta with a tilt of her chin.</p><p>\"She is here for Prince Velkan.\"</p><p>\"Raluca?\" Retta breathed as she stared in shock at the woman.</p><p>She bowed to her. \"It is good to have you home again, Princess. Welcome.\"</p><p>Her jaw slack, Retta approached the woman slowly so that she could study her features. She looked only slightly older than she'd been when Retta had last seen her. Only then Raluca had been a servant in Retta's father's castle.</p><p>\"How is this possible?\"</p><p>The woman glanced to Andrei before she answered. \"I am a Were-Hunter, Princess.\"</p><p>Were-Hunter. They were akin to the vampires or Daimons her husband had been created to kill. The Daimons had once been mortals who'd run afoul of the Greek god Apollo. A group of them had assassinated the god's mistress and child. As a result, Apollo had cursed them all to having to drink blood to live and for all of them to die at the tender age of twenty-seven.</p><p>The only way for them to live longer was to steal human souls. Dark-Hunters had been created by Apollo's sister Artemis to kill the Daimons and free the human souls before they died.</p><p>Several thousand years after that, an ancient king had unknowingly married one of their cursed race. When his wife had decayed on her twenty-seventh birthday, he'd realized that his beloved sons would meet their mother's fate. To save them, he'd magically merged the souls of animals with their race until he'd found a way to save them. Thus, the Were-Hunters had been created. Able to bend the laws of physics and with highly developed psychic sense, the shape-shifters lived for centuries.</p><p>But it was rare for a Were-Hunter to be near a Dark-Hunter, never mind serve one. Since Dark-Hunters were created to kill their Daimon cousins, most Were-Hunters avoided them at all costs.</p><p>Most.</p><p>Retta looked over her shoulder to Francesca, who was now squirming uncomfortably. A bad feeling went through Retta as she realized that Francesca had befriended her just weeks after she'd fled Romania. They'd known each other almost fifteen years before Francesca had confided the truth of her existence to Retta.</p><p>Now she had a suspicion that sickened her.</p><p>\"Lykos?\" Retta asked Raluca. That was the Were-Hunter term for their wolf branch.</p><p>\"Raluca is my mother,\" Francesca said quietly. \"Andrei and Viktor are my brothers—it's why I never used a surname. I didn't want you to realize I was one of the family.\"</p><p>Retta couldn't breathe as she stood there with her emotions in turmoil. Anger, hurt, betrayal.</p><p>They were all there and they each wanted a turn at Raluca and Francesca, but most of all, they wanted Retta to beat her husband. \"I see.\"</p><p>\"Please, Princess,\" Raluca said, her bright blue eyes burning with intensity. \"We're only here to help you.\"</p><p>\"Then call me another cab and get me back to the airport ASAP.\"</p><p>Francesca shook her head. \"We can't do that.\"</p><p>Retta glared at her. \"Fine then. I'll do it myself.\" As she moved toward the phone on the desk, Raluca pulled it away.</p><p>Retta saw the sympathy in Raluca's eyes as she cradled the phone to her chest. \"I'm truly sorry, but you can't leave here, Princess.\"</p><p>\"Oh yes, hell I can and I am.\" Retta started for the door, only to have Andrei block her path.</p><p>\"You are in danger, Princess.\"</p><p>She narrowed her eyes on him. \"Not me, buddy. But you are if you don't move out of my way.\"</p><p>Francesca took a step toward her. \"Listen to him, Retta, please.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She turned on Francesca with a hiss. \"Don't you dare start on me. I thought you were my friend.\"</p><p>\"I am your friend.\"</p><p>\"Bullshit! You lied to me. Deceived me. You knew how I felt about Velkan and yet you never once told me that you serve him.\"</p> <p>Francesca glared at her. \"Yes, Retta. Prince Velkan sent me to watch over you because he was afraid for you to be alone. As you've said repeatedly over the centuries, you were young and naive. You spent the whole of your life behind a convent wall. The last thing he wanted was for you to be hurt again, so I was charged with your care. Is that really a crime after all we've been through together?\"</p><p>\"I didn't need a babysitter. How could you play both sides of the fence when you knew how much I hated him?\"</p><p>Those blue eyes singed her with sincerity. \"I never played you. Okay, so I didn't mention that he'd sent me to stay with you originally. So what? We are friends.\"</p><p>\"Uh-huh. Friends don't lie to each other.\"</p><p>\"What lie?\"</p> <p>\"You said you never met him.\"</p><p>\"She has never met him,\" Raluca said quietly. \"I am the one who sent my daughter after you at the prince's request. She was the one closest to your area when you left here. But Francesca has never met His Highness. Not once.\"</p><p>That made Retta feel better than she wanted to admit, but still it didn't rectify any of this.</p><p>They'd all deceived her and she was too tired to play this game anymore. \"It doesn't matter.</p><p>I'm going home.\"</p><p>Andrei blocked her way again. \"You are home, Princess.\"</p> <p>\"Like hell.\" She feinted to the right, then rushed left, past him.</p><p>He caught her in his arms before she could make it to the door.</p><p>\"I don't want to hurt you, Andrei, but so help me, I will.\"</p><p>Before he complied, Francesca went to the door and locked it with a key. \"You're not leaving.\"</p><p>\"Damn you!\"</p><p>\"Look, spew at me all you want, but you need to be aware of why I brought you here.\"</p><p>Retta crossed her arms over her chest. \"Let me guess. Velkan wants to see me?\"</p><p>\"No,\" Raluca said, joining them. \"The only thing His Highness would like to see in regards to you, Princess, is your disembowelment.\"</p> <p>Now that surprised her. \"Since when?\"</p><p>It was Andrei who answered. \"Since about halfway through the sixteenth century when it became obvious that you had no intention of returning. He's been cursing your name ever since. Loudly, too, I might add.\"</p><p>Raluca nodded eagerly.</p><p>For some reason Retta didn't want to think about, that actually hurt her feelings. She'd assumed that all of his attempts to besmirch her father's name and reputation had been his way of getting her to contact him. Of course, she'd had no intention of ever doing that since she still wasn't convinced he hadn't intended to kill her the night he'd given her his sleeping potion.</p><p>\"Then why am I here?\"</p><p>Andrei took a deep breath before he answered. \"Because of Stephen Corwin.\"</p><p>She was baffled by the name. How in the world could he fit into this madness? \"The investment broker?\"</p><p>\"Among other things,\" Francesca said. \"Remember when I told you I had a weird feeling about him?\"</p><p>\"You have weird feelings all the time. Nine times out of ten, they're attributable to either pizza or spoiled beer.\"</p><p>Francesca gave her an unamused stare. \"Yeah, right. Remember when I told you that his scent bothered me? That I couldn't place it? Well, I did some checking and it turns out he's a member of the Order of the Dragon. Sound familiar?\"</p><p>Retta rolled her eyes. Both her father and grandfather had been members. Their epitaphs of Dracul and Dracula had stemmed from their membership. \"That order ceased to exist not long after Velkan killed my father.\"</p><p>Raluca shook her head. \"No, Princess, it didn't. They merely went underground and wanted the rest of the world to think that. It was a cousin to Mathhias Corvinus who lost his wife to a Daimon. Horrified by the demon who claimed her life and soul, he reestablished the order to purge the world of the undead. They went on a killing spree of Daimons, and he called for his brethren to help him. But they didn't stop there. They killed our people and countless Dark-Hunters as well. They don't distinguish between us. To them, one preternatural being is the same as the other and all of us should be exterminated. Even now, centuries later, they hunt us without discrimination, brutally slaughtering all they find.\"</p><p>Retta felt terrible about that, but it still didn't explain why they wanted her to stay here. \"What has this to do with me?\"</p><p>Francesca took a deep breath before she answered. \"I think Stephen was sent to kill you.\"</p><p>Retta scowled at her friend. \"Are you insane? There's no way.\"</p><p>\"Remember the tattoo on his arm you told me about? The one of a dragon coiled around the cross? It's their emblem. He's one of them, Ret, trust me.\"</p><p>\"Trust you? After all these centuries when you were lying to me? Think again. Stephen wouldn't hurt me. He's had ample time to try.\"</p><p>Francesca gave her a deep, meaningful stare. \"Are you sure?\"</p><p>Retta hesitated, then hated herself for it. Stephen had never once given her an indication that he was anything more than an acquaintance who wanted to be more significant in her life. But since she was still technically married and an immortal, she'd kept him at bay. \"Of course I'm sure.\"</p><p>\"Then why has he been sniffing around you?\" Francesca asked coldly.</p><p>\"Because maybe he likes me?\"</p><p>\"Or he was trying to use you to get to Prince Velkan,\" Raluca said. \"That has been my theory. It is why the prince made sure that all mentions of you and your mother were purged from historical records. He didn't want anyone to learn that Vlad Dracula had a daughter, and most especially he didn't want them to know that you had married him. He knew that the order would pursue you to the ends of the earth if they ever learned of your existence.\"</p><p>\"It makes sense,\" Andrei added. \"The Corvinuses and the Danestis have a long history of bad blood between them.\"</p><p>Still Retta discounted their argument. \"This is not the Middle Ages, people. In case you haven't noticed, the wars are over.\"</p><p>\"No,\" Andrei said, glancing past her, toward the door. \"I think the war is only beginning.\"</p><p>Frowning at his dire tone, she turned her head to see what had his attention.</p><p>Her heart stopped beating as she saw the tall figure dressed in black armor, complete with helm and heraldry.</p><p>It was Velkan's.</p><p>And he was heading straight for her.</p><p>Chapter Three</p><p>Retta couldn't so much as draw a breath as Raluca opened the door and Velkan swaggered in. At six foot four, he'd seemed like a giant to her when she'd been human. And again, she remembered the first time she'd seen him. Blood had coated that black armor. The blood of those out to rape and kill her. She could still recall the sound of steel scraping steel as he moved. The sight of his dexterity even though every inch of his body had been covered by armor.</p><p>More than that, she remembered the beauty of his face... the tenderness of his callused hands as they caressed her bare skin. The way he'd held her as if she were unspeakably precious, as if he feared she would shatter in his arms and leave him alone again.</p><p>Those memories surged and buried all the anger and hatred she'd nursed against him.</p><p>There for a moment, she wanted to go back to the beginning of their marriage. Back to the days when she had lived and died for this man. When she had trusted him without question.</p><p>He had been her entire world.</p><p>She'd known this moment would come, and in her mind she'd practiced a thousand things to say to him.</p><p>A thousand and then some.</p><p>But every one of them fled her memory as he approached her and some foreign part wanted to embrace him after all these centuries. She wanted to rush into his arms and just feel him hold her again.</p><p>She'd expected him to curse her or kiss her. To stare at her as if he couldn't believe she was here. To try to strangle her. Something. Anything. But in all her imagined scenarios nothing had come close to what he did next.</p><p>He walked right past her as if he didn't know her and seized Francesca in a fierce hug before he danced around the room with her.</p><p>Baffled, Retta put her hands on her hips as a wave of rage whipped through her body. How dare he grab another woman and not even acknowledge her! She opened her mouth to speak only to be hushed as the knight started laughing in a tone that was nothing like Velkan's. It was light and almost boyish.</p><p>\"Oh, my little sister! It's been far too long since I last saw you. How have you been?\"</p><p>\"Viktor,\" Raluca said with a laugh. \"Put Francesca down before you bruise her.\"</p><p>Francesca pulled the bird-shaped helm from his head, exposing his laughing features, as opposed to Velkan's serious countenance. With brown hair and teasing blue eyes, Viktor quickly complied with his mother's orders and set Francesca back on her feet. Laughing, she hugged him close while Retta let out a long breath.</p><p>That had been close. Too close in fact and it made her realize that she didn't want to meet Velkan on his terms. She needed to make sure that she had control of their first meeting.</p><p>That her emotions and body didn't betray her again.</p><p>\"It's so good to see you,\" Francesca laughed at her brother. \"I've missed you so much.\"</p><p>And those words tugged at Retta's heart as she saw the affection her best friend shared with her family. Retta's own brothers had died hundreds of years ago, as had their entire lineage. There was no joyous homecoming for her. No parents.</p><p>No husband.</p><p>Nothing.</p><p>That hurt most of all.</p><p>Viktor paused as he realized that they weren't alone. \"Princess Esperetta?\"</p><p>\"Yes,\" Raluca answered for her.</p><p>Panic flickered in his blue eyes. \"We must get her out of here before the prince sees her.\"</p><p>Finally someone who actually saw reason.</p><p>Raluca waved his words away. \"He won't come here this early.\"</p><p>Viktor shook his head in denial. \"She can stay the night, but come the morrow, she needs to leave before he learns that she is here.\"</p><p>Francesca argued with him, \"I brought her here for protection. She must stay.\"</p><p>\"No,\" Retta said, growing tired of the way they spoke about her like she was a lost puppy who was out in the garage. \"I came here because Velkan is planning on putting my father's remains on display.\"</p><p>They exchanged a puzzled frown as Francesca turned a bit sheepish.</p><p>Absolute rage tore through Retta's entire being. \"Don't tell me you lied.\"</p><p>Francesca cringed. \"Only a little. I knew if I told you that, that it was the one thing that would get you to leave Chicago.\"</p><p>In all her life, Retta had never been more livid. \"Unbelievable! Un-friggin'-believable. How could you do such a thing?\"</p><p>Francesca was completely unrepentant. \"I did it to protect you.\"</p><p>Retta held her hand up as pure disgust filled her. \"Thanks, Frankie. It's not like I have a life as well as clients who need me.\"</p><p>\"You can't have clients if you're dead. Besides, Trish is handling them. They won't even miss you.\"</p><p>\"Save me the bullshit.\" She looked at Viktor. \"Get me a cab and I'm out of here. Right now.\"</p><p>He started for the counter.</p><p>\"Viktor,\" Raluca said in a thick, drawn-out accent. \"Touch that phone and you will regret it for the rest of your existence.\"</p><p>He arched both brows as he froze in place. \"But Mother... the prince will—\"</p><p>\"I will deal with the prince. You need to prepare yourself for the tour. Now go.\"</p><p>Retta could tell he wanted to argue but didn't dare. Instead, he cast a sullen look her way before he complied with his mother's orders.</p><p>\"Where is Velkan?\" Retta asked Raluca.</p><p>\"Not to be flippant, Princess, but he is wherever it is he wishes to be.\"</p><p>\"You won't tell me?\"</p><p>Raluca hesitated before she answered. \"I will not allow you to blindside him in his home after all he has suffered for you, Princess. I know of your feelings toward him from my daughter.\"</p><p>\"And still you side with him?\"</p><p>Raluca's gaze went toward the blunted spike tip on the wall. \"I will protect His Highness with every breath I hold in my body. But for him, I would have been impaled, too.\" And with those words spoken, she turned around and left Retta alone with Francesca and Andrei.</p><p>Retta gave Andrei an expectant look.</p><p>\"He will be in the Bloody Dungeon later.\"</p><p>\"The what?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's a club,\" Francesca explained. \"One where Daimons tend to pick off tourists who want to meet real vampires.\"</p><p>Well, didn't that make perfect sense? \"What time does he go there?\"</p><p>Andrei shrugged. \"Any time between now and dawn.\"</p> <p>\"You are just so helpful, Andrei.\"</p><p>\"I try to be, Princess.\"</p><p>\"And you fail with such panache.\"</p><p>He ignored her sarcasm.</p><p>Sighing, Retta looked at Francesca. \"I don't suppose I could talk you into just poofing me home again, could I?\"</p> <p>\"You don't like to teleport. It makes you queasy. Besides, I thought you didn't like me anymore.\"</p><p>\"I'm bordering on it. But you are the only family I have. Good or bad, and right now it's definitely bad. Let me go home and I will forgive you.\"</p><p>\"I can't do that, Retta. Sorry. But trust me, this is for your own good.\"</p><p>Fine then. Come morning, she'd slip away from them one way or another. She looked back at Andrei. \"We are one hundred percent sure Velkan won't come to this hotel, right?\"</p><p>\"Oh, I can absolutely guarantee it. He wants nothing to do with your family. He only ventures here once in a blue moon.\"</p><p>That just made her all warm and toasty inside. \"Then why do you run this place?\"</p> <p>He grinned at her. \"The money. We make a killing on it.\"</p><p>Great, just great. \"Whatever. I'm going to bed now. Give me a key and let me put this whole nightmare behind me.\"</p><p>Francesca frowned. \"Aren't you hungry?\"</p><p>\"No. I just need to sleep and forget this whole day has happened.\"</p><p>Andrei went behind the counter to sign her in. \"Would you like Dracula's Suite?\"</p><p>Retta narrowed her eyes at him. \"Keep pushing, Andrei, and you and I are going to play a game.\"</p><p>\"And what game is that, Princess?\"</p><p>\"Find the Ball in My Hand.\"</p> <p>He frowned. \"I don't see a ball, Princess.\"</p><p>\"Oh, you will, just as soon as I snap it off your body.\"</p><p>He flinched.</p><p>Francesca laughed. \"She's teasing, Andrei. Her bark is always worse than her bite.\"</p><p>Wishing she'd left her friend at home, Retta took the key card from his hand. \"Where's the room?\"</p><p>\"Top floor.\"</p><p>Without a word, Retta grabbed her suitcase and headed for the elevator. She got in and turned around to see Francesca and Andrei teasing each other as the doors closed. Pain sliced her heart. How she wished she could have her family back again. She'd adored her two little brothers. They had been one of the greatest joys of her human life. And a twinge of guilt went through her that she'd deprived Francesca of hers. She hated they'd been apart all these centuries.</p><p>But that had been Francesca's decision, not hers.</p><p>Sighing, she rode the elevator up to the room, and as soon as she pushed open the door she felt the need to go downstairs and hurt Andrei and Raluca. To say the place was tacky would be an insult to tackiness. The suite was large and airy, with blood-red walls that were decorated with every kind of woodcutting imaginable that depicted impalements.</p><p>She rolled her eyes as she headed for the bedroom, then stopped dead in her tracks. Unlike the sitting room, this one was done in black, white, and gray and was identical to the bedroom from Bela Lugosi's Dracula, where he'd bitten his fair maiden.</p><p>\"You people are sick,\" Retta said, grateful that at least in here there were no reminders of her father.</p><p>Setting her suitcase down, she peeled her coat away from her body as she toed off her shoes, then headed for the bed. She'd take a little nap to get the edge off her exhaustion and then she'd see about finding a rental car to get back to the airport. One way or another, she was going to get out of this place and go home.</p><p>She pulled the covers back and tucked herself into the large bed that cushioned her like a cloud, and before she knew it, she was sound asleep.</p><p>But her sleep was far from peaceful. In her dreams, she could hear her father's voice calling out to her. She could see Velkan delivering the death blow that had ended her father's life as his serpent emblem drifted through her mind, over all the images.</p><p>You are the daughter of the dragon... Death to the Danestis.</p><p>She came awake with a start. Retta lay silent as she listened to a fierce wind whipping against her windows. But that wasn't what had disturbed her.</p><p>She sensed a foreign presence in the room. It was powerful and frightening.</p><p>Reacting on pure instinct, she quickly rolled to her feet and struck out at where she sensed the presence. There was nothing there but air.</p><p>Now the presence was behind her.</p><p>She whirled about to confront the intruder only to find herself face-to-face with the last person she expected.</p><p>Velkan.</p><p>He stared at her with eyes so black she couldn't even tell where the iris stopped and the pupil began. Dressed in a pair of jeans and a tight black shirt, he wore his long, wavy black hair pulled back into a ponytail. He still had the same sharply chiseled features. The same feral look that announced to the world this was a man who not only could take your life but one who would relish the killing.</p><p>God, he was unbelievably sexy. Tall and commanding, he made every part of her warm and breathless. And as she stood toe-to-toe with him, she was tormented by images of being held between those muscular arms while he made love to her. Of being kissed by that perfect mouth. Of fingering the long scar that ran from the outer corner of his left eye to his chin. A scar that in no way detracted from the beauty of that masculine face. If anything it added to it.</p><p>She couldn't even think as a wave of pent-up emotions seared her to the spot.</p><p>Velkan couldn't breathe as he stared into eyes so blue they reminded him of the summer sky he'd not seen in over five hundred years. The scent of her hung heavy in his nostrils, reminding him of a time when that scent had clung to his body. Her skin was still as pale as a snowy field. Her hair the deep auburn red of a fox.</p><p>Not once in all these centuries had he forgotten her beauty. Her scent. The sound of her voice calling out to him.</p><p>The sound of her voice cursing him to death.</p><p>It was a mistake to be here. He knew it.</p><p>Still he was here, staring at a woman he wanted desperately to kiss.</p><p>A woman he wanted to kill. He'd given her everything he had and more, and in return she'd spat at him. He hated her for that even as a buried part of him loved her still. He'd lived and died for her. Had died a death no human being should ever have to suffer. And for what? So that she could run from him and deny they'd ever loved each other.</p><p>His father had been right. Women were useless outside of the bedroom and only a fool would ever give his heart to one.</p><p>\"What are you doing in my room?\" she breathed, finally breaking the taut silence that was rife with their bitter emotions.</p><p>His gut tightened at the sound of her cadent voice that was so similar to what he remembered and at the same time alien. She no longer bore her native accent. Now she sounded like the women in the American TV shows that Viktor watched.</p><p>Velkan ached to reach out and touch her, but honestly he didn't trust himself not to choke her if he tried. Anger, lust, and tenderness were at war inside him and he had no idea which of them would ultimately win. But none of it boded well for the woman in front of him.</p><p>\"I wanted to verify your presence with my own eyes.\"</p><p>She held her arms up in a sarcastic gesture. \"Obviously, I'm here.\"</p><p>\"Obviously.\"</p><p>She stepped back, her eyes guarded. \"Well then, you can leave.\" She gestured toward the door.</p><p>It was hard to stand here when all he wanted to do was pull her into his arms and taste those mocking lips. The air between them was filled with their mutual hatred. Their mutual desire.</p><p>He still didn't know how it had come to this. How a man could love a woman so desperately and still want to kill her.</p><p>It didn't make sense.</p><p>A million thoughts clashed inside his head. He wanted to tell her that he'd missed her. He wanted to tell her that he wished she were dead. That he'd never laid eyes on her.</p><p>Most of all, he just wanted to stay here and soak in the beauty of her features until he was drunk on them. You are one sick bastard. This was a woman who'd abandoned him five hundred years ago.</p><p>He might not have much in his life, but he did have his dignity. Be damned again if he'd allow her to take that from him. With a curt nod to her, he stepped back and turned toward the window to leave.</p><p>\"I want a divorce.\"</p><p>Those words stopped him cold. \"What?\"</p><p>\"You heard me. I want a divorce.\"</p><p>He laughed bitterly as he looked at her over his shoulder. \"As you wish, Princess. But make certain that you take a camcorder to the courthouse, as I would like to see the look on their faces when you present them with our marriage scroll and they note the date of it.\"</p><p>\"That's not what I mean,\" she said coldly. \"I want to be free of you. Forever.\"</p><p>Those words tore through him like a hot lance and did twice the damage. Grinding his teeth, he looked out the window, into the black night that had been his only solace all these centuries past. \"Then take your freedom and leave. I never want to see your face again.\"</p><p>Retta didn't know why his words shredded her heart, but they did. They even succeeded in bringing tears to her eyes as she watched him turn himself into a bat before he flew through her open windows.</p><p>In spite of everything, she wanted to call him back, but her pride wouldn't let her. It was best this way. They would both be free now...</p><p>Free for what?</p><p>She was still immortal. And no matter how much she hated it, she was still in love with her husband. Tears flowed down her cheeks as she realized the truth. She should never have come back here. Never.</p><p>But now it was too late. After all this time, she knew the truth. She loved Velkan. Even with all the lies and the betrayal. He still held her heart captive.</p><p>How could she be so stupid?</p><p>Closing her eyes, she saw him as he'd been on the day they'd married. It'd been a small monastery in the mountains. For the first time since childhood and in order to honor her, Velkan had laid aside his armor and wore a simple doublet of black velvet. Still unrefined even though he was a prince, he'd left his long hair loose to trail over his shoulders. She'd been dressed in a gown of dark green samite and velvet, trimmed in sable that matched her fur mantle.</p><p>It'd been the only time she'd seen him clean-shaven. His dark eyes had scorched her as he stared at her and uttered the words that would bind them together before God.</p><p>What she hadn't known then was that Velkan's mother had been a sorceress who'd taught her son well. And while he and Retta had taken holy vows, he'd bound her to him with the darkest of arts.</p><p>Without telling her.</p><p>What he'd done was unforgivable. So why then did a part of her ache to forgive him?</p><p>Retta tilted her head as she heard a light scratching at her door.</p><p>\"Velkan?\" she whispered. Her heart leaped at the prospect of it being him again.</p><p>Before she could stop herself, she rushed to the door and opened it. Her jaw dropped at the sight of the last person she'd expected to be there.</p><p>Tall and blond, he was a far cry from her darkly sinister husband. And for the first time, she realized he was pale in comparison to the man she'd left behind.</p><p>\"Stephen? What are you doing here?\"</p><p>His light blue eyes were filled with sympathy. \"My name is not Stephen, Retta. It's Stefan.\"</p><p>Before she could ask him what he meant by that, he blew something into her face.</p><p>Retta staggered back as her senses dulled. Everything shifted around her. Reacting on instinct, she kicked her foot out, catching him right between the legs. He doubled over immediately. But as she tried to close her door, her sight went black and she fell to the floor.</p><p>Chapter Four</p><p>Velkan landed on the balcony of his mansion that overlooked the quiet valley, and shifted back into human form. Five hundred years ago, this place had been accessible by a dirt road that led up the mountainside to his courtyard. It was a road he'd closed and let be overgrown two hundred years ago when he realized how often he watched it, waiting for Esperetta to return.</p><p>Now that road was completely covered by brambles and vines as the forest had reclaimed it. The only way to venture here was by flight or teleportation. Two things that helped to keep away anyone who had no business here.</p><p>Velkan paused on the carved-stone balcony to look back toward town. He'd already cleared out the Daimons who'd come to town to prey on the tourists and he still had hours before dawn. His house was completely dark and silent in the night. Viktor had chosen to stay at the hotel with his family—no doubt in fear of Velkan's mood.</p><p>And the man had every right to be afraid. Velkan didn't like surprises and Esperetta's arrival had definitely qualified as that. The Weres should have told him to expect her. What they'd done was unforgivable to him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The gilded French doors to his room opened silently at his approach, then slammed shut behind him. Long ago, his wife had been terrified of his supernatural powers. What he had now made a mockery of the ones he'd borne as a mortal man. Back then, he'd been limited to simple premonitions, curses, potions, and spells that had to be worked with blood and ritual.</p><p>Now his powers were truly fierce. Telekinesis, shape-shifting, and pyrokinetics. Over the centuries, he'd become the monster Esperetta had feared. He held his hand out and the bottle of bourbon flew to him. Uncorking it, he drank the bourbon straight from the bottle as he walked past a mirror that didn't cast his reflection.</p><p>He laughed at that. Until he neared the fireplace where Esperetta's painting hung. The look on her face froze him to the spot. And as always, it took his breath.</p> <p>He'd commissioned it right before their wedding. He'd hired Gentile Bellini and had practically been forced to abduct the man out of Venice for the work. But Velkan had known that no one other than that artist would have ever been able to capture her youth and innocence.</p><p>Bellini hadn't disappointed. If anything, he'd excelled past all of Velkan's expectations.</p><p>Esperetta had been so nervous that day. With bright summer flowers in her dark auburn hair and dressed in a light gold gown, she'd been an absolute vision. Bellini had placed her in the garden outside of Velkan's residence—a garden that was now a gnarled, unsightly mess from lack of care. She'd been fidgeting unmercifully until she'd spied Velkan sitting on the wall, watching her.</p><p>Their eyes had met and had held, and the shyest, most beautiful smile that ever graced a woman's face had been captured by the artist. It was a look that could still bring Velkan to his knees.</p><p>Snarling at the picture, he forced himself to walk onward, away from it. He should have burned it centuries ago. He still wasn't sure why he hadn't.</p> <p>In fact, he could send a blast to it even now and burst it into flames...</p><p>His hand heated up in expectation. But he balled it into a fist as he left his room, then descended the stairs to the first floor, where Bram and Stoker waited for his return. Calling out to his Tibetan mastiffs, he made his way to his study, where his fire had all but gone out.</p><p>He shot a blast of fire into it, making it roar to life. It bathed the room in a dull orange light and caused the shadows to dance eerily along the cold stone walls. He petted his dogs as they welcomed him home with joyful barks and licks. Then they bounded off to retake their seats beside his padded chair. Sighing, Velkan took his seat so that he could stare into the fire that did nothing to warm him. The light was painful for his eyes, but honestly he didn't care.</p><p>He glanced over at the dogs on each side of him. \"Be glad that you're both neutered. Would that I had been so fortunate.\" Because right then, his body was hard and aching for the one woman who would never again submit to his touch.</p><p>His anger mounting, he took another swig only to curse over the fact that the alcohol couldn't do anything to him. As a Dark-Hunter he could never get drunk. There was no escape from this pain.</p><p>Growling, he threw the bottle into the hearth, where it shattered into a thousand pieces. The flames sparked in greedy consumption of the alcohol. The dogs lifted their heads in curiosity while Velkan raked his hand through his hair.</p> <p>As bad as it had been before, it was so much worse now knowing that she was only a short distance away. Her scent still hung in his nostrils, making him even more feral than he'd been before.</p><p>You should go to her and force her to take you back.</p><p>That was what the Moldavian warlord Velkan Danesti would have done. He'd have never allowed a slip of a woman to lead him about.</p><p>But that man had died the night an innocent young woman had looked up at him with eyes so blue, so trusting, they had instantly stolen his heart. Perhaps this was his punishment for having lived such a brutal human life. To want the one thing he couldn't have. Esperetta's peaceful, soft touch.</p><p>Restless with his thoughts, he rose to his feet. Bram rose as well until he realized that Velkan was only going to pace the room. The dog settled back down while Velkan did his best to banish his memories.</p><p>But unfortunately, there was no way to cleave his heart from his chest and until he did that he knew he would never escape the prison his wife had condemned him to.</p><p>Retta came awake to a stinging headache and found herself tied to an iron chair. The room, which was industrial, like an old warehouse or something, was dark and damp, with an awful stench that was similar to that of a pair of old gym socks mixed with the smell of rotten eggs.</p><p>It was all she could do to breathe past the stench as she tried to wrest her wrists free of the ropes that held her down.</p> <p>She could hear faint voices from an adjoining room...</p><p>She strained to hear them, but all she caught was a faint whisper until a loud roar rang out,</p><p>\"Death to the Danestis!\"</p><p>Great chant, especially since she was technically one of them. Granted, she didn't want to claim kinship, but on paper...</p><p>\"She's awake.\"</p><p>Retta turned her head to see a tall, gaunt man in the doorway. Dressed in black slacks and a turtleneck, he reminded her of a slick city drug dealer, complete with a gold-capped tooth.</p><p>And he eyed her as if she were the lowest life-form on the planet.</p><p>\"Thank you, George,\" an older man dressed in black slacks and a blue button-down shirt and sweater said as he moved past him. There was something innately evil about the older man. He was definitely the kind of guy who'd like to pull the wings off butterflies as a kid. Just for fun.</p><p>And pulling up the rear was her \"good\" friend Stephen, tall and blond. She'd originally liked him because he was the complete antithesis of her husband. Whereas Velkan's features were sullen and intense, Stephen's were wholesome and sweet. He'd reminded her of a very young Robert Redford.</p><p>If only she'd known that Stephen wasn't the boy next door. At least not unless you happened to live next door to the Munsters.</p><p>She glared at him with every ounce of hatred she felt. \"Where am I and what am I doing here?\"</p><p>It was the older man who answered. \"You are our hostage and you are in our... place.\"</p><p>Gee, he was ever so helpful. \"Hostage for what?\"</p><p>It was Stephen who answered. \"To get your husband to come to us.\"</p><p>She burst out laughing at the absurdity of that statement. \"Is this a joke?\"</p><p>\"No joke,\" the older man said. \"For centuries my family has been hunting him, trying to kill the unholy, unnatural creature he has become.\"</p><p>\"And we've been hunting you,\" \"Slim\" said as he stepped forward from the doorway.</p><p>The old man nodded. \"But always you and he escaped us.\"</p><p>\"Wow, that doesn't say much about your skills, since I didn't even know I was being chased.\"</p><p>He rushed forward as if to strike her, but Stephen caught him. \"Don't, Dieter. She's only trying to provoke you.\"</p><p>\"She's doing a good job.\"</p><p>Retta cleared her throat to draw their attention back to her. \"Just out of curiosity, why have you been hunting me?\"</p><p>Stephen stepped closer to her and offered her a cocky smile. \"Because you are the one thing we know that will draw Velkan out into the open. He's never responded to any lure we've cast at him... yet.\"</p><p>\"Yeah, well, bad news for you, pal. He won't come for me, either.\"</p><p>Dieter scoffed at her. \"Of course he will.\"</p><p>She shook her head. \"Hardly. News flash, guys. All of you have committed a felony for no good reason. I saw Hubby earlier tonight and he made it plain that he never wants to see me again.\"</p><p>The men exchanged puzzled stares.</p><p>\"Is she lying?\" the old man asked Stephen in German.</p><p>Retta had to force herself not to roll her eyes. Surely they weren't so stupid as to think she couldn't speak German?</p><p>\"She has to be,\" Stephen answered abruptly. \"Good God, the man was impaled for her. In all the centuries while our kind have watched him, he's never been with another woman or we would have used her to get to him. There's not even a record of a one-night stand, and he keeps tabs on Esperetta constantly. Face it, the werewolves would never have sacrificed a daughter to stay with her if he wasn't absolutely adamant that she be protected. Those aren't the actions of a man who hates her.\"</p><p>Slim concurred. \"The werewolf I tortured and killed said that he keeps her room just as she left it five hundred years ago. It even has the gown she wore when they married. There's a painting of her when she was human in his bedroom and photographs that have been sent to him to prove that she lives and is happy. He stares at the photographs every night.</p><p>There's no chance that he doesn't hold her sacred. If he hated her, he would have destroyed all traces of her centuries ago.\"</p><p>\"Likewise,\" Stephen said with a hint of rancor in his voice, \"she lives as a nun. I couldn't even get a kiss from her the whole time I've known her. She's only trying to protect him. I'm sure of it.\"</p><p>Retta couldn't breathe as she heard those words. It was true. She'd never touched another man. Had never even been interested in one. Of course, she'd told herself that once burned, a thousand times shy. And she couldn't very well date, let alone marry, a human man who would begin to wonder why she didn't age. After all, there were only so many ways to lie about plastic surgery before it became obvious she was immortal.</p><p>And in all this time, she'd convinced herself that Velkan hadn't been as faithful to her. During their lifetime, no woman would have ever expected fidelity from her husband. It was absurd.</p><p>Even her father, who was adamant about his Christianity and who demanded absolute faithfulness from his subjects, had been known to have mistresses.</p><p>So she'd convinced herself that Velkan had never really missed her. That he'd taken what he wanted and used her to kill her father.</p><p>Could it be that Velkan really did love her? That he missed her?</p><p>If it were true, then she deserved to die at their hands. Because if it were true, then she'd been punishing a man for centuries for no other crime than loving her.</p><p>No one should be hurt because of that.</p><p>Surely she hadn't been that stupid. Had she?</p><p>I am such a rabid bitch. No wonder Velkan had told her to get lost. She was lucky he hadn't choked her. Clenching her teeth to staunch the pain that ached inside her, she tried her best to remember what he'd said the night she'd left Romania. She could see the moonlight on his face, the blood on his armor.</p><p>They'd argued, but now she couldn't remember anything other than her confusion and fear of him. She'd been absolutely convinced that he'd tried to kill her by burying her in the ground.</p><p>That he'd lied about the tonic he'd given her.</p><p>But had he?</p><p>Please don't let me be wrong. Please. \"He won't come for me,\" Retta said from between clenched teeth. \"I know he won't.\"</p><p>Dieter narrowed those rodent eyes on her. \"We shall see. Not that it matters. Either way, we kill you.\"</p><p>It was almost five in the morning when Velkan found himself alone in his bedroom. Then again, he was always alone in his bedroom. God, he was such a fool. Any man worth his salt would just find a willing female and sate the ache in his loins for a woman's body.</p><p>But Velkan refused to forsake the oath he'd taken to Esperetta. He'd vowed before his father's God to honor her and to keep himself for her only, and he'd stood by that oath.</p><p>Even though he hated himself for it.</p><p>There was only one woman who held his attention and it was why he despised her so much.</p><p>She'd left him with nothing. Not even his manhood.</p><p>Damn her.</p><p>Suddenly there was a knock on his door. \"I told you to leave me alone, Viktor,\" he snarled, thinking it was his Squire.</p><p>\"It's not Viktor,\" Raluca said from the other side of the doorway.</p><p>How unlike her to venture here so close to the dawn. Not that the dawn held any sway for her, but normally Velkan would be preparing for bed.</p><p>Frowning, he opened the door with his thoughts to find her there, wringing her hands. Her sons and Francesca were behind her and all of them echoed their mother's worry. His stomach shrank. \"What has happened?\"</p><p>Raluca swallowed. \"They have taken her.\"</p><p>He knew instantly that Esperetta was the her. \"Who has?\"</p><p>\"The Order of the Dragon,\" Andrei said, his voice tinged by anger. \"Once they notified us that they held her, we tried to get her free, but...\"</p><p>\"But?\" Velkan prompted.</p><p>Francesca stepped forward. \"They have her tied inside a cage. An electric one. There's no way for us to get to her without it immobilizing us.\"</p><p>Velkan gave them a droll stare. \"Fine, let her stew there, thinking about how much she's betrayed me. When the sun sets, I'll go get her.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Weres exchanged a nervous glance before Raluca spoke. \"It's not that simple, my prince. They've put her on a small stool with no rungs. And that stool is on an electrified floor.</p><p>If she puts her legs down at all or slips from the stool, it'll kill her instantly.\"</p><p>Francesca nodded. \"They have enough juice on that floor to light up New York City.\"</p> <p>He wanted to tell her that he didn't care, but the fear in his heart told him exactly how much of a lie that was.</p><p>But before he could move, Raluca was by his side, with her hand on his arm. \"You know you can't go, either.\"</p><p>He narrowed his eyes on her. \"I'm not afraid of them.\"</p><p>\"It's too close to dawn,\" Raluca insisted. \"You'll end up like Illie if you go. They know our weaknesses.\"</p><p>Velkan took her hand in his and squeezed it gently. Illie had been her mate who'd died at the hands of the Order. Five years ago, he'd been captured when one of their Order had used a Taser on him. The electricity had shot through his cells, turning him from man to wolf and back again. It was one of the few things that could completely incapacitate a Were-Hunter.</p> <p>Enough electricity would ultimately kill them.</p><p>And if the Order had Esperetta, then they already knew Velkan's weakness.</p><p>\"Would you have her die?\" he asked Raluca.</p><p>He saw the pity in Raluca's face. She'd been Esperetta's nurse before his wife had been oblated to the convent.</p><p>\"Not by choice. But better her than you.\"</p><p>\"Mom!\" Francesca snapped. \"No offense, but I choose Retta in this. She's an innocent victim.\"</p> <p>Her mother turned on her with a snarl. \"And the prince has guarded us for centuries. But for him, I would be dead now and so would your brothers.\"</p><p>\"We're wasting time,\" Velkan said, cutting them off. \"I need you to take me to her so that I can free her before the sun rises.\" He saw the reservation in Raluca's eyes. \"It's why you came, is it not?\"</p><p>She shook her head. \"I came only because I knew you would be angry if I failed to tell you what had happened.\"</p><p>She was right about that. He would never stand by and see Esperetta harmed—even if he did hate her. \"Don't fear. You can teleport me there and I can turn off the electricity, then you can teleport both of us out, long before the sun rises.\"</p><p>Francesca screwed up her face. \"It's not that easy. The switch is inside the cage. You'll be electrocuted trying to switch it off.\"</p><p>He sighed at the prospect, but it changed nothing. He just wished he could use his telekinesis on it. But electricity was the one thing he couldn't move with his mind. Its living nature made it highly unpredictable, and he could accidentally hurt or kill someone by trying to manipulate it mentally. He would have to manually shut it off. \"Fine. It won't kill me.\" It would just hurt like hell.</p><p>\"There's more,\" Viktor said quietly.</p><p>This he couldn't wait to hear. \"That is?\"</p> <p>\"They have a generator rigged and another switch that is also inside another electric cage. If you turn it off, it won't give us enough time to reach her before they fry us, and unlike you, we're not immune.\"</p><p>Raluca nodded. \"And they have her out in a courtyard. The wall of which is surrounded by mirrors to reflect the rising sun directly onto you should you go to her. Their intent is for none of us to survive this.\"</p><p>And they'd done a good job setting this trap.</p><p>Velkan let out a tired breath as he considered what was about to happen. But it didn't matter. \"My wife is in danger. Take me to her.\"</p><p>Retta ground her teeth as every muscle in her legs ached from the strain of keeping them off the floor. The effort showed itself in small tears in her eyes. This had to be the most excruciating pain she'd ever experienced. Honestly, she didn't know how much longer she could stand it and not rest her legs.</p><p>The dry hum of electricity was a cold reminder of what would happen to her if she didn't keep them lifted...</p><p>\"You can do it,\" she whispered.</p><p>But what good would it do? They were determined to kill her regardless. Why was she even fighting the inevitable? She should just put her feet down and get it over with. Put herself out of her misery.</p><p>Velkan wouldn't come for her. Francesca couldn't. It was over. There was no need to delay the inevitable, and yet Retta couldn't make herself give up. It just wasn't in her.</p><p>\"What is it about you and this country that you are ever finding yourself in peril whenever you're here?\"</p><p>She jerked her head up as she heard that deep, resonant voice that went down her spine like a gentle caress. \"Velkan?\"</p><p>He stepped out of the shadows and neared the edge of the electrified floor that separated the two of them. His face was awash with shadows and yet he'd never looked more handsome to her. \"Is there anyone else stupid enough to be here?\"</p><p>She glanced up at the sky that was growing lighter by the second. \"You can't stay. You have to go.\"</p><p>He didn't say anything as he turned into a bat and flew toward her. Her heart pounding, she watched as he neared the cage, but the wire was too tight for him to fly into the cage with her.</p><p>She could swear she heard him curse before he turned back into a man. And as soon as he did, the force of the electrical current threw him back ten feet, onto the grass. This time there was no mistaking his fierce curse.</p><p>\"Forget it!\" she said, looking up at the sky again. It was too close to the dawn. \"There's no need in both of us dying.\"</p><p>Shaking his head, he ran at the cage and grabbed the wire. Retta cringed at the sound of his skin frying as he seized it. His entire body shook from the force of the electricity. It had to be unbearable. And still he held on, pulling at the wire until he'd torn through it. Amazed by his strength and courage, she was crying by the time he threw the switch and turned the electricity off.</p><p>\"There's another—\" Before she could say more the electricity returned. She jerked her feet up as a thousand curses came to her mind for the people who'd rigged this damned place.</p><p>Velkan grabbed ahold of the cage and snarled an instant before he punched straight through the metal floor. Two seconds later, he pulled a thick wire up from underneath and tore it in half.</p><p>The humming ceased as the electricity vanished again.</p><p>Too scared to put her faith in that, she waited for it to return. And as each second ticked by while she watched Velkan's frayed appearance, relief coursed through her.</p><p>He'd done it. Her tears coursed down her cheeks as gratitude swelled in her heart. In spite of the fact that she wasn't worth it, he'd come for her. And in that moment, she remembered exactly why she loved this man. She remembered all the reasons that she'd wanted to spend her life by his side.</p><p>Velkan reached for her.</p><p>Until sunlight cut across his body. Hissing, he jerked back, instinctively covering his face.</p><p>Then he took another step toward her only to have more mirrors turned to him.</p><p>Even so, he crawled toward her, while Stephen and the others kept the mirrors on him, so that he could loosen her hands. She quickly freed herself.</p><p>Her rage mounting, Retta tried to wrap herself around her husband, but she wasn't large enough to cover him from the deadly rays that made his skin blister and boil. His entire body was smoldering as he tried to make it toward the wall where there were still shadows.</p><p>He staggered at the same time Stephen and the others left the house. They were coming to finish Velkan off, but she'd be damned if they'd get to him without fighting her.</p><p>Retta stood her ground, ready to battle until she felt someone grab her from behind. She turned to strike but caught herself as she saw a friendly face.</p><p>\"It's me,\" Francesca said as she flashed them from the garden.</p><p>One second Retta was a hair from death, and in the next she was in a room she hadn't seen in centuries...</p><p>Velkan's bedroom.</p><p>Retta's heart pounded in fear. \"We can't leave him.\"</p><p>\"We didn't.\"</p><p>She looked around her as Viktor flashed into the room with Velkan in tow before he sank to the floor between Andrei and Viktor. Horror filled her as she stared at what remained of him.</p><p>He was bloodied and scorched. The scent of burnt hair and flesh invaded her senses, making her queasy.</p><p>But she didn't care. Terrified that he was dying, she rushed to Velkan's side and rolled him over. Tears gathered to choke her as she saw the damage done to him. \"Velkan?\"</p><p>He didn't speak. He merely stared at her and blinked.</p><p>Pushing her aside, Viktor and Andrei picked Velkan up from the floor and moved him to the bed:</p><p>Retta followed, wanting to help.</p><p>\"You should go,\" Viktor said coldly as Andrei struggled to peel Velkan's shirt from the flesh that seemed to be melted to it. \"You've done enough damage.\"</p><p>\"He's my husband.\"</p><p>Viktor narrowed his cold blue eyes at her. \"And you walked out on him five hundred years ago. Remember? Do him a favor and let history repeat itself.\"</p><p>\"Viktor!\" Francesca snarled. \"How dare you.\"</p><p>\"It's all right,\" Retta said, calming down her friend. \"He's only doing his job.\"</p><p>Then Retta moved to stand beside Viktor. This time when she spoke, she lowered her voice and let her raw emotions show in every syllable. \"Get in my way again, boy, and you're going to learn that Velkan isn't the only one in this family who has fangs.\" That said, she pushed her way past him to reach the bed where Velkan lay.</p><p>She wasn't sure if he was still conscious until she paused by his side. Her stomach shrank at the sight of his blistered and charred skin.</p><p>But it was the pain in his eyes that took her breath. In spite of the part of her that wanted to run from the horrible sight of him, she reached out and placed her hand to an undamaged part of his cheek.</p><p>He closed his eyes as if he savored her touch.</p><p>\"Thank you, Velkan,\" she breathed.</p><p>He took a breath as if he would respond, but before he could, he passed out on the bed.</p><p>Viktor moved to stand next to her, \"Are you going to just stare at him or are you going to actually help us tend him?\"</p><p>She looked to Viktor, whose face bore all the rancor of his voice. \"You're such an asshole, Viktor.\"</p><p>He opened his mouth to respond, but Francesca covered his mouth with her hand. \"Lay off, little brother. They've both been through a lot today.\"</p><p>Curling his lip, he moved to the other side of the bed, where Andrei was still trying to get the shirt off. Retta helped him undress Velkan, but as she saw a fierce scar in the center of Velkan's chest, just over his heart, she paused. That hadn't been there when he'd been mortal. It literally looked as if someone had staked him through the heart.</p><p>\"What on earth?\" she said, fingering it. It was at least six inches wide and four deep. \"How did this happen?\"</p><p>Viktor gave her a droll stare. \"Can't you handle the sight of your father's handiwork?\"</p><p>She frowned at Viktor. \"What are you talking about?\"</p><p>\"The scar,\" Andrei said quietly. \"It's where the lance left his body after your father ordered him impaled.\"</p><p>Retta jerked her hand back, not wanting to believe it. \"I don't find your humor funny.\"</p><p>\"I'm not joking.\"</p><p>Nausea filled her as she looked back to Velkan's blistered face. Then she looked to Raluca, who nodded grimly.</p><p>\"I don't understand,\" Retta whispered.</p><p>Raluca's eyes were kind as she explained. \"After your father killed you, Princess, he viciously turned on Velkan. He tortured him for weeks until he finally had him impaled in the square at Tîrgoviote. That's how he died and was able to become a Dark-Hunter.\"</p><p>Still, she had a hard time believing it. Her father had loved her so much. Would he really, even in anger, have killed her? He may have hated the world, but to him, his children had always been sacred. \"Why didn't Velkan tell me?\"</p><p>Viktor snorted. \"Oh, I don't know. Maybe because you ran from him when he tried and didn't stop running.\"</p><p>\"Viktor!\" Raluca snapped.</p><p>\"Everyone stop 'Viktoring' me. I speak the truth that all of you are too scared to say. She ought to understand what he's gone through to keep her safe. What he suffered as a human.</p><p>For. Her.\" Viktor turned back toward Retta. \"He didn't mind his own death—he'd planned on that. It was yours that destroyed him. He'd surrendered himself to your father, knowing the bastard was going to impale him. He thought that by having you drink the sleeping potion your father would see you dressed for burial and leave you be. His plan was for my mother to take you to Germany, where Francesca was living, and to keep you safe while your father tortured him. He never dreamed your father was going to stab you in the heart while you lay dead.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That hadn't been the plan Velkan had given her. They were to lie side by side as if dead and then awaken once her father was safely gone and convinced of their deaths. Velkan was then supposed to take her to Paris, where they could be together without fear of her father's reprisal against Velkan. Free of the war that was waged between their families.</p><p>She looked to Francesca for the truth, but for once her friend was speechless. \"Velkan surrendered to my father?\"</p><p>\"What did you think he was going to do?\" Viktor asked angrily.</p> <p>\"He told me we would both drink the potion and that my father would see us dead, then leave us in peace.\"</p><p>Viktor nodded. \"And you drank it first.\"</p><p>\"Of course, and then I saw him drink it right after me.\"</p><p>Viktor shook his head. \"He never swallowed it. Once you were unconscious, he spat it out and placed you in state for viewing. He was afraid that if you were both unconscious your father would behead both of you. So he remained conscious and told your father that you'd died of disease. Your father promised him that once he saw you, he would be content to take Velkan and leave. Velkan submitted to him and had to watch him kill you.\"</p><p>And she had run out on him...</p> <p>Again, her gaze went to Francesca for verification. \"Why didn't you tell me?\"</p><p>Her gaze sad, Francesca sighed. \"You didn't want to hear it. If I ever tried to take his side, you yelled at me, so I learned to drop the subject.\"</p><p>It was true and Retta knew it. She had no one to blame but herself.</p><p>Retta's heart ached as she thought about how many years... no, centuries she'd deprived herself and Velkan of because she'd been stupid and unforgiving. No wonder Viktor hated her. She deserved it.</p><p>Clenching her teeth, she looked up at the picture over the fireplace—the one that had been her wedding portrait. Tears gathered in her eyes as she recalled the day it'd been sketched.</p><p>The sight of Velkan on the wall, watching her with nothing but adoration on his face. He'd looked like a woodland sprite come to life to stand guard over her.</p> <p>She blinked away her tears before glancing back at the bed where her husband lay. \"We have to get him healed.\"</p><p>\"Why?\" Viktor asked.</p><p>\"So that I can apologize.\"</p><p>But getting Velkan healed proved to be easier said than done. The sun damage was hard for even an immortal to overcome. Not to mention they still had the threat of the Order out there wanting them dead. At least here in Velkan's home the Order couldn't get to them.</p><p>\"You should go rest.\"</p><p>Retta looked up at Raluca's voice. The older woman stood in the doorway with a chiding look on her face.</p><p>Retta stretched in her chair to ease her sore and cramped muscles. She'd been by Velkan's side for the last four days while he slept. At first his continued sleep had seriously concerned her, but Raluca and Viktor had assured her that it was natural for a Dark-Hunter to sleep like that whenever he was injured. It was what enabled his body to heal.</p><p>True to their words, every day Velkan's skin did seem better than the day before. Now he merely looked as if he had a serious sunburn and the bruises were all but gone.</p> <p>\"I don't feel like resting,\" Retta said quietly.</p><p>\"You have barely eaten or slept.\"</p><p>\"It's not like I can get sick of die.\"</p><p>Raluca tsked at her as she turned around muttering. \"Fine. I'll bring your food here, but trust me. If the prince awakens he will be grateful he doesn't have a heightened sense of smell.\"</p><p>Highly offended, Retta daintily sniffed at herself to make sure she didn't stink.</p><p>\"Relax. She was only teasing.\"</p><p>Her heart stopped beating as she heard that deep voice. \"Velkan?\" She shot from her chair to the bed to see his eyes open.</p><p>\"I thought you'd be gone by now.\"</p><p>She swallowed against the tight knot in her throat \"Hardly. I have much to do.\"</p><p>\"Such as?\"</p><p>Retta swallowed against the lump in her throat before she answered. \"Apologize to you.\"</p><p>\"Why would you do that?\"</p><p>\"Because I'm stupid and pigheaded. Judgmental. Unforgiving. Mistrustful—you can stop me at any time, you know?\"</p><p>One corner of his mouth lifted to taunt her. \"Why should I? You're on quite a roll. Besides, you missed the worst flaw.\"</p><p>\"And that is?\"</p><p>\"Hotheaded.\"</p><p>\"I learned that one from you.\"</p><p>\"How so?\"</p><p>\"Remember that time when you threw your boots into the fire because you had trouble getting them off?\"</p><p>Velkan frowned at her words. \"I never did that.\"</p><p>\"Yes, you did. You also gave your favorite saddle to the stable master because it scratched your leg as you dismounted and told him he could have it but, personally, you'd burn it, too.\"</p><p>That one he remembered well. He still bore the scar from it. But what surprised him was the fact that she remembered the incidents. \"I thought you banished all traces of me from your memory.\"</p><p>She looked away sheepishly. \"God knows I tried, but you're a hard man to forget.\" When she looked back at him, their gazes met and locked. \"I've been so stupid, Velkan. I really am sorry.\"</p><p>He lay there completely stunned by the heartfelt emotion in her voice. There had a been a time when he prayed to hear those words from her lips. A time when he'd pictured this moment.</p><p>\"Can you ever forgive me?\" she asked.</p><p>\"I could forgive you anything, Esperetta, but I could never trust you again.\"</p><p>Retta scowled at his words. \"What do you mean?\"</p><p>\"When you left and didn't return, you proved to me that you had no faith in me as a man or a husband. You were so suspicious of me that you honestly thought I could kill you. Obviously, we had a lot of problems in our marriage that I didn't know about.\"</p><p>\"That's not true.\"</p><p>\"Then why didn't you come home?\"</p><p>Because she thought he'd kill her. She really had. \"I was young. We lived in turbulent times.</p><p>Our families had spent generations killing each other—\"</p><p>\"And you thought that the only reason I married you was to kill you.\" He shook his head. \"You know as well as I do that I was disowned by my family when they learned we'd wed.\"</p><p>It was true. His family had turned them out. His father had sent an army to seal this house and make sure that Velkan would never enter it again.</p><p>But the worst had been his father burning everything that had held Velkan's symbol or name.</p><p>Even the family crest book that bore the Danesti lineage had been burned and a new one created that left no trace of Velkan's birth.</p><p>\"I thought that you'd had enough of running from our families. And we both know that had you returned home after killing me and my father, your father would have welcomed you back.\"</p><p>Those black eyes burned her. \"I made my decision as to who held my loyalty on the day I bound myself to you, Esperetta. I knew the cost and the pain our union would cause my family and still I thought you were worth it. You spat on me and you spat on the love I wanted to give you.\"</p><p>\"I know I hurt you.\"</p><p>\"No,\" he whispered. \"You didn't hurt me. You destroyed me.\"</p><p>Tears welled in her eyes. \"I'm so sorry.\"</p><p>\" 'Sorry' doesn't even begin to fix five hundred years.\"</p><p>He was right and she knew it. \"Why did you tie our souls together without telling me?\"</p><p>His eyes burned her with sadness. \"I didn't want to live without you... in either this life or the next. I had intended to tell you what I'd done, but your father ran us to ground before I had the chance. Little did I know that when I sold my soul to Artemis for vengeance your soul would go with mine.\"</p><p>What he didn't say was that she'd caused him to suffer the very thing he'd wanted most to avoid... a lifetime spent without her.</p><p>In that moment, she hated herself for what she'd done. And she didn't blame him for not forgiving her.</p><p>He'd given her the world and she'd spurned him. Unable to stand the mistake she'd made, she got up. \"Are you hungry?\"</p><p>\"Yes.\"</p><p>\"I'll get you something to eat. Hang tight.\" Retta paused at the door to look back to where he lay on the large bed. It was the bed she'd lost her virginity in. She could still see that night so clearly. She'd been terrified and excited. Velkan for all his ruthlessness had left her untouched and in a room down the hallway.</p><p>He'd promised to take her the next day to her father's agents and release her. It'd been the last thing she'd wanted. Her father would have sent her back to the convent to live out a life of prayer and hard work—not that anything had been wrong with either of those. But she'd already fallen in love with her dark warlord and she didn't want to go back without a small token.</p><p>Her intent had been nothing more than an innocent kiss. But the moment their lips had touched, Velkan had swept her up in his arms and she had submitted to him willingly—even more eager to taste him than he was to have her.</p><p>Closing her eyes, she could still remember the feel of him inside her as he clutched her leg to his hip and thrust against her. \"I will never let you go, Esperetta,\" he'd whispered fiercely in her ear.</p><p>And then he'd given her a kiss so hot that her lips still tingled from it.</p><p>How had she ever turned her back on that? A tear slid down her cheek before she brushed it away and headed downstairs to the kitchen. She scratched Bram on the head as she passed the giant animal that reminded her more of a cow than a dog.</p><p>\"Good to see you out of that room,\" Raluca said as she set her tray down that was filled with food.</p><p>\"I'm only here because Velkan is awake and hungry.\"</p><p>Francesca snorted as she entered the kitchen behind her. \"And you're here getting food?</p><p>What kind of stupid are you? I'd be in bed with him.\"</p><p>\"Frankie!\" Raluca snapped. \"Please. I am your mother.\"</p><p>\"Sorry,\" she said, but her tone was less than apologetic.</p><p>Retta sighed as she straightened up the flower in the vase Raluca had put on the tray. \"It doesn't matter what I want. I blew it with him a long time ago.\"</p><p>Francesca shook her head. \"You can't blow it with someone who loves you that much.\"</p><p>\"I daresay you're wrong. I just wish you guys would let me go home.\"</p><p>\"The Order would be all over you now that they know for a fact you're real. You can never go home again.\"</p><p>And she couldn't stay here. How perfect was this?</p><p>Raluca gave her a sympathetic smile. \"He loves you, Princess. He's hurt, but underneath that is the man who went through a fate far worse than death trying to save you. He won't let something as cold as pride keep you from him.\"</p><p>\"It's not pride, Raluca. It's broken trust. How do you repair that?'\"</p><p>\"That's up to you, Princess. You have to show him that you want to stay with him.\"</p><p>\"And how do I do that?\"</p><p>\"You close your office and have Andrei and Viktor bring all of your belongings here.\"</p><p>\"What if he won't let me?\"</p><p>\"How can he stop you? You're the Lady Danesti. This home is half yours.\"</p><p>Retta smiled as she considered that. But in order to stay here, she'd have to give up everything.</p><p>No, not give up. So she couldn't be a divorce lawyer in Romania. She wouldn't be able to keep up her practice too much longer anyway. Some people were already getting a bit suspicious because she hadn't aged.</p><p>She looked around the stone walls that somehow managed to be warm and inviting. Stay with Velkan...</p><p>Somehow that was nearly as frightening as it had been. But in order to stay, she'd have to reclaim the heart her husband had closed to her. C'mon, Ret, you're made of sterner stuff than this. And she was, too. She wasn't going to walk out on him again.</p><p>But as Raluca said, she'd have to find some way to show her husband just how serious she was.</p><p>Chapter Five</p><p>Velkan ached with a pain that was second only to impalement. His Dark-Hunter powers should have healed him by now... it told him just how severe his injuries had been that he was still hurting from them.</p><p>He turned as he heard the door open.</p><p>It was Esperetta, and there for a second he was back five hundred years ago when they'd shared this room together, when she had willingly joined him here every night.</p><p>Once he'd reclaimed this house after his death, he'd taken great pains in making her room down the hall look just as it had when she'd lived here. But though her personal items were there, she'd never really used it for anything other than dressing. In contradiction to the customs of their time, she'd shared this room with him for sleeping... and for other things the memory of which warmed him completely. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Wincing, he could still imagine the way her scent had clung to his sheets and pillows...</p><p>The way it had clung to his skin.</p><p>Be strong, Velkan. He had to be. The last thing he wanted was to let her hurt him any more than she already had.</p> <p>She came forward a bit hesitantly before she set the tray down on the table by his bed. Her long hair was pulled back into a ponytail and she looked extremely tired. And yet she managed to be the most beautiful woman he'd ever seen. \"Do you still prefer your steak served with onions and stewed apples?\"</p><p>Her question surprised him. He couldn't believe that she'd remembered that. Nodding, he watched as she pulled the silver top off the platter and then uncovered the onions.</p><p>\"Are you not eating?\" he asked as she handed him the plate.</p><p>\"I'll just take some of the bread. I'm not really hungry.\"</p><p>He shook his head at her. \"Bring the bread plate and split this with me.\"</p> <p>\"You need it.\"</p><p>\"I will live and I can send for more. Now bring me the plate.\"</p><p>She arched a brow at his sharp tone.</p><p>\"Please,\" he added, softening his voice.</p><p>Retta paused at that. This was a man who was used to issuing commands. To her knowledge, he'd never even uttered \"please\" before. Her heart softening, she picked up the plate and did as he asked.</p><p>\"Thank you,\" she said as he halved his food with her. \"By the way, I have a bone to pick with you.\"</p> <p>\"Only one?\"</p><p>She smiled in spite of herself. \"At the moment.\"</p><p>\"Then I can't wait to hear it,\" he said before tasting his steak.</p><p>\"'Bram' and 'Stoker'?\"</p><p>He laughed, a deep, resonant sound. \"It was fitting, I thought.\"</p><p>Retta growled at him. But she didn't mention her room, which she'd seen the night of her arrival. It had been an eerie reminder of their past, and it had brought home to her just how much Velkan loved her. Even if he denied it, she knew the truth. Everything had been laid out as if he'd expected her to return at any moment.</p><p>When she'd seen it, she'd actually sat down on the floor and wept over her own stupidity.</p><p>Forcing that thought away, she cleared her throat. \"Did you have to give that man that awful book about my father?\"</p> <p>He shrugged those broad shoulders before he wiped his mouth. \"I was stationed in London at the time and bored. He'd been working on the book and had been calling the lead character Radu—which, no offense to your uncle, isn't nearly as compelling as Vlad Dracula.</p><p>Besides, it's not my fault the book took off. It would have been forgotten completely if not for the movie decades later.\"</p><p>She narrowed her eyes on him suspiciously. \"I heard you had a hand in that, too.\"</p><p>\"That is a rumor of which I'm quite innocent.\"</p><p>\"Uh-huh.\" Even so, she wasn't really angry at him. At least not now. A century ago, she'd wanted to cleave his head from his shoulders, but strangely, now that she was here, she felt an odd kind of peace. It was so bizarre.</p><p>He set his plate aside.</p><p>\"You're not through, are you?\"</p><p>\"I'm not really hungry.\"</p><p>The only problem was that she was starving... and it wasn't for food. What she really wanted a taste of was that delectable mouth of his. He was sinful and decadent. He'd always been that way, and it had been so long since she'd last had a kiss, Velkan could barely focus as his body burned for a taste from his wife. How cruel to be this close to her and to not be allowed to sate the need that burned so furiously inside him.</p><p>She finished her food, then moved to retrieve his plate. As she did so, she turned to look at him. It was a mistake.</p><p>Unable to stand it, he buried his hand in her soft auburn hair and pulled her closer to him. He expected her to push him away.</p><p>She didn't.</p><p>Instead, she met his lips with remarkable passion. It was as if she wanted to devour him.</p><p>Velkan growled at her enthusiasm. It'd been the last thing he'd expected from her. But God, how good she tasted. It was the most incredible moment of his life and all he could think of was pulling her naked body flush to his.</p><p>Retta couldn't get enough of him as she folded herself into his arms. At least not until she eagerly brushed her hands against his ribs and felt him cringe from the pain of his injuries.</p><p>\"I'm sorry,\" she breathed, pulling back.</p><p>But he didn't let her go far. He pulled her back to him and gave her a kiss so sizzling that it melted her completely. With a teasing laugh, she nibbled his lips. \"You're still hurt.\"</p><p>\"You're worth a little pain,\" he whispered before he buried his lips against her throat.</p><p>Retta groaned as chills spread over her, and her body heated up immediately. It'd been way too long since they'd been together. She'd all but forgotten how good this felt. How good Velkan felt. Leaning back, she pulled him with her until his weight was pressing her into the bed. Still his lips didn't leave her neck as he unbuttoned her shirt. His eyes were dark with hunger as he cupped her breast while his thumb slipped beneath the lace to touch her skin.</p><p>She shivered at his hot touch as she pulled his shirt from over his head.</p><p>His skin was still burnt and angry looking, but even so, she'd never seen anything more exquisite. He was so lean and ripped that she could see the outline of every muscle on his chest. And she remembered the first time she'd seen him naked. He'd been hesitant, afraid of hurting her. And she'd been stunned by the size of him. By the contrast of his masculine body to hers. Where she was soft, he was hard. Where her skin was smooth, his was chafed by battle scars and calluses. And his scent...</p><p>It was warm and masculine, all-consuming.</p><p>Shivering, she reached around and undid her bra, then let it fall to the floor.</p><p>Velkan could barely breathe. He still couldn't believe she was allowing him to touch her. Not after all the anger she'd spewed. All the insults that had gotten back to him over the centuries. If he were smart, he'd send her packing. But how could he? No matter the anger, he knew the truth..</p><p>He still loved her. He still wanted her.</p><p>She was everything to him.</p><p>And she might change her mind...</p><p>That would be too cruel for words. Cruel even for the daughter of Vlad Tepes.</p><p>Her eyes dark with longing and passion, she moved from the bed to divest herself of her pants. Velkan thought he was going to die as she reached for her panties. His breath came in short, sharp bursts as she licked her lips, teasing him, exciting him. The tips of her fingers went beneath the black satin fabric.</p><p>\"Do you want me to leave?\" she asked as she hesitated while he waited for her to lower that damned skimpy piece of fabric.</p><p>What, was she insane? Or just plain cold?</p><p>\"Hell, no,\" he growled.</p><p>Smiling, she slowly pulled the panties down her legs until she could step out of them. In that moment, it was a struggle not to come from the sheer pleasure of seeing her naked alone.</p><p>Damn, but she had the hottest body the gods had ever gifted to a woman. Granted her breasts weren't very large and her hips were a bit wide, it didn't matter to him. There was no woman more perfect.</p><p>Retta loved the power she felt as he watched her with hooded eyes. Even so, she could tell how eager he was. But that was nothing compared to how badly she wanted a taste of him.</p><p>She pulled the covers away from Velkan's body, then crawled back onto the bed between his legs while never breaking eye contact with him. Her mouth dry, she finally dropped her gaze down the bulge in his pajama bottoms. She could have sworn she heard him whimper.</p><p>But still he didn't move while she moved her hand so that she could cup him through the flannel. He hissed as if it were sheer torture, and yet she knew by the look of relief on his face that he was enjoying it immensely. It still wasn't enough. Her heart hammering as her entire body burned for him, she dipped her hand into the slit of his pants to seek him out. His skin was so hot and smooth as she touched his cock. He was already wet and leaking. She brushed against the tip of him, making him arch his back as if he were being tortured on the rack.</p><p>Laughing in delight at his response, she pulled her hand away so that she could taste the salty sweetness of him.</p><p>Velkan was absolutely on fire as he watched her lick the tip of her finger. But that was nothing compared to how he felt as she reached for his waistband to pull his pants off. He lifted his hips to accommodate her even though her slowness was starting to piss him off.</p><p>He wanted to savor this, and at the same time he wanted inside her so badly that he could barely contain himself. It was all he could do not to seize her and whip her under him.</p><p>But his patience paid off as she tossed his pants over her shoulder, then dipped her head down to take him into her mouth.</p><p>The sight of her hair fanning out over his lap while she tasted him was almost more than he could suffer. She looked up at him and met his eyes with nothing but raw hunger in her gaze... He had to grind his teeth to keep himself from his orgasm. But it was hard and he didn't want this over so quickly.</p><p>He had to lean back and stare at the ceiling just to control himself, and even so he still felt the moist heat of her mouth as she tongued him from hilt to tip.</p><p>Retta groaned deep in her throat as she saw Velkan clutching the sheet in his fists. He lifted his leg between hers, and when his thigh touched her core she almost came from the sheer pleasure of it.</p><p>But that wasn't what she wanted. She wanted to make amends to him for all the centuries she'd allowed her unfounded fears and stupidity to keep them apart. She owed him so much and she wasn't going to leave him until he knew just how sorry she was for what she'd done to both of them.</p><p>Her body throbbing, she slowly kissed her way from his cock to his navel. Then she moved to his nipple so that she could lave it while he sank his fingers deep inside her. Closing her eyes, she savored his touch as she moved herself so that she straddled his hips.</p><p>He moved his hand and cupped her face before he kissed her, and in that moment every bad thought she'd ever carried for him melted and she couldn't remember what about him had ever made her flee. Closing her eyes, she savored his tongue and mouth. Savored the feeling of his hands on her face before she lowered herself onto him.</p><p>Velkan shivered as she took him in all the way to his hilt. He'd dreamed of this moment for the last five hundred years. And all those dreams paled in comparison to this one moment in time. He inhaled the sweet fragrance of her skin as she rode him slow and easy.</p><p>This was all he'd ever wanted in his entire life. Esperetta in his bed. His body inside hers.</p><p>He growled deep in his throat as she continued to ride him, driving both their pleasure onward. She nipped and licked the pad of his finger as he gently traced the curve of her lips.</p><p>Needing to touch her, he dropped his hand down so that he could cup her breast in his hand and let her hardened nipple tease his palm. He lifted his hips to drive himself even deeper into her.</p><p>Retta smiled and took Velkan's hand into hers while she gave them both what they needed.</p><p>The look of pleasure on his face only added to her own. It felt so good to be back with him.</p><p>So natural. For the first time in centuries, she honestly felt like she was home.</p><p>And she was never going to leave it again.</p><p>That thought swept through her an instant before her body shuddered and spasmed. In a glorious flood of ecstasy, her body splintered. Crying out, she leaned forward over Velkan as he quickened his strokes, heightening her pleasure even more.</p><p>And when he came, he whispered her name like a breathless prayer. That gave her more hope than anything else that he'd forgive her.</p><p>Her heart pounding, she laid herself on his chest while he held her close in the firelight.</p><p>There was no sound in the room except their breathing and the sound of his heart thumping under her cheek. Closing her eyes, she inhaled the scent of them and caressed the muscles of his arm.</p><p>Velkan lay quietly as he felt every inch of her body pressed against his. He loved the sensation of her flesh on his. Of her hand gliding over his arm. But he knew this couldn't last.</p><p>He knew he couldn't trust her.</p><p>No matter what he felt right now, the past stood strong in his mind. And it was a past he didn't want to relive. Learning to get through each day while that pathetic part of him had kept watching the road, thinking, no, praying, she would come back to him.</p><p>She might be with him now, but she didn't trust him. She never would. And that burned through him like a stringent poison.</p><p>\"What are you thinking?\" she whispered.</p><p>\"I'm wondering when you'll be on the next flight out of here.\"</p><p>\"I'm not leaving, Velkan.\"</p><p>\"I don't believe you. You have a business to run. A life to get back to.\"</p><p>Retta grew quiet at that. He was right... and he was wrong. \"I've had other businesses in the past that I had to walk away from. I can leave this one as well. I belong here, with you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He didn't say anything, but the doubt in his eyes tore through her.</p><p>\"Will you at least give me another chance?\"</p><p>\"At what?\"</p> <p>\"Being your wife.\"</p><p>\"Do you think that could make you happy? I'm stationed here in Romania. In the backwoods of the world that you've embraced. You wouldn't be happy without all the conveniences you're used to. Besides, Dark-Hunters aren't married. They're not supposed to have any kind of emotional ties whatsoever.\"</p><p>\"Then we'll get our souls back and be free.\"</p><p>\"And if I don't want that?\"</p><p>She was taken aback by his question. \"You'd rather stay in Artemis's service?\"</p> <p>\"I'm immortal, and I'm an animal, remember? I live for war.\"</p><p>\"You would choose that over me?\"</p><p>His black eyes burned her. \"You chose much less than that over me.\"</p><p>Retta looked away, ashamed. He was absolutely right. Her heart heavy, she slid herself off him. Her gaze fell to the areas of his body where his skin was still blistered from his rescue of her. \"Then I guess there's no future for us.\"</p><p>He let out a tired sigh. \"We were never meant to be, Esperetta.\"</p><p>She ground her teeth in frustration. \"Then do we divorce?\"</p> <p>\"Why bother? Death has already separated us.\"</p><p>Not true. Stupidity had separated them, not death.</p><p>Retta scooted from the bed and gathered her clothes before she dressed without another word to him. She didn't know what to say. \"So that's it then?\"</p><p>\"That's it.\"</p><p>She nodded as she opened the door to the hallway. She hesitated. \"I have to say I'm surprised.\"</p><p>\"By what?\"</p><p>\"Your cowardice. I always thought you had more guts than this.\"</p><p>He turned in the bed to give her his back. \"Then we're even?\"</p> <p>\"How so?\"</p><p>\"I misjudged you, too. I once thought you were worth dying for.\"</p><p>The door slammed shut in her face.</p><p>Retta stood there staring at the wood, her mouth agape, his words ringing in her ears. She glared at the door, half-tempted to kick it in and beat him. But she wouldn't give him the satisfaction of it.</p><p>Fine. If he wanted to play it that way, so be it. Far be it from her to argue. As he'd pointed out, she had a life in America. Lifting her chin, she turned and walked toward her room down at the end of the hallway.</p><p>And with every step she took, more tears gathered in her eyes as pain filled her. Her heart broken, she opened the door to find Raluca in her room, shaking her head at her.</p><p>Retta cleared her throat. \"Don't give me that look. You don't understand.\"</p><p>\"I do understand.\" Raluca crossed the small distance between them and held her hand out to her.</p><p>Needing to feel comfort, Retta took Raluca's hand and then gasped as a spike of hotness tore through her. It ripped her from this room out into a lightless void that was searing and frightening. She heard winds howling in her ears as something whipped against her body.</p><p>She held her hand up to protect her eyes as a sudden light pierced the darkness.</p><p>No longer in the manor, she found herself in the small cottage where she'd taken refuge with Velkan after their families had learned of their marriage. His family had disowned him and her father had vowed to see Velkan dead. And it'd been her father who'd found them first.</p><p>Completely disembodied, she stood in the corner where she could watch Velkan, who was kneeling beside her comatose body. Because they were in hiding, he didn't wear the armor of a warrior. He was dressed in a simple tunic and hose. To her utter shock, there were tears in his eyes as he held her hand in his and kissed her fingertips. She'd never seen him look so vulnerable.</p><p>\"I won't let anyone hurt you,\" he whispered, lowering her hand from his face. \"Raluca will see you safe for me. Please don't be angry that I'm leaving you. It's the only way I know to free you to live the life you deserve.\" He rose up so that his lips were only an inch above her own.</p><p>\"I love you, Esperetta.' Always.\" And then he pressed his lips to hers before he tore away with a growl.</p><p>Still, she saw the lone tear that slid from the corner of his eye, down his whiskered cheek.</p><p>He brushed it away before he turned and opened the door to their cottage.</p><p>There before him was her father with his army. Dressed in armor, her father wore no helm to cover his stern, chiseled features. His long black hair brushed his shoulders as he narrowed his black eyes on her husband. She winced at the rage that contorted her father's face.</p><p>Never once had she seen this side of him. To her, her father had only been loving and indulgent. Kind. Velkan drew his sword and stood there as if to take all of them on.</p><p>\"You're outnumbered, boy,\" her father snarled. \"Is this how you would die?\"</p><p>\"In battle, aye. It's what I prefer.\" Velkan glanced back over his shoulder. \"But you promised me that you'd allow my servants to take Esperetta home for a proper burial. Do you still swear it?\"</p><p>Her father's lip curled before he nodded.</p><p>Velkan planted the blade of his sword into the ground beside his foot. \"Then I surrender to your...\" he paused before he said, \"mercy,\" from between gritted teeth.</p><p>Two of her father's men dismounted before they came to take Velkan. As soon as they held him, her father slid from his horse. He came forward with an angry swagger.</p><p>\"She's dead,\" Velkan spat, trying to free himself. \"Leave her in peace.\"</p><p>Her father scoffed as he entered the cottage and moved to stand beside her. Retta held her breath as she saw the pain that darkened his brow. His lips quivered ever so slightly as he looked down on her body. He lifted his hand to press it against her mouth and nose so that he could hold them closed.</p><p>\"I told you,\" Velkan said, his voice rife with anger. \"She's dead.\"</p><p>Her father jerked the dagger from his waist as he turned on Velkan with a fierce curse.</p><p>\"She's nothing but a Danesti whore.\" And then her father plunged the dagger straight into her heart.</p><p>Velkan let loose a cry so anguished that it made every hair on her body stand up as he shook off the men who held him and grabbed his sword. Before he could pull it free, two arrows were shot into his back—one striking his shoulder, the other to the left of his spine.</p><p>Velkan stumbled to the side, and when he failed to go down, another arrow was shot into his leg. He cried out, reaching for the fallen sword. Until another arrow was embedded into his forearm.</p><p>\"Don't kill him!\" her father roared. \"Not yet!\" He kicked Velkan's sword out of reach before he shoved the arrow at the small of Velkan's back deeper into his body. Velkan growled, trying to move, but there was nothing he could do.</p><p>Instead, he looked to where she lay inside. \"Esperetta,\" he breathed in a tone that was filled with tragedy and loss.</p><p>Her father seized Velkan by the hair and pulled him back. \"She's the least of your concerns, you bastard.\"</p><p>Velkan tried to fight, but he was too wounded to have much effect on the knights who were better armed.</p><p>Unable to bear it, Retta turned away. \"Take me out of here, Raluca. Now.\"</p><p>She did, but still she didn't take Retta back to the manor. Instead, Raluca took her to where her father was torturing her husband. Retta's breath caught in her throat as she saw him bleeding and bruised as they laid hot pokers over his skin.</p><p>\"Stop!\" she screamed, closing her eyes and covering her ears. \"Take me home. Now!\"</p><p>To her instant relief, Raluca obeyed her.</p><p>Retta glared at her in anger. \"What was the point of that?\"</p><p>\"Understanding.\"</p><p>\"I got it, okay? I was willing to—\"</p><p>\"No, not for you. I know you were ready to start over. But now you know why Prince Velkan isn't. You couldn't even look at what your father did to him and you didn't even see the worst of it.\" Raluca's eyes blazed in anger as she glared at her. \"What do you think he'd have given if he could have simply closed his eyes and told me to take him home?\"</p><p>Retta swallowed against the knot in her throat. Raluca was right. He'd endured hell for her.</p><p>\"I can't undo what I did and he won't forgive me. If you have some magic trick in your bag that will give us common ground, then by all means pull it out. But at this point, I'm not the one being stubborn here. And I'm not the one who has to forgive. I've apologized. There's nothing more I can do.\"</p><p>Raluca let go her hand before she gave a curt nod. \"You are absolutely correct, Princess.</p><p>Forgive me.\"</p><p>And before she could even blink, Raluca vanished from the room.</p><p>Velkan tensed as he felt a presence behind him. He turned quickly in bed to find Raluca staring at him with a gimlet look that was unsettling.</p><p>\"Is something wrong?\"</p><p>\"Yes.\" She reached out and touched his arm.</p><p>Velkan sucked his breath in sharply between his teeth as his vision dimmed. Suddenly he wasn't in his room. He was in complete darkness with an awful weight pushing down on his chest. It was hot and stifling. Oppressive. Something smelled like rotten earth. Damp and cold. It choked him. He couldn't breathe as a putrid terror coursed through his body.</p><p>Desperate, he pushed against the darkness.</p><p>It wouldn't budge.</p><p>More desperate than before, he shoved even harder. Only this time, it caused something to rush in on him. He coughed and choked as his entire face was covered with heavy black dirt. The weight of it was excruciating. The thick, grainy taste filled his mouth and nostrils as he kept pushing and digging, trying to free himself of it.</p><p>He'd never felt anything like this. Every movement only made it worse. Every second ticked by with an excruciating slowness as he fought against his prison. Eternity seemed to have passed before he finally broke free of it. Wheezing and vomiting earth, he found himself climbing out of a grave that bore a single name and date.</p><p>ESPERETTA D. 1476</p><p>Confused, he looked down at his hands, only they weren't his. They were feminine and they were torn and ravaged from the digging. They were Esperetta's.</p><p>Still coughing, he tried to move free of the grave, but the weight of his dress pulled him back toward the coffin. Afraid of falling, he kicked his feet, tearing the hem, and used his trembling arms to get his weight out of the grave.</p><p>And as he lay on the ground, trying to remove the taste of dirt from his mouth, his thoughts whirled.</p><p>What had happened?</p><p>We'll be together, Esperetta. Trust me. When you awaken, I'll be there by your side. We shall go to Paris, just the two of us, and start our lives over. No one will ever know who we are.</p><p>Only they weren't together. There was no sign of Velkan now. Panic set in as Esperetta looked about the cold, desolate cemetery. Where could he be?</p><p>A wave of terror went through her as she feared for him. Surely he wasn't dead. Not her Velkan. He'd always been so strong. So fierce.</p><p>\"Please,\" she begged as tears gathered in her eyes. She had to find him. The last thing she wanted was to live without him. He meant everything to her.</p><p>Unsure of where to go, she headed through the cold darkness toward the town lights, desperate for him. It wasn't until she'd reached the street that she realized she wasn't far from her father's home.</p><p>Why was she here? She'd taken her serum far away from this place.</p><p>With Velkan.</p><p>With nowhere else to go, she headed for her father's palace. But she never reached the doors. Before she could do more than slip inside the gate, she'd heard the sound of swords clashing.</p><p>And then she'd heard her father cry out.</p><p>Without a clear thought, she'd run toward the sound only to skid to a stop as she saw her father lying dead at Velkan's feet. Her mouth worked a soundless scream as she watched her husband kick at her father's body and curse him. But that wasn't the worst of it. The worst came from the single sword stroke that separated her father's head from his body.</p><p>The cold satisfaction on Velkan's face burned her eyes as he gripped her father's head by the hair and pulled it up from the ground. \"Death to the house of Dracul. May you all burn in hell.\" Those words rang in her head.</p><p>Velkan was a monster!</p><p>This time her scream came from deep within her soul.</p><p>Velkan jerked as that scream resonated through his memory. He tried to free himself of Raluca's tight grip, but she refused to let him go.</p><p>\"Enough!\" he roared. \"I don't want to see any more.\"</p><p>She finally released him.</p><p>Velkan's breathing was ragged as he stared at the Were-Hunter. \"How can you do that?\"</p><p>She folded her arms over her chest. \"My father was a Dream-Hunter. I inherited a few of his abilities, such as manipulating reality so that you could experience that night as Esperetta.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Why would you do this?\"</p><p>\"Because I lost my mate to the hatred of an Order that should have never existed. There's nothing I can do about that, but you two have lost each other because you're both too prideful and stubborn to admit you're wrong.\"</p><p>\"How could I ever tru—\"</p> <p>\"Velkan!\" Raluca snapped in a tone he'd never heard before as she called him by his name.</p><p>\"You have seen that night through her eyes. It wasn't her fault. You kept the truth of her father from her. You never once let her know as a mortal how demented Vlad was. No one did. To her, he was a decent and caring father. She never saw his brutality. But you... you she saw.</p><p>On the night you met, you beheaded a man on top of her. She was just a young woman who'd been sequestered in a convent. Can you imagine the horror of that?\"</p><p>He looked away as he remembered just how scared Esperetta had been. Her entire body had quaked in his arms the whole way home and she'd been racked with nightmares for months on end. He'd held her in the darkness and sworn to her that he'd never allow anyone else to ever hurt her again.</p><p>Until her father had killed her.</p> <p>But that changed nothing. Esperetta didn't love him and he would never expose himself to that kind of pain again. \"You ask more than I can give.\"</p><p>\"Very well, but know this. The princess hasn't left your side since you were brought here. She could have tried to escape us, but she hasn't. She's stood watch over you like a lioness guarding her pride. And for five hundred years I have sacrificed my daughter and her happiness to watch over Esperetta for you. I've had enough of that. If the princess leaves, she leaves alone.\"</p><p>\"I forbid it.\"</p><p>\"I am your servant, my lord. My daughter isn't. If you want the princess guarded, then I suggest you do it yourself.\"</p><p>Velkan gaped at her words. She'd never spoken to him like this. Never once. \"You're not serious.\"</p><p>\"Oh, but I am. Francesca isn't getting any younger and I want grandchildren. It's time she was free to find her mate. You threw yours away by choice. Francesca should at least have the chance to be so stupid, no?\"</p> <p>He honestly had no response to that. What could he say? He was a fool. But how could he put aside the centuries?</p><p>How could you not?</p><p>\"You lie there, Prince, in your bed alone. I'm going to book a flight out for the princess. She's a big girl. We'll let her find her own way in the world.\" And with that Raluca left him alone.</p><p>\"Good riddance,\" he said sullenly under his breath, but even as the words left him, he knew better. He couldn't allow Esperetta to leave here. Not while the Order was out there. She wasn't strong enough to protect herself from them.</p><p>They were a cunning bunch.</p><p>He would simply go to her and...</p><p>Beg her to stay.</p><p>He flinched at the voice in his head. He'd never begged for anything—not even mercy while her father had tortured him. He would order her to stay. And she would... laugh in his face most likely.</p> <p>You'll have to beg.</p><p>\"Then she can leave.\" But he knew better than that. In fact, he was already stepping out of his bed. His emotions torn, he quickly dressed in a pair of pants and a loose-fitting button-down shirt.</p><p>As he started for the door, it swung open and almost hit him. Aghast, he watched as Andrei and Viktor entered with a large trunk between them. Esperetta followed them into the room.</p><p>He was baffled as they placed the trunk at the foot of his bed. \"What is this?\"</p><p>The men didn't answer. In fact, they refused to meet his gaze as they hastened from his room.</p><p>\"There's another trunk that needs to be moved, too,\" Esperetta told them.</p><p>Viktor cringed as he looked at Velkan, then nodded. \"Yes, Princess.\"</p><p>\"What trunk?\" Velkan asked, stepping closer to his wife.</p><p>\"My trunk. I'm moving in.\"</p><p>\"In where?\"</p><p>\"My room. Here.\"</p><p>Completely stunned and flabbergasted, he opened and closed his mouth, unable to speak.</p><p>Esperetta walked over to him and placed her finger on his chin before she closed his mouth.</p><p>\"I know you don't trust me, but tough shit.\"</p><p>He would have gaped again at her profanity had her hand not prevented it.</p><p>\"This is my home and you're my husband. I made a mistake and for that I'm sorry, but I'm through being an idiot.\"</p><p>He pulled back from her. \"Dark-Hunters can't be married.\"</p><p>\"Well then, someone should have told Artemis before she made her bargain with you and brought me back to life, huh? You were created as a married Dark-Hunter. I hardly think they can complain now.\"</p><p>She did have a point about that.</p><p>\"But—\"</p><p>She ended his words with a kiss.</p><p>Velkan growled as she explored every inch of his mouth and buried one hand in his hair.</p><p>\"Esperetta—\"</p><p>\"No,\" she said, tightening her grip in his hair. \"I won't hear any protests from you.\"</p><p>He laughed at that. \"I wasn't protesting. I only wanted to say welcome home.\"</p><p>Retta drew her breath in sharply at his words. \"Really?\"</p><p>He nodded, but even so she could tell that he didn't truly believe her. But at least he was allowing her to stay. It was a start, and it was one that gave her hope.</p><p>The door opened again as Viktor and Andrei brought in the next trunk. They paused in the doorway.</p><p>\"Should we come back later?\" Andrei asked.</p><p>\"Yes,\" Velkan said, his voice thick. \"And take your time about it.\"</p><p>The men reversed course.</p><p>Retta laughed until Velkan kissed her again. Yeah, this was what she needed, at least until he pulled back and glanced at the trunk. \"You didn't arrive here with trunks.\"</p><p>She bit her lip sheepishly. \"It's symbolic,\" she confessed. \"They're actually empty.\" Then she frowned as she realized he was dressed. \"Where were you going?\"</p><p>\"No place.\"</p><p>She arched a brow at that as a sneaking suspicion went through her. \"No?\"</p><p>She saw him hesitate before he spoke in a deep, emotionally charged voice. \"I was going to find you and ask you to stay.\"</p><p>\"Really?\"</p><p>He nodded. \"I don't want you to leave, Esperetta.\"</p><p>\"You're willing to trust me then?\"</p><p>He hedged. \"Well...\"</p><p>\"Velkan!\"</p><p>He kissed her lips, melting her anger. \"I will trust you, but only if you swear to never leave here again.\"</p><p>She wrapped her arms around his shoulders and met that dark gaze levelly. \"I will only leave if you're with me. Promise.\" Then she rubbed the tip of her nose against his before she met his lips and sealed that promise with a scorching kiss.</p><p>EPILOGUE</p><p>In all the centuries, Velkan had never bothered with the Order. He'd left them alone to run amok without his interference. But all that was about to end.</p><p>They'd threatened Esperetta and had almost killed her. Now that he had his wife back, he wasn't about to let anyone take her from him again.</p><p>Without preamble, he used his powers to open the door to Dieter's home. Velkan strode through the doorway as if he owned it. Dieter and Stephen looked up with a gasp, as did five other men.</p><p>And before Velkan could move, an arrow was shot at his chest. He caught it in his fist and tossed it to the floor. \"Don't even try that again,\" he snarled.</p><p>\"W-what are you doing here?\" Dieter said as a fine sheet of sweat appeared on his forehead.</p><p>Velkan pinned each member there with a hostile glare that should adequately cow them. \"I'm here to bury the proverbial ax. Where exactly I bury it is entirely up to you. Either we can bury it in the ground and let bygones be bygones or I can bury it in the heart and head of every one of you here. Either way, the persecution of my wife and her friend stops now.\"</p><p>Dieter stiffened. \"You don't come in here and order us about.\"</p><p>Velkan shot a blast that knocked him off his feet. \"Be smart. Take the out I'm offering you. I promised Esperetta that I wouldn't be a barbarian anymore. So I'm trying to be civilized about this and let you live even though the warlord inside me would rather I bathe in all your entrails.\"</p><p>\"We are sworn—\"</p><p>\"Save it,\" Velkan snapped, cutting Dieter off. \"I was one of the members of this Order five hundred years ago and I know the oath you've all taken. And I've taken a new one. The next man or beast who threatens my wife or my servants will not live to regret that stupidity. Is that understood?\"</p><p>He waited until each man had nodded.</p><p>Velkan took a deep breath. \"Good. Now that we have an accord, I'll leave you in peace.\"</p><p>Turning toward the door, Velkan caught sight of something from the corner of his eye.</p><p>Before he could react, a single gunshot rang out.</p><p>He snapped his head toward a corner of the room where Esperetta stood with Raluca, Francesca, Viktor, and Andrei.</p><p>Esperetta was holding the gun in her hands. Her eyes were narrowed on the men in the room. \"Anyone else want to try and go for my husband's back?\"</p><p>Velkan looked to see Dieter lying on the floor with a single gunshot in his chest. Stunned, Velkan met Esperetta's gaze.</p><p>She didn't speak as she moved forward to take his hand while the wolves stood their ground. \"Gentlemen,\" she said quietly. \"I think most of you have met Illie's family and I believe they'd like a word with you. Alone.\"</p><p>Stephen came to his feet. \"Retta...\"</p><p>\"Save it, Stephen. You already told me what I needed to know.\"</p><p>Velkan wasn't sure what he should do, but as Esperetta pulled him from the house, he followed. And as soon as the door was closed behind him, he heard the screams of the men.</p><p>He stared in stunned awe of his wife. \"I thought you wanted them spared.\"</p><p>\"I'm not the girl you married, Velkan. I'm a woman who now understands the way the world works. They wouldn't have stopped coming for us. Ever. Frankie and her family owed a blood debt for what the Order did to her father. I say bon appétit.\" She stepped into his arms and placed a chaste kiss to his cheek. \"Thank you.\"</p><p>\"For what?\"</p><p>\"For trying to be a gentleman when I know it had to go against every part of your nature.\"</p><p>He took the gun from her hand and threw it into the woods before he cupped her face in his hands. \"For you, Esperetta, anything.\"</p><p>She gave him a speculative look. \"Anything?\"</p><p>\"Yes.\"</p><p>\"Then come and get naked with me. Right now.\"</p><p>Velkan laughed before he kissed her lightly on the lips. And for the first time in his life, he gladly submitted to someone else's orders. \"As you wish, Princess.\" </p> </body></html>"]