["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>1</p><p>There was nothing unusual about finding a dead man facedown in the London gutter. The odd part was that this particular man still had all of his clothes and skin. Even more bizarre, he was an almost exact copy of Frannie’s brother Bertram. From his cascading coppery-golden hair to his long slender fingers to the foppish cut of his expensive boots, Frannie was half-terrified to roll him over and find Bertram’s face as she had last seen it: proud, shocked, and marred by a sword slash across his silently screaming throat.</p><p>Sprawled in the alley as he was, he should have been stripped to bones by the bludrats. But he was perfect—and still breathing. After glancing up to make sure the Copper was still at his post across the square should she need him, Frannie nudged the figure with a toe, curious to see if she was rousing a lost Bludman instead of considering a human corpse. The color and cut of his flashy clothes were all wrong for a London Bludman, but Frannie’s neighborhood was getting closer and closer to Darkside and the expanding Daimon District, so who knew? She nudged him again. Much to her surprise, the man leaped into a crouch and spun to face her, teeth bared and beautiful hands curled into claws. He looked less like Bertram from the front, and she exhaled in relief. As he growled, a strange look of confusion came over his beautiful blue eyes. Frannie stepped away just in time to avoid the splatter of vomit that painted his waistcoat.</p><p>Holding back her skirts, she considered him. The stranger was terribly handsome outside of the sick, which smelled strongly of red wine. From hair to dimples, they could have been twins, except for the eyes. Hers were a dark shade of green, while his were almost the same bright sapphire blue Bertram’s had been. Her heart twisted. She couldn’t walk away.</p> <p>“Had a nice night, did you, duck?” she asked.</p><p>He wiped his mouth with a fine handkerchief and stood. His posture went from dangerous to resigned and a little sheepish as he knocked the filth off a rich man’s boots. When he looked up at her again, his eyes were wry, and his smile was dimpled.</p><p>“The night was fine, darlin’. It was the morning that caused all the problems.”</p><p>He looked past her into the darkness of the alley, then across the open square, where brisk business was happening under the watchful eye of a Copper and a splutter of watery sun. “We anywhere near the Vauxhall?”</p><p>She chuckled. “Nowhere close.”</p> <p>“That’s damned inconvenient.”</p><p>Frannie watched as the man thrashed around the alley, kicking the trash and bins aside and growing angrier by the moment. He was no born Londoner and no gentleman, even if he wore the clothes of a grander man. And yet something about him made her stay, curious, as if he were some new animal whose habits she had yet to learn by heart.</p><p>He kicked the wall. “Hellfire! Have you seen a suitcase?”</p><p>“A what now?”</p><p>“Valise. Portmanteau. Whatever you people call it. About this big, filled with my clothes and bottles? All my worldly possessions? And my last week’s pay, which I was going to give my innkeeper, right before he kicked me out?”</p><p>Frannie sucked in a chuckle and gestured to the narrow alley and filthy bricks, careful not to upset the basket over her arm. “If there was anything worth having, it’s long gone. Welcome to London, lad.”</p> <p>“Long gone? Bloody thieves. Isn’t anything in this stupid world easy?”</p><p>“Losing what you’ve got’s a good bit easier if you’ve been drinking.”</p><p>“I may have had a bit to drink, but I think something more sinister was at hand.” The man rubbed his head and winced. “There’s a lump on the back of my skull the size of an apple. And this isn’t my usual side of town.”</p><p>A hiss cut the air from deeper down the alley. They both turned as a pair of bright red eyes emerged from the shadows, higher up than they should have been. Another pair appeared behind it, and the hiss grew louder. The basket over Frannie’s arm wiggled and jerked, and she unhooked the parasol from her belt and pointed the tip at the advancing red-furred monsters.</p><p>“A nice cudgel to the head makes you easier to rob, my lad. You must be new to London, to have fallen for that. But whatever magic kept the bludrats from eating you alive, your luck’s run out. I suspect in more ways than one. However you got here, it’s time to leave.”</p><p>She backed out of the alley with a confident smile, holding the parasol with easy familiarity and humming gently to her basket. The man stared at her in confusion before shaking his head and following. He looked lost, the poor creature. Just like Bertram. As if the little boy inside was constantly amazed that he was expected to buck up and get to work like a man. And yet there was something gallant about him, too. There was a good heart hidden under the yark and the gold-stitched waistcoat—she just knew it.</p><p>“Do you need me to escort you somewhere?” he said, confirming her suspicions. “I think this part of town might be dangerous.”</p><p>She snorted and rolled her eyes. “I know these streets better than you do, duck. I should probably be escorting you. Now, come along. You need a safe place to sleep off that headache. Five coppers a day for lodging, but you do your own washing.”</p> <p>They left the alley and stepped onto the square, but Frannie didn’t put down her parasol. She knew well enough that bludrats were fearless. City lines and sunshine meant nothing to them. But she didn’t hate them the way most people did. Like any animal, they had their place, and she had solid walls at home to keep them there. The ferocious maroon monsters were fascinating in their own way, mainly when viewed from a distance while holding a sturdy, blade-tipped parasol.</p><p>Once she was far enough into the morning tumult of the square, she retracted her parasol’s tip, hooked it back onto her belt, and strode briskly down the sidewalk. She was almost a block away before the man caught up with her, dancing around the street muck in his fancy boots.</p><p>“Did you . . . should I be following you?” he asked. “Is five coppers enough?”</p><p>She didn’t break stride. “I’ve a damnably soft heart for lost creatures, and you’re the most lost thing I’ve found in ages. Five coppers is London standard for lodging. At the very least, we can get you some breakfast that’s actually made of food.”</p><p>“Why are you being so nice to me?”</p><p>She stopped and spun, drawing herself up tall and squinting at him. He even had Bertram’s hairline. The only difference she could see was that this fellow had darker eyes than her brother’s, but otherwise, they might have been twins. It was sealed then, right there. If she could save him, she would.</p><p>“Because you remind me of someone I loved.”</p><p>He looked her up and down, wary. “That’s a kind offer. I don’t have the coppers right now, but I promise I’m good for it. My name is Casper Sterling.” He held out his hand.</p><p>Instead of shaking, she gave him a handkerchief. “No offense, Master Sterling, but you’re spattered in yark. I’m Frannie Pleasance, and I run a pet shop called Needful Creatures, so I hope you don’t mind a bit of noise and fluff downstairs. Now, hurry up. I’ve cages to clean, and we open at ten on the dot.”</p><p>With a firm nod, she dove into the foot traffic without looking back. When she heard a small mewling, she sneaked a glove into the basket to calm the muddle of kittens wrapped in a warm blanket. Their mother had died when the last kitten had gotten stuck, and that meant that until they were grown, she would keep them with her at all times.</p><p>“There, duckies. Almost home,” she crooned.</p><p>Casper appeared at her side, struggling to keep up with her brisk pace. “You’re quick” was all he said.</p><p>She grinned. “Everything is, in London.”</p><p>2</p><p>The first day was easy. Robbed of his cash, Casper insisted on helping with chores. Her new lodger took quickly to the animals and was efficient and quiet at his work. Part of that might have been the headache one would expect from a night wandering the town incoherent and yarking. Or it might have been the knot she felt under his long hair, almost big enough to break the skin. He had definitely been hit and dumped, and judging by the smell of his shirt, he’d been drinking something heavier than he could handle.</p><p>At the very least, he didn’t bother the creatures, which was a mercy. In addition to supplies and feed, Needful Creatures currently offered parrots, mynahs, crows, small owls, budgies, finches, canaries, kittens, random reptiles, and a very rowdy litter of corgis, all for sale at the right price to customers whom Frannie herself approved. As she tidied up yet another pile of puppy shavings, she couldn’t help admitting that there was some advantage to the clockwork pets that were all the rage. They weren’t much to cuddle, but the cleanup was vastly more pleasant.</p><p>Casper had gone green at mention of breakfast and even tea, and that’s when she began to suspect that there was something rather wrong with him beyond overindulgence. She knew enough about men to know they never turned down food, and yet there was an odd desperation about him. She watched him when he wasn’t looking, just as she felt his eyes on her whenever her back was turned. Finally, she couldn’t take the strained silence anymore.</p><p>“I’m taking tea. You can join me or scoop up after the iguana.”</p><p>With one glance at the slimy pile behind the monumental lizard, he nodded and followed her through the curtained door to the parlor beside the kitchen, where buyers were introduced to the more expensive pets before buying. She went about the calming ritual of making tea, one ear always cocked for the bell over the door.</p><p>“It’s a lovely shop,” Casper said, his arm draped casually over the back of the sofa.</p><p>And it was a lovely shop, the bricks and boards painted individually in pastel hues, a brilliant mosaic to fight the dreariness outside. Frannie had always loved the curving birdcages of metal and wood shaped like minarets, castles, and turrets, each one a different color and all housing merry, bright birds. The lively parrots and sleepy owls and clever, sleek crows sat on brightly painted perches, ringing bells and chattering. Her father had built the bins for puppies and kittens in the shapes of ornate carriages, and the display of lizards, turtles, and snakes resembled an array of penny candy at a general store. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But she knew it was lovely—she lived there. Frannie narrowed her eyes at him. Was the fool going to flirt?</p><p>“My father started it before I was born. I didn’t change much when he and my mother passed on.”</p><p>“No clockworks?”</p> <p>Her shoulders bunched as she poured hot water from the kettle into her mother’s old teapot. Always the same question.</p><p>“No clockworks. I’ve always felt there’s a certain magic to the old ways. Animals used to be everywhere. Now they’re rare and special. People who want clockworks can totter off to artificers and the modern shops on High Street. People who want warmth and charm and quirkiness will always find me here.”</p><p>“Charm and quirkiness, eh? Where I come from, they would call you ‘vintage’ and ‘timeless’ as the highest compliment.”</p><p>He smiled with his dimples, and Frannie sighed to herself. So he was the same as all the rest. They couldn’t help getting fresh, even when she dressed in her mother’s old patched things and didn’t paint her face as a lady should. She looked down past the teacup in her hand to the thick, solid cloth of her tweed skirt.</p><p>“Been told I look like a London sparrow.” She poured the tea with a deft hand. “Small and brown and quick, flying away whenever somebody gets too close. And brown hides the stains of the creatures, bless them.”</p> <p>Casper looked down, chastened. “I’m sorry if I’ve made you uncomfortable. I’ve only been in London for a few weeks, but you’re the first girl I’ve met who wasn’t dressed in the brightest colors possible and who didn’t detach half of her wardrobe the moment she was behind closed doors.”</p><p>“Is that a put-down or a compliment?” she said sharply.</p><p>“Just an observation.”</p><p>Frannie rolled her eyes—it was clear girls rarely dismissed his charms. “And what’s your story, then? I saw your costume earlier. You a ringmaster in the circus?”</p><p>He shuddered as if she’d stuck him with a hatpin. “Nothing like it,” he said, face gone dark. “I’m a musician. Getting a bit famous, actually. They call me the Maestro.”</p><p>Taken aback, Frannie stared at him. “The Maestro? The man with the magic hands, who can invent songs that rival the angels’ choirs and play them faster than the devil’s fingers?”</p> <p>“The very one.”</p><p>She whistled through her teeth as she handed him the saucer and cup. “The Maestro’s famous hands, glove-deep in cat litter. I’ll be damned. You should have said something.”</p><p>He sighed. “All I can say is thank you. You found me half-dead in a puddle of sick and offered me your brother’s bed.” Her eyes narrowed at him. “I assume that’s his portrait, on the wall? The three of us look like triplets. Will he mind having me in his room?”</p><p>“He’s gone.”</p><p>He flinched at her frosty tone. “Anyway, I’m not going to complain about a little honest work.” He sipped the tea, grimacing. “Lord knows I could use some.”</p><p>She wasn’t sure how to act, now that she knew he was famous. Other than a naval admiral stopping in for a parrot once, she’d never met anyone remotely important. Even the fine lords and ladies who wished for high-profile pets sent their servants to handle the distasteful exchange of creatures for coin. Still, it wasn’t as if she had forced him into servitude. And aside from his cheeky flirting that pressed overly close to old wounds, he hadn’t been too much trouble.</p><p>“How’d you end up in the street, Maestro?”</p><p>He sipped, but she didn’t see his throat move. Strange.</p> <p>“Enjoyed the party too much, I suppose. I was headed for the . . . a friend’s flat, and then everything went black.”</p><p>“You’ll not be up to such high jinks here, you know. Puts the birds off their feed.”</p><p>He chuckled. “I promise to do my carousing elsewhere. It’ll be good to have a place where I’m hidden and not coddled. But what’s your story? I want to know more about you.” He grinned at her, and she sidled away as she sensed his interest rekindle.</p><p>Luckily, the bell rang just then. She gladly left Casper behind, hurrying through the curtain to greet the stiff nanny and richly dressed little girls waiting, pink-cheeked, to pick out one of her darling kittens.</p><p>“Such a fine, soft coat! And such bright eyes!” the nanny said, inspecting every inch of the kitten with a professional flair. “This is the fourth establishment we’ve visited, and this is truly the most superior specimen in all of London.”</p><p>Frannie just smiled. Her patrons never knew her secret, but they paid handsomely for her results. Her parents had taught her well.</p><p>3</p><p>Frannie sold the kitten for a tidy price, of course. She pressed a pamphlet on care and feeding into the nanny’s hands in exchange for a heavy purse that still wasn’t heavy enough. Before they left, she made the little girls promise not to tease the creature too badly.</p><p>Her next customer was a daimon fetching his monthly bag of seed for the crow she’d sold him years ago. They chatted politely about the new tricks and phrases the canny bird had mastered. Of all the daimons she dealt with, this gentleman was one of her favorites, a puppeteer from Paris who ran a popular show in Piccadilly Circus. The daimons of Franchia were known for their strangely colored skin, waving tails, and peculiar magic, but they were good customers. Frannie vastly preferred dealing with the ones who fed on happy energy and laughter, and even Maisie, the innkeep next door, refused to offer lodging to the dark daimons who fed on pain and worse things.</p><p>“Au revoir, chérie,” the daimon said, doffing his tall hat and bowing. “You must come see the show again soon.”</p><p>“One day,” she murmured.</p><p>She hadn’t been since Bertram’s passing, of course, and her heart felt heavy as she locked the barrel of seed and rolled it back into place. Bertram had loved Piccadilly.</p><p>When she pushed past the curtain to the parlor, she found Casper asleep on her couch, his untouched tea growing cold on the table. After sneaking upstairs, she hid the velvet bag of silvers and changed into an uglier hat. She couldn’t turn Casper out, but she wouldn’t give him reason to eye her like a pastry, either.</p><p>Her new lodger slept the day away, and she was free to go about her regular, boring routine. In the past few years, since she had been forced to cut expenses and let her assistant go, she had developed a certain way of doing things. It was almost like being a spinster at twenty-four, but she didn’t mind.</p><p>When she went out to her tiny courtyard to hang up the wet towels she’d just washed, a familiar, battered top hat and cunning pair of eyes watched her over the brick wall. She smiled to herself, knowing exactly what would come next.</p><p>“You sure you’re ready to have another lodger?” a gravelly voice muttered.</p><p>“I couldn’t turn him away, Maisie. He looks like—”</p><p>“Any fool can see that. But he ain’t Bertie.”</p><p>“I’m not wiping his arse. And he’s not staying forever.”</p><p>The old woman harrumphed and shook her head. “Be careful. Reve said he smells like trouble.”</p><p>It was Frannie’s turn to harrumph. “Daimon magic. Tell me you don’t believe in that folderol?”</p><p>Maisie’s boots shuffled slowly to her back door. “I been running this lodging house since your papa was in a pinafore. Kept just as many daimon lodgers as Pinkies, and I tell you now that when a daimon gives a warning, I take it. Remember what happened last time somebody told you to be careful around a man?”</p><p>Frannie dropped her towel on the ground with a splatter of mud as Maisie’s door slammed shut.</p><p>“I remember,” she whispered in the silence.</p><p>Casper slept until evening. He sprang up from the couch as Frannie was placing a plate of bread, cheese, and fruit on the table by a fresh cup of hot tea.</p><p>“Simmer down, duck,” she said. “Did you have sweet dreams?”</p><p>“Not in years. What time is it?”</p><p>“Dinnertime. Sit. Eat.”</p><p>He made a grouchy face that reminded her more than ever of her indignant younger brother.</p><p>“For a pretty little thing, you act like an old lady. And what’s with the ‘duck’ thing?”</p><p>He didn’t touch the food, but she sat down in her favorite chair and began eating anyway. She was always starving after a day on her feet among the animals, and business had been brisk.</p><p>“When my parents passed on in a conveyance accident, I was only seventeen. I became my younger brother’s guardian, and he followed me about like a duckling. Old Maisie next door told me I had to treat him just like a troublesome creature—with unconditional love and complete dominance.”</p><p>“What happened to him?”</p><p>She dropped the piece of bread that she’d been unconsciously shredding. “He died.”</p><p>No matter how many times she said it or thought it, it was never any easier. The silence deepened, and she looked up at him, eyes pricking, daring him to say something sappy so she could tear him apart as easily as the bread.</p><p>“That sucks” was all he said, and although she was unfamiliar with the phrase, it rang terribly true.</p><p>“It does suck, yes. It . . . sucks very much.”</p><p>“You should probably eat,” he said softly, and in response, she threw the bit of bread at him, smacking him right in the face.</p><p>“You first.”</p><p>His mouth quirked up, and he rolled the bread between his fingers as if he had forgotten how to eat. “Not hungry. And I have to get to the Vauxhall before dark.”</p><p>“You’d best run, then,” she said, staring at the clock on the mantel.</p><p>When he saw the time, he leaped to his feet and ran off without a word—or his spoiled waistcoat and fancy jacket. He wasn’t wearing nearly enough clothes to be on the street after dark, but he was already gone, and she wasn’t about to chase after the fool.</p><p>Frannie stared at her dinner for a moment, finding loneliness in the silence for the first time in a long while. Her eyes started to tear. Being with Casper was . . . so very strange. She wanted to help him, order him around, keep him safe. But he wasn’t Bertram, and the way he looked at her made her all skittery. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With a determined nod, she marched into the pet shop to a chorus of creature greetings, plucked her favorite kitten from the abandoned litter, and carried the little ball of white and gray fluff back into her parlor. Her parents had warned her from a very young age never to get attached to the animals. They were things to be bought and sold, not kept and cosseted. Love them and let them go. But she had been drawn from the start to the wide green eyes and folded-over ears of the runty orphan.</p><p>“Your name is Filbert,” she said. “And your job is to keep me from crying.”</p><p>Filbert batted at a loose string in her skirt and set to purring, and she ate her cheese, determined to kick Casper out the next morning. She’d given him a key earlier, which she now regretted. Despite what she’d said to Maisie, she was starting to take Reve’s warning to heart.</p> <p>Casper Sterling was definitely trouble.</p><p>4</p><p>Frannie’s dreams were unsettled and muddled, punctuated by the rumbling purr of her first actual pet. But when Filbert’s tiny claws dug into her neck, she woke up in a sweat. Bolting upright, she knew something was deeply wrong. The wee cat was terrified, and it was easy enough to see why. The curtains were on fire and belching smoke.</p><p>The ruckus from downstairs was deafening, and fear choked her when she realized how frantic the trapped animals must be. She lurched out of bed and tossed the contents of her ewer at the flames, then a vase of flowers, but the water wasn’t nearly enough. She next yanked the curtains to the floor and tossed her thick blanket on top of them, trying to stanch the flames. But the blasted fire leaped to the carpet and licked at her stockinged feet, and she cast about for some other way to stanch the blaze before it ate up her entire life and legacy. Although the outside of the building was stone and brick, there was plenty of wood inside. Most of the things she valued were flammable, and she was only one person, a small woman clutching a blanket riddled with smoking holes.</p><p>The kitten mewed hysterically on the bed as Frannie’s eyes began to tear up from the smoke. One sleeve over her nose, she threw open the closet door. She put one hand on the back wall, considering, but she wasn’t enough of a coward to give up and take the easy way out. No, she would have to fight. The breath stopped in her chest when she realized there was nothing in the closet that didn’t have deep sentimental attachment, that anything she chose would be a beloved memory lost forever. Damn it all. She yanked out her mother’s winter coat, a thick wool thing that looked like a bear’s carcass, and threw it over the rug, grinding her foot over it. Stubborn and quick, as if it had a mind of its own, the fire danced out from under the coat and caught her shawl where it hung from the bed. She grabbed Filbert, stuffed him into her nightshirt’s pocket, and slammed the door on her way to the landing.</p> <p>“Casper? Wake up!” she yelled, banging a fist against his locked door, but all she heard within was a tired mumble and the creak of bedsprings as he rolled over.</p><p>“There’s a fire, you dolt! Get up or die in your damned bed!”</p><p>Frannie heard his feet hit the floor, and that was enough. She ran down the stairs, grateful that smoke wasn’t barreling up the narrow staircase. But why would the fire have started in her room, of all places? It didn’t matter now. If it spread, she would have to set the animals free. They wouldn’t have much of a chance on the London streets, but maybe some of them would fly over the walls or escape the bludrats long enough to find a home. Anything was better than hearing their screams of death in a smoky inferno.</p><p>The shop was a raging storm of feathers and screeches and cawing. Wide wings flapped, small birds fluttered, and the pups barked like mad. She spun in the middle of her domain, her brain a snarl of smoke and flame and horrible possibilities, trying to figure out which creatures would have the best chance on the streets.</p><p>With a deep breath, she flung open the front door of the shop and ran to the birdcages, opening the doors for the parakeets, canaries, and finches. The tiny, stupid birds would fly fast and high, none of them loyal enough to look back. A few of them flitted past, while most were too silly to find the door.</p><p>“Idjits,” she muttered, moving on to the larger birds.</p> <p>She opened the doors to the larger cages of the mynah birds and a few pet crows she’d raised from eggs. It hurt her heart to watch them hop on top of their cages as they were accustomed to at mealtime and stare at her with intelligent eyes, but she shooed them out the door one by one, hoping their natural instincts would kick in and keep them from harm’s way.</p><p>“Good morning!” one called as it flapped into the night, and she stared at the parrot cages with growing anxiety. The poor things were too brightly colored to blend in with their surroundings, and while the mynahs and crows were just a few generations from the wild, the parrots hadn’t seen true jungles in decades.</p><p>She chose the biggest, meanest one first, but the olive macaw wouldn’t be coaxed out. Clicking its beak, it muttered, “It looks like rain,” and stepped back into the corner of its cage. She left the door open and moved to the next one as she heard a thump and a howl behind her. One of the corgi pups had managed to leap from the deep bin in which they slept and had landed badly. She scooped it up and dumped it back in with its littermates, hoping the little fool hadn’t broken a leg. The puppies wouldn’t last five minutes in London, and therefore, they would be going with her in a grain sack. Along with her kittens, of course, which would all fit in one basket. No matter how bad the fire got, even if it devoured the entire shop, she would save the pups and kittens.</p><p>Frannie had gathered the giant iguana in her arms and was hefting it toward the door when a siren pierced the night outside. Instead of dropping the nasty beast on the cobblestones, she stuffed it back in its terrarium and took a deep breath, waiting. If the Metropolitan Fire Brigade made it in time, perhaps there was hope. The elite but underpaid gentlemen of the Brigade were known all over London as heroes, saving the mostly wooden buildings from igniting the entire city when they inevitably caught fire. Although electricity was becoming more popular, there were still plenty of gaslights and even old women taking candles upstairs in their shaky hands. But her father had wired the house himself, and there was no way her curtains could have caught fire from her own folly. Still, she tried to calm her heart and be patient, putting a hand in her pocket to check on Filbert. The little scamp had gone back to sleep.</p><p>A huge machine rumbled to a stop beyond her open door. Men in uniforms and tall helmets dropped to the cobblestones and burst into action. Frannie was rooted in place as she watched the firemen unroll their heavy hoses and begin manually pumping water that slammed into the house and splattered around the open door. She heard the upstairs window shatter as murky water seeped onto the carefully swept wooden floors of the shop. A confused parakeet fluttered back in, cocking its striped head at her. It had the good sense to scuttle under a seed bin after a rubber boot nearly squashed it.</p><p>Frannie was struck by the strangeness of the fellow attached to the battered footwear. A Copper’s uniform clashed with a plumed helmet, dusty goggles, and the newfangled breathing apparatus that kept London’s firemen from dying of smoke inhalation. Her heart stuttered in her chest for several reasons.</p><p>“May we go upstairs?” he asked, and Frannie nodded dumbly at the impersonal, mechanical sound of his voice through the mask. He clomped past her and up the stairs. Two more identical men followed, and she couldn’t imagine how they managed to carry the huge cylindrical tanks that held a mixture of water and the secret fire-suppressant chemical for which they were famous. While she waited, Frannie bundled the kittens into a basket and stroked the yipping puppies, preparing for the worst. From the top of his tank, the iguana stared at her like some strange, alien god who knew the time of judgment was nigh.</p><p>It was both moments and eons later that the three men tromped heavily back downstairs, their uniforms streaked in soot. Two of them went outside to the truck, but the biggest one, the leader, stopped before Frannie. After withdrawing his thick, rubberized gloves, he unlatched his breathing mask with broad, sweaty hands and shoved the goggles back onto his head.</p> <p>“It’s out, miss,” the man said, his voice deep but soft and carrying a slight burr, infinitely more human without the helmet.</p><p>Frannie didn’t realize she was holding out a handkerchief until he took it gently from her to mop off his grime- and sweat-streaked face. He was a sturdy-looking man, with bluff hazel eyes and a determined jaw speckled with stubble that matched the sun-bleached hair pulled back in a rough tail. He looked as if he spent a great deal of time outdoors, gazing at the horizon, and she wondered for a moment if he had once been a sailor.</p><p>“Mask gets a bit mucky,” he admitted. “Thank you.”</p><p>When he held the limp, grimy fabric out to her, she shook her head. “Keep it, please. It’s the least I can do. I can’t thank you enough, Mr. . . . ?”</p><p>“Maccallan. Thom Maccallan.” He glanced down at her, flushed, and looked uneasily around the pet shop instead. Frannie realized she was wearing only her night shift, with no shawl close at hand, and she swung the basket of kittens around to cover her bosom as much as possible. He cleared his throat. “Not much damage upstairs. Curtains, rug, bit of the bed. Some sort of bearskin.”</p><p>“I’m Frannie Pleasance. And that was my mother’s coat.”</p><p>“Sorry about that. Do you know if anyone has a grudge against you, Miss Pleasance?”</p><p>“A grudge?”</p><p>He dragged a finger down the glass of his goggles and held it out to her. A smattering of glittering grains sparkled among the soot.</p><p>“Some sort of magic about the fire. Came through the window. Are ye harmed?”</p><p>Frannie shook her head. The shock was finally getting to her, and her teeth were glued together. She felt as if she would fly apart if she tried to open her mouth. Thom nodded in understanding.</p><p>“It takes ye like that sometimes, the fire. Too big to handle, aye?”</p><p>She nodded again.</p><p>He held out a hand as if to pat her shoulder, then realized how grimy he was and withdrew it. Instead, he jerked his head at the vacated birdcages. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ye were letting them out?”</p><p>She nodded.</p><p>“Think they’ll come back?”</p> <p>She shrugged.</p><p>“Ye got anyone to help ye round them up?”</p><p>She shook her head no.</p><p>His eyebrows drew down. “Not to tell ye your business, miss, but ye ought to have someone around, at least.”</p><p>As if on cue, Casper stumbled down the stairs in nothing but breeches, lipstick smeared all over his bare chest.</p> <p>“Bit noisy and watery up there, isn’t it?” he slurred. He put one hand on a cage and leaned, making the parrot inside squawk indignantly when he nearly knocked it over.</p><p>Thom’s eyes rolled to Frannie. Her mouth finally came unstuck, and she muttered, “My good-for-nothing lodger. I assure you, the rouge ain’t mine, and neither is he.” She waved a hand at Casper. “Go back to bed, fool.”</p><p>Thom sized Casper up and made a Scottish sort of noise way back in his throat as the smaller man staggered up the stairs. The fireman rubbed the handkerchief over his forehead again, spreading more soot around. “I see. Well. If ye need help a-gathering the creatures you’ve let out, I’ll offer my services. Did a bit of hunting, back home and aboard ship. Have ye some nets?”</p><p>Frannie pointed to a bouquet of bird and insect nets she kept in a corner, most of them antiques. “That’s most kind of you, Mr. Maccallan,” she said, her voice rough with smoke.</p><p>His eyes caught hers, and she felt warmth bloom in her belly. His eyes were like a deep puddle in the sunshine, like a pond in a far-off forest. She was about to mumble something completely incoherent when the basket rocked against her, followed by a splat and an indignant mew. One of the kittens had climbed out and fallen onto Thom’s heavy boot. With a chuckle, he bent to scoop up the little fluffball and drop it gently back into the basket.</p><p>“That one’s going to be a bounder,” he said.</p> <p>She couldn’t help smiling in agreement.</p><p>“C’mon, Mac. There’s a call ’cross town!” someone called from outside. The siren pealed, and the fire rig churned to life with a rumble she felt in her feet.</p><p>“Be careful, lass,” Thom said. With a last long look, he pulled his mask and goggles into place before turning to go.</p><p>She followed him to the door, not minding the dirty water splattering her bare feet. “Mr. Maccallan?”</p><p>He turned, and she saw her reflection in the glass of his goggles, lit up by the first streaks of dawn. Her coppery hair was tousled, limned in gold, her skin pale except where a blush rode her cheeks. She looked like the heroine of some romance novel, an orphan lost on the moors. She shook off the fancy.</p><p>“Thank you. Ever so much.”</p><p>She couldn’t see his face, but she sensed that he smiled, although his voice was metallic and impersonal again.</p><p>“It’s my job, miss.”</p> <p>She watched him climb up onto the rig, holding on confidently with one hand as it lumbered off into the morning. He didn’t wave, didn’t turn, and she couldn’t help wondering if he was just being polite, offering to help her find her lost creatures, or if maybe he was hoping for coin she didn’t have. As the fire engine rumbled away on heavy treads, Frannie’s eye was caught by something white and stark. It was her handkerchief still clutched in his hand, fluttering in the wind as he rode off into the sunrise.</p><p>5</p><p>A knock woke Frannie the next morning. She rose and stretched, a little achy from sleeping on the downstairs parlor couch, as her bed was a wet, smoldering mess. The ache in her heart was heavier than usual. With Bertram and her father gone, there was no man about the house to help with repairs. The knock came again, and she realized she had slept late for the first time in years. Remembering the basket of kittens clutched to her chest the night before in the name of modesty, she wrapped a blanket around her shoulders as a shawl before pushing past the curtain into the sad mess of her too-empty, too-quiet shop.</p><p>Looking through the glass window, she saw a beggar child standing at her door. Beside his patched, overly large boots stood a familiar, dignified crow. A filthy bit of twine was tied to the creature’s leg, and when she opened the door, it stared up at Frannie like an affronted duke come face-to-face with a servant.</p><p>The child sneered up at her, and the Copper standing slightly behind him said, “Go on.”</p><p>“Found yer bird,” the child muttered.</p><p>“Found it and tried to make a pretty penny, more like. Thought it might belong to you, miss. Have you had any thefts?” He stared down at the child almost hungrily, as if hoping for a reason to take the scamp into the station.</p><p>Frannie knelt and held out her arm. The crow gladly hopped to her, rubbing its beak gratefully along her sleeve. Even if it had been stolen, she wouldn’t have turned the poor ragamuffin over to the Coppers for what passed as interrogation these days.</p><p>“Not stolen. There was a fire last night, and I began freeing the animals in case the Brigade couldn’t stop it in time. Would you brave gentlemen care for some biscuits as a reward for returning him?”</p><p>“Money’d be better,” the child grumbled, but the Copper thumped him on the head and said, “That’s awfully kind of you, miss.”</p><p>Frannie set the bird on its perch by a fresh bowl of seed and hurriedly fetched some ladyfingers from the parlor, along with some of the lemon drops she kept around for her customers’ spoiled children. The Copper regarded the shop with narrowed eyes as he nibbled his biscuit, and Frannie was relieved when he yawned and moved toward the door. When he stepped outside, she slipped the candy and a coin into the child’s hand and whispered, “A copper for any more pets you bring. Pets, mind. Won’t pay for nuffin’ wild. Spread the word, eh?”</p><p>The child’s eyes went bright as he nodded craftily. The candy and the coin had already disappeared.</p><p>Once they were gone and the raven settled back in, she set to work upstairs, mopping up the water and dumping the ruined bedclothes and rug and singed curtain scraps out the broken window. She knew well enough that they would be snatched up within moments by the less fortunate. There were plenty of people in London who had nothing and wouldn’t mind the burn holes. Studying what was left of her room, she tallied up what she would need to make it livable again. Money was tight, and she’d have to visit the secondhand shops. It had been years since she’d had anything like new.</p><p>When she went downstairs for the parlor broom, she found a disheveled but dressed Casper steadily going about her chores. He was halfway through scooping out the puppy bin, his face a decided shade of green.</p><p>“You’re alive, then,” Frannie said sharply.</p><p>He glared at her, the whites of his eyes as pink as pickled eggs. “Did I dream it, or was the shop on fire at some point in the night?”</p><p>“Ah, yes. It was, actually. You did your part to save dozens of animal lives by turning over in bed and knocking over a parrot. Well done. You’re on your way to earning your keep.”</p><p>“I’ll pay for the room.” She raised her eyebrows. “When next they pay me.”</p><p>“Don’t drink it away this time.”</p><p>“I didn’t drink it away. I have an unusual . . . condition. It requires a special medicine that’s very expensive, and—”</p><p>“Don’t. Just don’t.” She held up a hand and went back to sweeping.</p><p>He looked properly chastened and set to scooping up bedding with renewed vigor as corgis tumbled all over the rolled-up sleeve of his shirt. She noticed an inked mark on his forearm, a raven with a key, but she was too scandalized at seeing a man’s skin during daylight to ask about it.</p><p>“You don’t know any carpentry, do you?” she asked.</p><p>He shook his head. “Outside of music and puppy wrangling, I’m utterly useless. Sorry.”</p><p>“No other skills whatsoever?”</p><p>He looked down, and she couldn’t help noticing again the smeared marks of rouge on his chest. “Let’s just say I use my hands for softer things.”</p><p>She snorted and raised an eyebrow at him. He was so much like Bertram that it was almost ridiculous. Pretty and spoiled. Casper finished with the puppies and stood, and she put a glass bottle in his hand.</p><p>“The kittens in the basket need to be fed. There should be enough here to fill all their tummies. They’ll make a mess right after, so make sure to put them in their bin of hay.”</p><p>He looked at the creamy milk and laughed. “Not the kind of bottle or cathouse I’m used to, but I think I can do that much. Are you leaving?”</p><p>“I’ve things to replace, after the fire. I’ll lock the door. Don’t open it for anyone.”</p><p>“You don’t trust me to sell animals?”</p><p>Looking him up and down, she said, “This establishment is called Needful Creatures, not Pathetic Mutts. Have a bit of pride, man.”</p><p>She left him there, barefoot and staring at the bottle as if it was a foreign artifact.</p><p>Frannie returned just before ten. The folding cart behind her was mostly empty. Things seemed to cost more than they once had. The curtains were drab, and the sheets were thin, but they would do. That would have to be good enough.</p><p>The door was unlocked, which set her immediately on the defensive. Two male voices were raised within, which was one more nonbird voice than she could allow.</p><p>“What the blazes—”</p><p>Casper and a familiar-looking man stopped their nose-to-nose arguing and stared at her. They were both covered in kittens and bristling all over like two male dogs that had sniffed each other’s bum and not liked what they found.</p><p>“I told him. I told him I wasn’t supposed to let him in. But that crazy old biddy next door sent him around back,” Casper said.</p><p>The big man leaned back and tried to cross his arms over a wide chest, but he was hampered by a tiny calico crawling up his jacket. He stifled a smile and cleared his throat, and that’s when Frannie realized it was Thom, the fireman from the night before. He looked different out of his uniform and not coated in sweat and soot. His skin still carried the kiss of a sun more fiery than Sangland had seen, but his hair fell to his shoulders in clean waves, and his cheeks were neatly shaved. And she hadn’t met a man in a skirt before—not that it wasn’t a very manly skirt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He must have caught her staring at his knees, for he said, “Edinburgh, in case you’re curious. Took to the sea as soon as I could and never looked back. Especially not when a wee cockerel like this one tries to turn me away from an obligation. Speaking of which.” He snapped open an odd, fur-covered bag around his waist, and a parakeet flew out in a tizzy to screech at him from the rafters.</p><p>Frannie could only stare at the little yellow and green bird. “How in Sang did you manage to catch a parakeet in London?”</p><p>A grin lit up his face. “Told you I was good at catching things. Shall we go out and find some more of your wee pets?”</p> <p>She stared at Casper, noting that he was fully dressed and clean, at least, his hair brushed and tied back and his boots pulled on. Did she trust him alone at the shop? No. But there was something mighty fetching about the fireman and his strange ways. And the earlier she went out to search for the lost pets, the better the chance of finding them in one piece. Frannie bit her lip and considered. What if someone came in for a kitten or a puppy? Casper didn’t know when they’d been whelped, what their bloodlines were, or what they liked best to eat. She needed every copper she could get from their sale.</p><p>“I’m afraid I can’t this morning,” she said sadly. “I can’t close shop, you know. Especially now that there’s things to replace.”</p><p>His brow creased, and he handed her the calico kitten that perched on his shoulder.</p><p>“There wasn’t much damage, aye? The window and a bit of the bed? Can your lodger not take care of such things?”</p><p>Frannie shook her head, and Thom gave Casper a withering look. The musician had his back turned as he sipped from a flask and missed the entire exchange.</p> <p>“I’ll bring the necessary materials,” Thom said. “Will tomorrow morning at dawn suit?”</p><p>“How much?”</p><p>He raised one eyebrow, affronted. “A home-cooked meal would be a fair trade. Nothing but wrappies down at the station, and bad ones at that.”</p><p>She cocked her head at him, but he seemed so earnest. “If I might ask, why are you being so kind to me?”</p><p>Thom gave her a look that seared her down to her toes, a spark lighting unexpected tinder. Looking down and clearing his throat, he extracted a kitten from his boot. “Ye seem like a good-hearted woman, is all.”</p><p>“That might be true. And I could use the help, to be sure. But only if you let me reimburse you.” She plucked the kitten from his hands and stroked its tiny back until a purr started up. “And only if it’s not too much bother. Fighting fires all night must be rather exhausting. And surely you have a family.”</p> <p>Thom’s face went dark. “Not anymore. I do a bit of handyman work when I can. Keeps me from brooding.”</p><p>“We mustn’t get too broody,” Frannie said, the corner of her mouth quirking up. “Dawn it is.”</p><p>“An ungodly hour,” Casper tossed over his shoulder.</p><p>Thom snorted. “Ye strike me as an ungodly man, lad. Best buck up and grow a pair.”</p><p>With a last nod at Frannie, Thom left.</p><p>“What’s with that guy?” Casper asked. “Barging in here like he can fix everything?”</p><p>“What’s wrong with you?” She advanced on him, waving a gloved finger in his face. “Sleeping through a near tragedy, useless to help clean up the mess. Call yourself a man?”</p><p>Casper’s lips pulled back, and he let out a warning hiss that drove her blood cold. “You don’t know a goddamn thing about me,” he said, low and deadly. “Where I came from or what I am. Don’t you dare compare me to some beefcake sailor who pretends he’s a gentleman so he can slip under your skirts. Here’s my week’s rent, by the way. If that agreement still stands?”</p> <p>He held out a paper tube of coins, and she took it numbly. Of all the things she’d expected of Bertram’s doppelgänger, rage and riches weren’t on the list.</p><p>“This is too much.”</p><p>“Keep it. Money is one thing I don’t lack.”</p><p>“Then why were you kicked out by your last landlord?”</p><p>“I—”</p><p>The rage fell from his face, and he simply looked like a lost little boy. One hand went unconsciously to the pocket where she knew he kept his flask. He recovered quickly and flashed his dimples. The practiced grin didn’t reach his eyes.</p><p>“Let’s just say my illness took me poorly. I had a fit. But I’m better now.”</p><p>“Are you sure?”</p><p>“I will be.”</p><p>The coins filled Frannie’s fist, far more than what she’d asked. She couldn’t toss him out now. Perhaps having a lodger wouldn’t be so bad, if he made a habit of actually paying extra. So long as he didn’t discover the hidden door in her closet, and so long as he kept to himself and didn’t have any fits, it might work out.</p><p>“You must be very talented,” she murmured.</p><p>He glanced up at her, mouth open in surprise. “You’ve honestly never heard my music? I thought everyone in London went to musicales and balls and shows. I assumed that was why you rescued me that day. Because you recognized me.” She shook her head, and he muttered, “Of course. The resemblance to your brother.”</p><p>“I don’t go out,” she said. “My parents didn’t approve of public displays.”</p><p>He smiled his charming smile, but with feeling this time.</p><p>“Would you go out for a good reason? I’m playing the Vauxhall this Friday night, and it’s kind of a big deal. I’ve been challenged by an upstart little twerp who thinks he invented the harpsichord. We’re going to have a duel.”</p><p>“A duel?” Her hand went to her throat, her heart dropping to her feet and her entire body going numb.</p><p>“Of course. Dueling pianos. One stage, two instruments, two master musicians.” He must have noted her going nearly rigid. “Oh, honey. You didn’t think I meant a duel—with swords? No way. I’m a lover, not a fighter. Most of the time.”</p><p>Frannie took a long, deep breath, feeling the blood rush back into her extremities. That’s all it took—a single word—to send her right back to that day in the park. To the red blood against sooty snow, to a cruel laugh, a sneer, and a dark, twirly mustache that had made her forever hateful of facial hair. She hadn’t been back there since. Hadn’t been much of anywhere, other than her usual errands, all of them to unthreatening shopkeepers and along walkways safe from the city’s dandies and devils.</p><p>“You really should come. My contract stipulates a box for my use, and I’ll put your name on it. You can bring your friends.”</p><p>Frannie snorted. “What friends? Maisie next door? A basket of kittens?”</p><p>“It’s a box, darlin’. Bring the entire shop, if you can keep the parrots quiet.”</p><p>“I’ll think about it,” she finally said.</p><p>But she knew the sort of person who lurked around Casper’s innocent little musicales, and she didn’t ever want to see that mustache again. Was it better to seem a coward or come face-to-face with the man who’d ruined her life?</p><p>6</p><p>Her coin had more than done its work. Three more street urchins arrived that day bearing lost and confused birds. One brought half of a dead parakeet and a hopeful smile, but Frannie sent him away with her secondary order: they only counted if they were whole and alive.</p><p>The kittens were brightening up, so she settled them into a bin, glad to be relieved of the basket for the first time in a week. On a whim, she gave them a bit of mushed-up fish and milk to see if they were ready for real food, and they fell to it like thieves. One less thing to worry about. All in all, business was going well, and by the end of the day, she’d paired city folks with animals they considered magical, pocketing a decent bit of coin in the process.</p><p>Crows and owls were quite popular with magicians, scholars, and daimons, while the rich families lined up for kittens and puppies. The middle class had to settle for creatures small and bright—parakeets, dragon lizards, canaries, and the occasional tortoise. She would take almost any unbludded animal her vendors could deliver still breathing. Over the years, she’d seen dozens of the expected creatures, not to mention rare and exotic pets such as spotted mice, dodo birds, living monkeys, snakes, and, once, a patchy leopard cub she’d spruced up and taken to the zoo for an enormous profit. After coaxing her new charges into excellent health with her father’s secret lore, she sold them fairly quickly. That was one reason she never got too attached to her creatures: they never stayed.</p><p>Except Filbert. He rode in her pocket all day, even for the morning’s errands. She’d held herself aloof for so long that it felt odd to have someone constantly around, even if it was just a kitten.</p><p>After closing shop for the night, she went up to the attic and brought down the ancient dress form and sewing kit. The old dress from the back of her closet felt strange in her hands, the shimmering indigo fabric light and fresh and crisp compared with her mother’s old tweeds. She’d thrown out all her bright dresses right after Bertram’s funeral, except for this one. Considering carefully the fashions she saw daily on her customers, she made a few changes to the design, moving the ruffles and ribbons around and including a pocket for Filbert. She had spent far too much on this dress, back when Bertram had been alive and the shop had still been in the good part of town and they had barely been able to keep the cages full, so quickly were the animals sold. And although she wasn’t sure why she hadn’t tossed it out with all the others, she was glad to have at least one thing in the closet that wasn’t brown. No one wore brown to the theater.</p><p>Once she heard the back door close behind Casper, she set the dress aside and crept downstairs for her final check that all was in place. The pet shop was warm and rustling, comfortable. She lived in fear that a bludrat would find its way in and massacre her world, despite the tight-as-a-drum design of the room. She couldn’t have traps, of course, since a curious kitten could fall victim all too easily to one of the huge, crude affairs meant to crush bludrats in one snap. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The shop was tidy, most of the creatures sleeping. A secretive smile came over her face as she realized that with Casper gone, she could finally sneak through the hidden door in her closet. She had business to attend to on the roof, after all.</p><p>Hours later, as she prepared to drag herself inside and into bed, her eye was caught by a movement on the next roof over, down on Maisie’s building. Frannie’s row house had the tallest façade on the block, but there were decorative windows in the brick to encourage proper air flow. She could easily see what occurred on all the other roofs, which was mostly nothing. She glanced over, hopeful that perhaps the last of her clever crows had found its way home, but the shadow was gone. Strange that anyone or anything else would be about on the roof, in the milky light of the moon. She waited a while longer until a yawn nearly cracked her jaw, then finally went inside and gave in to sleep.</p><p>When Thom arrived the next morning, Frannie was sweeping the shop for the third unnecessary time. His knock was soft, and the first rays of the sun barely painted him pink when she unlocked the door and shyly let him in. Thom was wearing a different skirt this time—a kilt, she reminded herself. Her curiosity had been piqued by their last conversation, and she had looked up Edinburgh in her atlas to brush up on what little she had been taught about Scotland. For a country that was bloody close, things up north were terribly strange, and men with bare knees were the least of it. Compared with the native creatures of his homeland, bludrats attacking his skin must have seemed but a minor inconvenience. He certainly didn’t seem concerned about his shocking state of undress.</p> <p>Clad all in grays and browns, he almost melded with the dreary stones and fug of London. His eyes were the lone bit of nature, warmly hazel. He grinned at her, and when he spoke, his voice was soft enough to keep from riling up the still-sleepy creatures.</p><p>“Ready to do some work, lass?”</p><p>“I am. Are you sure you don’t mind?”</p><p>In response, he shrugged amiably and scratched his chin. He looked remarkably awake and tidy for someone who’d been fighting fires all night, but she handed him her flask anyway.</p><p>“Bit early for whiskey, aye?” he said, but then he smelled it and murmured approvingly. “Coffee.” He sipped it. “With goat milk?” He drew back to look at her, and she smiled smugly.</p> <p>“I have my ways,” she said, enjoying his incredulity. For a quiet London lass in a dowdy tweed suit, she held quite a few secrets. As long as Thom never found his way to the roof, she didn’t have much to fear.</p><p>“I’ve brought a bit of wood and glass and my kit. Mind if I bring it into the shop before we head upstairs to assess the damage? Never seen a city with such sticky fingers. They’d steal the hoses off the truck, if we weren’t careful.”</p><p>He eased a cart through the door, careful of the old boards and wrapped bit of glass. Frannie locked the door behind him, an oddly intimate gesture in the dusky morning. It was even stranger when he followed her past the curtain and up the narrow steps to the upstairs hall and into her room. The last time a man had been in there, the ensuing kerfuffle had ended worse than badly.</p><p>Thom went first to the window, his brow furrowing as he ran a leather-gloved finger over the jagged, fire-darkened remains of the glass.</p><p>“I couldn’t really see the damage last night, but the Brigade didn’t do this. Did you break it trying to escape?”</p><p>Frannie came closer but didn’t reach out to touch the thick, wavy glass. It wasn’t the newer, thinner glass that one could easily see through, but had been original to the house, too heavy to let in anything but a token bit of light.</p> <p>“I didn’t touch the glass. There was smoke everywhere, and the curtains were on fire. I didn’t even look, really. But it would have taken a lot of force to do this much damage, correct? It’s as thick as my thumb!”</p><p>Thom looked out the window, mindful of the scorched shards as he scouted along the street below. Much to Frannie’s surprise, he dropped to his hands and knees and began to crawl around on the fire-blackened wood boards. She hadn’t installed her new curtains yet, and the light through the broken glass laid the room’s every fault bare. She was mortified when he stuck his head under the bed; surely the neglected dustbunnies were one step away from craving blood.</p><p>When Thom emerged holding a crude device of charred metal and fabric, Frannie was more confused and embarrassed than concerned. After all, she hadn’t moved her bed a single time in her entire life, and she hadn’t spent much time poking around under there, either. Having grown up with a mortal fear of bludrats, hanging about under a pitch-dark bed wasn’t something that interested her.</p><p>“Tell me, lass. D’ye have any enemies?”</p><p>“Not to my knowledge.” She had many secrets, but no one knew about them. And if anyone did, setting her home and shop on fire would have rendered them useless, anyway. “What is that thing?”</p><p>Thom stood, turning the object over in his dusty leather gloves. Although he held it easily in one large hand, when he gave it to her, she needed both hands to manage the size and weight of it.</p><p>“An incendiary device.” She cocked her head at him and raised an eyebrow, a trick she had picked up from the parrots. He moved closer, his arm brushing hers, to point at a blackened, pointy part. “Bit like a fire lighter. See, here, where the bit of slate strikes the flint? My best guess is that someone threw it through your window while it was on fire. That would explain why the flames were concentrated on the curtains, aye?”</p><p>Frannie handed it back to him, noting that for a fellow who seemed rustic and rough, his vocabulary was rather crisp. She stood before the window, the skin crawling on her neck as she thought about the only person who’d ever tried to hurt her. But this—this wasn’t his style. She was fairly certain it couldn’t be the neighbors, either. The building across the street was owned by a baker, and she knew the family well enough to be sure the device hadn’t originated there. In any case, the baker’s roof was sloped, not high and flat like her own.</p> <p>“It must have come from the street,” she said. “But why me? The shop’s worth nothing burned.”</p><p>He shrugged, his shoulders stretching the gray coat. “Plenty of arson in this city, most of it never explained to my satisfaction. Did you sleep here last night?”</p><p>She blushed and stared at the bed, which was stripped to an old, singed sheet over the striped mattress.</p><p>“Of course ye didn’t. Good. Ye never know when they’ll try again. I’ll speak to the local Copper, make sure someone patrols this street at night. Have you considered barring the windows? Or setting a clockwork to guard?”</p><p>“My family has been here for thirty years without a single problem. This part of town is still good.” Her glare dared him to disagree, but he only raised his eyebrows. “I’ve never felt unsafe before.” She swallowed, crossing her arms over her chest as she stared at the cold, charred incendiary device. Metal was so impersonal. “Not like this.”</p><p>Thom set the device down on her bed and stepped closer. His hand half-lifted from his side, but in the end, he didn’t touch her.</p><p>“You’re scared of something more than the fire, lass. What’s amiss?”</p><p>She hugged herself and tried to smile, although it didn’t quite reach her eyes.</p><p>“It doesn’t matter. It was a long time ago.”</p><p>“Was it that rakehell with the floofy shirt? Because I’ll turn his face into liver.”</p><p>She couldn’t help laughing, which surprised him. “He couldn’t hurt a fly, that one. Not my type, anyway. All bluster and no blood, as my father used to say.”</p><p>His eyes were crow-sharp, considering. “So you two . . . aren’t involved?”</p><p>“I took him in like a dying dog, and he’s paying me well to sleep in an empty room. That’s the depth of our involvement.” Looking up at him, she fluttered her eyelashes just a bit and said, “Why do you ask?”</p><p>He cleared his throat and stepped closer still. Frannie couldn’t help responding to his closeness, to the bulk of him and a warmer-than-warm radiance that made her think of the sun shining on the ocean. He smelled a little like heather and violets and salt, and she could tell the sea had suited him. As much as something about Casper pushed her away, something about Thom beckoned her closer.</p><p>She suddenly realized that she was focusing on his lips, barely parted, waiting for him to speak or kiss her or just keep breathing, near and warm and safe. It was possibly the first time in three years that she’d been close enough to touch a man and not wanted to bolt away and hide behind a locked door.</p><p>“Ye like what ye see?” he whispered, his voice teasing and deep, and she looked up quickly to find his eyes dancing with humor.</p><p>“I was waiting for you to answer the question,” she teased right back. “You were taking your time.”</p><p>“Aye, well, all the best things take a bit of time. Best not to rush into things. Ye never know what you’ll— Oh, hell.”</p><p>They’d been moving closer and closer all along, and he bridged the distance to kiss her, softly. His lips were warm and dry, settling firmly over hers as his hand splayed against her back to pull her closer. She stiffened, just a little, her nerves thrumming with forgotten sensation. He opened his mouth, his tongue seeking hers, and panic slammed into her heart. She gasped and bolted backward and tripped into his cart like a complete goose.</p><p>“I’m sorry, lass. I thought—”</p><p>But she was already downstairs, pulling a corgi pup into her lap and trying to remember how to breathe.</p><p>“I’ll just . . . take care of the window, aye?” he yelled from upstairs, and she nodded to the empty room.</p><p>Let him fix the window and the bed. Fixing Frannie was all but impossible.</p><p>7</p><p>Frannie went about her day in a muddle, running business as usual as the sounds of hammering and sawing drifted down the stairs. One of the parakeets had snagged a talon while lost in the streets, and catching it and touching the wound with iodine took the better part of the morning. Her thoughts churned all the while, trying to tease the present from the past, possibility from pain. She had known she was damaged, but she hadn’t known how very deeply the rot ran until the kiss that first thrilled her turned to torture. And poor Thom had looked so . . . hurt. Not that she had rejected him—that he had caused her pain. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She wasn’t ready to explain herself, so she did the next-best thing: she baked. In between customers, she bustled around the kitchen attached to the parlor, carefully cracking eggs and measuring out flour and sugar as her mother had always done when nervous, despite the pet shop’s ongoing agreement with the baker across the street. Around lunchtime, she flipped the sign on the door, locked it, and headed upstairs with a heavy tray.</p><p>Thom looked up as she stood in the doorway, a wobbling smile on her face.</p><p>“Hungry?” she said too brightly.</p> <p>He stilled to watch her, his gaze cautious but warm. “Verra, thanks.”</p><p>She was surprised that he hadn’t made more progress in five hours alone. She’d heard a little bit of sawing, a little bit of hammering, but the room was still dark, a curtain covering the window.</p><p>Wait. It was her new curtain, which she had left folded neatly on the table. Her bed was made, the corners neat. The bright blue floor had been swept, the charred wood and ashes removed. Good gracious, the man had put everything to rights!</p><p>“The bed is fixed,” he said softly, holding up the side of the blanket to show shining new wood where charred, ancient boards had been.</p><p>“My. You do work fast.” She set the tray on the now empty table and put up a hand to touch the curtain, but he grinned and gestured for her to move back.</p> <p>“Wait. The grand reveal.”</p><p>Careful to give her space, careful not to touch her again, he waited for her to step away before whipping the curtain aside. When she gasped this time, it was with happiness.</p><p>“Just a little something I found,” he said.</p><p>“So you’re a sailor, a firefighter, a handyman . . . and a miracle worker?”</p><p>“I get around.”</p><p>She put a finger to the dimpled glass. It was nothing special, as windows went. Two simple panes of thick glass, but clean and bright and thin enough to show her the world outside, which the old window had never done.</p> <p>Without Thom, she would have had to pay someone to board the window over with scavenged wood. It would have been months before she had saved up enough money to pay someone else to install the cheapest glass available.</p><p>“It doesn’t seem like words are enough, but thank you,” she said.</p><p>Although Thom seemed on the verge of stepping closer, he held himself away. She felt his eyes on her, careful and taking her measure. He had the same quiet, contained comfort she had cultivated when taming small birds. They were excitable, flighty, and untrusting, and they needed space, understanding, and time before they would step up onto her finger. Frannie smiled to herself. So she was more like a sparrow than she’d thought, then. And he was more patient than she had expected. She suddenly realized that she had to see him again.</p><p>“Do you like music?”</p><p>The question caught him off-guard, and he warily said, “I don’t dislike it.”</p><p>He glanced about the room, probably looking for a gramophone or some other modern contraption for enjoying music in the home—and forcing it on unwitting victims. But her bedroom was a small, tidy spot, and he’d seen everything but the closet, so far as she knew. She narrowed her eyes at the door, wondering. But if he had opened it, she’d have heard the squeal of the hinges, and he would have had a few choice questions for her by now.</p><p>“I’ve a box at the Vauxhall for Friday night and would appreciate an escort,” she began, and a small smile quirked his full lips.</p><p>“I’m not really the theater type, lass,” he said. “Big brute like me.” But he was teasing, and she knew it. And liked it.</p> <p>“I’m not, either. But if someone’s running about throwing incendiary devices through my window, I’d be glad to have my own personal brute in tow. For safety, you understand.”</p><p>The gleam in his eyes said he understood just fine, but he continued to play along. “Well, if it’s a public service, I can’t really say no, aye?”</p><p>“I knew I could count on your altruism. You seem amenable to helping a lady in need.”</p><p>“It’s no’ a habit, but I do make exceptions. And I doubt you’re helpless at all. Ye seem a very apt lass, to me. Running this place all alone, keeping up the creatures and sorting your own house. I was raised by just my mother, and she was worn ragged from the running of things. Ye do fine.”</p><p>She couldn’t help blushing. It was hard work, but she’d honestly never considered anything else. What else could she have done when Bertram passed? Her parents were gone in a horseless-carriage accident, and all her wider family were dour, religious folk who had never supported the idea of a pet shop. When she’d turned down her grandmother’s offer that Frannie move in and act as maid, companion, and cook, that was the last she’d heard of the humorless biddy. She’d let no one close enough to see the truth of her life, not in a long time. Except Maisie, but their relationship was based on wisdom disguised as grumbled complaints. And she never left her own courtyard, either.</p><p>“I don’t know how to thank you, Thom. Please let me know what I owe you for your work and materials.”</p><p>He glanced at the window, his mouth twisting. “I don’t think—”</p><p>“Just enjoy your lunch and send me a bill, aye?”</p><p>He grinned. “I’ll do that. Before the theater on Friday.”</p><p>Later that afternoon, an urchin arrived bearing a letter and a mynah bird in a rough wooden cage. In the wobbly, loopy hand of a man accustomed to being at sea, it read:</p><p>To: Miss Frannie Pleasance, Tamer of Beasts</p><p>Bill for: Acts of Altruism</p><p>Fee: One ticket to the theater</p><p>From: Thomas Maccallan, Finder of Lost Things</p><p>Frannie gave the courier a copper and tucked the note into her jacket pocket. She held her finger out, gratified when the mynah stepped up and ruffled its feathers. As soon as it was settled back in its usual cage, it said, “Naughty lad. Naughty lad, don’t eat that. She’s a pretty lass, no?”</p><p>She couldn’t stop smiling for the rest of the day.</p><p>The next morning, Casper swaggered down the stairs and into the pet shop, clearly not dressed for helping out with the muck. Then again, she hadn’t expected him to be, not after he’d overpaid her so generously.</p><p>“You’re all bright-eyed and bushy-tailed this morning, eh?”</p><p>He looked up with a winning grin. “It’s recently been brought to my attention that I can come across as a bit disreputable. I’m trying to clean up my act.”</p><p>“I’ll admit you look sharper without sick all over your shirt.”</p><p>He winced and brushed a few stray feathers off his slightly-too-fine jacket. “That was one unfortunate incident that I’m going to blame on a concussion. I’m a talented, self-supporting male in my prime. A star on the rise.”</p><p>“And a pet-shop assistant?”</p><p>He clutched his chest and rolled his eyes. “Anything to impress a lady fair.”</p><p>She rolled her eyes right back. “You’re not my type, lad.”</p><p>“I’ll keep trying.”</p><p>“Please don’t.”</p><p>She spun on her heel, and he put a hand on her arm as she passed. “Frannie, come on—”</p><p>Smacking his hand away, she balled her fists and turned on him. “Who do you think you are? With your grins and your pretty words and your money? Do you think you can buy me, Casper Sterling?”</p><p>The look of utter confusion and mortification on his face made her slightly less angry. “Buy you? God, no. I just . . . have kind of a crush on you.”</p><p>“A crush?” She snorted. “You’ve known me for three days, and most of that time, you were drunk or asleep. Just because I dragged you out of the gutter doesn’t mean you can grab me and start asking favors.”</p><p>“It’s not like that.”</p><p>“What’s it like, then?”</p><p>Casper walked to the counter, hopping up to sit on her ledger and receiving another death glare for his trouble. “Things just don’t seem to work in London the way they work elsewhere. How does a guy show polite interest in a nice girl here? I keep mucking it up.”</p><p>“I saw the rouge stains on your chest, lad. Something tells me you know exactly what you’re doing.”</p><p>It was his turn to snort and shake his head. “There’s a certain kind of woman who throws herself at me. I know how to handle that, but it’s never serious. It’s never real. This is the second time I’ve told a girl here I genuinely liked her, and she’s treated me like I’m a total ass.” He looked at his bare fingers with confusion. “Why do the good girls always say no?”</p><p>Frannie chuckled and sighed, punching him lightly on the arm in a sisterly fashion. “Saying no to fellows like you is what keeps us good girls good.”</p><p>“But what if I want to be good, too?”</p><p>She stood back to look him up and down.</p><p>He made a token fuss at his cravat, held his arms out wide, and smiled a winning, dimpled smile.</p><p>“You’re not good. You might want to be, but you’re reckless and foolish and smooth and sly. And any girl worth her salt will notice and run away.”</p><p>“Why?”</p><p>“Maybe you’re asking the wrong person.” She raised her eyebrows at him, and he looked down as if the answers were written on the floor.</p><p>As Frannie headed upstairs on an imaginary errand, she realized that she knew exactly what Casper’s problem was. He may have thought he wanted to be good, but he was a rake at heart. A dashing devil with a dimpled smile and a hunger for more than Frannie and her quiet life could provide. A girl knew the signs of a fellow who would always be looking over his shoulder for something new, once such a man had preyed upon her. If she let herself get attached to him, he would hurt her. So, as with most of the creatures in her pet shop, she wouldn’t even dream of getting attached.</p><p>8</p><p>Upstairs in her room, she pulled back the curtains a little more, glad for the light. The mirror proved that she was the same Frannie as ever, even if something about her had attracted two lads in the same week. She was a pretty lass, to be sure. But with a very busy job and the situation with Bertram, she hadn’t given much thought to finding love. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She had assumed that after what happened with Charles, she would never want to be within two feet of another man who wasn’t in the shop simply to buy a crow. But Thom was so very, very different. There was a bluff honesty about him that reminded her of a particularly loyal dog, and yet the way he looked at her, the way his breath sometimes caught around her—well, she felt it, too. There seemed nothing underhanded about him at all, as if everything to be seen was on the surface, all of it genuine. And she knew, deep down in her bones, that Casper was nothing but trouble. But she wasn’t ready to throw him out yet, not when he was putting such effort into getting his act together. And not when he was paying so very well. Every time she saw him, she saw Bertram, so filled with hope and promise. And yet always failing, despite his good intentions.</p><p>Looking down at the street below, she tried to imagine who had stood there, aiming an incendiary device at her window. A Copper strolled by, swinging his billy club, and although she didn’t approve of Coppers, she assumed his presence was at Thom’s request. A flash of color farther down the walk caught her eye, and she noticed two daimons glance at the Copper and scuttle nervously into an alley. Despite what she had told Thom, the daimons were spreading, and not all of them were as kind and harmless as Reve.</p><p>As much as Frannie hated to admit it, her daimon friend had been right about Casper being trouble, that was for sure now. And yet things had been good since he’d arrived, mostly because it had coincided with Thom. The tube of coins didn’t hurt, either, and she would have to write some letters and see about getting some more exotic beasts into the shop; the bigger or stranger the creature, the bigger her profit. Overall, despite the nagging irritation of Casper and the fire, she felt hopeful and giddy, a lightness of spirit she hadn’t known since Bertram’s passing.</p> <p>With a smile, she snapped one of the flowers out of the vase on the table and tucked it behind her ear. As she turned her head back and forth, admiring the small white rose, there was a knock on the pet-shop door. It was too early for customers, and she hurried downstairs, riddled with curiosity.</p><p>Casper had beaten her to the door and was holding a plain brown box tied with twine and punched at intervals with air holes. It was unmarked aside from the shop’s name and address, but there was nothing unusual in that. Several of her sources were a bit underground, and many of the creatures she carried weren’t commonly available—or, technically speaking, legal.</p><p>“What is it?” he asked, and she decided to indulge him. Bertram had always loved opening the boxes and seeing which strange new pets had arrived mysteriously from foreign climes.</p><p>She returned his grin. “Open it and see.”</p><p>Casper set the box on the counter. Quick as a child at a birthday party, he untied the twine, crumpled up the paper, and flipped open the lid. She almost laughed at his confusion.</p> <p>“A lumpy pillowcase?” He poked a finger into the box and jerked it back quickly with a shudder when the cloth writhed. Frannie knew well enough what it was and chuckled at his inborn fear. Many Londoners had never seen a single live snake before they visited Needful Creatures.</p><p>She leaned past him and plucked the bag out of the box, unwinding the string to dump the contents gently onto the scarred wooden counter that she’d played behind as a child. She snatched back her hand right before the coiled green serpent struck.</p><p>“Jesus Christ, what is that thing?” Casper stumbled back, too.</p><p>“A viper of some sort.” Frannie kept a fair distance as she admired the smooth green scales, slender face, and vicious fangs of the prettiest and deadliest snake she’d ever seen.</p><p>“What do we do about it?”</p><p>Frannie fetched one of the big, empty glass cylinders that housed her reptiles. She always had a few ready in back, and she also kept a forked stick to help get the more reluctant snakes into their new homes. The lazy pythons and boas never gave her much trouble, but this fellow . . .</p> <p>“Stand back. This could be messy.”</p><p>She placed the cylinder in just the right spot and swept the little snake into it with one smooth, confident swoop of her stick. It plunked angrily against the mossy bottom of the terrarium and struck the glass wall. Frannie set the snug-fitting mesh into the top of the cylinder and placed it on the counter. Venom dribbled down the glass, reminding her that the jewel-pretty creature within was more than a bracelet-sized treasure.</p><p>“Dang, girl. You’re fearless.”</p><p>“Animals can smell fear, you know. Just as women can smell desperation.”</p><p>With one raised eyebrow, she turned her attention to the snake’s packaging. There was no card within, which was unusual. No bill, no label, no indication whatsoever of the creature’s place of origin. Frannie’s boots clipped across the striped boards on the way to the door. When she opened it to peer up and down the street, she was surprised to see Thom headed for her at a determined pace, in trousers, suspenders, and work shirt, streaked all over with soot. His hair was sweaty and falling down from its tail, his cheeks red and his gloves singed around the edges. A bludrat darted for his leg, and he punted it back into the alley without slowing down.</p><p>Frannie’s heart nearly leaped out of her jacket. At first because Thom looked so competent and avid and focused on her. But then because she saw the badge gleaming on his chest. Surely he couldn’t be a Copper. And he had been inches away from her closet, alone in her room! Had he opened the door, and then the secret door? Was that why he was striding toward her, eyes snapping?</p><p>But no. That couldn’t be it. He was smiling.</p><p>She found her tongue and shouted, “Good heavens, Thom. Has something happened?”</p> <p>His eyes crinkled up, and she realized his agitation was of the positive sort. “Are ye free, lass? I’ve found one of your wee corbies, but he willna come to me.”</p><p>Her last crow! The creatures were altogether too clever, and she had despaired of finding the last of her big birds gone loose. When she turned back to face the shop, Casper was doing his best to look responsible, almost like a small boy hoping to please.</p><p>“Go on,” he said. “I can handle it here.”</p><p>“But you don’t know anything—”</p><p>He held up a small leather book. Modern Practices in Animal Husbandry was picked out in gold leaf on the cover. “I’ve been studying,” he said.</p><p>“Aren’t you supposed to be playing harpsichord for loose women?”</p><p>He grinned. “No until after dark, darlin’.”</p><p>She sighed and tried to hide her answering grin. “Fine. But don’t try to sell the kittens or puppies without me here. They go to approved homes only.”</p><p>He nodded solemnly. “Aye-aye, sir.”</p><p>“We have to hurry,” Thom urged, and she flipped the sign to “Open” and closed the door behind her.</p><p>It was a strange feeling, being out and about with the door unlocked and her not behind it. Such a thing hadn’t happened in years, and it made her feel both nervous and somehow liberated. She hadn’t seen the streets of London at this time of morning since Saint Ermenegilda’s Day, and she wished she had worn heavier boots. It had been drizzling recently, but then, it drizzled nearly constantly. Her long-dead great grandfather had told her stories when she was a little girl about how London had once been a bright, clean place with white walls and sparkling cobblestones and good-natured horses pulling jewel-toned carriages. Gazing at the gray pervading every surface and mirrored by the low, thick clouds, stepping in puddles of filth, it was a hard thing for Frannie to imagine.</p><p>Thom led her into a darker section of the city, and she hurried to keep up. She mostly kept to the well-lit, working-class areas, avoiding High Street and Darkside and the heart of the Daimon District. She got along with them fine and had never had a problem with any of Maisie’s lodgers, but the scent of magic made her more than a bit queasy. Frannie preferred her stolid London life and the creatures of the natural world, and although a baby dragon or roc chick or unicorn braid might pass through her hands, she never kept anything like that for any longer than she had to. The wee charm on the roof was the only magic she didn’t mind, and that was because it had been there for longer than she’d been alive.</p><p>There were plenty of areas of town she avoided, and it wasn’t long before she realized that Thom was leading her toward one of them, albeit using a circuitous route.</p><p>Hyde Park.</p><p>More specifically, Dueler’s Green.</p><p>Frannie froze, and Thom stopped to stare at her curiously.</p><p>“Goose stepped on your grave? Ye look as if ye’ve seen a ghost.”</p><p>“I’m sorry, but I can’t go . . . there. To Hyde Park.”</p><p>“It’s a goodly chunk of London, lass. And the crow is over just a bit, on a monument. I can see it from here, all puffed up and full of itself, aye?”</p><p>Frannie gulped for breath and wrung her hands, only then realizing that she’d worn her thick leather shop gloves onto the street, a great faux pas. She could indeed see the crow perched atop a low stone fence, preening for some children walking with their nanny and a great wolfhound that looked mildly familiar and had probably been kept in one of her bins as a pup. The exceedingly rich would pay a mint for the giant, short-lived creatures to guard their children from bludrats on the streets and bludbunnies along the seemingly idyllic greens of London’s only natural park.</p><p>She wanted that crow back. But more than that, she wanted to go home and have a good cry, now that she’d seen the green where Bertram had died.</p><p>Thom looked from her to the bird, concern and kindness written in the lines around his eyes. “If ye can’t get any closer, I’ll try to shoo it over to ye. It’ll come once it sees you, aye?”</p><p>She sniffled and nodded. “Most likely.”</p><p>“Stay here, then. We’ll get it somehow. If you’re all right?”</p><p>She nodded again but had run out of words.</p><p>He was clearly uncomfortable leaving her alone, but he was good enough to believe her. Walking a wide circle, he disappeared into the wild undergrowth that was, Frannie had heard, far less wild than elsewhere in the world. Not much grew in London unless one knew just the right secrets—which Frannie, luckily, did. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The bushes rustled just behind the crow, and it gave a loud squawk and flapped awkwardly to the ground. She had been worried about this bird in particular, as it preferred to roost in her rafters and leave white streaks down the other birds’ cages. For that reason, she kept one of its wings clipped, which meant that it couldn’t fly free and was in even more danger than the other released birds. It was amazing that it had lasted this long in a city as dangerous as London.</p><p>Thom burst onto the green, flapping his arms and shouting in a thick Scottish brogue, much like the one the mynah had used after spending the night in his care. The startled crow turned its head, screeched, and flopped ungracefully into the air, cartwheeling across the grass with Thom in hot, flappy pursuit. The wolfhound started barking, and the children started laughing, and before she knew what was happening, Frannie herself was chuckling, right there with her boot toes on the hated green of Hyde Park.</p><p>Just then, the crow must have finally spotted her. With a loud squawk of relief, it ran at her in an odd, hopping gait, wings outstretched and mouth open. She knelt with a broad smile and offered the arm of her worn tweed jacket. The creature leaped onto her, and she stood, stroking its ruffled feathers and murmuring about how handsome it was, despite its recent fall from dignity. Crows liked that sort of thing.</p> <p>Thom walked up at a more sedate pace, his cheeks still red from fighting fires all night . . . or from having flapped after a crow in London’s most popular park. As he passed the giggling little girls, he gave a silly bow, causing them to double over with laughter. Frannie was trying very hard not to laugh heartily herself. It took a big man to debase himself publicly for the sake of one rangy old crow.</p><p>The crow drew back just a bit as Thom approached, but the fireman was a lot less scary when upright and not hollering.</p><p>“You’re going to have to send me another bill,” Frannie said. “I’m getting to think you’re a hard man to repay.” She began to walk away from the Green, away from Hyde Park. Without questioning her, he took his place by her side.</p><p>“It’s been a long time since I made myself useful.” He pulled the tie out of his hair and shook it loose before putting it back in place, and Frannie’s stomach did a little flip. It was almost as if Thom had no idea of how handsome he was and, frankly, didn’t care, and that was worlds away from the sort of fellow she was used to.</p><p>“Not useful? But you fight fires. You’re the only thing that keeps this entire city from going up in flames!”</p> <p>He snorted. “To tell ye the truth, I don’t know if that’s so much a wish to be useful as a sort of self-destructive behavior with a silver lining.”</p><p>“And the badge?” She gestured at the copper pin on his suspender.</p><p>He waved a hand. “Eh, I investigate fires. It’s mostly an honorary title that involves doin’ more paperwork than the other lads. Workin’ with the Coppers isn’t my favorite thing to do, ye ken.”</p><p>Frannie breathed a tiny sigh to herself. She didn’t much like him having anything to say to the Coppers, but at least he wasn’t one of them. She barely stayed afloat as it was. If the Coppers ever found out about her secret, she’d lose everything. The crow must have noticed her attention wandering, as it squawked in her ear and flapped its wings.</p><p>“I know, I know. You’re a grand lad. Now, can it.”</p><p>She looked at Thom out of the corner of her eye as they walked the streets of London, him just the slightest bit behind her. It was a position of politeness that made her feel cared for but not overpowered. Had he draped an arm around her waist or slipped her hand onto his elbow, she would have bolted like a frightened finch. It was the sort of thing Casper would have done. But Thom’s presence, as it was, was comforting. No urchins plucked her sleeve, no dandies doffed a hat. She actually enjoyed the walk, despite the fact that her companion had gone silent and the crow was full of itself again and well aware of an audience. She would have to find it a proper magician, and fast.</p> <p>Back at the shop, Thom hurried ahead to open the door for her. When it wouldn’t open, Frannie was just as surprised as he was.</p><p>“That’s not right,” she muttered, checking that the “Open” sign was facing the street. She knocked, but Casper’s voice didn’t answer. She patted her pockets and sighed. “And I haven’t brought a key.”</p><p>Thom looked up the face of the building, as if he might scale it. “Is there a door on the roof?”</p><p>Frannie startled and shook her head a little too quickly. “Also locked, and higher than it looks. But we can go around back. I keep a hidden key.”</p><p>He raised an eyebrow but didn’t argue. She walked past Maisie’s lodging house and turned the corner after the recently closed haberdashery that was, so far as she knew, still empty. They kept the back alley swept out and as empty as possible to discourage bludrats, but something about the dark, closed-in passage always made Frannie uneasy. Thom moved just a little ahead of her without asking, and her heart rate slowed a bit—that is, until a dark form moved into the alley up ahead.</p><p>“Bonjour, darling,” a dusky voice called. “I was hoping you might stop by.”</p><p>The crow squawked on Frannie’s arm as Reve stepped languidly into sight, shades of ink and twilight rippling over the daimon’s skin as if she couldn’t decide whether to match the stone wall or the shadows.</p><p>“Hello, Reve, dear,” Frannie called, and Thom relaxed at her side.</p> <p>She set the crow on her shoulder, hoping it wouldn’t ruin anything, and turned her back to block her activity with wide skirts. After counting the correct number of bricks, she withdrew her hidden key, unlocked the door, and put the key back. Thom and Reve had turned away politely, keeping a natural distance from her and from each other.</p><p>“Do come in,” Frannie said, opening the door and gesturing into her warm, lamp lit kitchen. The crow squawked and flapped as Reve walked in, followed by Thom. “I’ll be just a moment.”</p><p>As Frannie passed through the parlor to deposit the creature in its usual cage, she noticed a hastily scrawled note on the counter. Written in pencil on the brown paper from the snake, was:</p><p>Sorry. Emergency. Had to go do business. Will pay you back. JCS.</p><p>She gave a huff of annoyance. What kind of emergencies afflicted musical prodigies? At least the fool had locked the door on his way out.</p><p>When she returned to the kitchen with an arm still achy from carrying the crow, she found the daimon and the Scotsman quietly watching each other. To Frannie, Reve looked like any other daimon, if more stylish. She was tall and slender, with dark hair worn always in a bun at her nape, and her skin changed colors to indicate her feelings. She had a long, prehensile tail, a trait all daimons shared, but Frannie didn’t really see it anymore. She had known Reve so long that the beautiful daimon was simply herself, and although Frannie had never asked which particular emotion Reve fed on, she knew it must have been something positive.</p><p>“Reve, this is Thom Maccallan, the firefighter who stopped the fire from destroying the house. Thom, this is Reve, one of Maisie’s lodgers next door and also a very talented seamstress.”</p><p>Reve smiled and gave a graceful, theatrical curtsy, and Tom nodded politely.</p><p>“He has never met a daimon before, I think,” Reve said with a coy smile.</p><p>“I’m afraid not,” Thom said. “Have ye come from Paris, then?”</p><p>As the conversation continued in pleasant tones, Frannie was gratified to see that Thom was well-mannered and curious. She’d seen so much prejudice when her customers met the occasional daimon leaving Maisie’s house. Frannie herself had grown up in a pet store that catered to all types, from the richest of Pinky lords to the most dashing of Bludman magicians to daimons of all shapes and colors. She had learned over the years that the color of one’s skin or the sharpness of one’s teeth had nothing to do with the warmth of one’s heart. Reve was one of her favorites and might have been a good friend, had Frannie had the wisdom to seek the daimon’s company.</p><p>“Why, that’s fantastic news. Congratulations!” Thom said, and Frannie turned to find Reve colored all over in pinks and fuchsia, a full-body blush of joy.</p><p>“What’s happened?”</p><p>“I shall be leasing ze haberdashery next door to Maisie’s. For my shop,” Reve said. “Monsieur Halifax will take ze upstairs for his clockmaking, and I’ll take ze downstairs, a showroom in front and a workroom in back.”</p><p>“What lovely news! Reve, darling, I’m so happy for you!” Frannie surprised herself by folding the daimon woman into a warm hug. Daimons were known for affecting less clothing, as Bludmen didn’t care for their blood, and it was strange to feel the heat of Reve’s arms against her own thick jacket. Reve wore mostly ruffled vests and tight breeches when not on the street, with a slit in back for her tail. The first time Frannie had seen daimons as a child, she had been frightened. But she knew that Reve’s reputation as a popular costumer would be a positive force for business. Frannie immediately began to think of what sort of pet she could offer as a shop-warming gift.</p><p>“Was there another reason you stopped by? I’m terribly happy for you, dear, but it’s not often I find you in the alley.”</p><p>Reve looked down, her long fingers rippling over in a cacophony of colors that made Frannie a little dizzy.</p><p>“Your lodger. The musician. ’E is here?”</p><p>“Called away on emergency, or so his note said. Why?”</p><p>“He is trouble,” Reve said simply, her eyebrows raised in entreaty.</p><p>“Maisie mentioned that. Trouble how?”</p><p>“I get zis feeling.” She shrugged, green and pink rippling over her arms and the triangle of throat above her ruffled vest. “ ’E has a good heart, but zere is something below, something dark. There is more than wine in his flask. Zey say that artistic genius is just a shade of madness, you know. He’s no good for you, of that I am sure.”</p><p>Thom cleared his throat, and Frannie looked down, pulling at a loose string on her sleeve. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He wasn’t under consideration,” Frannie said, very proper. “Just another lost thing taken in. Someone had bludgeoned him, for goodness sake. And he looks . . .”</p><p>“So much like Bertram. But ’e isn’t Bertram, ma chère. You must let it go.”</p><p>Reve’s hand was light on her back as Thom took a step forward. “Is she in danger, then?” he asked softly.</p> <p>Reve gave a graceful shrug. “Who can say what the future holds? I am not, as zey say, that sort of daimon. But when he is here, the air tastes of pepper, of a sneeze waiting to happen at ze most inconvenient time. Frannie’s world is normally sweet and warm, like baking bread.” She cocked her head at him, closing her eyes to inhale. “Oh, la. And zis one smells of salt and butter.”</p><p>“Tea, anyone?” Frannie squeaked upon seeing the thoughtful, pleased smile on Thom’s lips.</p><p>“Tea would be lovely,” Reve said, her skin shivering over in a clear, pale green as her dark eyes went dreamy. “Bertram was a bit like tea with ginger biscuits. But his friend who was always about at the end, he was like absinthe. Like something that makes you forget, and then you never forget. What was his name?”</p><p>“Charles,” Frannie murmured without thinking, because she was lost in her memories, spurred on by Reve’s musings. The daimon was right. Charles had been very much like absinthe—heady, dizzying, overpowering, and then one woke up empty and alone. Or one never awoke at all.</p><p>“Frannie? Lass, are ye well?”</p> <p>Thom’s hand on her arm brought her back to the present. She caught her breath and looked madly around the kitchen, trying to ground herself in the little paradise she’d made of her home and shop.</p><p>“I need a moment. Reve, will you excuse me?”</p><p>Reve nodded, her skin going a warm blue that felt like an apology. Thom nodded, too, but looked very much as if he wanted to follow her through the parlor and back into the closed-up shop.</p><p>Everything was where it belonged. Everything was as it should be. And yet she was deeply unsettled. She walked slowly along the wall of cages, trailing a gloved hand over the bars and setting them to sway lightly in her wake. The little bright birds hopped about, the larger ones eyeing her curiously.</p><p>“Crackers, miss,” said an old gray parrot, which she ignored.</p><p>The puppies were all asleep in their bin, the kittens batting about a long feather that looked as if it could have come from one of Casper’s fancier hats. She almost panicked when she realized that one of the kittens was missing, before remembering that Filbert was probably asleep on her rug, where she’d left him that morning, safe in her room with fresh food and a box of sand. Approaching the glass jar on the counter warily, she noted that the green snake was wound up perfectly like a rope, its head resting on its back, its eyes wide open and as shiny as buttons painted with poison.</p> <p>She’d all but locked herself up, after what happened with Charles and Bertram. She’d sent her assistant away, trimmed the shop hours, and made it so that everything could be done by herself, alone. Even if one of her strays had bitten her back, and a human one at that, she didn’t stop throwing herself into the lost creatures that found their way to her doorstep—Charles couldn’t kill that part of her.</p><p>Having lost one future, she hadn’t let herself get her hopes up again, only to have them destroyed. But now, looking at the old parrot’s patchy feathers and noting the places where the bricks needed repainting, she finally let the weight of her world go, for just a moment. Growing old among other people’s pets was a lonely sort of comfort. A cowardly sort of comfort.</p><p>She flicked the glass in front of the snake’s face.</p><p>She wasn’t a cowardly sort of girl.</p><p>And so, when Thom came through the door, carefully carrying a teacup and saucer dwarfed by his large hands, she reached up to peck him on the cheek.</p><p>A smile bloomed over his face, and he asked, “What was that for?”</p><p>“The tea, of course.”</p><p>“I hope it’s good tea, then.”</p> <p>“It will be.”</p><p>9</p><p>Thom left soon after that. After a yawn that cracked his jaw, Frannie insisted on it.</p><p>“We can’t have you falling asleep at the hose,” Frannie said, and he reluctantly agreed, leaving her with a belly full of her favorite tea and work to do.</p><p>She was helping a shady-looking daimon choose between two crows when the bell over the door rang. Casper strolled into the room with an armful of hothouse flowers, looking like a million coppers. With a dazzling smile on his face and perfectly tumbled hair, he pulled up a stool and laid the ribbon-tied bouquet of roses on the counter. Frannie could feel his gaze, and if she had been a bird, her feathers would have ruffled. The nerve of the man, to stare at her like a piece of meat while she was doing business, and after she had already told him off!</p><p>After convincing her customer that the most recently returned crow would make an excellent familiar, she accepted his payment and tucked it into her bodice. The crow squawked indignantly as the daimon carried out its swinging cage, and Frannie turned to narrow her eyes at the sharply dressed fellow posing by the green snake in the jar.</p><p>“Your emergency was flowers?”</p><p>His blue eyes smoldered, dancing with flames that heated her cheeks. “Let’s just say it was a bad day for my condition. I got what I needed, and I’m fine now. The flowers are the apology. For the emergency.”</p><p>“You can’t charm your way out of everything, you know.”</p><p>He sauntered over, his eyes keen and his mouth curved up with a confident smile. “I might surprise you.”</p><p>The look of disdain she threw at him would have frozen and shattered a man with less ego. But not Casper. He stepped a little too close, close enough for her to smell an undercurrent of red wine and expensive scent; the unfamiliar combination left her half intrigued and half sick, and she took a step back.</p><p>“Speaking of which, I’m looking forward to seeing you Friday night,” he said, giving her his best dimpled smile and ignoring her obvious discomfort. “It should be the finest box in the house.”</p><p>Frannie grimaced. “Wait—you’ll be in the box? I thought you’d be onstage. Isn’t that how it typically works?”</p><p>He barely brushed her sleeve on his way to the desk, and she drew back her arm, overwhelmed by the strange signals her brain was sending. Her lodger had an undeniable animal attraction and knew how to use his words and his body to best effect. But, as Reve had said, something was wrong underneath the surface. And she still couldn’t look at him without seeing Bertram.</p><p>“I’ll be onstage for the first half, for the harpsichord dueling. And I expect I’ll win and spend the second half onstage as well. But I have something planned for the intermission. Celebratory champagne, cheese, imported oysters. Have any favorites?” He raised his eyebrows and cocked his head invitingly.</p><p>Panicking, Frannie turned away. When she’d found him on the street, half dead, she hadn’t expected to keep him alive, much less around. Normally, she could shut down a cad with a few sharp words, but there was something honest and sweet about Casper, despite his vanity and pride and the danger lurking underneath. She had the idea that he really, truly did hope to win her over, even if he was going about it all wrong and didn’t have a Bludman’s chance in the sea.</p><p>“I didn’t know it was like that. I invited someone else along,” she said quietly.</p><p>Casper half laughed, half choked.</p><p>“That grizzly bear of a fireman? You invited him to share the Maestro’s box at the Vauxhall Theater? I mean, you know the Magistrate will be there, right? I was going to introduce you to him.”</p><p>“Casper, I’ve told you from the start that I . . . I’m not . . . that is . . .”</p><p>“I’m not your type, huh? You don’t like fantastically rich guys on the verge of being appointed to the London Opera?”</p><p>“It’s not that.”</p><p>“Is it because I was covered in puke the first time you saw me?”</p><p>“Don’t be ridiculous. You were concussed.”</p><p>He looked down, and his hair fell over his face. Pushing it back, he gazed into her eyes.</p><p>Accustomed to animals as she was, she could see something wounded and dangerous, deep in his heart.</p><p>“Is it because of what I am, because of what’s happening to me?”</p><p>“What do you mean?”</p><p>He chuckled ruefully and rubbed a glove over his stubbled jaw. “No, of course not. How could you know? No one does.”</p><p>He looked so hangdog that her heart went out to him. She bridged the gap between them, one hand on his brushed-velvet sleeve. “Don’t take it personal, eh? You’re a fancy lad, and I’m just a regular ol’ London shopkeep with grit in her shoes and dog treats in her pockets. What do you want with me, anyway?”</p><p>He stared at her hand, at the stained and nearly shredded leather glove that no girl in her right mind would wear out on the town. “The day you found me, you were like an angel. The sun here is so weak I can barely feel it on my skin. But it lit up behind you like a halo. Your smile was so warm, and you smelled like warm milk and puppies and the right kind of cookies. All the women I’ve met here are these empty, grabbing harpies. They want money and jewels and riches. They want to claw their way to the top. But you just want to take care of things. That’s very attractive.”</p><p>He was still staring at her glove, so she lightly patted his cheek. “I take it you’ve read Sagacity and Susceptibility?”</p><p>“Sort of.” A strange twinkle in his eye confirmed it, though.</p><p>“When Maryann twisted her ankle, she preferred Mr. Willowbee’s wild bouquet to the Colonel’s hothouse roses, did she not?”</p><p>His mouth twisted up in wariness. “She did.”</p><p>“And later, what happened to the Colonel?”</p><p>Casper looked confused. “Something different from what I remember, probably.”</p><p>“He hung himself in sadness after Willowbee and Maryann eloped.” She shook her head sadly. “Don’t try so hard, eh?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So you’re still bringing the fireman?”</p><p>“If I do, are you going to hang yourself?”</p><p>He snorted a laugh, which made him look five years younger and a hundred times more attractive. For just a moment, Frannie tried to picture what her life would be like if she opened her heart to Casper and his high-flying world. Parties, fashionable dresses, glasses of champagne, the finest horseless carriages, and gloves made of actual silk. She could see herself, laughing, sparkling, being adored. Like a princess.</p> <p>The image terrified her. Might as well put a crow in a bonnet and ask it to sing.</p><p>“Suicide? No. I favor longer, less dramatic methods of self-sabotage, darlin’. Enjoy the flowers. See you tomorrow night, and your little fireman, too.”</p><p>He gave her a last, long, smoldering look that told her plainly enough that he wasn’t giving up, and what’s more, he had something up his sleeve.</p><p>Fine. Let him play at courting. She might laugh, but as a savior of lost things, she sensed the recklessness within him. Reve was right. Casper was bad news—to himself, if no one else.</p><p>Frannie closed up shop early on Friday night. She’d gotten in a new shipment of parrots, and they were all crowded together in a traveling cage like old biddies on a train, frightened of foreigners. By the time they were all fed and soothed, she didn’t have the energy left to sell canaries to miners and parakeets to carriage drivers. As she flipped the sign to “Closed,” she realized that her hours had been more sporadic in the last week than in all of the previous year combined, and she didn’t know whether this was good or bad. She also had hope for the first time and a reason to wake up in the morning besides keeping the kittens alive. And she couldn’t deny, even to herself, that the pleasant flips in her stomach whenever Thom walked through the door weren’t something she was willing to give up just for the sake of regular work hours.</p> <p>She had decided to live a quiet, comfortable, safe life. Whether she had been punishing herself for what had happened to Bertram or hiding from the future, she didn’t know. But excitement held a new appeal, now that she’d tasted it.</p><p>Her stomach felt fizzy with anticipation as she skipped upstairs to her room. The dress was there on its form, pressed and fluffed to the best of her ability. She decided right then that she would need to talk with Reve about her wardrobe, as the solid, serviceable tweed she’d inherited had begun to feel less like a comfort and more like a cage. She would never be an ornamental sort of girl, but at the very least, she could be presentable. Maybe Thom wouldn’t notice. Then again, maybe he would.</p><p>Button by button, she shucked off the tweed until she stood in just her petticoats and corset, once white but now faded to the color of cold tea. Ignoring the chill in her heart, she sought the full-length mirror in Bertram’s old room and dragged it into her own bedroom, settling it in the light of the new window. Standing before it, she took stock of herself for the first time in several years.</p><p>When Charles had first started hanging around with Bertram—that was when she had learned to curl her hair with tongs and tighten the middle bit of her corset on purpose. She had giggled with Reve and some of Maisie’s other girls, taking tips from the more worldly Parisian daimons on how to catch the eye of the debonair but ne’er-do-well Franchian lad with the curled mustache and high top hats. And caught his eye she had.</p><p>Look how that had turned out.</p><p>She shook her head. Things were different now. Not every man was Charles. Thank heavens.</p> <p>As she passed in front of the window, the sunset stained her with a rainbow of light, and she smiled. She looked like a scarlet macaw for just a moment there, but even her fine new gown would make her more of a raven than a parrot. After carefully unbuttoning the skirt from her dress form, she stepped into it and admired the slick slide of taffeta up her stockings. The tweed kept her arms safe from avian talons, but it didn’t feel pretty, didn’t slither over her skin like the inky indigo of the unworn but long-kept dress.</p><p>The new style was different, too, with a separate skirt and bodice, which made it much easier to get dressed on one’s own. The last time she had preened, she’d missed her mother’s patient hands. And she missed her still, of course. But left all alone with herself and her shop, she was the captain of her ship, and there were certain perks to that. For example, her mother would have insisted that she wear her hair up tonight in a quiet chignon befitting a merchant lass. Instead, she made one long braid in the Franchian style, the tail falling over her shoulder. She could only hope that Casper wouldn’t make good on his promise about meeting the Magistrate. The farther Frannie flew under official notice, the better.</p><p>Thom’s knock was so tentative that she barely heard it, despite the fact that she was waiting for it. She smoothed her hair behind her ears once more and lifted her skirt to keep it from the dust of the shop. Thinking of the snake incident, she checked the peek hole to make sure it was him. She smiled when she saw him brushing the top of his hat, a move she had also employed earlier in the evening upon finding spider webs in her old bonnet.</p><p>With a deep breath, she opened the door. She only worried for a moment about how he would see her, as she was utterly arrested to see him wearing another kilt, albeit a dark and sober one pinned neatly and topped by a soft white bag with long tails. It was strange, to be sure, but she couldn’t imagine any other costume that would suit him more. The deep navy jacket fit snugly, showing the breadth of his shoulders, a gray vest peeking out underneath. Even his stockings looked tidy and formal, and his boots were neatly polished.</p><p>“What a beautiful wee thing you are,” he said softly, and she felt herself flush with pleasure.</p><p>“You cut a fine figure yourself.”</p><p>“I hope ye don’t mind the kilt.” He looked down self-consciously. “I haven’t any fine trousers, and I haven’t worn this kilt in years, but it’s the best I could do. I know I’m not verra dashing, but . . .”</p><p>“Hush, now. I’m smiling, aren’t I?”</p> <p>He looked up and mirrored her grin. “That ye are, lass. At least, I washed the soot out of my hair, eh? Now, shall I call a conveyance, or would ye care to walk?”</p><p>“Let’s walk, please,” she answered quickly. The last time she’d been in a conveyance of any sort was on the way to Bertram’s funeral, riding beside his casket.</p><p>As she locked the door on the way out, Frannie couldn’t help seeing the world in a new light. Just as the new window changed her room completely, so did the lens of a new dress and a sturdy arm under her glove change her outlook on the only city she’d ever known. The beggars, the buskers, the Coppers on their frothing bludmares, the wrappy sellers with their steaming carts. There was a certain picturesque beauty there. Usually, she hurried from place to place, trying to avoid anyone’s notice. Even before Charles, she hadn’t been a showy thing, which was maybe why she had been so bewitched by his exotic, debonair ways. For a brief period of time, he had shown her the world. And then he’d torn it all down.</p><p>“So what are we seeing?” Thom asked, grinning down at her.</p><p>“My mother always told me that the fun part of shows was seeing people and being seen.”</p><p>She felt his laugh through his arm, a warm rumble in his chest. “It’s that bad, is it?”</p><p>Frannie sighed. “It’s my lodger. The fellow in the frilly shirt.”</p><p>“He’s a clown, is he?”</p><p>They hit High Street, which was filled with bodies and conveyances, all fighting toward a tall building dramatically lit by gaslights. The marquee shone like the sun in the darkness, the calligraphed words still wet from the artist’s foot-wide brush:</p><p>TONIGHT ONLY! MAESTRO CASPER STERLING</p><p>And underneath, in much smaller letters:</p><p>Vs. Edwin Kind, a Duel by Piano.</p><p>A paper drawing of Casper rippled lightly in the wind, the cocky grin and dimples ten times larger than life.</p><p>“He’s apparently rather famous,” Frannie said weakly.</p><p>Thom made a noise deep in his throat. “I never trust a man in a frilly shirt” was all he said.</p><p>10</p><p>The plush velvet was almost too soft, the lights far too warm—at least, until they dimmed. The box went dark until Frannie could see nothing but the stage just below, almost close enough for her to jump down. Or to take a rose, had the star musician attempted to hand her one of the many thrown by the adoring crowd. She shuddered at the thought and hoped Casper was self-involved enough never to consider it.</p><p>He had promised her the best seat in the house, and now that she was there, she would have preferred to be anywhere else, even down below in the pit, where whores and chimney sweeps shouldered one another cheerfully, with toothless smiles and spoiled cabbages in hand.</p><p>Thom shifted beside her as if he, too, couldn’t get comfortable in the squishy seats. Whenever she looked at him nervously, he smiled in reassurance, but it was clear that they didn’t belong there, in the posh box made for men like the Magistrate or maybe like the queenly dame in the hoop skirts directly opposite them, who couldn’t put down her opera glasses or make her mouth turn up at the corners. Still, Frannie was all too aware of the kilt-clad knee mere inches away from hers and the broad hand on the armrest, fidgeting in a new kidskin glove.</p><p>After a few moments of near darkness, Frannie’s lodger appeared in a spotlight, standing tall before the newfangled sort of harpsichord she’d heard of but never seen in person. A piano, they called it, and a very grand one indeed, all shiny black and dramatically curved. Clad in a royal-blue coat spangled with gold stars, Casper bowed, and the crowd went mad. Looking down, Frannie saw women of all castes fanning themselves and reaching for him. But Casper looked up at her, just her, and winked. She understood the words he mouthed at her, even if she couldn’t hear them over the screams.</p><p>“I told you so.”</p><p>His spotlight winked out suddenly, bathing the room in darkness pierced only by the most expensive sort of opera glasses. The screeching stopped, replaced by whispers and one long, slow hiss like an uneasy snake. The spotlight lit the other side of the stage, falling on an identical piano and a man who seemed a joke in comparison with Casper. Where Casper was tall, broad-shouldered, gorgeous, and perfectly put together, this fellow was short, spindly, and ungainly, despite his fine gold-trimmed suit. His attempted smile seemed a crooked sneer. The crowd booed, and a single cabbage exploded against the second piano, a bit of filth splattering the man’s mauve coat before the light winked out again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Beside her, Thom tensed and sighed the long, slow sigh of a man attempting patience where none was deserved. She shouldn’t have brought him. And yet to be alone in this darkness, surrounded by strangers and velvet and gold—she couldn’t have borne it alone. Before she could reach over to touch his hand and make a small apology in the private sphere of the shadowed box, Casper’s spotlight flared into life again, casting him and his piano in a fierce light. He sat on the stool like a god, his long fingers bare and poised over the stark keyboard, and she realized she was holding her breath right along with the rest of the crowd, with the rabble and dukes and Coppers alike, waiting to be transported.</p><p>When he finally touched the keys after that masterful pause, the room filled with the perfect note, drawn out and commanding the very air. The song began, slow but rich and strong and saturated with purpose. It was several moments before Frannie remembered to breathe. She soon forgot again, hearing the miracle of his music. No wonder they called him Maestro.</p><p>The song he played was familiar yet utterly transfigured. Casper hunched over the keys, his every muscle tense, a look of profound joy on his face as his fingers coaxed magic from the piano almost too fast for Frannie’s eyes to follow. Although it began simply, the song grew more and more complex as Casper built upon the melody, adding trills and crashes as the tempo sped up. Frannie found herself on the edge of her seat, her teeth set firmly in the cloth of her glove as if awaiting some transformative moment that never came. When the song finally hit its crescendo, she wiped tears from the corners of her eyes and felt pleased that she hadn’t worn paint. Beside her, Thom sighed and settled back.</p> <p>“Bugger, he’s good.”</p><p>She chuckled. “Bugger, indeed.”</p><p>After a studied pause, Casper rose and bowed to the audience, his hair flipping forward. The response was thunderous, loving, frenetic to the point of madness. As the brightly dressed bodies in the pit below surged toward the stage, the women struggling to clamber onto the boards in their long skirts, Frannie glanced around the theater, relieved to see no one who reminded her of Charles, much less the wastrel himself. She was startled when the lights went out, until she remembered that Casper wasn’t the only player.</p><p>When the spotlight went up again, the man hunched over the other piano stared out at the audience with narrow, haughty eyes. His fingers hovered over the keys, not with Casper’s teasing showmanship but with an expectant, measuring glare, as if he found the audience wanting and wished to punish them. He played the same song Casper had, beginning with the basic tune and adding his own frills. And although even Frannie’s amateur ears could tell it was technically quite good, there was something lacking. Spirit, fire, passion, joy. The man played as if he was angry at the piano and wished to strike it, again and again.</p><p>A low hum began in the pit as the crowd whispered and shook their heads. The pianist played faster, his top hat falling off as he lurched over the keys and his mauve coat flashing in the light. He was balding, and the top of his head was pink and moist with sweat. The man had barely missed being smacked in the face by the first moldy tomato when a melody sprang up in the darkness on the other half of the stage. It wasn’t the same song, but it somehow struck the perfect counterpoint.</p> <p>The pianist played harder, angrily, cocking his head toward Casper’s piano. As the music from the shadows grew louder and more insistent, the crowd in the pit whispered and chuckled the way Frannie’s birds did when she brought out a bit of fruit and began to hand it around. As if they had a taste of something good and wanted more.</p><p>“It is my turn, sir!” the man shouted over his shoulder at the darkness hiding Casper’s piano.</p><p>“Is it? I thought this was a duel.”</p><p>The spotlight burst onto Casper, who had removed his jacket. The intimacy of his open shirt made it seem as if he were all alone in the world instead of displayed onstage before thousands of London’s richest and poorest spectators. The grin on his face told Frannie that he enjoyed enraging the other musician as much as he enjoyed playing.</p><p>With a growl of frustration, the pianist in the mauve jacket abruptly changed the song to something Frannie had never heard before. Casper’s fingers froze above the keyboard, his head cocked and his eyes turned skyward as if seeking answers there.</p><p>“Is that new?” Casper called.</p> <p>“Just wrote it.”</p><p>“I bet I can guess how it ends.”</p><p>With a fierce laugh, Casper began playing the exact notes as the other pianist but, somehow, better. They played the song in near-perfect accordance, except that every now and then, Casper struck a chord or added a trill that improved the song markedly. The man in the mauve coat played faster, and even Frannie could tell when he hit the wrong key.</p><p>“You’ve been in my rooms, Sterling. You’ve tossed my drawers, damn you!”</p><p>“From what I hear, no one’s been in your drawers, Edwin.”</p><p>The pit roared and began to chant, “Maestro! Maestro! Maestro!”</p><p>The man in the mauve coat faltered again, and Frannie sat forward in her seat. After the next wrong note, he stood so violently that his bench fell over backward. Slamming his fist down on the keys, the man spun and stepped to the edge of his spotlight, halting just before the dark swatch of stage separating his piano and the one that Casper still played, finishing the song with a masterly flourish.</p><p>Casper stood, smirking and tall, not even out of breath. They faced each other, a strip of darkness between them. The crowd’s chant grew as they surged forward, arms grasping for Casper.</p> <p>“Maestro! Maestro! Maestro!”</p><p>Casper turned to the crowd and put one finger to his lips. The pit quieted to an unruly whisper. Frannie leaned forward in her seat, fascinated by the animal energy in the air.</p><p>The man’s voice rang out in the silence, his frustration and fury echoing off the boxes. “You promised me a fair trial, Sterling.”</p><p>“I promised you a duel.”</p><p>“Stealing my compositions is low, even for you!”</p><p>“I’ve stolen nothing, Edwin.”</p><p>Someone in the crowd shouted, “You tell ’im, Maestro!” and an egg exploded against the mauve jacket and slid down the man’s breeches to land on his buckled shoe.</p><p>Shaking his head as if trying to rid himself of a fly, the man crossed the darkness and stood, bare inches away from Casper, who, to his credit, didn’t flinch.</p><p>“Where’d you learn that song, then? No one’s ever heard it. It’s locked up in my home. Where’d you learn it, you lying chit?”</p><p>Casper cocked his head, giving the crowd a wink and a flash of dimples. “I heard it in a dream.”</p><p>The pit erupted in laughter and cheers, and Casper bowed, first to the crowd and then, with a saucy flourish, to the man in the mauve jacket.</p><p>“Maestro! Maestro! Maestro!”</p><p>It was a mercy when the smaller man finally stalked offstage, a hail of eggs in his wake.</p><p>“Would you like to hear more?” Casper called, one hand cupped to his ear, and the crowd’s answering “Hurrah!” made him throw back his head and laugh.</p><p>“I think I’ve heard enough,” Thom grumbled, shifting in his seat as if his kilt itched him horribly.</p><p>Casper sat down at his bench, turning back the cuffs on his shirt. The spotlight on the other piano winked out, leaving only the Maestro and his instrument and a dazzling smile. He cracked his fingers one by one and began to play a song that made Frannie’s heart thunder against her corset. It wasn’t fair, that one man should be so beautiful and charming and have such otherworldly skill. For just a moment, she longed to discover if he could master a woman’s body as perfectly as he played.</p><p>“Just let’s hear the end of this song,” Frannie murmured, her hand moving to cover Thom’s as her betraying eyes stubbornly clung to Casper.</p><p>“If we—”</p><p>Thom stopped in mid-sentence, and Frannie tried to turn to him and discover what was wrong. But she couldn’t move. The fashionably poofed sleeve of her jacket was pinned to her seat by an arrow. She was slightly confused and just stared at it for a moment before Thom shoved her to the ground with an angry rip of indigo taffeta. He landed on top of her, breathing hard as her heart leaped into her throat and her fingers and toes went numb in fear. Casper’s song played on, not slipping a single note, as Frannie put one glove to the bare shoulder exposed by the arrow’s tear.</p><p>11</p><p>“Are ye hurt, lass?” It came as a whisper.</p><p>“You . . . you say that a lot.”</p><p>“Are you?” More forcefully this time.</p><p>“Only by your weight, I think. Was that . . . ?”</p><p>“Aye, a bolt from a small crossbow. It didn’t catch your skin?”</p><p>She shook her head, or tried to. Her hat and tight jacket made it difficult, sprawled under Thom as she was.</p><p>“Only my jacket.”</p><p>“Thank the gods.”</p><p>They lay there for a moment, long enough for her to notice the rise and fall of his chest and the woodsy scent that rose from his skin, reminding her a little of the heady, smoky Scotch that Bertram had sometimes stolen from their father’s liquor cabinet. She’d poured it all down the loo, after their parents’ funeral, just to be sure her brother’s recklessness didn’t get out of hand. Frannie didn’t hear any more arrows, but then again, she hadn’t heard the first one, thanks to Casper’s playing and the shouts of the rabble.</p><p>“Is it safe?”</p><p>“I don’t know anymore, lass. You’re having a run of awfully bad luck. And you’re shivering like a wee pup in the night. Scared a bit?”</p><p>“A bit.”</p><p>“Can ye wait here, on the floor, while I fetch the Coppers?”</p><p>Frannie gasped. “No Coppers.”</p><p>He let out a contemplative breath, going still. “Escape it is, then.”</p><p>Casper’s song ended with a crescendo, and the lights went up, nearly blinding Frannie. The crowd went mad with shouting and stamping and clapping and whistling. Thom gently climbed off of her, leaving her exposed and cold with dread. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Come, lass. We need the cover of the crowd.” He began to crawl toward the back of the box on his elbows and knees, and Frannie rolled over to follow, her long skirts twisting and catching beneath her knees. Thom met her in the shadows behind the rows of seats and helped drag her farther back before reaching up with a small knife to slice the cord holding the privacy curtain. Once it fell, he stood to help her up in the complete darkness behind the fall of burgundy velvet.</p><p>Her knees wobbled, but he steadied her, one hand on each arm. The knife had disappeared as quickly as it had appeared, and she realized that she knew very little about Thom, outside of his altruistic profession and his kindness. She took deep breaths, trying to force herself into calm or at least sharpen her senses.</p><p>“The pet shop’s made of stone, aye?”</p> <p>It caught her by surprise, and she had to think for a moment. “On the outside, yes. There’s wood on the inside in places.”</p><p>“Then it’s safer than the fire station. Can ye walk, or must I carry you?”</p><p>“I’ll let you know.”</p><p>He stifled a chuckle and took her hand.</p><p>Thom opened the door just a crack, and the sound of voices and the smell of overly warm bodies assailed them. Cold dread sneaked down Frannie’s neck, and she held back from the bright light beyond the door. The person with the crossbow could be out there. Thom tugged her hand, but she didn’t move.</p> <p>“Don’t worry, lass. I’ve got you.”</p><p>He took off his jacket and slung it over the ripped shoulder of her dress. Much to her surprise, he reached under her knees to sling her up tight against his chest.</p><p>“Tilt your hat down,” he whispered, and she obeyed, letting the deep brim cover her face.</p><p>With his arms wrapped firmly around her, he shouldered open the door and plunged into the crowd. She tucked her head against his chest and squeezed her eyes shut. If an arrow was going to come for her, she wouldn’t be able to stop it, and she didn’t want to see it. Thom elbowed his way roughly through the crush of bodies, a trail of gasps and whispers in his wake.</p><p>“Must have fainted.”</p><p>“Perhaps an invalid?”</p> <p>“Told you the Maestro makes all the ladies swoon, mate.”</p><p>She curled more tightly against Thom, her face crushed against the linen of his white shirt. His chest was hard underneath it—it would have to be, the way he wore his heavy fireman’s rig and hefted hoses and ladders about. In his arms, she felt safe and nigh invulnerable, his broad strides tearing a swath through the hall, down the stairs, and across the lobby, where his boots rang loudly against the marble as the first men from the pit dashed outside for a smoke.</p><p>It was a relief when he shoved through the door and into the night. The clammy kiss of London’s air brushed her cheek, and Frannie dared a look around. Thom was nearly running but not out of breath, carrying her with grim determination and stolid strength on the shortest path from the Vauxhall to the pet shop.</p><p>“Ye can relax a bit, dove,” he murmured. “Whoever was aiming for ye will be behind us now.”</p><p>“But that means they would hit you.”</p><p>“Let them try.”</p><p>The temperature went downright cold as he ducked into a back alley, and she clutched at his chest when she saw the first bright red gleam of bludrat eyes.</p><p>“A native Londoner scared of the rats?”</p> <p>“Not usually. But I’ve forgotten my parasol. And my jacket is ripped. They can smell me.”</p><p>He chuckled, his chest rumbling against her palm, and hurried faster. “They can always smell ye. We’ve much worse things, where I come from.”</p><p>“I was curious how you could wander about with your . . . wearing a . . .” There was no polite way to end the sentence.</p><p>Another chuckle, this one a shade darker. “Oh, so ye noticed my knees, did ye?”</p><p>She hid her blush against his chest.</p><p>Finally, he stopped, and she could tell from the scent of baking bread and the sound of glad barking that they were at her front doorstep.</p><p>“I can stand.”</p><p>He gently set her down, his hands clinging to her shoulders as if he would have preferred to carry her all night against his heart rather than let her feet touch the ground. Once she unlocked the door, he gave her a meaningful look and stepped in first before ushering her inside, one hand on the small of her back. Everything was as it should have been, the birds rustling softly in their cages, a few sleepy heads peeking out from under fluffed wings. The puppies stopped barking and started whining for food, and Thom closed the door behind them. Warmth and comfort and rightness washed over Frannie, and she put up her chin and said, “Right, then. Tea.”</p><p>She handed Thom his jacket and went to busy herself in the kitchen. He followed more slowly, checking every dark corner of the shop.</p><p>“Would the animals know if something was amiss?” he asked.</p><p>She laughed as she measured out the tea. “Oh, yes. Clockworks are all well and good, but birds are the noisiest and most easily agitated of busybodies. If anyone they didn’t recognize had come in downstairs at night, they’d still be talking about it and tossing feathers and seed onto the floor. I think we’re safe now.” And she did. Not only because the pet shop slept but also because Thom was there, blocking the door. He leaned against the side, crossing his feet and narrowing his eyes at her. She fumbled the spoon.</p><p>“I know I asked ye before, but I must ask again. Does someone wish ye ill? Someone from your past?”</p><p>“I don’t believe I have any enemies. The one person from my past . . .” She stared into the stream of boiling water as it swirled with the tea leaves, turning them from a dusty gray to a warm, wet green. If only she had possessed some sort of magic, she would have read the leaves in her cup and his, later, to try to puzzle out why everything was changing. “He was indifferent, like a storm that leaves destruction in its wake. If anyone wished revenge, it was me. Crossbows were never his style, in any case. He preferred swords.”</p><p>“Anyone complain about a pet sale? Any threatening letters? Lawsuits?” She shook her head, and his eyes went sharp. “Thrown over any lads lately?”</p><p>She snorted and plunked sugar cubes too forcefully into his tea, although he hadn’t requested them.</p><p>“Until last week, I spoke to no one but Maisie and the odd nod with the neighbors. One might ask if you and Casper had enemies.”</p><p>It was his turn to snort as he took the tea and sat on the couch, holding the thin porcelain with excessive care. “I live a solitary life, and any man with a grudge can call me out for a good thrashing, if he wants one. It’s clear the Maestro has enemies aplenty, and for good reason, but it’s also clear they could have shot him onstage and finished him off. No, they were aiming for you, lass.” He blew on the tea and sipped thoughtfully. “First the incendiary device and now an arrow.”</p><p>Frannie blushed and looked down, stirring her tea with a small spoon. “And someone may have mailed me a viper.”</p><p>Thom choked on his tea and set the cup and saucer down to glare at her. “Ye might have mentioned that!”</p><p>She shrugged and sipped.</p><p>“Have you somewhere else to go, lass? Where you could lie low for a bit?”</p><p>She looked up at him, defiance snapping in her eyes. “Absolutely not. This is my home, and I refuse to run away in the hopes that someone would be too stupid or silly to follow me. I’ve done nothing wrong. I’ve no enemies.” She fingered the rip in her jacket. “And I’ve nowhere else to go, in any case, and no money to get there. So that’s that.”</p><p>“Then you’ll have to put up with having a great brute about for a bit.” He stood and pointed his chin at the stairs, the orange gaslights sparking off the stubble. “I’m sleeping in your hall.”</p><p>12</p><p>Of course she couldn’t sleep; Thom sat just outside her door. The gallant man had promised not to let himself drift off until she herself was firmly dreaming, and she suspected that he was alert to her every toss and turn. Heaven knew her head was full of enough snakes to keep an entire block of London bludrats hopping.</p><p>She’d been twitchy ever since the fire. The new glass in her window was even thinner than the pane that the device had shattered, flying into her room and setting the curtains ablaze. She hadn’t heard the crash then, just as she hadn’t heard the arrow thwack through her sleeve and into the plush velvet seat, a finger’s span from her arm. She had told Thom the truth: she didn’t know who would wish her harm. But she was more scared than she could admit. Having him near was becoming a habit, and not just because she knew that he’d already saved her life at least twice and wouldn’t hesitate to dive between her body and danger.</p><p>She heard him shift outside and sigh, the old door creaking against his back. Without meaning to, she echoed his sigh and turned again, the bedsprings squealing beneath her. Of course, she was afraid to fall asleep, when her dreams held nothing but the memory of blood on snow, the jangling of the traces on the black horses of the funeral carriage, and, more recently, the hot reek of fire. She’d held her secrets alone too long, and a desperate glance at the closet only made her more fretful.</p><p>“Stop worrying and sleep, lass,” Thom called through the door. “You’re safe, I promise ye.”</p><p>She rolled over, cheeks hot and red, the ribbons on her nightdress caught under her hand. “I’m trying,” she called back, and he made a Scottish noise deep in his throat that seemed to say he didn’t believe her, not one little bit.</p><p>Long memories of a foolishly broken heart and a dead family weighed her down, and she was on edge about the recent and random attempts on her life. But what really kept her wide awake in the middle of the night was the warm and restless presence of the Scotsman in the hall.</p><p>“I could make ye some more tea,” he said uneasily, and she snorted. He struck her as the sort of fellow who could do anything but boil water.</p><p>With a final, deep sigh, she sat up, her hands gripping the rough new wood he’d used to rebuild her bed. No point in pretending any further. The uncomfortable truth was that sleep wasn’t what she needed most. Sleep couldn’t ease her heart. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Frannie stood and slipped a shawl over her shoulders. Her feet were silent on the boards, her nightdress whispering as she crossed the small bedroom and put a hand on the door as if she would be able to feel his warmth through it. With no warning, she twisted the knob, and the large man caught himself before he could fall backward into a lady’s chamber.</p><p>“What ails ye now?” he asked, pulling his kilt and unbuttoned shirt to rights and keeping his gaze politely averted from her bare feet.</p><p>She couldn’t see his eyes in the dark, and that made it all the easier to answer, “You do.”</p> <p>He leaped to his feet and stood, dwarfing her. “I can keep watch downstairs in the parlor, if that would be easier. I know it’s damned improper, having a strange man about at night and not a lodger.” He frowned as he looked at the door of Casper’s empty room.</p><p>She only put a hand on his arm and said, “Can I trust you?”</p><p>“Aye.” It was half statement, half question.</p><p>He hesitated for just a moment on the threshold of her room before following her inside. The house was dark, but she knew every inch of it. She wasn’t surprised to feel his fingers catch her gown as she walked to the closet door. Frannie had kept her family’s secret faithfully, the only one left to keep it since Bertram’s death. As she opened the closet door and pushed aside the layers of tweed and wool, a little thrill ran through her, making her swallow down a giddy giggle. Even Charles had never known about this. She had planned to tell him after their wedding, which had never happened.</p><p>Thom’s breath was hot on her ear, one hand even hotter against the small of her back. “Dragging me into a closet, lass? I don’t think that’s going to help ye sleep.”</p> <p>“Close the door and come along.”</p><p>She pulled the hook hidden under a coat, and when the panel slid aside, she reached behind for Thom’s hand and pulled him up a narrow staircase. Even as she shoved the coats aside, he didn’t grumble or question her, as if he understood that what he was about to see was important. The steps were tall and wooden and probably quite dusty, but it was too dark to know for sure. Frannie held her nightdress up in front, counting the steps until she felt the press of wood against her outstretched hand. The stair below hers creaked ominously as Thom stopped and waited, a solid presence behind her. Smiling to herself, she opened the door to the roof and stepped out into the most beautiful garden in London.</p><p>The smell always struck her first. Green things and deep earth and robust, natural health. And, yes, goat. Next came the tweets of birds in the branches, just as sleepy as their captive brothers below. After a few steps in, the smooth stone under her feet turned to soft grass, and she sighed happily and looked up at the half-full moon that lit the milky glass of the greenhouse ceiling.</p><p>“I’ll be damned,” Thom said softly under his breath. “Am I dreaming, lass?”</p><p>“You’re no sleepier than I am,” she said with a grin.</p><p>She tried to see it through his eyes, as if for the first time. She’d played in the secret garden all her life, had even taken her first steps here. Since first her parents’ and then Bertram’s passing, it had been a large part of her life, taking care of all the chores that allowed it to flourish. The small fruit trees, carefully pruned. The grass and rows of vegetables and tidy fences. The flowers and beehives, sleepily humming. The cantankerous but tiny goats that kept her in cream and milk when the rest of the city suffered. The troublesome process of turning their scat into the richest compost in the city. Even the high stone walls of the roof that hid the bounty within were painted the fresh, warm green of a summer that had ceased to be, ever since London had grown weak and watery with pollution and sharp with blud creatures. Frannie’s home was the tallest house for blocks. The glass ceiling could only be seen from an airship, and not many of those crossed this part of London. A small but powerful charm helped eyes slide away, should they actually land on the curved glass, which was carefully vented on the side so the wild birds could come and go.</p> <p>“This is why you’re so scared of the Coppers, aye?” Thom asked. “And my badge?”</p><p>She looked up at the cold, indigo sky. “All very illegal, yes. If anyone ever found out, it would all be seized for the city. Probably ruined, as they ruin everything.”</p><p>Looking all around, he put a hand on her shoulder, where the shawl had fallen aside. The warmth and weight of his touch seared through her.</p><p>“This place is far too precious to be ruined,” he said gently.</p><p>“This is where I go when I can’t sleep. When I feel unsafe or unquiet or too alone. I lie back in the grass and stare at the sky and just breathe.”</p><p>With long familiarity, she went to a faded wooden trunk along the wall and cleared off the half-filled pots and trowels to lift the lid. When she turned back to face him with a rough wool blanket in her arms, a smile lit his face with the light of secrets shared and promises to come. A new heat unspooled in her belly, matching the wet warmth of the sun-kissed grass soft under her feet. He took the blanket from her, and she moved to an open patch where the grass was thick.</p><p>“This is my favorite spot,” she said, and he tossed the blanket high, holding on to one side and letting it settle smoothly over the ground.</p><p>Even though she’d done this a thousand times or more, this was her first experience in the garden with a man’s eyes on her body, on her face. She tried to avoid his gaze, busily bundling her shawl into a pillow and stretching out on the blanket, enjoying the trapped warmth of the greenhouse more than any coverlet and trying to ignore the fact that she wasn’t wearing nearly enough clothing. She had long ago decided that the rooftop greenhouse was a place beyond time, a place where nothing mattered but warmth and nature and light, and she struggled to convince herself further as Thom settled by her side, not touching but close enough that she could feel the brush of his kilt.</p> <p>Frannie stared up through the glass at the faraway glitter of stars. London’s famous fog swirled in and out between the moon and the greenhouse, but she found her favorite constellations, the Swan and the Great Bear. Thom was a still and silent presence at her side. Barely moving, barely breathing. On high alert, and waiting.</p><p>An owl hooted overhead, and Thom startled.</p><p>Frannie finally had to laugh. “A bit jumpy, there?”</p><p>He sighed and chuckled and ran a hand through his hair, caught out. “Aye, well, I’m in an illegal garden, alone with a beautiful, half-dressed girl. I’m one step away from sitting on my hands.”</p><p>Frannie ran fingers through the grass, the uneven blades tickling over her palm. “Time seems to stop here,” she murmured. “I used to come here and watch the stars spin and fall asleep to the sound of rustling leaves. I came here when my parents died. I came here the night my brother was killed.” She rolled to her side, her head on her hand as she looked at him. “I came here after you kissed me.”</p><p>He looked down on her with soft, serious eyes. “I’ve regretted that. Poor wee thing. I didn’t mean to scare you away.”</p><p>“I’m not a virgin, Thom.”</p><p>He didn’t blink. Didn’t move.</p><p>“I was engaged for one day, and then he used me and left me. My brother called him out to the Dueler’s Green, sword in hand. My brother lost.” Thom groaned and put his head in his hands, and she sat up, a hand on his forearm. “I’m not telling you so you’ll regret kissing me, nor so that you’ll pity me. I’m telling you so you’ll understand why I bolted. I’m skittish. No one’s touched me in years. I’m . . . apologizing. It was a nice kiss.”</p><p>“No wonder you’ve no faith. Poor lass.”</p><p>The way he said “poor” made it come out “puir,” and Frannie leaned forward slowly to put her head against his bicep. He stroked her braided hair gently and then wrapped his arm around her.</p><p>“I had a wife.”</p><p>She nodded against his chest, scared to speak and break the spell of the garden. Something about the sleepy warmth, the cool darkness beyond, and the charmed glass that kept it secret created a bubble of solitude that she didn’t care to end. Thom ran his fingers down the long braid in her hair, and he swallowed hard.</p><p>“We were married young, and I left her behind when I did my service with the Scottish Navy. I didn’t know until I returned home with a bag of pearls that she had died in a fire just a few months after I left. I hadn’t been there. I couldn’t save her. Or the bairn she carried. I sold the pearls and left home again. I figured I would keep other families from losing their hearts, or die trying. Either was better than reminding myself of what I let happen. I should have been there.” He paused, and she heard his fingers scrape the stubble on his cheek, knocking away a tear, perhaps. “I don’t sleep so well, these days.”</p><p>“I only sleep well here. Lie back beside me. Look at the stars. Feel the sun’s heat still in the ground.”</p><p>He pulled back to look at her. “You’re a cheeky wee thing.”</p><p>He scooted down and lay back on the blanket, arranging his kilt and settling his hands over his stomach.</p><p>She stretched out on her back beside him, her feet crossed at the ankles. His elbow brushed hers, but it wasn’t enough.</p><p>“Cheeky? Is that what they call it?” She shifted, setting her arm against his with quiet purpose. “From what I hear, the fine ladies of society have another word altogether for someone like me.”</p><p>“Now, Frannie—”</p><p>“I like the way you say my name. With that little trill on the r. And I don’t care what they would call me. That’s what I’m trying to tell you. I ran away when you kissed me because I can’t hide from my memories, not because I’m worried about my future. I made mistakes, and I have regrets, but I don’t want to run away anymore. You make me feel safe, make me realize that hiding isn’t actually living. Actions speak louder than words, for me. You make me want to live again.” She gazed up at the moon, praying to still her heart. “Are you still sitting on your hands?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I can think of better places for them, if ye trust me.”</p><p>He rolled to his side to cup her cheek, gazing down with watchful eyes that still held the sea. She put her hand over his.</p><p>After placing a careful kiss in his palm, she whispered, “I trust you.”</p> <p>13</p><p>Thom ran a thumb over her cheekbone with the gentleness he’d used cradling her dainty teacups. His eyes went hooded, and he leaned over to dust her lips with his. Shivers raced through her at the touch. It may have seemed gentle and soft, but the promise of more lurked in his hazel eyes, gone shadowy with the moonlight. She understood that he was giving her time to bolt, to break away. To turn from him.</p><p>She didn’t.</p><p>She lifted her head, inviting, and with a slow, curling smile, he obliged. His mouth slanted over hers with firm purpose as his hand slipped to her jaw. Whatever had made her panic last time, that impulse was gone, her body rooted to the earth and yearning toward his. The kiss was long, slow, and tasting, and she opened her eyes to watch him, her fingers trailing over the golden hairs on his forearm where his sleeve had slipped up. His eyelashes were light where they fell over his cheeks, and tiny webs of wrinkles sprang from the corners of his eyes as if he was always laughing. But he wasn’t laughing now, and he ran his thumb along the corner of her mouth as he deepened the kiss, his tongue slipping within. She closed her eyes. Now she was the one struggling not to fall apart.</p><p>Charles had kissed her, and those kisses had excited her, but never like this. Charles had made love as he had done everything: quickly, sharply, selfishly, and with a mirror close at hand. She had been too young and anxious to please to consider that there might be something more to how bodies met. Thom seemed entirely focused on her, on her mouth, although he subtly sidled over, his hip pressing against hers with lazy suggestion. His tongue explored her, pressing sweetly and gently and playfully but with a slow tenderness that was half pleasure, half madness. He coaxed her with tender strokes, calling her into his rhythm, luring her to lap at his mouth with the same sly fascination, the same unhurried surety. She reached for his hair, for the tender back of his neck exposed beneath his collar.</p> <p>When he pulled back, his thumb still pressed to the corner of her lips, he smiled down at her with a new heat. “Ye didn’t bolt.”</p><p>She just shivered and shook her head no.</p><p>Without the press of his body and the touch of his mouth, Frannie felt exposed, her skin alive and on fire under the thin cotton of her gown. She hadn’t thought it through, bringing him up to the garden, although it didn’t feel wrong. Still, it was strange to see the hills and shadows of her body through the worn chemise and know that even the wan moonlight would show him every place where the thin shift clung to her, the dusky shadows of her nipples and her thatch, farther down. She felt lush and fearless in the night air, laid bare for him as all her secrets now were.</p><p>“Ye look like a selkie dusted in starlight.”</p><p>His hand traced down her face and neck, making her shiver when he reached her collarbone. Leaning over ever so slowly, he planted a kiss there, and the breath caught in her throat as her back arched toward him.</p><p>His palm traced down her arm, and he took up her bare hand and matched his fingers to hers, one to one, a look of wonderment on his face. “Such a wee thing,” he mused.</p> <p>Frannie’s eyes feasted on him in turn, from the shaggy cut of his hair, just grazing broad shoulders, to the V where his work shirt hung open, showing a patch of gold hair even lighter than the rest. He was stretched out beside her, bigger in every respect, at ease on his side with his kilt draped haphazardly, showing gold-dusted knees and his heavy work boots, carefully polished for their visit to the theater. She ached to touch him, just as she longed to feel his callused hands skim over her every curve.</p><p>With a satisfied rumble, he half-settled over her, his body pressed against hers from chest to thigh. The kiss started deeper, faster this time, his hunger showing in the pressure of his lips and the firm movement of one leg, protectively covering one of hers and moving her knees ever so subtly apart. Her tongue sought his, breaking past soft lips in a quick, tender caress, just testing the waters. He met her, moaning into her mouth as his hand slid from her collarbone to her waist, fingers splayed over the whisper-soft gown.</p><p>“No corset. Gods, woman,” he murmured, his palm hot as he explored the valley from ribs to hips, the cotton bunching under his fingers. He pulled her to her side, and she slid her leg over his, pressing pearled nipples against the planes of his chest, back arched and still bearing the damp kiss of dew-wet grass soaked up through the blanket.</p><p>Thom kissed just behind her ear, moving her hair aside and brushing the tiny curls with a finger between soft presses of his lips. Heat shimmered over her, making her ache inside for more of his body and his mouth. Her hand tightened around the tense knot of his bicep. He skimmed the lacy neck of her gown, leaving a trail of kisses down to the ribbon tie as his hand cupped her breast, his thumb stroking her hard nipple through the cloth. She felt heavy in his arms, soft and opening the way the tree leaves did every morning when the sun rose. Slowly, so slowly, he pulled the ribbon at her throat as his mouth dipped to her breast, suckling through the thin fabric, an echoed heat pooling between her legs and making her gasp.</p><p>With one hand cradling her head, he gently rolled her to her back and slung a leg over to straddle her thighs. She watched the play of his kilt and grinned, stretched her hands overhead, and reveled in the strange, leisurely pleasure, languid as a purring cat. His tongue returned, hot and wet through the gown, her nipple still peaked to his touch. With both hands free, he cupped her breasts tenderly and bent his head to lavish the other nipple with warm strokes of his tongue, his breath hot through the cotton. When Frannie ran her hands up the hard planes of his thighs, she was surprised to find that underneath his kilt he wore nothing at all.</p><p>“Goodness,” she muttered, and he caught her mouth in another kiss, briefly grinding his pelvis against her to demonstrate with no question that there was actually . . . quite a bit of something else underneath a Scotsman’s kilt. Before she could gasp in surprise, he found her nipple again, teasing with his teeth and making her writhe.</p><p>A shadow passed over the moon just then, casting the garden in shadow. Emboldened by the darkness, she ran a hand even farther up his leg and briefly stroked the hot silk of what she found there.</p><p>He made a strangled noise, deep in his throat. “Oh, lass. You can’t know what ye do to me.”</p> <p>But she did know, and she moved her hand gently up and down, grinning slyly when he moaned, cheek hot against the skin of her chest. She moved her hand a little faster, and he growled, going tense all over. His hand tangled in the fabric of her gown before skimming up the inside of her leg, warm and yielding. When he stroked the hot center of her like a question, she answered by quivering and whimpering in turn, her hand locked around him. The sensation of his thumb, rough and wide, rubbing slowly and deeply, woke something in her, and she finally understood that just as Thom’s kisses were something different from the ones Charles had inflicted upon her, so would Thom’s lovemaking be an entirely new experience, one that her body was well roused to enjoy. Every touch, every taste, every look of his shadowed eyes told her that he was determined to take care of her in every way, that he wouldn’t leave her hungry. She closed her eyes, tossing her head back, yielding her body utterly to his care.</p><p>“You’re wet, lass. Do ye want this?”</p><p>One finger pressed in, ever so gently, and she rose to meet it, holding her breath. “More than I’ve wanted anything in a long time,” she whispered, and he made an affirmative noise and moved the finger a little faster. She felt his lips close around her nipple again, and an exquisite yearning surged through her like a flame connecting where his mouth and fingers met her body.</p><p>“Well, then,” he whispered, lips hot against her breast.</p><p>He pushed another finger into her, in and out slowly, and she ached for the fullness every time they withdrew. She found herself moving along with him, her body already knowing the dance. After a last, wet pull on her breast, he drew his shirt over his head and murmured, “Let me see you, love.” Watching the play of shadows over his chest, she shifted to help him strip her gown away. In all her years in the garden, she’d never been there naked. She’d never really been anywhere naked, other than the copper tub in the loo, and her lifelong fear of bludrats always urged her to hurry back into a gown, into anything. But now, fully exposed from hair to toes, she stretched in the starlight and sighed at the air’s warm kiss on her skin.</p><p>Thom still wore his kilt and boots, but she found that she approved. The brush of wool against her thighs was delicious, and she sucked in a breath as he kissed between her breasts and down the curve of her belly. Finally settling over her, he kissed her gently, sweetly, deeply.</p><p>“Ye must promise to tell me if it hurts ye.”</p><p>She nodded, biting her lip.</p><p>He nudged her thighs apart with a leg, and she opened willingly. Every nerve thrummed, ached, and she knew she was more than ready. The hot press of him where his fingers had recently worked made her shiver with anticipation. As he pushed into her, so slowly, he took her nipple between his teeth and suckled.</p><p>Frannie had never wanted anything so badly, never felt such a hunger. When he was fully inside, she wrapped her arms around his neck and pulled him close to whisper in his ear, “Don’t stop.”</p><p>He moved slowly at first, tentative, as if he was afraid of hurting her. She moved with him, learning, feeling, the tension building. He felt so big, filling her, blotting out the stars. It was hot and sweet and wet, and still she wanted.</p><p>“More.”</p><p>“More, lass?”</p><p>“Harder. I don’t know. More.”</p><p>He moved faster, pounding against her, making her wiggle and press against him. An ache was building in her, like an itch she couldn’t scratch, and he sped up the pace. She wrapped one leg around him and whimpered, trying to find just the right place. When he unlatched her arms and rolled her over onto her hands and knees while still inside her, she was utterly surprised. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’ve heard it said some women prefer it this way. Let me know, aye?”</p><p>She was about to protest when he pulled out and pressed back in, one finger stroking her cleft. Suddenly, everything fell into place. She let out a strangled cry and closed her eyes, finding her rhythm with him, meeting him with every thrust. Oh, the joy of it! That had to be how birds felt, flying into the sky. With every plunge, he struck some fine, secret place, and she felt a sensation building like a song, pounding toward a crescendo. His finger moved faster, their bodies in perfect harmony, the song spiraling on and on, until finally, she held her breath as the world stopped, the note spinning out inside her forever, higher and higher, until she saw stars against the inky darkness of her closed eyes.</p><p>“Gods, woman,” he said, and he pounded against her, drawing out that last note, finishing his own song with a groan.</p> <p>When he collapsed against her back, her knees gave out, and they both tumbled to the blanket in a sweaty heap. She knew him well enough to know that he would be scared to crush her, worried about his weight.</p><p>“Bide a while,” she murmured, one eye on the stars. “I like how you pin me down.”</p><p>He chuckled and rolled to his side, taking her with him and making her yelp in surprise. “I won’t pin ye down, but I’ll hold you close enough.” Curling around her, he draped an arm over her side, pulling her against him.</p><p>Frannie relaxed into his chest, letting her head drop. Cradled by the warmth and magic of the secret she’d shared with a tender man who wasn’t about to leave, she drifted off to sleep.</p><p>14</p> <p>Frannie peeked through her closet door, Thom a secure wall at her back. All was silent and still in her room, everything as it should be, right down to the puffball kitten curled on her pillow. She pushed past the coats and walked confidently into the cool darkness, her body chilled beneath the wet places on her gown, now that she was beyond the garden’s midnight warmth. Now that she was out from under Thom.</p><p>He shut both doors behind them and sauntered into the room with a leisurely stretch, his knuckles nearly raking the ceiling.</p><p>“We’ve still a few hours until morning. D’ye want me outside the door again, or . . .” He jerked his chin toward her bed with a warm grin.</p><p>She jerked her chin right back at the bed. “You go ahead. I want to check on the shop first. Make sure Casper didn’t break anything on his way in.”</p><p>He had been drawing his shirt over his head, but he paused and let it fall. “Let me check for you, or go with ye, at least. I can’t keep ye safe if I’m curled naked in your bed, lass.”</p><p>Hands on hips, she shook her head. “If you’re going to be around, you’ll have to get used to me being unruly. I’ve kept my own house and run my own business for too long. I’ll not tiptoe around my home. The walls are solid. The doors are locked. And the animals will let me know if something’s amiss. They’re silent, you’ll notice.”</p> <p>He cocked an ear and looked her up and down, and she wondered what he saw. A wee wisp of a woman in a worn nightdress still stained with his mouth? Or a resilient London sparrow, accustomed to fighting her own battles and making her own way? The scales must have tipped toward the latter, or maybe he just knew well enough what was good for him.</p><p>“As you say, little love. I’ll be here if you need me.” He sat on the bed, fully dressed and alert. Waiting.</p><p>But that was his business. He’d have to get used to it.</p><p>Taking up her second-favorite but far less damp shawl, she wrapped her shoulders against the night’s chill and opened Casper’s door a few inches. It was too dark to see much, but she could hear him breathing. She rolled her eyes prematurely, dreading the braggadocio to come once he was awake. Plus, he’d probably want to know where she’d escaped to at intermission. The arrow had been wretched and unwelcome, but in hindsight, the night had gone rather well, and at least she hadn’t had to meet the bloody Magistrate.</p><p>She shut his door softly and headed down the stairs and into the pet shop. Everything was exactly as it should be, the room warm and sleepy, the silence broken only by the occasional tweet or the dry slither of scales on glass.</p><p>The puppies were fine, too, although their cage was messier than it should have been. She’d neglected them, and she would make up for it tomorrow with a couple of nice knuckle bones from the butcher. The kittens’ straw was empty, and she was startled for a moment before she remembered that she’d left them in a deep box in the warmth of the kitchen. They were more independent and on solid food now, but they couldn’t keep themselves warm without a mother during the long night.</p><p>Satisfied that all was well, Frannie passed into the parlor and went to bank the fire a little more carefully, as the kitchen was still a touch cool. She tripped on a bottle, sending it skittering into the corner.</p><p>“Drunk bastard,” she muttered. She would have to talk to Casper in the morning about the responsibilities of lodgers. Just because he was the most celebrated musician in the world, that didn’t mean he could leave wine bottles lying about. The bottle hit the wall with a clank, and the kittens sprang into motion, a chorus of desperate mews erupting from the crate.</p> <p>“Hush, now. It’s coming, lads.”</p><p>She went to the icebox and doled out a bit of the mush she’d made for them of goat’s milk and bread and finely ground chicken and spread it around the plate so they’d all have a chance of a bite. With such tiny stomachs, they still needed to eat quite frequently.</p><p>As Frannie held her shawl with one hand and set the plate of mush in the box, the kittens began to leap and mewl furiously, each little puff of fur crawling over the others to reach it. One took up hissing, and she let go of her shawl to swat it gently, saying, “Calm down, fussy. There’s plenty for everyone.”</p><p>And that’s when it wrapped needle claws into her wrist and dug tiny teeth deep into her palm.</p><p>The plate dropped from Frannie’s hand and shattered against the stones as she tried to shake the kitten off. She’d been bitten dozens of times before, by dozens of animals, and her response was always calm, firm, and quiet. But something was different this time. This wasn’t a kitten clinging or learning or playing. The thing was dug into her skin, gnawing at the meat of her hand with razor-sharp teeth, growling as it ripped the hole bigger. She caught the scruff of its neck, trying to dislodge it, but it only dug its claws in with wicked tenacity. When she stepped back, scanning the parlor for a spatula or a spoon or something to smack it with, she stepped barefoot on the shards of the plate and stumbled to the ground, falling hard on her knees.</p><p>Two more kittens plopped out of the box, and the sound of claws on wood told her more were on the way. She shook her hand, thrashed it, her instinct to toss the kitten away even if it was cruel, but the fuzzy gray creature only hissed and bit deeper.</p><p>A small weight landed on her leg, tiny claws pricking deep in her thigh as another kitten clumsily climbed up her body. Years of training and familiarity and softheartedness had given Frannie the patience and sacrifice to deal kindly with helpless creatures, but her heart’s frantic thumping and the ice-cold fear wrenching down her spine told her that something was deeply wrong. She rolled her eyes upward and whispered, “I’m sorry.” Then she bashed her hand on the hard stones, knocking the kitten off and flinging her own blood across the hearth.</p><p>The kitten leaped up and bunched its tiny legs to pounce, its eyes glowing red as it hissed at her.</p><p>Fear shot through her. These weren’t kittens.</p><p>“Thom!” she screamed. “Thom, help!”</p><p>She yanked the kitten-thing off her leg, its claws shredding her nightgown. Another one jumped on her back and skittered up to her neck, leaving a trail of red-hot welts that fueled her panic. By the time she had tossed the animal off her legs into the shadows of the kitchen, the one on her neck had burrowed under her hair, sinking teeth into the nape and ripping deep into the flesh as if hunting for her spine.</p><p>She felt the blood running down her neck before the small, scratchy tongue began to lick. And then she heard the rumbling purr. On instinct, she wrenched it off and dropped it in the box, where it licked her blood off dainty paws.</p><p>When one of the kittens started up her leg again, she grabbed it tightly by the scruff of its neck and held it up to the fire’s meager glow. Red eyes glared back, and the little pink mouth opened with a hiss to reveal sharply gleaming fangs.</p><p>Footsteps pounded down the stairs as Thom landed in the kitchen, clad only in a kilt, knife in hand. “What is it, lass?”</p><p>“Bludkittens. Don’t kill them. They can’t help it.”</p><p>She scrambled to her feet, slipping in a puddle of her own blood and diving for the drawer where she kept carefully folded grain sacks. Thom reached down to pluck a fast-crawling kitten from the hem of her nightdress.</p><p>“Gah! Bugger bit me!”</p><p>“Put it in here.”</p><p>She held open a sack, and Thom pulled a kitten from his thumb. It held on as long as it could, stretching long, like a furry leech, before its teeth came unstuck with a little pop and a dribble of blood. He held it up to his face, and its eyes went wide and round, its miniature paws swimming in the air and its stubby tail twirling.</p><p>“Mew?”</p><p>“I don’t think so, moggy.”</p><p>He dropped it neatly into the sack and went for the box, grabbing two more and tossing them in. Their claws immediately sank into the rough cloth, their little bodies swarming upward, but Frannie’s fist cinched the neck of the bag, trapping them.</p><p>“There are two more. I threw one in the corner.”</p><p>“Where’s the other?”</p><p>“Ah! On my ankle!”</p><p>She hopped on one foot, trying to dislodge the little orange tabby wrapped around her foot. It purred while it sucked blood from the meat of her calf, and Thom knelt to pull it gently away. Its legs wheeled in the air as it hissed, and Frannie held open the bag, jiggling it to knock the others away from the opening.</p><p>“One more,” she said.</p><p>Careful not to step in the shards of porcelain and forgotten kitten mush, she flicked on the light. With the bag in one hand, she prowled the room, checking the kittens’ box, under the tables, and in the corners. The fifth kitten, a white one, had utterly disappeared. It was unsettling to think that a creature so rabid for her blood would be intelligent enough to run in the opposite direction. She held up the now-shredded hem of her nightgown and called, “Here, kitty. Here, puss. Come have some nice blood.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Thom stepped behind her, holding a damp cloth to the searing wound on the back of her neck. “What happened?” he asked, gently moving her braid aside and running the cool, wet cloth over her shoulders and down her back. She sighed and tried to relax, but her whole body was tensed as if to run, her breathing fast and high. For all the animals Frannie had dealt with in the bounds of the shop, creatures exotic and angry and scared, she had never feared one before, not even the venomous asp. But of these kittens—turned to blud creatures by some diabolical hand, and in her own house, no less—she was truly frightened.</p><p>“I came to feed them, and they attacked me. The rest of the shop is fine. But how is it even possible? They’re the same kittens they were this morning, but . . .”</p><p>“But changed.”</p> <p>“It’s unnatural.”</p><p>She handed Thom the bag, and he grasped it so tightly his fist turned white. Remembering the bottle she’d kicked earlier, she hunted around under the butcher’s table in the center of the room. There was nothing unusual about the cheap green glass, except the residue of an opaque pink substance around the mouth. Frannie sniffed it, careful not to touch it.</p><p>“Milk and magic and blood? Or blud? Someone’s been here.” She took a deep breath and moved to the door, checking the locks as her face went red with anger. “Someone’s been in my house. Someone did this to my kittens.”</p><p>“But why, lass?”</p><p>She took the bag back from him, cinching the neck of it tightly and fetching the twine from its drawer. Around and around she wrapped it as the kittens tried to claw and hiss their way out of the gunnysack prison. She tied it off with an overabundance of knots and set it on the floor, then turned the kittens’ crate over on top of it. Then, for good measure, she fetched the iron doorstop and put that on top of the crate.</p> <p>“D’ye think leaving the wee beasties alive is safe?”</p><p>“I don’t have the heart for the alternative. It’s not their fault. I’ll drop them on the doorstep of King’s College tomorrow and let the university study them. I can’t keep them here, but I won’t see them drowned.”</p><p>He pulled her into a fierce hug, and she melted into his arms. “You’re the bravest, biggest-hearted creature I’ve ever known.”</p><p>She nuzzled into his chest and flinched when he caressed her back.</p><p>“You’re hurt, Frannie.”</p><p>“I’m a mess.”</p> <p>“Let me doctor you.”</p><p>“I’ll get the kit.”</p><p>He held her away, his hands warm on her shoulders and thunder in his eyes. “No, Frannie. No. It’s time to go. Someone wants to hurt you, lass. I can’t imagine why, but they’ve been here, and you can see the lengths to which they’ll go to harm ye. We must go next door or, at the very least, an inn. I can’t keep you safe here if your enemies can steal inside while we sleep.”</p><p>She shrugged out from under his grasp, feeling suddenly tender and wounded and past exhaustion. All the panic and strength drained out of her, and she thought of the loose kitten, waiting in the shadows and licking her blood from its teeth. As she pulled the first aid kit from its drawer, she thought carefully about how to proceed with the man she wanted to stay.</p><p>“I’m not leaving. This place is my life. The animals are my livelihood. This house is all I have left of my family, and no one and nothing will drive me out. Besides, if someone can get in here, they can get in anywhere. They can follow me anywhere. Better to fight them here, where I know every nook and cranny. If I’m going to die, I’m dying on my terms.”</p><p>Thom rubbed his eyes tiredly and handed her the wet handkerchief stained with red. “Don’t mistake bravery for foolishness, my lass. I’ll stand by ye and fight for ye, but I fear your stubbornness will kill us both.” He leaned against the doorway, his head against the wood and his mussed hair sparking in the gaslight. “What is it you want of me now?”</p><p>“Come to bed,” she said. “Bring your little knife, and lock my door, and tend my wounds, and keep me safe so I can sleep. We’ll worry about it by the light of tomorrow.”</p><p>Thom threw a wry glance at the crate on the floor, the bag writhing with hisses underneath it. With a deep sigh, he scooped Frannie up and carried her up the stairs, just as he had carried her home from the theater.</p> <p>“If a kitten kills me in my sleep, lass, you’ll get what you deserve.”</p><p>15</p><p>Something pulled at Frannie’s consciousness. An annoying sound, and a threatening one, breaking through her dreams. She struggled to sit up, but Filbert was curled up in the crook of her neck, and Thom was wrapped around her like a winter blanket, his bare chest and muscled arms radiating the heat of the fires he so often fought. Shrugging out from her cave of warmth and resettling the kitten at Thom’s shoulder, she realized what had woken her.</p><p>The sound of tiny claws, scritching under the door.</p><p>By the time she was across the room and ready to grab the lost white bludkitten and stuff it into her ewer, the cheeky thing was already gone. The door across the hall was open, and Casper stood there, looking even more debauched and beautiful than usual, his shirt undone down the front and his breeches unbuttoned. Frannie tried not to stare and failed.</p><p>“You been scratching at my door?” he mumbled.</p><p>The spell was broken, and her eyes snapped up to his bloodshot ones. “Go back to bed, bounder. And if you see a kitten, watch out for its teeth.”</p><p>“I’d like to feel your teeth. Want to join me, darlin’?” He gave her a dimpled, sleepy smile, and she slammed her door and spun around in a huff.</p><p>Thom watched her from the bed, propped up on one elbow, with her grandmother’s quilt artfully draped over his waist. With one wide thumb, he stroked Filbert’s head, and Frannie blushed when she remembered what else that thumb had stroked last night.</p><p>“I am plagued by attractive men and bludkittens,” she muttered to herself. “And I’m not wearing nearly enough clothes to deal with either.”</p><p>She went to her closet, fingering the ripped indigo taffeta of last night’s gown. The first time in years that she’d gone out, and someone had barely missed shooting her with an arrow. But who would wish her ill? All the trouble someone was going to, trying to harm her. Charles was lazy if nothing else, and these shenanigans weren’t his style. An incendiary device through her window. A viper on her doorstep. An arrow at the theater. And a crate of her beloved kittens, birthed and raised by her hands, turned into fierce, foul creatures that hungered for blood. Had she been alone last night, had they found her sleeping, who knew what might have become of her? She shivered as she pulled out a thick tweed skirt and jacket. She would also wear high boots and her most heavily boned corset. She had meant it when she had told Thom she wouldn’t leave her home—but she wasn’t a fool, either.</p><p>Thom had saved her, again and again. But could it be a coincidence that the two handsome men in her house had arrived on the same day as the first threat against her? She couldn’t think of anything anyone could want from her, aside from the rooftop garden, which no one knew about, not even Maisie. And if that was the ultimate goal, wouldn’t setting the building on fire be a bad idea?</p><p>Frannie realized she was simply standing in the light of her window, her hand sweating under the thick leather glove as she gazed at the gray sky.</p><p>“Pensive much, little dove?”</p><p>She turned to Thom, trying to shake the fancies from her head.</p><p>“I can’t puzzle it out. There’s no good answer. There’s no reason to want me dead.”</p><p>Thom stood, scratching the ice-blond hair on his chest down to where it disappeared into his kilt, which was the only thing he wore. He caught her staring and winked before sitting to strap on his belt and pull on his stockings and boots.</p><p>“I must work today, lass. They need me, and I need the job. I’ve a friend at the precinct, and I’ll be asking him to patrol the block, tell him I saw some unsavory characters hanging about.” She opened her mouth to protest, and he held up a hand. “No. I’ll not tell the Coppers the truth or ask them to come inside. I know how much your secret means to ye, and I’ll keep it to my death. But at the very least, they’ll be nearby should something happen before I can get back tonight.”</p><p>“You’ll come back?”</p><p>He shrugged into his shirt and tucked it loosely into his kilt. When he held out his arms, she went to him willingly, and he pulled her close on his lap. “What’s your favorite food, lass?”</p><p>She didn’t even have to think about it. “Frosted cakes from the bakery on High Street.”</p><p>“I’ll bring some tonight, if you don’t mind the company.”</p><p>She smiled and looked down, running a finger down the V of his shirt. “So long as you’re coming for me, not because you feel you must.”</p><p>“Oh, I must. I can’t kiss you if you’re not around, aye?”</p><p>“But I don’t want to be a chore.”</p><p>He put a finger under her chin, and she let him lift her face until their eyes met. His were the gold of baked bread in the center and green as grass around the outside, and they crinkled at the corners with his smile. “Taking care of his woman is a man’s most serious job. I failed it once. I’ll not fail it again.” Shivers trilled up her spine as he brushed his lips over hers, sure and soft but still as searing as a brand.</p><p>“Thom, I—”</p><p>He stood, pulling her with him and gently cradling her face to kiss her again. “Until tonight,” he murmured. “I’m bringing cakes. Be careful, little love.”</p><p>She watched his kilt as he sauntered out the door, amazed, surprised, and worried all at once. His boots sounded on the stairs, and she imagined him making his way through the pet shop, pausing to pat the puppies or poke a finger at the mynah that still echoed his voice after a night in his company. The door closed with a jangle of the bell, and she moved quickly to the window to watch him walk down the street. His hair was a bird’s nest, but his jacket hid the mess she’d made of his shirt, at least, with blood and kisses and wrinkles. Halfway up the sidewalk, he turned to her and blew a kiss, and she drew back from the window, cheeks aflame at being caught out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Here she was, mooning out a window for a man she hadn’t even known for a week. Her mother had told her, when she was young, the story of how her parents met. Her mother had come into the pet shop as a nanny with two little hellion boys under her care. Her father had outright refused to sell them a kitten, on the grounds that the spoiled children would bring the creature to harm.</p><p>“What do you recommend, then?” her mother had asked.</p><p>“Gelding” had been his response.</p> <p>Her mother had been so impressed that she asked if he needed any help around the shop, with cleaning cages or handling the creatures. He hired her. The next day, she gave her notice to a frazzled High Street duchess and moved into the room Casper now used, bringing nothing but a secondhand valise and an extra hat.</p><p>“It was love at first sight,” her mother had always said with a sigh.</p><p>When Charles had first arrived with Bertram for tea, all those years ago, Frannie had thought she finally understood what her parents had meant. She had been infatuated with the exotic charmer, with his slick ways and pretty words, his sly winks and dark eyes. But now she knew the difference between girlish fancy and a woman’s intuition.</p><p>Charles had hurt her and left. Thom kept coming back just to keep her safe. Four days suddenly seemed like more than enough time to start falling in love with a real man.</p><p>Frannie was jumpy as hell all day. She startled, one hand to the high neck of her blouse, each time the bell rang over the door. Every time a bird squawked and flapped, every time a puppy yipped, she sidestepped as if the white kitten was diving for her flesh. She searched the shadows for adorably malevolent eyes and flinched when a shadow passed the glass in the door. And every time her work took her near the display of tall glass jars, she couldn’t help feeling that the small green snake was watching her. Waiting. The next time a dark daimon came in, perhaps she could sell the pretty thing for a quick profit and be done with it.</p> <p>Aside from the anxiety, it was a good day for the shop. She sold a corgi pup to a teen girl who’d been blinded in an automaton accident as a child, and watching the girl’s radiant smile as the wee thing leaped all over her, licking joyfully, brought tears to Frannie’s eyes. A charming Bludman and his wife stopped in for a crow, and another orphan brought by a green parakeet in exchange for some cookies and a copper. She packaged up countless bags of seed, biscuits, and treats, slipping lemon candies into the hands of impatient children. Lizards and finches and tortoises left for new homes, snug in pink-and-white-striped boxes tied with black ribbon.</p><p>At dusk, she checked outside for last-minute customers before locking the door and flipping the sign. Back in the kitchen, she sipped tea and pulled a bit of string for Filbert to chase, the smell of a shepherd’s pie perfuming the air. Frannie noticed the bludkitten lurking in a corner and readied herself to catch the little menace, should it come after its once-brother where he played by the fire. When Casper appeared suddenly in the doorway, she couldn’t help gasping. His stocking-clad feet had been silent on the stairs, and when the white kitten leaped from the shadows to land on his foot, he poked it with a toe. It sniffed him and hissed and bolted back up the stairs before Frannie could shriek a warning.</p><p>“Mischievous little puffball,” he said with a winning grin.</p><p>“Catch it! It’s a killer!” she cried, snatching Filbert into her lap with one hand and grabbing a meat mallet with the other.</p><p>Casper just laughed. “Barely gummed me. Honestly, girl. You look like you just saw a ghost.”</p><p>“That . . . thing. It’s a bludkitten. They all are, except Filbert. They attacked me last night.”</p> <p>He swallowed down a laugh and scratched his stubble. “Ah, yes. Bludkittens. Of course. The most vicious creatures in London!”</p><p>Dropping Filbert into her pocket, she spun around and pulled down her collar to show the nasty scab that had formed where the kitten had ripped into her neck. “What do you think did that?”</p><p>“I’m not the expert on animals.” He gave her a searing, knowing look. “But I noticed that Thom stayed overnight.”</p><p>She gasped, mouth open, then went to the corner for her broom. She shook it in his face, and he backed away from the dusty twigs.</p><p>“You paid for the week, and that gives you three more nights as a lodger here. I’m an honest woman, and I’ll honor the bargain. But after that, you’re out, lad. Calling me a liar and a strumpet in one breath isn’t something I’ll readily forgive.”</p><p>“I’m sorry, Frannie. Really. I—”</p><p>“You’ll keep to your room when you’re here. No more mucking up the bird seed and neglecting the pups, trying to get on my good side. I don’t have one when it comes to gadabouts.”</p><p>He smacked the broom aside, knocking it to the ground. “Is that why you left last night? I arrived at my box with the Magistrate and a bottle of champagne and found it empty.”</p> <p>She drew up tall, her hands balling into fists. “Someone shot a crossbow at me, and I took that as my cue to leave. You might have noticed, if you’d ever looked away from your adoring crowd.”</p><p>He opened his mouth to shout back and froze, his entire posture changing from self-righteous anger to solicitous concern in the span of a heartbeat. “Someone shot at you?”</p><p>“Aye, with an arrow. It ruined my best dress and barely missed me, and Thom carried me home in the crowd at intermission. Did you not find the arrow in the seat?”</p><p>“No matter how full of myself I might seem, I’d have noticed that.”</p><p>He moved to a stool and sat, his eyes far-off.</p><p>“Why you, Frannie? Do you have any enemies?”</p><p>“Thom asked me the same question, and I’ll tell you the same thing I told him. I have no enemies. Nothing worth taking. Nothing worth killing for.”</p><p>He snorted. “Speaking of making a killing, you wouldn’t believe how badly I beat Edwin’s ass last night. Trying to trick me with a new song. Like I don’t know them all already. You did see that part, didn’t you?”</p><p>She took Filbert from her pocket and set him on the table, and he rubbed his face against her finger and purred, as a kitten should. “That was cruel of you. That poor man. Nobody likes someone so superior.”</p><p>His mouth quirked up. “Oh, plenty of girls like it fine. Just not, as you so astutely pointed out, the nice ones.”</p><p>“Don’t you have to go ruin another musician’s day?” She glanced pointedly at the back door.</p><p>“I don’t play tonight. Do you want to—”</p><p>“I have plans.”</p><p>“Oh?”</p><p>“Plans that don’t include my lodgers.”</p><p>He stood and laughed wryly, running a hand through his hair.</p><p>“And you think I’m cruel,” he muttered.</p><p>“I told you not to set your cap for the likes of me.”</p><p>The look of defeat and pain in his eyes struck Frannie to the heart, but she didn’t look away. “I’ll be upstairs, getting drunk and writing poetry,” he said bitterly over his shoulder.</p><p>She felt a little guilty but not enough. “Watch out for bludkittens.”</p><p>“No need.”</p><p>And he was gone.</p><p>16</p><p>She had the table perfectly set when Thom arrived. The hot pie placed just so, the fluffy crust marked with an X. Fresh salad from the garden upstairs and warm bread from the baker across the street. A bottle of white wine as yet uncorked. Candles reflecting off silver goblets. Two plates waiting for the first time in years and a third, empty plate for his promised cakes.</p><p>The white kitten was still on the loose, but she felt safe enough to take off her jacket in the warmth of the kitchen. The bag of four captured bludkittens had been dispatched to King’s College in the heavily gloved hands of one of Maisie’s lodgers, a college lad who studied the blud mutation and had nearly fainted with joy to see their sharp teeth poking through the burlap. Frannie was still too worried to leave Filbert alone in her room, so the poor moggy had been dropped into an old birdcage on the counter with a deep bowl of mush and a brightly colored cloth mouse she had bought from Reve and filled with catnip from her garden. He seemed happy enough to be trapped, and she was free to focus her attention elsewhere.</p><p>A knock sounded on the back door, his voice calling, “It’s Thom.”</p><p>She opened it for him, and he pulled her into a warm embrace. She smelled smoke and soap in his still-wet hair when he handed over his bowler. It looked nice, hanging on the hook beside her shopping bonnet.</p><p>“Here’s your treat, little love,” he said, placing a pretty blue box in her hands. “Did you miss me?”</p><p>“I did.”</p><p>He’d brought half a dozen cakes, although she’d expected only one at the dear cost. Admiring each confection, she placed them on the family porcelain, smiling prettily at the sugar flowers and butterflies. She nodded at one of the chairs, and after hanging up his jacket, he took it, inhaling the steam rising from the pie with a look of pure bliss.</p><p>“It’s been years since I’ve had proper cooking. Wrappies and fireman’s food can’t beat such a fine spread.”</p><p>Pleased and blushing, Frannie cut him a thick slice of pie. He poked a fork under the buttery crust and smiled as if he’d found a long-lost childhood friend.</p><p>“Eat up, man. I know you’re hungry.”</p><p>“Aye. Fighting fires and kittens is tough work, I’ll have ye know.”</p><p>He dug into the food as she poured the wine. She was overcome with a pleasant sense of comfort, of rightness. For the first time in forever, her shop felt like a home. She’d only managed a few bites of piping-hot pie interspersed with shared smiles when the shop door banged open, sending the birds into a frenzy. Thom had his dinner knife in hand; he turned the blade subtly as he flung aside the curtain and stormed into the shop, blocking Frannie’s view.</p><p>“Ah. Frannie’s plans. She likes ’em big, stupid, and armed, I see.”</p><p>The words were slurred and bitter as Casper all but fell in through the door, a bottle in each hand. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“God, man,” Thom said. “Ye smell like vinegar. Can ye even make it to the stairs?”</p><p>Casper stumbled into the kitchen and put one bare hand on the table, nearly knocking over a spoon. “Didn’t even know I was gone, did you?”</p><p>“I didn’t,” Frannie said softly.</p><p>“Ran out of my preferred medication. Should be good for the rest of the night. Or however long it takes a man to drink himself to death. Or worse.”</p> <p>“Have some self-respect, Maestro,” Thom said. “Man with soft hands like that ought to keep them covered, out on the streets. And drinking so much will rot your mind.”</p><p>Casper chuckled, then snorted, then full-on laughed as he staggered up the stairs. “S’gonna do a lot worse than that.” He turned around and made an exaggerated bow. Wine sloshed out of one bottle to puddle, thick and dark, on the floor as he staggered up the first few steps.</p><p>Frannie and Thom shared a loaded look that reminded her more than a little of her parents’ wordless conversations over Bertram’s head. When Casper yelped and fell down the stairs, Thom shook his head and went to pick up the fallen man, with Frannie on his heels. She couldn’t help thinking that Thom’s arms were getting quite a workout this week, what with carrying people up and down staircases. Then again, that had to be part of his job, saving Londoners from their burning homes. Her heart went warm, thinking about the first time she had seen him, in his uniform in the middle of her shop, right when she needed help the most. He was a good man, to be sure.</p><p>Casper wouldn’t let go of his bottles, and they clanked against the walls as Thom carried him over one shoulder and into Bertram’s room to deposit him on the unmade bed.</p><p>“Casper and I are going to have a wee chat, lass,” Thom said to Frannie with a meaningful look. “Best go downstairs and have a bite, eh?”</p> <p>Frannie watched Casper trying to kick off his tall boots without letting go of his bottles. It hurt her heart, how far away this man was from what he should have been. But she knew well enough that nothing she could do or say would help him find his path. She could take in lost things, but she couldn’t always save them.</p><p>“Feel better, Casper,” she said softly, heading downstairs and hoping that Thom could talk some sense into the world’s greatest musician and possibly worst lodger.</p><p>She closed and locked the shop door, the birds still shrieking after Casper’s dramatic entrance. Back at the table, she poked at her pie and sighed. She’d never liked it cold, and she wished the birds would calm down so she could relax. After some more salad and a bit of bread with butter, she took a sip of wine and pulled the plate of cakes closer. Each one was the size of her hand, round and beautifully iced in pastel sugar frosting. With a mischievous glance at the stairs, she selected a lavender cake and nibbled the edge, savoring the way the sugar melted on her tongue. When she was little, her mother had always bought her one cake, just one, on her birthday. She had always shared it with Bertram, but the first bite had been her own.</p><p>“Cheers, brother,” she said, taking an indulgently deep bite.</p><p>She chewed slowly, eyes closed, considering that the only thing sweeter than this cake was the man who had brought it for her.</p><p>The strangest feeling came over her. Frannie’s eyes closed, and she slumped to the table before falling to the ground.</p> <p>“Go on. Go back to her. I don’t want your pity.” Casper pulled the cork out of the bottle with his teeth and swigged, a trickle of red slipping past his lips and staining his shirt.</p><p>Thom made a swipe for the bottle. Despite his extreme drunkenness, Casper was faster. “Too bad, lad. You’ve got my pity. That’s about all you’ve got right now, too.”</p><p>Casper’s face twisted up in an ugly sneer that he’d never shown Frannie. “I suppose you think I should buck up and be a good little tame musician?”</p><p>Thom snorted. “I think you should buck up and be a man.”</p><p>“I pay my bills. I do my work. What else is a man supposed to be around here?”</p><p>“Sober, for one.” Thom managed to snag the unopened bottle and put it on the floor. When Casper grabbed for it, a firm hand landed against his open shirt, shoving him back on the bed. “Sober. Helpful. Useful. Sacrificial, if sacrifice is needed. Without a heart, you’re not even human. You’re in that poor girl’s brother’s room, sleeping in his bed. Ye look just like the boy, from what I understand. She took you in when you needed it. Try bein’ a little kinder, aye? Try giving her some good memories instead of just dredgin’ up bad ones.”</p><p>“She wants nothing to do with me.” Casper sat back against the headboard. “And why should she? I’m disgusting. Not even human, as you say.”</p><p>“You can change that. You just have to want to be good. Here.” A thick finger poked hard against Casper’s chest. “You’ve got a hole in your heart. I know how that feels. Just find something to fill it with besides wine, aye?”</p> <p>Casper hung his head, wagging it back and forth. “You want to know about loss?” His voice was harsh and ragged. “Let me tell you something about loss.”</p><p>Before Thom could respond, there was a crash downstairs, and he leaped to his feet. “Frannie? Who’s there?”</p><p>There was no answer but the continual din of the birds, their cages rattling and their voices shrill and panicked. Thom rocketed down the stairs to find Frannie fallen on the floor, the white bludkitten inches away and sniffing her, its mouth open in disgust. A lavender cake was broken in pieces on the stones beside her hand, and her eyes were bugged out, their pupils pinpricks that rolled back and forth. He leaned close to listen for breathing, but all he could hear was the birds. One persisted in screeching, “A cracker, miss! I do say!” while a familiar voice called, “She’s a pretty lass, a pretty lass.”</p><p>Casper slid down the last three steps and leaned bonelessly in the kitchen door. “What’s up, buttercup?” he asked, eyes closed.</p><p>“Lass, what’s happened?” Thom asked urgently, his accent going thick with fear as he tried to sit her up. She had a pulse, but her body was rigid, the muscles hard and quivering, and her eyes unseeing. Of course, she couldn’t answer. Her teeth gnashed together, lavender foam dripping from her lips.</p><p>“She okay?”</p><p>Casper’s voice slurred low, and Thom gritted his teeth. It was fruitless to wish the musician was the one writhing on the stones so that Thom could turn his back and walk away. But it was Frannie, his Frannie, so he took her stiff hand in his and leaned close.</p><p>“I don’t know what to do,” he murmured. All his training in the navy and with the firefighting brigade hadn’t prepared him to help a wee slip of a lass with an unknown ailment, gasping on the ground. He had been helpless and far away when his wife perished, and he’d be damned if he’d watch, dumb and crying, as Frannie died.</p><p>“What’s wrong?”</p><p>With a roar, Thom shouted over his shoulder, “I don’t know, ye drunken fool!”</p><p>Staggering across the room, bottle still clutched in his hand, Casper upset Filbert’s cage before knocking a goblet off the table and falling to his knees at Frannie’s side.</p><p>“Poison,” he muttered, wobbling back and forth. “Best fetch a daimon.”</p><p>He fell over, already snoring, and Thom stood up and kicked him, just a little. “Bloody bastard!”</p><p>With one last look at Frannie and her insensible lodger, Thom ran for the back door. Some soft instinct made him close it quietly so Frannie’s animals wouldn’t have any further reason to panic.</p><p>He’d never knocked at Maisie’s door, and he knew it was the wrong time of night, but he would have woken Saint Ermenegilda herself if there was a chance of saving Frannie. It was dark in the alley, and a bludrat raised a warning hiss as he knocked hard enough to split skin on his already callused knuckles. Every second felt like an hour as he waited for an answer.</p><p>“Who is it?” an old woman croaked. “No vacancies!”</p><p>“I need Reve,” he shouted back. “Frannie’s been poisoned. Send a daimon, I beg you!”</p><p>Before she could open the door or argue, he was gone, slipping around the high brick wall and through Frannie’s door, to kneel by her side as the birds in the pet shop continued to batter against their cages. The noise was maddening, but none of it mattered.</p><p>“Just hold on, lass,” he whispered. “I need you.”</p><p>She was starting to turn blue, her legs kicking feebly and her eyes rolling to focus on Thom, almost pleading. When he couldn’t bear another moment of waiting, the back door opened silently. Reve crept in, a large bag at her side. The daimon’s skin was corpse-white tinged with lavender where it showed beneath her robe, but as soon as she saw Frannie, angry shades of red and black shivered over her like a fire at night.</p><p>“I know zis poison.” She spat into the fire and knelt to dig through her bag. “We do not have much time.”</p><p>“Can you cure her?” Thom asked.</p><p>The daimon didn’t look up from the shadows that seemed to gather around her bag. “That depends, Thomas Maccallan.” She held out a dagger. “What will you give to keep her alive?”</p><p>17</p><p>Thom looked hard at Reve and took Frannie’s hand again.</p><p>“I didn’t know ye were that kind of daimon, Reve.”</p><p>She smiled, or at least pulled back her lips in something like a smile. “I’m not. But ze poison came from a dark daimon, and their spells are best fought with love’s blood.”</p><p>He held out his arm. “Take what’s needed. I’ll no’ miss it.”</p><p>Reve scattered herbs on the stones and laid out a crucible before handing Thom her knife. “A finger will do. Just a few drops.”</p><p>He loosed Frannie’s hand, her arm standing rigid where he left it. With a quick cut, his blood dripped into the stone bowl, and he squeezed it until Reve nodded.</p><p>“That is enough.”</p><p>He was too busy holding Frannie’s hand to see what went into the daimon’s potion, although he did see her crumble a bit of the spilled cake into the blood. He also noticed, as time strung out, that she snatched up the close-creeping white bludkitten and stuffed it into her bag. Its cry was cut off abruptly, and it didn’t appear again. Finally, she took up a tiny silver spoon and carefully dribbled the liquid from the crucible into Frannie’s open mouth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It will take a moment to seep in,” she explained, sitting back on her haunches, her tail wavering over her head. “This is Mr. Sweeting’s work but poorly done. I know ze smell of his magic. I believe someone bought his poison too cheaply and applied it too hastily.” She nudged the spilled cake with the spoon. “Where did the cakes come from?”</p><p>Thom looked up, his eyes red and wet with tears. “I brought them.”</p><p>Her eyes went dark. “When? From where?”</p> <p>“Today, from the bakery on High Street, at her request. I stopped on the way here from work.”</p><p>Reve stood, a graceful, fluid movement. Her slender fingers barely touched the plate as she leaned close to sniff the remaining five cakes.</p><p>“Sprinkled on top like sugar,” she said. “Who else has been in ze house?”</p><p>“Since I arrived, only me.” He jerked his chin at Casper’s splayed form. “And him.”</p><p>Reve stalked across the room to where Casper lay in the shadows. He barely twitched as she leaned in close enough to kiss him, one hand on his chest. “Still bad news,” she muttered. “And getting worse. But he is a different kind of poison.” She glanced at Thom. “Stay with her. Don’t let go.”</p> <p>The daimon’s skin shivered over with shadows until all Thom could see of her was the glint of candlelight on her eyes. Moving like a stalking cat formed of smoke, she crept toward the door to the pet shop. The creatures within were still calling, fluttering, barking, scratching, and fighting against their cages. Reve disappeared through the door, dissolving into the darkness. Thom turned to Frannie, hoping beyond hope that she would move, or splutter, or blink. Anything.</p><p>But nothing had changed. Her eyes were going dry, and he reached out to close them, hoping to lessen her pain somehow before dragging her into his lap and stroking back her copper-colored hair.</p><p>“I’m still here, lass. I’m not leavin’ ye. Just hold on.”</p><p>In the pet shop, the birds took their chaos up a notch. The cages banged against one another, heavy wings slamming into the bars as the crows and parrots screamed en masse. The corgi pups took up a mournful, otherworldly howl. Thom wondered, for just a moment, if they could feel their mistress dying in his arms.</p><p>From the darkness of the pet shop, barely audible over the clamoring animals, there came a crash. Along with the sound of shattering glass, Thom heard a voice call out in anguish, shrieking in a language he didn’t know.</p><p>“Was that a terrarium?” Frannie whispered, and her shoulders shifted against him. He ignored the shop to pull her closer, tucking her head under his chin.</p> <p>Thom sent a silent prayer of thanks to Reve, to Ermenegilda, to the gods he had once cursed, standing before his own charred doorstep with a necklace of gray pearls in his hand.</p><p>“It doesna’ matter, little love,” he crooned. “We’ll get ye a new one.”</p><p>“What’s happened?” She tried to sit up, but her limbs were still weak.</p><p>“Bide a moment, love. Don’t try to stand yet.”</p><p>“But the shop,” she said, struggling harder. Another glass crashed, and a parrot mimicked a lady’s scream. “The birds—there’s something wrong in there. The bludkitten? I have to go calm them. That poor old parrot will have an apoplexy.” Her legs flopped against him like rubber, her fingers twitching.</p><p>Thom chuckled, giving her a squeeze. “There’s more important things just now.”</p><p>“Thom. Why can’t I stand? What’s wrong with me?”</p><p>“You were poisoned.”</p> <p>“By whom?” Frannie asked, her eyes searching his.</p><p>Reve stepped into the doorway, clutching a dark cloak hiding a limp figure. She tossed it onto the floor, and it rolled, unconscious, to face the fire.</p><p>“By zis miserable excuse for a daimon.”</p><p>18</p><p>It was a while before Frannie could stand on her own and even longer until the slight daimon in the cloak regained consciousness. By that time, the pathetic thing was bound to a chair with ropes from Reve’s bag that shimmered strangely in the firelight. With her hood pulled back, she seemed strangely small and starved, her skin smooth and slightly iridescent, like a fish’s belly.</p><p>“Who is your master?” Reve said, and the smaller daimon shrank back, turning her wasted face away. More softly, she added, “If you tell me, I may be able to free you.”</p><p>“Master Kind.” The daimon’s voice was high and quavering. “Bought me off Sweeting with the song of his heart. Told me he loved me. Promised he’d set me free if I did as I was told.”</p><p>“What were you told?”</p><p>“Kill that.” The daimon gestured to Frannie with her pointed chin, and Thom moved forward menacingly, his hands in fists at his side. Reve gave him a look and shook her head, and Frannie pulled Thom back with two still-weak hands around his wrist.</p><p>“Tell me exactly what you were told, word for word. I will know if you lie.” Reve’s tail curled over her head and was poised, waving like a snake, inches from the other daimon’s eye.</p><p>The daimon didn’t flinch, only narrowed her eyes at Frannie. “That one”—she cocked her head at Frannie—“stood in the street over that one.” They all turned to follow her stare toward Casper, who slumped against the wall behind them, looking half-asleep and mid-nightmare. “Master Kind pointed and said, ‘Kill that man, and I’ll set you free. Don’t be seen or leave behind anything that can be traced to me.’ ” The daimon shrugged narrow shoulders and looked down, pained. “I been trying. I been following everywhere. I been failing. It’s awful hard to kill. I was waiting, this time, to make sure. That spell was hard bought.”</p><p>“Master Kind? Edwin Kind?” Frannie said. “The musician?”</p><p>“Not much of a musician, if you ask me,” Casper muttered.</p><p>The daimon nodded. “He’ll never have me now. Never.” She burst into tears, her thin body shaking horribly.</p><p>“Do you think,” Casper said slowly, carefully enunciating each word, “that he meant to kill me?”</p><p>Frannie, Thom, and Reve all turned to glare at him.</p><p>“Of course, he meant you, ye great ninny!” Thom said. “The puir wee thing just botched it.”</p><p>“But I’m not a man,” Frannie said. “Kind pointed to the two of us and told the daimon to kill the man. What would make the daimon think . . .”</p><p>Casper lurched up and staggered to the door, furious and panting. “I’ll be leaving now,” he said, voice ragged. “I’ll send for my things. Better yet, keep them to pay for the trouble I’ve caused you. Good-bye, Frannie. I’m sorry. For everything.” Bottle in hand, he slammed the door and disappeared into the alley.</p><p>“What was that all about?” Frannie asked, throwing her hands up in the air and sitting in a chair before her legs could collapse beneath her.</p><p>Thom rubbed his chin, watching the door. “It means Casper’s not human,” he said thoughtfully. “But what is he, then?”</p><p>Reve smiled a secret smile. “I don’t think even he knows yet,” she said. “But I suspect he will find out rather soon.”</p><p>Reve took the other daimon with her into the night. No matter how often and how many ways Frannie asked what would become of the pathetic creature, Reve simply pursed her lips.</p><p>“Daimon business is daimon business” was her only answer. “She will trouble you no more.”</p><p>Thom locked the door and glanced into the pet shop, but the birds and pups had quieted. He turned on the light and winced. “The wee green snake is a bit of a mess,” he said. “Smushed.”</p><p>“It’ll keep till morning. And good riddance.” Frannie put her head in her hands. Her lips were still numb, her eyes achy and stinging. “Good heavens, what a wreck. And we never finished dinner.”</p><p>“That’ll keep till morning, too, lass. And it could still be poisoned.”</p><p>For the third time—or fourth, she kept losing count—Thom picked her up and carried her upstairs, depositing her gently in her bed. His big hands were surprisingly nimble with her bootlaces and tender as he rolled down the high stockings.</p><p>“Top drawer,” she said, cutting her eyes to the dresser. “On the left.”</p><p>He obediently fetched her other nightgown as she unbuttoned the sweat-soaked blouse and slithered out of the heavy tweed skirt. When he turned around to find her in only a corset and petticoats, he swallowed hard and squeezed his eyes shut. “I can’t be lookin’ at ye like that, not when you’re half-killed.”</p><p>“I’m still half-numb, honestly. And yet I feel better than I have in days. No one’s going to try to murder me tonight, and that’s rather saying something. Except the kitten—”</p><p>“Reve took it,” Thom said. His eyes roamed over her, cautious but glowing, and he unconsciously balled the forgotten nightgown in his hands. “Nothing to be afeared of. I’ll keep ye safe, lass.”</p><p>She held out her arms, and although they shook a little, he gladly settled into them and curled on the bed beside her. “If I asked you to kiss me, would you?” she asked.</p><p>“I shouldn’t. Ye were on death’s door, woman!”</p><p>“But now I’m on the other side. Just hold me close, and don’t let go, aye?”</p><p>He dropped the nightgown onto the floor and stroked her hair back before cupping her face and kissing her, soft and warm and sweet. “I can help ye with that,” he murmured. “But I’m no’ bringing cakes this time.”</p><p>19</p><p>Three days later, a knock on the pet shop door set the puppies howling. Frannie was distributing seed to the sleep-ruffled birds as Thom dodged Filbert and swept up spilled hay and feathers, clad only in trousers and shirt. It wasn’t yet opening time, and their eyes met across the room, cautious.</p><p>Thom reached the door first, peeking through the glass before unlocking it and looming at full height over the ragamuffin on the doorstep. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fancy fella told me if I brought you this, you’d gimme his jacket,” the lad said, rubbing his smudged nose with a fist. He held out a normal-sized box wrapped with brown paper and tied with twine. Thom shrugged at Frannie, and she hurried upstairs, returning with the gaudy, glittering jacket Casper had worn the first day she found him, speckled with yark and mostly dead in the alley. It was clean now and the only thing left in Bertram’s old room. The lad grabbed it with a grin and took off, and they shut the door to stare at the box.</p><p>“Ye don’t think it’s another incendiary device, do ye?” Thom asked.</p><p>Frannie just smiled and shook her head. “He meant well. Even Reve said he meant well.”</p> <p>They took it to the counter where Frannie had once unwrapped a viper. She snipped the twine with scissors and let the paper fall away. The box was plain and unmarked, and Thom poked it hard with a finger. When nothing strange happened, Frannie set trembling fingers to the latch and opened it.</p><p>A thick scroll was on top, the papers rolled up and tied with a red ribbon. Underneath that was a heavy package wrapped in thick velvet. When Frannie pulled it out, a posh jacket unfolded, and the heavy weight it had held dropped to the counter with a clank. Frannie held the bodice at arm’s length, noticing that between the fabric, the cut, and the gold thread around the edge, it was possibly worth more than a parrot.</p><p>“It’s too much,” she murmured.</p><p>Thom chuckled. “If ye think that’s too much, look at what else the bugger sent.”</p><p>Frannie rolled the tubes of silvers back and forth under her glove. There were five of them.</p> <p>Unrolling the scroll, she found a writ and a letter:</p><p>Dear Frannie,</p><p>First of all, I apologize for nearly getting you killed. You showed me nothing but kindness, and I exploited your generosity in the worst way. You were right not to trust me. In return, I give you a jacket to replace the one ripped by the arrow and five rolls of silvers, one for each time the daimon aimed for you instead of me. I’m very glad she missed. That should cover my rent and hopefully ensure that you won’t take any other risky lodgers.</p><p>The writ is a bit trickier. I’ve a confession: I found your garden. I was turned around and looking for my bottles and found the door in your closet one morning while you were in the shop. I couldn’t help going upstairs, and once there, I couldn’t help falling in love with the place. I haven’t felt the sun like that since I came to Sangland, nor have I smelled healthy grass and growing fruit and, heaven help me, manure. I know now why you’re so guarded about your home. This writ from the Magistrate himself gives you complete ownership of your building and, more important, the space above it. Such things are possible, if you know the right people. It’s yours now, for keeps, and you needn’t fear the Coppers.</p><p>You were a good friend to me, and you taught me something very important about opening your heart to creatures that need comfort. And Thom, damn him, taught me something about being a man, although I don’t know if I’ll ever have the chance to apply it. The one time I could have helped you, I was drunk with self-pity, and that’s my biggest regret so far, which is saying a lot.</p><p>I’ve sent a letter to Reve as well, thanking her for her part in keeping you alive. I suspect she appreciates my latest costuming commission even more. I’ll be in London, playing piano, and my box is yours any time you wish it.</p> <p>Best regards,</p><p>Casper Sterling</p><p>Frannie looked up, one hand resting on the coins as if they might get up and walk away. “Is it wrong to take money from a debauched gadabout?” she asked.</p><p>Thom lifted a tube and stared at the silvers winking from either side. “You’ve more than earned it, puttin’ up with him.”</p><p>She looked up as if she could see through the ceiling and the upper story, all the way to the rooftop garden. “We should celebrate. All my worries, fixed in one fell swoop.”</p><p>“All your worries?”</p><p>“The garden’s safe. The shop’s safe. I’m safe.” She stepped close, one hand on his arm as she went up on tippytoes to kiss his cheek. “And I have you.”</p><p>“Aye, well, that does seem like you’re in rather a good patch,” he admitted, his arms curling around her waist and pulling her close for another kiss. “And tell me, Miss Pleasance, how would ye like to celebrate?”</p> <p>Frannie checked that the door was locked and dropped Filbert into his cage. Grabbing Thom’s hand, she pulled him toward the stairs.</p><p>“Let’s celebrate in the garden, where it all began,” she said.</p><p>“What about the shop? It’s five past ten.”</p><p>“Let the pets take care of themselves.” She grinned. “It’s my turn.” </p> </body></html>"]