["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>I’m going to kill my brother.</p><p>Roman Steele muttered under his breath as he ended his shift, carefully checking the cards and organizing his table. He’d only been in Vegas for a few short weeks, and already his older brother bossed him around. After convincing him to transfer from Atlantic City, Rick set him up with a woman for the evening. Rome’s temper cranked up a notch. When he got a hold of Rick, he’d kick his ass. He didn’t need help recruiting a female for company, despite his brother’s good intentions.</p><p>With methodical precision, he counted out chips and stacked decks while he brooded. The casino swung into overload as night arrived in full blown, Vegas style. The ching of the machines vibrated with noisy celebration and competed with screams of rivalry around the roulette table. The lushness of the casino beckoned both the novice and experienced gambler to play. From the dripping crystal chandeliers to the merlot carpet, opulence flashed from every room and pampered the crowds. Cocktail waitresses rushed by in low cut tops and short skirts, balancing trays filled with vivid neon drinks. The familiar scents of exotic perfume, musk, and money drifted in the air. He held back a groan. He craved a soft bed and a hard drink. Alone. Instead, the call from his brother beckoned him with other possibilities.</p> <p>The perfect woman.</p><p>He snorted at the impossible thought. The popular dating service,1Night Stand, supposedly hooked up clients for the night with an ideal match. His brother actually believed Madame Eve, who ran the company, possessed the magical power to find him his soul mate.</p><p>Mid thirties threatened and he still hadn’t found someone to challenge his normally dominant side. Moving to Vegas only made him more depressed as he dated the same women over and over, chasers of money and glory, out for a man to finance their dreams, or to find a cheap thrill for the night. The bars continuously contained a tight knit cluster of friends on a weekend visit for an episode of Girls Gone Wild. If he saw one more drunken wink with the accompanying drawl, Everything in Vegas stays in Vegas, he’d vomit.</p><p>Hell, he’d become a grump.</p><p>Since Rick began working for Castillo Resorts and Hotels, his brother seemed focused on getting Rome married and settled. Not that Vegas was the best place to put down roots, but Rick had changed since meeting his wife, and wanted to share the bliss. Seems Madame Eve hooked his brother up with Tara. Rick now touted family and commitment, and actually admitted he wanted children. He never spoke of details, but his obsession with Rome using the company’s services convinced him that his brother actually believed his one-night stand had potential for more.</p> <p>Ridiculous.</p><p>He ignored the deep pang in his gut and buried it with the ease of an expert. Images of a woman by his side for the long term haunted him. His relationships always lacked something crucial. He craved a woman who challenged him on every level—inside and outside the bedroom. Someone who wouldn’t fear his need for dominance and surrender without the strict rules and limits of a Dom/sub relationship. He shook his head at his inner whining. He needed to get the hell over himself and get off. He’d probably feel better.</p><p>Grabbing his bag, he changed out of his uniform, and headed toward the bar for a quick drink.</p><p>His phone vibrated and he glanced at the text. Bonjour, Roman. Your brother speaks highly of you. Are you ready to begin your adventure?</p><p>He hesitated. Hell, what did he have to lose? A night of great sex with no strings attached. Before he could change his mind, his fingers flew across the keys. Good evening, Madame Eve. Since my brother leaves me no choice, I’ll put myself in your capable hands.</p><p>The phone shook in his palm as if in excitement. Very good. You will find her seated at the blackjack table, far right, second chair from the left. Short dark hair. Dressed in black. Her name is Sloane Keller. Bon chance.</p> <p>The screen went blank.</p><p>He shook his head as the call dropped. Then with a jump, the Blackberry zinged back to life. His back itched between his shoulder blades. The same damn feeling he always got when something big hovered in sight. Like a cheat at his table counting cards. Or a woman about to play him.</p><p>Walking past the bar, he headed toward table six. He needed to loosen up and not take the encounter too seriously. His older brother had bought him an evening with a woman—hopefully one he was compatible with. No reason to bitch and look the proverbial gift horse in the mouth.</p><p>He stopped dead and stared at the woman in black at table six.</p><p>Her name suddenly rang through his head in a symphony of clanging bells. Sloane Keller. Champion of the World Series of Poker. The Queen of Cards.</p><p>His mouth snapped shut. Was this a joke? A revised version of Candid Camera? He’d been half in love with her since she’d stumbled on the card scene with a cold confidence that pissed everyone off. She’d come from behind and won her first poker championship with the big boys. An unknown, unnamed long shot everyone expected to laugh out of the game. With icy deliberation, she knocked every other player off the table and never batted an eyelash with victory.</p><p>Shit. She’s gorgeous.</p><p>His gaze swept over her with a greediness he’d never experienced. The woman practically exuded I dare you to any guy within distance. Her hair shimmered under the lights, an exotic black cherry, falling pin straight to brush the top of her shoulders. Longish bangs hid most of her features until she turned her head, and he caught a whirling impression of strength. A stubborn chin. High cheekbones. Arched dark brows. Thick eyelashes. Her lips were ruby red and not overly puffy like the normal Botox look. No, they were perfectly sculpted with just a hint of plumpness in the lower one. Her outfit added to the impression of lean power—a sleeveless black silk blouse, dark trousers, low-heeled sandals. She perched on the chair as she stared at her cards, her blood red toenails tapping on the bottom rung. Her fingers were lightning quick, the nails matching the color of her toes.</p> <p>Suddenly, she paused. Her shoulders tightened and she swung her head around with a hint of annoyance. Her gaze slammed into his with a fierceness and challenge that singed his nerve endings and his cock. Eyes a bottomless violet sucked him in as deep as he imagined her wet pussy would welcome him. But it wouldn’t be easy. Everything about the woman screamed the need for an alpha to take her under him. Figuratively and literally.</p><p>He met her stare dead on and refused to back down. A few beats passed. Then she turned away with a dismissive shake of her head, obviously irritated she’d lost the skirmish. Satisfaction thrummed in his veins. Finally. A woman he could sink his teeth into without worrying. I bet this woman would bite back.</p><p>Why the hell had she signed up for a 1Night Stand? She had her own groupies—men who’d line up to take her to bed. Vegas looked upon her as a literal rock star.</p><p>He took stock of the situation. There must be a damn good reason she used a dating service to get laid. Her dismissal told him she cared less if he’d been bought and paid for. She refused to stroll off with any man, even if Madame Eve arranged it. The deliberate action told him he’d need to earn his time with Sloane Keller.</p><p>A smile played about his lips.</p><p>Game on.</p><p>He closed the distance between them.</p><p>She watched the man approach her table with her peripheral vision and pretended to be engaged in her hand. Is this him? Hell and damnation, the man is hot. Of course, she’d met many hot men in her travels. Most of them crumbled under the personality test, but something told her he’d hold his own. In fact, maybe he’d even surpass her.</p><p>Madame Evangeline might have scored a home run.</p><p>He was a mixture of George Clooney and Richard Gere, with short gray hair cut close to his scalp. A sexy, scruffy beard hugged a perfectly sculpted jaw and set off the sensual curve to his bottom lip. His eyes glimmered with a controlled strength and he moved with a predatory grace as he crossed the room. Was he former military? A shiver tingled down her spine. The thin white shirt and black pants did nothing to mask his rock hard body. She tried to control the dip in her tummy when he stood beside her. When was the last time a man excited her at first glance? His body heat and the delicious scent of lemon and spice rose to her nostrils. She kept her head down, gaze on the cards, and waited for his first move.</p><p>She tapped her finger on the table for a hit. Jack of spades smiled up at her. The dealer nodded and slid the chips toward her as she met the goal of twenty-one. Then she looked up.</p><p>He didn’t speak, but his gaze drilled into hers. The odd combination of blue and gray reminded her of rainy skies and stormy seas. He waited by her side as if enjoying the game of blackjack for pleasure. She knew from the 1Night Stand report that he worked as a dealer at the Castillo Resort. Would he have the balls to play a round with her?</p><p>She raised her hand to her dealer, Wayne, for a short pause then swiveled in her stool to face the man beside her.</p><p>“Were you ever going to introduce yourself?”</p><p>His bold appraisal stripped her naked and pumped her with pleasure. An amused smile touched his carved lips. “Didn’t want to break your concentration. Besides, it seems we have all night, Sloane Keller.”</p><p>She raised her brow. “Perhaps. And you are?”</p><p>He seemed even more pleased at her obstinacy. “Roman Steele. You can call me Rome.”</p><p>He looks like a Rome. She imagined him dressed in armor and chains, leading an army of men with no thought to being disobeyed. Imagined him standing over the bed of a naked woman, ready to enjoy his spoils.</p><p>As the only player at the table, Wayne waited patiently for her to decide whether or not she wanted to continue. She upped the stakes. “Do you play?”</p><p>“Of course.”</p><p>“What’s your pleasure?” She dropped her voice to a husky drawl.</p><p>He bumped a hip against her chair. “Poker, of course.”</p><p>She wondered how he’d handle her. Most men she met either fawned like a groupie or treated her like shit. Since he was bought and paid for, she figured she’d test him before she made her final decision. If she didn’t like him, she’d demand her money back before they even hit the elevators. “Funny, me too. But I like a good game of blackjack to relax.”</p><p>“Are you good?”</p><p>She smiled slowly. “I’m the best.”</p><p>“Cocky, huh?”</p><p>“Confident.” She leaned forward. Her lips stopped inches from his. The sizzling tension between them stretched in exquisite agony. “Not that I mind a little−cockiness.” Her gaze lingered on his lips then dropped slowly to the evident bulge in his pants. “As long as someone can back it up.”</p><p>Smoke gray eyes heated and sharpened like lightning. “Oh, I can back it up.”</p><p>“Care to play a hand with me?”</p><p>“Thought you’d never ask.” He slid onto the stool next to her and motioned to Wayne to deal him in. “So, you in Vegas for business or pleasure?”</p><p>She watched the cards fly and leaned back in her stool, automatically searching for clues in his face to find what type of player he was. “Pleasure tonight. Business tomorrow.”</p><p>“Big tournament, huh?”</p><p>She nodded. His casual reference held no adoration or resentment. In fact, he wasn’t the least bit intimidated. A thrill shot down her spine and right between her legs, leaving her hot and wet. As the Queen of the Cards, she hit the high stakes signature poker room at the Castillo regularly. At a minimum of $20,000 to grab a seat, she believed the play integral to honing her skill in the competition of the World Series of Poker. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Two wins placed her name at the top of the charts in Vegas. Unfortunately, most men couldn’t handle the intimidation. Her last relationship bombed so badly she’d teetered on switching teams and going full lesbo. Not only was she physically hard up, it had been so long since she enjoyed an honest, open relationship she worried she’d become one of those very rich spinsters who spent their life doing things for charity. She fought a shudder at the thought.</p><p>But Rome Steele didn’t seem too afraid of her.</p><p>And, God, she needed an orgasm.</p><p>How humiliating. The tabloids stalked and publicized her exotic hook-ups. Fortunately, the press had no idea they were mostly visual candy to throw people off track. Some of her most well known escorts were only good friends or gay. The ones she attempted to actually sleep with were...disappointing. Something must be wrong with her. Her climaxes gave her barely a hiccup of pleasure. She craved a man’s body under her hands and warming her bed, so when her friend told her about Madame Eve, she decided she had nothing to lose. She did not engage in one-night stands for the risk factor. She believed in controlling all details, from her work to her play.</p> <p>Pushing away her thoughts, she concentrated on her hand. Ten of clubs for her. Deuce for her one-night stand. She kept her head down and watched from the corner of her eye for every nuance of expression, and dug deep into her gut. Yes, he wasn’t a safe player. Not stupid, but he liked risk. He’d ask for a hit fifty percent of the time when he should stay. She watched the dealer flip up an ace for himself.</p><p>She tapped her finger twice on the table. The solemn face of the Queen stared up at her. She hid a smile and put out her hand in the hold gesture. Rome’s card slid across the table. Eight of hearts. A slight hesitation did him in, and his next hit revealed a six. Done.</p><p>Wayne kept his expression neutral as he dealt himself a card. Five of spades. Without a flicker of an eyelash, he hit himself again. Ten. Done.</p><p>The chips slid into her pile to match her first mound. She waited for the fake expression of awe she usually received from her dates. Instead, he treated her to a wolfish grin that promised he’d eat her for breakfast and enjoy every last bite. He grasped her wrist in a firm grip and pulled her forward so their lips were inches away.</p><p>“Nice warm up. But can you do it again?”</p> <p>She laughed with sheer pleasure. “Of course.”</p><p>“Fine. Do it again and you get me for the night to do whatever you want.”</p><p>She gazed at him with suspicion. “I already did.”</p><p>“Not yet.”</p><p>Admiration cut through her. This man was not led around by his cock. Curiosity teased the question from her. “What do you get if you win?”</p><p>Determination and promise gleamed from his blue-gray eyes in warning. His voice dropped to a growl. “You, of course. But you’ll listen to everything I say without any back talk.” He paused and deliberately stared at her with the look of a warrior issuing an order. “And obey.”</p> <p>She gave him an icy glare. “Excuse me?”</p><p>“You heard me.”</p><p>Her thighs clenched and her panties grew damp. Why did his commanding tone turn her on? Her nipples tightened painfully, her body on full alert, practically begging him to make good on his threat. She forced the excitement down, knowing she’d win. She always won. Still, he never backed down, and she wanted him in her bed. She licked her lips and nodded.</p><p>“Done.”</p><p>Wayne dealt the cards. The stately king of diamonds winked at her. Rome took a five. The dealer turned over a lucky seven. They moved to the face down cards.</p><p>Her senses opened up as her view narrowed to the dealer’s hands, and the cards on the table. She looked at the next card, poised for the flip, and imagined an ace. She watched the ace unfold and put her hand out to stay.</p><p>Rome took a ten. She knew the odds favored a bust. The man never even paused, just tapped the table. Six of spades. Twenty-one.</p><p>The dealer busted and they both raked in chips. Sloane glanced up at Rome and found no emotion etched on his face. Definitely a good dealer. His quick movements and stone face challenged her. Her respect nudged up a few notches. She’d dated dealers before, hoping the knowledge and shared love of the game would be a bond. Usually, they ended up pissed off at her for winning most of the time, or became clingy when she wanted to play in other casinos.</p> <p>He didn’t look concerned or overly interested. They set themselves up for round two.</p><p>This time she hit twenty. Wayne held at eighteen. And her one-night stand surprised her for the second time that night.</p><p>His cards added up to sixteen. She prepared to leave the table with her winnings, cash out, and have some very good sex with her Roman warrior. Instead, he tapped the table for a hit.</p><p>If she hadn’t been so used to guarding every emotional reaction, a gasp would have escaped her lips. Why would he hit? The odds were almost impossible not to bust. Her eyes widened slightly as she waited for the card.</p><p>Six of clubs.</p><p>Blackjack.</p><p>Son of a bitch.</p><p>He pulled in his chips and turned to face her. No hint of victory marred the carved lines of his face, or the steady gleam in his eye. He said a few words to Wayne and slid some chips across the table for the tip then he stood and offered his hand. “Your room or mine?”</p><p>She blinked up at him and tried to school her features. When was the last time she lost a hand to an amateur? The glint of purpose in his ocean eyes told her he knew her thoughts. The sudden turn of events slammed into her like a launched champagne cork.</p><p>I agreed to do anything he said.</p><p>The answering thrill hit her body as fast as her mind. She grew wet and achy, ready for him to take charge. He’d won. There was nothing she respected more in another player...or in a man.</p><p>Her voice caught on the word. “Mine.”</p><p>His fingers interlaced with hers and he gently tugged her off the stool, making sure to scoop the chips into her cup. “Lead the way.”</p><p>They walked in silence to the elevators. Never spoke as the doors swooshed open on the thirty sixth floor for the Penthouse suites. She ushered him in and clicked the door behind her. He scanned the lush interior with a quick dismissal that confirmed his ease with luxury hotels. Castillo Resorts rivaled the best in Vegas, and she only stayed at the best. The gorgeous colors of the desert theme interspersed the room with a cream sectional sofa, rich cherry wood dining area, and a wet bar taking up one entire side. The oriental carpet and watercolor canvases lent an exclusive feel to the suite. The ceiling-to-floor windows gave an aerial view of the shimmering lights of Sin City during a hazy sunset.</p><p>He walked to the wall and hit the button. With expert grace, the blinds slowly closed and blocked the city from view, shrouding the room in a shadow. He took charge of her room as if he owned it, and her. A virginal shiver slid down her spine and she stood rooted to the ground in a strange mixture of fear and anticipation. He closed the distance between them with a few strides.</p><p>Then smiled.</p><p>She sucked in her breath at the flash of white teeth amidst the sexy stubble of beard that covered his upper lip and jaw and at that moment, it wouldn’t surprise her to spot fangs. He looked exactly like a wolf about to enjoy long hours toying with his meal.</p><p>“Let’s play, Sloane Keller. Take off your clothes.” He leaned forward an inch so his warm breath struck her trembling lips. “Now.”</p><p>Chapter Two</p><p>Rome took in the slight widening of gorgeous violet eyes and held back a chuckle. The Queen of Cards seemed off balance, probably for the first time in her life, and he loved every moment of it. He intended to use the next few hours wisely and wring out every last ounce of pleasure. For both of them. If this worked, he figured he’d send Madame Evangeline a crap load of flowers. The woman in front of him called to every sense of challenge in his arsenal, and his dick stiffened to full staff. Forget the toys tonight. She’d insist on his best weapons—his mind and dominance. She exuded all the characteristics he craved in a woman: headstrong, confidant, assertive. With a soul that cried out for a man to tame her so she could receive the ultimate in pleasure.</p><p>And he was just the man to give it to her.</p><p>He raised an eyebrow in question. He made sure his voice slapped her like a whip to attention. “Make me ask again and you won’t like the consequences.”</p><p>Heat burned her cheeks, but her nipples hardened like pebbles and poked against her shirt. “Screw you.”</p><p>He shook his head in mock disappointment. “I guess we’ll have to do this the hard way.” With deft motions he unhooked his belt, pulled it through the loops and grabbed her hands behind her back. Her gasp of outrage heated his blood as he tightened the leather until her hands were snugly cuffed behind her back. She began to thrash and fight back, but he moved quickly and slammed her body against the wall, trapping her. He kicked her feet out and pressed his knee between her thighs so she remained open to him. With his free hands, he grabbed her jaw and forced her head still.</p><p>He watched her carefully for any sign of fear or panic. Instead, her pupils dilated, her pulse beat rapidly at the base of her neck, and lust gleamed from her eyes. The lady didn’t want to admit it, but she liked to play games in both the casino and the bedroom. He wondered if any man before him ever had the guts to take the upper hand.</p><p>“Anything else to say before we begin again?”</p><p>“You son of a bitch—”</p><p>He stamped his mouth over hers. With one quick thrust, he parted her plump lips and pushed in. Hot, wet satin and the sweet taste of woman swamped him, mingled with the unique taste of coffee, mint, and spice. She met him full force, her tongue forcing him back in a battle he intended to win. He sucked at her lower lip, bit her, then ravished her fully until he wrung a moan from her delicious mouth. His hands worked the buttons of her blouse free, slipping the material over her shoulders and down her arms so it hung loose around her tied wrists. One snap and the fragile lace bra fell to the ground. His thumbs moved over sensitive nipples flushed a ruby red. He plucked the tight buds and squeezed until she slumped against the wall.</p><p>“I’m going to make you come so many times you’re going to beg me to stop,” he whispered against her lips. His teeth nibbled along her jaw and worked his way to her ear. He bit the lobe and blew gently. She jumped, and he caught her musky scent of arousal. “But you have to be a good girl for me. Can you do that?”</p><p>He watched her struggle to gain the upper hand. She pushed against him in one last desperate move to win.</p><p>The instinct to conquer and possess speared him. With a low chuckle, he pushed down her black pants and dipped his head to take one hard nipple in his mouth. He laved her with his tongue and sucked while his other hand slid past the elastic of her panties. Hooked under the lace fabric. And dived into home.</p><p>She cried out and arched upward. Dripping wet heat met his hand, but he backed off and kept his touch deliberately light. He traced her swollen folds while he worked at her nipple, until his name chanted in his ear to his satisfaction. Slowly, he lifted his head and removed his hand.</p><p>Fucking gorgeous. Violet eyes fogged with need and a naked desire. He pressed his hand to his nose and breathed in her essence. A raw animal response thundered in his veins, like a horse wanting to mount and possess in a fury of lust. If he wasn’t careful, he’d plunge inside of her and spill his seed like a teenager. He clamped down on his need and took a deep breath. In order to break down her barriers, he needed to go slow. By the end of the night, she’d completely submit to him, body and soul. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Are you ready to give me what I want?”</p><p>Her voice was ragged. “Yes.”</p><p>“Good. I still don’t trust you so I’m leaving the belt on. I’m going to remove the rest of your clothes. Lie on the bed with your head by the board.”</p><p>Her legs shook but she obeyed with no delay, positioning herself on the king size bed as he requested. He took in every inch of her nakedness with appreciation. Long legged and slim, she moved as gracefully naked as clothed. Her nipples jutted out from perfectly formed, plump breasts. Smooth golden brown skin gleamed like cocoa butter. Dark pubic curls covered her inner lips, but he spotted a flush of moisture and the nub of her clit, already heavily aroused.</p><p>He walked into the bathroom to snag the plush robes hanging from the hook. He grabbed two belts and returned to the bed. With quick motions, he unhooked the leather belt and freed her hands. Before she could say anything, he pulled her arms over her head, re-attached the belt around her wrists, and secured her to the elaborately scrolled headboard.</p><p>“What are you doing?”</p><p>The sharp edge of demand tinged her voice, and admiration cut through him. She’d never bore a man—always challenging him on every decision, and he loved it. He quickly looped a cloth sash around each of her ankles and tied her to the footboard. The hotel’s rooms were well known for catering to a taste in bondage, and the choices of bedroom furniture proved an asset. “Taking away your choices.”</p><p>Her brows furrowed as she tested the hold. “No. I want to touch you also. Untie me.”</p><p>He flashed a grin at her haughty tone while she lay spread-eagle on the bed. “I won the hand so we play my way. Lay back and enjoy the ride.”</p><p>She wiggled one foot and struggled against her bonds. “I’m not one of your groupies. I have my own demands to make and never take a free ride.”</p><p>Bingo. Sloane Keller was so obviously used to calling the shots and making sure she won in bed, she forgot to surrender and receive.</p><p>His cock throbbed painfully against the fabric of his pants. She’d fight him the whole way until he gave her the first orgasm. Making a quick decision, he stripped quickly. He needed her pliant so he had the time to take her in his own way.</p><p>Her gaze hungrily roved over him, but he didn’t give her much time to look. Kneeling on the bed, he placed a hand on each of her thighs and caressed the trembling flesh.</p><p>Her breath came in huge gulps as she fought her body. “What are you doing! Didn’t you hear what I said?”</p><p>“Oh, baby, I’m not giving you a free ride. But if we’re going to go any further, I need you to listen better. So, I’m going to let you come.”</p><p>“You bastard! Don’t you dare, I refuse to come on command for you.”</p><p>He lowered until he’d settled between her legs. “Let’s see who wins this round.”</p><p>“Roman, I—oh!”</p><p>He parted her lips and touched his tongue to her throbbing clit. A rush of liquid warmth met him at her entrance, as he teased her with quick licks of his tongue that never gave her the pressure she craved. She bucked underneath him and panted. She tasted like heaven, musky and fragrant. He worked one finger into her and slid in and out, giving her a tiny taste of what his cock would do later on. Her cries became frenzied as she moved close to the edge, and with one swift movement, he pressed his tongue against her hard bud while he plunged three fingers in her channel in savage demand.</p><p>She screamed and convulsed around him. He cursed viciously under his breath at her open, naked response and kissed her, stroking her legs as she rode out her orgasm. She fell limp on the mattress, her vivid burgundy hair fanning the clean white pillows in stark contrast.</p><p>He moved up and cuddled her, massaging her arms so her muscles didn’t get sore in the bound position. He removed the sashes from her feet, but kept her hands tied. Her stubbornness still lingered, and she hadn’t surrendered completely to him yet.</p><p>But she would.</p><p>Sloane lay against his hard, muscled length and enjoyed the tender caresses on her skin while she floated back to earth. Dear God, what did he do to me? She’d never had such an intense orgasm before. In a matter of an hour, she’d been rebuked, tied up, and ordered around in a way she’d never thought possible.</p> <p>And she liked it.</p><p>No, she admitted. I loved it.</p><p>A quick glimpse of his naked body showed corded arms and chest, literal six pack abs, and a huge, throbbing cock. Her mouth dried at the thought of wrapping her lips around such power. Easily over six feet, he loomed fierce and treated her as a captive from the spoils of war. He forced her to walk a fine edge of fear and lust, until she didn’t know how to react.</p><p>In all of her past relationships, she’d never been ordered around in the bedroom. Some men tried, but one strong protest and they backed off. She’d never been a non-participant in sex, yet this stranger had gotten her off in a matter of minutes and she hadn’t even laid a hand on him.</p><p>He pressed a kiss to her forehead, smoothing back her hair, and sudden tears pricked her lids. Disgusted by her weakness, she pushed the emotion back and concentrated on conversation to keep her mind strong. “Where did you come from?”</p><p>His chest rumbled with laughter. “Atlantic City. I worked as a dealer there for years, but my brother wanted me in Vegas. A job opening came up with Castillo Resorts so he finally convinced me to take it.”</p><p>“Hmm, who’s your brother?”</p><p>“Rick Steele.”</p><p>She picked her head up. “I know Rick. He’s a friend of Jackson Castillo. That’s how I found out about Madame Evangeline. I knew I’d be playing this week and Jackson gave me the contact information.”</p><p>“Hmmm, interesting. My brother set this up for me, too. What were you looking for, Sloane?”</p><p>A man to make her forget she always had to be in charge. A man to cuddle her and make her feel feminine and cared for. A man to challenge her mind and make her spirit soar. Everything a woman wanted and dreamed about and everything a woman doubted she’d ever find.</p><p>“I moved to Vegas about a year ago since most of my work took place in tournaments around the city. I have a poker tournament this week and I needed to blow off steam. I don’t usually do one-night stands, though you probably won’t believe me. But I wanted company on this tour, and I wanted to be safe. Madame Eve’s service seemed to fit the bill.”</p><p>“I do believe you.” His warm voice steadied her and she relaxed. She sensed when people told her something just to appease her, but he only spoke truth since the moment she met him. “I guess it’s hard to believe such an extraordinary woman would need an outsider to keep her company.”</p><p>She laughed. “I’m a workaholic, and I’m careful who I get involved with. I guess you could say I’m extremely picky.” She gazed into stormy eyes and looked for her own answers. “I’d say the same about you. Looks to me like you don’t need help finding company.”</p><p>His lips kicked up in a smile. “I’m picky, too. Haven’t found what I’m looking for, so my brother wanted to step in and help.”</p><p>“Help get you laid?”</p><p>He rolled to loom over her. His eyes glinted with something she couldn’t name. “Help me find the one.”</p><p>Naked want rose her throat and strangled her. She pushed it back with her usual ruthlessness and tried to seem casual. “With a talented mouth like yours, I’d say you’ll find her.”</p><p>“Yes. I think I will.”</p><p>She squirmed under the intense heat of his stare as his face changed. Sensual demand gleamed from his eyes and his mouth hardened into a thin line. “Ready for round two?”</p><p>Her heart thundered like a pack of thoroughbreds out of the gate. “I don’t think—”</p><p>“I do.” His mouth came down on hers with rough command. She fought back for a moment before giving in to the delicious feeling of being conquered and forced to release control. He nibbled at her bottom lip, her jaw, while his hands massaged her breasts and his fingers tweaked her nipples to hard points. Her clit swelled and pulsed with new demand, as if her last orgasm only made her more susceptible to every lick of his tongue and touch of his fingers.</p><p>“You taste delicious,” he growled, working his way down her body. “I want to know every pleasure point. Every weakness. Does this feel good?” He pinched her nipples. The quick pain shot straight to her pussy and juices trickled down her leg. “Tell me,” he demanded.</p><p>“Yes.” She forced the words out.</p><p>“And this?” His teeth pulled and bit her sensitive nipple. His tongue swirled as his hands massaged her ass, slipping one finger into her crack. Heat burned and licked her nerve endings at the forbidden touch, and she closed her eyes. Her muscles clenched in pleasure and the need for deeper penetration.</p><p>She groaned but he made her say the word aloud. “Yes, God, yes, more.”</p><p>He slid lower, kissing her stomach, nibbling the crease of her thigh. His fingers buried into the tangle of dark hair and exposed her inner lips to his gaze. “Do you like me looking at your pussy?” he asked. One finger slid through the wetness. “Open more for me. Wider. Yes, like that. How does that feel?”</p><p>The heat built to an excruciating agony, fogging her mind. She had no clear thought except to give him anything he wanted. “I like it. I feel exposed, but I like knowing you’re looking at me.”</p><p>“You should see how gorgeous you are. All wet and pink and swollen. Begging for just a flick of my tongue to make you come against my mouth again. Do you want to come again?”</p><p>“Oh, God, Roman.”</p><p>“Say it. Tell me what you want or I won’t give it to you.”</p><p>She plunged over the personal edge of rational thought and sanity and gave him the world. “Please put your cock in me. Please fuck me and make me come.”</p><p>She caught a flash of a wolf smile and he reared up to gaze down at her, open and exposed for his viewing pleasure. “Good girl.”</p><p>He slipped on a condom with quick motions, grasped her legs high in the air, and plunged.</p><p>She sucked in her breath at the fullness of his cock. Panic hit her full force, and she struggled to back off from the pressure of him filling her. He called her name with sharp demand, and she glanced up, panting hard, and met gray-blue eyes.</p><p>“You can take me. Give yourself a moment to relax, baby.”</p><p>She shook her head and bucked, but he held firm and her body softened. Unconsciously, she lifted up to seek more of him and he murmured in satisfaction, rubbing and plucking her breasts until she moaned for more. Slowly, he pulled out then slid back in to the hilt, setting an easy pace that only teased the fire and didn’t come close to giving her what she craved. She begged for more with her eyes, and her hips and her moans, but he gave her nothing else but the torturous slow pace that kept her mercilessly at the edge of climax and moved her no closer.</p><p>Raw frustration and temper nipped at her nerve endings. With a low curse, she sank her teeth into his shoulder since her hands were helplessly tied to the bed. He gave a low laugh which only made her angrier.</p><p>“Isn’t this what you asked me for?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“More. Harder.”</p><p>He increased his pace and pressure, but her clit burned for friction. She squeezed her eyes shut in sensual agony. “Damn you, give me what I want.”</p><p>“All of it, baby. Tell me.”</p><p>“Fuck me hard! Take me with your cock and make me come, damn it!”</p> <p>“Good girl.”</p><p>He slammed into her and her heels dug into his back as she reached. He grasped her hips and set a demanding, bruising pace, pushing her closer. Heat shimmered deep within. Again. And again. And—</p><p>She shattered in a thousand pieces with nothing but the ties holding her to earth. With a hoarse shout, he came right afterward, but her body continued to milk him hard. Moisture gathered behind her eyelids at the sheer release she never experienced, and she wondered if she’d ever be the same again.</p><p>He slumped over her and gathered her close, untying her wrists from the bed. With a sigh of pleasure, she wrapped her arms around him and slid into sleep.</p><p>Chapter Three</p> <p>“Hmmm, what time is it?”</p><p>He laughed. “It’s Vegas, baby. Does it matter?”</p><p>“You’re right. I’m parched.”</p><p>“Let me get you some water.” He rose from the bed and made his way to the elaborate wet bar. He put a few cubes in a crystal glass, poured Pellegrino and added a slice of lemon. He brought it back to the bed and watched her gulp, then slump back into the pile of down pillows.</p><p>He took her glass, re-filled it, and retrieved one for himself. He sat on the bed beside her and watched her plump lips suck on an ice cube. His cock grew hard as he imagined her sucking him off. She lifted a brow.</p><p>“Do you ever rest?”</p> <p>“Not with you around. Tell me about poker.” He watched her face, wondering what had spooked her in the past. Or who.</p><p>“What do you want to know?” she asked lightly.</p><p>“Not many little girls grow up to be world renowned poker players. How did you get involved with the business?”</p><p>He wondered if she’d tell the truth or lie. His gut screamed she wasn’t afraid of the truth, and reminded him of a fierce warrior—forever loyal once she belonged to a man. He wondered how many men she’d claimed, and jealousy burned like a shot of whiskey.</p><p>“I grew up as a vagabond. My mom took off when I was young and my dad raised me. Unfortunately, my dad gambled and ran con jobs for a living. He loved it all: horseracing, slots, tables. He couldn’t drag me to the casinos until I turned legal, but he gave me an education early.”</p><p>“How so?”</p><p>She shrugged elegant shoulders and stared at the ice in her glass. “He taught me how to pickpocket. How to use my age to distract a mark. Got me a fake ID, dressed me up, and took me into the casinos.”</p><p>The reality of her childhood struck him hard in the gut. “What about school?”</p> <p>“I went here and there. Mostly, I educated myself. I became obsessed with books—all kinds. Classics, poetry, business. I started reading psychology and found the art of reading people. Ticks, facial expressions, how people lied. I graduated with a street education that served me well.” She hmphed in disdain. “Stupid people spend thousands for a degree when they can get anything they need free. Anyway, something clicked with poker. I loved math, and had a photographic memory. I also got my father’s skill.”</p><p>He raised an eyebrow in question. She gave a twisted smile. “The luck of the Irish, of course. Unfortunately, my dad liked the drink as much as the gambling.”</p><p>“What happened?”</p><p>Darkness stole over her face for a second. She pushed it away with an expert ease he recognized immediately. “Found him passed out in a hotel with an empty bottle at his side. He’d had a heart attack and died on the spot.”</p><p>“How old were you?”</p><p>“Nineteen. Old enough to get by myself.”</p><p>He nodded as if he agreed and understood. Inside, his heart stopped, before the beats resumed. “But you still weren’t old enough to gamble legally.”</p><p>“That’s right. I had squirreled enough money to get by. Some of my father’s friends took me in and gave me shelter. And I took the time to learn.” Her smile came fast and hard, with a glitter in her violet eyes. “By the time I walked into the first casino on my own, I made my first grand by the end of the day. I perfected my craft and got sucked into the Poker circuit.”</p><p>“Easy to get sucked in, but hard to remain a consistent winner.”</p><p>She shrugged again and shook the ice around in her glass. “I have my father’s luck. I don’t drink. And I’m careful with my money.”</p><p>Her will, not to simply endure but to thrive, slammed the truth into him like a sucker punch. She made no excuses and asked for no pity. Poker required great skill and control, but in order to win, she forced back any submissive urges. Even in the bedroom. Sloane needed to give up that control in order to feel. Somehow, some way, he knew he needed to push buttons to go deeper.</p><p>He wanted to go deeper. But she wasn’t ready. Yet.</p><p>“You made your life on your own damn terms.” He spoke in a strong voice without a shred of pity. With a grin, he lowered his head and growled in her ear. “Good girl.”</p><p>The familiar term affected her immediately. Her pupils dilated and her heart beat sped up. He scented her arousal, and he bet if he plunged a finger inside her pussy she’d be dripping wet. A few hours before dawn remained. He needed to bust down some of her remaining barriers, and teach her to trust her body. But he needed a decent plan.</p><p>His eyes lit on the glass she held. A smile curved his lips.</p><p>She stopped shaking the glass. He almost laughed at the combination of wariness and lust gleaming in her eyes. With slow, deliberate motions he reached out and plucked the glass from her fingers.</p><p>“Lie back, Sloane.”</p><p>She did, though she teetered on the edge of acceptance and rebellion. Her natural submissive tendencies wrapped up in a headstrong hellion made his dick rock-hard. Damn, her very demeanor called to his soul to complete him.</p><p>“Now, close your eyes and don’t open them until I tell you.”</p><p>He adjusted her on the bed with her hands by her head to lift her breasts upward. The rosy tips of her nipples thrust forward proudly. Beautiful. Pulling up her knees, he opened her pussy to his gaze.</p><p>Her eyes flew open. “What are you doing?”</p><p>A deep sigh escaped him.” Another direct order disobeyed.”</p><p>“I’m not your sub, buddy.” Fire lit from her gaze.” And I like my eyes open.”</p><p>He left her for a moment and returned with a silk pillowcase. “Again, we’ll do it the hard way.”</p><p>“But what—”</p><p>Moving fast, he bound her wrists again to the headboard. He rolled the silk fabric of the pillowcase into a sleek rope and placed it over her eyes, tying a snug knot behind her head.</p><p>“Roman!”</p><p>“Our night isn’t over yet, and you lost the bet. Now, if you say another word, I’m going to gag you.”</p><p>Silence ensued. He smothered a laugh and sat beside her. Her body vibrated with tension. He laid his hands on the sleek, silky muscles of her shoulders and began to ease out the knots. He took his time with a deep massage until she softened beneath his touch. Slowly, he eased down to her breasts. The full mounds filled his hands perfectly, and her nipples jutted out in cranky demand for attention. “Just relax, sweetheart, and let me pleasure you.”</p><p>“But—”</p><p>“Shhhhh.” His mouth covered hers, gently playing with her tongue and sipping at her lower lip. He played with her breasts, wringing out a moan, and worked his way down her body. When he reached her feet, he used his knuckles on her instep and heel. Her sigh of pleasure raked across his ears. Every muscle surrendered to his touch, open to every sensation he chose to bestow. Satisfaction coursed through him.</p><p>He plucked an ice cube from the glass. And touched it to one of her nipples.</p><p>She arched up, but the ties held her, and he moved the ice over each hard nipple. The color turned a deep ruby red, and goose bumps broke over her skin. Lowering his head, he sucked and rolled his tongue around the tip until she moaned. When she relaxed against the heat of his mouth, he slid the cube down her belly, dipped into her navel and coasted to her inner thighs. He kept his mouth busy, alternating his hot tongue with the cold ice until she writhed under him, lit with arousal.</p><p>Grabbing another block from the glass, he hovered it over her clit. Slowly, he slid his fingers in and out of her pussy, wringing out moisture, while his tongue worked her with long, hot strokes. Her hips bucked. A smile curved his lips, and he pressed the cube against her swollen nub.</p><p>She came apart, the orgasm wracking her body in beautiful form. He quickly sheathed himself with a condom and slid home.</p><p>Her tight heat squeezed around him mercilessly. He plunged over and over, claiming her for his own, as he pinched her nipples. With one final thrust, he came hard. Her pussy clenched around his dick with her orgasm, and he rode out his release before he collapsed on top of her in a tangle of limbs. He pressed a kiss to her sweat-dampened skin, released her bonds, and gathered her close. Her scent rose to his nostrils, and the thud of her heart beat steadily against his ear. Foreboding washed over him as he gazed at her face, replete with satisfaction. She’d wrecked his world.</p><p>He wondered if he’d ever be the same man again.</p><p>“What are you doing?” she asked.</p><p>He replaced the receiver on the phone and walked toward the bed. Except the man didn’t really walk. More like claimed the space around him. He was even more powerful naked, as if he belonged in the Garden of Eden and had never taken a bite of the apple.</p><p>“Getting us some dinner. I have plans and they require energy.”</p><p>She stretched her sore muscles with a languid sensuality she’d never experienced. “I have a big game tomorrow. At least let me walk into the room with some dignity and not hobbled by too much sex.”</p><p>His laugh sounded low and promising. Goose bumps lifted on her arms. Halfway annoyed at her quick response to a man she’d met only hours earlier, she rose from the bed and went to the bathroom for a robe.</p><p>“Don’t.” His voice lashed through the air.</p><p>She stopped mid-stride. “Don’t what?”</p><p>He closed the distance between them. “Don’t put on a robe. I like you naked.”</p><p>Pleasure speared her belly. She’d always felt too skinny, worried about her small breasts and her lanky height. His gaze and mouth and hands worshipped every inch of her, and his impressive erection proved his desire. Still, she wasn’t so far along that she enjoyed walking around naked. She forced a laugh. “Thanks for the complement, but I feel more comfortable with a robe on.”</p><p>He smiled slowly. “I want to look at you while we eat and imagine what I’m going to do to you later. No robe.”</p><p>A touch of uneasiness skated down her spine, along with the familiar sizzle. Why did he turn her on so much with his demands and orders? She raised her chin up and gave him an icy glare. “Sorry, but I like to eat with my clothes on.”</p><p>A discreet knock on the door halted the stare down. She scurried into the bathroom, relieved at the interruption and donned a luxurious white spa robe, slipping her feet into matching slippers. She cursed under her breath when she found no ties—he’d made use of them, the bastard—but she wrapped it tight like a kimono and marched back out of the bathroom. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The table was set with white linen, sparkling china, and a bottle of chilled champagne. A solitary candle burned from the center, casting the room in romantic shadow. The scents of savory steak and herbs rose to her nostrils. Her stomach growled on cue as he lifted the silver dome and revealed buttery mashed potatoes, crisp green beans, and gravy. He handed her a flute of champagne alive with bubbles and she took a luxurious sip, noting the wonderful tones of Dom Pérignon.</p><p>His gaze took in her appearance with obvious disapproval. She readied for battle, intent on winning one round, but he waved his hand in dismissal and pulled out her chair. “I’m unhappy about your decision to disobey me, Sloane.” His voice cut smooth as caramel, but the warning pulsed beneath. Unease slithered in her belly. “We’ll have to address that later. First, I think we both need to eat.”</p><p>Since she had no intelligent comeback other than a curse, she glared at him from behind her bangs and dug in.</p><p>The meat melted in her mouth. She ate with gusto and focus, until her plate was clean.</p> <p>“I see you eat like you have sex,” he said, amused. “No holds barred. It’s nice to see that famous control slip away.”</p><p>Her back stiffened. “My so called famous control makes me an excellent gamer,” she said, formally. “I’m sorry if that bothers you.”</p><p>He put down his fork and studied her. She refused to fidget and met his gaze head on, the stormy blue of his eyes sucking her in like an undertow. “Your control doesn’t bother me, Sloane. It’s part of who you are, and got you to the top. It also got you out of the slums and kept you alive.” His gaze ripped her polished surface to shreds, leaving her open and vulnerable. “Do you like being in control?”</p><p>“Of course.”</p><p>He nodded. “What about your past lovers?”</p> <p>“What about them?”</p><p>“Did they ever try to take away your control?”</p><p>She shrugged and kept her face expressionless. “No.”</p><p>“Not one of them challenged you in the bedroom?”</p><p>Her temper flared and she snapped. “No, okay? Some tried, but I threatened to cut off their balls and they backed down. I can’t help who I am, and I’m not less of a woman just because I like to call the shots. Who cares if I have a difficult time having an orgasm? It’s not my fault.” The words stumbled out of her mouth in a terrible rush of honesty.</p><p>His calm questions continued like steady gunfire. “Have you had trouble reaching orgasm in the past?”</p> <p>“Not with myself.”</p><p>“Have any past lovers tied you up?” Amusement flared briefly.</p><p>“No.”</p><p>“You seemed to have no trouble reaching climax tonight,” he pointed out.</p><p>She shrugged. “Like I said, it’s been a while. I’m backed up.”</p><p>His eyes lit with humor, but he didn’t argue. “Did you like what I did to you tonight?”</p><p>“No. I only obeyed because you won the bet.”</p><p>He laughed and shook his head. “God, you’re stubborn. Don’t lie to me. Not ever again. Now answer the question.”</p> <p>She opened her mouth to tell him to go to hell, then snapped it shut. He was right. She hated liars. Grudgingly, the word popped out of her mouth. “Yes.”</p><p>His approving smile filled her with happiness. “Thank you for telling me the truth.”</p><p>She sipped her champagne and sulked. He’d crawled under her skin like Frank Sinatra’s famous song. How had one lousy night begun to change the person she believed she was?</p><p>“Now, I want you to take off that robe so I can look at you.” His words yanked the proverbial rug right from under her.</p><p>She blinked. “I said I’m more comfortable with it on.”</p><p>“Take it off.”</p><p>Temper flared. She tossed her head. “Hell, no. Get over it.”</p><p>He nodded, almost pleased with her decision. “That’s what I thought. Not adhering to the exact terms of the bet will force me to punish you.”</p><p>Her eyes widened in shock. “Excuse me? Do you think this is the Middle Ages, buddy? What are you going to do—spank me?”</p><p>His lips twitched. “Actually, yes. That’s exactly what I’m going to do.”</p><p>A strange mixture of lustful anticipation at his dominance and pure horror mingled within her. A beat passed. Two. His face reflected carved stone with an implacable determination. Her heart exploded in her chest with a rush of adrenalin. She needed to move. Quickly.</p><p>She jumped out of the seat and bolted toward the bathroom. He caught her in two seconds flat and tumbled her to the carpet. She fought like a wildcat, but he managed to rip off her robe with one quick tug. As if handling a china doll, he rolled her over, pulling her over his thighs while his hands held her in place. With her ass in the air and bands of steel pinning her to the rug, the sheer vulnerability of her position stole her breath. Panic flared.</p><p>“Let me go, you bastard!”</p><p>He chuckled, obviously enjoying her predicament. “I asked you nicely, but you insist on fighting me. A little pain can sometimes elicit the greatest pleasure, Sloane. Especially with strong women who don’t let themselves go.”</p><p>“Fuck you.”</p><p>His hand came down hard on her bare ass. The breath whooshed out of her lungs and her tender flesh stung under the slap. She cried out. He’d done it. He’d actually spanked her. She was going to kill him, tear him to pieces, sue his ass and Madame Eve’s company and kill Castillo and—</p><p>Suddenly, that same hand massaged the stinging flesh and slipped downward. He glided over and pushed one finger inside her, testing. He laughed low, using her moisture to coat her clit and coax it to a throbbing nub.</p><p>“Very nice,” he murmured in approval. “You, my gorgeous one, need a little push. The men you slept with were total assholes and completely unworthy of you.”</p><p>His hand came down again, harder than the last one. She bit back her cry, but the treacherous response of her body begged him to sink into her heat and take her hard. Again, his hand slid between her thighs to play. While her ass burned, other parts of her burst into flames. Her nipples stabbed into the thick carpet, the cool air on her naked skin like a gentle kiss, and he slipped another finger in, moving in a slow pace that tortured her.</p><p>“Strong women need a reason to let go. Only one with a will like yours could survive, but you took your body with you for the ride. In order for you to feel completely free, you need someone to take away your ability to control.”</p><p>Another slap. Another. She bit her lip and the stringent barriers around her body and heart and mind wobbled, tilted, then fell.</p><p>He thrust four fingers into her, rubbing her clit, while his other hand came down hard for one final slap.</p><p>She came hard, bucking over his legs as she let go under the demands of another orgasm. It washed over her without mercy, and she rode it, sobbing his name. She heard the rip of a package. He flipped her over, spread her legs, and dove deep.</p><p>He filled her aching, pulsing body. She shook her head and pushed at his shoulders, her last orgasm too intense to even want another. His low laugh raked across her ears as he pinned her wrists against her head.</p><p>“More. I want more.”</p><p>“I can’t. Roman, I can’t.”</p><p>His gaze seared with blue fire, forcing her to surrender it all. “You can, baby. Give it all to me, I can take it. I want it.”</p><p>He moved. Thrust after thrust, he threw her higher into the unknown. He claimed her with his mouth and tongue and cock and fingers. Her sensitized clit burned and throbbed under the steady pressure, but he never relented, cranking up the excruciating tension. The wet slap of their bodies echoed in her ears, and her walls held tight and milked him hard, until the second orgasm grabbed her and tossed her over. She flew and he stayed with her, his solid, muscled length anchoring her to earth and to safety.</p><p>Sloane watched her sleeping lover. His chest rose and fell with even breaths. His face relaxed in slumber, like a wolf napping after a long night with his mate.</p><p>The knowledge she belonged to him vibrated in every muscle of her body. He’d wrecked her for anyone else. Yet, the terms of the agreement stated one night only. Would he want to see her again? Or was her lifestyle not suited to the future he craved?</p><p>Her thoughts jumbled. She traveled constantly. She played all night and slept during the day. She made a ton of money and her job required her to meet a wide range of people, especially men. Not one of her previous lovers could handle it.</p><p>So why did her gut whisper she’d found the one?</p><p>There wasn’t a man alive with enough balls to order her, spank her, and give her pleasure to the limits of his own. In a few hours, he’d made her feel precious and cared for, like the woman she was meant to be—both inside and out.</p><p>His eyes flew open as if he heard her thoughts. She reached out and traced the stubble of his beard. He grabbed her hand and nipped at the pad of her finger in mock punishment. She fought not to show the hope on her face that morning wouldn’t turn him into a pumpkin.</p><p>“I thought you were asleep.”</p><p>“Not with an hour left before dawn.”</p><p>She turned her head so he wouldn’t glimpse any weakness. “I know,” she said softly. “My turn for a question. You never told me how you ended up as a dealer.”</p><p>“Must be in the blood. My father dealt in Atlantic City his whole life. We grew up by the shore—good old Jersey boys. My mom brought us up as strict Catholics. Hysterical, of course, since gambling is a sin. Surprised the church didn’t catch on fire when all of her men tidied up nice and went to Mass with her on Sunday mornings.” His face reflected an open affection and love when he mentioned his family. The hunger to belong to his inner circle clawed at her gut in an effort to be freed. “Dad still works, mom teaches high school, and my brothers and I took up the reins. Rick’s been wanting me to join him out here for a while now, but we get back on holidays and other occasions. My little brother, Rafe, is in the military. And my two best friends keep their eye on my mother since she practically raised them.”</p><p>She smiled. “You sound like you have a close family.”</p><p>“I had nothing to complain about. I had a solid childhood. I learned to live hard and play harder. I like money, and travel, and casinos. But I love an evening in, with a cold beer and my Lab at my feet.”</p><p>“You have a dog?”</p><p>He nodded. “Golden Lab. Name’s Bella. She’s not as bad as Marley, but close. I have a good friend who looks in on her when I’m on a long shift.”</p><p>She thought about coming home after a hard day to warm affection and furry loyalty. Imagined coming home to Rome to share every bit of her day. Yearning permeated every pore. “I always wanted a dog. But I’m not home enough, and I never stayed in one place for too long.”</p><p>He studied her face as if he spotted her secret thoughts, memorizing every feature. He didn’t say a word. Just pulled her head down and kissed her.</p><p>Sweet. Deep. Complete. She sighed and gave it all back to him. He dragged her hand to his evident arousal and she squeezed. He groaned. His cock felt like iron coated with silk. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re finally going to let me touch you?”</p><p>He grinned with male satisfaction and propped himself up on the pillows. “For now.”</p><p>Her eyes narrowed and her temper surged. He consistently kept her on edge, which only added to her arousal. Making a vow to invoke her revenge, she gave a fake simper and batted her eyelashes. “May I give you pleasure, sir?”</p><p>He nodded. “Go ahead.” His gaze challenged her to give her best shot.</p><p>Bastard.</p><p>Let’s see how he likes to play my way. She dropped her head over his chest and let her hair tickle his skin while she explored with her tongue. He tasted like salt and musk and man. His muscles jumped under her hands as she massaged every inch of him, sinking her teeth into his hard belly and laughing low at his muttered curse. His cock grew longer and harder, pushing against her thigh in demand, but she ignored him, concentrating on other parts: the sharp curve of his hip. The meatiness of his thigh. The flat nipples surrounded by dark hair.</p><p>Her fingers coasted down his shins and she huffed her warm breath over his throbbing length. He tensed in anticipation and power surged in her blood. Finally, she was free to bestow pleasure on her own terms. Her hands cupped his balls and stroked, exploring the iron length of him, collecting the drops of moisture around his tip as she rubbed with teasing strokes up and down.</p><p>“Take me in your mouth, now.” His sharp command shot straight to her clit.</p><p>Her pussy clenched in response and she opened her mouth to slide him in. She took his cock deep in the back of her throat and slowly sucked. Used her tongue to pleasure, swirling around the tip as her hand clenched him at the base. He thrust his hips up and silently asked for more.</p><p>Excitement pulsed and pounded in her blood, and moisture dripped down her thigh. She wanted him to come in her mouth, wanted to give him the mind-blowing pleasure he’d bestowed for hours, and she became frantic as she bobbed her head up and down, licking, sucking, until—</p><p>“No!” She cried out when he hauled her up and on top of him. She struggled to get back to her original position, but he stilled her with firm hands on her hips.</p><p>“Ride me. Ride me and make me come, Sloane.”</p><p>A new lust burned within, and she quickly sheathed him with a condom, parted her legs, and sank deep. “Rome!”</p><p>She moved up and down, setting her own pace, her clit throbbing against his shaft, and she matched him, demand for demand to make him come around her. His hands rubbed her breasts and tugged her nipples, and she bucked and arched into the delicious, tightening tension. With one last thrust, she scraped her clit against him and shattered.</p><p>His fingers dug into her hips with male satisfaction. She cried out his name, riding the wave and crashing, and he followed behind her. The orgasm went on and on, shaking her body like a tree in a hurricane, until she collapsed.</p><p>His ragged gasps stirred the tendrils of her hair. His heart thundered against her ear. A sense of completeness swept over her.</p><p>A feeling of home.</p><p>“What have you done to me?” he murmured. She didn’t answer. Let herself slide into the silky darkness, held tightly by the man she’d fallen in love with.</p><p>The rising dawn leaked from behind the blinds. He closed his eyes and fought with his decision. She had a big tournament today. He wanted to wake her with a deep kiss and slide his cock into her wet heat. The image of her wet and naked in the shower as he washed her flickered past his vision. Rubbing cocoa butter into every sore muscle, especially her ass. He craved to stamp his possession on every part of her body, along with her soul.</p><p>She’d given him many gifts. Her body. Her past. Her secrets. Most of the time his heart beat steady. But in the pause between heartbeats, he realized he’d fallen in love with Sloane Keller.</p><p>His gut said she felt the same. Still, in the hard light of morning, most women would run. Fast. He’d pushed her limits to the edge. He had to let her go.</p><p>For a while.</p><p>Her widely publicized tournament started in a few hours. She needed some time and space to re-focus, slide into the safety of her control, and win.</p> <p>He had enough confidence in her to wait.</p><p>Time to make his final bet. The bet of a lifetime.</p><p>He smoothed the dark cherry strands away from her brow. Dropped a tender kiss on her lips. With one last glance, he left.</p><p>Epilogue</p><p>Sloane eased her way through the crowd. She paused and made polite conversation with the bigwigs, had some laughs with some good friends, and schooled her face for the tournament. In usual form, she wore her standard attire of black—a high-necked black dress that fell right above her knee, with black ankle boots. No jewelry adorned her outfit, and her hair swung free, masking her face when she bent her head.</p><p>She ordered a seltzer at the bar and went to take her seat. The cameras whirred, but she clicked into the zone until the crowd was a distant murmur in the background. The clink of ice cubes against glass drifted to her ears, and suddenly she stiffened as the memory hit full force.</p><p>Roman.</p><p>A hot, wet tongue on her nipples. Sliding down so close to her aching pussy. Trapped from any visual stimuli and dependent on his breath and his touch to guide her. A long plummet into heat. Then icy cold slamming her back and wrecking her defenses. Again. And again.</p><p>His fingers and mouth on her clit, teasing, stimulating. On the edge of orgasm as she waited for his next move. The slam of painful cold against her throbbing nub, hurtling her over the edge. Her scream told him she belonged to him.</p><p>But when she woke up in the morning, he disappeared.</p><p>No note. No phone number. Just the smell of him and the indent of his head on the pillow next to her. The hurt cut razor sharp and shredded delicate flesh. Her one-night stand ended, and he’d disappeared as a good one-night stand should.</p><p>But he wasn’t one night to her.</p><p>He’d become everything.</p><p>She despised herself for thinking he wanted her for more than one night. She’d shared personal truths about her past she’d only shared with one other man before him. That man had rolled his eyes at her story and verbally lashed out. How could she be whining about her past when she earned millions? He had no patience for her or her poor little rich girl story. So, she’d locked herself back up tight and vowed to never share herself with another.</p><p>Until Roman.</p><p>She carefully set the glass down and made sure the ice didn’t clink. She pushed the hurt and ache down deep and prepared to play.</p><p>It wouldn’t have worked anyway. All men ended up jealous and angry. She’d watched her relationships crumble before her eyes until she couldn’t stand to be the loser any longer. It’s better this way. For me, especially.</p><p>The tournament began.</p><p>Her piles of chips grew, steadied, and dropped. Always in it for the long game, she liked to pace herself. When others began to tire, she became alive, hungry for the kill and the lure of the win. Her senses sharpened like an animal in the night, and she smelled blood. One facial reaction or flick of the cards could be a person’s downfall. She made her way through the long hours of the play, until day blended into night and blended back again.</p><p>With her chips, she had one opponent left. She fought to stay in the zone, but a shimmer of awareness crept up her spine. She turned her head a half inch and peeked from her peripheral vision.</p><p>Roman stood in the crowd watching her. His arms crossed against his powerful chest, hip out, feet in a wide relaxed stance. His silver hair glimmered under the casino lights, highlighting the foggy blue-gray of his eyes. For one moment, their gazes met, locked and delved deep.</p><p>He smiled.</p><p>Time stopped. That beautiful, masculine smile and the warm gleam in his gaze told her everything she wanted to know. Raw pride shimmered from every carved feature of his face. The quiet confidence in her ability, the naked emotion of possession, all told her he loved her.</p><p>She turned back to her hand. Victory pulsed in her blood, her face reflecting emotion for the first time in her life under the hot whirr of the camera.</p><p>And she knew she’d won.</p><p>When the chips were counted and congratulations from the players eased, she walked across the room to stand next to him.</p><p>“Good game, babe.”</p><p>A joyous smile curved her lips. “Thanks. Why’d you leave?”</p><p>He reached out a finger and trailed it down her cheek. “You needed to get in the zone. I would have just made you a bowl of mush with too many orgasms. I respect you.”</p><p>“I know.”</p><p>“I also love you. One lousy night and you got me. So, here’s what we’re going to do.”</p><p>She raised one brow. “Being bossy again, huh?”</p><p>He sighed with deep regret. “Why do you have to make everything difficult? Thank God I already have the necessary equipment to tame you.”</p><p>She stared at him with suspicion. “Equipment?”</p><p>“Handcuffs, blindfolds, whips, etc. So, here’s what we’re going to do. I’m going to cheer you on every step of the way while you make a shitload of money. Then you’re going to move in with me.”</p><p>She raised her chin. “I like my place better. You move in with me.”</p><p>“We’ll argue about which place is better later. In the meantime, you need some food and water and relaxation.”</p><p>“You don’t always know what I need, Mr. Roman Warrior. I had a hell of a day and I’ll tell you what I need.”</p><p>“Go ahead.”</p><p>She raised herself on tiptoe and spoke right against his lips. “I need an orgasm. So get your ass back up to my room and take care of it.”</p><p>His eyes heated with warning. A thrill raced down her spine.</p><p>“Good girl.” He lowered his head and kissed her deeply. “Let’s play.” </p> </body></html>"]