["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was a deadly kissthe kind of kiss that stole my breath, forced my heart into overdrive, left me hopelessly weakened and desperately gasping for more. The kind of kiss where I felt as if Id die if it ever ended. I, Raven Madison, was in terminal bliss.</p><p>Alexander, my vampire boyfriend, and I were nestled together in the dusty depths of the Mansions basement, passionately clinging to each other like a broken spider-web. Id transformed the wine cellar into a ghastly haunt as a present for him. I wanted him to have an alternative macabre sanctuary when he needed a retreat from painting in his attic room.</p><p>After Alexanders parents returned to Romania, I had decided to once again give the Mansion a feminine touch. Upon moving a portrait for storage in the basement, I stumbled across something Id never seen before. Behind the staircase and toward the north wing of the house I found an arched wooden door secured with a heavy wooden beam. I had no idea what lay on the other side, and since Alexander was upstairs creating a masterpiece, I didnt want to disturb him. I paced in front of the door, deliberating whether to wait until he was finished. My impatience got the best of me, so I figured a quick peek wouldnt hurt anyone.</p><p>It took all my strength to pry open the beam, but less to open the rusty door. What lay on the other side was a dark, dusty, and chilly room. I was awestruck. The floor was made of uneven stones and the arched ceiling and narrow walls of gray bricks. Centuries-old Romanian and other European bottles were evenly stacked on dozens of wooden racks. On closer inspection, some of the bottles appeared different from the cabernets and merlots Id seen resting on the three-tiered metal rack in the Madison family kitchen.</p> <p>Curious, I lifted one of the Sterlings bottles from the shelf to inspect it further when I felt an icy shadow behind me.</p><p>I gasped.</p><p>Slowly, I turned around to find Alexander standing in the doorway. I held out the bottle, which was shaking in my hand. He nodded his head, and it was then I knewthese bottles werent filled with wine. They were filled with blood.</p><p>And now, a month later, the wineor, rather, bloodcellar also housed votives, a portable DVD player, and an amorously entangled mortal and vampire. As the candelabras dripped bloodred wax, my body melted around Alexanders. He, in turn, held me in the clutches of his strong, pale arms. The cool air of the cellar only added to the chills dancing up and down my spine from Alexanders tantalizing fingers. His deep, dark eyes stared boldly into mine, his fangs gently grazing my neck. For a moment, I was tempted to pull him into meso hard he would be forced to sink his teeth into my flesh.</p><p>Then Id be a vampire. Forever. For eternity.</p> <p>But as I stared back at him, I knew that that wouldnt be fair. The quiet and reclusive Alexander had already shared so much with mehis family, his nemesis, his home. He had to be ready to take me completely into his world just as much as I was ready to be taken.</p><p>While I contemplated my plunge into the Underworld, three hard knocks came from above the rustic ceiling and echoed off the basement staircase walls. I wasnt about to end our embrace, but Alexander pulled away.</p><p>It was critical that nothing separate usnot time, homework, or an unwanted visitor.</p><p>I fingered his metal chain-link necklace and gently drew him back toward me. He leaned in for another kiss and I closed my eyes. As I waited for his lips to touch mine, three loud thumps echoed again. I opened my eyes to find Alexander gazing at the door instead of me.</p><p>Jameson, Alexanders butler, was out on the town catching a late-night flick with his girlfriend, Ruby White. It couldnt have been him. It was too late for deliveries, and no Dullsvillian in his or her right Ivy Leagueschooled mind would dare venture out to the old lonely Mansion and up its spooky driveway in the middle of the night.</p><p>Perhaps its a ghost, I teased. Begging for souls.</p> <p>For a few minutes, there was silence. I was relieved.</p> <p>Then, suddenly, a louder bang.</p><p>Ill only be a minute, he said, rising.</p><p>And leave me here alone? I argued.</p><p>You arent afraid, are you? I thought you felt like the Mansion was your home.</p><p>The cellar was certainly spooky, dark, and foreboding, and I was far more comforted by it than I was afraid. However, there was nothing I could do alone, and since Alexander and I were destined to be separated by the sunlight, our darkened moments together were priceless.</p><p>Me? Afraid? Only of being apart from you.</p> <p>It sounded corny, something from a greeting card or a sappy TV movie, but I meant every word.</p><p>Alexander extended his hand and led me up the basement stairs and past the candelabra flickering in the hallway.</p><p>We reached the foyer, and Alexander grabbed the door handle. I took his hand before he opened it. Arent you going to look out the peephole before you answer?</p><p>Alexander glared down at me. He was, after all, a vampire. Who could be on the other end of the door that could frighten him?</p><p>The Mansion door slowly creaked open, and I waited anxiously to see who was brave enough to be standing in the shadows on the broken steps.</p><p>Candlelight streamed out from the Mansion, partially illuminating an unfamiliar figure. I craned my neck to get a better glimpse of the stranger. A handsome guy, appearing to be around Alexanders age, with wildly wiry short blond and brown dreadlocks, boot-shaped sideburns, goatee, and a thin, ashen face, stood before us. Tattoos crept out from his unbuttoned vintage white shirt, and gold earrings hung from his ears. He had a glistening gaze and an alluring smile.</p><p>Dude! Where have you been? the visitor asked enthusiastically.</p><p>Sebastian Alexander was shocked. My boyfriend was familiar with the guy I thought was a stranger. What are you doing here?</p><p>Thats what I wanted to ask you. I had to find out from your parents that you werent returning to Romania. But now I see why His gaze bore through me. Well, arent you going to introduce us?</p><p>This is Sebastian, Alexander said politely. Sebastian, this is</p><p>Raven. Sebastian took my hand in his. He wore more rings than I did and sported black polish on his bitten fingernails. He kissed my hand. I couldnt quite tell if this character was charming or just an annoying flirt.</p><p>Well, arent you going to invite me in? he asked with a wide grin.</p><p>Of course, Alexander replied, still surprised.</p><p>Alexander stepped back, but Sebastian didnt follow.</p><p>Just a minute, Sebastian said. Ill get my things.</p><p>Things? Alexander asked, his mouth hanging agape.</p> <p>Sebastian had already taken off toward a vintage mint-condition 1960s black Mustang with silver racing stripes, which was parked in the Mansions drive.</p><p>Alexanderwho is? I began softly.</p><p>Alexander didnt answer. Instead, he remained focused on Sebastian.</p><p>The handsome visitor popped open the trunk and reached inside. I could see in the distance that he was pulling out a large duffel bag and setting it on the drive. He reached in again and placed another bag on the broken pavement. Then another.</p><p>I assumed Sebastian intended to spend the night, but judging from the amount of luggage he possessed, I wasnt sure just how many nights he planned on staying.</p><p>I wasnt sure how I felt about this strangers visitor moveinto the Mansion. Alexanders parents left Dullsville and we were free to resume our independence. Now we were accepting boarders?</p> <p>But more important, who was this person and why was he here?</p><p>I better help him, my boyfriend said, and headed for the Mustang.</p><p>From my vantage point on the crumbling steps, I wasnt privy to their conversation. But by their gestures, I could tell the two chatted like reuniting brothers. After a few minutes, they carried Sebastians bags back toward me. I trailed the ghostly pair back into the Mansion, up the stairs, and into one of the vacant rooms.</p><p>The room was stark and cold. A velvet eggplant-hued curtain covered a single window. There wasnt so much as a bed or air mattress. The only decoration present was a tiny vase with dead lavender flowers Id placed on a small table a few days before.</p><p>Appears you still like living in the past, he said to Alexander. Wheres the TV, man?</p><p>Down the hall, Alexander said, pointing to the far end of the house.</p> <p>Alexander retrieved a candelabra sitting on a table in the hallway. He lit a match and illuminated the room.</p><p>Sebastian dumped his oversized bags on the floor. They landed with a thud, making me suspicious about the weight of his clothes. He walked around the room with the candelabra.</p><p>Lavender? Sebastian asked as the candles spread light on the vase.</p><p>Its just Ravens touch, Alexander said.</p><p>I can put it in another room if it bothers you, I offered.</p><p>Sebastian gazed down at me. His eyes glistened in the candlelight. I wouldnt have it any other way.</p><p>Alexander stepped between us. Ill give you some time to settle in, he said. You must be tired from your trip.</p><p>Sebastian surveyed his new digs and stretched out his arms while Alexander closed the door behind us.</p> <p>I stopped Alexander before he moved. Who is this guy? I asked. One of your relatives?</p><p>No. Hes my best friend.</p><p>I was shocked. Alexander spoke so little about himself and Romania, Id never heard about any friends, much less one best friend named Sebastian.</p><p>You never mentioned you had a best friend, I told him.</p><p>He never came up.</p><p>Never came up? I talk about Becky all the time.</p><p>You talk about a lot of things, he joked.</p><p>Alexander had a point. I liked to talk about every mundane thought I had during every minute of my day, while Alexander kept mum on even the most important subjects.</p><p>So how long do you think hell stay? I asked. I could only wonder what it would be like for the three of us to hang out at the cemetery, my house, or the Mansion.</p><p>Perhaps a few days.</p><p>I thought hed be here for weeks.</p><p>Sebastian? He wont want to wear out his welcome.</p><p>There was one piece of information I couldnt wait to find out.</p><p>I wanted to ask you, I whispered. Is he like you?</p><p>Sounds of banging and hammering came from inside Sebastians room. Was he, too, redecorating the Mansion?</p><p>The door creaked open and I saw Sebastian kneeling on the wooden floor, a hammer in one hand and a nail in the other. Boards peeked out of his duffel bag. It was a spookily spectacular sighthe was building a black coffin.</p><p>Alexander quickly reached for the door.</p><p>Just then we heard the locks being unlatched from the front door below.</p><p>Thatll be Jameson, Alexander said, closing the bedroomor in this case, coffin roomdoor behind him. He will have to take you home tonight.</p><p>So soon? I whined.</p><p>Its really late, actually. Even Jamesons date is over.</p><p>So what are you guys going to do? I hope youre not going clubbing.</p><p>In this town?</p><p>Or hiring escorts or something.</p><p>Alexander shot me a look.</p><p>I watch cable. I see what guys do. And these guys werent like most othersthese guys were vampires. One of you might get hungry, I inferred.</p> <p>Dont worry. Im the same guy with him as I am with you, he reassured.</p><p>And with that, Alexander gave me a quick good-night peck on the cheek, a stark contrast to the passionate, long lip-lock we had just shared in the cellar.</p><p>Reluctantly, I jumped into the Mercedes and Jameson drove me at a creeping pace toward my house. I caught a glimpse of myself in the rearview mirror. Reflected back was a scowl not unlike that of a four-year-old child who hadnt gotten her way.</p><p>It wasnt fair. Two guys partying at the Mansion while I had to go home to bed. If I was a vampire, Id be able to hang out with them all night and chill out during the day near them in my coffin. Id fit in and not have any reason to be excludedno longer a mere mortal with a reflection and a curfew.</p><p>I fantasized that Alexander would bite me and take me into his exciting and mysterious darkened world. It had been a dream of mine to become a vampire long before Id even met him. But now that I was dating a vampirethis particular vampiremy broad childhood desire about joining the Underworld had morphed into a specific desireto be turned by Alexander. But so far that hadnt happened. I knew in my heart that there was the possibility that Alexander might not ever turn me, that maybe we would share life side by side but separated by our two worlds. I knew the reason he hadnt bitten me was as much out of love as it would be if he had bitten me. Id fallen for the one vampire in the world who didnt put his needs above his morals. This only made me love him more. And I couldnt imagine that Alexanders fear might be rightthat I might not like being a vampire after all, that something Id desired all my life in its reality might not live up to my grandiose expectations. But how could that world be bad if I was sharing it with him?</p><p>And now, with the arrival of Sebastian, two immortals were partying it up in the Mansion without me.</p><p>At this point, as I was being driven home by Jameson, I was as much disappointed about not being a vampire as I was just being me and not being included in my boyfriend and his best friends sudden plans.</p><p>This situation would have to be fixedsooner rather than later. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The following day, I was bursting to tell my best friend, Becky, the news of Alexanders surprise visitor. I waited impatiently by the swings in Evans Park until I finally saw her heading down the hill.</p><p>Where have you been? I asked, catching up to her.</p><p>I had to drive Matt to practice. I hate saying good-bye. And yet I love saying good-byeif you know what I mean. She giggled, still in swoon mode.</p><p>I knew what she meant and how she felt about kissing her favorite guy. But for once, I had other things on my mind.</p> <p>I intently led her toward the bottom of the yellow plastic double-wide slide.</p><p>Whats so urgent? she asked as we sat down.</p> <p>First it was Alexanders parents. Although you know I adored them.</p><p>Yes. Whats up?</p> <p>Now Alexanders best friend has invaded the Mansion.</p><p>Becky was puzzled. I didnt know he had a best friend.</p><p>Neither did I. I sighed.</p><p>WowAlexanders so mysterious.</p><p>Evasive.</p><p>Reclusive, she added.</p> <p>Tell me about it</p><p>Just like a vampire, my best friend said. I think thats why hes the perfect match for you.</p><p>You really think so? I asked.</p> <p>Of course.</p><p>A perfect match? Or a vampire?</p><p>A perfect match, silly. But if anyone was a vampireAlexander could be one.</p><p>You think so? You honestly think so? I prodded.</p> <p>He is from Romania and has a butler. Come to think of it, Ive only seen him at night, she said, and laughed. And that garlic allergy</p><p>But I wasnt laughing.</p><p>Did I say something wrong? she asked.</p><p>No. In fact, you said something right, I wanted to say. Could I finally bare all the secrets to my best friend? Would she realize this time that her statements were true, instead of laughing at me when I suggested the very same thing? At last Id be able to unleash the truth about Jagger, Luna, Alexanders parents, Onyx and Scarlet from the Coffin Club, and, most important, my boyfriend. The load Id been carrying in silence was too heavy on my temporarily rose-tattooed shoulders.</p><p>I weighed my thoughts. If Becky knew Alexanders true identity, then shed surely blab the facts to Matt. I knew he was more tight-lipped than Becky. Guys didnt gossipI didnt even know Alexander had a best friend! But this news was bigger than a footnote to a byline. This was front-page Dullsville Gazette breaking news. Vampires Aliveor UndeadAtop Benson Hill. And if this information did slip out at practice or a game, then Trevor Mitchell would know. Not only would Alexander have to return to Romania, but it would be imperative that he never inhabit Dullsville again.</p><p>Whats wrong? Becky asked.</p><p>Alexander is a perfect match, I said with a sigh. I was just thinking how I didnt want Sebastian to crowd us.</p><p>Thats totally normal. I get bummed when I have to share Matt with the entire soccer team. They talk about the most inane subjects, like ESPN and computer sports games. But I imagine Sebastian and Alexander are different from guys here. Is he an artist, too?</p><p>I dont know.</p><p>They probably talk about world events, she imagined aloud.</p><p>I dont even know what they talk about, I answered, clueless.</p><p>Well, whats he like?</p><p>He is hottheres no doubt about that. But other than that, I dont know. Hes a total flirt and he likes electricity.</p><p>Becky laughed. I think its a good thing. You can find out more about Alexander through him, she said.</p><p>She had a point. Sebastian possibly held the key to the Alexander I never knew. For a moment, I lost myself in thought as I lay back on the slide. I imagined a young version of our goateed guest and Alexander having sleepovers in the cemetery, dining with Draculas descendants, or flying in bat form over European cities.</p> <p>Is he like Alexander? she asked, awaking me from my daydream.</p><p>In some ways he isbut Im still not sure.</p><p>Well, weve been friends forever and we arent the same. It should be exciting to see what hes all about.</p><p>Was Sebastian a real romantic or was he a player? Did he have a menacing streak like Jagger or more noble intentions like my own boyfriend?</p><p>I still cant believe that for so many years Trevor and Matt were best friends, Becky said to me, breaking me out of my fantasy. It really turns my stomach. But Im sure Sebastian is not like Trevor.</p><p>Lets hope not.</p><p>Becky and I were best friends but polar opposites. Were Alexander and his best friend like Matt and Trevor?</p><p>I knew one thing for sureI couldnt wait to find out!</p> <p>Unlike when Alexanders parents arrived in town, Alexander wasnt keeping me a secret from Sebastian. I was invited to the Mansion as usual. Perhaps Sebastians arrival wasnt a bad thing after all. He could show me the side of Alexander Id never known, as Becky suggested. I biked over to the Mansion, hoping to get there just in time for the sun to set.</p><p>I happily coasted down a hill and squeezed the brakes as I turned the corner to avoid any oncoming or parked cars. What I didnt anticipate was an obstacle of another kinda pack of runners. I barely avoided smacking into them and veered off into a small band of hedges instead.</p><p>Watch where youre going, Monster Girl! I heard a male voice call.</p><p>I withdrew my bike from the bush and picked a few leaves off my hoodie.</p><p>Trevor stormed over to me, flanked by a few soccer snobs, and held the handlebars of my bike so I couldnt pass.</p><p>Where are you off to in such a hurry? His stunning green eyes bore through me. A corpse convention? Even sweaty, Trevor was gorgeous.</p><p>What are you running away from? I retorted. Your mirror?</p><p>The soccer snobs laughed. Trevors already flushed face reddened like a sunburn.</p><p>The Mansion loomed behind Trevor up ahead on Benson Hill, the sun moments from setting.</p><p>I suggest you turn back now. Before its too late, he tried to warn as only an adversary could. When darkness falls, the monsters arise.</p><p>The monster has already arisen, I said, in his face. And hes standing right in front of me.</p><p>Trevors cohorts snickered again.</p><p>How about I just take your bike then? He tried to wrestle the handlebars away from me, and for a moment the two of us struggled.</p> <p>Finally, I released my grip. Be my guest, I relented. Pedal your way back to practice on a girls bike. Im sure it will end up on YouTube.</p><p>Trevor thought for a moment as his cohorts tried to hide their chuckles. My nemesis let my bike fall to the ground.</p><p>We better get back. Its getting dark, one of the soccer snobs said.</p><p>Trevor locked his gaze with mine. His torment was palpable. He owned a portrait Alexander had painted of methe only thing he could own of me. And as I stood before him, he strained with the knowledge that I was the only girl in town that he couldnt haveand perhaps the only one he truly wanted.</p><p>Get out of here already, he finally acquiesced. Run off to your little Monster Boy, freak.</p><p>I dusted myself off and picked up my bike. Id have felt sorry for Trevor if he didnt bring his own torment on himself. I pushed past my nemesis and the other runners, and we both headed off in opposite directions.</p><p>I pedaled through the darkness as fast as possible. I didnt want to miss any precious moments with Alexander and Sebastian. I felt as if I were hauling my bike up a ski hill. Exhausted, I barely had enough strength to bang on the Mansions door. I was still out of breath and perhaps a little disheveled when Jameson let me in.</p><p>Good evening, Miss Ravenare you all right? Jameson stood crisp and creepy in his gray butlers uniform.</p><p>Yes, I said. Ive never been better.</p><p>Are you sure? His voice and expression were kind and sincere.</p><p>I guess I appeared worse for the wear. Had there been mirrors in the Mansion, I might have been able check out my appearance. Out of respect for the Mansions inhabitants, I didnt dare open Rubys compact, nestled in my purse. Instead, I just combed my hair with my fingers and tried to straighten my outfit.</p><p>I believe they are upstairs, Jameson directed.</p> <p>I hurried up the creaking staircase. I passed Sebastians new accommodations and peeked in. The once-barren room was a messclothes, CDs, and games were strewn all over the hardwood floor. It appeared as if hed been living there for decades. His coffin was finished, and the lid was closed and topped with junk. The sides of the coffin were adorned with stickers of global citiesLisbon, Beijing, Romelike a giant suitcase.</p><p>I could hear the sounds of battle coming from down the hall.</p><p>I headed into the TV room to find Sebastian stretched out, his boots propped up on the coffee table, gaming console in one hand and a cell phone in the other. Two knights were jousting on the screen.</p><p>Alexander saw me in the doorway. He immediately rose and greeted me with concern. Sebastian didnt budge but took Alexanders absence as an opportunity and whacked his blue knights sword against Alexanders unprotected red knight.</p><p>Are you okay? Alexander asked.</p> <p>Are you okay? I asked. I think he just flattened you.</p><p>Oh, thatits only a game.</p><p>Do I look that awful? I asked, suddenly self-conscious.</p><p>You have leaves in your hair.</p><p>I thought I got them out. I did my best to smooth out my hair.</p><p>What happened? Alexander asked, picking out the remaining leaves.</p><p>I bumped into Trevor.</p><p>Alexanders sweet expression furrowed. In the woods? Did he hurt you? Ill</p><p>NoI just hit a bush. I should have hit him instead, I teased.</p><p>Alexander shook his head. I knew he was tormented, just like Trevor, but for different reasons. Alexander felt the need to protect me from all evilvampire and mortal. He was tortured, knowing that during the daylight hours it wasnt possible for him to safeguard me against my nemesis.</p><p>Ill pick you up from now on, he firmly instructed.</p><p>When my parents put me under curfew, I rebelled. However, when Alexander was overprotective, it made my heart race.</p><p>Trevorwhos Trevor? Sebastian finally said, pausing the game and typing on his cell phone.</p><p>Though the Mansion was as decayed as an ancient ruin, I was disappointed with Sebastians lack of refinement. Instead of behaving like a guest, he was sitting like he was in a fraternity house, scuffing the already antique coffee table with his shoes. I wasnt Miss Manners myself, and heaven knows I wouldnt have cared if Becky had put her John Deere, soil-stained boots on my bed. But this was the Mansion, after all, the house of my dreams, and, more important, Alexanders home. I spotted a beat-up old ottoman in the corner and scooted it in front of him.</p><p>You might be more comfortable, I said graciously.</p> <p>Thanks, he said. Now I feel like a king. I can see why you like it here, he said to Alexander.</p><p>I didnt know if he was sincere or making a snide remark.</p><p>Alexander sat on the couch, and I curled up next to him.</p><p>I was curious about this friend who seemed like the opposite of Alexander.</p><p>So how do you like it here so far? I asked.</p><p>Awesome, now that Ive found a room with outlets. And I cant believe Alexander still doesnt have a cell phone. How do you two communicateby smoke signals?</p><p>Excuse me? I asked defensively.</p><p>Its okayhes just joking, Alexander reassured me.</p><p>Oh, I said, relieved. My first response was to protect Alexander. I hadnt been exposed to anyone before who amiably ribbed my boyfriend.</p> <p>So who are you texting? A girlfriend? I wondered aloud.</p><p>One of many, Alexander said. A lady in every town.</p><p>It must be nice to receive steamy texts, I hinted to Alexander. Id cherish every one.</p><p>Alexander only shook his head.</p><p>Ohyeah, Sebastian said. Im being rude, arent I? After a few clicks, he closed his phone.</p><p>Sebastian sat up, now ready for conversation. So, what did you do all day? he asked. Soak up the sun?</p><p>Hardly. I was stuck in school. How about you?</p><p>Well, my day started about two minutes ago.</p><p>Yes, thats what I figured. Soits really cool you came to town. I havent met any of Alexanders friends.</p> <p>He likes to keep us hiddenlike tucked away in a vault somewhere.</p><p>So do you live in Romania, too? I inquired.</p><p>Yes. We lived next door to each other.</p><p>I imagined two Gothic mansions resting on top of a large mountain surrounded by fog, witchlike trees, and a ghostly cemetery and protected by a full moon.</p><p>I guess you didnt live in the suburbs? I asked.</p><p>Not exactly.</p><p>Do you live in a mansion, too?</p><p>I guess. I never thought about it really. It was just our home. But we had lights, he said, giving Alexander a verbal jab.</p><p>Do you know Jagger and Luna?</p><p>Vaguely. I wasnt there for that whole covenant thing. I crossed paths with Jagger, but Luna was a mortalso I never saw her. My family travels a lot.</p><p>Are they art dealers like Alexanders?</p><p>Nothey are pilots.</p><p>Are they all</p><p>But before I could say vampires, Alexander placed his hand on mine. So many questions. Dont you want to save a few? he hinted politely.</p><p>Finally, a woman who is interested in me for a change, Sebastian said coyly. And a beautiful one, at that. He flashed a mesmerizing smile. So what do you want to know?</p><p>Sebastian was charming, no doubt about it. But my interest was in Alexander. I wanted to know more about Sebastian but even more about my own handsome boyfriend.</p><p>Are you homeschooled like Alexander?</p><p>Yes. But we took night classes together. We had to take a few for exams. Alexander helped me pass themwithout knowing it.</p><p>So what was Alexander like?</p><p>I think its time we figure out what were going to do, Alexander interjected.</p><p>Sebastian ignored his host. Ahthats the real question. About Alexander. You were working your way through me to get to him, werent you? he asked. Its okay. Im used to it. Alexander always got the girls, he revealed.</p><p>Oh, really? I asked. I couldnt bear to imagine Alexander with any other girl than me. I felt a sword of jealousy pierce straight through my heart.</p><p>Something about long hair and being an artist, Sebastian added.</p><p>I bit my black lip. Alexander shot Sebastian a cold stare.</p><p>Maybe we should go, I said.</p><p>Dont worry, Sebastian said sweetly. He broke many hearts. Thats why I had to check out the girl who made him stay. Most keep him running.</p><p>I felt relieved and flattered at the same time.</p><p>So what about you? I asked. Where is your girlfriend?</p><p>Me? he asked. I dont have one.</p><p>I figured with all your travels, I said.</p><p>True love has always eluded me, he confessed. He spoke in a charming and intimate tone, as if he was baring his heart for the first time.</p><p>So, what are you looking for? I asked.</p><p>Someone kind, sincere, and captivating. Someone unlike anyone else Ive ever met.</p><p>Someone like Raven? Alexander said proudly, giving me a gentle squeeze.</p> <p>Yes, just like Raven. Sebastian grinned. But without the artistic boyfriend.</p><p>Then Im sure you will find her, I reassured him.</p><p>Sebastian gazed at me with a stare so bold, yet sincere, that tiny hairs rose on the back of my neck. I havent found her yet. But Im hoping my true love is closer than I think.</p><p>Well, I hope you find her soon, I said.</p><p>Alexander switched off the game and TV. Lets get something to eat.</p><p>We all rose and collected our things. As Alexander returned the remote to the TV stand, Sebastian leaned toward me so closely his goatee brushed softly against my cheek. I hope I find her soon, too, Raven. He whispered in my ear with such intensity that chills raced down my spine. Im starved to death. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I wasnt sure what Sebastians opinion of Dullsville would be. It certainly wasnt London, Paris, or Lisbon. He, like Alexander, had been to places Id seen only in Armstrong Travels brochures.</p><p>As we sauntered down Main Street, past the courthouse, fine restaurants, and trendy boutiques, I held my crimson-streaked head high, knowing that I was in the company of two vampires and that glaring Dullsvillians werent aware of their true identity.</p><p>I had to admit we were a motley crew. Sebastian sported his wild dreadlocks, shining rings, and snake tattoos. Alexander was gorgeous in his studded leather jeans and white T-shirt, while I danced around the sidewalk in a dark knit hat, torn black-and-red minidress, and midcalf lace-up boots.</p><p>Townspeople, decked out in their designer jeans and Kate Spade bags, avoided us as if we were the stars of a freak show. But I loved it! I felt triumphant being surrounded by what I thought was normal. Though Dullsvillians gawked at us, I sensed that most of them were staring at me, wondering who I thought I was, drawing such negative attention.</p> <p>Thats it, I said when we reached the Main Squares fountain. That is our bustling metropolis.</p><p>This town is really quaint, Sebastian remarked.</p><p>Yes, different from what you are used to, I suppose. Instead of the Eiffel Tower, we have a ten-foot-tall bubbling fountain. And instead of the Roman Colosseum, we have Dullsville Highs stadium.</p><p>No, I like it. I can see why Alexander and his grandmother moved here.</p> <p>You do? I asked. Did you know Alexanders grandmother?</p><p>I never met her. She moved here years ago and rarely came back to Romania to visit. But I hear she was a wonderful woman.</p><p>I hear that, too. I squeezed Alexanders hand tightly.</p><p>So, Sebastian continued as we passed Shirleys bakery, where does one go in this town for a bite?</p> <p>I can treat you to some ice cream, I offered. Shirleys has the best in town.</p> <p>Thats not what I was referring to, Sebastian said.</p><p>Then what exactly were you referring to? I pressed. It wasnt every day a girl from Dullsville got to hang out with two sexy vampires.</p><p>Where are the babes in town? he said, licking his fangs. I mean besides you, of course.</p><p>I wasnt sure if Sebastian was serious about finding a meal in the form of a girl. Even though he was Alexanders best friend and surely benign, he was a true-blooded vampire.</p><p>Probably at home studying or shopping at the mall, I finally said.</p><p>No bars? he asked.</p><p>None that youd like or that we could get into.</p> <p>So where do you two go for fun?</p><p>The cemetery, I answered.</p><p>There are girls there? he asked, surprised.</p><p>Not living ones, Alexander said.</p><p>We all laughed.</p><p>Yeah, I guess not, Sebastian said.</p><p>I figured youd love cemeteries, I said. Alexander does.</p><p>Sebastian would rather hang in an Internet caf ̈¦, Alexander told me.</p><p>It was not the atmosphere Id imagined Alexanders best friendmuch less a vampirepreferring. But perhaps I rushed to judge him, as so many of the students at Dullsville High judged me.</p><p>Well, theres one right there, I said, pointing across the street to Javalicious.</p> <p>Sebastian perked up. Lets grab some coffee.</p><p>All right, Alexander said.</p><p>Great, I thought. Here I was hanging out with two hotties from the Underworld, and we were going to sit in a mundane coffee shop?</p><p>And well sip it by the tombstones, Sebastian suggested as if reading my mind.</p><p>Happy and giddy, I linked arms with Alexander, and the three of us headed for the shop.</p><p>I tried to pay for two jumbo-size caramel mochas with whipped cream and one hot chocolate, but Alexander insisted on treating us. He beamed like I hadnt seen before, basking in the company of his two best friends.</p><p>An elderly couple sharing a pot of tea seemed preoccupied by our presence.</p> <p>Dude, did you see her checking me out? Sebastian teased as Alexander dropped a few dollars in the tip jar.</p><p>The woman rose and made her way toward us.</p><p>I think she heard you, my boyfriend said, taking his hot chocolate.</p><p>I do like older women, Sebastian whispered, but this one is using a walker.</p><p>The woman slowly approached Alexander, who towered over her. The demure lady had two circles of soft blush on her powder-white skin. Alexander politely stepped aside, assuming she was going to order.</p><p>She was quick to grab his hand. Are you the Sterling who lives in the Mansion on Benson Hill? she asked.</p><p>The two baristas ceased brewing and the entire shop of coffee klatches eagerly listened.</p><p>Alexander looked as if he wasnt sure how to respond. No one in town had ever talked to him before. Even though the elderly woman wasnt threatening, we were still uncertain of her motives.</p><p>Uhyes, he finally replied.</p><p>We have a Sterling painting hanging in our home. I bought it at the art auction last month. We were told it was by an up-and-coming Romanian artist. Is the artist a relative of yours?</p><p>Yes, a very distant one Sebastian interjected before Alexander had a chance to speak.</p><p>I was surprised by Sebastians remark, especially since it wasnt true.</p><p>Are you kidding? I asked. Alexander was too humble to speak up. Alexanders the artist, I announced proudly.</p><p>My boyfriend glared at me and shook his head.</p><p>But you are so young, the woman complimented. It couldnt be you.</p> <p>It is! I said, glowing. Isnt he wonderful?</p><p>My husband would love to meet you, she said, referring to the older gentleman seated at her table. If you have a moment</p><p>UhI appreciate that Alexander began politely.</p><p>Perhaps another time, Sebastian interjected again. We really should be going.</p><p>Like a savvy media handler, Sebastian whisked us away from the woman before she could ask any more probing questions.</p><p>See, I told you Alexander attracts the ladies, Sebastian lamented. If only she were sixty years younger.</p><p>Sebastian was leaning against an already tilting tombstone while Alexander and I were nestled together on a cold cement bench.</p><p>This town is relaxing, Sebastian commented, gazing at the stars. Besides that curious woman, no one really bothers you. You could hide out here forever and no one would notice.</p> <p>I think they notice, I corrected. And most of the people do bother me.</p><p>Not when Im around, Alexander said.</p><p>True. Im lucky; I have a bodyguard. I took a sip of coffee. Speaking of bodyguardsWhy didnt you guys talk to that couple? I figured youd want to tell everyone about your paintings.</p><p>Its probably best not to, my boyfriend said.</p><p>You dont have to be humble, I told him. But I must confess it is an endearing quality.</p><p>I rested my head on Alexanders shoulder, and he gently stroked my hair.</p><p>In this case, its survival, Sebastian said. Would you like Alexander to be run out of town?</p><p>Of course not, I said, sitting up.</p><p>Then he cant become the next Picasso, he added.</p> <p>But he sold his paintings to half the town, I challenged. They are bound to wonder who painted them.</p><p>Yes, and then theyll be asking questions. Who is this mysterious artist that lives on Benson Hill? Why does he live by candlelight? Why does he sleep in a coffin?</p><p>I wasnt planning on telling them what he is, just who he isan amazing artist, I defended. You know that, Alexander.</p><p>Of course, he reassured me. I dont think we have to worry. She was just a kind and elderly woman. I dont think shell be asking for a tour of the Mansion anytime soon.</p><p>Youre right, Sebastian conceded. Far be it from me to come to town and upset what youve established here. You have a really sweet setup. But for meI need more.</p><p>Excitement? I wondered aloud.</p><p>No.</p> <p>Wi-Fi?</p><p>Sebastian leaned toward us and glanced around. Vampires, he whispered.</p><p>I was surprised by his candor.</p><p>Im not sure if I could be the only one in town, he admitted to me. Thats why I always admired Alexander. He seems comforted by the things that frighten me the most.</p><p>I melted at his compliment for my boyfriend. Id always regarded Alexander with such high esteem, and I blushed knowing that others did as well. Alexander must have been touched, too, because a warm smile came over his face.</p><p>This is a great place for someone like us, Sebastian said, stretching out again. If you dont mind being the only immortal.</p><p>Sebastians remark filled me with loneliness for my boyfriend. Maybe Alexander was better off not being the only vampire in town.</p> <p>Do you think youll move here, too? I asked. Then Alexander wouldnt be the only one.</p><p>Actually, Ill be taking off in a few days, Sebastian replied. Alexander didnt seem surprised, but I was disappointed.</p><p>But you just got here, I said.</p><p>I never stay in one place too long when I travel. Dont want dust to collect on my casket.</p><p>But were having so much fun. Arent we, Alexander?</p><p>Yes But Alexander didnt need to respond. His face showed a contentment I wasnt sure Sebastian had ever seen.</p><p>Besides, Im cramping your space, Sebastian said.</p><p>Its a mansion, I said. All it has is space.</p><p>Yesyou can stay as long as you like, Alexander said. You know that.</p> <p>Sebastian surveyed Alexander and me hand in hand, cuddling on the bench. Then he gazed off into the distance. Perhaps I need to add a bigger city to my collection. And, who knows, I might get lucky and meet someone there like you did here.</p><p>Sebastian took a swig of his coffee, crushed the cup in his hand, and tossed it into a garbage can. He popped in his earbuds and began dancing his way around the tombstones.</p><p>Looking for someone you know? I asked.</p><p>You never know who youll find at one of these places.</p><p>Where Alexander had found a moment of peace, Sebastian was restless. He was searching for himself in the many cities plastered on his coffin. But just like in Barcelona, New York, Rome, and the many other places he visited, he hadnt found a home in Dullsville.</p><p>Not only was I caffeinatedI was confused. It was more than a giant-size caramel mocha that was creating my insomnia. I lay awake in bed, clutching Nightmare as she fell asleep in my arms. How could she sleep so peacefully when so much was going on? At first I didnt want another visitor in the Mansion, but now, after meeting Alexanders best friend, I wasnt ready for him to leave Dullsville. Sure, he was disorganized and messy, but he had an insight into Alexander that I couldnt get without him.</p><p>And I found myself feeling a little jealous that he had the freedom to fly off to the bright lights of the cities far away. I could only imagine what it would be like to have the opportunity to monster-watch at Loch Ness, search for witches in Salem, or camp beneath Draculas castle in Romania.</p><p>Also, I was getting a little attached to Sebastian. It wasnt only that he was more playful than the other vampires Id met, like Jagger or Luna, but I was concerned how Alexander would feel when his friend left him behind. I couldnt imagine a happy existence without Becky by my side.</p><p>First Alexanders parents left, and now his best friend would be going. Could this mean that Alexander would want to leave, too? Their visits and eventual returning to his homeland, Romania, might remind him of what hed been missing since his own arrival in Dullsville. He had roots with his vampire family and friends. And if he didnt turn me into a vampire, would he eventually become lonely surrounded by mere mortals? I began to wonder if I could possibly be enough reason for him to stay. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alexander appeared confident and content in the company of our cryptic clique as we entered Hatsys Diner. He hummed Love Me Tender as Elviss voice crooned throughout the fifties-themed restaurant.</p><p>Once again our odd threesome was met with glaring eyeballs, but my immortal companions appeared unaware. Sebastian seemed immediately taken with the charm and authenticity of the diner and was intrigued by the juke-boxes. While the vampires picked out a few songs, I found Becky sitting in a red vinyl booth, texting.</p><p>I plopped down across from her. Wheres Matt? I asked.</p><p>He has to study. But he says hello. She held her phone in front of my face. It displayed the words L8TR QT followed by Tel R Hi.</p> <p>I waved to the phone.</p><p>Although I loved that Alexander was reclusive and shrouded himself in mystery, I did wonder what it would be like if Alexander had a phone and I could receive sweet nothings on my phoneLUV U LOTZ, Cant W8 2 C U, A X R. I had a million girlie texts from Becky and quite a few nagging ones from my mom but nothing close to the love notes Becky was receiving from Matt.</p><p>Suddenly, Alexander and Sebastian were standing at our booth. Alexanders black hair hung sexily over his deep, dark eyes, his white collar perched up around his neck, and he wore a dark jacket and tight jeans. His Underworldly cohort, Sebastian, stood with his hands in his oversized pockets, sporting sparkling earrings and wildly woolly locks.</p><p>Becky, I began. This is Sebastian.</p> <p>Sebastian and Becky locked eyes. They both froze for a moment that lingered like an extra heartbeat. There seemed to be an electric charge that surged between the two. His pale face flushed ruby red. She giggled without a sound.</p> <p>Come sit down, I said, hoping to sever their strange and sudden connection.</p><p>Oh yeah, Sebastian said, as if coming out of a fog. Becky quickly shut her phone.</p><p>Alexander scooted next to me and placed one hand on my red-and-black-striped tighted knee and the other around my shoulder. He smelled yummy in his lightly scented Drakkar, and my pulse quickened.</p><p>Sebastian inched awkwardly onto the bench next to Becky. The seemingly self-assured guy appeared suddenly shy and smitten. He tucked his hair behind his ear and played with the rings on his fingers.</p> <p>Becky held her purse tightly in her lap like a childs teddy bear and nervously twisted the nylon strap.</p><p>I hope youre hungry, I said, and handed Sebastian a menu that sat behind the tabletop jukebox.</p> <p>You know I am, he mumbled.</p><p>Sebastian fidgeted in the booth and tapped his fingers against the menu. Becky avoided him by flipping through the jukebox songs.</p><p>Dixie, a familiar waitress, came over. She wore her hair in a black beehive, and her curvy figure was squeezed into her white uniform like a forties pinup girls. When she wasnt reading a tabloid magazine at the soda counter, she was heckling her customers. She had a heart of gold but little patience for the teen clientele.</p><p>Whatll you have? she asked.</p><p>Sebastian hadnt had time to open his menu; he was too busy perusing Becky. What are you getting? he asked Alexander.</p> <p>The malts are fabulous, Alexander said.</p><p>Order anything youd like, Sebastian, I said.</p><p>Anything? Or anyone? Sebastian gave a cheeky wink to my best friend.</p><p>Sebastian waited for her response. Embarrassed, Becky blushed and giggled. Sebastian took that as a positive sign and he, too, grinned.</p><p>Alexander chuckled and I sneered. I was the only one not finding any humor in his comment.</p><p>Four chocolate malts, four burgers, and two atomic fries, I said to Dixie.</p><p>Sounds good to me, Becky said.</p><p>How do you want the burgers cooked? Dixie cracked her gum so loud it sounded like a car backfiring.</p><p>Rare, Sebastian said.</p><p>Alexander kicked Sebastian underneath the table.</p><p>Rare? Becky asked.</p> <p>We dont serve hamburgers rare here. With the tip of her pen she pointed to a small disclaimer on the bottom of the menu. This isnt a five-star restaurant, if you hadnt noticed. You can order your burgers burnt or not burnt.</p><p>Then four not-burnt burgers, Alexander said with a grin.</p><p>Dixie blew a pink bubble, winked at Alexander, and wiggled toward the kitchen.</p><p>We all cracked up, and when our laughter subsided there was an awkward silence.</p><p>Sebastian checked out Becky, which caused her to fiddle with her napkin.</p><p>Alexander and Sebastian grew up together in Romania, I told her. Just like us, best buds.</p><p>Thats great, Becky said demurely. She wrung the napkin again.</p><p>Since no one else was talking and I was dying to find out more about Alexander, I figured this was as good a chance as any to steer the conversation in that direction.</p><p>So what did you two guys do for fun in Romania? I asked.</p><p>Alexander shrugged his shoulders. I dont knowwe just hung out.</p><p>And played golf? I asked.</p><p>No. Alexander laughed. We did the things kids do</p><p>Yesbut you werent normal kids.</p><p>Becky appeared puzzled.</p><p>I mean, since Alexanders grandmother was a baroness, I said, covering my comments.</p><p>Dixie returned with our shakes. Becky hid behind hers and the rest of us began to devour ours.</p><p>Did you get into trouble? I asked.</p><p>I did Sebastian said. But Alexander was always there to get me out of it.</p><p>I nestled into my boyfriend.</p><p>What do you do for fun? Sebastian asked Becky.</p><p>Me? she asked, surprised the conversation was directed toward her.</p><p>Yes.</p><p>Becky leered at me as if I were going to answer for her.</p><p>Sebastian waited, but Becky didnt answer. She just played with her straw.</p><p>We do girlie things, I answered for her. Talk, gossip, and talk some more.</p><p>Do you like cemeteries? he asked.</p><p>Me? She shook her head vehemently.</p> <p>Was Alexander in his attic room painting like he is now? I asked.</p><p>Uhyes. He always was working on some masterpiece. But he rarely showed me. He kept them hidden in an armoire in his room. Do you paint or draw? he asked Becky.</p><p>NoIm not an artist.</p><p>Did you guys go clubbing? I asked Sebastian.</p><p>Sure, sometimes. Do you like to go out, Becky?</p><p>Uhme?</p><p>Alexander, I said, clearing my throat. I left something in the car. Can we go get it?</p><p>Uhsure, my boyfriend replied.</p><p>Sebastian reached into his back pocket and handed Alexander his keys.</p> <p>Once Alexander and I were outside Hatsys, I stopped.</p><p>The car is over there, Alexander said.</p><p>I didnt forget anything. I wanted to talk to you.</p><p>Alexander was perplexed. What do you want to talk about?</p><p>What is going on with Sebastian?</p><p>What do you mean?</p><p>Im trying to have a conversation with him and all he wants to do is talk to Becky.</p><p>He doesnt mean anything by it. Hes just being polite.</p><p>Does he think we were fixing him up? I asked.</p><p>I dont think so.</p><p>Well, he needs to back off. Dont you see the way hes staring at her? Hes hitting on her.</p> <p>I think you might be overthinking it, Alexander said soothingly.</p><p>Did he ask me one question? I charged.</p><p>Alexander paused. Is that what this is about? That hes not paying attention to you? he asked sweetly. He doesnt always have the best manners. I do try to tell him.</p><p>NoI dont care that he doesnt ask me.</p><p>But perhaps it did bother me. Maybe I was getting wrapped up in his attention toward Becky. Maybe I was oversensitive to his advances since they were not directed toward me. I felt like a heel, accusing Alexanders friend of preying on Becky.</p><p>Okay, okay. I guess Im just being overprotective of Becky, like you are of me.</p><p>When we returned, Sebastian was holding Beckys hand and reading her palm. This is your life lineand this is your love line. He was seductively tracing her lines with his finger. Very strong indeed.</p><p>See? I whispered to Alexander.</p><p>Now Ill show you mine. He scooted closer to her and held out his palm.</p><p>Becky giggled uncontrollably. She glanced at a long line running through his hand. She had a quizzical look on her face. Wowyour life line seems to go on forever.</p><p>Now Alexander wasnt pleased with Sebastians flirting.</p><p>How about you tell them about the time you drove your Mustang through the cemetery and it almost fell into an empty grave, Alexander prompted his friend, taking charge of the situation.</p><p>Just then Dixie arrived with a tray full of food. Sebastian tore into his burger while Becky picked at her fries.</p><p>I could tell she wanted to say something to Sebastian. Normally, Becky was painfully shy, but with Sebastians playful attitude toward her, she was loosening up. What do you and Alexander do all day while we go to school? she asked suddenly.</p><p>Sebastian was pleased with her interest. Sleep.</p><p>You sleep all day? I cant imagine not getting up when the sun rises.</p><p>Well, I stay up all night.</p><p>Like Raven? She has insomnia. Shed sleep all day and go to school at night if she could.</p><p>Or not go to school at all, I chimed in.</p><p>They laughed, but I was serious.</p><p>You are so different from other girls I meet, Sebastian said.</p><p>Becky slunk down. I knowIve never been to Europe or even New York.</p><p>NoI mean that as a compliment, he continued.</p> <p>Becky lit up. She wasnt used to being paid so much attention by a good-looking stranger.</p><p>Yes, Beckys the greatest, I praised. Not like those other girls in school who are obsessed with everything Gucci. Weve been friends since the third grade.</p><p>I can see why you like it so much here, Sebastian said to Alexander. The people are really genuine. And cute.</p><p>Becky turned as red as the bottle of ketchup she was reaching for. She squeezed it over her fries but then left them untouched.</p><p>So, Alexander, I said, taking over. Now we know what we do all day. What do you do?</p><p>Alexander sat up as we waited for his response.</p><p>I spend it thinking about you, of course.</p><p>After stuffing our faces with burgers and chocolate malts, Alexander gallantly paid Dixie and we headed for the parking lot.</p> <p>We escorted Becky to her truck underneath a star-filled night sky.</p><p>It was great meeting you, Sebastian. She opened her arms to give him a friendly hug. Alexander cleared his throat when Sebastian squeezed her a bit too long.</p><p>When will I have the pleasure of seeing you again? Sebastian asked. Clearly, Sebastian didnt want our visit to end.</p><p>Becky twisted her hair and shrugged her shoulders. She gave me a quick hug, hopped into her truck, and rolled down the window.</p><p>Good night, Raven, she said. Ill talk to you tomorrow. Good night, Alexander.</p><p>We watched and waved as Becky drove out of the parking lot and down the street.</p><p>So now what do you want to do? I asked. Hang out at the cemetery again?</p> <p>I guess we should be dropping you off, Alexander said.</p><p>Me? But the night is so young, I moaned.</p><p>Alexander put his arm around me and we headed for the Mustang, but Sebastian continued to stare in the direction Becky had just driven.</p><p>Whats up? Alexander asked him, tripping him out of his trance.</p><p>Sebastian was silent.</p><p>Hello. Are you in there? Alexander prompted again. Is something wrong?</p><p>I dont know, Sebastian said. Ive never felt like this before.</p><p>Are you sick? I wondered.</p><p>I thinkIm in love, Sebastian announced, as if it was just occurring to him.</p> <p>With who? I asked. Dixie?</p><p>I can see why you like it here, dude, he said to Alexander. You found your soul mate, and now Ive found mine.</p><p>Who are you talking about? Alexander asked.</p><p>Becky.</p><p>I laughed. But then I could see that Sebastian was dead serious.</p><p>She has a boyfriend, I said.</p><p>She does?</p><p>Yes, I said emphatically.</p><p>Of course she does. Someone as pretty as her. But does that matterin the long run? Sebastian mused.</p><p>It matters. Besides, shes not really your type.</p><p>AB negative? I like all kinds. Sebastian didnt seem to be joking, but Alexander broke a smile.</p><p>Its not funny, I said. I think its time to go</p><p>Im not laughing, Sebastian said. It aches in here, he said, pointing to his heart.</p><p>Thats not love, thats indigestion, I said. Hatsys is known for it.</p><p>I cant shake it.</p><p>We can stop at the pharmacy and get you some Rolaids, I offered.</p><p>Sebastian faced me intently. This isnt heartburn. Dont you see?</p><p>All right, Alexander said, putting his hands on Sebastians shoulders. Its time we head out.</p><p>Did you see how into me she was? Sebastian asked. Asking me all sorts of questions?</p> <p>She was just being polite, I told him.</p><p>I like that. Most girls I meet are into themselves. Can you give me her number?</p><p>Her number? I asked, alarmed. But she already has a boyfriend!</p><p>Something I can overlook. For now.</p><p>I really dont think</p><p>One cannot dodge Cupids arrow, Sebastian proclaimed.</p><p>I rolled my eyes. Cupid isnt the only one with an arrow. I scowled.</p><p>Alexander rubbed my neck. Its okay. Hes just playing.</p><p>We got into the Mustang, and as Sebastian drove me home, the ghostly duo boisterously sang to tunes blasted from his speakers. I pretended to not be disturbed by Sebastians off-key singing or his sudden proclamation.</p> <p>Sebastian waited in the car while Alexander escorted me up the front steps.</p><p>Why didnt you say anything about Becky? I asked when we reached the door.</p><p>Hes harmless. He falls for girls all the time and whines when they dont fall back. I was surprised he didnt declare his love for you. Alexander fingered my belt loops and drew me to him.</p><p>Yeah, why didnt he? I asked, gazing up at him.</p><p>Im sure he did, he said, brushing my hair away from my face. He just knows what Id do to him if he did anything about it.</p><p>You think hed really like me?</p><p>For a moment, I too was as giddy as Becky had been. Not because I liked Sebastian but because I liked the idea of being admired. I spent so much of my life in Dullsville being ostracized, it was exhilarating to know that I might be attractive to the male species, especially when the male species was the vampire kind.</p> <p>How could he miss the most beautiful girl in Dullsvilleor the world, for that matter? Alexander asked. Hed have to be blinder than a bat.</p><p>My boyfriend stared at me, his chocolate eyes burning through me. He leaned into me and gave me a five-star kiss. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The following morning, I was lumbering around my room in a towel and Jack Skellington slippers like a lost zombie, vacuously trying to figure out what to wear to school, when I heard Becky repeatedly blast her trucks horn. I threw on the first thing I saw, a charcoal-colored T-shirt dress, and layered it with a ripped Wicked Wiccas tank, gathered my backpack, and haphazardly dragged myself out of my house. When I got into her truck, Becky was sporting an overblown grin.</p><p>Whats up? I asked.</p><p>He texted me like a hundred times. She blurted out the words as if shed been holding them in for a decade.</p><p>Who? I asked. But I already knew the answer. Sebastian?</p> <p>She tried to hide the smile that crept across her face by chewing on her sparkling pink lip and drove us toward school. How did you know?</p><p>A hundred? I asked flatly.</p><p>Wellnot exactly. But Im going to have to buy more minutes.</p><p>What did he say?</p><p>He wanted to know what I was doingwhat I liked to dowhat were my favorite flowers. Becky beamed.</p> <p>Did you answer?</p><p>I did until Matt texted in. Then I told him I had to go.</p><p>You shouldnt be texting Sebastian.</p> <p>Why?</p><p>Why? Because you have a boyfriend.</p> <p>I know that. But its no big deal.</p><p>Are you kidding? Becky was as serious as she was naive. She was so amazed that Matt liked her, she couldnt fathom that another guy might possibly feel the same. Texting another guy? In some countries you could be jailed.</p><p>Raven, I think youre totally overreacting.</p><p>Me? Overreact? Promise me you wont text him anymore.</p><p>He was just being nice.</p><p>Hes not being nice. Hes dangerous, I blurted out.</p><p>Hes a criminal? Becky squealed.</p><p>Of course not, I said, and sighed.</p> <p>Becky was being unusually stubborn. I knew it was because she simply didnt think I wasnt going to leave her in the dark anymore. I had to use all my ammunition.</p><p>Hes dangerous for different reasons than you think. Hes in love with you!</p><p>Becky almost slammed on the brakes. Youre joking.</p><p>Noits true.</p><p>No ones ever been in love with me. Not even Matt.</p><p>What? Of course Matt loves you.</p><p>Well, hes never said it.</p><p>I was surprised. I figured Matt told her all the time, as Alexander told me.</p><p>Are you sure?</p><p>Yes, Im sure. I would have told you the minute he told me.</p> <p>I just assumed he already had. But clearly, he doesnt need to. Its written all over his face.</p><p>You think so? she asked with doughy eyes. You know how I feel about him.</p><p>Of course he loves you. Thats why you have to stay away from Sebastian. So you dont spoil your relationship with Matt.</p><p>Id never let that happen. But I dont believe you about Sebastian. Truly, he was being totally innocent.</p><p>Guys dont want to be just friends. Havent you seen When Harry Met Sally?</p><p>No.</p><p>Well, perhaps its time you watched it.</p><p>Ill rent it tonight.</p><p>Perfect. Then were done with the subject, I ordered. Hes supposed to be leaving soon anyway, so theres no need to mention his name.</p><p>Mention whose name? she asked with a cute grin.</p><p>Becky parked the truck in the student parking lot. We dashed up the front stairs through the bustling hallways and hurried to our lockers. She opened hers to find a glass vase tied with a white ribbon and filled with tiny pink roses.</p><p>WowMatt never gave me roses before, she exclaimed. Didnt I tell you I had the best boyfriend ever?</p><p>My stomach tied itself in a bigger knot than was on her bow.</p><p>My guess is they arent from him, I mumbled.</p><p>What?</p><p>Uhnothing. Is there a card?</p><p>Oh She picked through the flowers. Here it is. Until we meet againSebastian, she read aloud. Sebastian? My best friend was as shocked as she was flattered. She stuck the card back in the vase.</p><p>Suddenly Matt appeared behind us. Becky gasped and turned corpse white.</p><p>Did you miss me last night? he asked with a churlish wink.</p><p>I did, I said truthfully.</p><p>Thanks, Raven.</p><p>Becky tried to envelop the flowers in her unbuttoned paisley cardigan, but her sweater was too small and a few buds peeked out from her neckline.</p><p>Where did you get those? Matt asked. You dont have a secret admirer, do you?</p><p>Becky froze. She never lied to Mattor anyone, for that matter.</p><p>They are mine actually, I fibbed for her. She was holding them while I shut my locker. I held out my hand.</p> <p>Becky opened her sweater and I took the vase.</p><p>The bell rang and Mrs. Hathaway, our history teacher, opened the door for class.</p><p>I didnt think pink was your color, Matt said, bewildered.</p><p>UhIts not. Im regifting.</p><p>I cant believe youd give away flowers from Alexander, he charged.</p><p>They arent from him I said, trying to defend my actions. Then I realized what Id said.</p><p>Matt spotted the card poking out of the vase. He snatched it before I could stop him.</p><p>Sebastian? he read. Alexanders friend? Why is he giving you flowers?</p><p>My horror story was spinning out of control. I wasnt even sure what I was saying anymore.</p><p>Uhwere going to be late for class, I said.</p><p>Yes, Becky agreed. She took Matts hand and led him into class before our story got any more fictional.</p><p>I handed Mrs. Hathaway the bouquet. She was quite surprised and a little skeptical of my gift but happily placed the vase on her desk.</p><p>Becky and I glared at the bouquet. Even under normal circumstances I couldnt focus too long on history. Now, with Sebastians roses prominently displayed in class, both Becky and I were distracted. For once, neither of us learned a thing.</p><p>The sky over Dullsville was picture perfectbeautifully blue and dotted with bright, puffy clouds. It didnt match the storm I felt brewing inside me during lunch as Matt questioned Becky and me about Sebastian on the bleachers.</p><p>I have to meet this dude, Matt said, wiping his mouth with the back of his hand. Hes either a real gentleman or a real snake.</p> <p>Giving flowers to another guys girl? If he did that to my girlfriend, Id have to take him out.</p><p>Matt had grown up as Trevors shadow. Now that hed broken away from Trevors clutches and started dating Becky, he showed a confidence I didnt know existed. That said, he still was far from the type of guy to throw the first punchor the last, for that matter.</p><p>Why dont we talk about something else? I suggested. I was trying to eat organic peanut butter and jelly on a million-grain roll my mother had bought at some overpriced health food store. Becky fingered her gluten- and flour-friendly roast beef sandwich. She noticed my distaste and happily traded lunches with me.</p><p>Does Alexander know Sebastian gave you flowers? Matt asked skeptically.</p><p>No, he doesnt, I said.</p><p>Are you going to tell him?</p><p>UhI guess.</p> <p>I think its important to be honest in a relationship, Matt said. Becky and I always tell each other everything. No secrets.</p><p>Becky hid her face in her hands. Matt, theres something you should know</p><p>Did I tell you Sebastian wont be in town much longer? I suddenly asked. Hes just passing through. So surely we can talk about something else.</p><p>Becky paused. Yes, she agreed. Lets talk about</p><p>Thats a shame, Matt said. I would like to meet Alexanders best friend. I imagine hes pretty cool. Whats he into?</p><p>Hes into Becky, I wanted to say.</p><p>Gaming, Becky said. He looks like a modern-day pirate, she said, half dreaming. All he is missing is an eye patch and a pegleg.</p><p>Maybe I should be the one worried about him honing in on my girlfriend.</p><p>Matt gave her a bear hug as she blushed.</p><p>How about the five of us hang out tomorrow? he continued. The team is going to Hooligans and you guys can come, too.</p><p>Hooligans was a grown-up version of Chuck E. Cheesewithout the oversized rat. Id gone there on a few occasions when Billy was still being called Nerd Boy. My little brother loved the video games and I loved a night out.</p><p>I wasnt sure if Hooligans was going to be Alexander and Sebastians idea of fun, but I was more concerned with Becky being in the magnetic vampires presence again.</p><p>Id rather spend time with just us, Becky said. I havent seen you</p><p>Yeahthe guys have been keeping late nights, I said truthfully. They might want a night off. And more important, who wants to see Trevor?</p><p>Its a big place. You wont even run into him, Matt said encouragingly. Besides, if Sebastian is leaving, when will you get a chance to see him again? Matt asked, excited by his idea.</p><p>I was hoping not anytime soon, Becky whispered to me.</p><p>Awesome, Matt declared. Well meet this week. But Im warning you, Raven, if you open your locker this afternoon and find a ring, then Im telling Alexander.</p><p>As soon as the sun set, I hopped on my bike and motored toward the Mansion. It was imperative I get to Alexander posthaste, and this time I wasnt going to let anyone stand in my waynot even a handsome soccer snob. I was fortunate that all I had to dodge were a few cars and a woman walking her poodle.</p><p>I pounded on the door until Jameson politely let me in. I paced on the squeaky parlor floorboards for what seemed like an hour until Alexander finally entered the room.</p><p>Alexander was dreamy, standing in the doorway, his long black hair tousled and slightly damp from his shower.</p><p>You have to talk to him, I exclaimed. I have to talk to him.</p> <p>What? Talk to who? he asked.</p><p>Sebastian, I said, racing over to him.</p><p>I was so harried, the note card fell out of my hoodie pocket and onto the floor. Alexander picked it up before I could place my boot over it.</p><p>Until we meet againSebastian? he read aloud.</p><p>Alexanders dark eyes turned angry red. What is my best friend doing giving you cards? he asked, his brow furrowing.</p><p>It wasnt a card, Alexander. It was flowers.</p><p>Alexander looked shocked, then angry. He couldnt hide a feeling of betrayal as his expression tightened. Sebastian! he began to call.</p><p>I grasped his arm. They werent for me.</p><p>Then who were they for? he asked skeptically.</p> <p>Becky. He texted her all night and then had roses waiting for her in her locker.</p><p>Alexander was only partially relieved. Now he was confused. Why would he do that? he asked softly.</p><p>You heard him last night. He said he loved her.</p><p>I know, but I didnt think he meant it. Besides, hes copying my moves. Leaving surprises in your lockerwell, Beckys.</p><p>He has to stop, Alexander. Becky isnt used to this kind of attention. And he is, after all</p><p>Like me? he asked with a hint of sadness.</p><p>No one is like you, I said, taking his hand.</p><p>Sebastian has never acted like this before.</p><p>To make matters worseMatt wants to meet him. He has no idea the flowers were for her. He thinks they were for me.</p> <p>Who gave him that idea? he asked, slightly accusatory.</p><p>Well</p><p>So now everyone at school thinks my best friend is hitting on my girlfriend?</p><p>First of all, hes not. And second, no one knows.</p><p>Youre sure?</p><p>Of course. How would they, anyway? No one talks to mejust about me.</p><p>He glanced away. I knew it was painful for Alexander to imagine me at school without him. I just wish</p><p>Just say the word and Ill quit, I said, wide-eyed.</p><p>Before Alexander could remind me of the importance of my education, I pulled him close. Matt wants the five of us to go to Hooligans.</p> <p>Jameson shuffled into the room with a tray of two bloodred smoothies, each garnished with a tiny blue plastic sword and three cherries. Alexander took one and I picked up the other.</p><p>Jamesons bulging eyes bulged out even more. Miss Raven, that is for</p><p>Ill save you the trip.</p><p>I marched up the staircase, followed by Alexander, careful not to spill the bloody concoction, and pressed my ear to Sebastians bedroom door. I could hear the sounds of footsteps on the squeaky floors, followed by a thud.</p><p>Room service, I called.</p><p>The door creaked open. Sebastians hair was sticking up like a starburst. He was sitting on his closed coffin in boxers, a black wrinkled shirt, and unlaced boots and was staring at the cell phone in his hand. Socks, T-shirts, and bandannas were scattered around his coffin like the dirt from his homeland.</p> <p>What happened to you? Alexander asked.</p><p>I didnt sleep. Ive been up all day.</p><p>Well, heres your breakfast, I offered, almost shoving the drink at him.</p><p>Im not thirsty.</p><p>Oh, yes you are. I need you well nourished.</p><p>He examined the smoothie and fiddled with the tiny sword.</p><p>Try it, youll like it, I encouraged him.</p><p>He made a face. Anybody, is there a vein in the house? he called.</p><p>Alexander laughed.</p><p>It was never fun dining with the Sterlings, Sebastian continued. When the Camdens had people over for dinnerwe really had them for dinner, he joked like a vaudevillian comic.</p> <p>Drink up, I demanded.</p><p>I watched Sebastian as the red liquid slowly made its way up the straw, past his full lips, and into his mouth.</p><p>I thought hed be repulsed, as one would be tasting sour milk. But he appeared to enjoy it just as any mortal might a strawberry shake.</p><p>Raven tells me you sent flowers to Becky at school? Alexander asked.</p><p>I didnt send them, he emphasized.</p><p>Whateverhowever, Alexander said. The point is</p><p>I know. Its justIve never felt this way. Really. I see how you two are. I feel that way about Becky.</p><p>May I remind you that Becky has a boyfriend? I said firmly.</p><p>What would you have done if you thought Raven had a boyfriend?</p> <p>Sebastian challenged Alexander.</p><p>Alexander had experienced that kind of situation when he saw me with Trevor outside the Mansion last Halloween. My boyfriend thought carefully before he spoke. Its not the point what Id do.</p><p>See? Sebastian said. I cant forget her. Besides, people break up all the time.</p><p>Becky and Matt will never break up. I hadnt imagined that scenario before, and I shuddered at the thought. Shes going to get married to him.</p><p>Married? Shes still in high school.</p><p>When she gets out. And she certainly isnt going to date a vampire!</p><p>They both looked at me. I had just stuck my combat-booted foot in my black-lipsticked mouth.</p><p>I mean that in a good way, I said. Im the one who likes vampires, I declared. But Becky has a thing for mortals.</p> <p>I'm sorry, Raven, I cant change my feelings, Sebastian said sincerely. What am I supposed to do? he asked with an almost childlike quality.</p><p>You can change what you do about them, Alexander said. Ravens right. You have to back off.</p><p>Sebastian cooled down. I know. I just couldnt sleep all daywaiting and wondering when I could see her again.</p><p>Well, youll get to see her tomorrow night, Alexander revealed.</p><p>Really?</p><p>Matt wants the five of us to hang out, Alexander said.</p><p>Whos Matt?</p><p>Beckys boyfriend, I stressed</p><p>Sebastian turned toward the window. The moonlight cast a glow against his sad and almost lonely expression.</p> <p>Perhaps once he saw how happy Becky was with Matt hed be cured of his feelings for her.</p><p>Sebastian snapped back with a wicked grin. Great! Ill be on my best behavior. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The students at Dullsville High treated me more oddly than usual the next day when I arrived at school. Apart from the usual shifty glances thrown my way, I heard more whispers and mutterings than normal. I was throwing my coffee in the trash when I felt a person standing behind me.</p><p>Your secret admirer is not so secret anymore, a male voice said.</p><p>I tried to ignore the demon in khakis and inch around the trash can, but he blocked my escape. Cornered, I spun around.</p> <p>Trevor towered over me. His golden locks were combed perfectly, as if hed just been primped for a photo shoot. I didnt have the energy for one of his trivial confrontations.</p><p>Do you mind? Littering is illegal, you know. Be my guest and do us all a favor, I said, gesturing toward the can. Throw yourself in.</p><p>I love it when you talk dirty, he said, not budging. He placed his hand against the wall, blocking my exit.</p><p>I really dont have time for you today, I said, and slipped underneath his human barricade.</p><p>Two-timing your boyfriend takes a lot of time and energy, does it?</p> <p>This time I stopped and faced him squarely. What are you talking about?</p><p>Word has it theres a new monster in town and hes leaving gifts in your lockercandy, jewelry, love notes.</p> <p>I was always amazed at how fast rumors spread throughout Dullsville and how grossly incorrect they could become.</p><p>No one is leaving me anything.</p><p>Is that so? Then what were those flowers doing on Mrs. Hathaways desk?</p> <p>Teacher Appreciation Day.</p><p>Thats not until</p><p>I was planning ahead.</p><p>Im not going to even react to your lies. I thought when you ditched your boyfriend, the least you could do was come to me. After all, Im much better-looking.</p><p>I didnt ditch Alexander!</p><p>Then he doesnt know? he asked as if he was unraveling a mystery. You are two-timing him.</p> <p>Youve wasted enough of my time.</p> <p>Or are you having a monster threesome up there in that filthy mansion? You always seemed the kinky type with your studs and boots. He sidled up to me, so close I could feel his warm breath against my neck.</p><p>Noyou have it all wrong. I faced him hard. This was one time Id rather have been in class than out in the hallway. I have to go.</p><p>Well, someone is going to know about you sneaking aroundand it might be Alexander. Trevor thumped me on the head and disappeared into the crowd of students.</p><p>I wasnt dating Sebastian. There was nothing to hide from Alexanderbut by the way everyone was treating me, the whole school must have believed I was cheating on him. My boyfriend, like any other, would not have been happy about that.</p><p>After school, I was at Beckys waiting for sundown. The time had slipped by as Becky typed away at her computer doing research for an English paper and I ignored my own homework by lying on her bed, rereading The Vampire Lestat.</p> <p>I think Im almost finished, she said gleefully.</p><p>Well, I should be going, I said. The sun was slowly sinking; only a few rays still poked out behind the field. I need to tell Alexander that the whole town thinks Im dating Sebastian before it gets back to him.</p><p>Im sorry things have gotten so far out of hand. If you hadnt stuck up for me</p><p>Thats my job, I said. Im your best friend. I hopped off her bed and grabbed my jacket. I better get my bike.</p><p>When we arrived at her house, Becky and I picked apples from one of her trees for a snack, and Id parked my bike in the barn.</p><p>Becky peered out her window. Why dont I drive you home instead? she asked with concern. Its totally dark out there.</p><p>Thats okay. I can find my way.</p><p>But there arent lights, she said. Even in the barn.</p> <p>I'd always protected Beckyat school, in town, in lifebut this was her property and she wasnt normally afraid on her own land.</p><p>Dont worry, I reassured her as I walked down her creaky stairs. I can go by myself. It will just take a minute.</p><p>The light switch hasnt been working, and quite frankly its kind of spooky without it, she confessed.</p><p>Im all about spooky!</p><p>I'll drive you home, she insisted.</p><p>You dont have to do that. Besides, I love wandering around fields in the dark. Maybe well find a dead body.</p><p>Dont say that!</p><p>Once outside, Becky picked up a flashlight from on her back-porch railing. I never get used to coming out here in the dark, she said.</p> <p>It was pitch-black except for the tiny light beaming from her flashlight. We had at least fifty yards to walk just to reach the barn. The cool night air made the journey even more chilling.</p><p>Becky dug her nails into my arm but was doing her best to be brave.</p><p>I thought Id take her mind off her fears as we traipsed down her gravel road and through the darkness. So are you sure Sebastian hasnt tried to contact you again?</p><p>No.</p><p>No texts? Or flowers? I hinted.</p><p>Nothing, Becky vowed.</p><p>Youd tell me</p><p>Of course I would. You know I cant keep secrets.</p><p>Good. Perhaps Alexanders and my talk was getting through to him. If you werent going out with Mattwould you like him?</p> <p>But I am going out with Matt.</p><p>If you werent, I prodded.</p><p>But I am, Raven.</p><p>You havent even thought about it?</p><p>Nowhy would I?</p><p>As we grew close, a neighbors horse whinnied in the distance.</p><p>The old barn smelled like hay and old wood.</p><p>For a moment, Becky struggled, but she opened the barn door. It sticks, she said.</p><p>The barn was dark as a cave. Becky shined the light inside. Tools hung from the walls like dripping wax.</p><p>What happened to the switch? I asked.</p> <p>It shorted out the other day. My dad didnt have a chance to fix it.</p><p>We were blind except for the thin beam from her flashlight. Something felt strangelike we were being watched. I knew that there werent any farm animals kept in the barn. I wasnt sure what else it could be.</p><p>Hurry and get your bike, she said.</p><p>Becky was still hiding behind me, pointing past the tractor. She clung to me so hard, I couldnt move.</p><p>Just then we heard a rustling in the rafters.</p><p>Becky jumped. Ooh! Its a bat. My dad said he saw one the other night. I figured youd want us to catch it for you, but it was too high.</p><p>Its more than a bat, I surmised.</p><p>After a few moments, the bat disappeared. I sensed someone lurking in the shadows. I took the flashlight and shined it on a bale of hay. Nothing. I shined it again on a workbench. Becky hid behind me, grasping my shirt so tight I could barely breathe.</p><p>Im scared, Raven. Lets go back.</p><p>I shined it on the tractor. The light caught the tail edge of blond dreadlocks.</p><p>Sebastian? Becky said, shocked.</p><p>I turned the light away from the vampire. He approached us in the moonlight, pushing my bike.</p><p>What are you doing here? I asked. Youre supposed to be with Alexander!</p><p>He was painting and I wanted to get some air.</p><p>In Beckys barn? I charged.</p><p>I was walking around and I heard some girls talking. I had to investigate. He smiled broadly.</p> <p>Becky seemed to buy his excuse, but I knew better.</p><p>You scared us to deathwell, at least me, she said. Im so glad its just you.</p><p>Im sorry, he said. Truly. Id never want to make your heart race. Unless it was for a good reason.</p><p>Flirting time was over. Youre lucky Beckys father didnt find you. He has a shotgun, I warned.</p><p>He rarely uses it, Becky said. You must be tired if you walked all the way from the Mansion. Can we get you a drink?</p><p>No I answered for him.</p><p>Sure! he said over me.</p><p>I took my bike from Sebastian and the three of us headed back to Beckys house. In Sebastians presence, she was no longer afraid and didnt cling to me in any way.</p><p>Becky offered us fresh lemonade. Becky had the best lemonade Id ever tasted; her mother made it from scratch. Both Sebastian and I gulped it down and asked for seconds.</p><p>Its time we go, I said.</p><p>Sebastian wasnt ready to go. He wandered around her kitchen, examining every picture and decoration.</p><p>Where was Alexander when I needed him? If he had a cell phone, I could text him immediately. Instead, I tried to ring the Mansions line. If Alexander was painting, his music was probably blaring. It was true. The phone rang endlessly.</p><p>Even Jameson didnt pick up.</p><p>No voice mailreally frustrating, Sebastian said.</p><p>Arent you in town to visit Alexander? I asked.</p><p>Well, yes.</p><p>Then why arent you two hanging out?</p> <p>We dont spend every minute together. Were guys.</p><p>When Becky and I got together, we spent every minute in each others company. But guys? Sometimes when Henry was over with Billy, one would be on the computer while the other was playing video games. I often wondered why they got together in the first place.</p><p>Still, I wasnt crazy about Sebastians behavior. It didnt seem to be bothering Alexander, however, if he was creative enough to paint. And for all I knew, Alexander might have needed the space.</p><p>We better be going, I finally said to Sebastian.</p><p>I can drive you both back if youd like, Becky offered.</p><p>You can drop Raven off first, then me, he said.</p><p>Becky will drop us both off at the Mansion, I instructed. Then we can tell Alexander where weve been.</p><p>After Becky drove us to the Mansion and I placed my bike against the gate, I grasped Sebastian by his sleeve and pulled him toward the front door like a scolded child.</p><p>See you tomorrow at Hooligans, Sebastian called back to Becky.</p><p>We met Alexander in his room as he was washing out a brush in a small bucket.</p><p>Did Sebastian let you in? Alexander asked.</p><p>Well, yes, but</p><p>Did you go into town? he asked Sebastian. It did me good to get some work done.</p><p>Yes, I had a great time seeing the sights, his best friend answered.</p><p>Alexander was euphoric from painting. I hated to spoil his mood by telling him where Id found Sebastian.</p><p>Im really such a lucky guy, Alexander said. My best friend and girlfriend are here and Im almost finished with my new project.</p> <p>He pointed to a covered painting resting on the easel. But this one is for me.</p><p>Sebastian clearly wasnt going to tell Alexander what hed been up to. I strongly suspected that if Alexander found out Sebastian had been lurking in Beckys barn, he might throw Sebastian out of the Mansion. I didnt want to snitch on him, but I wasnt about to keep secrets from Alexander.</p><p>I had a major dilemma on my hands.</p><p>I gazed at Alexander, who was relishing his creation and his friends. Alexander was so peaceful, I couldnt bear to tell him Sebastian was stalking Becky or that Trevor was saying I was two-timing him. But then Sebastian surprised me.</p><p>I happened upon Becky today when she and Raven were together, Sebastian confessed.</p><p>Happened upon? Alexander inquired.</p><p>AlexanderIm hooked. I just wanted to see her one more time.</p> <p>He flew into her barn when Becky and I were getting my bike, I said lightly. Nothing serious.</p><p>You cant be sneaking around her house, Alexander reprimanded. Thats immature. And dangerous.</p><p>Sebastian frowned.</p><p>I was the queen of sneaking in places. I wasnt any better than him.</p><p>No more. Ive washed my hands of love. Sebastian seemed to sense that this was upsetting his best friend. Well stay in for the rest of my stay and play Medieval Mayhem. I wont see her anymore. Not now, not ever.</p><p>But we are supposed to see her and Matt tomorrow at Hooligans, I said.</p><p>Well, I suppose one more time wont hurt, will it? Alexander said.</p><p>Sebastians face lit up. Ill have on my game face. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The following afternoon, Becky, Matt, and I were hanging out on Dullsville Highs soccer field waiting for practice to begin. Sebastians fascination for Becky indelibly stuck in my mind. Matt and Becky were nestled together by the home-side goalnot even the threat of an opponents score could break them apart. As my best friend gazed up at her beau adoringly, I realized Id never imagined Becky with anyone but Matt. He was the first boyfriend she ever had and I never doubted that someday theyd be married, live a quiet life in Dullsville with a couple kids, and have the proverbial white picket fence. Even a handsome and love-struck vampire so far hadnt turned her head away from her one true love.</p><p>Sebastian had fallen for a girl who could make him happyif only she liked him back. I was hoping that that would never happen. Not only didnt I want Becky to become a vampire, but I didnt want her to be with anyone besides Matt. But I felt empathy for Sebastian. He didnt choose his amorous fate.</p> <p>As the two lovebirds snuggled, I sat alone thinking about my own relationship with my boyfriend. We had bigger challenges that faced us on a daily basis besides an immortal paramour. It was as simple as the sun and as complicated as immortality.</p> <p>Alexander was my soul mate. But was our love strong enough to face the inherent struggles of our two different worlds? If he didnt turn me, would that ultimately come between us? Could we live mortally together while he lived eternally alone?</p><p>As I watched Becky and Matt cuddle, I felt my love for Alexander was not a choice. It was otherworldly.</p><p>Alexanders life would surely be easier if he were dating a vampire. He wouldnt be in a position to make a life-altering decision. Perhaps I was putting too much pressure on him for my own needs. He didnt want to turn Luna, so why would he want to turn me?</p><p>And would my life be any easier if I were with someone mortal? We could see each other by our lockers, share classes, and hang out at school dances. But I lived in Dullsville, where no mortal was like me. Even if Alexander hadnt moved into the Mansion on Benson Hill many months ago, I would never have found anyone here to love. I viewed my lonely, mortal world before I met Alexander as far more difficult than the challenges I faced by falling in love with a vampire. The insecurity of Alexanders and my future was better than the certainty of my unhappiness without Alexander.</p><p>Hooligans was a noisy, technology-driven themed restaurant. The food was normal faresalads, chicken wings, sandwichesbut the selling point was the jumbo-size, high-decibel, flashing-light video, pinball, and dancing games. Some games spit out tickets to use like cash to purchase prizes like bears, bracelets, and pencil toppers. It was quite easy to spend a hundred dollars just trying to win a twenty-cent prize.</p> <p>Alexander thrived in his quiet hideaways, like the Mansion, Dullsvilles cemetery, and the Coffin Club, under the guise of Phoenix. I was concerned that Hooligans was going to blast him into sensory overload. However, I knew Sebastian would be in gaming heaven.</p><p>Sebastian parked his Mustang in an empty space right next to Beckys truck. He wore a spectacularly stylish bloodred blazer.</p> <p>Alexander glowedhis hair rich-looking, seductively dangling down, his lean body pressed into black jeans and a white T-shirt and finished with a sparkling oversized skull belt buckle.</p><p>We arrived at the hostess stand to find a long line and at least a dozen patrons with pagers.</p><p>Well be here all night, Sebastian said.</p> <p>Follow me. I forged through the sea of people and pushed myself right in front of the main hostess.</p><p>Were meeting two friends. Im sure they already have a table, I said in my most mature voice, as my parents did when we were meeting their friends for dinner.</p><p>You can go ahead and check.</p><p>We squeezed our way through the waiting customersscreaming babies, young couples, and corporate parties. I was counting my blessings. So far no Trevor or a soccer snob in sight. I found Becky and Matt at a round table in the corner of the restaurant.</p> <p>Before any formal introductions could be made, Matt extended his hand to Alexanders best friend. Heyyou must be Sebastian.</p><p>But Sebastians focus was instead on Becky, and Alexander nudged his best friend.</p><p>Oh, yeah. Nice to meet you.</p> <p>Sebastian made his way to the empty seat across from Becky, but I snuck in behind him and scooted myself into the chair just as he landed on my lap.</p><p>We looked quite the sightas if a ventriloquist had just sat on the dummy.</p><p>Heyget off of my girlfriend, Alexander teased, jabbing Sebastian.</p><p>We all laughed as Sebastian rose to find that the only empty chair was between Matt and Alexander.</p><p>Matt and Sebastian found a common ground talking about computer games. However, in between breaths, Sebastian continued to be fixated on Becky, as if he was trying to seduce her with his gaze. Any normal guy could be a pest, but a vampire? He could be deadly.</p><p>I held my menu out, blocking his line of sight, until the waiter finished taking our orders and the menus.</p><p>We can all use my points, Matt offered, showing us his Hooligans game card. Lets go.</p><p>The gaming area was packedfilled with couples dancing, skiing, shooting, and bowling.</p><p>Matt took Beckys hand, Becky took mine, and I took Alexanders. Matt led us through the maze of people while Sebastian followed close behind.</p><p>Matt stopped in front of the only unoccupied gamea pinball machine, Nosferatus Nightmare.</p><p>Want to play? he asked, challenging Sebastian.</p><p>Sure, Sebastian replied. Winner gets the girl.</p> <p>What girl?</p><p>Sebastian gestured to Becky, who turned bone white.</p><p>Youre joking! Matt said.</p><p>Of course I am. But I knew Sebastian really didnt want to be. He appeared lovelorn for my best friend.</p><p>However, Matt and Sebastian played like they were competing for more than a high score on a pinball machine.</p><p>I cozied up to Alexander. Are you having fun?</p><p>Absolutely!</p><p>Wouldnt it be cool if Sebastian didnt leave? I asked. I was happy that Alexander had companionshipsomeone his own agein the Mansion.</p><p>It would be awesome. Maybe we can convince him to stay a bit longer.</p> <p>Nosferatus Nightmare was a ghoulish 3-D game. Silver balls shot through winding tubes with neon bats running across them, and squeaky coffin lids opened and closed in attempts to catch the ball.</p><p>Open Draculas coffinone thousand points, a monsteresque voice commanded as Sebastian hit the ball over a gravestone.</p><p>Becky rested her head against Matt. Sebastian couldnt concentrate and lost the silver ball. He relinquished the controls to Matt and stood next to Becky.</p><p>Matt pulled on the lever and clicked the flippers. A graphic of fangs clenched down on a womans neck flashed on the video screen along with the sound of a woman screaming.</p><p>Its not really like that, Sebastian said to Becky.</p><p>Matt was just as naive as Becky. He, like she, was missing all the obvious signs that another guy had fallen for his girlfriend. And, most important, that the other guy was a vampire.</p> <p>Matt scored a massive number of points and kept the ball in play like a professional gamer. Even Alexander was engrossed. Matt politely gave the controls to him. Heretry it.</p><p>The four of us watched as Alexander clicked the flippers as if hed been doing it his whole life. The ball hammered the bumpers, skyrocketing his score. He got multiball after multiball and racked up points in the millions.</p><p>We all cheered as Highest Bloody Scorer came across the screen and the machine lit up with blinking red and white lights.</p><p>Alexander seems to be in heaven, Becky said as we moved to another game. I think its great that his best friend is in town. I know its been good for Matt, too. Since he and Trevor stopped being friends, he does seem a bit lonely. Now he has two new ones.</p><p>Two Jet Ski simulators opened just as we approached them.</p><p>Lets do this! I exclaimed.</p><p>Becky and I each hopped on a machine. Matt gestured to Sebastian for him to ride along with Becky as Alexander sat behind me.</p><p>Sebastian was tentative as he settled on the ski behind Becky.</p><p>Put your arms around my waist, she said, lacing his hands around her. You dont want to fall off.</p><p>Matt swiped the card before Sebastian could change his mind.</p><p>Suddenly we were off, jetting over waves and avoiding wayward motorboats. I could almost feel the heat from the Miami sun, the ride felt so authentic. I peered back at Sebastian, who was hanging on to Becky for his life.</p><p>Slow down! he said as if we were really tearing down choppy waters. Slow down!</p><p>Becky let go of her throttle as I passed her and a half dozen computer-generated opponents until we soared through the finish line.</p><p>Alexander and I hopped off our Jet Ski, while Sebastian still clung to Becky.</p> <p>Its over, she said. But Sebastian didnt move.</p><p>Want to do it again? Becky asked.</p><p>I dont think so.</p><p>Need some help? Matt asked.</p><p>Instead of being thrilled by the ride and embracing his crush, Sebastian was green. Matt handed him a soda he had just bought. Here, drink this.</p><p>For the next several hours the five of us danced, boxed, and jousted our way through Hooligans.</p><p>Alexander and the gang hung back at the table while Becky and I counted and cashed in our skeeball earnings tickets. Becky and I each had enough tickets to win a stuffed bearBecky pointed to a sparkling teal blue one, and I spotted a shimmering black bear.</p><p>The girl handed the blue bear to Becky. Just as the cashier was about to take the black one, another worker grabbed it.</p> <p>I sneered. Hey, that was my bear!</p><p>Im sure its going to a nice kid, though, Becky said, trying to ease my disappointment.</p><p>Just then, we saw it was Trevor holding the black bear.</p><p>Kid, yesnice, no, I remarked.</p><p>That was our last one, the girl said. They werent very popular, so we stopped ordering them. We have tons of pink ones.</p><p>I ought to rip it out of his hand, I told Becky.</p><p>Alexander, Sebastian, and Matt were mesmerized watching two men battle it out on Lazer Wars. I didnt want to bother Alexander with my swiped winnings.</p><p>Haggling over childrens toys, are we? Trevor said, sidling up to me. So is that Alexanders competition? I guess he hasnt heard of a brush before.</p> <p>I didnt want this one, the Pradabee whimpered to Trevor, tugging on his Polo. I told you I wanted a pink one.</p><p>The Pradabees voice was like black fingernails on a chalkboardand not in a good way.</p><p>Trevor glared at me and flung the black bear on the counter as his date retrieved a new plush.</p><p>I grabbed the bear, which had landed on its back, and dusted it off.</p><p>Youre lucky youre going home with Raven, Becky said to the bear. The alternative would have been disaster.</p><p>Matt and Alexander were settling the bill while Becky, Sebastian, and I headed outside. Sebastian engaged Becky in conversation. He fawned over her in a genuine love-struck manner, complimenting her hair and comparing her beauty to that of a famous actress. She was so mesmerized by his attention, she didnt see a small row of bushes in front of her and tripped and fell onto the sidewalk.</p> <p>Sebastian and I immediately rushed to her side.</p><p>Im okay, she said with an embarrassed laugh.</p><p>Are you sure? I asked, picking up her bear and handing it to her. Who put that bush there, anyway? I joked.</p><p>Becky wiped off a few leaves and raised up her skirt just above her knee to expose a small wound. There was blood.</p><p>I shielded her knee and gazed up at Sebastian. He stood, frozen as if now he was the one in a trance.</p><p>Its nothing, Becky said. Then she noticed Sebastians odd behavior. Its just a scratch. I hope you arent the kind to faint around blood.</p><p>I dont think hes going to faint, I said, watching Sebastian.</p><p>Do you have a Band-Aid? she asked me.</p><p>I wasnt sure what was in my Corpse Bride bag. I kept my gaze on Sebastian at the same time feeling my way through my purseI recognized a pen, lip gloss, mascara, and loose change. Finally, I pulled out a piece of paper. We can cover it with this. It was an old detention slip.</p><p>Thats not sterile. Do you mind checking with the hostess inside?</p><p>Sebastian was still fixated on Beckys wound.</p><p>Im not leaving you here. I tried to block her from Sebastians sight line. We need a tourniquet. Immediately. I took off my Olivia Outcast hoodie and attempted to tie it around her knee.</p><p>Ravenits hardly even a cut!</p><p>Before I knew it, Sebastian was crouched down next to Becky. He took her leg and placed her sandaled foot on his knee. Her pink toes sparkled against his black pants like tiny stars. It was like Prince Charming trying to fit the glass slipperonly this Prince Charming was a vampire.</p><p>Becky giggled awkwardly, her leg in Sebastians grasp.</p><p>Im all right, Becky said. Its just a scratch.</p> <p>Sebastian examined her wound as a jeweler would a diamond ring.</p><p>Why are you two making such a fuss? Becky asked. Before I could do anything, Sebastian took his index finger and wiped her wound.</p><p>Ooohthats gross! Becky screeched, closing her eyes.</p><p>Droplets hung on his finger like red wine.</p><p>His fangs flashed. He reached his finger to his mouth.</p><p>I knew what he was about to do next, and though I wanted to see it for myselfa firsthand account of a vampire following his instinctsI knew if Becky saw it we could never undo the damage that would incur.</p><p>His finger was about to pass his lips.</p><p>No! I exclaimed.</p><p>I pushed Sebastian as hard as I could away from Becky, and the two of us tumbled to the ground.</p><p>Ravenwhat are you doing? Becky asked.</p><p>Sebastian and I lay on the grass, for a moment disoriented. I regained my bearings and rose to my feet to find Sebastian already standing. His pale face was cherry red. I grabbed his hand and held it toward the light. The blood on his finger was gone.</p><p>He gazed at me with childish horror, like a toddler who has broken into a candy jar.</p><p>Becky took out a crumbled tissue from her pocket and dabbed it on her wound. Then she showed me. See? The blood is gone.</p><p>Alexander and Matt suddenly were standing behind us.</p><p>Whats going on? Matt asked, concerned.</p><p>I shot Alexander a stern glare.</p><p>Nothing really. I tripped and skinned my knee, Becky said.</p> <p>Sebastian was very brave and wiped the blood off with his fingers.</p><p>Matt led Becky into her truck while Alexanders contentment slowly turned to anger.</p><p>Alexanders best friend was leaning against his car. A wicked grin overcame him as he licked his pale blue lips.</p><p>As Sebastian drove toward my house, I tried to mask the severity of the situation by chatting about the upcoming weather forecast. I didnt want to snitch on Sebastianto condone or deny what had just taken placeif only not to spoil Alexanders evening. My boyfriend had been so happy to be out of the Mansion with his best friend by his sidea fellow vampire, a childhood playmate, his next-door neighbor. A guy with whom Alexander could be his true selfno longer having to wear the disguise of a rebellious mortal but instead that of a sensitive vampire. But Alexander was keen to Sebastians ill conduct. The two friends rode in silence.</p><p>When we finally parked in front of my house, Sebastian, along with Alexander and I, got out of the car.</p> <p>Alexander didnt bother to shut his door. He avoided Sebastian altogether and started for my driveway.</p><p>Sebastian tapped his boot against his tire in disgust.</p><p>He didnt mean to do it, I defended.</p><p>Alexander chewed on his lip.</p><p>Alexander Sebastian said bravely, confronting his best friend. I dont know what happened. Im truly</p><p>Alexander faced his friend. You crossed the line, he said in a tone that couldnt hide his disappointment.</p><p>I didnt plan on it. It wasnt like I hurt her. I couldnt help myself; Im not restrainedlike you, he said sincerely.</p><p>You cant stay here, Alexander said firmly. His voice was strong, but it couldnt mask how it pained him to say it.</p><p>Im sorry, Alexander. I wont go near her again.</p> <p>Becky didnt see anything, I said. I wasnt sure why I was defending Sebastian. Perhaps it was because the hapless vampire, like me, seemed to get in trouble just by breathing.</p><p>Tomorrow night, Alexander started, when you wake up, Jameson will have your things packed.</p><p>Sebastian slunk back into the Mustang, and Alexander silently escorted me to my front steps.</p><p>Im sure he I began, but Alexander wasnt listening. Instead, he gave me a quick kiss on the lips. I opened the front door and reluctantly entered my house. I heard the sound of a car door slamming and a Mustang peeling away from the curb.</p><p>I struggled as usual to sleep. The only time Id seen Alexander this upset was when we went to the SnowBall last winter and Trevor told him the only reason I liked him was that I thought he was a vampire. Instead of hanging out in bed, I sat on my desk and stared out my window.</p><p>I hoped Id find Alexander resting against our tree or sitting on the swings. All I saw was a lonely maple and an empty swing set.</p> <p>I replayed Sebastians obsession with Becky over in my mind. I imagined what would happen if Alexander and I were placed in a similar position.</p><p>Alexander was chasing me through the tombstones. The grass was wet with fresh rain, and the air filled with a gentle mist. I dodged a grave marker and then jumped over another as Alexander drew close. Fatigued yet exhilarated, I sprang over a third headstone. It caught the heel of my Mary Janes, I lost my balance, and I tumbled to the ground with a thud.</p><p>I felt a little stupefied. I sat up to find a sharp pain emanating from my right arm.</p><p>Alexander leaped to my aide. I raised my elbow. He held it softly.</p><p>Is it broken?</p><p>Just bruised.</p><p>He blew off the dirt and gently picked the wet blades of grass from my skin and examined it closely. A large gash, the size of a pencil, raced up my forearm. We both watched as blood began to fill the slender wound.</p><p>We are on sacred ground, I said, raising my wound toward his mouth.</p><p>Two fangs pierced through the break in his lips. He tried to cover them with the back of his hand.</p><p>You need me as much as I need you, I said, pulling his hand away. Its okay. You dont have to fight it anymore. You dont have to be strong.</p><p>I could see in his eyes that Alexander struggled, wondering what it would be like to finally taste my blood, as Sebastian had tasted Beckys.</p><p>Id still have to bite you. To turn you, like me.</p><p>Perhaps its time. Wed finally be together. Like Ive always wanted. Ive always needed you, Alexander.</p> <p>I need you too, Raven.</p><p>He took my arm and drew it up to his mouth. He closed his eyes, and I watched as he licked his lips and opened his mouth.</p><p>Suddenly, Nightmare jumped in front of the window and I was so startled, I was lucky I didnt fall off my desk and really bust my arm.</p><p>I wanted the reassurance that Alexander needed me just as much as I needed him. That he craved me, as Sebastian craved Becky. But I knew Alexander wasnt about to make that decision lightly. And did I want it, after all? Id put so much of my thought into this magical and darkened world when right before me I was seeing vampires struggle with their lifestyle, as I struggled with mine.</p><p>At this point, I could only imagine Alexander biting me and taking me into his world. The fantasy of it thrilled me. I could only hope the reality, should it ever show itself, would be as good. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The hours ticked away painfully slowly during school. I was tormented as Becky raved incessantly about our previous evening at Hooligans. She went on about how she and Matt had a blast hanging out with the three of us, how we all could be best buds, and what a shame it was Sebastian was going to leave. She had no idea the evening had ended with a nightmareone caused by Sebastian. I was in a fog all day. I couldnt get my mind off of Alexander and Sebastians falling-out. Did they make amends? Had Sebastian left Dullsville? I begged for the sun to set as fast as it could, but it seemed to toy with me as it hung over the trees. When it lowered below the rooftops, I jumped on my bike and took off. I had no idea what I might find when I reached the Mansion.</p><p>The Mustang was still in the driveway, but the front door of the Mansion was open.</p><p>Jameson? Alexander? I called. But no one answered.</p><p>The house was eerily quiet.</p> <p>I scaled the main staircase and passed a half dozen rooms until I came to Sebastians.</p><p>I tapped the door and it squeaked open.</p><p>The room was spotless. There were no signs that Alexanders best friend had even visited the Mansion. No coffin. No iPod, boxer shorts, or wallet. Not even a trace of Romanian dirt remained.</p><p>I felt as hollow as the empty room.</p> <p>I ran throughout the Mansion. Alexander!</p><p>No response.</p><p>Jameson? I called.</p><p>The Creepy Man was nowhere in sight.</p><p>I entered the kitchen and found Alexanders best friend sitting alone at a rustic dinette, staring vapidly at a tiny plastic sword in his hand. His hair was unkempt, his eyelids droopy.</p> <p>I stood for a moment. Sebastian wasnt talking. He didnt even acknowledge my presence.</p><p>I approached him tentatively.</p><p>Im sorry youre leaving, I finally said. Apart from the fact that you want to break up my best friend and her boyfriend, we actually got along pretty well.</p><p>Are you really? he asked, gazing up at me.</p><p>Sure. You brought light to the Mansionliterally, I teased.</p><p>But Sebastian didnt even smirk.</p><p>Ravenwhat have I done? How could I have been so recklessso selfish? A girl should never come between friends. Im sorry things didnt turn out better than this.</p><p>Alexanders still mad at you? I was hoping</p> <p>Not only didnt I find true love, I lost my best friend.</p> <p>It pained me to see Sebastian hurting. He wasnt as controlled as Alexander, or as menacing as Jagger. But like all the vampires Id met, he struggled with his place in the mortal worldjust as I struggled.</p><p>Ill talk to Alexander. Im sure youll be able to repair thingswith some time. When are you heading back to Romania?</p><p>Im not sure. I cant return like this. What do I say to my parents? To his? I thought I might stay nearby for a few more days.</p><p>Then youre not leaving town? I was happy at the thought.</p><p>Im not sure. I might just take a few days to think things through. And figure out how to make amends.</p><p>Does Alexander know?</p><p>We didnt talk much, he said with a nervous chuckle.</p><p>I pulled out a chair and sat by him. Where are you going to stay?</p> <p>Im still not sure.</p><p>Are you planning to crash in a hotel with a coffin? I asked exasperatedly.</p><p>I thought somewhere more obscure. In the woodsor perhaps in an old barn.</p><p>We both paused with dead concern.</p><p>Nonot that barn! he corrected. Not anywhere near that barn! he said. Thats what has gotten me here in the first place.</p><p>For a moment I deliberated taking him into my house. But I knew it wouldnt work. Not only would I feel awkward getting in the middle of the two guys feud, but how on earth could I hide his coffin bed?</p><p>Id invite you to my house, I said, wanting him to know I was trying to help, but I think you might understand the massive complications in that plan.</p><p>Thats very kind of youeven after I did that to your friend? Well, both friends really</p><p>I sympathized with Sebastians dilemma. He was a vampirefor better or for worseand Alexanders best friend. If anyone knew his struggle, it had to be the gorgeous guy I was in love with.</p><p>If youll excuse me, I rose and backed out of the kitchen. Alexander! I called, running upstairs. Out of breath, I burst into Alexanders attic room.</p><p>I found my boyfriend sitting on his bed with a paint-brush in his hand.</p><p>On his easel was a beautiful painting of Alexander, me, and Sebastian. It was the very one hed been working on so intently and that was bringing him so much joy. The one hed never sell or auction offthe one that was created for only his possession.</p><p>I guess Im going to have to paint over him, he said.</p><p>Dont you dare.</p><p>He had a quizzical look. I thought youd be Your best friend is downstairs, as upset as you are. You should understand him and his desires more than anyone.</p><p>But I thought</p><p>I can see that he doesnt have the same personality as you do. I know its not easy for you to understand how impulsive he can be.</p><p>Why do people think its so easy for me, too?</p><p>Its not? I prodded.</p><p>But Alexander didnt elaborate.</p><p>I held his hand. He was so strong yet so vulnerable at the same time. It pained me to see him struggle in any way, whether it was with the tribulations of being a vampire or the normal conflicts of anyone with emotions.</p><p>I didnt say it was easy for either one of you. Its just the way you handle it. Becky is my best friend. However, shes the total opposite of me in many ways. She would die before shed ever confront anyone or defend herself. She is terrified of silly things like the dark and spiders and would rather visit a mall than a graveyard. Ive protected her for years, like youve protected Sebastian with his loose lips and impulsive actions. But if I didnt have herif she didnt stick by me, toothen I wouldnt have anyone.</p><p>Alexander folded his arms.</p><p>Sebastian knows he messed up. But hes not going to leave Dullsville until he finds a way to reconcile with you. To me, thats a best friend.</p><p>But I thought youd be mad at him, too. After all, he was almost stalking Becky.</p><p>Im not happy about it. But your friendship is more important to him than she is. I want you to have a best friend just like I do, for better or for worse.</p><p>I waited as Alexander decided on his next move. He gazed at the picture hed painted of the three of us together.</p> <p>He stood up and placed the brush on the easel. He took my hand and led me downstairs.</p><p>We entered the kitchen, but it was empty of vampires. I followed Alexander outside, where Sebastian was loading his final bag into his trunk. Alexander left me on the steps and walked quickly to Sebastian. I winced, prepared to see fists and fangs fly.</p><p>I waited. And waited. And waited.</p><p>The two began talking. I was out of earshot, burning to know the contents of their conversation. At any moment, Sebastian was going to get in his car and drive off. I wasnt sure if Id ever see him again. I wouldnt even get to say good-bye.</p><p>I felt a small pang in my stomach. I hated to see Alexander so upset with someone he cared about. I heard a car door close.</p><p>Just then, Alexander reached into the Mustangs trunk, put a duffel bag on his shoulder, and summoned his best friend. The two vampires returned toward the Mansion.</p><p>Jameson, I called. Prepare those smoothies with the tiny swords! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I met Alexander at the Evans Park covered bridge the following night. The old pedestrian bridge was unused and unkempt. Wooden slatted shingles worn off over the years had gone unfixed. Paint had chipped away. Even the birds nests were forgotten. I always thought the bridge was beautiful. A trickling creek ran beneath it and a tiny broken bench overlooked a dead bed of flowers. Tonight, however, I found the bridge decorated with twinkling yellow and white lights, which hung like sparkling icicles, making it a truly romantic and magical scene.</p><p>I crept inside to find a table with a flickering candelabra on it and two champagne glasses filled with soda.</p><p>Alexander emerged from the shadows, dreamy and gorgeous. I was breathless. There wasnt a place Id rather be than in Alexanders presence. I rushed to him and squeezed him with all my might. It seemed like ages since we had been alone, and I planned to take advantage of our solitude. My fingers begged to touch his skin, to feel my boyfriend close, sense his breath against mine. His strong hands grasped my smaller ones and he intently kissed them, as if he, too, had missed our moments together. I gently stroked his face and ran my fingers over his lips, my black nail polish in striking contrast to his alabaster skin and pale red mouth.</p><p>Alexander and I had only a short time for our date. Becky was in the safe company of Matt and the soccer snobs at a scrimmage, and Jameson was doing his best to keep Sebastian entertained with a newly purchased Guitar Hero.</p> <p>I curled up in Alexanders arms. The electricity between the two of us seemed unbreakable. When he kissed my neck, I wondered if it was as much a torture for him as it was for me.</p><p>Alexander had the power at any moment to turn mewhether I wanted him to or not. Was he thinking what it would be like to pierce his fangs into me and take my blood into his? But Alexander was thoughtful and cautious. If I were in the arms of another kind of vampire, perhaps like Jagger or Sebastian, I might have blood dripping down my neck. I wondered and admired how he could be so different.</p> <p>I dont know how you do it. Sebastian cant.</p><p>Its not easy. Im sitting with the most gorgeous girl Ive ever seen in my life and she wants to be a vampire.</p> <p>I melted at his compliment. It seems easy to me.</p><p>I couldnt help but want to be bittenif only to become a vampire before my best friend did.</p><p>A few pings of raindrops began to hit the roof of the bridge. A few moments later, it began to pour. It only added to our magically romantic night. I snuggled even closer to Alexander.</p><p>Imagine it, I began. Wed live in the Mansion together. Id make you smoothies, and if we ran outthen youd have me.</p><p>Wed have a beautiful coffin together, I continued. Id decorate it with the most comfy pillows and blankets and tiny portraits that youd paint of us. And we could wire it so we could listen to morbidly melodic music.</p><p>I could take you to Romania and you could see my home, Alexander added. We would dine outside on our balcony overlooking the twinkling city lights with my parents, and Id take you into town and wed dance until dawn.</p> <p>I was excited by Alexanders enthusiasm. Youd become a famous painter and Id be an editor of a gothic magazine, I continued. Wed travel to Paris for your showings and wed attend gothic fashion shows. Wed hang out all night long and sleep all day.</p><p>But you do that now, he joked.</p><p>By myself. But if I were like youwed never have to be apart again, I said. Wed be together, hidden away from the sunlight.</p><p>And holding hands in the moonlight, he imagined.</p><p>Youd never be alone. Not for a moment.</p><p>Not for one moment? he asked coyly.</p><p>Well, maybe one. If you wanted some space.</p><p>Forget it, he assured me. Ive been waiting for you all my life.</p> <p>Alexander kissed me again.</p><p>We wouldnt only have stolen moments like tonight, I urged. Wed be together longer.</p><p>Raindrops continued to fall against the roof as he kissed my wrist. My vein showed prominently. Alexanders attention was drawn to my blue blood vessel.</p><p>Are you ready? I asked. Were not on sacred ground, but we could go to the cemetery. We could finally be together.</p><p>Alexander paused. He stared deeply into my eyes, and so intently, I felt as if I were staring back into his soul. Then suddenly he turned away.</p><p>Its not fair, I said, clasping my hands. Sebastian wants to turn Becky and you dont want to turn me.</p><p>Alexander sat up. First of all, he doesnt. He feels strongly for herand now that hes crossed the line hes put all of us in jeopardy. He tasted her blood. He has a stronger pull to her than he already had.</p><p>It was a mistake to have brought up Sebastian. Now Id distracted Alexander from his thoughts about me.</p><p>I know, I said. Its just that sometimes</p><p>Raven, its hard enough for mewith you, as we are right now.</p><p>I couldnt push him any further. Id already spoiled his mood and the gorgeous night hed created for me. I could tell he was just as concerned for Sebastian as he was for himself.</p><p>I guess I shouldnt have let him in, he lamented.</p><p>Are you kidding? Hes your best friend. Sebastian is a sweetie, I reassured Alexander.</p><p>Hes much more impulsive than I am. Kind of like someone else I know, he said, lightening up.</p><p>Hes just fallen for the wrong girl, I said with a sigh.</p> <p>Then we have to find someone else for Sebastian to fall for, Alexander thought aloud.</p><p>Thats a great idea.</p><p>He hasnt really had a steady girlfriend. Not only would this be helpful for Becky, but it would truly be helpful to him.</p><p>I was so touchednot only that Alexander was concerned for the welfare of my best friend, but that he felt such responsibility and loyalty for his own.</p><p>Another mortal? I asked. I thought about the Dullsvillian girls who had plagued me all my life. Theres a bunch of cheerleaders at school that I certainly wouldnt miss, I offered. But on second thought, I refuse to let one of them be turned before I am.</p><p>No, my boyfriend said. She has to be a vampire.</p><p>Im afraid Im short on vampire girls here, I said. But then I had a thought. But in Hipsterville, theres a whole club full!</p><p>Alexander lit up.</p> <p>I know two very eligible ones. Onyx and Scarlet. One of them could be a perfect match!</p><p>How do we get them here? he wondered aloud.</p><p>That, I have no idea.</p><p>Lets think.</p><p>They are party girls, I said.</p><p>Then well have a party.</p><p>Thats awesome! I love parties. Though truth be told, I havent hosted manyor, in fact, any. No one would show up besides Becky.</p><p>It will be a small, intimate gathering.</p><p>Shall we have it at the cemetery?</p><p>Alexander disagreed. Well have it at the Mansion. That way it will be discreet and no one will find out about it.</p> <p>I gave Alexander a huge hug. I was excited to be hosting a party and thrilled at the prospect of seeing Scarlet and Onyx again.</p><p>But how are we going to invite them? he finally asked.</p><p>I reached into my purse and took out my cell phone. I have them on speed dial.</p><p>After a few minutes of canoodling, I strolled outside the covered bridge to get more light from the streetlamp. I avoided a few puddles, as the rain had ceased.</p><p>I scrolled to Scarlets contact number and pressed send. The line began to ring. And ring. And ring.</p><p>Is she there? Alexander asked impatiently.</p><p>I shook my head.</p><p>Just then, someone picked up. I could hear the pounding of loud music with overloaded bass in the background.</p> <p>Scarlet? I said.</p><p>Hello? I barely heard her voice. Hello?</p><p>Then the phone went dead.</p><p>I dont think she wants to speak to me, I said.</p><p>I think she probably cant hear you. That club can be deafening.</p><p>Ill try again.</p><p>I pushed redial and waited.</p><p>This time she picked up right away. Raven, is that you?</p><p>Yes! Can you hear me?</p><p>Ravenis that you?</p><p>Yes! I yelled.</p><p>I think its Ravenbut I cant hear her, she said to someone.</p> <p>Scarlet? Onyx? Are you there?</p><p>The call was dropped. All I heard was my own voice shouting.</p><p>I guess well have to try later, Alexander said, resigned. He wiped off the damp bench with a tissue he had in his pocket and sat down.</p><p>If she cant hear my invite, then maybe she can see it.</p><p>What do you mean?</p><p>I sat down next to Alexander and texted as fast as I could. He peered over my shoulder, curious.</p><p>Onyx and Scarlet</p><p>Mansion Mayhem!</p><p>Mansion on top of Benson Hill only a few towns away.</p><p>Saturday Night @ Sunset</p> <p>Raven</p><p>Now what? he asked.</p><p>We wait.</p><p>How long?</p><p>If she sees the message, it could be within a minute. If she doesnt, it could take days.</p><p>We dont have days.</p><p>I know.</p><p>We sat in silence, his arm around me, my cell phone in my lap. We both were zoned out when we heard a few beeps. I showed Alexander my phone.</p><p>Cant W8 2 party w/u!</p><p>X, S &amp; O</p> <p>Alexander gave me a huge squeeze, and we spent the rest of the evening pressed against each others black and pale red lips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The party at the Mansion was going to have to be top secret. I couldnt even invite Becky and Matt. I hated having an intimate party and not inviting my best friend. However, I had to remind myself of the motivation for the partyto get Sebastians mind off Becky and onto a vampire girl.</p><p>Becky and I sat at a side entrance to the school, she intently eating her lunch on a step while I was perched on a half wall, doodling a macabre party in my notebook.</p><p>A figure stood next to me. Whats that? Trevor said, snatching my notebook.</p><p>Wouldnt you like to know.</p> <p>It looks like a sketch for a funeral.</p><p>And if youre luckyor rather, I amyou could be the guest of honor. I tried swiping it back, but he held it out of reach.</p><p>You and your friends are having some gathering where you try to bring back the dead</p><p>We call it a party, I said back to him.</p> <p>A party? And when should I be there? he asked.</p><p>A party? Whos having a party? Becky asked, placing her trash into her brown lunch bag.</p><p>Uh, no one. Trevors just mouthing off.</p><p>Well, your sketch looked exactly like a party to me.</p><p>There isnt a partynot now, not ever! Cmon, Becky, lets go. This location is suddenly very unappetizing.</p><p>Trevor remained at the half wall, puzzled, as Becky and I escaped into school.</p> <p>Sebastian and Alexander were hanging out in the gazebo when I arrived.</p><p>Were going to have a party, I said to Sebastian.</p><p>I know, Alexander told me all about it. I do appreciate the lengths you guys are going to to repair my broken heart, he said dramatically, his hand over his chest.</p><p>You never know where you might meet the perfect person, I said.</p><p>Listen, Ive been traveling all my life and I havent found her yet. Well, I thought I had, but Ive resigned myself to my fate. Becky will marry Matt and Ill be alone for eternity.</p><p>Alexander and I were chuckling at his histrionics when we heard the sound of a car coming up the Mansions long driveway.</p><p>Are the guests arriving already? Sebastian asked sarcastically.</p><p>No one drove up to the haunted-looking Mansion at night, and I didnt recognize the car. The three of us headed back inside through the kitchen and waited in the dining room as Jameson answered the door.</p> <p>Im Giles Lunken with the Gazette, we heard a voice say.</p><p>Giles Lunken? He was a well-known writer throughout Dullsville who had a column showcasing local and international talent.</p><p>I was wondering if I could speak with Alexander Sterling, he continued.</p><p>May I ask what this is regarding? Jameson asked like a strict butler.</p><p>Is he the artist that painted the canvases sold in last months auction? We were thinking of doing an article about him for the Gazette. Hes so youngits amazing hes so talented. Also, Id love to come back with my photographer.</p><p>Im afraid thats impossible.</p><p>Why? His voice was accusatory. Hes not the artist?</p> <p>UhYou will have to come back at another time.</p><p>Then it was another artist? Mr. Lunken prompted.</p><p>Im not saying that, Jameson answered firmly.</p><p>Then what are you saying? Did he paint those paintings?</p><p>Of course he did</p><p>Then does he have a personal phone or cell number? Mr. Lunken pulled out a PDA.</p><p>Im afraid he doesnt.</p><p>An e-mail? Mr. Lunken questioned.</p><p>No.</p><p>He doesnt have e-mail?</p><p>Jameson shook his bald head.</p> <p>Does he have a Web site? I couldnt find any information on him.</p><p>You can leave your card with me, Jameson suggested.</p><p>UhI dont have one.</p><p>You dont have a card? Jameson asked. Interesting</p><p>I couldnt help but snicker. Alexander put his hand gently over my mouth.</p><p>Ill come back in a few days.</p><p>That would be best.</p><p>Jameson passed us, and Alexander gave him the thumbs-up sign. The Creepy Man headed for the kitchen as we settled in the living room. Sebastian plopped down on the antique sofa.</p><p>Dude! Sebastian said with an impressed tone. You are famous. Soon well have to invest in a security system to weed out the paparazzi.</p> <p>Funny, Alexander said. Shouldnt we have heard his car take off by now?</p><p>Sebastian leaned back and peeked out the worn velvet curtain.</p><p>He didnt leave.</p><p>Alexander and I jumped onto the sofa and the three of us peered out.</p><p>Giless car was still in the driveway, but he was nowhere to be found. He soon emerged from the side of the Mansion with a notepad. He continued walking, staring up at the attic window. Finally, he examined the Mustang, jotting down a few notes. Several minutes later, there was a knock at the door.</p><p>Sebastian fingered his dreadlocks, straightened his shirt, and opened the door.</p><p>Alexander? we heard Mr. Lunken say.</p><p>No, Im Mr. Sterlings assistant.</p> <p>I was just here a moment agospeaking with an older gentleman. And I noticed a light in the upstairs window and this carI just thought</p><p>He has a very busy schedule, Sebastian said.</p><p>I can do the story without your help.</p><p>Sebastian paused. Fine. I think we can work you in. Hell meet you at Javalicious</p><p>Id like to meet here, the reporter insisted.</p><p>Sebastian turned to Alexander, who shook his head adamantly.</p><p>Please come back in two days after sunset.</p><p>After sunset? Giles asked.</p><p>I mean early evening. Hell be waiting. Sebastian closed the door.</p> <p>What are you doing? Alexander asked. We already discussed that I need to remain private. It would be dire to have a reporter see the real Mansion and discover the real me.</p><p>Then he wont meet the real youor the real Mansion. But we cant put him off. He could write anything.</p><p>So what is your big plan?</p><p>He was snooping around anywaywho knows what he might say on his own. We have to show him youre just like everyone else. Mortal.</p><p>But youve invited him here. And why in two days? We might as well get it over with.</p><p>He doesnt need to see the whole house. Just the first floor.</p><p>Have you seen the first floor? I said. It would make a ghost scream.</p><p>Sebastian thought for a moment. Not when it gets a Sebastian Camden makeover. It will look like everyone elses home. And you wont be bothered again.</p> <p>Alexanders stern mood quickly lightened up.</p><p>Theres a reason hes my best friend, he said, slapping his arm around Sebastians shoulder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mom I need you! I declared when Alexander dropped me off at my house. Where are you?</p><p>I found my parents sitting in the family room. My mom was finishing a scrapbook and my dad was channel surfing.</p><p>I need your help I continued.</p><p>I already gave you your allowance, my mother said, gluing a border on a photograph.</p> <p>I dont need money.</p> <p>Im not signing a note asking for you to be dismissed early because you want to watch Dark Shadows. I told you to DVR it.</p><p>Mom. This is way important.</p><p>Are you suspended? she asked.</p> <p>No.</p><p>Expelled?</p><p>I shook my head.</p><p>Arrested?</p><p>I folded my arms in disgust. Are you finished?</p><p>Im all ears, my mom said.</p> <p>Alexander needs some new furniture for the Mansion.</p><p>HmmI suppose you want something Victorian? You never know what you might find at a yard sale.</p> <p>We dont have time to wait for the weekend.</p><p>How about Annies Antiques?</p><p>No, were doing a makeover. We need to make the Mansion look like our home. Or the neighbors. Or the Mitchells.</p><p>My dad came out of his TV coma. Whats going on?</p><p>Raven needs some tips on making the Mansion appear morenormal. She wants it to look more like our home.</p> <p>My father was confused. Our home? But we dont have bats.</p><p>Or spiderwebs, my mom said.</p><p>Or creaking floors, my dad added.</p><p>We do have those upstairs, my mom corrected.</p><p>That's true.</p> <p>Are you through? I asked, disgusted with my parents teasing. This has to be done immediately. Where are all your catalogs?</p><p>Why all of a sudden do you want to do this makeover? my mom asked.</p><p>Alexander is going to have an interview.</p><p>How exciting, she replied.</p><p>But I wasnt as thrilled. Once the reporter sees what the Mansion looks like, Alexander will be the laughingstock of this town.</p><p>I hardly think that will happen.</p><p>You just did it yourself. You both were making fun of it. How will he feelwith some reporters comments published throughout town?</p><p>For once I had silenced my parents.</p><p>See our problem? I asked.</p> <p>Your father and I were just kidding. Youre rightwe really shouldnt have said those things.</p><p>But the townthey wont be fooling around. Theyll mean it. You see how Ive been treated for years.</p><p>Thats what I dont understand, my dad said. I thought you were all about being yourselfno matter what.</p><p>I am.</p><p>Then I figured Alexander would be, too.</p><p>Of course he is, I said emphatically.</p><p>There is no reason, then, my mom said, that Alexander should change who he isor where he lives.</p><p>She had a point.</p><p>So where is our nonconforming daughter? my dad asked. What has happened to you?</p> <p>We dont want the whole town to know my boyfriends a vampire. That he sleeps in a coffin and has a cellar filled with bottles of blood, okay? I wanted to say.</p><p>I was on trial in front of my parents. They waited for the accused to speakto declare if I was guilty of trading in my own belief system. I was asking them to understand why I was changing my whole character in order to impress the very town from which Id been an outcast my entire life.</p><p>They were correct. Under normal circumstances, Id never go along with Alexander trying to change who he was. But if the town knew he was a vampire, hed be the one in danger.</p><p>Maybe Alexander doesnt want the town to see his real image, I began.</p><p>Why? my mom asked.</p><p>Its an invasion of his space.</p><p>How do you figure that?</p> <p>The Mansion is his studio, his home, his family. Hes already shared his soul in his paintingsdoes he have to share it in a newspaper, too?</p><p>My parents agreed. I was beginning to get through to them.</p><p>Besides, its not my decision, I said. Its Alexanders. And he wants the Mansion to appear like any other home in Dullsville.</p><p>My mothers bewilderment turned to joy. Then I guess Im forced to help you shop.</p><p>Jameson and I are going to pick up the furniture after school. I just dont know where to begin, and I thought youd be great in giving me some ideas.</p><p>Come into my private stash. I followed my mom into her bedroom.</p><p>Where a man might have stashed Playboys, my mom had hidden her Pottery Barns. She reached underneath her bed and pulled out a large plastic container.</p><p>I have every issue from every home store.</p> <p>We hunkered down on her bed like two girls at a sleepover. We spread out the catalogs and pored over the slick pages.</p><p>Rugs are a great accent. Framed pictures can make a statement. Clocks can really be striking. She noted pages with Post-its, and with a thick black marker I circled items that reminded me of Trevors home.</p><p>I was hoping for a day like this since you were a little girl, she said, for decorating your roombut Ill settle for decorating Alexanders.</p><p>Jameson and I were armed with catalogs and a credit card. We had to go to the one place Id never imagined the Creepy Man would ever escort me tothe mall.</p><p>It was an understatement to say that we were an odd pair. Elderly mall walkers, tweens with cell phones and Vera Bradley backpacks, kissing couples, and families filled the food court. There was only one bald butler and morbidly dressed girl.</p><p>We entered a home store Id only been in when I was being dragged by my mother and the mall benches were already occupied.</p><p>We were immediately confronted by a friendly woman with a rock star headset. Do you need help? she asked sincerely.</p><p>You could say that, I said. Wed like to purchase a few things for the home.</p><p>Her forehead wrinkled as she tried to assess the couple who stood before her. Uncle and niece? Father and daughter? Boyfriend and young girlfriend?</p><p>By the expression on her face, I think she settled for Creepy Man and Monster Girl.</p><p>Its not for my home, I reassured her. Its for his home.</p><p>All right, then. The saleswoman did her best to hide her discomfort.</p><p>Miss? Jameson asked.</p><p>Lauren.</p> <p>Miss Lauren, he began in a soft and velvety Romanian accent, I am so delighted that you will be helping us. I can tell you have impeccable taste.</p><p>Lauren was immediately captured by the Creepy Mans compliment. Thank you, she gushed.</p><p>And, Miss Lauren, we need to have these delivered quickly, Jameson told her.</p><p>If its in stock, we can have it delivered the next day.</p><p>Then lead me to those items, he said.</p><p>Lauren guided us around the store like a docent in a fine arts museum.</p><p>We picked out a few rugs, a desk and hutch, and furniture covers. She showed us a dozen lamps and pushed one long hanging rug after another until Jameson found one he liked.</p><p>I had a blast shopping with the Creepy Man. My mom usually took ages to decide between two varieties of the same item, then, after deciding on the most perfect one, went to another store, only to finally come back to the original and buy it, while Jameson instantaneously picked out furniture, rugs, and accessories.</p><p>Lauren rang up our purchases and Jameson handed over his credit card and signed his name.</p><p>We left the store with oversized shopping bags like any other normal Dullsvillian.</p><p>Now all we needed was a cleaning company.</p><p>Alexander wouldnt let me inside until the Mansions makeover was complete. I heard bustling and tried to peek into the window, but the dirt blocked my view.</p><p>I was seated on the stoop when I received a text.</p><p>Hey Hottie, What are you doing?</p><p>The sender was from an unavailable number. I dismissed the call, and as I waited on the stoop, the Mansions door finally creaked open.</p><p>Alexander stood as Id never seen him before. He was wearing pressed jeans and an oxford shirt, a brown leather belt and shiny loafers. He was unbearably handsome.</p><p>Where is Alexander? I asked.</p><p>What do you think? he asked, nervous about my response.</p><p>You are gorgeous! Id never imagined you as an insider, I said, checking him out. You look like you belong in a prep school.</p><p>Good, thats the look were going for.</p><p>The Mansion had been transformed into a spread from Homes &amp; Gardens. Everything seemed completely wrong. With the new slipcovers, the couches appeared brand new and the room clean, sweet-smelling, and free of any unwanted eight-legged insects. Hurricane lamps and framed flowers lined the mantel. Bright yellow and white pillows popped out against white linen-covered chairs.</p> <p>It looks like someone else lives here, I said.</p><p>You think so? Sebastian asked, pleased with the results. Alexander will be like any other person living in townonly hell have a butler instead of a few parents. That will accentuate his trust-fund status, he said, thinking out loud.</p><p>Youve covered all your bases, I said, noticing that a floor-length candelabra had been replaced with a silver floor lamp. Giles Lunken wont have anything to say, except Hes one of our own.</p><p>And, Sebastian began, it gets better. Now theres no need for a photographer.</p><p>I followed Sebastian into a roomformerly the parlor, now a studio with desk, computer, and easel.</p><p>Its almost finished. I just have to print it out, he said.</p><p>Sebastian went to the printer tray and handed me a glossy photo. I held it in my hand.</p> <p>It was a picture of Alexander!</p><p>This will be his artists headshot, Sebastian boasted.</p><p>I was amazed. For the first time in my life, I held a picture of my vampire boyfriend. I love it! It looks exactly like you!</p><p>I used one of my image-enhancement software programs, Sebastian proudly said, and played around with some photographs I found online. I used Johnny Depp and made a few tweaks to bone structure and added pale skin, and voil ̈¤! Alexander.</p><p>It looks like a real photograph. And it looks like you! Can I keep it?</p><p>We have to give it to Mr. Lunken for the article. But I can print you another one.</p><p>Print a hundred! I ordered.</p><p>I was so distracted by finally possessing a photograph of Alexander, I almost forgot that the preppy guy standing in front of me was him.</p><p>My boyfriend tugged at the collar of his shirt and fiddled with his shoes. I watched him as he uncomfortably tried to adapt to his new image. He was trying his best to fool even himself.</p><p>We returned to the living room, where he put a log in the fireplace.</p><p>You hate it, dont you, I said.</p><p>This house is beautifuldont get me wrong, he lamented. And the clothes look great on a guy in a magazine. But</p><p>What?</p><p>I dont want to let you down.</p><p>Me? I said. Ive spent my whole life not conforming. Why would I judge you if you dont feel comfortable in an image that isnt your own?</p><p>Because if I dont do itif that reporter snoops around or it slips out that I sleep in a coffinthat I drink blood for breakfast Alexanders voice rose. It is dangerous not only for me, but for you.</p><p>I understand. I, too, was afraid Mr. Lunken would find out and reveal Alexanders true identity. But mostly for Alexanders sake.</p><p>Im not sure you do. Is this the life you really want, Raven? The one youve desired all your life? Or is it just about the fantasy of it?</p><p>What do you mean? I asked. Being a vampire had always fascinated me. I knew there were drawbacks, but werent there drawbacks to being mortal?</p><p>You are all about showing the world who you truly are. What if you couldnt anymore? he asked sincerely.</p><p>It was something I hadnt thought about. Id imagined a life of darkness and mystery, but not one where Id have to hide who I was. I dont know.</p><p>Think about it. Me, Sebastian, Jagger, even Luna. Were all in a club that no mortal wants to joinexcept for you.</p><p>But</p><p>Have you even told your own mother about me? Or Becky?</p><p>Of course not. I thought you didnt</p><p>I know. I dont. He wandered back to the mantel, stoked the fire, and gazed into the crackling flames shooting from the burning logs. But sometimes I do.</p><p>I was speechless. Alexander was so much more complicated than I could ever imagine. I did feel sorry for him. I never hid from others my thoughts and tastes, no matter how outlandish, and yet he had to keep secret everything about his lifestyle.</p><p>Sometimes I want your parents to know, he continued. Just be able to be who I am. And not have them be fearful of me. Not have them run away.</p><p>I couldnt imagine my parents running from Alexander under any circumstances. Maybe this was my opportunity to let them into his world.</p><p>Do you want me to tell them? I moved toward him and drew him in to me.</p><p>It will be the end of everythingof our relationship, of my living here.</p><p>What if it isnt? I asked excitedly. What if they embrace it? Then neither one of us would have to hide it anymore.</p><p>You think your father wants you dating a vampire? A guy who drinks blood to exist?</p><p>Theyre former hippies. They might think they were having a flashback.</p><p>Im serious. They arent hippies anymore. They are parents of a teenage girl.</p><p>Well</p><p>He sat down on the sofa. Its been great having Sebastian here.</p> <p>And you. Its been a long time since Ive been able to be myself, apart from being with you.</p><p>It was quite the sightAlexander, my once gothic prince, transformed into a handsome quarterback from a boarding school, living in a palatial mansion, pained with loneliness even as I sat right next to him.</p><p>This is my life, Raven, whether I have to hide out in a Mansion, live among my kind, or hide out in the Dungeon at the Coffin Club. Its all about secrecy and survival.</p><p>Id never been about hiding or not getting in peoples faces. Maybe I couldnt be a vampire after all. Could I take the solitude? Or wandering around like Sebastian, trying to find those who were like me?</p><p>I felt Alexander was pushing me awaynot from him, but from the fantasy of being a vampire. So if I was to truly be with him, Id have to show him how much I cared for him and push back.</p><p>But wed live together, I said. Like your parents do. I just want to be with youand I just want everyone to love you for who you are, just like I do. But I understandAlexander, I know Im impulsive, but I want whats best for youno matter what that means.</p><p>He turned to me, his eyes soulful and his shiny hair glistening. A gorgeous smile emerged from his serious face.</p><p>I fixed his collar so it rested flatly. Besides, it is only temporary. But dont be mad at me if I slip and call you Trevor.</p><p>Alexander didnt find my joke amusing, and he rose.</p><p>I didnt mean to I started.</p><p>He didnt speak but shook his head.</p><p>Im sorry. I was just teasing.</p><p>Noyoure right. This isnt how I live. And most important, this isnt who I am. He unbuttoned his shirt and removed it, exposing a white Cure T-shirt.</p><p>I was startled and elated by his bravado. I ran to him and gave him a squeeze so hard I thought Id pushed the air out of him.</p><p>Jameson, we have some moving to do, he called.</p><p>Sebastian and Jameson entered the room.</p><p>Were returning the Mansion and me to our original state, Alexander declared.</p><p>What happened? Sebastian asked.</p><p>Its just not me. I dont have to come out and say Im a vampire, but on the other hand, I also dont have to be ashamed of being myself.</p><p>So what do you want to do now? Jameson asked.</p><p>Reschedule the interview. Were going to return the furniture. Immediately.</p><p>All of it? Sebastian asked.</p><p>Alexander nodded.</p> <p>Jameson shuffled over to Alexander. Can we at least keep this rug?</p><p>Alexander smiled. Of course.</p><p>And my desk? Sebastian pleaded.</p><p>Yes.</p><p>Can we keep that outfit? I whispered, coyly tugging at his brown leather belt. Just for fun?</p><p>Fine! he reconciled. But everything else goes back. I have an interview to do! </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The next day after sunset, I bounded over to the Mansion with a renewed sense of delight. I was eager to see the Mansion return to normalor what Dullsvillians called a nightmare. I was proud that Alexander made the decision to be himselfor at least be as real as he could be without putting his true identity in danger. I knew it was an extremely hard choice for him to makebut either way he was going to be in the story. It was ultimately better that he shared the macabre artist that he was rather than an untrue, khaki-clad version of what he thought the town wanted him to be.</p><p>When I arrived atop Benson Hill, the Mansions door was wide open.</p><p>I entered the foyer to find the Mansion restored to its original disorder. The scent of lit candles and musty air that Id grown to love wafted through the halls. The brand-new crisp white linen covers were gone, exposing the worn Victorian couches. The silver floor lamps had been replaced with dripping candelabras. And the freshly purchased easel and metal desk with blue locker drawers had been taken from the library and the old desk and library books returned.</p><p>Curious, I bolted up the grand staircase. I peeked into Jamesons room to find his new accent rug at the foot of his bed. When I surveyed Sebastians room, the only thing organized was his shiny new desk.</p> <p>As I drew closer to the TV room, I heard Alexander and Sebastian talking intently.</p><p>So havent you thought about it, man? Sebastian asked. You must have.</p><p>Of course I have, Alexander answered.</p><p>Isnt it difficult to resist? She is beautiful.</p><p>It isnt easy.</p> <p>What were they talking aboutwho were they talking about? I pressed my back flat to the wall and did my best to hear.</p><p>She isnt a vampire, Alexander said.</p><p>But if she wasman, you could be living the dream. You could sell the bottles in your cellar. Shed quench your thirst for eternity.</p> <p>They both laughed.</p><p>I agree with you that it would be easier if she had been born into our world, Sebastian began. Thats what I think. Then there are no decisionsno conflicts, no pressure.</p> <p>Its enormous. I try my best not to think about it.</p><p>But you do</p><p>Of course I do.</p><p>I waited with bated breath to finally get a glimpse into Alexanders thoughts. Ones that I knew he was reluctant to tell me about.</p><p>If Becky were to go out with me, what would I do? Sebastian pondered. It would be very hard for me not to want to turn her. How do you manage?</p><p>I waited an eternity for Alexanders response. I pressed my ear closer to the door. I, like Sebastian, was eager to know how Alexander managed.</p> <p>Its difficult.</p> <p>If only she were born a vampire, Sebastian said again, then it would be easier.</p><p>Then she wouldnt be Raven, Alexander lamented.</p><p>I sighed. But what did Alexander think about turning me? I was dying to know more.</p><p>So, Sebastian pressed. Whats keeping you from it?</p><p>Alexander paused. Not Raven, I heard him say. Not my love for her. Or us being together.</p><p>I smiled inside and out.</p><p>I do imagine that moment, Alexander continued. Raven and I together on sacred ground. The first time I laid eyes on her, I knew she was what Id been searching for. What I didnt find with Luna or any girl Id ever known. But I never planned to fall for a mortalthe responsibility of it all. But no one said love is easy.</p> <p>I tried my best not to scream in delight. Listening to Alexander admit to Sebastian that he truly wanted me in his world was what Id been waiting for.</p><p>Do you think you ever will? Sebastian asked. Ask her</p><p>Would Alexander really turn me? I waited for his answer, but all I heard was deafening silence.</p><p>Miss Raven! I heard a voice say from the shadows.</p><p>I thought Id jump clear through the Mansions roof.</p><p>I didnt know you arrived, the Creepy Man said in his thick Romanian accent. You must have snuck in.</p><p>The door was wide</p><p>Raven? Alexander called from the room. Suddenly he was standing before me.</p> <p>Uh, he stammered. I didnt know you were here. It was obvious he was calculating in his head whether Id heard their conversation.</p><p>Sebastian was sitting with a gaming guitar in his hand.</p><p>Sebastian was just going to show off his guitar talents, Alexander said, changing the subject. Were just missing a gothic rock star.</p><p>Uhyeah, Sebastian said. I could use a singer.</p><p>They both looked to me.</p><p>Sure, I said. Just as long as you both have earplugs.</p><p>The following day, Alexander closed the coffin lid on Sebastians and my participation in his interview. We were banished from the Mansion, and just to be safely at a distance Sebastian and I met at Dullsvilles fountain until Alexander could join us.</p><p>It was odd, to say the least, to be hanging out with Alexanders best friend without Alexander. What were we going to talk about? Would it be strange to be hanging out with a guy who wasnt my boyfriend? The only other guy I was ever alone with, besides the occasional run-in with Trevor, was my snarky little brother.</p><p>There was no doubt Sebastian was charming. His mood was playful and his intentions toward me benign.</p><p>What I didnt plan on was anyone seeing us, since there was a soccer game at school and the whole town was going to be there.</p><p>Raven, I heard a sweet voice call. Are you two on a date?</p><p>It was Becky, the last person, besides Trevor, I wanted Sebastian to see.</p><p>Hey, what are you doing here? I asked. I thought youd be at school, cheering for Matt.</p><p>Im on my way. Wheres Alexander?</p><p>He has an interview with the Gazette. So I was being the tour guideonly Sebastians already seen everything in town.</p><p>I know one thing you havent seen: Our schools winning soccer team. Wanna come?</p><p>We cant, I said.</p><p>Have you ever seen a soccer game? Becky asked naively.</p><p>Yes Sebastian replied.</p><p>Well, you havent seen Matt play.</p><p>True, he said, but Im not sure thats a good idea. Were supposed to meet Alexander in an hour.</p><p>Even Sebastian tried to put off my best friend.</p><p>Dont be a stick-in-the-mud. I can bring you back here in time.</p><p>You know how I feel about soccer, I said, trying to be diplomatic. And especially going to school when I dont have to.</p><p>Oh, it will be fun. There arent any tombstones, but youre sure to see a killer match.</p> <p>Before I knew it, Becky was playfully leading Sebastian toward her truck. He looked to me for help. He was struggling with her touching him, and he was doing his best not to make eye contact with her.</p><p>She opened the passenger door and Sebastian reluctantly began to get in.</p><p>NoIll sit in the middle, I insisted, squeezing in before Sebastian had the chance to sit down.</p><p>I didnt want Sebastian to be too close to Becky. Hed tasted her blood. That meant Sebastian felt even more of a draw to Becky than he had originally. I could see him wrestling with his inner vampire.</p><p>Sebastian stared out the window. Becky did her best to engage him in conversation, and he did his best to be polite but remain uninterested.</p><p>Dont leave me alone with her, Sebastian pleaded as he and I sat on the bleachers. Becky was at the refreshment stand while we held a seat for her. Alexander will kill me if he finds out Im seeing her again. You know I didnt plan this.</p><p>I knowneither did I. We could both get in trouble.</p><p>Becky returned with some chips and a container holding three drinks. She handed the tray to me, and as I reached for it, she sat down in between us. Sebastian scooted away.</p><p>He took out his cell phone and began texting.</p><p>Want some chips? she asked him.</p><p>He fiercely shook his head.</p><p>Who are you texting?</p><p>Just some girls, he said.</p><p>Becky dismissed him and took her drink and chips.</p><p>There was a time-out in the game.</p><p>I received a text again from an unavailable number.</p> <p>I know where you are</p><p>Whos texting you? Becky asked. Im here, and Im the only one who you text.</p><p>Im not sure. I think they have the wrong number.</p><p>The soccer snobs returned to the field.</p><p>How long is this going to be? Sebastian asked with an obnoxiously audible yawn.</p><p>Whats wrong with him? Becky whispered to me. Hes acting very strangely.</p><p>Im not sure.</p><p>Just then Trevor scored a goal and the fans erupted in cheers. Sebastian rose to see what was going on.</p><p>Were winning, she said.</p> <p>Sebastian and Becky locked gazes. They both sat down, and he put away his phone.</p><p>Before long, Sebastian had lowered his guard. He was into the game, rooting for Matt, and glowing at Becky.</p><p>He took out his cell phone and began snapping pictures of the action. Then he focused it on Becky, who began to get caught up in Sebastians enthusiasm. She posed while I sat as inert as a tombstone.</p><p>Cmon, Rave she said, placing her arm around me.</p><p>Yes, Raven, Id like some of you, too, Sebastian suggested.</p><p>I couldnt even muster a fake smile.</p><p>Now let me take one of you, Becky said, retrieving her phone.</p><p>NoI hate being photographed. Sebastian shielded his face with the drink tray.</p><p>Weird. Alexander does, too, Becky said. Must be something in the water in Romania.</p><p>Must be, I said.</p><p>Then how am I going to remember you when you leave? she asked, snatching the tray from him.</p><p>Sebastian froze. His soft, lovelorn eyes melted even more. Beckys comments had pierced his already aching heart.</p><p>All right, he said.</p><p>He gazed into the camera intently. He smiled adoringly at Becky. She snapped her camera and the flash went off. He winced as if hed been struck by a soccer ball.</p><p>Are you all right? she asked.</p><p>I got something in my eye, he said, recovering his composure.</p><p>She tucked her phone into her purse and turned her attention back to the game, unaware that she had unwittingly broken his heart. She could never possess his image and he could never possess her love.</p><p>Becky waved wildly to Matt just as the buzzer went off.</p><p>Final quarter, she said.</p><p>We have to meet Alexander, I said. We need to go.</p><p>Off in the distance, a shadowy figure emerged over the horizon and began strolling down the grassy hill toward us.</p><p>Even from a distance, his presence was intense. A figure like no other. My own breath escaped me and I felt a magnetic and magical connection. For a moment, words eluded me.</p><p>Handsome, charismatic, and truly alluring. Alexander Sterling, the perfect vampire. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I stumbled into the kitchen, my vision blurry from lack of sleep and caked-on eyeliner that had smeared like a chocolate bar in the summer heat.</p><p>I was greeted by my overly chipper parents, nursing their coffee and tea before making their way to work.</p><p>I bet this will wake you up, my mom said, finding me bumping into the counter as I reached for a mug. Alexanders in the paper!</p><p>My eyelids shot open like a rocket.</p> <p>Where is it? I scoured the countertop and dinette. Do you have it?</p><p>I think Billy read it last.</p><p>Billy? You let Billy touch it? I was horrified. How could you! I know he got his snotty paws all over it! He probably mangled the whole thing!</p><p>Calm down, my father said.</p><p>I stormed upstairs to find my brothers door locked. I banged so hard, my fist pulsed with pain.</p> <p>Itll cost you, I heard him yell back.</p><p>It will cost youan arm and a leg!</p><p>The door slowly opened and I pushed myself inside. Billy was nowhere to be found. I jerked open his closet door, then heard his nerdy little voice from behind me.</p><p>He says he sleeps in a coffin! he teased.</p><p>What?</p><p>I spun around. Billy was standing at his door with the Gazette in his smarmy little hand.</p> <p>Im not sure who took off first. We both tore down the stairs as Billy cried, Mom, shes trying to kill me!</p><p>Nerd Boy I screeched, as Id done all his life.</p><p>I hadnt called him that name in months, but in my anger it just naturally rang out.</p><p>I tackled him before he reached the kitchen. I tried to wrangle the paper out of his hand as he pleaded with my parents for help.</p><p>It had been a while since we had a major sibling blowout bodyslam event, and he had grown stronger. It took all my might to hold him at bay.</p><p>Raven, get off him, my dad shouted.</p><p>Billy, give your sister the paper! my mom ordered.</p><p>Shes sitting on my chest! Billy hollered.</p> <p>My dad pulled me off my brother by my woven belt, and I grabbed the paper from his hand.</p><p>I took off for my room, locked the door behind me, and hopped onto my bed. I spread out the paper and carefully tried to smooth the wrinkles.</p> <p>Staring back at me on the front page of the Arts section was my boyfriend, with the caption An Artist Amongst Us.</p><p>He is so handsome! I cheered.</p><p>OUR TOWNS BEST-KEPT SECRET. A budding young artist, hiding out on Benson Hill.</p><p>Id always heard ghost stories about the Mansion on Benson Hill, but I didnt see any spirits wandering through the halls. I was invited into an old-fashioned estate with a reclusive teen. Homeschooled his whole life, Alexander spends his days and nights painting.</p><p>What is his inspiration? I asked him.</p><p>A girl named Raven, he replied.</p><p>Though I only saw the first floor, the rest of the Mansion appeared the same. He claims to sleep in a coffin and have a wine cellar straight from Transylvania. This artist might as well be a writer, too. But this interviewer wasnt fooled. The only thing he was really hiding was his talent. Though Alexander Sterling may be able to spin a yarn, he is also able to paint.</p><p>There is more to this artist than could ever be told. It has to be seen. All you need to do is take a look at one of his paintings. You can see how he loves this town and the people who inhabit it.</p><p>Do you want to be famous? Like Picasso, Dal ̈aMonet? I asked him.</p><p>No, he said. I just want to be likeme.</p><p>I riffled through my desk and found some tape. I placed my boyfriends article right over my headboard.</p><p>Even wrinkled, Alexander Sterling was still the most gorgeous guy Id ever seen. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I wasnt the only one who read the article on Alexander. In a town the size of Dullsville, small as a Shrinky Dink, any news was news. No one wanted to be left out from any new information or, worse, be the last one to know.</p><p>A group of cheerleaders was stretching out in the hallway while I waited for Becky outside the restroom. I was exhausted as usual.</p><p>Did you see the picture of that Mansion guy? the captain asked.</p><p>Hes totally hot, her assistant said, fixing her headband.</p> <p>Hes really funny, another said.</p><p>Did you see how he was ribbing the reporter? He must be really confident to do that.</p><p>And talented. My parents bought one of his pictures at the Art Auction a few months ago, the captain boasted.</p><p>Hot, talented, and funny.</p><p>How did she ever land him? her assistant said.</p> <p>They all glared at me. Just then I received a text.</p> <p>Funny article.</p><p>Picture of a vampire?</p><p>Impossible.</p><p>It was pitch-black when I went to Beckys house to meet her. Her parents werent home and her house was unlocked. I called her name throughout each room, but she didnt answer. I knew she was afraid to go to the barn alone, but perhaps she needed to replace the rake. I found the flashlight resting on the back-porch railing.</p> <p>Becky? Where are you?</p><p>When I finally reached the barn, the metal door was ajar.</p><p>Becky? Are you in there?</p><p>I heard some whispering voices and a giggle.</p><p>Becky? Is that you? Are you okay?</p> <p>I shined the light on a few bales of hay. On an empty ladder. Then the tractor. It caught Becky, who quickly covered her face.</p><p>Becky, what are you doing in here? You hate the dark.</p> <p>Her hair was messy and she bore a menacing smirk on her face. I helped her up when I noticed two fresh wounds on her neck.</p><p>No! What has Sebastian done to you?</p><p>What are you and Alexander waiting for?</p><p>NoBecky! What about Matt?</p><p>Hes not a vampire!</p><p>Just then I heard a beeping sound. I awoke to find Mrs. Hathaway and a classroom full of students staring at me.</p><p>Miss Madison, she said with a stern voice. Is that a cell phone I heard?</p><p>Noit was my alarm clock.</p> <p>The class laughed.</p><p>I have the authority to confiscate anything that is electronic, other than a calculatorwhich, I might add, you dont need in history class.</p><p>Mrs. Hathaway returned to her lesson, and I quickly checked my message.</p><p>Lets make history together.</p><p>I glanced up and saw Trevor peering back at me.</p><p>I shook off my dream, and Mrs. Hathaway stepped out of class.</p><p>What are you doing this weekend, Becky asked, besides sleeping?</p><p>Alexanders party was fast approaching. I didnt have much time to decorate. I only had one day to gather some gothic and groovy items. Id been so distracted with keeping Sebastian away from Becky that I hadnt had much time to be excited about Onyx and Scarlets arrival or figure out something to wear.</p> <p>Uhnot sure, I finally answered.</p><p>Why dont we all get together?</p><p>I think Alexander has plans, I said truthfully.</p><p>Doing what?</p><p>Im not sure. I just think I heard him say he was doing something. Nothing bigjust hanging in.</p><p>We can stay in, toounless you dont want us over.</p><p>Ohits not that. I just hate for you to cancel something dreamy like a movie night when all we are doing is hanging out playing video games.</p><p>Matt loves gaming. Besides, hes never been inside the Mansion. And I havent either, for that matter. We were only outside for Alexanders Welcome to the Neighborhood party.</p><p>How about I get back to you?</p> <p>I waited for Beckys response.</p><p>Okay. Text me when you know, she finally said.</p><p>I felt awful keeping Becky in the dark about Alexanders party. She was my best friendI included her in everything. For that matter, she was the only one Id ever included. If it wasnt for Becky, Id have been totally alone all of my life. This was the thanks she gotbeing excluded from an intimate gathering hosted at the Mansion. But I had to remind myself of the reason I was having the party in the first placeto keep her safe and mortal.</p><p>I was really shaken by my dream. Imagining Becky as a vampireand how much she enjoyed itjolted me. I liked my best friend just the way she was.</p><p>But the dream felt so real. The fact that my best friend became a vampire before I became one haunted me. I was struckby jealousy. No one in this town wanted to be a vampire more than I did. Not Becky, or a Pradabee, or an unsuspecting soccer snob. If anyone was going to be bitten in this town, it was going to be me.</p> <p>When the final bell rang, marking my freedom from the doldrums of Dullsville High, I met Becky at our lockers. Do you mind dropping me off at Annies Antiques? I asked.</p><p>Ill go, too, she said as she loaded her books in her backpack and I unloaded mine into my locker. I have nothing to do this afternoon.</p><p>I was planning on buying goodies for the party. How could I do that in front of her?</p><p>Are you sure? I asked. You know how I can dawdle forever. I dont want you to miss doing your homework.</p><p>Ive already finished it during study hall, she said proudly.</p><p>Then why are you taking home all your books?</p><p>The real question is why didnt you take any of yours?</p><p>Becky was as good a student as she was a friend.</p><p>I have things on my mind, I said. I planned on doing my homework in the morning.</p><p>She shook her head, as my mother had done a thousand times.</p><p>We exited the building, got into her truck, and drove the few miles to Annies.</p><p>Annies Antiques was one of my favorite haunts. A Victorian-style home was turned into an antiques store, each room filled with knickknacks, furniture, and artwork.</p><p>Annie greeted me with a warm hello. She was one of the few store owners who didnt judge me by the way I was dressed, assuming I was going to vandalize or shoplift. The antiques store was also one of the few stops in Dullsville where I regularly bought merchandise.</p><p>She wore an oversized leopard-print shirt with a black faux-fur collar and black rayon pants. Two golden retrievers roamed throughout the rooms and slept by Annies stool. What are you looking for today? she asked.</p><p>Nothing in particular. Just browsing.</p> <p>I got some new things in that might interest you, she said, pointing to a nearby doorway.</p><p>I strode across the Victorian homes hardwood floors, which were weathered by all the foot traffic and furniture being moved in and out. On a small table covered with black lace fabric were items from Halloweens past.</p><p>Coveting all the goodies, I gathered as many things as I could hold, as if at any moment there could be a swarm of competitive shoppers.</p><p>You could use a shopping cart, Becky said, helping me place the various decorations on the counter.</p><p>Look at these! Becky presented me with three fake tombstones. You can put them in your room.</p><p>Absolutely!</p><p>I found a box of skeleton lights perfect for hanging by the gazebo.</p> <p>Im not sure that all the bulbs work, Annie confessed when I brought them to my already rising pile of merchandise.</p><p>It doesnt matter, I said, unfazed. They are a must-have.</p><p>I found some lace place mats, dragon-headed candlesticks, and a ceramic raven.</p><p>Are you having a party? Annie asked. You could decorate a mansion with all this stuff.</p><p>Becky gave me a skeptical stare. Yes, what are you going to do with all these things?</p><p>I handed Annie all the money I had in my wallet. Saving them for a rainy day, I guess.</p><p>It might not rain for a while, Annie said. I hope you are able to enjoy them before then.</p><p>I will.</p> <p>Becky gave me a quizzical look as she helped carry the bags and load them into her truck.</p><p>Need help taking them into your room? she asked when we arrived at my house.</p><p>Thats okay, I said. I really should do my homework, after all.</p><p>Thats all I needed to say to let Becky know something was up.</p><p>Theres something youre not telling me, she said.</p><p>You know I tell you everythingor at least everything I can share that I dont mind Matt knowing, I said, giving her a friendly dig.</p><p>Fair enough, she said. But Ill find out from you one way or another.</p><p>With that, Becky drove off. As I set down my goods on the driveway and unlocked my front door, I still felt a twinge of guilt. Becky had just helped me decorate a party I wasnt even inviting her to attend.</p> <p>Dusk settled over Dullsville as I anxiously awaited Alexanders arrival at the cemetery.</p><p>We were going to share a private moment together before discussing our final plans for the party.</p><p>It was unusually late. I realized we might have planned to meet at the Mansion. I had finally decided to head back to the entrance when I got a text. Again, it was from an unavailable number.</p><p>Im watching you</p><p>I was sick of Trevor bothering me, and his game was about to end. I pressed the redial button, prepared to chew him out.</p><p>I heard a ringing coming from behind me but saw no one. I rose and followed the ringing until I made my way up toward the Sterling monument.</p><p>Out from the darkness emerged Alexander, a cell phone ringing in his hand.</p> <p>My heart stopped. It couldnt be. Alexander had a cell phoneand had been texting me?</p><p>It goes against everything you believe in.</p><p>He smiled a broad smile.</p><p>It was youall along? I asked, still shocked.</p><p>He continued to beam.</p><p>But you sent me messages during the day, I said, when you were sleeping in your coffin.</p><p>Youre not the only one who gets insomnia.</p><p>The image of Alexander lying in his coffin, thinking of me and texting, melted me.</p><p>But what made you do this?</p><p>Ive always wanted to sit next to you in class. Buy your lunch.</p> <p>Watch you study. You should have all the things a normal girl gets from her boyfriend. And by going out with me</p><p>Im not normal, though, no matter who I go out with, I said with a laugh. At least these Dullsvillians dont think so.</p><p>He put his arm around me. You arent normal to me, either. You are extraordinary.</p><p>I wrapped my arms around him.</p><p>You should have all the good things coming to you, he continued. All the gifts. I dont want you to ever doubt how much I care for you.</p><p>I took his free hand in mine. But this isnt your thing. Technology. Modern conveniences.</p><p>Its not about whats my thing, he said with a smile. Its about yours.</p><p>I hugged Alexander with all my might.</p> <p>But I dont want you to change.</p><p>Its not about changingits about growing, together, he said, like the wise soul that he was. I wanted to let you knowthat I am with you. Always. Forever. We dont have to be separated by the sun, school, or even the night. Now Im just a click away.</p><p>I was deeply moved by Alexanders present to me and rewarded my vampire boyfriend with mortal kisses. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I spent the following day alone, toiling around in the Mansions backyard while Alexander and Sebastian slept in their respective tombs. No one would be able to help me set up for the party. Thats what I got for wanting to date a vampire.</p><p>I hung the skeleton lights from the wrought-iron fence and put place mats on a coffin-lid table. I lined the crumbling walkway with votives and floor-length candelabras. The fake tombstones poked out from the dead grass. Sebastian had hooked up his sound system in the gazebo, and I decorated it with plastic bats and blinking skulls.</p><p>By the time Alexander and Sebastian awoke, I was beat. The pair was wide-eyed and freshly groomed when they found me crashed out on a sofa in the parlor room.</p><p>Alexander gently petted my hair and awakened me from my catnap.</p> <p>The best sight in the world was Alexander. Even blurry, he was smoldering. His deep, dark hair melted over his ears, and his smile was heavenly.</p><p>Youve really outdone yourself, he said. The backyard looks great!</p><p>What time is it? I perked up in a hurry.</p><p>They should be here soon, he said.</p><p>Im not even dressed! I exclaimed. And I feel like I just got out of gym class.</p> <p>I leaped up from the sofa and dashed to the upstairs bathroom.</p><p>I only had twenty minutes to clean up. I washed, dried, primped, powdered. It was something I was used to, as I normally overslept and had to get ready for school in record time.</p><p>Also, I was extra speedy because I was anxious for our party to begin, eager to see Onyx and Scarlet, and for Sebastian to fall in love with one of them so my relationship with Becky would return to normal.</p><p>When I finished my fifteen-minute makeover, I descended the outside backstairs as if I were a contestant in a beauty pageant. Only, instead of stilettos, hose, and a white ball gown, I was in rubber lace-up boots, fishnets, and a black slip dress. I spun around in my outfit.</p><p>Boyyou look hot! Alexander said. He was setting up the fire pit.</p> <p>Make that double hot! Sebastian concurred.</p><p>Sebastian was tinkering with the sound system, making sure his favorite hits were loaded onto his iPod. The three of us talked for a while, but our monsterfest wasnt going as planned. There was no sign of Onyx and Scarlet.</p><p>Alexander stoked the fire. Sebastian fixed some of the skeleton lights, and I adjusted my suffocating boots.</p><p>Its been nightfall for over an hour, I finally commented, glancing at my watch. Where are they?</p><p>Maybe they got lost, Alexander said. Did you give them directions?</p><p>Several times.</p><p>Then I bet something else came up, Sebastian lamented.</p><p>I know these girls, I said defiantly. If they said theyd be here</p> <p>Its okay, Raven, Sebastian said. Its really the nicest thing anyone has ever done for me. But we dont have to wait all night. Besides, this is as good a time as any to tell you that Ill be leaving tomorrow.</p> <p>What? I asked.</p><p>Even Alexander was surprised by his comment. We were having a blast.</p><p>I knowbut Ive worn out my welcome here.</p><p>No, you havent, I told him. Id gotten used to Sebastians presence, and I knew it was good for Alexander to have the company.</p><p>Why dont we go inside, he suggested. We can have a little band session to take it off my mind. I think youre on your way to being a lead singer.</p><p>We cant give up on our party yet, I tried.</p><p>Even Alexander was getting a bit fidgety. We havent eaten yet and Im feeling hungry. Well have Jameson make us some drinks.</p><p>But you have a bottle out here, I told them.</p><p>Well save it for something special, Alexander said.</p> <p>Fine. My first party, and it was a disaster.</p><p>They headed inside. I remained at the table and sulked for a few moments until I heard a car in the distance. I took off around the side of the grassy Mansion lawn, doing my best to avoid uneven patches of soil. When I reached the driveway, I saw two headlights shining on the street. The streetlamp illuminated a car. When I got closer I noticed a bright white Beetle, the headlights highlighted with black paint, the hood with a dark circle, and vertical white stripes adorning the bumper. It looked like a giant human skull.</p><p>Theyre here! I exclaimed. Theyre here.</p><p>I raced down the long driveway as if I were competing for a gold medal.</p><p>When I reached the Mansions gate, exiting the cryptic car were two amazingly stellar party girlsScarlet and Onyx.</p><p>Scarlet wore her curly red hair long with a black bow; she had on a cream-colored velvet dress, black lace gloves, and stilettos.</p> <p>Onyx, with her jet black, blade-straight hair, wore a corset top, knee-length skirt, ripped stockings, and wicked witchy boots.</p><p>We all screamed like children, and they engulfed me in a tight embrace.</p><p>We thought wed never see you again, Scarlet said.</p><p>I thought so, too, I said.</p><p>When we saw your message, we knew we had to come, Onyx said. No matter what.</p><p>I love your car! I proclaimed. I could only dream of driving that up to my house in the burbs. I thought I was lucky to have a black bike.</p><p>I just got it. Isnt it ghoulish? Scarlet grinned.</p><p>The two girls linked arms with me and we ascended the steep and winding drive. It was as if we were miniature dolls in comparison to the stately Mansion that loomed above us.</p> <p>Is this where you live? Onyx asked, aghast.</p><p>No, my boyfriend does, I replied.</p><p>Are his parents out for the weekend? Scarlet wondered, assessing the situation.</p><p>Wellfor a while longer, I said. They live in Romania.</p><p>He lives here by himself? Onyx asked. How lonely.</p><p>He has a butler.</p><p>You go, girl! Scarlet said.</p><p>He must be a millionaire, Onyx stated.</p><p>Almost, I said.</p><p>Is hea V? Onyx asked.</p><p>A what? I wondered aloud.</p> <p>A Coffin Club member, Scarlet whispered. You knowone of us</p><p>Oha V. I nodded proudly. And more important, so is his friend.</p><p>He has a friend? Scarlet hinted.</p><p>Yes, and hes single and very hot, I replied.</p><p>Love it! the two girls shrieked.</p><p>We never see that Phoenix guy anymore, Scarlet said. We thought maybe youd have hooked up with him.</p><p>Really? I asked. WellI havent either. But I think youll like Alexander, too.</p><p>Judging from that Mansion? I like him already, Scarlet declared.</p><p>Alexander didnt realize that the girls had arrived. The backyard was empty of male vampires. I was slightly miffed at the pair for giving up so easily.</p><p>Where is everyone? Scarlet said.</p><p>They went inside.</p><p>I felt awful. Should I leave my guests alone? Or take them inside? I had never hosted a party before and wasnt sure of the etiquette. I knew my mother would know exactly what to do, so I did my best impression of her.</p><p>Why dont you two wait here while I get you something to drink, I asked.</p><p>Nostay with us, Onyx said, grasping my wrist. We traveled all this way to see you, so were not letting you out of our sight.</p><p>Yes, Scarlet said. This way we can have some girl time.</p><p>I wanted the girls to feel the full effects of our haunting happening, but without Alexander and Sebastian it wasnt happening at all.</p><p>Maybe Alexander would get worried and come find me.</p><p>We sat at the tomb-shaped table. A Romanian bottle was chilling on ice, and the twinkling candelabra was still dripping hot wax.</p><p>So hows the Coffin Club? I asked. I miss it.</p><p>Its the best, Onyx said.</p><p>There isnt anywhere weve found thats like it, Scarlet added. And since Phoenix usurped Jaggers authority and made the club about us and not him, its been running smoothly. But we havent seen Phoenix at all. Its quite odd.</p><p>We thought you might have seen him, Onyx began, since you got on so well with him.</p><p>I havent seen anybody.</p><p>Not even Jagger? Onyx asked.</p><p>Noand for that Im grateful.</p><p>Really? I think hes kind of hot, Onyx confessed.</p> <p>Scarlet and I were surprised by her admission of admiration for the alluring, but menacing, vampire.</p><p>I mean in a lonely sort of way, Onyx continued. I think he might just be misunderstood.</p><p>So, Scarlet said. Youre dating a vampire. Then youll become a vampire, too! Scarlet was beside herself with glee.</p><p>Uhwere waiting for the right time, I answered.</p><p>But dont you want to be like us? Scarlet asked.</p><p>Of course, I replied. Its been my lifes dream.</p><p>Then what are you waiting for</p><p>Its a big decision, Onyx defended. I dont know that Id turn someone. It is a lot of responsibility.</p><p>I would! Scarlet said. Its in our blood.</p><p>To change someones life forever? Onxy proposed. We were born into this. We didnt have a choice. And for Raven, it would be changing everything about her life as she knows it. It is something that should be thought through really carefully. Not so casual or in the moment, Onyx argued, reassuring me. Its okay, Raven, to take your time.</p><p>There is nothing wrong with being a vampire, Scarlet said.</p><p>I didnt say there was, Onyx retorted. But would you want to be mortalif you found your true love?</p><p>Scarlet thought for a moment. I guess youre right. It is a big decision.</p><p>I smiled in agreement. It was hardthese two girls took for granted a lifestyle I wanted so badly. They werent becoming vampires because of someone they loved or something they wanted to bethey were vampires because they were born vampires.</p><p>It was then I remembered why Id invited them.</p><p>Speaking of true love, I began. Ive got a really great guy I want you to meet.</p> <p>Yes, tell us about Alexanders friend, Onxy said.</p><p>Hes really hot, I repeated. And hes looking for someone special.</p><p>Were special, Scarlet said.</p><p>Exactly! That was what I was thinking. I scooted close. He was enamored with my best friend, I confided. Only, shes mortal and has a boyfriend. And I dont want anyone in this town being bitten before me, I joked.</p><p>Yes, that wouldnt be fair, Onyx said.</p><p>Id die if some cheerleader showed up to a game with fangs, I told them.</p><p>That would be wrong on so many levels! Scarlet snorted.</p><p>She wouldnt be deserving, Onyx said. Not like you.</p><p>So I thought it would be wonderful if he could meet a nice vampire girl, I went on. And Dullsville is short on those.</p><p>So where is this Prince Charming? Scarlet asked.</p><p>The faint sound of a guitar wailing screeched from the Mansion.</p><p>Is that your boyfriend playing? Scarlet asked tentatively.</p><p>Nothats his friend.</p><p>I hope he kisses better than he plays, she teased.</p><p>The three of us laughed.</p><p>A figure was standing by the window. I knew Alexander would eventually wonder where Id gone.</p><p>Within a moment, Alexander and Sebastian were hanging out on the back steps.</p><p>Both girls mouths dropped when they saw the handsome pair.</p><p>Which is the available one? Onyx asked softly.</p> <p>I dont carethey are both gorgeous, Scarlet declared. Ravenyou dont mind sharing, do you? she teased.</p><p>Onyx and Scarlet, this is my boyfriend, Alexander.</p><p>Wowyou are so lucky! Scarlet whispered to me. We should have been hanging out here instead of at the Coffin Club.</p><p>Alexander blushed and shook both of their hands.</p><p>Sebastian cleared his throat. He was frustrated he wasnt getting any attention.</p><p>And this is Sebastian, I said. As if on cue, both girls held their hands out to him. He took each one and tenderly kissed them. Each girl giggled.</p><p>I hope thats just a prelude of whats to come, Scarlet said.</p><p>The girls broke their gaze with Sebastian and he gave Alexander the thumbs-up sign.</p><p>Would you like something to drink? I asked.</p><p>Uh. Sure. I guess Ill have a soda.</p><p>No, we have the real thing, Sebastian said, pointing to the bottle on the table.</p><p>Transylvania 1972, Alexander said as Jameson came outside to assist us.</p><p>I heard that was a good year, Sebastian said.</p><p>Why dont you sit here, I encouraged Sebastian, deliberately placing him between the two girls.</p><p>Alexander stuck a corkscrew in the bottle and turned it slowly. He pried the cork and it easily slipped out.</p><p>Jameson began filling the goblets.</p><p>Its rare to find something authenticoutside the Coffin Club, Scarlet said. In a bottle, anyway.</p> <p>We all laughed.</p><p>Well, you are in rare company, Sebastian flirted.</p><p>As Jameson continued to fill the goblets, Alexander poured me a soda and then himself one.</p><p>You can have some, I said. Dont miss this on account of me.</p><p>But Alexander politely refused.</p><p>Sebastian held the goblet to his nose and took a deep breath in.</p><p>Umperfect, Sebastian said. I think its a mixture of A positive and AB negative.</p><p>Wowyou are quite the connoisseur, Onyx praised. I can never tell.</p><p>Heres to us. Sebastian raised his glass and we all clinked ours together.</p><p>I watched as the three vampires put the blood-filled goblets to their lips and sipped as if they were consuming a rare vintage wine.</p><p>This is delicious, Scarlet said. Very smooth.</p><p>We are just happy you joined us, Alexander said. We know you came a long way.</p><p>It was worth it, Scarlet said.</p><p>Very smooth, Onyx added. Yet sweet. Just like you, she said, her eyes locking with Sebastians. Surprised by her remark, she began to giggle and spilled a bit of her drink.</p><p>I had to remind myself that some Romanians hemoglobin, not fermented grapes, had just dripped on my friend.</p><p>She cant hold her blood, Scarlet playfully scolded. I tell her that all the time.</p><p>I guess I drank it too fast, Onyx said.</p><p>Red liquid dripped down her neck and began leaking toward the lace border of her neckline.</p><p>Here, let me, Sebastian said, wiping the spillage with his napkin.</p><p>There was a moment between Onyx and Sebastian. He was doting on her as he had Becky. Our plan was already working. I gave Alexander a quick wink.</p><p>Scarlet sensed competition. And though the two girls were best friends, it was obvious Scarlet didnt want to be the one without a vampire. She leaned her elbow onto Sebastians shoulder, her bracelets dangling next to his goatee.</p><p>She tapped her fingers against his brown and blond dreadlocks as if they were batting eyelashes, then brushed her plum-colored fingernails along his neck.</p><p>No recent marks, she noted.</p><p>Interesting, Onyx said, almost scorned.</p><p>And you? Sebastian asked Scarlet.</p> <p>It isnt polite to ask a girl, is it? she asked coquettishly.</p><p>Well, I just thought.</p><p>Scarlet displayed her wrist. Two purple marks were embedded on her slight, chalk white arm.</p><p>But it didnt really mean anything, she confessed. He wasnt nearly as handsome as you.</p><p>Or as clever, Onyx added.</p><p>The girls were intoxicated by Sebastians charm, and he was relishing the attention.</p><p>I figured this was mine and Alexanders cue to leave the three single vampires alone.</p><p>Alexander, I think we left a few snacks in the house, I said.</p><p>Oh yeah, my boyfriend agreed, taking my hint. Ill help you.</p> <p>But before we could rise, Scarlet stopped us. Where is everyone else?</p><p>Ohtheyll be coming later, Sebastian said.</p><p>Yeah. We just wanted it to be us for a little while, I added.</p><p>Then sit down and enjoy yourselves, Scarlet insisted.</p><p>Alexander and I returned to our seats. I guess the girls expected a Mansion-size party. I couldnt break the news to them that they were the guest list.</p><p>How about we crank up the tunes, Sebastian suggested.</p><p>Yes, we love to dance, Scarlet said.</p><p>Sebastian turned up the music and the five of us rocked as hard as we could.</p><p>It looks like youre having a great time, I said to Sebastian as I danced next to him.</p> <p>I am.</p><p>Do you think youd like to ask one of them out?</p><p>I guess. But Sebastians voice wasnt confident. Even though he was having a blast, I sensed Sebastian was still carrying a torch for Becky.</p><p>The musics volume suddenly lowered. We stopped to discover Jameson standing by the sound system.</p><p>Complaints from the neighbors? Alexander asked, concerned.</p><p>Alexander, Jameson announced, you have some guests.</p><p>Guests? I asked.</p><p>Alexander was just as confused.</p><p>Ill only be a moment, he said, excusing himself.</p><p>I guess theyre here, Scarlet said. Well chat later.</p><p>I was curious what guests were arriving. Since Onyx, Scarlet, and Sebastian were engaged in conversation, I, too, excused myself.</p><p>I sped through the kitchen, down the long, haunting hallway, and found Alexander at the front door. I couldnt tell whom he was talking to, so I sneaked up close and peered out.</p><p>I spotted Beckys truck in the driveway.</p><p>What was she doing here? Was she in trouble?</p><p>It was then I noticed Trevors Camaro parked behind the truck.</p><p>I wedged myself between the entranceway and Alexander to find Matt fuming at the foot of the stoop.</p><p>Whats going on? I asked. Are you all right?</p><p>Matt, normally upbeat and smiling, was brandishing a frown. Behind him was Trevor and a team of soccer snobs.</p><p>What are they doing here? I asked Alexander.</p> <p>Matt glared at me coldly.</p><p>Its okay, Alexander said to me.</p><p>Wheres Becky? I asked. Is she all right?</p><p>I thought you were my friend, Alexander, Matt said sternly.</p><p>Alexander didnt move. I am, he said calmly. Whats this all about, Matt?</p><p>Your houseguest.</p><p>Hes out back.</p><p>Well, he better stay there.</p><p>Is something wrong? Alexander asked.</p><p>You bet. Your best friend has been hitting on my girlfriend, Matt challenged.</p><p>Alexander shook his head. His best friend had gotten him into a mess. Thats just Sebastians way. He didnt mean any harm.</p><p>Did you know that after Sebastian met Becky at Hatsys he texted her all night? Matt asked.</p><p>Not at the time. Im not with him every minute.</p><p>Sebastian sent the flowers to Becky. Not Raven. Did you know that?</p><p>Noor I would have stopped him.</p><p>But you did find out.</p><p>Yes.</p><p>So were you going to tell me?</p><p>There wasnt a need to. We had it resolved.</p><p>Really? Did you know he had the nerve to show up at her house?</p><p>He did? Alexander said. I thought he bumped into her in town.</p> <p>And all the time you both were laughing and encouraging him, Matt said, annoyed.</p><p>Now, take it easy. I never laughed, and I most certainly didnt encourage him. It was just the opposite.</p><p>Now I was mad. It was one thing to accuse me, and now Sebastian, of causing trouble, but quite another to accuse Alexander. You have it wrong, Matt. Alexander</p><p>Its okay, Raven, Alexander said, trying to calm me down. I understand you might be mad, Matt. But its not as bad as it sounds.</p><p>And to think I included him at Hooligans.</p><p>You are misunderstanding what happened.</p><p>Am I?</p><p>Matt stepped forward.</p> <p>I was ready to pounce on anyone who charged at Alexanderthough he was quite capable of defending himself.</p><p>Alexander held out his arm. Its okay.</p><p>Now youre having a party, Matt said. Then he fixed on me. And Ravenyou dont invite your best friend?</p><p>Trevor stood behind Matt, arms folded, smiling gleefully.</p><p>Whats he doing here? I charged. I thought you werent his shadow anymore.</p><p>Hes the one who told me, Matt said. Seems Trevor is a good friend after all.</p><p>The soccer snobs surrounded Alexander. I rushed in, but Alexander held me at bay.</p><p>I dont think you know who you are dealing with here, I said to the gang of athletes.</p><p>Alexander appeared concerned for Matts situation, but he wasnt worried about the threat from the others. He was confident in his own power, and I knew he wouldnt use it unless it was to defend me.</p><p>Is Becky with Sebastian? Alexander asked.</p><p>Noshes with me, Matt said.</p><p>Then isnt that your answer? Alexander assured Matt. After all the texts, the flowers, and the visits, shes still with you.</p><p>Matts anger changed to relief. He even broke a smile.</p><p>Sebastian suddenly appeared beside us. Whats going on?</p><p>When he saw Matt, he knew he must have found out about his feelings for Becky.</p><p>Im the one you have a beef with, Sebastian said. This isnt about Alexander.</p><p>I know that now, Matt said.</p> <p>Lets talk calmly, Sebastian urged.</p><p>I know how you feel about Beckybut Im the one who loves her, Matt suddenly proclaimed.</p><p>Becky hopped out of the truck. She raced to Matt and clutched him around the waist. Hed declared his love for her in front of everyone. She gazed up at me with an almost thankful smile.</p><p>I was surprised by Matts sudden passion and proud that he was standing up for Becky. However, I didnt want this conflict to continue.</p><p>And just so you know, Sebastian defended, Alexander ordered me to leave the Mansion.</p><p>He did? Matt asked.</p><p>But I was the one who wanted to stay in town. Raven and Alexander went out of their way to arrange a party for meto find my own Becky. So they really are better friends to you than you might think.</p> <p>Matt was speechless.</p><p>Yeahso you might have Becky, Sebastian began, but I have Raven and Alexander.</p><p>Matt was stunned. I feel awful, he said.</p><p>I do, too, Becky added.</p><p>Matt glared at Trevor. You started this, didnt you? Just like always.</p><p>But Trevors attention was on a few cars that had pulled up to the Mansions gate.</p><p>Within a few minutes, vehicles began to line the street.</p><p>Students came up the driveway and the lawn, decked out in their Saturday-night best and carrying bags of beverages.</p><p>Whats going on? I asked.</p><p>You know how news travels in this town, Trevor said. Everyone likes a party. Not just you guys.</p><p>Wheres the coffin guy? a Pradabee asked.</p><p>Is that him? another asked, pointing to Alexander. Hes gorgeous!</p><p>I wonder if he has a dungeon, the Pradabee commented. Or a secret room. I wouldnt mind if he locked me up in one. The pair laughed and followed the others to the backyard.</p><p>What are we going to do? I asked frantically. Call the police?</p><p>Noits fine. Alexander beamed.</p><p>Alexander surveyed his uninvited guests and their festive mood.</p><p>Well, we dont have enough drinks, I said. I mean, the non-Romanian kind.</p><p>Doesnt seem to matter. Looks like they are bringing their own, Alexander commented.</p><p>Sebastian lit up. Now, this is a real party. This is what were missing by being homeschooled. Look at these girls. Theyre all hot!</p><p>We arrived in the backyard to a full-fledged happening. The backyard began to fill up with every teen in town.</p><p>Heres some liquor, a soccer snob said, holding the unfinished Transylvania 1972.</p><p>He lifted it to his lips and leaned back to take a huge swig.</p><p>No I yanked it out of his hands. Thats an import! I chastised. I grabbed the goblets and carried them into the house like a seasoned waitress.</p><p>As I exited, I met an anxious Jameson in the doorway, examining the expanding party.</p><p>Miss Raven, what has happened?</p><p>We had a few party crashers.</p><p>A few? More like a hundred. I must go to the basement. I know we have more stock.</p><p>Not the cellar, Jameson, I said. Its not that kind of party.</p><p>Of course, I meant in the downstairs pantry. Jameson fretted. Oh, I wish I had time to prepare!</p><p>Id watched plenty of movies. Couples using pieces of furniture and empty bedrooms for makeout sessions while others used the furniture as coasters. I didnt want the Mansion trashed and, more important, Alexanders and Sebastians identity revealed. Dont let anyone in the house, I told Jameson before he started off. If they find Sebastians bed</p><p>I understand, Miss Raven.</p><p>Just then two girls came up to the door.</p><p>Which way to the bathroom? one asked.</p><p>That way, I said, pointing to the street. There is one at the gas station. Or, better yet, I bet theres a golden-seated one at your home.</p> <p>The girls glowered at me and returned to their boyfriends.</p><p>Ill stand watch as soon as I get back, he said nervously. Jameson wasnt the only one upset. I returned to find my partylike my lifeout of control.</p><p>Couples were mashing. Some were hanging out by the fire pit. Others were dancing.</p><p>I spotted Onyx and Scarlet hovering on either side of Trevor. The girls were fawning over his beefy physique.</p><p>Where was Sebastian? The girls were supposed to be drooling over him. But none of the vampires seemed interested in the others at this point.</p><p>I stormed through the crowd and toward the girls. Scarlet pretended to arm-wrestle with Trevor and then turned his wrist to examine it.</p><p>I saw Scarlets fang catch the light of the fire pit. Onyxs onyx tattooed fang sparkled when she grinned.</p> <p>Trevor was in heaven. But if Onyx and Scarlet had their way, he might be somewhere else.</p><p>Scarlet lifted his wrist to her mouth.</p><p>Scarlet! I called. Onyx.</p><p>Not so fast, Trevor warned, holding Onyx by the waist. They are doing just fine. You arent the only one interested in threesomes.</p><p>First of all, Im not. And second of all, this isnt that kind of party.</p><p>Is jealousy the only emotion you feel? Trevor charged. Even in front of Monster Boy? he said. But it appears hes already busy, he said, gesturing to a few girls who were talking to Alexander. But dont worry. You can join in with us. I wont tell.</p><p>I wasnt pleased that my schoolmates were fawning over my boyfriend, but I had more urgent matters to attend to.</p> <p>Save it for school.</p><p>I wrangled the girls away from Trevor and whispered in Onyxs ear. Hes not a V.</p><p>Not a V? He had overheard me. What does that mean? Virgin?</p><p>Oh, really? Onyx said softly.</p><p>They were shocked.</p><p>Funny, we both sensed he was, Scarlet whispered. Its not the first time weve made a mistake, she said, alluding to me.</p><p>Remember why I invited you guysfor Sebastian, I urged.</p><p>But Scarlet wasnt walking away. She was charmed by Trevor and continued to hold on to his hand.</p><p>You can have Sebastian, she said in a low voice to Onyx.</p><p>She cant like Trevor, I said. Thats not an option. Remember what we discussed, I warned through gritted teeth. No one gets Dont worry, Raven. Shes just having fun, Onyx said, stopping me. And I plan to do the same. Onyx flipped back her jet black locks and disappeared into the crowd.</p><p>This party was getting out of hand. Vampires mixing with unsuspecting mortals. I had to make sure no one was bittenespecially Trevor Mitchell.</p><p>I looked to Alexander and Sebastian for help. Sebastian was now talking to the girls who were interested in Alexander, and Alexander was entranced by his rocking party.</p><p>I turned to go back to Trevor and I bumped into Becky.</p><p>Im so sorry, Raven, she said. Can you forgive me?</p><p>Uh, yesbut I have something else I have to deal with right now.</p><p>Pleaselisten, Becky pleaded. Youre the one who always talks about being in trouble, but Im the one who keeps getting you there. You are my best friend. Now and alwaysand I dont want anything to get in the way of that.</p> <p>I hated not telling you about the party, I said. I did feel like a sneak. But I had to protect you.</p><p>I totally understand. You and Alexander are so kind to Sebastianand to me. And look what weve done. We brought Trevor and the entire school to the Mansion. Becky sat on a bench lined with plastic skeletons. Im so ashamed.</p><p>Its okay, Becky. I gave her a hug. Alexanders having the time of his life. Babes dancing in his backyard. Jocks hanging out. Its an image I never imagined. Its a blessing, really. Hes so isolated being homeschooled, and now hes more popular than Trevor.</p><p>Becky managed a small grimace. You dont hate me?</p><p>Of course I dont hate you. Youd have to do a lot worse than bringing Trevor to the Mansion for me to not like you. But speaking of TrevorI have a major issue to address. Can you help me?</p><p>Of course.</p> <p>Just as I began pushing past the crowd to separate an embracing Trevor and Scarlet, all heads turned toward the back stairs.</p><p>I saw a sight I thought Id never see. I was completely unprepared.</p><p>Descending down the Mansions back stairs as if a soft halo of light were around her was a gothic fairy girl with candy-pink-colored hair perfectly woven into two braids and wrapped in Wednesday Addamsstyle black bows, wearing an offbeat Alice in Wonderland dress with black-and-white tights and pink combat boots.</p><p>She was as beautiful as she was cute, as fragile as she was confident. Her frame was that of a whimsical angel with the wings of a devil. And everyone at the party was spellbound.</p><p>It was Luna Maxwell.</p><p>I hated how beautiful she was. She had perfectly porcelain skin, and her glossy pink lips sparkled like tiny stars. Her presence lit up the crowd. She drew everyones attention like a starlet.</p> <p>The crowd was hypnotized. Sebastian was mesmerized. For a moment, even Alexander was transfixed.</p><p>And looming right behind her was her twin brotherJagger, Alexanders former nemesissporting familiar bleached-white hair with bloodred ends, a freakishly frightening Joker T-shirt, and red Doc Martens.</p><p>Our party had officially spun out of this world.</p><p>How was I going to hold all these vampires at bay from mixing with the mortal students of Dullsville? How were we going to keep their Underworldly identity a secret? And if their cover was blown, how was I going to keep Alexander from having to leave Dullsville?</p><p>My blood boiled and my flesh flushed. I felt dizzy and queasy. The voices and music became muddled, and everyone suddenly seemed very far away.</p><p>I was sure I was falling.</p> <p>Then the world went black. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I opened my eyes to find myself lying flat on the grass. Alexander was kneeling beside me. A large circle of familiar facesBecky, Matt, Onyx, Sebastian, Scarlet, Trevor, Jagger, and Lunawere staring down at me. The stars shimmered and a full moon hovered above them.</p><p>It had to be a dream.</p><p>I closed my eyes again.</p><p>Lets give her some air, I heard a girls voice say.</p> <p>Did you drink too much? another asked.</p><p>Did she take something?</p><p>Did she OD? someone else said.</p> <p>My mouth was dry. I couldnt form a word in my defense.</p> <p>Ill take her to a doctor, Alexander said, alarmed.</p><p>Here, drink this, Becky said, handing me a soda. Alexander helped me sit up, and I gulped down the bubbly liquid as if I hadnt drunk for days.</p><p>Scarlet held a bag of ice on my head.</p><p>Did you eat something odd? Becky asked like a ponytailed Florence Nightingale.</p><p>NoI havent eaten anything, I replied, weakened.</p><p>The crowd of well-wishers stopped fussing.</p> <p>What? Alexander asked. You havent eaten?</p><p>I didnt have time. I was decorating for the party all day.</p><p>Not even breakfast? Scarlet asked.</p> <p>No.</p><p>Then no wonder you fainted, Becky said.</p><p>Alexander signaled to Sebastian, who took off for the Mansion.</p><p>My boyfriend swept me up in his arms and carried me to the table. He gently let me down in a wrought-iron chair and held my hand while I drank my soda. A few moments later, Jameson pushed a small cart through the crowd of partygoers. The scent of marinated steak was intoxicating to the mortals and euphoric to the vampires.</p> <p>A thick, juicy steak was placed before me. All the vampires, including Alexander, almost salivated.</p><p>Ill do that, Scarlet said as I began to cut into the bloody steak.</p><p>Its for Raven, Alexander said gently.</p><p>The vampires watched with envy as I tore into my meal. As I wolfed down the steak and began to regain my strength, Alexander began to address the next issue we had on our handsbloodsucking party crashers.</p><p>The candelabras lit Jaggers menacing ice-green-and-blue eyes. His sister stood behind him, basking in the glow of stares from the male partyers.</p><p>I dont remember inviting Alexander said.</p><p>Some girls have looser lips than others, Jagger said.</p><p>Onyx appeared ashamed.</p><p>Perhaps its time we mingle, Scarlet said. She led Onyx into the crowd.</p><p>We didnt think youd mind, Jagger said to Alexander. Now that we are friends.</p><p>Alexander was skeptical. Though their feud had ended when Alexander returned Jaggers weakened brother, Valentine, to him, Alexander wasnt expecting his longtime nemesis to instantly replace Sebastian.</p><p>Friends? Alexander said.</p><p>Yes, Jagger said. One can never have too many, right?</p><p>I suppose you are right, but</p><p>There really is safety in numbers, Jagger urged. Besides, we have so much in common: Romania, vampires, and Raven.</p><p>Raven? Alexander asked suspiciously.</p><p>I saw a lot of her recently, Jagger proclaimed, referring to my attendance at the Coffin Club. She fit right in.</p><p>I heard, Alexander said.</p><p>No one knew she was any different. Did she tell you?</p><p>She didnt have to.</p><p>I was hoping to see her there again, Jagger continued. It seemed she got on as well as any of the members there.</p><p>She is planning on being here, Alexander said.</p><p>I was hoping youd come back, Jagger said to me. But since you didnt, this way weve come to you.</p><p>How sweet, I retorted.</p><p>I think well be fast friends, Alexander, Jagger said. Its something Ive always wanted. There is so much we can learn from each other. Jagger gestured to the party. There is safety in numbers. We could use more members and, with your help, perhaps start a club here.</p><p>Out of the question! Alexander said.</p><p>Nothing you have to decide now, my friend, Jagger said calmly. But imagineIf all these mortals were just like us, then think of what could bewhat we could do. A town in which you dont have to hide out in a Mansion, all alone.</p><p>I think its time you leave, Alexander demanded.</p> <p>But we just got here, Jagger said. Youre right. Im getting ahead of myself. Im just a visionary, thats all. Nothing you need to commit to this minute. Besides, Jagger continued, we came to party. And Luna was very eager to see Raven.</p><p>So how have you been, Raven? she asked,  ̈1ber-polite. Besides lying flat on your back, she whispered in my ear.</p><p>Luna was still bitter toward me for fooling her into believing I was a vampire. And even more so because Alexander had jilted her at the covenant ceremony back in Romania and he had found happiness with me.</p><p>However, seeing Luna standing here today, glowing like an angel, I couldnt imagine him ever leaving her.</p><p>Alexander, Luna said in a soft, sexy voice. Its great to see you. She showed off her dress for him. A group of jocks ogled her as she twirled around. Its amazing how much a person can change in just a short time, isnt it? Im sorry for you that things in your life have remained the same.</p><p>Alexander wasnt pleased with her taunting.</p><p>Yes, doesnt my sister look great? Jagger said. This lifestyle suits her. Shes been dying for it since she was born.</p><p>Im glad you are so happy, Alexander said. Thats all I ever wanted for you. He turned back to the party.</p><p>Luna took Alexanders comment as a slap in the face instead of a heartfelt sentiment. She couldnt mask her scorn and turned her venom on me.</p><p>I see youve managed to fool some other girls, too, she said, referring to Onyx and Scarlet.</p><p>They like me for who I am, I said.</p><p>But do you like yourself as you are? Or, at the end of the day, do you really wish you were more like me?</p><p>Luna was right. She had the one thing I didnt haveshe was a vampire.</p> <p>I have everything youve always wanted, she bragged.</p><p>Except Alexander, I snapped back.</p><p>Well, when you can be here for an eternity, everything is possible. I just need time.</p><p>I wasnt happy with her insinuation.</p><p>When he sees my potential. Perhaps what he is missing from a relationship with youWho knows what he might do?</p><p>With that, she and Jagger joined the other partygoers.</p><p>Alexander, I said, getting his attention, Luna isnt over you. She still cant be trusted.</p><p>Her bark is worse than her bite.</p><p>Im serious. Shes still in love with</p><p>Hey, Sebastian said, suddenly by our side. This party is killer!</p><p>You think so? I asked.</p><p>Its not what I planned. Im even amazed. Alexander beamed.</p><p>This mansion is going to be party central, said Sebastian. The girls think you are a rock star, and I dont mind taking your leftovers.</p><p>I glared at Sebastian.</p><p>I mean, taking them off your hands so you can be alone with Raven.</p><p>A band of jocks bumped into the tomb-shaped table, knocking it over. Alexander rushed to help steady it.</p><p>There is no reason you need to be cruising this crowd, I told Sebastian. There are two perfect and single girlsthat were just meant for you, I said as the ultimate matchmaker. Onyx or Scarlet.</p><p>I know, Raven. They are beautiful, but there arent any sparks.</p> <p>What do you mean? You just met them. And now you are totally ignoring them. You need to spend more time with them.</p><p>Its just something I feelor rather dont feel. And by the way it looks, they dont seem to be bothered.</p><p>Trevor was talking to Jagger, and Onyx and Scarlet were by their sides.</p><p>Well, maybe Im not meant to be in love, he said. Maybe Im supposed to just have fun. And is that so bad?</p><p>I was a major failure at matchmaking.</p><p>This was not supposed to happen! I said. None of this was supposed to happen!</p><p>I ditched Sebastian and was heading toward Alexander when Becky jumped in front of me.</p><p>Where have you been? she asked.</p><p>This night has gone all wrong, I said frantically.</p> <p>No it hasnt. Look! Everyone is enjoying themselves. You might be having the best party Dullsvilles ever seen.</p><p>Sebastian was supposed to like Scarlet or Onyx and he doesnt like either, I rambled, and to top it off, Scarlet seems to be struck by Trevorgag meand Onyx is smitten by Jagger.</p><p>Its nice that they came to town for your party.</p><p>Jagger and Luna werent invited. Remember? You werent even invited.</p><p>Becky laughed. Raven, youve brought the whole town togethereven a neighboring one.</p><p>But I didnt want to. Even Jameson is freaking out. He was standing guard outside the kitchen door. I have to do something. I know I took out my phone. Ill call the police. A noise complaint and a few squad cars are enough to drive everyone back to their sprawling estates.</p><p>Becky stopped me. Raventhen Alexanders party will be a bomb. Look at him. Alexander was joking with the group of jocks as they replaced the items on the table. He was as content and happy as hed been when he was out with Sebastian and me. Wouldnt you rather the party be a hit than have your boyfriend stuck in his attic room forever alone?</p><p>I weighed my friends thoughts heavily.</p><p>Then what should I do? I finally asked.</p><p>How about have some funlike everyone else? Why should you be the only one moping?</p><p>Becky didnt understand the severity of the situation. And it wasnt something I could delicately break to her over the sounds of pounding music. However, it was Alexanders mansion, and if Alexander was having a blast, then it wasnt my place to break up the party.</p><p>Alexander was now hanging out by the fire pit with Matt, Sebastian, and several soccer snobs. I was approaching him when I overheard a few cheerleaders talking to him.</p> <p>Are you the painter in the article? one asked.</p><p>Uhyes.</p><p>I like to model, another told him.</p><p>Do you do nude portraits? the first one asked.</p><p>The girls all laughed.</p><p>I was steaming! My blood began to boil and my whole body raged.</p><p>There is only one model I use, Alexander said. And her name is</p><p>Raven, they said in unison.</p><p>Yes, he said.</p><p>A warm feeling flooded me.</p><p>Perhaps you should get to know her, he said. Shes a great girl.</p><p>The girls all turned their noses at him and walked away. I snuck up behind my boyfriend and gave him a huge embrace.</p><p>There you are, he said. I was just talking about you.</p><p>You have groupies, I said. Sebastian was right.</p><p>No I dont, he said humbly.</p><p>He drew me close and kissed me by the open flames.</p><p>I never dreamed wed have a hit on our hands, I said.</p><p>I never did, either, he said.</p><p>Jagger and Onyx and Luna joined us by the fire pit.</p><p>Jagger Maxwell, Sebastian said, a drink in his hand. Its been a while since Ive seen you. This is the last place Id imagine bumping into you.</p><p>Jagger moved in close, out of earshot of the soccer snobs and Matt.</p> <p>Alexander and I have to make up for lost time. I thought now was as good a time as any to begin our new friendship.</p><p>Alexander is really picky about who he hangs out with, Sebastian said protectively.</p><p>Im sure he is.</p><p>Rumor is you havent returned to Romania, Sebastian said.</p><p>I started a club a few towns over. Ive been talking to Alexander about possibly starting one here.</p><p>This town could really use a club, Sebastian said.</p><p>Jaggers blue-and-green eyes lit up. Then you might be the one to help me.</p><p>I love clubs. And youre rightthis town could be a perfect place to open one.</p><p>You dont know what hes really talking about, Alexander warned.</p> <p>Perhaps we can go into business together, Jagger said to Sebastian.</p><p>Maybe</p><p>Luna yawned and appeared bored.</p><p>Luna, Jagger said, seizing the opportunity. I want you to meet Alexanders best friend.</p><p>Alexanders best friend? she asked, perking up. I dont believe weve met.</p><p>No, I think Id remember, Sebastian said, tonguetied.</p><p>She grew up on a different time schedule than we did. But now we are all finally the same, Jagger said. Luna, Sebastian might be interested in starting a Coffin Club here.</p><p>No hes not, Alexander said. He doesnt know what you are talking about.</p><p>Sebastian was lost in Lunas spell, even though she was somewhat intimidating.</p><p>Any friend of Alexanders is a friend of mine, right, Alexander? Luna flirted.</p><p>Lets hope so, Sebastian said.</p><p>Suddenly this party doesnt seem so insipid after all, she commented.</p><p>I tried to block Sebastian from Luna. I think Jameson needs our help in the kitchen.</p><p>Jameson can find someone else, Luna said, gazing at Sebastian. Its a party, the night is young, and Im out for blood. Would you like to dance, Sebastian? Luna asked.</p><p>Are you kidding? Sebastian looked as if he would have breathed in garlic if Luna had asked him.</p><p>So tell me what it was like growing up with Alexander, Luna said, leading him to the dance floor.</p> <p>Jagger smiled a mischievous smile. Onyx, would you like to dance?</p><p>Onyx acted as if shed just been struck by Cupids bow. Of course, she said, and followed Jagger.</p><p>Alexanderwhat do we do?</p><p>How about we dance, too?</p><p>When we arrived on the dance floor, Alexander and I kept a watchful eye on the others. But after a few songs, we got distracted by our own connection.</p><p>This was the reason to have a party, Alexander said, kissing me. For us.</p><p>I was so lost in his eyes. Id gotten so sidetracked that I wasnt allowing myself to enjoy the very thing Id been dreaming about all my life: Alexander Sterling.</p><p>I still want to be like you, I said. I want to be with you. Forever.</p> <p>Alexander pulled me into him and laid a dizzy-making kiss on my lipsso passionate and tender, my knees shook.</p><p>Luna bore a gaze that blazed through us.</p><p>Becky and Matt applauded, and we got a few whistles.</p><p>Alexander and I embraced, and Luna left the dance floor.</p><p>How about a slow one? Matt suggested. He fiddled with the sound system until he found a song he liked.</p><p>The four of us danced, joined by Dullsvillian student couples.</p><p>When the song was over, I was jolted out of our romantic entanglement.</p><p>The Pradabees were with the other Pradabees, and the soccer snobs were mixing it up with the cheerleaders. Trevor was flirting with Scarlet, and Onyx was hanging next to Jagger.</p><p>Wheres Sebastian? I asked.</p> <p>Hes probably in mortal babe heaven, Alexander said. I appreciate all youve done for him.</p><p>Me? It was nothing.</p><p>One other partygoer was not accounted for. Luna was missing. That could mean only one thing. Trouble.</p><p>It was late. Bottles and trash littered the backyard of the Mansion. Alexander and I forced our way through the reveling students. A large crowd had gathered around the gazebo. I pushed through to find Luna, several soccer snobs, and Sebastian sitting in a circle.</p><p>In the center, resting on its side, was the empty Transylvania 1972.</p><p>The students, unbeknownst to them, were playing a deadly game of spin the bottle.</p><p>We have to stop them, I said.</p><p>The game seems quite uneven. She must be up to something, Alexander said.</p><p>The crowd was hooping and hollering, and several guys had formed a line vying for a seat in the circle.</p><p>Were waiting our turn, a guy said to me.</p><p>Luna spun the bottle, and it landed on a soccer snob.</p><p>On the cheek, please, she said.</p><p>Are you kidding? Forget it. He got up and walked away.</p><p>She spun again. It landed on another soccer snob. On the cheek, please.</p><p>He gently gave her a slobbering kiss on the cheek, to the crowds delight. She made a face and wiped it off with her sleeve.</p><p>Luna twirled the bottle again. It landed on Sebastian.</p><p>On the cheek, I know, he said.</p> <p>Luna made a deadly stare at Alexander, then gazed at Sebastian. On the neck, please, she said coyly.</p><p>Sebastian was stunned, and the crowd cheered.</p><p>She stood up and flipped back one of her pink Wednesday Addams braids to expose her porcelain flesh.</p><p>Luna put her waify arms around Sebastians waist.</p><p>We have to stop this, I said to Alexander. Hes going to bite her!</p><p>He better not! Alexander charged forward, but the cheering crowd grew larger, blocking our path to the gazebo.</p><p>Sebastian grinned and began to lean in to Luna.</p><p>I squeezed myself in between a pair of petite cheerleaders.</p><p>Sebastian smiled, revealing two shiny fangs. Lunas eyes closed and she leaned back with delight.</p> <p>No! I screamed.</p><p>I jumped between Sebastian and Luna, but at the last moment someone pulled me back.</p><p>It was Jagger.</p><p>What are you doing? voices from the crowd yelled at me.</p><p>Alexander and I were mortified. Sebastian was smiling, and Luna was holding her neck, grinning.</p><p>She removed her hand. Tiny drops of blood trickled down her neck.</p><p>Sebastian turned to me and Alexander, his eyes hazy and his fangs red. He wiped his hand over his mouth and pulled Alexander close.</p><p>I think Im in love, he declared. And this time its for real. </p> </body></html>"]