["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>.1.</p><p>Every female eye was drawn to the same man, and for once, it wasn’t Criminy Stain. The ringmaster seldom came to sit around the bonfire with his carnivalleros at the end of a long day’s setup, and it had been ages since there had been any eligible fellow worth glancing at across the flames. Ever since Marco Taresque had stalked out of the moors, he’d been the topic of many a whispered conversation. And many a feverish dream in the secret cocoon of a caravan wagon.</p><p>Marco sprawled against a velvet settee that was one broken leg away from firewood. The knife thrower took up more space than most men, and the other carnivalleros naturally shifted away to accommodate the dangerous aura that surrounded him. The fire lit his dark hair; the ever-present shadow of a beard highlighted exotically high cheekbones. He used kohl as the Bludmen did, which only served to make his violet eyes smolder more ferociously, reflecting the smoke and the cherry-hot flames.</p><p>Directly opposite him, contortionist Demi Ward leaned back against a barrel and sighed with longing. She was half in love with Marco after only a few days, but she resented the hell out of those violet eyes. The romance books she’d read at home on Earth before an accident brought her to Sang had always featured supernaturally beautiful heroines with eyes in unbelievable shades that real life failed to produce. She’d resented the characters then, and now she resented the devilishly hot guy who refused to acknowledge her, or any of the carnival girls. As Demi pretended not to watch, Emerlie edged closer and closer to Marco, trying to draw him into her chatter. He merely rolled his eyes and pulled deeper on his hot cider, ignoring the tightrope walker and resident busybody—which was no mean task.</p> <p>In her fantasies, Demi stood and tossed her dark hair, which was much longer and straighter and silkier than it was in real life. She walked directly through the fire like some half-daimon sorceress instead of just another Bludwoman, and one who looked deceptively young enough to be the daggerman’s daughter. In the dream, Marco’s eyes finally settled on her face, his breath catching. He stopped turning the dagger over and over in his gloved hands and stood, facing her. The world stopped. The fire ceased to dance. The other carnivalleros disappeared. It was just them, Demi and Marco, drawn to each other like bludbunnies to a scream. He held out his arms, and she walked into them, and he kissed her until her knees melted and the world dissolved in starlight. And then he threw her onto the back of a bludmare and galloped away into the night, on to bigger adventures.</p><p>“I’m tired.” Demi’s best friend and contortionist partner, Cherie, elbowed her in the ribs, and the fantasy blurred into smoke. “Let’s go back to the wagon.”</p><p>“I want to stay.”</p><p>Cherie leaned close. “Stop mooning over him. Marco’s too old for you. And he’s dangerous.”</p><p>Demi groaned and leaned her head back on Cherie’s shoulder. “I know. But he’s so undeniably hot.”</p> <p>“You’re just infatuated with the new shiny.” Cherie stood, shaking out curly blond hair peppered with straw, bits of silk, and dust from a day spent sinking posts, shining automatons, and raising the patchwork tent under which they now sat, protected by the circled wagons of Criminy’s Clockwork Caravan. “He’ll still be here tomorrow, you know.”</p><p>Demi squinted through the smoke. Marco’s face was lost in the flame. His expression was unreadable and far away, and his mouth turned down, just a little. It only made her want to kiss him more and taste a passion she hadn’t known in her world or in Sang, where the only guys in the caravan were freaks, loners, or boring. She’d had her eye on one of the new daimon boys, the older son of the dancing mistress, Mademoiselle Caprice. He was tall and Franchian and had an air of savoir faire that appealed to her. But once Marco arrived, Demi developed a one-track mind.</p><p>When Cherie rose and held out her hand, Demi took it and stood as gracefully as she could. Despite a day of drudgery and manual labor, she’d been careful to dress in clothes that showed off her lithe figure and accentuated the parts that boys liked to ogle. Every day, she was thankful that Criminy Stain had found her, bleeding on the moor, and brought her to the least boring life in Sang—and the one with the least frumpy clothes. Her artfully ripped lace leggings, high boots, short skirt, and corset did a good job of bringing in the customers on show nights, and now she felt the flicker of pride as male eyes snapped up around the fire to watch her stretch. Just because she wasn’t interested in the caravan guys didn’t mean they weren’t attracted to her—or that she didn’t like the attention. Even the lizard boy perked up, just a little, as she drew in a deep breath and pushed out her chest with a yawn.</p><p>Cherie swatted her and snorted. “Stop showing off. He’s not even looking. Come on, before I fall over.”</p><p>With a last, resigned look at the daydreaming knife thrower who didn’t know she existed, Demi followed Cherie to the clockwork bird guarding the carnivalleros’ tent from the outside world. It was colder beyond the gap, and they slipped past and hurried to their wagon, already shivering.</p><p>“Wait. What’s that?”</p> <p>Cherie had stopped, staring out onto the moon-dappled moor, and Demi was so deep in daydreams that she nearly ran into her smaller friend. Forced to look up, she saw something on the hill above where absolutely nothing but a rogue bludbunny should have been.</p><p>“A conveyance? Out here? But we’re miles from Scarborough.”</p><p>A shadow fell over them, and Demi spun, hands automatically curling into claws. When she saw the stark figure standing guard behind them, focused on the mysterious vehicle, she relaxed.</p><p>“What is it, Crim?”</p><p>The ringmaster’s gray eyes went as black as the night sky, his nostrils flared to scent the intruder. He bared his teeth and turned it into a reassuring smile.</p><p>“Hop into your wagon, my dears. I’ll have it sorted out in a jiff.”</p><p>Demi enjoyed a closer relationship with Criminy Stain than anyone in the caravan other than Tish, considering he had saved Demi’s life and all but adopted her. Still, she knew as well as anyone that when he was in this mood, half animal and half devil, it was best to nod and lock the door. The ringmaster would do anything to protect his caravan, and in the heat of the moment, details over who was dying weren’t always sorted out comfortably.</p><p>Inside the stuffy wagon, she put a hand against the solid wood wall and wondered what Criminy would find after he’d stalked across the moor to the curious vehicle waiting in the moonlight.</p> <p>“I wish these frigging boxes had windows,” she said with a sigh. “All the fun stuff happens outside.”</p><p>.2.</p><p>When the clockwork dog took up its mechanical barking, Jacinda Harville snapped her pocket watch closed and smiled to herself. She’d heard Criminy Stain was keen as a blade, that between his magic and his madness, nothing got past the wily Bludman. She’d also heard he hated journalists above all else. Time to see which other rumors were true about the famous ringmaster.</p><p>“Hush, Brutus.”</p><p>The metal beast quieted immediately. Jacinda slipped on her favorite bracelet and adjusted her hat in the mirror firmly affixed to the wall of her conveyance. The live-in vehicle was modeled on a bus-tank but only large enough to support a Murphy bed, a small desk, and her traveling trunk. Her leather pith helmet sat smartly on red hair the color of a bludfox’s pelt, and the matching leather corset below had been made by the same artisan to straddle the line between protection and beauty. She had worn both on purpose, knowing that it would be well in character for Master Stain to send his two-headed Bludman, a wolf man, or even a venomous lizard boy to frighten her away.</p><p>The knock was sharp, and she counted to ten before walking to the door. In spite of the cool, confident nerves she’d cultivated over a series of death-defying adventures, when she saw who glared at her from the other side of the peephole, she was slightly intimidated.</p><p>So he’d come himself. Interesting.</p><p>She opened the door and looked down. “Good evening, Master Stain.”</p><p>“Who the devil are you?” He breathed in deeply, and his lip lifted in a snarl. “Besides a dead reporter.”</p><p>She tipped her helmet and forced a smile. “Jacinda Harville, adventuress and journalist, at your service.”</p><p>“If you wish to serve me, pet, best turn this monstrosity around and rumble back to town. I don’t allow the press through the turnstiles.” He looked up at her, his top hat slipping back to show wicked eyes and a smirk. “And if they do slip through, they don’t make it back out again. I mount typewriters on the wall instead of hunting trophies.”</p><p>Good thing she kept her beloved Underwood tucked away in a trunk. Infamous ringmaster Criminy Stain loomed over me like a dark angel, she thought, fingers twitching for cold metal keys, like an incubus drawn in ink on stark white paper. She’d type it up later. The Bludman was a force of nature, she’d give him that. Her late husband had been a rather dashing and leonine blond, but she’d gotten a taste for the dusky and exotic since his tragic passing in Egypt. Criminy Stain was wickedly handsome, but he made her edgy, and she tapped her hip in a distinct pattern, relaxing just a bit when Brutus settled on smoothly oiled haunches, its sensitive nose pressed against her leg.</p><p>“I think we can find a mutually beneficial arrangement, Mr. Stain.”</p><p>“As do I, Miss Harville. You turn around and leave, and I won’t kill you. It works out rather nicely for both of us.”</p><p>“It’s Mrs. I’m a widow, and you’ll find I don’t give up that easily.” She knocked a leather-gloved fist against her helmet. “Hardheaded does not begin to cover it.”</p><p>The corner of Criminy’s mouth twitched, and he looked past Jacinda’s unusual outfit of canvas, leather, and fur and into the small space beyond her. Masks of wood and bone covered the walls, along with bits of scroll and tablet and a few crumbling relics on ledges. A great striped bludzebra pelt covered much of the wood floor, and the fierce but startled face of a bludgazelle glared from above the steering wheel. Her bed was folded into the wall to reveal her worktable, and just to the side was a desk crammed with papers and . . . </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Books. Why am I constantly afflicted with uppity women and their blasted books?” The look he gave her was weary but just the tiniest bit curious, and she struggled not to crow in triumph. “What is it you want, Mrs. Harville?”</p><p>“Something only you can give me, Master Stain.”</p><p>He chuckled darkly. “Bad news, pet. I’ve a wife. And she’s a fortune-teller. And as she hasn’t killed me in my sleep, that means it’s not in the cards for us.”</p> <p>“Bit full of yourself, aren’t you? But I expected nothing less.” She looked him up and down with no attempt to hide her appreciation. “Fortunately, that’s not what I want.” His eyebrows rose in lieu of repeating his question. “I’m here for a story.”</p><p>“Unless the headline is ‘Famous Reporter’s Bones Found Near Scarborough,’ I can’t help you.”</p><p>“Ah, but you can. I’ve built my career writing about the most hidden, exciting, mysterious places in Sang. And now I want to write about something the city folk can’t begin to fathom: life in a caravan.”</p><p>“You’re funny, I’ll give you that. Good night.”</p><p>Criminy tipped his hat and turned to go, shaking his head in amusement. As a younger woman, Jacinda would have panicked. Instead, she said, “Brutus, record.” Clearing her throat, she spoke loudly and carefully. “World-renowned caravan ringmaster Criminy Stain was the most handsome man I’d ever met, and also the most dangerous. Luckily, he underestimated me, and that’s how I came to be pointing a salt-dipped arrow at his back.”</p> <p>Criminy froze, and she struggled not to laugh.</p><p>“I understand that you lie for a living, love, but you tread on dangerous ground,” he said through clenched teeth.</p><p>“Turn around and call me a liar again.”</p><p>Criminy’s hands made fists at his sides, and he spun smoothly to face her, his eyes shining in the night like an animal’s. She waggled the little crossbow just a little, letting the warm light of the conveyance twinkle against the salt clinging to the arrow’s barbed tip.</p><p>“How the hell did you manage that?” He seemed more amused than angry, which was what she’d banked on.</p><p>“I keep it hanging beside the door in case unsavory characters come knocking.”</p> <p>“And have they?”</p><p>“They have. And I have the scars to prove it.”</p><p>“And yet here you are, on my caravan’s doorstep.”</p><p>“That’s how dedicated I am to my calling, Master Stain. I intend to write a book about your caravan. I wish to interview your carnivalleros, provided they’re willing to share their stories with me. Tales, illustrations, and a very fine engraving of the dashing gent in charge. Do I have your attention?”</p><p>He grinned. “Depends on what my cut of the profits would be.”</p><p>She didn’t even have to think. “Seventy/thirty, and you pay for printing.”</p><p>“Sixty/forty, but you must be terribly flattering toward the rakish gent who runs the show. I get full editorial privilege. And I expect color illustrations. And gilt on the cover, which will be red.”</p><p>“I’d already decided as such, so I’m agreeable.”</p> <p>She stuck out her ungloved hand, which he shook firmly.</p><p>“To an exciting partnership,” she said.</p><p>“And to my rules, which you’ll follow to the letter.”</p><p>Jacinda withdrew her hand and cocked the crossbow. “I’m not overly fond of rules.”</p><p>“Consider them nonnegotiable. First, you submit to being glanced upon by my wife, Lady Letitia, and agree to leave immediately if she demands it. No one gains access to the internal workings of the caravan until she’s touched them and determined they mean us no harm.” She nodded, and he stepped up into the doorway of her wagon. Despite the crossbow between them, it felt far too close. “I protect my own, Mrs. Harville.”</p><p>“Understood.”</p><p>“Second, the carnivalleros participate of their own free will; I won’t order them or even ask them. Under no circumstances may you badger them. Several of my folk have reason to hide, and I have offered them refuge and anonymity.”</p><p>“Fair enough.”</p><p>“I’m deadly serious. I can see that you’re a woman accustomed to getting her way, but if they refuse to talk to you, it’s over. You turn this conveyance around and get back to buggering mummies, or whatever you do.”</p><p>“I may be persistent, Master Stain, but I’m not cruel. We all have our secrets.”</p><p>“That we do. And three, you pay admission every night and don’t cause me a bit of trouble.” His eyes went a shade darker. “Or else.”</p><p>She didn’t hide her grin at that. “Very generous. I agree.”</p><p>“That quickly? Blast. My reputation’s going to go to hell.”</p><p>She finally lowered her crossbow. “I promise to write you up as a fearsome, bloodthirsty scoundrel.”</p><p>“Don’t forget the pointy teeth, lass.”</p><p>When he grinned like that, it didn’t seem like a difficult task at all.</p><p>.3.</p><p>The next morning, Jacinda stepped down from the ringmaster’s wagon, pulling her glove back on and feeling very peculiar indeed. Her notebook and pen were under her arm, the large metal dog waiting for her at the bottom of the stairs. After Lady Letitia’s strange behavior, she was more intrigued than ever to finally walk among the carnivalleros.</p><p>The fortune-teller’s manners and accent had been strange, and touching the bare skin of someone who wasn’t a lover had been a puzzling experience.</p><p>“Oh,” was all the glancer had said at first.</p><p>“Oh?”</p><p>Letitia’s other hand clasped warmly around Jacinda’s. “I’m sorry. About your husband.”</p><p>Jacinda straightened her shoulders and struggled to hold in that one damnable tear that threatened to wiggle out every time she talked about Liam. “I am, too.”</p><p>Letitia leaned in closer, patting Jacinda’s hand excitedly. “It’s going to get better—I promise you. You’re going to have some amazing adventures.” An impish smile told Jacinda that the glancer was keeping secrets, but knowing her future made her queasy, so she didn’t use her uncanny ability to winkle things out of loose lips. She’d never placed much faith in fortune-tellers, but if Letitia’s blessing was necessary for her admission to the caravan, she was willing to undergo the glancer’s scrutiny. And pity.</p><p>“Does that mean I can write the book?”</p><p>Letitia grinned. “Of course. Don’t worry about Criminy and his threats. He’s just a puppy, really.”</p><p>One eyebrow shot up as Jacinda thought about the ringmaster’s fangs. “A puppy?”</p><p>“A wolf puppy, maybe.”</p><p>“Then I owe you my thanks, Lady Letitia.”</p><p>“Please, honey. Call me Tish. And promise me you’ll be careful.”</p><p>The older woman’s nervous concern made Jacinda really study her. Fine lines webbed Tish’s eyes, and strands of white threaded her dark hair. The woman’s energy, strangely accented voice, and entire mien were of a younger woman, and yet she had to be at least ten years older than Jacinda. The outside did not match the inside. Something odd was going on here.</p><p>“So what’s your story, Tish?”</p><p>A coy smile told Jacinda she was about to get the brush-off. “Let’s just say my story didn’t really start until I got to the caravan. Besides, fortune-tellers are always more intriguing when they’re mysterious. Now, forget about little old me and go talk to the carnivalleros.”</p><p>With the glancer’s blessing, Jacinda was free to explore the caravan, yet she didn’t know where to start. Each lacquered wagon was painted a different color, most of them with beautifully calligraphed words proclaiming the talents of the denizens within. But no one was walking around or practicing in the weak morning sunlight, so Jacinda tapped her hip and began to explore the perimeter of the circle of boxcars with the mechanical dog clicking at her heels. It didn’t take long before she realized where all the action was: inside the circle, beyond the large clockwork animals that stood in the spaces between cars. A soaring patchwork tent, ragged but beautiful and open on the sides, was the source of the laughter and burbling voices that carried over the wind. It reminded her of the desert caravans she’d once traveled with at Liam’s side. She froze, seeing beyond the clockwork kangaroo to a past she couldn’t forget and couldn’t escape, to words shouted in anger and a heavy thump and the sudden silence, after.</p><p>“Can’t find your way in, eh?”</p><p>Jacinda turned to the aggressively dressed girl who had materialized by her side. Black-rimmed eyes hooded with glittering blue shadow glared back at her. In her younger days, the journalist would have felt the sting of otherness, of knowing that she didn’t belong among the brightly painted circus folk. Now the difference between her own serviceable adventuring costume and the girl’s lurid pink and green getup only made Jacinda feel more powerful. She didn’t need paint and gimmicks to get what she needed.</p><p>“No, I’m afraid I’m quite new to all this.”</p><p>The girl’s smile curled like a cat’s mouth barely containing feathers. “Always glad to help the new girls. I’m Emerlie, by the by. Tightrope walker. I’ll show you the way, shall I?” She took off, and Jacinda had no choice but to follow, her eyes dancing with spots from the vibrant acid green of Emerlie’s tutu.</p><p>“So you’re the tightrope girl?”</p><p>The tiny hat bobbed. “Tightrope, unicycle, juggling, bit of this and that. Been with the caravan forever. What’s your act?”</p><p>“Oh, nothing so impressive. I’m a writer. A journalist, to be exact.”</p><p>Emerlie dropped back, her expression avid. “You here to talk to Marco, then?”</p><p>“Marco?”</p><p>The girl’s shoulders shivered in excitement. “You don’t know? The new knife thrower—Marco Taresque? He’s a murderer.” But she didn’t look disappointed by the fact. Far from it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“A murderer?”</p><p>“That’s what they say down south. Story goes, him and his lovely young assistant disappeared one night, and all they found the next morning was a wagon splattered in blood.”</p><p>“Interesting.” Jacinda opened her notebook and began scribbling. “Do you know Mr. Taresque personally?”</p> <p>Emerlie gave a sly wink over her shoulder. “We don’t talk much. But he knows how to stick a dagger, I’ll give him that.”</p><p>“Is that supposed to be a euphemism?”</p><p>The girl spun around. “A what, now?”</p><p>“Are you implying that you’ve bedded this murderous knife thrower?” Jacinda held her pen poised over the page expectantly.</p><p>Emerlie sneered. “You calling me a liar?”</p> <p>“I’m not calling you anything. But I have a reputation for printing the truth, not wishful thinking.”</p><p>“It’s not wishful!”</p><p>Jacinda sighed and closed her notebook. “The only thing the knife thrower’s ever stuck you with was a mouthful of disappointment.” The look of outrage on Emerlie’s face was enough to make Jacinda giggle behind her glove.</p><p>“Find him yourself, then, cow!”</p><p>The girl flounced away, her tiny top hat bobbing over pin-curled blond hair, leaving Jacinda alone before a clockwork bird in the space between two wagons. Jacinda coughed down the rest of her giggles. Even if Emerlie was the reticule of gossip in the caravan, gently flattering half-truths out of the little ninny would have been immensely annoying, compared with going directly to the source. And now she had a lead on the sort of juicy story every journalist dreamed of nailing.</p><p>Jacinda glanced up at the awkwardly dancing bird. As she ducked to move past it and into the tented space beyond, the machine’s head shot around, blocking her way. Shoving it did nothing to discourage it, and no matter which way she moved, it wouldn’t let her pass. When a small syringe appeared in its beak, she decided she’d had enough and removed a small metal device from the bag at her belt.</p> <p>“That’s enough out of you.”</p><p>Holding the gadget as close to the bird as she dared, she pushed a red button, and a blue spark arced to the bird’s copper body and raced over its surface like a wave devouring sand. The thing went still, a slender curl of smoke rising from its eye. Tucking the disruptor back into her bag and rucking up her skirt, she slid under the bird’s now-still neck and entered the circle beyond the wagons. Useful things, disruptors.</p><p>Laughter, murmurs, and the occasional thunk carried from under the patchwork tent. Not wanting to encroach on what was clearly a personal space, Jacinda sent Brutus back to her wagon and kept to the circle of weak sunlight just beyond the tent’s shadow, skirting the wagons as she navigated around the spaces set up for practice or work. The strong man nodded to her warily, a two-headed Bludman leered at her, and the lizard boy raised an appreciative eye from where he snoozed in a lone sunbeam that fell through a rip in the tent. She nodded politely but didn’t stop to begin her interviews. She was too avid to reach the source of the repetitive thunking noise. All she knew about this Marco Taresque was that he was a knife thrower, a possible murderer, and someone with whom Emerlie desperately wanted to be physically linked, and that combination intrigued her in more ways than one.</p><p>When she walked up, the subject of her inquiry was pulling a bouquet of knives from a scarred wooden target painted in rings of red and white. She had a moment to study him before he noticed her, and she realized immediately why Emerlie had been so very keen. Marco Taresque was a damn fine specimen of a man, dark and angular and as sharp as his knives, with thick, wavy hair that trailed down his back like brambles, making him seem half wild. She couldn’t help staring, willing him to face her while still enjoying the elegant but powerful movement of his shoulders and arms as he unconsciously went through his routine.</p><p>Like most men, he wore a white shirt that had seen better days, but the sleeves were more fitted, while the collar was uncharacteristically loose, especially when so many Bludmen were near to hand. He wasn’t wearing a coat, which was expected for such an unusually warm day. But his midnight-blue waistcoat was of a cut she’d never seen before, thick and tight, with boning similar to that of a lady’s corset and lacing up the back. It sharpened the lines of an already sharp man, setting off the wideness of his shoulders and the way his shirt stretched across well-muscled arms. As he pulled the knives from the wood, he slid them one by one into invisible slots in his vest, where their black handles disappeared against the velvety fabric. She counted twelve, six on each side, before the target was cleared. The daggerman spun around, saw her watching, and froze.</p><p>Feeling the full strength of his violet eyes, she froze, too. For a moment, they stood that way, and Jacinda was wildly aware that he could have reached down and stuck her with every knife in his vest before she could spin and run away. She felt like the target, like a solid thing, painted and waiting to be pierced. Despite a leather corset designed to repel attacks, she had never felt so vulnerable, not in seven years of traveling the most removed, dangerous cities of Sang. She imagined a black dagger flipping end over end, as quick as a bird, to strike her directly in the heart with a wooden thunk.</p><p>And then he smiled, a quick, wry thing that was gone instantly, replaced by a dark scowl.</p><p>“I should have known you’d find me.”</p> <p>His voice was gravelly but musical, with an accent at once unfamiliar and enticing, and his eyes settled on the notebook and pen held, limp, in her hands. She dipped her head in acknowledgment but not acquiescence.</p><p>“You’ve heard of me, then, Mr. Taresque?”</p><p>Looking down, he ran a hand through his hair. He walked toward her, every step deliberate, boots crunching on dead grass already trampled. As he passed close enough for her to feel the air stir from his sleeve, he said, “No. But I know your type. You’re not the first. You’ll not be the last.”</p><p>He kept walking, and as she’d promised to obey Criminy’s rules, she had no choice but to watch him go. His snug-fitting trousers had fine pinstripes that disappeared into high black boots. The man bristled with so many knives she wasn’t sure how he sat without cutting himself to ribbons.</p><p>In her years first as a student, then as a journalist’s assistant, then, most recently, as a solitary adventurer, she’d met thousands of men. Heroes, villains, brigands, jackals, shamans, monsters, soldiers, weak-chinned milksops, and even uncivilized madmen. But the strange push and pull of Marco Taresque was a first for her. Aloof but magnetic. Wild but carefully contained. Dangerous to a fault but in no way overtly threatening. Dark but oh so appealing. As soon as her feet caught up with her heart, she was following at his heels, pen and notebook in hand, hoping Criminy didn’t have spies lurking about.</p><p>“Mr. Taresque, would you be willing to tell me your story?”</p><p>He didn’t turn. Didn’t break stride. Said nothing.</p><p>“It’s not just you, of course. I didn’t come here to find you personally. I’m writing a book on the caravan. With Criminy Stain’s blessing.”</p><p>Again, no response. Just steady, confident, angry steps, faster and faster so that she was almost jogging to keep up. She was starting to feel desperate and resorted to a journalist’s last resort: accusation.</p><p>“I’ve heard that you’re dangerous. That there was blood everywhere.”</p><p>He had reached the clockwork bird she’d recently deactivated. A begoggled artificer and a woman in a frumpy coat were fussing with the wires in an open compartment, arguing over the cause of the automaton’s malfunction as he held a screwdriver and she held a book. Without a word, Marco took two fast steps, planted a boot on the man’s back, and catapulted himself over the bird.</p><p>“Dammit, man! These are fragile instruments,” the artificer growled, but Marco ignored him and kept walking.</p><p>“Oh, Henry. That’s your best vest,” the woman said, fussing at the bootprint.</p><p>Jacinda tried to get around the pair and the collection of tools, books, and wires arrayed on the ground, but there was no clear path, unless she went over, which even she wouldn’t risk in such voluminous skirts.</p><p>“Are you hiding something, Marco Taresque?” she shouted at his rapidly disappearing back.</p><p>He stopped and turned, hands on hips bristling with knives. Did she imagine the smile tugging at his lips?</p><p>“Of course I am!” he shouted back.</p><p>And then he was gone.</p><p>.4.</p><p>“So what do you know about Marco Taresque?”</p><p>The three girls around the table giggled behind their hands, telling Jacinda exactly what she wanted to know: he’d had absolutely nothing to do with any of them.</p><p>“He just showed up one night,” the bearded girl breathed, woolly cheeks in her gloved hands. “Materialized out of the smoke like he was part of the fire.”</p><p>“Everything was smoky that night, Abi. He just happened to walk out at exactly the right moment.” Demi rolled her eyes. “And honestly, he showed up that afternoon. Marched across the moor like anyone else who’s vaguely suicidal. You just didn’t see him because you were asleep in your wagon. It was far less dramatic then.” But the girl’s eyes went misty anyway, betraying her feelings about the mysterious stranger.</p><p>“Master Crim said he’s dangerous, and that’s good enough for me.” Cherie shook her blond curls, her mouth in a prim line. “Honestly, he looks like a wastrel. Like he did what the papers say he did.”</p><p>“Oh, he was in the papers?” Jacinda asked.</p><p>Abi leaned close, her beard wagging excitedly and dipping into her oatmeal. “Master Stain don’t like us to read about the cities, but the audience drops a paper every now and then. There was a drawing, and there’s a price on his head.”</p><p>“Down south, they call him the Deadly Daggerman,” Cherie whispered.</p><p>“I’d like to see that story. Do you have it still?”</p><p>Demi blushed. “Crim found us with it and took it away. Said it was just another case of a money-grubbing journalist making a sensation out of hearsay and ruining a man’s life in the process.” She raised her eyebrows and stared at Jacinda as if daring her to continue the line of questioning. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jacinda knew when an interview was headed downhill. She would find a better time to talk to the girls about their own stories when they weren’t on the offensive—or packed together in a giggling gaggle.</p><p>With a warm, professional smile, she stood, tucking her notebook under her arm without a single word written on the page. This interview had been doomed from the start, but she had learned more than she anticipated. Now she knew why Marco wouldn’t talk to her. And she also knew that he hadn’t been breaking hearts among the young and easily breakable. He went up a notch in her estimation, considering how very easily he could have preyed upon these moon-eyed girls. It shouldn’t have mattered, as she was simply a journalist gathering facts. And yet . . . it mattered.</p><p>“Thank you all so very much for your time.”</p> <p>“But what do you know about Marco?” Demi asked, her eyes almost pleading. “Did he really do it?”</p><p>Jacinda reached out to pat the contortionist on the shoulder, forgetting for a moment that the girl was bludded and seeing only a tender young soul filled with longing, as she herself had once been. “That’s what I’m going to find out, dear,” she said.</p><p>She moved across the dining wagon to a booth shared by the bookish couple she recognized from her earlier encounter with the clockwork bird. They sat hip-to-hip on the same side, their heads together as they shared a joke. She cleared her throat, and they both looked up, suddenly going silent.</p><p>“Would you mind if I asked you a few questions?” She held out her notebook and pen with an inviting smile. Without a word, the man slid out of the booth, tipped his hat farther over his eyes, and disappeared.</p><p>“You’ll have to forgive Mr. Murdoch,” the lady said, moving over as if trying to absorb whatever warmth he’d left behind. “He’s very shy of strangers.”</p> <p>“And I’m as strange as they come.” Jacinda picked the woman’s looks apart with professional interest, noting her pretty face, owlish costume, shabby gloves, and guarded copper-colored eyes. “Are you part of the circus?”</p><p>The woman chuckled softly to herself. “I don’t look much like a caravan act, do I? Not at all bright and flashy. I run the butterfly circus, you see. And Mr. Murdoch is the caravan’s artificer, who invented my equipment and all the clockworks. I’m Imogen, by the way.”</p><p>“Jacinda Harville.”</p><p>“And you’re a reporter?”</p><p>“A journalist, yes. I’m here to write a book about the caravan.”</p><p>“Oh, that sounds fascinating. The city folk will just gobble it up, won’t they?”</p> <p>Jacinda grinned. “That’s what I’m hoping. Are you from the city, then?”</p><p>Imogen blushed and looked down. “Yes. London. And it was just as dreary as the penny dreadfuls make it sound. I’d be glad to show you the clever intricacies of my butterfly circus sometime, if that will help your story.”</p><p>A flutter of color caught Jacinda’s eye, and she noticed a small orange butterfly slowly flapping dotted wings from its perch on Imogen’s hat. Her breath caught.</p><p>“Is that . . . real?”</p><p>Imogen chuckled. “Of course not. Everyone knows butterflies are extinct. Mr. Murdoch is very talented, you know, with his machines.”</p><p>Jacinda’s face didn’t change, as she knew how to mask her emotions—unlike Imogen, who couldn’t lie worth a damn. The keen-eyed journalist would have bet everything in her conveyance that the butterfly on her companion’s head was indeed real, but judging by the way Imogen was wringing her hands and glancing nervously at Jacinda’s notebook, she would have to change course soon or lose the meek woman’s trust forever.</p><p>“What I’m really curious about is the new knife thrower. Do you know anything about him?”</p><p>Imogen sucked air through her teeth. “He’s a bit of an enigma, that one.”</p> <p>“Have you seen the papers?”</p><p>With a nod, Imogen reached to the bench beside her skirt and produced a stack of ragged newspapers, carefully folded. She shuffled through them before sliding yellowed paper across the table. “I get the one from London, although it arrives terribly late. I believe the Wanted poster is in this edition, although there’s very little actual fact. Marco and his assistant apparently disappeared on the same night, leaving behind only a blood-spattered wagon. He surfaced here, in the caravan. But no one has seen her.”</p><p>“Have you spoken to him?” Jacinda’s pen tapped against the paper.</p><p>Across the booth, Imogen ducked her head and shrugged into herself. “I spend most of my time with Mr. Murdoch. Or reading. I’ve seen Marco throw his knives. But I know almost nothing of the man himself.” She looked around the wagon, taking in two dozen people of all shapes, sizes, and species. “I suppose I should be more concerned about having a suspected murderer among us. But in my short time here, I’ve come to understand that Criminy and Letitia wouldn’t let anyone in who would bring us to harm.” She looked closer at Jacinda, perking up with curiosity. “Has she glanced on you, perchance?”</p><p>Jacinda’s skin prickled, remembering the warm, dry feel of Letitia’s palm against hers, the fingers gripping tightly as a little ripple of something passed between them.</p><p>Before she could speak, Imogen chuckled softly and said, “Of course she has, or else they’d never have allowed you in to question us. I’m sorry we can’t be of more help, Hen—I mean, Mr. Murdoch and me. Good luck.”</p><p>As Imogen swept her dishes off the table and left, Jacinda looked down at the creased old paper and unfolded it. It was the London Gazette, one of her favorites. She’d made a habit of picking it up in major cities around the world during her travels. Skimming went against her nature, but she would save her in-depth reading for another time. Instead, she flipped through until she found the Wanted poster, only a quarter of a page and clearly done by a sensationalist hack. The image looked nothing like Marco Taresque as she’d seen him.</p><p>The drawing showed a devil of a man with a cleaver in his hand, dripping black blood.</p><p>WANTED: THE DEADLY DAGGERMAN</p><p>In conjunction with the underhanded disappearance of one Petra Incanta on 22 February 1906, being a petite woman with dark hair and the knife thrower’s ill-fated assistant. Deliver to London Coppers dead or alive. Reward ten silvers.</p><p>And that was all. It didn’t even mention his name, which explained how he could perform here without being dragged off by a lynch mob. She pored over the periodical, but there was no reporting, no quotes from family, friends, or Coppers. Just the poster, sure to induce fear in the easily frightened children of London. Jacinda folded the paper and snorted. Idiots, all of them, and sloppy reporting to boot.</p><p>Journalism was more than work to her—it was a passion, a calling, one that her husband had died pursuing by her side. Although she was outgoing and accustomed to learning quickly the customs of a given society, she missed having someone insightful with whom to discuss the day’s findings over a cup of tea. All the people she had met so far at Criminy Stain’s caravan had been kind and welcoming, if not actually helpful. But she missed Liam more than ever, the way they had worked so intuitively as a team to unearth secrets and treasures and stories. He would have loved the caravan.</p><p>Try as she might, there were some things that men would only tell other men, and her late husband had been adept at sidling in with a cigar or a bottle of brandy. But he was gone now, and she was alone, and she wasn’t giving up, even if this was one story that was going to have to come straight from the bludmare’s mouth, as they said.</p><p>Standing, she took a last look around the dining car. Marco wasn’t here, which meant the story wasn’t here. Stuffing an apple into her pocket, she nodded to herself and made for the door and the weak sunshine beyond. These days, the next story was the only thing that kept her going.</p><p>This time, when she approached the clockwork bird, she found Mr. Murdoch blocking her path. She could barely see his eyes through the thick goggles that hid the rest of his face.</p><p>He cocked his head at her as if she’d forgotten her shirt. “Lose your mutt?” he asked.</p><p>“Your clockworks appear to be the only ones that don’t require recharging. Brutus sleeps more than I do.” She pulled out her disruptor, and he held up a hand covered in a thick leather glove.</p><p>“Put that device back where it goes, madam. I can’t have you mucking about, destroying my work.”</p><p>She waved the disruptor under his nose, her finger hovering over the red button. “How do I get by, then?”</p><p>He harrumphed. “I suppose we’re stuck with you for a while, at least until you finish your blasted tell-all book. Look, they’re guards. You see? Keep the rabble out of our private space. You want in, you walk up to this clockwork—this bird only—and say, ‘posthumous orangutan grotesque.’ He’ll freeze for a minute, and you can squeeze through. Do you understand, or has your career choice corrupted and shriveled your brain?”</p><p>At his three peculiar words, the bird stopped its strange dance, freezing in place. Jacinda leaned closer, listening for the telltale ticking of machinery. It was faint, and Mr. Murdoch smirked at her, waiting for the questions she was sure to ask and he was sure to dodge. Instead, she struggled to hold her tongue until the bird began to gyrate again.</p><p>“Posthumous orangutan grotesque,” she said clearly, and it froze. She nodded and ducked around its tail. “Thank you, Mr. Murdoch.”</p><p>“You’re not going to interrogate me?” he asked. “I was fully prepared to evade you.”</p><p>She looked him up and down from behind the mechanical bird, taking in the hat, the goggles, the layers of clothes, the leather mask that hid much of his face. “I know a closed book when I see one.”</p><p>Leaving Mr. Murdoch chuckling in her wake, she trod the same path she’d taken yesterday toward the heavy thunking of blades in wood. There was a steady, powerful laziness to the sound. Not rushed. Not unsure. Perfectly measured, every time. Along the way, she greeted the carnivalleros she’d met by name, introduced herself to others. She shook hands, laughed at jokes, and avowed she couldn’t wait to learn everyone’s story. And it was true, which made them like her even more. She’d begun her career as Liam’s assistant on a desert caravan and was proud of her knack for fitting in with new cultures and people, no matter how bizarre they might at first appear. It seemed the clockwork caravan would also soon be under her spell. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As a little girl, she’d been a voracious reader and daydreamer. But she’d never guessed what would happen at age eighteen when she enrolled in a cultural anthropology course, much against her parents’ wishes. On the first day, she’d fallen in love—with Egypt and the dashing young professor. After she had seduced Liam with her body and her brain, he had seduced her with the wide, wild world beyond academia. He never would have thought to study something as geographically available as caravans in Sangland. And yet Jacinda was fascinated by the people here, curious about all their histories.</p><p>But the enigma came first. And the enigma in question was watching her walk toward him as if trying to decide whether to run away or swallow her whole.</p><p>The daggerman’s posture was almost smug, the curve of his back suggesting a sleek jungle cat, asleep with one eye open. His dark hair was pulled back today, except for the bits that fluttered around his face. A beard shaded his cheeks and dusted his upper lip, enhancing the cut of his jaw. At first, Jacinda thought he used kohl on his eyes as the Bludmen did, but as she stepped closer and stopped about ten feet away, she thought it must be dark eyelashes. But then—no, it was both, the bastard. He blinked, long and slow, his arm never stopping as it flicked knives lazily at a spinning target. A human shape was painted over the red and white bull’s-eye, which spun with the nearly silent ticking she’d come to associate with Mr. Murdoch’s clockwork machinery.</p> <p>“See something you like?” he asked.</p><p>“The surface isn’t what intrigues me, Mr. Taresque. It’s the truth I’m looking for.”</p><p>He chuckled and flicked his eyes at the bull’s-eye. Faster than Jacinda could follow, a knife thunked into the target, right in the middle of the outlined figure. Right where its heart would be.</p><p>“The truth. You want the truth?” She nodded, and he jerked his chin toward the knife sunk in the wood. “Some things are better left buried, don’t you think?”</p><p>Jacinda knew well enough when someone was trying to scare her. With a toss of her hair, she marched to the target, her boots crunching over the broken blades of grass. Wrapping both of her gloved hands around the knife’s handle, she managed to tug it out as neatly as possible, considering the blasted thing was rotating slowly with the wood. She held it up, testing its weight, her fingers carefully pinching the leaf-shaped blade.</p> <p>Marco grinned at her, hands on his hips. “Don’t cut yourself, sweetness.”</p><p>Jacinda snorted, raised her arm, and let the knife fly in a black and silver blur to quiver in the ground a few inches from Marco’s boot. He didn’t move. “Even I know throwing knives aren’t sharp, Mr. Taresque.”</p><p>His grin widened in appreciation and surprise, and Jacinda’s cheeks flushed with sudden heat. “The tips are sharp enough. If you threw with any spirit, you could strike me down from there.”</p><p>Tension rose as they considered each other. Jacinda felt rooted to the earth and yet as if she might fly free at any moment. His violet eyes went a shade darker, which didn’t seem possible. Finally, Jacinda winked, knowing he would go on staring forever, trying to impose his will on her. Let him try. She knew his type well enough. She walked to him, then yanked the knife from the dirt and wiped it on the folds of her brown skirt. Holding it out, she risked looking at his face again, suspecting he would think the dimple in her cheek silly and frivolous. Not that she cared.</p><p>“You say I could strike you down, and yet you didn’t budge.”</p><p>He chuckled. “I never budge.”</p> <p>“And I do everything with spirit. I want an interview.”</p><p>“I don’t.” He took the knife from her glove, his kid-swathed fingertips dragging over the crease of her palm—the love line, as an old gypsy woman had once told her. Jacinda shivered in spite of herself.</p><p>Her palm burning, she pulled out her notebook and pen. “I have influence. The truth could exonerate you. Surely you’d like the world to know you’re innocent?”</p><p>Marco stepped closer as he slipped the knife back into a loop on his vest with a whisper of metal on cloth, a strangely intimate sound. From far away, he’d seemed a normal-sized man, but up close, the tips of his blades winking inches away from her body, he seemed large and solid and made of rocks and vines and wildness barely held together by his indigo waistcoat.</p><p>“What do I care about the world so long as I know the truth myself?” he said, barely loudly enough for her to hear. It seemed impossible, that his voice could be nothing more than a breath, a warm breeze on her jaw.</p><p>She swallowed hard. “You would have freedom. Your good name.”</p><p>His glove cupped her cheek, his thumb stroking hot over her jaw as she struggled to hold still. “I always have freedom. I don’t need a good name to know who I am. You, on the other hand . . .”</p><p>He released her, but she was frozen in place, chin up where he’d last held it. He walked around her, a few simple steps, but it was as if the polarity of the planet reversed and she was suddenly the moon, something cold and foreign and powerful in itself. Something caught in uncontrollable orbit.</p> <p>“I know who I am, thank you very much.”</p><p>“But you’re not free.”</p><p>She shook her head, her mouth open in surprise. “Really?”</p><p>His eyes were oddly soulful, gazing into hers, belying a peculiar sort of sorrow she didn’t care to contemplate. “You think you’re free. But something holds you back.”</p><p>“Do not toy with me, Mr. Taresque. I’m a widow, not one of those giddy girls by the fire, mooning at you. I know what you are.”</p><p>“You think I did it, then?” His voice changed as his teeth clenched, and he circled away from her, their connection broken. He pulled the knives from the target one by one, so quickly and roughly that even though she knew there was no danger, she expected to see blood. Jacinda could feel that she was losing him, would have to reel him back in with sure hands.</p><p>“I think you’re hiding something. And I want you to tell me what it is. And why.”</p><p>He spun, and his fine eyes narrowed at her, taking in her figure, her face. If those attributes would weigh in her favor, she would use them, and gladly. She let one corner of her mouth play up, slow and sly, her eyelashes lowering just a little, just enough.</p><p>But instead of softening, he stiffened, cocking his head. “Is this a game to you?”</p><p>“A game?”</p><p>“Are you as brash as you pretend to be? Or is it part of your little act?”</p><p>“My act?”</p><p>He grinned. “You’re echoing, sweetness. Might want to work on that.”</p><p>Jacinda took a deep breath, trying to focus. He unnerved her, as much as she hated to admit it. “I’m not scared of you, Mr. Taresque. The truth is not a game. And I wouldn’t say I’m brash. Simply that I don’t base my decisions on fear.”</p><p>That earned her a wide, toothy smile that made her nervous. And rightly so, considering what happened next. “So prove it.”</p><p>And he reached into his vest and held out a playing card.</p><p>.5.</p><p>Jacinda took the card from between his fingers, careful not to touch his black suede glove.</p><p>“The Queen of Hearts? Really?”</p><p>“Really.”</p><p>She held it up to the light. It was an old card, the image in sepia-tinged tones that might very well have been painted by hand. “There’s a knife slash in this card.”</p><p>“Let’s add another one.”</p><p>Her body stiffened before her mind caught up. “Exactly what are you proposing, Mr. Taresque?”</p><p>“A dare.”</p><p>She rolled her eyes. “Elucidate.”</p><p>He chuckled. “Let’s make it simple. I strap you to the target. You hold this card out, as close to or as far from your body as you wish. I’ll throw one knife. If I hit the card, you go back to wherever you came from and leave me the hell alone. If I miss . . .”</p><p>“Yes?”</p><p>“Well, if I kill you, I suppose I’m on the run again.”</p><p>She shivered but swatted him with her notebook to cover the true frisson of fear. “If you miss?”</p><p>“I’ll answer one question with complete honesty.”</p><p>“Only one?”</p><p>That grin again. “I have fifty-one more cards, if you find you like the game. Should be enough for your book.”</p><p>Jacinda turned the card over in her hands. One knife-wide slice through it. Not a drop of blood, as carefully as she looked, and the paper was old and unwaxed, so she would have noticed. Her eyes flicked to the target, where a single gash of knife-struck wood marred the black-painted figure from his throw just moments ago. The bull’s-eye still spun lazily, a constellation of scars outlining a body she could almost imagine as her own, if naked and corseted, the legs delicately spread and the arms up in what almost seemed triumph. Or surrender.</p><p>She shook her head. That was ridiculous.</p><p>“What if I walk away right now?”</p><p>“Then you’ll never know the truth.”</p><p>She walked past him in a huff, the card held in one hand, the edges of the paper cutting into her fingers.</p><p>“But I don’t think you’re going to walk away, sweetness.”</p><p>And that’s when she stopped.</p><p>“Consider it carefully. This is your last chance.”</p><p>His voice was mocking, taunting, luring. And beneath all the posturing, the cruelty, the danger, there was something else. Pleading? So low, so deep, that even he surely didn’t know it was there.</p><p>Could it be possible that he wanted to tell her the truth as much as she wanted to hear it? Even if it was a confession of guilt? But surely if Lady Letitia had seen her dying in a pool of blood in the carnival, she wouldn’t have allowed Jacinda to stay. That had to mean it was safe.</p><p>She closed her eyes and took a deep breath, her ribs creaking against her corset as she focused her will. With a cold, slow smile, she held out the playing card between two fingers. “Then let’s play, Mr. Taresque.”</p><p>“That’s the second part of the deal. First, you have to call me Marco.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Where do you want me, Marco?”</p><p>A lesser man would have betrayed himself at such bold speech. Swallowed hard, gasped, at least allowed his eyes to widen the tiniest bit. But not Marco Taresque. Not the Deadly Daggerman. No, he just raised one eyebrow and grinned. “Right over the silhouette, sweetness. I’ll strap you in as gently as I can.”</p><p>That was the first time she noticed the narrow platforms at the base of each painted leg and the leather straps at each wrist. Fear trickled down her veins, starting with numbness in her hands and feet and a chill, heavy feeling that settled deep in her belly. But she wouldn’t show Marco that. He was watching her so very carefully for any sign of weakness, for the smallest betrayal of her determination. After disparaging the flibbertigibbets of the caravan, she wouldn’t give him the satisfaction of thinking her a coward or a lesser woman.</p> <p>After a second’s consideration, she took the card in her left hand and held out her right. “A warrior in the forests of Almanica once dared me to something similar involving a tomahawk,” she murmured, low and dulcet.</p><p>“And you took the dare?”</p><p>“I did. I got a great story out of it. And a tattoo in a very personal area.”</p><p>He ignored her baiting and took her hand to help her step up onto the platform, her skirts crushed between her stocking-clad calves and the painted wood. The abrupt change in her posture forced her chest out, knocking it into his arm. He absorbed the blow with a gratified grunt but neglected to make any comment. His fingers skimmed along her left arm and trailed over her bracelet before firmly holding her wrist against the wood and strapping it down gently. She understood then that he wasn’t a man who allowed second chances, that the die was cast, and herself along with it. And she was the kind of woman who preferred it that way, so she tested the leather and nodded her approval.</p><p>“Why do you wear no gloves?” he asked. “Do you wish to be eaten?”</p> <p>“I’ve been to the far corners of the globe, and it was never the sight of my bare flesh that earned me a brush with the stewpot. It was usually ignorance.”</p><p>“Or perhaps you simply overestimate a creature’s self-control.”</p><p>He stroked the crease down the palm of her trapped hand, and she couldn’t stop herself from shivering.</p><p>“But what of the card?” Her right arm seemed oddly heavy and useless, the card suddenly flimsy in her grasp.</p><p>His fingers grazed her shoulder, indicating worn, curved prongs of wood a scant inch above her jacket. “These notches will keep you in place. Hold the card as close as you wish.”</p><p>As Marco’s hands caught the ankles of her boots, the breath rushed out of her with a whoosh, and she already felt as if she were spinning. What was she supposed to do with the card again? Did she want him to hit it—or did she want him to miss? The terms of the deal had been . . . but no. It was forgotten. No heat passed from his gloves to the thick leather of her boots, sewn thick to ward off the biting creatures of the jungle, but still the warmth crept up her legs as he fastened the leather straps with almost impersonal strength. She’d had men since Liam, sure. But none of them had left her breathless, not before or after the act. And here she was, quivering like a girl under the knife-wielding hands of a supposed murderer.</p> <p>What in heaven had she gotten herself into? She was just here to write a book. It should have been safe. But, suddenly, it wasn’t.</p><p>Marco knelt at her feet, and she looked down on gleaming hair the color of oiled teak.</p><p>“What are you doing?”</p><p>He looked up, grinning, showing a handful of steel pins. “To hold down your skirts,” Marco said, his voice barely a murmur. Jacinda felt the flush travel all the way up her body, lingering in places like puddled rainwater. “Keep things decent.”</p><p>At the word “decent,” her head jerked up, and she scanned the area around the tent. She had forgotten that anyone else existed. The lizard boy was draped over his pillows nearby, but otherwise, everyone was engrossed in his or her own work. That was good. She felt silly, strapped spread-eagle to the target, and that was before he stepped back and gave her a better look at the long line of knives snaking down his body as naturally as stripes on a bludzebra.</p><p>Being pinned down was dangerous enough before she remembered the reason for it.</p><p>“Do you ever miss, Marco?”</p><p>Saying his name was like blowing a kiss, the way it made her purse her lips together. Maybe that was why she’d resisted saying it for so long. Now that she was strapped onto the round target, her boots snug against the platforms, he had to look up to meet her eyes, and what she saw there made her breathless. Amused satisfaction, complete confidence, and an indolent, languid slowness that spoke of long patience. He liked her exactly where she was. The way his gaze raked her with open admiration told her plainly that she was but an object, and the way her breath sped up told her plainly that she didn’t mind being objectified.</p> <p>“Is that your question? Because you’ll have to wait until I’ve taken my shot if you want an answer.”</p><p>“That’s not my question.” The words tumbled out too fast, and she struggled to maintain her professional calm. She’d stood up to kings and shamans and shambling corpses. Why was this man disarming her so totally?</p><p>Oh, right. The knives. And the leather straps. Not to mention the curling lips. And the eyelashes. She couldn’t forget those.</p><p>He winked as if he knew exactly what she was thinking and moved behind the target. Turning her head, she found only wood. The leather creaked as she unconsciously tested her bonds, feeling vulnerable now that she couldn’t see him.</p><p>“Get ready.”</p><p>So smoothly she barely heard it, the motor started, and the bull’s-eye began to turn, her body with it. Jacinda had been hung upside down by booby traps and even suspended once by vines over a cauldron of boiling water, but she’d never felt this strange, controlled, secure, mechanical movement. It was so very oddly smooth, perfectly balanced. He’d strapped her down so carefully that as she turned fully upside down, the only real change in her person was a cascading of red curls into her eyes and the cold kiss of metal as her pocket watch fell out of her jacket. With a swift intimacy, as soon as she was right-side up again, Marco dropped it down the throat of her blouse and tightly between her chest and her corset—an intimate gesture, but a necessary one, if she wished to keep the metal from smacking her in the face with each revolution. Her breath caught at the intimacy of the touch. Not until he had finished tucking her hair behind her ear did she remember to breathe again, and by then, she was upside down.</p><p>“The card, sweetness.”</p><p>Oh. She had forgotten utterly that one arm was free, clutching the card against her chest in a white-knuckled grip. With a shaking hand, she pinched just the corner of the card, holding it against the painted wood as far from her face as she could allow without looking like a complete coward.</p><p>Marco nodded and walked to the exact place she’d found him standing earlier, marked by a muddy, trampled spot in the grass. The lazy smile had never left him, but it deepened as he regarded her, reaching his eyes with pointed heat. His hand almost caressed the knives down his side, and he didn’t look down as he drew one from its loop and weighed it in his palm, turning it this way and that. Jacinda watched, right-side up and upside down and sideways, unsure whether the spinning was all in her head or in the clockwork revolutions of the bull’s-eye.</p><p>“Are you ready?” he asked.</p><p>“Always.”</p><p>“Don’t move, sweetness.”</p><p>She held her breath and willed the card to stop twitching with the beating of her heart. Marco narrowed his eyes, kissed the dagger with solemn reverence, and waited until she was perfectly right-side up. Then his arm flicked forward in a blur of motion.</p><p>She closed her eyes at the heavy thunk. She didn’t feel pain or impact. But perhaps one wouldn’t feel a knife, especially if the strike were fatal? She’d never been stabbed before.</p><p>“You can look now. Cheater.”</p><p>The amusement in his voice told her she was unhurt, because surely even a man as contained and unflappable as Marco Taresque, a man who could walk away from a blood-spattered murder scene, wouldn’t stand in the open air of a public place and watch her scream after using that tone.</p><p>It took great control to unscrew her eyelids and look down.</p><p>The knife was stuck in the painted wood, right where the card had been.</p><p>The card lay on the ground, hearts up.</p><p>As she stared at the queen’s smug smile, the machine stopped, and he stepped out from behind it, suddenly very close. She was turned sideways, suspended only by the leather straps on one wrist and around her waist. Marco knelt and held the card out to show her.</p><p>“I hit the place where the card would have been. Hit it perfectly. But you, my dear, dropped the card.”</p><p>She smiled, coyly, feeling strangely free with her feet off the ground. “Oops.”</p><p>“That’s not good enough, sweetness.”</p><p>“You didn’t hit the card.”</p><p>“You made that impossible.”</p><p>“I never promised to make it easy for you.”</p><p>He twirled the card in front of her face for a moment before placing it against the wood. He let go, and she thought for sure it would flutter against her cheek. Instead, it fell barely an inch before he’d whipped out a blade and plunged it into the wood beside her eye with a heavy thunk, so close that she could count her eyelashes reflected in the shining steel. She gasped.</p><p>And while her mouth was open, he bent and covered it with his.</p><p>.6.</p><p>Jacinda was sideways, and Marco was standing, and their mouths met at opposite angles with exquisite dissymmetry. With no warning, his tongue slid between her lips from one corner up to the other, plunging into her depths to taste her with an intimacy as unexpected as it was right. She moaned as he pulled away, taking the sound with him and leaving her with the lingering ache for the unfelt rasp of his jaw against her cheek or perhaps somewhere even more secret.</p><p>“Where did you—”</p><p>His eyebrows rose as he crossed his arms. “One question.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Bugger. Then I take it back.”</p><p>“You can’t. Where did I . . . ?”</p><p>Jacinda tried to make her mind work, but it was as useless as harnessing mad bludmares to a moving wagon. He’d unnerved her, and she’d been on the verge of asking him where he’d learned to kiss like that. At least he’d stopped her in time. What a waste that would have been. And knowing what she did so far of his capricious nature, who knew what she would have to do to win the next answer?</p> <p>“Where did you hide the body?”</p><p>He shook his head sadly, disappointed with her. “Oh, sweetness. There was no body.” With a melodramatic sigh, he slipped his hands into his pockets and turned away.</p><p>“Marco?”</p><p>He didn’t stop walking.</p><p>“Marco! Are you going to unbind me?”</p> <p>He paused but didn’t look back. “No more questions.”</p><p>She opened her mouth, first to demand and then to beg that he undo the straps and let her down from his blasted bull’s-eye. The knife was uncomfortably close to her skin, and without his presence to distract her, she was beginning to feel the cut of the leather against the softness of her flesh. But she could tell he wouldn’t respond to demands, and she wasn’t willing to lower herself to pleading—yet. And so she closed her mouth and ran her tongue along her top lip, remembering with a shiver the exotic feeling of being kissed in an entirely new way. Damn, but the man was a mystery.</p><p>It took a few moments for her to realize her fingertips were to her lips, and it took a few moments more for her to chuckle at herself and reach to unbuckle the strap around her other wrist. She’d utterly forgotten that one hand was free all along. With both hands on the buckle at her waist, she stopped. She couldn’t reach her ankles until she undid this buckle, but as soon as the tension was gone, she would flop right over. Silly as it was, injury was possible, especially if the creaking sway of the bull’s-eye indicated, as it seemed to, that the thing could spin freely. She’d be upside down and making bets on how quickly her skirts would rip if she continued in her stubborn streak to free herself from Marco’s clever cage.</p><p>But he was long gone, and she wasn’t about to give him the satisfaction of causing a scene. The lizard boy was the only person she could see, and she hissed at him until her tongue went dry, but he didn’t open an eye. She had just set her hands to the buckle at her waist and prepared for the worst when she noticed someone moving furtively along the outside of the wagon circle. It was one of the girls from the dining car this morning, the one with the odd speech and wistful, faraway manner. Jacinda’s orderly and journalistic mind shifted through mental cue cards as she put on a warm smile.</p><p>“Demi, dear? Do you have a moment?”</p><p>“Mrs. Harville? What are you doing?”</p> <p>For a Bludwoman, Demi had a hesitant walk, almost as if she was doing something that would get her in trouble. Her strange costume showcased the casual resplendence of a life lived in the caravan, with vibrant colors and patterns carefully fitted and ruffled by hands more expert than her own. The girl’s hair was in a low ponytail, rippling over her shoulders in careless curls that matched the bangs cutting across her forehead. Something about her struck Jacinda as foreign, but she couldn’t place the girl’s looks or accent in any culture she’d visited.</p><p>Jacinda sighed and rolled her eyes heavenward. “I made a bad bet, I’m afraid. Would you be so kind as to spin this machine around so that I’m right-side up?”</p><p>Demi stared her up and down, taking in the placement of the pins in her skirt and the tightly buckled leather around her waist and ankles. Something dark flashed behind the girl’s brown eyes, and they narrowed.</p><p>“Did Marco do this to you?”</p><p>Jacinda blinked, going a little colder, recognizing instantly the ire of a woman with no right to be jealous. Since Liam’s death, she’d been plagued with such indignation across the globe any time she chose a lover and inadvertently gained rivals for his affection. She always knew she would stake no future claim, but the women of the cities and villages she visited never believed her. It was rare, in today’s world, for a woman to take what she wanted without expecting more down the road.</p><p>But Demi was young and sweet, beyond the raised hackles. And Jacinda knew better than to forget for even a moment that the slender girl was a Bludwoman and that she herself was pinned to the target as surely as a piece of staked meat over a fire. So she smiled warmly and shook her head as if the whole thing were very silly, which it was.</p><p>It was.</p><p>“He said he would answer a question if I let him throw a knife at me, and I was fool enough to take him up on it. And then he left me here like a goose. It’s beginning to hurt a bit. Would you mind?”</p> <p>She twirled a finger, and Demi followed it hungrily for a moment before snapping awake and moving the wheel until Jacinda’s head was finally where it belonged. She reeled for a moment with the rush of blood, and Demi thoughtfully reached down to pull out the pins holding her skirts to the wheel and unbuckle the leg straps. Jacinda undid the waist belt, stepped down, and nearly fell, the blood rushing to and from all her body parts in an awkward dance that left her dizzy.</p><p>“Thank you so much. I don’t know how I would have gotten out without you.”</p><p>Demi nodded and turned to go, her head hung a little low. Jacinda remembered well enough what it was like to be young and have crushes on older men; of course, she also remembered seducing her anthropology professor, marrying him, and taking off behind him on a camel for the six best years of her life. But Demi wasn’t her, and Marco wasn’t Liam, and she sensed in her bones that the young Bludwoman’s destiny lay elsewhere.</p><p>“Honey, I’m sure everybody in this caravan has already told you he’s too old for you.”</p><p>Demi opened her mouth to deny any interest whatsoever in the desperately attractive man before wisely swallowing down the act and shuffling her boots a little in the muddy place where he stood to throw his knives. “They have. I mean, I know.”</p><p>A few wooden crates sat just under the edge of the tent, and Jacinda walked to one and tested it with a hand before sitting. When she jerked her chin at Demi and flashed a dimple, the girl shrugged and followed her, sitting on the other corner.</p><p>“Have you ever been out of the caravan, Demi?”</p><p>“When I was younger.”</p><p>“Lately?”</p><p>“Not in five years.”</p><p>Jacinda tsked. “Have you ever been out of Sangland, then?”</p><p>Demi thought for a moment. “Sangland is the only part of Sang I’ve ever seen. But I want to see more.”</p><p>“I know caravans are exciting from the outside, but I’m guessing that when you live in one, they’re just as boring and normal as anything else.”</p><p>Demi chuckled. “Yeah. The glitter rubbed off pretty quickly.”</p><p>“Do you know, I once thought joining a desert caravan would be glamorous. But the moment I wrapped my fingers around a bludcamel’s teats and squeezed out the pink milk while she pissed on the lace edge of my skirt, I knew I was in for it. Thus began three weeks of sand, raw meat, and blud-tinged tea that I still crave.”</p><p>“But it was an adventure, right?”</p><p>Jacinda’s fingers roved unconsciously to the pocket watch Marco had recently tucked back into her corset. An etching of Liam grinned within, opposite the clock face. She hadn’t wound the watch since his death. Her smile was soft, touching her lips as gently as a last kiss. “Oh, yes. It was the adventure of a lifetime. I very much advise determining the boundaries of your comfort zone and getting the hell out of it.”</p><p>“That’s not what people usually tell me when I act antsy.”</p><p>“What does Lady Letitia tell you?”</p><p>It was Demi’s turn to smile softly. “Only that when it’s time to leave, I’ll know.”</p><p>“Waiting really is the hardest part, isn’t it? Every day, you walk out your door, always trying to figure out when you’ll decide not to return.”</p><p>They sighed in unison. “Yeah. That’s pretty much it.”</p><p>“Your time will come, Demi. I promise. But until then, please keep in mind that Marco Taresque is at least ten years older than you and wanted for murder.”</p><p>Jacinda gave the girl a companionable nudge with her elbow, and Demi went stiff all over, whether from the nudge, the bluntness, or the sudden realization that flirting with fire was, in this case, cavorting with carving knives.</p><p>“Yeah,” she said softly. “Yeah.”</p><p>“I’m not sure if it’s any consolation, but I heard those two handsome daimon boys whispering about you this morning in the dining car.” Demi perked up, and Jacinda hid her smile of triumph. “I know a little Franchian. The words ‘limber’ and ‘pretty’ came up repeatedly.”</p><p>Demi blushed, and Jacinda remembered that she was gossiping with a girl, not a grown woman.</p><p>“But let’s focus on the ‘pretty’ part. Maybe add ‘smart’ and ‘funny’ to the mix, yes?”</p><p>Demi stood with a regal, liquid languidness in her spine that reminded Jacinda again that the girl was a predator. “I’m twenty-six, not sixteen,” she said stiffly as she placed a handful of pins on the crate. A smile broke through, briefly. “But thanks.”</p><p>As Jacinda watched the girl walk away, she hoped Demi would one day come to trust her and share her story. Everyone she met piqued her interest like books waiting to be read, and she felt that Demi’s past and future held tales worth telling.</p><p>The contortionist had left a neat pile of pins on the crate, the ones Marco had used to secure Jacinda’s skirts to the target. Jacinda picked one up, noting that they were hatpins, each with a delicate wood flower for the head and a capital P carved into the back.</p><p>Was the P for Petra? Had these pins once held down another girl’s skirts as she spun, waiting to feel the accidental kiss of Marco’s blades? She looked closer, checking the steel points for blood, but found nothing. She had to find out what had happened to the knife thrower’s missing assistant. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Demi and the carnivalleros could wait to tell their stories.</p><p>Marco might not.</p><p>.7.</p> <p>That night, Jacinda dressed in her most normal, boring clothes in hopes of blending in with the caravan’s audience. No steel pith helmet. No leather corset or canvas dress. No tribal layers and bells and scarves. Definitely no Almanican face paint or even desert kohl. Just a plain, well-fitting, wine-red dress, a few years out of date but of fine enough material to suggest she was a purposeful anachronism. She put up her hair as best as combs could hold the curls and dabbed just a bloom of rouge on her lips. Years in the sun with Liam had brought out her freckles, but she wore them proudly, like war paint, never hiding them under white powder as so many city girls did.</p><p>Although it pained her, she left her notebook and pen behind on the desk. Brutus, on the other hand, she would keep by her side. During the day, the caravan was quiet and safe. At night, there was no telling what dangers lurked in the shadows within the wagon’s circle and on the moors beyond.</p><p>Tucking three coins into her pocket with the watch, she said, “Brutus, follow,” and left the oil lamps burning. Long ago, she’d turned them off every time she left the conveyance to make fuel last longer. And then, one day, she’d found a man in her bed, waiting with a knife. Since then, she risked fire for the sake of illumination and kept the clockwork dog close whenever she went out after nightfall. The cuts on her hands had healed, but she was no longer as trusting of darkness.</p><p>Outside, she locked the door and took a deep breath. The caravan was a symphony of smells now, a mixture of sweet and salt and warm and spice that drew her forward as surely as the strings of lights swooping around the perimeter of the cars. She could have easily walked down two steps, across the grass, under the lights, and directly into the crowd forming around the puppet show, but she knew well enough that Criminy Stain was watching, wherever he was. She wasn’t a liar, and she wasn’t stupid, and she wasn’t about to break his rules, especially considering his unexpected generosity in regard to her interests. She had heard of his famous hatred of reporters and had expected him to toss her out on her bustle, possibly after half-draining her for upsetting his evening routine. But instead, here she was, taking the long way around the caravan, averting her eyes politely from the acts already in progress, and waiting her turn in the queue among city folk quivering with fear and excitement.</p><p>Criminy himself was waiting at the turnstile, clad in a somber black that made him seem one size smaller and twice as sinister as she remembered him during daylight.</p> <p>“Admission’s a vial or a copper, miss,” he said with a smirk.</p><p>She put a copper on his red-gloved palm. “I don’t think I want you developing a taste for my blood. What’s your refund policy?”</p><p>“You get what you pay for here, love.”</p><p>He tossed the copper high in the air, where it flashed with lantern light and moon darkness. He held out his hand to catch it, but what landed across the red kid suede was a silver hatpin with a carved wood rose on the end. Jacinda’s hand flew to her hair, a gasp on her lips.</p><p>“I think you’ll be well rewarded for your time, Miss Harville.”</p><p>“Mrs. Harville.”</p> <p>“Not anymore.”</p><p>She snatched up the pin in spite of his smirk and stuck it back in her hat. As much as she wished to pretend she didn’t storm off with flaming cheeks, that’s exactly what she did. And as much as she’d like to think she took her time enjoying the charms of the caravan, that’s not what she did, either. With the great clockwork dog a step behind her, she walked widdershins around the circle of wagons, to the well-trod spot where a repetitive musical thunk announced Marco’s skills. She’d watched him practice twice, but she had no idea what happened during his actual act.</p><p>The flavor of the carnival changed with each wagon. From the dizzy music of the dancing mistress to the tense silence under the tightrope walker to the cheerful horn of a clockwork monkey playing in time with the strong man’s squats to the tinny giddiness of Imogen’s butterfly circus, Jacinda absorbed it all like a greedy child in a candy store. She didn’t stop to savor any one act, but she couldn’t help but appreciate the universal excitement of the world Criminy had created, this glittery oasis in the dark sea of the moors.</p><p>Marco’s wagon was the same color as the cloudless night, blending seamlessly with the shadowed wilderness beyond the lights. As Jacinda approached, the hum of a gramophone needle picked up, followed by a fanfare of trumpets. Twin lights blinked on, making her see spots. Although Jacinda expected to see the spinning bull’s-eye she now knew so intimately, the setup was different on this side of the wagon. Of course, having met Mr. Murdoch, she would have been foolish to expect anything less than a masterpiece when it came to the caravan’s equipment.</p><p>The backdrop was painted to match the idyllic fields of a time gone by, bright and golden, with rolling hills and happy green trees as fluffy as candy floss. Just like the fancy stage sets she’d seen in Milano and Paris and London, there were several layers of independently moving parts that danced in time with the gramophone’s music, like a puppet show without strings or puppet master.</p><p>Down in front, wooden bludbunnies gamboled, their merry eyes at odds with their blood-tipped teeth. Behind them, a family of bluddeer leaped, the fawn’s eyes big and as melty as hot chocolate. Wooden birds swooped from the sky, and a bludrat darted among the bushes, its deep russet fur making it stand out among the muted pastoral hues. Jacinda squinted for just a moment, trying to uncover the secret of the clever mix of wood, paint, and clockwork. She immediately opted to enjoy the show and edged into the back of Marco’s crowd.</p><p>An explosive crack and a puff of smoke drew every eye to the figure materializing from the hazy white. Marco was clad all in black, looking even more deadly than the image in the newspaper Jacinda now kept rolled up in her desk. His hair was pulled back low, and he wore a bandanna like an airship pirate, keeping his eyes free of windblown locks. He might have disappeared against the night sky if not for the spotlight’s keen glare off the line of bright silver knives glinting from boots to shoulders, at least twice as many as he usually wore. As he posed and the audience clapped, Jacinda found herself daydreaming about pressing herself against his back and dropping the knives, one by one, from their loops to the ground, until his body was safe to explore without fear of the blades’ pointed tips.</p><p>With smooth, practiced movements, Marco reached for the knives at his shoulders and flung them simultaneously in time with the gramophone’s song. Twin flashes crossed in an X, and the knives flickered into two of the painted wooden birds flapping across the sky, one in each eye. The crowd clapped, and Marco’s mouth twitched just the tiniest bit.</p> <p>Knife after knife flew at the targets in time with the music, seemingly straight from their loops. He made it look effortless, simple, as natural as a hawk swooping from the air to capture a bludbunny. The crowd’s gasps grew fewer and fewer as he went on without missing a single shot. As if he sensed the exact moment their attention hung at a precipice, he stopped and pulled the bandanna down over his eyes. As the city folk murmured and nudged one another around her, Jacinda couldn’t help focusing on Marco’s sensual mouth, his cheeks cleanly shaven, and that little, delectable place above his upper lip desperately in need of kissing.</p><p>She shook her head. Nibbling on Marco wasn’t part of the story.</p><p>With his eyes covered, he took more time with each throw, and the crowd cheered after each blade hit a target. Jacinda would have bet anything that he could see through the bandanna, no matter how opaque and thick it might look from the audience. The hesitation was purposeful, part of the act. But then again, he had said he liked taking his time. The way he had said it, however, meant something else entirely.</p><p>As the final knife thudded into the bright red bludrat, the last untouched target, the crowd went mad with wolf whistles, clapping, and the frantic wailing of overexcited women. Jacinda clapped politely, well aware that she was not the only one in the audience who’d been waiting to see Marco without protective ribbons of steel up his thighs. Pulling off his bandanna, he bowed and straightened. His grin told her plainly, told everyone, that he was well aware of the effect he had on women, and when he winked at a buxom girl in the front row, the little ninny fainted dead away. Jacinda considered it significant that he caught her eye, just after that, one eyebrow raised in amusement.</p><p>As the applause built to a crescendo, Marco raised both arms, threw them down, and disappeared in another burst of smoke. Moments later, the crowd quieted and dispersed, still whispering about the mysterious knife thrower and the darkly dangerous look in his eye, so different from the soft, bespectacled men of the city proper, with their top hats and paisley waistcoats. Jacinda waited until the last giggling girl had given up on seeing Marco again before she walked around the backdrop, which had gone still. From behind, the mechanics were visible, a tangled orchestra of metal, cogs, pistons, and gears. She was almost tempted to touch the delicate mechanisms, but she suspected that everything in the caravan was rigged to punish people who were too curious or too foolish.</p><p>“Looking for more answers?”</p><p>With a blush in her cheeks, Jacinda spun around to find Marco standing at the front of the backdrop, grasping a knife to pull it free of the wood. He looked so pompous and self-contained that she wanted to beat on his chest with her fists until he spilled his secrets like angry bees from a hive. One by one, he pulled out the knives and slipped them into their hooks, barely looking down as he worked. With nothing else to do and desperately in need of distraction, Jacinda knelt to yank a knife from a red-eyed bludbunny. It was easier than it looked. Instead of handing him the first one, she stayed where she was and reached for another.</p><p>“Your show seemed to go well.”</p><p>“They always do.”</p><p>“Why didn’t you use the spinning target? From earlier?”</p><p>She looked up in time to catch a fleeting grin. “That trick’s no good without a pretty girl. Are you volunteering?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Remembering the momentary flick of his fingers that had sent a knife hurtling toward her body and recalling the split second when she couldn’t tell if she’d been hit or not, she shook her head. “I need to be fully functional, thanks. It takes two hands to do what I do best.”</p><p>He smothered a laugh. “Are you saying you doubt my skills?”</p><p>“No. But I do doubt the proximity of a well-trained chirurgeon, should something go wrong.”</p> <p>“I’ve never drawn blood, you know.”</p><p>She looked up sharply; he’d divulged more than he had meant to. But Jacinda knew well enough how to lure a witness into confidence, into revealing more. So she calmly pulled out another knife.</p><p>“I’ve heard it called the impalement arts.” She stood, three knives in her glove, holding them out with a welcoming smile. “But it doesn’t seem like much impalement actually occurs. At least, not if you’ve any talent.”</p><p>Had he been drinking just then, he might have choked, but as it was, he cleared his throat and took the knives, one by one, his fingers lightly dragging across her gloved palm.</p><p>“There’s more than one way to be impaled, Miss Harville.”</p> <p>One fair red eyebrow rose. “It’s Mrs. Harville. So yes, I know all about that.”</p><p>The knives slid, one by one, into their loops with a whisper of cloth.</p><p>“You’re a very singular girl.” He paused to stare at her lips. “Mrs. Harville.”</p><p>He stepped closer, his presence a dark wall. She didn’t move but tilted her head to look up at him. With careful fingers, she slid a knife out of its loop on his shoulder and drew it gently down his shirt, knowing he would barely feel it but enjoying the scratch of steel against cloth and the feeling of slight rebellion against a man who billed himself as the most dangerous thing around.</p><p>“You’re just accustomed to girls. I’m a woman. There’s a difference.”</p><p>With a quick flick of his knife, she popped off his top button. It flew into the night, landing somewhere in the dry grass, not that he bothered looking for it. In a flash, he caught her wrist in a steel grip that didn’t hurt so much as warn. As he slipped the knife out of her grasp, he leaned close to whisper, “Keep playing games with me, if you like. I know some games, too.”</p> <p>Jacinda’s pulse was racing, and she realized she was up on tiptoes, waiting to see what he would do next. But he simply put the knife back and returned to his work, collecting the rest of his instruments until he was fairly bristling again. When he ducked around behind the backdrop, she followed him into the shadows. He turned on the machine, and Jacinda stepped back from the suddenly shuddering and twirling spears of metal.</p><p>“Let’s say I want to play,” she said, voice pitched low. “Let’s say I agree to play by your rules.”</p><p>His eyes raked her from hem to hat. “I have a show to put on. Now is not the time for distractions.”</p><p>“Think about it, then. Because I’m not giving up. You might as well have some fun, being pestered to death.”</p><p>The moment built, heavy and dark, the clockworks’ ticking as inescapable as sand in an hourglass. Voices began to gather on the other side of the backdrop, and Marco pressed another button to start up the fanfare. His eyes didn’t leave hers as he checked his bandanna, ran fingertips over the knives, and reached into a wooden crate for two round, paper-wrapped packets that smelled of powder and magic.</p><p>“Crowd’s gathering. You’re stuck, sweetness. You’ll have to wait out the show back here.”</p><p>“Oh, no. Time to myself in the dark with a bunch of well-oiled machinery. Whatever will I do?”</p><p>That surprised him. With the smoke bombs in each hand, Marco couldn’t reach out, couldn’t step too close or touch her or even shove her away. He glanced from Jacinda to the backdrop as if weighing his chances. Before he could say something dismissive or discourage her further, she stepped forward, curled her fingers into his shirtfront, and kissed him with the controlled passion only a very experienced woman could handle under the circumstances. He was helpless to do anything but take her kiss, his mouth warm and his jaw rasping against her cheek as she ran her tongue past his lips with playful possession.</p> <p>“I’ll be right here. Not distracting you. Try not to hurt yourself out there.”</p><p>Carefully transferring both smoke bombs to the same hand, he turned his back to her and made adjustments to his costume with a long, shaky sigh. She smirked to herself. If the key to finding out Marco’s past was to keep him slightly confused by constant sexual tension, then she was going to enjoy this story quite a bit.</p><p>“What a way to go,” he said under his breath as he stepped around the backdrop.</p><p>Jacinda sat on the edge of a crate, the clockwork dog a still and solid presence at her side. She absentmindedly ran a hand over its boxy head and down its metal spine. She was a woman who appreciated a dangerous creature that could be harnessed but never tamed.</p><p>And when Marco was done with his show, she decided, she would have a little surprise for him, too.</p><p>.8.</p><p>As soon as the show was over, Jacinda slipped out with the crowd, darting among the shadows with the dog in her wake. She’d said, “I’ll be right here,” but she’d failed to mention how long she would stay there. Although she wasn’t sure exactly how Marco appeared and disappeared with his smoke bombs, she wanted to keep him guessing, out of power. Thus far, he had admitted to never having drawn blood, and the offhand delivery suggested that he had been telling the truth. What, then, had happened to his assistant? Why had there been so much gore?</p><p>Walking the caravan against the flow of the crowd, Jacinda had never felt more alone. She’d traveled with Liam for so long and had grown so accustomed to his nearness that even a year later, she would find herself turning with a smile to whisper something or reaching for a hand that was no longer there. At least she’d traded in their larger conveyance for her small one, a private space unhaunted by her late husband’s presence.</p><p>She knew that returning to Marco’s act would be a mistake, would make her seem desperate. And she had promised Criminy she wouldn’t interfere with his caravan during showtime. But the charms of the circus seemed tawdry to her at night, when she had a goal to accomplish. The people behind the glitter and paint were far more interesting to her than their magic-spiced acts. If she would move among them, she wanted to know them by light of day and not, as everyone else did, after dark had fallen and the lights had gone up. She wanted the stories of the people behind the show. The truth was more interesting than the artifice.</p><p>Try as she might, she couldn’t stop thinking about Marco’s lips, the rasp of his cheek, the cut of his shoulders, the chasm of his eyes. He reminded her of a vein of ore she’d seen in a mine in Africa. Just a few glimmers aboveground hinted at the glittering depths and crystal caverns below. She didn’t usually favor the strong and silent type, much less the darkly dangerous type. But she suspected that he hid the best parts of himself and let the world see only the surface. If he was as razor-fine inside as he was on the outside, it would be worth her while to dig. At the very least, she would enjoy trading kisses and winning his story from him bit by bit, if that was what it took. The book was still her goal, but a scoop that would rock London and the chance to exonerate an innocent man—well, she wouldn’t have turned that down, even if she hadn’t been personally drawn to the subject.</p><p>Walking around the perimeter of the caravan, she felt rather the flâneuse, the only person outside of the joy and wonder. She wasn’t surprised when her feet brought her right back to Marco’s trailer. The crowd had thinned as the night grew colder, and the only people left were a trio of troublesome boys conferring about whether or not to nick one of Marco’s knives from the backdrop.</p><p>“Shoo, you little creeps.”</p><p>They straightened and turned on her, wearing snarls. “Bugger off, lady.”</p><p>Jacinda smirked. “Brutus, exsanguinate.”</p><p>As soon as the metal dog turned in their direction, the boys scrambled away, and with a roll of her eyes at the foolishness of lads, Jacinda began the work of collecting Marco’s knives. It was always better to have work than to sit around, empty-handed and empty-headed, so far as she knew. She wasn’t tall enough to reach the very highest blades, but she had two handfuls of bristling steel as she rounded the corner of the backdrop.</p><p>Strong hands found her waist, swinging her around until her back was against the wood. Brutus lunged forward with a metallic growl.</p><p>“Brutus, disengage.”</p><p>The dog froze in place, but Marco hadn’t shifted his grip for even a moment. She was on full alert, the wood cold against her back, his hands warm on the narrow waist of her corset. With fingers carefully curled around the blades, she felt helpless. But there was something strangely lovely about it.</p><p>“Doing my dirty work for me, sweetness?”</p><p>“I like to be useful.”</p><p>“I know a good way to use you.”</p><p>She lifted her face, her mouth slightly open and waiting. But he held her there, looking down with a teasing sort of smile. “Now’s the part where you kiss me,” she whispered, and he chuckled and bent, ever so slowly, to taste her lips.</p><p>Jacinda savored his patience, the warmth of his mouth moving against hers with complete mastery and control. One of his hands left her waist to cup her jaw, just so, and she was surprised to find bare skin where suede should have been. His palm was warm and broad, his thumb stroking her cheekbone possessively as the other hand pressed the corset’s stays into her hip. He opened her mouth with his lips, his tongue darting in, gentle and hot, making shivers run up and down her spine to pool in her belly.</p><p>She’d kissed plenty of men since she’d lost Liam, in part to help her forget. Because each man tasted and moved so differently, she’d never had any trouble letting lust overtake her behind closed eyes. She’d never felt anything for any of them, mostly younger men who could appreciate a woman’s body without delving deeper into her heart and mind. But their first kisses had always been fast and sloppy, passionate and rushed, as if she might suddenly change her mind and leave them wanting. Not that she minded—she liked the frantic hunger, liked the distraction of the intoxicating frenzy. Marco, on the other hand, refused to let her set the pace, defied her haste with hands that wouldn’t budge from their places and a tongue determined to enjoy a deep taste before moving on. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With a little whimper, she arched away from the wall, aching for the pressure of his body against hers. His hand tightened on her waist, holding her back, and she murmured, “Come on, Marco,” into his mouth.</p><p>He pulled away, leaving her panting. “Hungry little thing, aren’t you?”</p><p>“I am. And if I want more?”</p> <p>He rubbed a thumb over her still-wet lips before releasing her and taking the knives from her clenched hands. As he stepped away, she nearly collapsed, her legs boneless and her hands suddenly empty and aching from making fists around the steel.</p><p>“Then you’ll have to beg for it.”</p><p>She was off balance for a moment, but she quickly regained her footing, sensing that she needed to keep him interested, that he was the sort of man who got bored easily and would toy with her only as long as he enjoyed the chase. “Do I have to get on my knees?”</p><p>That got his attention. He turned back from the crate, where he was slipping his knives one by one into a long leather roll. Their eyes caught, and with her chin held high, she gracefully dropped to her knees and sat back on her haunches as she’d been taught when interviewing geishas in the East. Hands folded just so, she lowered her eyelids to gaze up through her lashes.</p><p>“Please?”</p> <p>He swallowed hard and looked away, turning his head and listening to the sounds beyond the backdrop. She could hear it, too—the caravan was closing for the night. The noise of the crowd had grown faint, wagon doors were slamming closed, and Criminy’s voice shouted unnaturally loudly, thanking everyone and welcoming them back tomorrow if they weren’t eaten by bludbunnies on the way home. She had almost forgotten they weren’t the only people in the dark, that hundreds of people had been lingering and laughing just around the corner. But now they were alone. Almost.</p><p>“Fearless and shameless. What a combination,” he finally said, and she laughed.</p><p>“I’m a writer. I’ve lived through hell and imagined worse. You don’t scare me.”</p><p>“Even though they call me a murderer?”</p><p>She stood in one smooth motion. “Thing is, I don’t think you did it. I’d like to prove everyone wrong. I’m one of the only journalists out there hell-bent on the truth.” She shrugged. “Such is my curse.”</p><p>It was the wrong thing to say to him, and she felt the same drop in her gut as if moving a chess piece to a square that would lose her the game. His face closed up, his eyes going dark and fathomless, looking straight through her. “I can’t give you what you want.” It came out ragged, his back to her as he finished with his knives.</p> <p>She was drawn to him, desperate to mend what she’d torn asunder. Her hand found the small of his back, her fingertips spreading to enjoy the play of hard muscles. “Is the truth so impossible?”</p><p>He shuddered and shook her off, rolling up his knives and storming to the stairs of his trailer. He slipped inside and slammed the door in her face without a word, and she felt a flare of anger. It was bad enough to kiss her like that and leave her wanting, but to lock her out was a slap in the face. Even if the truth was his possession, his secret, she was unaccustomed to being treated so rudely. And damned if she wasn’t burdened with a temper. But she wasn’t about to knock or yell or beg. The time for that was past.</p><p>Forgetting that he had deadly aim and a history of supposed bloodshed and driven only by her cheated body and her angry heart, she reached into her pocket for her lock picks and had his door open in moments. The lights inside were warm, the room glowing with wallpaper in silver and black stripes. Marco sat on a low sofa, his head in his hands and his shirt half unbuttoned. Furious surprise was written clearly on his face.</p><p>“Did you just break into my wagon?”</p><p>Her mouth quirked up slowly. “Of course not. The door was open.”</p><p>She closed the door silently and leaned back against it, suddenly unsure. What was she doing? She’d never thrown herself at a man—at least, not since Liam. The rest had come running like bludrats scenting a bare foot. She’d simply chosen one from the pack and let things run their course. But this was no pack, just a lone wolf, and the only one that would do. She had come to the caravan for an entertaining story, but now she couldn’t think past her own stupid body and swiftly racing heart. She wanted his secrets even more.</p><p>It should have been easy. Seduce him. Take what she needed.</p><p>But this was more than she had expected, and she had to tread carefully.</p> <p>Marco didn’t move, sprawled over his couch as he was with one leg up on a steamer trunk. He was surprised, sure, but still dripping with confidence, with a bone-deep certainty that he was the most dangerous thing in the very small, suddenly rather airless room. She realized that she’d left Brutus outside, slammed the door in the metal dog’s face. Even without the knives glinting up his shirt, she still suspected Marco was well-armed.</p><p>“I suppose I should be glad you didn’t break in while I was out and rifle my drawers.”</p><p>“There’s always tomorrow.”</p><p>“What do you want?”</p><p>“You know what I want.”</p><p>“What’ll you settle for?”</p><p>She took a deep breath. “More time to screw it out of you.”</p><p>He snorted, his head rocking back against the couch to show a long, muscled neck already shaded with new beard. “What makes you think I’m interested?”</p><p>She raised one eyebrow and cast a damning look at his lap.</p><p>He just chuckled. “That’s nothing.”</p><p>“Prove it.”</p><p>He stood, his footsteps creaking across the wood floors, closer and closer. Even though she had invited the situation—well, forced it—she still felt as if her back was always against a door with him, that there was nowhere left to run as soon as his eyes found her. She pressed her hands against the wood, willing the blood out of her cheeks, the slight hitch out of her breath. He was angry with her, but he was amused, too. She had to hope the amusement would win out.</p><p>Marco’s expression was sharp and dark and hungry, and she fought the urge to look away, to look down, to cower in any way.</p><p>“Woman, do you know what you’re getting into?”</p><p>“I’m a big girl. I always know what I’m getting into.”</p><p>One finger, curled under her chin, made her tilt her head back to look up at him. Her lips parted, waiting for him to crash into her, to run his hands down her body with the frenzy she felt inside every time they traded barbs. Instead, he spun her around to face the door and pressed close against her back, hotter than the sun and breathing warmly over her neck. One after the other, he took her hands, pinning them against the door over her head. Her heart sped up, pounding against the door loudly enough that she was sure he could hear it, and with animal grace, she arched her back, feeling the hardness of him even through her bustle and the layers of skirts.</p><p>His lips brushed her ear, running down her hairline to the high collar of her dress. She’d never hated fashion so much, never resented the way people in Sangland were forced to cover so much skin just to stay alive. As his mouth skimmed down the curve of her neck, she could feel the heat of his breath through the fabric, and when his teeth found her shoulder, she let out a small moan. One hand still pinned both of hers to the wood, his other hand tight on her hip, moving around to the front, to the sensitive crease just under the hipbone. Through layers of skirts, his hand steadily followed the line of her corset to where it came to a point, right at the crux of her.</p><p>“Don’t move your hands,” he whispered in her ear. “Or I stop.”</p><p>He released them, and they stayed pinned to the wood, flat, one on top of the other. His right hand traveled with careful, cruel slowness, down her wrist, past the sensitive furrow of her elbow, down her shoulder, still wet with the marks of his teeth. All the while, his left hand rubbed through her skirts, back and forth, hard enough that she could feel it but softly enough that it provided no relief. Over the curve of her ribs, the valley of her corset, the swell of her hip, his right hand traveled with leisurely abandon, never pausing, even when she strained for his touch. When his left hand left off its work, she groaned. But she swallowed the sound when she felt him move back and downward, palms gripping her hips as he knelt behind her.</p><p>She almost turned around, but he had burned it into her: don’t move. His hands caressed her ass reverently through the bustle and skirts before running down the outsides of her legs, past her knees, all the way down to the tops of her boots, just above her ankles. Damn. If she’d known he’d get this close, she would have worn the elegant boots with the sharp heels, the ones that laced up to her thighs. His fingers were feather-light as he moved them to the insides of her legs and trailed them upward, skimming over her fashionably ripped stockings. When he found the insides of her knees, they nearly buckled. And as he reached the softness of her thighs, he stood back up, dragging her skirts up with him and exposing her legs to the chill air.</p><p>Teeth clenched, she closed her eyes and set her forehead against the cool wood, just under her wrists. She felt with exquisite slowness and anticipation the moment when his hands changed courses under her layers of skirts and petticoats, the left one continuing up the tender inside of her thigh while the right one spread wide and caressed her ass briefly, gently, before curving around to her front, just under the edge of her corset. At the exact same moment, his fingers found the crux of her from either side, and she gasped and whimpered.</p><p>One finger slid up and curled inside her with expert precision, and she spread her legs wider to accommodate him, fighting her every instinct to use her hands, her mouth, anything to touch him. But: don’t move. Or he would stop. So her own fingers curled against the wood in imitation of his fingers inside her, her nails raw against the gloves. Marco’s body pressed hard against her as he worked her with both hands, and she wanted nothing more than for him to slide up and enter her with the same damnable slowness. As his finger rubbed up and down, barely dipping in and out, his teeth caught the lobe of her ear, gentle but unyielding.</p><p>“You want to let go. You want to drop your hands. You want to turn around and feel my tongue in your mouth, moving in time with my finger. You want to press against me, feel your nipples rubbing against the corset, against my chest. But you can’t. You can’t move.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But she could, just the tiniest bit, pressing her ass more firmly against him. He responded by gently sliding in a second finger, and she shuddered with the first promising echo of the release to come. He let loose his teeth, and his tongue curled down around the shell of her ear, caressing the tender hollow where it met her jaw and sending shivers that made her shoulders shake. Still, she didn’t move her hands from their place on the door; still, she didn’t open her eyes.</p><p>God, this maddening slowness, the pressure building, every drop of her pleasure completely out of her own control. She was accustomed to a passionate frenzy on the outside, to writhing bodies and flashes of teeth by firelight and moving a clumsy but eager hand to right where she wanted it. But the tempest was inside her now, the outside as still as a moonless night, even his clever fingers hidden by layers and layers of skirts. Her heart and her damnable panting were the only things taking on speed, and she began to understand that Marco wasn’t going to be the easy mark she had supposed. She had expected a bad boy, full of himself and easily led into making the mistake of confession, whether under influence of wine or woman. Instead, he had trapped her, and she’d never been so wet, so wanting, so desperate.</p><p>“How long will you make me wait?” she whispered.</p> <p>She felt his chuckle rumble against her back. “Wait for what?”</p><p>“For you.” She wiggled suggestively, hips rocking against him. He caught her, pressing firmly against her ass in a way that magnified everything else he was doing and made her whimper. She couldn’t take it a second longer and dropped her hands, spinning around to reach for him.</p><p>But he only dropped her skirts and backed away, his smile amused but his eyes rueful. Jacinda felt entirely bereft and immensely frustrated.</p><p>“You can’t be serious, Marco.”</p><p>He held up his hands as if she had aimed a crossbow for his heart, his fingers gleaming. “I told you not to move.”</p> <p>Her teeth were clenched, her cheeks as hot as the sun. “We’re adults. This isn’t a game, as much as we might pretend to play. You clearly know exactly what you’re doing. So why not drop the pretense and enjoy our mutual good fortune?”</p><p>Hurt flashed in his eyes for some reason she couldn’t fathom. “Get out of my wagon, woman.”</p><p>“Marco. Please. Do I have to get on my knees again?” She licked her lips, slowly, her eyes dropping to the part of him that had so recently pressed against her ass. No matter how matter-of-fact he sounded, his own frustration was even more clearly outlined than her own.</p><p>“It won’t do any good. I don’t care to be rushed. No matter how tempting it might be.”</p><p>She had to resist stomping a foot. “Who said you make the rules? When do I get a say?”</p><p>“It’s simple. You want something from me. A couple of things. And that means I make the rules.”</p> <p>Jacinda groaned and made fists of her hands, her stupid, greedy hands that just couldn’t stay put when they wanted so badly to touch him in turn. Flooded with shame and frustration, she spun on her heel and jerked open the door.</p><p>“Not used to being defied, are you, Jacinda?”</p><p>In response, she slammed the door, wanting nothing more than to set the damned thing on fire and forget the cool smoothness of the wood under her gloves.</p><p>She’d let him get under her skin. And now, damn them both, she needed more.</p><p>.9.</p><p>Sleep was hard to find and harder to keep that night, but she outright refused to seek relief under the darkness of her blankets, because, somehow, that meant that Marco had won. Instead, she formulated her plan. She was more determined than ever to get to the root of Marco’s past . . . and his refusal to bed her. A normal man would have jumped at the chance, would have been more than happy to take pleasure in a pretty woman without shame, without commitments, without damage or shyness. As much as she hated to admit it, his rejection had wounded her confidence.</p><p>When she found herself staring into a mirror the next morning, looking for wrinkles or rogue freckles or anything that would make her less than desirable, she shouted, “Bugger you, Marco Taresque!” and went for her notebook.</p><p>He said he liked to take his time; let him. Even if he had turned her away, she had seen the evidence of his own desire, and she would let him stew in it. She would ignore him and concentrate on her book, the reason she’d sought the caravan in the first place. Perhaps watching her fawn over his fellow performers while immersing herself in her element would get him as riled up as she currently felt. If there was one thing she knew how to do, it was flatter and flirt. And, of course, write.</p> <p>With Brutus at her heels, she set out across the moor, commanding the metal dog to destroy the bludbunnies that lunged out of the grass and toward her leather-clad ankles. Four bodies dangled from her grasp as she entered the well-trampled grounds of the caravan proper. She made her way to the dining wagon, hanging the rabbits on a hook as she’d seen the others do and using the chalk to write her name and four hatch marks on the chalkboard beside the names of the carnivalleros and their own bludbunny counts. Gathering food brought her one step closer to being one of their own and only six rabbits away from earning a copper for her trouble, if she remembered the gossip correctly.</p><p>“Got your first one, my lady?” the strong man called, and she waved with a grin.</p><p>“Got my first four, Torno!”</p><p>He laughed, his leather top hat wobbling. “But should the dog not receive the credit?”</p><p>She grinned. “He can’t be trusted with coppers. Always spends them on drink and loose women.”</p><p>He bowed politely as she stepped up the stairs to the dining car ahead of him.</p><p>“You are a strange woman, but then, I think perhaps all women are strange in their own ways,” he said.</p><p>“My husband used to say something quite similar. Tell me, Torno, have you ever been married?” The hugely muscled man blushed red to the tips of his waxed black mustache, and she held open the door to the dining car with an inviting smile. “Join me for breakfast, and I promise not to ask anything too embarrassing. I’m writing a book, you see . . .”</p><p>An hour later, her notebook held pages of frantic scribbles, and she’d enjoyed a riveting tale that could have been a book in itself, considering the adventures that had brought the strong but overly sensitive man from the small island of Sassily to the mainland, through a war, across the channel, and around the icebergs after being skyjacked by pirates. And no, she learned, he had never had a wife, not after his sweetheart had been thrown overboard by the pirate captain. The poor man had squeezed out a few tears, recounting the loss of his one true love.</p><p>“What did Tish tell you?” she had asked softly.</p><p>“Lady Letitia told me nothing of my heart. But I can’t complain, you see, for she saved my life.”</p><p>By the time he left to practice, she had grown accustomed to the galloping of his speech and realized she now saw him as the hero of his own story, one she hoped would have a happy ending that included the love he deserved and would cherish. To think—he looked so big and scary, but inside he was a kitten. Filled with renewed purpose and shoving away thoughts of Marco, she turned the page on her notebook and approached the booth shared by Demi and Cherie.</p><p>Both girls looked up at her in surprise with red-painted lips, and she realized that they were most likely unaccustomed to being approached by Pinkies while drinking Pinky blood. From the bludcaravans of the desert to the lively bars of Darkside, Jacinda had never been threatened by a single Bludman and had no patience for anyone who feared them, nor did she have patience for gloves unless they were required for propriety. She hadn’t approved of prejudice even when she’d been expected to live a normal life in the city, and she smiled warmly and asked, “May I sit with you?”</p><p>“If you want to,” Demi said, licking her lips clean and swirling blood around in her teacup with doubt written in her eyes.</p><p>Cherie, by far the meeker of the two, scooted over, daintily sliding her teacup away across the scarred wood of the table. Jacinda murmured, “Thank you,” and sat beside the slender blond girl, realizing that, oddly, between the two of them, the predator was probably more frightened of the human.</p><p>“We don’t know anything more about Marco, if that’s what you were going to ask,” Demi said quickly.</p><p>Jacinda rolled her eyes with the slight head shake she would use to discuss a mischievous child. “Consider him pigeonholed. He’s a tough nut to crack, that one. I’ve got something bigger in my sights.” She leaned closer, twirling her pen between ink-stained fingers. “I’m writing a book about the caravan, and I’d like to write a chapter about the two finest contortionists I’ve ever seen.”</p><p>“Us?” Cherie asked innocently.</p><p>Jacinda’s smile was real. “If you’re willing. I’d like to know all about you both.”</p><p>Demi reared back, panicked, her eyes shooting around the dining car. “What about me?”</p><p>“Nothing you don’t want to share. I just sense you have a good story. As a journalist, nothing fascinates me more than learning about new people. I think your tales would greatly intrigue the young women of the city. And you can always give a pseudonym, if you wish.”</p><p>Demi and Cherie had a conversation of gestures and squeaks, prompting Jacinda to get up and fetch a cup of coffee. Criminy hadn’t said anything about food, but she could always toss coppers at him if he got too ornery. She had been careful to leave her notebook on the table, writing-side up and pen on top, so that the girls could see exactly what she did. The page was open to the tail end of her interview with Torno and included scrawled notes and a few unobtrusive sketches, all very favorable, if she did say so herself. One of her attractions as a journalist was her ability to write, draw, stay sober, and ride a bludcamel, as most practitioners in the field could manage only one of the four.</p><p>Sure enough, the girls were huddled over the book, Demi’s dark hair almost touching Cherie’s blond curls. They broke apart as she neared, Cherie blushing and Demi looking up in reckless challenge. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“A book, huh?” Demi asked, and Jacinda nodded.</p><p>“I’m known for writing about the places that most consider no more than dreams. The pyramids of Kyro, the native villages of Almanica, the daimon cabarets of Paris, the hidden jungles of Africa. But I’ve never seen a single book about the truth behind a caravan.”</p><p>“And Criminy knows? He doesn’t mind?” Cherie glanced around nervously.</p> <p>Demi smirked. “If she’s here, he knows. And he probably loves it. Crim’s got an ego the size of a Mack truck.”</p><p>“A what?” Jacinda asked, as it was rare that anyone mentioned anything she hadn’t heard of at least once.</p><p>Demi, blushed, her eyebrows drawn down as she looked away, annoyed. “Just something from where I’m from.”</p><p>“And where’s that?” Jacinda’s pen was poised over a fresh sheet of paper, and she felt the familiar thrill of the blank page, the pause before the story started.</p><p>“Demi, don’t,” Cherie said, but Demi just shook her head.</p> <p>“Almanica. But I won’t talk about that.”</p><p>Jacinda knew well enough how to dance around forbidden topics and still get the pieces she needed to enthrall an audience. And having been there herself for more than a year, she also knew well enough that Demi wasn’t actually from Almanica.</p><p>“Tell me about Sangland, then. How long have you been here, and how did you get into contortion?”</p><p>Demi sighed and drank the last of the blood from her cup with a determined air. “One question, first. Can you make me famous?”</p><p>Jacinda didn’t want to let the girl down; she looked so hungry and earnest and, suddenly, very innocent. “My books do fairly well, and I believe the city folk would be riveted by the tales of the caravan. But tell me, aren’t you already a star? I’ve seen the crowd gathered around your act, and I can tell you’re very popular. Every girl in London dreams of what you have, this freedom and applause.”</p><p>“It’s not enough. I want more. I want to be famous.”</p> <p>Poor Cherie looked as if she was about to collapse in on herself, her fair head ducked down between narrow shoulders and her face in her hands, although whether it was in embarrassment, worry, or fear, Jacinda couldn’t tell. But Demi had her head high, her eyes gazing out the window and past the moors to the sky with near-feral determination.</p><p>“Being in a book is a good start, darling. I’ll do what I can.”</p><p>Demi took a deep breath and focused. “My name is Demi Ward. I was attacked by bludbunnies, and Criminy Stain bludded me and pretty much adopted me, and when we were trying to think of some sort of work I could do to earn my way in the caravan, he suggested contortion. I was young enough and had a little acrobatic training, and Cherie was willing to teach me.” She looked at her friend fondly, and Cherie looked up and smiled. “We were instant best friends and have been performing together for five years. But that’s not really interesting, is it?”</p><p>Jacinda shook her head, her pen scritching over the paper. “Think about what it would be like to be fifteen years old, living in a cramped, dark apartment in London. Most girls your age have never been outside the city walls. You almost died and were saved at the last moment by the most notorious and handsome magician in the country. They’d salivate to hear it.”</p><p>Demi chuckled. “Never thought about it that way. I’ll try to make it sound juicy. Um. One time, the Magistrate raided the caravan with a bunch of Coppers and dogs, looking for Lady Letitia, and all the Bludmen ran away into the moors. But Cherie and I didn’t want to run far, so we hid in the lookout box on top of our wagon and watched. It was totally brutal. They pulled out the old costumer and carried her away tied to a bludmare’s rump. She beat three guys up with a sword hidden in her umbrella first.”</p><p>“But what about you? Any exciting stories of your own?”</p><p>Demi thought about it for a few moments, her face slowly falling. “I can’t think of a single freaking thing. I mean, I wake up, drink blood, perform, drink blood, and sleep. I don’t leave the caravan or go into the cities.” She swallowed hard and let her head fall to her chest. “I’m just as trapped as they are.”</p><p>The interview was not going the way she had hoped, and when the dining-car door opened, Jacinda was grateful for a reason to look away from the girl’s tears. Marco didn’t pause as he stepped into the trailer, but he did tip his head just a shade to smirk at her.</p> <p>Demi saw it, too, and her voice took on a tinge of resentment. “I mean, there aren’t even any guys here. All the good ones get taken. And Criminy makes sure I never get to talk to anyone in the crowd.”</p><p>“Don’t forget the daimon boys.” Jacinda winked.</p><p>“And Luc is looking right at you,” Cherie began, tossing her hair and surreptitiously glancing to the other end of the wagon, where a lanky, good-looking boy with red skin joked with Marco by the drink dispenser.</p><p>Demi’s eyes flicked to Marco and Luc. “I don’t know. Daimons?”</p><p>Jacinda leaned close with a conspiratorial grin. “I had a daimon lover in Paris. His name was Gael, and he was a dealer in rare books and antiquities. He looked quite calm until the spectacles came off. And then, ooh la la. Highly recommended. Since they feed off emotions, let’s just say they’re . . . highly motivated to keep you happy.”</p><p>Demi’s lips twisted up as she watched the boy laugh and turn around, tail waving. He caught her eye and winked with a daredevil smile, and Cherie giggled and hid her face.</p><p>“Hmm. Maybe you’re right. I hadn’t really considered it before, but I guess a Bludman being prejudiced against daimons is just as bad as Pinkies being prejudiced against me.”</p><p>“And he’ll speak Franchian, too. Such a sensual language,” Jacinda added.</p><p>Cherie giggled again, and when the daimon boy passed by them with a backward glance, Demi met it and nodded, just a little. Good for her. Jacinda loved an adventure, and the thought that the bright, pretty girl could be depressed in the caravan hurt the journalist’s heart. It would do the girl good to have a fling with a daimon, one as giving and energetic as Gael had been. Just thinking about it brought her thoughts back to Marco and the night before, and she watched him contemplatively as he loaded up his tray.</p><p>Even though his back was to her, she felt as if he knew she was watching, as if he could sense her eyes brushing over his shoulders, the small of his back where his shirt tucked into his breeches, a place she’d barely begun to explore. What else might have happened, had she kept her hands on the door last night? Damn the man! He was under her skin now, and she craved what she’d barely tasted. But she wasn’t about to admit it. She looked down at her notebook, where she had doodled the exact curve of where his back met his ass when she was supposed to be sketching Demi’s face.</p><p>Turning to a new page, she asked, “What about you, Cherie? Where are you from?”</p><p>The girl blushed and looked down. “Oh, I’m from Freesia. We were once a great family, but the tsarina argued with my mother, and we lost everything. Six of us lived in a wagon smaller than the one I share with Demi, all pulled by a pair of gray dappled bludmares named Snow and Ice. I fought a bludbear once . . .”</p><p>As Cherie talked, Jacinda made the appropriate noises of surprise and assent, scribbling down the details of a life that would read like a fairy tale to the city girls. Festivals, balls, bludbears, wild unicorns, and bloodthirsty peacocks. To Cherie and Demi, it was boring, but to everyone else in the world, it was a beautiful dream.</p><p>Although Jacinda’s mind was halfway on the story and aware of how valuable the tale would be, she couldn’t stop glancing at Marco in between words. It slowly dawned on her that he was purposefully taking his time, giving her ideal views of his physique as he collected food and talked to Criminy by the cauldron of vials. His mouth was quirked up as if he knew his very existence teased her, as if he was more than pleased about it. Therefore, she wasn’t surprised when he slid into the booth directly behind her. He leaned back, letting his hair brush her neck, and she went still like a dog on point, positive she could feel the warmth of his body through the wood between their backs.</p><p>It was hard to respond appropriately to Cherie with him so close, and she wondered that the girl couldn’t feel the tension, the hot and cold running through her body. But no, Cherie just prattled, innocent as the girl she seemed. Demi stared contemplatively at Luc where he sat with his slightly less handsome brother at a far booth, sipping a daimon drink and staring right back. When Cherie reached what seemed like a stopping point, Jacinda closed her notebook with a satisfied nod.</p><p>“Thank you so much for sharing your stories with me, both of you. I may not be able to crack the toughest nut in the caravan, but this is just as satisfying. It’ll be good to keep my hands busy with something worthwhile instead of sitting around, twiddling my thumbs, and doing nothing.”</p><p>Behind her, Marco stifled a chuckle and cleared his throat. Demi and Cherie shared a look of bemused doubt.</p><p>“Um, you’re welcome?” Demi said. “And you should definitely talk to Veruca and Eblick. They don’t talk much, but I think they’ve got pretty good origin stories.”</p><p>With a nod, the contortionists stood, and Jacinda rose to let Cherie out of the booth, purposefully stepping back just enough to allow her bustle to brush Marco’s sleeve. As Demi and Cherie left to deposit their bloody teacups in the washing cube, Jacinda was sure she felt a hand slip into the pocket of her skirt, but it was so stealthy and quick that she might have imagined it. She paused a moment, rolling up her notebook, but the sensation didn’t come again. Although she had planned on visiting with more of the carnivalleros this morning for research purposes, she changed plans and headed outside without a word or a look for the man behind her.</p><p>In her pocket, she found a bit of parchment hastily scribbled with pencil.</p><p>Find me later. I have something to keep your hands busy. M.</p><p>She smiled to herself, fingering the paper.</p><p>Oh, I bet you do, Marco. I bet you do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>.10.</p><p>She made him wait.</p><p>Back in her conveyance, she refilled Brutus’s tank with clockwork oil, added to her caravan notes and stored them in a new pigeonhole, and, much to her own annoyance, primped in front of the mirror, making sure she looked ravishing but not as if she were trying too hard. She’d put on her fancier corset that morning, along with the new style of stockings she’d picked up in Paris. Even if it was wishful thinking, she’d found over the years that wearing fancy underpinnings gave her the confidence she needed to face up to anything from roaring bludmares to charging warriors in buffalo chariots.</p> <p>With an odd little twinge of surprise, she realized that she had abandoned completely the idea that he might be guilty. Even without hearing his side of it, even knowing him only a few short days, she felt, bone deep, that he had not committed the crime for which he’d been accused. With renewed determination, she set out for his wagon and the answers she kept forgetting she needed.</p><p>She knocked on the door of his trailer first, but he didn’t answer, and she wasn’t willing to break in again, especially during daylight. Slipping past the clockwork bird was no problem, and she was soon exchanging pleasantries around the circled wagons, caught between wanting to win over the carnivalleros and wanting to get close enough to Marco to feel the ripple of acknowledgment her body seemed to experience every time he was near.</p><p>She found him by the target, throwing the knives with his usual offhand brand of lazy concentration. Waiting a respectful distance away, she admired his perfectly coordinated movements and the snap of his forearm that sent each silver missile thudding into the target. He didn’t acknowledge her until he’d thrown his last knife.</p><p>“Found something better to keep your hands occupied?” His playful smirk was back, so full of promise that she cocked her hips and licked her lips on instinct.</p><p>“As much as I hate to leave things unfinished, my time is too valuable to waste. I like playing games as much as the next girl, but I prefer to play to checkmate and have at least a few pieces to move around as I wish.”</p> <p>“Talking in metaphors. That’s cute.”</p><p>“As a button.”</p><p>He’d collected all of his knives from the target by then, sliding all but one into their slots on his vest. Walking toward her slowly, he twirled the last one in the air. She wore an expression of bored expectation, but inside, her heart was racing, her toes curling in her boots.</p><p>“You ready to try this again?”</p><p>She glanced around, one eyebrow raised. “I’d prefer somewhere more private, if you don’t mind.”</p><p>“Damn, woman. You’ve got a one-track mind. I meant target practice.” He jerked his chin at the target.</p> <p>She grinned to keep from showing her disappointment. “Same rules?”</p><p>“I’m upping the ante. Twelve knives, one question. You in?”</p><p>Jacinda took a deep breath, studying the painted shape on the target.</p><p>“Let me get this straight. You want me to let you strap me to a spinning target and hold still while you throw not one knife but an entire dozen? And in return, I get to ask one measly question, which you might or might not answer to my satisfaction?”</p><p>He took her hand gently and led her to the target. When he placed her palm against the shiny wood, her insides shuddered with recognition at the last time he had placed her hand, just so.</p><p>“You’re good at what you do. Trust that I’m good at what I do. There’s not a single cut in that wood that I didn’t mean to put there. It’s not as dangerous as you think it is. But I need a live assistant, and you need incentive.”</p><p>“Incentive?”</p><p>“If you want the truth, you have to work for it. You’re a woman who needs an occupation. And I think you like the excitement.”</p> <p>With a raised eyebrow, she took her hand off the wood and faced him head-on. Putting her palm on his chest with the same gentle pressure he had used on her, she softly said, “You want to tell me the truth, don’t you? But something’s holding you back.”</p><p>He looked down at her hand, considering. “Tell yourself whatever you need to hear. But you’ve got two choices: play by my rules, or go interview the lizard boy about his acid spit. You’re the one who wants something here.”</p><p>She ran her hand down his chest, hooking a single finger into his belt. “You don’t want anything?”</p><p>He pulled her hand away. “Step up or keep walking, woman.”</p><p>She detected bitterness, but she also understood that this was a dangerous dance. He wasn’t just toying with her; any misstep on her part could cause him to shut down completely. She wasn’t accustomed to jumping through hoops for a man, to dancing around rules or playing games. But she knew that she would forever regret it if she didn’t find out the truth about Marco Taresque. So she stepped up, right onto the platforms, the wood against her back a familiar caress.</p><p>“Strap me in, will you?”</p><p>He obliged, silent as he gently tightened the leathers around her ankles, her waist, and, this time, both wrists. When he knelt to pin down her skirts, she waited, breathless, to feel his hands brush her legs. Because the game was so very tenuous, her senses were on alert, desperate for his attention. It was maddening. And intoxicating. When the pad of his thumb caressed her calf, the heat in her cheeks told her that he was right: she needed the thrill of this man and his knives.</p><p>For the flash of a few heartbeats, he disappeared behind the target, and then she was spinning slowly, wondering whether the drop in her belly was from gravity or from the man staring at her as if she was the only thing on earth.</p><p>“Six knives.”</p><p>He stopped twirling one and cocked his head. “What?”</p><p>“Twelve is insane. I want a question for six knives.”</p><p>“You can’t change the terms that you’ve already agreed to.” He walked up closer, close enough for her to count the holes in the buttons on his pants when she was upside down. “For the love of all that’s holy, woman. You’re strapped to a target. I could come at you with a hatchet, and you couldn’t do a damn thing about it.”</p><p>“But you won’t.”</p><p>“Just because I’m a gentleman doesn’t mean I’m about to let you tell me how things are going to be.”</p><p>“Eight knives.”</p><p>He chuckled and turned away, walking back to his bare patch of ground. She was so riveted with the progression that she very nearly forgot that deadly steel would soon be flying at her body with only the meager armor of her corset, and that only protected her vitals and her heart. Her head, arms, and legs were utterly vulnerable. And she didn’t know how many knives he would throw, although she swore to herself that it would be fewer than twelve, because she was betting he was an honorable man with a soft spot, somewhere under the dark clothes and darker eyes.</p><p>With a smirk that echoed down all of her own soft spots, he said, “This time, don’t move.”</p><p>She barely stopped herself from saying, Yes, sir.</p><p>The first knife surprised her, slamming into the wood by her hip. They came in quick succession after that, none of them coming close enough to really frighten her. She sensed he was going easy on her, that he could have outlined her every curve with steel had he so chosen, the blades pressing against her with the tenderness of fingertips. But they were all crowded in the vast plains of red and white rings between her arms and her body. She lost count, but as he walked toward her, she noticed three knives still in his hands.</p><p>“Nine?”</p><p>“It’s a square number.”</p><p>He disappeared behind the machine, and she giggled.</p><p>When he stood before her again, he asked, “What?”</p><p>The machine slowed to a stop, and he turned the target until she was head up. “Nothing. You just didn’t strike me as a mathematician.”</p><p>“Woman, what you don’t know about me could fit in a Kraken’s belly.”</p><p>“I know. That’s why I let you throw nine knives at me. Now I get a question. What really happened that night?”</p><p>“That’s too broad. Like wishing for a million wishes.”</p><p>“You never said I couldn’t ask a perfectly reasonable question.”</p><p>He said nothing, simply pulled the knives out around her. She felt exposed and ridiculous and realized suddenly that she hadn’t given any thought to her question. The first time she had asked him where the body was, and he had told her there was no body. Which meant she’d asked the wrong question.</p><p>“Where is Petra?”</p><p>“I have no idea.”</p><p>The answer came quickly, and in a flash, he was behind her, turning on the machine. The target began to spin again and, with it, her mind. She couldn’t concentrate with him staring at her, so she closed her eyes and wracked her brain as the knives landed, one after the other, in the wood around her.</p><p>Thwack.</p><p>There was no body.</p><p>Thwack.</p><p>He didn’t know where Petra was.</p><p>Thwack.</p><p>That meant his ex-assistant had to be alive.</p><p>Thwack.</p><p>But if she was alive, where had the blood come from? He said he’d never drawn blood.</p><p>Thwack.</p><p>And why had he run, if there had been no crime? Why would he tell no one the truth?</p><p>Thwack.</p><p>She’d read every word of the newspaper, gone through her archives. There was no mention of the name Marco Taresque, not even on the broadsheets.</p><p>Thwack.</p><p>And Letitia wouldn’t have let Marco stay if she’d seen anything unsafe in his past or his future. And she wouldn’t have let Jacinda herself stay had she seen danger.</p><p>Thwack.</p><p>She was missing something.</p><p>Thwack.</p><p>Her skirts felt oddly tight, and she opened her eyes and looked down. The last knife quivered between her thighs, piercing the layers of her skirts and drawing the cloth tightly over her legs.</p><p>“What—”</p><p>His mouth quirked up in a hungry, amused smile as she spun around slowly, and she pinned her lips together before the words escaped her and she stupidly wasted a question. What on earth are you trying to do? was not the question she’d suffered near impalement to ask. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It only took one breath, and she knew.</p><p>“If you didn’t do what they accused you of doing, why won’t you tell the truth?”</p><p>He switched the target off and spun her upside down. All the blood rushed to her head, and she found her mouth inches away from his thighs. She was about to ask him what the hell he was doing, again, but she knew: he was trying to confuse her, muddle her senses, keep her off balance. It was the same tactic she was using on him.</p> <p>He sat on his haunches and leaned close to whisper, “Because a man has his pride.”</p><p>“Pride? Your pride is worth allowing the world to think you a murderer?”</p><p>He spun her right-side up and began to collect his knives as she went over woozy.</p><p>“Is that your next question? Because I can throw the knives faster, if you like. My aim is actually better when I remove my mind from the equation.”</p><p>“You’re being purposefully evasive.”</p> <p>“You want something I don’t want to give. You’re lucky I haven’t taken off for the hills.”</p><p>“Why haven’t you, then?”</p><p>He stepped close, wrapping a fist around the knife he’d thrown through her skirts. His knuckles brushed her body, making her shudder, and he held his hand there, warm and solid, his wrist against the tender curve inside her thigh.</p><p>“Because you’re like an itch I can’t scratch. I keep telling myself to disappear.” He leaned even closer, his mouth near her ear and her hands pinned, unable to reach out in any way. “And yet I keep coming back for more.”</p><p>She shuddered, licked her lips. “For which I’m glad. Gladder still if you came closer.”</p><p>“I told you from the start: I can’t give you the things you think you want.”</p> <p>He jerked the knife out of the wood, and the target shuddered against her back. That blade had gone deeper than most.</p><p>“Are you going to let me down?”</p><p>“Depends. You want one more question?”</p><p>She nodded, hoping that he would throw that knife again, so close to where she wanted other sorts of impalement. Instead of turning on the machine to spin her, however, he walked to his usual spot and said, “Really, this time, don’t move. Not a hair.”</p><p>“What are you going to do?”</p><p>His grin was fatal. “I don’t think you want to know.”</p><p>Before she could protest, a knife thunked into the wood, right against her ribs, touching her corset. Then another on the opposite side. Then one on each side of her waist. Then around her hips, the flat blades a whisper, a leaning away from her dress. Two more around her thighs, then her knees. The penultimate knife thudded beside her left ankle, and the last one glittered briefly in the weak sun before quivering in the wood beside her right ankle. But something was wrong. It burned.</p><p>“Marco . . . I think . . .”</p> <p>Blood bloomed in the green of her dress, and she tried to pull her leg away, but the blade was firmly stuck. With the skirts in the way, she couldn’t see what exactly had happened, but the pain was radiating out. It was clear enough he’d struck her, for all his bravado.</p><p>“Oh, sweet Ermenegilda.”</p><p>He was beside her in seconds, yanking out the knife and unbuckling her, ankles first, then waist, then wrists. She all but fell into his arms, the blood drained from her arms and legs.</p><p>“Is it bad? I can’t see anything. It stings.”</p><p>Marco glanced around before carefully placing her on the crate where she’d once taken his carved pins from Demi and left all but one behind. He released her as if she might break, and she curled fingers around the splintered wood and tried to make the world stop spinning. He fell to his knees, running his hands up her ankles without asking permission and pressing the place that burned.</p><p>“It’s not as bad as it might have been. Dammit, woman. You’re too pretty. It’s distracting.”</p><p>He held back her skirts, and she leaned over to see a cut just above her boot top, her new stockings sliced neatly and blooming with blood. She’d had a lot worse. But she was shaken by the combination of excitement, fear, pain, and the strange sensation of having all of the blood in her feet and nethers instead of in her brain and fingers where it belonged.</p><p>“Let me fix it up for you. Can you walk to the cassowarrel? Stupid clockwork guards shouldn’t be on during the day.”</p><p>With a shaking hand, she reached into her pocket and pulled out her disruptor. “I’m in a hurry. Let’s make trouble.”</p><p>He shrugged and stood, putting his arm around her to help her hobble to the nearest clockwork, a gangly giraffe that she froze with one jolt of blue sparks. They struggled past the automaton and around the corner of the wagon to Marco’s door. Her ankle was bleeding down her stocking and into her boot, and it stung, and she had trouble getting the disruptor back into her pocket. By the time she paid any attention to her surroundings, he was closing the door behind her and helping her onto the couch. He’d soon pulled a stool up and fetched an old wooden cigar box. Without asking, he picked up her damaged leg and laid it across his lap.</p><p>After rolling back her skirt, he unlaced her boot and slipped it off, seemingly unaware of the effect his businesslike touches were having on her body. Taking the thin silk stocking in two hands, he tore the rip wider, exposing her calf and the freely bleeding cut that she no longer really felt, thanks to his closeness.</p><p>“I don’t think it needs stitches. Do you?”</p><p>“Hmm?”</p><p>He palmed the back of her head, directing her gaze down to her own leg. “Stitches. Do you want them?”</p><p>“Not particularly.”</p><p>He chuckled and dabbed at the wound with a clean handkerchief. “It’s refreshing, a woman not losing her guts over a little cut.”</p><p>She slipped farther down on the sofa, enjoying the strength of his hands. He’d shed his gloves at some point, and she felt the heat of his touch, not to mention every move of his body as he cleaned off the wound.</p><p>“One time in Freesia,” she began, “we were beset by a peacock and a unicorn—they work together, you know. As the men fought the unicorn, the peacock went for me. Although I’d heard their beaks were razor-sharp, I didn’t quite believe it until he was licking the blood from my arm with his black tongue. That cut was far deeper than this one.” She held up her arm, rolling back her sleeve to show a white scar cutting across her forearm.</p><p>“What happened next?”</p><p>“I beat him to death with my umbrella and put his tail feathers in my hat.”</p><p>He sat back, eyed her as if she was edible. “Really?”</p><p>“I can show you the hat.”</p><p>“So fierce.”</p><p>He was still dabbing gently at the cut, and she flicked her eyes to it. It was dry and clean and no longer hurt much at all. But he didn’t stop touching her. “Hold on. I can make this easier for you.”</p><p>She bent over, her foot still in his lap, and ran her hands under her skirts to pull the bow that held the stocking up at her thigh. She carefully rolled down the dove-gray silk under cover of the green fabric, smiling coyly as the thin material skimmed over the rip and the cut. His dark eyes widened, his breath catching with a satisfying pause. She pulled off the ruined stocking, tossed it onto the floor, and nestled her bare foot back in his lap. When she resettled herself against the sofa, he gently grasped her ankle, ignoring the wound as his thumbs massaged her arch and the ball of her foot. Her head fell back, a moan escaping her.</p><p>“I’m sorry about this, Jacinda.” His voice was low, husky.</p><p>“You’re forgiven, provided you keep doing that.”</p><p>His hands froze. “I suppose it’s the least I can do.”</p><p>She wiggled her toes at him, and he sighed. There was something sad in the sound, some unknowable sense of loss, but she forgot it as soon as his touch changed, his thumb pressing with warm intimacy against the sensitive arch of her foot and running down to the cleft between her toes. With her eyes closed and the welcome but unfamiliar feeling of having one leg completely bare, she gave in to the eddies of warmth and electricity whirling through her.</p><p>“I should tell you to leave, woman.”</p><p>“You’re not going to.”</p><p>“I should pack up and hit the road. Find another caravan to hide in.”</p><p>“I’d find you.”</p><p>“I should treat you badly. Say cruel things. Set fire to your conveyance.”</p><p>“You should kiss me, Marco.”</p><p>“I most definitely should not do that.”</p><p>“But you want to.”</p><p>“What’s wanting got to do with anything?”</p><p>She leaned forward, her lips a breath away from his. “You think you’re so tough, don’t you, Marco Taresque?”</p><p>He tilted his head, his lips almost brushing hers. “Pretty sure I stabbed you today, and I wasn’t even trying.” He kissed her, lightly, teasingly, pulling back almost instantly. “You should see what I can do when I actually put my mind to it.”</p><p>“Oh, I’d like to see that.”</p><p>She tried to kiss him, but he pulled away. Her temper flared, but she tamped it down. There had to be some way past his defenses. With a sly smile, she leaned back and slowly unlaced her other boot, kicking it off and slipping her stockinged foot into his lap with the one he still held, cradled in warm, callused palms. It wasn’t difficult for her toes to find what she was looking for, and he groaned, his fingers tightening on her other foot.</p><p>“I’m going to be blunt. I want to bed you. It has nothing to do with the story. This is for me.”</p><p>She felt the effects of her words under her toes and smiled at the truth he couldn’t hide. He closed his eyes, his mouth falling open deliciously for just a moment before he groaned and stood, dumping her feet angrily on the floor. “I can’t. I flat-out can’t. You think I don’t want to?”</p><p>“I know you want to. You certainly seem . . . able. I just don’t know why you won’t.”</p><p>“I have my reasons.”</p><p>“You’ve already got a girl? You’re married? You took an oath? You’re cursed?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco turned away. “There’s no one else. But otherwise, you’re closer than you think.”</p><p>He snorted and shook his head bitterly, his back to her. She didn’t mind the view, but it pained her to see him so conflicted, to know that there was some real, deep reason he couldn’t just throw her against the wall and kiss her until she cried, even if he ached for it as much as she did. She wanted him, she liked playing and flirting with him, and she realized that as little as she knew about him, she cared for him. And he was hurting.</p><p>She stood, wrapping her arms around him and putting her cheek against the solid curve of his shoulder. He smelled familiar and warm, wood and metal and the same incense she remembered from the caravans she’d visited on her way to find Criminy’s. She didn’t grind herself against him, didn’t let her hands roam. She just held him.</p> <p>“I’m sorry for pushing you, Marco. I thought you were just flirting with me, enjoying the back-and-forth. I didn’t know there was an actual impediment. I’ll back off. Getting a story is one thing, but I’m not the sort of journalist who tears people down. All along, I just wanted to prove you were innocent. But if you don’t want that to be proven, if you can’t take this farther, consider the issue closed.”</p><p>She pulled away from him, her hands lingering briefly, wistfully, on his biceps. Silly. She felt silly now. Pursuing him when he didn’t want to be pursued. Pushing him when he didn’t want to be pushed. Coming back for more, when he’d made his position clear, told her again and again it was a game, not real. Whatever his reason, it just seemed cruel to them both to continue on as she had been, goading and pressing and toying with him for her own amusement and pleasure.</p><p>As she bent to slip on her boots and leave, an embarrassed blush high on her cheeks, he murmured, “This issue damned well isn’t closed.”</p><p>Before she could straighten and ask him what he meant, his hands caught her hips and pulled her back, hard, against him. Jacinda gasped and straightened and wobbled, her foot half in her boot. He steadied her back against his chest, one arm around her waist and the other traveling up to her jaw to hold her, tightly but gently, against the length of his body. With a small sigh, she pressed against him, forgetting everything she’d just said about respecting his boundaries.</p><p>His lips found the edge of her ear, and he turned her face to kiss along her throat, half frantic and half tender.</p> <p>She didn’t want to say it, but his earlier conviction, his passion, had left its impression. “But you said—”</p><p>“I know what I said.”</p><p>His tongue slid past the lace edging of her collar, his fingers deftly undoing the buttons as his mouth undid the woman. It took every ounce of fortitude she had to wrap an arm around his neck, grab a fistful of hair, and yank his lips away from her skin.</p><p>“I told you I would back off, and you agreed it was for the best?”</p><p>He shook her hand off and nipped the shell of her ear. “I did agree with that.”</p><p>“Then why is your other hand cupping my ass?”</p> <p>“Because it’s perfect.” Both hands slid down to briefly frame the part in question, his lips warm on her neck. “And because I’m sick of running from the past. And the future.” He flicked two more buttons and pulled back her collar, exposing her entire throat. “You can run, if you still want to.”</p><p>She let her head fall back over his shoulder, her mouth against his ear. “I never wanted to run at all.”</p><p>He caught her throat in one hand and turned her face, their lips meeting, half open, and she realized that they’d never once kissed normally, lined up like they were meant to. Thus far, it had always been sideways, upside down, over her shoulder, her back against his chest. She didn’t care; she didn’t want anything average. The fierce abandon of their tongues, their mixed breath, his hand slowly sliding down her open collar, seemed fitting for a wild creature like him. Caught between his hands and mouth, spine twisted and body pulled taut, she kicked off her boot and gave in to him entirely, to taking whatever he would give her, heedless of his best intentions.</p><p>With sudden ferocity, he swept her up into his arms, carrying her toward the back room of the wagon. “I want to see you.” He kicked open the door and laid her gently on a wrought-iron bed neatly made with a quilt of patchwork silks. “All of you.”</p><p>She stretched her arms overhead, lifted her bare foot to let the hem of her dress slide up her calf and give him a view of creamy skin. Then, with a slow and wicked smile, she reached to grasp the headboard, arms spread wide, fingers curled around the iron bars.</p><p>“Reminds me of being strapped to your target.”</p><p>“Mm. You forgot something.”</p><p>With a matching smile, he took an ankle in each hand and pushed them apart until she lay there, spread-eagled on his bed, as he climbed up to straddle her. She couldn’t help admiring the way his black breeches stretched tight over his thighs, making her fingers twitch around the iron bars. His boot tips hooked over her ankles as he found the next button on her jacket and slipped it open.</p> <p>“You city women and your buttons,” he mused, and she shook her head.</p><p>“I’m not a city woman. Haven’t lived in a city since I left university.”</p><p>He undid another button, traced a fingertip down her throat. “What are you, then?”</p><p>“Nothing that has a name.” He flicked another button, this one just over her heart, and before she could elaborate, his mouth was on her, his tongue tasting her throat as his fingers continued downward, exposing the edge of her corset. She unclenched the bed frame, but he caught her hand and put it back firmly.</p><p>“I like you like this, spread out for me. If you let me enjoy myself, I promise you won’t regret it.” His lips nibbled her clavicles, his tongue tracing the fine lines of her bones. “I told you: I like to take my time.”</p><p>“I’ll do my best. But I’m not one for following orders.”</p><p>“Consider it a polite request, then.”</p><p>His tongue dipped into the valley between her breasts as he finished with the last button of her jacket, spreading the thick cloth from chin to waist and revealing an emerald-green corset that made her fair skin glow like porcelain held before the fire. She wanted so badly to touch him, to enjoy the softness of his dark hair and the breadth of his shoulders and the smart, enticing curve of his ass, but she was painfully aware of what had happened the last time she’d moved her hands from his chosen place before he was satisfied. The frustration heightened the touch of his fingertips, callused from flicking blades and perfectly nimble with softer flesh as he gently eased her breast from under her corset. Her nipple hardened and pearled as he pulled it into his mouth, licking and tasting it. His fingertips found her other nipple, rolling and rubbing it, making her squirm to be free of the confines of stays and thick satin. He teased from one to the other before pressing them both together and tonguing both of her nipples at once, a sensation she’d never experienced but that made her throw her head back with a strangled moan.</p><p>“You make that noise again, I’ll have to do something about it,” he murmured, his breath hot against her flesh.</p><p>“If you’re daring me to dare you, then I dare you.”</p><p>Before she’d finished speaking, his tongue was in her mouth, messy and wild and wet and all too brief, and then he was kneeling between her legs, his hands on her ankles under the hem of her skirts. His knees against her thighs made her squirm, as did the painful slowness with which he slid her skirts and petticoats up, revealing her legs inch by inch.</p><p>“Oh, this is pretty.” He ran a fingertip up and down the lone silk stocking she still wore.</p><p>“When I put them on this morning, I was thinking of you.”</p><p>“Holy mother, they go all the way up. Maybe the cities aren’t so bad.” Walking his fingers up her leg from ankle to thigh, he lifted just that side of her skirt to expose the dove-gray stocking. She closed her eyes and writhed, so impatient for him to reach the ribbon bows that connected the Franchian silk to her corset.</p><p>Reaching the curve of her hip, he paused.</p><p>“You weren’t lying.” His fingertip stroked the place on the crease of her thigh where an Almanican shaman had etched her skin with needle and ink in an elaborate ceremony. The stylized quill tattoo had been hard won, and she treasured it beyond words. After a short pause, he kissed it gently and said, “Beautiful,” and she exhaled in relief.</p><p>He leaned over, taking the black ribbon in his teeth and pulling so slowly that she could hear the bow spring free. It took everything she had not to let go of the iron bars and dig her nails into his back, not to beg him to give her something besides exquisite frustration.</p><p>“Mmm.” He rubbed his cheek against her hip, the rasp of his stubble delicious against her skin. “I like the stockings, but I like what’s underneath better.” He took the silk in his teeth and lightly dragged it down her thigh, his breath hot on the inside of her leg as he exposed her flesh to the cool air. When his nose grazed the tender curve of her ankle, she shivered, and he slipped the stocking free with his teeth and tossed it onto the floor.</p><p>Jacinda lifted her eyes, and he was staring straight at her, a look of such profound emotion on his face that she was momentarily bewildered. There was hunger and lust and darkness and a strange sort of sadness in him, and before she could ask him why he was so worked up over simple love play, he was nibbling up her ankle, his hand on her other leg matching pace and pulling up the other side of her skirt to expose her completely. His tongue and lips traveled up her calf, paused to dip into the tender spot behind her knee, and then began the ticklish, devilish, delicious trip up the inside curve of her thigh, closer and closer to the place where she’d been dreaming of his touch. He was drawing it out as long as possible, making her breath build to pants and causing her body to strain toward him.</p><p>“Damn, Marco, but you can work a woman up.”</p><p>“I’m very generous.”</p><p>“Generous with torture.”</p><p>“It’ll be worth it. You won’t believe the things I can do with my tongue.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m more interested in what you can do with other parts of your body.”</p><p>Marco’s lips froze with a quick intake of breath, almost as if she’d wounded him, even though there wasn’t anything she could have done, spread out as she was.</p><p>“I hope I live up to your expectations,” he murmured, licking gently up the inside of her thigh until he exhaled, slowly, at the core of her.</p> <p>Jacinda held her breath, waiting. He was so close, his thumb nearly brushing her, just next to his mouth. Her entire world started and ended with the place where she waited for his touch, and she realized she hadn’t wanted anything this badly in a long, long time.</p><p>When his caress came, it nearly ended her. Just the tip of his tongue, wet and gentle, barely dipping to taste her as his thumb pressed, softly, just beside it. She was already wet, dripping with want, and she whimpered and went stiff, beyond desperate for more. Lick by lick, he teased her, tasted her, touched her, pressed in the tiniest bit, nowhere close to satisfying her, taking his time as he had promised. One finger slid into her with infinite patience, his tongue probing her most secret of places. Marco was just as frustrating in bed as he was on his feet, and she loved and hated it with equal measure.</p><p>Since Liam, all her lovers had been fast and brash and pounding and innocently selfish, easy to lose herself in for a night and just as easy to forget come morning. But Marco’s touch brought her back to herself, reminded her of what it was to yearn and want and need. She couldn’t escape it, couldn’t escape him, couldn’t escape the feeling writhing in her chest, the hunger, the needing.</p><p>“Please.”</p><p>One long, deep lick, tongue flat, enough to make her shudder. “Please what, sweetness?”</p> <p>“Just . . . please.”</p><p>He put his lips against her and hummed, sending a thrum throughout every cell of her body. “Hmm. Please go more slowly?”</p><p>She groaned. “Curse you and your damn lips, Marco Taresque.”</p><p>He paused, set his forehead against her thigh. “Care to rephrase that?”</p><p>“Yes. No. Faster. More.” He licked her again, and she whimpered. “Please. More.”</p><p>He chuckled against her, slid a second finger in beside the first, and curled them as if he knew every inch of her body as well as he knew his knives. His tongue began to work her with purpose, pushing in and out in perfect time with his fingers, and she met his rhythm with every breath, with the little moans and whimpers that escaped her as her head thrashed back and forth. Her fingers were numb around the iron bars, her hands forgotten in the frenzy he’d built inside her.</p> <p>“Better?” he asked.</p><p>“So close. Still not enough. All of you. Now.” After one last, forceful, hard push of his tongue, he withdrew, leaving an emptiness behind where his fingers had brought her to the edge of a release she felt sure he wasn’t ready yet to give her. The knowledge was thrilling, that he was so attuned to her body after so little time, that he was reading every signal she threw. She felt like an instrument in his hands, as if he knew how to coax songs from her that she didn’t yet know how to sing.</p><p>Marco moved up, one knee at the juncture of her thighs, flush against the place his fingers had filled almost perfectly. “You haven’t let go of the bed yet. Good girl.”</p><p>He wrapped his hands around hers and bent his mouth to her lips, kissing her long and deep and fitting his knee more snugly between her thighs. His fingertips trailed down her arms, tracing over the fabric of her undone jacket until he came to the plain of her exposed chest, her breasts still floating over her corset and aching for his touch. He licked and sucked and teased them, but she could feel his patience turning to hunger, could sense that he couldn’t go on like this much longer, drawing out her pleasure while denying his own. One by one, he unlatched the hooks down the front of her corset, kissing down the valley of fevered flesh until the last one popped free, exposing her utterly. As she gulped a deep breath, he licked a long line straight up from her navel to her throat. In a heartbeat, he was back at her navel and circling there, briefly, before dipping below the waist of her skirt.</p><p>Before she could twist her hips to show him the buttons, he’d already undone them and begun to slip the heavy skirts and petticoats down her hips, his mouth lingering on the ticklish flesh of her hipbones. She lifted herself up, helping him slide the skirts off completely and toss them onto the floor. With a sigh of bliss, she wriggled all over, glad to be free of the heavy layers of fabric. His hands ran reverently over the curves of her, tracing and cupping and brushing as if he’d never seen so much of a woman before. When she looked up, she was moved by the softness and awe in his eyes. He caught her looking and leaned over to take her face in both his hands and kiss her with such tenderness that her desire melted away, for just a moment, into bliss.</p><p>And then his finger found her again, testing the wetness pooled between her legs.</p><p>“I think you might be enjoying this.”</p><p>He began to ease in one finger, and she tossed her head and whimpered. “I want to touch you, Marco. Please let me touch you.”</p> <p>He shook his head no, but ever so softly, he said, “Do, then.”</p><p>Her fingers ached when she unwound them from the iron, and her head swam when she sat up. With tentative hands, he helped her draw off her jacket and unwrap the corset, and then she was completely naked before him, a field of sweetly flushed freckles and soft red hair. The way he stared with liquid violet eyes, as if she was an angel, made her feel cherished and beautiful and fierce. Jacinda slipped from the bed to stand between his knees, the wood floor cold under the balls of her feet.</p><p>With trembling hands, she began unbuttoning his shirt, pausing only to gasp when he cupped a breast in each hand and held them together, licking every curve. The soft black linen fell open, and she untucked his shirt and drew it down over his shoulders, skimming her hands down the smooth, hard muscles of his biceps and scratching her nails through the dark, curly hair on his forearms. Her eyes were drawn by a series of thick white scars that stood out from the golden skin of his shoulder, side, and chest.</p><p>“What happened?”</p><p>He grimaced and shook his head, turning it into a smile. “Being a daggerman has its perils. Like beautiful women throwing themselves at me.”</p><p>She knelt in one smooth motion, his knees on either side of her. Kissing down his chest, she ran her hands over the curve of his ribs, over hard muscles, down to that elegantly delicious line where his hipbones made a V pointing somewhere lovely. Marco held perfectly still, his eyes closed, letting her do her work, his hands making fists in the coverlet as if he was afraid to touch her. After running her hands along his thighs and to his knees, she sat back on her haunches and slowly, so slowly, undid the buttons on his breeches. He leaned back and groaned as he sprang free, and she was smugly gratified by the evidence of his desire, that he had taken such time to drive her mad with hands and mouth while he felt the same hunger she knew.</p><p>The deadly Marco Taresque looked so very vulnerable this way, torso bared and head thrown back, throat exposed and eyes closed, wild hair tangling down his back. And she very much wanted to shock him, to drive him mad. And so, with her hands on his knees, she bent and took him deep into her mouth. He groaned and tensed and growled as she tasted him, just as slowly as he’d tasted her.</p><p>“No . . . I don’t . . . I can’t . . .”</p><p>Without pulling away, she innocently mumbled, “Can’t what?” around him.</p><p>With a growl, his hands caught her waist and pulled her to standing, and her excitement ratcheted up a notch with his sudden ferocity and need. He pulled her close and gazed up into her eyes, and it was like falling into a cave of ever-twilight, into a dark, echoing, endless chasm.</p><p>“God, you’re unspeakably beautiful.” He laid his face against her side, nuzzling, and she tugged fingers through his dark, silky hair, waiting for his next touch, for him to finally initiate the release they both craved. But he made no move.</p><p>“What do you want, Marco?”</p><p>His lips tickled her ribs as he spoke. “Everything. I want to taste every inch of you and meet you a thousand ways for a thousand nights and hear you scream in my ear as you shatter under my mouth.” He pulled away, traced her curves up and down with his fingertips. “But since you’re asking, let’s start with this.”</p><p>He spun her around and sank his teeth into her ass briefly as his fingers found her, spreading her lips and pulling her back gently. With a smile of satisfaction, she spread her legs to straddle his knees. Ready as she was, he slid in easily, perfectly, deliciously, making her gasp as she settled against him. He let out a strangled sigh and set his forehead against her shoulder, and for just a moment, she imagined she felt the wetness of a single, solitary tear.</p><p>Then Marco’s arm wrapped around her, pinning her hands to her chest, and he rocked forward tentatively. With a little “Ooh,” she moved with him, grinding against him slowly. He moved her hair aside and caught the nape of her neck with his lips, finding a steady rhythm that battered against her, striking deep inside. With his arm still around her, his fingers wrapped around both of her wrists, she leaned forward, testing his strength, changing the angle just slightly, and his groan thrummed down her neck, down her spine, adding to the pooling pleasure at the core of her. His free hand roamed her body, cupping her breasts, pinching her nipples, and skimming her ribs, following the crease of her thigh to the crux of her, where he rubbed in time, moving faster in counterpoint to his thrusting.</p><p>Jacinda threw her head back and wrenched her arms free with a growl. Her hands found his thighs, finally, and she rode him without shame or regret or thought, becoming a being of pure hunger and desire and hot, wet sweetness, with no past, no future, no deep-down sorrow. As many times and ways as she’d imagined being with Marco since the first time she’d laid eyes on him, it was better still than that.</p><p>He fit perfectly with her, moved perfectly, knew just how to work her flesh with mouth and hand in a wild frenzy that drew her into ecstasy, into forgetfulness, into that pitch-black, starlit abyss where nothing mattered but this, but him, but the movement, the feeling, the riding. And still they moved faster and faster, until only his arm kept her upright and in one piece. She arched her back against him and whimper-screamed, her head over his shoulder and her fallen hair streaming down his back as he caught her mouth and swallowed the panting whimpers of her crest. With one last cry, she clenched her muscles around him and kissed him hard, until she felt the rhythmic pumping of his own release. The kiss ended when his climax ignited a second bloom of pleasure deep inside her, and she had no choice but to lean back against him and ride it out in one long, high scream. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She went silent and collapsed against him, and Marco fell bonelessly back onto the bed, taking her with him. Rolling off his body, she put her head to his chest and smiled at his slow, steady heartbeat.</p><p>“Damn, woman,” was all he could say before closing his eyes and going completely limp, his booted feet still on the floor and his undone breeches flung open.</p><p>“Damn, yourself.”</p> <p>He flinched, and she nuzzled closer. “Maybe I should just say ‘Wow’ and leave it at that.”</p><p>“Wow, indeed.”</p><p>He curled an arm around her shoulders and pulled her close, brushing her hair back from her temples. “If I’d known it would be that good, I might not have resisted for so long,” he said.</p><p>“I had my suspicions.” She ran a hand over the dark hair fuzzing his chest. “But I always like it when I’m right.”</p><p>.11.</p> <p>The afternoon passed with that sweet, slow discovery of things above the neck. He liked poetry and read well, and she curled on the bed happily while he paced in breeches and boots and wooed her with words. She found his violin case under the bed when she stubbed her toe and persuaded him to play a little for her. It was slow and mournful and made her think of looking up through pine boughs at the winter sky, just before the snow came. After delving into her girlhood, he unearthed that she had once sung opera, and clad in nothing but her skin, she sang a few rusty arias for him, for which he went still and wide-eyed and reverent, which gratified her.</p><p>He kept an eye on the clock, and she felt a twinge of sadness when he rose to prepare for the night’s show. His breeches had been utterly ruined, and she watched appreciatively as he pulled off his boots and stockings to change into a new pair that fit just as well. For all their leisurely and time-consuming lovemaking, she hadn’t seen his body fully exposed before then. Jacinda lay back and watched him go through his ministrations as if he were a classical statue brought to life, all strong lines and ideal curves and masculine power balanced with beauty and just the right dusting of dark hair. Only the scars marred his perfection, and she felt a twinge of doubt. Had she just slept with a murderer? He’d given her his body but not his truth. Had he shared himself with Petra like this . . . before she disappeared?</p><p>“You going to come watch me throw some knives, sweetness?”</p><p>She jumped guiltily. Of course he wasn’t a murderer, no matter how dangerous he appeared, no matter what the carnivalleros whispered, no matter what some biased rumor rag printed. He was watching her in the mirror as he brushed his hair and tied on his bandanna, and her heart softened at the smile in his eyes. She reluctantly stood and stepped into the petticoats puddled on the floor. She’d been here for hours, naked and learning about the mysterious man she’d needed so badly to bed. But now . . .</p><p>“I’ve seen the show. And I like the private show better. I’ll be in my conveyance, working.”</p><p>His eyebrows went down. “Abandoning me already?”</p> <p>She stepped behind him, pressing her bare chest against his back and wrapping her arms around him. He was about half a foot taller than she, and on tiptoes, her chin fit just over his shoulder with a possessive intimacy that made her feel warm all over.</p><p>“You have your work, and I have mine. I’m not some fawning girl who’s incomplete without a man and needs to follow you about, mooning like a fool. But I’ll be counting the moments until the caravan is closed for the night and you’re knocking on my door.”</p><p>That seemed to satisfy him, and he turned his head to kiss her cheek. She went back to the pile of clothes, unlacing her corset so that it would fasten down the front again and then pulling the laces just enough for decency. The skirt billowed over her head, and the jacket covered her arms. Her legs felt naked and free without the stockings, but the matched pair was ruined now, thanks to his clumsy knife throw.</p><p>“That’s twice you’ve missed,” she said, holding up the slithery gray silk to show the bloodstained slice where his knife had found her ankle. She’d totally forgotten about the wound, couldn’t even feel it anymore as she laced on her boots.</p><p>“The first time was your fault. You dropped the card.”</p><p>“And the second time?”</p><p>He stepped close, fully costumed and ready for the show, all vestiges of vulnerability replaced by the raw power that had originally drawn her to him against her will. “The second time wasn’t an accident.”</p><p>“You hit me on purpose?”</p> <p>He tangled his hand in her hair and pulled her close, kissing her hard and deep and reminding her how very easily he could make her insides quiver.</p><p>“And look how nice it turned out.”</p><p>“You sly dog. I can’t believe you cut me just to get me into your wagon. I would have followed you in here willingly.”</p><p>“Followed me? Girl, you broke in once already! But I wanted it on my terms. I wanted you in my arms, not driving me before you like some idiot sheep. And I wanted to give you a reason to run, if you were looking for one. Getting involved with me . . . well, I’m dangerous. And I’m not a man who lets go of things easily.”</p><p>“Like your past, for example?”</p><p>A rueful sadness filled his violet eyes. “Don’t rush me, sweetness. A man can’t give up all his secrets at once.”</p><p>“I just want to know—”</p><p>“I’ll tell you. In time. I promise.”</p><p>She sighed melodramatically and buttoned up her jacket. He watched her fingers, not blinking, his desire to see the jacket back on the ground all but palpable. “Fine. Then I’ll be waiting to screw it out of you in my conveyance after tonight’s show.”</p><p>His eyes raked her as she twisted up her hair. “What’ll you be wearing?”</p><p>She smiled, smug as a cat in cream. “Nothing but a smile.”</p><p>Before he could kiss her, she turned and left, letting her hips swing. She didn’t look back, just shut the door behind her as she stepped down to the ground. Far away, she could hear the banks rumbling over the moors, packed with city people, their pockets filled with clinking vials and coins. The carnivalleros were all in the wagons, preparing, as Marco was, for the night’s show. Being seen by the audience before everything was perfect was considered a grand misstep, and Criminy himself was walking the perimeter with a copper monkey scampering at his side, checking that all was in place.</p><p>The smug and knowing smile he gave her made her roll her eyes. What did she care if the ringmaster knew what she’d been at with the knife thrower?</p><p>“Finding success in your endeavors, Mrs. Harville?” he asked, giving her a polite bow.</p><p>“I’m getting what I need, yes.” She kept walking toward her conveyance, and he fell into step beside her, swinging the monkey up onto his shoulder.</p><p>“You’re not distracting my daggerman, are you?”</p><p>“As much as possible, yes.”</p><p>“That would upset me, if not for my wife’s charming insistence that your continued presence is the only way I can keep him among us. It’s hard to find a good knife thrower, you know. Especially one with such a lively reputation. I hope you don’t plan on ruining it with the pesky truth.”</p><p>“You’re just vexed that I’ve been chasing him instead of interviewing you for your chapter in the book.”</p><p>The ringmaster threw his head back and laughed, a wild sound that suited him perfectly. “For a journalist, you certainly have an honest streak,” he said. “Now, go back to your conveyance and find some new stockings before the two-headed Bludmen smell what you’ve been up to and get hungry. It would be such a shame if you died before you immortalized me in prose.”</p><p>“I don’t take orders from you.”</p><p>“I’d just hate to see you get hurt before you can completely corrupt my daggerman.”</p><p>“Marco’s a big boy. And I’m not one of your carnivalleros, you know.” She flounced away to hide her embarrassment.</p><p>“Keep telling yourself that, pet,” he called with another mad laugh. “You’re practically his assistant, which means you’ll be asking me for wages soon.”</p><p>A shiver ran up her spine at the word “assistant,” but when she turned back around to shout at him, the ringmaster had disappeared.</p><p>“I’m no one’s assistant,” she muttered under her breath. “I’m a goddamn journalist.”</p><p>She was beyond the caravan lights now, out among the wilder winds of the moors. A bludbunny darted out for her, and she kicked it away, wondering where Brutus had gotten off to. She’d left the metal dog on Marco’s doorstep, but she’d seen no sign of it since emerging and had forgotten to leave it with orders. It had malfunctioned before and was programmed to return to the homing beacon in her conveyance. Still, out here, without her guard or an escort, she felt ill at ease.</p><p>The field between her conveyance and the warm lights of the caravan felt larger, wilder, and colder than it did in the daylight. Thunder grumbled menacingly, and Jacinda hurried faster, stumbling over a rogue bludbunny and almost falling into the waist-high grass. Back on her feet, she broke into a jog and didn’t look back until she stood on the steps of her conveyance, unlocking her door by gaslight with shaking hands.</p><p>Gazing back down to the caravan that was beginning to feel like home, she shivered. Criminy was nowhere to be seen, and the carnivalleros were in place, waiting for the crowd that was moving down the moor in a frightened cluster of bright silks. No one looked toward the shadowy conveyance on the hill. And yet she felt eyes on her, danger hovering near, dogging her every step since she’d left Marco’s wagon.</p><p>Perhaps she should have gone to watch Marco’s show, paid her copper to wander again among the glittering golden lights and laughter, where things felt safe. But no. Foolish fears had never stopped her before, and they wouldn’t now. She didn’t know if Criminy had been joking about the dangers of his pet Bludmen and the wild animals, if there was any real threat other than the same strangely oppressing darkness that hung always over the moors. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Drawing her curtains, she realized what was missing. She wouldn’t feel safe again until the dangerous daggerman was back in her arms.</p><p>.12.</p><p>Once she was fortified with a cup of hot tea splashed with whiskey, Jacinda took great care preparing herself for Marco’s visit. She’d spent time within the labyrinthine walls of a sultan’s harem once, and the women had taught her all the ways to entice a man using the full force of her beauty. With candles arrayed along the windowsill and soft rain beginning to play in counterpoint to the song she hummed under her breath, she bathed with a soft cloth and rubbed rich creams into her arms and legs. She plucked every hair that was out of place, lined her eyes with kohl, and brushed her hair a hundred strokes until it shone like fire in the candlelight. And although she’d told Marco she’d wear nothing, she slipped into a nearly transparent lace shift she’d found in a Paris boutique while shopping with a daimon courtesan.</p> <p>Midnight came, and she arranged herself on the bed like an odalisque, waiting for Marco’s knock to ring out over the sudden thunder of raindrops on the conveyance roof. At one o’clock, she yawned and went to check the door, to see if perhaps a shadowy form was crossing the moors under a dark umbrella, his eyes deeper than the sky. The door swung inward, and movement caught her eye. An envelope, pinned to the wood by one of Marco’s knives.</p><p>Her hands shook as she pulled out the knife and slammed the door on the sputtering raindrops. Had he made good on his earlier threat and run from her, even after the intimacy and mutual hunger they’d shared? Was he having second thoughts about having a physical relationship, much less the real one she was starting to crave?</p><p>There was no wax seal, and the paper was damp but not soaked. She hadn’t heard the knife, nor had she seen a shadow under the door. Moving to her bed, she clicked on the lamp and unfolded the paper. The familiar writing was hurried and frantic, the paper crumpled as if he’d written it against the conveyance wall.</p><p>Meet me at 3 Cocklebur Lane in Scarborough. I’ve leased a small cottage by the shore where we can be alone for a while. I’m ready to tell you everything.—M.</p><p>Her heart had sunk upon seeing the envelope instead of the man, but it rose again when she read the last line. If he was ready to tell her the truth, surely that meant he felt the same attraction, longing, and fondness, that the dangerous daggerman was ready to finally open up.</p> <p>She shed the nightgown and dressed in her heaviest adventuring gear, because even if her heart was ready to rush to him, her mind knew well enough that crossing the moors alone at night could be dangerous, even in a conveyance as well appointed and rugged as hers. Although the seaside was lovely, there were still bludseals to consider. Strapping her leather corset on over her canvas dress and pulling on thick gloves and the bracelet she always wore, she willed her heart to still and sought her thickest boots. Best-case scenario in this getup: she’d enjoy Marco’s delicious slowness as he labored to undress her.</p><p>Brutus hadn’t returned to her conveyance, which troubled her. The mechanical dog was programmed to return when its orders were in question, but sometimes heavy rain could cause it to short out. She dug out her emergency homing beacon and pressed the red button, willing the dog to live up to the grand price she’d paid for it and function according to its programming. When it hadn’t arrived at the door within five minutes, she decided she would ready her weapons and go anyway. Making brash decisions was her general mode of operation, and she wasn’t about to let one malfunctioning metal mutt keep her from Marco’s body and heart. She’d never trusted clockworks too much, anyway; not enough brain for her needs.</p><p>Powering up the conveyance, she flicked on the outside lights and rain wipers and undid the brake. The caravan was dark as she rumbled past, with only one light shining from the dining car. She smiled to herself, hoping that Demi and the daimon boy might be sitting in a booth, fidgeting with their cups and flirting awkwardly. For a homeless collection of mismatched wagons and people, the caravan was starting to feel a little like home.</p><p>Scarborough was the nearest city, and she remembered passing the white chalk cliffs and mostly abandoned seaside villages on her way to find the caravan. She followed the black ruts left by the banks over the lashing moor grasses, all the way to a high hill that showed the shifting sea, black and unfathomable, beneath a towering, jagged city like a beehive plastered in flotsam. When the bank tracks met the road to Scarborough proper, Jacinda turned left, maneuvering carefully down the white shell path that led to the beach roads. The rain had turned to drizzle, and the road was cut diagonally to keep it from being too steep and toppling the various conveyances of seagoers and fishermen. Her fingers clenched the trembling wheel as hard as they had curled around Marco’s bed earlier.</p><p>As the main road leveled out and began to split off onto smaller avenues, she anxiously looked for Cocklebur Lane. She nearly missed the narrow white path bordered by a cliff, turning the conveyance on two wheels at the last possible moment. It was a tight fit, and the road was more of a footpath, but she wasn’t about to get out in the dark, alone, to feel her way along sharp rocks.</p><p>A light soon appeared—a lantern hanging from the front porch of a stone cottage that would have been charming with just a little more attention. The porch sagged, the flowers in the pots were dead and crumpled, and a mobile of shells and bones clattered helplessly in the breeze from the ocean. At least there would be no blud creatures about, this close to the salty sea spray. Well—almost.</p> <p>She parked the conveyance and went to her bed, where she’d laid out the many weapons she’d picked up during her travels. The boomerang, the machete, the crossbow, the seawater gun, the brass knuckles with claws that fit over her fingers perfectly. Her main concerns here were giant lobsters and bludseals, which had developed a special oily coating that allowed them, alone of all blud creatures, to touch the sea’s salt and survive. Practically nothing worked against lobsters, of course. Nodding to herself, she tied the machete’s leather holster around her waist, took up her notebook and pen, and stepped down to the sand.</p><p>Outside, the drizzle had given way to air heavy and cold with mist, the sea spray floating toward her like formless ghosts and stinging her eyes. The wildness of the place appealed to her, and she smiled up at the sky, at the electricity latent in the clouds. She started up the path, her boots crunching on the crushed white shells. When the door opened to reveal Marco’s shadow silhouetted with light, she sped up and gave him her fondest smile.</p><p>“I’ve been waiting for this,” she called over the sea’s pounding.</p><p>He said nothing as she skipped up the creaking steps, and she squinted to see his face in the blinding light. What she saw chilled her to her bones. It wasn’t Marco. It was a woman with a knife.</p><p>“I’ve been waiting, too,” the woman said.</p><p>.13.</p><p>“Where’s Marco? What is this?”</p><p>The woman stepped forward until Jacinda could separate her form from the shadows. She was petite and perfect, with large, arresting golden eyes and shiny black hair cut short to show ears heavy with tribal baubles. Looking Jacinda up and down, the girl twirled one of Marco’s knives between her fingers, quick and sure.</p> <p>“So this is what Marco was waiting for? You’re so pale and round, like a city cow. To tell you the truth, I’m disappointed.” She pointed the knife at Jacinda’s hand, now on the hilt of her machete. “Throw that into the yard, and put your hands up. Now. I’m as quick with a blade as my beloved Marco, you know. He taught me well.”</p><p>Slowly, her eyes never leaving the girl, Jacinda obeyed, untying the belt and tossing the heavy knife out into the sand. The girl nodded slowly, and with a sick turn of her stomach, Jacinda suddenly realized whom she faced.</p><p>“So you must be Petra. Funny, you don’t look murdered.”</p><p>“Neither do you. Yet.”</p><p>Jacinda stiffened, her eyes sliding sideways, looking for a weapon, an egress, an ally. The girl was clever. She must have been responsible for Brutus’s disappearance, and Jacinda had utterly fallen for it, despite her paranoia. But where was Marco, and why did he say nothing? If he was in the house, surely he would come to her rescue?</p><p>“What have you done with Marco?”</p><p>The girl smirked as if they shared a joke. “Nothing he hasn’t done with you and me. He’s tied up. Come in and see.”</p><p>Jacinda didn’t move, and the girl twirled the knife in her face.</p><p>“Let me be clear: come in and see, or die on the porch. And don’t try anything funny, or he takes a blade in his soft parts.”</p><p>Swallowing hard, Jacinda nodded. The girl opened the door wider and jerked her head inside. With one last, desperate look to her conveyance and the freedom of the sea, Jacinda stepped into the blinding light of the windowless cottage.</p><p>Lamps were hung everywhere, and a fire smoked in the heart. The walls were whitewashed and crumbling, the wind whistling in through cracks and carrying flurries of sand and dust. The smells of salt and fish and decay were overwhelming, with just the faintest hint of copper. Bile rising in her throat, Jacinda turned to find Marco pinned to a makeshift target of weathered wood. Ropes held him spread-eagled, tied tightly around wrist and ankle and wrapped thickly around his neck, his face an angry shade of puce. Knives nestled in the wood against his sides in blooms of blood. His eyes were wide with fear and anger, and her gray silk stocking trailed out of his mouth, silencing him.</p><p>“Marco . . .”</p><p>He shook his head no.</p><p>“You wanted the truth, didn’t you? Here’s the truth. Marco is mine and always has been.”</p><p>Jacinda’s temper flared. Before she could stop herself, she said, “He wasn’t yours this afternoon.”</p><p>Quick as a whip, Petra slapped her—using the hand not holding the knife. Jacinda’s cheek went red, her fury burning up to the roots of her hair.</p><p>“Did Marco tell you he likes to take his time? Because that’s where I learned it.” Petra walked to Marco, slender hips swaying in patchwork breeches, and gently ran the blade of the knife down his cheek. “Can’t go killing you quick, no matter how much you try to provoke me. Plus, I promised I’d tell you everything, and I think someone should know, at least for a little while.” She snatched Jacinda’s notebook and tossed it into the fire, where the pages caught and curled over, black. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jacinda had never been angrier, but Liam had taught her, long ago, how to continue using her brain in a life-or-death situation, even when her body and temper betrayed her. It was the reason she was alive, and he wasn’t. She took a deep breath through her nose, her hands shaking and cold.</p><p>“So tell me.”</p><p>Petra spun, flinging her knife at Marco in a glittering silver arc that, before now, had given Jacinda a little rush of excitement. Now she just waited to see if the girl had drawn blood and, if so, how bad it would be. The knife was a hair’s breadth from Marco’s wrist but hadn’t pierced his skin.</p> <p>“We grew up in neighboring caravans, my Marco and me. He was taught knife throwing, and even though I wished to learn with him, I was sent among the women to cook and clean and care for the snot-nosed brats. He gave me one of his knives, and I practiced in secret, and whenever our families circled the wagons, Marco would help me, teach me to throw. When it became clear that I caused nothing but trouble among the women, I was sent to his caravan to be his assistant.” She walked to him, pulled out the knife, and paused, assessing him. “There was hope that he would marry me and settle down, but he resisted. And I did my best to break his resistance, didn’t I?”</p><p>Jacinda felt the bile rise in her throat, watching the girl run her pinkie finger around Marco’s lips. He couldn’t move his head, but his nostrils flared with anger.</p><p>“Has he kissed you sideways?” Petra said. “I taught him that.”</p><p>Fighting for control but unwilling to let the little fiend gloat, Jacinda rolled her eyes and crossed her arms. “Isn’t this all a bit petty?”</p><p>“Petty? Have you ever loved someone for ten years, offered them your heart and your body on a platter again and again, and had them pat your head like you’re a tame dog? Every day that he strapped me onto the target, I prayed that he would hit me, that my blood or tears would force him to care for me even an ounce, touch me with any true feeling, but he never missed. Not once.” She walked up to Jacinda, pointing the knife right at her eye. “Until yesterday.”</p> <p>“You’ve been following him? Watching him?” Jacinda swallowed. “Watching us?”</p><p>“Ever since that night on the outskirts of London. Ever since I promised him everything and he turned me down, wouldn’t even bed me. And I sliced him up so badly he went on the run out of shame. The Deadly Daggerman they called him. Everyone thought it was my blood. But he was too much of a coward to fight back, too much of a coward to admit he wasn’t man enough to take a girl’s virginity. Too much of a coward to admit he’d been beaten by a woman half his size. Didn’t even care enough to strike me, dripping with blood in his own wagon. Just ran away in shame.”</p><p>Jacinda was lost in her imagination, remembering the picture in the paper, the cleaver splattered with blood. And now she knew where that story had come from: this girl. Her, and her knife, and Marco’s blood seeping from those white scars she’d found on his body.</p><p>“Running away in shame doesn’t sound like the Marco I know.”</p><p>Petra sneered and flung the knife again. It thudded into the wood between his thighs, barely a finger’s width away from his pants. He flinched and looked away. “You don’t know him like I do. He plays a good game, knows how to make a girl scream, but he can’t close the deal. He’s not even a man. Did you know he’s a virgin?” She cocked her head, staring at Jacinda with narrow eyes. “Or he was.”</p><p>Stunned, Jacinda looked at Marco’s face, gauging his reaction. His eyes were wide, begging. And she knew, deep down, that if Petra knew the truth, they would both die here tonight.</p> <p>“Perhaps he has his reasons,” she murmured.</p><p>“Damn his reasons!” Petra roared. “What happened in his wagon today? No blasted windows. Did he kiss you? Did he use his mouth on you? Did he say that he loves you? Because he doesn’t. He doesn’t love anything or anyone.” The girl’s eyes closed, tears trailing from long eyelashes. She stormed to the target and wrenched the knife from the wood, slamming it back into the target again and again in the unscarred space between his arm and his leg, closer and closer to his chest. “Why can’t I make you love me, you bastard?”</p><p>With Petra’s back turned, Jacinda slipped the bracelet off her wrist and felt around to the reed that had been painted black. Marco’s eyes flew wide, and she shook her head at him. As Petra spun back around, the knife pinched between thumb and forefinger and arm flung back to throw, Jacinda put the reed tube to her lips and blew explosively. A tiny feathered dart found Petra’s cheek as the girl’s arm jerked downward, her knife flying straight for Jacinda’s chest.</p><p>.14.</p><p>The blade pounded into Jacinda’s belly, and she gasped and stumbled backward. She didn’t feel anything at first, just the impact of the throw. And she wasn’t willing to look down yet and see the damage, because as long as Petra was standing, so she would be standing.</p><p>Across the room, the slender girl twitched, her fingers clawing at the tufted dart embedded in her cheek. Jacinda felt a small point of pride; the dart’s poison would work even faster, considering the needle had pierced the girl’s mouth. Through saliva and blood, it would swiftly travel all through her body, rendering her paralyzed. Jacinda had picked up the unusual weapon and the skill to wield it in the jungles of Africa and kept it always on her wrist, well aware that most of Sangland’s inhabitants didn’t even know such a thing existed. Brutus was the muscle, but this tiny needle was the brains.</p><p>As Petra threw the dart to the ground, she tripped and fell on her side. Only then did Jacinda allow herself to look down at her belly and see the damage done by a spurned woman with wicked aim. But all she saw was a dented scar on her leather corset. Running her hands up and down, she realized that the knife must have struck her with the unsharpened side rather than the piercing tip. Thank heavens for small miscalculations. She exhaled in a rush and plucked the dull silver from the floor before rushing to the target and pulling the stocking from Marco’s mouth.</p><p>“Are you hurt?” he asked, breathless, and she could only shake her head no.</p> <p>“You?”</p><p>“Yes. But I’ll live. Will she?”</p><p>Jacinda looked down at the girl’s form, still but for shallow breathing.</p><p>“There’s enough poison in that dart to take down a lion, so I don’t actually know what it’ll do to a person. The bludgazelle I shot with one never got up again. But she won’t be able to hold a knife for a long time, in any case.”</p><p>Petra’s eyes rolled to her, glazed and unfocused, and Jacinda stepped around her to untie the rope choking Marco’s neck. When she’d finished with his wrists and legs, she helped him step down and immediately checked the bloodstained places left on his body by Petra’s knife. She felt the tiniest shred of pity for the pathetic creature and her mad obsession but not enough to unleash her on the world again, no matter Marco’s pride.</p><p>“It’s not as bad as it was last time.” He put one hand to his side and pulled it away bloody. “She hasn’t been practicing.”</p><p>“I can’t believe you let her go, after that.”</p><p>He chuckled ruefully. “To be quite honest, I was in no shape to chase anyone. Just dragged my carcass off to heal. I never dreamed she would be so obsessed. I had no idea. If I had known she was following me, watching me. Watching us . . .” He shook his head, reached to squeeze her hand.</p><p>She squeezed back. “You did warn me that being a daggerman is a dangerous job.”</p><p>“So is being a daggerman’s lady,” he said with a smile somehow both grateful and mischievous. “Now, aren’t I late for a date in your conveyance?”</p><p>She raised an eyebrow at him. “You are. And as I tend your wounds, you’re going to tell me what it was like, losing your virginity this afternoon.”</p><p>He looked down, sheepish. “It was welcome. And way overdue. But I think you’ll be especially interested about what happens now. That’s the part you might regret.”</p><p>.15.</p><p>Late as it was and considering they were both in shock, they blew out all the lamps and left the cottage for the short walk to Jacinda’s conveyance—after tying Petra securely to the target. She was still breathing, and Jacinda planned on delivering her to Criminy Stain’s justice by the light of day. But first, there was business to attend to. With the conveyance door firmly locked from the inside and the sea pounding just beyond, Jacinda dumped her weapons off the bed and stripped Marco of his shirt. It wasn’t the way she had planned to get him naked, but it would have to do.</p><p>She tended his wounds with water and a healing salve from her travels, then bound the shallow slices with soft bandages made of her torn stockings. As she fed him biscuits from a tin and brewed the tea, he leaned back against her pillows and rubbed his eyes tiredly.</p><p>“So that bracelet you always wear—it’s been a weapon all along?”</p><p>Jacinda grinned and sat beside him, careful not to jostle his wounds as she held up the bracelet of reed tubes. “Small, pretty, hidden in plain sight. It’s a traditional Abyssinian weapon, although putting it on the bracelet was my idea. They tend to wear them as necklaces or stuck through their ears.” He traced a finger over the inside of her wrist. “A little ostentatious, for my tastes. Liam said . . .” She trailed off, and he curled his fingers around hers.</p><p>“What did Liam say?”</p><p>Jacinda squeezed her eyes against the tears that always threatened. “He said I should have a hole put through my nose, as the Abyssinian warrior women do. He was half serious.” A few tears escaped, and Marco caught them on his finger and gently stroked her cheek. “I’m sorry. I shouldn’t—”</p><p>“There’s nothing wrong with sadness, and I don’t expect you to stop loving someone you lost. Never be sorry for talking about him.”</p><p>“He died defending me, you know. It was so stupid. Should have been just another scuffle in the street. But the man who made a vulgar offer for me . . . he was big, and he hit hard, and Liam’s head struck the stone wrong. He died in my arms. And that’s when I decided I had to learn to defend myself.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Marco held her close, stroking her back. “I can’t complain about that. You certainly saved my life tonight, sweetness. And I’m grateful.”</p><p>For a few moments, she finally gave in and allowed herself to grieve in Marco’s arms, feeling safe for the first time since that night. When the kettle whistled, Jacinda took it as a sign to put away her sorrow. She straightened, brushing the tear trails away and getting up to fix the tea.</p><p>“Enough about me. Stop stalling and spill. I was promised a story about a handsome virgin.”</p> <p>“Always so hungry for a story.” He settled back against her sultan’s pillows. “I guess Petra already told you what you originally wanted to know. She caught me on the moors tonight, on the way to your door. She was always too fast and strong by half, for such a little thing, and she said she’d kill you outright if I didn’t go with her. What she told you about our childhood was true—and it’s also true that I saw her as a little sister, not a lover, and definitely not a wife.” Jacinda handed him a mug of tea, and he wrapped his fingers around it with a grateful smile. “But the main issue is a prophecy my grandmother made when I was very young, although I always called it a curse. Nonna’s a fortune-teller. Not like Lady Letitia—she reads palms.” His eyes went far off. “ ‘Listen well, Marco Taresque. Where you sow, you’ll reap. Where you lie, so you’ll stay. Guard your virginity, for the woman who takes it will be your own forever. Choose carefully.’ ”</p><p>Jacinda shivered, and not only with the realization of the gift he had given her that afternoon and the repercussions to come, if one believed in prophecies. She remembered all too well that one strange night she had spent with a traveling caravan outside of London on her way to find the famous Criminy Stain. Like a knife in the heart, she recalled exactly the way one old woman had regarded her, eyes twinkling across the bonfire.</p><p>“I think I met her. She told me how to find Criminy’s caravan,” she said softly. “She admired my leather corset and told me to be careful.”</p><p>“Sounds like Nonna. As I grew up, I asked her again and again if there was a way around it, if she would look at my palm again and see if something had changed. There I was, young and handsome, girls throwing themselves at me, and I couldn’t get my grandmother to elaborate on whether any seed I spilled would shackle me to a woman forever. It was torture. Pure torture. Even if I’d wanted to bed Petra, I would never have taken the chance.”</p><p>“But you’re so good at . . .”</p> <p>Marco smiled sheepishly, looked down, ran a hand through his hair. “If you’re a man like me, living in a caravan, you find a way to please women so well they don’t speak of your noble refusal to bed them. They only talk about your proficiency and generosity in other realms.”</p><p>“So today . . .”</p><p>He reached over, took both her hands in his own. “I should have told you first, but I couldn’t turn away from you anymore. Everything about you calls to me. I either had to take you or die of longing. I’ve never wanted a woman, wanted anything, so bad.”</p><p>She cupped his face in one hand, noting for the first time that his eyes were the same wild violet as the old woman’s. “Do you think your grandmother knew it would be me? And that’s why she told me where to find you?”</p><p>He chuckled, nestled his cheek in her palm. “Who knows what that old devil sees? When we sat around the fire as children, she used to beckon us close with a finger. ‘I know a secret,’ she would say. ‘I know who goes to heaven and who goes to hell.’</p><p>“ ‘How do you know, Nonna?’ ” I would ask.</p> <p>“Her smile was twisted and dark and smug as she answered, ‘You go where you think you will go.’ ”</p><p>Jacinda chuckled and kissed his cheek. “What does any of that mean, Marco?”</p><p>“It means you saved my life tonight, and I’m indebted to you. The night that I disappeared, Petra went mad, out of control. Just like tonight. Threw my own knives at me, raged against me, tried to take me against my will. The punishment for hurting your own in a caravan is death, and I couldn’t bring myself to condemn her for loving me to the point of madness. She ran away, and I ran away. I couldn’t admit the curse of my virginity. I couldn’t send her to death. I couldn’t stay there, among my brothers, carrying scars from a woman. So I ran away and let people say of me what they would.” He pulled her into his lap with a groan, cradling her gently against his bandaged chest. “I’ve never told anyone about what happened. I didn’t think I ever would. I was basically committed to dying a virgin with a very talented tongue because I’d never met anyone I wanted to be shackled to forever.”</p><p>She twined her fingers with his. “Why me?”</p><p>“Because when I saw you for the first time, I finally understood the obsession Petra had felt for me. I wanted you, no matter what. Even if it meant confessing everything to you, even if it meant driving you away to protect you. And even if it meant that you stabbed me in the heart rather than spend forever by my side. I just knew.”</p><p>She snorted. “You didn’t show it.”</p><p>“I’ve gotten good at hiding my real feelings behind my smoldering good looks and wicked smile. Besides, if I’d made it easy for you, you wouldn’t have chased me. And I do like the way you chase me.”</p><p>“Are you going to miss that, now that you’re stuck with me?”</p> <p>He stroked her hair and flicked the brass clasps down her leather corset, one by one. “I don’t think you’re ever stuck, Jacinda. If you’ll have me, I figure it’s my turn to chase you—all around the world on your adventures. I want to see more of sang, and once Petra’s gone, I’ll be totally free.”</p><p>“Oh, I’ll show you the world.” She smiled and stood, dropping her corset with a thud and walking to her desk. She rolled back the top, selected a new notebook, and cracked the cover, opening it to the front page. “But first, you’ve got to heal. And I’ve got a book to write about a certain caravan. Starting with Marco Taresque, the Deadly Daggerman who never misses a target.”</p><p>“I missed once,” he reminded her.</p><p>“You might have nicked my leg, but my heart took all the damage.” </p> </body></html>"]