["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>~TRYSTAN~</p><p>There was nothing but sorrow and music keeping Trystan glued together. Mari was everything to him. He couldn’t think about the void in his life or how it would be without her. Trystan’s fingers slid along the neck of the guitar as he strummed, playing the song that brought him solace. When his world cracked apart the song always rose to the front of his mind.</p><p>The weight within him felt like it was too much to bear, crushing his bones while he still breathed. Nothing changed. Life continued down the same hellish path, beating him in every way possible. Maybe it’d be different if he gave up, but he wouldn’t. That was Trystan’s problem—he didn’t stay down. It was like that with his father. It didn’t matter how many times his father’s hand flew, he got back up. It was the same with his life. It didn’t matter how many bad hands he was dealt, he always got back up.</p> <p>A numb tingling filled his body again as he played softly. There was no peace. No refuge. He was alone. There’d always been an ember of hope burning within him, but when Mari said she didn’t like him, it felt like someone ripped his lungs out. The ember died, shriveling within his chest, leaving a dull ache in its place. Mari’s words left him mute, unable to respond. It was the one time he didn’t get up again. He couldn’t.</p><p>Trystan sat silently on the stool, softly playing the guitar in his lap, and felt the familiar sense of loss fill him. When his voice finally came, he sang without realizing it. Barely whispering, Trystan’s mouth formed the words that spilled from his heart. The lament, the song—Mari’s song—it helped purge him. It gave him a false sense of control, which was something Trystan desperately needed.</p><p>In the moments when Trystan was weakest, it was like there was nothing else—no air touching his skin or filling his lungs. There was no stool, no music stand. He was just a voice, a heartbeat, and a breath of song. That was why he failed to hear the door, failed to hear her footfalls inching closer and closer.</p><p>By the time Mari was standing in front of him it was too late. She saw him. She heard him. She knew who he was and what he’d been hiding. Her slender fingers touched her lips as she said, “You’re Day Jones.”</p><p>Trystan’s guitar slipped from his lap and slid to his side as he stood. Shock and fear twisted his stomach into a knot. His throat was too tight to speak. Instead of attempting an explanation, he stared at her with his pulse pounding in his ears. Mari stood there, looking at him with her jaw dangling open. She stared into his eyes, unblinking, waiting for him to speak.</p> <p>A thousand thoughts flew through Trystan’s mind, but he asked, “Why’d you come back?”</p><p>The shock melted off of Mari’s face. She stood a few paces away from him. Uncertainty filled her eyes. It was like she’d never seen him before, like she never noticed the guy fighting so hard to survive that he’d do anything.</p><p>Her pink lips pressed together. The scent of strawberries filled his head as he remembered kissing those lips not so long ago. Mari’s eyes darted away from his. She made a few false starts, before saying, “I was going to tell you something, but I think you might have something to tell me instead.”</p><p>Trystan stared, his body tense. The grip on the neck of his guitar tightened, but he didn’t put it down. The faint golden light doused Mari softly, highlighting the gentle curves of her face. He couldn’t stop looking at her.</p><p>Taking a deep breath, he replied, “There’s nothing to tell.”</p><p>Mari stepped forward with an incredulous look on her face, “Are you seriously going to deny it?”</p> <p>“No, there’s just nothing to tell.” Trystan’s heart felt like it was going to explode.</p><p>The fame that Day Jones achieved wasn’t something he wanted. He knew what would happen if he revealed himself—reporters would start digging into his personal life. It would expose everything his father had done to him. The thought made him sick. Trystan saw the offers and the endless requests to reveal his identity, but he couldn’t. Now, it was everything he could do to keep it a secret. He considered deleting the page, but he thought that might give him away. If someone was watching when he did it, they could track him down. The risk was too great, so he left it there and watched the comments and likes swiftly grow to staggering numbers.</p><p>“Why didn’t you tell me?” she asked softly. Mari’s big brown eyes lowered like she was afraid he wouldn’t tell her.</p><p>Trystan sat back down on the stool and pulled the guitar onto his lap. He looked down at the instrument, his dark hair falling into his eyes. “There are some things that are too hard to tell—you know what I mean?” He glanced up at her to see her nod and step closer. Trystan lowered his gaze to the strings and slowly began strumming again. He waited a moment before asking, “Is the door closed?” His voice was so soft he could barely hear it.</p><p>“Yes,” she breathed, watching him closely.</p><p>Trystan nodded and started the song again. He didn’t plan to sing, but as he played, the words poured through him and he couldn’t stop. This was what he wanted, he wanted her to know. He wanted her to believe him. Trystan forced himself to look her in the eye as he sang and felt the bottom of his stomach lurch into a free-fall that didn’t seem to end. Mari’s big brown eyes locked with his as he sang. She breathed slowly, her slender fingers still pressed to her lips.</p><p>Suddenly, the song didn’t seem melancholy anymore. It was Mari’s song and Mari was here. The corners of Trystan’s mouth pulled up slightly, giving him a ghost of smile. His voice and the music flowed together, mingling and conveying the things locked inside of his heart.</p><p>Mari watched him. She didn’t move. Her beautiful body remained still, standing in front of him, her lips slightly parted. He took in every inch of her, every soft curve, and every twisting brown curl as she watched him sing. When Trystan played the last note he looked down at his hands. The music faded until the only sound he could hear was his breath.</p> <p>Mari’s body was tense, her slender arms rigid as her hands fell to her sides. She flexed her fingers one by one like she was nervous. Her voice was soft, curious, “Who is she?”</p><p>Trystan glanced up at her. He pressed his lips together and closed his eyes. He shook his head, indicating that he couldn’t answer. The pit of his stomach lifted as his throat tightened. Trystan could feel the words in his mouth, the confession his lips that he wanted to bare, but he couldn’t force it out. She had to see it for herself.</p><p>When Trystan looked up, Mari smiled down at him sadly. She sucked in a quick breath and it was like flipping a switch. Something changed, but he didn’t know what.</p><p>“I won’t tell, you know.” Mari said. “I didn’t mean to walk in on you.” She stepped toward him, closing the gap between them and rested her hand on his shoulder. Even though it was only a moment, only a small touch, Trystan nearly jumped out of his seat. Her touch set his skin on fire. It made him want to touch her in return, but he couldn’t. She didn’t want him. She didn’t like him that way.</p><p>Heart pounding in his chest, he tried to sound like his old self, but his voice was still too timid. Nodding, Trystan said, “Thank you. I don’t want anyone to know. I thought I was alone...” His voice trailed off. Mari released his shoulder and moved to the couch. Sitting across from him, she remained on the edge of her cushion like she might jump up at any moment. Her hands were clutched in her lap, gripping her pointer finger like she was wringing it out.</p><p>“You were alone. I didn’t hear anything until I stood by the door.” She forced that smile again, the one that said her insides were being ripped apart, but he didn’t understand why.</p><p>Glancing at her, Trystan stood and walked the guitar back to its place in the corner. He wished she would talk to him. He’d do anything to get that look off her face and make her laugh. Instead, he asked, “What’d you want to tell me?”</p><p>Mari stiffened, “What?” She startled, like there was a loud crack next to her ear.</p><p>Trystan watched her for a moment. Something wasn’t right, but he didn’t know what. His emotions were so out of whack. Maybe he was reading her wrong? Brow pinched, he said, “You said you were looking for me, to tell me something.”</p><p>Trystan put the music stand away and stuffed the sheet music he was working on back into his pocket. When he was finished he walked to the couch and looked down at her. God, she was beautiful. Her skin was pale and perfect. The way her mouth curved made him want to kiss her. Trystan scolded himself. He had to stop acting like this around her. For whatever reason, she came back. He wouldn’t chase her off again. Having her as a friend was better than not having her at all. That thought made his gut twist. There was no way he could deal with losing Mari.</p><p>“I was.” She blinked up at him a few times like she’d forgotten something important. “I decided to take Tucker’s pass. It wasn’t upstairs and neither were you. I assumed you took it.”</p><p>Trystan reached into his pocket and pulled out the pink paper. His eyes never left Mari’s as he reached out and handed it to her. When her fingers brushed his hand, he wished he could pull her into his arms. Instead, he tried to capture some of his old swagger and hide just how much she affected him.</p><p>Trystan’s lips pulled into a soft smile as she reached out, but Trystan didn’t release the paper. She glanced up at him. “I thought you didn’t want it,” he breathed, stepping closer to her.</p><p>“I changed my mind,” she whispered, tugging the pass, but he didn’t let go.</p><p>“Your mind is usually a difficult thing to change.” He grinned, looking down at her perfect face.</p><p>She smiled, “Not when there’s a good reason for it.”</p><p>“And what reason is that?”</p><p>Her brown gaze drifted over his face before returning to his eyes. She tilted her head to the side and her dark hair fell over her shoulder. “A sad song, being sung alone in the basement.”</p><p>The way she said it gave him hope. Something inside of him came to life and told him to hold on tight. The way her lips wrapped around the words, the way she said them softly, glancing away for a moment like it was something she shouldn’t admit, made it difficult to breathe and wiped the smug expression off his lips.</p><p>Trystan tilted his chin up, still watching Mari. Carefully, he asked, “You think you’ll figure out who the girl in the song is, if you hang around me long enough?”</p><p>“I know I will,” she said with a soft voice that was exceedingly confident. It made the corners of his lips curve up. “You wear your heart on your sleeve when no one is looking, but I’m always looking. I’ll see it, even if no one else does. I’ll figure it out.” Her words sounded like, I want to figure it out. I want to know who brought you to your knees.</p><p>Her fingers were still touching his, each of them clutching the pass. As they spoke, their faces became closer and closer. Trystan could feel her breath on his lips. Every inch of his body was tingling. He wanted to say something great, reach out and take her face between his hands, and press his lips to hers. The way she was looking at him, the way her mouth was so close to his, made him think that she might be thinking the same thing, but he couldn’t believe that any more. Before she stormed off, he would have thought she liked his attention, but now—he didn’t know anymore. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Before he did something stupid and scared her off, Trystan smiled and released the pass. “I hope you do.”</p><p>CHAPTER 2</p><p>~MARI~</p><p>Did I just say that? Did I actually confess that I was always looking at Trystan? I was so flustered. Trystan stood there, his warm skin brushing mine with that playful look in his eye. He tugged the pass hard and I tugged back. We were nose to nose by the time he said that. His lips were so close, so perfect. I sighed inside, wanting to fall into his arms, but I couldn’t. He was lost in some other girl. If I threw myself at him now, it wouldn’t end well. I’d be second to whoever stole his heart.</p> <p>I heard myself say, “I’ll figure it out,” not knowing what I’d do after that. I just didn’t want to leave. Part of me wanted to confess why I came back in the first place. Heart racing, I looked into his vibrant eyes, unable to look away.</p><p>Trystan grinned and released the pass. “I hope you do.”</p><p>I replayed the whole thing over again in my mind as I walked to class in a daze. Trystan Scott was in love. As if that wasn’t weird enough, he was also Day Jones. I didn’t even know what to ask him about that, so I didn’t ask anything. I cursed myself for thinking I could tell Trystan that I was in love with him. Naivety often blindsided me. I’d listened to that Day Jones song enough times to know that whoever wrote it was completely and totally lost to love—even if she didn’t even know he was alive.</p><p>A spark of jealousy flamed to life inside of me. I knew Trystan was alive. Every inch of me knew Trystan was alive and wanted to know him more. Sighing, I put my books on my desk and slid into my seat. I’d walked so fast that I’d gotten to class early. While many students still lingered in the halls, hardly any were at their seats, yet.</p><p>Katie arrived half a beat later. I heard her voice before I saw her face. She slipped into the seat next to me asking, “Did you tell him?”</p> <p>I shook my head, not bothering to look up. “Couldn’t.”</p><p>“Why not?” Katie was pumped, ready to support me however I needed, but she couldn’t tell what I needed. “You’re killing me! Tell me.” She shook my arms as she said it and I sat upright in my seat.</p><p>I glanced at the front of the room. The bell would ring in a second. Mathboy started to hand back papers. When he passed Katie’s desk, she practically drooled a puddle on the floor.</p><p>“Later. I’ll tell you later.” Just as I finished saying it, a wadded-up piece of paper nailed me in the back of the head. Katie and I turned in unison looking for the source.</p><p>Brie Parker. She had that horrible smile on her face, the one she wore after she did something really bad. I was in advanced math and Brie wasn’t. Since the school budget didn’t pass this year or last, there wasn’t an honor’s class. Instead they combined a class of nerds with the class of burn-outs who were a year older than us. It had to be hell for the teacher. I didn’t like it much either. It meant I had to hear about Brie and Trystan all last year while they dated. Sometimes he had come into the room and taken her in his arms. Every other girl was jealous, enviously watching Brie and Trystan. When they broke-up, there was a lot of chatter about who Trystan would date next. It drove Brie crazy. Trystan bounced from girl to girl, while Brie snagged the first thug she could wrap her pointy little fingers around. She made sure to slobber all over her new boyfriend in front of Trystan regularly.</p><p>I hated her guts before, but after Brie got me in trouble the other day I hated her even more. I figured out that I must have done something that pissed her off, but I had no idea what. Throwing stuff wasn’t the normal backstabbing Brie-method of humiliation. She was usually more subtle, more devastating than that. It worried me that she seemed to have chosen me as her new target. There would be more crap like she pulled the other day. I’d hoped that Trystan humiliating her would have made her focus on him. As far as I could tell, she didn’t change targets. Maybe it was because Trystan was already on her hit list.</p> <p>Katie snatched up the paper and hurled it back at Brie’s face, but Mathboy chose that second to walk in front of her. The paper wad nailed him in the back. He turned around and cocked his head, staring straight at Katie.</p><p>“Really?” he asked as a brow drifted higher on his face.</p><p>Katie flushed scarlet and she turned around in her seat. Mathboy picked up the paper-ball and stuffed it into the crook of his arm and continued to pass back papers. When he stopped in front of Katie’s desk, he placed another of her tests in front of her, along with the wadded paper. Brie was sniggering from the back with her clones. When the hot guy finished passing out the papers, he left the room to do something else. The teacher walked to the front of the class and started the lesson.</p><p>On the side of the crumpled paper, there was a blue pen mark that looked like a number. It wasn’t there before. I poked it with my pencil and glanced at it several times to get Katie to notice. When she did, she smoothed the piece of paper and saw Mathboy’s phone number. The day got a lot more interesting after that.</p><p>As Katie and I walked to my locker after school, she leaned in close to make sure no one could hear her over the sound of slammed lockers and hallway chatter. The last bell had rung. There were ten minutes before I was supposed to be at practice.</p><p>“What’s with you?” Katie asked, bumping my shoulder. “You’ve been out if it since lunch.”</p><p>I was out of it. I couldn’t stop thinking about Trystan, about that guitar in his lap, and the beautiful tone of his voice when he sang. I’d never heard him sing before. It was breathtaking and heartbreaking at the same time. Whoever caught his attention did a good job.</p><p>A jolt of jealousy shot through me, straightening my spine. I glanced at Katie. I couldn’t tell her what happened. I couldn’t say that Trystan was Day Jones. I promised I wouldn’t say anything, even if I didn’t understand why. Revealing that he was Day would have meant financial independence. He could leave this place and never look back, but Trystan left the agents’ requests unanswered and kept his identity a secret.</p> <p>Clearing my throat I said, “Nothing. Everything. I can’t get him out of my head.” I stared blankly ahead. I didn’t want to lie to her, but felt I had to. “He doesn’t feel like that about me, Katie.”</p><p>The smile slipped off her face, “How do you know if you didn’t tell him?” She leaned closer to me, clutching her books to her chest. Her eyes darted back and forth to make sure no one else could overhear us.</p><p>“Because he told me that he likes someone else.” That wasn’t a lie. Not totally. His song said he liked someone very much. He sounded like he was in love with her. I didn’t understand how he could have written that, and sang that way, if he didn’t. Swallowing the lump in my throat, I stopped in front of my locker and took a deep breath before opening it. I tossed my books in as Katie put a hand on my shoulder.</p><p>“I’m sorry, Mari. But at least you know now. You can move on. Find someone else.”</p><p>I nodded and stared into the open locker like I was forgetting something. “I know.” And I knew there would never be anyone else like Trystan. Every time I thought I knew all there was to know about him, another thing popped up—like Day Jones. It drew me to him more, making him too irresistible to forget.</p><p>CHPATER 3</p><p>~TRYSTAN~</p><p>Tucker sat in the first row like he always did, pinching the bridge of his nose as he watched the actors on stage. Everyone wondered why he taught all the theater classes, since he appeared to hate it so much. There were rumors that he was paying his dues, being the youngest English teacher in the school, but Trystan wasn’t so sure. At times he saw the subtle smile on Tucker’s face that said he enjoyed it. The man may have been new to teaching, but it also gave him passion some of the older teachers were lacking. Tucker didn’t seem to think anyone was a lost cause, which was probably why he paid attention to Trystan when the rest of his teachers couldn’t wait to shove him out the door.</p><p>Tucker stood and stomped up the steps, his gut shaking as he went. His voice was strained, “Brie, dear—” he started and she beamed at him, bating those blue eyes like she thought he was going to compliment her.</p><p>Trystan stood opposite Brie, his arms folded across his chest and rolled his eyes. Brie shot Trystan a nasty look when Tucker wasn’t looking. She was still pissed about her skirt going over her head. Brie’s expiration date on revenge was never. He’d been waiting, but so far she didn’t seem to be plotting anything.</p><p>As Trystan watched Tucker coach Brie, he looked away. Everything about her irritated him. When she messed up, she’d pout and toss her golden hair over her shoulder. Her bottom lip would slowly push out until it looked like she’d cry. It kept her from getting the correction she needed.</p><p>Trystan couldn’t believe how fake she was and that he failed to see it sooner. Brie smiled and said something. Tucker walked her through her lines again. Trystan stared into the stage wing, peering through the darkness, looking for Mari. Instead of seeing the girl who stole his heart, he only saw her empty chair. She was downstairs. They didn’t need her to prompt anymore, and Tucker had sent her into the prop room to dig something up.</p><p>Trystan couldn’t stop thinking about Mari. She consumed his thoughts to the point that he didn’t hear his own name.</p><p>“Scott!” Tucker bellowed.</p><p>While Tucker coached Brie, he’d retreated to the other side of the stage and slid onto the table. He sat there, dangling his legs over the side and staring at his feet, while Brie played dumb. When people thought you were stupid, they didn’t expect much from you. Trystan knew that trick. It was one of the reasons he’d been assigned someone to run lines with. No one knew the other reasons.</p><p>Trystan looked up slowly. He’d been so focused on the memory of Mari listening to his song, the way her face looked as he sang to her, that he failed to hear Tucker. Coolly, Trystan lifted his gaze and said, “Yes?”</p><p>Tucker folded his arms across his massive chest and looked at Trystan like he was crazy. Tucker jabbed his thumb at Brie, “Run through the end of the second act with her.” When Trystan didn’t move, Tucker added. “Now.” The large man turned, huffed as he descended the stage stairs, and walked back to his seat. Clapping his massive hands, he bellowed, “Top of the second act people.” Those who weren’t supposed to be on stage cleared the stage, leaving Trystan alone with Brie under the spotlight.</p><p>As Trystan slipped off the table, he saw a sliver of light cut across the wall backstage. A moment later, Mari appeared. Her long curls dangled down her back as she rounded the stage, appearing next to Tucker below. She handed him something too small to see and went back to her metal chair in the wing.</p><p>As Trystan’s gaze followed Mari back to her seat, Brie stepped closer and whispered with her ruby red lips a little too close to his face, “You’ll never nail that. Her mom’s on the school board and her dad’s a doctor. There’s no way they’ll let their only daughter anywhere near scum like you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Good thing your parent’s didn’t care then, huh?” Trystan’s gaze cut to Brie.</p><p>The snake-like smile that spread across her face fell as his words hit her. “Fuck you, Trystan.”</p><p>“Anytime, Brie.” Trystan smirked, as Brie’s face contorted into a scowl that resided in evil bitch territory. Brie folded her arms across her chest and turned away. Venom radiated off of her. He’d pay for that later. He knew every jab, every insult he hurled at her would be repaid tenfold, but Trystan didn’t care. Brie needed to be knocked down a few pegs and he didn’t mind doing it, not when she kept trying to screw with him.</p><p>Tucker yelled, “From the top. Now, people.”</p> <p>They started again. The guy in the lighting cage changed the lights on the set so there was a single golden spot on center stage. Its broad beam was soft, spilling light across the stage like a streetlight on a dark night. Trystan moved to stage left and started his lines again. He had no trouble with this part. As the scene went on, they moved closer together. Romantic tension was rising steadily. Tucker didn’t stop them. Brie played her part well, but not as well as Mari. Trystan said his lines with conviction. They were perfectly played, because he pretended Brie was Mari, the girl he wanted and couldn’t ever have. It fit perfectly into that scene and made it easier to act opposite Brie and not puke on her.</p><p>They ran through the act perfectly. Everything was flowing at a steady rate toward the end of the scene. Trystan’s stomach was pooling with dread. That act ended with a kiss, a passionate kiss. To make matters more awkward, Trystan could feel Mari’s eyes on him, watching him get ready to kiss someone else. He couldn’t think about that now. If he wasn’t half way convincing, Tucker would have them start over.</p><p>With every ounce of charm he had in him, Trystan pulled Brie close, gently wrapping his fingers around her waist. Brie let him, and slipped into his arms like she belonged there. The scent of her perfume filled his head. At one time it had been attractive, but now the scent repelled him. He breathed through his mouth, inhaling as little as possible. Brie pressed against him, letting him feel her curves.</p><p>Trystan’s voice was deep and seductive. He acted as though he were saying the line to Mari, “I’d do this.” Trystan moved in slowly and pressed his lips to Brie’s. Revulsion shot through him, but he didn’t stop.</p><p>It’s Mari, he told himself. Pretend she’s Mari. Trystan closed his eyes and splayed his hands across Brie’s cheeks, kissing her a second longer than he should have. The students in the wings got wrapped up in the steamy kiss. Trystan could feel all eyes on him, and for once, he wished they weren’t. It was the emptiest kiss he’d ever had.</p> <p>After all this time, he finally understood what Mari meant—that a kiss was worth something—that it meant something. This was the difference between a shallow kiss and one that he craved with every ounce of his being. When Trystan opened his eyes, he looked Brie in the face. For once, she was silent. Shocked. They both stared at each other as the spot light faded and curtain swung shut.</p><p>Trystan dropped his hands and stepped away. He felt sick, like he’d done something wrong.</p><p>“Trystan,” she said his name like he had a tremendous effect on her. Brie stared at him with her red lips parted, waiting for him to respond. He’d never kissed her like that before. Sure, he’d kissed her plenty of times before that, but it never meant anything. It was purely fun, purely lust. This time was different, because he was thinking of Mari and her perfectly sweet lips. Apparently, Brie felt the difference. The look in her eye said she wasn’t done with him yet, that he could have more.</p><p>Trystan said nothing. There was no way he was telling her what changed, why the kiss felt passionate. Instead, he turned to the wing where Mari was sitting and walked off stage. When he passed through the curtain, there were several stage crew members blocking his path. One slapped him on the back and said, “Holy hell! That was hot!”</p><p>Brie watched him walk away with her fingers to her lips like she never realized what she had while she had it.</p><p>When Trystan finally plowed through the kids, he found Mari’s seat empty. It wasn’t fair. It wasn’t right. That was Mari’s kiss and he gave it to someone else—someone he detested. Trystan sat down hard in Mari’s chair and leaned back, running his fingers through his hair. Where was she?</p> <p>Tucker’s voice boomed from the other side of the curtain, “Take a break, Scott.”</p><p>That was all he needed to hear. Trystan got up and exited through the side stage door. He walked through the empty halls toward the cafeteria and went to the vending machines. He normally didn’t buy stuff like that. It was too expensive, but he wanted caffeine. He was shaking, his stomach churning inside of him like he’d be sick.</p><p>Fishing a dollar out of his pocket, Trystan fed it to the machine and then pressed a button. A Coke tumbled out of the bottom of the machine. He bent down and picked it up, lost in thought. Trystan walked back slowly, drinking his sugar quickly, when Seth ran up next to him. A teacher screamed at Seth to stop running, but he didn’t slow until he reached Trystan.</p><p>“Hey man,” Seth huffed. “You almost done? I have us a dinner date lined up.” He waggled his eyebrows, very proud of his latest catch. It had to be the 7-Eleven twins. Seth had been hanging around them nearly every day.</p><p>Trystan groaned inside, but he didn’t show any sign that he wasn’t interested. He didn’t want to fight about Mari again. Nodding, Trystan said, “Yeah. Give me about forty-five minutes. We should be done by then.”</p><p>Seth grinned, “She’s so hot, man. And her rack is like,” he paused his hands cupping the air as a look of awe spread across his face, “so perfect.”</p><p>“Which one?”</p><p>“Like it matters?” Seth laughed. “They’re twins. They’ve got the same of everything.” He elbowed Trystan, like his crass comment amused them both and then took off in the other direction. “Later, Scott! Don’t be late!”</p> <p>Trystan shook his head. He was starting to think that he and Seth had little in common anymore. At some point, Seth fixated on bodies and Trystan wanted more than that. A good body was great, but without a brain it didn’t hold much appeal. Mari had a great mind, filled with tack-sharp wit and other awesome things. Plus she had the body, too. He grinned, thinking about it. Trystan started back toward the auditorium, chugging the rest of his Coke.</p><p>As he rounded the corner, Trystan saw Mari leaning against the wall by the stage door. Her head was tilted up, her eyes closed like she was upset. His heart twisted in his chest. He watched her for a moment, unsure if he should approach, but he couldn’t help himself. His feet took him to her. It was like they were two magnets and when she was near, he couldn’t pass her by.</p><p>“You okay?” Trystan asked, stopping in front of her.</p><p>Mari jumped when she heard his voice. She looked directly at him. There were no tears in her eyes, but he knew something was bothering her. Something had been bothering her all day. Mari seemed more agitated and jumpy than normal. “Yeah, fine.” She waited a moment, then crossed her arms and sighed, “I don’t get it.”</p><p>Trystan leaned his shoulder against the wall next to her. The hairs on the back of his neck started to rise. He ignored the warning premonition. Looking down into her face, he asked, “What don’t you get?”</p><p>“How you can do that. How you can make everyone believe your emotions are real, even when they aren’t. That kiss...” She spit out the word kiss, shaking her head. Mari’s soft brown curls moved as she did it, falling forward into her face. She pushed them back, her gaze skewering him in place. “It makes it hard to believe that you like someone else. That’s all.”</p><p>Trystan didn’t understand why she was upset. Her reaction was strange considering what she’d told him earlier. She didn’t care about him that way, and while kissing Brie made Trystan feel dirty, it shouldn’t have had any effect on Mari. Unless...</p><p>Unless what, Scott? Take a hint, the voice inside his head scolded, she doesn’t like you. Stop acting like she does.</p><p>Maybe his words were too clipped, but once he said them, he couldn’t take them back. “Why does it matter, Mari? It doesn’t affect you.” And you’d tell me if it did, he hoped.</p><p>She straightened like he’d hit her.</p><p>Crap. That was the wrong thing to say.</p><p>“No, it doesn’t.” Mari looked at him once like he was cruel, and started to walk away.</p><p>He reached for her, grabbing her wrist, wanting an explanation. “Hey, wait a second. Mari, what is this? You know me.” His heart throbbed harder as his hand gripped her wrist. Her skin was so warm, so smooth. When she looked up at him with those dark eyes, he was lost.</p><p>“I’m not so sure anymore.” She looked down at his hand on her arm like she didn’t want it there.</p><p>“What do you mean? Of course you know me.” Trystan tried to strangle the pleading tone out of his voice, but it wouldn’t budge. An icy feeling was pooling in his stomach as he watched her.</p><p>“I’m never really sure if the guy I know is the real Trystan or the act.” She tucked a curl behind her ear and looked up at Trystan with those eyes. They said everything. She didn’t trust him. She didn’t know what to believe anymore and it was his own damn fault. “You can put on a dazzling show when you try. How I am supposed to know what’s real and what’s not?” When she asked the question, she couldn’t look at him. Her gaze fell to the floor.</p><p>He took her shoulders in his hands. “Look at me, Mari. You know me. I wouldn’t lie to you. About anything.” Her gaze lifted and met his. Her brown eyes seemed incredibly vulnerable right then, and he didn’t know why. Trystan knew this was important to her, that she felt misled and he wanted to fix it. He lifted a hand to her face and tucked a stray hair behind her ear, letting his fingers linger in her soft hair. His voice was soft, beseeching, “You know me better than anyone else. You always have.”</p><p>Mari swallowed hard, her eyes locked on his. She didn’t look away. She didn’t shirk him off like she usually did. Instead she stood there, barely breathing, looking for the truth in his eyes. His gut twisted like someone was wringing it out. The way she looked at him said so much. Did she really not see it? Of course not. She saw the guy on stage, the one who kissed Brie—the one who was never serious about anyone.</p><p>Finally she said, “I don’t know.”</p><p>“Come to the prop room tomorrow with Tucker’s pass. I’ll show you that I’m serious. Acting is acting. Brie doesn’t have my heart.” He paused, willing her to see it, to feel it. Squeezing her shoulders, he said, “Someone else does.”</p><p>Mari broke the intense gaze, nervously tucking her hair behind her ear, and stepped back. He smiled at her. The way she tucked her hair behind her ear was a tick that he hadn’t noticed before. Something about the way she did it, like she was trying to hide from him, made him adore her even more.</p><p>“We’ll see, I guess. I want to believe you. I really do. I just... I don’t know anymore, but I’ll come. I’ll be there because of what happened today. All of it.” Mari gave him a weak smile and turned on her heel to leave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Trystan’s eyes slid over her curves and landed on her hips for a second. The black top she wore wasn’t tight, but it wasn’t loose either. Coupled with those jeans and that sexy hair, she looked like a goddess—and just as far out of reach.</p><p>Mari was too good for him and he knew it.</p><p>CHAPTER 4</p><p>~MARI~</p> <p>I didn’t want to watch that part, but the end of the second act drew me back to my seat. No one blocked my line of sight, so I had the perfect place to watch Trystan give Brie a perfect kiss. The tension in the air was so thick, the way he looked at her made my stomach twist. It was like watching the lines when he ran them with me. Nothing seemed real in that moment. The guy I loved was inching closer to someone else, his lips pressing to hers, his hands gently touching her face. It was like hitting replay and watching him kiss me. Suddenly it felt like there was no air. The room grew hotter as my heart slapped into my ribs, banging inside of me like I was going to die.</p><p>That was my kiss. It was the same kiss he gave me in the prop room. I’d known it was fake, that he was acting, but somehow seeing it in front of me was too much. I felt sick and couldn’t stay there for another second. My stomach churched like I ate glass as I staggered to my feet. My head was caught somewhere between being crushed in a vice and floating away. Anger surged through my veins, but not at Trystan—at myself.</p><p>How could I be so stupid? I’d come to think that the kiss we shared meant something to him. The way he looked at me, the way he leaned in so slow that my heart felt like it would burst, even the way he gently pressed his lips to mine—it was all nothing. Out on the stage, it looked like Trystan hit a replay button. The entire thing played out, just as it was done to me, but he was with another girl and it was right in front of my face. It didn’t matter that he was acting. I couldn’t get control of myself. My eyes stung as I tried not to blink. Tears would roll down my cheeks. I looked insane as it was, shoving my way through gawking kids and running away like there was a fire.</p><p>My kiss was nothing to Trystan. Our kiss meant nothing.</p><p>Irritated with myself for being so naive, I hurried through the hallway to my locker. Pretending that I forgot something gave me a moment’s peace. I darted from my chair while everyone else watched the lights fade to black. It was like the air was charged with hormones and I imagined Trystan would get a fair amount of high-fives and crass statements for delivering such a smoking-hot kiss in front of so many people.</p> <p>I fumed as I raced to my locker, trying to calm down. The teachers wouldn’t say anything as long as I didn’t linger, and as long as I didn’t run. I opened the door and leaned my head against the shelf, feeling the cold metal against my skin. The scent of paper and musty textbooks filled my head.</p><p>How dumb am I? I wondered.</p><p>For a moment I thought that Trystan actually liked me. When I heard him sing, it made me feel like there was a part of him that I couldn’t see. There was genuine pain and longing in that song. Could he have concocted that song and all its haunting beauty like he concocted that kiss? Could he toy with a girl’s emotions as easily? I felt sick. How could I be so stupid? And what about everything else? All those looks, the way he brushed my hand when I was close, the way he looked at me—I swear, if I didn’t know better I would have thought he liked me.</p><p>But I did know better. I knew Trystan Scott and this was one-hundred percent Trystan behavior. Damn, the guy was like a total sociopath. He wore so many masks, way more than I’ve ever even tried on, and each one fits him perfectly. He can become what he needs to be, what people expect, at the snap of a finger. The guy I saw so rarely was hidden somewhere beneath layers too deep to fathom.</p><p>Why does he do that? Why does he change when different people are around? The version of Trystan that sat in the basement and played the guitar, the earlier version that wasn’t Day Jones even, those were great. What’s not to like? Why hide when everyone loves you? There has to be a reason for it, but I had no idea what it was.</p><p>Yeah, you know. He likes getting what he wants, my inner-voice chided.</p> <p>Oh God, was he that shallow? Did he really change to suit who he was with to get what he wanted? Trystan couldn’t be that shallow. Deep in my bones, I knew he wasn’t like that. There was something else. Something more that damaged him. There had to be. Trystan had that lost puppy thing about him. It made girls flock to him and want to be with him. That was always there. It never went away. He wore it like a scar. It was a piece of him that he couldn’t hide no matter how much he smiled and flirted.</p><p>I checked my face in my mirror and pressed the locker closed. Walking back to the stage door, I stopped for a second and leaned against the wall trying to blow off what I’d just seen.</p><p>It doesn’t matter what he does with Brie or anyone else. Trystan and I are nothing, but friends. I kept telling myself that, but it didn’t take away the sting. Pressing my eyes closed, I took a deep breath. When I opened them again, I saw Trystan standing in front of me with a can of Coke, asking me a question that I barely heard.</p><p>“You okay?” Trystan asked. His eyes found mine and held my gaze gently, like he knew I was close to tears.</p><p>Irritation and anger mingled together and vaporized my resolve. It floated away like I never had any. Trystan’s gaze was so convincing, which made it harder not to fall for him. I spewed out the words before I could stop them. “Yeah, fine.” My teeth bit into my bottom lip. I tried to shut up, I tried to stop talking, but I couldn’t. “I just don’t get it,” I said, arms flying around like a crazy person, my tone too clipped to be fine.</p><p>Trystan leaned next to me and looked down into my face. Those startling blue eyes were like twin pools. I wanted to get lost in them. I wanted them on me and only me. “What don’t you get?” he asked.</p><p>“How you can do that?” I squeak, unable to keep my mouth shut. “How you can make everyone believe you’re emotions are real, even when they aren’t? That kiss...” I shook my head. My brain was telling my mouth to shut up, but it kept going. My heart overpowered my head, like it usually did. Taking a deep breath, the rest of the thought rolled out, “It makes it hard to believe that you like someone else. That’s all.”</p><p>“Why does it matter, Mari? It doesn’t affect you.” His words struck me like a blow to the cheek. I never expected him to say it. Not to me. Not so callously.</p> <p>“No, it doesn’t.” Sickened, I turned away. I had to leave. Now. I couldn’t stand there another minute. Trystan was all talk, all smooth lips, and smoother lies. I didn’t want that from him. I thought I knew him and I didn’t. It felt like someone was strangling me. I couldn’t stand it another second.</p><p>Trystan’s hand shot out and grabbed my wrist, stopping me, “Hey, wait a second. Mari, what is this? You know me.”</p><p>Heart pounding, I looked down at his hand and then up at Trystan’s face. I wanted to say so many things, but the only one I could manages was, “I’m not so sure anymore.”</p><p>He looked offended, dark hair falling into his eyes, his lips curving into a confused expression, “What do you mean? Of course you know me.”</p><p>“I’m never really sure if the guy I know is the real Trystan or the act. You can put on a dazzling show when you try. How I am supposed to know what’s real and what’s not?” I couldn’t stop the words flying out of my mouth. It was like I was running straight into a freight-train and hoping it would miss smashing me to bits when it hit. I knew what he thought of me, how he felt for me, and yet—I was standing there doing what? Demanding more?</p><p>He’s not mine, I reminded myself. I shouldn’t be so upset. It shouldn’t matter if he can photocopy a kiss and give it to every girl in the school. Trystan isn’t mine. His heart belongs to someone else, assuming he has a heart at all.</p><p>Trystan shocked me out of my thoughts when he placed his hands on my shoulders. A current ran through me. That jolt laced around my throat, traveling down into my stomach, and froze me in place. I couldn’t breathe. My brain was fighting it, screaming for him to let go. I couldn’t take his touch and his false sincerity.</p><p>Panic clutched me harder until I heard his voice, “Look at me, Mari.” But I couldn’t look at him. Those eyes, that gaze would knock the sense out of me. He continued, his voice pleading with me, “You know me. I wouldn’t lie to you. About anything. You know me better than anyone else. You always have.”</p><p>I couldn’t help it. As he spoke, my gaze lifted to meet his and once I did, I couldn’t look away. Trystan stole my heart and I couldn’t take it back. Hope and dread mingled together as his words washed over me. They were too easy to believe. I wanted to believe him, but I couldn’t.</p><p>By the time I spoke, my voice was small, “I don’t know.”</p><p>“Come to the prop room tomorrow with Tucker’s pass. I’ll show you that I’m serious. Acting is acting. Brie doesn’t have my heart. Someone else does.”</p><p>His words were like a foot to my stomach. There was no air. I tried to cover it up. I looked away even though I felt his gaze burning a hole on the side of my face. Tucking a piece of hair behind my ear, I pressed my lips together trying to find an answer that wouldn’t hurt me more.</p><p>Brie. He gave Brie my kiss. He kissed Brie before. He slept with Brie, I reminded myself. Closing my eyes, I wished he was gone. I didn’t shirk him off this time. His hands felt too good. They were strong and warm, holding me in place, demanding something from me that I was afraid to give.</p><p>I babbled a few words that I couldn’t remember saying even if I tried and then added, “I don’t know anymore, but I’ll come. I’ll be there because of what happened today.”</p><p>Because of what you did for me. Because of your gaze in the closet. Because of the way you defended me to Tucker. Because of the song that poured from your heart. Because I heard it from your lips. Because I’m not sure who you are anymore and I think I’m more in love with this version of you than the last.</p><p>Oh God. Katie was right. He was going to hurt me and I was giving him every means possible. I couldn’t stand it anymore. Turning, I freed myself from his grip. When his hands fell away, it felt like someone ripped off a piece of my heart. I walked away leaving Trystan behind. For once, he didn’t say anything. He didn’t bound up the hallway chasing after me. Instead he stayed there, staring, speechless.</p><p>CHAPTER 5</p><p>~TRYSTAN~</p><p>“Well, that couldn’t have gone worse,” Trystan mumbled, as he walked back into the theater. Running his fingers through his hair, he pressed his eyes closed. There were so many things he did that totally screwed his relationship with Mari. It was like the whole relationship went up in a ball of flames before he even realized he liked her—before he fell in love with her.</p><p>Regret snaked through his stomach, as he walked to a few rows behind Tucker and slouched down into a seat. Within a matter of moments, girls he didn’t really know filled the seats next to him. They fell from the sky like rain. They were always there chattering. He was never alone, but he always felt isolated. Trying to block out the chatter, he watched the beginning of the third act on stage. Brie was sucking-up her lines and trying to cover it by blaming someone else. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That’s when he finally zoned in on the conversation going on around him.</p><p>The girl was saying, “I know, right? I heard there’s a reward for the person who outs him.”</p><p>Trystan’s gaze snapped toward her, “Outs who?”</p><p>Regan beamed, glad that he noticed her. Her inky hair gleamed in the dim light, falling over her shoulders as she leaned closer to him. “Day Jones. Who else? The guy’s a shadow. Every time someone thinks they got a line on him, he vanishes. Poof.” She lifted her hand, making the fingers of her fist fly open. Her dark brows rose as if it were impressive.</p> <p>Another voice spoke and Trystan turned to see Jamie, a coppery-haired girl with olive skin. “There’s a reward, and it’s huge. That rich dude said he’d offer a million bucks to the person who finds him. Something about wanting Day to sing at his kid’s birthday.” She shrugged like it was a normal thing to do. Trystan never celebrated his birthday. Actually, he spent it as far away from his dad as he could manage. It was a reminder of everything they lost, of everything he’d never have.</p><p>Trystan’s skin prickled as ice filled his stomach. He shifted in his seat, hiding behind that cool smile he always wore. “Are you serious?” he was shocked, but he hid it like he hid everything.</p><p>What the hell was wrong with people? Why couldn’t they admire a song and leave a guy alone?</p><p>“Totally,” Regan replied. She laughed and turned toward Tessa behind her. “Did you see that Day-Tracker site? The one with all the leads and how they panned out?”</p><p>Tessa laughed, “Yeah, that was awesome,” she leaned forward. “That last guy they tracked seemed like a good fit, but in the end, it wasn’t him. I was totally hoping they’d find him. I can’t wait to see what he’ll do—and what he looks like. With a voice like that, he has to be hot. The shy thing just makes him more appealing.”</p> <p>“I know, right?” Regan smiled, nodding in agreement.</p><p>“Hey, did you see the Facebook page for Find Day?” Tessa continued, “It’s hysterical.”</p><p>Regan nodded, smiling huge. “I know right? And the pictures were an awesome touch.” She turned to look at Trystan, adding, “It’s like the ultimate Where’s Waldo of hot guys. Girls have been uploading pics of what they think Day looks like and where they think he is. I’m totally uploading my guess later.”</p><p>“And, what’s that?” Trystan asked, a smirk on his face. He folded his arms over his chest while they were speaking and sat up a little bit. His stomach was tangling into a knot. They were looking for him.</p><p>Regan giggled, “Well, with a song like that there’s no question that he’s been playing for a long time. His accent sounded a little Cajun, and based on the way he plays, I’m thinking New Orleans.” She turned quickly and pointed a finger at the others, “You better not steal my idea. Post your own city.”</p><p>“He’s not in New Orleans,” Tessa whispered as Tucker looked back at them, a clear signal to shut up, but they kept talking. “Cajun accent,” she mimicked and rolled her eyes. “What the hell is wrong with you? He’s clearly from Long Island. Did you hear the way he said his G’s?”</p> <p>Regan contested, “Yeah, but he didn’t put W’s in the middle of everything. There’s no way he’s from around there. You’d hear it.”</p><p>“Scott!” Tucker yelled. “Silence your posse or get out.”</p><p>Trystan stood, heart racing, all too happy to flee. The girl’s looked up at him as he rose. “Mr. Tucker, you know as well as I do that there’s nothing that will get them to stop talking, short of the apocalypse, and even then I imagine that they’ll be pointing out which zombie is wearing what, so I’ll take you up on your offer and leave.” The girl’s watched him slack-jawed, admiring him and then bursting into giggles at the zombie fashion reference.</p><p>Trystan headed out the back door, his head spinning. People were looking for him, trying to discover Day Jones’ identity. The thought never occurred to him, not in his wildest dreams. Dread pooled in his stomach as he walked to his locker and opened the metal door. Staring into space, he wondered if there was anything telling on the video—any signs of who he was or where he was. Trystan admitted he wasn’t very careful. When he made the video he was only thinking of Mari. He leaned his head against the cold metal and took a deep breath. He’d have to watch the video later to make sure there was nothing identifiable. Although he’d done it already, he felt like there was something there, something that would lead them to him. Trystan was certain that their only real clue was the YouTube account and his user name. Even if someone managed to track the IP address, it would show his neighbor, not Trystan’s home. The thought still made him squirm. That was too close.</p><p>Trystan grabbed his leather jacket and slammed the locker door. As he headed outside, a cool burst of wind caught his jacket and Trystan tugged it shut. Night was falling. Practice was running longer and longer, as it normally did, up until the day of the dress-rehearsal. Trystan walked down the street. Car horns blared on the busy road next to him. The scent of exhaust mingled with the crisp autumn air filled his lungs.</p><p>Passing store fronts, he walked to the diner to meet Seth and his date. Trystan cringed inside. Maybe it wouldn’t be so bad. He laughed hollowly. Yeah right. Knowing Seth, there wasn’t really another option. He sighed, his breath coming out in a white cloud. Sometimes he wished he had a different life, a different father, a different past.</p><p>Maybe it wouldn’t be so bad if people knew he wrote that song, but the thought made him cringe. What would his life be like if people knew he was Day Jones? What would they think when they found out his mother ran out on him and that his dad hated him? Trystan hung his head, his gaze intent on the sidewalk in front of him. He could see it, picture it in his mind’s eye—everything everyone ever thought about him was a lie. He wasn’t anyone special. He wasn’t anyone at all. Revealing Day Jones’ identity would destroy him. It would strip away the little parts of his life that mattered.</p><p>Frustration shot through Trystan. Moving his feet faster, he came up with a plan for the date. He’d have dinner with Seth, so he didn’t get grilled with more Mari questions, and then get rid of the girl. There was no way he could feel okay. Not tonight. Not after today. Everything had started off so promising, before it derailed and turned to ash in his hands.</p> <p>CHAPTER 6</p><p>~MARI~</p><p>Katie got my text and met me at the diner in ten minutes flat. She must have hitched a ride, since she didn’t have a car and there was no other way she could have arrived so quickly. I didn’t expect her to get there so fast.</p><p>She slipped into the booth across from me, gasping like she was out of breath, “What the hell happened? I ran out after stuffing dinner down my throat. My parents think I’m a lunatic as it is. After tonight, they’re gonna have me committed.” I was near tears. “Awh, damn. It’s Trystan, isn’t it?”</p><p>I nodded and started spilling my guts, telling her how that kiss felt—the way it seemed like it was tailored just for me. Seeing him kiss Brie like that in front of everyone, giving her my kiss, shattered the illusion.</p><p>“It was a lie,” I finished up, slumping back in the booth, folding my arms over my chest. I let my dark hair fall forward to hide my face and cast a shadow over the pain in my eyes. “He used me. No—he was running lines. The entire thing was fake and I was too stupid to notice.”</p><p>It felt like Trystan wrapped his fingers around my heart and squeezed. I couldn’t stand it. I didn’t know what I wanted to do, but suddenly sitting in the booth felt uncomfortable. I wiggled in my seat, trying to slink out of sight when some girls who knew Brie walked by. Katie shot daggers at them and they passed without comment, which was good because I couldn’t take anything else today.</p><p>A waiter came by again and asked for our order. When I first sat down, he tried to get my order, but I said I was waiting for someone. He huffed and walked off, like I screwed up his night. It’s not like I was rude. I didn’t understand people sometimes.</p><p>Katie ordered for both of us. “Two sides of fries and two chocolate milkshakes—tall with extra whipped cream. And she wants a cherry on top.” Katie winked at me and the strangle-hold on my heart lessened. She always knew how to make me feel better. She dug through her purse and pulled out a ponytail holder. She pulled back her hair as she spoke, “I’m sorry this happened, that you found out this way, but at least now you know. Before you couldn’t tell what he was doing. Now you know he’s a goddamn liar.”</p><p>“An actor—”</p><p>“Same thing,” Katie said. When she finished tugging the ponytail tight, she leaned forward saying, “Listen, if anything, that thespian genius makes it harder to see through his little flirtations. There’s no way to know if things are real with a guy like that. He’s always acting.” Her head tilted to the side and her eyebrows crept up her face. It was her uh-durrr face, she was just too kind to actually say it to me.</p><p>Some of what she said seemed true, but my mind rebelled against it. My voice was flat. I wasn’t defending him, but I had to point it out, “We’re all always acting. What the hell do you think high school is? You really think I strut around being myself all day? Come on, Katie. You have to do better than that.”</p><p>She cocked her head at me like I was retarded. Leaning forward she said, “You don’t get it. Actors don’t just hide who they are, they manipulate people. They carefully construct a false facade and use emotions to do it.”</p><p>“Nice alliteration,” I interrupted.</p><p>She smirked. Katie was always a poet and totally bent on making her point. \"People like that make you love them. They make you laugh. He’s an expert at pulling emotional strings and he pulled all of yours. He did it knowing that a kiss meant something to you, and he stole one. He’s an asshole.”</p><p>I didn’t know what to think of that. It was true. Trystan could make anyone love him. He had that ability, which was why he was such a good actor. It was throwing me off, because the time I spent with him felt real. They weren’t conflicting versions of Trystan, and I’d seen how he acted around other guys and love-struck girls. He didn’t change over the years. Actually, scratch that—the first major change I’d seen was that Trystan was in love. Descending the staircase and hearing him tell Seth that some girl had turned him inside out was the first change. The second was the revelation that he was Day Jones, and that he wrote a song that said he was in love.</p><p>Something changed Trystan, no, someone changed him—that girl he loves—she altered him.</p><p>The waiter put the plates of fries and milkshakes down in front of us. Sighing, I looked up at Katie. Sitting up straighter in the booth, I pushed my hair out of my face. I felt less fragile and more like I could handle this, and whatever else was thrown in my face tonight. “Thanks for meeting me here so fast.”</p><p>She plucked a fry from the plate, swiped it through the whipped cream, and popped it in her mouth. “Sure, what are friends for?” she grinned at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s so gross.” My lip pulled up a little bit, as she swiped another fry through ketchup and then dipped it into her shake.</p><p>She laughed, “Creative cuisine was never your thing.”</p><p>“That’s not cuisine. It’s seeing how many things you can put on a fry before shoving it in your mouth.” I reached for the pepper shaker and said, “Try this and maybe some jelly next time.”</p><p>“Twit,” she laughed, and then added a heaping amount of pepper to her fry that was already covered in milkshake. This was why guys loved to watch her. She stuck anything in her mouth. I cringed, watching.</p> <p>Before I had a chance to unwrap my straw, the diner door swung open, and Seth walked in with a girl on his arm. My face must have shown my distain, because Katie turned and looked. She started to open her mouth to say something, but she was half-choking on pepper. Turning fast, she sloshed half a cup of water down her throat, before turning around and seeing Trystan and another girl follow Seth inside. The four of them stood, waiting to be seated, just inside the door.</p><p>Trystan had on his leather jacket. It looked so soft. It was the same one he wore every year once there was a chill in the air. There were tiny white lines in the leather, showing its age. It must have belonged to someone before him. The jacket didn’t look new, but it sure made him look good. When he wore black, his gaze always seemed more intense, more vivid. More blue.</p><p>They didn’t see us. Trystan had his hand on the small of the girl’s back. She was pretty, all curves and hair, with big eyelashes with lots of make-up. She was the kind of girl who dated for fun.</p><p>I was her polar opposite. I was looking for love, which apparently was not fun.</p><p>Katie swung around before they saw her, “Holy shit. Is he frickin’ serious?” She blinked at me like she couldn’t believe it, and then glanced back at Trystan and Seth.</p> <p>“Let’s just go,” I said softly, feeling the rest of my heart shatter and fall into my shoes. “I can’t watch this.”</p><p>Katie shook her head, “No. We’re staying. Something’s up with him.” A waitress led them to a booth on the other side of the door. There was a long counter with silver stools with thick padded red seats between us, along with a scattering of booths. I was in their line of sight. As soon as they sat down, Trystan would see me.</p><p>When their backs were turned, Katie jumped up, “Quick, switch sides with me.” I did as she said, my heart racing way too fast. I clung to the table, slipping silently into the booth while she passed behind me. “I’ll watch them for a while and let you know what’s up.”</p><p>I nodded slowly, wishing I were somewhere else. I didn’t really feel like eating, but I picked at the fries and sipped the shake. I couldn’t tell Katie about the other side of him, the Day Jones side that was hiding from fame. If that part didn’t exist, I would have thrown him out of my life. But I couldn’t. It didn’t make sense. Katie thought he was a glory-hog, but that wasn’t it. I didn’t know what the truth was, but it hurt to watch, trying to figure it out.</p><p>Katie told me about Mathboy. They shared a phone call earlier and some texts. “He’s so hot, Mari. Look what he said.”</p><p>I took her phone and read the texts, as she beamed back at me. It appeared that he had quite the crush. “So,” I said, “it was a good thing Brie pegged me in the head. Just think, if she hadn’t done that, and you hadn’t tried to protect me, you and Mathboy would have never connected.”</p> <p>The corners of her mouth curved up. She cradled the phone in her hand, looking down at the messages. “He has a name you know.”</p><p>“Sorry. I figured we’d be calling him Mathboy until you guys got married. Then we’d call him, Mathman. That’d make you, Mrs. Mathman.” I smiled at her, but was distracted. Her eyes kept flicking over my head, back to Trystan’s table. After a little bit, I said, “Can we leave now? He’s on a date. You don’t have to protect me. I know what’s going to happen. He’ll leave with her, they’ll screw around, and I’ll cry. I really don’t want to know all the details, Katie.”</p><p>Katie ignored me, her gaze still over the top of my head. “Trystan isn’t acting like himself. He’s sitting next to her, but they aren’t touching at all. Weird, right?”</p><p>I nodded. Okay, that was weird for him. Every time I was around him, it was like he found some excuse to touch me. I’d seen him do it to other girls, too. Not touching was weird.</p><p>Katie continued, “Sexbot, on the other hand, has got some heavy hands for a public place.” Her face scrunched up, “Gross. He’s feeling her up and sucking her face off. Where does he find these girls?”</p><p>“Hoes-R-Us, aisle 4.” I said deadpan, not really thinking about my words. There was no explaining, Seth. Katie snorted. I continued, “How someone could find him appealing, with that mouth, is beyond me.”</p><p>“Maybe that’s why she hasn’t stopped sucking his face—to shut him up.”</p><p>I laughed a little too loud. I smacked my hands over my mouth and grinned.</p> <p>Katie’s eyes went wide. “Holy friggin’ frack. Just sit there. Smile and laugh again.” When I started to turn around she hissed at me, “Just do it!”</p><p>I had no idea what was going on, so I smiled uncertainly and laughed again. It was a weak haha that sounded totally fake. Katie stomped my foot and I made a strangled sound, as a grin spreads across my face. Then, I kicked her back, laughing louder, not realizing that someone was approaching behind me.</p><p>“I thought I heard you,” Trystan said, as he stopped in front of our table. His leather jacket was gone. The shirt he wore clung to his body and his scent filled my head. Trystan slipped his hands into the pockets of his jeans and looked from Katie to me.</p><p>Katie had a plastic smile on her face. She raised her eyebrows at me, but made no other indication that she thought this was unusual.</p><p>Every hair on the back of my neck stood on end when he spoke. My heart stopped. Don’t turn, don’t turn. If I look at him, I’m toast, I thought to myself. I continued to smile at Katie, tilting my head back like I looked up at him, but I didn’t. My glance grazed his shoulder, not his face.</p><p>“Hey,” I replied, sounding as normal as possible. When I glanced up, I didn’t catch his expression until the memory of his face registered in my mind. The look in his eyes was soft, like he was fragile. God, I wanted to die. I couldn’t take this.</p><p>As if Katie could read my mind, she blurted out, addressing Trystan, “So, double date with the boobie twins?”</p><p>Trystan glanced back at his table. Running his hands through his hair, he sighed, “Yeah. Seth needed a wingman. Personally, I’d rather be over here.”</p><p>Katie had her foot on the bench next to me, keeping him from sitting down. She pulled her foot down, and said, “Then sit, actor-boy, but don’t steal Mari’s cherry. It’s kind of important to her,” Katie smirked evilly at her innuendo, as she glanced at my bright red Marciano cherry, still sitting on top of my spoon. “She saves the best for last.”</p><p>Instantly, I flushed head to toe and promptly kicked her in the shin.</p><p>Trystan grinned deeply, showing off a set of dimples that made me die. He slipped into the booth next to me, his shoulder brushing mine. God, he smelled good. “I’m aware of that.” He glanced at the cherry, and then looked at me. “Plan on demonstrating any cool party tricks? Tying the stem in a knot?”</p><p>I started to answer, but Katie cut me off, “I’m afraid that’s privileged information.”</p><p>Trystan smirked at her. “Really?” He folded his arms across his chest and stared Katie down.</p><p>“Mmm. ‘Fraid so.”</p><p>Trystan turned to me, “You’re a bottomless box of surprises.”</p><p>“I’m not a bottomless anything. Not around you,” I said dryly. Katie had her straw in her mouth, sucking up some milkshake and promptly choked.</p><p>Trystan raised a single brow at me and smiled. Leaning in closer, he breathed, “I wouldn’t bet on it.”</p><p>A tingle shot through my stomach. The way he looked at me, the way he said it, made my heart slap into the sides of my ribs so hard that I thought they’d crack. I did everything humanly possible to not react to his words, to his charm—because that’s what it was, charm. Flirtation. There was nothing else there.</p><p>Holding my gaze for a moment, he smiled softly. Heat spread through my body and I couldn’t look away. Trystan might as well have been holding my face in his hands. I couldn’t move. I couldn’t think. The power he had over me scared me to death, especially, because he didn’t seem to care. Every part of me reacted to him, was drawn to him. Trystan was beautiful—like a wisp of flame—and I knew trying to hold him would only get me burned, but I was mesmerized.</p><p>Trystan slipped out of the booth and stood, leaving me there with my jaw hanging open like an idiot. “See you around, Jennings.”</p><p>CHAPTER 7</p><p>~TRYSTAN~</p><p>“Where’d you go? The food’s getting cold.” Seth glanced around after Trystan excused himself, but he didn’t see who he was talking to. The diner was full of the dinner crowd and he could barely make out the top of Trystan’s head across the room.</p><p>“Nowhere,” he said. “Just thought I saw someone.”</p><p>Seth groaned, “Oh, God. Seriously? You’re on a fucking date.” Exasperated, Seth dug his fingers into his scalp before letting out a huff of air.</p><p>The blonde next to Seth recoiled a little, “What’s the matter? What’d he do?” She glanced around as she said it, and then looked back at Seth.</p><p>“I didn’t do anything,” Trystan said, ignoring his own date, who didn’t seem to care one way or the other.</p><p>“You didn’t tell her?” Seth scolded, his gaze narrowing on Trystan.</p><p>“No,” Trystan hissed. “Drop it.” He slouched back into the booth and put his arm along the top of the seat, not touching his date.</p><p>“I will when you stop acting like a lovesick dick. You can’t live like that, man. She’ll rip your goddamn heart out of your chest.”</p><p>Trystan held his temper in check. That was one good thing about having a father like his—he could hide his feelings so that no one had a clue. Trystan dropped his arm down onto his date’s shoulders. Grinning at Seth, he said, “Not planning on it. I’ve got Beth here—”</p><p>“Betsy,” the blonde corrected.</p><p>Trystan didn’t bother correcting himself. “—and nothing is distracting me from her beautiful face.”</p><p>Seth stared at him from across the table. A plate of half eaten food sat in front of him. The guy’s arms were wide, made to hit stuff. Trystan could tell that he pissed Seth off by looking for Mari, but when he heard her laugh, he had to see her. Trystan did it without thinking and didn’t plan on giving Seth, or anyone else, an explanation. Besides, he was gone less than five minutes. There was nothing to tell.</p><p>Seth’s tongue moved over his teeth under his lips, as his jaw tensed. “I thought you were into this,” he hissed, pointing at the girl next to Trystan. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I am,” he insisted even though he wasn’t. He pulled the girl closer. “You guys go do your thing. We’ll do ours.”</p><p>Seth watched him for a moment. Uncertainty clouded his eyes. Or maybe that was lust. Either way, Seth was frozen in place. He wanted to keep Trystan from doing something stupid, but the girl sitting next to him was a sure thing. “You’re a pain in the ass, Scott,” he said and scooted out of the booth. Twin number one—Bess—followed. Bess and Seth threaded their fingers together. She leaned into him and threw her hip out, annoyed that Seth stopped again.</p><p>“You sure?” Seth asked.</p><p>“Leave,” Trystan urged. “We’re fine. Right, Betsy?” Trystan said, as he gently pushed a strand of golden hair away from her face. The girl giggled and nodded so furiously that Trystan thought her head might snap off. Turning back to Seth, he said, “See, we’re fine. Go.”</p> <p>Seth didn’t need more encouragement. He took the check, paid, and left. It was the normal agreement. Trystan was fine being the wingman, if Seth paid the bill. He stretched and placed his arm over her shoulders again. This part was going to suck.</p><p>“So, what do you want to do?” she asked snuggling into his chest. Her fingers played with the collar of his shirt, slipping between the buttons.</p><p>Mari chose that second to appear at the door and looked over at them. His heart clenched tight, but he didn’t move. Instead they stared at each other. She was a million miles away, someone he’d never have. Katie’s warning was clear enough, even if it did embarrass Mari—keep away.</p><p>When his date’s lips landed on his neck, Mari shot him a disgusted look and walked out. Trystan pulled his date off his throat, but Mari was already gone. Katie watched her friend walk out the door and looked back at Trystan. The way Katie looked at him made his balls jump up into his body. That girl would castrate him, if she could. He stared her down, refusing to look away.</p><p>Betsy, Beth, or whoever she was seemed impatient. She pulled on his shirt front and grabbed Trystan’s face, pulling him to her for a kiss. Before the kiss connected, he saw Katie walk out. Betsy’s lips pressed into his, but they were cold and lifeless. There was no passion there. It was a kiss without feeling. Trystan didn’t want this, but Mari wasn’t his. She never would be. He peeled Betsy off his mouth and they slipped out of the booth, walking out the door hand-in-hand.</p> <p>The rest of the night passed in a blur. After making out with Betsy, he walked her to her sister’s car in front of Seth’s house. She tried to talk Trystan into more, but he wasn’t interested. It was like part of him died. Trystan didn’t think a single girl could have such control over him, but if he couldn’t have Mari, he didn’t want anyone. And, to his horror, making-out with this girl didn’t help him forget. If anything, it made the realization that he didn’t have Mari more painful. Trystan didn’t know what to do. Part of him wanted to give up and give in—say yes to the beautiful woman in front of him—but her kisses left him hollow and cold. He could only image what sleeping with her would feel like. He ran his hands through his hair and walked away.</p><p>Frustrated, Trystan walked home alone. Carefully, he cracked open the front door and glanced around for his dad. The lights were still on, the TV blaring. Trystan slipped around the door quietly and saw his father passed-out on the couch.</p><p>Relief flooded through him. While he wished his dad would just snap out it, he knew that wasn’t going to happen. He wasn’t a little kid anymore. This was his life. This was all there was. He stripped off his shirt as he walked back to his room, wishing he had his guitar. The weight on his chest felt like it was going to crush him.</p><p>Trystan closed his door and slid the new bolt shut before lying on his bed. He finally had time to think, time to rest.</p><p>CHAPTER 8</p><p>~MARI~</p> <p>I slumped against my bedroom door, tossing my book bag on the floor. Thoughts of Trystan filled my mind in an endless wave. It wasn’t fair. Why’d he have to show up with a girl on his arm? He didn’t seem like he was that into her, but when Katie and I left, the girl was going all vampy on his neck and he didn’t seem to mind. Actually, he seemed comfortable with it. If I ever did anything like that in a diner, I’d die of embarrassment. The concept of a public-display-of-affection was foreign to me. I wanted my private life private, so what Trystan was doing with that girl, in front of everyone, made me feel sick.</p><p>That would never be me.</p><p>Before I had time to think another thought, someone pounded on my door. Pressing my eyes closed, I peeled my back off the door and opened it. Dad was home. That was his knock. I braced for whatever scolding I was about to receive. Pulling the door open, I said, “Hey, Dad. Home from work?”</p><p>“Yes,” he said in a clipped tone, pushing past me into my room. He had that look on his face, the one that said I didn’t measure-up, the one that made me feel like a failure. “You’re progress report showed up today. Would you like to tell me anything before we discuss it?” Dad had the piece of paper in his hand. The school sent weekly progress reports via email to psycho-parents, like mine, who demanded them. That was one of the changes my Mom made while she sat on the school board. Dad thought it was a great idea, while I found it to be less than stellar.</p><p>Dad’s dark hair was silvering at the temples. Wrinkles sprouted from the corners of his eyes making him appear older than he was. Dad had seen too much, first in the military, and then in the hospital. To him, getting good grades was a life or death thing.</p><p>I pressed my shoe to the floor, staring at the black toe. I’d loved these shoes when I’d gotten them. They were so cute, but now they seemed frivolous. Dad probably thought so, too. I shook my head, “No, sir. There’s nothing to tell.”</p><p>“It says here that you received detention this week? Mari, we’ve talked about this. You cannot have such childish things on your permanent record. College is next year. It’s not three years away. It’s only one year away, and you can bet they’ll look at this year and see this blemish.” He became more stressed as he spoke, slapping the paper into his fist. When I didn’t look up at him, he snapped, “You’re destroying your future, Mari. It’s not something that can be undone.”</p><p>My mind broke. Maybe it was Trystan, I don’t know, but I couldn’t take the emotional berating he was giving me. The guilt he dumped on me sank into my stomach and sat like soured milk. It curdled and I spewed verbal vomit at him, ranting like a lunatic, “It’s one detention, Dad! Out of how many days of school? Like seven hundred and twenty! One day doesn’t matter! They won’t even look at it.”</p> <p>Dad laughed, but the sound was angry, “Young lady, so help me, I’m going to get through to you.” He leaned close to my face, speaking deliberately slow, like I was too stupid to fathom what he was saying, “Everything you do, from now until graduation, matters—every grade, every test, every day—all of it. It’s recorded and they’ll see it. If you just blew your shot at Yale, so help me God, I will—”</p><p>“What? What will you do?” Tears streamed from my eyes. I couldn’t hold them back anymore. “I made a mistake. It wasn’t even something I did. Mom knew about it and she didn’t do this to me.”</p><p>“Because your mother doesn’t know! Did she go to Yale? Did she attend an Ivy League school and have her parent’s pay for medical school?”</p><p>“No,” I said softly.</p><p>He was still up in my face. “That’s right. I did. I know what they expect and this little stunt might have just cost you everything.” He sighed and shook his head, like he knew everything and I knew nothing. Closing his eyes he inhaled hard and let it rush back out. “I only want what’s best for you, Mari.”</p><p>I stared at him. I wanted to believe him, but I didn’t. I felt like a trophy child, someone he had around to show off. It felt like it was more important that his daughter was smart, that his daughter was perfect—but, I was his daughter and I was neither of those things. I worked hard to get my grades, and I tried so hard to meet his expectations, but I failed. Over and over again, I fell short. I didn’t measure up. That feeling never faded. It’s there every day when I got a test back.</p><p>School was not for learning, not to Dad. School was to demonstrate how smart I already was, but I wasn’t. And I wasn’t him—he just didn’t see it.</p><p>I nodded, “I know, Dad.” There was nothing else to say. He couldn’t see me. It’s like I was nothing more than that paper he held in his hands. That one blemish blinded him to all the A’s. I knew it was coming. I knew he’d react this way. He always did, but today I couldn’t just nod and take it. Tears streaked my face, and I knew he saw that as a sign of weakness.</p><p>He lifted my chin in his hand, and looked me in the eye, “Only the cream rises to the top, Mari. You’re mother and I know you’re cream. Don’t disappoint us again.” His grip felt cold and distant, his gaze was even more so. I swallowed hard and nodded. He released me and said, “Get in a little studying before bed.” With that, he turned on his heel and left.</p><p>Every inch of me wanted to scream, but I couldn’t. They couldn’t know how trapped they made me feel, how smothered I was. I pushed the door shut and went to the computer not thinking about what I was doing. Before I knew it, I was on the Day Jones page and clicking play on his song, letting Trystan’s voice fill my head. I laid down on my bed, clutching the pillow, crying into it, as the song played softly and drowned out my sobs.</p><p>There were so many things that I wanted to say to my parents, but I couldn’t. They both worked non-stop trying to give me everything they never had. They acted like I was an adult with some things and a child with other things. I just wished they’d see Mari, their daughter. I wished they saw how much I liked art and how much I didn’t want to dedicate my life to something I wasn’t passionate about. It left me, their only child, alone. From the time I turned twelve, I’d spent more days alone than with them. Last year, their work schedules lined up and they were pleased. It meant they’d get more time together, but it also meant I saw them less. They worked four days on, three days off. For the days they were gone, I was on my own, and they were proud they had such a self-sufficient child.</p><p>Tears chilled my face, as they sank into my pillow. I couldn’t stand it anymore. For once, I wished I wasn’t me, that I didn’t feel the way I felt about everything. I wished I could just hook up with a random guy and not hand over a piece of my heart. It would help me forget the things that I tried so hard not to remember. No matter what happened, in a year, I knew if I didn’t fight for my life, I’d be stuck on this path forever, living the life my father wanted—not the one I wanted.</p><p>Pushing off the bed, I looked at the screen. More comments, more pleas for Day to play another song, reveal his name, post a pic, anything—and they all went unanswered.</p><p>Emotional insanity compelled me to do it. Staring at the screen, I typed in one word at a time. I watched as my fingers wrote something I would never say, something I never tried before. I wanted to know if it helped take away the sting, if that was why he did it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>WHAT DOES IT FEEL LIKE TO SLEEP WITH SOMEONE YOU DON’T LOVE?</p><p>My hands hovered over the keyboard. I hesitated to post it. Trystan would know it was me. There was no way he wouldn’t, and since he didn’t answer anyone, what was the point? But I wanted to know. Maybe his way of dealing with life was better. Maybe a random hookup didn’t leave everyone feeling hollow inside. Maybe that was just me and I could get over it.</p><p>My pointer finger smacked the enter button hard. The key clicked and the message posted.</p><p>CHAPTER 9</p> <p>~TRYSTAN~</p><p>By the time Trystan was safe in his room, it was late. Out of habit, he grabbed the old laptop and turned it on. The machine made a hissing noise, followed by something that sounded like Cookie Monster munching gravel. It came from inside his hard drive, and Trystan knew the laptop wouldn’t last much longer, but the machine finally turned on. The screen flared to life and he checked his Facebook page, stopping by Mari’s page to look at her picture for a second, and then moving onto the Day Jones’ YouTube page. Although he vowed to stay away from it, he couldn’t. It was too insane how quickly it’d grown, how many people liked the song.</p><p>He didn’t read every post. Instead he read a handful of new comments. One post that was in bold type caught his eye. The rest of the comments were of the same vein, but this one was different. His heart clenched when he read it. It had to be Mari. It had to be. There was no way to know for certain, but he could feel it tugging on his gut like a guitar string. The girl who wanted every kiss to have profound meaning was asking for pointers on sleeping around? That didn’t make sense. It pained him, cutting through his core, like he’d been cleaved in half. Trystan’s breath was ragged, as he stared at the screen.</p><p>Answer her.</p><p>Trystan’s fingers twitched, dying to respond. He wasn’t sure if she was scolding him or asking him how to get started. A sick feeling crept up from his gut and lodged itself in his throat. He swallowed hard, trying to force it down, but it wouldn’t go away. Every part of him said that this was Mari, this was her question.</p> <p>Trystan’s fingers tapped out a response on the keyboard. Carefully constructing his reply, he crafted each word so she’d know. His answer was plain and simple. There were no excuses or pleas, just the naked truth. Trystan’s finger hovered above the button. He wanted to click, he wanted to post the reply, but it was so risky. There were ways to track things back to him. He knew that, and with the number of people trying to find him, Trystan couldn’t click.</p><p>He deleted his post and closed the laptop, knowing that he had to wait until tomorrow. He’d ask her when he showed her what he was working on. The thought made him feel better. Lying back on his bed, Trystan pictured her face as he sang. The memory was burned into his brain and he loved it. Closing his eyes, he could see her face, her brown eyes filled with curious flecks of gold surrounded by a cascade of curls that were soft as silk.</p><p>Trystan closed his eyes and for once, fell asleep with a smile on his lips.</p><p>Trystan heard his dad moving around when he was finishing up in the shower. Damn it. He’d taken too long. Toweling off fast, Trystan pulled on a pair of tattered jeans and a tee shirt. His clothing had seen better days. He hid it by layering his shirts with a flannel or button down shirt. He let the front hang open, which still gave him that neatly messy look.</p><p>Before he could reach the door, his father’s voice rang in his ears, “I’ve got tickets to the hockey game this weekend. I thought me and you could go.” His voice sounded softer than usual. Trystan turned slowly, carefully, and looked his old man over. “It’d be like old times.”</p><p>“What old times were those?” he asked, knowing he shouldn’t.</p> <p>Trystan’s dad looked down and sighed. He was wearing a gray suit with a jewel-toned blue tie. It brought out his eyes. Damn, they looked alike. It made Trystan’s skin crawl to think he was turning into his dad. He wanted nothing to do with him. Starting a new life somewhere else was a dream. He thought about it day and night. The only think holding him here was Mari. How many times had Trystan wanted to run? How many times did he nearly walk away and leave everything? Too many, he thought bitterly.</p><p>“Don’t be like that. I do the best I can. This was something I could do. Give me another chance, kid. I promise you—”</p><p>“Your promises don’t mean much. Not anymore. I’m not the little kid who used to wait for your approval. I gave up on you a long time ago. There’s no point in pretending... not anymore. As soon as I graduate, I’m gone and I’m never coming back.”</p><p>“Trystan... ,” Dad said, stepping toward him. It was hard to look his father over, hard to see how normal he seemed in the light of day. Wearing that suit, smiling that smile, he could be any nice guy, but Trystan knew better. He was the jaded drunk who’d hit him faster than he could blink.</p><p>“It’s okay, Dad. There’s no need to pretend anymore.”</p><p>His father look genuinely confused, “Pretend what?”</p><p>Trystan was so disgusted that he couldn’t even say it. Pretend you care about me—pretend you love me. Instead, he closed his eyes and shook his head. Trystan turned on his heel and left without another word.</p><p>By the time Trystan got to school, he was late. He sat down in homeroom, but Tucker didn’t say anything. No commentary on his tardy, no threat to dock his grade.</p> <p>When the bell rang at the end of class, Tucker stopped him, “Mr. Scott.”</p><p>Trystan stopped. He stared straight ahead, not wanting to look at the man. It was like Tucker had radar for screwed-up students, and he was sniffing out what was wrong with Trystan. The thought made his skin grow cold and clammy. No one could know that part of his life. Ever. And Tucker was getting way too close to the truth.</p><p>Tucker waited for the other students to pass, “Want to tell me why you were late today?”</p><p>Trystan shrugged, “Had better things to do.”</p><p>Tucker hmmmfed, but didn’t say anything else about it. Instead, he said, “I’ll check on you and Mari later today. You’re a good kid, Scott, but you need to be careful. You’re walking the line and it’s too damn thin—too easy to fall on the wrong side.”</p><p>Trystan’s gaze lifted and met Tucker’s. He wanted to say, You don’t know what you’re talking about—you haven’t lived my life, but he was silent. Trystan nodded once and walked out, leaving Tucker watching his back as the room filled with the next class.</p><p>Trystan sat through his classes, not paying attention to anything. The lump in his throat didn’t abate last night. It didn’t fade while he slept. His concern over Mari’s question twisted into worry. What if she was really asking? What if she intended to sleep with someone she didn’t care about? What could he do about it?</p><p>Nothing, he thought, gripping his pencil so hard that it snapped. The crack was audible. Trystan ignored the looks of his classmates, including Seth who sat shaking his head next to him.</p><p>After the bell rang, Seth walked out next to him, “Thought you would have hit that last night, but obviously you didn’t. What happened to promising to stay away from her?” he said referring to Mari. “Do your promises mean nothing?” there was a joking quality to his voice, but it hit way too close to home for Trystan.</p><p>Trystan rounded on his friend, shoving Seth’s shoulders hard. Surprised by the sudden hostility, Seth flew back into the lockers, tripping several students in the process. When his back slammed against the metal doors, Seth’s face pinched with anger, “What the fuck, man?” Seth stood and walked back toward Trystan, shoving him back. Trystan tried to keep walking, but Seth wouldn’t shut up, “She’s nothing but a bitch,” he enunciated the word, spitting it at his friend’s back, “a tease,” he said it slowly, but Trystan still didn’t turn. Seth’s anger got the best of him and he added, “A little cun—” but before Seth could finish speaking, Trystan was on him.</p><p>The word made him snap. No one could call Mari that. Trystan threw his books to the floor and charged Seth, ramming his shoulder into Seth’s stomach. The two slammed into a group of lockers. Trystan’s fists punched into Seth’s sides, one after the other. Seth screamed at him, returning every punch, but Trystan was a better fighter. After years of beatings, he knew how to take a hit. His body moved, taking Seth’s shots in less vulnerable places or moving out of the way, so Seth’s fists missed Trystan entirely.</p><p>It didn’t take long for a group of kids to circle around them. They chanted fight, fight, fight.</p><p>Trystan thought that was stupid, standing around them in a circle and cheering them on to fight. What do they think we were doing? Dancing? Just as the thought entered his mind, Seth’s fist connected with his stomach. Trystan folded in half and rammed Seth with his shoulder. Neither of them could breathe. Blood dripped down Trystan’s lip and he wondered if it was his.</p><p>Before anything else could happen, Tucker stepped between them, yanking them apart. “Get to class!” Tucker yelled at the crowd. The kids groaned, slowly walking away when they realized there was nothing else to see. Tucker glanced at Trystan with a look of exasperation on his face, “Get to where you’re going, Scott. Seth, my room. Now.”</p><p>“You’re just gonna let Trystan walk?” Seth argued, following after Tucker but looking over at Trystan with malice. His broad shoulders were tense, the muscles in his arms still taut and ready to punch something. This wasn’t over. That much Trystan knew.</p><p>Tucker didn’t look back. He walked at a pace that was fast for him, forcing Seth to keep up and release some that anger burning in his body. He snapped over his shoulder, “Scott’s already taken care of; you on the other hand need some guidance. Not another word or I hand this mess over to the principle and you both get suspended. Rumor has it that one more suspension gets you expelled.” Seth groaned dramatically and trailed behind Tucker and out of sight.</p><p>Trystan headed straight for the stage, rage still flowing through his muscles. He couldn’t control himself. He’d never hit Seth like that before. They’d rough-housed, wrestled and that kind of thing, but this was a fight. Trystan threw punches not caring where they landed, as long as they did some harm. He couldn’t process what was happening. Up until then, Seth had been his best friend. The guy always had his back, but this was insane. It was like he was forbidding Trystan to be with Mari, like Seth would make him choose between them.</p><p>What kind of friend would do that? Maybe he missed something. Maybe it wasn’t what it looked like, because it looked an awful lot like jealousy—but that didn’t make any sense. Seth didn’t like Mari. Trystan’s arms were still tense. His fingers clenched over and over again trying to work it out, as he bounded up the stage stairs and walked behind the wing. It was dark, as usual. He made his way to the basement door and pulled it open.</p><p>Descending swiftly, Trystan stopped at the bottom to see Mari with her legs hanging over the end of the couch and her dark hair fanned around her beautiful face. The little white tee shirt she wore clung to her body. He watched her chest rise slowly, as she drew in a breath. Mari’s eyes were closed like she was daydreaming, thinking about something wonderful. The way her pink lips pulled up slightly at the corners gave her a ghost of a smile. Her foot swung and he was treated to a full smile, though he didn’t know the cause. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mari’s eyes opened, and she saw him standing across the room. “Oh,” she said startled. Her hands slipped to her sides like she was going to push herself up.</p><p>Trystan crossed the room quickly, before she could sit up. Grinning down at her, he asked, “Hanging upside down off the end of the couch, are we?”</p><p>Mari smirked, “Maybe.” Trystan laughed and it was contagious. Mari’s soft laugh filled his body and warmed him, chasing away the rest of the animosity he felt toward Seth. “Definitely. I wanted to see if my hair could touch the floor if I leaned over the side.”</p><p>“Does it?”</p> <p>She nodded, “Yup.” Mari’s eyes were focused on his mouth. Trystan squirmed a little wondering why she was looking at him like that. “What happened to you? There’s blood on your mouth.”</p><p>Trystan straightened and tried to dab it away. “Nothing. Seth and I don’t see eye to eye on something. It didn’t end well.”</p><p>Mari slipped off the couch and stood up in front of him. She licked the back of her thumb and ran it over his mouth, removing the rest of the dried blood, before wiping her hands on her jeans. The touch was light, gentle. Trystan’s stomach felt like it was floating. How she could do that, how she could reach out and touch him without thinking twice was... he didn’t know what it was. The nurse wore gloves when blood was involved, but Mari didn’t seem to think Trystan was anything to be worried about. She trusted him in a way that surprised him.</p><p>Mari looked down and when she met his eyes again, Trystan asked her softly, “What does it feel like to sleep with someone you don’t love?” Her eyes widened and she looked up at him. Her lips parted like she wanted to say something, but her jaw just hung there suspended. Trystan became serious, all traces of humor stripped away by the question, “Do you really want to know?” Do you already have someone picked out? Did you give up on your dreams? Was I the one that pushed you to do it? He stared down at her, hating himself. Breathing hard, heart fluttering, he watched her. Her brown eyes didn’t stray from his.</p><p>She didn’t apologize, she didn’t explain. She just stood there, watching him breathe like everything was normal. After a moment, Mari smiled sheepishly. “You knew that was me. I figured you would.” She looked down at her fingers, as they twisted in her hands.</p> <p>He stepped closer to her, “Of course I would. And I knew what you meant, too. I just couldn’t write it there. Too many people are watching, looking for me.” He wrapped his fingers around hers as he spoke, suspending the nervous wringing of her hands.</p><p>Mari didn’t pull away. “So, what’s it like?” She sounded curious and it killed him. It killed him that she asked—that she wanted him to tell her it was good. He could hear the hope in her voice.</p><p>Trystan watched her dark, rich eyes. There was a hint of something in her voice, like she’d given up on her ideal. Guilt gnawed at him, like he was the one who pushed her to it. What was he supposed to say? That sleeping around helped him forget about his life? That he used it to hide from reality for a while. In those moments, it felt like time was suspended, like there was nothing to fear—like he could survive the lot he’d been given. But now, seeing the look on Mari’s face, he couldn’t say that.</p><p>Sleeping with her would be different. He lowered his lashes, and glanced at her hands. Swallowing the lump in his throat, he finally said, “It’s not worth it, not compared to what you could have.” His thumb stroked the smooth skin on the back of her wrist. His heart pounded harder. It felt like a confession, like everything he’d done until now was wrong—like he knew his salvation was standing in front of him.</p><p>“Compared to what I could have?” she repeated. “And what’s that, Mr. Scott?” One of her dark brows lifted. It made her look jaded and he didn’t like it. Cynical was something Mari was not. There’d been a pureness that attracted him to her. The way she lived her life with her whole heart was brave. She put herself out there and was willing to take chances that he never took. That demanded admiration, even if she didn’t realize it. Now, it seemed like she was thinking about chipping that away. The thought killed him.</p><p>“Love,” Trystan’s voice was deep and determined. “It makes everything else seem trite.” He looked down, unable to meet her gaze.</p> <p>“You sound like a little hypocritical, there Trystan. There can’t be one set of rules for you and another set for me.” She sucked in air and added, “I saw you leave with her last night. Ten bucks says you didn’t even bother to get her name.”</p><p>Fuck. Trystan ran hands through his hair, his heart sinking into his shoes, “You’re right. I didn’t know her name. And the truth is, I didn’t know what I’d do until the moment came.” It was a confession that he didn’t plan to give, but if fell from his lips like drops of rain.</p><p>Mari’s hands fell to her sides, her gaze locked on Trystan’s face. “Oh, and what’d you do?”</p><p>“Took her home. Said goodnight.” He glanced up at her from under his brow, “She’s not the one I want.” His eyes connected with hers and held. There were so many things he wanted to say. Trystan’s body felt light and lithe. In that moment he wanted nothing more than to lift his hand and feel Mari’s soft skin under his fingers, and taste her lips. The longing in his gaze made him feel exposed. He wanted her to see it. He wanted her to know she was the one.</p><p>But for whatever reason, Mari was blind—or worse—she didn’t care. Mari looked away and nodded, “I see.”</p><p>Trystan smiled softly, whispering, “No, you don’t—but I wish you would.” Glancing at her, Trystan’s heart beat wildly in his chest. Every urge he had was wrong. He wanted to wrap his arms around her, pull her to him, and kiss her with all his might. The way her eyes darted away, the way her lips parted like she was disappointed, killed him. Part of him wanted to tell her—no, to show her, how he felt—but his mind kept telling him not to. There was only one chance for him to get this right, and now was not the time.</p><p>Before he could say anything else, Mari smiled weakly and leaned forward, her beautiful face coming closer to his until her lips met his cheek. Her soft lips brushed his face, pressing against his cool skin before retreating.</p><p>Shocked, Trystan stared after her, unable to speak. Bewildered, he finally managed to ask, “What was that for?”</p> <p>Mari shrugged, and looked up at him out of the corner of her eye, with a grin on her lips, “What? You’re the only one who can steal a kiss?”</p><p>CHAPTER 10</p><p>~MARI~</p><p>My heart was pounding in my chest, beating harder than I’d ever felt it as I leaned toward Trystan’s face. It wasn’t a conscious plan. I didn’t think, hey, let’s kiss Trystan on the cheek and then grin like an idiot. Instead, I found my body moving without my consent. I was so happy he didn’t sleep with her. I was so glad that it flooded my body like liquid sunshine coursing through my veins. Before I could stop myself, I felt my lips brush his cheek. Wildly fighting every urge within me, I made sure it was just a peck. I made sure I didn’t take his gorgeous face in my palms and pull his lips to mine. Breathing steadily, I looked up at him when I stepped away, trying to ignore the jitters that were making me giddy.</p><p>Trystan’s voice was airy and filled with shock, “What was that for?”</p><p>The perplexed look on his face made me say it. “What?” I asked, looking at him from the corner of my eyes. I could feel the smile spreading across my lips and I couldn’t hide it. “You’re the only one who can steal a kiss?”</p><p>Trystan blinked like he didn’t hear me right. It was a moment that I’d play over in my mind again and again. Everything about it was perfect. That look, that baffled look on his face, made me want to dance. Unable to hide my giddiness, I swallowed a giggle, but it sounded like a sultry laugh instead.</p><p>Trystan tilted his head to the side, eyes wide, like he didn’t know what came over me. Before I could say anything, he stepped behind me and wrapped his arms around my waist. The vixen, that seemed to possess me moments ago, fled when Trystan’s fingers started tickling my sides.</p><p>His lips were next to my ear. I could feel his breath wash over my neck as he teased, “Kiss stealer.”</p><p>I laughed hysterically, my knees buckling from under me. Trystan scooped me up in his arms and tossed me in the air. I shrieked as I fell straight down onto the couch. Before I could breath, Trystan pinned me by sitting on my legs and continued to tickle me.</p><p>“Kiss ninja,” I laughed, trying to get my fingers to wiggle in a ticklish spot on Trystan’s lean body.</p><p>“Kiss ninja?” he laughed, moving his hands over my sides, applying the perfect amount of pressure to make me laugh the hardest.</p><p>Between hysterical giggles I managed, “Yeah, because you sneak up all stealthy like a ninja.”</p><p>“Kiss thief,” he said smiling, his fingers moving between my belly and my underarms. Laughter made me shake so hard I couldn’t stop. The glimpses I got of Trystan were filled with pure joy. His eyes sparkled, brilliant blue as he laughed.</p><p>“Kiss cowboy,” I blurted out. That one made him chuckle really hard.</p><p>“Kiss bandit.”</p><p>Right then his hands were on both sides of my waist, applying enough pressure to make me squealing with laughter. “Kiss assassin! You’re killing me! Stop!” I laughed, certain I was going to explode in a ball of giggles. As we wrestled on the couch, Trystan leaned into me. From trying to pull away my hair was covering my face, several curls stuck to my lips.</p><p>Panting hard, he stilled and brushed the hair out of my face. “A kiss assassin sounds kind of sexy. I’d like to see one of those.”</p><p>“Grab a mirror, because I’m totally looking at one. He has bright blue eyes, a killer smile, and he’s a closet musician.” A wicked grin spread across my lips. “All the kiss assassins are—”</p><p>Before I could say anything else, his fingers tickled me again. This time when I stopped laughing, something changed. I was more aware that here he was, how he was laying with half of his body on top of mine, on the couch—the nearness of his mouth and his breath on my face.</p><p>Trystan looked down at me, still smiling softly. My heart hammered in my chest, but this time it wasn’t from tickles or silly words. His gaze pinned me in place, those sapphire eyes stole my breath and my brains in one look. They swept over my face, moving slowly from my eyes to my lips, and back again. Trystan’s mouth parted like he was going to say something, but he didn’t. He froze like that, watching me beneath him with an unreadable expression on his face. Just when I thought my heart couldn’t take another shock, the door above us banged open.</p><p>Tucker’s voice bellowed down the stairs, “Scott, get up here. Now!”</p><p>As soon as we heard the door open, we shot apart. Trystan pushed himself upright, and stood as I rolled to my side and patted my hair, trying to make it look normal and not like we’d been doing something naughty. I glanced over at him. Trystan didn’t meet my eyes. Instead, he shoved his hands in his pockets and walked away. Before he got to the stairs, he looked over his shoulder. “Later, kiss thief.” He treated me to a dimpled grin and I nearly died. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ignoring the fact that my heart was half way up my throat, I slumped back into the couch nodding and said, “You know it, ninja.”</p><p>CHAPTER 11</p><p>~TRYSTAN~</p><p>“What are you plans after high school, Scott?” Tucker asked him pointe-blank. Irritation made Tucker’s face a reddish, blotchy color. He stood with his arms folded, eyes narrowed, waiting for an answer.</p> <p>“I’m enlisting,” Trystan replied. He didn’t look away.</p><p>“How do you plan to do that when you’re arrested for assault?”</p><p>Trystan blanched. “What?”</p><p>“You’re eighteen, Trystan. For chrissakes, use your head. You’re not a child anymore. When you hit someone, it’s assault. You should know this by now.” Tucker used little restraint when talking to him. Trystan didn’t understand why he wasn’t dumped in the principal’s office, why Tucker seemed to be watching out for him, but it seemed like he was.</p><p>Before another thought came into Trystan’s head, he blurted out, “Seth’s filing charges?” Worry and shock pinched the spot between his brows.</p> <p>Tucker sighed and his arms fell to his sides. “What’s it going to take to get through to you? This isn’t a game. You get one shot at life and if you screw it up now—” he trailed off, not completing the thought. He let it linger there, allowing Trystan to fill in the blank.</p><p>“I’m not playing games, Mr. Tucker.” Trystan looked away. The anger he had toward Seth was still simmering below the surface.</p><p>“Then what the hell is going on with you? Seth’s your best friend. What did he do that made you react like that?”</p><p>Trystan stared at the floor. A quick shake of his head was the only answer he could manage.</p><p>Tucker’s stance shifted. They were standing in front of the stage. The only light in the room came from the recessed lights that hung above the exit doors. It cast a faint yellow glow across the stage, illuminating the place where they stood.</p><p>Tucker took Trystan’s shoulder in his hand, “I can’t keep you out of trouble forever. I want you to have a shot.”</p> <p>“Why?” Trystan blurted out. He sounded bitter, jaded. It was like he couldn’t believe Tucker’s words. He felt his face pinch when he said it, and it didn’t matter how hard Trystan tried, he couldn’t hide it. He couldn’t believe that someone would look out for him.</p><p>Tucker dropped his hand. He blinked once, slowly, his forehead pinching together forming rows of wrinkles that made him look much older than he was. He sounded remorseful when he spoke, “Someone told you wrong, Trystan. They lied to you.” He shook his head sadly, as he said it and then turned to leave.</p><p>“What are you talking about?” Trystan said to his back. Turning, Trystan watched Tucker as he walked away up the dark aisle toward the exit at the back of the auditorium.</p><p>When he reached the door, Tucker turned back to Trystan and said, “You’re worth something, Scott, your life is valuable. Right now, you have a chance to escape whatever you’re running from, but if things keep up like this, you’re going to blast your only escape route straight to hell.” With that, he disappeared through the door leaving Trystan alone.</p><p>CHAPTER 12</p><p>~MARI~</p><p>I didn’t mean to overhear what I heard, but when Trystan’s voice echoed from the other side of the stage curtain, I stopped. I was no longer interested in exiting the stage door in front of me. Instead, I lingered, listening.</p><p>Did he say he was enlisting? My throat tightened. I couldn’t breathe. I had no idea what Trystan planned after school. I assumed he would go to college, but now that I thought about it, I hadn’t heard him mention applications and admission interviews. It felt like someone was crushing my heart. Frozen, I stood behind the curtain and heard everything.</p> <p>Tucker’s warnings rang in my ears. I peered through the stage curtain to see Trystan sitting in the first row with his face in his hands after Tucker left the auditorium. Trystan leaned forward so that I couldn’t see his eyes. The light spilled onto the curve of his back before it mixed with shadow. Dark hair hung forward, blocking his face.</p><p>Paralyzed by fear, I stood there staring at him. If he enlisted, I’d never see him again. The thought made me shiver. Sickness crept up my throat and soured in my mouth. There were only a few months of school left. Then, he’d be gone.</p><p>Forever.</p><p>I couldn’t breathe. I couldn’t think. I didn’t think. I walked down the stairs, quietly making my way straight toward him. I didn’t care if he loved someone else. I had to tell him. I had to say it before he left or I’d regret it for the rest of my life.</p><p>Trystan lifted his head when he saw me descending the stairs. His eyes seem hollow, like he was weary and broken. He didn’t speak. That dark brooding gaze followed my movements. There was a hardness to his gaze that usually vaporized around me, but this time it remained in place. I knew that he’d be angry that I heard. Trystan never told me he was running from anything, but Tucker seemed to have figured it out. Trystan looked like he’d been sucker-punched with the truth. Knowing that I was standing there, knowing that I’d seen it happen, made it worse. His eyes said it all.</p><p>Heart pounding harder, I reached the lower landing and stepped onto the floor. I didn’t know what to do, what to say, so I didn’t say anything. There were no words to comfort, no words to explain how I felt or what I wanted. Walking toward him with my shoulders back, my long hair swayed gently with each step. Trystan gazed at me with a desperate look in his eye, like he was drowning and I wasn’t welcome to watch.</p><p>When I was two steps in front of him, Trystan abruptly looked away. He pushed out of his seat, making us stand nose to nose. “Mari, I don’t think now is a good time—”</p><p>I didn’t stop moving toward him. I didn’t answer him. I didn’t speak. Pulse pounding in my ears, I lifted my hands and curled my fingers in his shirtfront. Surprised flashed across his eyes, as I pulled his face to mine. I yanked his shirt hard, pulling him closer to me, fast. His lips pressed into mine and I kissed him.</p><p>I kissed Trystan Scott. And it was a real kiss. I didn’t hold back and I wouldn’t apologize for it later.</p><p>My lips moved against his and this kiss was my doing, not his. His hands lifted and tangled in my hair. I flicked my tongue against his lips until he parted them, and let me deepen the kiss. His arms tightened around me, embracing me harder. Breathless, I kissed him more, feeling every curve of his mouth and tasting every inch of his soft lips. My hands released his shirt and tangled in his silky hair. I didn’t want it to end. The moment was perfect. The kiss was perfect and I knew without a doubt it was my kiss, that it was real, and that I meant every bit of it.</p><p>When we parted he looked at me with that soft smile on his face. Breathing hard, he said, “You have to stop doing that, thief.”</p><p>“You have to stop letting me,” I replied, smiling back at him. My fingers pushed through his hair and then fell to rest on his shoulders. He closed his eyes, feeling my touch, enjoying the sensation.</p><p>When he opened his eyes again, Trystan was more breathless than before. “I need to tell you something.”</p><p>Icy fear crawled out of my stomach and up my throat. He wanted to tell me that he was in love with someone else. If he said it, I’d die. There was no way I could handle it, and once I knew the name, it would be impossible to kiss him and not feel guilty. I could barely speak, but I managed to shake my head, saying, “I don’t need to know. I like things like this. I’m okay with things like this...”</p><p>Trystan was quiet for a moment. He reached for me, running his fingers through my hair. When he spoke, his voice was barely a whisper, “You deserve more...”</p><p>My heart was in my throat, ready to crawl out of my mouth. The words, I love you, were on my tongue. I was going to say it, but the way he looked at me, rendered me speechless.</p><p>Trystan’s breath warmed my cheek. He was that close, his body against mine. When he pressed his lips to my face, I couldn’t speak. My breath caught in my throat as Trystan slowly bestowed one kiss after another across my cheek. I closed my eyes, and enjoyed every second of it. Every bit of me felt light and happy.</p><p>When Trystan pulled back again, I couldn’t hide my grin. “Assassin,” I breathed into his ear. “You’re killing me. You know that?” The warm playful tones in my voice let him know how much I liked it.</p><p>Trystan pulled back enough to see my face, his smile widening as he did so. “I could say the same thing.”</p><p>“So, what are we going to do about it?” This confidence, this insane person who was speaking wasn’t me. She was blurting things out that I never had the guts to say. But he’s leaving, a voice in the back of my mind whispered. You don’t have another year. You barely have another semester. He’ll be gone after graduation. Take a risk, give a kiss. See what happens. I listened to that voice for once, finding resolve that was foreign to me.</p><p>Trystan released me and stepped back. Before I could ask what he was doing, he pulled a piece of paper from his pocket and showed it to me. “I wanted to tell you this for so long, but—” his voice trailed off.</p><p>I took the wrinkled sheet from his hands, my eyes scanning the page like it could devastate me. It was the song—the Day Jones song about the girl. My stomach clenched, as I tried to shove it back into his hands. Shaking, I said, “I don’t need to know who she is. Having you like this is better than nothing at all.”</p><p>He smiled sadly at me, but shook his head. “Not until you read the last line on the page. Flip it over, Mari.” Trystan watched me, his eyes burning into mine.</p><p>My stomach acted like it was in a free-fall. I looked down at the page in my hands and flipped the paper over. It felt like time stopped. The rapid beat of my heart filled my ears. I could feel Trystan’s gaze on my face, as my eyes trailed down the page looking for the last line. There were two lines of words filling the space were only one line belonged. It was an alternate ending, an ending that showed a name.</p><p>My skin prickled as I read it. I didn’t understand. I looked up at him and couldn’t stop shaking. “What is this?”</p><p>“The original ending—the real last line where I tell the girl I love her and call her by name.” My chest swelled as my throat tightened. I shook so hard that I dropped the song, and tried to step away. Trystan didn’t chase after the sheet with his music and words. Instead he chased after me. His hands slipped around my waist and he pulled me to him.</p><p>Looking down at me, he said, “The girl who inspired that song, the girl who stole my heart—she’s standing right in front of me.” </p> </body></html>"]