["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>The house was too quiet. She could hear her own footfalls as she walked through it, her own heartbeat as she stared into her coffee. She could feel her fear, closer, stronger than it had ever been before. The new house was so still, the memories that her New York home had held were absent here.</p><p>She had moved to be closer to Tess. To try in some way to make up for the cruel, bitter words she had thrown at her daughter. And she had moved to live again. She had hidden from herself and from the memories of her marriage for so many years that she was feeling the deprivation in ever increasing levels. Her family was here. Her sister, her friends. They were all here. With Tess gone, the New York house was too silent, too lonely. Though this one wasn’t much different today.</p><p>She still wore the cream lace dress she had chosen for the wedding, though the matching wide brimmed hat had been thrown carelessly on the embroidered chair that sat inside the front entryway. She felt lost in a way she hadn’t felt in years. A loneliness she couldn’t explain haunted her; needs she couldn’t admit to shadowed her mind and her desires. So she thought of Tess instead.</p> <p>The wedding had been one of the most beautiful Ella had attended in her life. Her daughter, her baby, had made a gorgeous bride. The pervert she had married had looked handsome and darkly seductive.</p><p>She ran her fingers over the careful upsweep of her auburn hair, feeling the pinch of hairpins holding it in place. Her hairdresser had followed her orders to the letter. Not a strand of hair had slipped free of its mooring. Her dress hadn’t creased, and her silk stockings hadn’t dared slip or snag. She looked as well dressed now, six hours after the wedding, as she had when she left that morning.</p><p>Thankfully, with the move to Virginia, the damage she had done to the relationship with her daughter was healing. In her shock, in her rage, she had been hurtful to Tess. But, still, she couldn’t believe what she had walked in on.</p><p>Her hands trembled as heat flooded her face. It had been Jesse, not James, but the likeness was too great. The twins were identical in nearly every way, even to their sexual preferences. Tall and distinguished, with a lean muscular build and dark toned skin that looked perpetually tanned. Thick, black hair fell along their napes, straight and glossy, tempting the women around them to touch.</p><p>Her legs trembled as she sat down at the small, walnut kitchen table. Her fingers trembled as they covered her lips. Her heart pounded with hard, driving beats within her chest. It had been her worst nightmare come to life, except her daughter played the role Ella had played within those dark visions.</p> <p>Not with Cole, but with James. And there lay the demon that lurked in her mind. Perverse, depraved. She had walked away from her marriage and the life she had fought to build because of her husband Jase’s perverse desires. The light spankings she had managed to tolerate, though they had seared her with shame. Being restrained had been easier, though even then, what pleasure had filtered through the experience had been tainted by the fact that she knew, knew what was coming and she knew she couldn’t bear it.</p><p>Her lack of submission to Jase’s needs had finally broken their relationship. She hadn’t been able to give him the trust, the control he needed. She had been terrified, knowing instinctively what would come next, who would come next. And she knew she would never be able to maintain her control, her sanity, if James touched her.</p><p>He had been at Tessa’s wedding. He had watched her with knowing eyes, so green, so wicked, her body had pulsed with depravity. He had shaken her hand, the heat and pleasure of his touch nearly taking her breath. And all the time he had watched her, knew her, tormented her.</p><p>She stalked to the glass door that led to the cool, foliage sheltered area of the garden. The slender heels of her shoes created a hollow, lonely tap against the wood of the porch as she moved to the end of the vine-covered shelter. Her hand gripped the thick post, her nails biting into the wood as she fought her anger, her fears for her daughter.</p><p>Tess was too much like Jase. Ella had always been afraid of that, especially after the books she had found years ago, hidden in Tess’s bedroom. Her desires were extreme, and evidently she had no fear of them. Unlike her mother, who fought the demons, the knowledge of her own needs.</p><p>She couldn’t get the image of it out of her mind. She couldn’t fight the dark nightmares of James, holding her, taking her as another did. She never knew, never cared who joined them in those nightmare images, all she saw, all she knew was James.</p> <p>One day, Ella, you’ll have to stop running. When you do, let me know.</p><p>“Like hell,” she bit out, turning and moving purposely to the house. She wasn’t running, and she sure as hell wasn’t going to let him know anything.</p><p>Jase’s sexual tastes had nearly ruined her life, and now they would ruin Tess’s. No man could truly love a woman, truly respect her, if he allowed another to touch her, to take her.</p><p>She fought the ripple of response between her thighs. The creamy moisture that she fought to ignore, the desires she kept carefully banked, always hidden. Controlled. She couldn’t let him break her, couldn’t let him see her response to him. If anyone had the power to break her heart, it was James Wyman.</p><p>She couldn’t ignore him; she couldn’t pretend he didn’t exist. Due to her own foolishness, he would soon be a daily part of her life. But she could handle it, she assured herself. She had spent her life practicing the careful control that had sustained her over the years. She could handle James Wyman, easily. It was all a matter of control.</p><p>Chapter Two</p><p>It was all a matter of control. James watched as Ella Delacourte led him up the carpet-covered stairs to the bedroom he would be using while he stayed in her home. He was still amazed that she had given into Tess’s request that she allow James to stay in the house until the home he was buying was ready to move into.</p><p>Her slender waist and gently flared hips drew attention to the delicate, perfect curves of her ass as she moved in front of him. Dressed in gray silk slacks and a pearl gray blouse, she was the epitome of grace and elegance. Calm, controlled...so perfectly controlled it made him itch to hear her scream. To hear that perfectly pitched voice ragged and hot, begging him to fuck her deep and hard, to take her however he wished. He wanted, needed, to break that control.</p> <p>And Ella knew it. She had been well warned years before, and he wasn’t a joking man. But he was a patient man. He had waited five years for the chance at the only woman he knew that could make him think of forever. The only one he knew would challenge his mind, as well as his sexuality. If he could manage to keep from getting kicked out of the house.</p><p>He hid his grin. He knew Ella was desperate to make up for the painful words she had thrown at her daughter when she caught her sandwiched between Cole and Jesse. She had been furious, outraged, and if Jesse was right, certain at first that it was James rather than Jesse who had participated in Tess’s first ménage.</p><p>Tess, too, wanted that relationship repaired, but she also wanted her mother happy. She had been more than happy to participate in James’ plot to get closer to her mother. Especially after he convinced her how long he had been waiting for the opportunity.</p><p>“You can use the kitchen and the washroom if you do your own cooking and laundry. The living room is okay for entertaining, but I have to ask that if you need overnight female companionship you rent a motel. I won’t have it in my home, James.” She pushed open the bedroom door before turning to face him.</p><p>She wore only a minimum of makeup today to accentuate her eyes and her graceful cheekbones. Her lips were colored with a soft dawn shade, and at the moment the lower lip appeared slightly swollen, as though she had been biting at it as she walked upstairs.</p><p>“I’m not a teenager, Ella.” He watched her carefully, aware that her blue eyes were a shade darker than normal, the pupils slightly dilated. He wondered if her pussy was wet, or if she had mastered control over even that part of her body.</p><p>“I’m aware of your age,” she said coldly. “I’ll leave you then to get settled in. If you need anything, the house is laid out fairly simple, and everything is easy to find. I’ll talk to you later.”</p><p>“Ella?” He stopped her as she turned for the door.</p><p>He caught the ready, tense set of her body, as though she were preparing herself for a battle. She turned back to him, her expression carefully closed, cool.</p><p>“Yes, James?” She kept her voice well modulated, soft yet not simpering.</p><p>“Am I allowed to come out of my room if I’m a very good boy?” James kept his voice low, teasing. There was no way in hell he was going to get close to her if she didn’t loosen up a little.</p><p>She was wary, almost frightened of him, and she almost succeeded in hiding it. Almost. He knew her better than she knew herself in some ways. She stiffened further, her perfectly arched brows snapping into a frown.</p><p>“I’m not in the mood for your games.” Her voice was non-confrontational, but the flush along her cheekbones warned him of the coming storm. Damn, he loved pissing her off. Watching her eyes glitter in ire, her pale cheeks flushing so prettily. It gave him a glimpse of what she would look like in passion.</p><p>He tilted his head curiously. “Shame. Tess assured me you would welcome my company. I’m feeling as though I’m putting you out, Ella. Perhaps I should stay in a hotel until the house is ready.”</p><p>For a moment—a very brief, infuriating moment—satisfaction glittered in her eyes, until she remembered Tess and her promise to make James comfortable. Her lips thinned as she drew in a deep, careful breath. The smile that she pasted on her face had little to do with warmth; it damned near caused frostbite.</p><p>“You’re perfectly welcome, James. Tess’s little friends are always welcome in my home, you know that.”</p><p>Ouch. Little friends? He chuckled silently. She was finding every opportunity to remind him that he was several years younger than she was. The six years made little difference to him. As a matter of fact, it seemed perfect. An older man would never keep up with the passions he knew ran beneath that cool exterior.</p><p>He allowed a smile to curve his lips as he stared at her intently. “Little friends? I’m hardly that young, Ella.”</p><p>“Not far from it,” she grumbled. “I have work to do, James. Make yourself at home, and perhaps I’ll talk to you later.”</p><p>But not if she could help it.</p><p>“What type of work?” He stopped her again. “I was unaware you worked. Jase should have given you a very healthy settlement from the divorce.” By God, if he hadn’t, James would be talking to him about it.</p><p>“That’s none of your business.” She frowned again. “What I do, James, I do for my own pleasure and how Jase decided to pay me for the divorce is none of your concern.”</p><p>Pay her for the divorce? James was damned well aware that she was much less than happy in that marriage, yet she sounded bitter, rejected. Had she cared more for Jase than he had once thought? That idea didn’t set well in his mind, or in his heart.</p><p>“Ella, you weren’t happy, and neither was Jase,” he said softly.</p><p>“I refuse to discuss this with you.” She straightened her shoulders majestically, her lips thinning as her anger grew. “I don’t mind your presence here, James, but I don’t have time to entertain you. You’ll have to find your amusements elsewhere.”</p><p>“But you said no women.” She stopped again as she turned to leave.</p><p>“No women.” She shook her head tightly, her voice strained. “Not in my home, James. Never again in my home.”</p><p>Chapter Three</p><p>“You know, you need a housekeeper or a cook.” James’ voice early the next afternoon had her jumping in startled awareness as she finished filling the coffeepot. She turned, facing him, thinking what a shame it was that one man would have such sexual presence.</p><p>He stood propped against the doorway, dressed in dark blue silk slacks and a lighter blue silk shirt. His jacket was held at his shoulder by the crook of his finger, and his green eyes regarded her with lustful secrets. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m perfectly capable of cooking my own meals and cleaning my home.” She shrugged. She had been raised to do for herself, and cleaning gave her something to do, a way to occupy her hands when her body was filled with restless energy.</p><p>He straightened from the doorframe, walking to the table with a casual male grace that threatened to take her breath. She turned quickly from him, moving to the cabinet to retrieve her coffee cup. She fought to still her shaking hands, the nervousness in her stomach that wouldn’t seem to go away. She felt immature, like a quaking child before him. It was...unbalancing.</p><p>“What if you became busy? Or found a lover?” he asked her then.</p><p>Ella fought back her panic. She felt aged, past the time when she could have worried about the future, or a man in her life.</p><p>“I’m not looking for a lover, James.” She poured her coffee, moving with what she hoped was casual unconcern to the work isle in the center of the room.</p><p>She leaned her hip against it, lowering her head as she concentrated on stirring cream and sugar into the dark liquid. She was aware that he was watching her, his eyes dark, intent. She was well aware of his desire for her; a desire she knew wouldn’t last beyond the moment. She had no illusions about herself. She was growing older, and her body was slowly showing the signs of it. It wasn’t something she worried much about, until she was faced with James. He made her feel young, made her feel desired, and it was dangerous to allow herself to be convinced that it could go further. Too dangerous for her heart.</p><p>She watched as he laid the jacket over the back of a chair then moved to the cabinet and snagged a cup for himself. His arm reached up, muscles bunching in his shoulders and back. She shivered, her hands itching to touch him, to feel the strength of motion beneath his flesh.</p><p>He turned back to her, leaning against the counter as he regarded her quizzically. “Do you have a lover?”</p><p>His voice was whisky rough and dark. It caused arousal to zip along her nerve endings, her skin to become sensitive, needy for his touch. She hated it.</p><p>“That’s really none of your business.” She fought to stay in control. He would leave soon; she knew Jase depended on him at the corporate offices. Not that she understood any of the legal talk she had ever heard in the past, but his job, she knew, was complicated and often required late nights and full days. She was hoping that would keep him out of her hair for the most part.</p><p>“Maybe I want to make it my business.” His voice hardened imperceptibly as he watched her, his gaze brooding.</p><p>Ella couldn’t stop the surprise that she knew was reflected on her face. She blinked over at him, her chest tightening in unwanted excitement, her vagina throbbing in unwanted preparation for his touch.</p><p>“Why would you want to?” She couldn’t understand his desire for her in any way. “I’m not in the market for complications, James. A lover is, by his very nature, a complication.”</p><p>He tilted his head, his lips quirking in amusement as she raised the coffee cup to her lips.</p><p>“Don’t you ever get horny, Ella?” She nearly dropped the cup. The coffee she had just taken into her mouth threatened to choke her as it went down the wrong way.</p><p>She wheezed, her eyes widening, tearing as she stared at him in shock.</p><p>“For God’s sake,” she bit out when she could breathe again. “Is that any of your business, in any way, James?”</p><p>“Actually, it is.” He shrugged his shoulders with deceptive laziness. “I want you, Ella. I want to lay you down and touch you in all the ways a man can. I want to fuck you until you’re screaming out in agony, because it feels so damned good it hurts. So yeah.” He nodded. “It’s my business.”</p><p>The breath lodged in her throat. She felt her cunt cream, her thighs tremble at the thought of him powering into her, fucking her as she screamed. She had never screamed, never wanted anything desperately enough to beg. But she couldn’t have James. Anger, directed at herself, at him, poured through her.</p><p>She felt her face flush, her body tremble, as she fought for control.</p><p>“Sorry, James.” She smiled tightly. “I’m really not in the market for a toy boy this year. I guess you just lucked out.”</p><p>She didn’t give him time to reply. Before he could cut her down, before he could tempt her further, she swept from the room, rushing to the safety of her bedroom where her control wasn’t as important. Where it wouldn’t matter if the tears that filled her eyes escaped. All that mattered was that James didn’t know.</p> <p>Chapter Four</p><p>She wouldn’t survive this. Ella escaped to her bedroom, locked the door clumsily behind her and stood against it, breathing raggedly. She was flushed, heated, her body tingling. She hated it.</p><p>Her fists clenched as she felt her vagina spasm, growing wetter by the second as she remembered the sound of his dark, velvet voice. The deep baritone stroked over her senses then plunged heatedly into her womb. How was she supposed to maintain her control this way? She despised the person she had been while married to Jase. She had acted like a harpy, her fury and fears driving her to rages that had terrified her.</p><p>For years. Years she had fought him and what he wanted from her. Because she had known how much he wanted from her. The sexual excesses he enjoyed. She pressed her fists to her stomach, fighting the driving, insidious images that pounded at her brain. She could have tolerated it, she told herself. She could have allowed herself to let go if she hadn’t known the man who would eventually arrive.</p><p>Jase was nothing if not honest. He had never lied to her when his sexuality had begun emerging. They had been in their early twenties, and his need to dominate, to control her sexual responses had at first seemed merely harmless play. He hated her controlled sexuality. Her fear of letting go, of giving him the responsibility of pleasing her.</p><p>Ella had hated his need for it. She had married him because she was pregnant. She had cared for him, had felt a warmth and gentle desire for him, but what he needed she had never wanted. Until she met James. Until she saw in his wicked, knowing eyes, the truth about herself.</p><p>God, he had been twenty-six, and she was already in her thirties. She had felt like a cradle robber, looking at him, feeling her pussy gush with moisture, her breasts swelling in desire. And then, she had begun to fantasize. When Jase took her, his cock burrowing into her as he held her to the bed, she imagined it was James.</p><p>When he tied her to the bed, her nipples would bead instantly as she thought of James tying her down, thought of James tormenting her body, driving her ragged with need. And when Jase had suggested a ménage, she had thought of James, yet still pretended her husband wasn’t truly serious.</p><p>Until the day James had walked into the room Jase had set up for his play. Tied to the narrow bed, her legs gaped open, as Jase grew more and more frustrated over her lack of response. James had walked in, his brilliant eyes going to her smooth, bare pussy and she had creamed instantly. She had fought Jase, vowing to never allow him to touch her again. The screaming match that ensued lasted for years. Until the divorce.</p><p>She couldn’t stand it. For years she had pushed her own needs back, fought to forget James and the terrible desires that raged through her system. Until she walked in and saw Tess with Jesse, James’ twin brother. Betrayal had sliced through her soul. And Jesse, damn his black heart, had known. She had seen it in his eyes, in the sardonic lift of his mouth.</p><p>Her hand raised to one throbbing breast as the ache in her nipples seemed to only grow. Her fingers glanced over the hard point beneath the silk blouse and sheer bra she wore. Her breath caught on a gasp at the electrified pleasure that washed over her.</p><p>She felt her pussy cream furiously, spilling the thick essence along her bare cunt lips. Jase had started her habit of shaving there. It was one of the few things he had taught her that she was thankful for. Until now. Now, the incredible sensitivity of her bare inner lips was a curse. She could feel her juices, hot and slick, coating her flesh as they eased from her vagina, and it only made her ache more.</p><p>How was she going to bear having him in her house? Her arms wrapped around her waist as her womb clenched. He hadn’t been here an hour yet and already she could think of nothing but his touch moving over her, his hands stroking her, spanking her... She whimpered. She didn’t want that, she cried silently, couldn’t bear it.</p><p>“Ella, you in there? I’m ordering lunch, how do you feel about pizza?” He knocked on her door, startling her into jumping away from it with a tight gasp.</p><p>God, wasn’t he ever going to leave for work? Surely he wouldn’t be here for lunch. She couldn’t handle it.</p><p>“Fine.” She was horrified at the husky, needy quality of her voice. She cleared her throat and swallowed tightly. “I’m tired. You eat. I’m going to lay down.”</p><p>“Ella, come out and talk to me,” he cajoled, his voice soft, filled with such wicked promises she had to bite her lip to keep from calling him to her. “It’s just pizza, nothing else.” Amusement was like a dark vein of sin in his tone.</p><p>She glanced at the clock, then the bedside window. She could find no reasonable excuse to stay hidden in her room, and she knew if she continued to refuse it would only make him suspicious.</p><p>“Fine,” she bit out, feeling her nails piercing the skin of her palms. “I’ll be out in a while. I need to freshen up first.”</p><p>“I’ll be waiting on you. Don’t take too long.”</p><p>As he spoke, Ella tore desperately at her clothes to remove them. She was too hot, too aroused to go to him like this. If she didn’t find relief, no matter how minute, she would burn in flames of desire if he so much as brushed against her.</p><p>She jerked the drawer of her bedside table open and pulled out the slender, slim line vibrator she had purchased years ago. The soft, supple latex flexed in her palm as she stretched out on her bed. It wasn’t thick or long, but buying the damned thing had been one of the hardest things she had ever done in her life.</p><p>Her body was already primed, her cunt so wet and sticky that when she ran her fingers through the narrow slit, it clung to her fingers. Her clit was swollen, so large and sensitive she gasped as she circled it with the head of the slender dildo. She eased the control switch on the vibration up, shuddering as the device began to hum.</p><p>She couldn’t still her gasp of breath as she slid it into the hungry opening of her pussy. Her muscles closed on it, relishing in the hum, but still greedy for more. She pushed it deeper, feeling the sensitive tissue part for the invader.</p><p>Ella writhed on the bed, her eyes clenched tightly closed as the fingers of her other hand gripped one of her tight, elongated nipples and pinched lightly.</p><p>She couldn’t groan, she told herself. She couldn’t cry out his name as she had done since seeing him at the wedding and agreeing to let him stay. She couldn’t pretend it was James pushing inside her wet pussy, fucking her tight depths. But she couldn’t help it either. Her mind formed the image. His body hard and muscular, his cock thick and long as it pushed inside her.</p><p>Her control weakened as a small whimper escaped her throat. It wasn’t going to be enough. Oh God, she could feel it, the weakness of her body, the incredible arousal searing her nerve endings. She would never achieve a climax hard enough to still the raging pain.</p><p>“Let me help you, Ella.” The words were like a splash of cold water.</p><p>Her eyes flew open to see James, fully dressed, his green eyes glowing with lust as he stared down at her nude, perspiring body. From her breasts to her still slender thighs, spread invitingly as she moved the vibrating dildo inside her pussy.</p><p>“Oh God.” Embarrassment washed over her as she realized he really was standing there, watching her. He was real this time, not a figment of her imagination.</p><p>She would have jumped from the bed if James hadn’t moved to stop her, pinning her shoulders to the mattress as he forced her legs closed holding the vibrator inside her pussy as he stared down at her, his powerful legs clamped on the outside of hers as she stared up at him in horror. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His eyes were dark, wicked, his expression filled with sensuality, with lust. Her legs were clamped together as his fingers moved to the control box at her side and he thumbed the power up to its highest level.</p><p>Her body jerked in response as the heat flared higher, hotter inside her tormented depths.</p><p>“Who do you imagine inside you, Ella?” His voice was deep, rough. “Who’s fucking that tight pussy for you, in your mind?”</p><p>The deep baritone of his voice stroked over her nerve endings, sending her senses into overdrive. Her hips jerked in reflex, her clit pulsing, throbbing in reaction.</p><p>“Don’t do this,” she cried out, fighting the pleasure as he forced her wrists into one broad hand, holding her securely as he stared into her eyes.</p><p>“Is it me, Ella?” he asked her softly. “Do I fuck you in your fantasies? I sure as hell fuck you in mine. Hard and deep, Ella, but my cock is a hell of a lot thicker than that baby pecker you picked. When I push inside you, you’re going to be so damned tight you’ll come from the pleasure/pain alone. Come for me now, Ella. Come for me baby, so we can discuss this rationally.”</p><p>Ella couldn’t bear it. His voice was enough to make her juices flood her pussy, making the vibration echo along her sensitized flesh.</p><p>“I can’t.” She fought to hold onto her control. She couldn’t do this. It was too horrifying, too humiliating. Dear God, how had he opened a locked door?</p><p>He leaned closer, his legs loosening from around hers, his hand moving between their bodies as he watched her. She twisted against him as he forced his hand between her slick thighs and gripped the end of the dildo.</p><p>“I’m going to fuck you, Ella.” He pulled it back as she cried out, staring up at him, seeing his grimace of hot, desperate lust. “Like this.” The vibrator was thrust into her pussy, squishing through the thick juices, pounding into her womb as he began to fuck her hard and fast with her own dildo.</p><p>Her eyes widened. Her body stiffened as ripples of electricity began to flare through her womb. She could have survived it. She fought for control and it was nearly in her grasp when his head lowered to her nipples.</p><p>It had been nearly a decade since a man had touched her. Nearly ten years of fantasizing about this, aching and dreaming of his dominate touch. When his teeth gripped her nipple, his tongue rasping over it as he fucked the vibrator hard and deep inside her pussy, she lost all sense of control.</p><p>An orgasm unlike anything she had ever known ripped through her body. She felt the juices spray from her pussy as James groaned, fucking her harder with the latex toy, pushing her thighs apart and heading for her clit. When his lips covered it, his tongue stroked it, she screamed. Her hips arched, her pussy greedily sucking at the vibrator as her clit exploded, and she was flung into a vortex of pleasure that horrified her with its force.</p><p>It wouldn’t stop. Her upper body jerked from the bed as her muscles contracted, her pussy exploding so hard, so deep, every bone and muscle spasmed in response. She shuddered, feeling the muscles tightening on the vibration inside her as she shook in the grip of her orgasm.</p><p>Moments, hours later she collapsed to the bed again, though her womb continued to contract in deep, hard surges as the thick cream flowed from between her thighs.</p><p>“There, baby,” James soothed her gently and she realized she was crying. His lips feathered over her cheek as he slowly lowered the speed of the vibrator, bringing her back to sanity. She could smell the slight earthy scent of her pussy on his lips, and shuddered at the knowledge of it. “It’s okay, baby,” he whispered again. “Ease back to me, Ella. It’s okay now.” He eased back to look at her as the tears welled from her eyes, pouring down her cheeks. “Don’t cry, Ella,” he whispered gently. “It’s okay, baby, it’s what we both needed for now.”</p><p>She shook her head, fighting now to be free of him, to remove the proof of her need, her own perversions from the dripping channel between her thighs. She rolled to her side to escape him, but before she could get away, he pushed her down again, on her stomach, the vibrator once again trapped inside her quaking flesh.</p><p>“No, Ella.” His voice was hard, tight with lust as his hand smoothed over the quivering cheeks of her rear. “You won’t run from it, and by God, I won’t let you hide from it any longer.” His fingers ran down the cleft of her ass as he hummed in approval.</p><p>The juices that flowed from her pussy had slicked the area, giving his fingers greater ease despite the tightening of her muscles.</p><p>“James. No,” she cried out as he circled the tight opening of her anus. Horror and shame streaked through her system, because despite her embarrassment, she could feel the entrance relaxing, her betraying body sucking at the tip of his finger.</p><p>“For now.” He was breathing hard at her ear, his chest laboring under his breaths. “For now, Ella. I’ll leave you, this time. But you have fifteen minutes to bring that pretty ass out to the living room where we can discuss this with relative sanity. You will not run, Ella. You will not hide. You’ve come in my mouth now, and I’ll be damned, but I won’t wait much longer to feel you coming around my cock. Fifteen minutes.</p><p>He moved quickly from her, stalking to the door. “And the next fucking time you try to lock a door against me, I’ll break the son of a bitch down. Fifteen minutes.”</p> <p>Chapter Five</p><p>James was shaking as he stalked to the pristine, perfectly organized living room. His hands, his entire body, were nearly shuddering in reaction, in lust and need, and he feared the loss of his own control. Never. In his entire sexual life his own control had never been so sorely tempted as it had been in Ella’s bed, watching her push that pitiful excuse for a dildo inside her tight pussy.</p><p>The vibrating toy was slender, soft to the touch, a teaser. A toy to use to drive her to distraction and make her hungry for more, and she didn’t even know it. But he intended to do his best to instruct her on the best toys for the job. The job of preparing her, opening her, driving her insane for his final possession.</p><p>Jerking the cell phone from his waistband he made a quick call. His eyes watched the door carefully as he put in the order to the online supplier of adult products. A collection of toys, of devices, and he alone would show her the proper use of them.</p><p>He wouldn’t have long. It would take her five minutes, he guessed, to work herself up. Another five to struggle back into her clothing as she fought the lethargy of her orgasm. Damn. He shook his head as he gave the owner of the adult products store the list. Damn, she had climaxed like nothing he had ever seen. Her pussy had gripped that dildo so tight, so hard, he’d had to struggle to fuck her through the rippling pleasure.</p><p>He had watched her abdomen, seeing the convulsive shudders of her womb beneath her flesh as she cried out his name. But she hadn’t screamed it, and he swore before the week was over, she was going to scream his name.</p><p>He had just flipped the phone close and pushed it back in its slim holder when she stormed into the room.</p><p>“You dirty son of a bitch!” she screamed with rage and fear. “You dirty, perverted bastard. This is my home. Mine. And you can fucking leave now.”</p><p>No control. She flew at him, her face flushed, murder in her eyes, intent on knocking the hell out of him. He didn’t think so. He had seen that bruise Jase had sported for a week years before their divorce.</p><p>Before she could land the blow he grabbed her wrists, shackling them together in one hand behind her back. His arm went around her waist and he jerked her against him. Before she could curse him again, his lips slanted over hers.</p><p>She bit at him, but he nipped at her lip warningly a second before his tongue plunged into her mouth. She was heat and anger, and desperate, hungry lust. She groaned into the kiss, fighting his hold though her lips opened for his tongue, then suckled it tight into her mouth.</p><p>James groaned, his cock jerking beneath his zipper at the thought of her mouth enclosing it in such hot pleasure. But for now, his mouth had her, and the taste of her was indescribable. Sweet and warm, filled with the heady, aroused whimpers of a woman overcome with her own desires, pleasured, hungry for more.</p><p>He allowed his tongue to stroke the inside of her mouth, to twine with hers as his head slanted, angling closer to allow his lips to stroke hers. She was trembling in his arms, and he knew her pussy would be dripping, wet and aching. And tight. He groaned at the thought of that as he lifted her closer. She had been so tight on that damned slender vibrator that he could barely fuck her with it. She would strangle his cock. His body tensed, his tongue fucking her mouth as she growled in greedy passion beneath his kiss.</p><p>He couldn’t get enough of her. She arched to him, her breasts unconfined beneath the loose silk shirt she wore, her pants-covered thighs plastered to his as she pressed her mound hard against the thick erection beneath his slacks. The soft cotton pants she wore would do her little good, he promised himself. She would soak them with the juices from her sweet little cunt just as she had the silk slacks.</p><p>With a muttered groan he pulled back from the kiss and stared into her face. Her eyes were dazed, her expression slack with sensual need. He could have her now if he was willing to take her. To give her no time for thought, to allow her to believe he had forced the control from her as he had in the bedroom. That would only hurt his intent. It would do nothing to further his own personal goals.</p><p>“Enough,” he growled, holding onto her as he pushed her into the recliner at his side. “Sit there. And don’t get up, Ella, or I promise, you’ll regret it,” he warned her as she made to do just that.</p><p>Evidently she heard the strain of his own fight for control in his voice. She pressed herself tighter against the back of the chair, staring up at him with wide eyes.</p><p>James drew in a tight breath. His cock throbbed beneath his pants, pleading for a touch, no matter how timid, no matter how forced. He gritted his teeth and moved back from her.</p><p>“Ten years,” he bit out, watching her broodingly. “I’ve wanted you for ten years, Ella, and I’m tired of fighting it.”</p><p>She shook her head, shock darkening her eyes. “That’s not possible.” Her voice was thready, desperate.</p><p>“Oh, it’s more than possible.” Disgust welled inside him. “I’ve wanted you until I could barely breathe, ever since I walked into that damned house of Jase’s and saw all that careful control as you fought to give him at least part of what he wanted.”</p><p>Her face flamed and her eyes looked wild.</p><p>“Did you think I couldn’t see who you were, Ella? Every time I saw you, you watched me as though you were terrified. Your nipples would harden, your face would flush, and I knew you wanted me. Me, Ella. And I fought it, fought it just as fucking hard as you did until I walked into that playroom.”</p><p>He remembered it clearly. Seeing her strapped down on the cot, unaroused, but trying, as Jase fought to pleasure her. He had seen her small cunt; dry yet looking so soft, so tender, as Jase touched it. Then she had seen him. She had fought Jase, screaming at him, crying, but James had watched her cunt. And within seconds it had glistened, her juices spreading over the delicate lips.</p><p>He had left. Turned and stalked from the room because he couldn’t stand to see her lying there, crying brokenly as she cursed her husband. Jase had given up. He hadn’t loved her, and James knew it. What he needed sexually drove him, until he began to bring other women to his bed as his wife moved to the solitary comfort of a downstairs bedroom.</p><p>Never in my home. Never again, she had said earlier. He had seen the humiliation flash in her gaze. Jase had brought other women to her home, had taken them to his bed, destroying the pride that was so much a part of her.</p><p>“I want you to leave.” Her voice quivered as she crossed her arms beneath her breasts, refusing to look at him. “I want you to leave now.”</p><p>James snorted. “Do you enjoy wasting your breath, Ella? You don’t want me to leave. You’re just too fucking scared for me to stay.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No.” She shook her head desperately.</p><p>“Yes,” he all but snarled. “Prove it then. Stand up, Ella, and drop those pants. Let me sink my fingers into that tight cunt and see if you’re still wet and ready for me, because I bet you are. I bet you would come again, Ella...”</p><p>“Stop it.” She jerked to her feet, her voice raspy, hoarse. “You’re younger...”</p><p>“I’ll fuck you harder than any man your own age could ever hope to.” He stood in front of her, staring down at her furiously. “Better yet, Ella, I’ll fuck you like you need it. I’ll make all those nasty little fantasies of yours reality, and then I’ll teach you some you could have never imagined.”</p><p>“I won’t listen to this,” she raged heatedly. “I let you come into my house as a guest...”</p><p>“And I’ll come in your pussy as your lover,” he bit out, breaking over her outraged declaration. “Your pussy, your mouth, your ass. Wherever I can get my cock in, Ella, I’ll fuck you until I can fill every inch of your body with my cum.”</p><p>She collapsed back in the chair. He could see her trembling, fighting herself as well as him.</p><p>“But we both know it’s not that easy, don’t we, baby?” He stooped in front of her, his hands going to the button of her pants. “We both know that what I want will be more intense, and a hell of a lot more serious than anything Jase ever asked of you, and that’s what’s scaring the hell out of you.”</p><p>“James.” Her hand covered his as her voice broke. “Don’t do this to me, please.”</p><p>“Don’t do what, Ella?” he asked her, tenderness—fuck, love—welling inside him so deep, so strong it nearly strangled him. “Don’t give you what you need? Don’t satisfy your fantasies, your desires? Don’t show you how damned good it’s going to hurt when my cock pushes inside your tight pussy? Sorry, baby, but I think I just reached the end of my control. I won’t let you run anymore.”</p><p>Ella watched James, seeing the determination in his eyes, the lust that flushed his face, tightened his features, and she couldn’t find the words to fight him. She trembled before him instead, her body still weak, still vibrating in longing after the climax he had given her earlier. She needed more. Her thighs trembled, her cunt gushing her juices as she tried to find a way to make him leave.</p><p>She could make him. She could call the police and he wouldn’t stop her. She could have him thrown out. She could scream if she could find the breath after that kiss. But she knew she couldn’t bear to see him dragged away. Couldn’t bear the humiliation she knew he would face. But she couldn’t give in to him either. She wouldn’t give in to him. At least, not entirely.</p><p>“Just us,” she finally whispered, trembling. “Just sex.”</p><p>His whole body tightened. She had expected him to finish removing her pants, to give her what she needed. She didn’t expect him to draw away from her.</p><p>“I take control,” he said broodingly. “Whatever I want to give you, Ella, however I want to give it.”</p><p>“My terms,” she bit out desperately, then watched in horror as he shook his head slowly.</p><p>“No, Ella. My terms as my woman. Your choice.”</p><p>Chapter Six</p><p>My terms as my woman. Your choice. The words resounded in her head that night and all the next day. James was the head corporate lawyer for Delacourte Electronics, and with the growth of Jase’s business, she knew he often put in long hours working, both in the office and at home, she guessed. That left the house silent and lonely that next day.</p><p>She wandered through the rooms, tired from the restlessness of her sleep the night before, and torn between her desires and his. She remembered clearly Jase’s demented sexual games. Not that any of them made sense to her at the time. What was the purpose in tying a woman down? Unless your fantasy was rape, which he always swore wasn’t true. She hadn’t had a clue until James walked into that damned room and stared with flaring lust at her naked, bound body.</p><p>Ella remembered, clearly, her own agonizing humiliation. Spread open while her husband touched her, as she fought to find arousal in the game he wanted to play. But there had been none. Nothing until James’ eyes had centered on her thighs, spearing past her boredom with an instant, flaring heat. She had creamed herself in seconds, and the terror that Jase, or even James would realize it, had nearly destroyed her.</p><p>She sighed morosely as she walked out to the back porch and threw herself into one of the padded loungers there. The late afternoon sun was passing over, but beneath the cool shelter of the low trees and thick vines that wrapped around the porch, Ella was spared the blinding heat. The outer heat. Her inner heat was killing her.</p> <p>She had finally given up on changing panties. After the second pair, she had thrown her hands up in disgust and stopped. After ten years of no sexual activity, of fighting her desires and her needs, her body was evidently taking over. It wouldn’t stop producing the hot, slick fluid that would ease James’ entrance into her tight pussy. And it was tight. She shuddered in longing. Tight and greedy, anxious to feel James’ thick, hard cock sliding into it.</p><p>She was losing her mind. She closed her eyes as she tightened her thighs against the empty ache in the center of her body. Her vibrator had disappeared. She didn’t know how, or why, but somehow James had managed to steal it, or hide it, because it was no place to be found. And she needed it.</p><p>“You look pretty there, Ella.” She jumped as James stepped to the doorway, staring at her with those hot, sin-filled eyes.</p><p>“What are you doing here? You’re supposed to be working.” She would have jumped from the lounge chair if he hadn’t moved to stand in front of it.</p><p>She stared up at him, fighting to control her breathing as well as the desire that shook her to her soul.</p><p>“I took the rest of the day off.” He shrugged his broad shoulders as he pushed his hands into the pockets of his pants. The action only drew attention to the thick ridge beneath the material. “Is your pussy wet?”</p><p>Ella blinked as the question took her by surprise.</p><p>“Are you insane?” her voice squeaked in shock.</p><p>“Most likely,” he growled. “Make me crazier. It’s your chance for revenge, Ella. Tell me how wet your pussy is.”</p><p>She bit her lip, breathing fast and hard as she seriously considered the request.</p><p>“Go back to work,” she finally whispered desperately, shaking her head.</p><p>“Ella, remember how nice I was to you yesterday when my mouth sucked that sweet little clit of yours?”</p><p>How could she forget?</p><p>“I didn’t ask you to break into my room, James.”</p><p>“I want you to suck my cock like that, Ella. While you’re tied belly down on my bed, my cock thrusting slow and easy in your mouth and I inflate the plug I’m going to push up your sweet, virgin ass.”</p><p>“Stop. Why are you doing this to me?” Her pussy was gushing between her thighs, so hot it felt blistered by her need. “For God’s sake, James, surely you can find someone to fuck. Do you have to torture me this way?”</p><p>She pushed her fingers through her loose hair, feeling the silky strands brush her shoulders, almost shivering at the caress against her ultra sensitive flesh. She was being driven crazy, and he knew it. Maybe it was some kind of messed up mid-life crisis, she thought desperately. Because she knew her own arousal had never tormented her to this degree. It was hell and she wanted it to stop. She wanted him to leave. Or did she?</p><p>“I won’t waste my breath answering that question,” he bit out as he stooped down at the end of the lounger. “You want to control it, Ella? Do you really think you can?”</p><p>He was so handsome he broke her heart. Hard and toned, his body muscular and so filled with male grace that it took her breath every time she looked at him. And his face, arrogant with just a touch of the aristocratic in his strong, straight nose and superior expression.</p><p>“James, I’m asking you to stop this.” Her heart was racing out of control. How was she supposed to deny him when her body ached so desperately for him?</p><p>He was like a fever in her blood. As long as she stayed away from him, she could survive it. But now, with his desire for her so clear, her needs raging through her body, she couldn’t find the will to resist him. She was weak. She admitted it and she hated it. Hated the emotional and physical responses that she couldn’t fight any longer.</p><p>“Lay back for me, Ella,” he whispered softly. “Lay back, and let me show you what I can do for you.”</p><p>Ella watched him helplessly. Her body was tense, demanding action. Demanding that she do as he ask and lay back in the lounger for him. She watched as his tongue touched his sensual lips, as though anticipating a meal, and she knew what he wanted. Knew what he would do to her. Her pussy gushed in response.</p><p>She whimpered as he moved, his hands reaching for her arms, pulling them gently, taking the support she used to keep her body upright as he released the back support of the lounger. He lowered her until her back rested on the flat surface.</p><p>Ella stared up at him, trembling, hating the weakness that flooded her body. Damn him. He was so assured, so sensual, so damned tempting she could barely keep her senses intact.</p><p>“James.” Her breath caught in arousal as his fingers went to the tiny buttons of her bodice. Her breasts were unbound beneath the fabric, her nipples hard, on fire for his touch.</p><p>“I’ve dreamed of touching you, Ella,” he whispered, his green eyes darkening, the thick black lashes lowering sensually over the wicked orbs. “Ached to taste you. Do you have any idea the hell I’ve gone through for the last ten years, wanting to hear you scream my name as you climax for me?”</p><p>A whimper escaped her lips as the last button of the dress came free, and he was able to spread the edges apart with slow deliberation. Her body was laid out before him then, only the thin silk of her panties left to cover the front of her body.</p><p>“You’re wet for me, Ella,” he whispered, his eyes centering on the pale green triangle of fabric. “And you still shave your pretty pussy, don’t you? When my tongue caresses it, laps up all that thick cream, you’ll feel every soft touch, won’t you?”</p><p>His hand spread her legs slowly. Ella gripped the sides of the lounger, watching him, mesmerized by the sensuality in his expression, the hunger reflected in his eyes, in the curve of his lips.</p><p>“James.” She whispered his name, her voice rough, pleading as she caught his hands when they moved to the band of her panties. “I can’t...” She couldn’t finish the sentence, couldn’t force the words past her lips.</p><p>“Can’t what, baby?” he asked her gently, his fingers hooking in the elastic, pulling her panties down, away from her weak grip. “Can’t lay back and feel good for me? Can’t see if what we’ve waited for all these years isn’t as good as our imaginations? Why can’t you do that?”</p><p>He was hypnotizing her, she thought desperately. Stealing her will with the sound of his deep, rough voice. Making her crazy for him with that dark, hooded look.</p><p>She trembled as he removed the scrap of silk then spread her legs wider. All the while he watched her from the side of the lounger, his chest moving hard and fast, as he seemed to fight for breath himself, his eyes darkening lustfully.</p><p>“Damn, Ella, you’re prettier than I ever imagined.” His hand moved up her thigh until his fingers grazed the desperate heat and thick juices that coated her cunt. The proof of her weakness. The proof that she was just as depraved, just as perverted as Jase had been, because she knew, knew beyond a shadow of a doubt exactly what James wanted from her.</p><p>“I can’t.” She jerked from him, moving before he could stop her, stumbling from the lounger then rushing desperately away from him. Away from her own needs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Seven</p><p>Jumping to her feet, she rushed to her bedroom, fighting her tears, her fears. James’ voice was dark, angry behind her, spurring her forward, making her heart beat in dread. If he touched her again, asked her again, she wouldn’t be able to refuse him. He was her weakness. He was her sin.</p><p>She slammed the door behind her, then fought to drag the suitcase from her closet. She couldn’t stand it. If he wouldn’t leave, then she would. He could have the fucking house. Do whatever the hell he wanted. She couldn’t stand it anymore. She ignored her dress as it flared away from the front of her body, ignored her nakedness beneath it. She had to leave, had to get away from him.</p><p>Bent over, her mind centered on pulling the damned case from the small utility closet, she was unaware that James had followed her until he burst into the bedroom, gripped her hips and tossed her on the bed.</p><p>“Damn you,” she screeched as she came to her knees, clutching the sides of her dress. Her eyes widened as she watched him undress. Slowly. Watching her with narrowed, intent eyes.</p><p>The air in the bedroom heated, thinned, until she had to fight for breath. She sat on her knees, gripping the edges of her dress together, fighting just to breathe as each article of clothing was dropped to the floor, until he wore nothing but his own brazen sexuality.</p><p>Dear God. He was naked. All dark, sleek skin and toned muscle. Especially the bulging length of his cock. It was thick and hard, the head flared and appearing bruised, it was so engorged with blood. She couldn’t take her eyes from it, couldn’t stop the whimper that escaped her lips.</p><p>“First lesson,” he growled dominantly, his voice brooking no refusal. “Take your dress off and lay down on the bed.”</p><p>“Are you insane?” She repeated her earlier question.</p><p>“Most likely,” he bit out, his hand going to the engorged flesh rising between his thighs. She watched, mesmerized, as his fingers stroked the hard cock. “So it might be best to placate me.”</p><p>She licked her lips. “What are you going to do?”</p><p>He walked over to the dresser and picked up the articles she hadn’t seen until then, in one hand. He must have placed them there before coming to her on the back porch.</p><p>The first looked like a slender cock, the middle thinner than the flared head, with a hose and bulb leading from the base. With it was a small tube of gel lubrication. In the other hand, he picked up the leather wrist and ankle restraints. Her eyes widened.</p><p>“I’m going to fuck your ass, eventually,” he told her softly. “While I’m fucking your sweet mouth and your tight little pussy, I’m going to be preparing your ass to take me. The inflatable plug will take care of that. “</p><p>Inflatable? How much did it inflate? It already looked too damned big to her.</p><p>“James, please.” She shook her head, reduced to pleading. “Don’t do this to me. I don’t think I can bear it.” Physically she was dying for it, emotionally, she was terrified.</p><p>“We’ll start out easy.” He wasn’t asking her, he was demanding. “Undress and lie on the bed.”</p><p>“Why?” She couldn’t take her eyes off the restraints. “Why do you have to tie me down?”</p><p>He laid everything at the bottom of the bed. “It’s all about control.” He eased the straps of her sundress from her shoulders. “The one losing it, the one possessing it. My pleasure, Ella, comes from yours. But you think you have to control that pleasure. Fight it. I want you restrained, unable to run from me, unable to fight what I need to give you. I want you to lose that control that keeps you locked inside your own fears.” She trembled as the material of her dress skimmed her swollen breasts.</p><p>“I don’t like it,” she whispered, almost groaning as his lips feathered her shoulder.</p><p>“If your pussy doesn’t get wet and hot for me, if your body doesn’t scream out for more, then I’ll stop. I’ll know if it’s not right for you.” The dress fell to the bed behind her. “Now, lie down for me, on your stomach first.”</p><p>Ella licked her lips. God she wanted him. She had controlled it with Jase, no matter the fantasies of James that had tormented her. Surely she could control her heart, if nothing else.</p> <p>Shaken, weakened by her own desires, her own fantasies, she did as he ordered.</p><p>“Have you ever been taken anally, Ella?” he asked her then. “Not a plug, but by Jase, or anyone else?”</p><p>She shook her head, careful to keep her face buried in the blankets of the bed. He attached the leather restraints to her legs first, the small links of the chains rattling as he secured them to the short bedposts. He moved then to her wrists. His hands were gentle, caressing, the leather cool as he secured it above each hand before securing the chains to the headboard.</p><p>She was spread out. Though there was some slack in the chains, she wouldn’t be able to go far if she did move. She shuddered, dragging in air with a sense of desperation as her arousal intensified. Never with Jase had she felt the trepidation and searing desire that she did now. As though she had known Jase was no threat to her, neither emotionally nor sexually, but James was. He could destroy her. If she let him.</p><p>“So nice,” he whispered as he moved back to the bottom of the bed, moving between her spread thighs.</p><p>His hands ran up the backs of her thighs as she trembled beneath his touch. Long-fingered and broad, his hands were warm and slightly calloused, creating an exciting friction on her flesh.</p><p>“I used to hide and watch you whenever I saw you out in public,” he whispered. “I knew you would run if you saw me, and I loved watching you move, Ella. Watching the sweet curves of you ass flex, the line of your back, the tilt of your head. I would drink the sight of you in.”</p><p>Ella’s hands clenched in the blankets beneath her as his hands cupped the lower curves of her rear, spreading her apart sensually. She could feel her cunt, drenched and hot, rippling with convulsive shudders of need. She couldn’t stop the involuntary flexing of her buttocks, or the little whimper that escaped her throat.</p><p>“Are you comfortable?” he asked her, his voice low, rough.</p><p>“No.” She had to fight for air. She felt intoxicated and yet on the edge of panic.</p><p>“Good.” He patted her rear a little sharply in approval. Ella flinched at the tingling heat that washed up her spine from the light tap. “Now, I want you to try to relax for me a little, Ella. I want to put the plug inside you, get you ready, before we go any further.”</p><p>Relax? He was kidding, she thought. He had to be.</p><p>She felt him moving at the bottom of the bed, his body shifting beneath her before his hair brushed her leg. She jerked as his hands went under her thighs, lifting her a bit before his tongue thrust hard and fast inside the soaked channel of her pussy.</p><p>“Oh God! James!” she cried out, her back bowing in reflex, angling her hips higher for the invasion.</p><p>His tongue was like a flame, searing her vagina as he pushed in hard, then pulled back slowly. As though he had already shaken the foundations of her desire, he began to lap at her. His tongue licked and stroked, drawing her juices from her body as he murmured his appreciation of her taste, or her need, she wasn’t certain.</p><p>His fingers moved to the gentle curve of her cunt lips, spreading them marginally as his tongue delved higher, licking through the slit, circling her clit. Teasing strokes of his demon tongue had her grinding her pussy into his mouth, and yet with little ease. As she moved closer, his mouth drew farther away.</p><p>She was only barely aware of his fingers probing between her buttocks, slick with the cool gel of the lubrication that coated them. One long finger pierced her puckered opening as James’ tongue speared deep inside her cunt once again.</p><p>Ella’s eyes flew open as a gasp escaped her lips. Braced only partially on her knees, the slack in the restraints taken up by her position, there was no way to escape the invasion. She moaned, a drawn out sound of shocked pleasure, heated pain as his tongue fucked her clenching vagina once again.</p><p>“James,” she whimpered his name, fighting to hold onto her control.</p><p>Her anus stretched around the probing finger, welcoming the heated sensations that came from his smooth, stroking movements. He didn’t answer her unspoken plea, one she wasn’t certain of herself, rather he pulled the finger back, added another and pushed into the tight entrance once again.</p><p>A cry strangled in Ella’s throat.</p><p>“Easy, darlin’.” His voice was a rough croon as his fingers began to gently scissor inside her anus, stretching her slowly as he slurped at the juices running from her heated cunt.</p><p>The bite of pain was intoxicating, addicting. Pleasure swelled inside her as he stretched her, licked her, his other hand moving up her body until it tucked beneath her breast, his fingers plucking at her nipple. She was shaking, suspended between lust and that sharp bite of pain, and terrified he would stop.</p><p>He prepared her slowly. The pleasure became a tormenting surge of sensations as his fingers prepared her anus gently. There was no impatience, as Jase had often shown, no irritation that it took so long to prepare her. Beneath his unhurried caresses she eased, relaxed, until he was working three long fingers in and out of the back passage as her strangled moans echoed around the room.</p><p>“Yes, baby,” he crooned into the dripping folds of her pussy. “So sweet and tight, Ella.”</p><p>She moaned in protest as his fingers pulled free, then moaned again in rising pleasure as his tongue began circling her clit. She was unaware of his hands for long moments, unaware that more was coming. Her dazed senses only knew his hard breaths between her thighs, his stroking tongue...</p><p>Chapter Eight</p><p>“James...” She wailed his name as the head of the butt plug seared her anus as he pushed it into the tight entrance.</p><p>She fought the restraints, pressed harder into his licking tongue and nearly came to the smooth, stroking movements as fire lanced through her rectum. Thickly lubricated, the plug invaded her slowly, stretching her, burning her, bringing her so close to orgasm she had to bite her lip to keep from screaming out for it.</p><p>“James, please.” She couldn’t stop the strangled plea tearing from her throat as the anal plug lodged inside her anus, her muscles clenching on it, her pussy shuddering in reaction to the pleasure/pain.</p><p>He moved then, despite her protesting cry, pulling himself from beneath her thighs and kneeling behind her. Her hips arched to him, her body desperate, mindless. His hand landed on the upturned cheek of her ass in a surprisingly sharp blow.</p><p>Ella stilled. At first, shock arced through her body, then an excitement that had her stilling in fear. She didn’t like it, she assured herself. It was depraved, perverted. She wouldn’t like it.</p><p>“From now on, if you need to get off, Ella, you come to me. No more vibrators unless I insert them. Do you understand me?”</p><p>“James...” She shook her head, needing to protest, yet unable to.</p><p>His hand landed on the opposite cheek of her ass. She flinched, her body shuddering at the heat. She wouldn’t like this, she promised herself, though her pussy convulsed in nearing orgasm.</p><p>Then she felt the plug, seated so snugly in her rear, begin to swell. Slowly stretching her, burning her as his fingers went to her dripping vagina. One slid slowly inside her, caressing the thin muscle that separated her vagina from her anus. She could feel the enlargement of the plug as he caressed her there. The steady growth, the burning pain, the striking pleasure that shot through her body like flares of lightning.</p><p>“The plug enlarges, Ella, to eight and a half inches and several inches around. Almost as thick, almost as long, as my cock.” She was struggling for breath when the swelling stopped. “Seven inches is all you can take now. When you can take it all, Ella, then I’ll fuck you there.”</p><p>Ella writhed against the blankets, fighting to accept the thickness of the device that stretched her anus. She could feel the heat steaming from her pussy, the sensitivity of her body, the agonizing need that was as much pain as it was pleasure. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Here, baby.” He was beside her then. Ella opened her eyes, staring up at him as he helped her to lever herself up as far as the chains he had loosened would allow.</p><p>She trembled, knowing what he wanted, more than eager to give it to him. She licked her lips slowly then allowed his cock to push slowly between them. He was thick and hard, so hot and demanding she moaned in exquisite anticipation as she closed her lips tightly around him and suckled slowly at his flesh. He burrowed in, sliding over her tongue until he was almost gagging her, poised at the entrance to her throat.</p><p>He stopped, breathing roughly as his hand wrapped around the flesh where her lips were closed around it. Then his hips began to move. She heard his groan as her tongue licked at him, her mouth sucking him as he began to fuck her with smooth, powerful strokes. She was restrained, at his mercy, a receptacle for whatever he commanded. She was helpless. She was insane with lust.</p><p>She suckled his cock with moist, noisy appreciation. There was no shame in the sounds she made, no trepidation that he would give her more than she could take. At least, not in this instance. There was only the hot male taste of him. Only the need to make him as crazy to come as she was.</p><p>“Damn, even your mouth is tight,” he groaned as he fucked her slowly. “Hot and tight, Ella. But your pussy’s going to be hotter, tighter. Like fucking a virgin with that butt plug filling your ass, tightening your cunt.”</p><p>She trembled as his wicked words washed over her, but she suckled his cock like a woman starved for a man. She licked beneath the head, slurped at it, starved for the taste of his seed. The shaft throbbed, pulsed, but he held onto his control as she slowly lost hers.</p><p>“Enough,” he growled long moments later as he pulled back from her.</p><p>Ella moaned in protest, struggling against the restraints, as she tried to follow the burgeoning erection. His hand landed on the curve of her ass again. A warning slap that only made her pussy vibrate with increased need.</p><p>“I’ve got to fuck you, Ella. I’ll strangle you if I try to take my pleasure in your mouth now.”</p><p>Ella stilled. Her breath rasped from her throat, fear suddenly trembling through her with almost the same force as her lust did. His cock was large, thick. The plug in her anus had tightened her vagina, and it had been more than a decade since anything larger than her small vibrator had invaded the channel. He would kill her with his cock...</p><p>“Not like this, I want to watch you take me, Ella.” She was too weak to fight him as he released the restraints on her ankles and her wrists.</p><p>He turned her over on her back, then replaced them carefully. Ella stared up at him, unable to protest, unable to fight him. She ached in ways she could have never imagined. Her pussy felt as though it was boiling with heat, and the fullness in her anus only called attention to the emptiness of her vagina.</p><p>He leaned over her, his expression so gentle, so filled with approval that her heart clenched. When his lips covered hers, her womb flexed with melting desire. His kiss was hot, heated, tasting of her intimate juices and his male need. She moaned into his lips, wishing she could hold him to her, touch him, as she felt his cock nudge against the sensitive opening of her vagina.</p><p>“Ella,” he groaned her name, his hand touching her damp hair, the other holding her hip as the head of his cock invaded her tight opening.</p><p>“Oh God! James!” Her head tossed as he began to push slowly inside.</p><p>“Easy, Ella. It’s okay, baby. You can take me.” She struggled against the restraints, crying out as he separated the sensitive muscles, powering through the drenched, fisted grip of her pussy.</p><p>She bucked beneath him, barely aware of her sharp cries of pleasure...or were they of pain? Her movements drove him deeper inside her. Deeper. Deeper. Her hips arched to him as he slid into the hilt, the pulse and throb of the heavy veins beneath his hard flesh echoing through her body.</p><p>“Damn you, Ella,” he cursed her, his voice rough as he fought for control. “You’re so fucking tight I could come now. Look what you’ve denied us all these years. All these years, Ella, you stole this from us.”</p><p>She screamed then. She had sworn she would never scream for him. But when he began the hard driving rhythm inside her tight clasp, the pleasure/pain that tore through her body pushed the desperate scream from her throat. She was bound to the bed, unable to fight the sensations, helpless against the rocking strokes that tore past her muscles, made her accept her own desires, the pain and the pleasure and the need for more.</p><p>Too many years longing. Too many nights dreaming. On the third stroke Ella exploded. The orgasm that tore through her body had her tightening further, screaming out his name, her body shaking, tensing, convulsing as she fought the strength of her release. But she couldn’t fight it. Couldn’t escape the hard, quickening strokes of his cock as he fucked her through the cataclysm, then a last desperate lunge as his seed jetted hot and harsh inside her convulsing pussy.</p><p>“Ella.” He cried out her name as his lips buried at her neck.</p><p>She felt his release spurting inside her, her own rushing through her quaking vagina as her soul rocked with the pleasure, and she knew the emotions she had fought for so many years.</p> <p>Her vision dimmed as she lost her breath with the last wave of intense sensation. Tears fell from her eyes, and as she collapsed back on the bed, she knew in her soul she would never be the same again.</p><p>Chapter Nine</p><p>“Hey, Ella, you missed dinner. Are you in there?” Ella jerked awake at the sound of her friend’s voice that evening, her shocked eyes going to the bedside clock. Damn, she had forgotten about Charlie having the key to the house, and her habit of just coming in as she pleased.</p><p>It was dark, a little after ten, and James was still in the bed with her. Even worse, his half erect cock was still buried in her pussy where it had been after her last climax.</p><p>She moved to jerk away, but his arm around her hips stopped her, and her heart raced as his cock began to harden inside her.</p><p>“In a minute, Charlie,” she called out, pushing at his arm. “I fell asleep. I’m sorry. I’ll be out in a minute.”</p><p>“Well, hurry,” Charlie called back. “It’s getting late and I need to head home.”</p><p>The sound of the other woman’s footsteps fading away from the bedroom door eased her harsh breathing until she felt James thrust inside the tight grip of her vagina as his throttled groan sounded at her ear.</p><p>“I have to get up,” she whispered, pulling at his arm, wanting nothing better than to push back against him, to scream out in the pleasure again.</p><p>“Damn,” he muttered, though there was no anger in his tone, only regret.</p><p>Ella bit her lip as the hot length of flesh eased from her and he rolled lazily to his back as he reached over and flipped on the light at his side of the bed. She looked back at him as she wrapped the blanket around her and rose to her feet. He was naked and unashamed of it. His long fingers scratched at his chest as he smothered a drowsy yawn. His erection lay against his lower stomach, glistening with her juices and his earlier release. He looked sexy as hell.</p><p>Ella shook her head before he could tempt her any further, grabbed her robe and rushed to the bathroom. It took longer than she would have liked to clean the evidence of their spent passion from her body. Thankfully, James had removed the butt plug earlier, though her vagina, and her tender back entrance were still a little sensitive.</p><p>Ten minutes later, she left the bathroom, covered in her long gown and robe. James still lay on the bed, watching her through narrowed eyes.</p><p>“She doesn’t know you’re here,” she whispered.</p><p>His eyes narrowed further. “Who does know?”</p><p>She licked her lips nervously. “Just Tess and Cole.”</p><p>“I see.” His tone of voice suggested he might see more than she was actually saying. “So you want me to stay put?”</p><p>She shrugged. Hell yes, she did. Her friends rarely kept secrets. What Charlie knew, Terrie would know, and Marey would know and Tamera. She winced at the thought. She especially didn’t want Tamera to know.</p><p>“Fine.” He shrugged, though she didn’t trust his tone of voice. “Go visit your friend. I’ll be here when you’re done.”</p><p>He closed his eyes. Ella breathed in deeply in relief before she rushed from the room.</p><p>“It’s about time. What were you doing in there, anyway?” Charlie turned from the refrigerator as Ella moved into the kitchen.</p><p>Charlie was nearly five years younger than Ella, slim and sophisticated, dressed in a gray silk sheath with matching heels. Her long, black hair fell to the middle of her shoulders like a fall of midnight silk, contrasting to the perfect peaches and cream perfection of her bare shoulders.</p><p>“I was asleep.” Ella went to the coffee pot and put on a fresh brew of coffee.</p><p>“You’re never asleep before midnight, Ella,” Charlie scoffed. “Hell, you’re still up at one and two in the morning. I know, I can see your bedroom light from my house.”</p><p>Ella lowered her head. She was unaware Charlie kept such a close eye on her. It was disconcerting.</p><p>“Sometimes I take a nap.” She shrugged, flipping the switch and listening to the machine begin to hum as it began to heat the water. “It’s no big deal.”</p><p>She turned back to her friend, aware of Charlie’s steady regard as she took a slice of cheesecake from the refrigerator and moved to the table. She collected a fork from the cabinet as she passed by it, but still, she watched Ella.</p><p>“What’s going on? You’re acting strange.” Charlie was the most perceptive of her friends, but Ella didn’t like how easily even she was reading her.</p><p>“Nothing’s going on.” Ella moved two cups from the cabinet and set cream and sugar on the table. “I was just tired, Charlie.”</p><p>She was just damned uncomfortable now. Her thighs were weak and tender, her breasts marked by James’ mouth, her body longing to return to him. She usually enjoyed her friend’s visits, and looked forward to them. Charlie was usually easy going and filled with laughter, but now she just wanted her to leave. Ella wanted to return to James, his heat, his hard body.</p><p>“Ella, you aren’t acting right, honey.” Charlie watched her with sharp, deep blue eyes. “What’s going on?”</p><p>“Nothing.” Ella shook her head as she poured the coffee. She had to fight the trembling of her hands, and the knowledge that everything was suddenly out of control. And not just sexually.</p><p>She set Charlie’s coffee cup in front of her, then moved to the other side of the table and sat down. As she looked up, her stomach dropped. Charlie was staring across the room in complete shock. Ella’s head turned slowly, knowing what held her rapt attention. Her brows snapped into a frown as James walked barefoot through the kitchen.</p><p>“You didn’t tell me you were fixing coffee, baby.” He wore blue jeans and nothing else. And those damned jeans. The top button was loose, and the waistband rode low on his tight abdomen. Right above it was a strawberry love bite. She remembered marking him, and now her face flamed as she realized her friend couldn’t miss it.</p><p>“Dear God,” Charlie breathed as she obviously fought for breath, her gaze swinging from Ella to James.</p><p>Ella could only cover her face as James poured his coffee, dropped a quick kiss to the top of her head and said, “I’ll finish up some of that paperwork you dragged me away from earlier while you talk to your friend.”</p><p>She peeked through her fingers as he ambled away. The jeans molded his buttocks to perfection, and Charlie wasn’t missing a second of the view as he left the room.</p><p>As he disappeared through the doorway, Charlie turned to her, her eyes wide, her expression shocked.</p><p>“James Wyman,” she breathed out in shock. “Oh my God! Ella, you fucked James Wyman? Or is it Jesse?” she squeaked in fear, well aware of Tess’s interlude with Jesse Wyman and Cole. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ella squirmed in her chair. No, she thought, he had fucked her, thoroughly. And more than once. She sighed tiredly. Everyone would know it now.</p><p>“It’s not Jesse,” she groaned, pushing her fingers restlessly through her hair. “You should know better than that.”</p><p>“James!” she squealed.</p><p>“Dammit, Charlie, shut up,” she shushed her frantically. “He’ll hear you.”</p><p>“Ella, do you have any idea what you’re doing? What you’re getting into?” Her voice lowered. “Honey, he and Jesse have shared their women more than once...”</p><p>“Not me.” Ella came out of her chair, her hands trembling violently as she shoved them into the pockets of her robe.</p><p>“Maybe not with Jesse, but Ella, James and Jesse aren’t the only members of their pack, hon. I could name you half a dozen now.”</p><p>She shook her head. “What the hell are you talking about?”</p><p>Charlie sat back in her chair, her mouth falling open in surprise. “You haven’t heard? They’re called the Trojans, babe. Because of their dominance, and their sharing. They like submissives, Ella. You aren’t a submissive. Are you?”</p><p>“You know I’m not,” Ella bit out. But she wondered. What James had done to her that night, the dark promises he had made to her as he buried his cock inside her over and over again, threatened her belief that she wasn’t.</p><p>“Ella, those men, they don’t mess with women who aren’t submissive. Women who won’t give them that ultimate commitment.” Charlie came to her feet, facing her in concern. “You ran from Jase because of his demands. James will be worse.”</p><p>Ella shook her head. “I’m in control,” she whispered. “He won’t do it if I don’t want it.”</p><p>“And when he leaves because you can’t do it?” she whispered fiercely. “Dammit, Ella, haven’t you been hurt enough?”</p><p>“It’s my choice, Charlie.” She raised her head in determination. “My choice. No matter what happens.”</p><p>Charlie watched her silently.</p><p>“He’s the one,” she finally said slowly. “The one that came in while Jase had you tied down. The reason you divorced him and moved so damned far away for so long.”</p><p>Ella turned away, her lips opening as she fought to drag in more air, to stem the panic rising in her chest.</p><p>“Stop, Charlie,” she whispered, turning back to her as she stared at her friend pleadingly. “Please, let it go.”</p><p>“My God. You’re in love with him.” Charlie shook her head, amazement shaping her expression. “Ella, he’s the one. The reason you ran and turned into a bitter old nun. My God. He’s younger than you are.”</p><p>“Six years...”</p><p>“He shares his women,” she pointed out again.</p><p>“I don’t have to agree...”</p> <p>“But you will to keep him.” Charlie was angry now. Her voice throbbed with it, her face flushing with it. “You will, Ella. Because you love him.”</p><p>“Enough.” Her hand sliced through the air as her soul trembled with the knowledge. “This isn’t any of your business, Charlie...”</p><p>“The hell it isn’t.” Charlie’s voice rose with her anger. “Dammit, Ella, I watched you destroy yourself after that divorce. Turning into a bitter old woman before your time because of that bastard...”</p><p>“Lower your voice.” Ella was shaking with her own anger now. “And remember, Charlie, I didn’t ask you for your opinion then or now.”</p><p>“Like you have to ask for it,” Charlie snorted is disgust. “Really, Ella. It’s voluntary, darling.” The sarcasm was a clear sign that Charlie was rapidly losing her temper. Ella wasn’t far behind.</p><p>“Everything okay?” Ella’s head swung around to the doorway and she wanted to groan in dismay when she saw James standing there, watching them mockingly.</p><p>“Don’t you know how to dress?” she bit out in irritation, seeing all the smooth, perfect muscle that she knew Charlie was eating up with her eyes.</p><p>He arched a dark brow questioningly. “I thought all good little boy toys went around half naked? Don’t tell me you’re firing me after only a few hours on the job.”</p><p>Chapter Ten</p><p>It was well after midnight before Charlie left. After James’ mocking statement and his declaration that he was going to bed to let them discuss him in peace, Ella broke out the wine. Some nights, there was nothing you could do but get a shade tipsy and remember all the reasons why you didn’t want a man in your life. Charlie was eager to go along with her. Evidently all that smooth male muscle and blatant sexuality had been too much for her to deal with at one time as well.</p><p>Finally, her friend weaved her way to the limo waiting on her, thanked her aging driver nicely as he opened the door for her, and crawled into the vehicle. Ella herself felt she was walking reasonably straight until she closed the door and turned around. She proceeded to walk into the embroidered chair that sat off to the side. She frowned down at it in irritation before backing up and trying again.</p><p>She needed to go to bed. But James was in her bed. She stopped as she headed through the kitchen. Of course James was in her bed. That was where he belonged, she decided with a sharp, rather jerky nod before squaring her shoulders and heading to the room.</p><p>He was waiting on her. How had she known he would still be awake and waiting on her? His expression was cool, arrogant, as she removed her robe and started to lie down.</p><p>“The gown.” His voice was dark, foreboding.</p><p>Ella stopped, staring at him in surprise.</p><p>“Excuse me?” she asked him haughtily. “I sleep in my gown.”</p><p>“Take it off or I’ll tear it off.” There was no mercy in his voice, no change in his expression.</p><p>Ella snorted. “Some boy toy you are, James. I might have to fire you after all. You are supposed to obey me, not the other way around.”</p><p>“Take the gown off. I won’t tell you again, Ella.” Her insides trembled at the dark brew of anger and desire that throbbed in his voice.</p><p>She did as he said, suddenly too nervous not to. She watched him helplessly as the silk gown slithered to the floor, leaving her bare before his eyes. What did he see, she wondered? She was older; her body wasn’t as toned, as pretty as it had been ten years before. She knew all her problem areas, had stared at them in the mirror more times than she could count.</p><p>He pulled the blankets back then and patted the bed beside him. Watching him warily, she got into bed, lying on her back as he stopped her from turning on her side. His big hand moved to her stomach, caressing the flesh there as her breath caught in her throat.</p><p>“I won’t be regulated to the bedroom, hidden, a secret you keep from everyone,” he warned her coldly as he stared down at her. “Do you understand me, Ella?”</p><p>“What do you want from me?” She shook her head, her brain clouded with the alcohol, her emotions sensitized from her friend’s warnings, and James’ demands. “Why are you even here, James? In my bed. My life,” she sighed wearily.</p><p>“You have to figure that one out on your own,” he growled, his hand moving until he could brush back the lingering strands of hair that clung to her cheek, her neck. “You should have already figured it out, Ella, but you refuse to look beyond your own fears. I won’t allow that to continue.”</p><p>His eyes softened only marginally as she stared up at him. In the soft light of the lamp, his features were shadowed, savage yet softening with tenderness. She lifted her hand until she could touch the roughness of his beard-shadowed jaw, loving the warmth and roughness of his flesh.</p><p>“I dreamed of you,” she whispered bleakly. “For so many years, I dreamed of you, James. You’ll break my heart if I let you. I can’t let you.”</p><p>His gaze became shuttered. “Go to sleep, Ella. We’ll talk tomorrow.”</p><p>He moved then, turning out the light before lying down beside her, wrapping his arms around her as he pulled her close. Ella stared up at the dark ceiling, feeling the warmth and vitality of his body as he held her. Feeling the hard length of his cock against her thigh.</p><p>She breathed out regretfully. “I’ll miss you when you’re gone, James.”</p><p>“Go to sleep, Ella,” he warned, his voice soft yet commanding. “You don’t want to push me much further tonight.”</p><p>“But I will, James.” She shook her head, the wistful sadness inside her heart too much to bear. “I was used to being alone.”</p><p>Silence met her words. He wasn’t asleep; his body was too tight, too tense for her to believe that. His anger thickened the air in the room, though, and she realized she didn’t really want him angry. Keeping him angry was to keep him at arm’s length, a safe distance from making her body torment her with its needs. But he was close now, he had already taken her, more than once, and the little aches in her body proved that.</p><p>“I used to fantasize about you.” She frowned as she thought of the years that had passed. “How silly is that, James? That’s when what little satisfaction I had found with Jase in all those years was gone. The moment you stepped into that room destroyed it all.”</p><p>His cock jerked against her thigh.</p><p>“I warned you, Ella. I won’t warn you again.” She shivered at the dominating tone of his voice.</p><p>She turned her head to look at him, seeing only the shadowed impression of his form beside her. Her eyes lowered as she wondered what it would be like to see him out of control. All that cool purpose burned away. Could she do it? Could she make James Wyman, master of women, lose control? Her pussy gushed with the thought. She had heard rumors for years. Women talked, and unfortunately she heard the tales. And they talked about James and his cool control, his sexual deliberation. None had broken that calm. None had made him lose control.</p><p>She rolled on her side slowly, shivering as she felt him adjust his erection to her new position. His body tightened further.</p><p>“Maybe having a boy toy would be nice.” She smoothed her hand up his chest, her nails glancing his hard male nipple as she scratched lightly over it.</p><p>He caught her hand, holding it still against his chest as he stared at her through the darkness.</p><p>“Do you think I’d make a good toy, Ella?” he asked her, his voice silky, dangerous. “It could blow up in your hands, sweetheart. You don’t want to continue on the course.”</p><p>She was just tipsy enough to smile. To lean forward and swirl her tongue over the sensitive nub of his nipple. She heard his breath catch, felt his body tighten further.</p><p>“Isn’t that the point?” she asked him as she moved lower, her tongue stroking down his hard abdomen as the muscles there clenched tightly.</p><p>His hands threaded through her hair, clenching on the strands as she nipped at his flesh, trying to halt her movements. Ella couldn’t halt her gasp. The prickling heat in her scalp was more exciting then she wanted to admit.</p><p>“Ella.” He spoke her name sharply, a demand, a command to stop, warning her in the sheer dangerous throb that lingered in the tone.</p><p>“What, James?” she asked him softly. Her head held still just below his heart, but her hands were free. She raked her nails up his thighs, loving the sound of his breath catching in his throat.</p><p>“You don’t want me to lose control, Ella,” he warned her softly.</p><p>“Of course I don’t,” she whispered, her teeth nipping at his skin as her nails ran alongside his bulging cock.</p><p>It was exhilarating, exciting. He was breathing harder now, his heart racing beneath her ear. She tugged at the grip on her hair, whimpering with the stimulation, that sharp flare of pleasure that raced through her body. Her head lowered until her tongue was able to reach the flared, hot crown of his cock. He jerked as she licked it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The grip he had on her hair was fierce, the burning along her scalp intense, but it only fired her body as a distant amazement pierced her brain. The pain was a fiery cascade of sensations that nearly broke her. She was out of control. She, who had kept her control wrapped about her like a mantle of protection, had fallen as easily to this man as a virgin with no knowledge of the heartache awaiting her.</p><p>She pulled further against his grip, crying out as she felt her cunt clench at the ache. Her lips capped the turgid head of his erection, slurping noisily as her tongue licked, stroked. She wanted him deep within her mouth, wanted to feel him fucking into it, unable to halt his own spiraling pleasure. To destroy his control as he had destroyed hers.</p><p>One hand gripped the thick shaft as his hips jerked, burying the smooth crown in her suckling mouth. She heard his strangled moan above her, felt his erection throb with a deep, hard flex of the tightened muscle.</p> <p>“Enough.” His voice was thicker now as he pulled at her hair. When that didn’t help, he gripped her head, pulling her up as she cried in protest.</p><p>He flipped her to her back, jerking the blankets off the bed as he came over her.</p><p>“You don’t want this, Ella,” he bit out fiercely. “You don’t want to tempt me this way.”</p><p>She undulated beneath him, raking her hard-tipped breasts against his chest, rubbing her aching pussy against the thigh wedged between her legs.</p><p>“What will you do, James?” she asked him, tempting him, tempting fate and the dark visions suddenly rushing through her head. “How will you punish me? Will you share me then, to show me my place? To regain your control?”</p> <p>He stilled. His hands held her wrists to the mattress as he stared down at her, his savage expression only barely discernable. He was breathing hard and fast now, fighting to regain the upper hand, and now she knew how to make him lose it.</p><p>“Can you bear it, James?” she asked him softly. “Will you join in, or merely watch as another man takes me, making me scream as you do, fucking me like you do...”</p><p>Before she could anticipate him, his control broke. His legs wedged between her thighs and his cock pushed inside her swollen pussy in one hard, long stroke. She screamed out at the invasion, at the instant, fiery pleasure.</p><p>“Do you know what you’re tempting, Ella?” he groaned as she fought to accept the heavy girth buried in her cunt. “Do you know what you’re doing to me?”</p><p>He wasn’t still. His hips moved, his cock thrusting in and out of her in long smooth strokes as he fought to hold back. She didn’t want him to hold back. She didn’t want to hold back. Not any longer.</p><p>“How will you do it, James? How can you make me accept it? I dare you to try.”</p> <p>She didn’t expect the consequences of those words. His lips slammed down on hers, slanting across hers as his tongue drove deep into her mouth. At the same time, the thrusts of his cock inside her vagina increased in strength and power.</p><p>Ella cried into the kiss, her tongue tangling with his as she tilted her hips to take him deeper, harder inside her sensitive cunt. She could feel her muscles gripping him, the thickness, the heat of his erection thrusting past the sensitive tissue, stroking nerve endings already enflamed with a lust she had never thought herself capable of.</p><p>And with each stroke, each demanding invasion into the core of her body, she was reminded of what caused his loss of control. The thought of her with him and with another. Two cocks, hard and strong, pushing into her over and over again...</p><p>Her body tightened, her cunt clamping down on the pistoning power of his cock as she exploded to the images twisting through her mind, her body. She tried to scream, but her mouth with filled with James. She tried to buck him away from her, to escape the driving pleasure, the knowledge, but her pussy was filled with James. Filled with him until he groaned hard and deep, powered into her one last brutal thrust before he exploded.</p><p>The wash of his hot seed inside her channel triggered another, smaller climax as she whimpered beneath him. Her body shuddered, her womb rippling with the orgasm as the ice that had once encased her heart shattered.</p><p>She loved James Wyman. And Ella knew to the farthest depths of her soul, that the love filling her would be her ultimate destruction.</p><p>Chapter Eleven</p><p>“I’ll be back in three hours.” Ella lay face down on the bed at noon the next day, breathing through the fiery fullness that invaded her anus.</p> <p>James had taken her again when they woke up. He had been quiet, almost reflective as they showered and ate breakfast. Later they had lain around the pool until after a light lunch that he had prepared himself. They hadn’t talked much, but the silence hadn’t been uncomfortable.</p><p>Ella had been wary, though. He wasn’t pushing her, for anything. He was contemplative as though his loss of control the night before bothered him in some way. An hour after lunch he laid out the box that contained a mild anal douche and ordered her to use it. His voice had hardened, sending heat streaking through her pussy.</p><p>“So what am I supposed to do for three hours?” She turned her head, watching him with narrowed eyes.</p><p>Preparing her for the anal invasion had left her hot, wet. She wanted him now, before he left.</p><p>“Wait on me.” His voice brooked no refusal. “Leave the plug in. I’ve removed the inflator, so you can dress, do what you normally do. Just do it as it eases the muscles there.”</p><p>He had inflated it farther than before. Through a tormenting hour of heated touches, burning strokes of his tongue in and out of her pussy, but never enough to push her over the edge. She was burning with lust now and reluctant to move. The thick intruder buried in her anus stretched the muscles there with fiery precision. He had given her all she could take, yet had assured her that it still had not been fully inflated.</p><p>“Oh, that’s fair...” She stopped. The look in his eyes was almost frightening.</p><p>She settled back on the bed, watching as his brooding look eased only slightly.</p><p>“You pushed last night, Ella. You may think you’ve gotten away with it, but you haven’t. When I get back, I’ll show you just how you haven’t. If you get yourself off, I’ll punish you, Ella. I’ll tie you down to this bed and leave you there for the remainder of the night, and I’ll make sure you know how painful arousal can really be.”</p><p>She trembled at the sound of his voice. She had no doubt he would do it, too. If she was restrained, there would be no tempting his control, no pushing his personal limits. He could torment her as long as he liked. He had proved that in the last hour.</p><p>He released the restraints that held her, leaving the chains attached to the bed as he moved away from her.</p><p>“Wear a dress. Something loose and light. When I get back, we’ll see how much control you have, baby.”</p><p>Something about those words had trepidation skittering through her body. She eased up slowly on the bed, feeling her pussy clench, drench further as the plug bit at her tender anal muscles. She stared up at him silently, watching as his eyes darkened, his body tensing at the sight of her swollen, hard-tipped breasts, and the arousal that she knew was obvious in her expression.</p><p>“What are you going to do, James?” she asked him softly.</p><p>“You know, Ella.” He pushed his hands into the pockets of his slacks as he watched her, his voice throbbing with an emotion she didn’t want to name. “I’ve waited ten years, and in those years you have refused to take my desire for you, or my needs seriously, let alone your own. Tonight, you will take those needs seriously. You’ll take me seriously, Ella.”</p><p>Had she ever seen him look so powerful, so commanding? Suddenly, she felt much younger than him, and definitely much less experienced. His command of his own power, his own control, went beyond age or experience, and entered that unknown realm of supreme self-confidence. He knew what he was doing, she realized suddenly. James had a plan, just as he always had, she knew now. But why and what that the plan was, she couldn’t decide.</p><p>“No other men.” She shook her head, her hand trembling as she pushed her fingers through her hair. “I mean it, James. No one else.”</p><p>His lips quirked. “You no longer set your own limits, Ella. I do. You’ll learn that tonight. Whatever I want, however I want it, and you’ll love it. Or you can continue to be a coward and deny what I know you feel for me. If that’s the case, my bags are packed. Set them on the porch and I’ll never bother you again.”</p><p>She stared up at him, fear suddenly shaking her soul. “So I’m part of an orgy or I’m nothing to you, period?” she asked him, feeling her heart thunder in her chest. But what really terrified her was the clench of arousal that rippled through her cunt.</p><p>“No, Ella. I would never put you in the middle of an orgy,” he promised her smoothly. “What I will put you in the middle of is more pleasure than you’ve known could exist. Pleasure I know you want. Need. Even now, after the past three days, you aren’t satisfied. You climax until you nearly pass out with the pleasure of it, but you need more. And, by God, tonight I’ll make sure you have what you need, or I won’t bother trying anymore. I love you, Ella. Love you until my heart breaks with it, but I won’t beg you, and I won’t let you deny either of our needs. Now think about that.”</p><p>Shock exploded through her body as he turned and left the room. She could feel her face paling, her body weakening at a knowledge he had possessed, and yet she hadn’t.</p><p>It made sense now. James wasn’t a man to chase after any woman, to care one way or the other if his desires weren’t returned. Yet, he had chased her for ten years. Not in an obvious, lovesick manner, but in his own controlled, brooding way. He had made her aware of her own body, her own desires, even as she tried to hide from them, and made her more than aware of him.</p><p>She bit her lip, staring at the door, remembering his driving demands, his loss of control the night before. No other woman had managed that. Had it happened, she would have known about it. And his need for her wasn’t diminishing. Like hers, it seemed to be growing stronger.</p><p>Even after the excesses of the past days, the fiery heat and lust that flared between them. He was right, she had kept reaching for more. Something, some unknown dark desire kept pushing her.</p><p>She shook her head, fighting the awakening realization. For years she had fought Jase, not because she secretly wanted what he offered, but because he didn’t satisfy her. He didn’t bring her to the mindless orgasms James could bring her to. He didn’t make her pussy drench with a look. His needs hadn’t filled her with this strange excitement and nervousness. She had never wanted to break the control he thought he had.</p><p>She eased from the bed and walked slowly to the shower. A cool shower. She needed to think, she needed to make sense of the past and of the present. But more than anything, she had to decide if the desires that filled James were truly a part of her own needs, or just a part of her desperation to keep him now that she had held him. She had to know, before she took the chance of losing him forever.</p><p>Chapter Twelve</p><p>“I need to talk to you.” Of the five friends Ella had kept over the years, Terrie was perhaps the freest; the one Ella felt would be the most likely to understand her present predicament.</p><p>Silence met her request for long minutes. “Charlie called this morning, too,” Terrie finally said softly. “Are you okay?”</p><p>Ella closed her eyes. Of course Charlie had called. Terrie, and Marey and most likely Pamela as well. Just what she needed, everyone to know who and what she was doing. Her parents would know, too, if they were still alive. Poor Charlie, she couldn’t keep anything from their small group of friends, no matter how hard she tried.</p><p>“I’m fine,” she finally whispered. “I just need to talk.”</p><p>“I’ll be right over then.” She could almost hear Terrie’s sharp nod.</p><p>Ella hung up the phone, sighing deeply. Terrie would know James the best. She had been married to one of his two brothers, the bastard. Ella, for one, was glad to see his final demise. Thomas Wyman had been a stone cold prick. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As she waited for the other woman to arrive, Ella made sweet iced tea, moved about the kitchen preparing glasses and fought to ignore the heat in her rear. The plug was driving her crazy. Her panties were damned near drenched from the moist heat of her pussy and no matter what she did her nipples wouldn’t soften and just go the hell away. The scrape of the light cotton fabric of her sundress over them was about to drive her to distraction.</p><p>It wasn’t long before she heard the front door open then close, and Terrie’s voice calling out her name from the hall.</p><p>“I’m in the kitchen.” For as long as Ella could remember, the kitchen was the favored spot for her and her friends to talk, to argue, to visit. Either over coffee or sweet tea, it was there they seemed to find the most comfort.</p><p>She set the glasses of ice and the pitcher of tea on the table as Terrie swept into the room. She stopped inside the doorway, looking around curiously. “Is the boy toy in residence today?”</p><p>Ella winced at the question, though it could have been the tight, erotic tugging of the plug in her rear as she sat down, she thought.</p><p>“James went somewhere,” she sighed. “He didn’t say where.”</p><p>“He’s meeting Jesse for lunch.” Terrie shrugged as she sat down across from her. “Jesse was supposed to come over to the house and fix the faucet for me but James had some kind of emergency.”</p><p>Ella watched her friend suspiciously. “Are you sleeping with him?”</p><p>“James?” Terrie’s eyes widened in surprise.</p><p>“No, not James,” she bit out. “Jesse. I know you’re not sleeping with James, you would have killed him by now.”</p><p>Terrie poured the glasses of tea and slid one closer to Ella. “Jesse isn’t like James, Ella.”</p><p>Ella lifted her brows at that surprising statement. “Have you lost your mind, Terrie?” she asked her carefully. “I caught him with Cole and Tessa. You are aware of this, right?”</p><p>“Well, Ella, you were so drunk that night when you called us over that you couldn’t keep it to yourself,” Terrie sighed regretfully. “I am aware that he likes to play. But he’s not all dominant and fierce like Cole and James are. Jesse’s softer.”</p><p>Ella snorted. Terrie hadn’t seen Jesse, her beloved brother-in-law, that day as he lay beneath Tess, obviously spurting his release inside her. The man was just as dominant as his brother. He just hid it from Terrie. The reasons he would do so worried Ella. Terrie didn’t need more heartbreak, or more pain.</p><p>“I’m not here to talk about Jesse anyway,” Terrie reminded her. “We’re here to talk about you and James.”</p><p>Ella was smart enough to recognize the same denial tactics she had used herself with James. She sighed wearily. Maybe Terrie was the wrong friend to call.</p><p>Maybe Jesse was the wrong brother to call. Unfortunately, James thought, he was his only brother. Even when Thomas had been alive, Jesse was still the only brother he had to talk to. The only other person he trusted.</p><p>“I love her, Jesse. What if she won’t accept it?” James couldn’t get the thought out of his mind.</p><p>His sexuality was a part of him, a part he didn’t want to change, and saw no reason to change. Could he have been so wrong about Ella? Was he mistaking the excitement, the unspoken challenge she tempted him with? Could he do without watching another man fuck her? He could, it wasn’t about sharing her. Besides, it wouldn’t be a common thing. He wasn’t that depraved. He wanted his woman to himself. And only one man. He had already discussed it with the one he had chosen to introduce her into the pleasures of a threesome. But could she accept it?</p><p>James was well aware that Charlie had, in depth, given Ella all the gossip she thought she had on the Trojans. He snorted silently. The ninny who had pinned that name on them didn’t have the sense God gave a goose. Unfortunately, one of the leading members of the unofficial group had married her. He sighed wearily.</p><p>Whatever name you put to it, they were a group, of sorts. Nearly a dozen men who had met in college, and over the course of several years had gravitated together based on their sexual practices and their need to discuss and learn from each other’s mistakes. There had been many. Often due to a member’s unlucky choice of a lover who refused or even reviled their dominance. At present, there were eight of them, all in their thirties, all still looking for that one woman who could accept them.</p><p>Jesse leaned back in his chair, tipping his beer back and taking a healthy drink as James watched him. Finally, he shrugged. “She most likely knows what’s coming, James. Ella can be a pure witch when she’s riled. If she hasn’t cut your balls off yet, then most likely she’s not going to.”</p> <p>James winced. That didn’t do much to reassure him. He tipped his own beer back, staring up at the ceiling of Jesse’s home as he contemplated the coming evening. He had called Saxen earlier to set the time to meet him at Ella’s home, and as that time rapidly approached, he found he was becoming more nervous than he had thought he would be.</p><p>“Saxen was my choice for tonight,” he informed his brother quietly.</p><p>Jesse nodded slowly. “He’s a good choice.”</p><p>The tall, dark-skinned engineer worked with them at Delacourte Electronics as well, and was one of the most dependable men James knew.</p><p>He had spent over an hour talking to Jesse and getting nowhere. He wasn’t any closer to stilling the nerves running riot inside him than he was to begin with.</p><p>“You have been of absolutely no help whatsoever,” he finally sighed as he set the empty bottle on the glass coffee table and rose to his feet to leave. “Remind me of this when you finally decide to get off your ass and make your move on Terrie.”</p><p>Jesse grunted as he rose to his feet to his feet. “Damned women. What did we do to deserve them?”</p><p>James shook his head. “I would say we were just lucky, but I’m starting to wonder about that one.”</p><p>Chapter Thirteen</p><p>His bags weren’t sitting on the porch. James pulled in behind Saxen’s Mustang and breathed out a hard sigh of relief. He’d be damned, but he had never been this nervous in his life. His entire future, his relationship with Ella and his own needs were riding on this final day. If she turned him away, would he have the strength to stay in control and to walk away from one of the most important aspects of his sexuality?</p><p>He would if he had to. He admitted that to himself. Ella was more important than his desire, more important than his life. But he knew if he allowed it to happen, then neither of them would ever know complete fulfillment. That was his main concern. He knew Ella, better sometimes than she knew herself, and he knew she needed the extreme boundaries of sex just as intensely as he needed it for her. Pulling the keys from the ignition, he opened the door and stepped out of the car as Sax unfolded his tall frame from the other car.</p><p>“You need a bigger car, Sax.” James repeated the comment he made every time he watched the other man slide from the low-slung car.</p><p>“James, that’s my baby,” Sax grinned, his teeth flashing white against his dark skin as he ran his hand over his slick, shaved head.</p><p>The sleek, little blue car was indeed one of his prized possessions, though he could have afforded better. That and the Harley. Sax had a set number of priorities. He had achieved all but one. Poor man, Sax had his eye set on a woman that wasn’t about to let him anywhere near her. She would make his life hell, James knew.</p><p>“She might throw us out of the house.” James paused at the bottom of the steps as he glanced at Sax. “She might shoot us.”</p><p>Sax chuckled. “If you’re brave enough to go after this one, James, then she should be brave enough to accept you. You’ve gotten this far without frostbite. I bet you last through the night.”</p><p>Ella’s nickname, The Ice Queen, had followed her even after her divorce to Jase.</p><p>“Frostbite?” James murmured as he shook his head. “That’s the least of our worries, Sax.”</p><p>He opened the door and stepped inside. He had left explicit instructions for her in the letter he had left in the living room before he went to Jesse’s. He had been careful not to voice those instructions for fear of her outright rejection. If she didn’t want this, then the luggage on the porch would have been a more humane way to cut his heart from his chest. Of course, a bullet would be more permanent.</p><p>“She should be in her room,” he murmured. “Either restrained to the bed or waiting with the gun.”</p><p>Sax chuckled behind him, and in the sound James could feel the other man’s excitement. Sax was one of the few men who hadn’t known Ella during her marriage to Jase. He had wanted his partner in this next experience with Ella to be free of any preconceived notions or ideas of loyalty. Ella was his. Sax would continue to join in periodic threesomes with him and Ella if this first session went as James hoped.</p><p>Just as Jesse would continue with Cole and Tess until he took that final step in securing his own woman. After marriage, there was no need, no desire to touch another woman. The commitment was strong, the need so extreme that other women held no attraction. It was often a confusing, hotly debated issue among the men who shared in this lifestyle. The need to see their women experiencing that pleasure of an added element to their sexuality. The periodic addition of another man, and in one case he knew of, another woman.</p><p>He stopped at Ella’s bedroom door, took a deep breath and opened it slowly as Sax leaned against the doorframe. God help him. He nearly came in his slacks. She had buckled the straps to her ankles as he ordered, and her arm into one of the wrist restraints. She was staring at the ceiling, her breathing hard and rough as he walked slowly into the room.</p><p>He moved to the free wrist restraint and bent over to buckle it slowly. He caressed her wrist, feeling the hard throb of blood in the vein beneath her skin. She gazed up at him, a shade of fear mixing with the excitement in her gaze.</p><p>“Are you sure, Ella?” He sat on the side of the bed, cupping her cheek gently as he stared down at her.</p><p>She was trembling. He could feel the fear and excitement traveling through her. It would heighten the sensations, he knew; make the arousal, the coming orgasm more intense, hotter and brighter. He could barely hold back his own anticipation. He had waited, longed for this more years than he could count.</p><p>“No.” She breathed out roughly. “I’m not sure of anything right now, James. Don’t ask me questions like that.”</p><p>His lips quirked into a soft, gentle smile. Despite her words, he could see that she was more than ready. Her breasts were swollen, her nipples hard little points atop the firm mounds.</p><p>“You’ll only be restrained until we think you’re ready to be released,” he promised her softly as he stood by the bed and began to undress.</p><p>The word “we” had a small, strangled whimper escaping her throat. He watched the shiver that worked over her body, the way her nipples tightened, hardened further.</p><p>“Is the plug still inside you?” he asked her gently as he dropped his shirt to the floor, aware that Sax was slowly undressing behind him.</p><p>“No.” Her voice was low, breathless. “You told me to take it out.”</p><p>“You followed my directions exactly?” He kept his voice firm, stern.</p><p>Her eyes were wide, dark as she watched him, careful not to look toward his hips. Nervousness and excitement had her body quivering on a finely balanced edge of desire and lust.</p><p>“Exactly.” Her voice trembled.</p><p>He stripped off his pants and boxers, his hand going to the near-to-bursting erection that stood out from his body. He was so damned hard he knew he wouldn’t make it five minutes if he didn’t find relief soon. A relief he knew her sweet, suckling mouth would provide him.</p><p>“Sax, loosen the chains on the footboard. I need her sweet mouth first, or I won’t make it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t blame you. She’s beautiful, James.” Sax spoke for the first time as he moved to the bed, his own cock thick and hard as he stared down at Ella.</p><p>Her gaze flickered to him, her eyes widening as they caught the sight of his cock, as hard and long as James, if not a bit more. Her gaze flew up to him and he could see the fear in her eyes.</p><p>“I’m scared,” she whispered, her hands curling into fists as he sat down beside her on the bed again.</p><p>“The fear is good, to a point, Ella,” he told her gently. “You have to trust me, though. You have to trust that I won’t allow you to be harmed, that I will never threaten you, never cause you undue pain in any way. Without that trust, baby, we’re wasting our time here.”</p><p>His hand reached out to cup one of her full breasts, his fingers gripping the nipple firmly. She breathed in roughly, the little point tightening further. Leaning to her he drew one of the hard points into his mouth, relishing the thick moan that vibrated at her throat.</p><p>When his head rose, he was pleased to see the flush of lust, of deepening desire coloring her once pale face.</p><p>“I love you, Ella,” he said softly. “Above all things, I love you.”</p><p>She nodded her head sharply. “Fine. Fine.” She was breathing hard and deep, then her eyes widened, shock flaring in her expression as her gaze went between her thighs.</p><p>James followed her look and his lips quirked into a smile. Sax couldn’t resist soft, wet pussy, and he was lapping at the creamy mound now with the intent concentration of a man enjoying a prized dessert.</p><p>He couldn’t help but watch, and Sax gave a show worthy of any porn star as he made certain each touch, each stroke could be clearly seen. His tongue ran through the narrow slit, parting it, gathering the thick juices on the tip of it before he licked them into his mouth and started again. Slow, teasing strokes of his tongue that circled her pink pearl clit then returned to her tender opening to start all over again.</p><p>Then his fingers parted her, his dark flesh an erotic contrast to her pale skin. When he had her lips flared open, his tongue distended then disappeared slowly inside her vagina. James’ cock jerked at the sight of it, imagining the feel of her pussy gripping the other man’s tongue, her muscles rippling around it as he fucked in and out of the hot channel.</p><p>“James.” He saw her hips jerk, the muscles of her abdomen tightening as her body tensed, her legs moving against the restraints.</p><p>Sax was slurping on her now, sucking as much of the thick honey from between her thighs that he could reach. And James knew even more would replace it. It would be impossible to suck that well of sweetness dry.</p><p>“Shhh.” James leaned forward, his tongue licking over her lips as she stared up at him with dark, shocked eyes. “Just enjoy, Ella. Just enjoy.”</p><p>He kissed her. A long, wet kiss that had her moaning into his lips, her head lifting from the pillow as she fought to get closer. Sax’s noisy feast below seemed to make the kiss more desperate, heated, as her body began to clamor for release. A release she would be screaming for before it ever came.</p><p>His lips moved from hers, his own breathing rough, impatient, as they traveled down her neck, moving unerringly to the hard-tipped breasts that rose and fell roughly. She was moaning, her head thrashing on the pillow as she fought to get closer to the mouths tormenting her.</p><p>Sax would tease her. He wouldn’t want her release coming until she was sandwiched between them, no more than James did. And she would be ready for them. Then he heard her shocked gasp, the moan of near pain that erupted from her throat and knew Sax was preparing her back entrance as he stroked her cunt hotter.</p><p>“It’s okay, baby.” He kissed her nipple, licking it gently as he rose to his knees beside her. “Just enjoy, Ella. Just let it feel good.”</p><p>He gripped his cock in his hand, grimacing at the near black of her eyes, the flush of lust on her face. She was so beautiful it was damned near killing him.</p><p>“James, I can’t stand it.” She bucked against Sax’s mouth as James looked to the other man.</p><p>Sax had pulled back, watching as two of his fingers sank slowly in her pussy, two up the forbidden depths of her anus. Her heels were pressed into the mattress, fighting for leverage to thrust against the shallow thrusts. Sax wasn’t about to hurry, though. He knew as well as James did, the pleasure she would experience from the teasing.</p><p>Sax’s head lowered again then, unable to keep his lips, his tongue from the soaked slit that flowered open for him. He murmured his enjoyment into her flesh, his eyes closing as he savored each lick. James felt his cock drip with his own pre-cum at the sight. Her moans, her ragged breaths, the unconscious sexuality reflecting in her face, in her jerky movements, was more than he could bear. If he didn’t push his swollen cock into her mouth soon he was going to go insane.</p><p>Chapter Fourteen</p> <p>Ella wanted to scream, to find some way to release the surging sensations building in her body, but she couldn’t find the breath. Seconds later the choice was taken out of her hands as James’ cock slipped past her lips, filling her mouth, as his rough groan echoed around her.</p><p>Her lips tightened on him, her tongue licking over the thick veins, the tight flesh in greedy hunger, as the scents and sounds of sexual need wrapped around her. The flared head of his erection sank nearly to her throat as her tongue worked desperately along the shaft. She suckled him, pulling her head back then pushing forward, tempting him to fuck her mouth, to spill the hot rich seed that tasted like nectar on her tongue.</p><p>Between her thighs, Sax was lapping at her cunt, his tongue dipping into her vagina, two large fingers sliding deep inside her anus. She shuddered with the sensation, moaning around the flesh thrusting between her lips as she fought to suckle it, to tempt him into the release she knew he was teetering on the edge of.</p><p>She was suspended on a rack of agonizing pleasure and desperate fear. She had seen the other man’s cock, thick and hard, the dark flesh appearing angry, eager to take her. How would she bear it? How would her body hold two thick shafts like that at the same time?</p><p>“Ella, you’re killing me.” James’ voice was thick and deep as his hand gripped the halfway point of his cock and his thrusts became harder. “Your mouth is so sweet, so hot.”</p><p>She felt the head pulse against her tongue as she delved beneath it to the sensitive spot that she knew would make him groan with dark lust. The sound shot to her womb, ripping through her with almost climactic intensity. She tightened her mouth on him, slurping on his hard flesh hungrily as his thrusts became harder, his breathing rougher.</p><p>He was on the edge of release, she could feel it, almost taste it, but she was as well, and the tormentor between her thighs was refusing to send her over. She strained against his suckling mouth, his piercing tongue, but nothing seemed to be enough.</p><p>She growled around James’ cock as she fought for that one stroke, that one caress, that would send her over the edge.</p><p>“Stay still.” A sudden, light slap to her mound as the other man moved back had her stilling in surprise.</p><p>Her eyes flew to James’ face as he watched her, then glanced down once again.</p><p>“Again.” James voice was soft. “She’s not sucking me properly, Sax. I think she needs to be punished for it.”</p><p>Her mouth was full of James’ cock, but her strangled scream should have been enough. When the lightly stinging blow landed, she felt her entire body flinch. Not from pain, but from shameful pleasure. Her clit throbbed, pulsed, so swollen and sensitive now that the light blow was agony and ecstasy all in one.</p><p>Her mouth tightened on James’ cock, her tongue stroking, her mouth suckling as she knew he liked it, but she was determined that when the restraints came off, so did her façade of submission. This was all well and good, but she would make certain they both paid for the tormenting arousal.</p><p>Another blow landed. She jerked, moaning in protest at the streaking sensations. Her clit swelled further, throbbing in an agony of arousal. When the next blow came, she growled around the cock thrusting into her mouth and raised her hips for more. More. One more blow aimed just right, and her clit would explode.</p><p>But the next smack never came. Instead his tongue stroked, caressed, running around her clit with light, deliberately teasing strokes. She rewarded James, the beast, with a firmer suction on his erection, driving him past his own control.</p><p>“Yes, Ella. Baby. I’m going to come now. Take me, Ella.” He powered in, his moan deep and hard as his cock suddenly exploded.</p><p>Thick and hot, his seed shot into her mouth as his body jerked with the pleasure she knew was washing over him. In return, the mouth on her cunt only teased her more. She continued to suckle James’ flesh, drawing the last drop of his tangy seed from the tip as she fought to keep from screaming out in agony.</p><p>“Perfect.” James pulled back from her, his cock still hard, leaving her suckling mouth reluctantly.</p><p>Perspiration coated his body. His eyes were dark, his face flushed, his lips heavy with sensuality as his hands went to her breasts once again.</p><p>“Are you ready, baby?” His hands went to the restraints at her wrists as Sax moved away from her to loosen those at her ankles.</p><p>Ella shuddered. Her pussy was on fire, desperate, yearning. Every nerve ending in her body was sensitized and throbbing for release. When they released her, Sax moved to the side of the bed, laying back, the bulging length of his heavily veined cock rising to his abdomen. As she watched, he rolled a condom over the throbbing shaft, preparing to take her.</p><p>Ella moved, coming quickly to her knees as she caught James’ shoulders, her hands moving to his head as she pressed her lips to his. The surprising action seemed to fray his hard-won control. His tongue plunged into her mouth as she felt him moving her, Sax lifting her.</p><p>They lifted her over Sax’s big body until she felt the wide, flared head of his cock nudging at her vagina. She pulled back then, staring up at James, seeing the heady excitement in his gaze as the other man clasped her hips, holding her still.</p><p>“I’ll take you anally first,” he whispered. “Then Sax will take you. Scream for me, Ella. Don’t worry about control, don’t worry about anything. Just the pleasure.”</p><p>She groaned as Sax drew her down to him, his lips whispering over her cheek, her neck, as he drew her head to his hard shoulder. Below, his cock throbbed at the opening of her cunt</p><p>“Relax, Ella,” Sax’s voice was soft, soothing. “It’s like nothing else you’ll ever experience. Nothing else you’ll ever know.”</p><p>She flinched as she felt two fingers, slick and cool, slide into the prepared depths of her anus. She cried out, pressing closer, desperate to drive the hard cock inside her pussy as James tormented her back entrance.</p><p>“Stay still, Ella.” Sax’s fingers tightened at her hips. “Patience, beautiful. Patience.”</p><p>Then James moved into position. She felt the head of his cock nudge against the little puckered hole a second before he began to press inside. She tried to arch, but Sax held her close and still. Her wail, one of agonizing arousal and the sharp bite of erotic pain, was muffled against the shoulder beneath her as James entered her with excruciating slowness.</p><p>“James,” she cried out his name as Sax’s hands held her still, closer, his cock throbbing at the portal of her cunt.</p><p>She felt the burning stretch of tight muscles, heard James groan, praising the heat and the grip of her tight channel. One hand gripped a buttock, flexing, tightening on her as he surged inside her last few inches with a hard, shockingly deep groan.</p><p>Impaled, stretched and overfilled, Ella fought to breathe through the first fiery thrust, then to adjust to the invasion. She tightened on his cock, her breaths beseeching cries as her cunt flooded with moisture, convulsed and fought for release.</p><p>“Now,” James groaned behind her. “Now, Sax, I won’t last long.”</p><p>“Please.” She felt the condom-covered tip of his cock force its way into the entrance of her pussy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She bucked against them, the heat and hardness searing her, the pleasure/pain more than she could bear as he worked his cock inside her by slow degrees.</p><p>She tried to thrash in their arms, tried to force Sax to enter her faster, harder, dying for the orgasm she knew was just out of reach.</p><p>“James. Damn. She’s tight.” He groaned beneath her as he rocked inside her, the slick inner juice easing his way, but not by much.</p><p>As each agonizing inch pressed into her cunt, she could feel James, thicker, harder, as he throbbed inside her ass.</p><p>“Almost there,” Sax groaned. “Hold on, baby, I’m giving it all to you.”</p><p>She screamed, loud and deep, as the last inches powered inside her with a strong surge of his hips, burying his erection into her to the hilt. A second later, James began to move behind her.</p><p>The sounds of wet sex, desperate cries and hard male groans filled the air as Ella shuddered, her body jerking almost spasmodically in the grip of a lust she could have never imagined. The two men, their thrusts perfectly timed, began to fuck her with hard, driving strokes. Muscles protested, flared with heat, but parted beneath the driving strokes of the two thick shafts possessing her.</p><p>Between them, Ella cried out their names repeatedly, pushing herself into each thrust, flying higher, surging deeper into the ecstatic orgasm she knew was building faster, harder inside her.</p><p>Their thrusts quickened then, pushing into her body with rapid movements, rasping her clit against the wiry roughness of Sax’s pubic hair until the moment insanity hit. She felt her mind, her heart, her womb and her pussy explode. Convulsively, simultaneously, as her scream rocked the air between them. Behind her, James stiffened at that moment, his hot seed flooding her anus as Sax thrust into her tightening pussy one last time and tightened, his groan of release sounding hard and loud at her ear.</p><p>“Ella, baby.” James leaned over her, holding her close as she continued to cry out, her body shuddering so harshly she feared she would break apart.</p><p>“James,” she cried out his name, tears wetting her face as another vibration wracked her body, tightening her, blinding her. She tightened on the cocks still filling her, riding her through the mindless orgasm until she collapsed, boneless, against Sax’s body.</p><p>“Ella. God. Baby.” James pulled her from Sax, easing her into his arms as he fell to the bed, holding her close, tight, as the other man moved from the bed.</p><p>Ella could still feel the internal shudders racing through her womb, her own release dripping from her cunt as James rocked her, his lips caressing her face, his hands stroking her back.</p><p>“Don’t leave me.” She burrowed closer against his chest, too exhausted to hold him to her, praying he would hold her to him instead.</p><p>“Never,” he whispered at her ear, his vow echoing to her soul. “Never, Ella. I’ll always be here.”</p><p>Chapter Fifteen</p><p>“She asleep?” Sax was waiting in the kitchen, dressed, looking smartly presentable. He didn’t look as though he spent the last hours helping James fuck Ella into another screaming climax. James had held her in his arms, stroking her body, easing her through the destructive shudders of her orgasm before moving to take her again himself.</p><p>After the first violent sensations had eased from her body, neither man had been able to leave her in peace. She responded to each touch, each stroke of their hands as though it were the first time.</p><p>“She’s asleep.” James nodded, wishing he were as well. He had never been so exhausted in his life.</p><p>“Will she be okay?” Sax glanced back at the hallway that led to her bedroom, a frown shaping his brow.</p><p>“She’ll be fine.” James was sure of that. Her sleepily muttered words as she finally gave into her own exhaustion assured him of it.</p><p>“Well, you waited long enough for her.” Sax rolled his broad shoulders as he headed for the hallway. “I’m heading home now. I need to sleep.”</p> <p>James followed him to the door and as the other man turned back to him, lifted a brow questioningly.</p><p>“I’ll need your help now,” Sax said with a fierce frown. “You and Cole set up Ella’s downfall. I expect your help setting up my woman’s fall.”</p><p>James grinned. “You have a deal, Sax. Give me a chance to figure out how to get to her, and I’ll let you know.”</p><p>Sax nodded. “I’ll be waiting. Impatiently, but waiting.”</p><p>He walked out the front door, closing it softly behind him. James sighed deeply, secured the locks and then returned to Ella’s bedroom.</p><p>She was in the same position he had left her in, curled up on her side, her auburn hair a cloud of silk around her face, her expression peaceful, serene. Had he ever seen her peaceful or serene before he invaded her life? He shook his head, knowing he hadn’t.</p><p>“Is he gone?” she mumbled as he eased into the bed beside her.</p><p>Surprised, James stared down at her closed eyes.</p><p>“He’s gone.” He pulled her into his arms, tucking the blankets around her again.</p><p>Her voice was drowsy, replete, as she snuggled against him. “No more threesomes.” She yawned. “I can’t move.”</p><p>He chuckled gently. “Let me know when you need to move and I’ll do it for you,” he assured her.</p><p>Silence thickened around them again for long seconds.</p><p>“What now?” she asked, her voice even, though he heard the worry in her tone.</p><p>“Hmm. Many things.” He smiled against her hair. “But I’m not leaving, Ella. Not now, not ever. You’re mine. You submitted to it, baby. You can’t back out now.”</p><p>The letter he had left that day was detailed in more than one regard. Submit now, submit for life. The ring that had accompanied it graced her finger, just where it belonged.</p><p>“You have a lousy way of proposing, James. I’m going to have to teach you better. Boy toys are supposed to be more romantic, especially married ones.” Warmth filled her voice, a warmth that gave him hope. Then joy swelled in his chest when she whispered, “Especially the one I love.”</p><p>He laughed then, feeling freer, happier than he could ever remember feeling.</p><p>“I’ll keep that in mind, baby.” He kissed her lips tenderly, feeling her smile, her exhausted response. “Sleep now. In my arms, Ella. The way it’s supposed to be.”</p><p>And they both slept.</p><p>Epilogue</p><p>He had sworn she would come to him. He wouldn’t spend agonizing months trying to ease her into a relationship she had stated she would never tolerate. So he tried to seduce her into it instead.</p><p>After Thomas’s death, he had made himself indispensable to her. He was at the house often, fixing this or that, just talking or watching movies late into the night. Despite appearances, Terrie was a wary person, well aware of how easily she could be hurt, how weak she was physically. From what he had gathered, his brother had been more of a bastard than he had ever imagined.</p><p>“Now that was a beautiful wedding.” Terrie stumbled against him a bit as he helped her into the house.</p><p>James and Ella’s wedding ceremony had made her teary eyed, reflective. She had sat in the limo on the way home, quiet, a bit sad, staring out the window as her fingers stroked over the upper swell of one breast that her cream colored dress had revealed. The action had caused his cock to swell, to harden in agonized need.</p><p>“Well, it wasn’t a long one, anyway.” Jesse pulled her to him, leading her to the living room, enjoying her soft weight against his side.</p><p>The soft silk of her dress slid against his hands, and when he sat her on the couch, the hem rode just below the crotch of her panties. Cream colored as well, silk. He was betting it was a thong.</p><p>“You kissed the bride.” Her surprising comment had his brows lifting in surprise.</p><p>He had kissed the bride. Long and deep, to her complete surprise and shocked arousal.</p><p>“Yeah, I did.” He knelt at her feet, removing the high-heeled shoes from her small feet.</p><p>“That was so decadent,” she bit out. “Kissing her that way, with your tongue. You made her horny.”</p><p>He smothered his laughter. “That was the point,” he whispered up at her as he caressed the slight welts on the side of her foot.</p><p>She pouted. She had such an intriguing pout, and used it on him often.</p><p>“I promise not to kiss Ella again.” His hand stroked her calf as he felt a small tremor work over her body.</p><p>“Sax fucked her. He was at the wedding, of course,” she bit out. “I knew she couldn’t hold out. She gave in too easily.”</p><p>She sounded angry with Ella, though Jesse knew she was more than happy that her friend had finally found some happiness.</p><p>“You, of course, would be much harder to convince?” he asked her, careful to keep his voice even, his hand on her calf comforting rather than arousing.</p><p>She leveled a hard look at him. “I am not so easy.”</p><p>That was sure as hell the truth. He murmured consoling words, though, massaging her foot, well aware of how the heels made her feet ache.</p><p>“I’m not your sister.” She jerked her foot from his grasp, staring down at him angrily. “Stop treating me like one.”</p><p>“Keep it up and I’ll turn you over my knee and paddle your ass.” He jerked her foot back. “Now what has you so upset? I thought you were happy for Ella.”</p><p>“I am.” She was pouting again, watching him darkly.</p><p>“Then what’s your problem?” he asked her again.</p><p>“You’ve never kissed me like that,” she finally bit out, her cheeks blooming with a flush. “Why haven’t you?”</p><p>He pursed his lips. Her breasts were moving quickly beneath her dress, her nipples hard, poking impatiently at the light fabric. He allowed his hand to stroke higher along the inside of her leg.</p><p>“Because,” he whispered. “I can never decide where to put my tongue first.”</p><p>She blinked, confusion filling her expression. “What?” Her question was almost a gasp.</p><p>“You heard me.” His hand stroked to her thigh. “Do I take your lips and plunge my tongue into your mouth, Terrie, or do I push it as deep and as hard up your pussy as I can, and suck all that sweet cream into my mouth? Deciding is a bitch.”</p><p>Her mouth opened, her thighs tensed. He watched as she fought to breathe, to draw in air to counter the arousal he saw surging in her gaze. He parted her thighs then, his cock jerking at the sight of the damp spot on the silk of her panties. His gaze rose back to hers.</p><p>“Do you want that, Terrie? My mouth buried in your cunt, my tongue fucking you to orgasm?” Her thighs opened farther as a strangled moan whispered past her throat.</p><p>“Please,” she whispered, and his cock surged in joy then throbbed in disappointment as he gently closed her thighs.</p><p>“Remind me when you’re sober, Terrie.” He stood to his feet, staring down at her shocked expression. “I won’t fuck you drunk. Sober up, then call me. But don’t be surprised if you find out exactly why Sax was at that wedding, and what he’s most likely doing right now to your friend’s climaxing body. You won’t play with me, Terrie,” he warned her softly.</p><p>He turned and left the room, then the house. If he didn’t, he knew he would fuck her, knew he would drive his cock so deep and hard inside her she would scream for her orgasm. And he couldn’t. Not yet. She hadn’t seduced him; she didn’t want it enough. When she did, well then, he grinned, then he would give her everything he had ever dreamed she could take. </p> </body></html>"]