["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>“I know what you are.”</p><p>Cade Thain carefully put his whiskey glass down and glanced up at the woman before him. “And what’s that?” His hands flattened on the old, wooden table.</p><p>She sat down and leaned toward him. Her hair was blond, her skin a sun-kissed gold. And her eyes—they were the coldest blue he’d ever seen in his life. “You’re a werewolf.”</p> <p>He laughed, the sound deep and loud.</p><p>Her jaw tightened. “And you’re an assassin.”</p><p>Cade kept the smile on his face. “Lady, you’re crazy.”</p><p>“No, I’m not.” A thread of anger—no, that thread was far closer to fury—rumbled beneath her words. “I’m here to hire you.”</p><p>Cade glanced to the left. To the right. In this pit of hell that passed for a bar in some hole-in-the-wall Oregon town, no one was paying any attention to anyone. Or anything. “You’ve got the wrong man,” he said slowly.</p> <p>Her gaze searched his face. “Not too many men have scars like yours.” And that icy stare had locked on the scar that slipped from his right eyebrow all the way down to his jaw. Another scar sliced around his neck. There were more, so many more, hidden beneath his clothes. “Cut you with silver, didn’t they?” she asked softly. “When you were so young that you could barely heal.”</p><p>Fuck, yeah, they had. His back was covered with long, twisting scars. Wounds administered by sick pricks that Cade had personally sent to burn. Cade had been fourteen when he made those kills.</p><p>His first, not his last.</p><p>“Werewolf...” She breathed the title. “I’ve got a vamp for you to slay.”</p><p>Now the lady had his full attention. He dropped the act and focused totally on her.</p><p>Vampires had been the ones to torture him. To destroy his family. His pack. They’d introduced him to hell.</p> <p>Made him into the monster that he was today.</p><p>She leaned closer. Her scent—already too strong for someone with his enhanced senses—surrounded him. A bitter scent, heavy with incense. A witch. The scent of their spells always clung to them.</p><p>His would-be-client told him, “The vamp’s name is Allison Gray, and she’ll be such easy prey, especially for someone like you.”</p><p>Her fingers slid over to touch his hands. His claws weren’t out—not yet. Not yet. “Why do you want the vamp dead?” Dade demanded to know</p><p>Hell, vamps were already dead. They only kept living by draining their prey. Feeding on them.</p><p>Like they fed on me.</p><p>Parasites.</p><p>“She’s a pureblood.”</p> <p>Shit. Now the witch was talking some serious power. Most vampires were made the old-fashioned way—they were humans who were bit, drained, and brought back as vampires. But a pureblood? Purebloods were extra strong because they were born as vampires.</p><p>Lucky for the rest of the world, most purebloods were rare. Otherwise, hell would be calling on earth every damn night.</p><p>But killing a pureblood? “That’ll cost you extra,” he warned.</p><p>Her smile didn’t make her eyes appear any warmer. Beautiful, but the witch was stone cold. “I’ll pay you one hundred thousand dollars.”</p><p>Paranormal hits were never cheap—or easy. “Make it two.”</p><p>Her eyes narrowed.</p><p>He offered her his own, cold smile. “And I’ll want the cash up front, before I take my prey.”</p><p>The witch hesitated.</p><p>“You can always go find someone else.” Total bullshit. There weren’t any other werewolves in this part of the U.S. And when it came to vamp killin’, no one got the job done better than a wolf.</p><p>The witch would know that.</p><p>She nodded. “Done.” Then she eased back, licking her lips. “But you have to do it fast, before the next full moon.”</p><p>Five days away. Werewolves always knew exactly when the next full moon would rise. They were at their strongest when the full moon hung in the sky.</p><p>Her fingers drummed on the table. “And you have to make it hurt.”</p><p>Killing a vamp? Torturing her? Cade shrugged. For two hundred grand... “Done.”</p><p>His conscience had died long ago. He’d left it, broken and bloody, in that pit where the vamps had tortured him.</p><p>Besides, it wasn’t like he was slaughtering the innocent. The world would be a far better place with one less bloodsucker on the streets.</p><p>He reached for his whiskey. Barely felt the burn as the liquid slid down his throat.</p><p>One more down...thousands to go.</p><p>Chapter One</p><p>She was being hunted.</p><p>Allison Gray had felt the unseen eyes on her for days. Ever since she’d left Alliance, Nebraska, and begun this crazy journey.</p><p>Ever since she’d started to change.</p><p>Her hands fisted as she slid through the crowd inside Blood Bath. Blood Bath? Jeez, just what kind of name was that for a bar? Nestled near the Cascade Mountains, the bar was like the rest of the small town—pretty damn scary.</p><p>Allison found what she hoped was a private corner. One hidden by shadows. She’d never expected this town—not here. The tiny spot of Lost, Oregon, was filled with folks who looked like they could—and would—kill at the drop of a hat. She’d been told that she had to journey to this town. That she’d find the answers to all her questions here.</p><p>Her breath eased slowly from her lungs as her gaze swept around the bar. As always these days, she was aware of the strange ache in her gut. Hunger, one that just couldn’t be satisfied with food. No matter how much she ate, she stayed hungry.</p><p>And her senses—they were in freaking overdrive. So many scents burned her nose. Alcohol. Cigarettes. Cheap perfume. Sex. Blood.</p><p>Her nostrils flared.</p><p>Blood shouldn’t smell good. But, lately...the scent had started to—</p><p>“Well, hello, pretty lady...”</p><p>She didn’t start in surprise. She’d known the big biker was heading her way. The guy with tribal tattoos that covered his arms and shaved head. A dozen piercings penetrated his face. And...the guy had blood under his fingernails.</p><p>She was betting that blood wasn’t his.</p><p>“You all alone tonight?” he asked as he closed in on her.</p><p>Allison kept her chin up. Elsa, the witch who’d found her, had promised that Allison would find a guide in this bar. A protector who would help her on the rest of her journey. Elsa had said that her guide would come to Allison immediately. The witch had also told her that he’d be the strongest guy in the bar.</p><p>Allison could sure use some strength to help her out. Especially since she didn’t have any of her own to speak of at that moment.</p><p>She licked her lips and studied the guy before her. Big, check. Definitely strong, but...</p><p>But he scared her. His eyes were hot, almost feral as they slid over her body.</p><p>Allison realized she should say something. “Uh...I’m...waiting for someone.”</p><p>“Don’t have to wait no longer.” He reached for her hand. Pulled her up against him. Allison was barely five foot three, and this guy towered over her. “I’m right here, baby.”</p><p>Laughter followed that comment. The guy had friends in this place—a lot of them by the looks of things. And they were all watching her now.</p><p>Why weren’t there more women in the bar? Allison counted two in the whole place. Her and a chick who was—leaving.</p><p>Okay, that wasn’t good.</p><p>She put her hands on the biker’s chest. “Are you...are you my guide?”</p><p>He laughed, a hard burst of sound that grated in her ears. “Oh, yeah, baby, I’ll guide you all right.” His hands dropped to her ass. “I’ll guide you all night long.”</p><p>Crap. This guy wasn’t him.</p><p>The biker was pulling her even tighter against him now, and she was trying to get away but she wasn’t strong enough.</p><p>Story of my life.</p><p>She hadn’t been strong enough to save her family. Hadn’t been strong enough to stop the death.</p><p>Not strong enough to—</p><p>“Let her go.”</p><p>The voice was low, but it cut sharper than a knife, and the hard order pierced through the laughter in the room.</p><p>Because she was staring up at the brick wall of a biker’s face—a face that looked like it had actually hit a few brick walls over the years—she saw the fleeting expression of fear that whispered over his features.</p><p>“Thain.” The hands holding her eased as her captor bit out the name.</p><p>Allison hadn’t even seen the new guy yet, but if he was scary enough to make the biker tremble...</p><p>Trouble.</p><p>“She’s mine, Griggs.” Lethal words accompanied by the hard thud of footsteps as the Thain guy stalked closer. “So I’ll say it again, but only once more...let her the fuck go.”</p><p>No one seemed to be breathing in the bar. No one-including her. Allison’s lungs burned, but in that moment, she was too afraid to move at all. Griggs slowly, very slowly, released his hold on her. “Wasn’t gonna hurt her. Just gonna give the pretty lady some fun.”</p><p>She bet they had different ideas of fun.</p><p>“Allison.” Now that hard, dark voice of Thain’s was saying her name. If he knew her name...he had to be her guide. No one else should know her in that place.“Come here.”</p><p>She eased around the biker, took a step, and froze.</p><p>Because Griggs looked a hell of a lot more safe and welcoming than Thain did.</p><p>He was big, probably taller than Griggs, and far more muscled. His shoulders just...stretched. Allison swallowed. His muscles had the black t-shirt he wore pulling taut over his chest and arms.</p><p>His eyes were dark green and burning with intensity. A thick scar slid from the top of his right eyebrow all the way down to the underside of his square jaw. The scar just made him look...</p><p>Scary. Extremely scary. No—actually, it was the eyes that did that. Eyes that promised hell would be coming.</p><p>“Don’t know if she wants to go with you,” Griggs said. His hand came up to clasp her shoulder. “You can always stay with me, pretty lady.”</p><p>Allison sucked in a deep breath and stepped toward Thain. Her gaze slid over his face once more. This time, it was his mouth that caught her stare.</p><p>She took another step. The biker’s hand fell away.</p><p>Thain’s lips, strangely both cruel and sensual, were parted a bit to reveal the edges of his white teeth.</p><p>Her gaze lifted again. His hair, a shade darker than her own locks, was thick, heavy, brushing back from the strong lines of his face.</p><p>“Touch her again,” Thain warned, “and you’ll lose the hand.”</p><p>Everyone backed up a few feet.</p><p>Even Griggs. She heard the fast scuttle of his feet.</p><p>She was almost close enough to take Thain’s offered hand now. Almost.</p><p>Allison saw Thain’s nostrils flare. His eyes narrowed and swept over her. When he glanced back up, there was no mistaking the fury in his stare.</p><p>His hand began to lower.</p><p>No.</p><p>Allison grabbed his hand and held tight. “I’ve been waiting for you,” she said.</p><p>A muscle jerked in his jaw. Then he pulled her forward. His scent—a little wild and with the richness of the forest clinging to him—wrapped around her. Allison stared up at him and tried not to show her fear.</p><p>She wasn’t supposed to be afraid anymore. This was the man Elsa had told her about. The man who would end her nightmare.</p><p>She just had to trust him.</p><p>“Let’s get out of here,” Allison whispered. They could leave. Go someplace safe. Then maybe she could finally stop feeling like death stalked her every minute.</p><p>This man...he could stop death. To her, he looked like he was strong enough to stop anyone and anything.</p><p>His arm wrapped around her shoulders. He led her from that godforsaken bar and out into the still night with the moon that hung high in the sky.</p><p>Her heart raced so fast, she could feel it thudding in her chest.</p><p>He paused and glanced down at her. “You’re afraid of me.” His voice was still a deep rumble.</p><p>Allison managed a nod. Despite her efforts, she couldn’t help it. She couldn’t—</p><p>“Good,” he told her as he pushed them into a dark alley.</p><p>Whoa, wait—good?</p><p>In the next instant, he had her shoved against the alley’s wall. “You should be scared.” His face came toward hers. Dangerous and threatening in the faint moonlight. “You should be damn well terrified.”</p><p>Allison’s body shook.</p><p>“You’re being hunted,” he told her, “stalked. There are people who want you dead.”</p><p>“I...I know.” Some had wanted her dead for years.</p><p>He leaned in closer. Odd. His teeth seemed sharper than before. “And you just blindly walk off with me? How the hell do you know I’m not one of the assholes who wants to kill you?”</p><p>She didn’t know that. But she wasn’t stupid. Or crazy.</p><p>Allison slipped her concealed knife up to press against his heart.</p><p>Okay, maybe she was a little crazy. “If you’re the guide that the witch sent to collect me, then you’ll be able to tell me her name.”</p><p>She drew in a breath and could almost taste him because he was so close.</p><p>Actually she wanted to taste him. What in the hell was up with that?</p><p>Allison pressed her knife harder against his chest. Not hard enough to break the skin, but hard enough to show that she meant business. “Tell me her name.” So she could trust him. So she wouldn’t have to be alone any more. “Tell me.”</p><p>He glanced down at the knife. A faint furrow pulled between his brows as if he were trying to figure out a puzzle.</p><p>“Elsa,” he breathed the witch’s name slowly. “Elsa sent me to you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her heartbeat began to slow. Her knife slid away from his heart. “Then it is you.” Big, scary, tough—yes, she’d take him, please. He’d keep her safe. “You’re the one who has been sent—”</p><p>He ripped the knife from her hand. Tossed it to the ground. And in the next second, his hand was at her throat. Only...something was wrong. Something sharp had burst from his fingertips.</p><p>Claws?</p> <p>He had claws at her throat. Why would—</p><p>“I’m the one she sent,” he growled. “I’m the one who’s here to—”</p><p>A shout broke the night. Not so much a shout, but more a bellow that was her name.</p><p>The watcher. She’d only been in town a few hours. Had he already caught up to her?</p><p>Thain’s head whipped to the right. His nostrils twitched. “Vampire.” He said the word like a curse.</p> <p>Because it was.</p><p>Most thought vampires weren’t real. Just stories to tell in order to frighten children.</p><p>She’d been a scared child once. She’d seen the vampire that came into her house. That fed on her family.</p><p>Not just a story.</p><p>“We have to get out of here,” she whispered. “Now.”</p><p>Thain glanced back at her, frowning.</p> <p>Why wasn’t he moving? Did the guy want to get eaten by vampires? That wasn’t exactly the best way to go.</p><p>He stepped back. Well, that was something. Movement. Then Thain shook his head and stared at her like she was some kind of mental case. Yeah, she’d seen that look before. After her parents were killed, she’d tried telling the cops about the vampires. Only the cops hadn’t believed her. They’d just given her the look that said she was insane. The same look Thain was giving her now.</p><p>So not time for this.</p><p>“Allison!” That roar again. Closer this time. Coming too near.</p><p>A growl rumbled in Thain’s chest.</p><p>Uh, okay.</p><p>Then he caught her hand and they started to run. Not away from that yell. Oh, sweet baby Jesus, they were running toward it.</p><p>Allison dug in her heels. “We can’t! Stop!”</p> <p>But it was too late. The blond vampire had rounded the corner. He rushed at them with fangs barred.</p><p>Thain leapt forward and drove his claws—yes, definitely claws, very definitely—right into the vampire’s throat.</p><p>Using those claws, Thain lifted the vampire up and tossed him back through the air. A good ten feet through the air.</p><p>Allison realized her jaw was hanging open.</p><p>The vampire thudded into the side of the alley. Blood gushed from his throat as he shoved his hands up to cover the wounds. He tried to speak, but only a gurgle slipped from his lips.</p><p>A gurgle, and more blood.</p><p>Thain lunged for him again, but vampires were fast—so fast.</p><p>The vampire leapt up and raced away.</p><p>For an instant, she thought that Thain would give chase. Instead, he turned to her, breath heaving, claws still out.</p><p>His green eyes were glowing.</p><p>“What are you?” Allison whispered.</p><p>He smiled. His canines had lengthened to razor sharp points.</p><p>“Scared?” he mocked. She couldn’t even hear the vampire’s footsteps anymore. He’d run too far, too quickly.</p><p>Allison shook her head and hurried to Thain’s side. She knew there was a whole lot more to this world than met the eye. Vamps were real, and she’d heard stories of other monsters lurking in the dark.</p><p>Right then, she didn’t really care what Cade was...all that mattered was that he’d just rescued her ass from the vamps. Laughing, she threw her arms around him. “Thank you!” He could do it. He could keep her safe. Elsa had been right. This man—he was the one she needed.</p><p>The one man who could help her.</p><p>Thain stiffened in her arms. His whole body felt rock-hard. She glanced up and stared into eyes that were too bright.</p><p>Slowly, his arms closed around her. His head lowered toward hers.</p><p>She actually thought her hero might kiss her. Even wilder, in that instant, she wanted him to put his mouth on hers.</p><p>Sensual and cruel...how would he kiss?</p><p>But Thain pulled back. He took her hand and led her through the alley and to a motorcycle that waited in the shadows. He climbed onto the back of the bike and glanced over at her. “If you come with me, there’ll be no going back.”</p><p>Allison slid on the bike behind him. Her thighs hugged his even as her arms curled around him. “I have nothing to go back to.”</p><p>Only death. But Thain...he offered her life.</p><p>The motorcycle’s engine snarled, and they raced forward into the darkness.</p><p>Elsa LaSpene crept slowly through the night. She didn’t head into the bar. No point. Her prey would be long gone by now.</p><p>She closed her eyes and inhaled. The sweet scent of blood had her smiling.</p><p>Fresh blood.</p><p>She slid deeper into the alley. There. Against the wall. The dark stain of blood could be seen in the moonlight. Her fingers lifted and touched that perfect wetness.</p><p>So fresh.</p><p>The little pureblood hadn’t lasted long. Not long at all. Not once the wolf had gotten his hands on her.</p><p>He’d taken Allison from the alley, just as he’d promised. Taken her, but blood had already been spilled.</p><p>The wolf had started his fun early.</p><p>“You’d better make it hurt,” Elsa whispered as she tilted her head back and gazed up at the moon. “Make it hurt.”</p><p>Chapter Two</p><p>Fuck. Fuck. Fuck.</p><p>Cade drove the motorcycle deep into the forest. Allison held on tight behind him. Her body was soft, warm.</p><p>Human.</p><p>That witch had lied to him. Set him up. Dammit. He hadn’t signed on for killing a human.</p><p>Not one that smelled like roses and looked like the sweetest sin he’d ever seen.</p><p>Not her.</p><p>The motorcycle roared as he pushed it faster. Faster.</p><p>Soon the trees thinned, and he saw the stark outline of his cabin. Small, but made with heavy wood that could stand against the rough winters, he’d thought the cabin would be the perfect place to hold the vampire.</p><p>To kill her?</p><p>His fingers clenched around the handlebars. Cade shut of the motorcycle and shoved down the kickstand. He didn’t speak at first because the rage choked back any words that he wanted to speak.</p><p>“Thanks for getting us out of there,” she said, and, hell, even her voice was sexy. Smooth and soft, with a slightly husky edge that made him think of tangled sheets and warm flesh. “Thain, I—”</p><p>He turned toward her. “Cade.”</p><p>She blinked her wide, fuck-me bedroom eyes at him. “What?”</p><p>His enhanced vision let him see her perfectly in the dark. So he could easily read her confusion. “The name’s Cade. Cade Thain.”</p><p>And why was he even talking to her? She should have been dead by now.</p><p>But...</p><p>But he was rising off the bike, taking her arm and leading her toward the cabin like they were on some kind of damn date. And she came right with him. Her steps double-timed it to keep up with his, and her long, dark hair brushed his arm as they walked.</p><p>Lamb to the slaughter.</p><p>He shoved open the door. She slipped right over the threshold, never even hesitating. Just blindly walking in. Trusting him.</p><p>That trust pissed him off.</p><p>Slamming the door behind him, Cade pounced. In less than a second’s time, he had her body pinned to the nearest wall. He had his hands on her—damn, she’s soft—and his fangs were ready to rip and tear.</p><p>Only...he wasn’t ripping anything.</p><p>She gazed up at him. The light from the hallway spilled onto them, and he saw the faint ring of gold that circled her pupils. That gold around her eyes was one sign that marked her as a vampire pureblood.</p><p>He caught her left hand. Yanked it up.</p><p>“Cade!” Allison yelped. “What are you—”</p><p>The mark was there. A blood-red rose, nestled in her palm. A real particular birthmark.</p><p>Pureblood.</p><p>Fuck.</p><p>“You’re not human,” he told her. Unfortunate—for her.</p><p>Her eyes widened even more. “Uh, yes, I am.” She jerked against his hold. He just lifted a brow and kept right on holding her.</p><p>“Who sent you to that bar tonight?” Cade asked her, but he already knew the answer.</p><p>“The same witch you sent you.” Allison huffed out a breath. “M-my friend, Elsa. She told me you would be there—that you’d guide me to safety and—”</p><p>He started laughing. “You don’t have any clue, do you?” No wonder the witch had been so certain.</p><p>Allison stared up at him, the long tangle of her hair sliding over her shoulders. Her skin was pale—so pale, just like that of most vamps, but her body was warm. She was small and curved just the way he normally liked women to be—with pert breasts, flaring hips, and an ass that could make a man beg.</p><p>And her face...beautiful. Not that he’d had a whole lot of beauty in his life, but he knew it when he saw it.</p><p>He saw it then in the high sweep of her cheekbones. The soft slide of her nose. The heavy lashes that covered her eyes—and in the delicate chin that angled up in the air.</p><p>Allison Gray was a beautiful woman.</p><p>A beautiful, soon-to-be dead woman.</p><p>Hell. He could feel Allison’s heart racing against him. She was afraid again. That should have been a good thing.</p><p>Why did her fear piss him off? It angered him just as much as her blind trust. The scent of her growing fear seemed to burn his nose.</p><p>“Vampires are chasing me,” she told him. He’d pushed her hands back against the wooden wall. “That guy in the alley—he’s been after me for months.”</p><p>Yeah, Cade bet he had.</p><p>“They want me dead.”</p><p>Undead.</p><p>“Elsa said you’d help me.” Her lips trembled. Wide, full lips. Flushed dark red. Plump. Those lips were so close to his.</p><p>The beast within began to snarl. “She lied.” Blunt. Brutal.</p><p>Best to go ahead and tell her. Best for her to know...</p><p>Her tongue swiped out and licked a slick trail over her bottom lip. “Wh-what?”</p><p>Take. The beast inside roared. Cade brought his mouth closer to hers. What would it hurt? Just one little taste...</p><p>Her eyes were so very blue as they stared up at his. Not cold like the witch’s had been, but filled with a tangle of emotion.</p><p>Her lashes began to lower.</p><p>His lips pressed lightly over hers. Allison didn’t fight. Didn’t try to turn her head away.</p><p>Her breath whispered out, and he pulled that soft gasp into his own lungs, taking her taste with that breath.</p><p>Sweet.</p><p>He’d take more.</p><p>He kissed her again. Harder. Deeper. Her lips parted and...and she let him in. His tongue thrust past her lips and into the warm cavern of her mouth. His body pushed against hers, so close he could feel the tight tips of her nipples and the wild beat of her heart.</p><p>Innocence and sin. One woman shouldn’t taste like both.</p><p>She did.</p><p>Allison met him, kissing him with a wild, hot need as a moan built in her throat. Kissing him...because the woman thought she was safe with him.</p><p>That he was some promised protector.</p><p>His claws began to stretch.</p><p>He let his fangs rake over her lower lip.</p><p>Allison froze in his arms.</p><p>Time for her to understand exactly what was happening. Cade lifted his head. Gazed into her eyes. “I’m not here to keep you safe.” His words were growled, the snarl of a beast.</p><p>Her gaze slid from his, searching the darkness of the cabin that waited to the left, then to the right.</p><p>“No one followed us out here.” She’d come so willingly. She could have screamed back at that bar. Asked for help. Begged for help.</p><p>Maybe Griggs would have fought for her.</p><p>Perhaps some other dumb asshole would have played white knight.</p><p>Slowly, he released her wrists, but he didn’t step back. “There’s no one to hear you scream out here, sweetheart.”</p><p>Allison flinched. “Wh-why would I scream?”</p><p>He brought up his hand and let his claws slide down her cheek. She needed to stop seeing him as some kind of damn hero and see him for what he really was.</p><p>“Your Elsa didn’t send you to me for protection.” He paused. Watched because he knew the horror would come. “She paid me to kill you.”</p><p>And since Allison looked so incredibly delicate, so innocent and human, he wasn’t expecting the blade of her knife to shove into his chest.</p><p>He glanced down, stunned, and realized that when they’d been in that alley, she’d stopped to retrieve her weapon. He’d been fighting the vamp, and she—</p><p>His blood dripped down his chest, and Allison shoved him back with very un-human strength. He flew back and crashed into the opposite wall. She gazed at him with desperate eyes, stunned, scared, then she rushed for the door.</p><p>The screen door slammed behind her as she fled into the night.</p><p>Taking his time, Cade rose to his feet. The knife had missed his heart by a good three inches. And it wasn’t even silver.</p><p>Amateur hour.</p><p>He yanked out the blade. Stared at the bloody metal, then broke it with his tightened fist.</p><p>She was running from him now. Running fast into that dark night. Pity. She wouldn’t realize just how much he enjoyed the hunt.</p><p>The beast always liked to chase prey.</p><p>Cade let the change sweep over him, brutal, hard, as his bones popped and broke, reshaped and elongated. Fur sprang along his skin, and when he opened his mouth to cry out to her, a howl filled the night.</p><p>Time to hunt.</p><p>When Allison heard the long, angry howl, she glanced back even though all her instincts screamed...Keep going. Hurry.</p><p>Her savior was her executioner. Allison stumbled away, plunging for the thick shelter of the trees. If she’d known how to hot-wire the motorcycle she would have jumped on it and fled, but, dammit, she didn’t have that skill set. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her side heaved as she raced through the woods. Her legs burned, but she pushed herself as fast as she could go. There was no safe place for her anymore. No one to trust. Even Elsa had sold her out.</p><p>Elsa...the woman who’d come to Allison when she’d stood, crying, over her parents graves in that cold cemetery. Elsa had promised friendship.</p><p>But tried to give death.</p> <p>Lying witch.</p><p>Another howl shook the night and she whipped around, following that sound.</p><p>Oh, hell. A big, black beast of a wolf charged after her. Too big, freaking huge. And he was running too swiftly.</p><p>She lurched to the right, tripped over a fallen log, and hurtled down the hill, spinning again and again and slamming into the earth with each painful turn.</p><p>When her body finally stopped hurtling, she was face-down on the ground. Every part of her hurt and...</p> <p>“Allison.”</p><p>Her head jerked up. Elsa stood there. Lying, scheming Elsa. Smiling.</p><p>“Guess the werewolf has already started his fun...”</p><p>Werewolf. Then she heard it—the thunder of the wolf’s approach as he raced down after her.</p><p>“He’s going to rip you apart.” Elsa stood near two twisted, gnarled trees. “And I can’t wait to watch.”</p><p>Allison made it to her feet. Nothing felt too broken. Maybe. But she was trapped between a witch and a wolf. A freaking werewolf. She’d heard plenty of stories about the werewolves. Dangerous, more animals than men. And she had to fight one of those beasts? Without a weapon? “You were supposed to help me!” Screw this. She wasn’t standing around to—</p> <p>Elsa lunged at her. Grabbed her and held on tight. Elsa’s nails sliced into Allison’s arms. “You think you’ll take my power? My life? You won’t,” she gritted, spittle flying. “You won’t take a damn thing from me.” Her nails dug deeper. “But I’ll take everything that you are.”</p><p>The wolf snarled, and Allison actually felt the hot stir of his breath behind her.</p><p>Elsa twisted her around and shoved Allison back toward the wolf. “Rip the vamp’s throat out.”</p><p>“I’m not a vampire!” Couldn’t the chick see that?</p><p>And could the wolf even understand her now?</p><p>Her breath heaved as she stared at him—at green eyes she’d never be able to forget. No wonder Cade’s teeth had looked so sharp. His teeth, his claws...</p><p>All the better to freaking kill me with.</p><p>“Rip her apart!” Elsa shouted the words with feverish excitement. “Rip. Her. Apart.”</p> <p>Allison didn’t move.</p><p>The wolf stalked closer. She’d stabbed him. Shoved him—and the guy had hurtled pretty far when she’d hit him back at the cabin. Maybe she could hold him off. Hold them both off, just long enough to—</p><p>The wolf leapt forward.</p><p>Allison screamed. She couldn’t help it. She wasn’t brave and super kick ass, and she didn’t want to die, she didn’t want—</p><p>The wolf pushed her behind his body and faced off against the witch. He’d shoved her back with his powerful paws, and Allison found herself on the ground again.</p><p>The wolf was so big that she could barely see around him, and she rose quickly to her knees in order to get a better view.</p><p>The witch wasn’t smiling any longer. “What in the hell are you doing?” Elsa screeched.</p><p>The wolf glanced back at Allison. His green eyes—glowing, so wild—seemed to see right through her.</p><p>Bones began to snap then. To break, to crunch. The sounds were horrific, and Allison wanted to turn away, but she couldn’t.</p><p>Watch him. Her legs trembled as she stood.</p><p>Fur melted from the wolf’s body. Golden flesh and toned muscles appeared. Naked male. Powerful. Primal.</p><p>He rose to his feet, still making sure to keep his body between her and the witch.</p><p>“She’s not a vampire yet.” His voice was rougher, harder than before.</p><p>Allison bit her lip to keep from speaking. He knew about her infection?</p><p>“It doesn’t fucking matter!” Elsa snapped back at him. “Kill her!”</p><p>Two against one. Bad odds. Especially when one of those two was a werewolf.</p><p>Her mouth had gone desert dry. Her nails dug into her palms, and her body locked as she waited for Cade’s next move.</p><p>He spared her a glittering glance over his shoulder. Please. She didn’t speak the word, but she sure thought it and knew the plea had to be reflected in her eyes. Don’t kill me.</p><p>Did his head incline? Did she imagine it?</p><p>“Kill her!” Elsa yelled.</p><p>“No.” Cade’s response. Low but fierce.</p><p>And Allison didn’t know who was more shocked.</p><p>The wind began to whip around them in heavy bursts that caught Allison’s hair and lifted it into the air.</p><p>“I paid you!” Elsa thundered at him. “We had a deal.”</p><p>“You paid me to kill a vampire.” The guy was naked and still damn dangerous. “Right now, she’s just a lost human.”</p><p>She was a scared-as-hell human who had a bit of hope stirring in her chest.</p><p>When she craned her neck, Allison caught sight of the red-faced witch. “She’ll change!” Elsa’s hands were fisted on her hips. “Just a few more days, and she’ll be—”</p><p>“Then I’ll see about killing her,” he said with a shrug.</p><p>And that simply, her hope faded.</p><p>Elsa lunged forward, coming at Allison with a scream. But Cade caught her and tossed her back. “You’re not touching her,” he growled.</p><p>Allison shivered at the threat lacing those words.</p><p>“If you won’t do it—” Elsa began.</p><p>Now Cade was the one to laugh. “You can’t kill her. If you could’ve done the job, you never would have come crawling to me.”</p><p>Uh, why couldn’t the witch kill her?</p><p>“So get the fuck out of here, witch, and I damn well better not see you again.” He lifted his hand, and claws had broken through his fingertips. “If I do, you may just be the one to die.”</p><p>Allison backed up a step and a stick snapped beneath her feet. But the wolf and the witch didn’t glance her way.</p><p>“You’ll pay for this,” Elsa promised.</p><p>Cade just shrugged again, clearly not worried. What did it take to worry a werewolf? Not threats from a witch, obviously...</p><p>“She’ll turn on you. The minute the hunger strikes her, she’ll feed on you...just like the others.” A heavy pause. “But maybe you like that. Maybe you like just being fucking food for the vamps!”</p><p>Elsa yanked away from him, chest heaving. “You’ve made the wrong enemy.” Her blond hair rose in the thrashing wind. “Soon enough, you’ll both die.”</p><p>The wind whipped in an even wilder frenzy. Allison struggled to stand and—</p><p>And Cade had her. He pulled her tight against his chest as the wind seemed to scream and rake her flesh. He held her close, his warm body a solid anchor against the fury.</p><p>Then, in the next instant, there was only—</p><p>Silence.</p><p>His fingers curled around her chin and forced her head up. Allison stared into his eyes, not knowing what to say. Because the werewolf she was looking at just might be her savior...or he could be her worst nightmare.</p><p>Chapter Three</p><p>“You’re...not going to kill me?” Allison asked softly from her position in front of the fireplace.</p><p>Cade buttoned the jeans he’d donned and headed toward her. Her scent pulled him in—no one should smell like that.</p><p>Good enough to fucking eat.</p><p>Her gaze darted to his face, then dropped to his chest. Her lips parted when she saw his scars.</p><p>He’d be willing to bet she didn’t have a single scar on that soft, silken body.</p><p>She glanced away, too fast, and his jaw locked. The woman had better start getting used to the way he looked. If she wanted to keep living, he was her only shot at survival.</p><p>Why? What the hell am I doing?</p><p>Helping her hadn’t been the plan...had it?</p><p>She looked at him again, locking those fuck-me blue eyes on his.</p><p>The wolf within started to growl.</p><p>“Why are you making that sound?”</p><p>So maybe the man was growling, too. Vamps weren’t the only ones who liked to use their teeth. Right then, he was real tempted to bite.</p><p>He could start on her shoulder. That delicate spot where neck and shoulder met. He could mark her and—</p><p>“S-stop staring at me like that.” She hunched her shoulders and pulled up her blanket. “Either you’re gonna kill me or you’re not.”</p><p>Those weren’t the only choices he had. What about fucking? Where did that fall on her little to-do-list?</p><p>“I can leave, you know. Go out that door, and you won’t ever have to see me again.”</p><p>She didn’t get it. Cade lunged forward, grabbed her arms, and lifted her up against him. The blanket fell to the floor. Her lips parted as she sucked in a startled breath. “Without me,” he told her flatly, “you are dead. You’ve been marked for death by a witch.”</p><p>Her eyes caught his—trapped him. Fuck. A woman’s eyes shouldn’t make a guy feel like she was stealing his soul with just a glance.</p><p>He forced his hands to ease their too tight grip on her. “Since I didn’t kill you, you can bet that she’ll just send someone else to finish the job.”</p><p>“Why?”</p><p>“Because vamps aren’t exactly loved, sweetheart. Humans and supernaturals, hell, we all want to stake them.”</p><p>She shook her head and her hair brushed over his arms. “I-I got infected and—”</p><p>At that, he laughed and stepped back, freeing her. “Is that what you think happened?”</p><p>Allison nodded quickly. “When I was a kid...vampires killed my parents. They tried to kill me—when they bit me, th-they must have infected me—”</p><p>Had Elsa told her this BS?</p><p>“If we can just find me a cure...” Allison continued, voice desperate, “I’ll be okay. Whatever’s happening...it can stop. It stopped for years. Nothing happened to me until just a few weeks ago—”</p><p>She had no clue. “You’re not infected.” The vamps who’d attacked her had no doubt realized the truth about Allison with one bite. They would have tasted the power in her blood. “You’re a pureblood.”</p><p>Allison blinked. “I’m a what?”</p><p>“A human who is born to the call of blood. You don’t have to get a blood exchange in order to change. You’re one of the rare few who will change on your own.”</p><p>She shook her head at him again. Right. Why believe what he had to say? Figured. He exhaled on a rough sigh. “That family of yours that died, I’m betting they weren’t your real family, were they?”</p><p>“They sure as hell were!”</p><p>Ah, now she was showing some bite.</p><p>He cocked his head as he studied her. “Easy. I meant, they weren’t your blood family, right?” No way two humans could have created her. That wasn’t the way purebloods were made.</p><p>Her jaw tightened. “I don’t have any clue who my birth parents were, okay? All I know is they dumped me on the steps of a hospital and never looked back.”</p><p>“To leave a pureblood behind, they probably couldn’t look back.”</p><p>A furrow appeared between her brows. No clue. He tried to explain by saying, “Purebloods are rare. Only newly turned vamps can have kids, and they don’t just toss ‘em out.” No matter what else you could say about the vamps, they protected their own. “Your parents...”</p><p>She watched him with troubled, lost eyes, not speaking.</p><p>Cade exhaled. “I’m guessing they were being hunted, and if they never came back for you, that means...”</p><p>They died.</p><p>Her lashes lowered, and he knew she understood. Her throat worked as she swallowed, and, still not looking back at him, she said, “I-I can’t be...”</p><p>Deal with it. Life sucks, sweetheart. It’s a lesson we all learn. “You are. In just a few days, you’ll be kissing your human life good-bye.” Then what was he supposed to do? Stake her? Cut off that pretty head?</p><p>No.</p><p>Her cheeks grew even paler.</p><p>But it was best that she go ahead and understand this now. An infection? Not for her. “You’re gonna change. By the time the full moon rises, you’ll be a vampire.”</p><p>“I can stop it! Elsa said there was a cure, I can—”</p><p>“There is no stopping it for you. Elsa just set you up to die.”</p><p>She flinched at his words. Right. The truth could hurt, huh? Better to shatter all her illusions now. “There’s no cure. There’s not a damn thing you can do to stop the change.”</p><p>Her body trembled.</p><p>“You will be a vampire.” His hand lifted, and traced the thick scar that circled his neck. A scar that he’d received when he’d been too young to readily pull forth the full wolf within. “And then...”</p><p>“Then?” Allison whispered.</p><p>“Then you’ll go for the throat of any asshole dumb enough to get near you.”</p><p>“You—you...hate vampires.” Her eyes had fallen to the hand that slid across his scar.</p><p>He stared at her, caught by her words. “Yeah, I fucking do.” Fury broke beneath the words. He hated those parasites and wanted them all in the ground—so why was he standing there, talking to her, wanting her?</p><p>Offering to protect her?</p><p>Cade spun away. “Stay the night. You’ll be safe here.” He’d know if anyone tried to sneak onto his land.</p><p>“Thank you.” Her whisper followed him.</p><p>Cade glanced back. She’d wrapped her arms around her stomach. She stared after him, looking lost. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Fuck.</p><p>“Don’t thank me,” he growled. Don’t thank me because you don’t know what I’m going to do yet. You don’t know what I want.</p><p>Soon enough, she would.</p> <p>It was the same nightmare she always had. Allison knew it was a nightmare, but she still couldn’t wake up. Her parents were dead around her, their blood staining the white carpet a dark red. Her neck hurt, and she could feel the wetness sliding down her skin.</p><p>Her blood.</p><p>“We’ll be seeing you again...” The vampire told her, smiling with a flash of his blood-stained teeth. “Grow up for us, get strong...we’ll be seeing you again.”</p><p>Because she was one of them. Just like them. She’d kill, torture, listen to her prey scream—</p><p>“Wake up, Allison.” Hands were wrapped around her arms, shaking her not-so-gently. “Dammit, wake up!”</p> <p>Her eyes flew open, and she found Cade crouched over her. She almost screamed again.</p><p>Just in time, she managed to stop herself. “I—is something wrong?” Her heart thudded in her chest and her voice came out far too husky.</p><p>She was in the bed. His bed. He’d taken the couch and offered his room to her.</p><p>A nice gesture for a killer.</p><p>“You were screaming.”</p><p>And now she was awake, in bed, mostly naked, with a bare-chested werewolf crouching over her. “Bad dream,” she managed.</p> <p>Cade grunted. Was that supposed to be a sympathy sound? He stared to pull away.</p><p>She grabbed his hand.</p><p>They both froze then. Suddenly, the air seemed very, very thick. And he seemed even...bigger than before.</p><p>“You want to let me go,” he said the words softly, but she heard the order in them.</p><p>She didn’t let him go. “You’re not the hard-ass you want me to believe you are.” Hard-ass killers didn’t comfort you when you had a nightmare. Hard-ass killers didn’t give you their beds. They didn’t—</p><p>One second. That was all it took. He had her flat on her back as his body crushed hers into the mattress. His lips were on hers, not soft and gentle—wild, hard, rough.</p><p>He didn’t kiss like a new lover. He kissed like a man taking what he wanted.</p><p>Me.</p> <p>She couldn’t pull away. His hold was too strong. But—</p><p>But she didn’t want to pull away. Allison let her lips part even more, and she kissed him back, loving the hot surge that heated her veins. She’d been alone and afraid for so long and now—I want him.</p><p>His mouth jerked away from hers. “What the hell are you doing?”</p><p>She licked her lips. Tasted him. Wild. “Kissing you?” Sure, she might not be the most experienced chick in the world but she did have some skills.</p><p>“Why?”</p><p>Uh, shouldn’t that be—</p><p>“Do you like to play with fire? I want you...” His voice had roughened, deepened so that it sounded like the rumble from a beast, “and werewolves aren’t exactly known for their control.”</p><p>Her hand rose and traced one of the twisting scars that crossed his chest.</p><p>Cade’s muscles stiffened at her touch. “You don’t want to—” His words broke off as his head jerked to the right. She saw the slight flaring of his nostrils as he scented the air.</p><p>“Cade?”</p><p>He didn’t look at her. Just stared toward the dark window. “Company.”</p><p>Cade leapt out of the bed and raced for the door. Allison grabbed for her clothes and yanked them on as she stumbled after him.</p><p>Then she heard the growl of motors approaching. At least two. Oh, crap, this wasn’t good.</p><p>She grabbed Cade’s arm. “Wait!”</p><p>He spun to face her.</p><p>“You don’t know what’s out there—”</p><p>“Two trucks. Seven dumbass humans. I can smell ‘em.” He inhaled and offered a grim smile. “And those humans are about to get an ass beating.”</p><p>Okay, so he did know.</p><p>Cade stalked outside. He was still bare-chested, and the guy didn’t even look for a weapon to take with him. She didn’t know much about werewolves, but no way were they indestructible.</p><p>Allison rushed after him, yanking down her shirt. The trucks had just braked to a halt, and dirt danced in the air around them.</p><p>Cade stopped on the small porch, braced his legs apart and kept his arms loose at his sides. “Griggs!” He called out. “You dumb bastard, you don’t want to get in this battle.”</p><p>Griggs? The guy from Blood Bath? Like she’d be forgetting him anytime soon.</p><p>The truck door opened, and sure enough, Griggs poked his shaved head out. “For enough money, I’d gut my own mother.”</p><p>Lovely.</p><p>The men climbed out of the trucks. Cade had been right about their “company” after all.</p><p>“The money’s real good,” Griggs continued as he began to edge toward them. Oh, damn, was that a wooden stake in his hand? “Too good to pass up. Not my fault if you went all pussy weak.”</p><p>A quick glance showed her that Cade’s claws were coming out.</p><p>“What?” Griggs demanded. “Did you decide to spend some time screwing the target? I mean, she’s hot, but not worth the—”</p><p>Cade lunged forward, and when he moved, in that instant, Allison saw the flash of metal. A gun. The jerkoff sidling up behind Griggs had a gun that he was aiming at Cade.</p><p>Had Cade even seen the weapon?</p><p>She screamed a warning and leapt toward Cade. Leapt—and moved faster than she’d ever moved in her life. Faster than a human could ever move. Her body slammed into his, and she knocked Cade out of the way even as she felt a fierce burn lance her skin.</p><p>She hit the ground, stunned, and realized that her side was still burning. Allison glanced down and in the growing dawn light, she saw the blood seeping through her shirt.</p><p>“Fucking wrong move,” Cade snarled.</p><p>Her head lifted, and she saw him charge for the gunman. One twist, and he’d broken the man’s wrist. Cade grabbed the gun, and fired two quick shots at the two men coming from the second truck. They fell, screaming.</p><p>I know the feeling, assholes. Allison pushed her hand against the wound as she tried to stop the flow of blood.</p><p>Griggs just kept standing there with the stake clutched in his fist.</p><p>“You’re a fool,” Cade snarled the words at Griggs. He tossed the shooter against a tree. The guy moaned and fell to the ground. “You come out here, and you think a bullet’s gonna stop me?”</p><p>Griggs backed up a few steps.</p><p>Cade stalked after him. “Because you know about the supernaturals, you think that makes you some kind of bad ass slaying machine?”</p><p>Allison managed to get to her feet. She only swayed a little, and the blood was slowing, wasn’t it?</p><p>She blinked, and Cade had Griggs pinned against the truck. All of the men Griggs had brought with him were on the ground, moaning in pain.</p><p>Cade’s fingers, no, his claws, were at Griggs’s throat. “Come after me again,” Cade warned, “you’re dead. So much as look at Allison wrong...and you’re dead.”</p><p>Oh. Allison swallowed. He was protecting her again. If he didn’t watch it, she’d definitely start to think he had a soft spot hidden beneath those claws and fur.</p><p>“I’ll rip you open,” Cade continued, voice grim, “and cut your heart right out of your chest while you scream and beg for me to stop.”</p><p>Maybe not such a soft spot.</p><p>“Not get the fuck out of here,” he ordered. “And make sure every hunter in the area knows...stay away from what’s mine.”</p><p>Wait—hold up—did she qualify as his?</p><p>Cade stepped back from Griggs. Griggs hauled ass for his truck and his men, wounded, bleeding—their blood smelled sweet—limped after him.</p><p>The trucks roared away, fish-tailing it through the woods.</p><p>Slowly, Cade turned to face her. “Why?”</p><p>She lifted her hand and saw the blood on her fingertips. “Because you couldn’t die for me.”</p><p>He stalked toward her. “I wouldn’t have.”</p><p>Well, that seemed harsh. She’d saved his butt. Didn’t that count for anything in his mind?</p><p>His nostrils flared. “Wolves like the scent of blood.”</p><p>So did vampires.</p><p>He was almost upon her now, and she could see the sharp edge of his canines. “It usually makes us want to attack,” he said in that lethal voice of his.</p><p>Allison barely managed to swallow the lump in her throat as she looked up at him. Don’t attack. Down, wolf. Down.</p><p>He’d said his control wasn’t that good. She sure didn’t want him losing control right then.</p><p>His hands flew out and grabbed the edge of her t-shirt. He yanked the bloody fabric, ripping it. His breath hissed out. Or was that hers?</p><p>“The bullet’s still in you.”</p><p>Her knees almost buckled at that.</p><p>“It’s still in you...” His green gaze measured her, and he said, “and you’re on your feet.”</p><p>So she was. “I wanted to...help you.”</p><p>He just stared at her for a moment. His gaze searched hers. For what, she didn’t know. Then he shook his head. “Let me help you now.” And he picked her up, lifting her easily into his arms.</p><p>Maybe it was stupid, but she felt...safe...in those strong arms.</p><p>“This is gonna hurt,” he warned her as he carried her back inside the cabin. “But you can’t heal until that bullet comes out.”</p><p>Her head rested against his shoulder. It seemed natural to put her head against him. To let her body soften against the hard strength of his chest.</p><p>She took a deep breath and tried to ignore the pain lancing up her side. “You said...blood usually makes you want to attack.” Please, no attacks for the next, oh, hour or so. Not until she was back to better fighting form.</p><p>He slammed the door behind them and headed for the bedroom.</p><p>She wasn’t letting this one go. “Wh-what does my blood make you want to do?”</p><p>Cade lowered her onto the bed. He ripped away the rest of her shirt, leaving her clad in her black bra. His fingers slid up her side, a gentle touch that she hadn’t expected. A caress? That soft touch was almost enough to make Allison forget her question. Almost.</p><p>But having a werewolf so close to her when she was weak and bleeding...Focus. “Cade?” Allison breathed his name. What if the scent was too strong? What if his beast took control?</p><p>He looked up at her, and his green eyes were glowing with the power of the wolf.</p><p>Chill bumps rose on her arms.</p><p>“Your blood...the scent...” His jaw clenched, and he gritted, “It makes me want to kill.”</p><p>Not good.</p><p>“It makes me want to tear apart those bastards—to make damn sure that they can’t ever hurt you again.”</p><p>Her lips parted but Allison realized she didn’t know what to say.</p><p>“Now scream if you have to,” and his sharpened claws hovered over her wound, “because this is gonna hurt like a bitch.”</p><p>Chapter Four</p><p>She screamed.</p><p>The sound pierced right through him. The wolf howled inside of Cade, but his fingers were rock steady as he drove his claws into her wound.</p><p>His left hand pressed against her stomach, holding her in place on the bed, while his right hand dug into the torn flesh.</p><p>Tears leaked from the corners of her eyes, but after that first scream, she didn’t make a sound. He glanced at her, only for a moment, and saw that Allison was biting her bottom lip to hold back her cries.</p><p>Should have killed them.</p><p>Why the hell hadn’t he?</p><p>Because you didn’t want her to think you were a monster.</p><p>He found the bullet. Held tight to it and felt the burn on his flesh. Smoke rose from his fingertips and drifted from her body.</p><p>“C-Cade?” Her voice was soft and scared. “What’s happening?”</p><p>He pulled out the bullet. The flesh on his fingers was bright red and already blistering. He tossed the bullet onto the nightstand. “They used silver.”</p><p>Should have killed them.</p><p>Those bastards hadn’t just been after Allison. Elsa had sent the humans to take him out.</p><p>Allison’s wound began to close, right before his eyes.</p><p>“It feels...strange,” she whispered. “Tingling...”</p><p>Because the flesh was mending. She was so close to the change now, so close to becoming fully vampire, that her body had already prepared for the shift.</p><p>Vamps could heal from nearly any wound. Because they were such fast healers, they were often damn hard to kill.</p><p>There were only three ways to kill a vampire—fire, beheading, or a stake to the heart.</p><p>No wonder Elsa hadn’t come after Allison on her own. The witch literally wasn’t strong enough to kill her.</p><p>But I am. A werewolf’s claws were the perfect weapon to behead a vamp.</p><p>He realized that his fingers were caressing her stomach. Sliding lightly over the flesh. His gaze lifted, met hers.</p><p>Want her.</p><p>“You...protected me.” Who’d ever done that before? And why the hell had she done it? He’d told her that he’d been sent to kill her, and the woman had still gone ahead and take a bullet for him.</p><p>Why?</p><p>Allison stared back at him.</p><p>Fuck. He rose. Left the room.</p><p>“Cade?” Allison called after him. He liked it when she said his name. Liked it when she touched him. When her scent surrounded him. “Don’t leave,” she said, the words quiet, but he heard them perfectly.</p><p>His chest ached. “I’m not.” He went back into the room with a wet cloth held in his hands. She was sitting up now, and her breasts pushed against the cups of her bra. Damn fine breasts. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade’s cock shoved against the front of his jeans, but he yanked back the lust.</p><p>For now.</p><p>Carefully, he put the wet cloth over her side and washed the blood off her skin. Creamy, smooth skin. The wound was all but gone. Vamps and their amped up healing powers. She’d have no scar to bear, not like him.</p> <p>Scars covered far too much of him.</p><p>He glanced up and found Allison staring at the scar that sliced down his cheek and curled under his jaw. Cade’s back teeth clenched.</p><p>Then she lifted her hand and touched the rough skin. “What happened to you?”</p><p>Sympathy. Pity. He didn’t want either from her. He tossed the cloth unto the nightstand. It covered the bullet. “Nothing I couldn’t handle.”</p><p>He expected her to drop her hand. She didn’t. Just kept right on touching him, and the lust that he’d tried to hold back grew stronger with every second that passed.</p> <p>Her heady scent filled his nose. Her body was so close, waiting for him. And she was touching him. Stroking his cheek. Staring up at him with those big, blue eyes.</p><p>She knew how dangerous he was. The lady should be hauling ass away from him.</p><p>Not—</p><p>“Tell me.” Her words were husky, whispered, and they slid right over his flesh better than any silken stroke.</p><p>Fine. Not like it was some deep, dark secret. His story had been talked about in bars. Whispered in the woods. “When I was fourteen, vamps attacked my pack.”</p><p>Her hand stilled on his cheek. Her eyes didn’t look away from his.</p> <p>“I was too young to shift, but too damn big to be seen as anything other than a threat that they had to eliminate.” He’d always been big. But being big didn’t matter when you were up against a vampire’s enhanced strength.</p><p>“Before they got around to that eliminating...” He exhaled and remembered the scent of burning flesh. “They thought it would be fun to torture me.”</p><p>He saw the delicate movement of her throat as she swallowed. “Your face.”</p><p>Cade couldn’t help it. He laughed at that. Then he rose and made sure the light fell on his body. There would be no shadows to hide him any longer. He hadn’t taken the time to put his shirt back on before heading out to face Griggs and his gang. No shirt to cover him. No darkness to cloak the old wounds. “Sweetheart, my face was just the start.”</p><p>He turned around, real slow, making sure she had time to see all the marks that twisted his flesh.</p><p>Nothing nice or neat about him. The vamps had used silver knifes to peel away his skin. Then they’d used liquid silver to burn his muscles. To burn and burn until agony had been all he’d known.</p><p>He kept his back to her and stared straight ahead at the wall. The vampires had been laughing as he screamed.</p><p>“But I stopped them,” he said, still remembering. Still seeing. “I got out of the chains.” Out of the silver that had held his wrists so tightly. “At the first light of dawn, when they were weak and I was strong, I got out, and I killed every one of those fucking bloodsuckers.” With the claws that had finally sprang from his fingers. The pain, the fury—something had brought on the change in him. The wolf had burst to the surface that blood-soaked day, and his claws had ripped into his prey.</p> <p>“But it was too late for the others in my pack,” he said. Far too late. “Everyone else was dead.” Tossed aside. Broken.</p><p>He’d never joined another pack. What was the point? To grow close to them, to care, only to wind up one day watching them all die in another attack?</p><p>He didn’t need anyone else. Didn’t want anyone else. It was far better to be alone.</p><p>When Cade felt the light touch on his back, he stiffened. Not fingers on his skin—the touch was too soft. That was—</p><p>Allison was kissing his back. Kissing the marks left by torture almost twenty years ago.</p><p>He spun around and caught her shoulders. “Don’t.”</p><p>She didn’t look afraid. She should. The wolf was far too close to breaking free. “Why not?” she asked him, staring into his eyes and he found he couldn’t look away. “You took care of me...why can’t I take care of you?”</p><p>“Because I don’t want your damn pity!” His words weren’t loud. Lethally soft.</p><p>“Pity isn’t what I want to give you.” Then she pulled from his hold, far too easily.</p><p>Barely human now. The vampire transformation was so close. Did she realize it?</p><p>Allison straightened her shoulders, and then she reached behind her back. He heard a soft snick and her bra slipped to the floor.</p><p>“I know what’s happening to me.”</p><p>Shit, were those tears in her eyes?</p><p>“I can feel the change. I mean, I just instantly healed from a freaking bullet wound. I know, okay? I know what I’m becoming.”</p><p>Some would say that she was becoming a monster.</p><p>Just like him.</p><p>“I know what I’m becoming, but I don’t know what will happen to me when—” She broke off and shook her head. Her breasts pointed up toward him, the nipples tight and hard and a pretty pink.</p><p>Want to taste.</p><p>His cock was so hard that it hurt. He wanted in her.</p><p>“I don’t care what’s going to happen tomorrow. I just care about right now.” Her hands dropped to the front of her jeans. They were undone. He’d undone them in his frenzy to repair her wound. “Right now, I want you.”</p><p>That was all he needed to hear. Before she could say anything else, before he could think of a reason why this was wrong, Cade had her flat on the bed. His body trapped hers, and his mouth tasted one sweet breast. And it was sweet. Sweet and tight and perfect in his mouth.</p><p>Perfect.</p><p>Her hands slid over his back. He didn’t tense when she touched his scars. Didn’t try to pull her hands away from the marks he’d always carry.</p><p>He just sucked her breast harder. Lapped at her nipple. One, then the other. His hands shoved down her jeans and yanked her panties away.</p><p>She wanted him.</p><p>He didn’t know how the hell he’d gotten that miracle, but he wasn’t about to turn her away.</p><p>In that moment, there wasn’t a single force on earth that would have made him leave her.</p><p>“You want him dead, witch?” Griggs swiped the blood from his nose as he glared at Elsa. “Kill him your own damn self. We’re not goin’ back. Not facin’ that fuckin’ freak again.”</p><p>Elsa glared at him and his worthless bunch of humans. These were supposed to be hunters? More like whipped puppies. “One man,” she snapped. Her hands flattened on the table. Her mirror, the scrying mirror she’d used since her eighteenth birthday, gleamed upon the table’s surface. “You let one man defeat all of you?”</p><p>“Not a man.” Griggs spat blood on the floor. “Werewolf.”</p><p>“Werewolves can die.” Everyone and everything could die.</p><p>“You’re on your own.” Griggs turned away.</p><p>Her hands fisted. “I’ll double the money!” She was running out of time...and options. Vampires were closing in. They were already in the city. It wouldn’t be much longer before they found Allison.</p><p>Griggs hesitated. Greedy bastard. Sometimes, humans could be so predictable. Elsa started to smile.</p><p>“That guard dog she’s got...” Griggs glanced back over his shoulder and shook his head. “If we go back, he’ll kill us all.”</p><p>She could almost smell his fear. Rancid.</p><p>“You’re on your fucking own.” He stormed out, taking his men with him. Their thudding footsteps blended with the wild racing of her heart.</p><p>No, no, this couldn’t be happening. Not to her.</p><p>Elsa grabbed her knife. One quick slice over her arm and she had blood dropping onto her mirror. With her index finger, she slid the blood over the mirror’s surface as she chanted.</p><p>The image came to her, not slow and blurry, but fast and crisp.</p><p>Her future hadn’t changed.</p><p>The full moon hung in the air. Allison stood over her, with her vampire teeth barred. Allison’s eyes were wild, and blood dripped down her chin.</p><p>Elsa stared at the image. No change. Allison would still kill her in just a few days time. When she changed, when she became fully vampire, Allison would come after her.</p><p>“I’ll kill you first,” Elsa whispered. That’s why she’d first sought out Allison. Because of the death vision. She would change that vision.</p><p>She had to.</p><p>Elsa wasn’t planning on dying for some vampire bitch. Allison would be the one to die. She’d be the one to bleed and beg and scream and die.</p><p>“Not me,” Elsa said as she reached for the knife again.</p><p>She just had to find a way to hit the vampire’s weakness. Everyone had a weakness, even a pureblood vampire.</p><p>You’re the one who’ll die.</p><p>Chapter Five</p><p>Allison’s breath heaved out as she stared up at Cade. His arms were on either side of her body, his hands pushing down into the mattress as he caged her in place.</p><p>Lust and stark need etched hard lines onto his face, and his broad shoulders seemed to block out the light around them.</p><p>She was naked beneath him. Naked...and she could see the sharp edge of his teeth.</p><p>And the glow of the beast that lit his eyes.</p><p>Maybe she should have been afraid then.</p><p>But her head lifted and she met him in a hot, open-mouthed kiss. Her tongue slipped inside his mouth and tasted him. The werewolf’s power wasn’t scaring her.</p><p>It was turning her on.</p><p>Her hand fisted in his hair as she pulled him closer. Allison had enjoyed a handful of lovers in her life. The first few had been fumbling, the others more skilled.</p><p>Yet right then, she couldn’t remember any of their names. Couldn’t pull up their faces.</p><p>Only Cade.</p><p>She sucked on his lower lip. Heard his growl and felt her body tense in anticipation.</p><p>This wasn’t going to be some gentle ride. No sweet release.</p><p>Good. She wanted fire and passion. Wild pleasure.</p><p>Him.</p><p>Her lips slipped from his, and Allison kissed her way down his neck. His pulse raced beneath her lips, thudding in time with his heartbeat.</p><p>Blood.</p><p>She licked him. Bit lightly.</p><p>Blood.</p><p>Allison turned her head away, squeezing her eyes shut as she fought the dark impulse to drink from him. That wasn’t what she wanted. She wanted—</p><p>The bed shifted as he moved, sliding down her body. His fingers were rough, strong, as he pushed her thighs apart. Then those fingers were sliding up, stroking right over the core of her need, and a gasp broke from Allison’s lips.</p><p>“Look at me,” his growl.</p><p>Slowly, her eyes opened and her head turned toward him.</p><p>“What do you see...” His fingers pushed inside her. Stretched her. Thrust and made her want more. “When you look at me?”</p><p>She saw the man she wanted.</p><p>“Monster?” His fingers withdrew. Thrust deeper. Her hips lifted helplessly against him as she arched off the bed. “Or man?”</p><p>Allison licked her lips. “Man.” But what did he see? When he looked at her what—</p><p>“And I see the most fucking beautiful woman I’ve ever met.” He pulled his hand back. Yanked open his jeans and positioned his cock at the entrance of her body. “Beautiful.”</p><p>He made her feel that way.</p><p>“I’m safe,” he told her, voice rough and deep as he fought to hold his desire in check, and his gaze seemed to burn even brighter. “Werewolves can’t carry any diseases. Neither can vamps.”</p><p>She already knew that, just as she knew pregnancy wasn’t a risk for her, not then. Could a vampire and a werewolf even have a baby together?</p><p>Cade waited at the entrance of her body. She felt the broad shaft of his cock and she wanted him inside but...</p><p>“No fear,” he told her.</p><p>Allison shook her head. She didn’t fear him. Right then, she just wanted him. “Now, Cade. Now.”</p><p>Her wolf smiled and drove into her. He filled her, so full and thick, and Allison realized that she’d forgotten to breathe. He stilled for a moment, letting her adjust, and when she tightened around him, wanting more, Cade withdrew—then thrust in again, harder.</p><p>Her nails dug into his shoulders. She wanted hard. Wild. Him.</p><p>Each slide of his flesh sent need twisting through her. Her sex was so sensitive, stretched, eager.</p><p>Pleasure beckoned just out of reach.</p><p>The bed squeaked in time with their rhythm. Thrust. Withdraw. Thrust. Stronger each time. Deeper. Wilder.</p><p>Allison laughed. It just felt good. He felt good. Her nails dug deeper. Her legs wrapped around him, pulling him closer.</p><p>Cade’s mouth was on her neck. No, not her neck, but right at the curve of her shoulder. She could feel the edge of his teeth.</p><p>Maybe she wasn’t the only one who liked to bite.</p><p>And...and she liked the feel of his teeth. Allison tilted her head back and pushed harder against him.</p><p>Harder.</p><p>The climax hit her, slamming right through her body so that her breath choked out and pleasure rocked her. Not gentle. Not easy. So fierce that the room dimmed. Aftershocks trembled through her sex as ripples of release tightened her around him.</p><p>And Cade came. She felt the hot release inside of her even as his teeth nipped at her shoulder. He shuddered and his hands held her so tight.</p><p>As if he’d never let go.</p><p>His heartbeat raced. She could feel it against her. Drumming far faster than hers ever could. He was so warm around her. Warm and strong and solid.</p><p>In his arms, she was safe. Nothing could hurt her. No one.</p><p>Not while she was in his arms.</p><p>He pressed a soft kiss to her shoulder and lifted his body as he stared down at her.</p><p>She didn’t want the moment to end. Not yet. Allison didn’t want to talk. Didn’t want to worry about what or who would be coming for them next. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Right then, she just wanted to pretend that the rest of the world didn’t matter. Just a man and woman—that’s all they were.</p><p>No monsters.</p><p>No darkness.</p> <p>Just a man.</p><p>She pressed a kiss to his chest.</p><p>And a woman.</p><p>Cade began to thrust again.</p><p>She was gone. Cade knew he was alone even before his eyes opened. The bed felt cold. Allison’s scent was weak, barely hanging in the air.</p> <p>She was gone.</p><p>Growling, he jerked up in bed. The woman never should have been able to give him the slip. If he hadn’t spent half the day screwing her until he fell into an exhausted sleep, she damn well wouldn’t have gotten away.</p><p>He leapt from the bed. Didn’t she know how dangerous it was out there?</p><p>She needed him.</p><p>And he...fuck it, he wasn’t letting her get away from him. He grabbed his jeans, yanked them on, and followed the faint trail of her scent in the air. Roses.</p><p>He threw open the screen door, and it banged against the side of the cabin. She hadn’t taken the motorcycle. That was something. But then, he’d taken the liberty of hiding the keys.</p> <p>His head turned slowly, and he stared at the thick line of trees. At the mountains that waited.</p><p>She’d gone off alone. Fuck.</p><p>Didn’t she realize? There was no place that she could go—no place that he wouldn’t follow.</p><p>He’d had one taste, and he wasn’t about to let his little pureblood go.</p><p>Elsa stood in the clearing, smiling. Her mirror had shown her just what she needed to see—Allison, running. Allison, scared and desperate.</p><p>The fool didn’t fully understand what was happening to her body. She didn’t know about vampire weaknesses.</p><p>She was about to find out. And a vampire running in the day...she might as well be human. Elsa could take out a human any day of the week. She’d been wrong to think that Allison was too powerful for her to handle alone. She could destroy the pureblood vamp. She would.</p><p>Elsa lifted her arms and called forth her magic. The spell of fire was always the first mastered by her kind. The first, and the most powerful.</p> <p>The flames began to spread to the trees around her. The fire leapt from branch to branch, jumping through the forest. Soon, the fire would sweep out into a giant circle that would surround the fleeing vamp-to-be.</p><p>Surround Allison and trap her. The fire would close in. Slowly. Slowly.</p><p>The wolf had done his job after all. He’d lured Allison from the protection of the city. Got her into the wilderness where she was helpless. And soon...</p><p>Soon the fire would take her.</p><p>Elsa would make sure she stayed close enough to hear the bitch’s screams.</p><p>The scent of smoke reached her, thick, cloying, and Allison froze. Her heart thudded wildly in her chest, pounding hard enough to shake her.</p><p>She turned slowly. The smoke...it was coming from the right. Allison could see the dark streak of gray in the sky. A forest fire? Hell, that couldn’t be—</p><p>Flames crackled. But that crackling came from behind her, to the left.</p><p>Her gaze jerked toward the sound.</p><p>More smoke. More fire. And that blaze looked like it was racing right toward her.</p><p>No...no...</p><p>“Allison!” The roar was her name. A roar loud enough to push across the crackling fire. “Allison!”</p><p>Cade was coming for her.</p><p>She spun around, seeing only smoke and fire now. So much. Too thick. She began to cough. This...wasn’t right. The afternoon had been fine moments before. Clear. Calm. She’d been the one running wild and—</p><p>“Allison!”</p><p>She choked, but managed to cry out... “Cade!” And, oh, damn, was that fire racing toward her?</p><p>She jumped back, barely avoiding a wild surge of heat. The fire was so close now. It seemed to be heading right for her.</p><p>Because it was. Understanding was like ice in her veins.</p><p>Freaking witch.</p><p>There wasn’t anywhere to run. The flames were all around her. No, not just around her.</p><p>Allison screamed when fire licked its way up her arms. She dropped to the ground, rolling and slapping at the flames. But more flames just came, burning her, burning...</p><p>“I’ve got you.”</p><p>She was still screaming so she barely heard the words. He had to tell her three times, then Allison managed to glance up.</p><p>Cade was there, pulling her against his chest. And it hurt. She hurt. Deep blisters covered her skin, and the smell of burnt flesh—her flesh—had her stomach rolling.</p><p>“Hold on,” he told her as he rose, tucking her body close against his. The movement hurt, but she locked her teeth to hold back the cry.</p><p>A wall of fire blocked them. There was nowhere to go. No—</p><p>He bent his head over hers. Curved his body so that he was covering her, and he leapt right through the flames.</p><p>Allison heard the rush of the fire—a wild whoosh of sound—and the burning breath of the flames blew over her body.</p><p>Then they both hit the ground. They fell in a tangle of limbs, spinning, rolling, falling down a hill. Faster, faster.</p><p>She didn’t feel the bumps. Didn’t feel the bruises. But when they fell into the too-chilled water of a lake, oh, sweet hell, yes, she felt that.</p><p>And she just sank beneath that cold water. Her eyes wanted to sag closed. Why was that so wrong? She’d rest a few moments in the sweet cold, then everything would be fine.</p><p>Something grabbed her. Her eyes flew open. Through the murky water, she could just make out Cade’s form. He looked furious, his eyes glowing. His hands wrapped around her shoulders, and he pulled her toward him. A powerful kick from his legs sent them shooting toward the surface. Allison couldn’t get her own legs to move and was grateful for her wolf’s strength.</p><p>And it was only when they broke the surface and when his gasps for breath filled her ears that Allison realized...</p><p>I’m not breathing.</p><p>Chapter Six</p><p>Fuck, fuck, fuck no.</p><p>Allison’s eyes were wide open. Staring straight at him, but the woman wasn’t seeing him. She wasn’t breathing. Her body was ice cold.</p><p>A shudder shook his frame as Cade lowered her to the ground. “Come on, sweetheart,” he muttered as he pushed back her wet hair and ran his fingers over her face. “Breathe for me.”</p><p>Blisters and deep burns covered her forearms and hands. Her legs had fallen victim to the fire—he’d seen the wounds.</p><p>So much pain.</p><p>Too much.</p><p>She wasn’t breathing.</p><p>He wasn’t letting her go like this. Not like this.</p><p>He put his mouth to hers. Damn she was cold. Her lips were like ice against his.</p><p>Cade blew into her mouth. Take my breath, sweetheart. Take it.</p><p>Nothing.</p><p>He gave her his breath again. Come on, Allison. Don’t leave me.</p><p>He pushed air into her mouth once more.</p><p>And she jerked beneath him. His head lifted and he stared down at her, desperate, wild.</p><p>She’d coughed up water and seemed to be breathing now. Her eyes actually saw him. But she was still so icy. So pale.</p><p>And hurting so much.</p><p>His canines had stretched when he’d first caught the scent of smoke. The wolf within had known that danger stalked Allison. His claws had come out, his teeth had prepared to rip and tear—he’d been ready to do anything in order to protect her.</p><p>Anything.</p><p>He lifted his hand and slashed his wrist with his teeth.</p><p>“C-Cade?” Her voice was a broken whisper. “Why...don’t hurt...”</p><p>He put his wrist to her mouth. “Drink.” Because if she didn’t, he could still lose her.</p><p>Allison shook her head. “N-no.” Her body shook, trembling hard, and he knew shock when he saw it.</p><p>Fire was a particular bitch for vampires. They burned far faster than humans. Faster than any of the other paranormals.</p><p>But you knew that, didn’t you, Elsa? He had to deal with that witch. Payback.</p><p>After he made sure Allison wasn’t checking out on him. “Take it,” he ordered, staring into her eyes. The gold was almost gone now, never a good sign with a pureblood vamp. It meant her body was too depleted.</p><p>But she turned her head away. “I...can’t. I don’t want to be...”</p><p>A vampire.</p><p>Screw it. “No changing what we are.” He knew the scent of his blood had to be driving her crazy. He’d seen her nostrils flare. Oh, yeah, she liked that scent. “So either drink or die.”</p><p>Her head slowly turned back toward him. He could see the fear in her gaze. And the desperation.</p><p>He could also see that just beneath her too-pale lips, her fangs were growing.</p><p>With every second that passed, Allison lost her mortal self. Before his eyes, she was becoming more.</p><p>Vampires are the enemy. That had been his line for years. Parasites. Good only for killing.</p><p>Slowly, her mouth pressed against his wrist.</p><p>The only good vamp...</p><p>She didn’t look like a parasite.</p><p>Is a staked vampire.</p><p>Her tongue slipped out and licked the blood. Her eyes were open, on his. At the first taste of his blood, he heard the sharp inhale of her breath.</p><p>She likes it.</p><p>She licked up another drop of blood.</p><p>Her eyes were still on his.</p><p>But...</p><p>A tear streaked down her cheek. Not a blood tear, and usually those were the only tears a vampire could shed. Allison still shed human tears as she took his blood.</p><p>“More,” he whispered because she hadn’t taken enough blood to heal her wounds. Not even close.</p><p>Her mouth pressed harder against him and when he felt the scrape of her teeth, Cade expected the memories to slam into him. Another bite, another time.</p><p>Torture.</p><p>Screams.</p><p>Hell.</p><p>But...but he only saw her. Saw the gold come back into her eyes. Saw the wounds begin to fade from her body. He didn’t feel like prey.</p><p>Her mouth on him—damn, it felt good.</p><p>No pain. A pleasure he’d never expected to feel from a vampire’s bite.</p><p>Fuck. He was getting turned on while a vampire fed from him.</p><p>Her teeth sank into his wrist. She sucked harder and damn if his cock didn’t swell even more.</p><p>The rush of pleasure had his breath panting out. This wasn’t just about saving her any longer. Now he was the one who wanted more.</p><p>Cade hadn’t gotten enough of Allison when he’d had her in that bed beneath him. Maybe he’d never get enough.</p><p>His hand tunneled in her hair. Not to force her away from his wrist, but to hold her against him. To make her take more.</p><p>When she licked him again, it was like a shot of pleasure right to his cock.</p><p>Want.</p><p>But not there. He forced his head to lift, and he gazed at the smoke billowing above them. That witch was out there, she could come at them anytime, she could—</p><p>“Cade.” Allison’s voice wasn’t weak now. Her glanced back at her. She’d pushed against him, let go of his wrist, but she stared at him with hunger in her eyes.</p><p>Not hunger for blood.</p><p>Lust.</p><p>For vampires, those two needs could intertwine so easily. That was why some vamps and their fancy-ass vamp councils had started to spread the PR in the paranormal world about their kind not taking directly from living prey.</p><p>Like he bought that bullshit.</p><p>Her tongue swiped over her lips. Dark red lips. The burns were already gone from her body. The woman was gonna make one dangerously powerful vampire.</p><p>No, not make. She already was powerful.</p><p>Her hand rose. Touched his lips. “I want you.”</p><p>And he wanted to be buried in her as deep as his cock could go.</p><p>But first... “We need to get out of here.” Because he could hear sirens coming. Like anyone could ignore a blaze this size. The humans would rush in and fight the flames. Their trucks were already so close that his ears picked up the hard growl of the approaching engines.</p><p>If he let Allison stay there, the witch could try again with her fire and fury. The humans could get caught in the cross-fire.</p><p>He gazed down at Allison. Her dark hair was wet around her, and her clothes clung tightly to her body. A body he’d learned so well with his hands and mouth.</p><p>A body he’d know again.</p><p>“Come on...” He pulled Allison to her feet. Watched her carefully. After her first feeding, he wasn’t sure what to expect. Her standing there, looking increasingly lost...that wasn’t it.</p><p>He pulled her close. “I’ve got a back-up motorcycle stashed close by. Don’t worry.” His lips pressed a quick kiss to her temple.</p><p>And he froze.</p><p>Shit. Shit. What was happening to him? How could he care so much about what might happen to a vampire? About how she might be feeling for fuck’s sake?</p><p>His back teeth clenched.</p><p>Screw it. He kept a tight grip on her arm and raced for the hidden motorcycle. He jumped on the bike, and she climbed on behind him, sliding close and putting those never-ending legs of hers alongside his. When the engine roared to life, they leapt forward, driving fast and hard through the woods. With every minute that passed, Cade realized just how dangerous Allison truly was to him.</p><p>Dangerous...because she could make him care.</p><p>Sonofabitch.</p><p>Something was wrong with her. Very, very wrong.</p><p>It wasn’t just the drinking blood bit. Oh, hell, she’d actually done that. The blood should have revolted her.</p><p>Instead...</p><p>It had tasted better than any champagne she’d ever had.</p><p>Cade’s blood had been so good, and it had made her hungry.</p><p>For him.</p><p>She ached. Her nipples hurt, wanting his touch so badly, and with every vibration of that motorcycle...</p><p>Cade.</p><p>Allison wanted to scream with the frustrated need building so wildly inside of her. This wasn’t normal. This wasn’t right.</p><p>And her fangs hadn’t gone away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her fangs were out and her fingernails had sharpened up like mini-claws.</p><p>Cade parked the motorcycle in front of what looked like your average no-tell-motel. She followed him quickly to the front desk, wondering about the fierce looks he kept sending her.</p><p>Did he realize that she was barely keeping it together? That she was seriously considering throwing the guy down on the ground and jumping him?</p> <p>What is wrong with me?</p><p>She’d never been like this.</p><p>The balding guy behind the counter didn’t even give them a second glance. So what if she was still wet and her clothes were mostly burned? He just scooped up Cade’s money and tossed them a key. About thirty seconds later, they were entering room number 16, and Allison was trying hard to hold onto her control.</p><p>The door clicked shut behind them.</p><p>Want.</p> <p>The whisper in her mind didn’t even seem to be her own. It felt too strong. Too dark.</p><p>Her eyes squeezed shut. “This isn’t me.”</p><p>The floor creaked as Cade stalked closer. “It’s who you’re gonna be.”</p><p>“Don’t.” The word was a snarl, but this was wrong. Her claws, her teeth—she could hurt him. If he touched her, Allison’s control would shatter.</p><p>Can’t hurt him.</p><p>But she had to get herself under control. Had to quench the fire that was building—</p> <p>Her eyes flew open. Without glancing at Cade, Allison lunged across the room. She rushed into the miniscule bathroom and yanked on the shower’s cold water. That was what she needed. A good, cold shower and everything would be fine again. She’d cool down. Pretend she was back to normal and everything would be fine.</p><p>Her burnt clothes hit the ground. Naked, she stepped into the shower. The water hit her, hard and stinging and—</p><p>Cade’s hands wrapped around her shoulders. He turned her around as that pounding water slid over her flesh.</p><p>He’d shed his clothes and he stood before her, naked. He stepped into the shower.</p><p>Fighting herself, she backed up. Allison could feel her control splintering and she knew, right then, she knew that she was becoming someone else.</p><p>Something else.</p><p>In an instant, she grabbed Cade and pushed him back against the rough tiled wall. “Don’t.” She barely managed to speak. “I can hurt you.” Her words were close to an animal’s growl.</p><p>But her werewolf laughed. “Ah, sweetheart, trust me on this...I can handle you.”</p> <p>He broke her hold. Took her mouth in a kiss that made her sex clench and her knees tremble and suddenly she was the one with her back pressed against that tile.</p><p>He’d reversed their positions so fast she barely had time to blink. Her back was against the tile. He’d lifted her up effortlessly, and he held her in his rock-hard embrace.</p><p>His mouth was on her throat. Licking her, sucking her flesh.</p><p>His cock pushed at the entrance of her body.</p><p>In.</p><p>His teeth scored her flesh and she shuddered in hungry arousal. “Cade!”</p><p>The water pounded down on them. He drove into her. She gasped as he filled her, stretching her body, only to withdraw seconds later and thrust in deeper, harder than before.</p><p>Again and again.</p><p>Her legs wrapped around his hips. Her hands slid over his slick flesh. The water didn’t seem so cold anymore. Not when he was burning hot against her.</p><p>Allison’s teeth began to burn, stretching and sharpening in her mouth. She wanted to bite him. To taste that delicious blood once more.</p><p>She clamped her lips together and arched her hips against him.</p><p>No, no she could be just a woman. She could—</p><p>He pulled back a bit, kept her pinned. Then took her breast in his mouth. Her nipples were so sensitive that the rough lick of his tongue had her moaning.</p><p>Her nails raked over his skin. He growled, and she caught the scent of blood.</p><p>Her eyes widened in horror when Allison realized that she’d scratched open his skin.</p><p>Cade’s head lifted. His thrusts stilled as his cock filled her. Her sex clamped around him, sensitive, eager for the pleasure that would come. His gaze held hers, and she wondered if he’d pull away.</p><p>“Go ahead,” he told her, voice deep, dark, and rumbling, “bite me.” A dare.</p><p>Then he withdrew...drove deep.</p><p>She bit him. On his neck this time. Hesitant at first because she didn’t really know what the hell she was doing, but her sharpened canines figured it out fast. They sank right through flesh and his blood slid onto her tongue.</p><p>She came at that first taste, her body shuddering with the blasts of pleasure that had her holding him as tightly as she could.</p><p>But Cade wasn’t done with her. Not yet. He kept thrusting. Stronger, wilder, and the feel of his cock sliding in and out of her sex had pleasure sweeping through her again.</p><p>Allison licked gently over the small wound she’d made on his neck. Shame lurked inside of her, but she wouldn’t feel it, not then. Then she only wanted the pleasure and him.</p><p>Her gaze met Cade’s.</p><p>“My turn.”</p><p>Allison’s lips parted. “What—”</p><p>He carried her out of the shower. Not withdrawing from her, but filling her as he strode back to the bed. They fell on the mattress, both soaking wet, and rolled in a tangle of limbs. Cade rose above her, and there was no mistaking the hungry lust burning in his gaze. “You’re not the only one who likes to bite.”</p><p>Her own eyes widened even as she reached for him.</p><p>His mouth closed over her flesh, right there, where the curve of her shoulder met her neck. She didn’t know what she expected but—</p><p>His teeth pressed into her flesh, and the Allison that she was becoming—the woman who tasted blood and climaxed—her breath whispered out in anticipation.</p><p>Cade bit her. Not to drink, not like she’d done before with him. This seemed...different. More of a marking.</p><p>Claiming?</p><p>Then she stopped worrying about bites and differences and just enjoyed the feel of his cock within her.</p><p>This time, when she came, he was right with her. Growling out his pleasure and holding her even tighter than she’d held him.</p><p>In that one moment, she didn’t care about what she was becoming.</p><p>She didn’t really give a damn about anything else but him.</p><p>Elsa stared into her dark mirror. It wasn’t showing her anything now. No past. No present. Nothing.</p><p>Her hand slammed into the glass surface. It cracked beneath her palm, tiny, spider-wed like cracks that rippled across the surface.</p><p>Allison wasn’t dead. Because of that asshole wolf. He’d given her shelter. He’d protect her. Gotten her ass out of the fire.</p><p>He should have been the one to kill Allison. Not to keep her alive. What use was an assassin if he couldn’t fucking kill anyone?</p><p>She lifted her hand, not caring about the drops of blood that flew from the scratches on her palm. All the supernaturals in the area knew just what Cade Thain was. They knew how much he hated vampires.</p><p>But, now, unless she missed her guess, he was fucking one. Why else would he keep Allison alive?</p><p>Why else?</p><p>A loud crash sounded behind her. Elsa didn’t move. She just kept staring into her broken mirror. Footsteps pounded up the staircase</p><p>“Where is she?”</p><p>So the vampire had finally found her home. He must be mighty pissed if he’d come out hunting in the daytime. He could have waited. Dusk was only an hour away.</p><p>Elsa didn’t answer him. She didn’t want to look away from her mirror. She didn’t—</p><p>A snarl hung in the air, and, in the next moment, she hung in the air, held up by the vampire’s grip on her throat. The big, blond vampire shook her like she was a rag doll and if he hadn’t been choking her, Elsa would have laughed right in his face.</p><p>“Where is she?” he demanded.</p><p>Elsa knew this vampire. Charles Crawford. A vamp who’d been walking the earth for over two hundred years.</p><p>A vamp who’d been tracking Allison for weeks.</p><p>He knew what she was. Vampires could always sense when a pureblood turning was at hand. And Allison had been right there in the city with the guy just nights before. No wonder he’d almost caught her in that alley.</p><p>Would have caught her, if Cade hadn’t plunged his claws into Crawford’s throat. Yes, her mirror had shown her that truth, too late. It hadn’t been Allison’s blood dripping from that alley’s walls the first night. Cade had attacked Crawford.</p><p>She smiled.</p><p>Crawford’s eyes narrowed. “What have you done?”</p><p>His hold eased, just enough for her to speak. “N-not me.” Her smile widened even more. “Werewolf.”</p><p>“That bastard? He still has her?”</p><p>“Gonna...kill her.” And the perfect plan hit her. “Unless...” Her breath heaved out as she studied the vamp. Maybe he could get the job done for her.</p><p>Wouldn’t that be fitting?</p><p>“Unless what?” he snapped. Poor vampire. With the werewolf hiding Allison in the woods, he wouldn’t have been able to catch her scent anymore.</p><p>And he’d be wanting to find the lost pureblood very badly. Purebloods were the favored in the vamp clans.</p><p>Elsa tried to appear careless as she said, “He’ll kill her...Unless you can kill him first.”</p><p>Now that bit had Crawford stepping back. “Tell me where the wolf is, and he’s dead.”</p><p>Elsa rubbed her throat and glanced back at her broken mirror. She saw nothing, because there was nothing left to see.</p><p>The end was coming.</p><p>It won’t be my end. It won’t. Crawford could take out the werewolf, and she would find a way to kill the pureblood.</p><p>“Don’t worry,” she told the vampire. “You won’t have to wait long.” Not long at all. “When night falls, he’ll come here. To you.”</p><p>She didn’t need her mirror to know that. Cade wouldn’t wait for her to attack again. She’d studied him. Learned his habits before she approached her would-be killer. No, he wouldn’t sit back and wait for another attack. He’d come after her.</p><p>And find a vampire waiting to kill him.</p><p>Chapter Seven</p><p>Vampires tore into her flesh. They cut her with gleaming silver blades, and they licked her blood from the edges of their knives. They laughed when she screamed.</p><p>And they tortured her even more.</p><p>They chained her and poured liquid silver onto her back, just so they could hear her screams.</p><p>And Allison did scream. Over and over as her flesh burned away.</p><p>She looked up, staring straight at the bastards who loved her pain, and something broke inside of her. Broke, even as the chains holding her arms broke free, and she lunged forward with a strength born of fury.One swipe, and she cut the head off the nearest vampire. She drove her claws into the throat of another. And as they fell, this time, she was the one who laughed.</p><p>“Allison!” Hard hands grabbed her, shook her.</p><p>Her eyes flew open, and Allison found herself out of that dank pit. The peeling walls of the hotel room surrounded her. She was on the bed. With Cade.</p><p>The man seemed to always be saving her from nightmares. But then, it wasn’t like she was the sweet dream type.</p><p>Always nightmares.</p><p>Sweat covered her, and she could still smell the scent of her own burning flesh.</p><p>Only, it hadn’t been her flesh that burned. Not really. Her trembling fingers lifted and touched the rough scars that marked Cade’s face.</p><p>His pupils widened when she touched him. His hold on her gentled, but he didn’t let her go.</p><p>Why not? Her hand fell away. How could he stand to have her near him? Those other vampires had tortured him for hours, days, and they’d drank his blood.</p><p>Just like she had.</p><p>“I’m sorry.” Her stark whisper.</p><p>Cade frowned down at her but there wasn’t surprise on his face. Just a kind of angry understanding. “The blood,” he said. “Fuck, how did I forget that? Vamps don’t just take blood, they take memories, too.”</p><p>Allison flinched. “I-I didn’t—” What? What was she supposed to say? That she hadn’t meant to steal his memories? That she hadn’t meant to drink his blood?</p><p>She had meant to do it.</p><p>Allison realized she was still naked. It hadn’t mattered before, not when she’d wanted the press of his flesh against her more than she’d wanted anything else. But at that moment, she felt...lost.</p><p>She pulled free of him and yanked the sheet up to cover her breasts. Taking a breath, she asked the question that she feared, “Am I even human any longer?” She didn’t feel weak. In fact, her body seemed incredibly strong right then. No blisters, no wounds. Only healed flesh.</p><p>Her heart was still beating. She still breathed. But she’d taken blood. Grown fangs. Her own version of claws.</p><p>“You were never human.”</p><p>His words hurt as much as a slap would have.</p><p>Allison jumped from the bed, dragging the sheet with her.</p><p>“You were born a vampire, it just took a little while for the DNA to kick-in.” His voice followed her, cold, no emotion. There’d been plenty of heat in the daytime hours. But with night, all of that seemed to have vanished. “It usually takes about twenty-five years of life, maybe a few years more, before the vamp side takes over for a pureblood.”</p><p>“Why?” She needed to learn all that she could. No more denying. No more hiding.</p><p>Deal with this.</p><p>“Because the vamp genes freeze the body at its peak. They keep you strong and young, forever.”</p><p>“Forever...” Or as long as she kept drinking blood. As long as she didn’t lose her head or get staked.</p><p>Or die in a fire set by a sadistic witch.</p><p>“You’ll keep breathing,” he told her, and she glanced back to see him pulling up his jeans. Sexy. “Your heart won’t stop. That only happens to the turned humans, and only for a little while. You were born this way...you’ll stay this way.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She felt something wet on her cheek. Allison swiped the back of her hand over her face, and when she looked down, blood stained her fingers.</p><p>Humans didn’t cry tears of blood.</p><p>“Wh-what about you?” She hated to ask, but she had bitten him, and he’d bitten her. What if she’d...changed him?</p> <p>What if he turned into the one thing he hated more than anything else?</p><p>His eyes narrowed. “What about me?”</p><p>“Will you become...like me? Because I swear, I never meant—”</p><p>He laughed then, and some of the tension eased from his face. “I won’t turn into a vampire, no matter how many times I’m bitten.”</p><p>Her shoulders sagged.</p> <p>“It doesn’t work that way for my kind. We can’t change but...” Now he rubbed his chin. “I have heard a story about another werewolf down in Florida...”</p><p>“What story?”</p><p>He buttoned and zipped up his jeans. “Seemed he married a pureblood vampire and by drinking her blood, the guy made himself even stronger.”</p><p>Her heartbeat kicked up. Last night, she’d been only thinking about him and pleasure. But just what had Cade been planning? “Is that why you bit me?” Anger began to simmer in her gut.</p><p>Where the hell were her clothes?</p><p>Oh, yeah, right. Pretty much burned to bits. So she’d keep having this awkward conversation wrapped in a sheet.</p> <p>He stalked toward her. Didn’t touch her. Just came close enough that she could feel the hot warmth of his flesh. “I wasn’t trying to get a power boost last night.”</p><p>“No?” Crap. She sounded way too hopeful. She could play this semi-cool. “Then what were you doing?”</p><p>His jaw clenched. “Claiming you.”</p><p>Um...</p><p>“I’m taking care of this witch,” he told her, “I’m gonna make sure that she never comes after you again, and then...” His hand lifted. Brushed over her cheek. “Then you and I—we’re gonna work this thing out between us.”</p><p>“This thing?” The guy didn’t exactly have a golden way with words.</p><p>He pressed a kiss to her lips. An open-mouthed-I-want-more kiss. “You want me. I’m fucking burning alive with need for you.”</p><p>Okay, better. Her lips curled. A girl liked to hear some occasional sweet—or hot—things from the guy who’d fought his way past her defenses.</p> <p>And into her heart?</p><p>Don’t go there. Not now. Focus.</p><p>“So let’s take her out,” Allison said and this time, she was the one to kiss him. Her kiss lasted longer. “Because I’m tired of looking over my shoulder.” She wanted to look ahead, instead.</p><p>To a future? A few days ago, Allison would never have thought that possible. But now...</p><p>What if she could have a future, with Cade?</p><p>That was sure as hell something worth fighting for.</p><p>But first...Allison caught the hand that he’d put to her cheek. She entwined her fingers with his. Stared deeply into his eyes. “I won’t ever let another vampire hurt you.” She needed to say this. To make him understand.</p><p>She wasn’t like the others. No matter what happened, she wouldn’t become like them.</p><p>And they’d damn well never attack him with silver again on her watch.</p><p>“So tough.” His smile had her heart jumping in her chest. “I think I’m rubbing off on you.”</p><p>“Maybe you are.” Or maybe the vamp in her was just developing her own killer instincts.</p><p>Kill to protect what was hers? Yes, she would. Because she was definitely starting to think of Cade as hers.</p><p>“Let’s find me some clothes,” Allison said. There had to be some kind of store around there somewhere, right? “Then we’ll hunt the bitch.” And part of her nightmare would end.</p><p>Then she could deal with what was becoming, had become.</p><p>A monster who wasn’t afraid to kill.</p><p>Tracking the witch wasn’t hard. Once they made it back to town, Cade made short work of finding Elsa’s scent trail. Actually, finding her scent was a little too easy. Elsa should have covered her tracks better.</p><p>He stared up at the old Victorian house near the edge of town. Lights glowed through the windows, firing out through the stained glass on the second floor.</p><p>He’d followed the scent of ash and power all the way back to this place. Elsa waited inside. But the witch wasn’t alone.</p><p>The scent of blood was far too strong.</p><p>Vampires.</p><p>His wolf pushed to break free.</p><p>Allison’s hand pressed against his shoulder. “What is it?”</p><p>He didn’t look away from the house. He’d wanted Allison with him because he’d been afraid Elsa would trick them and attack again. Leaving Allison behind to be a sitting duck hadn’t been his fucking plan.</p><p>But leading her straight into a nest of vampires wasn’t an option, either.</p><p>He inhaled, catching all the scents and said, “There are four vamps in there with her.” The scent of those vamps was so strong that it nearly overpowered everything else.</p><p>He caught the ragged sigh of her breath.</p><p>“Don’t worry, sweetheart, they won’t be a problem for long.” Not once he ripped their heads right off their bodies.</p><p>Her nails dug through his shirt and into his flesh. “You can’t take them all on.”</p><p>The wolf was clawing to the surface now, determined to be free. “Watch me.”</p><p>She didn’t let go. Her hold just tightened more. “I don’t want you dying for me!”</p><p>He could think of worse things to die for but... “I won’t be dying tonight.” No matter what Elsa had planned, “And neither will you.” Then, because he had to taste her, just once more, Cade pulled her close. His lips took hers in a hot, deep kiss, and he knew he’d carry her taste with him when he faced the enemies who waited.</p><p>The only good vamp is a staked vamp.</p><p>Not his motto anymore. But those bastards who’d sided with Elsa? They were begging for death.</p><p>He pushed Allison back. The change took him then, hard, brutal, as bones broke and reshaped. He fell to the ground, body contorting, and fur burst along his flesh.</p><p>At fourteen, his first change had been a burning agony. Now, he hardly felt the pain at all.</p><p>In moments, a wolf stalked the ground, heading toward the house. Allison stayed behind him, following close. He could go in quiet, try to surprise the vamps or—</p><p>Or he could just tear them apart.</p><p>Cade leapt for the door. His powerful claws slammed into the wood and sent the door crashing inward. Before it had even slammed to the floor, Cade jumped away and swiped out at the vamps who rushed toward him.</p><p>One slash across the chest to the dark-haired jerk who attacked with fangs barred. Even as the guy screamed and stumbled back, Cade drove his claws into the chest of the vampire on the right. The red-head’s eyes widened as the claws jerked inside of him, and the scent of the vampire’s fear filled Cade’s nose.</p><p>Kill. Destroy.</p><p>“Don’t hurt the girl!” The vampire’s bellow seemed to shake the whole house. Cade dropped his prey and saw that a big, blond vampire was rushing down the stairs, with another vamp right on his tail.</p><p>Their fangs were out, bloodlust glowing in their eyes but—</p><p>A gunshot thundered and a bullet thudded into his flesh. From the red-hot burn, Cade knew he’d taken a silver hit. His head jerked toward the top of the stairs. Elsa smiled at him even as she lifted her weapon once more.</p><p>Now he knew where Griggs had picked up his silver bullet ammo. Figured.</p><p>Allison screamed even as Cade’s wolf form tore up the stairs. He slashed out and knocked the vampires out of his way. But those vamps, they weren’t going down easy. The blond shoved a knife into Cade’s back.</p><p>More fucking silver.</p><p>His body burned.</p><p>“No!” Allison’s shout. “Get away from him!”</p><p>He felt the vampire jump in surprise. That shift of focus, that second’s hesitation was all that Cade needed. His head twisted, and he sank his fangs into the vampire’s neck.</p><p>Another bullet thudded into him. Elsa’s laughter grated in his ears.</p><p>Won’t stop. Kill.</p><p>Then Allison was there. She punched at the vampires. Swiped with her own claws. “Let him go!”</p><p>The vampires didn’t fight her. They fell back—one actually fell off the stairs, and Cade raced toward the witch. She was still smiling, still holding up her gun—</p><p>“Cade, no!” Allison’s steps pounded after him.</p><p>The witch’s finger tightened around the trigger.</p><p>His hind legs shoved down, then pushed him high into the air as he launched toward her. The bullet fired, scraped right by his left-ear, and he slammed into the witch.</p><p>His claws sank into her flesh.</p><p>She didn’t scream. Just kept laughing.</p><p>“Cade, watch out!” Allison’s yell.</p><p>But the warning came too late. He’d been too focused on the witch. On the vampires. Their scents had been so strong that he hadn’t noticed—</p><p>A knife plunged into his back. The pain had a howl of fury and agony breaking from him. He rolled, swiping with his claws, and Griggs—fucking bastard Griggs—fell to the ground, dead.</p><p>But Cade fell, too. He couldn’t get up. His legs had gone numb, and the shift swept over him again in an uncontrolled rush.</p><p>Too much silver. Too much blood.</p><p>He tried to find Allison. Saw her being held by the blond vampire. She was struggling in his arms and red tears leaked down her cheeks.</p><p>She thinks I’m dying.</p><p>Maybe he was.</p><p>He still couldn’t get up.</p><p>Griggs would never get up.</p><p>“Greedy bastard...for the right money, Griggs would always do anything.” Elsa, dripping blood, eased down beside Cade. She had a mirror cradled in her hands, a cracked, blackened mirror. “I knew he’d come back...he just wanted you to be weak enough first. Likes to attack when...his prey is weak.”</p><p>Too bad for the bastard...Griggs hadn’t waited long enough. Cade had made sure that prick went to hell first.</p><p>“Get away from him!” Allison yelled.</p><p>Elsa didn’t look her way. She leaned closer to Cade. He still couldn’t move. That fucking knife lodged right in the middle of his back. Griggs had driven it in deep, all the way to the bone, and when Cade had spun to kill the human—</p><p>I just drove it in deeper. When his back had hit the floor, the hilt had broken off, and the silver blade was lodged deep within him.</p><p>“What did you think would happen?” Elsa whispered as she clutched her mirror. “That you’d save her? That you’d get to keep her?”</p><p>Forever. He’d wanted a chance, a shot at—</p><p>“She would’ve stayed young for centuries, and you would have wasted away.” She held up the mirror to him. “See what would have been—see it!”</p><p>Cade stared into the mirror. He saw the future that had waited for him and bellowed in maddened fury.</p><p>Chapter Eight</p><p>That bitch wasn’t killing Cade. Allison jerked, twisted like a snake, and drove her claws—not nearly as fierce as Cade’s—into the blond vampire’s stomach.</p><p>He barely grunted. His eyes, too blue and bright, glittered down at her. “Don’t worry, we’ll keep you safe.”</p><p>Screw that. Like she believed a word he said.</p><p>Gritting her teeth, she pulled back her fist and slammed it right into his chest.</p><p>She heard something break. Luckily, it wasn’t her hand.</p><p>The vamp’s eyes widened. “Pureblood,” he whispered as he fell back a step.</p><p>That step was all she needed. “You aren’t killing Cade!” She’d promised that vampires wouldn’t hurt him again, and now he was up there, not moving.</p><p>Dying?</p><p>No.</p><p>“Cade!” She spun away and jumped up half the stairs.</p><p>But the blond vampire moved faster than her. He blocked her path in an instant. “I’m like you. Born to the blood, I can help you...show you...”</p><p>The witch was next to Cade. Her werewolf was shouting, but his body wasn’t moving. Dammit. “I don’t want you to show me anything! I don’t want anything—just Cade!”</p><p>Surprise slackened the vampire’s face. “He was...hurting you...holding you captive...”</p><p>She slammed her body into his. The vampire crashed into the wooden railing. “He was keeping me safe.” The wood began to splinter. “From all the murdering vamps who wanted me dead.”</p><p>The wood gave way.</p><p>The vampire didn’t try to fight the fall. He just plummeted to the hard floor below.</p><p>Allison grabbed a chunk of broken wood from the stairs. She rushed up toward Cade and the witch. “Get your ass away from him!”</p><p>Elsa turned around, her eyes were wide, and, oh, yeah, Allison saw the fear flash in her gaze. “You want to take me out so badly?” Allison snarled. “Then here’s your chance!”</p><p>But Elsa backed away. She dropped a mirror, and the heavy chunks of glass shattered at her feet.</p><p>“Better save him...” Elsa told her as she edged back. “With that silver lodged in his spine, he could be dead in seconds.”</p><p>Allison froze, the wood gripped tightly in her hand.</p><p>Elsa was still backing away. Going for another weapon? Preparing for another spell attack?</p><p>“Unless he doesn’t really matter to you...” Elsa threw out, taunting her. “Unless you want to watch him die.”</p><p>Cade was trying to crawl toward the witch. His legs weren’t working—because of the silver in his spine.</p><p>She wouldn’t leave her wolf helpless.</p><p>Never.</p><p>Allison rushed to his side. The wood dropped from her hands as she reached for his back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I thought so...” The witch’s nearly purring voice said. “I knew your weakness.”</p><p>A rush of wind filled that second-story room. Allison caught the sharp edge of the silver and ignored the pain when it sliced her flesh. “It’s okay,” she whispered to Cade. “I’ve got you. You’re going to be—”</p><p>The wind rushed harder, beating on her like hands, and a wooden stake burst through her chest.</p> <p>Allison didn’t let go of that broken knife. She glanced down and saw the bloody edges of the wood. The same wood she’d brought up to use as her weapon.</p><p>That rushing wind, it had been Elsa, using one of her spells...she’d moved faster than Allison could see. The witch had come up behind her and—</p><p>“Got your heart, bitch,” Elsa told her.</p><p>Allison yanked out the silver blade. She heard Cade’s fast inhale. He’ll be okay now. “No...” She managed to tell the witch even as every breath sent pain pulsing through her chest. “You didn’t.”</p><p>The makeshift stake had gone from her back all the way through the front of her chest, but the witch had shitty aim. She’d missed Allison’s heart.</p> <p>Allison rose to her feet, swayed, but managed to stay upright.</p><p>Elsa scrambled back. “No, no!”</p><p>A stained glass window waited behind her, one designed to show the beauty of a blooming red rose. But with the moonlight spilling through that glass, it appeared as if the witch were surrounded by blood.</p><p>She would be, soon enough.</p><p>Allison stalked slowly toward her. Every move hurt, but she wasn’t giving up. Wasn’t stopping. Her hands, already bloody, caught the edge of that stake. Slowly, inch by inch, she pulled it out. Then she held her weapon gripped tightly in her fist.</p><p>“Why?” Allison asked because she had to know. “Why did you... come after me?” Her fangs were fully extended, and she wanted to tear Elsa’s throat wide open. I’ve become the monster...and I don’t give a damn. Not then. Then, she wanted the strength that being a vampire gave her. “I never...never would have...”</p> <p>“You were going to kill me!” Elsa screamed, backing away even more. Her elbows bumped into the big, stained glass window. “I saw it!”</p><p>Allison shook her head. That small move had the room spinning. Blood soaked her clothes.</p><p>“I tried to change it...” Elsa glanced around the room with bright, almost feverish eyes. “I have to change it.” Then she glanced over her shoulder, back through the stained glass, and the witch started to laugh. “The moon’s not full...it’s not time yet! You can’t kill me!”</p><p>Watch me. Full moon or no full moon, Elsa was dying. Allison wasn’t gonna give the witch another chance to attack.</p><p>Behind her, Allison heard bones snapping and popping. Cade. Shifting. Healing. Her breath eased out slowly. He’ll be all right.</p><p>Elsa wouldn’t be. “I am going to kill you,” Allison told her quietly, hands fisting. “You won’t get out of this house alive tonight.” She wouldn’t give Elsa a chance to come at her again or to come at Cade.</p><p>“I had to save myself!” Elsa’s face flushed bright red as they faced off. “The mirror—I saw what you’d do! I saw—”</p><p>Screw the mirror. “You made this happen. You started it all. But I’ll end it.” Then, using every bit of strength that she had left—which wasn’t a hell of a lot—Allison jumped forward, diving right for Elsa. She shoved the stake at Elsa’s chest. “My turn.” The stake sank into Elsa’s flesh. Then Allison grabbed the witch, and she shoved her back into that stained glass window as hard as she could.</p> <p>The glass shattered, raining down to the ground, and as Elsa fell, Allison yanked her hands back.</p><p>But the witch didn’t let her go. Elsa’s hands had clamped around her, and Allison was too weak then to break free. She’d used her last bit of strength in the attack and—</p><p>Elsa pulled her through that broken glass. The shards sliced into Allison’s skin. They fell, glass covering them, surrounding them, and the wind whipped past Allison’s body.</p><p>Then they hit the ground.</p><p>When Allison went through that window, Cade leapt after her. He’d just shifted back to human form, and he rushed for the window as quickly as he could, bellowing her name.</p><p>Not fast enough.</p><p>So when the witch pulled her through, Cade followed them right down to the ground below. Their bodies hit the earth with a sickening thud, and he leapt down just behind them, his knees barely buckling when he landed on his feet.</p><p>Glass littered the ground. Blood stained the earth. “Allison?”</p><p>She was face-down, half on top of the witch. His heart froze in his chest. He stepped closer. “Allison?”</p><p>At his voice, her head rose slightly, and his heart started to race in his chest. He could see the blood on her cheek. The scratches. She pushed up slowly as she stared down at the still form of Elsa.</p><p>The witch hadn’t survived the fall. Maybe it was the stake in her chest that had killed her. Or the twisted angle of her neck. Either way, Elsa wouldn’t be hurting them or anyone else ever again.</p><p>He reached for Allison and lifted her gently into his arms. He noticed that, hell, yes, dammit, his hands were shaking. Fear. “Don’t ever fucking do that to me again.” He’d seen the stake go into her chest. Had thought for one lost, desperate moment that she’d been dying.</p><p>Won’t lose her.</p><p>He pulled her closer. Held her tight. He’d seen what waited in the mirror. What the future held for him and—</p><p>“Werewolf.”</p><p>And the fucking vampires were back. Could no one just leave them the hell alone?</p><p>Snarling, Cade pushed Allison behind him. He’d deal with these jackasses and then get her some place safe. Warm.</p><p>Then he’d make love to her all night long. Until he forgot what it was like to fear that death could steal her from him while he was helpless to do anything but just watch her die.</p><p>One leap forward, and Cade had his claws at the big, blond vampire’s throat. Cade knew the lead asshole when he saw him. “Ready to lose that head?” One swipe, just one, and he’d be rid of the bastard.</p><p>“I’m not here...” The vampire didn’t seem particularly afraid. Obviously a dumbass. “To hurt her...or you.”</p><p>Bullshit.</p><p>“Elsa said...” The vampire swallowed and Cade sliced his throat, a small, warning slice. More would come. “She said you were the threat...that you were sent to kill Allison.”</p><p>Plans had fucking changed. Everything had changed for him from that first moment in the alley, when he’d looked into bright blue eyes and realized that he still had part of his soul left.</p><p>A soul and a heart. He should have killed her, but Cade had only come alive when he met her.</p><p>Allison slid her small hand over his shoulder. Cade forced himself to take a breath. The urge to strike was so strong that he trembled but...</p><p>But the vampire wasn’t making any move to attack.</p><p>“You got your Intel wrong,” Cade snapped. Okay, fuck, he had been hired to kill Allison, but that plan had changed day one. He’d become the man who’d stand between her and any threat that might be out there.</p><p>Kill her? Hell, no. He wouldn’t even so much as bruise her skin. Right then, all he wanted to do was take her away, give her his blood, let her heal—</p><p>Then make love to her until he stopped being afraid that she’d slip away from him.</p><p>Death, you can’t have her. So fuck off.</p><p>“No one takes her from me,” he said, the words a vow. He hadn’t found her just to lose her. Wouldn’t happen. If he had to behead this vamp to prove it...</p><p>He was ready to slice.</p><p>“I mean her no harm.” Blood dripped down the vampire’s throat. “I thought...that night in the alley, I thought you were the threat.”</p><p>“He wasn’t,” Allison said as her fingers pressed against Cade’s shoulder.</p><p>Her voice was weak. She needs blood. His blood. But as much as he wanted to turn and scoop her into his arms, he didn’t move. Not yet.</p><p>Cade kept his hold on his prey.</p><p>The only good vamp...</p><p>“I have no quarrel with you, werewolf,” the vampire told him. The guy’s cronies had come outside, but they stood just in front of the house, wisely deciding not to interrupt right then.</p><p>Smart. They might keep their heads.</p><p>“I know who you are,” the guy went on. “And I know what you did to that nest in Oregon who made the mistake of fucking with your pack.”</p><p>The rage built within Cade.</p><p>“If you hadn’t killed them,” he added, “then my team would have. We don’t tolerate rogue groups, and we’re sure as hell don’t make a habit of torturing children.”</p><p>The guy looked sincere.</p><p>But vampires could lie.</p><p>As easily as witches. Werewolves.</p><p>Humans.</p><p>All were good. Bad. None were perfect.</p><p>Allison stroked Cade’s shoulder. “You might know us, but who the hell are you?” She wanted to know.</p><p>Cade risked a glance her way. Bruised, bloody...so beautiful. The dumbass vampire probably thought so, too.</p><p>“Charles Crawford. I’m on the Northwestern Vampire Council.”</p><p>Big deal. Vamps and their councils. He knew all about them. The councils were supposed to keep the vamps in check. Stop them from killing humans.</p><p>Keep ‘em on a leash.</p><p>From what he’d seen, those fancy councils did jack and shit.</p><p>Crawford glanced at Allison. “I was sent to protect you.”</p><p>“Then you arrived a bit late to the party, buddy,” Cade drawled. “Very late.”</p><p>Crawford’s jaw clenched. After a moment he said, “I vow that I won’t hurt her,” the vampire said, “or you.”</p><p>He’d like to see the fool try.</p><p>“Truce?” The vampire asked.</p><p>Oh, that grated and—</p><p>Allison swayed beside him. Cade lunged for her and caught Allison just before she would have fallen. Her skin was ice cold.</p><p>Her eyes were closing.</p><p>“No, sweetheart, don’t you even think of leaving me.” He held her gently, like the fucking precious thing that she was. He cradled her head and pushed her toward his throat. “Drink, Allison.” Take everything you need.</p><p>Because he wasn’t letting her go.</p><p>Chapter Nine</p><p>A gasp came from a few of the assembled vamps when Cade offered his neck to her. Yeah, he got it—werewolves didn’t usually offer themselves up as food to a vamp. He sure as hell wouldn’t to anyone but her.</p><p>He felt the press of her small fangs against his skin, a quick slice that was too fast for pain, then a surge of pleasure hit him as she began to gently suck on his neck.</p><p>He held her tighter and lifted her easily in his arms. As she drank from him, he faced the vampires.</p><p>Crawford watched him with blood still dripping down his own neck. Mild curiosity lit the vampire’s eyes. “So...it’s like that.”</p><p>“She’s mine.” And he was hers. Forever.</p><p>Crawford inclined his head. “Do you know...” He seemed to hesitated, but then he asked bluntly, “Have you taken her blood?”</p><p>Same old song and dance. “We both know werewolves can’t become vampires, so don’t worry, I’m not about to turn.” He tensed when Allison’s tongue licked over his skin. What he wouldn’t give to be alone with her then.</p><p>“You won’t turn...” Now Crawford’s eyes had narrowed. Filled with speculation. “You’ll just become...more.”</p><p>He already knew that. He’d seen his future in the mirror.</p><p>Allison’s tongue swiped over his neck once more. “I’m okay,” she whispered. “You can put me down now.”</p><p>He rather liked her where she was.</p><p>“There’s another vampire and werewolf pairing, down South.” Crawford motioned to his men, and the others began to walk away, back into the darkness that surrounded the old home. “He’s become more, too.”</p><p>“More?” Allison asked, voice stronger.</p><p>“Your blood will make him stronger,” Crawford told her. “As long as he has you, he’ll always be stronger, faster...”</p><p>Immortal.</p><p>Cade had seen all of this in the mirror. Elsa had thought that he’d see his death. That he’d see his body withering away over time while Allison stayed young forever.</p><p>He hadn’t seen that. He’d seen them. Laughing. Loving.</p><p>His life didn’t have to be a walking nightmare. With her, it could be more.</p><p>With her, he was already more.</p><p>But even if his power had faded, even if they’d only been offered a few years, he would have taken those years.</p><p>Taken them and counted himself damn lucky.</p><p>“Maybe our kind can help each other...” Crawford murmured with a slight nod of his head. “Maybe.” He stepped back. “I’ll send a team to...clean up this area.”</p><p>Nice code for body clean-up.</p><p>“And if you two should ever need me, I’ll be close.”</p><p>“Not too close,” Cade warned him, the power of the wolf rolling in his voice. “I’d hate to behead you...on accident.”</p><p>The vampire nodded at the warning, but his eyes were on Allison when he said, “Despite what you may think, we’re not all evil. I can help you.”</p><p>Cade’s back teeth clenched.</p><p>Crawford laughed. “I said help, wolf, not screw. I’m really not that eager to feel your claws at my throat again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade lowered his head close to Allison’s cheek. The scent of roses filled his nostrils and soothed the beast within.</p><p>Before her, he would never have stood there, talking to the male vampire. Slashing and fighting? Hell, yes.</p><p>But now...</p><p>Crawford backed away.</p> <p>Perhaps there could be more between vampires and werewolves. Maybe it didn’t have to just be about centuries of fury and rage and pain.</p><p>Allison looked up at him.</p><p>Maybe, just maybe, it could be about something so much better.</p><p>Allison gazed into Cade’s eyes as he thrust deep into her. A moan slipped from her even as her hands flattened on his chest.</p><p>She was above him, both her knees digging into the mattress on either side of his body.</p> <p>She’d healed. They’d survived.</p><p>No more running. No more fear.</p><p>Just...</p><p>His cock slid along her sensitive flesh.</p><p>Pleasure.</p><p>His hands were on her hips. Holding her tight. Lifting her up, down, and she moved with him. Not too fast. Not too hard.</p> <p>This wasn’t like the times before. The wild fury was gone.</p><p>Oh, the lust was still there, burning as hot as before but...</p><p>Allison leaned forward and kissed him. Her lips, open, eager, feathered over his. Her tongue pushed into his mouth.</p><p>He growled, and she knew that he liked her taste, but he didn’t thrust harder. Just kept up that perfect driving pace. Smooth, slow, so deep.</p><p>When the climax hit her, the release sent a wave of pleasure rolling through her whole body. Cade came with her, surging deep into her core.</p><p>And he held her close.</p><p>Just as she held him.</p><p>Her head lowered to his chest. Her ear pressed against him, and his heart raced so quickly, almost shaking her with its strength.</p> <p>“It’s over,” she whispered.</p><p>His heartbeat jumped. Then he stiffened. “What?” His hands caught her shoulders, and he lifted her up. “You’re...going with the vampires? Allison, you don’t have to, I—”</p><p>She shook her head. The flash of pure panic in his eyes made her feel braver. “I meant that we didn’t have to worry about Elsa anymore.” Though the witch’s final moments would haunt her dreams—nightmares—for months to come. Dammit, Elsa should never have looked into that mirror. There were some things that folks weren’t meant to know.</p><p>If Elsa had never glanced in that mirror, would the witch have ever come after her? Would their paths have ever even crossed?</p><p>Or, just by looking into that dark glass, had Elsa started the whole chain of events that had led to her own death?</p><p>Don’t think about her. Not now.</p><p>Allison’s fingers trailed over Cade’s muscled chest. He was still inside her, growing bigger and stronger by the moment, and this—he—was what she wanted.</p><p>“I know...things won’t be easy.” She’d managed to take his blood without a problem, but the thought of drinking from anyone else had her shuddering. Adjusting to vamp life wouldn’t be a quick, over-night process.</p><p>No more real food? No chocolate? No drinks?</p><p>Only blood.</p><p>Her breath sighed out. “Maybe being with me, the way I am now,” not human, not anymore, “that might not be what you want.” No kids. No white picket fence.</p><p>“You’re exactly what I want.”</p><p>Oh, that sounded so good. Her lips started to curl. “And you’re the only man I want.” Through blood and death, darkness and fire—just him.</p><p>His hand lifted and threaded through her dark hair. “We’ll take it as slow as you want. We’ve got nothing but time.”</p><p>Not death.</p><p>She nodded and for the first time in weeks, her heart felt lighter.</p><p>“I’ll keep you safe and give your nights filled with pleasure,” he told her, his eyes beginning to show the light of the wolf. “And I’ll stay by your side as long as you want me.”</p><p>Then he’d stay with her forever because she’d always want her wolf.</p><p>Want him. Need him. Love him?</p><p>Yes.</p><p>But could he love a vampire? She was afraid to ask. Allison didn’t want—</p><p>“When I look at you,” Cade told her, “I see every fucking dream I’ve ever had. You make me want to be better, for you.”</p><p>She lost her breath.</p><p>“Hell, I’m far from perfect, we both know that. And you could damn well do better—”</p><p>There was no one better. Stronger.</p><p>“But let me show you that I can love you.”</p><p>Her heart broke a little then.</p><p>“I can be the man you need.”</p><p>Allison shook her head. “You already are.” Maybe he wasn’t perfect. She didn’t want perfect. She wasn’t perfect. Far from it.</p><p>Perfect was boring.</p><p>Instead of some pristine prince charming, she’d much rather have her big, bad wolf.</p><p>They’d make their own happy ending, one that would last forever.</p><p>Forever with blood, monsters, and more than a bit of hot sex.</p><p>What vampire could ask for more?</p><p>Allison smiled and bent to kiss her wolf again.</p><p>Forever. </p> </body></html>"]