["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>10:19 p.m. Soho</p><p>She’d locked him in.</p><p>Alexander bit into the cuff encircling his left wrist and growled. Nothing. Not even a pinprick indentation. Clearly, his fangs were no match for metal.</p><p>Unlike his strength.</p> <p>Slow and steady, he sat up on the bed, taking the headboard with him. The loud, aching creak of it mimicking his insides, his unfulfilled hunger – the cry of desertion he refused to utter. His vixen, his sweet cocktease, his beautiful and truest mate had lost her mind, her senses and her own forthcoming orgasm five minutes ago and had left him – had locked his unclimaxed ass in the cold, dark cell that had once upon a time been his cheerless lair for self punishment and feeding, but had, over the many months, become a den for sexual play between them.</p><p>And all because he’d been unable to lie.</p><p>Again.</p><p>Unable to lie, and for the first time, unable to give his mate something she wanted - his acceptance – his blanket willingness to become a parent.</p><p>Snarling, Alex yanked at the cuff, bending the bedpost into a perfect upside down V. Didn’t she understand him at all? Creating a life, a balas – it was too much, too precious. He could not hold such a gift, protect such a gift with the sour, unbeating heart he possessed. At this moment in time, he had nothing to offer a child, no stories or traditions to pass on – nothing but the tales of a balas so unloved by its parents it had turned to the rats in its cage for affection.</p> <p>Didn’t Sara understand that his mother and her mate had grown an animal – not a nurturer – NOT a father.</p><p>Again, Alexander jerked at the metal, so fiercely this time the cuff snapped off and went flying into his face. He barely felt the sting.</p><p>It wasn’t that he didn’t want a balas.</p><p>Goddamit.</p><p>No.</p><p>In the deepest part of himself, the young, soft part that hadn’t been altogether destroyed – the part that was loved by its true mate - there was a yearning to care for a life of his own creation. But that was a selfish desire. Just as his love for Sara was selfish, but she was grown, she was a female who could make the decision to be with a paven like him – accept any and all that came with a paven like him.</p> <p>But a balas.</p><p>A balas had no choice. A fact he knew all too well.</p><p>“Damn you, Sara!” he growled, lifting the bed and flipping it over, just as he’d flipped his mate to her belly an hour ago, gripping her hips as he entered her honey-soft cunt.</p><p>She would have to understand his reasoning, his resolute pronouncement. His seed entered her body for pleasure only – not to bring a life into this world.</p><p>Walking over to the bars of his cell, he gripped the iron in his fists and hissed her name. Sara – his Sara – had locked him in here with nothing but his mind and his hand to finish what they’d started. He enjoyed their games, both in pain and in pleasure. He enjoyed her punishments – even enjoyed losing on occasion. But in this, he would come out the winner.</p><p>And his spoils?</p><p>Alexander’s nostrils flared and his fangs dropped, piercing the swollen flesh of his lower lip. His sweet, seductive Sara would pay for locking him up, lonely and pained...pay in the most delectable way he could manage. Wherever she found herself in that moment, it would serve as their mating bed while the audience she stood before would bear witness to her impassioned cries. For he would have her worked up, worked over.</p><p>If not by his hand, then by her own.</p> <p>At least until he found a way out of his cage.</p><p>Tightening his hold on the bars, Alexander shut his eyes and called out to her.</p><p>11:59 p.m. Walter Wynn Hospital</p><p>What was she doing here?</p><p>At work.</p><p>It wasn’t even her shift.</p><p>And yet there was nowhere else Sara had thought of to go. Her home, where she took in air, where life was lived and love resided bountiful and true, had bars around its walls tonight. The bars weren’t made of metal like the cage she’d locked her paven in a short time ago, but they were thick and impenetrable nonetheless. Alexander loved her – she knew this deep within herself, never questioned it, not even for a moment. But she had believed that his love might grow to encompass a balas at some point. It had been her silent prayer, her truest hope.</p><p>But after his words tonight, that hope had died.</p><p>From behind the desk in her office, she sat up straight and tried like hell to focus on the patient charts before her. The names written in red and black ink ran together like blood and oil, and she felt the tips of her fangs twitch. The damn things wanted to extend. They wanted inside flesh, inside vein. They wanted blood.</p><p>They wanted their master.</p><p>She closed her eyes.</p><p>Sara jerked upright, her eyes flying open. She still wasn’t used to her mate’s gifts.</p><p>Oh, god. Alexander. His voice boomed through her system, making her skin tingle, her mind weaken. With clenched teeth, she shook her head. Why couldn’t he leave her alone? Just for a moment. Just so she could get a hold of herself – let her anger subside. Let her dreams of having a balas at her breast fade.</p><p>A shudder moved through her heart, circled and moved downward. She glanced up, at the door – closed, at the lamp – dimmed.</p><p>She did. But she hadn’t left him in the cage to punish him, only to separate herself from him. To release herself from his power, his delicious control over her body, her skin. But there was no stopping him – no stopping the dark magic of his voice. Even the tiny heartbeat inside her clit quickened to meet it again. As she sat there on her office chair, her anger began to fuse with her desire. Soon she would be completely lost to it.</p><p>Sara realized she had dropped back against the chair, and her hand was flat against her belly, her fingers pointing downward like an arrow.</p><p>Sara’s breath grew ragged and rough as she unbuttoned her jeans, fumbling with the zipper. Damn him, she thought, even as she whispered his name. Damn their bond and the need her body, her skin, her mind demanded from his vampire – and always would. No matter their arguments, their conflicting choices, she belonged to him utterly and completely.</p><p>Beyond reasonable thought now, Sara shook her head, just as her body shook, ached. She shifted down on the chair, lifted her buttocks, squeezed her hips. She could see him, leaning back against the bars of his cell, his nude body rich with sweat, each drop clinging to muscle and bone like a lover. Her tongue swiped at her lower lip then, as she imagined licking off every salty bit.</p><p>Her hand inched lower, gripping the top of her pelvic bone. Her fingers were greedy to touch, and her clit cried out for his voice, more of his voice – and the sexual play in her head.</p><p>Oh god. Her hips jerked.</p><p>Her hand was lost inside her underwear, her fingers dipping between the wet folds, searching...searching for the swollen, aching – - .</p><p>Eyes closed, knowing the door to her office was unlocked and available to anyone who wished to walk through it, Sara groaned her pleasure. As Alexander spoke, she circled her wet clit – seeing him in her mind, seeing his tongue playing her body as her hands were now.</p><p>It wasn’t a question, but she answered it anyway.</p><p>“Yes,” she uttered, breathless.</p><p>Her breathing jumped, caught in her throat as she flicked the tender, aching bud over and over.</p><p>Her hand began to shake.</p><p>All thoughts in Sara’s mind evaporated as she followed his command, leaving her clit and thrusting one long finger up inside her cunt.</p><p>She gasped at the sensation.</p><p>Hot. Wet.</p><p>Ready.</p><p>Tonight. She tried shaking her head, but it wouldn’t budge. She felt drunk, on fire, her finger buried so deeply within herself she could feel her womb.</p><p>God...her womb. It was so empty...would always be empty--?</p><p>Her hand, shiny and flexed with her own power, stilled at his words, her eyes opened to slits.</p><p>Her core shook so badly, she nearly disobeyed him. Release herself? God, she didn’t want to. But he was her master and she slipped her hand from her body and sat up. She sucked in a breath as her sensitive clit made contact with the rough fabric of her jeans.</p><p>Alexander’s command echoed in her mind causing her skin to blister and the mark – mark - behind her ear to vibrate. In seconds, she was up, fumbling to refastened her jeans as she ran for the door. The hallway was clear, elevator was empty, and she didn’t even have to push the button for the roof. It was done the moment the door closed.</p><p>Her heart pounded as the metal box pushed upward. Her anger was there, still there – her frustration, all of it, but it didn’t cloud the fact that Alexander Roman was the goddamn love of her life. He was her other half, why she slept sweetly and was thrilled to wake. And whatever they decided for their future they would always have each other.</p><p>The doors barely opened before Alexander’s hand clamped around her arm and tugged her out onto the roof. She whimpered and heaved herself into his arms.</p><p>That’s when she noticed what he was wearing.</p><p>A long black coat.</p><p>Alexander guided her to the roofline, leaned back against the railing and let the wind take the folds of his coat as he quickly removed her jeans and underwear. Sara’s gaze caught on the hard length of his cock, standing up straight and ready, and her cunt quivered in anticipation. With a growl of need, with impatience, Alexander lifted her up and placed her down on his shaft.</p><p>Sara gasped, impaled. So deliciously impaled.</p><p>There was nothing like it, nothing that could rival it.</p><p>Alexander groaned, “The most perfect motherfucking fit ever.” He kissed her frantically, his mouth devouring hers like the hungry, possessive vampire he was. He gripped her buttocks, his fingers digging into her flesh as he worked her over, thrust so deeply into her that she lost her breath. He put no thoughts into her mind only action into her body. Maybe it was because, like her, he was too caught up in what they were doing, feeling, or maybe their closeness was all he’d really been after in the first place. Whatever the reason, as he stretched her, impaled her, pounded into her, he continued to kiss her mouth, consume her breath.</p><p>Sara couldn’t help herself. She trembled uncontrollably, her hips slamming against his groin. She was so close, her cunt squeezing its beloved so tightly she knew the fireworks were about to hit. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Possessed and starving, Alexander’s breathing turned raspy, guttural against her mouth, and when he opened her wide and suckled her tongue, the muscles around her cunt rippled... spasmed, then exploded with heat – with delectable tremor after tremor.</p><p>Sara cried out and bucked frantically against him, her nails scratching at his skin as she sent her true mate into four massive, battering thrusts than ended in the hottest snarling climax of Alex’s long life.</p><p>It was moments before they recovered. Clinging to each other, shaking, both breathing in gulps of air as the night closed in around them – their eyes found each other and locked.</p><p>“Alex...” she uttered softly, desperately. “My Alex...” God, she loved him so...</p> <p>“I’m afraid, Sara,” he whispered harshly, gripping her buttocks, pulling her closer, keeping his cock inside of her where it was home and happy.</p><p>She reached out and touched his face, her eyes imploring him. “Tell me. Please.”</p><p>“If we do this...” He shook his head. “I will make such mistakes.”</p><p>Her heart surged. Smiling gently, she nodded. She understood him now. “So will I.”</p><p>“I would need to learn patience.”</p> <p>“Me too.”</p><p>He stilled, his eyes suddenly fierce. “I would kill anything that brought ours harm – including myself.”</p><p>Sara leaned in and bit his lower lip, then licked off the blood. “Then you have the true nature of a father, my love.”</p><p>His nostrils flared as he stared hard and deep into her eyes. It was as emotional as Alexander Roman allowed himself to be. But Sara understood it, understood him. Fear and concern had given way to hope, and her heart soared.</p><p>“Close your eyes, my Sara,” he commanded, and in seconds they were gone, flashed, hovering in momentary darkness as Alexander began again with thrusts so slow and languid and delicious, Sara felt like a new bride again.</p><p>Her body clung to his as they landed, just as her cunt squeezed around his cock. A sudden gust of sea air filled her nostrils and she smiled.</p> <p>The lighthouse.</p><p>Alexander’s lighthouse.</p><p>And when he pulled back from her embrace, his eyes shown with the dearest of love. “Our balas would be conceived here, Sara. Where I found freedom, where I was brought back to life – where I fell in love with its beautiful, kind and forgiving mother.”</p><p>“Are you sure,” Sara said, the surf at her back, her heart pounding with life. “That you have enough love for three?”</p><p>Alex grinned then, his fangs dropping low as he continued to pump slowly inside of her. “For three. For four. Maybe for more.”</p><p>Sara laughed, and as the waves crashed behind her, new waves swelled within her. He was magic. He was her life, her love, her true mate, and one day, he would be the father of her child. She wrapped her arms around his neck and kissed him, spoke sweetly to him, rocked with him as they made love.</p><p>And possibly a balas.</p><p>The End</p>  </body></html>"]