["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>General Hank Renshaw hadn’t often seen a man’s hand down the bra of esteemed senator, Ginger Landis.</p><p>Of course, as he stood astounded in the doorway of the VIP lounge in the tiny airport on the Bavarian border, he couldn’t recall a time he’d ever seen his longtime friend Ginger’s underwear at all. Much less with a man’s hand slipped inside.</p><p>Hank slammed the door closed so nobody else would snag a view of what now filled his eyes.</p> <p>Technically, the security fellow wasn’t groping around inside her satiny camisole thing. Ginger had taken off the jacket to her Christmas-red power suit so the reedy guy in a black coat could outfit her with the latest listening device for her upcoming meeting with the German Chancellor and Minister of Arts as well as the Vice-Chancellor of neighboring Kasov. All a part of a holiday goodwill trip across Europe, ending on Christmas Eve at a medieval castle with chapel ruins set to be rebuilt. Ginger would be donating an heirloom from her family’s antique art collection, a small but priceless porcelain crèche.</p><p>Hank’s role? To stand at her side as her official military escort. Unofficially, he was here to protect her. He was the final wall of defense between her and the threats that had been made on her life. Those threats were the very reason for the heightened security with a listening device.</p><p>Arms extended, Ginger stood in spike heels, legs to kill in a pencil-thin skirt and satin camisole trimmed in lace.</p><p>His midnight dreams about this woman played out much like this—with him standing beside her, of course. He would stretch her out on that froufrou creamy chaise behind her.</p><p>But only in dreams when he tossed off the restraints of waking hours did he allow himself to fall victim to fantasies about his pal of over twenty-five years. He was a red-blooded man, after all, and age hadn’t diminished Ginger’s appeal in the least. Which could also have something to do with the genius brain she packed underneath that head of perfectly styled platinum-blond hair.</p> <p>Still, never had he done anything to put their friendship at risk by relaying the attraction.</p><p>Then he realized the silence had gone on too long to be anything but freaking awkward, and his slack-jawed look could very well put a chink in their all-important friendship.</p><p>“Sorry, Senator Landis.” Hank used her official title in deference to the security personnel present—and out of a need to put some distance back into their relationship. “I hadn’t realized you weren’t ready yet. I’ll just step outside.”</p><p>Outside. A fine place for him to stand guard anyway, while he sweated his way through images of her wearing red-hot lingerie. This would be a very long day.</p><p>He twisted the doorknob behind him.</p><p>Ginger waved a manicured hand through the air, white tips of her nails fluttering. “Oh, hell, Hank. Quit with all that formal madame stuff. We’re not at a press conference.”</p> <p>She had a point. Still he couldn’t help thinking he would be safer standing guard in the airport corridor by the decorated tree getting his head on straight again. “Ginger, I’ll wait in the hall by the door until you’re ready.”</p><p>“Hold on. Get out from under that mistletoe and come over here. See if you can clip this microphone on right so I’m not trailing tiny computer bits out of my skirt,” her South Carolina drawl curled through the cloud of unease. “This poor secret service fellow’s so worried about copping a feel he can’t get the damn thing secured to save his soul.”</p><p>The young security agent must have been all of seventeen—okay, twenty-seven. They just looked like babies when you’d hit fifty-five.</p><p>The kid didn’t help matters by blushing to the roots of his Idaho-farm-boy red hair. “Senator Landis, I apologize. These new listening devices have a tricky clasp, but they’re far less visible.”</p><p>Ginger cocked a delicately arched brow. “Well, I wanted to use those fancy teeny-tiny ones that fit in the ear canal, but all this flying gave me a double ear infection.”</p><p>She smoothed a hand over her blond hair away from the aforementioned ailing ears. The simple gesture hitched her camisole up to expose a tiny strip of stomach when Hank was already reeling from the surprise of seeing his old friend in a new light. Hank blinked his way through the fog and focused on her words. She’d mentioned being sick? Concern slammed away everything else.</p><p>He charged deeper into the room, the plush carpet muting his frustrated footsteps to dull thuds. “Are you sure you’re up to this trip? They’ve packed in more stops on this goodwill tour than there are waking hours in the day.”</p><p>“I’m fine. The antibiotic’s kicked in. My ears are just a little sensitive.”</p> <p>Relief rocked through him as the secret service agent stepped away from her, giving Hank a clear path. Yeah, he knew he was a little overprotective of women. His daughters labeled him an alarmist when it came to illnesses. Send a bullet or mortar fire his way and he could stand firm without flinching. But ailments of the body still made him break out in a cold sweat since he’d lost his wife to a fluke aneurysm twenty-four years ago, leaving him with three children to bring up.</p><p>He didn’t know how he would have made it through without Ginger’s help. He’d tried to help her as well when her senator husband had died ten years ago in a car crash, leaving her with four strapping boys. She and Hank had pooled resources when they could.</p><p>He blinked through thoughts of the past, their past, their friendship. Anything to keep himself from focusing overlong on the fact that his fingers were now inches away from Ginger’s chest.</p><p>Her breasts.</p><p>Hell. What was he thinking? She was an esteemed member of the Senate Arms Committee, for Pete’s sake. He considered himself nonsexist, a professional. He’d risen through the ranks treating everyone in his command equally, fairly. So get the job done.</p><p>He slid his hand inside Ginger’s camisole. He schooled his features to stay blank in spite of the fact that her creamy skin smoothed along the back of his hand with a sweet temptation reminding him how long it had been since he’d been with a woman.</p><p>There had been invitations, but his rank kept him from accepting most of them, and his jammed schedule eradicated most of the rest. He adjusted the clamp to a crevice in the lace. Damn it all, he wasn’t some unseasoned kid to be floored by a simple stroke against skin.</p><p>But he was man enough to appreciate the subtler temptations of life as being far more seductive than blatant displays.</p><p>Sweet sin, something shifted in his world in that moment. It didn’t matter that he was an old cantankerous bomber pilot, widowed father of three, a grandpa even. He couldn’t make himself look away from the holly-green of Ginger’s eyes.</p><p>She cocked her head to the side. “Hank?”</p><p>He whipped his hand free. “All set.”</p><p>Hank tugged her jacket from the back of an ornate wooden chair and held the coat open for her to slide her arms inside. Then his brain tripped over itself.</p><p>Hell.</p><p>This wasn’t an overcoat. It was clothing. He should have simply passed the jacket to her while waiting to give her the velvet bag that held the miniature porcelain crèche. Now, he couldn’t miss the intimacy of helping her dress. Luckily, Ginger simply smoothed over the moment by taking it in her normal easy stride that had aided her in negotiating legislation during senatorial debates.</p><p>She slipped one slim arm then the other inside, shrugging the suit jacket into place. Her fingers glided down the golden buttons until she was once again fully clothed. “Thank you, Hank.”</p><p>Too bad he still saw satin and lace.</p><p>Not wise. He needed to remember that he was here as part of Ginger’s protective detail for this string of politically strategic visits across Europe. With two death threats and pockets of terrorist cells all over Eastern Europe, her security had to be his number-one priority.</p><p>His brain didn’t have room for satin and lace when her life could be in danger. But because of those very problems with spreading terrorist factions, she’d stressed more than ever the need for strengthening ties between their country and representatives from countries on their list.</p><p>Ginger stepped forward, the hem of her sleeve gripped in her fist and reached to rub the fabric over his shoulders. “You’ve got snowflakes melting on your uniform. Don’t want to tarnish those three shiny stars on your shoulder boards.”</p><p>“Thanks, it’s kicking up out there, but I’ll have an umbrella to cover you on the way to the limo.” He kept his face stern. “I’m going to state the obvious—again. You should wear a bulletproof vest.”</p><p>“Impossible to hide under this suit.” She shook her head.</p><p>“Easy enough to hide beneath your overcoat if we kept your appearances outside.”</p><p>“We can only take security so far without insulting the people we’re trying to win over.” She tapped his temple as if the awkward moment had never happened. “What’s done is done, so lighten up. What’s wrong with you today, Hank?”</p><p>He let his real feelings show for the first time since he’d been frozen solid in the doorway. “I’m worried about you. I’ve got a bad feeling about this that I just can’t shake. You’re sick with that ear infection anyway. Why not bow out of the next two days of meetings and just make the final appearance at the chapel ruins?”</p><p>“Oh Hank, you know better. We’ve come a long way from when our kids used to play together while we drank a bottomless pitcher of tea with Benjamin and Jessica.”</p><p>Benjamin and Jessica. Ginger’s husband. His wife. Back when they’d all been friends and who’d thought of the future? “Or longneck bottles of beer.”</p><p>“That too.” Ginger gave his shoulders a final swipe and pat. “You gave up personal-comfort choices when you took on your position with the Joint Chiefs of Staff. And I’m taking a walk I never expected when Benjamin decided to get out of the Air Force and run for the Senate. So let’s put on our best game face and do our jobs.”</p><p>Their jobs. Right. Except as he stared down into her deep-green eyes and wondered why she wasn’t as affected by the moment as he was, he realized her hands still rested on his shoulders.</p><p>Her hand resting in the crook of Hank’s elbow, Ginger stepped out of the airport, her time to “freshen up” in the VIP lounge over. Her stomach clenched. From the security threats, surely. Not from the surprise jolt of awareness she felt from taking the arm of the towering man beside her. This was her longtime pal, her dear friend.</p><p>A man who had been unmistakably checking her out.</p><p>Her nerves fluttered like the trills of music from the band playing Christmas tunes under the red-striped awning. “Oh, Tannenbaum” floated on the snowy swirls as she made her way along the preswept red carpet leading to the limo fifty feet away.</p><p>Hank held the umbrella as she waved to the distant crowd who’d braved the snowstorm to welcome them. She had almost gotten to the point where she didn’t notice the protective detail. However her safety depended on it, and she simply had to accept that.</p><p>Cameras flashed and snapped as reporters caught their images for the papers and the Internet. She strode past the cargo plane with its spit-polished crew who had hauled all their gear, personnel and vehicles across the Atlantic, then around Europe. The redheaded secret service agent walked alongside, talking into his sleeve.</p><p>Hank stayed ever-present in step, his strides a loose march, snow spiraling around their feet. She gripped his arm, her velvet bag dangling from her elbow. She wasn’t sure why she’d been so insistent on carrying the crèche herself. It would have been simpler to include it with the luggage. But she’d always treasured the little piece, one of her children’s Christmas favorites each year and she wanted to keep it with her as long as she could.</p><p>Hank’s face dipped toward hers. “Is the microphone on yet?” His voice rumbled low.</p><p>“No, General, not until I’m in the meeting with the German Chancellor and the Vice-Chancellor of Kasov,” she answered while smiling, nodding, waving. “I can say pretty much whatever I want as long as I smile sweetly for the cameras and we keep our voices low. But there will be a driver in our limo after we finish this little walk-and-wave gig. You have about one minute.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fair enough. I’ll make this quick then. I apologize for the awkward moment back in the VIP lounge.”</p><p>In spite of the lack of listening devices, she appreciated that he kept his comment vague with all the people around. However, she also knew this was about as much privacy as they would get for the next couple of days. “I guess there’s no need for me to say, ‘What moment?’ but really Hank, don’t give it a second thought. We’re old enough to be past worrying about things like that.”</p><p>“Do you think so?” He cocked a brow. “You don’t look too old to me.”</p> <p>And never too old to appreciate what sounded to her ears to be a most sincere compliment. The butterflies in her stomach swirled faster than the snowflakes.</p><p>Her publicity smile still in place as she waved and looked ahead, she whispered out of the corner of her mouth, “Lordy, Hank, I’m a forty-nine-year-old mother of four boys.”</p><p>“And still hot as hell. You always have been.”</p><p>His words actually sent her stumbling a step on her heels before she regained her balance by gripping his sturdy arm—and making a quick check to be sure no one had overheard that bit of blunt flattery.</p><p>Seemed they were in the clear, and she wished she could have credited her slip to an icy patch, except that each footstep hit a swath of red carpet laid expressly for her visit. “Well thank you very much...General.” She also couldn’t bring herself to leave him out there hanging. “The years have been more than good to you. I was a little afraid I had embarrassed myself back there, too.”</p> <p>His “public smile” relaxed into something more real for a moment. “So basically, you’re saying it’s okay that we both felt something in the airport lounge?”</p><p>“I’m saying we are both normal human beings.”</p><p>Her waving hand paused for a moment to glide possessively over the crèche. It had been her idea to give away the item to the church in the region where her husband’s great-grandmother had been born. Her right. Nothing politically incorrect about it, but everything politically savvy.</p><p>So why was her heart aching so over letting go of a piece of artwork she hadn’t even set up for the last three years? She told herself maybe she was the only one obsessing about the crèche to avoid thinking overmuch about the more pressing matter of these unexpected feelings for Hank.</p><p>“We’re also friends, Ginger, and I’ve learned friendship is rare, unlike....”</p><p>Sex?</p> <p>She didn’t know about him, but sex was more than rare for her. It was nonexistent these days. Still, she couldn’t miss the depth of what he’d said about friendships being rare, something to treasure.</p><p>Their limo loomed a few more steps ahead, the crowds behind them now, the only other observers and press across the lot, roped off.</p><p>She stopped, staring up into his golden-brown eyes while waiting for the limo door to be opened. “How have you stayed single this long? You are something special, Hank Renshaw.”</p><p>Even as she heard the vehicle door click open, she couldn’t pull her gaze away from his. She shivered and hugged her wool overcoat closer to her. The weight of the velvet bag on her arm pinched at her skin, the wind swaying the purse back and forth.</p><p>Deep in his eyes she saw so much, not just the shared memory from the airport lounge, but from those years of friendship. Swirling at the center she found times they’d comforted each other—which made her remember the near-crippling agony of losing Benjamin.</p><p>Eventually she’d made her way past the pain into a vision of a future full of her children, grandchildren and a career on the national scene full enough to keep her busy for life. It had felt like enough.</p><p>Except at the moment she was too aware of the feel of red satin against her skin.</p><p>Heaven help her, Hank was reaching toward her. Could he be as caught in this moment as she was? Now wouldn’t a single inappropriate touch between the two of them eclipse all other morning feature photos?</p> <p>She started to caution him when she realized he wasn’t reaching to stroke her arm, but to grip her elbow. His mouth opened.</p><p>“Ginger. Down,” he shouted, just as a bullet split a hole in the red carpet an inch from her high heels.</p><p>Chapter 2</p><p>Hank flattened Ginger down to the red carpet, shielding her with his body as he weighed his options for the best place for her safety. Bullets came at them from both sides. Security personnel made attempts to rush toward her, but bullets held them off.</p><p>Downed two. Holy hell.</p><p>Handheld radios squawked as a local cop pointed out a target in a black suit. A man with a sputtering gun keeping them from the airport.</p><p>A longer rifle glimmered in the distance from the patch of icy trees. Hank shouted a warning as another hail of gunfire exploded. Good guys and bad guys—all wearing black suits—blended until he didn’t know who to trust. No way even of determining who was from what country.</p><p>Shielding Ginger, he pivoted left and right, ascertaining one thing for certain. The limo chauffeur narrowed his eyes in their direction.</p><p>Hank had a split second to decide whether to put Ginger’s life in that man’s hands. Hank’s training, his instincts all shouted, trust no one.</p><p>He went into battle mode. Over thirty years of training kicked into high gear with one objective. Keep Ginger alive.</p><p>His arm hooked around her, he pressed her to his side as he ran. He protected her as best he could, shifting his back to whichever way it seemed the barrage of bullets raged worst.</p><p>He needed cover. Certainly. More than that he needed to get the hell away. He scanned the field, a mass of mayhem now with the crowds of shrieking observers running for cover behind trees or distant houses.</p><p>He missed the good old days when he’d driven himself from point A to point B. The limo was a no-go for transportation even if he could trust—or take out—the chauffeur. The vehicle was too unwieldy and identifiable.</p><p>Hank ducked by a tree with Ginger against him as a fresh hail of bullets spat from the airport door. Thank God she wasn’t a squealer. She kept her head and her silence. Although she couldn’t keep up, thanks to those ridiculous high heels that made her legs dream material.</p><p>“Look. There.” She pointed to another man dressed in a suit. Appeared to be secret service, but damned if he wasn’t pointing his gun in their direction.</p><p>His brain raced until the obvious hit him. They couldn’t go inside the limo, but the back end of the limo would make a fine place to crouch while planning.</p><p>Arm around her waist, Hank hefted her off her feet and sprinted back, closer to their original position. Bullets pocked the ground by his polished uniform shoes. Damn it all, he wished he had his flight suit and combat boots rather than this monkey suit with medals clanking and shoes pinching.</p><p>Finally, he eased Ginger to the ground. Luckily, the vehicle’s engine was off—shot out from bullets perhaps?—so no worries about being run over.</p><p>She wrapped her arms around the boxed crèche, her black wool coat trailing in the snow behind her. “What the hell is going on?”</p><p>“I don’t know, but I’m not sticking around to chat with the guys shooting at us.” He slid his hand inside his overcoat and pulled out his 9 mm. “Can’t tell the good guys from the bad guys.”</p><p>He had a gun—of course he did, given the woman he’d been tasked to escort. Right now it was tough to figure out who to shoot. He could just as easily take out one of their own, but by the same token he couldn’t bring himself to trust a single person here at the moment. Bottom line, the best course still seemed to be trust no one for the moment, leave and recoup.</p><p>Now he had to figure out how to get out surreptitiously—with a hot woman in a red suit who just happened to be the high-profile U. S. Senator from South Carolina.</p><p>“Hank?”</p><p>“Thinking.” He gave her waist a reassuring squeeze. “Hang in there.”</p><p>“Hank—”</p><p>“Damn it, Ginger—”</p><p>“Hank!” She thumped his chest and pointed.</p><p>Tucked twenty feet or so away under an icicle-laden tree sat a silver Mercedes, engine humming, driver slumped over the steering wheel.</p><p>A getaway car.</p><p>He smiled.</p><p>She winked. “Ready?”</p><p>“Set,” he growled.</p><p>“Go!” Her purse clutched to her chest, she leapt to her feet and ran like hell in those heels he could have sworn would keep her back.</p><p>Well, damn. So much for carrying her this time. He bolted after her, his coattails flapping in the wind. He focused on creating a boundary with his body between her and anyone who might target her. Seconds later, they reached the Mercedes. Hank gripped the dead man by the collar and pulled him from the car.</p><p>He took a precious extra five seconds to relieve the dead guy of all his weapons before climbing behind the wheel—to find Ginger already buckled in beside him with her black velvet bag containing the family crèche resting on her lap. Her seat was reclined enough to keep her head out of the way of incoming fire.</p><p>“Let’s blow this pop stand.” He stretched his arm along the back of her seat and looked behind them, reversing the vehicle before pulling forward onto the road. Away from the firefight.</p><p>God, it felt like an hour since he’d stepped out of that little airport, but the whole ordeal had probably lasted all of ninety seconds. He’d experienced that same bizarre time-warp sensation countless times before in battle.</p><p>Now he just had to figure out a safe place to relocate in a foreign country with a U. S. Senator in tow at a time when people had decided to start shooting at her for no apparent reason.</p><p>Merry flipping Christmas.</p><p>“Buckle up.” Ginger couldn’t hold back the order as she gripped the dash of the Mercedes they’d just stolen from the dead agent.</p><p>“Yeah. In a second.” Hank slammed the car into Reverse again as they reached a road block of tractors.</p><p>“Now. Buckle it.” She put on her best mother voice that had actually stood her in good stead at the bargaining table when working to eliminate pork from legislation. “You’re no good to me if you catapult through the windshield in a car chase.”</p><p>“Uh-huh.” He rammed the Mercedes into Drive and nailed the gas pedal, whipping the steering wheel around to dodge the limo that had suddenly taken an interest in them again. Apparently the engine hadn’t been dead after all.</p><p>“I hear you, Ginger. As soon as I get a hand free. Duck.”</p><p>A bullet nailed the vehicle. The car rattled on impact. The reverberation shuddered up through her toes. Echoed through memories in her mind. She would never forget the unmistakable sound of tearing metal when she’d lost her husband in that awful car crash on an icy road.</p><p>She also couldn’t help but think of Hank in battle. How often had Hank heard antiaircraft fire hit his plane? Had it sounded the same? Life was too fragile.</p><p>Her heart pounded. She hit the deck as ordered. That didn’t mean, however, that she would forget about Hank’s safety. If he wouldn’t take care of himself, she would do it for him.</p><p>Ginger tucked her head low and reached over his lap. He thought he was invincible. She knew better. Images of her dead husband’s lifeless body in the wreckage of their family car still haunted her dreams at vulnerable moments. Like now. Here she was again, in a vehicle, driving too fast beside a man who was an important part of her life.</p><p>The Mercedes engine roared a reminder of their need to put space between themselves and the current crisis. She could hear the limo behind them. The squeal of brakes. Feel the swish of tires on slushy roads as rubber worked to gain traction.</p><p>The luxury sedan lurched forward as if rammed from behind. Hank braced himself. She bit back a scream that reverberated in her mind anyway.</p><p>Stop thinking. Take care of Hank’s seat belt while he worked his racetrack magic over the streets along the Bavarian border. She stretched her arm, fingers wiggling until she finally...felt...the fabric of his seat belt. Victory. She tucked the shoulder harness under his arm—not optimal, but he wouldn’t take his hands off the wheel—and yanked the lap belt in place with a satisfactory click. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Relief shimmered through her. He really should know better. He wouldn’t climb in a plane without going through a checklist. A rogue thought ticked at her brain like a frosty bracing breath.</p><p>He’d been more concerned about her safety than his own. She shivered with her exhale, her breath caressing the rough fabric of his open overcoat.</p><p>His coat?</p> <p>Oh my. What a time to realize she lay with her cheek pressed against his thigh. The heat of him warmed her face chilled by winter and fear. Then her face flamed from more than the feel of him.</p><p>Did he notice their suggestive position? She couldn’t decide whether she should be more embarrassed if he did or if he didn’t. She started to shift.</p><p>The car jerked left. The brakes shrieked. Hank palmed her back. “Don’t move.”</p><p>She hugged his waist for balance and tried not to envision what was happening outside. The best thing she could do for him was stay calm. He didn’t need some screaming, clingy liability distracting him.</p><p>Time passed in a blur of growling engines, honking horns, screeching brakes. Finally—she had no idea how much later—the car jerked to a stop. Only then did Ginger realize she’d squeezed her eyes closed during the breakneck chase. Now that the danger seemed to have passed for the moment, her senses went on hyperaware. Her arms were wrapped around the hard muscle of Hank’s waist. The fresh smell of his soap mixed with an arousing hint of tangy sweat, no doubt from the run, the adrenaline.</p> <p>His hand moved along the small of her back. “Ginger? Are you all right?”</p><p>“Just catching my breath.” She considered herself a strong woman, but she really wasn’t ready to open her eyes or sit up just yet. “Do we need to run again?”</p><p>“No. I think we’ve ditched everyone for now.”</p><p>“Okay.” She nodded her head against the coarse fabric of his pants leg.</p><p>This had to be the strangest conversation of her life, lying with her head in her friend General Hank Renshaw’s lap. She attributed some of it to the flashback of losing her husband, something she expected she would never fully get over.</p><p>Of course it wasn’t every day people shot at her.</p> <p>They’d also shot at Hank, this amazing man who’d stood by her for years, and she owed it to him to be strong because their hides weren’t out of the sling yet. Digging deep, she smoothed her frayed nerves and opened her eyes. Only to blink, once, twice, and still find the overwhelming evidence clearly in front of her in Hank’s lap. She wasn’t alone in becoming aware of feelings other than friendship.</p><p>Hank was very impressively affected by their physically compromising position.</p><p>Well damn. Here he was, fifty-five years old, and he felt about fifteen around this woman. There wasn’t much he could do about this second awkward-as-hell moment as he sat with a sexy lady parked in a car in the deserted woods. Not much he could do...</p><p>Except laugh.</p><p>He gripped Ginger by the waist and plopped her upright before he did something foolish—like act on the attraction aching through him. “Ginger, I’ve already told you once today that you’re hot. Doesn’t mean I respect you any less. We can talk about it more later if you’re of a mind to, but right now,” he paused and pulled out his cell phone, “we need to find someone we can trust.”</p><p>“All right.” She blinked fast, chewing on her bottom lip, which made him think of that moment her hands had lingered on his shoulders. “And thank you. For the ‘hot’ comment.”</p><p>“You’re welcome.”</p><p>She frowned. “Where are we?”</p> <p>“Near a place I know.” He’d had a good dinner here just up this mountain road. “I’ve been to Germany more times than I can count and made some trips up this way over the Bavarian border. This was all I could pull out of my memory when those guys were chasing us.”</p><p>“I think it’s extraordinary you could remember anything about the area given everywhere you’ve traveled.”</p><p>“Piloting, travel, navigation—it’s what I do for a living. Or rather what I did before these stars on my shoulders pulled me out of the cockpit and sent me off to deal with mostly political BS.”</p><p>It had been a lot easier in the days when he’d only had to worry about his own butt on the line. He and his crew, out on a mission. Not a civilian to protect.</p><p>Tonight, the stakes were high with Ginger’s life in danger for some reason he’d yet to determine.</p><p>He didn’t have much in his arsenal—a Mercedes, a 9 mm, and the two weapons he’d scooped off the dead guy. Along with his own cell phone and his BlackBerry. And of course his standard stash of currency and an alternative ID he carried with him when he traveled overseas.</p><p>“Hey, Ginger, before I start driving again and risk stopping somewhere for gas, you need to take off your shirt.”</p><p>“Excuse me?”</p><p>“Your shirt. Or suit coat or whatever you call it. I’m not up on women’s fashion. We have to get rid of that listening device in case someone has activated it. I want to be careful who I speak to.”</p><p>“Yes, right. I should have thought of that myself.” She shrugged out of her large overcoat, then worked her fingers down the gold buttons on the red suit coat, inch by inch revealing the satin camisole again.</p><p>He might not be up on women’s clothing, but somehow the names for women’s lingerie stayed in his mind just fine.</p><p>Hank swallowed hard.</p><p>He’d noticed her looks before, but never had them gut-slam him like this. That, combined with his deep respect for her and a long-standing friendship, made for a heady combination. Out of respect—and a need to keep his sanity—he looked away at the snowy landscape of pine trees and bare limbs.</p><p>Didn’t help. His eyes saw tall trees laden with pillows of snow, but his mind filled in the blanks of the rustling going on beside him. Ginger sliding her hand down the front of her camisole as she worked free the listening device.</p><p>The world had gone crazy today.</p><p>She extended her hand, thin wires wadded up. He took the listening device from her and crushed the mechanism in his fist.</p><p>Once satisfied it had been completely destroyed, he nodded. “All right. Time to start making some calls.” His phone had the best encryption available. Still, he would keep the conversations short and move locations. “Hopefully this is just a single incident and we can head back in for a late supper.”</p><p>He offered up his best consoling smile.</p><p>“That sounds lovely.” She reached under the front seat and came back up with the velvet bag.</p><p>Phone gripped in his palm, he hesitated in mid-dial. “You managed to hold on to that through the whole shootout?”</p><p>“I must have done it through instinct. I don’t remember thinking about it, really. But I’m certainly not leaving a priceless heirloom behind now.”</p><p>Staring at the steely woman beside him, Hank figured she took the word priceless to a new level, a thought more dangerous than any threats lurking behind the icicle-laden landscape. He wouldn’t risk anything happening to Ginger tonight, but he couldn’t deny his own peace of mind would seriously be at risk if they remained isolated together much longer. He’d only just barely willed away his physical attraction before the shock of having her life in danger, followed by the jolt of awareness over having her sweet curves up close to his body while he was hepped up on adrenaline, took hold.</p><p>He definitely needed to get his head back in the game—because it was his job and because he couldn’t risk anything happening to the woman next to him.</p><p>Hank clutched his cell phone and brought his mind back to the important task at hand. Time to start making calls and hope they netted results. Otherwise he and Ginger would be stuck making use of the Bavarian hospitality undercover.</p><p>Chapter 3</p><p>Ginger eyed the potato soup in front of her—the price-wise special on the tavern menu—and tried to force herself to eat.</p><p>Hank’s three calls from their wooded haven had been fruitless so far. None of the people had responded appropriately to his code word, so he couldn’t risk giving away their locale.</p><p>At least they didn’t have to worry about the calls themselves. She knew his phone was encrypted well enough that he should be able to make quick, untraceable calls. With his job, he had the best technology available.</p><p>Still, making contact involved some level of risk, no matter how fabulous the equipment. So he didn’t want to call too often, which left them in the back corner of a smoky old tavern recharging and regrouping.</p><p>In spite of the roaring fire in the garland-strewn hearth, she kept her overcoat on to mask her bright-red suit. She didn’t expect people to recognize her, but she didn’t want to stand out. Hank had done the same with his coat, keeping it on, as certainly his American uniform with all its medals and stars would draw dangerous attention.</p><p>Christmas music from an accordion combated the television and slapdancers to make conversation anonymous, but he’d stayed silent while he ate his bratwurst and potatoes. Was he thinking? Moody? Or just plain hungry?</p><p>Ginger glanced around the smoky bar as best she could, taking in the back exit, the bathrooms, the bartender and a couple of patrons at the counter staring up at the television. She wanted to scout out the whole place, but Hank had taken the best seat for viewing. No matter where they went, he always kept his back to the wall. He said it made him feel less vulnerable.</p><p>She understood the feeling as well. She didn’t much like having her back to this room full of diners when somebody could come through the door, guns blazing, at any second. So why hadn’t she simply sat beside him in the booth rather than plopping in the seat across from him with her own back so very exposed, dependent on another for protection?</p><p>Because Hank had stand-back vibes right now.</p><p>Ginger swallowed a bite of her roll—more like a ball of lead. To hell with this silence. She would force him to talk. They were equal partners in this. “What do you make of the callers not responding to your duress word?”</p><p>“Seems less likely that we’re dealing with a lone individual out to make an assassination attempt.” He filled his mouth with more food.</p><p>“A conspiracy?” She prodded, even though the grouch would have to chew for quite a while before he could answer.</p><p>“Possibly.”</p><p>“And?”</p><p>Sighing, he set down his fork. “We just don’t know the scale or the supporting faction. There were the threats made.”</p><p>“There are always threats made.” She leaned forward on her elbows, her blood chugging through her veins. She might not be able to shoot back at those people out there who’d taken potshots at her, but at least in brainstorming, using her mind, she felt like she was doing something. “It doesn’t matter how popular or unpopular a public official is, there will be threats from inside and outside the country.”</p><p>“You can be sure there are plenty of people working all those angles.” He picked up his fork and began attacking his meal again.</p><p>Great heavens, he was in a mood. She’d never seen this side of him before. He was as detached as any secret service agent.</p><p>Ginger gave up trying to start a conversation and shifted her attention to the television. At least the German sitcom would give her a chance to brush up on her local language skills.</p><p>Then the news break came through...</p><p>“Hank—” she tugged on his sleeve as the television report translated in her mind “—the news is stating an attempt was made on my life, but that I’m safely back in the care of my consulate. No one even knows I’m gone.”</p><p>“That’s good.” He nodded, a hint of a smile showing for the first time since they’d left the airport. “At least the average guy in the next booth won’t be looking for us.”</p><p>Only law-enforcement agencies—and whoever had started shooting at them in the first place if he had connections on the inside. “I really hoped up to now that this was a fluke attempt by one person and we’d get the all clear to come in.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The reality of it hit her. They were truly stuck out here. Alone. Not only was her life at risk, but she’d put Hank in danger, too. That more than anything struck her in the gut, stinging her eyes with tears.</p><p>What the hell? She never cried anymore. She knew better because she never knew when cameras might be trained on her. Except, maybe that was the point. For the first time since her husband had raised his right hand and become a senator, since she’d assumed his seat after his death, since she’d won reelection on her own merit—for the first time since then, there was no threat of cameras.</p><p>A tear leaked free. “Do you think officials have told my children and yours? I hate to think of how afraid they’ll be. They’ve already lost one parent too early—”</p> <p>Hank’s bodyguard facade slid away and her pal reappeared with a handkerchief in hand. He reached across to swipe the cloth over her cheek. “Hey, hey, now. Nothing’s going to happen to you on my watch. Besides, if your boys have been told what’s going on, they’ve also been told you’re with me. They know full well I won’t let anyone hurt you.”</p><p>She clutched his hand as she had done hundreds of times in the past. Except today the sensation of his skin on hers felt different against her heightened nerve endings. She almost tugged her hand back but found she really didn’t want to. “What do we do next?”</p><p>A double-meaning question if ever she’d heard one. Which way would he choose to answer?</p><p>Hank glanced at their clasped hands now resting on the table and then at the cell phone. His gaze lingered longer on the phone, his chest heaving with a sigh. “We’re on our own until the director of the CIA gets back to me or I can figure out a way to get us to a safe house I know.”</p><p>A safe house? “How far away is this place?”</p> <p>“If the weather is kind, we’ll be there by morning.” He squeezed her fingers. “We’re going to be fine, Ginger.”</p><p>She nodded, soaking up the comfort of his broad hand clasped in hers. She couldn’t help but be aware, though, of how in the past he would have given her a comforting hug rather than keep his distance. However, things had changed for them in a silly instant when he’d seen her wearing her favorite red camisole.</p><p>“I’m sorry to have pulled you into this mess, but lordy, Hank, I can’t help but be glad it’s you here with me rather than one of those babies fresh out of secret service training.”</p><p>“Thanks, but I wish we had a couple of those secret service babies around to watch our backs.”</p><p>“Fair enough.” She couldn’t help but think of their battered car outside. “How do you plan to take care of transportation?”</p><p>“It’s dark enough that the couple of bullets the Mercedes took shouldn’t be visible. I’ll slap some sludge up over the marks on the back bumper. For good measure, I’m going to swap out our license plate with someone else’s in the lot in case someone runs the plates.”</p> <p>“Do you think it has a tracking device?”</p><p>He shook his head. “The guy driving it was more of a rent-a-cop variety and the car is older. It’s as safe as we’re going to get. Stealing another car is risky. Someone might catch us. Even if they don’t, there’s also the risk of having them report it missing, which gives away the fact we came through here.”</p><p>“Okay, I can see that.”</p><p>“Lucky for us, Mercedes are a dime a dozen in this area, which offers a certain anonymity. That should buy us enough time to get where we need to be.”</p><p>Get there by morning? “It’s going to be a long night.”</p><p>“Then we’d better eat up.” He attacked the last bite of bratwurst in front of him.</p><p>She shoveled a couple more spoonfuls of soup in her mouth and forced herself to swallow. She reached for her roll just as Hank stared past her, frowning. Her jangled nerves jarred back to life. She followed the direction of his gaze. A burly man leaned over the bar to speak with the guy on duty. The bartender nodded, kept nodding, and Ginger could almost foresee his arm slowly rising, pointing...</p><p>Directly at them.</p> <p>Her heart picking up speed, she shot out of her chair as Hank threw money on the table. He slung his arm around her.</p><p>She arched up on her toes to look back. “Duck your head. You’re too tall. He’ll see you in the crowd.”</p><p>Hank hunched, pushing his way through the throng, the bar full to the gills with holiday revelers. Ginger crossed her fingers the back door didn’t have some kind of alarm because Hank had pointed them in that direction and there would be no time for changing course.</p><p>They pushed past a couple on the fringes of the dance floor and made it to the bathrooms by the exit. She exhaled her relief. The door seemed to be nothing more than a simple wooden variety.</p><p>Hank twisted the knob and—crap—an alarm blared.</p><p>He didn’t even have to say run this time. She began to sprint only to have him scoop her up again. She really needed to invest in some more practical shoes before this night was over.</p><p>Snow hammered down from the sky—a blessing and a curse. A few steps into the storm and already she couldn’t see the tavern behind them, which meant their pal couldn’t see them either. Only the faint light of the tavern sign managed to flicker through the hammering downpour of snow. Hopefully, their tracks would fill quickly as well.</p><p>Hank tossed her in the car before scrambling half over the hood to take the driver’s seat. The Mercedes fired right up and dodged around two incoming cars that might have slowed down their pursuer. They were safe for a little longer. But in the bad-news department...</p><p>“Hank, I don’t think the weather is going to cooperate with your timetable to reach the safe house.”</p><p>The weather was definitely not cooperating.</p><p>Hank had been scavenging through his memory for a place to take shelter from the snowstorm pounding the Mercedes. The blasting heater couldn’t completely combat the frigid nighttime temperatures. Ginger shivered beside him, silent since they’d left the tavern. Luckily, no one seemed to be following them along the winding mountain roads.</p><p>However, the storm and remote locale also ended any hope of cell phone communication.</p><p>He didn’t expect to have reliable connections back any time soon either. Plus, the crummy weather conditions only allowed for a crawling pace. With ice sheeting from the sky, it wouldn’t be long before this road closed down, too. While he trusted his driving skills, he’d already watched countless cars spin out and off into ditches, more than once taking other vehicles with them. Very likely someone could hit the Mercedes.</p><p>Yet, on the bright side, if the storm kept them from moving, it would also keep whoever had been shooting at them from gaining speed as well. “Are you okay over there?”</p><p>Ginger nodded without taking her eyes from the road, a solid wingman from the get-go, calling out reports on conditions and sliding vehicles after translating updates from the radio. But she’d been quiet the last few minutes while the station switched to holiday music. “Just thinking. Wondering how they’re going to explain away the cancellation of the big Christmas ceremony at the old chapel while still maintaining I’m not missing.”</p><p>He swiped at the front windshield, the defroster unable to keep the windows completely clear.</p><p>“Have you lost faith in me already? I’ll get you there.” Of course, first he had to find somewhere for them to stay before the sedan ran out of gas.</p><p>He recalled from a trip to the area a chalet where he’d done some sightseeing on his own for a couple of days before returning home. He could have sworn the small hotel was up here, but it had been five or so years ago. The place could have gone out of business or his memory could be faulty.</p><p>Not that he’d ever been wrong when it came to navigation. His wife had always sworn she was the one woman married to a man who actually didn’t need to stop and ask for directions.</p><p>Ginger held that bag of hers in a death grip even though the tires kept firm traction as they wound around a bend through a sleepy mountain village. “I had mixed feelings about this trip from the start, too.”</p><p>“What do you mean?” He’d learned long ago to trust instincts in the air and on the battlefield. And if nothing else, keeping her talking might relax her.</p><p>“I know when I signed on for this job, I gave up a significant amount of my personal time, but I really don’t like being away from my family at Christmas.”</p><p>“Your nerves are just fried. Plus you must be exhausted from all these whistle-stops on the goodwill trek across Europe. You definitely need to talk to your social planner when you get home and have her schedule more downtime. A human being needs to do things like take a drink of water, make an occasional trip to the bathroom.”</p><p>She grinned, pressed a gloved hand to her lips, a laugh tripping free. “Lord love ya, Hank, I do so enjoy how you can always make me laugh. You’re the only person I can relax around other than my kids and yours.” She sagged back with a sigh. “I knew I would be apart from my boys for Christmas and thought I’d prepared myself. It’s not like I’m always with all of them, but I’m always with at least one of them.”</p><p>He chuckled low, a little sad. “And it seems like I’m never with any of my children for the holidays, never really have been. We learned to celebrate on whatever days we were together.”</p><p>“I guess I do remember a few of those sorts of delayed birthdays when Benjamin was on active duty, but he didn’t stay in the Air Force long enough for the kids to remember him missing anything significant.”</p><p>“You’re lucky.” The memories of those years parted like the windshield wipers slapping away the sheets of snow. “My young’uns remember well. They would say it didn’t matter...but I knew better. A live-in nanny wasn’t enough, yet it was the best I could do.” He studied the road ahead, a narrow path cut by the slim double beams of light. Much like he’d lived his life. “I still wrestle with the guilt over not having gotten out of the military and taken some nine-to-five job.”</p><p>“Your children grew up into amazing adults, and they all joined the Air Force.” Her hand in a black leather glove rested halfway between them on the seat, reaching in comfort, almost there, patting. “I think it must mean they understand that for some people like you, the calling to serve in the armed forces is not something you can deny. It’s in your blood.”</p><p>“They sure each found their own paths. Alicia is one helluva a fighter pilot. That girl never took gruff off of anyone.” His daughter with the call sign “Vogue” had an eclectic style to go along with a strut that cut a swath through a very male-dominated world. Damn, but he was proud of her. He was proud of all three of his kids—even if his relationship was easier with some than with others. “Hank Junior and I don’t get to talk as much as I would like.”</p><p>“It’s tough flying in your father’s plane in the shadow of your father’s stars.” She leaned her chin on her elbow, staring out the window as they drove past a small pond where a few kids braved the weather to skate by the light of a bonfire.</p><p>“I try to stay out of his business.” More like his son tried to stay out of his old man’s way, which seemed to include not talking all that often.</p><p>“But then when it comes to Darcy—”</p><p>“Yeah, yeah, she’s my baby.” His youngest daughter had been kidnapped briefly as a teen in an attempt to get to him. So, of course, his knee-jerk reaction was to check up on her. He tried to rein himself in, and she was a tough cookie who didn’t hesitate to tell him when to back off.</p><p>He couldn’t stop a deep smile from digging into his face. He’d never admitted it to any of them, but Darcy had always been the one who reminded him most of himself. Actually Jessica had pointed out the similarity for the first time. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Why did he keep thinking of his dead wife today? It wasn’t that he’d forgotten about her. But as the years went by, he found he could make it through days, then weeks without thinking of her. She would always be a part of his past and a part of him, but his life had gone on.</p><p>A week ago, he simply would have turned to Ginger and asked her something about Benjamin, worked the conversation around to how she dealt with it all. Ginger had always been someone he could talk to.</p><p>Just ask her, damn it.</p> <p>Except suddenly the snow parted in a swirl and his chalet appeared, a holiday fresco painted on the outside. The gabled inn was small and snow-covered and welcome as hell.</p><p>Ginger shifted in the leather seat next to him, her exhale rattling along with the engine shutting off. “Not exactly how I planned to spend my Christmas week.”</p><p>He eyed the chalet where he would be sharing a room with his best friend, his hot best friend.</p><p>“Don’t give up on Christmas yet. With luck we’ll only have to hide for one night.”</p><p>This big fluffy robe sure didn’t hide as much as she’d like.</p> <p>Ginger stood in the bathroom doorway, gripping the tie around her waist. It certainly was a long sprint from here to the sleigh bed where she could dive under the plump comforter to wait for her underwear to dry. Oh, but the bed looked inviting and warm where she could sleep with the sound of the fire snapping, the smell of the evergreen garland decorations reminding her of home as she drifted off...</p><p>Except Hank sat on the edge of the bed. All six foot three inches of him taking up most of the mattress, his BlackBerry held in his hands as he typed away, oblivious to her.</p><p>Wait.</p><p>His BlackBerry!</p><p>Why hadn’t she noticed that before? Good Lord, the man was never without the thing. She’d been so focused on the cell phone, she’d never considered what he could do with e-mail and the Internet, especially with his encryption card. She realized her BlackBerry had been lost in the scuffle, so she hadn’t thought about it again since they’d left the airport.</p><p>Rushing past the roaring fire in the stone hearth, she padded on bare feet over to Hank, stopping by his knees. “Do you have a signal? Are you calling someone to come get us?”</p> <p>“The signal is flickering in and out. I’ve sent a message that we’re still safe. It may or may not have gone through. Beyond that, I’m not hearing anything back. But with things so unsure, I can’t risk broadcasting our location to whoever may be on the receiving end of the message.”</p><p>“We’re cut off.” Her knees went weak and she dropped to sit on the brocade wingback chair, holding the edges of the robe together while she stretched her legs to wiggle her toes close to the crackling flames. “We should make the most of this time and work on a list of who would want me dead.”</p><p>“And why.” His gaze skipped along her bare calves. “Reasons help.”</p><p>Sometimes her job really stunk. She tucked her legs underneath her. “You haven’t said ‘I told you so.’”</p><p>“About what?”</p><p>She toyed with the robe’s tie. “You wanted me to wear a bulletproof vest. If I had, you wouldn’t have had to worry about me so much when you were hauling me around that red carpet.”</p><p>Slowly he looked up from the BlackBerry, his deep dark eyes meeting and holding hers with a power that stilled her. “I would have worried about you anyway, Ginger.”</p><p>The wind howled. Sleet dinged the windows. And that undeniable attraction hummed along the thread tugging between them. She couldn’t ignore the muscular strength of him. The man undoubtedly still worked out. He had the kind of body a woman could curl up against. The sort she knew would keep her warm on cold nights, whether it be about sex or tucking her toes between those solid legs.</p> <p>She forced herself to swallow. Well, she had to so she could muster up enough moisture to speak. “Thank you.” Her mouth dried up again. She looked away from him, to his BlackBerry. “Back to the list.”</p><p>“Yeah, right.” He rubbed his thumbs over the handheld device. “There were the two threats that came in this morning from new terrorist cells that have popped up along the Russian border.”</p><p>Her cheeks puffed with an exhale. “I remember them from the briefings. You wanted me to bail on today’s meeting.”</p><p>“I wanted more time to gather intel,” he gently corrected.</p><p>“Let’s go over what we do have.”</p><p>“As I said, both groups are in their infancy, but looking to make a statement. The one we believe sprouted out of Rubistan has yet to lash out.” He scratched a hand over his five o’clock shadow. By the bed, the digital clock’s glowing little red numbers silently shouted out a reminder of the lateness of the hour—12: 13 a. m. “They’re still training and posturing.”</p><p>“Unless today was their opening act.” Her eyes slid from the masculine cut of his jaw to his salt-and-pepper hair, trimmed short to military specs. The sprinkles of gray spoke of experience and wisdom. Strength. All of those things made him more appealing, especially on a day when she desperately needed a strong protector at her side.</p><p>Damn it, she didn’t want the heartache of another serious relationship. Why couldn’t he do something totally obnoxious? She forced her mind to stay on the task at hand. “And the other group?”</p><p>“Has risen from the ashes of the suppressed People’s Revolutionary Council in Cantou. They like to dabble in nuclear weaponry. They’ve already tried to park a bomb in a duffel bag at a German train station. Luckily, the bomb was defused.”</p><p>“Then they’re equal opportunity offenders.”</p><p>“Apparently so.” He cricked his neck from side to side, the white uniform shirt open and displaying a tempting hint of chest. “We have our normal assortment of call-in and write-in threats that come with every event. I wish I had the stack in front of me so I could review—”</p><p>“Hank, you know it takes weeks, sometimes months to trace through all of those reports. It would be a duck shoot, hoping we lucked into the right one in time for it to make a difference tonight.”</p><p>“Instincts count for something when you go duck hunting.”</p><p>“Do you still think they haven’t told the kids about us being missing?”</p><p>“Honestly? I don’t know.”</p><p>She stretched her legs in front of her, cracked her toes, then felt the weight of Hank’s gaze on her calves again. The logs in the fireplace snapped and popped.</p><p>Hank’s chest expanded in his uniform shirt. “We’ll need to get back on the road the minute the weather breaks.”</p><p>“Of course.”</p><p>“You should turn in now and nab as much rest as possible.”</p><p>Go to bed? Did he intend to get off the mattress before she stretched out? Or was he going to sleep, too?</p><p>She couldn’t imagine he would give up his watch even though he should snag a couple of hours of shut-eye.</p><p>“Uh, I’m going to put my clothes back on first, in case we need to leave quickly.” She would simply suffer through damp underwear.</p><p>She sprinted for the bathroom and slid back into her clothes, minus the panty hose and high heels. If she’d been alone, she could have slept in the camisole and tap pants...She couldn’t resist the grin that thinking of how that would surely make Hank stop in his tracks brought to her face.</p><p>“Ginger,” his voice called through the wall. “We’ve got an e-mail.”</p><p>Chapter 4</p><p>Hank jostled the weight of the BlackBerry in his hands as well as the weight of the message in his mind. Could he trust the simple text on a day when shots appeared to have come at him and Ginger from allies? Maybe even from within their own camp?</p><p>Ginger sat beside him on the edge of the bed, her fresh-washed hair damp and tousled and tempting right beneath his nose. “Do we trust the all clear to come in?”</p><p>“It’s not as if we can leave yet with the snowstorm. Once the weather does cooperate, we really don’t have a choice but to take this one cautious step at a time.”</p><p>“Basically, then, the e-mail changes nothing tonight.” Her bare toes curled into the carpet, a sexy temptation, a woman’s bare feet and a stretch of n**ed leg leading into the red skirt.</p><p>“Afraid not.” He pulled his attention back onto the BlackBerry, a much safer place to look at the moment. “We’re still captives of the weather.”</p><p>She scratched the top of one n**ed foot with the toes of her other foot. Damn, he was developing a foot fetish.</p><p>Hank rose from the edge of the bed, dimming the lights one after the other on his way. “I’ll sit over here and see what other information I can milk out of this BlackBerry. You should try to sleep while you can.”</p><p>“All right. I know it’s senseless to insist you need sleep as well.”</p><p>“I’ll rest, catch catnaps. I’m used to pulling long shifts.”</p><p>Pivoting on her heels, she snorted, mumbling something he could have sworn sounded like “pigheaded men.”</p><p>He turned away and tried not to listen to the sound of rustling sheets. Good God, how long would it take the woman to find a comfortable spot? A second before his sanity snapped, the sounds quieted.</p><p>“Good night, Hank.”</p><p>Her voice carried across the room with an unmistakable intimacy.</p><p>He cleared his throat and forced words free. “G’night, Ginger.”</p><p>He tapped keys on his BlackBerry and lucked into a solid Internet connection. At least he could do some research on the two terrorist groups that had made the death threats. Was there a significance in the date, this season of unity and hope?</p><p>Or was he chasing shadows? He’d been so certain there had been gunshots coming at them from within the protective detail. Everything had happened so quickly, he hadn’t recognized each of the faces well enough to know if the shooters were from local forces or their own. He could have sworn at least two of the people who should have been protecting Ginger had been aiming at her.</p><p>Hank kept tapping through his Internet search, fruitless though it might be, but at least he was doing something. Inaction wasn’t an option.</p><p>Especially once those sheets started rustling again. And again.</p><p>He glanced over his shoulder. Ginger thrashed in her sleep. Her feet kicked at the covers as a low moan slipped from her lips.</p><p>Hell. No question, this day was the stuff nightmares were made of.</p><p>Hank holstered his BlackBerry and shoved to his feet. Four long strides took to him to her side.</p><p>“Ginger,” he said softly, cupping her shoulder in a careful hand, not wanting to startle her awake. “Ginger, honey, it’s okay. You’re safe.”</p><p>Her eyes stayed tightly shut, another moan slipping free. Apparently the nightmare had deep talons. He knew the sort well from years of combat.</p><p>Waking her wouldn’t help. She would only remember the horrors all the more vividly. If he could soothe her back into a deep and peaceful sleep, with luck she wouldn’t remember the terror come morning.</p><p>He hadn’t been able to take her to safety yet, but he would give her a serene night’s rest. He could help her ease the tight grip of her manicured hands on the sheets. Hank couldn’t help but stare at her bare ring finger where Benjamin’s family diamond set had once rested. Now she only wore a simple band on her right hand, a ring with her children’s birthstones.</p><p>Right now he would sacrifice anything to lie there with her. His want warred with his need to continue researching on the Internet, hoping to luck in to some answer.</p><p>Ultimately though, as she thrashed from side to side, her comfort was too damn important to him.</p><p>Mission set, he stretched slowly beside her, his back against the headboard. He slid an arm along Ginger’s shoulders and sure enough, she curled against him with a sigh and stopped kicking. He couldn’t ignore how right it felt to hold her there, her soft cheek on his chest, her breath against his neck. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He just wished he knew who she’d reached for in her sleep.</p><p>Sunrise slatted through the small part in the brocade curtains. Ginger sat at the tiny table, surprisingly rested after only five hours sleep, and munched away at an apple from the complimentary basket. She’d also made use of the room’s coffeepot, but keeping busy did nothing to ease her nerves.</p><p>Reality glared beside her steaming mug in the shape of an ugly black gun Hank had left with her while he took his shower.</p> <p>She had no doubt that it would be the world’s fastest wash up.</p><p>Sure enough, the bathroom door opened and Hank’s broad shoulders filled the opening. He wore his uniform again, just the shirt and pants, the jacket with its medals and his long overcoat were hanging in the closet.</p><p>In the quiet moment before they had to go back out beyond the safe walls, the reality of all they’d been through—all he’d risked for her—crashed down around Ginger again. “Thank you.”</p><p>“For what?” He scrubbed a towel over his short buzz of hair.</p><p>“For putting yourself between me and the gunfire yesterday. For finding this safe place for us. For keeping watch so I could sleep.”</p> <p>“That’s my job.” He tossed away the towel as easily as he brushed aside her words.</p><p>“I know, but you still deserve to be thanked.” She rose, leaving her uneaten breakfast, her nerves too on edge for her to put food in her tumbling stomach anyway.</p><p>He retrieved his uniform jacket and overcoat from the closet. “You’re scared by what’s waiting outside that door.”</p><p>Perceptive man.</p><p>“I’m human and that safe house seems far away. I want to see my children again.” She reached to stroke his jaw and couldn’t help but linger along his freshly shaven cheek. “And I don’t want anything to happen to you because you’re protecting me.”</p><p>“I’m good at what I do and I’m lucky. Look at how old I am.” He winked before finishing buttoning his uniform jacket and donned his overcoat. He extended her long coat for her as well. “I’ve beaten the odds for years. Now let’s go.”</p> <p>He tucked the gun into his pocket, thrust her velvet bag into her hand and reached for the door. The wink and that twinkle in his eyes combined with all the adrenaline of the past twenty-four hours did her in.</p><p>That—and the memory of the dent in the pillow next to hers.</p><p>Ginger covered his hand with hers on the doorknob. “Hank. Wait. Before we go, there’s something I have to do first.”</p><p>She couldn’t stop what had been building since the second he’d walked in on her yesterday as she stood in her camisole and she’d seen that flame in his eyes. Since she’d felt an answering heat stoke deep inside her. She saw the question in his gaze. Then the realization. Ginger arched up on her toes and, thank goodness, she hadn’t walked out on this branch alone because Hank’s mouth met hers.</p><p>A first kiss. At her age, she’d thought she was past that teenage tingle of awe shimmering all the way to her toes. Apparently not. Her lips parted under his to admit the bold thrust of his tongue.</p><p>Nothing teenage about that. He was a hundred percent mature and experienced man.</p><p>She looped her arms around his neck and molded herself to him. She’d denied this part of herself for so long it seemed she’d stored a wealth of feelings that were now overflowing. So much so that she feared she might not be able to leave the room for a long time yet, a dangerous proposition for them—literally. They needed to leave.</p><p>Ginger forced herself to slide her hands from around his neck down to his chest, drawing her mouth from his kiss, another, then a final nip away. “Okay, we had to get that out of the way or the car ride was going to continue to be really uncomfortable. Now we can go.”</p> <p>Her feet not nearly as steady as she would have liked, Ginger scooted past Hank out the door. She heard his muffled curse as he made tracks after her, which made her realize she was even more shaken than she’d realized since she should have let him check the halls first. Well, too late now.</p><p>This whole “kiss experiment” had backfired on her. She’d hoped by getting it out of the way, the awkwardness would dissolve. Instead, she’d only made things worse because no way could she have predicted the power of her reaction. She couldn’t afford this kind of distraction.</p><p>And there was a teeny-tiny part of her that was more than a little scared by the intensity of the moment. She really didn’t have the time or emotional energy to sort through all of this now.</p><p>Her best bet for today? Pretend this hadn’t happened and try to regain their old footing as friends.</p><p>So damn close.</p><p>They’d almost made it to the safe house. Hank couldn’t believe that, after all his worries about gunmen and traitorous moles, they’d been stopped by a simple flat tire and a worn-out spare.</p><p>Hank figured the best way to hide today would be to lose themselves in a crowd of shoppers while waiting for the Mercedes’s tire to be patched. He’d considered renting another car and hoping they made it to the safe house before the credit card could be traced, but the small village only had one rental place and it had been sold out for the holidays.</p><p>And to think the safe house was just a few more miles down the icy road.</p><p>His and Ginger’s day driving through small towns had been long and tense, but December twenty-third was close to over. He hoped this would be their last stop. No more nights alone together.</p><p>He couldn’t let himself think about how damn good—how right—it had felt to spend the night with her tucked against him. He hadn’t been able to give up the chance even once she’d settled. Instead, he’d simply retrieved his BlackBerry and done his research while holding her.</p><p>A bittersweet pleasure he’d thought never to repeat—except then she’d kissed him and now he didn’t know what to think, except that they had to get through this day.</p><p>The tiny town overflowed with last-minute holiday shoppers clutching bags and the hands of small children. Old-fashioned cast-iron streetlamps adorned with wreaths and ribbons lined the street, ready to flicker to light when the sun went down in the next couple of hours.</p><p>With his overcoat covering his uniform, he and Ginger could be locals even—as long as they kept their mouths closed. They actually blended in with the Christmas mayhem as snow flecked from the sky.</p><p>He searched the press of bodies around them, suspicious of each bump and jostle of every passerby. He focused on all the details on all the open-air stalls lining the thoroughfare. “Come on. Let’s duck out for the next half hour until the tire is ready.”</p><p>He steered her past a stall selling mugs of warm gluhwein—mulled spiced wine. Pushing wide a jingling door, he nudged her inside a tiny shop, away from the crowd.</p><p>Ginger stomped the snow off her feet, then glanced around, sighing. “A children’s store. This sure brings back memories.” She strolled past a display of toy dump trucks, her gaze lingering. “Of course, it’s different shopping now since they’re all grown up.”</p><p>“Not that different for me now. I have a granddaughter, remember?”</p><p>“Alicia’s daughter.” Ginger smiled, the day’s worry almost sliding from her features. “Yes, we should find something for her. And does Darcy know the gender of her baby yet?”</p><p>His daughter had called just last week with the news. He’d been meaning to tell Ginger, but the grind of this tour had never given them time alone. How strange it had taken an attempt on her life to give them a moment to themselves. “Darcy and Max are expecting a boy.”</p><p>“So you have one of each to shop for. Definitely fun. Congratulations!”</p><p>“Thank you.” He’d been thinking of Jessica a lot lately, and how she’d missed out on seeing their grandchildren. Sharing these firsts with Ginger helped ease something inside him.</p><p>Then a hint of guilt pinched, surprising him. It had been a long time since his wife’s death, twenty-four years. Must be the holidays making him sentimental, reminding him of holidays past.</p><p>Damn it, Ginger was an important person in his life and he owed her better than half his attention. “What are you thinking about?”</p><p>She nodded toward the back corner where a Santa in traditional long robes passed out chocolates to children. “Of the history of Santa Claus.”</p><p>“Saint Nicholas?”</p><p>“Yes.” She pulled her gaze away with a nostalgic smile, trailing her hand over a wooden train set. “I was thinking of when Jonah heard my Dutch grandmother refer to Santa as Sinter Klaus. He thought she’d said Senator Klaus, because his dad was a senator, the word made sense.”</p><p>She’d always had a soft spot for her youngest, Jonah. Hank understood well how tough it was to let the youngest leave the nest. His daughter Darcy reminded him often enough that he needed to quit looking over her shoulder. She was a totally qualified and safe aviator.</p><p>Seemed like just yesterday he’d been shopping in toy stores for Santa Claus—or Senator Klaus—gifts for his children. “Kids make the holiday, no question. Mine were always very particular about having their own nativity set.”</p><p>“I didn’t know that.” She glanced up at him in surprise. “Now that I think back, I don’t believe I’ve seen your house decorated for Christmas after Jessica...”</p><p>“Right.” He shrugged past that guilt pinch again. “When they went shopping to pick out a crèche, it took them forever. Somebody didn’t like the sheep in one or the angel in another.” He paused by a shelf of toy planes. “I was TDY, and they about drove their nanny crazy searching. Then Alicia figured it out. Why buy a matching set? They each put together an eclectic nativity.”</p><p>“I like that.”</p><p>“We were never a family for the coordinated decorated tree. Alicia, my child of the unmatched flair, would have painted all the glass decorations different colors anyway.”</p><p>“Then she definitely won’t want this little dirndl dress for her daughter. How about a polka dot fur jacket?”</p><p>“Perfect.” He glanced at his watch and out the shop window. “Time to go.”</p><p>“Of course.” Her face sobered as she passed the tiny coat to the cashier to wrap.</p><p>He hated that this trip had turned so wrong. “I think it’s wonderful that you’re donating this crèche when it obviously means so much to you.”</p><p>“It’s just a material possession.”</p><p>“Just a thing? More like a priceless antique.”</p><p>“You know I don’t like to talk about money.” She took the wrapped package from the cashier.</p><p>“Spoken like a woman who has cash to burn.” He made a more than comfortable living as a general and had invested wisely over the years. But he didn’t have millionaire attached to his name like the Landis family—nor had he ever aspired to such. He’d always kept his eyes focused on missions rather than mansions.</p><p>To be fair, he’d never seen any sign of materialism from Ginger. “You get tears in your eyes every time you look at that bag. It’s obviously priceless for more reasons than the money.”</p><p>“It’s been in the Landis family for fifty years. There are certainly some sentimental memories attached.”</p><p>“Like the Senator Klaus story.”</p><p>“Exactly. Matthew and Kyle used to argue every year over where to put the wise men.” She strode past the mulled-wine stand back into the bustling crowd. “Matthew is such a traditionalist, like his father. He wanted them right there in the manger. Kyle, however, pointed out that the wise men really didn’t show up until two years later, so they should be positioned somewhere outside the manger.”</p><p>“Careful.” He reached to slide his hand between the velvet bag and a trio of children rushing past. Ginger was carrying around a flipping mint, for God’s sake. What if one of those kids had been a purse snatcher? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He frowned.</p><p>Another possibility hit him. Why had he never considered that Ginger might not be the target, but rather the priceless artifact she’d been carrying? He slid his arm around her shoulders and tucked her closer to his side, making faster tracks through the press of humanity.</p><p>Ginger shot a quick, startled glance up at him before continuing, “Every year, my little smart-aleck son would cradle those three porcelain antiques and shake his head, saying, ‘Two years, for Pete’s sake. That makes them the three wise slackers, if you ask me.’”</p> <p>“That certainly sounds like Kyle.” Hank could envision the boy saying something like that, except Kyle wasn’t a boy anymore. He would be turning twenty-seven soon.</p><p>Her boys had grown up in a blink. He’d tried to help out when he could, but being on the road so much, he’d barely been there for his own kids. Ginger had done a damn fine job with her sons while launching her own political career.</p><p>She was one helluva strong woman. He’d taken her presence in his life for granted for a long time.</p><p>Why had he needed a scrap of red satin to open his eyes to the fact that perhaps they had something to offer each other besides friendship? For a supposedly world-class military strategist, he’d certainly missed an obvious answer right in front of his eyes.</p><p>He and Ginger could offer each other something more if only he could get them both home safely.</p> <p>He glanced down the road to see if their car had been pulled around to the front of the garage yet as the mechanic had promised to do when finished, but no luck.</p><p>Damn it, what was taking so long to fix a simple flat? The hair on the back of his neck stood up in that battle-honed sense that something wasn’t right.</p><p>Screw waiting around for the mechanic to pull his car around front. He was going to light a fire under the man. The risk of staying out in the open was too high. He needed to get Ginger to that safe house now.</p><p>And pray the all clear was authentic.</p><p>Chapter 5</p><p>And just when she’d thought they were in the home stretch.</p> <p>Damn.</p><p>Ginger clutched Hank’s tense-as-steel arm and stared at the strange man kneeling beside their car inside the repair shop. His finger probed one of the bullet holes.</p><p>That by itself wouldn’t have been too much cause for concern. Except the towering man standing beside him peering into the crowds with narrowly slitted eyes sent a shiver down her spine that had nothing to do with the brisk breeze winding a corkscrew path around the shoppers.</p><p>Here she’d been worried about something else being wrong with the vehicle. It had held out far past her expectations, surviving a shoot-out, a mad chase and record-breaking storm conditions with only a simple flat tire. Only to be finally detected by...who?</p><p>Friends or enemies? “Hank?”</p><p>She tugged on his sleeve only to find him already evaluating the situation with keen eyes. “Keep close. Be ready to make fast tracks back into the crowd.”</p><p>The tall man staring into the shopping masses brushed gazes with her, looking past. Then back.</p><p>Holding.</p> <p>His hand slid inside his long duster, a hint of lethal black gun showing.</p><p>Ginger curled her toes in her shoes. “Bolt?”</p><p>“Yeah.” Hank slid his arm around her waist and tugged her into the anonymous press of merry humanity.</p><p>Her heart pounded in sync with their feet, in time with the packages slamming against her legs. “What are we going to do? You said the car-rental place was sold out for the holidays. And you didn’t want to draw attention by stealing a car. You said we’re close. Are we near enough to walk?”</p><p>“No.” He kept his arm hooked around her, guiding her through the milling shoppers while making sure they stayed side by side.</p><p>“Then what are you doing?”</p><p>“Thinking. Hoping.”</p><p>He hauled her into the anonymity of a cluster of people listening to a quartet of carolers. She wanted to ask more about his “hopeful” plan. Hank always had contingencies lined up for emergencies and this most definitely qualified. She chewed her lip and waited while he stared with searching eyes along the street vendors and stalls to where their pursuer stood by a living crèche, no longer chasing them for the moment, thank heavens.</p><p>Hank dipped his face to her ear, his smile brushing her cheek. “Forget worrying about getting caught stealing a car or walking. I’ve just found our ride.”</p><p>“You have?” Of course he had. When had Hank ever faltered? Apparently she was the only one who had fears and doubts. “I wouldn’t have thought a village this small would have two car-rental places.”</p><p>“Oh, it doesn’t have another car-rental place.” His smile caressed her cheek, swirling away some doubts but stirring up a lot more questions.</p><p>He pointed toward a line of decked-out sleighs.</p><p>Ginger tugged the sleigh blanket over her legs to ward off the chill, bells jingling with each step of the two horses’ feet through the snowy landscape. Hank had estimated an hour from the village to the safe house by this mode of transportation, which meant they should be arriving in no more than fifteen minutes since he’d paid the driver extra to haul butt.</p><p>So far, so good. No sign of their lurking bad guy buddy from the village, and the sleigh ride actually provided a bit of anonymity from the main thoroughfare.</p><p>Hank’s warm frame radiated heat beside her, close, so close, at times she thought he might even kiss her again. Her heart kicked up pace faster than the cars swishing past on the country road beyond the mask of pine trees.</p><p>Their driver seemed to be making good time, happily humming along atonally to whatever he was listening to on the headphones peeking from under his cap.</p><p>The snow-laden trees passed in a blur, ancient cottages tucked in the woods at unexpected places, their chimneys puffing smoke into the evening air.</p><p>“Here,” Hank growled low, pressing something solid into her hand. “You may need this.”</p><p>She looked down to find a revolver in her hand. “What do you mean? The e-mail said all clear at the safe house. I can understand why you didn’t want to risk any stranger coming to pick us up. But what’s wrong with us going to a known entity?”</p><p>“Contingency plan.” He kept his voice low, soft enough not to be overheard by the iPod-addicted driver in the seat in front of them. “If something happens to me.”</p><p>She swayed, the thought, well, unthinkable. Her fingers closed around the weapon, which also happened to cause them to clench around his hand. “All right.”</p><p>“Do you know how to use it?”</p><p>She welcomed the smile his question brought. “I was shooting targets in the woods with my daddy before I got my driver’s license.”</p><p>He winked and released the gun. The ominous black weapon rested in her lap now instead of her precious crèche, which lay within reach at her booted feet. She covered the gun with the red plaid blanket, then reached to secure her hood around her head while the wind combined with their brisk ride to try and tear off the cover.</p><p>Hank flipped up the collar of his coat to protect his ears—simple, but efficient, much like the no-frills man himself. “We don’t have much time left to talk, Ginger. Tell me more about the family crèche there. Is that something from your Dutch grandma’s side of the family?”</p><p>“No, actually, it’s a piece from Benjamin’s family.”</p><p>“Do you remember anything more?” He kept one gloved hand in his coat pocket—undoubtedly around his gun—while the other stayed around her.</p><p>“I seem to recall his father bought it for his mother for Christmas about fifty years ago.”</p><p>“Anything else?”</p><p>“What are you getting at?” She rubbed her hands together under the blanket, then placed them back on the weapon.</p><p>“Have you considered that someone may want the crèche instead of you? You said yourself it’s a priceless piece of art.”</p><p>“Oh, wow,” she stared at the velvet purse at her feet. “Wow. That makes an obvious kind of sense. Does it have any bearing on what we should do today?”</p><p>He brushed at a branch that came close to swatting their heads. Snow still showered down around them, drifts building in the sparsely populated outlying area of the village. “My gut’s telling me the safe house really is our best bet.”</p><p>“Okay.”</p><p>“That’s it? Okay? No questions about whether or not there are moles on the inside waiting there to shoot you since I’ve given you this gun?” He glanced down at the lump where the blanket covered the weapon.</p><p>“If your instincts tell you the odds are better for us to go in, then I trust you.”</p><p>“In my job.”</p><p>With those three words and their implication about other aspects, things heated up between them. She tried to think of how to answer him honestly. “You know I keep you with me because you’re the one person in my life I can totally trust. Too many times I’ve found out people only wanted me for access to the Landis fortune or a senatorial ear.”</p><p>“What if I let you down? I’m not a perfect man.”</p><p>“You’re mighty close.” So why couldn’t she bring herself to throw caution to the wind and fling her arms around him for another kiss?</p><p>Hank Renshaw was a lot of man to live up to. She’d loved and lost one of those larger-than-life men before and, lordy, they left a huge void behind them.</p><p>Her hands starting shaking at just the simple thought.</p><p>Simple? Not simple at all. Losing Benjamin had shaken her world to the foundation. Nothing, nothing had compared to the agony of that time. Only throwing herself into her job and being a mother had gotten her through.</p><p>Any dating she’d done had been totally superficial. She realized full well after that kiss with Hank—after knowing the man—things with him could never be uncomplicated. She stared at the winding street ahead, full of ice and heaven only knew what other roadblocks or hazards.</p><p>She wasn’t one to take the easy route. A person only had to look at her life to see that.</p><p>Hands still trembling inside her leather gloves, she leaned closer to absorb more of his body heat. Sure enough, a jolt of awareness shimmered up her arm, an echo of what she’d felt when they’d kissed.</p><p>When his gaze had locked with hers back at the airport lounge.</p><p>Things were definitely different. They couldn’t resume their old ways. She was scared to her cold toes. She just hoped she could continue to muster the resolve she’d used in countless international negotiations to carry her through figuring out where this attraction would lead them.</p><p>Hank slid his arms from around her and reached under the blanket to take one of her hands in his, holding tight. “Do you need another blanket? You’re shaking pretty hard.”</p><p>Touching him, she could swear he’d already piled on a stack of blankets, the comfort of him steaming through her. “I just want us both to get to that safe house in one piece.”</p><p>She squinted to peer through the blur of trees as best she could, and the roadway behind the traffic seemed sparse but steady. No suspicious vehicles slowing to watch them. “Do you think they were on the lookout back there since we were close to the safe house? Maybe they were just curious about the car because of the damage.”</p><p>“Anything’s possible right now.” He tapped the driver on the shoulder. The college-aged student peeled aside his hat and pulled out one of the earpieces while Hank called out some final directions. Hank eased back in his seat.</p><p>Before she had time to think overlong about what he’d said, the sleigh whipped onto a tiny rural road alongside a small row of old townhomes in a converted farmhouse. Window boxes were decorated with pine boughs and white lights.</p><p>Hank leaned over as if to kiss her and whispered in her ear. “Pretend we’ve come to visit our European cousins for the holidays.”</p><p>His mouth sketched across hers before reaching over the seat to pass her the crèche and one of the packages. He paid the driver and helped her from the sleigh, looking for all the world like visiting guests. Except she knew his hand in his pocket gripped a 9 mm as they trudged through the snow toward the corner unit, where a decorated tree glowed in the window. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The door swung open to reveal a dark-haired man wearing corduroy pants and a heavy cardigan. “Will-kommen! Gruss Gott!” He welcomed them with a thick German accent, puffing away on a pipe. “We’ve only just started to decorate the tree.”</p><p>He pulled them both into a hug before lumbering lazily down the walkway to pay off the sleigh driver.</p><p>Seemingly in no hurry, their “host” escorted them into the small abode, tugging the door closed behind him. In one of those odd quirks she should have been used to by now, the agent seemed to shed years from his age as he rid himself of his role as quickly as he pulled the pipe from his mouth and tossed it in an ashtray.</p> <p>The man’s smile faded. “General, Senator Landis, thank God you’re both safe.” He extended his hand, his German accent vanishing to be replaced by a nondescript mid-American-broadcaster-type voice. “I’m Special Agent Rodriquez. Let’s step into the briefing room to catch you up to speed on the National Security issues at hand.”</p><p>Twenty minutes into the brief, Ginger sagged back in one of the kitchen table’s wooden chairs. She could hardly believe her ears even as computers with the best world intelligence hummed all around them.</p><p>Could things have wrapped themselves up this neatly in the hour while she and Hank had been driving? “And you’ve questioned them thoroughly?”</p><p>Special Agent Rodriquez refilled the three coffee mugs, pulling down a couple more for the pair of agents in the back room. “It’s an ongoing investigation, but the People’s Revolutionary Council is claiming full responsibility for the attack. The Germans have two leaders of the local cell in custody.”</p><p>“Then I guess that’s it then.” Ginger took her refilled mug from the agent, her world still strangely off-kilter despite the thaw in her veins and the safety in her new surroundings. Was it because of what she’d shared with Hank? An unsettling thought that he could hold such sway over her emotions beyond just friendship because of a look, a kiss.</p> <p>A night in his arms.</p><p>Hank tipped his chair back, arms crossed over his chest. “There are more people in their group.”</p><p>“Very low risk. They’re disorganized with their leaders out of commission, and they’re not likely to strike in the same place so soon.”</p><p>Hank rocked his kitchen chair back and forth. “Fair enough.” Still he didn’t appear satisfied. “What about our cancelled appearances?”</p><p>“We told everyone the stress from the attack had aggravated the senator’s ear infection, and she was under doctor’s orders to rest. Since you’re in safely, we would like to invite those who missed meetings to attend the Christmas Eve dedication service, provided you’re still up to making the event, ma’am.” The agent reclaimed his seat at the table.</p><p>“Absolutely.” Ginger couldn’t fault how things had been handled. Everything seemed perfect, which meant there was no reason not to continue with the rest of her plans. “The chapel dedication is the most important part of this whole trip. Make whatever security arrangements are necessary.”</p> <p>“Ginger...” Hank’s chair thudded to the floor with an ominous thud. A stubborn thud.</p><p>“Hank, we can’t leave the country on this negative note. It taints all the progress we made in the weeks prior.” She stared him down, her mind set in spite of the fact she felt the same unsettling sensation inside of her that she saw echoed in his eyes.</p><p>However, she’d been in public service long enough to have had bad feelings come to nothing. She couldn’t cancel every event because of a feeling, and this one, passing along the crèche, had somehow become especially important to her for some reason she had yet to pinpoint.</p><p>So she locked on Hank’s gaze and held until he blinked first and shifted his attention to the special agent at the table with them.</p><p>“I want damn impenetrable security measures at that dedication ceremony, Rodriquez. No screw-ups this time. I want her wrapped in a fortress of protection.”</p><p>Hank couldn’t miss the irony of his wish as he stood at the medieval castle window, looking out over the historic fortress’s grounds. He’d wanted Ginger well protected and now he waited with her in an alabaster stone citadel that had withstood centuries of sieges and attacks.</p><p>He continued his perusal of the outlying snow-capped land as Ginger bustled behind him, settling into the room, putting away her clothes that had been brought over by the secret service. His room connected through a small sitting area. They’d been assigned the lord and lady of the castle’s quarters. He’d been placed close to her for protection, practical, but hell on the willpower since he would be spending the night here with her before tomorrow’s Christmas Eve dedication ceremony.</p><p>Even with his back turned, he couldn’t help but be tuned in to her every movement, his awareness of her pleasure or frustration over the smallest details of the room. Her sigh at the bathroom door meant there wasn’t enough elbow room. Her harrumph over the closet stated she didn’t approve of the musty scent. A quiet humming noise while she filled the dresser drawers relayed that she liked the flowery smelling pillowy things they’d put in there to scent up the clothes.</p> <p>God knows how he understood all of that since no one had ever accused him of being Joe Sensitive. But there it was.</p><p>And he would damn well lose his mind thinking about how much had shifted between them since he’d held her in his arms last night. Or kissed her this morning.</p><p>Better focus on the outside.</p><p>His eyes scanned a rocky, icy patch of scarred earth where he suspected there’d once been a moat. An ice-covered lake spread to the right, mountains along the left wrapping behind. Strategically, this had been a well-built home and he couldn’t deny the rush as he thought of all those old battles chronicled on the tapestries covering the walls.</p><p>How ironic that the castle had survived so much only to have the chapel razed by a fluke of nature fifty years ago. Lightning from a storm had sparked a fire, destroying the chapel along with its contents. The village had been devastated. The fundraising drive in this small town to rebuild the chapel had been a heart-tugging story—just the sort that called to someone like Ginger more than any big-city photo op.</p><p>One of the many things he admired about her.</p><p>As if drawn against his will, he turned on his boot heels to find her warming her toes by the fire. She toyed with the trailing end of the pine bough attached to the mantel, with red bows and silver glass balls. Her sigh of contentment seared right through him.</p><p>Their kiss that morning blazed in his mind and through his body as if it had just happened.</p><p>She turned to look at him, the flames from the hearth reflected in her eyes. He kept his gaze firmly off the looming four-poster bed with its poufy comforter across the room and a nice little spread of wine with holiday candies, fruit and nuts beside it.</p><p>The firelight brought out her blond hair, showcased the shadows of her every sweet curve, of her h*ps in formfitting jeans.</p><p>Her br**sts in that sweater—the woman looked fine in a sweater. He vowed to buy her lots of them, in every color. And yeah, these thoughts were leading him directly down one path.</p><p>Hell, he could stare at the moon and there was no ignoring the bed’s overpowering presence. In spite of all the danger—perhaps even heightened by the reminder of how easily everything could be taken away—they’d been working toward this moment all day.</p><p>His feet carried him to her with a surety he saw in her eyes along with those flames even if the breath she inhaled seemed a little shaky. He stopped in front of her and she dropped her extended legs, her feet resting toes to toes with his.</p><p>“So, Ginger, do I take my boots off and stay or not? It’s your call.”</p><p>Her face creased in a smile, her breath seeming a bit steadier this time. “Boots off, flyboy.”</p><p>She didn’t have to tell him twice. He dropped into the wingback chair opposite hers and slid his shoes off, dropping them to the floor, with a thud and thud, before he extended his hand to her. Without hesitation, Ginger glided up from her chair, sinking into his lap and his arms.</p><p>Her mouth met his and confirmed that the attraction, the draw he’d felt when they’d kissed earlier, hadn’t been a one-time thing. This was real. Intense.</p><p>Amazing.</p><p>He pulled her closer, tighter, her sighs encouraging as much as the press of her sweet bottom against him. His hands roamed over her back, under the hem of her sweater to find warm skin. He caressed higher, exploring and, hell yeah, enjoying.</p><p>Ginger cupped his face in her soft hands and eased away an inch. “Why did we never think to do this before?”</p><p>“Oh I thought about it.” And much more, but mostly in his dreams. He’d been so set on them as friends.</p><p>He’d been an idiot.</p><p>She smiled against his mouth. “Why didn’t you say something? Do something?”</p><p>“The same reason you didn’t.”</p><p>“You’re assuming a lot with that statement.”</p><p>He stared at her silently. Waiting. Yeah, he’d gone out on a limb by insinuating she’d been harboring feelings for longer than just this trip as well, but they’d always been honest with each other. He couldn’t see the benefit to either of them in holding back.</p><p>The defensive brace of her shoulders relaxed. “You’re right, of course. There were moments I wondered what would happen if I made a move on you.”</p><p>“Except you didn’t change things between us either, because we weren’t ready,” he said with a dawning insightfulness.</p><p>“And we are now?”</p><p>“I’m not sure about that,” he answered as honestly as he could. “At least, readier.”</p><p>She laughed low, then sobered. “Sex at our age shouldn’t be this scary. I thought fears about being emotionally prepared were for teenagers.”</p><p>“We’re wise enough to know this is serious.” His hands slowed on her back and he took a moment to absorb the feel of her shoulder blades. A simple touch, but the start of learning every nook and nerve. Baring themselves in that way wasn’t something to be taken lightly. “We’ve both been through a lot.”</p><p>Her palm fell to rest on his chest, a couple of pine needles from her fingers catching on his sweater. “We’ve both lost a lot.”</p><p>And wasn’t that the heart of why he’d held back for so long? The draw between them was intense. Almost too much. Could he—could they both—go through losing something this important again?</p><p>All such thoughts needed to take a hike or they would never end up horizontal on that bed together, and he very much wanted to land on that mattress with Ginger. Before he took it further, he needed to hear from her. “What do you want?”</p><p>“You.”</p><p>Because above all he did trust her, he didn’t need to ask anything more than that. He took her mouth again, not so gentle a meeting this time. No more questions or hesitation.</p><p>He skimmed the sweater over her head to reveal a matching bra. He could well lose his mind thinking about how she’d had all this hot lingerie packed away from the start of their trip across Europe. “I never would have guessed you had a weakness for lacy lingerie. You’re so down-to-earth and practical, but then there’s the red camisole, now this.”</p><p>“Practical or not, I’m a woman.”</p><p>“Believe me, I’ve never been more aware of that than I am at the moment.” He wondered what other luxurious lingerie she’d packed in her suitcase. His pulse hammered hard in his ears as his blood pumped through his veins in double time.</p><p>Hank unsnapped her jeans, revealing the top rim of green lace. He growled low, sliding his thumb over the rim of her panties. He grazed his knuckles along the creamy softness of her bare skin, which only served to stir a hunger to feel more of her. All of her.</p><p>An urge to have her now warred with the desire to stare at the sexy image of her standing in nothing but her bra and unsnapped pants. Her blond hair was tousled from their kisses, her bare feet with toes still curling and vulnerable, toenails manicured with white tips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>While he stared, she acted. Ginger gripped the bottom of his sweater and bunched the wool in her hands. With a smooth sweep that brought both her arms over her head in a move that had him swallowing hard, she tugged the sweater over his head, momentarily blinding him—damn it.</p><p>Then sight returned and he palmed the sweet curve of her bottom to bring her flush against him, skin to skin. It may have been a long time since he’d been with a woman, but he had a solid memory and he knew full well this female felt special.</p><p>Someone unique.</p> <p>He dipped his head for another kiss, his hand plunging into her soft hair again, releasing more of her floral perfume.</p><p>Need for her surged through him and he eyed the looming four-poster bed. Making love in the chair could be fun, and certainly worth considering for later. But he had something more intense and thorough in mind for their first time together.</p><p>Starting now.</p><p>Chapter 6</p><p>Oh my, she hadn’t expected to find this again.</p> <p>She’d been lucky to enjoy that toe-tingling passion with Benjamin. She’d only expected—maybe—to discover friendship with another man, with the warm comfort of a shoulder to rest her head against.</p><p>Even with the sizzle of their morning kiss, the inferno now pulsing through her, the urgency that sent her hands grappling at Hank with frantic need surprised her. Even shocked her. Ginger arched her back, pressing her br**sts against his chest.</p><p>Her jeans itched against her oversensitized skin. She wanted him to peel them off her. She’d missed being undressed by a man.</p><p>More than that, she’d missed undressing a man.</p><p>She wanted to see Hank. Her frenzied fingers found their way to his belt buckle. Then, better yet, she uncovered his zipper. He eased her from his lap until they both stood by the roaring fire. He locked his arms low around her, a good thing since her feet weren’t all that steady under her as she worked at unfastening his pants.</p><p>The raspy glide of his zipper sliding down, down echoed through the room. Hank’s pupils widened in response a second before his lids lowered to half-mast and his hands went into action.</p> <p>His thumbs tucked inside her jeans and began inching them off her body. She was more than happy to help with an extra shimmy and hop as his fingers skimmed over her legs. Ginger kicked the pants free and helped him out of his own until he loomed over her, tanned and toned.</p><p>Wow.</p><p>Just wow.</p><p>She’d seen him in swim trunks before and noticed he was a handsome guy, but goodness, had she been wearing blinders? Hank was all man. Hot, solid man. She wished she’d been ready for this sooner because she’d certainly been denying herself some major benefits in this friendship.</p><p>Ginger pointed one finger and planted it in the middle of his chest, pushing him backward one step at a time. “Bedtime, General.”</p><p>A smile dented one corner of Hank’s wind-weathered face. “Yes, ma’am.”</p><p>He let her topple him backwards onto the fluffy comforter. One slow step at a time, she advanced, kneeing up onto the bed until she straddled his waist. She brought some experience to this, and she intended to enjoy it to the most...</p><p>In case there wasn’t a repeat?</p> <p>The scary notion threatened to chill her at a totally inopportune moment. She focused instead on warming herself with the heat radiating from Hank’s muscular body and the crackling fire. She extended her arms in a gesture for him to finish undressing her. As his hands swept up to find the center clasp between her breasts, she couldn’t help but think about when he’d touched her there for the first time while fastening the listening device. Her world, her senses, had changed forever in that instant.</p><p>Another thought slithered through as she wondered how much more her world would change as they took these touches deeper, to the most intimate of caresses, by making love.</p><p>He rolled to his side, stroking her face before reaching off the bed to where his jeans had fallen when he’d kicked them free. “I don’t want to break the mood, but I planned, too. During our shopping, I picked up...” His hand came back with a condom.</p><p>“Thank goodness you thought of it because yes, there’s still the possibility, and heaven forbid I should be an unwed pregnant senator.” Yet she’d almost leapt into bed without protection.</p><p>Then he robbed her of the ability to think again with the stroke of his hands over bare flesh, his mouth to her breasts. And no way was she missing out on the opportunity to savor every inch of his muscular body, his chest, his legs, the hard hot length of him in her hand.</p><p>They weren’t inexperienced youths. She knew what she wanted, what she needed and she didn’t hesitate to show him. Thank goodness he had the smart sense and a strong enough ego to growl in appreciation.</p><p>She was a lucky woman tonight.</p><p>He tucked her underneath him and she hooked her arms around his shoulders, gliding a foot along the length of one of his legs. She couldn’t stop the purr of pleasure over the warm weight of him settling atop her, the unmistakable pressure of his arousal ready, so near. He smiled, and she held that image in her mind as her eyes drifted closed at the muscle-melting sensation of him sliding inside her.</p><p>She wanted to capture each moment of this into her memory but thoughts jumbled with each bold stroke of his body into hers. Somewhere in her scrambled mind, she realized that instincts were taking over. Her legs wrapped around his h*ps to hold on, tipping her h*ps for more, wonderful more.</p><p>She lost herself in the friction of sweat-slickened skin against skin. Touching. Tasting. Mumbled encouragement and appreciation and moans. Somehow in a distant part of her brain she wondered if their longtime friendship had brought a synchronicity of instinctive knowledge to their coupling, because this went beyond right.</p><p>With the building swell inside her, she feared it would end too quickly, yet he seemed to sense her frustration and slowed. Hank rolled to his back, shifting her on top, taking her to the edge again only to stop short. Time and time again, he teased her until she no longer worried about finishing fast at all.</p><p>“Enough.” She gripped, raked at his back with her nails.</p><p>“Not hardly.” He nipped at her shoulder.</p><p>Still, he tucked her beneath him again and began purposeful thrusts she knew...would carry her...to...</p><p>Yes.</p><p>Completion.</p><p>“Penny for them.” Hank popped a candied date into Ginger’s mouth, wondering what swirled around in that brilliant mind of hers.</p><p>How long had it been since he’d genuinely worried about the inner workings of a female’s brain? Not that he didn’t care what women thought or felt. But tonight, her emotions mattered on an intensely personal level and, for a man who dealt in a more factual world, reading chick nuances wasn’t his strong suit.</p><p>“A penny?” Ginger teased a sugar-glazed grape along his mouth. “We’re in another country. The currency won’t work.”</p><p>“You’re evading.” He scooped up a handful of almonds.</p><p>“You’re perceptive.” She snitched a roasted chestnut from his palm and rolled to her back.</p><p>He might not be known for being emotionally perceptive, but he could see when a person was avoiding answering. “We’ve known each other too long to misread.”</p><p>Her emerald eyes finally slid up to meet his. “What do you see then?”</p><p>“You’re scared,” he said with a sudden surety.</p><p>He waited for her to deny it...but she didn’t.</p><p>A sad smile tipped her kiss-swollen lips. “Seems silly, doesn’t it? I’m forty-nine years old, Hank. I’m not some young thing to get all fluttery.”</p><p>Not young? Maybe. But he couldn’t think of a time she’d looked more beautiful to him than now with her hair all tousled around her face, her shoulders bare above the covers, a sexy hint of whisker burn along her neck.</p><p>He weighed his words carefully. “When I was a ‘young thing’ I used to think fifty-five looked old, but now that I’m there, I don’t feel old. I believe the heart doesn’t have an age.”</p><p>She blinked fast. “Oh my,” she cupped his face, “I never would have guessed you’re a closet romantic.”</p><p>“Shhh.” He winced in exaggerated horror. “Don’t say it quite so loud. You’ll ruin my badass warrior reputation.”</p><p>“Your secret is safe with me.”</p><p>He could sense the fear in her as surely as he’d ever felt it radiating off any airman about to head into battle. He couldn’t deny some of it stirring in his own gut. He’d been there. Felt the debilitating loss. “I know how you grieved for Benjamin. I was there just like you were there when I lost Jessica. Love like that is only supposed to come around once in a lifetime.”</p><p>“Soul mates.” Surprisingly, the words didn’t carry any kind of reverence, more frustration. “It scared me, thinking of all those lonely years, my children so big already since we’d started having them so early.” She shook off the faraway look and rejoined him in the present, taking another one of the almonds from his hand. “The offer to take over Benjamin’s senatorial seat was a godsend. With all that was going on in Congress, I had something to dig my teeth into.”</p><p>“You’ve got fight in you, lady.” Total truth, he’d always admired that about her. He wondered why he’d never taken the time to notice all the wonder of Ginger before. “You would have found your way around the grief, but there’s no question it’s to our country’s advantage you channeled that energy into finishing out Benjamin’s term.”</p><p>“When I lost him, I just remember being stunned at how you survived losing Jessica. I mean, at the time, when she died, I understood the tragedy of it all. Still there’s just no way to fully comprehend until it happens to you.”</p><p>“You had the Congress. I had my small kids. Just about broke my heart watching Alicia trying to mother the two younger ones when she deserved a childhood of her own.” He shrugged his shoulders. “I had to keep plugging along.”</p><p>Her wise eyes filled with indecision. “So what are we doing here?”</p><p>She’d turned to him for advice before. Why did now feel different? Still, he pushed ahead to answer as he always did when Ginger looked to him for support. “Acting like damn fool teenagers with our hormones raging out of control.”</p><p>“Your hormones are out of control around me?”</p><p>How could she not know? “Can’t you tell? Good Lord, woman. I’m fifty-five years old and we’ve had sex twice already tonight. There’s a good chance you’ll get lucky again if you keep wiggling around like that showing me curves that make my hands start itching and another part start—”</p><p>She kissed him quiet fast. Then slow. Then again for leisurely fun because she could and had been secretly yearning to for longer than she would admit to him. “I get the picture. And thank you, but I haven’t been a teen in a long time, Hank.”</p><p>Now there was a comment he couldn’t let go past. “You turn me on a helluva lot more than any giggling Barbie doll type.”</p><p>She swatted at his bare stomach. “You’re just trying to get in my pants, and let me tell you, Hank Renshaw, even when I was a teenager, I was never easy to sweet-talk around.”</p><p>He covered her body with his again, a low growl rumbling his chest. “How about I try a different form of persuasion?”</p><p>A knock sounded on the door, jerking his head upward. Ginger tugged on the covers and Hank frowned, readying to call out for whatever room service or maid waited outside to come back later—</p><p>The opening door preempted him. What the hell? He’d secured the lock—pissed off already because of the old-fashioned keys. Heads were going to roll in security in about sixty seconds.</p><p>But first, he reached for the gun he’d kept on the bedside table for Ginger. Gripping the barrel and blocking Ginger from sight ranked as his number-one priority.</p><p>The portal filling with a quartet of men cut short anything else he’d even considered saying as recognition stunned him silent. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The oldest of the crew, apparently the only one not shocked speechless, stepped forward. “Mom?”</p><p>“Thank you for a most enjoyable afternoon, Senator Landis.”</p><p>“Thank you, Chancellor. I look forward to the rest of the visit as well.” Ginger gathered her composure as she nodded to the German Chancellor as well as Franz Kohl, the Minister of Arts, and Igor Mashchenko, the Vice-Chancellor from neighboring Kasov. The meeting had been called seconds after she and Hank had tossed out her sons and tossed on some clothes. Which left no time for her or Hank to speak to her sons after the enormously embarrassing encounter.</p> <p>In the grand hallway outside the dining room, she finished her farewells to the heads of state after their lengthy luncheon. Her eyes lingered on the two special guests as she took a final moment to gather her impressions of them. She thought of Hank’s concerns regarding the crèche being the focus of the threats.</p><p>Could the Minister of Arts want the crèche for monetary reasons? She studied the ambitious young man, a traditional-looking academic in his layered sweater and jacket with slightly rumpled pants. She could have sworn she caught a hint of paint on his brown leather shoes. His thinning hair, however, had been neatly groomed for the important occasion.</p><p>She shifted her attention to their guest from neighboring Kasov, Igor Mashchenko. A grandfatherly figure with a full head of steel-gray hair, he had a regal bearing that inspired confidence. He’d risen to the heights through shrewd investments that had helped finance his rise to power. He definitely didn’t need money.</p><p>Mashchenko bowed over her hand with an old-world elegance that elicited a low growl from Hank only Ginger would have heard. She lightly elbowed her general in the side before smiling at the visiting dignitary and wishing him farewell until the sunset ceremony.</p><p>Now that this final meeting was past, she and Hank had no excuse to avoid what waited in the sitting room back in her quarters.</p> <p>Walking down the castle corridor with Hank distinctly quiet by her side, she winced to think of the conversation still waiting to happen between her and her boys. She wanted to say it didn’t matter what they thought. They were the children and she was the parent.</p><p>Except they were adults, and actually their opinions did matter to her. She didn’t want dissension in her family. Something special had happened between Hank and her, and she wanted to start things off on the right foot with her boys.</p><p>Plus, it was damn embarrassing to be caught in flagrante delicto, no matter what her age.</p><p>Rounding a corner, she followed the path of sconce lights, updated with bulbs made to resemble candles, as she found her way back to her and Hank’s quarters. Strange how, in the past, meetings with the heads of state of other countries had given her less anxiety than the upcoming one with her boys.</p><p>Outside the door, Hank gripped her by the arm, stopping her. She blinked, her eyes wide at his public display in touching her in front of the security personnel stationed at the end of the hall.</p><p>Given the widening of Hank’s pupils, the touch to her arm was only the start of his intent. He leaned closer, his mouth a whisker away from hers. “What happened earlier was amazing and don’t you doubt for a minute that, given the chance, I would dive right in for a repeat. Don’t let anything that’s said in there steal a second of what we had. Got it?”</p> <p>“Roger that, General.”</p><p>He nodded, backing away without the kiss. She should have known he wouldn’t actually risk her reputation with any outright display. Gracious, his words had bolstered her when she needed it. More of that friendship-knowledge of each other coming into play, she imagined.</p><p>Shoulders braced, Ginger swung open the door to find her four sons waiting. Matthew paced. Kyle sprawled. Sebastian tended the fire while Jonah sent text messages on his cell phone.</p><p>Her boys. Grown up, but still her babies, each with a wicked little one-sided dimple. She opened her arms. “I can’t believe you’re all here.”</p><p>She fell into the familiarity of their boisterous hugs.</p><p>Matthew pulled back first, her oldest taking charge as usual, so far keeping his eyes solidly off Hank. “Once we learned of the attempt on your life, nothing would keep us away. Then we got here and found out you were missing...holy hell, Mom.”</p><p>She should have realized it wouldn’t matter whether or not her boys knew she was missing. The shooting incident alone would bring them to her.</p><p>Ginger moved deeper into the room with them, toward the sofa. “I thought for sure they would keep this silent for at least a couple of days.”</p> <p>“Mother,” Matthew shook his head with an unshakable self-confidence he’d inherited from his father. “I won my seat in the House of Representatives, in case you’ve forgotten. I have access to information.”</p><p>And a forceful, no-backing-down determination she suspected he’d made full use of.</p><p>“Thank you for worrying, son, but as you can see, my security detail is working overtime.” She sank onto the sofa, her boys sitting around her. “I’m in capable hands.”</p><p>Kyle quirked a brow. “I can certainly see you’re in someone’s hands.”</p><p>Leave it to her outspoken Kyle to address the issue first. She could already feel Hank advancing farther into the room with powerful strides. Ginger held up her palm to stall him. She and Hank might not have had time to determine where things were headed between them yet, but without question, they had something special.</p><p>She wanted this settled without contention between these important males in her life.</p><p>“Excuse me, young man?” Ginger tipped her chin and stared him down. “I’m still your mother.”</p><p>Sebastian, her middle-child peacemaker, interjected, with both hands raised between them, “You know he’s not being disrespectful to you, Ma, or to the General. Kyle simply wants to make sure you’re all right in every sense of the word.”</p><p>Her baby, Jonah, reclined in the wingback, laughing. “Like we have anything to worry about. The General would kick his own ass if he hurt Ma.”</p><p>A cleared throat reminded them all of Hank hovering behind her. “Damn straight.”</p><p>Heat crawled up her face.</p><p>Good Lord, she wasn’t in high school, caught talking about a boy in the lunchroom. Still, these feelings she had felt were just as fresh and new as anything she’d experienced then, combined with the maturity to know how very rare and valuable such emotions were.</p><p>Hank put his hands on her shoulders. “However, boys, if you know the first thing about your mother, you understand she can kick my butt all on her own if the need arises. And if you know me at all, you realize the last thing I would ever do is let anybody harm one hair on this lady’s head. Are we on the same page here?”</p><p>They all nodded, although she noticed that Matthew was a hint slower than the rest to accede.</p><p>Hank nodded in return. “Fair enough. Now, as much as I would like to catch up on old times with you four, your mother has some official business to attend to outside.” He extended his elbow. “Ginger.”</p><p>She thought of the gun he always carried. A skitter of unease iced up her spine. They’d caught the confessed perpetrators. Still, security would always be an issue in her job and she hated that she put Hank in harm’s way.</p><p>She could almost hear him gruffing that he had his own job to perform as a member of the Joint Chiefs of Staff, so get off her haughty high horse.</p><p>A smile trembled at her lips as she wondered why she couldn’t simply grab hold of this happiness. Oh, how she wished she could spend more time with them since she’d only just darted into the room a minute ago, but she truly did have obligations waiting and she needed to change for her final appearance.</p><p>“Mom?” Sebastian’s hand came to rest on her shoulder. “Are you all right?”</p><p>Ginger gave her grown-up child a quick hug and blinked away the sting of tears. “Of course. I’m just sentimental at the holidays.”</p><p>But as she and Hank both left to get ready for her final appearance on this Christmas tour, she couldn’t stop the fear that happiness would be snatched from her once again.</p><p>Hank didn’t care that they had an entire flipping courtyard littered with security, even a sniper perched on two parapets. He still had what his youngest daughter would have called the heebie-jeebies.</p><p>He tried not to fidget while he sat next to Ginger in the front row of chairs set up in the chapel ruins, but there were just too many people at this sunset dedication ceremony. Dignitaries, locals, media, the military aircrewmen who’d flown him and Ginger around from the start. Not to mention an orchestra, all bundled in jackets under tents erected around the chapel remains.</p><p>An earpiece in place, he listened to the security chatter, but it did little to reassure him or stop him from scanning the area. The Christmas decorations of lit trees in every corner, live boughs, bows and floral arrangements were magnificent; still, he couldn’t help but think of the personnel who’d tromped through setting up each and every piece.</p><p>Most of all, he couldn’t help but think of how vulnerable Ginger was, sitting next to him wearing her creamy off-white suit and a matching overcoat. She stood out like a beautiful beacon amid all the formal black and festive red.</p><p>A Christmas angel to his Scrooge.</p><p>They could tra-la-la all they wanted, but he was in more of a bah-humbug mood. Something felt off.</p><p>Ginger sat perched on the edge of her chair alongside the remains of the stone altar, empty velvet bag in her lap as Franz Kohl made comments about the rarity of the crèche now nestled on the stark stone altar. As if having Ginger here in the open wasn’t enough, to up the stakes, his own kids had arrived for the event as well, showing up a mere twenty minutes before showtime.</p><p>They all sat in the audience with Ginger’s boys, their friends since childhood. Hank eyed them lined along the front row of observers—vulnerable, even if his children were all trained Air Force warriors as well.</p><p>His oldest, Alicia, and her husband Josh, who both flew fighter planes, passed their wide-awake baby girl back and forth to quiet her while the Minister of Arts continued his lengthy speech.</p><p>Shifting his gaze to his own baby girl, Hank could hardly believe Darcy would be a mother soon. Part of him wanted to launch down there and protect her, but she had her special agent husband sitting next to her on one side and her navigator brother—Hank Junior—on the other. Hank couldn’t suppress the twinge of surprise at his son’s appearance, since his namesake usually checked out of family stuff, especially if “the old man” was around.</p><p>As much as he appreciated their support in showing up, he really wished they were somewhere else tonight. He’d asked them to consider observing from the safety of the castle—but none of them would even consider it.</p><p>“Hank,” Ginger whispered out of the corner of her mouth, “do you have your BlackBerry with you?”</p><p>“Does a rose have thorns?” he answered softly without moving his lips. They’d gotten pretty good at near-silent ventriloquism over the years of sitting in the limelight for hours on end.</p><p>She rested a hand on the crook of his arm. “Could you look something up for me without appearing conspicuous?”</p><p>“No one will think it’s odd if I’m using the thing. What do you need?” He surreptitiously slid his BlackBerry from beneath his jacket and cradled it in his palm, his hand large enough most should never even notice he held it.</p><p>“You mentioned not liking the look of Mashchenko.”</p><p>“That’s because he was checking you out.” The lech.</p><p>“Oh really?”</p><p>Hank growled lowly.</p><p>“Your instincts are usually right on. Why not run a search on him?”</p><p>Hank’s eyes shot over to Mashchenko where the older man waited for his turn to speak after Kohl. “Now?”</p><p>“Why not now?”</p><p>Of course nothing about this weekend had been on anything but a breakneck timetable. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Okay, sure. We already know he’s not from here. He’s from the neighboring country of Kasov.” Hank tapped through to the green screen for a secure connection with deeper files and typed in Mashchenko’s name. The man had a healthy portfolio...but sketchy info on his youth. He’d certainly made something of himself from very little past, but then many did. Still. Hank went back to his original gut feeling about the attack being somehow tied into the crèche. “Where did you say the crèche came from?”</p><p>“An auction in New York City.</p><p>“Before that.” He eyed the velvet bag in her lap</p> <p>“The auction house had papers that traced it to a village outside of Berlin. I thought since it was a German piece, it would be nice to dedicate it to this chapel and return it to the same general area.”</p><p>“Papers can be forged.” He gripped her arm and began hauling her out of her chair. “This ceremony is officially over—”</p><p>A gunshot ricocheted off the stone alter, just missing the crèche.</p><p>“Run!” Hank shouted.</p><p>As he ran with Ginger, he searched the crowd to check on their children. Alicia and her husband scrambled to safety with the baby, while Darcy’s husband covered his pregnant wife.</p> <p>Ginger’s boys and Hank Junior were all currently being restrained—looking none too happy about it as they struggled to get to Ginger, but Hank couldn’t think of that now.</p><p>His earpiece blared with a multitude of voices blasting conflicting instructions and reports. Ginger sprinted along with him to the side as people scattered. The crowd shrieked and dashed in mayhem, clearing the chairs and stage. Damn it. He could only guess where to turn for safety.</p><p>The stone altar. He could tuck her into the nook in the back and they would be protected on at least three sides.</p><p>Four more pops of gunshots launched another round of shouts. Followed by a bullhorn—and a loudspeaker. “Everyone halt. We have the gunman.”</p><p>The words repeated in German, again in French and in Russian, until slowly the frantic mass of humanity calmed. A secret service agent inched toward Hank and Ginger. People rose from their crouched positions by chairs and columns. The echo of a mishandled instrument—some kind of string instrument—twanged. A baby whimpered.</p><p>Still, Hank kept Ginger tucked behind the stone altar as one of the Christmas trees crashed to the ground. He wasn’t risking anything until his gut said to.</p> <p>The voices in his earpiece slowly quieted to only two or three speaking at once. In the mishmash he did hear the distressing news of a sniper down.</p><p>His body curved around Ginger’s. Their breaths mingled in the small enclosure. He could feel her heart pounding against his chest, until slowly, his synched-up with hers and he had this sappy romantic image of the two becoming one right here at the altar.</p><p>What was the deal with that? An old salty warrior like him thinking something so sentimental? But he couldn’t deny what he felt in his gut as much as his heart.</p><p>He loved this woman. It didn’t take anything away from Jessica, or anything away from Ginger. He was just a freaking lucky man to have such an incredible love twice in a lifetime.</p><p>No way did he intend to let her go.</p><p>From his hidden position, he forced himself to listen to the settling situation outside. Yes, there was a sniper down. From what he could tell, the other didn’t have a clear shot behind the altar if things went bad again, if there was more than one gunman.</p><p>Hank used his peripheral vision and found a secret service agent tackling a man with a weapon. Shouts sounded from the pile. Slowly the words became intelligible.</p><p>“I’m not taking the fall for this. It’s him. It’s all his doing.” The gunman pointed at Igor Mashchenko, the vice-chancellor of Kasov who’d been hitting on Ginger earlier. “He hired me to shoot the crèche and destroy it,” he continued to babble, thrashing away. “My people have been trying to take it since she landed on European soil, damn it.”</p> <p>Mashchenko stood between the gunman and Hank, the vice-chancellor only ten feet away. “He is talking crazy nonsense.”</p><p>“I am not an idiot,” the young gunman said, his racing voice beginning to slow, a cunning edge cutting the night air. “I videotaped all of our communications—and our monetary transactions.”</p><p>Hank didn’t like how close Mashchenko stood to Ginger and began scouting for an alternative place to take cover just as—</p><p>An ominous click, click sounded.</p><p>Mashchenko had trained his weapon on them. “Maybe one of your security men can shoot me, if they are good enough, but I will pop a shot off first.” He lifted his head to shout, “Does everyone hear that? I have a weapon strong enough to pierce through the General and kill the lovely senator—that is, if I don’t hit her anyway.”</p><p>Hank held tight, but it didn’t matter, damn it, because the bastard already had a gun pointed toward Ginger’s head and the sharpshooters weren’t an option any longer.</p><p>“Why, Mashchenko?” Ginger’s voice didn’t even shake as she tried to shrug her way free of Hank, but he wasn’t budging. “Why are you doing this?”</p><p>“You have brought that nativity back out in the open.” The older man moved closer, the lethal weapon all the closer. “The crèche would be back where it originally belonged. I tried to simply steal the crèche back, but Senator Landis never let it out of her sight. As time drew near, I’ve had to resort to desperate measures. Now that it is out there, where people in this part of the world can examine it, I will be ruined.”</p><p>Back where it belonged. But the precious art collection in the chapel had been destroyed by a fluke fire.</p><p>Or not.</p><p>Ginger gasped. “You burned down this chapel during a storm—after looting the place to sell the invaluable treasures on the black market.”</p><p>“You’re a smart woman,” Mashchenko replied. “I was only sixteen but I had dreams and a plan.”</p><p>Hank couldn’t help but fill in the blanks. Talking would buy time, and damn it, if the guy managed to squeeze off a shot...“The money financed your rise in government.”</p><p>“Enough talk.” He waved his weapon, obviously relying on firepower to overcome what he lacked in strength due to age. “There’s no reason why we all can’t end this day happy. If I kill you, I’m a marked man for life. I just want out now. I can hide. Come quietly until I can get to my connections.”</p><p>Fat chance.</p><p>Hank decided that age didn’t have a thing to do with any of it. He’d never felt more honed than at the moment as years of experience blended with training and a deep-rooted need to protect the woman he loved.</p><p>As if sensing his intent, Ginger gripped his clothes tighter; with those snipers out of commission, he couldn’t afford to hesitate.</p><p>The second he saw that Mashchenko’s weapon wavered and was only pointed at him, Hank leapt, not far at all. The weapon discharged. Ginger screamed. Hank couldn’t afford to hesitate. He forced himself to focus on the mission.</p><p>Take down Mashchenko.</p><p>Save Ginger.</p><p>Muscles bunched, Hank landed on the older male—a man who obviously worked out. Still, Hank gripped the bastard’s gun hand in a relentless grip, banging it against the rocky remains of the floor again and again. Praying the villainous thief wouldn’t get another shot off.</p><p>The thought of losing Ginger was inconceivable.</p><p>Even the notion caused a fresh pulse of adrenaline to surge through him, managing to mask most of the pain in his hand as he battered the villain’s arm against the ground. He slammed Mashchenko’s wrist against a sharp stone one last time.</p><p>The weapon skittered away along the cobblestones.</p><p>Hank’s fist followed as quickly across the man’s jaw, knocking him out a second before the secret service descended, Ginger’s sons leading the pack to rush them. A swarm of activity buzzed all around them, but his focus was only on one woman.</p><p>Where it belonged.</p><p>He pivoted to find Ginger already launching toward him—his feisty Carolina angel—blessedly safe and unharmed. He opened his arms to have her fall against his chest where he now knew she belonged.</p><p>For a lifetime.</p><p>Three hours later—which felt like a lifetime, so much had happened—Ginger stood with Hank under one of the tents erected for the dedication ceremony. After the shooting, it had been changed into a questioning center for the police to collect data, but most of the crowd and media had cleared away now.</p><p>A paramedic was just finishing splinting Hank’s two broken fingers from when he’d grappled with Mashchenko to pound the gun from the villain’s hand. Her pugnacious general insisted he would go to the hospital in the morning. Tonight, give him some tape and a Tylenol. He just wanted to be with his family—the Renshaws and the Landises.</p><p>She couldn’t stop the warm spread of joy over his words, even if they had been spoken with a grumpy-bear growl.</p><p>She hoped the secret service would let their children come over sometime soon. At least no one had been seriously injured. The sharpshooter had been hit in the shoulder and was reported to be doing well in surgery.</p><p>The stray bullet from Mashchenko’s gun, as he and Hank struggled, had struck one of the aircrew—who’d been with them from the start of this trip—in the arm. A superficial wound, thank God.</p><p>The injured sergeant was already being lauded by the press as the hero of the day as he’d helped carry an elderly woman to safety during the fracas.</p><p>Ginger sank back in the chilly metal chair and stared up at the moonlit sky, stars shining through clearly as midnight approached for Christmas Eve to pass away into Christmas morning.</p><p>While she was so relieved everyone would be all right, still she couldn’t help but be sad that she’d missed the chance to donate her crèche as planned. Such a silly thing to regret when she considered the larger implication of what could have happened, but as she sat here next to Hank, she couldn’t deny the truth any longer.</p><p>Giving away that family nativity, something that had been an integral part of her life with Benjamin from their first Christmas together, had been her way of saying goodbye. Because, finally, she was ready.</p><p>Ready to let go. Ready to love again.</p><p>Ready to love Hank.</p><p>Once his hand had been bandaged, Hank waved away the offer of a hypodermic needle that apparently held something with a little more kick than Tylenol. Her heart pounded faster as she thought of the two of them getting swallowed up by the media again, then their families, then their jobs. It seemed as if there might never be another chance for them to talk.</p><p>If nothing else, tonight she’d learned to grasp every moment.</p><p>She turned her chair to face his as the medical technician reluctantly stashed her needle back in a supply case and stalked away. Ginger took in the powerful set to Hank’s shoulders in his uniform, the slight dampness from snow and his injured hand the only signs he’d almost lost his life trying to save hers.</p><p>She refused to let the lump welling in her throat steal her ability to say the words hammering at her heart. “We probably only have a minute or two before the security folks unleash the kids on us, so I’m going to talk fast because I don’t want to wait another second to say a few things that should have been said a long time ago.”</p><p>“Okay.” He settled back into his seat, warding off a circling police officer who obviously wanted a word with him.</p><p>Her heart pounding, hopeful, she gasped in a deep breath of the icy night air. “You asked about me being afraid. About my feelings when I lost Benjamin. What happened out here tonight made me remember that there are no guarantees of tomorrow. This is a scary world we live in—whether it’s a terrorist, a crook or a fluke of fate.”</p><p>“Where does that revelation leave us?”</p><p>“Oh, Hank, it made me realize I’m an extremely brave woman. Sure I’m scared. Who wouldn’t be? But you’re more than worth the risk. We’re worth the risk.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re also a very smart woman.” He glanced around at the remaining crowd, his gaze landing on their children waiting not so patiently by two local police officers. “I guess the only question left to ask is whether or not you’re an impulsive woman?”</p><p>“Why do you want to know?”</p><p>He took her hands in his uninjured one. “Ginger, you’ve been my best friend for most of my adult life, and now you’re my lover, too. I’ve always loved you. Today I learned that I’m also in love with you.” He slid down on one knee. “So how about tonight you become my wife?”</p> <p>“Tonight?” She blinked fast, in time with the cameras of the few media hounds who’d stuck around to the end already click, click, clicking away. Apparently their moment wasn’t quite as private as she’d hoped.</p><p>But oh my, she had the feeling this was one moment she wouldn’t mind having captured on film.</p><p>“The priest who came for the dedication ceremony is still around. Our children are all here.” His smile broadened until it lit his eyes brighter than the Christmas stars overhead. “And you’ve never been more beautiful. I can’t think of a more perfect time or setting.” He brought her hands to his mouth for a kiss. “The only thing I need to know is if you’re in love with me, too.”</p><p>In love? It was as though her head was spinning from too much warmed gluhwein, her heart overflowing with more emotion than one woman could process. “As you said, I’m a very smart woman. Although actually, I find I’m listening to my heart’s IQ right now and it says, absolutely, totally, I am completely in love with you.”</p><p>She flung her arms around his neck and to hell with the cameras. She was seconds away from becoming Ginger Landis Renshaw anyhow.</p> <p>The marriage might not be official until they could get back to the States, but as of this night, Hank would be her husband.</p><p>He pulled back with a smile meant only for her before he stepped away to speak to the crowd, starting with her sons. “Boys, do you mind if I marry your mother here, tonight?”</p><p>The four brothers stepped free from the applauding police and clapped him on the back with a yes, some laughter—and a definite welcome. The Renshaw offspring and their spouses followed closely behind with smiles and hugs, and the flailing joy of Alicia’s baby girl. The priest joined the fold, camera lights kicking back into full-blown blinding mode at a goodwill stop that had turned into a media blitz beyond the journalists’ expectations. Definitely a bonus to all who’d braved the cold to stay to the end of this event.</p><p>Kyle grinned with that one-sided smile indigenous to all the Landis men. “About damn time. I was starting to wonder if we were going to have to dub you the fourth wise slacker.”</p><p>Ginger stood in the middle of her growing family, Hank’s strong—oh so sexy—muscular arm around her waist, and wondered how she’d gotten this lucky. The tiny crèche sat nestled on the stone altar, not officially dedicated, but home all the same and she realized she didn’t have to let go of her past to step forward into the future. Both could be a part of her, blending to make her the woman she wanted to be: wife, mother, grandmother—senator. Lucky lady all the way around.</p><p>She and Hank had taken a while to find each other this way, but he was right. The timing was perfect. Stars twinkled overhead as Christmas Eve melded into Christmas Day. Their children gathered around the stone altar where the crèche rested. The priest stood in front, reciting the ceremony in heavily accented English until finally the time came to kiss the bride.</p> <p>Hank whispered warmly against her lips, “Merry Christmas, my love. You’ll never have to worry about me forgetting our anniversary.”</p><p>“Smart man.” Her laughter rang along with local church bells, and then just the bells sang as Hank claimed his kiss. </p> </body></html>"]