["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>“Tilt that pussy.” I pound into her as my hand slaps down on her ass hard. Seeing my handprint appear on her smooth, pale skin makes me grunt out in satisfaction.</p><p>“Fuck me harder.”</p><p>“Shut your mouth,” I growl, wrapping my hand around her throat, pulling her up, and impaling her on my cock. “You know the rules.” I bite down on her earlobe, causing her to whimper. “You don’t talk when I’m fucking you unless I tell you to.”</p><p>She nods, and I push her back down. My hand slides up her back to her neck, pressing her face deeper into the mattress.</p><p>I pound into her harder until I feel her walls clamping down on me. Then I thrust into her ruthlessly. Lifting my leg up on the bed, I change the angle. She’s a tiny little thing, but I know she can take me. She always takes whatever I give her. I pull her hips up, slowing my rhythm, enjoying the feel of my cock dragging along her walls. She’s so wet that, every time my cock slides out, it’s shiny with her come. I pull out of her and flip us so she’s on top.</p><p>“Ride me,” I command, lifting my hips, filling her once more.</p><p>Her body starts bouncing up and down, her tits dancing in my face. Her large, natural Ds should look awkward on her tiny frame, but they go with her fat ass. I love everything about this woman. The visual in front of me has me getting close. I grab her hips, holding her in place as I fuck up into her. Then I come hard, long jets of seed filling her tight little pussy.</p><p>“I love you,” she says quietly.</p><p>I tug her down on top of me, kissing the top of her head. I had no idea when I met Chloe that she was going to change my life, but slowly, this waif of woman has burrowed under my skin.</p><p>“Love you too, Beautiful.” I press another kiss to the top of her head. And my mind drifts back to the past...</p><p>I was so fucking jaded when I found out that my ex-wife—the fucking bitch—was having an affair. Then I found Chloe by accident, and seeing her for the first time shifted something inside me. I had been on my cell phone and looked up to tell my client my cross street when my eyes landed on her through the bakery window. Without even thinking, I went across the street, and the moment I stepped inside the bakery, she turned towards the door and our eyes connected.</p><p>I have never believed in love at first sight or any of that other bullshit, but that moment was like a kick to the gut.</p><p>I walked to the counter and realized that my client was still on the phone, so I told him I would call him back and hung up. When she stepped towards me, the scent of lavender and vanilla filled my nose and the urge to grab her and bury my face in the crook of her neck was so strong that it was almost painful. Our gaze stayed connected until she was close enough to touch. Then the moment was broken when an old man came around the corner and told her that he would take care of me. I shook myself out of my daze, paid for a cup of coffee that would end up in the trash, and left the bakery in a rush. I wasn’t fond of the feelings I was having. I’d had plenty of women, but seeing her was something different.</p><p>I wanted to possess her.</p><p>I needed to own her.</p><p>I fought myself on going back to her but settled on having my driver wait outside the bakery for hours so I could watch her through the window. On days when men would be inside with her, talking to her, making her laugh, I had to stop myself from going inside and taking her away with me.</p><p>She was mine.</p><p>She just didn’t know it.</p><p>The first time I spoke to her in person, she smiled at me. I knew she was innocent the moment I had spoken to her—her head ducked, her face turned pink, and that look sealed her fate.</p><p>She would be mine.</p><p>Only mine.</p><p>I waited for her that night across the street. I watched her lock up before walking across the road and meeting her on the sidewalk.</p> <p>“How are you getting home?” I asked her.</p><p>Her head came up, her big, brown eyes met mine, and the surprise I saw filled me with another kind of satisfaction.</p><p>“I...I walk,” she stuttered quietly.</p><p>“I’ll walk you,” I told her, not giving her a choice. My woman wouldn’t be out at night alone.</p><p>I don’t give a fuck what people say about women’s rights and all that other bullshit. I’d let my ex do whatever the fuck she wanted, and look where the fuck that had gotten me. No more—my woman would be at home, barefoot and pregnant until she could no longer safely bear my children.</p><p>“I always walk myself,” she said softly, biting her bottom lip. Making me crave to do the same.</p><p>“Not anymore,” I stated, holding out my hand for her.</p><p>She looked at it for a few seconds before placing her small hand in mine. The feeling of her fragileness in my grasp was almost too much. My gut clenched and I fought myself not to carry her over to my car, where I could take her home and hide her away, keeping her only to myself. I mentally talked myself down.</p><p>I needed her to trust me.</p><p>I needed her addicted to me.</p><p>Then she would be mine, and I would never have to let her go again.</p><p>“Who are you?” she asked, looking up at me with wide, innocent eyes.</p><p>I looked her over. The top of her head barely came up to the middle of my chest. Her hair was dark brown with reddish highlights, and it reached the middle of her back. Her skin was the color of cream mixed with honey. I could picture my marks all over her beautiful skin. Her eyes were dark brown with long lashes that I could tell were natural. She didn’t wear makeup; she didn’t need it. She was naturally beautiful.</p><p>“Nolan,” I told her.</p><p>Her eyes looked me over, and I knew what she saw: black hair, darker skin that’s natural from my Spanish-American heritage, and dark-brown eyes surrounded by dark lashes. I’d been told a time or two that I’m good-looking. I wore my age of thirty-four well. And I’d never had an issue getting a woman.</p><p>My private investigator had informed me that Chloe had just turned twenty-two. I couldn’t give a fuck about our age difference. My mind was telling me that the younger she was, the more likely I would be able to train her into being exactly what I wanted. He’d also done some digging into her past and hadn’t been able to find out about any previous relationships. This suited me just fine. I didn’t even want to think about someone other than me touching her...ever.</p><p>We walked the rest of the way to her apartment in silence. I didn’t like the area she was living in, but I would have to wait to resolve that issue. I just needed to figure out how to force her out of her current residence and into mine.</p><p>“Thank you for walking me,” she said, trying to pull her hand from mine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I didn’t let up. I wasn’t able to let go. Her breathing picked up slightly, causing her breasts to press tighter against her top. Without thinking, I lowered my mouth over hers, taking her in a deep kiss, pushing my tongue between her lips. I could tell she was unsure; she didn’t know that what she was doing would only egg me on.</p><p>I wanted to consume her.</p><p>I wanted to brand her.</p><p>The need to own her, possess her, was almost crippling.</p> <p>I pulled my mouth from hers; my lips traveled down her jaw. Her body had melted into mine, so I took the opportunity to suck the skin of her neck in deep pulls that I knew would mark her for anyone to see. I needed to know that, tomorrow, when she went to work, I was going with her. I had a big case I was working on and couldn’t sit outside the bakery like I normally would, so she would be on her own, my mark a warning against any man who tried to get to close to her.</p><p>“I’ll see you tomorrow, Beautiful.” I kissed her neck and then her mouth again.</p><p>Her eyes were hazy, and I knew she didn’t understand what she was feeling. Her body was in control right now. I walked her into her apartment and made sure she was locked in for the night. After I knew she was safely tucked away, I went back to my limo.</p><p>“Sir,” Ricket said, opening the back door.</p><p>I nodded, getting into the car without saying a word. Once we were on our way, I called one of my men and put him on her building for the night, telling him to report to me after he followed her to work in the morning. I was a little anxious to get back to her, but I knew I had to play my cards right.</p> <p>I couldn’t rush this no matter what my inner beast was telling me to do.</p><p>By the time I pulled up in front of my building across town, I was restless. So instead of going to bed, I went down to the gym. Normally when I felt like this, I would fuck until I passed out, but I couldn’t do that. Chloe was the only woman I wanted. I hit the treadmill hard, running until my legs felt weak, and then I went to the weights. I worked out until my body was exhausted.</p><p>“Mr. Nolan.”</p><p>I lifted my head at the sound of my assistant’s voice. Maxine had been with me for the last four years. I’d shut her down the first couple of times she had given me a look that said she wanted more than I would give her. She had calmed down, but seeing the appreciation in her eyes had me gritting my teeth.</p><p>“What do you need, Maxine?”</p><p>“I wanted to remind you about your meeting in the morning, and I also wanted to see if you needed to go over the notes for the case tomorrow.”</p> <p>“Thank you, and no. You’re free for the rest of the night,” I told her, going back to doing crunches. I could feel her watching me, but I ignored her. I wasn’t in the mood to deal with anyone.</p><p>“See you tomorrow, sir,” she said, and I heard the door close as she left the gym.</p><p>I finished working out before jogging upstairs and getting into the shower. My cock had been rock hard since the first time I’d seen Chloe. Just like my mind, my body had been taken over by her. I wrapped my hand around my length and pumped twice. Then I thought about how I’d be wasting my come by shooting it down the drain when I could fill Chloe’s womb with it and released myself.</p><p>I was in unchartered territory with her. When I had been married right out of law school, I’d thought I was doing the right thing. My wife, Lynda, was my father’s best friend’s daughter. I respected her and thought, at the time, that I loved her. She was beautiful and interesting, and she had a good head on her shoulders. We were married for six years when I told her I wanted to have a child with her. When she agreed, we did the normal things while planning for a baby.</p><p>When it didn’t happen after a year, I decided that we should talk to a specialist about it. I had no idea that my wife had gotten her tubes tied until I showed up to an appointment she hadn’t expected to see me at. When the doctor let it slip what she had done shortly after we’d decided to have a child, during a time when she was supposed to have been at a conference for a week, I left the office in a rage. I couldn’t believe she had gone behind my back and done something so deceiving. That’s when I decided to find out what else I didn’t know about the woman I married.</p><p>The night the investigator gave me the case file on my wife was one of the most eye-opening experiences of my life. I hadn’t known that women could lead double lives—at least not the kind of double life she was leading. Not only had she gotten her tubes tied, but she had also been in a long-term relationship with another man for most of our marriage. I’d never once let my eyes wander from her. I’d had plenty of opportunities to take on a mistress or two, but when I’d vowed to be faithful, I had taken it seriously.</p><p>The night I found out who I really had in my bed, I went home and handed her the file, and without a word, she went to the bedroom and began to pack.</p><p>Angry would not be an accurate representation of the emotion I was feeling. I could have killed her. I actually thought about killing her. Then I thought about the way I could really hurt her. Her father had passed away a few years before, leaving her alone since her mother was in a special hospital in upstate New York. My dear wife was on her own.</p> <p>I was her only source of income since she didn’t work. She was a typical Upper East Side wife. Her boyfriend was a banker who lived in an apartment in the Bronx. His net income was around sixty thousand a year. Her lifestyle would take a drastic change, and she would never get shit from me. I had enough evidence against her that I didn’t need to worry about her. Even the best divorce attorney in the world wouldn’t have been able to force me to give her one penny.</p><p>It took six months to get my divorce finalized. Lynda tried to fight me, but in the end, she wasn’t able to get one red dime and her boyfriend dumped her. I learned later that he’d had no idea she was married and hadn’t taken kindly to her using him to cheat on another man...</p><p>A knock on the door brings me out of my thoughts about the past, and I’m just about to yell for them to go away when the door is swung open and Maxine walks in without even waiting for me to reply.</p><p>“Get the fuck out!” I roar, causing Chloe, who had fallen asleep on top of me, to jump in her sleep. I quickly pull the covers over us. I don’t give a fuck about me, but I don’t want anyone—even a woman—to see Chloe like she is now.</p><p>“Sorry,” I hear whispered as the door quickly closes.</p><p>“What’s wrong?” Chloe mumbles sleepy, raising her head to look at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Nothing. Go back to sleep, love,” I say quietly, kissing her forehead.</p><p>She sighs and closes her eyes, laying her head back down. Once I hear her breath even out, I slide out from under her and make sure she’s covered before pulling on a pair of pajama pants, grabbing my cell phone, and heading for the main living room.</p><p>“What did you need, Maxine?” I ask as soon as my assistant answers the phone.</p><p>“Sorry, sir. I thought you would want to know your conference call with Japan got canceled. I tried phoning you, but it went straight to voicemail.”</p><p>“Maxine, I don’t care if the world outside my bedroom door is imploding upon itself. When that door is closed, you do not ever open it,” I growl into the phone.</p><p>“I’m sorry. I didn’t know she was there,” she says, but even in her tone, I can hear bitterness.</p><p>I take a deep breath and let it out slowly. “Maxine, I expect the keys you have for my loft to be returned tomorrow. You will no longer be allowed into the building. I understand you have a job to do, but you will no longer have the access you had before.”</p><p>“Sir!” she gasps, and I shake my head, looking out at the city below me.</p><p>“This isn’t the first time you’ve overstepped your bounds, but this will be the last,” I tell her firmly.</p><p>“I apologized,” she whispers.</p><p>“And that is the only reason you still have a job,” I state before hanging up the phone.</p><p>I press my forehead to the glass and look out at the street below. Then I feel a small hand on my back slide around to my chest as Chloe’s cheek presses into my skin.</p><p>“Are you okay?” she whispers as I cover her small hand with mine before turning around and looking down at her.</p><p>She’s wearing the white dress shirt I had on earlier in the evening—only one button is in place, holding it together. Her hair is down around her shoulders, and her face is clean of any makeup. Just looking at her makes my breath catch in my throat.</p><p>“Better now,” I grunt out as my fingers slide into the open top of the shirt and down around her nipple.</p><p>A small whimper leaves her mouth as her eyes slide closed.</p><p>“My beautiful angel,” I whisper, dropping my mouth to hers, forcing my tongue between her lips.</p><p>When her small hand falls against my chest, I drop my hands to the back of her legs and pick her up, lifting her and wrapping her thighs around my waist. I turn and press her back to the window, my hips firmly between her legs, giving me leverage to use my hands to remove my shirt from her.</p><p>She cries out from the cold of the glass, and goose bumps breakout over her skin. Her nails tear against the skin of my shoulders as I lift her higher, pulling her breast into my mouth. I feel pre-cum pearl at the head of my cock, and the slick heat of her arousal between her legs rubs against my lower stomach. I want to lift her up and wrap her legs around my face while burying my tongue deep inside her. The fact that she was innocent before me only makes fucking her and eating her that much more intoxicating. Knowing that the only come to have ever filled her pussy is mine is extraordinary.</p><p>“I can feel your juices all over my stomach. Do you want me to eat you, Beautiful? Or do you want my cock deep inside your soaking-wet pussy?” I ask her as her fingers dig into my hair.</p><p>My brain is racing. One part of me wants to consume her, and the other part of me wants to lower my pants and slide inside her. The side of me that’s been trying to breed her wins out, so I use one hand to push down the front of my pants. Then I wrap my hand around my girth while pulling her forward and down, filling her until the head of my cock bumps against her cervix.</p><p>I watch her eyes roll back and her head fall against the window behind her. I slowly slide out then back in with deep, smooth, long strokes, enjoying every inch of her pussy rippling around me. She was made for me, her pussy built to be taken by me alone.</p><p>“Look at you...so fucking beautiful. Even with a view behind you that people pay millions for, you still outshine it.” My eyes lower to our connection and I watch myself disappear inside her. “Men would kill to see what I see right now,” I tell her on a grunt, pressing deeper inside her. “But you’re mine. You belong to me and only me, and I will kill anyone who even tries to get too close to you, anyone who even imagines seeing you like I see you,” I growl, the thought of another man even thinking of her making me want to kill.</p> <p>She is my obsession.</p><p>Her hips begin to rotate and my head falls back. I know that, if I let her continue her movements, I will shoot off inside her before I’m ready. So I still her hips and pull her from the glass, walking to the couch that faces the fireplace and laying her along the back. After sliding out of her and kissing her before nibbling down her body, I pause over her pussy, where I let out a long breath. Lying like this, she’s stuck; she can’t move or she will fall over the back or onto the couch.</p><p>“Stay still so you don’t fall,” I tell her and kiss her above her pubic bone before licking up her center, circling her clit, and then pulling it into my mouth between my lips. Her back arches and the couch wobbles as I fill her with two fingers. “Careful,” I hiss against her, fucking her slowly with my fingers as I suck on her pussy, letting her juices flow into my mouth.</p><p>Once I feel her little pussy start to convulse around my fingers, I lift my face, running my tongue around her belly button before sucking on each of her nipples. Then I kiss up her neck to her mouth, where she sucks on my tongue and lips, taking her taste off my mouth.</p><p>I hold her hips firmly as I enter her again; my cock is so hard that I feel my pulse beating through it. Her body slides with each thrust and her head slips over the side of the couch, her back bent, her hands on the cushion of the couch near her head. While her tits are bouncing with each thrust, her legs wrap around me as she is made completely helpless in this position.</p><p>I fuck into her, sliding my thumb over her clit in quick circles. She screams out as her pussy strangles my cock. The feeling of her walls clamping down on me has me standing on my tiptoes and pounding harder until my balls draw up and I come deep inside her. Then I take a deep breath, put my hands under her arms, and lift her slight weight up while she’s still impaled on me. Her body slumps into mine as I carry her around to the front of the couch and sit with her on my lap.</p><p>My chest is moving rapidly along with hers. I can feel her heart beating hard against my own as I look down at her, and I move her hair off her face, seeing that her eyes are still closed. Leaning my head back, I say a prayer of thanks that she was given to me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 2</p><p>“Do you want to explain to me why Mr. Yakamora called to tell me you missed your conference call this morning?”</p><p>I look up from the file I have been going over at my associate, Wesly, one of the five men who own the law firm along with me, and my eyebrows pull together.</p><p>“The meeting was canceled,” I state, sitting back in my chair.</p> <p>“By whom?” he asks.</p><p>Since I never asked Maxine who called and canceled the meeting, I have no way of knowing that information until Maxine gets back to the office.</p><p>“I’m not sure. Maxine is the one who received the information.” I sigh, rubbing between my eyes.</p><p>“Well, now Mr. Yakamora is demanding you go to Japan and meet in person. Normally, I would say fuck him, but this case would be over twelve million alone, and we can’t risk losing that kind of profit right now.”</p><p>“Fuck,” I mutter, knowing he’s right but pissed that I have to leave Chloe for any length of time.</p> <p>“Sorry, man. I would handle this myself, but you know he only wants to deal with you.”</p><p>“I’ll get this figured out. Tell Charles to schedule the jet for a red-eye flight to Tokyo,” I tell him as I gather my documents and briefcase. “I need to head home to pack. I’ll call you once I reach Japan.”</p><p>“We’ll talk then. Good luck, man,” he says, patting my back.</p><p>I pull my phone out of my pocket and call Ricket to tell him to meet me out front. As soon as I exit the building, my limo is idling at the curb and Ricket is standing on the sidewalk, holding the door open.</p><p>“Where to, sir?”</p><p>“Chloe. Then home. I’ll be leaving for Japan tonight,” I tell him, anxious about being away from her. “I’ll take a car service to the airport so you can make sure Chloe gets home safely. Also, put Bernard on her until I get home,” I tell Ricket, loosening my tie.</p> <p>“Yes, sir,” he says, pulling away from the curb.</p><p>When we arrive at the bakery, I step out and see Chloe through the glass window, sitting at a small table in the front of the store. She’s talking to a woman who looks familiar, but I can’t place where I know her from. When I walk into the bakery, Chloe’s eyes come to me and her face lights up. I watch as she says something to the woman before walking directly to me.</p><p>“Hey, you,” she whispers.</p><p>I lower my face and kiss her while wrapping my hand around the back of her neck so I can keep her anchored to me. “Angel,” I say against her mouth, standing up to my full height. “Do you have a moment?”</p><p>“Um, sure,” she says as her eyebrows draw together. “Just let me tell Lee we’re going to be outside.”</p><p>I nod, release her from my hold, and watch as she walks away to the back of the bakery. When she comes back, I open the door for her and step out onto the busy sidewalk, taking her hand and walking her to the back of the limo. Once I have her seated in my lap, I turn her face towards me and look at her for a moment.</p><p>“What’s going on?” she asks, searching my face.</p><p>“I’m leaving for Japan tonight. I should be home Monday if everything goes as planned.”</p> <p>“Oh,” she mutters, her shoulders slumping forward.</p><p>Even though she refuses to move into my loft, she has been there every night. We haven’t been apart for more than a few hours since the first time I took her. I want her with me, but she continues to say that she doesn’t feel comfortable living with me without us having a more solid footing in our relationship. What the hell that means, I have no fucking clue. All the women I have met in the past would have jumped at the opportunity to have a man take care of them, but my beautiful angel is not like all women, I suppose.</p><p>“It’s Wednesday,” she says as her fingers wrap into the collar of my suit jacket.</p><p>“I’ll be back before you know it. Ricket will be taking you to and from work while I’m gone, and Bernard will be looking after you.”</p><p>“I’m not afraid of being alone. I’m just going to miss you,” she says, placing her forehead against mine.</p><p>“Angel,” I whisper, wrapping my fingers into her hair and pulling her mouth to mine. Once I have enough of her taste on my tongue, I release her and sit back. “You need to be good while I’m away. I need to know that you’re safe,” I say as my fingers dig into the skin of her waist. The thought of something happening to her when I’m not around is enough to make me crazy.</p><p>“I’ll be working most of the time you’re gone. Then I have some stupid bachelorette party to go to on Saturday, an—”</p><p>“What?” I growl, cutting her off.</p><p>“My friend, Bre—the girl I was talking to when you walked in? Well, she’s getting married and invited me to her bachelorette party this weekend. Normally, I wouldn’t go, but she keeps asking and I feel bad. I don’t think she has many friends,” she says softly, reading the look on my face.</p><p>I trust Chloe, but I do not trust anyone else with her. While saying that, I also know I can’t exactly say no in this situation. So, like the lawyer I am, I immediately begin to formulate an argument that will lead to an outcome I can live with.</p><p>“Since I won’t be here, and I know how things can happen when women get together, I need you to allow me to supply security while you’re out with your friend,” I state.</p><p>She pulls her bottom lip into her mouth and begins to nibble at it while searching my face. Regardless of whether or not she agrees to these terms, I will have my men on her twenty-four-seven while I’m away. The only difference will be that, in this situation, she will know they are there.</p><p>“I don’t know how they will feel about having some scary-looking security hanging around,” she says with a small smile.</p><p>“My men are professionals,” I growl, kissing her neck, making her laugh.</p><p>“Where do you even find them, mobhenchmen.com?”</p><p>“Very funny, Angel.” I chuckle and tuck some loose hair behind her ear. “I need to know you’re safe,” I repeat sternly.</p><p>“If they don’t make it obvious they are there, then it’s fine,” she says, giving me exactly what I need, and I reward her with a kiss. “What time is your flight?” she asks, tucking her head under my chin.</p><p>“Late.” I sigh, pulling her tighter against me. “I still need to head home to the condo so I can pack,” I say quietly, enjoying the peace only she can bring me.</p><p>“I should probably get back into the shop,” she whispers after a few minutes, sitting up, and as much as I don’t want to let her go, I know I need to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Kiss me,” I demand.</p><p>She does as she’s told, her small tongue touching my bottom lip, making my cock, which was already at half-mast from having her on my lap, rise completely. I hate that I can’t have her one more time before I must go out of town. I take over the kiss, sucking her tongue into my mouth and then nibbling on her lips before pulling away, kissing her gently one last time.</p><p>“Be safe on your trip. I love you,” she says quietly, pressing her soft lips to mine once more.</p><p>“Love you, Angel,” I tell her, sitting for a second longer, willing my erection to go down.</p> <p>After moving her off my lap and opening the door to the limo, I get out, taking her hand in mine before walking her back across the street. Then I pull her into my arms one final time, breathing her in before opening the door to the bakery for her and watching her head inside. When I see her head towards the table where her friend is sitting, I take a moment to watch. The woman looks through the glass at me, and something about her triggers a memory I can’t place. She smiles, but I don’t return it, instead looking at Chloe, who waves. I lift my chin at her and head back across the street.</p><p>As soon as I’m seated inside the limo, I look at Ricket in the rearview mirror. “Call Bernard and tell him Chloe will be going out Saturday night and I want men on her while I’m out of town.”</p><p>“Will do, sir.” He nods.</p><p>“I also want to know how far along we are on getting her building condemned.”</p><p>“They’re still working on it, sir.”</p> <p>“Tell them if they can get it done before I get home, I will add another half a million.”</p><p>“Will do, sir,” Ricket says.</p><p>I know he will do anything I ask of him. He has been with me since I was a teen, and he’s one of the few people I would trust with my life.</p><p>After going home and packing, I make it to the airport and wait in the limo, sending Maxine a quick message about her fuck-up before calling Chloe and making sure she got home okay.</p><p>“Hey, Angel.”</p><p>“Hey. Are you at the airport?” she asks.</p> <p>I can hear the water turn on and the sound of her brushing her teeth. As crazy as it sounds, I’m pissed that I’m missing a small moment like that with her.</p><p>“Yes,” I say, looking out the window at my jet. “Are you in for the night?”</p><p>“Are you saying your men didn’t tell you I was home already?” she asks, and I can hear the smile in her voice.</p><p>“I like hearing it for myself,” I state then let out a frustrated breath when my driver taps on the window. “Be good while I’m away. I will call you in the morning. Make sure you wait for Ricket to take you to work in the tomorrow.”</p><p>“I will. Don’t worry about me,” she says reassuringly.</p><p>“I will always worry about you when I’m not around to see to your care myself,” I tell her.</p><p>I hear her sharp inhalation of breath. She still has a hard time accepting that I want to take care of her, how much I love her and want what’s best for her. I’m sure my psychologist would have a field day if he knew what kind of shit I am thinking when it comes to Chloe. My feelings for her go above and beyond the realm of normal and into the categories of slightly crazy, obsessed, and extreme possession. The one thing I can say though is that at least I can admit it to myself, and if I’m being completely honest, I don’t give a fuck what anyone thinks about my feelings for her. She’s mine and has been from the first moment I saw her.</p><p>“I’ll call you in the morning, Angel.”</p> <p>“Okay,” she says. I can hear her getting into bed, and I grit my teeth. “Night,” she whispers.</p><p>“Night, Angel,” I say, hanging up, grabbing my bag, and heading for the plane.</p><p>“I’m having a hard time believing you want my business,” Mr. Yakamora says, and it takes everything in me not to growl.</p><p>“I wouldn’t be here if I didn’t want your business,” I remind him again. Since I showed up in Tokyo, I have been hearing the same thing over and over. “I explained what happened with our meeting, apologized, and flew out here. My associates and I have been working this case since the beginning. If you feel another firm can do a better job, be my guest, but let me tell you, no firm in the world has the reputation we have. We’re known for winning cases, sir.” I sit back in my chair and loosen my tie.</p><p>He looks me over and sighs. “There is a lot of money on the line. We need to know you are completely involved.”</p><p>“I have proven to you and your company that you have me and my firm’s devotion. At this point, I do not know how else to demonstrate to you we are the best choice for you if you think you can get better representation somewhere else,” I say again.</p><p>Just as I’m about ready to say fuck it and walk, he turns to me, his eyes searching my face.</p><p>“How do you feel about sake?” he asks with a wide smile, changing the subject and catching me off guard.</p><p>“Fucking hate the shit,” I tell him, and he immediately begins to laugh as he comes towards me to pat my arm.</p><p>“You just haven’t had it in the right environment.”</p><p>I look around the club Mr. Yakamora’s men brought us to and sigh. When I was recently divorced—hell, even when I was married—I would have been happy to spend my business trip in a place like this. Great food, good company, and beautiful women at your beck and call. But as I sit here, all I can think about is Chloe. Tonight, she would be going to a bachelorette party, and I have to rely on other people to watch over her. I still can’t kick the strange feeling about the woman who was at the bakery with Chloe. I have no idea where I know her from, but something about her is familiar.</p><p>“You’re not enjoying yourself,” Mr. Yakamora observes, sitting down in the chair next to me and loosening his tie.</p><p>“I have a lot on my mind.”</p><p>“Who is she?” he asks, calling a girl over with a wave of his fingers. When she’s within hearing distance, he asks her in Japanese for another bottle of sake then turns back towards me. “I know it’s a woman because only a woman can make a man look like he is somewhere else. I grew up hearing from my parents and grandparents that, when you find the woman you were meant for, your souls are always together, regardless of space or time.”</p><p>I let his words sink in and relax back into my chair.</p><p>“So tell me. Who is she?” he asks.</p><p>I feel my jaw grind. I do not talk about Chloe to anyone, and I do not enjoy feeling like I have to choose between my personal life and the respect I have for a client. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ahh,” Mr. Yakamora says quietly, steepling his fingers in front of him. “All right.” He snaps his fingers on his right hand, and the waitress who had been taking his order comes over, setting a bottle of sake on the table along with two glasses. “I propose a toast.” He pours the alcohol into one glass, handing it to me before pouring his own and setting the bottle down. “To space and time and the women who transcend it,” he says.</p><p>We hold our glasses towards each other before taking a drink.</p><p>“Yes,” I sleepily mumble into the phone after I finally get it to my ear.</p><p>“Sir, Chloe is in the hospital,” Ricket says, and I sit up.</p> <p>“What do you mean ‘Chloe’s in the hospital’?” I turn on the light. “Is she okay?” I ask, getting out of bed and going over to my suitcase, where I begin tossing all of my belongings inside.</p><p>“Shit.” He takes a deep breath. “Duane was keeping an eye on her in the bar and noticed that she’d started acting strange. She went to the restroom and he followed her, so when she didn’t reappear after a few minutes, he went in and found her unconscious on the floor of one of the stalls. Right now, we’re waiting for the doctor to tell us what’s going on.”</p><p>“What the fuck happened?” I growl, powering up my computer. I need to get in touch with my pilot to ready the jet. I need to get to Chloe.</p><p>“We’re not sure. I’m pulling the video from the bar as we speak.”</p><p>“Stay with her until I get there. Do not let her out of your sight,” I command.</p> <p>“Will do, sir,” he replies immediately.</p><p>“The jet will be in the air within the hour. If you hear anything, let me know right away,” I tell him while texting my pilot.</p><p>“You have my word,” he says.</p><p>I hang up and go to my suitcase to pull out a pair of jeans and a T-shirt, getting dressed quickly before zipping up my bag. Then I pull my phone out and head down to the lobby of the hotel. As soon as I reach the front entrance, I call Wesly and quickly let him know that I’m on my way back to the US and I will be calling Mr. Yakamora. I’ll need to explain that I had to leave Japan immediately and any business we need to discuss can be taken care of via conference call.</p><p>I won’t be leaving Chloe again, even if I have to handcuff her to me.</p><p>“Can I take your coat?” the flight attendant asks.</p> <p>I hand it to her and pull out my phone from my pocket when it begins to ring. “Yes?”</p><p>“Sir, I wanted to give you an update. The doctor has her on an IV, and they are running a few more tests, but they believe she was drugged with Zolpide and she had an allergic reaction to it.”</p><p>“Who the fuck was close enough to her to drug her?” I demand.</p><p>“Sir, I’m not sure,” Ricket says quietly.</p><p>“Can I speak with her?”</p><p>“She hasn’t woken up yet,” he says almost under his breath, and a ball of hot rage fills my chest.</p><p>“Call me the moment she wakes up,” I hiss, running a shaky hand through my hair, “and for fuck’s sake, find out what the fuck happened!” I shout, clicking off the phone.</p><p>By the time we land in New York, my anxiety level has tripled. Chloe still hasn’t woken up and there is no evidence on the tapes showing that anyone had the opportunity to drug her.</p> <p>It takes an hour to make it from the private airstrip in Westchester to the hospital in downtown Manhattan, where Chloe is. As soon as I pull up outside of the hospital, Ricket is there to meet my town car. Without a word, I follow him into the hospital, and as soon as I step off the elevator, my hackles rise. Maxine is standing in the hall with a man I have never seen before.</p><p>“What are you doing here?” I ask her as soon as I get within speaking distance.</p><p>Her head turns towards me and she smiles. “I thought it would be best if I met you here,” she says quietly and starts to reach out her hand to touch me.</p><p>I instantly pull away. “You thought wrong. You can go,” I tell her, taking a step towards Chloe’s room, but the man who was standing with her steps in front of me, blocking my path. “I suggest you move aside,” I tell him.</p><p>“Do you now?” he asks and steps in front of me again when I try to move around him.</p><p>If I weren’t exhausted from traveling and worrying, I would lay the kid out, but as it stands, he may be able to get one over on me.</p><p>“Sir, this is Chloe’s boyfriend,” Maxine says from beside me, and I turn to look at her then back at him.</p><p>“The only man in Chloe’s life is me. Now get the fuck out of my way,” I bark.</p><p>He opens his mouth and begins to speak, but one of my men steps in, wrapping his hand around the guy’s arm. He starts to struggle but quickly stops when my man leans down and says something to him.</p><p>I turn towards Chloe’s room then stop and look over my shoulder. “Bernard.”</p><p>My bodyguard stops and turns to look at me as well as the guy. “Yes, boss?” he asks, looking back at me.</p><p>“I want to know everything about him, and make sure he understands he is not allowed to even breathe the same air as Chloe again,” I tell him.</p><p>He lifts his chin and starts to lead the guy away.</p><p>“Now, you,” I say, turning towards Maxine before heading into Chloe’s room. “If I find out you’ve somehow had a hand in all this shit, you will pray I end you.”</p><p>“Nolan,” she whispers, and I shake my head.</p><p>“Get out, now,” I snarl.</p><p>She jumps slightly before quickly turning and walking away. I take a breath and stretch my neck before stepping into the room where Chloe is.</p><p>The TV is on, blue light casting a glow around the room. My eyes go to the bed, and I take my angel in before stepping towards her. The blankets are tucked around her, her hands at her sides. Her eyes are closed, her dark lashes lying over her cheekbones. Her hair is up, and I can tell she styled it by the way the curls are still holding in her normally straight hair. I walk towards her and see that one of her hands has an IV attached. It feels like it takes forever to make it the ten steps to her side. My hand instantly goes to her face, and my fingers travel down her jaw when I see a large bruise there.</p><p>“Jesus, Angel. What the fuck happened?” I whisper, looking her over. I can’t believe this happened to her. I slip off my shoes and climb into the bed with her, being careful not to move her too much as I wrap myself around her.</p><p>“Nolan,” Chloe says as I feel her fingers travel though my hair. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I smile and open my eyes a crack. As the events of the last twenty-eight hours come back to me, the smile disappears and my eyes open completely, meeting Chloe’s concerned ones.</p><p>“Angel.” I swallow, gently pulling her closer so I can press my lips to her forehead.</p><p>“Why am I here?” she whimpers, and I can hear the tears in her voice.</p><p>I pull slightly away from her so I can look into her eyes. “You got sick and passed out in the bathroom of the club.”</p> <p>“I told them I didn’t want to drink,” she says faintly, making me instantly annoyed with the people she had gone out with. I should have known better than to trust anyone with her care.</p><p>“It’s okay,” I say, sitting up on the side of the bed while pressing the call button for the doctor. Then I slip on my shoes.</p><p>“Are you okay?” she asks, and the touch of her hand causes me to let out a sharp breath.</p><p>I’m so maddened by the thought of what could have happened to her that I could kill. I turn towards her and push my own personal demons aside. She needs me now, and I cannot let my own emotions overrule that.</p><p>“Fine, Beautiful,” I tell her, running a hand over her hair.</p> <p>“Sir,” Ricket says, which is followed by someone else’s, “You’re awake.”</p><p>When I turn my head, an attractive man a few years younger than I am walks in wearing a set of dark-blue scrubs.</p><p>“I’m Alex, Chloe’s nurse.” He smiles, looking at Chloe a little too long before his eyes meet mine at me.</p><p>“We’re fine, Ricket. Thank you,” I say, watching him leave before turning to look at Alex.</p><p>“I’m going to get the doctor. Do you need anything before that?” he asks Chloe, taking a step closer to the bed.</p><p>“I need to use the restroom,” Chloe says softly, her cheeks turning slightly pink.</p> <p>“I can help you with that,” he says, but I block his way.</p><p>“You just get the doctor. I’ll make sure she makes it to the restroom,” I snarl, and a smile twitches his lips, making a growl vibrate my chest.</p><p>“Let me just unhook her IV. That way, it’s a little easier for you,” he says.</p><p>I want to tell him no, but I know that, logically, that doesn’t make sense, so I reluctantly step aside so he can get to Chloe. It only takes a second for him to get her unhooked, and then he leaves the room.</p><p>“I can walk,” she complains as I pick her up and carry her into the bathroom.</p><p>“Not yet,” I tell her, helping her to the toilet. I stand at my full height over her, and her eyes narrow.</p><p>“You don’t need to wait in here with me. I’m fine,” she says.</p><p>I sigh, shaking my head. “Until the doctor says otherwise, you’re not to be left alone.”</p> <p>“I hate when you get bossy,” she grumbles.</p><p>I shrug. She can find it annoying all day long, but it won’t change anything.</p><p>After she finishes in the bathroom and I help her wash her hands, I carry her back to bed just in time for the doctor to walk into the room followed by Nurse Alex.</p><p>“Miss Kasters,” Chloe’s doctor says, coming to stand next to the bed, “how are you feeling?”</p><p>Chloe looks from the doctor, to me, then back again. “A little out of it,” she frowns.</p><p>The doctor nods and looks down at the tablet in her hand. “That’s understandable. Your blood results came back, and it appears you had quite a bit of the drug Ambien in your system.”</p><p>“Isn’t that sleeping medication?” Chloe asks, and I take her hand in mine.</p><p>“Yes, but it’s also used as a predator drug.”</p><p>“Do you mean like a date rape drug?” Chloe asks, and her nails dig into my skin.</p><p>“Unfortunately, yes,” the doctor replies softly.</p><p>“Did I...” Chloe whispers then pauses to look at me.</p><p>The fear and confusion I see in her eyes has me moving so I can hold her face between my hands. “No, Beautiful,” I reply on a hoarse whisper. “You passed out in the bathroom at the club, but no one touched you.”</p><p>Her eyes close, and I pull her closer to me, placing my lips to her forehead.</p><p>“No one touched you,” I repeat against her skin.</p><p>She nods, and I sit back.</p><p>“I know this is very upsetting, but everything seems to be fine now.” The doctor smiles softly at Chloe.</p><p>“How long must she stay here?”</p><p>“I would like to monitor her for the next two hours. If she doesn’t show any signs of having a concussion, I’ll release her.” She looks from me to Chloe and lowers her voice. “I need you to let me know if anything changes over the next seventy-two hours. You have been asleep for a long time, but we believe that it was due to the amount of Ambien in your system.”</p><p>“Maybe it would be best if she stays here,” I state, not wanting to risk something happening to her while out of the hospital.</p><p>“I’m fine,” Chloe says, and I look at her then back at the doctor.</p><p>“Are you sure it’s a good idea to send her home?” I ask, watching a smile twitch her lips as Chloe cuts me off with, “I’ll be okay.”</p><p>I let out a breath and look at my angel. I despise that this has happened, and I don’t know how I’m going to function. Since I met Chloe, I have felt the need to protect her. Now, with this turn of events, I feel that urge getting stronger.</p><p>“If the doctor says you should stay, you’re staying,” I state, leaving no room for an argument.</p><p>“She already said I could go home,” Chloe says, and I hear a chuckle from either the doctor or “Alex the Nurse” and ignore it.</p><p>“Maybe we should get a second opinion,” I grumble under my breath.</p><p>“Nolan, that’s ridiculous,” she states, rolling her eyes.</p><p>I begin to wonder if she hasn’t really hurt herself. I can’t remember Chloe ever being so defiant.</p><p>“She just told you I’m okay. If anything changes, I can come back.”</p><p>“Okay,” I say and then look at the doctor. “I’ll need the number for an at-home nurse.</p><p>“Nolan,” Chloe chimes in.</p><p>“No,” I assert, swinging my head in her direction. “If you’re coming home, we’re doing it my way.”</p><p>She must understand from my tone that this is not something I will budge on, because she instantly jerks her head in an up-and-down motion.</p><p>“Now, if that’s everything, she needs her rest until you release her,” I bark, looking from Chloe, to her doctor, and then to Alex. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I know it makes no sense to be angry, and I’m not mad at Chloe—I’m mad at this situation. Being who I am, I’m used to having control, and this situation is completely out of my hands. I know I won’t be able to rest easy until I find out who tried to hurt my angel.</p><p>“I will be back to bring you your discharge papers. If things look good when I get back, I’ll sign you out.”</p><p>“Thank you,” Chloe says. Then she looks at me and raises an eyebrow, causing me to press my lips together. “Nolan,” she whispers and elbows me in the ribs.</p><p>I look at the doctor and mutter a quick, “Thank you,” before watching her and Nurse Alex leave the room.</p> <p>The moment they are out of sight, Chloe looks at me.</p><p>“What?” I ask, putting her feet up on the bed.</p><p>“You were so rude,” she huffs, flopping back onto the pillow.</p><p>“Careful,” I bark, and her eyes go wide, causing me to flinch. “You were drugged. Your face is bruised and you have been unconscious for the last twenty-four hours, so don’t look at me like you’re surprised I’m reacting this way.”</p><p>“I know,” she sighs, and my eyes meet hers, “but I’m okay.”</p> <p>Her hand comes up to run along my jaw. My hand covers hers and I turn my head to kiss her palm. I know she’s right, but that doesn’t make it any easier. I nod and finish tucking her into bed before kissing her forehead and going out into the hall to talk to Ricket.</p><p>“Sir,” Ricket says as soon as he sees me walk out of Chloe’s room.</p><p>“Where’s Bernard?”</p><p>“He—”</p><p>“I’m here,” Bernard announces, walking around the corner.</p><p>“Any news?”</p> <p>“Not yet.” He shakes his head, looking towards Chloe’s room. “How’s she doing?”</p><p>“Better,” I tell him, running a hand down the back of my neck.</p><p>“So, no news on who the guy was either?”</p><p>“When I spoke to him outside, he said he was Chloe’s boyfriend from high school.”</p><p>“Why the fuck is he showing up here now?”</p><p>“Said he got a call from someone saying she was in the hospital. He told me he and Chloe have kept in contact over the years and he has always thought of her as his girl, so he wanted to make sure she was okay.”</p><p>The words “his girl” ring in my ears and I try to steady my breathing as my hands clench into fists.</p><p>“I want you to find out everything on him down to what he ate for breakfast this morning, and I don’t want him anywhere near Chloe. I don’t even want him to catch a glimpse of her.”</p> <p>“My men will be keeping a close eye on him.”</p><p>“Make sure,” I growl before turning on my heel and heading back to Chloe. I know it’s not my men’s fault that this happened, but fear of the unknown has me lashing out. I just need some answers sooner rather than later.</p><p>Chapter 3</p><p>“What are you doing?” I bark, walking into the bathroom, where Chloe is submerged in the tub with her eyes closed and mounds of white bubbles surrounding her.</p><p>“Taking a bath,” she answers, not even opening her eyes.</p><p>“You could drown,” I tell her, walking to her and picking her up out of the water, not caring when my clothes become soaked by doing so.</p><p>“Put me down, Nolan.”</p><p>“No. You’re going to bed,” I say, ignoring her struggles as I grab a towel with one hand before leaving the bathroom and carrying her to the bed, where she was supposed to be while I went to make a few phone calls.</p><p>“You are being ridiculous. First, you carry me around like a doll, and now, I can’t take a bath?” she cries, glaring at me.</p><p>“It was safer for me to carry you.” I shrug and start to dry her off, but she pulls the towel from my hand and starts whipping it at me, causing me to dodge her while trying to take it from her without hurting her in the process. “Chloe, stop. You’ll hurt yourself,” I say, finally getting the towel from her hands.</p><p>She reaches down to the end of the bed and grabs the blanket, pulling it over herself before crossing her arms over her chest and letting out a long huff.</p><p>“You’re supposed to be resting.”</p><p>“I was resting.” She rolls her eyes, suddenly getting out of bed.</p><p>“Now, what are you doing?”</p><p>“I need something to sleep in,” she mutters, walking past me to the dresser, opening my top drawer, and grabbing a shirt out.</p><p>“Are you hungry?” I ask, watching her slip my T-shirt over her head. I stand there hard as a rock as the shirt slides over her perfect tits, past the soft roundness of her stomach, and then down to cover her bare pussy.</p><p>“I’m still not hungry,” she says when her head turns and our eyes meet.</p><p>I watch as longing flashes in her eyes, and she starts towards me slowly.</p><p>“Angel,” I warn, and her step falters slightly before she continues her path. This time, the sway of her hips has my cock begging to reach her.</p><p>“I missed you.” Her voice drops and her hand goes to my chest, causing my already hard cock to become almost unbearable.</p><p>“You need your rest.”</p><p>“I need you,” she hisses, her hand at my chest traveling down my stomach, cupping me, her small fingers trying to wrap around my cock through the material of my pants.</p><p>“No.” I take her hand and wrap my arm around her waist, gently pulling her closer to me. “You’re not well.”</p><p>“I’m fine,” she moans, and by the noise she’s making and the slight movement of her thighs, I know she’s running hot.</p><p>“I decide when you’re well enough to fuck,” I whisper near her ear, and she whimpers as my hand slides around then down her stomach. “Do you want to come?” I know I can’t fuck her like I crave to, but I never want her to want for anything, even if it’s just an orgasm.</p><p>Her cheek moves against my chest, and she mewls as my fingers slide between the lips of her pussy.</p><p>“Poor Angel,” I say, feeling how swollen she is as my fingers begin to slowly circle her clit then move down over her entrance.</p><p>Her hips begin to move with my hand, and she’s so wet that my fingers are sliding with no resistance.</p><p>“Did you miss me?” I groan, sliding two fingers deep inside her, pressing against her G-spot. I can feel pre-cum coating the tip of my cock and know I’m making a fucking mess of myself. “Answer me,” I snarl when she doesn’t answer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes,” she cries as I begin to fuck her fast with my fingers.</p><p>I can feel her pussy getting tighter and hotter, and I know she is going to come, but I need her taste. I walk her backwards to the bed, making sure to keep my grip around her waist, my fingers never losing their rhythm. Once I have her to the bed, I gently lean her back onto the mattress, covering her body with mine.</p><p>I lift my head and look down at her as her eyes open and she looks up at me. There is so much hunger, so much desire in her eyes that I lower my mouth over hers just so I can break eye contact. I know what I want to do right now, but I force myself to take control of the urge to be deep inside her. Once I get my fill of her mouth, I gently move down her neck, using my free hand to lift my shirt she’s wearing and expose her breasts.</p><p>The cool air hits her nipples, causing them to tighten even more. The fingers I’m using to stroke inside her lift up, causing her back to arch off the bed, raising her breasts closer to my mouth. I blow a warm puff of air over her nipple before laving it with my tongue and blowing another breath across it. Then I pull it deep into my mouth.</p><p>Her whimper and her nails digging into my hair egg me on. Once I have given both breasts the same treatment, I kiss down her stomach, licking around her belly button before lowering myself and lifting one of her legs up and over my shoulder, spreading her out in front of me. I sit back, watching my fingers enter her in smooth strokes, then start fucking her harder with them before lowering my face to lick right up her center. I pull her sweet, pure taste into my mouth and circle her clit with my tongue before sucking it into my mouth and flicking it.</p><p>The heel of her foot digs into my shoulder, her pussy clamps down on my fingers, and her screams fill the room right before her body goes completely limp and silence fills the air. After I feel her body fully relax and know that her orgasm has passed, I slowly pull my fingers out then place them into my mouth, savoring her taste as I kiss my way back up her body. Once I reach her face, I kiss her once, seeing that her eyes are closed. They slowly flutter open, and a small smile forms on her mouth.</p><p>“Sleep, Angel,” I tell her as I fix her shirt and adjust her in the bed.</p><p>I cover her up before pulling off my own shirt while heading to the bathroom, where I’m extra careful about removing my pants. I’m still so hard that it’s almost painful. I make quick work in the shower and dry off hastily. I don’t even bother with clothes before crawling into bed with Chloe and pulling her against my chest. Then I fall asleep.</p><p>“I should go to work,” Chloe says.</p><p>I lift my head from the papers I’ve been going over for a case so I can glare at her. She has been repeating the same thing for the last three days. I do not know how many times I need to tell her that it’s not happening before she’ll get it. Hell, she will be lucky to go back to work at all.</p><p>“We’ve spoken about this.”</p><p>“You’ve spoken about this.” She rolls her eyes before standing from the table and heading for the kitchen. “I need to work. I need to make money so I can pay my bills,” she says, and anger instantly ignites in my stomach.</p><p>“I have plenty of money.”</p><p>“I know, but that’s your money.”</p><p>“I will take care of you.”</p><p>“Nolan, I love you, but I was never looking for a sugar daddy,” she cries, throwing her hands up in the air.</p><p>“Chloe, watch it,” I snarl. “You’re really testing my patience,” I say, tossing the papers in my hands down onto the table before standing from the chair, hearing it hit the wall behind me.</p><p>“Nolan.” She swallows.</p><p>“I’m the one who got a phone call from halfway across the world telling me the woman I love had been drugged. I’m the one that happened to, so you do not get to make this seem like I’m trying to keep you here for my own satisfaction. I’m keeping you here because it’s safe,” I rumble, leaning my head back in frustration.</p><p>She has become more and more defiant, and the way I would normally get her to submit cannot occur at this time—not until I know she is completely okay.</p><p>“I’m sorry,” she whispers. My head lowers and our eyes meet. “I just need to get out of the house. I mean, you didn’t even tell me you were moving me in with you. Yesterday, all my stuff just showed up here.”</p><p>Okay, so I may have gone a little bit overboard, but given the circumstances, I was tired of waiting, and now, I fully believe that the only place she is safe is with me. So that is where she will be from now on. And no, I do not want to be her sugar daddy, but the job has to go. If I need to travel for business, she is going to come with me. I will no longer be able to leave her while I’m out of town.</p><p>“I need to know you’re safe.”</p> <p>“Before meeting you, nothing like this has ever happened to me,” she whispers as her head lowers and her hands wring together.</p><p>Her words feel like a steel pipe going right through my gut. I hate the idea of being the one who has caused her to be harmed. I’ve only ever wanted to take care of her.</p><p>“Come here, Beautiful,” I sigh while opening my arms, and she walks to me, shoving her face into my chest as her arms wrap around me tightly. “I should have spoken to you about moving your stuff in, but I knew you would try to tell me, again, that it’s too soon. I removed the choice from your hands and did what needed to be done.”</p><p>Her head tilts back, and I gather some of her hair at the back of her head into my hand, making a fist. I then lower my mouth to hers, slipping my tongue between her lips, calling hers to come out and play. When she moans and her body rises higher, I pull away, placing one more gentle kiss on her lips before pulling her head back into my chest.</p><p>“What would you like to do today?” I ask after a moment of standing in silence.</p><p>Her head tilts back again and her face lights up. “I’ve never been to the Museum of Natural History.”</p><p>Internally, I groan, knowing that the place is likely overrun with children right now. But if my angel wants to go to the museum, then I suppose that is what we’re going to do.</p><p>“All right. Go get ready while I finish up some work. We’ll leave in an hour.”</p><p>“Really?” She smiles bigger, and my mouth lowers again, kissing that one off her lips.</p><p>“Really,” I reply against her mouth before pulling away and turning her towards the stairs, where I watch until she disappears out of sight.</p><p>“There are a lot of kids here,” Chloe says as we make our way through the dinosaur exhibits. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Most of the schools in the five boroughs bring the kids to this museum during the week, and then you have all the nannies who bring the kids here during the day. Or moms who just want something to do with their rug rats show up here as well,” I tell her, wrapping my arm around her shoulders so I can lead us though the crowd.</p><p>“I had no idea,” she mutters.</p><p>“When I was growing up, I only liked coming here for one reason.” I lead her past some of the exhibits, heading towards my favorite spot in the building.</p><p>“Holy cow,” she breathes, looking up at the giant blue whale that takes up a huge expanse of the museum.</p> <p>“I used to lie on the ground under it for hours,” I tell her, looking around.</p><p>The area the whale is kept is dark and the floor is empty, making it the perfect spot to get away from all the noise inside the museum. I lead her towards the middle of the floor and watch as she looks around the room. There are kids everywhere along with adults who are looking at the displays tucked into the walls.</p><p>“Come on.” She pulls my hand, beginning to sit on the floor.</p><p>I frown down at her. “What are you doing?”</p><p>“Come on, old man. I need the full experience.” She laughs, sitting down completely before lying on the floor.</p> <p>I shake my head but follow her down, resting my head near hers. She moves my arm and lays her head on my chest.</p><p>“This is so cool,” she whispers.</p><p>I squeeze her shoulder. I forgot how much I enjoyed doing this when I was young.</p><p>“This is where I had my first kiss,” I say, kissing her forehead.</p><p>“Was she your girlfriend?” Her cheek moves against my chest, and I know she’s smiling.</p><p>“I was six. I thought she was my girlfriend, so when we came for a field trip, I kissed her when we got to this part of the museum.”</p> <p>“What did she do?” She giggles, making me smile.</p><p>“She hit me then ran off and told the teacher.”</p><p>“Your poor ego.” She tilts her head back, and the soft look in her eyes makes me realize that this is the spot I will ask her to marry me once the ring I’m having made for her is complete.</p><p>“I survived,” I mutter, pulling her face up towards mine.</p><p>She instantly rises up on her elbow and lowers her mouth down to mine, nibbling my bottom lip before licking it. My hand moves to hold her face to take over the kiss, but we’re suddenly interrupted.</p><p>“Dere kissin’!” a kid yells, and a bunch of giggles break out around us.</p><p>Both Chloe’s face and mine turn at the same time to see that there is a group of kids who are all wearing matching shirts and look to be around five standing around us and laughing.</p><p>“Oh my God,” Chloe whispers and hides her face in my chest.</p> <p>I lay my head back down, break out into laughter, and can feel Chloe shaking from doing the same.</p><p>“I think we need to get up,” I tell her, sitting up and seeing that the children have moved on.</p><p>We spend the next few hours walking around the museum, checking out different displays before heading out of the building. Once on the street, I signal to Ricket as we walk towards the park.</p><p>“This is nice,” Chloe mutters.</p><p>I look down at her as she takes a bite of the pretzel I just bought her. I forget sometimes to step back from work to just enjoy the little moments.</p><p>“It has been nice,” I agree, bending my head to take a bite of her pretzel, making her laugh.</p><p>By the time we arrive back at my penthouse, it is dark. There is a chill in the air, and Chloe is shivering. She insisted we walk instead of taking the car, so I sent Ricket ahead of us, telling him that he could have the night off. That’s why I’m surprised to find him waiting in the lobby of the building along with Bernard.</p><p>“Sir,” Ricket says when he spots me.</p><p>“Is everything okay?” I ask, rubbing Chloe’s arm, trying to warm her up. We both dressed light to go out, and now, I wish I would have brought a jacket or demanded we take the car home.</p><p>“Evening,” Bernard says to Chloe before moving his eyes to mine. “We need to meet.”</p><p>I nod. “Let me get Chloe upstairs and warmed up, and then we can talk,” I tell him, watching as he lifts his chin and follows us to the elevator.</p><p>Once I have Chloe in the bath, I make my way out to the living room, where Bernard and Ricket are both speaking quietly.</p><p>“Tell me what’s going on,” I say, pouring a glass of scotch.</p><p>“I have gone over the videos from the club again from the night Chloe was drugged and still have not found even one moment when she could have been slipped the drug. Throughout the evening, she was never away from the other women at the event, she never went to the bar alone, and the party she was with had pitchers of drinks brought to them, and none of the other women ever showed any signs of having been given the same thing as Chloe.”</p><p>“The drug was in her system, and I know she has never taken sleeping medication, so at some point during that party, she was given the drug,” I growl.</p><p>“I agree,” Bernard says then looks at Ricket. “What I’m thinking is one of the women at the party slipped it into her drink. They are the only ones who would have had the opportunity to do so. My men were watching her the entire evening, and at no point was anyone who wasn’t part of the bachelorette party even within sneezing distance of her.”</p><p>“So you believe one of the women she was with drugged her?” I shake my head. “That makes no sense at all.”</p><p>“I don’t know why someone did it, but women from the party are the only ones who would have had the opportunity to do so.”</p><p>“So, what’s the plan?” I look in the direction of the bathroom, not wanting Chloe to come out during this talk. I don’t want her to even know there is something going on or what they suspect. I don’t know how she would react if she knew they believe that her friends had something to do with her being drugged.</p><p>“Right now, I’m gathering all the information I can on the women who attended the party. So far, they are all coming up as a bunch of well-to-do trophy wives, and I cannot find any link that would lead me to believe they would hold a grudge against her.”</p><p>“Chloe is innocent. I believe whatever’s going on here has more to do with me than her.”</p><p>“You think someone is using her to get to you?” Bernard replies, and I nod. “That would make sense. I have been going the ex-boyfriend route, but even he has been a dead end.”</p><p>“What do you mean?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He went home. He hasn’t even tried to contact her.”</p><p>“So why did he show up here?”</p><p>“I have my guy looking into his phone records. I want to find out how he knew Chloe was in the hospital. Someone had to have contacted him to give him that information.”</p><p>“For what purpose?”</p> <p>“Sir, if I may,” Ricket speaks, and I turn to look at my old friend. “You’re very possessive of Ms. Kasters. Perhaps whomever did this believed you would do something rash.”</p><p>“Like what?”</p><p>“Perhaps leave, sir,” Ricket says.</p><p>Memories of my marriage come back to me. I never even asked my ex if she was having an affair—not that I needed to. But even if all of the evidence hadn’t been right there in front of me, I still wouldn’t have given her a chance to explain.</p><p>I have never been the most understanding person. Chloe hasn’t been in my life for long, so if someone were trying to make me believe she was playing me, was having a relationship with someone else, and didn’t understand the depth of emotions I feel for her, they may have thought they could make me believe them.</p> <p>What they don’t know is I’m obsessed with her, and there is nothing anyone can do, including her, that would deter me from keeping her.</p><p>“How long will it take to get the phone records?”</p><p>“It will take a few days. Phone records are a little more difficult.”</p><p>“Let me know what you find out as soon as you have the information.”</p><p>“You know I will,” Bernard answers, patting my arm before heading towards the front door.</p><p>“Would you like me to do anything, sir?” Ricket inquires.</p> <p>“No. Just have a good night. Tomorrow, I will need to go into the office for a few hours. I’ll call when I’m ready to leave,” I tell him, and he nods once before heading towards the front door.</p><p>Once I know they are gone, I head towards the bedroom to check on Chloe. There is a lot to think about, but I know that my men will be able to handle it.</p><p>Chapter 4</p><p>“Nolan!” Chloe yells, and I lean my head back to look at the ceiling before letting out a long breath.</p><p>She has been on a rampage since coming home a few hours ago, and I’m ready to spank her ass. This morning, I told her not to go to work, and I believed she agreed with me and was going to stay home. But it seems my beautiful girl has become hard of hearing, because an hour after I arrived at my office, I received a phone call from Bernard informing me that Chloe had been spotted leaving the building by one of his men, who had then proceeded to follow her, making sure she arrived at the bakery safely before posting up outside until I could meet him there.</p><p>As soon as I received this information, I ended my meeting early and met Ricket downstairs so I could pick Chloe up myself. Even if she didn’t care about her safety, I did, and there was no fucking way I was taking a chance with her being at a location that is completely open where, at any time, anyone could get to her.</p><p>After I arrived at the bakery, Chloe ran into the back kitchen. At that point, I should have known she wasn’t going to make it easy. It took ten minutes to corner her. I have to say that, even if she is tiny, she is fast. It didn’t end with me catching her; no, I ended up carrying her kicking and screaming out of the bakery and into the back of my car. I was surprised the police didn’t show up after the scene she’d caused. If it hadn’t been for her injuries, I would have spanked her ass for the stunt she’d pulled.</p><p>“Nolan!” she yells again.</p> <p>This time, I hear her stomping down the hall. I sit back against the couch and wait to see what happens.</p><p>“I know you can hear me,” she huffs, coming to stand in front of me.</p><p>“It’s hard not to hear you when you’re yelling, Angel,” I mutter flatly, closing up my computer.</p><p>“Don’t ‘Angel’ me,” she growls, throwing her hands up in the air. “Where are my clothes?”</p><p>“In the closet,” I say slowly, wondering if she’s really lost it.</p><p>“No, they’re not,” she huffs, blowing a piece of hair out of her face.</p><p>“Angel.”</p><p>“Don’t freakin’ ‘Angel’ me! What? Did you take them so I wouldn’t have anything to wear or have a way to leave the house again unless I was willing to go naked?”</p><p>“Though that does sound like a win-win, no.”</p><p>“Well then, someone has stolen my clothes.” She throws up her hands again before lowering them to her hips.</p><p>“Chloe, you must really want a spanking. You have been doing things all day to provoke me.” I rub between my eyes and look up at her only after she has been quiet for far too long.</p><p>“I’m not lying. All of my clothes, everything of mine, is gone,” she whispers.</p><p>Seeing the panicked look on her face has me standing and heading to the bedroom and into the closet. As soon as I hit the bedroom, a familiar smell hits my nose, but it’s gone before I can place it. I storm to the closet and see that all of her hangers are empty. I open and close drawers, coming up with nothing. Everything is gone. My angel has a lot of clothes, and there is nothing left—not even a stray pair of panties.</p><p>I leave her standing in the closet and go to the bathroom where she keeps all her girly shit. It’s all gone as well. I search our home from top to bottom, but everything of hers is gone. There is not even a sign of her left. If she weren’t standing right in front of me, I would think she had disappeared. When I turn around, Chloe is standing in the middle of the kitchen with her hands covering her mouth. That’s when I realize what I must look like. I can tell that my face is red-hot with anger and my body has expanded. I have no idea who the fuck came into our home, but when I find out, they are going to fucking pay.</p><p>“Come here,” I demand.</p><p>She walks across the marble floors. As soon as she is within reach, I pick her up and carry her with me into the living room, where I sit down with her in my lap before pulling out my phone and calling Bernard.</p><p>“Shhhh, Angel,” I whisper to the top of her head and pull her firmly against me when I hear her sob.</p><p>“Boss?” Bernard answers.</p><p>“Get your ass up to my place now,” I order then hang up. “We’ll get you all new clothes,” I tell her, and she shakes her head, causing her face to slide against my shirt.</p><p>“Why would someone take my stuff?”</p><p>“Let’s not talk about that right now,” I say softly, kissing the top of her head. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My mind is traveling rapidly, and I don’t want to explore the reason why until Bernard gets here. All I can think about is the fact that she left this morning, and that is when the people must have come in to take all of her stuff. I wonder what they would have done if she had been here alone. There is no telling what would have happened then. My building is secure, but just like any location, there is always room for improvement.</p><p>It takes three minutes for the phone to ring and them to tell me that they are sending a guest up. Chloe jumps at the noise and I shush her again before sitting her on the couch next to me so I can meet Bernard at the entryway.</p><p>“I’ll be right around the corner. Sit here until I come back,” I tell her, kissing her forehead. “Look at me, Beautiful.” I place two fingers under her chin, raising her eyes to mine. “It will all be okay.”</p><p>“I know,” she whispers and then looks over my shoulder when the bell goes off again.</p> <p>“I’ll be right back.”</p><p>She nods, and I kiss her lips before heading towards the door.</p><p>“What’s going on?” Bernard asks as soon as I open the front door.</p><p>I lead him back down the hall towards the living room, not wanting Chloe to be out of sight for more than a moment.</p><p>“All of Chloe’s belongings are gone,” I tell him over my shoulder.</p> <p>“How is that possible?”</p><p>“I would like to know the same thing.” I run a hand through my hair and walk to the living room, finding Chloe where I left her, but now, her eyes are on her phone in her hand, her face white as a ghost.</p><p>“What’s wrong?”</p><p>“I just got an e-mail,” she whispers and then lifts her eyes to meet mine. “What happened when you were in Japan?” Her bottom lip trembles and tears fill her eyes.</p><p>My stomach twists as I wonder what she could possibly be talking about. “What’s in the e-mail?” I coax.</p><p>She lifts her phone up towards me. The image on the screen is of me from the night I flew home when I found out she was in the hospital. I’m sitting in one of the chairs, and the angle the picture was taken makes it appear like the waitress and I are kissing.</p> <p>I remember that moment. I had been taking a drink from the waitress, and she had bent down towards me to ask a question, so I had leaned forward to hear her more clearly.</p><p>“That isn’t what it looks like,” I state, taking a step towards her. “Do not ever question the depth of emotions I feel for you. I would never disrespect you or us like that.”</p><p>Her eyes search my face, and she swallows before lowering her face towards her phone again. For a moment, I wonder if whoever is doing this has won, if they have succeeded in taking away the most important thing in my life. Then her phone clicks off, her eyes meet mine, and I see that she’s still with me, and the knot in my stomach unravels.</p><p>“I will find out who’s doing this and bury them,” I vow, turning towards Bernard. “I want to know who was here and how the fuck they got in. In the meantime, I’m taking Chloe to my house upstate. I want three men with us. I expect that, by the time I talk to you next, you have some kind of lead,” I tell him before turning back to Chloe and holding out my hand for her.</p><p>She takes it and I pull her up off the couch.</p><p>“Is Ricket driving you?” Bernard asks.</p><p>My first instinct is to say yes, but I think driving may help ease what I’m currently feeling. “I’m driving,” I reply, picking up my briefcase and car keys from the table beside the door.</p><p>As soon as we’re inside, I press the button for the garage then pull Chloe closer, rubbing her back. Her body melts into mine and I press a kiss to the top of her head while taking a deep breath of her scent. As soon as the elevator doors open, I turn left and head straight to my favorite car: my Aston Martin Vanquish.</p> <p>“I had no idea you even owned a car,” Chloe says quietly while putting on her safety belt.</p><p>“Seven,” I inform her, starting up the engine, the loud roar bouncing off the concrete walls.</p><p>“Seven?” She looks at me questionably.</p><p>“Seven cars, Beautiful.”</p><p>“You never drive,” she states, looking at me like I’m crazy.</p><p>“In the city, no, but when I go to my house upstate, I drive.”</p><p>“I didn’t even know you owned a house upstate,” she mumbles.</p><p>“There was no reason to bring it up. I haven’t been to my old house in months. I have always stayed in the city. But my parents live near there and insisted I buy it when the market bottomed out. They wanted somewhere for me to raise a family that was close to them. I’m sure we would have gone sometime soon. My mother can only be put off for so long. You know she has been chomping at the bit to meet you since you answered my phone when you saw her name appear on the caller ID.” I smile at the memory.</p><p>“Who keeps their parents saved in their phone under their real names?” she mutters, and despite the situation, I can’t help but laugh.</p><p>“She got a good laugh out of it.” I squeeze her hand.</p><p>“In all fairness, there were a lot of girls calling before that.” She sighs.</p><p>“Then you came along and I couldn’t see past you. I still can’t see past you.”</p><p>“I love you.” She places her hand on mine. The words “I love you” always feel so inadequate for what I feel for her.</p><p>“Love you too, Beautiful.” I bring her hand to my mouth and press a kiss there. “I don’t want you worrying. I want you to trust me to take care of you and to keep you safe.”</p><p>“I just wish I knew why all of this is happening.”</p><p>“You were right earlier. This has nothing to do with you. This is all because of me.”</p><p>“What did you do?”</p><p>“I’m not sure, Angel, but in life, sometimes all you have to do is be breathing in order to piss people off.”</p><p>“That makes no sense,” she replies softly, leaning her head over onto my shoulder.</p><p>The rest of the drive is silent, with Chloe asleep while I go over potential suspects in my head. I know I have made enemies doing the work I do, but none of them would ever be so personal in their revenge. Women of my past flash through my head, but I can’t see any of them doing this.</p><p>My mind keeps venturing towards Maxine, the way she has acted and the things she’s said to me regarding Chloe, but I believe my relationship with her father would deter her from doing anything like this. I have no main suspect, no real reason for this turn of events. Nothing like this ever occurred when I dated in the past. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We pull up to my house after an hour, and Chloe sleepily lifts her head when I move her to punch in the code for the gate.</p><p>“This isn’t a house,” she says.</p><p>I turn my head to look at the structure in front of us. It’s all brick, with three-story, white pillars that line the front porch. It’s ten thousand square feet, eight bedrooms, nine baths, with a rec room and two large living rooms.</p><p>“I know it’s big, but I plan to fill every room in that house with a kid someday.”</p><p>“And who exactly is going to have that many kids?”</p><p>“You.” I smile when I see her shake her head out of the corner of my eye while I pull into the garage.</p><p>“Do I get a say in it?” Chloe asks, raising an eyebrow.</p><p>“You had a say the first night I walked you home. That was the time for you to run, but instead, you took my hand and let me get a taste of you. Now, I’m fucking addicted, and now, not even you can stop me from getting what I want,” I declare.</p><p>She surprises me by leaning over and pressing a kiss to my lips before quickly getting out of the car. I turn off the engine and shut the door for the garage while I’m still in the car, and then I unhook my belt before opening the door and getting out. Chloe is standing at the rear of the car as I pull off my suit jacket, laying it over the trunk then pulling my belt loose. I hold it in one hand while the other one grabs Chloe around the waist, jerking her towards me.</p><p>“My beautiful angel,” I mutter, crashing my mouth down onto hers while pulling her hands behind her back.</p><p>Her moan is the exact sound I want to hear as I use my belt to quickly bind her hands. Once she’s bound, I lift her, placing her on my jacket.</p><p>“Nolan,” she gasps as I slip her shoes off. Then I rip open her jeans, pull them over her hips, and toss them to the ground behind me.</p><p>“No talking,” I snarl as I lift her legs from behind her knees and pull her ass towards the edge. “Do you see, Chloe?” I growl, using my fingers under her chin to pull her face towards me. “Do you understand that, when you continue to give yourself to me willingly, you constantly feed the addiction I have for you?” I travel my hands up her thighs, to her waist, then up under her shirt, pulling it over her head in the process. “But, for you, there is no cure, no treatment,” I rumble against her mouth, licking it before licking down her neck to the tops of her breasts, pulling down the cups of her bra, and then stepping back to look at her.</p><p>“Open,” I say, placing my thumb in her mouth, swirling it around her tongue. Once it’s coated nicely, I pull it free, immediately placing it on her clit, using her saliva and juices for lubrication smoothly to circle it. “Put your feet on the trunk and stay open for me,” I order, never stopping my ministrations.</p><p>Once she’s positioned like I want, I kiss her in approval, showing her what I will soon be doing with my mouth to her pussy. She cries out as I twist her nipple while thrusting deep into her soaking-wet sex. I slowly pull away from the kiss so I can watch her face as she comes.</p><p>Her pussy tightens around my fingers as her eyes roll back into her head. Before her orgasm even passes, I lower my face, keeping my rhythm deep inside her while swallowing all of her juices. When her body begins to tremble, I know she is going to go over again, so I make a quick decision, using one hand to pull myself free.</p><p>My cock is rock hard, throbbing with anticipation, knowing that, soon, it will be surrounded by hot, wet silk. There is nothing better than being inside her, nothing better than knowing that her pussy was made to take only my cock. Since taking her virginity, I swear my cock was designed to fit inside her like the perfect puzzle piece.</p><p>I thrust slowly at first, then faster, watching my length disappear. Her tits are bouncing over the top of her bra with each thrust. Her knees start to shake as her pussy begins to ripple around my girth, and when I know she’s on the verge of coming, I pull out and bury my face between her legs so she can orgasm on my tongue. Then I stand, sliding back inside her hard and fast, making the car rock.</p><p>Her cry of ecstasy eggs me on, making me fuck into her wildly until my balls draw up and I force her face to mine.</p><p>“One more. Give me one more,” I growl, forcing my tongue down her throat as long jets of come shoot off inside her, filling her womb with my seed, setting off her third orgasm.</p><p>Her body goes limp, and I pull her to my chest, running my hand down her back then releasing the belt from her wrists. It takes a few minutes for her to come back to me, but the first thing she does is kiss my chest, cuddling closer to me. This is why my addiction for her grows. She accepts me, all of me, while asking for even more.</p><p>I tilt her head back and place a soft kiss on her lips before slipping out of her and fixing my pants. Then I look at her clothes, which are now in a pile on the floor, and take off my shirt, putting it on her before lifting her under her ass and wrapping her legs around my waist.</p><p>“Okay, Angel. Let’s show you your new home,” I say, carrying her to the door.</p> <p>I should have brought her here a long time ago. When I knew what she meant to me, I should have kidnapped her ass and brought her here, where I could have kept her to myself and we could have started our lives without ever giving anyone the opportunity to fuck with us.</p><p>I carry her inside, entering right into the kitchen, where I set her down on the counter.</p><p>“Let me get you some water, and then I’m going to call my mom and have her pick you up some stuff to wear. When I know things have calmed down a little, we can go to the mall,” I say, going to the fridge, pulling out a bottle of water, then bringing it to her.</p><p>“I can go,” she says.</p><p>My hand with the water bottle puts it to the side then lifts her face to me. “You will not leave unless I’m with you.”</p><p>“I never said I was going alone,” she replies calmly, placing her hand on my cheek. “I just feel weird having your mom get me clothes.”</p><p>I force my body to relax before speaking. “Don’t. It will make her feel like she’s helping. Would you like to take a bath?”</p><p>She nods and I pick her up again, carrying her upstairs to our bedroom. Once I have the bath full, I help her out of my shirt then watch as she lowers herself into the water.</p><p>“I think I’m going to wait a few days to call my mother,” I tell her, pulling my pants off.</p><p>“Why?” she asks confused.</p><p>“If I don’t call her, you have nothing to wear. I can think of worse ways to spend my days.”</p><p>She bites her bottom lip then breaks out into laughter, tossing a handful of bubbles at me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’ll pay for that.” I lunge for her, making her laugh louder.</p><p>That’s the instant I realize how much I have missed that sound and vow to find a way to make her laugh every day from this day forward.</p><p>Chapter 5</p><p>“You’re not wearing that. Go and change,” I growl, watching my beautiful angel walk towards me in a white dress that looks like it was designed to piss me off.</p> <p>The front is hooked around her neck with some kind of choker made of crystals and gold. The fabric of the dress is attached there, just at the front of her neck, before flowing down over her breasts. Then the waist of the dress is bunched together with a belt that matches the choker. Her sides are completely exposed, showing off a large expanse of her skin ̧ as the skirt flows to the floor. I’m sure if she turned even slightly, I would see the side of her breast. Being at a party attended by the men from my firm with her in that dress will definitely lead to me shoving my fist into someone’s face when they look at her too long.</p><p>I watch as her step falters and her smile disappears.</p><p>“You sent this dress for me to wear,” she mutters, looking down.</p><p>I cannot stand that she is going to be out in public in that scrap of fabric, but I really can’t stand the look on her face right now. This is entirely my mother’s fault. She has fallen in love with Chloe and loves dressing her. She was in my office when the invite showed up for the party and insisted she be the one to pick Chloe’s dress. I should have known better.</p><p>“You look stunning.” I step towards her, running my index finger down her bare side. “I don’t know how I’m going to make it through the evening without killing every man who looks at you.” That’s not a lie, I think, tracing the edge of her breast.</p> <p>“You didn’t pick this, did you?” she asks.</p><p>I lift my eyes to meet hers and shake my head.</p><p>“I can change.”</p><p>“No. You look...” I shake my head, trying to think of a way to describe her. “You look absolutely beautiful.”</p><p>Her hair is down, framing her face. Her makeup is light, just adding to her already elegant features. And the dress, though risqué, still looks charming on her. “I’m sure to be the envy of every man there.”</p><p>Her eyes narrow and she chews on her bottom lip. “Are you sure you’re going to be okay?”</p> <p>It’s on the tip of my tongue to say no, but there is no way I can do that to her—not right now. We’ve been staying in Westchester for two weeks now, and since coming here, I have seen my girl come out of her shell more and more. The first week was difficult. I knew she was very worried about everything that had transpired since leaving the city, but with my family and me around, she has blossomed. I was working from home most days and spending the nights trying to implant my child inside her. Even with everything hanging over us, I feel content, more at ease than I have in a long time.</p><p>“I know it’s not something I would pick for myself,” Chloe says, bringing me back to the moment, “but I kind of like it.” She smiles, and I know I will end up regretting this, but seeing that smile makes it somewhat worth it.</p><p>“Nolan.”</p><p>I hear my name and turn my head to the left, seeing Carter standing with a tall blonde I’m sure he met sometime within the last twenty-four hours.</p><p>“Carter.” I stop with my hand around Chloe’s waist, trying to block her from his view.</p><p>Carter’s father owns the second-largest international law firm in New York City. He went to Yale and has made a name for himself in the world of law since passing his bar exam by settling billion-dollar cases. He has also made a name for himself in the beds of women all over the city. At thirty years old, good-looking, with enough money to put Bill Gates to shame, he has women killing themselves just for a moment of his time. All of them want to be the one to turn the player into the perfect husband.</p><p>“Nolan, nice to see you.” He sticks out his hand.</p><p>The blonde at his side latches on to him, her red nails digging into his suit jacket as she gives me a smile.</p> <p>“Who do you have here?” he asks, his eyes zeroing in on Chloe, whose own fingers begin digging into my skin through the fabric of my suit.</p><p>“Chloe,” she replies, and I look down at her, seeing that her eyes are glued to Carter’s date. “His girlfriend,” she adds in a tone I have never heard from my angel before.</p><p>I bite back my smile as she looks up at me and glares.</p><p>“Nice to meet you, Chloe,” Carter says and begins to pull Chloe’s hand to his mouth. Lucky for him, she pulls away from his grasp, helping to save his life.</p><p>“Nice to meet you, too.” She smiles then looks at me. “I would like a drink.”</p><p>“Sure, Angel.” I run my fingers down her bare side.</p><p>She narrows her eyes, making me smirk at her before I look back at Carter, who is looking between us curiously.</p><p>“We’ll talk soon,” I tell him before leading Chloe away towards the bar.</p><p>“Who is that woman?” Chloe hisses at me once we are away from the crowd.</p><p>My eyebrows pull together as I ask, “What woman?”</p><p>“The blonde.”</p><p>I look around the room and see that Carter’s date is watching us, and when our eyes meet, she smiles at me and her eyes heat.</p><p>“Yes, her,” Chloe growls.</p><p>I gaze down at her, finding her flipping off the blonde. I grab her hand and pull it behind her back before anyone can see.</p><p>“I don’t know her,” I growl back. “Now, behave yourself.”</p><p>“Behave?” she repeats.</p><p>“Yes. Unless you would like me to bend you over and spank you in front of all of these people for acting like a brat, I suggest you behave.”</p><p>“You wouldn’t.” She struggles against my hold.</p><p>My arms wrap around her, turning so that my body is blocking her from the rest of the room as I slap her ass hard enough to get her attention. Her body stills and her mouth opens on a gasp.</p><p>“Now, behave,” I tell her again.</p><p>“You just spanked me.”</p><p>“You’ve been spanked by me before, Chloe. You know what a real spanking is. That was just me getting your attention.”</p><p>“She keeps staring at you,” she whispers, trying to look around me.</p><p>I pull her face towards me so that I have her full attention. “Where is all of this coming from?” I question, holding her cheek.</p><p>“I just don’t fit in here.”</p><p>“You fit in wherever I am. You outshine every person in this room. Do not ever doubt your worth,” I tell her, kissing her softly. “Now, let’s go get this over with so I can take you home and tie you to the bed with that dress.” I smile against her mouth as she rolls her eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We spend the rest of the evening mingling. Chloe has every person I introduce her to eating out of the palm of her hand with her kindness and finesse—not that I’m surprised. The qualities that draw people in are the same qualities that made me fall in love with her in the first place.</p><p>I do notice, though, that Maxine is nowhere to be seen. I transferred her the week prior to work with another lawyer after she had made a statement about Chloe to her father, telling him that, since Chloe had come into my life, she had noticed a reduction in my work and she worried that my relationship was going to affect the firm. I could no longer let her distaste for Chloe slide.</p><p>The ripping sound of the white fabric that was covering Chloe fills the room as I tear her dress down the middle. Her eyes widen and her lips part as I lead her to the bed, positioning her in the middle with her legs spread before tying her ankles to the posts.</p><p>“This dress has driven me crazy all night,” I say, running a piece of the fabric through my hands. “Watching men looking at you, watching how their eyes would heat as you spoke to them,” I say, running the fabric over the tops of her breasts. “Did you enjoy that? Did you enjoy making me jealous?”</p><p>She shakes her head, and I tilt mine to look at her, searching her expression as I take one of her hands and kiss her wrist before wrapping a piece of the fabric around it.</p><p>“I believe you enjoyed it,” I say, grazing a finger down her arm, over the tips of her breasts, over her belly, and then down to cup her pussy. My middle finger presses into her wetness.</p><p>“Nolan,” she hisses, lifting her hips.</p><p>I press in harder, gathering some of her juices, then bring my fingers to her lips, coating them before leaning over and licking her mouth.</p><p>“So sweet,” I groan into her then stand and walk around the bed to lift her other wrist to my mouth, this time sucking it before wrapping the fabric around it and tying it to the headboard. “Now, where do I start?” I smile, taking off my cufflinks, loosening my tie, and unbuttoning my shirt before shrugging it off my shoulders.</p><p>Her eyes are locked on my zipper, where my cock is outlined. I take off my belt then slowly pull down my zipper, watching her eyes. Once I’m free, I wrap my fingers around my cock and begin pumping.</p><p>“Do you want a taste?” I ask.</p><p>She nods, so I crawl up onto the bed, kneel over her face, and feed my length into her mouth and down her throat. I have taught her how to control her gag reflex, so she is a pro at taking me just the way I like.</p><p>I fuck into her mouth then use one hand to slide down her stomach and over her clit, making her hips buck. She is so wet that my fingers slip inside her with ease.</p><p>“Fuck, baby, I’ve got to have a taste of you,” I say, causing her to moan around my cock.</p><p>Then I bury my face between her legs. My arms go around her thighs and spread her open farther so my tongue can go deeper. I lick and suck her clit, making sure to tease her with the tips of my fingers at her entrance until she is writhing under me.</p><p>Her moans around my length make it hard to hold off my orgasm, so I move quickly, pulling out of her mouth, not wanting to waste my come down her throat. Once I’m in position, I thrust into her hard, her hands straining against the rope, and her legs shift as she fights to get loose.</p><p>“There is no place I would rather be than inside of you. Nowhere,” I groan against her ear, feeling her pussy trying to suck me deeper. “Come with me, Angel. Tighten that pussy and come with me,” I snarl down her throat.</p><p>Her pussy begins to milk my orgasm right from me. Then I plant myself deep and come, filling her with my seed.</p><p>“That time, I gave you my kid,” I whisper, and her pussy tightens again. “You like that idea, Angel?” I ask as I lean back to look at her. I place my hands on her face to hold her gently. “Do you like the idea of having my baby?”</p><p>“Yes.” She smiles as tears begin to fall into her hair.</p><p>I smile and lower my mouth to hers, kissing her once more.</p><p>Now, I just need to marry her and make it official.</p><p>“I’m surprised you wanted to come back here,” she says, laughing as we pass a group of kids on the way into the museum.</p> <p>I look down at her then follow her eyes to where a little boy is licking the glass of one of the displays and shake my head. “The last time we were here made me realize how many little things I miss out on, and I don’t want you to not experience things just because I’m busy.</p><p>“I don’t feel like that.” She frowns. “I love the life we have with each other.”</p><p>“I’m glad, Angel. I just know my schedule is hectic, and I need to learn how to properly balance it all,” I say, walking her over to the large-screen TV they have playing videos of dolphins and whales.</p><p>The moment we’re standing in front of it, a video begins to play images of places that have meant something to us—the bakery where I first saw her, her old front door, where we shared our first kiss, the restaurant we had our first date, and then where we are right now. Chloe looks at the screen then at me as I get down on one knee, opening the ring box.</p><p>“Marry me, Chloe. Say you will be my wife.”</p><p>Her eyes instantly fill with tears as she whispers, “Yes.”</p><p>Her hand is shaking frantically as I slide the five-carat ring onto her finger. Then I bring it to my mouth and place a kiss on it before standing, bending her over my arm, and kissing her until we’re both panting for breath. When I stand us back up, the crowd around us begins to applaud. I look at my angel and smile.</p><p>“I can’t believe we’re getting married,” Chloe says. She holds her hand up to the light coming thought the bedroom window, which makes her ring sparkle.</p><p>“You shouldn’t have been surprised, Angel.”</p><p>“I know I shouldn’t have, but even now, this seems surreal. I can’t believe that you’re mine.”</p><p>My gut twists from knowing that she feels this just like I do.</p><p>“I will forever be yours, Angel,” I tell her, pulling her hand to my mouth and kissing her fingers.</p><p>Chapter 6</p><p>The sound of Chloe getting sick has me sitting up in bed. This is the second morning this has occurred. I would assume she’s pregnant, but she had her period, so the sickness has me worried.</p><p>“Angel,” I say quietly, kneeling down beside her and placing a cool rag on the back of her neck. “I’m taking you to the doctor today. I know you said you’re fine, but you keep getting sick and I can’t stand to see you like this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m fine,” she says sleepily, laying her head in the crook of her arm. “It will pass.”</p><p>“It’s no longer your choice. I’m taking you.” I pick her up, carry her to the sink, and help her brush her teeth before helping her get dressed, all while listening to her complain the entire time that she doesn’t want to go to the doctor, but I still call and make her appointment.</p><p>“You’re overreacting,” Chloe repeats for the twentieth time since we arrived at the doctor’s office.</p><p>I look at her and shake my head. “The doctor will tell me if I’m overreacting or not, and I don’t believe I am.”</p> <p>“We should make a bet.” She laughs when I look at her and narrow my eyes. “If the doctor says there is nothing wrong and I’ve just got a bug, like I told you I do, you have to be my slave for twenty-four hours.”</p><p>“And if I win?”</p><p>“I’m at your disposal.” She smirks, and I chew the inside of my cheek like I’m debating agreeing to her terms.</p><p>“Are you not always at my disposal?” I grin, crowding her against the table.</p><p>“I could say no if I wanted to,” she breathes as I kiss down the side of her neck to the top of her shirt, imagining having my way with her right now.</p> <p>“You could say no,” I agree, “but you won’t.” I growl, nipping her skin, and I laugh when she moans my name.</p><p>“Can’t you just play along?” she huffs, glaring at me when she realizes I’m laughing.</p><p>“Fine. If there is nothing wrong, I will do whatever you want. But if I’m right, you have to do whatever I say tonight.”</p><p>“Deal.” She smiles and sticks out her hand, and I give her a shake while laughing at how cute she is.</p><p>“You really are feeling better, aren’t you?” I question when she begins to laugh.</p><p>“I told you I was. I don’t know why it happens. I just feel sick sometimes.”</p> <p>“I think you should take a pregnancy test, Angel.”</p><p>“I already told you I started my period.” She frowns.</p><p>“Hello,” the doctor says, walking into the room, ending the conversation between the two of us.</p><p>“How old are you?” I demand; the guy barely looks legal.</p><p>“Nolan,” Chloe hisses, elbowing me in the ribs.</p><p>“The guy hardly looks old enough to drink, let alone practice medicine,” I tell her, looking at the doctor, waiting for him to reply.</p><p>“I’m actually thirty,” he says, smiling at Chloe.</p><p>“See? He’s old. Now, can we please just get on with this?” Chloe prompts, and the doctor’s face falls at the word ‘old,’ almost making me laugh.</p> <p>“What seems to be the problem?” he asks, clearing his throat.</p><p>“She’s been waking up sick,” I tell him.</p><p>He looks at me then back to Chloe. “Are you pregnant?”</p><p>“No! Sheesh.” She rolls her eyes.</p><p>“Are you sure?” he asks.</p><p>“I started my period. So, yes, I’m sure.”</p><p>“How about we just test you, just in case.”</p><p>“Fine,” she growls.</p><p>After snatching the cup he pulled out of the drawer from his hand, she leaves the room, slamming the door. That would be another reason I want to find out if she is pregnant. The past few days, it hasn’t taken much to set her off.</p><p>“I’ll be back with the results,” the doctor mutters as he leaves the room.</p><p>It only takes five minutes after Chloe gets back for the doctor to step into the room with a piece of paper.</p><p>“You’re pregnant,” the doctor says, walking over to his rolling chair to take a seat, and I freeze in place.</p><p>“That’s impossible.” Chloe looks from the doctor to me. My mouth opens and closes, but not words come out. “Maybe you were right. Maybe he’s too immature.”</p><p>“I did two separate tests to confirm it, and we can do a blood test if that’s what you like, but the results will be the same. You’re pregnant,” he growls then looks at Chloe, who I have pulled into my lap. “A lot of women think they are having their period, but really, they are having what’s called implantation bleeding.”</p><p>“We’re pregnant,” she says, and I feel her smooth hand on the side of my face. “We’re pregnant,” she repeats.</p><p>My eyes close. I finally have everything I could ever ask for.</p><p>“We need to get married,” I state.</p><p>“We are getting married.”</p><p>“No, I mean we need to get married now.” I pause, kissing her lips. “Today.”</p><p>“Do you want to go to Vegas?” she jokes, but I think that sounds like the perfect idea.</p><p>“We’ll leave tonight. Mom can plan some kind of party when we get home.”</p><p>“Nolan, slow down.”</p><p>“No, we’re getting married. I agreed with you before because you wanted to plan the wedding with our mothers, but this is no longer only about you. Now, we have our child growing inside you. Your mother and my mother will just have to get together and plan a party or some shit.”</p><p>“Plan a party?” she whispers, looking at me like I’ve lost my mind.</p><p>I ignore her and pull out my phone, sending a message to Ricket that tells him to bring the car around. Once we’re out of the office with an appointment for a few weeks later and a prescription for prenatal vitamins, we head out of the building.</p><p>“Sir, madam,” Ricket says.</p><p>Chloe rolls her eyes, making Ricket’s mouth twitch. She keeps asking him not to call her that, and I believe that, normally, he would stop, but he enjoys ruffling my angel’s feathers.</p><p>“Ricket, we need to go to the airport. Just call ahead and have the plane readied to leave within the hour for Vegas.”</p><p>“We’re not even going home for clothes?” Chloe asks.</p><p>“You can buy clothes in Vegas.”</p><p>“This is ridiculous.”</p><p>“This is what I should have done weeks ago. Hell, I should have just taken you to Vegas the first night I met you and married your ass,” I say, following her into the back of the car.</p><p>“Nolan, you’re being crazy.”</p><p>“Beautiful”—I pull her into my lap and grab her face—“this is not up for debate.”</p><p>“So we’re going to Vegas and getting married without anyone to witness it? Do you have any idea how mad our mothers are going to be?”</p><p>“We’re not going to argue about this. We’re going to Vegas,” I tell her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She presses her lips together and shakes her head. “When your mom hears about this, don’t blame me.”</p><p>“It will be fine.” I shrug.</p><p>“If you say so,” she mutters.</p><p>When we arrive in Vegas, it doesn’t take long to get everything in place. Chloe has her dress sent up to the penthouse of the Paris Hotel while we’re still in the air, and I take care of a tux for myself. I also have someone brought in to do her hair and makeup along with someone to take photos. Even with this being short notice, I want Chloe to have good memories of this day.</p> <p>“Who are you speaking to?” I ask her, walking into the bathroom, where there is a group of people around her.</p><p>“It’s not your mom, if that’s what you’re asking.”</p><p>“I know you already did your damage talking to her. Who now? Your mom this time?”</p><p>“No, it’s Bre. She asked if I could meet her for dinner, but I told her no because my crazy fiancé decided we’re getting married today and flew us to Vegas.” She rolls her eyes then presses her ear closer to the phone when I give her the signal to hang up.</p><p>I told her that I didn’t want her speaking to her anymore, but apparently, she is not listening lately. Half the things I say to her go in one ear and out the other. I think she spends her days trying to think up ways to piss me off. I can’t even imagine what it will be like now that she is pregnant. As soon as she ends the call, I snatch the phone from her hand.</p> <p>“I do not want you to talk to her.”</p><p>“Why?”</p><p>“She was one of the women you were with the night you were drugged.”</p><p>“You don’t still believe she had anything to do with that, do you?” she asks.</p><p>“I have no way of knowing for sure, so until I have evidence that excludes her, she is not to be trusted.”</p><p>“What reason would she have to do something like that?” she asks as a frown forms on her lips.</p> <p>“People do crazy things every day. You never really know the reasoning.” I do not want her to live in fear, but the reality of the situation is we don’t know who to trust right now, and there is no way I will risk her safety.</p><p>I go to her side and spin the chair around, placing a hand on each armrest. “Let’s not think about that today.” I move a small piece of hair off her forehead with my finger. “Today is about us starting our future and enjoying the fact that you are carrying my child,” I declare, watching her face transform and a look of amazement fill her eyes.</p><p>“I still can’t believe I’m pregnant.”</p><p>“I can. I think deep down, even after you told me you had started your period, I knew you were pregnant,” I say quietly.</p><p>“How?” she whispers, leaning towards me with a tender look on her face.</p><p>“You’ve seemed more settled, more at ease, like you’re content with where you are.”</p><p>“I’m with you. How could I not be content?”</p><p>“What have you done with my mischievous fiancée?” I grin and she laughs, sitting back in the chair.</p> <p>“If I acted like everyone else in your life, you would have grown bored with me.”</p><p>“I doubt that, Angel.” I chuckle, kissing her temple before standing to my full height. “I will see you at the altar.”</p><p>“I’ll be there,” she murmurs as I turn for the door. “Nolan.”</p><p>I turn and look at her over my shoulder, watching her swallow then chew on her bottom lip. “What is it, Beautiful?”</p><p>She lifts her hand before dropping it to her lap, saying quietly, “I wouldn’t have you any other way.”</p><p>Something about those softly spoken words make me feel more powerful than I have ever felt before. A lump forms in my throat and I nod, leaving before I do something pussyish like start crying.</p><p>“Son,” my father says as soon as I pick up the phone.</p><p>“Dad,” I reply. I know exactly what’s coming. Chloe called my mother on the way to Vegas, and my mother immediately began freaking out. Then she proceeded to call Chloe’s mom and add her into the conversation.</p><p>“Your mother wanted me to call you to tell you that you are now disowned and cut out of the will.”</p><p>“Dad, I don’t want to sound disrespectful, but I haven’t even thought about my inheritance since I turned twenty-five.”</p><p>“That’s exactly what I told her. Regardless, she wanted me to phone you anyway,” he says on an exhale.</p><p>“Tell Mom that, if she relaxes, I will let her plan the baby shower,” I say, hanging up the phone just as my dad prompts, “Pardon?”</p><p>It takes approximately thirty seconds for my phone to begin ringing again. I look at the caller ID and smile but press ignore as I head to the elevator. I know my mother, and I know she’s in a tizzy over the news that she is going to be a grandma and will forget about the wedding—at least for a little while. Since the moment she met Chloe, she has hinted that we needed to work on making her a grandmother, so now, her wish is coming true.</p><p>I arrive at the chapel, and the moment I enter the room, the officiate is at my side, leading me to the altar to wait for Chloe. I never believed I would want to get married again, but Chloe has changed that for me too. The tighter I can tie her to me, the better off I will be. She is my personal brand of kryptonite.</p><p>When the music begins to play, I turn towards the door, and my breath instantly stills when Chloe appears. Her dress is all lace, starting at her neck then completely covering her body, including the tops of her hands. The delicate fabric looks like it has been painted onto her, and as much as I love what she is wearing, I can’t wait to see what she has on underneath.</p><p>When we were in New York, Chloe and my mother were going back and forth about dresses. My mother wanted her to have a certain style of dress, and Chloe wanted something completely different. I stayed out of it unless Chloe asked me to step in. My mother could be opinionated, but Chloe was stubborn as fuck, and if she really wanted something, she would find a way to get it.</p><p>Now, seeing her walk to me in a dress I know she picked out, with her hair down and makeup that only enhances her already beautiful face, I am glad Chloe got her dream dress. The officiate says something as she arrives in front of me, but I hear nothing but the beat of my own heart as I pull her closer.</p><p>“You look breathtaking,” I whisper against the shell of her ear.</p><p>Her hands fist into the lapels of my suit as I stand at full height, keeping her so close I can feel the heat of her skin. I’m so entranced by her that the rest of the ceremony is a blur until the moment Chloe takes my hand as the officiate repeats the words I just spoke to her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I never expected to wear a ring again. I never expected Chloe to have a ring for me to wear, so I’m overwhelmed with emotions as she slides a simple band onto my finger. I don’t even wait for his permission to kiss the bride. As soon as her eyes travel from the ring that is now on my finger up to lock with my eyes, I wrap a hand around her waist, bend her back over my arm, and take her mouth in a deep kiss.</p><p>“Thank you, Angel,” I whisper against her mouth.</p><p>“For what?” she whispers back, looking up into my eyes. The look in hers is so vulnerable and trusting that I know I have been given the greatest gift anyone could ever receive.</p><p>“You,” I grunt, overwhelmed with emotion as I pick her up and carry her to the elevator, ignoring the startled look from the chapel staff.</p><p>Chapter 7</p><p>As soon as I get the door to the suite open, I step through and kick it closed behind us, causing Chloe to laugh.</p><p>“How much do you love this dress?” I ask her, tossing her onto the bed. Then I quickly strip off my jacket and shirt before crawling on top of her.</p><p>“It was expensive,” she moans as my hand travels up her inner thigh then up the center of her pussy, feeling that the material of her panties is already soaked through.</p><p>“I could buy a million of these dresses. I just want to know how much you love it before I rip it off you.”</p><p>Her eyes close and her lips part as my fingers slide into the side of her panties. “I love it,” she breathes, making me smile.</p><p>“You love the dress or me touching your pussy, Angel?” I ask, and her hips shift.</p><p>It takes a moment for her to come back to herself, but when she does, her head lifts and our eyes lock.</p><p>“Both,” she moans, pressing her hips down, causing my fingers to slide into her.</p><p>“You better take it off then,” I growl, slowly my fingers move in and out of her, my thumb circling her clit.</p><p>“Stop,” she cries, and I shake my head, lift the front of her dress up, lower my face, and suck her pussy through the material of her panties.</p><p>“Take it off, Angel,” I snarl, biting the lips of her pussy.</p><p>“I can’t when you’re doing that!” she screams.</p><p>I slow down and lift up slightly as her shaky hands begin to shift her dress up and then pause.</p><p>“The back is buttoned,” she hisses.</p><p>“Interesting,” I mutter, flipping her to her stomach then climbing back between her legs.</p><p>Her hands go to the bed, putting her on all fours in front of me as I slowly begin unbuttoning her dress from the back of her neck down to her hips. As I carefully slide the fabric down her shoulders, I expose a lace bra the exact color of her flawless skin.</p><p>I run a finger from the back of her neck down to her lower back then back up again to trace the edge of the material before pulling her up with a hand under her waist so that she is kneeling in front of me. Her head leans back against my shoulder as her hands cover mine. It slides her dress off her body then back up to cup her breasts, twisting her nipples through the lacy material.</p><p>“This is pretty,” I whisper against her neck, looking down over her shoulder at her bra before pulling the straps down, exposing her breasts and watching as her already hard nipples become harder when they hit the cold air of the room.</p> <p>“Thank you.” She smiles, lifting her hands up and behind her head to wrap around my neck.</p><p>“You’re welcome.” I smirk, gliding my hand down her stomach, into her panties, and through the lips of her pussy before slipping them inside her and using my fingers to pull her hips back. I press my hips towards her ass, my cock settling between her cheeks through the material of her panties and my dress slacks. “You’re soaked, Angel,” I tell her as I fuck into her pussy hard with my fingers. “Do you want to come?” I question, biting her shoulder, neck, and then her ear.</p><p>“Yes,” she says shakily.</p><p>“Give me your hand,” I demand, and she slowly lowers one hand down. I grab her wrist, intertwining our fingers before slipping our hands between her legs.</p><p>“Nolan,” she whispers, sounding unsure.</p><p>“Shhhh, Angel. Just feel,” I tell her, nipping her jaw.</p><p>Her head turns towards me, and I shove my tongue into her mouth while pushing her fingers inside her pussy. Her thighs begin to shake as I use my fingers and hand to control the pace. Then I pull my mouth from hers. Her eyes are at half-mast, her lips swollen and pink.</p><p>“Do you feel that, how wet you are?” I ask, pulling her fingers out and bringing them to her mouth. “Open,” I tell her, and her lips part as I press her fingers into her mouth. “You taste that? You taste more amazing than anything I have ever eaten in my life and sweeter than the sweetest honey,” I say, pulling her hand away and covering her mouth with mine as I pump our fingers into her again, her cries filling my mouth as her pussy convulses.</p><p>“Oh, God,” she whimpers as her pussy soaks my hand and her body slumps forward.</p><p>I gently lay her down and move so I can slip the dress off her completely before taking off the rest of my clothes. Once I’m undressed, I crawl back up onto the bed. She lifts her hips, and then she pulls her panties down, dragging them her legs before tossing them at me and opening her thighs, showing me the evidence of her arousal.</p><p>My girl has become so brave. It seems like just yesterday I popped her cherry.</p><p>I lift her ass to sit on my thighs and open the lips of her pussy with one hand, wrapping the other around my width, and groan. I’m in so much pain. My balls are so tight that I know I won’t last long, but the night is young. I also know she will not be getting much sleep tonight.</p><p>“Easy, baby,” I tell her as she tries to lift her hips so the head of my cock slides an inch inside.</p><p>I grab her hands and pull her up, lowering my hips before raising them slowly. There is nothing better than feeling the wetness of her pussy as she uses her inner muscles to grip my cock.</p><p>“You’re so fucking hot, baby. Fuck, your pussy feels like it’s on fire,” I groan, lowering my head so I can watch myself disappear into her heat.</p><p>“Nolan,” she cries, and her hands go to my shoulders, where her nails dig into my skin.</p><p>I lower her back onto the bed and fuck her, making sure I don’t go as deep as I normally would.</p><p>“Please,” she begs as I slow down.</p><p>“No, Angel, we need to be careful.”</p><p>“No, harder.” She claws at my back and begins to thrash under me.</p><p>I grab her hands and hold them next to her head so I can control her. “Calm down,” I snarl, rolling my hips towards hers, feeling my length drag along her inner walls as she ripples around me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Nolan.”</p><p>“I’m here, Beautiful,” I whisper into her ear, slowing my thrusts and pressing kisses to the skin of her neck, cheek, and mouth. Then I release her wrists and hold her face between my hands while resting on my elbows. As I look into her eyes, I remember I now own her in the eyes of God and the law. She is mine, now and forever.</p><p>How the fuck I got so lucky, I have no idea, but knowing who she is to me, what she means to our future, has my thrusts going deeper and harder. Her head goes tilts and her back arches off the bed as her fingers scrape down my skin, leaving marks. Her pussy begins to ripple, and I thrust two more times before bottoming out deep inside her.</p><p>“Fuck,” I roar, coming hard. My muscles relax and I slump forward, careful not to put pressure onto her lower stomach.</p> <p>“I love you,” she whispers, and I gaze into her eyes. The love I see shining back at me solidifies that, as much as I own her, she owns me, and I wouldn’t have it any other way.</p><p>“Sleep, Angel,” I tell her, kissing her forehead then rolling to my side and pulling her into my arms.</p><p>When her breathing evens out, I turn off the lights and pick up my cell phone from the bedside table. The first thing I see is a message from my mom.</p><p>“You told her I’m pregnant?” is groggily whispered.</p><p>I look down at Chloe and fight back my smile when I see her glaring at me by the light from the phone.</p> <p>“Oh my God!” she yells, grabbing the phone from my hand. “She called my mom!” she cries, sitting up in bed and looking at me over her shoulder.</p><p>I put my hands behind my head and cross my ankles, smiling. “I had to give her something. She was upset about the wedding.”</p><p>“So you told her I was pregnant? Do you realize what you’ve done? My mom and your mom are going to freak out.”</p><p>“They will be fine. Just let them plan the baby shower.”</p><p>“Let them plan the baby shower,” she mumbles, staring at the phone.</p><p>“Angel, it’s fine. Don’t worry.”</p> <p>“Don’t worry?” she mutters under her breath.</p><p>I sit up and kiss her shoulder. “It will be okay,” I tell her, wrapping a hand around her waist.</p><p>“I think you’re delusional.” She shakes her head, handing me back my phone.</p><p>“I can’t believe you told them that I’m pregnant just so they would not freak out on you.”</p><p>“That is not why. I just wanted them to know. That way, they would have something else to look forward to.”</p><p>“Our mothers called me every day to talk about the wedding. Do you know what they are going to do now that they know I’m having a baby?”</p><p>“They are excited.”</p><p>“Yes, and now, I’ll never get a break ‘cause they are going to call or come over. I wouldn’t be surprised if my mom talks my dad into buying an RV so she can stay close...like ‘our driveway’ close,” she says, flopping back onto the bed.</p> <p>“Your parents are not living in our driveway.” I frown.</p><p>“If you say so. They are probably already on their way to New York now.”</p><p>“No,” I deny, glaring at her.</p><p>“Hey, it’s not my fault you have a big mouth. Be mad at yourself. I mean, for all I know, your parents are moving in as well.”</p><p>“Our parents are not living with us.”</p><p>“Okay,” she mutters, and I see a smile twitch her cheek.</p><p>“Maybe we should just build onto the house and have both our parents move in. We do have plenty of land,” I suggest.</p><p>“What?” she shrieks, making me chuckle. “That’s not funny.” She rolls her eyes, and I pull her down to me, tucking her head under my chin.</p><p>“Everything will be okay.” I press a kiss to the top of her head.</p><p>“I know.” She yawns, and I pull the blanket up over us.</p><p>Nothing matters anymore but us, and I know we will always be okay.</p><p>“Mom, calm down. What happened?” I ask, pulling my phone from my ear slightly so I can understand her better.</p><p>“Chloe!” she cries, and my stomach drops.</p><p>“What happened to Chloe?”</p><p>“She was almost run over and fell. We called an ambulance.”</p><p>“What do you mean ‘she was almost run over’?” I growl.</p><p>“We were leaving the baby store and she was getting into the car when a motorcycle came down the sidewalk and almost ran her over. She got out of the way, but she fell and hit her head against a parking meter.”</p><p>“Where is she now?”</p><p>“In the ambulance.”</p><p>“Jesus. Where are you exactly?” I roar as I run out of my office.</p><p>We haven’t even been home for a week. Since we’ve been back, our mothers have been keeping her busy with shopping and constant nagging about what is good for her and the baby. I was planning to go home tonight and force everyone out of our house so that I could get some alone time with Chloe, where we could just enjoy the fact that she’s pregnant. Life has been so consuming that I forgot Chloe was in danger and we have something to be concerned about.</p><p>“We’re at Bu and the Duck, near Church Street.”</p><p>“I’m on my way!” I shout into the phone as I head out of the lobby.</p><p>Just as I’m about to hail a cab, Ricket pulls around the corner in my car. I open up the backdoor and hop in.</p><p>“I need to get to Bu and the Duck on Church Street.”</p><p>“I know, sir,” Ricket says, and I pull of my suit jacket, tossing it across the back seat.</p><p>“How did this happen?”</p><p>“I don’t know, sir. I found out when her mother called me.”</p><p>“Her mom called you?” I ask, looking at him in the rearview mirror.</p><p>His eyes connect with mine as he nods before looking back at the road. “She said you would need to be picked up and where they were at.”</p><p>“Did she say anything else?”</p><p>“No, sir. She was distraught.”</p><p>“Yeah,” I mumble, looking out the window.</p><p>It takes less time than normal to make it across town. Once we reach the block my mom told me they were at, I see cop cars and a crying Chloe sitting in the open door of an ambulance. I don’t even wait for the car to come to a complete stop before I jump out and head straight for her. When I’m almost at her side, a police officer steps in front of me and nearly gets punched in the face as I try to get around him.</p><p>“This is her husband,” my mom says as I fight with the cop to get by.</p><p>The cop looks at her and releases the hold he has on my upper arm, letting me get to Chloe. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Nolan!” she gasps through tears.</p><p>“I’m here, Angel.” I wrap my arms around her, kissing the white bandage on her forehead.</p><p>“Who called you? I told them not to call you.” She shakes her head, pulling back to look up into my eyes.</p><p>“Excuse me?”</p> <p>“I didn’t want you to worry. I didn’t want you to have to leave work.”</p><p>“Beautiful, do you know the kind of trouble you would be in if I would have found out about what happened later instead of right now? You never keep anything from me, especially if that something has to do with you.”</p><p>“I’m fine, and you worry too much.”</p><p>“You were almost run over. You have a cut on your forehead, fell, and now have tears streaming down your cheeks and you don’t think I have a reason to worry?” I bark, making her jump.</p><p>“I know it sounds bad,” she mumbles, making a growl vibrate my chest.</p> <p>“It not only sounds bad, but is bad, Angel. Now, tell me. Have they made sure the baby is okay?”</p><p>“The baby is fine. I didn’t fall hard.”</p><p>“Chloe, I’m beginning to wonder if you understand what the fuck happened.”</p><p>“I know exactly what happened. I was walking out of the store when a stupid delivery bike almost ran me over. I jumped out of the way and tripped, hitting my head on one of the meters.”</p><p>“You don’t find it odd that a motorcycle was driving on a sidewalk of one of the nicest streets in Manhattan?”</p><p>“I don’t know.” She shrugs and smiles at the EMT, making me growl at him, which causes him to jump back and me to get hit in the chest.</p> <p>“This is not a joke, Chloe. You could have been seriously hurt—or worse.”</p><p>“I know it’s not a joke, but I don’t think you’re right about this. I think it was an accident. I mean, how would anyone even know where to find me?”</p><p>That’s what I’m going to find out. None of this was by chance. There had to be a reason all of this is happening now.</p><p>“I will figure it out, but until then, you’re not to go out unless I’m with you.”</p><p>“I would like to remind you that I didn’t want to go out in the first place, but our mothers insisted I find a christening gown.” She lifts her hands before dropping them to her side. “I didn’t even know we are Catholic,” she complains, making me smile despite the situation and kiss her head.</p><p>“We’re not Catholic—well, not practicing, anyways. But Mom was baptized, and so was I, so she just wants to keep the tradition.”</p><p>“I think our moms need a hobby that doesn’t include me.”</p><p>“They are excited about the baby.”</p> <p>“I know.” She leans her head on my shoulder as we watch the police talk to our mothers while Bernard stands near them, listening to the details of what occurred.</p><p>I make eye contact with Bernard and nod when he shakes his head. I can tell that he doesn’t believe this was an accident either.</p><p>Chapter 8</p><p>“Who’s on the phone?” I ask Chloe, walking into the bedroom, where she is sitting up on the side of the bed with the phone to her ear while she paints her toenails some strange purple color.</p><p>“Bre called to see if I was okay,” she says, leaning her head back and accepting my kiss.</p><p>“What did I tell you about speaking to her” I ask.</p><p>She presses her lips together then frowns and pulls the phone from her ear, setting it down on the bed next to her hip.</p><p>“What’s wrong?”</p><p>“She hung up.” She shrugs and begins painting again.</p><p>“Good,” I mutter, looking down at the phone and seeing that the image on the screen is a picture of Bre that pops up when she calls. The longer I look at the picture, the more something in the back of my head keeps niggling me. I know her from somewhere, but I just cannot place where. I shake off the feeling and head for the shower.</p><p>My guys are working on getting the security tapes from what happened this afternoon. Hopefully, they will have something for me before too long. I want all of this shit taken care of before Chloe has our child. There is no fucking way I will be able to work if I think for even one moment my family is in danger.</p><p>“What’s this?” I ask as I walk into my living room.</p><p>Four heads turn my way, and I know that Chloe is going to get her ass spanked tonight for disobeying me again when one of the heads that turns towards me is Bre’s.</p><p>“Our moms were here going over the plans for the nursery and Bre stopped by to bring me flowers, and when she saw what we were doing, she asked to see the plans,” Chloe says as her eyes plead with me to understand.</p><p>But all I can think about is the woman in front of me and the familiar way she looks. My mind keeps nagging at me to remember, but for some reason, there is a block. The idea of her knowing anything about the room that my child will sleep in makes me feel like I could kill.</p><p>I look at Chloe and nod towards the kitchen. She bites her lip but gets up from where she’s sitting on the floor and heads in that direction. I give her a few moments before following behind her. When I reach the kitchen, Chloe is standing near the sink, her eyes on the doorway, and she looks away as soon as our eyes connect.</p><p>“What did I tell you about Bre?” I growl, stepping towards her.</p><p>“Be reasonable, Nolan,” she pleads, looking back at me.</p><p>“What did I tell you, Chloe?”</p><p>Her face falls at the sound of her name. I never her call her by her name; I have always called her Angel or Beautiful. But she has pushed me too far.</p><p>“I don’t understand why you have such a problem with her.”</p><p>“I told you already I do not trust her. I also explained that, once I find out what is going on with you, and if she has been cleared and proven to be innocent, you can resume your friendship.”</p><p>“She’s really nice. If you just give her a chance, you will see that.”</p><p>I shake my head no. “People believed that some of the most notorious mass murders in history were nice, Chloe. So please forgive me if I don’t buy it.”</p><p>“You’re insane,” she hisses.</p><p>“Get rid of her or I will,” I snarl, pointing towards the door of the kitchen.</p><p>“Fine.” She stomps out of the kitchen.</p><p>I follow a few steps behind her into the living room. When I walk around the corner, Chloe is talking to our mothers and Bre is nowhere in sight.</p><p>“Are you happy now?” Chloe asks, turning to look at me. “She left.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Good.” I shrug.</p><p>My mother looks at me like she’s going to say something, but I hold up my hand.</p><p>“Chloe is in danger, and until I know who is trying to hurt her, everyone is a suspect.”</p><p>“Darling,” my mother stammers, putting a hand over her heart.</p> <p>“No. This is not up for discussion. And know that if you do anything to put her in danger and she goes along with it, I will be spanking her ass for it.”</p><p>“Oh my,” Chloe’s mother mutters as Chloe’s eyes light with fire.</p><p>“Now, I have work to do. Please stay out of trouble,” I tell them before leaving the room and heading towards my office.</p><p>In the back of my head, all I can think about is Bre—something about her is setting off red flags. I know I may seem a bit harsh right now, but this is about keeping my woman and unborn child safe, and I will do whatever is necessary to see to that.</p><p>“You’re sure about this?” I ask Bernard while going through the stack of pictures he just handed to me.</p> <p>“One hundred percent certain,” he says as I come across a picture of my ex-wife with Bre.</p><p>It took some time for it to click, but after a few days, I got it. I realized who Bre really was. Plastic surgery had changed her appearance, but her eyes were still the same.</p><p>Breanne’s were just like my ex’s—her older sister’s—cold and distant. She had a way of looking at you that made you feel like she was looking right through you.</p><p>“Tell me what the plan is,” I say, leaning back in my chair and setting the pictures down on the top of my desk.</p><p>“Hear me out before you say anything.” He sits down.</p><p>“If your idea has anything to do with Chloe, the answer is no.”</p> <p>“Hear me out.”</p><p>“No.” I slam my hand down on the top of my desk.</p><p>“I want to build the best case possible,” he says calmly.</p><p>“Do that without risking Chloe in the process,” I snarl, the idea of Chloe being in danger making my blood boil.</p><p>“I would never let anything happen to Chloe.” He shakes his head, running a hand through his hair.</p><p>“I know I would never let anything happen to Chloe.” I point a finger at myself. “And I refuse to put her in harm’s way, so figure something else out.”</p><p>“I will figure something else out,” he says.</p><p>I nod and watch as he walks away. Then I pick up my phone and look at the clock on the wall.</p> <p>“Shit,” I mutter, picking up my phone. “Hello.”</p><p>“Darling, you need to come home,” my mother says in a tone I have not heard from her since I was thirteen and my dog got run over.</p><p>“What is it?”</p><p>“Just come home,” she whispers before the phone goes dead.</p><p>I rush out of my office and out of the building, where Ricket is waiting for me.</p><p>“What happened?” I roar.</p><p>He shakes his head and opens the door to the car. I try to call everyone on the ride home, but no one is available. When we finally pull up to the estate, I see that there are at least ten police cruisers out front. I don’t even wait for the car to come to a complete stop before I’m out running to Chloe.</p><p>“What happened?” I demand from the officer while pulling Chloe into my arms, breathing in her scent.</p><p>“The two women in the back of the squad car over there tried to kidnap her,” the officer says.</p><p>I follow his eyes to a police car that is parked near the entrance to our home. Lynda and Breanne are both handcuffed and sitting in the back of a squad car. I push Chloe slightly away and begin checking her over, making sure she was not harmed. Once I see that she is okay, I pull her back towards my chest.</p><p>“Are you okay?”</p><p>“I’m fine. Bre told me that she wanted to go out for lunch. I told her that I couldn’t. Then she told me she had something for the baby in her car and to walk her out. I...” She pauses. “I just got a weird feeling. So I told her I would get it from her another time, and that’s when the other woman pushed into the house. Then Bernard and a few other guys showed up,” she says quietly.</p><p>I shudder at the idea of what could have happened. Then I look around the crowd for Bernard and give him a chin lift.</p><p>It takes about an hour for the police to leave after getting statements from everyone, and I have Chloe’s mother and mine take Chloe inside while I talk to Bernard. It seems that he tracked down my ex-wife and her sister in a small, one-bedroom apartment in SOHO. When they were able to enter their apartment, they realized the extent of their delusion. The two of them had devoted their lives to trying to hurt me.</p><p>From what they were able to gather, Lynda and Breanne had planned for me to meet Breanne and begin a relationship with her. They believed I would marry her at some point, and then their plan was to have me murdered and collect the money from my life insurance. When they realized I was already taken, they formed a new plan to use my devotion to Chloe against me.</p><p>They drugged Chloe and were going to try to set it up to make it look like she had been cheating on me with her high school boyfriend. When that didn’t work, they were planning on making it look like Chloe had moved out on me, and they sent Chloe the e-mail with the pictures of me in Japan, planning on Chloe seeing them and ignoring my calls. All of their plans were being foiled, and when Chloe told Bre that we’d gotten married, that sent my ex over the edge and she tried to run Chloe over.</p><p>After Bernard and everyone leaves, I find Chloe in the library, standing in front of one of the windows, looking out over the estate. I walk to her.</p><p>“They are really insane,” she whispers as I reach her side.</p><p>I wrap an arm around her shoulders, watching as Bernard pulls away. “They are, and they are both going away for a very long time.”</p><p>“I hate that Bre did this,” she whispers.</p><p>I’m not one to condone hitting women, but I could choke the shit out of that bitch for making my beautiful angel this upset, for coming into her life, pretending to be her friend, and then using her like she did.</p><p>“I’m sorry, Angel.”</p><p>“Me too,” she says, stepping out of my hold and walking out of the room.</p><p>I watch her go, knowing I will only give her a little time to get over what happened. I do not want her to dwell on this shit—not when we have so much to be happy about.</p><p>“Get up,” I tell Chloe as I walk into the bedroom.</p><p>“For what?” she asks, looking at me from over the top of her Kindle, not moving. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re not going to lie around and pout all day. Now, get up.”</p><p>“I’m not pouting.” She frowns.</p><p>I shake my head, walk over to her, rip the Kindle out of her hand, and toss it onto a chair across the room.</p><p>“Hey! I was reading that,” she complains, crossing her arms over her chest and glaring at me.</p><p>“I don’t know what happened to my submissive little Angel, but I’m telling you now—what you’re going to be doing is getting undressed, getting on your knees, opening that pretty mouth of yours, and sucking my cock until I tell you to stop. Then, if you’re good, I will eat your little pussy until you come,” I growl, pulling her out of bed. “When I’ve had my fill of your taste, you’re going to climb up on my cock and ride me until we both come.”</p><p>“Nolan,” she hisses as I rip her shirt off over her head.</p><p>“No.” I turn her around, bend her over the bed, and spank her ass with three hard swats before bending over her and growling in her ear, “Enough.” Then I move my hips so my cock is sitting in the crook of her ass. Using one hand to free up her pants, I pull them down around her thighs and then slide my hand between her legs, feeling her arousal coat my fingers. “You’re so wet, Angel,” I tell her, sucking my fingers into my mouth. Then I unbuckle my pants, freeing myself before sliding just the tip inside her. “Do you want me to fuck you?” I groan, sliding in a little deeper.</p><p>“Yes,” she breathes, trying to press back against me.</p><p>“Then do what I tell you.”</p><p>I press into her balls-deep then pull out slowly, feeling my length slide along her inner walls. Once I slide out completely, I fight the urge to slide back in and quickly help remove the rest of her clothing. Then I pull one of the pillows from the bed before setting it at my feet and helping her to her knees in front of me. As soon as her knees touch the pillow, her eyes meet mine and her mouth opens.</p><p>“Lick it,” I command.</p><p>She starts at the head then works her way down my shaft to the base until my cock is halfway down her throat. Her hands travel up my thighs, and one wraps around the base. She begins twisting it, bobbing her head. I start to feel the tingle in the bottom of my spine.</p><p>“Easy, Angel,” I groan, not ready to come.</p><p>She releases me on a pop, and I help her stand then position her as I had her earlier, leaning over the side of the bed with the fat lips of her pussy peeking at me from between her legs. I fall to my knees behind her, wrap my hands around her thighs, and bury my face between her legs, probing her entrance with my tongue then sucking her clit into my mouth.</p><p>Her body starts bucking against my face and her loud moans begin to fill the room. I move my hands and spread her pussy open farther, paying close attention to her clit, fluttering my tongue against it until she begins to flood my mouth with her sweet juices while her nails dig into my arms and her toes raise her up off the floor.</p><p>I slow down and ease her out of her orgasm before helping her stand up and turn to face me. When I look up at her, her eyes are clouded with desire. I take a breath then place a kiss above her pubic bone. Then on her lower stomach, where the life we created together is growing. I stand and get on the bed, helping her up and over me with her thighs straddling my hips. As soon as she is in position, the look in her eyes changes and she sinks down on me until the tip of my cock touches her cervix.</p><p>She leans forward, her hands holding on to my shoulder as her hips rise and fall. I pull her face down to mine, biting her bottom lip then the top, leaning back to look at her as her eyes close to half-mast and her hips start to move quicker. My hands travel down her hair and back to her ass, holding one cheek in each palm, lifting and dropping her onto me as her pussy begins to milk my come from my cock, the fluttering drawing my orgasm to the surface.</p><p>Her scream and my roar travel through the air at the same time that her body slumps forward and my head bends back into the pillow. It takes a few moments to catch my breath and for my heart beat to go back to normal, but when it does, I use my fingers under her chin to lift her face up towards mine.</p><p>“Love you, Angel,” I say, and her face goes soft. “From this day forward, we’re just going to enjoy life. I know what happened is horrible, but we have too much to live for.”</p><p>“You’re right,” she says as her face goes even softer.</p><p>I pull her back down onto me, tucking her head under my chin, where she fits perfectly. No matter what happened in my past or what I have gone through, having this with her now makes all those struggles worth it.</p><p>Epilogue</p><p>“I can’t see my feet.” Chloe laughs as I open the glass shower door. “There is no way I can shave my legs.” She shakes her head, sitting down on the marble bench that is built into the shower wall.</p> <p>“You look beautiful,” I insist as I run my fingers through her hair, gently tilting her head back.</p><p>“You love me, so you have to say I look beautiful.” She sighs, opening her eyes and looking up at me.</p><p>“I do love you, but you are beautiful as well. I love seeing you pregnant with my children.”</p><p>“I know,” she mutters, rolling her eyes. “I learned that after the first three kids.”</p><p>“You have begged for them each time,” I tell her, smirking.</p><p>“I told you before. If we’re in the moment, it doesn’t count.”</p><p>She laughs as I mimic her screaming for me to give her my seed.</p><p>“Mommy!” our daughter yells, breaking the moment.</p><p>I sigh and close my eyes. I wanted nothing more than to finally get a piece of Chloe. I thought we had finally snuck away, but as usual, our kids have perfect timing.</p><p>“Your mom comes into town tonight, so you better plan on not sleeping for the next twenty-four hours.”</p><p>“Nolan.”</p><p>“No.” I shake my head and pull her closer, lowering my mouth over one of her nipples. “I need you.” I lick around her nipple before biting down. “I need to be inside you.”</p><p>“You had me this morning.”</p><p>“That was only me getting rid of my morning wood. That doesn’t count. You owe me,” I tell her and smile when she begins to laugh.</p><p>“You’re obsessed.”</p><p>She is not wrong. I have been obsessed with her from the moment I met her, and nothing has changed. Even after five years, three kids, and another one on the way, we’re still inseparable, and I want her more now than ever.</p><p>What can I say? I have a beautiful wife.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Always and Forever, Lara Jean (To All the Boys I've Loved Before #3)</p>  </body></html>"]