["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Brenda clicked the pen against her desk, her eyes glued to the disciplinary action report on the screen. She’d dreaded this since she’d arrived at work, seven hours ago. Suspension would normally have been the first step with any disciplinary action, but she couldn’t suspend a pharmacy tech who reported to work drunk. That was dangerous, and she didn’t allow dangerous people to work in her pharmacy.</p><p>“Terry’s here,” Maria said, peeking into the office.</p><p>“Thanks, can you send him back?</p> <p>He slunk into the office, the dark circles under his eyes made all the more apparent by his too-pale skin. “You called?” he asked, but his voice was hollow. He already knew the answer to his question.</p><p>She slipped behind him and shut the door. It wouldn’t surprise Maria or any of the pharmacy techs she was letting him go, but adding public humiliation to his day wasn’t something she could stomach. The office was small, so he waited to sit down until after she took her seat behind the desk.</p><p>“We’re going to have to let you go,” she said without preamble.</p><p>He cursed and stared at his hands, not meeting her eyes. “Look, I know I had some troubles this weekend. Christine dumped me last week, and I just—”</p><p>“I’m sorry, Terry,” she said firmly. “But you came in here stinking of alcohol, when you bothered to come in at all.”</p> <p>He looked up, tears building in the corners of his eyes. “I won’t lie to you. I screwed up. Royally. But it won’t happen again.”</p><p>Brenda frowned. The man had messed up. But he was young, just old enough to buy the alcohol he’d used to drown his sorrows. And he loved his long-time girlfriend. Enough, apparently, to lose his job mourning the relationship.</p><p>“I have to let you go,” she said finally. “I can’t risk you’ll come in here drunk after the next fight.”</p><p>The haggard breath he took made her chest hurt, but she couldn’t give in, not on something this important. As tears started rolling down his face, she said, “If you get into an alcohol program, prove to me you’re sticking with it, we’ll see how things are going in a few months. Maybe try again, under a probationary period until I’m comfortable.”</p><p>“Oh thank you, Brenda!” he said, choking out the words between sobs.</p><p>“I said maybe, and remember, this is going to require some serious work on your part.”</p> <p>He nodded and promised he’d check out what the hospital offered that very day.</p><p>Brenda waited for him to pull himself together before escorting him out. She returned to her office and rubbed her eyes. Had she made a mistake? Should she have given him that small way for him to redeem himself, or would it have been better to make it a clean break?</p><p>She sighed and turned back to her computer, but the sound of a message arriving on her phone stopped her. The chirp was distinctive, and specific to a very special kind of message. Hitting shutdown on the computer, she didn’t glance at the cell’s screen. Instead she called out to Maria, “I have to leave early today, family emergency.” Only an hour remained until six, when she was scheduled to leave anyway, but she still felt a twinge of guilt.</p><p>“Is everything okay?” Maria asked when Brenda emerged from the office.</p><p>“It’s fine. My brother’s in town so just a little drama.” The lie made her mouth dry and her stomach flip-flop, but she could hardly tell her the truth.</p><p>Maria’s posture relaxed and she nodded. “Family drama, fun.”</p><p>“You have no idea.”</p><p>Brenda tugged on the spandex in a vain attempt to get the fabric to cover just a bit more of her cleavage. Damn it, she’d definitely shrunk the undershirt. She knew it was tight as she raced out the door, but she hadn’t realized the severity of the shrinkage.</p> <p>And why had she bothered to rush? Not like anyone would have missed her if she hadn’t shown. Suppressing a sigh she knew would prompt concern from her companion, Char, she glanced around the room, taking in the motley group.</p><p>“Motley” probably wouldn’t be the word most people would use to describe the gathering of superheroes. Granted, their disguises were all the more bright and noticeable with so many of them in one place—thirty or so, Brenda figured—but most still would have described the gathering with a much kinder word. Striking or spectacular, perhaps, especially when compared to the stark room they stood in. Gray carpet washed out by white walls. Folding chairs lined one side of the room, propped against the wall. Next to the other wall, a ten-foot by ten-foot section of the floor was elevated six inches higher than the rest of the space. The darker gray carpet that lined its surface kept it from being quite the tripping hazard it might have been otherwise. In the center of the dais a metal podium stood empty.</p><p>“You okay?” Char asked, not fooled by Brenda’s blank expression.</p><p>“I’m fine. Just feeling a bit squished. I left my top in the dryer a little too long.”</p><p>She grinned down at Brenda’s cleavage. “Well, luckily, just the undershirt is spandex. Can you imagine if you were wearing Violet’s outfit?”</p><p>Brenda snorted and glanced at the woman. She covered her body, wrist to knee, in purple spandex already stretched so tight it left not a single one of her curves or lumps a mystery. Black leather gloves and boots completed her outfit, along with a mask that hid her hair and half of her face. Brenda had never seen the older woman without her mask, but with the unmarred way the spandex sat against her scalp and neck she imagined Violet had short hair.</p><p>Even if she had been a teenager instead of the forty-something Brenda guessed she must be, that much spandex wouldn’t have been appealing. Thank goodness most heroes chose modern and attractive outfits. Of course there was a handful who, like Violet, stuck with tradition.</p><p>“What do you think this is about?” Char asked, keeping her voice low. She wore spandex today, too, though the material was much more flattering on her. Her small red dress with matching boots, gloves, and top hat complimented her athletic curves.</p><p>Brenda shrugged. Whatever it was, she was unlikely to be involved in any meaningful way, but she could understand the curiosity. Her friend had a useful power, albeit one that made her personal life a living hell. She reduced everything she touched with her fingers or toes for more than a few seconds to ash, burning it from the inside out. Sadly, her touch worked without conscious effort, and she couldn’t turn it off. Brenda found herself jealous of her superhero brethren often enough, but never of Char. That wasn’t to say the stunning superhero didn’t date, she just had to keep her gloves and socks on at all times. But she’d never had a long-term relationship, not since Brenda had known her anyway, maybe because her power was difficult to explain to a normal person without compromising her secret identity—something most superheroes were loathe to do until a relationship was firmly established.</p><p>“I heard Justice is coming to this meeting.” Char tossed her long, auburn hair behind her shoulder and grinned.</p><p>Cheeks burning, Brenda muttered, “Oh yeah?”</p><p>“Yep.” Char smirked. “Good thing you shrunk that spandex, huh?”</p><p>She frowned and then giggled at her friend’s waggling eyebrows. “Yeah, like he’s going to start noticing me all of a sudden.”</p><p>Justice was, much to Brenda’s annoyance, one of the few males who didn’t appreciate her and her costumes. She might be a second-rate superhero, but she filled her carefully chosen outfits quite nicely.</p><p>Her second-class status and Char’s generally sarcastic attitude placed them firmly outside of the cliques formed by the others surrounding them. In rare moments of honesty, she could admit her power—or lack thereof—had little to do with her outcast status. Like Char, she was in the out group because that’s where she felt comfortable.</p><p>As if summoned by their discussion, Justice strode into the room. He also filled his outfit to Brenda’s satisfaction. Like most of the male superheroes, he chose to wear leather and other less formfitting materials. Black was his color of choice, with deep red accents to give him a badass appearance, though not a particularly stylish one.</p><p>He towered over his brethren like a king over his subjects. Handsome and broad in the shoulder, he looked like a superhero should. She took an involuntary step forward and then stopped in her tracks, face warming. It’s his reputation, Brenda told herself. That was what made him appear so strong, what made her reaction to him so overwhelming.</p><p>He walked up to the wrought iron podium and held up a hand to silence the room. Her pulse quickened and for a moment, she forgot to breathe. His face was partially covered with a mask tied over his eyes, but it did nothing to hide his chiseled features. He had a square jaw and just a touch of stubble that ran down his cheeks and onto his neck. Probably only a day of growth, but with his dark hair it was already noticeable. She imagined for a brief moment what the rough stubble of his beard, followed by the softness of his full lips would feel like, gliding down the tender skin of her neck.</p><p>Brenda swallowed and forced herself to breathe. His had the face of a hero, one who certainly wasn’t interested in a second-tier champion such as herself, no matter how well she filled out her uniform.</p><p>Tension hung in the air, but no one spoke while they waited for Justice to break the silence. His gaze moved across the group, and as his eyes raked across her, it was as if she could feel his hands caressing her body. Her nipples tightened beneath her uniform, and she glanced away from him. He was out of her league. She needed to remember that.</p><p>Justice surveyed the room, taking in the group of heroes before him with a calculating eye. Some were more useful than others, but most weren’t valuable in a plethora of situations. Few circumstances arose where his powers didn’t come in handy. His gaze paused on Silencer—Brenda—for a brief moment, and he struggled to pull his eyes to the next hero before lingering long enough that she might notice.</p><p>She wore one of her skimpier outfits, definitely not one made for working. Spandex clung to her breasts, and the material threatened to push them right out of the laced-up silver bustier she wore over it. A short silver skirt clung to her ass and revealed long, toned legs. Elbow-length silver gloves and tall, silver, high-heeled boots—also lace-up—accessorized the outfit, which was completed with a silver mask that covered only her eyes and a cape that draped to the small of her back. The top was sleeveless, and the cape covered half of her neck and hung over her collarbone. While most superheroes generally stuck with one uniform, or a series of similar ones, Silencer believed in no such consistency. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not that he normally minded what she wore—quite the contrary. But today, her clothes were hardly reassuring.</p><p>“Thank you all for coming together on such short notice. You may have seen the attack on a local bank last night on the news. I’m here to confirm what most of you have probably already guessed: We have a new super villain on our hands.”</p><p>He waited for the buzz to die down, giving them a moment for the idea to settle in before he continued. “His name is Howler. This one is going to require a small team with specialized skills. As for those of you not on the team, The Council is going to ask that you do whatever you can to avoid him. He’s dangerous. Instead, keep your ears open and if you hear anything let me know.”</p> <p>The crowd murmured at the order, but this time he didn’t wait for the noise to die down before raising an arm, palm out, to silence them.</p><p>“Trust me when I say this Howler isn’t something most of us are equipped to deal with. He was in the New York City area for two weeks, hitting several banks during that time. Supers in the area weren’t able to bring him in.” The crowd went completely silent for a moment, and then exploded.</p><p>“New York couldn’t take him down?” The Panther called, his voice a growl that made it unmistakable.</p><p>“I’ve never heard of New York not being able to take down a villain,” Speed said.</p><p>“If New York wasn’t able to take him down, how can we?” Violet’s voice carried an edge of panic. He had to stifle that emotion before it spread.</p> <p>“Because,” Justice said, voice set loud to carry over the din, “we have the only superhero in the country with the unique ability needed to defeat Howler. Our very own Silencer.”</p><p>Justice waved her over as the calm broke and a slew of voices overran the room. Not bothering to make sure she followed, he walked through a doorway that led to the back offices of the Superhero League building.</p><p>Brenda gave Char an apologetic grin over her shoulder. She acknowledged her friend’s phone-to-ear motion with a quick nod, and then hurried after Justice. Doing her best to ignore the assessing glances of the other superheroes, she made her way to the door he had disappeared through. The looks she caught out of the corner of her eye were mostly surprised, and a few were openly derisive.</p><p>Violet stood near the doorway and stepped in front of her as she approached, forcing Brenda to meet her gaze. The purple-adorned woman’s arms were crossed in front of her body, and her expression was the one Brenda had hoped to avoid. If her face had been covered with doubt, even scorn, Brenda could have handled it—treated her with the same sarcastic sharp tongue she held at the ready ever since she could remember. But Violet’s brows drew together with worry, her thin lips turned down in a mournful expression.</p><p>“Dear,” she began, voice dripping with sympathy, “don’t you let them force you into anything. There’s no shame in admitting you aren’t strong enough to face this villain.”</p><p>Not strong enough? How dare this woman look at her with pity in her eyes, assuming she had already failed before she’d been given the chance to try. What did she know, anyway? If Justice thought she would be able to handle the guy, she could, right?</p> <p>The knowledge that he indeed trusted her to help take out this super villain hit her, and a weight lifted from her chest. She could do this. She would do this. She’d show Violet and every other superhero out there who doubted her that she was as capable as they were.</p><p>“I’ll be fine,” she said, struggling to keep her voice even. She stepped around the older woman and strode down the hallway.</p><p>Brenda made her way past a drinking fountain and almost passed the small office where Justice leaned against a heavy oak desk in the middle of the room. The room itself was tastefully decorated, much nicer than the common area where the general meetings were held. Was this his office? The unevenly stacked papers seemed random in their placement, and the chair behind the desk was oversized.</p><p>His hard expression met hers when she turned her gaze away from the decor. “What? I’m not allowed to look around?” Yes. Definitely his office.</p><p>“We need to get started hunting this guy, but your attire is....” He trailed off, but he might as well have said what he meant. She recognized that cool look of dismissal. The same expression was often carried in the eyes of other superheroes, women mostly. One glance at her stylish outfit and people decided she was nothing but fluff—all boobs and no brains.</p><p>“My attire is just fine for my normal superhero duties,” she replied, unable to keep the anger out of her voice. “Are you going to tell me what I need to know about this case, or give me fashion advice? And let’s be honest, you’re not exactly qualified for the latter, are you?” She eyed his clothing as she spoke. His outfit wasn’t bad; in fact, it looked quite perfect on him, but she wasn’t about to let him know that. And he was no fashionista; she didn’t like him judging what she wore. So what if she usually dressed for fashion instead of necessity? It wasn’t like the Superhero League ever gave her jobs that required real uniforms. She waved at parades. Talked to kids about a superhero’s life. Volunteered at community blood drives.</p><p>How was she to know they’d assign her an important case tonight?</p><p>“Like I said, he calls himself Howler. His powers seem to operate in a straightforward but effective manner.” Justice pushed off the desk and moved around to grab a folder off the top. Flipping it open, he read aloud, “He emits a scream that strikes a unique decibel and tone, one which almost instantaneously knocks out anyone within a long range—several hundred yards if there aren’t any barriers between him and his target.”</p> <p>Brenda’s mouth went dry, and she swallowed a couple of times before she spoke. “I take it superheroes are not immune.”</p><p>It wasn’t a question, not really. But Justice responded like it was. “No, but The Council is hoping that your ability to block sound waves means you are.”</p><p>She’d never heard her ability to turn her hearing off described quite like that. If she’d thought her mouth dry before, it was like a desert now. She raised her hand, index finger extended, and then turned and walked back down the hall where she’d come in. She could still hear a quiet rumble from the conference room, but guessed that most of the superheroes had left. The water from the fountain was cold on her tongue, and as it slid down her throat, her pulse slowed.</p><p>Ever since her abilities began to reveal themselves when she was thirteen years old, she’d hoped for something amazing. Her thirteen-year-old self had been convinced that if she showed a useful talent, it would gain the attention of her parents, pull them from their busy superhero schedules to focus on her. But hers had proved to be nearly useless, like powers were more often than not. And four years later when her brother’s power showed itself, she was almost beyond caring that his capacity to fly exceeded even the usefulness of their parents’ abilities. Almost.</p><p>When she rounded the corner back into the office, Justice again leaned against the desk. Did he never use the expensive-looking office chair behind it? Somehow she doubted it, and the vision of his constant leaning on the desk while trying to do paperwork or research on the Internet flashed in her mind.</p><p>“Something funny?” he asked. Without waiting for a response he added, “If you’ve assuaged your thirst, we need to get on the road.”</p><p>“Where are we going?”</p><p>He grinned, but she knew the pleased expression wasn’t for her. “To get the bad guy.”</p><p>Chapter Two</p><p>The bank’s orderly and clean appearance would have led Brenda to doubt that it had been recently robbed by a super villain, but then this wasn’t a typical bad guy they were dealing with. He used the power of his voice to incapacitate the people around him, thereby making it easy enough to walk in and take what he wanted without much damage to the structures he robbed. A far cry from the super villain norm, since they generally smashed their way into wherever they wanted to be.</p><p>The vault door stood ajar, and though no people milled around, she was willing to bet that there had been when he’d robbed it. No wonder they had such a difficult time catching him. He didn’t even need the cooperation of the bank personnel if he came during the daytime. Many banks kept their vaults unlocked during business hours, only setting timed locks at night when the employees were no longer there to watch the money.</p><p>She walked to the vault and peeked in. A smaller safe sat inside. It held the cash and was accessible with a key. Howler had probably grabbed it from a teller or bank manager’s neck or belt after he knocked them out. Simple.</p><p>“When did this happen?” she asked Justice.</p><p>“Tonight, right before closing.” He walked around from the customer area behind the counter so he could check the vault, too. Hard lines cut into his face as the slight frown he’d been wearing since they left the League’s headquarters deepened. “We would have been here sooner, but I didn’t have my cell on me during the meeting.”</p><p>That was probably on purpose. Tracking via cell phone wasn’t something she worried about, as no reporters stalked unimportant superheroes, but for someone like Justice, it might lead them right to his secret identity. Although unlikely he gave out the number to just anyone, he was the type to always take precautions regardless. Which was why they’d hiked several blocks to where he had concealed his Porsche.</p><p>“What’s the rush? Doubt we could have moved fast enough to catch him here anyway.”</p><p>“The Council didn’t decide to have me work this case for my super strength, sweetheart.”</p><p>The derision in his voice made her face burn, and she had the sudden urge to wipe the condescension out of his tone.</p><p>“So you’re here to track him so I can take him down, huh? Try not to get in my way then.” Without waiting for his reply, she turned, careful to keep her weight on her toe as she swiveled, and left.</p><p>She paused outside of the door, and then leaned against the cool brick. She was tired, and her feet were killing her. Damn these boots anyway. She’d toss them out, but they were too cute. She should have realized why he was with her maybe, but he didn’t have to point it out the way he did. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Justice, in addition to having superior strength, which was helpful if not entirely uncommon, had the ability to track supers. A rare ability, enough so his decision to become a superhero instead of a super villain was almost miraculous. Many of the strong ones went the other way. Little reward waited in the hero business other than the appreciation of the general public, which could be fleeting and could quickly turn to outrage and anger. Villains, on the other hand, found their chosen professions quite profitable.</p><p>Until a superhero caught them.</p><p>After what seemed like hours, Justice emerged from the bank. His hard expression wasn’t the least bit contrite, but he didn’t make any biting follow-up comments either.</p> <p>“We’re too late. I can’t track him.”</p><p>“So, what happens now? We go home and wait for him to rob another bank?”</p><p>Justice grimaced. “That’s not all we do. We’ve got people on it. But I’ll take you home.”</p><p>That was it, wasn’t it? We had people on it, but she wasn’t part of the we. She was the you. Not powerful enough to really be part of the Superhero League in anything but name, but not normal enough to fit in among humans.</p><p>But that was why she’d worked so hard, wasn’t it? Why she’d pushed herself through pharmacy school and worked her butt off to become not just good at her job, but excellent. And in that, she’d succeeded.</p> <p>He started walking back to the car, and she followed him automatically. He’d send her home and then do his superhero thing. Figured.</p><p>Silence overtook the car, thick in the air, until he couldn’t stand it anymore. “So what did you think of your first super villain scene?” he asked.</p><p>“It wasn’t my first scene,” she said, but didn’t elaborate.</p><p>Fine. If she didn’t want to talk, they didn’t have to talk. He didn’t realize how hard he gripped the steering wheel until he felt the material start to bend in his hands. Biting back a curse, he relaxed his hold. What was it about this woman? She’d driven him nuts from afar with her eyes and smile since he’d transferred to the Chicago league two years before, and now that she was close, she still drove him crazy—in a different way—with her scathing tongue and contrary attitude.</p><p>“It was weird to see the scene like that,” she said, interrupting his thoughts. “So...” she waved her hand in the air, searching for the right word, “...clean.”</p><p>He nodded. “The least-destroyed crime scene I’ve seen in a while. Definitely the cleanest I’ve seen by a super villain.”</p> <p>She turned to him, and the weight of her gaze made his pulse quicken. “Do you see a lot of non-super villain crime scenes?”</p><p>Shit.</p><p>He’d slipped up. He was so careful; he never slipped up. It was her fault. Damn woman, she wrecked his concentration.</p><p>“You know, on television.” He shrugged, trying to keep his voice light and airy.</p><p>“Hmm,” she said thoughtfully.</p><p>Desperate to change the subject, he asked, “So how long have you been with the Chicago league?”</p><p>He saw her frown deepen and her eyes narrow with his peripheral vision, but she answered his question. “Since forever. I’m from here. My parents are superheroes. They used to be on The Council, but they’re retired now.”</p><p>Her parents had been Council members; no wonder she had such a chip on her shoulder. All people born with abilities, whether it was something useful and impressive like super speed, or as useless as making grass grow from your skull, were permitted to join their local Superhero League. After all, even abilities that seemed useless could come in handy, and they always needed volunteers to speak at schools and oversee charity work. But Council members were different. Only the most powerful superheroes were found on the councils of their area chapters. If both of her parents had been Council members, she’d had a lot to live up to.</p> <p>“Must have been hard,” he said finally. “Two parents on The Council and you being....” He stopped talking, trying frantically to think of a way to finish the sentence without sounding condescending.</p><p>“What? Disabled by my crappy superpower? There are a lot of paths to success, Justice. Superpowers are just the easiest way.”</p><p>“Hey, it’s not like good superpowers are a surefire way to success.”</p><p>“No? Well it’s the nearest thing to the easy street that exists. Most of us have to work a little harder than being born special to succeed in life.”</p><p>“Just because you’re jealous—”</p><p>She gasped. “I’m not jealous!” Her head whipped around to look out her window. “Hey, stop the car!”</p><p>“Oh, you’d rather walk home than face an argument you can’t win? Some superhero you are.”</p><p>“You passed my apartment half a block ago, genius.”</p><p>He opened his mouth but no words came out. As they slid to the side of the road Silencer jumped out before he brought them to a complete stop, slamming the car door behind her.</p><p>Work seemed a little drabber than normal after spending the night arguing with a superhero and investigating a crime scene, and for some reason Justice’s face—the part not hidden by his mask, anyway—kept flitting to the top of her thoughts. Not that it hadn’t in the past, but things were different now. He’d proved himself to be a jerk, just as she’d figured he would. He was a powerful superhero after all, and that kind of thing tended to go to a man’s head.</p><p>So why was it she couldn’t think about anything but how strong his hands looked? How they’d feel, rough against her skin.</p><p>“Hey, Bren, we’re running a bit behind out here,” Maria said, nodding toward the pharmacy as she peeked into Brenda’s office.</p><p>“Sure, no problem. I’ll be out in just a minute,” she said, face burning as if the woman could read her thoughts.</p><p>Maria nodded and turned back to her work.</p><p>What she should be worried about was Howler. What did Justice expect her to do if she blocked his powers? Run up and kick him? Self-defense and karate classes she’d taken over the years had been purely for fitness’s sake, and she wasn’t prepared for a real fight. Oh, there was the standard training regiment all superheroes went through, but it was just practice, not real experience. Not that she hadn’t imagined being in a real fight more than once while she practiced. She’d meant to ask Justice more questions, sort out the specifics of The Council’s plan, but he’d touched on her sore spot. Made her angry. Accused her of being jealous. As if he knew what it was like to be in her shoes.</p><p>Brenda shook her head to clear her thoughts. She had to focus. An administrator filling out a bit of paperwork could afford a distracted brain to a certain extent; a pharmacist couldn’t.</p><p>So for the next two hours she kept her attention on work. Thoughts of superheroes and villains and Justice moved to the back of her brain, and she focused on filling the prescriptions that might very well mean life or death to the people they’d been ordered for. Requiring superpowers or no, it was a hefty responsibility.</p><p>Superheroes weren’t the only ones who saved lives.</p><p>“It’s Ms., not Miss,” an icy voice said from the counter. The voice was familiar enough to pull her from double-checking the information sheet she was stapling to a prescription bag, but she couldn’t quite place it.</p><p>The woman who corrected Maria’s use of her name didn’t look familiar. Short, brown hair, graying at her temples, did nothing to cover an ordinary fortyish face that sat on top of a body that wasn’t exactly overweight but didn’t appear to get a lot of gym time, either. Her too-tight T-shirt that proclaimed she was a fan of the local high school football team didn’t ring any bells.</p><p>Brenda moved closer to the counter to get a better look. She still couldn’t place her, and it felt important she did. The woman noticed Brenda’s stare, and returned it with one of her own.</p><p>“Can I help you, dear?” she asked, voice only slightly more kind than the one she’d used to correct Maria.</p><p>Recognition hit Brenda. Maybe it was the “dear” that did it; most people didn’t call strangers dear—not in Chicago. Or maybe the slightly condescending motherly tone triggered her recall. Whatever the cause, she knew without a doubt that the woman standing at her counter was Violet. Violet in her normal clothes.</p><p>“No, sorry. I thought you were someone else,” Brenda stammered, and a flush crept up her cheeks for the lie.</p><p>She pursed her lips and looked Brenda up and down thoughtfully but didn’t say anything else. Instead, she snatched the prescription bag from Maria’s hand and turned to leave. She stopped after a couple of steps and pivoted back around, just enough to give Brenda one last considering glance before she walked out the door.</p><p>A loud chirp made Brenda jump. She glared at her cell phone and then grabbed it to silence the noise.</p><p>“Another emergency?”</p><p>“Yeah, I’m sorry. I’ll explain—”</p><p>“Later, I know.” Maria grinned and waved her away.</p><p>Operating on little sleep, Brenda had left the house without packing a superhero outfit with her. Luckily, she had the extra mask she always carried in her car—it was regulation, after all. So after parking, she tied the mask on and tried to look as official as she could while wearing a superhero mask with a pair of slacks and a button-up blouse. She had half convinced herself it was working until she met up with Justice at the crime scene.</p><p>“What the hell are you wearing?” he asked, after taking in her outfit and shiny red mask.</p><p>“It’s regulation,” she snapped back.</p><p>He frowned at that, but didn’t argue with her. He of course wore his normal gear, and she wondered if he ever took it off. An image of him showering in all that black leather flashed in her mind, and it was all she could do to suppress a giggle.</p><p>“Something funny?”</p><p>One of the bank’s double doors hung from a single heavy hinge, and the other was nowhere in sight. Rubble decorated the once-professional lobby, and peeking inside revealed that much of the debris came from the second story, which had half collapsed on the floor below it. Brenda backed up, not eager to test the stability of what remained of the two-story building. “This...doesn’t look like our guy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I agree, but we’re checking anything and everything that could be Howler. I’ll get another team going on this, and we’ll get back to work on ours.”</p><p>Justice didn’t wait for her reply; instead he stalked off to meet a group of heroes who gathered at a slightly safer distance away from the scene. She recognized them; The Jumper, StrongArm, and Char. Moving back, Brenda gave her friend a small smile and wave. She grinned back openly but didn’t move to meet her. Instead, she nodded at something Justice told the group, and then followed StrongArm as he and Jumper jogged down the street away from the bank.</p><p>Justice met her with serious eyes as she approached.</p> <p>“So, what now?”</p><p>“Now we stick together,” he said. “I think it’s best we arrive on scene together, just in case. Until then,” his gaze moved up and down her body, eyes seeming to slow down over her chest and legs, “let’s go get you a real uniform.”</p><p>“I have real uniforms, thank you very much,” she replied, more irritated with herself for forgetting her uniform after wearing one he deemed so inappropriate the night before than she was with him. She was a professional, damn it. Even if she wasn’t usually required to be a professional superhero, she was a professional and that extended to every part of her life. Forgetting something so important riled her.</p><p>“Hey—” she began, but the ringing from her cell phone stopped her explanation, and she was grateful for the interruption because she hadn’t been entirely certain what she was going to say.</p><p>“This is Brenda,” she said, raising a finger at Justice. His lip drew back in a grimace, but her attention stayed focused on Maria.</p> <p>“I’m sorry, Brenda, I know you’ve got some family stuff going on this week, but I can’t get hold of Rachel and Ben’s school just called. He’s sick, and I need to pick him up.” Maria’s tone was pleading.</p><p>Brenda glanced at her watch. Only two hours until closing time. What was the likelihood Howler would strike again in the next couple of hours? And if he did, well, the pharmacy would just have to close early.</p><p>“I’m on my way,” Brenda said, and then clicked her phone shut.</p><p>“You’re on your way? Where do you think you’re going?” Justice growled.</p><p>“I have a job. A real job. One that needs me to be there for a couple of hours.” She took a deep breath and met his gaze. “I wouldn’t go if it wasn’t important.”</p><p>His eyes didn’t leave hers for a few moments, and he stared at her as if searching for some hidden meaning in her words. Finally, he nodded. “Fine. But I’m going with you.” He raised a hand at her before she could argue. “As a member of The Council, I already know your secret identity.”</p> <p>Of course he did. But that didn’t mean she wanted him traipsing around her work. But he was probably right—they should stick together. No matter how much the man irked her. “Okay then, let’s go.”</p><p>He kept his face carefully blank as he pulled his Porsche into a parking spot next to Silencer’s red Lexus IS350 at Pranier Medical. One of the nicest hospitals in the city, it wasn’t one he frequented. His jobs—both human and superhero—took him to county hospitals and city morgues, rarely to private facilities like Pranier.</p><p>Silencer met him at his Porsche and raised an eyebrow at his expression. She reached up to her face and with a quick flick of her wrist, removed her mask. Her simple action forced his breath from his lungs.</p><p>Taking off a mask, especially a small one like she’d been wearing, shouldn’t have made such a difference in her face. But as his gaze traced the fine line of her jaw, the soft sweep of the blonde hair across her brow, the contrast between her pale skin and dark eyes, for a moment he imagined superhero masks were magic. A relic that could so change a person’s facade that when one’s true face was revealed, the effect was shocking.</p><p>She was breathtaking.</p><p>“You got that?” she asked.</p><p>She’d been talking, but he’d missed it. What had she said? It had been important. “Um....” he said, brilliantly.</p><p>“B-R-E-N-D-A.” she said, punctuating every letter as clearly as if she’d written the word down for him. “Brenda. That’s my name. Don’t slip up and call me anything else. Not like anyone has heard of Silencer anyway, but I don’t want them to know anything about my other...pseudo life. Got it?”</p> <p>Something had changed. The woman standing in front of him with one hand settled on her hip while the other waved at him seemed like a stranger. But her direct gaze was the same, as was her matter-of-fact speech. He couldn’t put his finger on the change. But he would. He was Justice after all, the hero of the Millennium Park attack, the man who tracked down and defeated the super villain IronClaw, not to mention the people he helped during his day job.</p><p>His mind settled by his thoughts, he said, “How are you going to explain me?”</p><p>“Oh, don’t you worry your pretty head about that.” She grinned, and his feeling of being off-balance about her grew. But before he was able to think too far into it, she strode toward the hospital, leaving him to follow in her wake.</p><p>He expected her to head for the elevator, so when she swung toward the pharmacy door, he changed direction awkwardly.</p><p>The woman behind the counter smiled at Silencer in obvious relief before disappearing to let them into the pharmacy area.</p><p>As they slipped through the doorway, the woman said, “Thank you so much, Brenda. I’m sorry about this, but he—” She stopped talking abruptly as she took in Justice, frowning at the reassuring smile he shot her.</p><p>“This is Justice. He’s doing some surveillance of the hospital, and we’re letting him use the pharmacy as his base. Justice, this is Maria, she’s one of our pharmacists.”</p><p>Maria took the hand he held out and shook it gingerly. “One of the local superheroes?” She didn’t sound overly impressed.</p><p>“Yes, ma’am,” he replied.</p><p>“Hmph,” was Maria’s only response as she pulled off her lab coat. She grabbed a purse from the small office set in one corner of the pharmacy. “Thanks again, boss,” she called over her shoulder as she let herself out.</p><p>“You, wait there,” Brenda said, pointing to the office.</p><p>Justice followed her instructions; he seated himself and then peeked out to watch her deal with customers.</p><p>She was efficient, not brisk, but quick in the way of a person completely comfortable in her job. Questions from customers were met with compassion and direct answers, and it was obvious she knew several by name. After the first hour rolled around, realization hit him.</p><p>She’d changed when she took off her mask, changed in the way a superhero usually did when donning her uniform. For Silencer—Brenda—it was like putting on the uniform reduced her, removed a bit of confidence that, for some reason, a blouse and white medical coat granted her.</p><p>Suddenly, a blouse and slacks looked sexier than anything he’d seen in a while.</p><p>“So Maria didn’t seem exactly impressed to meet a superhero,” he said when the steady line of customers disappeared.</p><p>“Well, she wouldn’t be,” Brenda muttered, more to herself than to him. Shooting him a sharp glance, she explained, “Her ex was a superhero. Some hotshot out of Denver. I think he’s a big part of the reason she moved here.”</p><p>Unsure of what to say to that, he just nodded.</p><p>“Figures, though.” She tucked a chunk of blonde hair behind her ear and turned away to sort through a small stack of paperwork.</p><p>“Why?”</p><p>“Because she’s a normal human, of course. What kind of a chance did she have to hold onto a superhero?” She glanced at him before returning to her sorting. “A real one, I mean.”</p><p>“You think only some superheroes are real?” he asked, shock rushing through him.</p><p>“Justice,” she said, after glancing around to make sure they were alone. “There is a difference between real superheroes like you who have the power to save people from villains on a regular basis and people like me. My powers, such as they are, don’t make me any different from Maria and other normal people. Yours do.”</p><p>“You think it’s the powers that separate us?” Before he realized what he was doing, he was up from his chair and standing only inches from her. Her face was turned away, and she had to look at him so he could make her understand. He touched her soft skin with his fingertips, tipping her chin up. A scowl cut across her full mouth at his touch, but she didn’t move away.</p><p>“Isn’t it?” Her voice was soft, caressing.</p><p>It took a moment for him to remember what they were talking about.</p><p>“It’s not our powers that separate us—make us heroes. Yes, us,” he added as she started to shake her head. “It’s the willingness to put on the uniform. To face things that might be stronger than ourselves in order to save other people. And the lack of power you’re talking about?” Her skin brushed against his as he leaned in to whisper. “That lack of power is what makes you a real superhero, Brenda, because you’re willing to fight in spite of that fact.”</p><p>She turned her head, mouth parted to argue with him, to deny what he could so clearly see. Bringing his face down inches from hers, he grazed her jawline with his knuckles. She swayed toward him, gaze fixed on his mouth. She licked her lips, and the last bit of control he’d clung to broke.</p><p>Her lips were soft—so soft—and after a moment’s hesitation she kissed him back with a zeal he hadn’t expected. The sweet smell of strawberries filled his nose, and it occurred to him on some level that the intoxicating scent was probably her shampoo. He reached for her, touching her back with his hand, needing to get closer, to feel her body on his. She pressed against him eagerly, and her mouth opened. Soft and wet, her tongue caressed his.</p><p>Suddenly he couldn’t think about anything but her. The way she’d filled out her tight, little uniform. And the sexy confidence she donned with her conservative blouse and slacks. He hardened painfully in his uniform, and she moaned. The small sound made every muscle in his body tighten. He didn’t care that they were practically in public. He had to have her. Now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ahem,” a voice said, and Brenda jumped from him, gone so fast it was as if she had super speed. She left a cold emptiness in his arms when she fled.</p><p>“I don’t mean to interrupt, but I’m in a bit of a rush today. Bingo starts in an hour.”</p><p>“Of course, Mrs. Johns. I’m sorry.” Brenda’s face was so red that for a moment he thought there might be something really wrong with her, but as she helped the short, elderly woman behind the counter, her color returned to normal, and she slid into her professional visage. By the time she passed the receipt to the customer, her expression was hard.</p> <p>“You need to go,” Brenda said, as Mrs. Johns disappeared around the corner.</p><p>“Brenda—”</p><p>“Look.” Her expression was still hard but her eyes were wide, panicked. “I need to close up here and fill a few prescriptions. I can’t do that with you distracting me.”</p><p>“But Howler—”</p><p>“Message me if you hear something.” She turned away and pulled the bars down over the front window, and then placed a paper “Closed” sign behind it.</p> <p>“All right,” he said. “We’ll talk later.”</p><p>She didn’t reply, so he let himself out.</p><p>Chapter Three</p><p>Brenda kicked the covers off her feet and sighed. What a night. Thanks to Justice, sleep had been impossible. Why did he have to kiss her? Even worse, why had he told her those things? She was comfortable with the way she saw herself. She was good at her job, willing to help out when her minimal superpowers would suffice, and that was good enough. She had a better chance than most to be born with a great power, but instead...instead she was only good for filling out a uniform. She didn’t need delusions of grandeur put in her head by a man who had no idea what it was like to roam the world without powers.</p><p>What did he think he was doing? Zipping into her life and twisting her into a pretzel before leaving just as quickly, no doubt. And the kiss...God, the man could kiss. She could feel him now, lips soft on hers, testing, waiting for her to respond. And she’d responded all right.</p><p>Muttering an expletive, she smashed her fist into her pillow and reformed it into a slightly more comfortable lump.</p> <p>She had just drifted off into a doze when her cell phone chirped. Not bothering to look at the number, she threw off the covers and grabbed what she’d mentally named her “practical” superhero outfit. Black pants and a matching jacket, she’d blend perfectly with Justice and his dark ensemble. The outfit was made with leather, along with something that felt similar to canvas, and lined in cotton. It was comfortable, thoroughly practical, and in her opinion, pretty damn boring, which is why she’d never worn it other than to try it on in the store. Even now it was difficult to admit to herself that she’d bought it just in case she ever needed to actually run around like a real superhero.</p><p>Lame.</p><p>Ignoring her thudding heart, Brenda moved to answer the pounding at her front door. Justice stood, framed perfectly in the doorway with the low lighting of the hallway hiding his expression, as enigmatic as only a superhero could be.</p><p>He didn’t say anything for a moment, and though she couldn’t see his face, shadowed as it was, she felt his gaze moving up and down her body, burning her as they took her in.</p><p>“Let’s go,” he said, and then without waiting for her, he pushed from the doorway and headed down the hall.</p><p>“No need to wait,” she muttered, giving the empty doorway an exasperated glare. She grabbed a hair tie from the coffee table, pulled her hair back into a quick ponytail and jogged to catch up. “Nice to see you were actually able to find my apartment tonight,” she called after him.</p><p>He ignored her comment, if he’d even heard her. By the time she’d caught up to him, he was at the top of the stairwell, at the opposite end of the hall from her door.</p><p>“So where are we going exactly? Another bank?”</p> <p>“No, not a bank this time. He hit a store.” Justice didn’t slow his pace as he spoke, if anything, he seemed to speed up.</p><p>“A store? Why would he hit a store? I can’t think of a store that would have enough money in it to justify going there instead of a bank. What store?”</p><p>“A small mom-and-pop operation. But it’s not the store he was after, it was the mayor.”</p><p>“The mayor,” she echoed. She didn’t need him to explain why, but he did anyway.</p><p>“He’s asking the city of Chicago to cough up ten million dollars or he’ll kill him.”</p><p>“Ten million seems...low.”</p><p>Justice stopped at that and gaped at her. “It seems low? This misfit has kidnapped the damn mayor and that’s all you have to say about it?”</p><p>“Well, that’s not all I have to say about it.” She glared back at him and crossed her arms. “I’m not saying this isn’t a big deal or anything, I was just wondering why he didn’t ask for more.”</p><p>Justice opened his mouth, and then snapped it shut. He turned and headed down the stairs at an even faster pace than before. They hit the lobby before he spoke again.</p><p>“You’re right,” he said, and the words came out like they were dragged out with a winch. “It does seem low. But he’s new—Howler, I mean. Maybe he doesn’t realize how much he could have asked for.”</p><p>“Maybe...”</p><p>Justice grunted</p><p>The button on his key ring clicked as he unlocked the Porsche. Somewhere between the lobby and where he’d parked just down the street from her entrance—illegally, she noticed—Justice had hit an all-out run, and Brenda muttered a quick thanks to her treadmill for keeping her in shape so she wasn’t out of breath from the short jaunt. Just being around Justice after the kiss was awkward enough, huffing and gasping for breath while he stood there stoically would have made it worse.</p><p>As she slid into the seat, Justice slammed his door and then started talking. “Okay here’s the plan. We’ve got other heroes moving in to distract him while we get you into position. You’re to move in, block his power when he uses it on you. Get his attention—keep his eyes on you—and I’ll move in behind him.” He slid the Porsche into gear and pulled out into the street fast enough to knock her back in her seat.</p><p>“That’s it? That’s your plan? Justice, that isn’t a plan,” Brenda said, and then grabbed the door to keep from flying into the middle of the car during a sharp turn that he took at what felt like a hundred miles per hour. “Do you know the layout of the building? Is he armed?”</p><p>Justice glanced at her. “Armed? No, he’s not armed from what we can tell. What self-respecting super villain would run around armed? Might as well admit your power sucks if you do that.”</p><p>Brenda pursed her lips. She’d considered picking up a gun that very afternoon. Something small she could fit into her purse unnoticed. Backup, just in case. “Okay, so he’s not armed. Have you thought about paying the guy? I mean, ten mil probably doesn’t even touch what the mayor is insured for against for something like this.”</p><p>“You’re right, but he’s not going to stop with the mayor. If he gets money this way, he’ll just move onto bigger and richer prey.” His eye met hers for a brief second before he turned back to the road, but a second was long enough. He was worried.</p><p>She swallowed. If a hero like Justice was worried—no, she couldn’t think like that. She had to stay focused. “Okay.” Blinking lights came into view, police cars. They were getting close.</p><p>“I know the plan isn’t the best, but we’re working with what we have. You won’t be alone in there. Other superheroes are en route, some probably already around. I’ll be with you, too.” He slid to a stop behind a couple of police cars blocking the road. He slipped the transmission out of gear and cut the engine then turned to face her. “I won’t let him hurt you, Brenda.”</p><p>With those words vibrating in her head, she leaned forward as he bent and kissed her. It was quick, over in a flash, but shook her more than the idea of taking on a super villain.</p><p>Justice jumped out of the car and greeted the policeman guarding the scene before she wrangled her door open. The officer was in his forties and had sweat beading on his forehead visible through his military-short hair. He ran a hand through his almost-nonexistent hair and then waved them through.</p><p>Justice strode down the street, moving quickly, before he turned back and motioned her over. He hit a button on his cell phone as she shifted her weight, shooting glances up the street and back down the way they’d come. The way they were headed seemed darker. Shadows stretched so far they seemed to all coalesce into inky, impenetrable darkness.</p><p>“Okay,” Justice said into the phone. “Got it.” He clicked it shut and turned to face her. His brows were drawn together, but his voice was clear of worry.</p><p>“You’re going in the front,” he began, and then held up a hand to stop her interruption. “I know, it sounds nuts but your power is your element of surprise, not your presence. You go in with a briefcase they’ve placed near the door for you. Act like you’re paying the man. When he comes for it, be ready to power on. The other team members and I will be coming in behind him.”</p><p>“How will I know when to use my power?” she asked, wishing her voice wasn’t so frantic.</p><p>“You’ll know.” He gripped her shoulder in support. “Keep him distracted.”</p><p>“How am I supposed to distract him?”</p><p>“Follow your instincts, Bren. If they say to fight him, fight him. If you think he’ll be receptive to conversation, talk to him. Don’t let yourself get hurt. If you feel like it’s not going your way, run. That in itself might be just the distraction we need.” He frowned. “You are trained to fight, right?”</p><p>“Of course I am,” she said. All superheroes were. Just because she didn’t have the most impressive power in the world didn’t make her a slacker. She’d trained her butt off. Except, the instructors in pads and gloves hadn’t really wanted to hurt her, and who knew what this Howler was capable of? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Okay, okay. Sorry.” He pulled her into a quick hug and she stiffened, surprised at how much she longed to melt against him. This wasn’t her; she was stronger than this. She didn’t need to snuggle up to him and for even a moment feel like he was going to make everything okay. This was her day. Her job. Her villain.</p><p>After a few seconds he released her and nodded toward the dark street in front of them. “Couple blocks down, you’ll see the store. Lights will be on inside, briefcase is to the right. Pick it up before you let him see you.” Justice gave her one last smile and then jogged down the way they’d come, turning into an alley half a block away.</p><p>And she stood alone.</p> <p>“You can do this,” she whispered to herself, and then grimaced. Talking to herself now? Nice.</p><p>With a quick glance over her shoulder at the alley Justice had disappeared down, she shifted her focus to the task at hand. One step after another, she forced herself forward.</p><p>Lights pierced the darkness around a building that was, as Justice said, only two blocks from where he’d left her. The store sold antiques according to the sign in the window. Clear glass, uncovered by the gates that had been pulled down over neighboring buildings’ windows, was all that stood between her and the villain. How long had they been in there? Had the Howler kidnapped the mayor before the store closed for the day?</p><p>The briefcase sat near the front entrance, only feet away and drenched in shadows. Brenda grabbed it, almost dropping the metallic case as she pulled it from the ground, startled by the weight. Money didn’t fill it—she’d gathered that much from Justice—but something did. Yet another trick, an added bonus to make the briefcase a better decoy.</p><p>Here goes nothing, she thought to herself, and then stepped forward to face the Howler.</p> <p>Chapter Four</p><p>A bell dinged as she pushed the door open, announcing her presence as clearly as it had signaled customers entering over the years. Startled by the sound, she paused and glanced around. No one was there, not in this room anyway. A door leading to a back room—an office maybe, or storage—sat clearly visible from the entryway. How did the superheroes expect to sneak up on anyone in here? If they came through the back, Howler would have them even more quickly than he’d pick her off in the front.</p><p>The door slipped from her grip and shut firmly behind her.</p><p>The super villain didn’t spring from the shadows, didn’t appear so fast her eyes couldn’t follow him, didn’t teleport from parts unknown. He opened the backdoor and walked into view. Though his entrance struck her as anticlimactic, her breath came faster and her heart threatened to beat itself from her chest.</p><p>Howler stood around five feet seven inches tall, and had gone old school with his outfit. Tan and brown spandex covered his body from head to toe, and for a moment images of Violet flashed in her mind. The cut of his uniform was similar, spandex from neck to calf in a light tan color, with darker brown boots, briefs, and gloves. A mask hid his head and the top of his round face. An image of what appeared to be a wolf head was emblazoned in the middle of his chest, mouth open and looking almost straight up. It was howling. Funny.</p><p>His body was as ill-suited to wearing spandex as Violet’s, but for a different reason. Where hers was a touch too round, Howler was more than a touch too scrawny. No one would mistake him for a villain with super strength. Oh there were a few of those who didn’t appear strong, but she’d never heard of one who looked weak. And that was exactly how Howler looked: weak.</p> <p>“Let me guess? Shadow Woman? Dark Mistress?” he said, lip curling up in obvious disdain.</p><p>She glanced down at her outfit. Dark Mistress indeed. “I have your money.”</p><p>“Do you now? Well, let’s see it.”</p><p>She froze. See it? What if they’d put newspaper in the briefcase? One thing was guaranteed; the briefcase didn’t contain cash. The lump refused to move from her throat as she swallowed hard. Distract him, Justice had said, keep him busy.</p><p>“Not so fast.” Her voice came out steadier than she’d thought it would be, smooth and normal, as if she wasn’t facing down a super villain. “You need to show me the mayor first, so I can make sure he’s okay.”</p><p>“Oh, I think I’d like to see the money first, honey.”</p><p>Her reaction came just half a second too slow. She watched him fill his lungs with air, taking it in until his chest expanded to fill his ill-fitting suit. Her mind processed the scene in slow motion, and as realization hit that something was wrong, he screamed.</p><p>Too late, she touched the part of her mind that switched on her power with her consciousness. The sonic wave hit, and she fell to the floor.</p> <p>Everything went black for what must have only been a few seconds, because when her eyes fluttered open she saw him moving toward her—what she could see of him from her vantage point on the floor anyway. Tan legs and dark boots moved to her, and she could hear them scuff the floor as he moved. She grasped at her power with her mind, but it slipped away, out of her reach. The boots paused when they got only a couple of feet away.</p><p>Where was Justice? Where were the other superheroes? She hoped they were getting the mayor and the shopkeepers out.</p><p>“Still awake?” Surprise coated the villain’s voice, and he knelt down and peered at her face.</p><p>She stared back at him, and tried to keep her expression neutral.</p><p>A great laugh boomed from Howler’s chest, seeming too loud to have come from such a slight person. “Oh, it’s like that, is it? Don’t worry, I know how you superheroes feel about me.” He reached out and poked her shoulder, and she lost the battle to keep her face blank.</p><p>Whatever crossed her face, it made Howler’s grin widen. “Barely awake though, huh? Guess my shot wasn’t as direct as I thought. Unless....” A full smile broke out on his face, revealing slightly stained, but straight, teeth. “You must be her. Silencer.”</p><p>His voice took on the booming quality of an announcer. “The one with the power to defeat the Howler.” He laughed again and grabbed the briefcase, which had fallen next to her, and then pushed himself up from the ground awkwardly.</p><p>“Sorry, hon, guess you weren’t a match for me after all.” Using his foot, he pushed her over onto her back. Her body wouldn’t obey her, and moved as easily as if she’d been unconscious. “Nice rack, though. You can call me anytime.” With one last snicker at his own joke, Howler strode toward the back room.</p><p>She couldn’t move for minutes after, and the ruckus happening just out of her eyesight made her want to move more than anything. Shouts from several people could be heard through the wall that separated her from the action. She shoved herself up from the floor, halfway into sitting position. Glass shattered somewhere out of sight, and she collapsed back onto the floor. Then, just before silence fell, Howler screamed.</p><p>“I’ll walk you up,” Justice said, and then before she could argue, he was out of the car.</p><p>Damn man anyway, he moved like he had super speed. The weight of what had happened suffocated her. She’d failed. There had been one thing she was supposed to do—use her useless power—and she hadn’t. Not fast enough anyway.</p><p>She followed Justice woodenly toward her building door. When he held it open for her, she glanced at him but didn’t comment. Her head hurt and her ears still felt stuffed with cotton. She imagined Justice felt even worse, but he didn’t show it if he did.</p><p>They reached her apartment and she opened her mouth to thank him and tell him good-bye, but he pushed past her into the apartment.</p><p>“Please, come in,” she said sarcastically.</p><p>“Don’t mind if I do.” His voice was too loud, but short of a yell that would bother the neighbors. She’d be spared that humiliation, at least.</p><p>“Can I get you something to drink?” Her inner hostess kicked in, and despite her intention to get him out of the apartment as quickly as possible, she ended up sitting across from him at her small kitchen table. A turkey sandwich sat in front of both of them, along with a glass of orange juice by her plate and a soda next to his.</p><p>“You did good tonight.” His voice had come down a decibel or two, and she was relieved as the cotton slowly faded from her ears, but her head still beat like a drum on her shoulders.</p><p>“I didn’t do what I was supposed to. I wasn’t fast enough to get my power up in time to stop him from taking me out.”</p><p>“You distracted him, Brenda. That was your job. You kept him busy while we got the mayor and the shop owners out. No one was killed. No one was seriously hurt. That’s a win.” He took a big bite out of his sandwich and studied her.</p><p>She glanced away, suddenly uncomfortable. She didn’t do much of anything, not really. Certainly nothing worthy of getting congratulations from the real superhero sitting across the table from her. But all’s well that ends well, right? Everyone was okay.</p><p>For the moment.</p><p>“We didn’t get Howler.”</p><p>Justice swallowed his mouthful of sandwich and took a drink from his soda before answering her. “Not yet. But we will.”</p><p>“But I’m not a secret weapon anymore.” A thought popped in her head, and she spoke without thinking. “If I ever was.”</p><p>“What do you mean?” Justice took another bite and, to her amazement, Brenda realized that more than half of his sandwich had disappeared. The man ate as quickly as her brother had in high school.</p><p>“He asked if I was ‘her,’ if I was Silencer.” She scooted her chair back from the table and walked to the counter. “He knew who I was, Justice. He was expecting me. How is that possible? It’s not like our members and their abilities are public knowledge, and I’ve never made the news.” She grabbed a knife from the wooden stand on the counter and walked back to the table. The knife easily cut through her sandwich and she offered Justice half.</p><p>He took the food with a grateful smile, but his frown returned quickly. “I don’t know how he could have found out about you. Unless...” He shook his head. “I don’t want to start making guesses yet, not until I’ve looked into it.” Two bites later, the sandwich half she’d given him was gone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Let me know if I can help. With whatever you’re looking into, I mean.” She shifted in her seat. Should she ask him why he’d kissed her? The timing seemed so inappropriate and the question so inane. No, it didn’t matter how much she wanted to know. She couldn’t talk about it. Not right now.</p><p>“I will,” he said, and then pushed back from the table and stood. “I’ll be in touch. In the meantime, try to keep a low profile.” He bent to kiss her cheek before she realized his intent. Hand on her shoulder, his lips were hot against her skin. “Stay out of trouble,” he whispered into her ear.</p><p>Before she could think of a suitable reply, he was gone.</p> <p>The scratching woke her, like nails on a chalkboard. The sound grated at her and drew her from a troubled sleep. Confused, she rolled around on the bed to glance at her alarm clock. It read three o’clock, but outside it was still dark, as dark as it ever was in the city, anyway. She rubbed her eyes and sat up, mind still muddled. What was that? It was the middle of the night.</p><p>Light from the streetlamps shone through the curtains, seeming bright to her well-adjusted eyes. But the light was wrong somehow. As she stared at it she saw the shadow; it stretched across her room from the sliding glass door that led to her balcony.</p><p>The sheer curtains weren’t easy to see through when she changed, and a person would have to be clinging to the windowless side of the building next door to have a chance at a look, but they did allow enough light through to get around, if her eyes were dilated from the darkness. They weren’t shadowed; on the second floor there were no trees to block the light.</p><p>So what was that?</p><p>Brenda jumped up from the bed and grabbed her cell phone from the nightstand. She hit Justice’s name, but her finger paused over the send button. What was she going to tell him? That a scraping sound woke her up? That there was a new shadow in her window? What if he showed up and there was nothing outside?</p> <p>She swallowed and shut her phone, and then gripped it tightly in her palm. As she edged toward the window, the shadow stayed put.</p><p>It’s probably nothing, she reassured herself. But when she got close to the window, the scraping sound stopped. Hand shaking, she pushed the curtain aside.</p><p>Howler.</p><p>A knife scraped on the glass as she watched, and he stared up at her with a strange expression on his face. Fascination, like she was a bug under his microscope. His other hand pressed against the door as if he could push it open.</p><p>She let out a scream and jumped back, touching the place in her mind that turned on her power as she moved. What was he doing here?</p><p>Frantically she looked for Justice on her phone and hit send. She didn’t bother putting it to her ear, but turned her attention back to Howler.</p> <p>He smiled at her, mouth wide and teeth glinting garishly in the yellows and oranges and blues of the city lights. And he spoke, but she couldn’t hear him. Turning off her power would be suicide, but she was tempted, if only to reassure herself that he wasn’t talking about murdering her or wearing around her skin.</p><p>She shuddered. No more horror films for her.</p><p>Backing up, she kept her eyes firmly affixed on Howler until she cleared her bedroom doorway, and then she turned and ran to the front door. The knob was solid in her hand, real. And she clutched that piece of metal like it was the only real thing in the nightmare she’d become lost in. She wanted to turn it, unlock the deadbolt, run across the hall to her neighbor’s.</p><p>But what if he was out there? What if he’d driven her to the door for this very reason, to get her to open it?</p><p>No, that was silly, wasn’t it? If he wanted in, it would be easier for him to break the glass on the sliding door that led to the balcony he squatted on. Wouldn’t it?</p><p>With her hearing shut down, she couldn’t tell if he’d already broken the window, if he was sneaking up behind her as she struggled to make the right decision. She shouldn’t be running, she should be turning around, fighting him. But she’d never really fought anyone before. And he had that knife.</p><p>She shot a glance over her shoulder. No one crept through the shadows. She muttered a curse under her breath, turned the deadbolt and then threw open the door.</p><p>Running for her neighbor’s apartment, she crashed headlong into Justice’s chest.</p> <p>The second he’d seen her number, he’d been out of bed and on the phone with Porter. The silence on the line was deafening, and he hadn’t been able to hang up or drop it from his ear. Instead, he grabbed the landline off the wall and called in a favor. He hadn’t even considered the Porsche, fast as it was.</p><p>Porter was faster.</p><p>A minute to wake him up, thirty seconds for Porter to dress. Another half a second and he was at Justice’s door. A second to grab his hand. Less than a second later and he was at her door. The whole process had taken less than two minutes.</p><p>It was the longest two minutes of his life.</p><p>Just as he approached her door, ready to kick it down, she burst out. Straight into his arms. She wore an old T-shirt that was several sizes too big, and flannel pajama pants. Not what he’d imagined her sleeping in, but still pretty damn sexy.</p><p>“What happened?”</p><p>She mumbled something. He couldn’t make out the words.</p><p>“Bren? Brenda?” He forced her face up so he could look at her. She didn’t appear injured, but tears streaked down her skin and her eyes were bright. “Can you tell me what happened?”</p><p>She shook her head, brow furrowing, before she muttered something that sounded suspiciously like one of his favorite four-letter words.</p><p>“Sorry,” she said. “I forgot.” She waved a finger at her ear. “I still had my power on.”</p><p>“What’s going on?”</p><p>She glanced back at the apartment, face suddenly serious. “He was here, Justice. Howler was here. Out on my balcony...with a big-ass knife.”</p><p>“Stay here,” he said, and then stepped past her to scan the apartment. More than anything, he wanted to stride in and beat the hell out of Howler. Not on general principle because he was a super villain. Not for robbing banks or kidnapping mayors. But because he’d scared her. Because he’d put that look on her face.</p><p>But if he went in there—no. Then she’d be here alone, unprotected the second Howler used his power. Porter was already gone and wouldn’t go for help, wouldn’t call anyone. He wasn’t a superhero. He was a mercenary, barely living on the right side of the line.</p><p>Justice flipped his cell phone open and pressed the number one until it dialed. StrongArm’s voice came on the line, clear, like he’d been awake. “Yeah?”</p><p>“Silencer’s apartment has been compromised.” He hesitated before giving the building address to StrongArm. Giving out any superhero’s address was serious. But StrongArm led the superhero council in the Chicago area, which meant he could pull her address anytime he wanted. He ran his hand through his hair, rattled off the address, and then snapped his phone shut.</p><p>“Let’s go. We’ve got people moving in.”</p><p>Brenda nodded and let him lead her to the stairwell with his hand gripping her upper arm. She was surprisingly obedient, but he guessed she had every right to be shaken up. The idea of that freak hanging out on her balcony while she slept....</p><p>“Are you okay?” she asked when they reached the lobby.</p><p>He grunted, hoping she’d take it for assent. He was far from okay. “I should be asking you that.”</p><p>“I’m fine. He just startled me. I shouldn’t have run out of there like a damn chicken.” Disgust laced her voice.</p><p>Unable to help himself, he reached out and tucked a wayward piece of her hair behind her ear. “You did the exact right thing.”</p><p>She shook her head. “If you say so.”</p><p>The image of that creep peeking through her window with a damn butcher knife hit him, and he took a deep breath to calm the sudden rage rolling through his body. Brenda could have been hurt. And it would have been his fault for dragging her into this fight.</p><p>He pushed the thoughts to the back of his mind. He had to deal with the situation they were in right now. Make sure she was safe. That’s what mattered.</p><p>“Do you have keys?”</p><p>She looked at him blankly.</p><p>“Car keys?”</p><p>“Oh. Not my main set, but I have a spare in one of those hide-a-key things.”</p><p>He grunted again. After all of this was over, he’d talk to her about how she was inviting thieves to take her car off her hands with that thing, but for now it was damn convenient so he wasn’t going to argue.</p><p>“We’re taking your car.”</p><p>She crinkled her brows and shot him a glance but didn’t ask him how he got there. “Where are we going?” she asked instead.</p><p>“My place.”</p><p>Chapter Five</p><p>Justice lived in a house so close to the ’burbs she figured it barely counted as the city. But the home was cute, brick, and one-story, a ranch style typical of the seventies. It stood proudly between two McMansions that had replaced the older houses on either side of it. It didn’t look like the house of someone who drove a Porsche, and she wondered for a moment if he spent more money on the car than the house, and then dismissed the idea. A home in a nice neighborhood at a convenient location near—but not too close—to Metra and redline access didn’t come cheap.</p><p>He came around and opened her door and she realized she’d just been sitting like a dope, staring at his house through the window. “Sorry,” she muttered and looked away from him to hide her embarrassment.</p><p>Justice strode up to a door on the side of the house and unlocked it, letting them in to a small kitchen, not much bigger than the one in her apartment.</p><p>“I wasn’t expecting company,” he explained as she glanced around. The sink had his dishes from the night before, maybe from a couple of nights before, by the size of the stack. Or perhaps he hadn’t eaten alone.</p><p>She frowned and turned her attention back to Justice. “No problem.”</p><p>“I’ll show you the guest room.”</p><p>He led her to a small room off a narrow hallway that sported a twin bed and a small dresser. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Bathroom is the next door on the right,” he said, shifting his weight from one foot to the other. “My room is on the left if you need anything.” He paused and glanced around the room, before settling his gaze on her. “Do you? Need anything, I mean.”</p><p>The intensity behind his eyes burned into her and her mouth went dry. She licked her lips, and he took a step toward her, hands fisted tightly at his side.</p><p>“Oh.” She searched her mind for something snazzy or sexy to say. “I’m good, thanks.”</p> <p>He stopped and didn’t say anything for a few seconds. Then he nodded and shot her a reassuring smile, but the look didn’t negate the fire in his eyes. “He won’t find you here.”</p><p>Forcing a smile, she gave a quick jerk of her head.</p><p>Awkward silence hung in the air for a few seconds, and then Justice turned and walked into the hall. She shut the door behind him.</p><p>Staring at the window until the sun came up was not going on Brenda’s list of favorite ways to spend the night. But she’d slept after that, clear until noon. Groggy, she wandered to the bathroom, found a toothbrush on the counter still in the plastic container and used it.</p><p>Justice sat at the dining room table hunched over a laptop computer screen. His superhero outfit was back on, but he wasn’t wearing his mask.</p> <p>She stopped at the end of the hallway and studied him. He was handsome, as she’d known he would be—he couldn’t hide that under a mask that only covered a small part of his skin. Chocolate brown eyes were set into perpetually tanned skin. His hair, which she’d thought black until she saw him up close, was darker brown than his eyes. If he’d been any paler, it would have looked too dark, but against his skin the dark brown looked perfect.</p><p>“How was your night?” he asked, not raising his eyes from the computer screen.</p><p>She shrugged. “As good as you might expect, I guess.”</p><p>“There are doughnuts and bagels on the counter. Coffee’s fresh.”</p><p>“Thanks.”</p><p>After checking the bagels, all plain or non-fruity flavors, she settled on a doughnut covered in chocolate sauce. For good measure and because she’d had a bad night, she added a glazed doughnut to her plate before pouring a cup of coffee and heading back to the dining room.</p> <p>Justice shut the computer when she walked in and gave her a quick once-over.</p><p>“Did you get any sleep?”</p><p>If the expression on his face was any indication, she must look like she hadn’t.</p><p>“Some. Did they find anything at my apartment?” She sat at the table and took a sip of coffee. Maybe two doughnuts were too many. Some of the outfits in her closet might not fit after two.</p><p>“No. Bastard was gone by the time they got there.” He crossed his arms.</p><p>Of course he was. Screw it. She took a bite out of the chocolate doughnut. The night ran through her mind, and though she wanted to shy from it, she knew thinking about what happened was important.</p><p>Justice nodded and tapped on the computer; his eyes were affixed to a spot on his wall, and she didn’t have to turn around to know there was nothing of interest on the spot.</p><p>“What I want to know is how he got on the balcony,” she said, the thought bothered her the night before, but she hadn’t wanted to think about what had happened, or what could have happened if Justice hadn’t gotten there so fast. “And I want to know how he got down so fast and out of the area. I mean The Council probably had people there what...two, maybe three minutes after you?” She took another bite out of her chocolate-covered doughnut and reveled in the taste.</p> <p>“Yeah. Three minutes tops.” As he leaned forward, the laptop moved a couple of inches toward the middle of the table, too.</p><p>“So...I guess he could have brought a ladder.” She frowned. That didn’t fit the super villain ideal, but that didn’t make it impossible. “But to get down, load a ladder and get out of there before the League arrived?”</p><p>“I’ve checked and double-checked into his powers. I spent the morning talking to New York. He doesn’t have any powers outside sonic waves that anyone has ever seen.”</p><p>No wonder the undersides of his eyes were just a bit darker than she imagined they should be. He probably hadn’t gotten any rest at all.</p><p>“So what do we do now?” She stuffed the final bite of the chocolate-covered doughnut between her lips and eyed the glazed.</p><p>“We aren’t doing anything. I’m going to go talk to the League, see if I can come up with any leads.” He stood up.</p><p>“What am I supposed to be doing?” she asked, or tried to. The large chunk of doughnut lodged itself to the roof of her mouth, so the words came out muffled.</p><p>Justice crossed his arms. “You’re staying here.” He raised a hand when she started to object. “Spare my table the chunk of pastry you’re about to spit on it, please. This isn’t up for discussion. This guy wants you. You, personally. He knows your power, knows your name, where you live.”</p><p>She frantically choked down coffee to force the doughnut down. Some of the dark liquid dribbled onto her chin, and she wiped at it with her hand. So attractive. “So I’m just supposed to sit here?”</p><p>“He views you as a threat, Brenda. We can’t risk you wandering out there where he can find you easily. You’ll be putting yourself and the people around you in danger.”</p><p>She frowned and thought of Maria and all of the other people she worked with. She couldn’t go to work, not with him knowing her name. It would be all too easy for him to figure out where she was employed if he hadn’t already. Her blood ran cold. “What if they’re already in danger? He’s taken hostages before, Justice.”</p><p>“Justin.”</p><p>“What?”</p><p>“My name, it’s Justin. With everything I know about you, you have a right to know that much. Well,” he waved his hand, gesturing at the room around them, “and where I live, obviously.”</p><p>“Your real name is Justin...and your superhero name is Justice?”</p><p>He frowned. “Seemed...right.”</p><p>His disappointment at her reaction made her grin, but it faded as the distraction of his name wore off.</p><p>“You’re right. We should be worried about hostages. With this guy’s track record, it’s more than possible,” he said, and ran his hand through his hair. She wondered if it felt as soft as it appeared. “We’ll put a flyer on it, someone who can keep an eye out and report back if he shows. Violet maybe.”</p><p>She thought back to when Violet—out of uniform—had shown up at her pharmacy and the grin crept back onto her face. “Good idea. I don’t think she’ll have a problem finding the hospital.”</p><p>Brenda wandered around Justice’s house after he left. The television offered a poor distraction and she diligently ignored her desire to snoop. She showered and put on a pair of sweat pants and a T-shirt he’d dug out for her and felt even worse. Nothing like a set of old, too-large sweats and T-shirt to make a person feel really unattractive.</p><p>He still hadn’t done the dishes, so she loaded them into his dishwasher and tried not to wonder if they had come from more than one person, or just more than one meal. It seemed the least she could do after he let her stay at his home.</p><p>A couple of hours of daytime television later, she was about to go insane when she heard his car pull into the driveway. With its low and mean-sounding engine, the Porsche was unmistakable.</p><p>“Hey,” she said, shutting the television off as he walked into the living room. His mask was back in place, but he pulled it off as soon as he reached the couch.</p><p>“Hey yourself.” He took in her outfit, and a wide smile broke out on his face. “You’re all rumpled.”</p><p>She frowned. “I’m going crazy here. I can’t watch daytime television and stay sane.”</p><p>He barked out a laugh and continued to study her clothes with interest.</p><p>Crossing her arms, she glared at him. “Seriously, I need to get back to work.”</p><p>“Are you even supposed to work today? It’s Saturday.” He sat down next to her on the sofa, and she scooted a couple of inches away to give him room. The smell of his aftershave, spicy and fresh, hit her and she closed her eyes. A man should not be allowed to smell that good.</p><p>“No I’m not supposed to be working today, but that doesn’t mean I don’t have things to do.”</p><p>“What kind of things?”</p><p>“Well....” She’d been planning on cleaning her house, running some errands. But saying that aloud would make her list sound so...unimportant. Just being out of her element, forced to stay in a strange house where she had to constantly fight the urge to search through the underwear drawer of a man she barely knew, that’s what bothered her. But she couldn’t say that out loud.</p><p>The sound of her cell phone saved her from having to answer him, and she jumped up from the sofa to retrieve it from the dining room table. The table was only a couple of short steps from the couch, so she reached the phone on the second ring and flipped it open without looking at the caller ID.</p><p>“Hello?”</p><p>“Brenda, how are you?” The voice on the other end of the line sounded worried.</p><p>“Oh, I’m fine, Mom. How are you?” she said, airily. Crap. She should have checked before she answered. The worry in her mom’s voice meant she knew about Howler. Although her parents were retired, they still kept in contact with the Superhero League and its council.</p><p>“Why didn’t you tell me you’d been assigned to a dangerous case? Or at least call me last night?” her mother said, voice rising a few octaves. “I’ve been worried sick about you, but I didn’t want to call since you probably didn’t get any sleep last night.”</p><p>Brenda’s mother, Mabel Booth, had two great concerns in life: that her kids might get hurt in their superhero duties, and that they might not be getting enough sleep and eating enough vegetables. The first was usually reserved for her brother, Paul. The second was divided equally between them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m sorry I didn’t call you. I didn’t want to worry you.” She took a deep breath. “And I’m fine, Mom, really.”</p><p>“Good,” her mom said, and some of the strain disappeared from her voice. “Well, anyway, that’s not the only reason I called. I wanted to make sure you remembered to bring peach cobbler tonight. Your brother loves it.”</p><p>“Tonight....”</p> <p>“Yes, tonight. Your brother is in town. Don’t tell me you forgot?”</p><p>No, I didn’t forget something as exciting as dinner with Paul while being involved with something as banal as being stalked by a super villain. “Of course I didn’t forget. But honestly, with everything going on I’m not sure dinner is the best idea.”</p><p>“Nonsense, your brother doesn’t come into town every day.”</p><p>I’m not hunting super villains everyday either, Mom, was on the tip of her tongue. But upsetting her mother would just mean more questions and more worry. If her mom thought things were bad enough, she’d be on Justice’s doorstep before Brenda could stop her. “I know, but I’m kind of busy with this Howler thing—” she said instead.</p><p>“He’ll be there after dinner, too,” her mom said, and her tone allowed for no argument. “Bring your friend, the one you’re staying with. Justice, right?”</p> <p>The man himself had moved from the couch to stand across the table from her, and he watched her squirm on the phone with an eyebrow raised.</p><p>“I don’t think he’d be interested, Mom.”</p><p>“Why wouldn’t he be? Bring him. Seven o’clock, and don’t forget the cobbler.” Before Brenda could say another word, her mom hung up. She wasn’t one for good-byes.</p><p>“Your mom?” Justice asked.</p><p>“Yeah.” The cell phone clunked as it hit the tabletop.</p><p>“What exactly are you certain ‘he’ wouldn’t be interested in?”</p> <p>She looked up from where she’d tossed the phone, right into Justice’s slight smile and raised eyebrows. “That’s rather presumptuous of you. What makes you think you’re the ‘he’ she was referring to?”</p><p>As she’d hoped, his amusement disappeared. “Is there another ‘he,’ Brenda?”</p><p>She considered teasing him, but his tone was serious, and there was a hint of something else, too. “No,” she muttered, and her face heated. “Dinner tonight at my parents’ house. My brother’s in town.”</p><p>The smile returned to his face and the edge of teasing was back in his voice when he spoke. “Well, then, guess I don’t have to order in.”</p><p>“What’s wrong with cooking?”</p><p>A touch of pink crept up his neck. “I hate doing dishes. You can eat pizza on a paper plate.”</p><p>A laugh bubbled out of her throat. “Well, if we’re going to my parents’ tonight, we’ll have to get some supplies.”</p><p>“Supplies?”</p> <p>She tugged on the T-shirt hanging limply from her body. “Clothes for me to start with. And a baking pan. Something tells me you don’t have any.”</p><p>He shrugged. “I wouldn’t know what to do with one if I did.”</p><p>Justice parked in her parents’ driveway in Naperville at five minutes before seven while she clutched the aluminum foil-covered cobbler on her lap. He’d watched her with what she could only describe as fascination as she made it, handing her ingredients and utensils when she asked for them, but otherwise staying at a safe distance.</p><p>They’d visited her apartment, electing to grab her actual clothes and take one of her baking dishes and some key items like a hand mixer, rather than spend all day shopping. The apartment had been checked, repeatedly, and had been under constant surveillance since she’d made a run for it in the night. Howler hadn’t made an appearance, and the preparations for going to her parents’ house had gone more smoothly than she’d dared hope.</p><p>“You ready for this?” She turned to Justice, who was unfastening his seat belt. He wore his regular superhero outfit, mask included, something she’d almost protested. But he had every right to protect his identity.</p><p>“Are your parents that scary?”</p><p>“They can be.”</p><p>He just laughed and took the cobbler from her lap. She tensed as his hand grazed hers, heart suddenly thumping faster in her chest.</p><p>“Then let’s treat this situation like a bandage.” The handle clicked as he opened the door. “Rip it off quick.”</p><p>Suppressing a sigh, she pulled herself out of the car. Justice waited for her before he headed toward the house.</p><p>“My mom’s a little overwhelming,” she warned him when he reached the concrete walkway.</p><p>“I’m sure I can handle it.”</p><p>“Famous last words.” She rapped on the door then turned the knob and pushed it open. “Anybody home?” she called, and heard her mom’s voice, muffled from the wall separating the kitchen from the living room and foyer. She held the door and then shut it behind him. “Come on.”</p><p>The house was lined in walls colored in various natural tones, the living room a taupe color that somehow worked well with beige-and-red striped furniture and lighter taupe pillows. Her mother had taken a home design class at a community college after she’d officially retired from the local league council and had promptly put her education to use throughout the home she’d lived in for thirty years.</p><p>They made their way to the kitchen, passing the large formal dining area, which had also felt the touch of her mom’s design class, before walking through the entryway into chaos.</p><p>Her mother stood at the gas stove, apron covering a pair of slacks and a blouse. Brenda’s father, Walter, peered into the refrigerator.</p><p>“No, not the margarine,” her mom exclaimed as he pulled a yellow tub from the depths of the fridge. “The real butter. It’s on the top shelf.”</p><p>Her dad muttered something and stuck his head back in the refrigerator, and her mom turned her attention to her guests. “Brenda! Oh good, set the cobbler on the island.” She waved toward an empty section of the counter, and Justice obediently set the dish down.</p><p>“Mom, Dad, this is Justice. Justice, these are my parents, Walter and Mabel Booth.” They shook hands and her mother returned to the stove while her father went back to search for the butter. “Your brother’s in the backyard; why don’t you take Justice out there and introduce him.”</p><p>“You don’t want me to help?”</p><p>Brenda must have sounded as incredulous as she felt, because Mable laughed and said, “Oh, after dinner for sure, but show your guest around for now.”</p><p>Plush with thick grass, the backyard was so long it appeared too thin, but it was wider than the house it hid behind. It was the backyard she’d grown up in, practicing soccer and watching over her younger brother.</p><p>Paul stood there now, bottle of beer in hand, back set to the house as he surveyed the yard. He turned when they opened the French doors that led onto the deck, face breaking into what Brenda mentally termed his professional smile.</p><p>He was dressed casually, in cargo shorts and a polo shirt. He’d long since stopped being Brenda’s “little” brother in anything except age, towering over her at only an inch or two shy of Justice’s six-foot two-inch frame. Paul held out a hand, smile firmly affixed to his face.</p><p>“This is my brother. Paul, this is Justice.”</p><p>The men exchanged a quick handshake and polite greeting, and then Paul grabbed Brenda in a big hug.</p><p>“Sis! It’s been way too long.” He released her and gave her a pat on the back that almost made her stumble before turning his attention back to the tall man behind her.</p><p>Before Paul could start the small talk, their mom stuck her head out the French doors. “Brenda, I do need your help after all. Your father is hopeless.”</p><p>Brenda laughed. “Be right in, Mom.” Her mom disappeared back into the house.</p><p>The guys were already talking about baseball, and Justice shot her a quick smile without interrupting his conversation. She smiled back and headed for the kitchen.</p><p>“So I guess I should be asking the inevitable question; what are your intentions toward my sister?” Paul asked, as soon as the door shut behind Brenda.</p><p>Justice raised an eyebrow at him. Paul’s expression was still friendly, but the edge to his tone made Justice’s muscles tense.</p><p>“In that case, I’d say my intentions, such as they are, are none of your business.” Like Brenda’s brother, he kept his smile firmly set.</p><p>Paul handed him a beer from the cooler sitting next to a large table on the deck. “Oh? Would you be satisfied with that answer if she were your sister?”</p><p>“We’re working together,” he said finally. Blonde hair and Brenda’s bright smile flashed in his mind, and he fought to maintain his polite expression. He could hardly blame the man for being protective about his sister.</p><p>“I’ve never seen her look at any of her coworkers like that.” Paul’s expression grew grim, and he looked Justice up and down. “I don’t want her getting hurt.”</p><p>“You meet a lot of your sister’s coworkers?”</p><p>Paul frowned and Justice took a swig of his beer. He’d thought not. He understood the concern, but it was misplaced. A kiss or two did not make him a threat to her. Hell, she didn’t care about him, not really. She seemed to enjoy his company, liked to tease him, but hadn’t acted like she cared much past that. And that was okay with him. He didn’t need a woman in his life; he was better off alone, with no one to worry about but himself. They would catch Howler, solve this case, and things would go back to normal. His throat tightened and he took another sip of his beer.</p><p>“My sister’s great. But I know how A-lister heroes like yourself are with normal women like her. I’m not gonna let you—” Paul stopped talking as Justice took a step toward him.</p><p>Blood rushed to his ears. Paul expected him to treat Brenda badly just because she didn’t have an impressive superpower. Did he really think so little of his sister? That she needed a superpower to make her memorable? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The door opened and Brenda peeked out. “Dinner’s on the table.”</p><p>“So, Justice,” her mom said, as soon as they sat at the table, which was heaped full of roast beef with potatoes and carrots, a large salad, and her mom’s homemade bread. “What brought you to the Chicago area?”</p><p>Brenda dragged her attention away from the mouth-watering scent of the roast filling the room to listen to his response.</p> <p>He shrugged. “Day job, actually. Coming here was a kind of promotion.”</p><p>“How interesting,” her mom said carefully. Asking questions of superheroes about their secret identities or day-lives as most people called them was usually a no-no. Mabel Booth was a superhero herself, and had a deep respect for keeping one’s super and normal lives separate.</p><p>“Tell us about your case, dear,” Brenda’s father said, after Justice’s silence made it apparent he wasn’t going to offer up any more information.</p><p>She poked at her potatoes with her fork and tried to think of the best way to describe Howler. “It’s nothing big, really. The villain—Howler—can knock people out with sonic waves. Makes my power useful for once.” She shrugged. “He doesn’t have super strength or anything, he’s kind of a skinny guy. Nothing to worry about.”</p><p>Justice frowned at her, but didn’t contradict her story.</p> <p>“Guess it’s gotta be nice for you to get in the field for once.” Paul shoved a big bite of roast in his mouth. “Not like your power’s usually good for a whole lot except getting in some quiet time,” he said around the food.</p><p>Brenda stiffened in her seat but didn’t argue. He was right; it was good to get out in the field, frightening as it was much of the time. And she couldn’t argue with his opinion about her powers, though she was tempted to throw a chunk of roast at him for his lack of tact.</p><p>“Doesn’t take a powerful ability to be useful.” Justice’s voice was lower than usual, and when she glanced at him it surprised her to see his clenched jaw and the red color rising up his neck onto his face.</p><p>“Sure,” Paul said, apparently oblivious to the signs of Justice’s anger. “But I mean, not as if our Bren’s usually useful in a superhero capacity.”</p><p>“Paul,” her mother said, voice full of warning. But Brenda noticed that her father’s attention was all on Justice. Her father was a quiet man, not given to talking about much outside of football except on rare occasions, but he watched Justice like he’d done something very interesting.</p><p>“What? It’s not an insult; it’s just the way things are. Jeez, I didn’t say she was useless or anything. Just her power.”</p> <p>“Her power saved the mayor of Chicago last night.” Justice stood up from the table and leaned over to stare at Paul while he spoke. “Her power saved an innocent elderly couple whose only crime was minding their store.” He raised a hand from the table and pointed at Brenda. “Her power is the only chance we have of catching a dangerous super villain.” He tossed his napkin next to his plate. “I’d hardly call that useless, and you should have a little more respect.”</p><p>Brenda gaped as he sat back down. Unable to take her eyes off him, she struggled to speak, to find something to say. But her mom was faster.</p><p>“He’s right, Paul,” her mom said simply. “Who’s ready for cobbler?”</p><p>Chapter Six</p><p>Silence radiated from her during the drive home, and tension twined around her crossed arms, her clenched jaw, her fixed stare out the window. Whatever her problem was, it wasn’t his fault. He defended her from that tactless jerk of a brother. She could stew about it or yell at him, but that was her call. Not his problem, not his conversation to start. But when they entered the house, his determination cracked.</p><p>“Okay, what’s your problem?” he asked when she plopped her purse on the coffee table just a little too loudly.</p><p>She turned to face him, hands on her hips. “What’s my problem? What’s your problem? I mean, I invite you to dinner with my family and you start a fight?”</p><p>“Your brother started it. I just finished it.” His voice rose, and he made his way across the room so he stood only a few feet in front of her. “How could you expect me to just sit there when he was talking about you like that?”</p> <p>Face flushed, she raised her chin and glared at him. “He wasn’t talking about me, just my power. Look, I know he can be a jerk, but he’s still my brother. And he’s right, my power isn’t exactly the most useful one around.”</p><p>“Bullshit. Your power is as useful as you make it. You’ve proven that to the Superhero League this week, why can’t you believe it yourself?”</p><p>She spluttered, “I, that’s not...this Howler thing is a unique situation.”</p><p>“Well, regardless of how you view it, I’m not going to sit at a table—your parents’ or anyone else’s—and let someone degrade it—and by extension, you—without saying something.”</p><p>Her bright eyes glinted with unshed tears, seeming even darker than normal, and her brows drew together in confusion. “Why do you care?”</p><p>Simple words, but he struggled to answer her question. Why did he care so much? Why had he had to force himself not to jump across the table and knock that condescending grin off her brother’s face? He looked down at his fists clenched against his sides. Because he cared, that’s why. He gave a damn, even though it was stupid and dangerous and likely to get him hurt.</p><p>A soft touch on his shoulder brought his gaze back to her. Eyes wide with confusion and wonder stared back at him. She looked so goddamn beautiful and vulnerable, he ached to pull her into his arms. But she gripped his shoulder to balance with one hand and caressed the side of his face with the other. Rising onto her tiptoes, she drew him closer so she could kiss him.</p><p>Soft lips met his, and he wrapped his arm around her to settle his hand in the small of her back, the other he used to stroke her hip. The scent of his own shampoo surrounded him, blending with her lotion in a way that smelled better than anything. She smelled like his.</p><p>One of her hands brushed the back of his neck, and the other gripped his shoulder, like she feared falling if she let go. He deepened the kiss, lightly grazing her tongue with his, and she writhed against him.</p><p>He growled and pulled her closer, and the softness of her breasts pressed against his chest. God he wanted—needed—to see her, to touch that softness. To feel all of her under his hands, his body.</p><p>He pulled back for a moment and the sight of her knocked the air from his lungs. Lips swollen, her chest heaved as though she had to fight for air. She wanted him too, and that knowledge made him harden painfully.</p><p>She slid her hand from behind his neck to rest on his chest. “What’s wrong?”</p><p>“Not a thing in the world,” he murmured and then bent to take her mouth with his again.</p><p>She’d been waiting for him to kiss her again, and could admit it to herself, if not to him. And seeing him defend her had only worsened her attraction, which had made her angrier, and hotter. It was a vicious cycle. Finally, she couldn’t wait for him to make a move anymore. She had to kiss him.</p><p>Mouth hot against hers, he took her lips a second time, and she molded her body to his, feeling his heat through her clothes, and how much he wanted her pressed against her stomach. He was so hard, and she ached to touch all of him. To feel his hands all over her. To feel him inside her.</p><p>She touched the side of his face, and his skin was rough even though he’d shaved before they left for her parents’ house. Then she slid her hand through his hair to the back of his neck.</p><p>His tongue touched hers, testing. The moan escaped her before she realized it was coming, and he gripped her even more tightly to him.</p><p>The ache screaming from her chest and between her legs blossomed. But she wanted him too much. What would happen when this was all over? When he no longer needed to hide her in his home? He was a first rate superhero. She knew exactly what would happen.</p><p>But she still didn’t want him to stop.</p><p>His mouth moved from hers and she made a noise in protest. But he didn’t step away from her body, instead he traced small kisses and nibbles down her neck until he reached her collarbone. The smell of soap and fabric softener intermingled with the slight scent of sweat and an underlying smell of him. It overpowered her, took away her ability to think, to consider what they were doing and what it might mean.</p><p>His hand moved up her side, slipping under her shirt to graze her flesh with the rougher skin of his palm. But it wasn’t enough; she needed to feel more of him, to have him naked against her.</p><p>Justice tugged at the buttons on her shirt, face intent with desire. Freeing her from it at last, he made a triumphant noise. He took one of her still-confined breasts in his hand, palming her before undoing her bra clasp.</p><p>He hissed at the sight of her naked breasts. Then he took her in his hand again. Massaging. Caressing. Loving. Raw jolts thrummed from where he ran his thumb over her nipple and it hardened into a small nub. She gasped as he took her other breast into his mouth. Licking and sucking and nibbling her to the brink.</p><p>She’d imagined his mouth on her, more times than she cared to admit, but the fantasies fell far short of the reality. Every inch of her skin ached to be touched by his callused hands and soft mouth. Licked by his clever tongue.</p><p>He played with her, moving between her breasts with his hands and mouth. Each touch sent a jolt to her core. Giving them both equal attention until she cried out and squirmed in his arms. Thoughts flew from her head as he slipped her jeans off and she yanked at his shirt. He stepped back and pulled it off himself. But his eyes never left her.</p><p>He took her all in, her legs, her breasts, and her expression. The intensity in his gaze was almost frightening in its power. But it didn’t scare her. His hungry eyes made her shiver with need. To be the target of such desire was overwhelming.</p><p>He slipped out of the rest of his clothes and she only had a moment to take in his sculpted body before he picked her up. She kissed his neck and chest while he carried her, tasting just a touch of salt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He laid her carefully on the bed and she stared at him openly. A small smile on his face, he moved to cover her body with his.</p><p>“I’ve wanted you for so long,” he whispered, his mouth so close to her, warmth touched her ear when he spoke.</p><p>“You never seemed to. I mean—”</p> <p>He cut off her argument by taking her mouth with his. His hands were everywhere, caressing her breasts, her stomach, her thighs. And when he slipped between her legs and touched her in her most sensitive place, her body arched toward him, almost out of her control.</p><p>“Always in those sexy little outfits. With your snappy comebacks and—”</p><p>“Justin, I—” Words escaped her as his mouth was back on her skin, moving quickly down her body. Then his insistent tongue joined his hand between her thighs, stroking her to new heights. Within seconds, an explosion rocked her body. If he hadn’t held her down, she would have flown off the bed, out of his room, into the sky. But he held her, whispering sweet words in her ear that she couldn’t understand.</p><p>His mouth was back on hers when she came back to herself. But she still couldn’t think right, couldn’t get enough air. And he moved against her in such a way she needed him even more desperately than she had before.</p><p>She reached between them, and gripped his arousal. He moaned against her neck, and she stroked him until he pulled her hand away.</p> <p>“Vixen,” he muttered, and she let out a breathy laugh.</p><p>Then he was gone. She heard the snick of a condom wrapper, and his weight settled over her again before she could tell him to hurry. Propping himself on his elbows, he held her gaze, his dark eyes so intense with emotion her mouth went dry. Slowly, as if he was afraid to hurt her, he pushed himself into her heat.</p><p>Sweat touched his brow from the effort of moving slowly. But she didn’t want slow. She needed him to take her with the same intensity she saw in his eyes.</p><p>She gripped his butt hard and writhed against him, her body aching and trembling with need. Groaning against her mouth, he moved. Thrusting and sliding in a delicious rhythm that she could barely keep up with. She flew again. This time, with Justice at her side.</p><p>Chapter Seven</p><p>The smell of bacon woke her, and she sat up in the bed, confused until the night’s memories came rushing back to her. Justice, defending her against her brother’s matter-of-fact insults. Justice, loving her with his hands, his mouth, his body. And Justice, who now seemed to be making her breakfast. She lay back down for a moment, reveling in the pleasantly warm afterglow that remained after an almost-sleepless, but entirely wonderful, night.</p> <p>After a few minutes of fighting the urge to slip back into sleep, Brenda forced herself out of bed. She grabbed a T-shirt from a clean pile that had yet to be put away from the top of his dresser and pulled it over her head. None of her clothing seemed to have made the trip with her, so she padded down to her room and grabbed underwear and a pair of cotton shorts she normally slept in.</p><p>The woman who greeted her in the bathroom mirror looked like she’d spent the night being ravaged and doing a bit of ravaging herself. Brenda grinned stupidly and tried to get her hair into some semblance of order. When she was as good as she was going to get without a shower, she walked out to the kitchen.</p><p>“Morning, beautiful,” Justice’s face lit with a masculine smile, and he pulled her into his arms for a kiss that made her heart race. “I hope you like bacon,” he said, giving her a wicked grin as he returned to the stove.</p><p>“I love bacon,” she replied, and the smell of it filled her nose as it sizzled on the stove, making her mouth water. She hoped cooking was a domestic skill he actually excelled at. It would be the only one she had seen evidence of since her arrival at his home.</p><p>He sent her from the kitchen and a few minutes later appeared in the dining room with two plates full of bacon, eggs, fried potatoes, and toast. Her arteries and waistline protested, but she dug into the food vigorously.</p><p>“Wow, you can cook,” she said, after swallowing a perfectly fried potato.</p><p>“Don’t sound so surprised.” He grinned at her, almost halfway through with his plate. “Just because I don’t like to clean up—and can’t bake—doesn’t mean I don’t like to eat well.”</p><p>“So, what’s on our agenda today,” she asked, wondering how on earth he could eat so fast.</p> <p>“I’m going to check in with the League, see what progress they’ve made since yesterday. We need to find this guy soon, before he moves on.”</p><p>She nodded. If they didn’t get Howler, she would need to follow him wherever he moved on to. She was the only one with her particular power that she knew of, and she wouldn’t feel right leaving some other group of superheroes to deal with what she was now thinking of as her mess. That would be tough to do; getting out of work now and then was okay, but she’d feel like an irresponsible jerk if she had to just take off for weeks to find the guy. “I’ll go with you.”</p><p>“No, you should stay here.”</p><p>“Excuse me?” She bristled at his tone. She didn’t care how good the man was in bed, he couldn’t give her orders. Well, technically being a League council member to her normal membership he could, but she wasn’t about to let him get by on a technicality.</p><p>“Look, Bren, I know you want to get this guy, but he wants to get you, too. I think it’s best if you stay here where it’s safe. I’ll let you know if we need you.”</p><p>“If? Don’t you mean when?”</p><p>“Of course.” He got up from the table and grabbed her plate along with his own, stopping to plant a kiss on the top of her head, and then headed for the kitchen.</p><p>A few minutes later he reappeared from the bedroom, wearing his uniform, with a long coat over it, probably to hide his appearance from his neighbors. He carried his mask in one hand, and his keys in the other. “I’ll be in touch. Stay out of sight, and call me if you see any sign of him, okay?”</p><p>She gave him a short nod and stiffened when he pulled her close for a kiss good-bye. As his Porsche roared out of the driveway, she muttered a curse under her breath. Who did he think she was? She wouldn’t sit on the sidelines while other people got hurt hunting her villain. But he said he would call, and she trusted him, didn’t she? He’d call her if they found Howler, and she just have to keep from going crazy until then.</p><p>After washing the dishes, which Justice had conveniently left piled in the sink, Brenda took a shower and donned her practical superhero outfit, minus the mask, and then wandered around the house. She didn’t mean to pry, but couldn’t help herself from straightening up his room. She made the bed, and then glanced through the collection of books that lined his wall, most of which revolved around police procedures and evidence collection, with a few mystery novels thrown in, as well.</p><p>A quick peek into his nightstand drawers turned into a full-fledged search. The one on the side of the bed she’d woken up on was nearly empty, save for some loose change and a long-forgotten travel-size bottle of aspirin. But the drawer on his side of the bed had a far more interesting stash.</p><p>Her face burned when she picked up the box of condoms and set them on top of the nightstand. He’d torn them open with such haste that the top and half of one side was ripped away and was sitting in the drawer next to the box. Under that, she found a small container of mints and a half-empty wrapper of antacids.</p><p>Beneath those and still more change and an extra set of Porsche keys on a ring with other keys she couldn’t so easily identify, was a small stack of photographs.</p><p>The pictures, nine in all, showed the smiling faces of an obviously happy family. The man in the picture sported the same hair, skin, and facial features as Justice, though his clothes placed him in an era before Justice was a man. The little boy in the photos had to be Justice. He wore the smile she’d glimpsed only a few times since meeting him, wide and open, like he didn’t have a care in the world.</p><p>The other two in the pictures could only be his mother and younger sister. The woman was blonde like Brenda, but her hair was a few shades darker. The little girl’s long, blonde pigtails were much lighter than her mother’s hair, at a young age anyway. After leafing through photographs of the family picnicking, boating, and sitting around a gorgeously decorated Christmas tree, Brenda placed the pictures and other items back into the drawer.</p><p>Guilt tugged at her, but she couldn’t help feeling happy after glimpsing that cheerful family. Justice had never mentioned them. It was probably a sore subject since he’d moved to Chicago and likely didn’t get to see them as much as he wanted to anymore, but it surprised her he hadn’t at least said something about them in passing.</p><p>The sound of her cell phone interrupted her thoughts, and she shut the drawer and sprinted down the hall to grab it off the coffee table. She frowned at her work number, but flipped the phone open.</p><p>“Hello?”</p><p>“Brenda?” Maria’s voice sounded frantic.</p><p>“What’s wrong, Maria?”</p><p>“Can you get in touch with that superhero you were with the other day? Something’s happening here at the hospital; we’ve called the police but—” Abruptly, all sound on the line stopped.</p><p>“Maria? Maria what’s going on?” Brenda pulled the cell phone away from her ear and looked at it. The screen read: Call Failed.</p><p>She grabbed her purse from the coffee table and tossed her phone in. She would call Justice on her way. After making a quick stop in the spare bedroom to grab her mask, she hit the road.</p><p>Justice hadn’t even arrived at the Chicago League’s headquarters when his cell phone rang. He flipped his phone open.</p><p>“Yes?”</p><p>“We have an address for you.” StrongArm’s voice was calm, like always, but the hint of worry in his tone that made Justice’s stomach clench.</p><p>“Where?”</p><p>He arrived at Pranier Medical less than ten minutes after hanging up, a new record of breaking traffic laws left in his wake. He made his way through the police barricade just forming around the hospital. StrongArm, Char, and Violet stood in the parking lot, around a hundred yards from the front entrance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What do we have?” he asked. His phone rang and he glanced down at the number. Brenda. He hit the button to silence the ringer.</p><p>“Where is Silencer?” Violet looked behind him, as if Brenda would suddenly appear from thin air.</p><p>“Howler’s taken the hospital; a large section of it, anyway. We’re not sure what his game is yet. He hasn’t released a list of demands.” StrongArm’s voice had calmed again to near perfect.</p> <p>“How many hostages?”</p><p>“Not many directly with him, less than a dozen we think. But there are patients and personnel on other levels who haven’t been able to evacuate yet. We’re getting them out the back, but who knows if he’ll continue to let us.” StrongArm’s jaw tightened. “We need to get in there. Where is Silencer?”</p><p>“She’s not with me.”</p><p>“Well, then, call her in.” StrongArm wasn’t asking.</p><p>“Let’s think about this, Strong. He’s got a history of stalking her, and now he’s attacking here, her workplace. He has it out for her or something. We can’t bring her here where he can get to her.”</p> <p>StrongArm frowned and ran a hand over his full mustache, only a slight expression touched his face, but it was the most expressive Justice had ever seen him. “Silencer works here?”</p><p>“What does it matter?” Violet said, and her exasperated tone grated on his ears. “So what if he has it out for her or has a thing for her? That’s good for us. We can use it against him. She can get close, take him out easier that way. Call her in, Justice.”</p><p>He gave her a level stare. “Did you get promoted to The Council while I wasn’t looking?”</p><p>She glared back at him, eyes full of venom, but didn’t comment.</p><p>“We’re not arguing among ourselves,” StrongArm began.</p><p>“This is a pointless conversation,” Char said, cutting in. “I don’t like the idea of bringing her in any more than you do. But the fact of the matter is, we need her. We stand a much better chance of taking Howler out with her help, and she would want to be called in. I don’t understand why you’re trying to change the plan now.” Her eyebrows drew together in confusion, but her voice and expression lacked the anger radiating from Violet.</p> <p>Justice opened his mouth to argue, but no one was looking at him. Something had caught their attention behind him.</p><p>Brenda met his gaze as she rushed from her car. She wore her black uniform and it fit her like a tight leather glove. He licked his lips. “What are you doing here?”</p><p>“What am I doing here? Why didn’t you call me, that’s the question that needs to be answered, Justice.” Her eyes lit up with anger, and her hands clenched tightly at her sides.</p><p>StrongArm spoke before Justice could pull together an answer in his mind. “Howler has taken over much of the first floor, Silencer. He has hostages, we think around a dozen.”</p><p>“Where is he at on the first floor?” she asked, skin paling around her mask.</p><p>“Near the front doors.”</p><p>“Damn it,” she said, “you mean near the pharmacy.” She closed her eyes for a few moments, seeming to gather her thoughts. When she opened them, her attention was focused on StrongArm. “I got a call from a coworker inside the hospital pharmacy. We were disconnected before she could tell me anything, but I think he’s targeted her—targeting them—because of me.”</p><p>“Justice told us about your relationship with the hospital. Are you sure you’re okay to go in?” StrongArm asked.</p> <p>“I’m fine,” she said firmly.</p><p>“Okay then.” He nodded at her, only the slight smile on his face revealed how much he approved of her decision, her courage. “You and Justice will go in the front. If he knows you work here, he’ll be expecting you regardless; might as well send you in where he can see you. Char, Violet and I will come in through the back. We’ll try to get the drop on him if you can keep him busy, but if you see an opening, Silencer, you take it. Backup is en route, they’ll move in if we fail, but they’ll concentrate on getting patients and hospital personnel out when they get here.”</p><p>Brenda nodded, her skin seeming to pale even further, and her lips stood out even darker against it. More than anything, Justice wanted to take those lips with his own, kiss her—distract her—and take her away to somewhere safe. But he couldn’t, and she wouldn’t thank him for trying, so he simply nodded at StrongArm and followed Brenda toward the front door of the hospital.</p><p>He touched her shoulder when he got close and she shrugged off his hand, and then stopped and turned to face him. “You should have called me or come back to the house and picked me up the second you found out he was at my hospital, Justice.”</p><p>“I’m sorry. I just don’t want you anywhere near the guy, okay? He’s fixated on you, and he’s dangerous. We don’t know what he’s capable of, and I didn’t want you getting hurt.”</p><p>She smiled, but the expression didn’t touch her eyes. “Funny thing is, I was actually starting to buy that crap line you were giving me about me being just as good a superhero as the next guy.”</p><p>“That wasn’t a line, you are just as good—better—than most heroes, Brenda. I just....”</p><p>“What?”</p><p>He shrugged, unable to put how he felt into words. The fear that gripped him at the idea of her facing off with Howler, the unbearable pressure in his chest at the thought of her getting hurt.</p><p>“That’s what I thought,” she said, and then turned and stomped up to the front entrance of Pranier Medical.</p><p>Justice barely suppressed a growl and followed her through the doors.</p><p>The second they entered, Howler stepped out from the door that led into the pharmacy. Justice yelled and ran for the villain, but as he reached Brenda, the sound wave hit. The dark gray-and-maroon commercial-grade carpet rose toward his face, and then everything went dark.</p><p>Brenda pulled her power up the second she saw Howler. Elation rushed through her when she realized she got it up in time. Then she watched, aghast, as Justice fell like a puppet whose strings were cut. She stared at him for a few precious moments before remembering the threat wasn’t over.</p><p>Howler appeared to be laughing, so hard that he doubled over for a few seconds before righting himself. Tears ran down his face, and he did a little dance around Justice, surveying his handiwork with glee.</p><p>Brenda’s mind worked in slow motion, her thoughts were scattered, and she couldn’t seem to bring them into focus. What was she supposed to do now? Try to take the villain, hand to hand? He might be a small man, but he still outweighed her. If he had her training in martial arts, he’d likely win if she attacked. But what else could she do?</p><p>Steeling herself for her first real fight, Brenda put her arms up and forced her shaking hands into fists. She took a determined step forward toward Howler.</p><p>He stopped laughing when he saw her, expression turning thoughtful, and then he held out a hand like a police officer stopping cars so kids could cross the street.</p><p>Brenda paused, confused. Howler pulled a piece of paper from the utility belt of his uniform. After unfolding the note, he held it out in front of him. It read: Let’s talk.</p><p>She narrowed her eyes and studied him. He wanted to talk? His face was open, eager and he looked like he was on the edge of jumping around again; twitchy little man. But she needed to distract him and keep him that way until StrongArm, Char, and Violet showed up to help her. Talking seemed like a better way to do that than trying to beat on him until they arrived.</p><p>Tentatively, she turned off her power. “Okay, what do you want to talk about?” She braced herself and watched him for the quick intake of air that would reveal his intent to use his power, but he only smiled at her and clapped his hands quietly.</p><p>“Oh, Silencer, you don’t know how badly I’ve been wanting to talk to you.”</p><p>“Do tell.” She moved in a little closer; if she had to try to take him down, she would have a better chance of surprising him if she was close.</p><p>“I think you would make the perfect newest member of my gang.”</p><p>“Your what?” She stopped in her tracks.</p><p>“My gang,” he said, carefully enunciating the last word so she could be sure to understand. “What? You didn’t think I was working alone, did you?” He laughed, a wheezing sound that hurt her ears, and she decided he’d probably been practicing his super villain laugh for far too long.</p><p>“We’ve never seen you work with anyone else.” Keep him talking, Brenda, she told herself.</p><p>“Okay, I was alone until I got here,” he admitted, “but it wasn’t long after that my gang really got off the ground.”</p><p>She frowned and he looked at her quizzically, her reaction clearly not what he expected. Then his face lit up as if he’d finally solved a puzzle. “You’ll be my second in command, of course. I wouldn’t expect you to report to anyone except me.” He took a long step toward her, and she tensed her muscles, ready for an attack.</p><p>“Stay back,” she said, and he stopped only a couple of feet from her.</p><p>His smile widened. “I’m not going to hurt you, Silencer. I want you to be my number one sidekick. And if you’re uncomfortable going out in the field, don’t worry about it. I’d much rather have you around my lair to...keep me company.” He raked his gaze down the length of her body, and she suddenly felt filthy and in desperate need of a shower.</p><p>“Yeah, I don’t think so,” she said, trying to keep her voice free of the disgust she felt.</p><p>“Come on, baby,” he crooned, “you don’t have to play hard to get with me.”</p><p>With effort, Brenda kept her eyes fixed on Howler as StrongArm rounded the corner. Char stalked behind him and Violet brought up the rear. Howler started to turn, but StrongArm was on him, holding the man in a giant bear hug, he clasped his hand over Howler’s mouth.</p><p>Brenda whooped and jumped in the air, unable to maintain her stoicism in the face of catching the man who’d stalked her. Char grinned and walked over to her, giving her a solid high-five with her gloved hand. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Suddenly, a loud thump sounded and StrongArm stiffened; then his eyes rolled back and he fell to the floor with a thud. Howler twisted out of his grip at the last moment and avoided being squashed under the large man’s heavy frame. Violet stood behind them, a triumphant smile on her face. She held a piece of hospital equipment in her hands that Brenda didn’t recognize, some kind of metal box, and she tossed it to the side where it crashed into a wall.</p><p>Char froze for a moment, and then lunged for Violet. Howler filled his lungs, and Brenda used her power even as she called to her friend to watch out. Char went down, falling on top of StrongArm. Violet, face twisting into a snarl, also fell to the floor.</p><p>“Char!” Brenda screamed, but her power drowned out the sound of her voice.</p> <p>Howler’s mouth was open, and his eyes widened as she watched. At first she thought he was screaming, but quickly realized he was laughing, though it was silent to her ears.</p><p>She bared her teeth and lunged at Howler. Pain shot down her arm as her fist slammed into his nose. A whiff of cologne hit her, pungent and foul. Had he bathed in the stuff?</p><p>Howler stumbled back, both hands covering his face. Blood dribbled down his chin, marring the front of his uniform. He screamed something and dove at her.</p><p>Stars flew through Brenda’s vision as her head slammed into the floor. Howler weighed her down after tackling her, and she blinked to try to clear her sight. He was all teeth, screaming at her. She couldn’t hear the words, but it didn’t take a lip-reader to make out the profanities he spewed.</p><p>How much time had passed? Could the other superheroes do anything if they walked in now? She struggled to think, to move. She wriggled under him trying to break free from his grip on her shoulders. He moved his hands and tried to grasp her neck, his face full of rage.</p> <p>Squirming out from under him, she slapped at him frantically. She gasped as she broke free and crawled away from the villain. Scanning the room, her eyes settled on the machine Violet had used to knock out StrongArm. Her knees protested as she wormed her way across the hard floor.</p><p>Howler’s foot connected with her gut and her breath flew from her lungs. Air refused to fill her chest as she lay on her side, gasping. He kicked her again, almost losing his balance. The pain in her stomach was so severe she couldn’t even flinch as he moved in for in for another kick.</p><p>Movement in her peripheral vision caught her attention. Something black advanced toward them, and Howler didn’t attack again. She pulled her head from the ground and dragged herself toward the equipment. She didn’t bother looking behind her; there was no time.</p><p>Still gasping for air, she pushed up to her knees when she reached the metal box. Wires stuck out of it from a couple of different points as if it had been ripped from the wall or a stand. It looked like something that might report vital signs.</p><p>The cold and heavy weight in her hands, she struggled up and turned to face Howler. Justice lay at his feet. Brenda hesitated, confused. Hadn’t Justice been on the other side of the room?</p><p>Howler didn’t seem to see her; he glared at Justice. Blood pouring from his nose intermingled with blood from a cut on his forehead and a fresh shiner on his eye that she was certain she hadn’t caused. His uniform was ripped; one arm hung only loosely attached to the rest of suit.</p> <p>A surge of energy hit her and she ran at Howler. He saw her, eyes widening and mouth opening to lob more curses at her, but he didn’t move. Not fast enough. When she got close, she swung the heavy metal box she carried at his face, catching him square in the jaw. He clutched at the wall behind him before melting to the floor.</p><p>Brenda watched as he fell, and then tossed her weapon to the side, taking care not to hit anyone. Justice was paler than usual, and blood marred one side of his head. His ear bled, but his chest moved up and down in a normal rhythm.</p><p>Shooting Howler a quick glance to reassure herself he was still not moving, Brenda touched her mind and turned off her power. Sounds came rushing back. People yelled. They were close, but their sounds were muffled behind a wall or two from where she knelt. Police sirens wailed.</p><p>“Justice?” Her voice cracked. “Justice, can you hear me?”</p><p>Her legs didn’t want to work, but she forced herself up and out the front door. She waved at the police officers on the line before collapsing onto the hard asphalt.</p><p>Chapter Eight</p><p>The next hour was a blur. Paramedics hauled her onto a stretcher, ignoring her protests and demands that they wheel her back into the hospital so she could check on Justice. StrongArm trudged out of the hospital. The first superhero to appear from inside, he stopped to talk to her. He ignored the paramedics who hung around him, fluttering.</p><p>“Silencer, can you tell me what happened?” He accepted an ice pack from an emergency worker with a nod of thanks.</p> <p>She took a deep breath. “I was struggling with Howler when you guys got there. He’d already knocked out Justice.”</p><p>“I remember that much.”</p><p>“Violet hit you over the head with a metal box, some sort of medical equipment.” She paused, her chest suddenly heavy with the weight of her words. “God, Violet. She was with him. She betrayed us.”</p><p>StrongArm’s expression didn’t change, but he touched her lightly on the shoulder.</p><p>“We struggled after he knocked out Char. He had me on the ground when Justice got him off me.” She blinked back tears and tried to swallow the lump in her throat. “Is he okay? The paramedics won’t help me back in.” Her voice grew frantic. “I don’t think I can walk that far yet on my own. Did you see him? Is he—”</p><p>StrongArm grasped both of her shoulders, and she bit back a moan, wincing. “Sorry,” he muttered and let her go. “They’re only bringing in patients that absolutely need to see a doctor now; that’s why you’re out here. Had to clear out Howler and Violet before they’d open the place back up again. Justice is in with the doctor. They’re having a hard time waking him. Since he got hit twice at such close proximity, they’re worried.”</p><p>She struggled to her feet and StrongArm caught her just as her knees threatened to give out. “I have to see him. Can you help me get in there?”</p><p>“He’s tough. You need to worry about yourself right now.”</p><p>“I’ll be fine. Can you get me to him or not?” She met his gaze and refused to look away.</p><p>He grimaced. “All right. Wait here and I’ll find a wheelchair.”</p><p>“Just help me!” She glared at him. What kind of self-respecting superhero let herself be pushed around in a wheelchair when she was able to walk, albeit barely?</p><p>StrongArm raised an eyebrow at her order but offered her his arm. She limped up to the hospital, through the front doors, keeping her face as expressionless as she could manage. And she hoped that no one noticed how hard she clung to the man’s muscled arm.</p><p>The trip to the emergency room area where the hospital housed Justice seemed to take forever. Each step reminded Brenda of how rough the fight had actually been, and the slowness of her progress did nothing to stymie her anxiousness.</p><p>They found him lying on a gurney behind a curtain. A nurse stood over him, clipboard in hand, and she offered them a professional smile when they approached.</p><p>“How is he?” StrongArm asked as Brenda jogged—the fastest gait she could manage—to Justice’s side.</p><p>She took his hand in her own, careful not to move or disturb any of the cords running from him to the machines that lined the wall behind his bed. He was so pale, but she didn’t see any injuries save a small bruise forming under his right eye. They’d cleaned the blood up that had drizzled from his ear down his neck. StrongArm and the nurse’s voices faded into the background as she watched Justice’s face, wishing she possessed the ability to make him well through the strength of her will alone.</p><p>“Are you all right?” StrongArm touched her shoulder and she jumped.</p><p>She didn’t look away from Justice. “Is he going to be okay?”</p><p>“He’s tough.” StrongArm didn’t remove his hand from her shoulder, and moved to stand closer to her instead. “He has a blown eardrum in his left ear, and he’s stunned from the repeated sonic screams. He has a goose egg on the back of his head, too, from one of the times he hit the ground, I guess.” StrongArm squeezed her shoulder. “He’s sedated right now, but he came to a while ago. He’ll be fine.”</p><p>Brenda nodded, not trusting herself to speak. But when she brought a hand up and covered her mouth, she realized her cheeks were wet. She was crying, and she hadn’t even noticed. What was wrong with her?</p><p>As she stared down at Justice, the man who’d saved her more than once, and who, more than that, had made this week the most fulfilling of her life in every way possible, she knew.</p><p>She loved him.</p><p>The room wasn’t entirely dark, and it took him a moment before the memories of the day came back to him. Brenda fighting Howler. Howler standing over her, kicking her repeatedly. Pain and rage and fear. Howler’s neck under his hands. Then...nothing.</p><p>He tensed when something moved at his side, but relaxed when he saw StrongArm. “Hey,” he said, voice barely above a whisper.</p><p>StrongArm handed him a plastic pink cup with a straw peeking out from the top. Justice sipped the water and cleared his throat. “Where’s Brenda?” he asked, voice stronger.</p><p>“She’s fine. She was here until they forced her into her own room.”</p><p>“How is she?”</p><p>“She’ll be fine. Some cracked ribs, heavy bruising.” StrongArm crossed his arms. “Her hand is badly bruised from breaking Howler’s nose.” He took a deep breath. “I won’t lie to you. She got pretty beat-up, but she’ll recover.”</p><p>Pain lanced through his head as he pushed himself up from the bed, holding a hand out in warning when the other man moved to stop him. “I have to see her, Ben. I have to.”</p><p>StrongArm’s face broke out into a deep frown at the use of his real name, but he helped him up from the bed. “Your headache should go away in the next day or two. The doctor said there’s no permanent damage.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Justice stood on his own when they reached the door. But he stopped in the doorway, a sudden thought snapping into place in his mind. “What happened to Howler?” he asked, turning to face his friend.</p><p>His expression turned smug. “She took him down. Knocked him out so the League could take him into custody. We have Violet, too.”</p><p>“Violet?” he muttered, but he’d already turned from his friend and headed down the hall.</p> <p>“She was in league with Howler,” StrongArm explained. “TruthSeer questioned her earlier. Guess she decided she could make some easy money after she figured out Silencer’s identity. She saw her working in the pharmacy. Violet didn’t count on Howler actually wanting her to help him. She couldn’t figure a way out of it once she was roped in, so she went with it.”</p><p>Justice grunted and shook his head.</p><p>They reached Brenda’s room and though shadowed like every room in the hospital, it wasn’t really dark. Her bruised face and neck stood out in stark contrast to her pale skin. One of her eyes was swollen and her lip was split.</p><p>Air escaped his chest in a haggard breath. It took every bit of his self-control to keep from groaning at the sight of her. This wasn’t supposed to happen. And it wouldn’t have, if only he’d protected her like he should have.</p><p>He clenched his fists at his side to keep from hitting the hospital room wall. She wouldn’t be hurt if he hadn’t talked her into facing Howler in the first place. If he hadn’t convinced her of her power.</p> <p>It was all his fault.</p><p>The sound of her mother’s voice roused Brenda from her drug-induced sleep, and for a moment she considered pretending to still be asleep. But her mom’s angry tone couldn’t be ignored, so she suppressed a sigh and opened her eyes.</p><p>Sunlight streamed in through the hospital room window, illuminating her mother and a doctor in a white coat. Mabel Booth’s finger was pointed squarely at the poor older gentleman’s chest. Her lips were drawn into a firm line.</p><p>“Mom,” Brenda said, her voice hoarse, “leave the doctor alone before you get yourself kicked out of the hospital.”</p><p>“Brenda! Thank goodness you’re awake.” Her mom hurried the two feet to Brenda’s bedside. Her swollen eyes lit up, and a stab of guilt ran through Brenda for making her worry enough to cry.</p><p>“Water?” Brenda asked, and was rewarded with a sip from a hospital cup. Though lukewarm, it slid down her throat, delicious and wet.</p> <p>“How are you feeling?” the doctor asked.</p><p>“Okay, I guess.” Brenda moved a bit in the bed, testing her muscles. “A little sore.”</p><p>“Oh, honey,” her mother began, and Brenda braced herself for the lecture that would follow, for the warning that she needed to be more careful. “We’re so proud of you,” she said instead.</p><p>“You’re what?” Brenda asked, flabbergasted.</p><p>“You took down a terrible villain. I’m so sorry we haven’t been more supportive. We should have known you had it in you, it’s just...we worry.” She smiled, practically glowing with pride.</p><p>Brenda stared at her, unable to form words. They were proud of her? Knew she had it in her? Since when?</p><p>But she couldn’t ask that, not when her mother looked so content. So instead she muttered, “Thanks.”</p><p>“Oh you woke up just in time. Your friend is giving a press conference about the whole thing.” Her mom reached over and grabbed a remote from the stand next to the bed. Pointing it at a small television mounted on the wall, she pressed a button and the TV flared to life.</p> <p>A pretty brunette newswoman appeared on the screen with a perfect professional smile affixed to her face. She summarized the events of the day before, with a few key details left out. Details like Violet’s involvement and specifics about Howler’s apprehension. She also made no mention of why Howler had chosen Pranier Medical to hold hostage, other than to suppose it must have been because of the general high-class status of its patients. After a few minutes of discussion back and forth between her and the news anchor, the camera panned to a podium surrounded by reporters.</p><p>Justice’s serious face took up much of the screen when he stepped up to talk about what the reporters had dubbed the “Pranier Medical Attack.” Brenda grinned at the title and decided that creativity was perhaps not the first requirement of a reporter, for that particular network anyway. Face nearly untouched by the events of the previous day, save a small bruise that was mostly covered by his mask, he appeared every bit the heroic superhero Brenda knew him to be. But then Howler hadn’t needed to hit him, and he’d obviously avoided landing on his face.</p><p>After a few seconds the reporters quieted down and waited eagerly for Justice’s statement.</p><p>“Ladies and gentlemen, thank you all for coming. As you know, Pranier Medical was subject to an attack yesterday. While his reason for targeting Pranier is unknown, we can make the assumption that he was likely targeting its patients in general. We do not believe he had a specific mark in mind, unlike when he took the mayor hostage earlier in the week.” Justice’s face was expressionless, the area around his eyes covered with his mask, and his voice was steady.</p><p>Brenda frowned at the screen. She hadn’t really expected him to tell the press Howler targeted Pranier Medical to lure her in—he was no doubt trying to protect her secret identity—but she also hadn’t thought he’d outright lie.</p><p>Justice’s voice pulled her from her thoughts as he answered a question she missed from a reporter. “A team of superheroes led by myself and StrongArm took down Howler late yesterday afternoon. A superhero named Silencer was key in the takedown, due to her unusual power to turn off her hearing and block sonic waves from affecting her person.”</p><p>The rest of the interview faded into a game of reporters posing questions, which Justice promptly danced around without actually answering. The press never mentioned Brenda’s alter ego, and her stomach dropped. She shouldn’t be disappointed. She wasn’t a publicity-seeking lunkhead after all. But it hurt to not receive even a passing interest from the reporters after her first takedown.</p><p>“Can you turn it off, please?” Brenda said to her mom, who frowned at the screen.</p><p>Her mother clicked off the set and smiled at her daughter, though it didn’t touch her eyes. “Let’s see if we can’t get you checked out of here, shall we?”</p><p>After an hour of getting forms finalized and instructions from the doctor to stay off her feet for a few days, Brenda and her mother hit the road.</p><p>“Paul and your dad are waiting for us at the house.”</p><p>“Mom, I don’t want or need to stay with you. I’m fine,” she protested. Her mom glanced at her and she glimpsed an extra brightness in her eyes.</p><p>“Okay, fine,” Brenda said, unable to face the idea of her mother crying over her twice in one day. “But only until tomorrow.”</p><p>Her mom relaxed and nodded.</p><p>The look of worry on her father’s face didn’t surprise Brenda, but Paul’s red-rimmed eyes did. Her brother pulled her into a tight, but careful, hug as soon as she cleared the doorway and held her until she hugged him back.</p><p>He loosened his grip and stepped away so he could see her face. “Brenda, I’m sorry I didn’t take this seriously before. I should have been out there with you, not sitting on my butt enjoying my vacation.”</p><p>“Don’t worry about it, Paul. We got the villain, that’s all that matters.”</p><p>He shook his head. “I’m so glad you’re okay.”</p><p>“Let’s not forget I also kicked some ass.” She grinned.</p><p>“I won’t be forgetting that anytime soon.” He laughed and stepped aside so her father could give her a quick hug, too.</p><p>The newspaper sat on the kitchen table, so Brenda grabbed it to read while her mom warmed up some leftovers. Her stomach rumbled at the scent of roast and potatoes, and she smiled to herself. She would wait until tomorrow to talk to Justice. For now, being in her family’s care felt pretty darn good.</p><p>Pictures of Howler, Justice, and StrongArm covered the front page of the newspaper. She read through the article, and got nearly to the end of the story before she realized she gripped the paper so tightly her hands hurt.</p><p>It was all Justice, all StrongArm. No mention of her, of Char. No hint in the whole damn thing that someone other than Justice might have helped save the day.</p><p>She found her purse where she’d dropped it on the couch and yanked out her cell phone. No missed calls. No warnings or explanations from Justice. Nothing.</p><p>She flipped the phone open and found him in her contact lists, and then snapped it shut. No. This wasn’t a conversation she could have over the phone.</p><p>Justice threw the newspaper onto the table and cursed. He’d done his best to keep the reporters in the dark about Howler’s obsession with Silencer, knowing she wouldn’t like the speculation that might come with that information. But he had credited her as the main reason they’d been able to take down Howler. He should have known when the reporter blinked in confusion when he’d explained Silencer’s power that she might not think it impressive enough to mention in the article.</p><p>As if they could have taken down Howler without it or her.</p><p>Banging at the front door pulled him from his thoughts. The figure framed through the glass was familiar, and his stomach dropped.</p><p>Brenda didn’t say anything, but shoved past him to pace in the space between his dining room table and the back of the couch. He winced at the sight of her still-bruised face. The pink tinge to her skin and the hard line of her mouth made it clear she’d seen the article.</p><p>“How are you?” he blurted out, unable to stand her angry silence any longer.</p><p>“How am I?” she asked, voice tense. But she didn’t answer the question. Instead, she glared at him, jaw muscles twitching.</p><p>“Look, Brenda, I’m sorry. I know the article—”</p><p>“What? Didn’t credit anyone except you for taking down Howler? Of course you know about it! You were the source of the damn story!” She took a deep breath, closing her eyes. When she opened them again, some of the anger had drained from her expression. “I’m sorry. I know this isn’t something you would do on purpose. I know that.” She nodded as if convincing herself as she spoke. “I should have given you a chance to explain. It’s just, after everything....” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He opened his mouth to tell her the truth; that he hadn’t left her out of the explanation. That the reporter had screwed the story up. But before the words left his mouth, he snapped it shut. He’d already hurt her, even in the short time they’d known each other well. She’d hurt him, too. Nothing was irreversible—yet. But if he explained and it worked out, he could lose her. Lose her to a super villain or in a less spectacular, but still permanent, way. He’d learned that the hard way. Was it worth the potential pain?</p><p>He looked at her, taking in her wide eyes, her healing split lip, the obvious unhappiness on her face.</p><p>Because of him.</p> <p>If he told her, she’d forgive him, and he’d never get up the courage to leave. With her, he wouldn’t be able to go halfway. He already cared too much.</p><p>Caring deeply always ended in pain.</p><p>“I’m sorry.” He shrugged. “The reporter was hot.”</p><p>The slap rang out, seeming to echo off the walls. He glimpsed her tear-filled eyes and reached out to her, but she dodged and ran out the door.</p><p>The weight on his chest threatened to suffocate him and he tried to breathe. He’d known not telling Brenda the truth would hurt her, but he hadn’t realized the hole it would leave in his own chest.</p> <p>He walked back to the bedroom and pulled the stack of pictures from his nightstand drawer, and pretended that the burning in his eyes wasn’t tears.</p><p>Brenda clutched the steering wheel of her car so tightly her hands ached. The night spent at her parents’ place was rough, even with their awkward sympathy. After rushing out of the house and taking her mother’s car, she could hardly pretend nothing happened. Hiding her emotions had also proved difficult, but showing themselves beyond considerate, her family hadn’t pressed her for information. Not that they needed to. All the particulars necessary to put it together were in that damn newspaper.</p><p>She parked in her usual spot and walked up to her apartment. Silence greeted her and she gritted her teeth. She could do this. She’d managed fine on her own before Justice appeared in her life. And she was a hero. Oh, she’d always had her superpower, but now she knew how strong she was. She’d taken out a super villain.</p><p>If nothing else, Justice had given her that confidence.</p><p>The vacuum drowned out her thoughts as she started on cleaning her home. Cleaning, she’d found, was a good distraction from almost any problem. She ran the machine through her room and back out into the living room, and then shut it off to scoot the coffee table out of the way. She took a step then stopped, staring dumbly at the man standing next to her couch.</p><p>Jeans and a T-shirt adorned his body. Her heart quickened, thumping against her chest. How could he be even sexier in casual clothes than he was in uniform? Life just wasn’t fair.</p> <p>“I’m sorry,” he said, “but the door was unlocked, and you didn’t seem to hear me knocking.”</p><p>“What do you want?” She yanked on the vacuum cord and grimaced as it finally gave, whipping around the corner to smack into the hallway wall.</p><p>“Can we sit?” He shifted on his feet, and his lack of confidence suddenly made her think of the little boy in the pictures.</p><p>She frowned. “You can sit all you want. I have an apartment to clean.”</p><p>“Brenda,” he said, and then reached out and grasped her lightly by her shoulders, “please, just hear me out.”</p><p>She met his pleading eyes with a hard stare, but finally she gave a short nod. They sat on the couch, and she yanked her hands back when he tried to take them into his own. He winced, but didn’t try again.</p><p>“I lied to you.” He reached out and placed a finger on her lips when she opened her mouth to interrupt. “Please, let me get this out, okay?”</p><p>She shrugged and stared at the coffee table. Fine. If he needed to assuage his guilt to move on and leave her alone, it would be better than dealing with him repeatedly as he tried to get whatever it was off his chest. She wasn’t sure she could stand to see him all the time. Her heart couldn’t take it.</p> <p>“Yesterday, when you came to talk to me about the article, I lied and let you think I was attracted to that reporter and left you out of the story purposefully.”</p><p>“So what, you’re telling me she wasn’t your cup of tea now?” She’d seen the caption photo of the reporter. He had another think coming if he thought she was going to buy that.</p><p>He snorted. “And tell you another lie? No, she was pretty enough, but I wasn’t interested. I know it sounds like a cliché, but you’re the only woman I’ve had eyes for since we started this investigation. Well, before that, really, if I’m totally honest.”</p><p>She risked a quick glance at him, but he didn’t seem to be joking. She held out a hand, gesturing for him to continue with his explanation.</p><p>“You saw the pictures, in my nightstand?”</p><p>She opened her mouth to deny it, and then shrugged. “Yeah, I saw them.”</p><p>“I figured. They weren’t in the order I always keep them.”</p><p>Brenda frowned and looked at his face. But he wasn’t watching her anymore, his gaze had settled onto his hands sitting in his lap. Order? Nothing else in his house made her think he was neat enough to have an order to anything, let alone some old pictures.</p><p>“They were my family, as you’ve probably guessed. They....” He cleared his throat. “They died. When I was a teenager.”</p><p>Her mouth fell open, and before she could think, words tumbled from her mouth. “Oh God, Justice. I’m so sorry.” She pulled him close for a hug, but his arms stayed in his lap, so after a couple of seconds, she moved back. “Was it a super villain?”</p><p>He laughed, a short sound filled with no amusement. “Nope. Drunk driver. Took all three of them out.” He looked up at her, and his eyes glistened with unshed tears. “They were superheroes, Brenda, in every sense of the word. But their powers weren’t anything flashy, nothing that was able to save them from something so...mundane. That’s why I became a police officer, so I could help people hurt by non-supers, too.”</p><p>Justice reached to the end table behind him and grabbed a tissue from the blue box. He handed it to her, and she realized her cheeks were wet. She dabbed at them and muttered a thank you.</p><p>“I have other family—cousins, aunts and uncles. But I’ve never let myself get close to them. I always figured if I did, it would just hurt too damn badly when I lost one.” He took a deep breath. “It’s why I pushed you away yesterday, Brenda. I love you. But I’m scared to death I’m going to lose you, too. When I saw you on that hospital bed....” He shook his head. “That was my fault. My fault.”</p><p>“It wasn’t your fault!” she cried. “The only one responsible was Howler. You gave me the confidence to face him.”</p><p>“Exactly! If I hadn’t talked you into it—”</p><p>“Then what, Justice? More people would have gotten hurt, that’s what. You helped me get the confidence to save people; then you saved me when Howler was trying to beat me to death.” She took in a ragged breath. “You were there when I needed you. If you hadn’t been, I might be dead. Other people—innocent people—could have paid for it with their lives.”</p><p>Some of the bleakness faded from his expression. “We did kick his ass, didn’t we?”</p><p>A laugh bubbled out of her. “We did.” Tentatively, she took one of his hands and held it with both of her own. “And I love you, too.”</p><p>Justice lifted her off the couch and kissed her, softly to avoid hurting her still-healing lip, until her head spun. When he finally set her down, her heart raced for a very different reason than when he’d barged into her apartment.</p><p>His face close to hers, he leaned in and grazed her ear with his lips, and then whispered, “Say you’ll be with me.”</p><p>She pulled her head back and met his gaze with her own. “I’m not going to stop being a superhero,” she said. “I can’t give up part of myself so that you can be sure I’m safe.”</p><p>“Of course not. You might just have to put up with me at your side from time to time.” He grinned at her, and her heart warmed.</p><p>“I guess I can handle that,” she said, hope and love and other emotions she couldn’t identify bubbling out of her chest.</p><p>Justice whooped and pulled her close. And she knew she was home. </p> </body></html>"]