["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I PEERED THROUGH the windshield of my ‘93 Mustang. The Buzzard Highway stretched before me, a narrow line of crumbling pavement vanishing into the dusk. Below it ran the Scratches, a twisted labyrinth of narrow ravines gouged out of the ground by magic three decades ago, when our world began to end. The old road skimmed the top of the ravines, rolling far into the distance, where the sunset glowed gold, red, and finally turquoise. There was something vaguely wrong with this picture, but I couldn’t put my finger on it.</p><p>The Buzzard Highway took no prisoners. Step too hard on the accelerator, turn the wheel half an inch too far, and Boom! Pow! Fiery crash! To the bottom of the ravine you went. Only Atlanta’s best and craziest raced here.</p><p>That’s why I liked it. When a girl weighs a hundred pounds soaking wet, her glasses are thicker than Sherlock Holmes’s loupe, and everybody under the sun makes fun of her because she’s a vegetarian and blood makes her vomit, she has to do something to prove that she isn’t a wimp. The wild, deafening chaos of the Friday-night Buzzard race was a strictly no-wimps-allowed kind of fun.</p><p>It was so peaceful now. So quiet. Just me and the Mustang. I had named it Rambo. It was a sweet car, built from the ground up for one purpose: to go fast. We understood each other, Rambo and I. Rambo liked to kick ass, and I made sure it had a chance to show off.</p> <p>My body was so light. It was an odd feeling, almost like I was swimming or floating through some feathery cloud.</p><p>A familiar face appeared in the windshield: pale skin, dark eyes, the long tattoo of a dragon wrapped around his neck, snaking its way down under the blue tank top. Kasen. Decent enough guy as wererats went. He operated a tow truck and liked to hang out and watch the races at Buzzard Highway. They were good for his business.</p><p>Kasen’s lips moved, but no sound came out. He looked kind of funny there, sideways, flapping his lips in silence. What is it you want, silly person?</p><p>Kasen was sideways.</p><p>The sunset behind him was sideways, too, the highway running to the left of the sky.</p> <p>Oh crap.</p><p>Crap, crap, crap.</p><p>The phantom cotton clogging my ears vanished and the world rushed at me in an explosion of sound: the distant roar of car engines, the groaning of metal, and Kasen’s voice.</p><p>“Dali? You okay, baby girl?”</p><p>I tried to talk and my mouth worked. “Cool like a cucumber.”</p><p>He grinned. “You know the drill. Hold on, I’m gonna set you upright.”</p> <p>I clamped the edges of my seat.</p><p>Kasen stepped out of my view, and I could hear him grunt as he grabbed hold of the bumper, lifted, and twisted. Rambo screeched. Metal clanged. I winced. Rambo, you poor baby.</p><p>The sunset turned and dropped into its rightful place with a shudder. Rambo’s tires hit the pavement and bounced once. The left lens of my glasses popped out of the frame and plunked onto my lap. I swiped it off my jeans, squeezed my left eye shut, and climbed out of the car.</p><p>“I flipped!”</p><p>“You flipped.”</p><p>Hot damn! Rambo’s front end looked like a crushed Coke can. Water soaked the asphalt, leaking from the hood—the enchanted water tank that let the car run during magic waves had ruptured. I must’ve taken the turn too fast.</p><p>Warm wind fanned me. Technically it was the middle of January, but after two and a half months of severe freezes and snowfall, the weather got confused. For the past week the temperatures held in the eighties, all the snow had melted, and I had traded my thick winter coats for jeans and a T-shirt. You’d think it was May. Magic did odd things to climate. Today it was warm. Tomorrow we could wake up to a foot of snow on the ground.</p><p>Kasen peered at me. “Why is your eye closed? Did you hurt yourself?”</p> <p>“No, it’s closed because my glasses are broken, and looking through one lens makes me dizzy.”</p><p>“Situation normal, all fucked-up.” Kasen rubbed the back of his head.</p><p>Thank you, Captain Obvious. “It’s not that bad!”</p><p>“You want Rambo towed to the usual place?”</p><p>“Yeah.” My races would be canceled for a month. Bummer.</p><p>Kasen nodded at the Mustang. “That’s your second crash in three weeks.”</p><p>“Aha.”</p><p>“Didn’t Jim forbid you to race?”</p><p>Jim was my alpha. The shapeshifter Pack was segregated into seven clans, by the family of the animal, and Jim headed Felidae with a big Jaguar paw hiding awesome claws. He was smart, and strong, and incredibly hot—and the only time Jim noticed my existence was when I made myself into a pain in the ass or when he needed an expert on the ancient Far East. Otherwise, I might just as well have been invisible.</p><p>I raised my head to let Kasen know I meant business. “Jim isn’t the boss of me.”</p><p>“Actually yes, yes he is.”</p><p>It’s good that I wasn’t a wereporcupine, or his mouth would be full of quills. “Are you going to snitch on me?”</p><p>“That depends. When you die, can I have your car?”</p><p>“No.”</p><p>Kasen sighed. “I’m trying to make a point here. I’ve been watching this race for six years now and I’ve never seen anyone crash as much as you. You’re my number-one customer. You can barely see, Dali, and you take stupid chances. No offense.”</p><p>No offense, right. “No offense” stood for “I’m going to insult you, but you can’t be mad at me.” I bared my teeth at him. When it came down to it, he was a rat and I was a tiger.</p><p>Kasen raised his hands up. “Fine. Forget I said anything.”</p><p>The world blinked. The colors turned slightly brighter, the scents grew sharper, as if someone had dialed the picture’s resolution up a notch. A welcome warmth spread through my body—a magic wave had flooded the world. The distant roar of the gasoline engines choked and died. It would take fifteen minutes of chanting to get the enchanted engines to start. The race was dead.</p><p>“What if I take you to dinner?” Kasen said. “I know this really nice place down on Manticore ...”</p><p>Wererats always knew this nice place to eat. They munched constantly or they went twitchy, meaning they suffered attacks of hypoglycemia: cold sweat, headaches, and convulsions, accompanied by nervousness and bouts of aggression. Not fun.</p><p>I squinted my open eye at Kasen. There was no reason for him to offer me dinner. Most likely, he just wanted to butter me up so he could get a shot at Rambo after my demise. Too bad for him—I might not have been the strongest weretiger or the most bloodthirsty, but my bloodline was pretty damn old. Lyc-V, the shapeshifter virus, and my family were good friends, and the levels of virus in my body ran higher than they did in most shapeshifters. The higher the concentration of the virus, the faster the regeneration. Normally higher levels of Lyc-V also meant a greater risk of losing your mind and turning into a crazed loup killer, but so far I hadn’t had to worry about that.</p><p>I was hard to kill. Nothing short of a fiery crash complete with a giant explosion at the end would send me into the afterlife, so if Kasen was hoping to inherit my car, he would get a smoking wreck for his trouble.</p><p>I wrinkled my nose at Kasen. “Thanks, but no thanks. I need to get home.” And get my spare glasses out of Pooki’s glove compartment.</p><p>He heaved a sigh. “Maybe next time.”</p><p>“Sure. Maybe next time.”</p><p>I DROVE THROUGH the tangled streets of Atlanta with the windows down. The wind swirled with scents: a hint of wood fire, a dog marking his territory, horses, one, two, three, four, something tart and spicy ... The streets were deserted. Most people hid at night. The dark was when the monsters came out to play. Even nice monsters like me. Rawr.</p><p>The magic flowed full force, and Pooki, my Plymouth Prowler, made enough noise to shake the gods in their celestial palace. I’d modified him to run on gasoline when the tech was up and on enchanted water when the magic was running the show. Pooki didn’t go very fast during magic waves, and he was so loud he made me wince even with the earplugs, but that was the best I could do.</p><p>About three decades ago, Atlanta was the happening place in the South: all skyscrapers, trendy restaurants, and modern conveniences. Tons of money and people moved through the city. And then the first magic wave hit. Magic ripped through the world. For three days it raged, making complicated technological marvels fail. Planes dropped out of the sky. Satellites plummeted to the ground. Guns jammed or misfired. Electricity vanished and the cities went dark. Three days later, technology returned, but the world was never the same.</p><p>People said the magic came out of nowhere, but my grandmother told me she felt it building for years. It made total sense, considering the historical pattern of the First Shift, the one that was lost in antiquity. Approximately six thousand years ago, Homo sapiens had built a great civilization based solely on magic. It generated so much magic that the balance between technology and magic was permanently disrupted. The world seesawed way over to the technology side to compensate. The ancient civilization suffered an apocalypse, and the human race began rebuilding, this time using technology as its base. Of course, they created a civilization so technologically advanced that the seesaw shifted once again. The magic had to come back and crashed the party. Now it flooded the world in waves, one moment here, eating tall buildings, fueling spells, permitting manifestations, and the next gone. Apocalypse in slow motion.</p><p>It just goes to show that no matter how great a nail you give humanity, we’ll manage to hammer it into the ground crooked. We suck. It’s the nature of our species.</p><p>My house sat in a large wooded lot, all by its lonesome. The street to the left led to a ruined apartment building, now little more than a heap of rubble, and the neighbors to the back of me had fled the city a long time ago. I bought their land for a grand before they took off, busted the house up, hired contractors to build me an extra-tall privacy fence, and now I had an awesome backyard. With the trees and the fence, I could even go out in my natural form, roll around in the grass, and nap in the sun without anybody pointing and yelling, “Hey, look, a white tiger!”</p><p>I maneuvered Pooki into my driveway, got out, raised the garage door, and carefully eased the vehicle inside. Of all the cars I ever had, the Prowler was my favorite. I loved the Indy-style wheels. That’s why I never raced it. As much as I hated to admit it, Kasen was right—I wrecked. A lot. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I lowered the garage door and stepped into my kitchen. A scent floated past me on the draft. I inhaled it and froze. It smelled of sandalwood and amber, spiced with a hint of tangy sweat and male musk. A shiver dashed down my spine, setting every nerve on high alert.</p><p>Jim.</p><p>The masculine fragrance filled my house, screaming, “Mate!” at me so loudly that I held my breath for a second to get a grip.</p> <p>Jim was here, waiting for me. In my wildest dreams, I would walk into the room and he would kiss me. The picture was so vivid in my head, I shivered. It would never happen. Come on, ugly blind girl, snap out of it. Let’s try to be less pathetic. Jim was here because Kasen snitched on me, or because he needed some obscure scroll identified. He wasn’t here to make my sad little dreams come true.</p><p>I marched into my living room. “Jim?”</p><p>No answer.</p><p>The scent was hot and alive. He was still here, or he had been here just a second ago.</p><p>“Jim? It’s not funny.”</p> <p>Nothing.</p><p>Fine. I followed the scent, moving softly on my toes. Living room, hallway, bathroom, bedroom. The scent sparked here. He was in my bedroom.</p><p>Oh my gods. What if I walked in and he was naked on my bed?</p><p>I would lose it. I would lose it right there and never get it back, whatever “it” was.</p><p>Get a grip, get a grip, get a grip. I padded into the bedroom.</p><p>Jim slumped against the wall on the floor. His eyes were closed. He wore black jeans and a black turtleneck, a couple of shades darker than his skin. His black hair was cut short. His leather jacket lay on the floor in a heap. Asleep.</p> <p>I tiptoed into the room and crouched by him.</p><p>He looked so peaceful here. Usually Jim scowled, just to remind people that he was Serious and Important and would Kick Your Ass if Necessary. But right now, with his head tilted back and his face relaxed, he was beautiful. I wanted to sit on the floor next to him and snuggle up into the crook of his arm. It looked like the perfect spot for me. Instead, I sighed and touched his forehead with my finger. “Hey, you. Wake up.”</p><p>He didn’t move.</p><p>Odd. Usually Jim woke up if a pin dropped half a mile away. Most shapeshifters did, but Jim especially. He oversaw security for the Pack and he exhibited paranoid tendencies. The only time he would pass out like this was when he was injured or exhausted from changing too many times and Lyc-V shut his brain down to conserve resources and make repairs. I smelled no blood and Jim’s clothes were still on. But if he had passed out after shifting, he’d be on my floor ... naked. I closed my eyes and gave myself a mental shake.</p><p>Something was wrong.</p><p>I grabbed his shoulder and shook him. “Jim! Wake up. Wake. Up.”</p><p>His eyes snapped open. His dark hand grabbed my wrist. “Was I asleep?”</p><p>“Yes.”</p> <p>“Fuck.”</p><p>He surged off the floor, dark eyes pissed off. “You were gone. Dali Harimau, where were you?”</p><p>I stood up and crossed my arms over my chest. It wasn’t much of a chest, so crossing my arms was easy. “I was out. You’re not my daddy, Jim. I don’t have to check in with you before I leave my house.”</p><p>A green sheen rolled over Jim’s eyes. “Dali, where were you?”</p><p>He had pulled the alpha card. You didn’t argue when his eyes lit up. “I was racing on Buzzard. There. Happy now?”</p><p>He exhaled. “Good.”</p><p>Good? Since when was my racing good? “You’re not making any sense.”</p><p>“You didn’t check your messages?”</p><p>“No, I just got home.”</p><p>“So you didn’t go to the house?”</p><p>“What house? I told you I just got home.”</p><p>Jim’s eyes dimmed. He rubbed his face with his hand, as if trying to wipe something off. “I need your help.”</p><p>JIM SAT IN my kitchen, staring at a cup of hot ginseng tea like a demon was hiding inside.</p><p>“Drink it. It’s good for you.”</p><p>Jim gulped it down. “It tastes awful.”</p><p>If I were a guest and turned up my nose like that at the tea my hostess served me, my mother would tell me I had shamed the family. “It’s as though you have no manners. I offer you a gift of tea and you make funny faces at it.”</p><p>“Do you want me to lie and tell you it tastes great?”</p><p>“No, I want you to say ‘thank you’ and tell me what’s going on.”</p><p>“I’m not sure.” Jim’s face was grim. “The northeastern office on Dunwoody Road didn’t report in on Tuesday. I was out doing other things, so Johanna waited twenty-four hours and sent a scout in to check on them. He came back disturbed. I talked to him this morning. He claimed ‘something bad’ was in the building and he wasn’t going near it.”</p><p>“Who was it?”</p><p>“Garrett.”</p><p>Garrett was lazy, but he wasn’t a coward. Maybe there was something bad in the house. “You went there yourself, didn’t you?”</p><p>Jim shrugged. “I had to go that way for an errand anyway.”</p><p>I rolled my eyes. “You didn’t take anybody with you?”</p><p>He looked at me like I had insulted him. Mr. Badass didn’t need anybody to go with him, oh no.</p><p>“What happened?”</p><p>“I went to the office. The place looked empty. The windows were covered with dirt, like nobody had been there for years.”</p><p>Jim and I looked at each other. The Pack had seven offices in Atlanta and the surrounding area and every single one of those would have clean windows. Normal people looked at us like we were filthy animals. The animal part was true, but most of us were sensitive about the filthy part. If you wanted to insult a shapeshifter, you told him he stank. We kept ourselves and our offices clean. Besides, you can’t see angry mobs with pitchforks and torches coming at you through a dirty window.</p><p>“I went up to the door.” Jim looked at his cup. “The place smelled wrong. A weird scent, dusty, pungent, and bitter, not something I’ve ever come across before.”</p><p>“Like herb dust?”</p><p>“No, that wasn’t it. Not anything I recognized. And it was too quiet. There should’ve been four people at the office. Not a damn whisper, no sigh, no sound, nothing.”</p><p>Roger worked at that office. And Michelle. I liked Michelle; she was nice.</p><p>“I opened the door and smelled blood. The place was empty. There was a symbol on the floor in magic marker.”</p><p>“What kind of a symbol?”</p><p>He shook his head. His eyes turned distant. If I didn’t know better, I’d say he was confused, except Jim didn’t get confused.</p><p>“A Chinese symbol,” he said slowly.</p><p>“Like a sinograph? Hanzi?”</p><p>Jim gave me a blank look.</p><p>“Did it look like Chinese writing, Jim?”</p><p>“Yes.”</p><p>I got up and brought him a piece of paper and a pen. “Draw it for me.”</p><p>He picked up the pen and looked at it.</p><p>“Jim?”</p><p>He growled under his breath. “I can’t remember.”</p><p>The hair on the back of my neck rose. Jim didn’t have perfect recall, but he was very close. He practiced, because remembering details was a useful skill for the chief of security. I once watched him draw a complicated tribal tattoo he saw for two seconds completely from memory. He got it nearly perfect. A hanzi character on the floor in the middle of an office smelling of blood—he should’ve remembered it. The symbols weren’t that complicated. Something had fried his memory.</p><p>“What was next?”</p><p>“I called you.”</p><p>We both looked at my answering machine. The screen was dead—the magic had taken down the electricity. No way to tell if Jim had called me.</p><p>A green glow sparked in his irises and vanished. Frustration rolled off Jim in a hot wave. He was acting like a person with a concussion, but Lyc-V cracked concussions like nuts. I ought to know, I had gotten enough of them. Thirty seconds, and your brain was like new. Still ...</p><p>“Do you think someone might have whacked you on the back of the head?”</p><p>Jim looked at me for a long moment.</p><p>“Sometimes trauma to the head results in short-term memory loss.”</p><p>“Nobody traumatized my head. Nobody quiet enough to sneak up on me would be strong enough to knock me out. I wasn’t knocked out, I passed out.”</p><p>Huh. “Passed out?”</p><p>“Yes.”</p><p>“What do you remember before passing out?”</p><p>“The magic wave hit. I saw a woman.”</p><p>“A woman?” Great, now I’ve turned into a manga character who repeated everything everyone said.</p><p>“I saw her in the house.”</p><p>“What did she look like?”</p><p>“She was very beautiful.”</p><p>It stung like a slap. “Jim!”</p><p>“What?”</p><p>Yes, what, Dali? What exactly? “When did you see her? What was she wearing? Concentrate.”</p><p>He shook his head. “I was in the doorway. I looked up and she was standing at the back of the room. She was wearing some sort of a long robe or gown. The fabric was almost transparent, like a negligee.”</p><p>And he probably took a second to look at her boobies. Awesome.</p><p>“She had long dark hair. I told her to come outside. She said, ‘Help me.’”</p><p>“In English?”</p><p>He nodded. “She started backing up into the house and I went after her.”</p><p>“Four shapeshifters are missing, the office smells like blood, you see some weird woman in a transparent gown who clearly shouldn’t be in the building, and you run after her?”</p><p>“It’s my job to run after her.”</p><p>“Without backup?”</p><p>“I am the backup.”</p><p>I waved my arms. “Fine, what happened next?”</p><p>“I remember my legs getting heavy and thinking that something was wrong. Then I woke up in the middle of the floor.”</p><p>“How long did you sleep?”</p><p>“Eighteen minutes. I woke up tired as hell. I knew I’d pass out again if I didn’t leave, so I got up, locked the door, and got the hell out of there. I knew I’d called you and I thought you might go to the house. The magic was up, so I ran over here, got inside with my key, but you were gone. I went to the bedroom to see if your calligraphy kit was still here, because I knew you would’ve taken it, and then I don’t remember.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And then he’d fallen asleep on my bedroom floor. “Do you feel any different?”</p><p>“I feel tired.”</p><p>“Right now? Even after sleeping?”</p> <p>He nodded.</p><p>Jim could go forty-eight hours without sleep and still be as sharp as his claws. That was one of the fun gifts of Lyc-V: improved stamina, immunity to diseases—and crazy homicidal rage, just to spice things up. Something was seriously wrong. If it had been a typical curse, my magic would’ve purged it by now. He had to go to the medic. “We need to see Doolittle.”</p><p>“No. No Doolittle.”</p><p>“Jim, you keep falling asleep.”</p><p>“Doolittle is a surgeon.” Jim bared the edges of his teeth. “If he can’t cut it out or stitch it back together, he doesn’t know what to do with it. I have no symptoms. Pulse rate is normal, temperature is normal. I just fall asleep. You’re Doolittle. I come to you with this story. What’s your first move?”</p> <p>“Lock you up for observation.”</p><p>“Exactly. I don’t need to be locked up.”</p><p>“How do you know something isn’t interfering with your regeneration?”</p><p>Jim pulled a knife from his waist sheath so fast I barely saw it. The bluish metal flashed, slicing across his forearm. Blood swelled. The scent hit my nostrils, sending goose bumps over my arms. As I watched, the cut knitted itself back together, the skin and muscle flowing to repair the damage. Jim wiped the blood from his skin and showed me his forearm. The thin line of the scar was already fading.</p><p>“I’m not sick and my virus is working. Whatever this is, it’s magic. Four of our people are missing, and you’re the only magic user I have. I can’t just leave them in there.”</p><p>“They might be dead.”</p> <p>“If they’re dead, we need to know.” He leaned forward, his brown eyes looking straight into mine. “Help me, Dali.”</p><p>He had no idea, but when he looked at me like that, I would’ve done anything for him. Anything at all.</p><p>I got up. “Let me get my kit. We need to go see that house.”</p><p>THE NORTHEASTERN OFFICE of the Pack sat on Chamblee Dunwoody Road, well back from the road behind a carefully cut lawn. Tall pines framed it on three sides, with four picturesque trees shading its parking lot. To the right, another copse of pines bordered a large open field converted into pasture. To the left, behind the buffer of greenery and a chain-link fence topped with coils of razor wire, rose short stubby apartments. The guard at the gate gave us a nasty look as we thundered on by and clutched at his crossbow just in case. Silly man.</p><p>I steered the Prowler up the curving drive to the office’s lot, parked, and shut off the vehicle. The enchanted water engine took at least fifteen minutes to warm up, but leaving it running made no sense. The engine made so much noise I had trouble thinking. Besides, Pooki’s top speed during magic barely scraped fifty miles per hour, and if we had to bail, both Jim and I could run much faster than that.</p><p>We stepped out into the night. Painted an ugly olive color, the office looked like two separate buildings had been jammed together: The left half resembled a ranch house while the right was a two-story Queen Anne with green shutters.</p><p>The wind brought with it a salty metallic scent that burned my tongue. Blood. Jim bared his teeth at the building.</p><p>I closed my eyes and concentrated, trying to sense the magic. In my head, the house turned dark. Long translucent tentacles of magic slivered from inside it, sliding back and forth over the walls, out the windows, over the roof, clutching at the siding and tiles.</p> <p>I pushed a tiny step farther. The closest tentacle rose, hovered above the roof for a long moment, and snaked over to us. Magic lashed at me in an icy wave, fetid, terrible magic. I didn’t know what it was, but every cell in my body shrank from it. My eyes snapped open and I jerked back.</p><p>Jim caught me from behind. “What is it?”</p><p>The house looked mundane again, just a drab olive building. I swallowed. “We’re going to need protection. Lots of protection.”</p><p>I set my wooden box on Pooki’s hood and flipped it open. Jim peered at the calligraphy set inside. Most shapeshifters didn’t do magic, because we were magic enough as it was, and most didn’t trust magic. I totally understood why. Magic was iffy, but claws and fangs produced the same result every time. However, I was born to a long line of magic users, so concerned with tradition that they passed on their knowledge and rituals even when technology was at its strongest and almost no evidence of magic remained. My family took my education very seriously.</p><p>Half of the time my magic didn’t even work, but Jim had seen me pull it off once or twice. It’s not that he was impressed—he was far too cool for that—but Jim treated my talent with respect. He was in trouble and he trusted me to get him out of it. I had to step it up.</p><p>Jim nodded at the house. A pale yellow light appeared in one of the upper-floor windows, as if someone held a candle up to the glass.</p><p>“Isn’t it cute,” I murmured. “It’s saying hello.”</p><p>Jim smiled at the light. The only time a jaguar showed you his teeth was when he was about to sink them into you.</p><p>I pulled two thin strips of hanshi paper out, dipped my brush into the ink, and wrote the string of characters for general protection on each piece.</p><p>The ink shimmered a little in the moonlight. I held my breath.</p><p>Please work. Please, please, please work.</p><p>The magic snapped, sparking through the paper. I exhaled and tossed one strip at Jim. The paper sliced through the air, stiff like a blade, and stuck to his chest. He stared at it.</p><p>“Don’t mess with it. It’s a defensive spell.” I tossed the other piece of paper in the air, stepped toward it, and it adhered to me, over my left breast. “Let’s go.”</p><p>Jim pondered the little piece of paper. “You want me to go back into that house protected by a magic sticky note?”</p><p>“Don’t even start,” I told him. “It’s working. If it weren’t working, you couldn’t drag me into that place.”</p><p>“What did you write on here? ‘Don’t die’?”</p><p>“No, I wrote, ‘Don’t be an a-hole!’” I headed for the house.</p><p>“On yours or mine?”</p><p>“On yours.”</p><p>“Well, in that case, your magic isn’t working. I’m still an asshole.”</p><p>Grr, grr, grr.</p><p>Twenty feet to the house. A shiver shook me and I clenched my teeth. You can do it, White Tiger. Don’t be a wuss.</p><p>Fifteen feet. I could see it now, the translucent mess of sliding tendrils, ready to grab us, like a nest of colossal dark snakes about to strike. The bad magic would hit us any second.</p><p>Ten feet. The tentacles rose as one.</p><p>Screw it. I reached over and grabbed Jim’s hand. His fingers closed on mine, warm and strong.</p><p>The magic shot toward us. I clenched Jim’s hand. The paper on my chest sparked with pale blue and the tentacles fell away, as if singed by fire.</p><p>Oh gods. Oh phew. My heart pounded in my chest at about a million beats per minute. Pheeeww. Okay, alive. Alive is good.</p><p>I realized I was still clutching Jim’s hand like a moron and let go. He was looking at me. “Is everything cool?”</p><p>“Mhm.” I nodded, my voice a little too high. “Everything is great. Let’s go.”</p><p>We walked between the tendrils of magic to the door. A long scrape marked the dark green paint, exposing steel underneath. I could tell by Jim’s face that he didn’t remember it. We both leaned close and sniffed.</p><p>Smelled like paint.</p><p>Jim tried the handle. It clicked under the pressure of his thumb. The door swung open slowly, revealing a gloomy large room, as if the house had yawned and we were staring straight into its maw.</p><p>He said he had left the door locked and I knew he would have.</p><p>Jim stepped through the doorway and I followed him.</p><p>The inside of the house smelled wrong: hot and sharp with an undercoating of dust, like rusty iron scrap left to bake in the sun. Through it floated the stench of burned coffee and a faint scent of blood, fouled with a hint of decomposition. The blood was old, at least twelve hours, probably more.</p><p>The front of the room lay empty. Ahead, a large counter cut the room nearly in a half. To the right, a small stove supported a teakettle and a coffeepot. Gloom pooled in the corners, and if I squinted just right, I could see the faint tentacles of magic snaking their way in and out of the walls.</p><p>Jim skewed his face in a silent growl, stalked over to the counter, and leapt on it, landing with easy grace. He did it in absolute silence.</p><p>Wow.</p><p>I would’ve given anything to be able to match him, to be sleek and elegant, like a supple phantom. But no, even in my animal form, I was a klutz. The change dazed me and it took me about two minutes to figure out where I was or why. It took Jim about two seconds to kill something. If we both shifted in the middle of a room full of ninjas, by the time I could see straight, they would all be dead and Jim would be wiping blood from his hands.</p><p>All my life I was told I was special, the mystical white tiger. Guardian of the West, King of Beasts, Lord of Mountains, Slayer of Demons. Majestic of bearing and fierce in battle. The irony was thick enough to swim through.</p><p>Jim pointed at the floor. I looked down. Gashes scored the wood, digging deep into the floorboards. Something had clawed the floor, something large and powerful. Here and there small sections of black marker lines peeked from under the scratches, but no force on earth could decipher what had been written there.</p><p>I glanced at Jim and shook my head. He jumped down and I followed him deeper into the house. We passed a small file room on the right, separated from the counter by a partition. If people had died here, something must’ve taken their bodies.</p><p>The doorway to the stairs waited, a darker rectangle in the dark wall. I took a step forward. Magic washed over me, bad, terrible magic, smelling of death and blood and corpses, as if someone had taken a piece of ice and dragged it from the base of my neck all the way down my spine. The paper on my chest shivered. I froze, trying to catch every tiny noise, every hint of movement. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jim was looking at me.</p><p>“Bad,” I mouthed, letting him read my lips. “Bad magic.”</p><p>Above us the ceiling creaked. We looked at it.</p> <p>Another creak. Something heavy moved across the floor over our heads.</p><p>Jim pushed ahead of me and we padded up the wooden steps upstairs.</p><p>THE STAIRCASE WAS narrow and Jim’s muscular back took up most of it. I gave him a couple of feet to make sure he had room to strike if we ran into something unpleasant.</p><p>Magic saturated the staircase. It dripped from the rail in long viscous droplets, it slimed the steps, it boiled in long coils along the wall so thick and potent I wished I’d brought a rain slicker. Now, that was a totally irrational thought. It seemed insane Jim couldn’t see it, but I knew he couldn’t.</p><p>We reached the landing. A hallway ran perpendicular to the staircase, and right across it, a doorway was lit by a pale yellowish glow. I smelled lamp oil.</p> <p>Jim paused for one long second on the upstairs landing and strode on, through the hallway into the room. I padded after him.</p><p>A lone lamp burned on the floor at the far wall, illuminating a naked woman, who sat cross-legged on the grimy boards. Her dark honey hair hung in ragged strands down her back. I inhaled, sampling her scent. Michelle. But the scent was wrong. A living scent is hot, vibrant. This was a cold odor, laced with traces of toxic stenches: feces, a touch of urine, and a revolting patina of putrescence, like a meat broth left out for too long. Degrading amino acids. I’ve smelled this nauseating cocktail before: cadaverine, putrescine, and a dose of indole for good measure. My eyes told me Michelle was alive and sitting in front of me. My nose told me she was dead and had been so for at least two days. I trusted my nose. It never lied.</p><p>Jim pulled a knife from his sheath. It was his giant G.I. Joe knife, dark gray with a wicked curved tip and a serrated edge near the handle.</p><p>Michelle turned and looked at us. Her eyes were empty. Dead eyes, like two dark holes in her head. And I had really liked her, too.</p><p>Behind Michelle, another body lay in the corner on its side, long dark hair fanned out on the filthy floor like a black veil. Roger, a werelynx. Dead as well.</p><p>Michelle’s left arm jerked up and forward, resting on the floor. Her right followed, like she was a puppet on a string.</p> <p>“What do you want?” Jim’s voice was a low snarl. That’s why Jim was in charge. I didn’t have to explain that something was controlling the dead. He figured it out all on his own and wasted no time on being weirded out by it.</p><p>Michelle’s body turned, flipping her into a crouch.</p><p>Many things controlled the dead. I had to figure out who pulled the strings, before I could try a curse. Think, Dali, think.</p><p>“Any advice?” Jim asked, his voice casual.</p><p>“Keep her busy, so I can figure this out.”</p><p>Michelle’s mouth gaped open, showing dark nasty teeth.</p><p>“And try not to get bit.”</p><p>Michelle launched from her crouch, hands outstretched, fingers like claws. Jim lunged at her. He grabbed her arm, the knife sliced in a furious arch, and Jim hurled Michelle across the room into the wall.</p> <p>I clenched my calligraphy brush. This thing could’ve sent Michelle at us the moment we stepped through the door. But no, it taunted us from the window with the light. It made the ceiling above us creak on purpose.</p><p>Michelle rebounded from the wall, flipping in midair, kicking at Jim. He sidestepped, but she was fast. Her nails raked his chest with unnatural strength, ripping through clothes. Blood swelled through the tears. Jim grabbed her arm and twisted, his knife biting deep into Michelle’s shoulder. Something crunched and Michelle’s arm came away in Jim’s hand—he’d cleaved the ball joint from the socket. Like cutting a wing from a chicken.</p><p>Michelle spun around. No blood spilled from the cut. She bared her teeth and lunged at Jim again, swiping at him with her remaining hand. Michelle was a jackal. They didn’t claw, they bit.</p><p>He’d have to mince her into tiny pieces before she’d stop.</p><p>Something chuckled in the corner, where the magic knotted into a dark bramble. It was laughing at us. Playing a game, a cruel game.</p><p>Michelle clawed at Jim.</p><p>Just like a cat.</p><p>I began drawing my kanji. “Kill her now, please.”</p><p>Jim jerked Michelle down. He cut in a vicious swipe and her head plunked down on the floor.</p><p>A dark shape coalesced from the knotted magic in a blink and leapt over Roger’s corpse. I hurled my curse at it. The rigid white strip hit it between the eyes. Magic pulsed and I saw yellow cat eyes glowing like two moons at me from a round fur face.</p><p>Roger rammed into Jim.</p><p>The cat beast leapt in a blur, straight at me. The huge body knocked me off my feet. I flew and the back of my head bounced off the boards.</p><p>The cat clamped me down, its weight crushing my chest. A dark feline mouth gaped at me, exhaling fetid breath into my face. Pain punctured my shoulders like red-hot needles. I tried to snarl, but I had no air and only a small squeak came out.</p><p>The black mouth bit down. The kanji on the white piece of paper flared with green.</p><p>The paper burst into a dozen strips. They shot outward, jerking the cat off of me.</p><p>I blinked, trying to suck in a breath. Jim leaned over and thrust his hand down to me. I grabbed it and he pulled me up. Roger’s corpse, broken and twisted, crumpled on the floor. Above it, a long feline body hung about two feet off the ground, wrapped in long strips of paper. It was six feet long and shaggy with orange and white fur, a house cat that had somehow grown to a leopard size. The strips adhered to the walls and ceiling, clutching the cat like the wrappings of a mummy.</p><p>The beast wasn’t moving. Two paper strips had caught its throat in a makeshift noose. Its head hung limp, mouth open, a long tongue sticking out of the corner of its mouth. The yellow eyes, once glowing with bloodlust, were dull now.</p><p>I swallowed. My mouth tasted bitter. The cat monster was dead. My hands trembled from adrenaline. I had screwed up.</p><p>“WHAT THE HELL is that?” Jim asked. His voice was calm. His hands didn’t shake. Cool as ice. Why couldn’t I be more like that?</p><p>I sniffed, trying to hide the trembling. “Two tails or one?”</p><p>Jim took a step to the cat and lifted two long furry tails.</p><p>“It’s a nekomata,” I said. “A yokai.”</p><p>Jim gave me a blank look.</p><p>“The yokai are Japanese demons.” I rubbed my face. “Legends say that if a cat’s tail isn’t cropped and some other conditions are met, it has a chance to become a bakeneko, a demon ghost cat. Bakeneko cats grow to a huge size and get supernatural powers. Sometimes their tails fork and they become nekomata, demon monster cats. They have the power to control the dead, take on human form, and can do some nasty things.”</p><p>“Do they have the power to put people to sleep?”</p><p>I knew he’d get around to that sooner or later. “No. It’s possible that the woman you saw was a nekomata in disguise, but it’s not likely. She had you and she let you go. The nekomata is a cat, Jim. It’s cruel and mean, and it likes to play games, but you know yourself, the prey never gets away. This”—I waved my arms around—“is complicated. Too complicated for a demon cat. They mostly set fires, steal corpses, and walk around in human clothes, pretending to be your elderly mother so they can get free grub. There is magic here, really bad magic. It kind of scares me. The nekomata is dead, but the magic is still here. Something else is going on. This isn’t over.”</p><p>Jim tapped one of the paper strips with his knife. The strip didn’t give. “And this?”</p><p>“This is the curse of twenty-seven binding scrolls.”</p><p>Jim slashed at the paper strip. The paper held. Jim scowled. “How the hell ...”</p><p>Kate, one of my friends, always said that the best defense is a good offense. “Before you say anything, yes, I know that the curse didn’t function as expected and I know that it would’ve been better to have the nekomata restrained so we could question it, and I was trying to do that, but it’s not like it’s an exact science, and how was I supposed to know that the binding scrolls would choke the stupid demon to death? So you don’t have to tell me—I know! You try guessing some weird creature’s identity and writing calligraphy while it’s trying to bite your nose off and then don’t come crying to me.”</p><p>And that didn’t make even a tiny bit of sense. I was an exceptionally smart woman. Why did Jim always reduce me to some sort of ditzy bimbo idiot?</p><p>“I was going to say, how the hell did you pull that off,” Jim said. “You made paper with the tensile strength of steel out of nothing. The physics of this makes my brain hurt.”</p><p>“Oh.”</p><p>“And I would’ve said it and some other nice things, except that you jumped in my face and started sputtering and waving your tiny fists around.”</p><p>“Tiny fists?”</p><p>“That’s the root of your problem right there. You always rush into things looking for a fight. You’re like one of those First Responder magic cops: Ride in, kill everything, and then sort bodies into two piles: criminals and civilians.”</p><p>My face turned hot. My body was pumping out all sorts of angry, upset hormones. He was chewing me out like I was a child. I was this close to going furry, except it wouldn’t do me any good.</p><p>“If you take a tenth of a second to check if the fight you’re charging into isn’t there, it would save you a lot of grief.”</p><p>He didn’t get it and he would never get it. “Are you finished?”</p><p>“Yes.”</p><p>“Good.” I turned away from him and crouched by Roger’s body. Roger’s head hung in a weird angle, and both of his arms bent in places where no joints existed. Jim had broken him like a twig.</p><p>“What is it?”</p><p>You’re so special, why don’t you tell me, Mister Always Look Before You Leap. I dragged my finger against Roger’s skin. It came away with a powdery gray residue. I showed my finger to Jim. “I’m pretty sure normal corpses don’t do that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I saw that,” Jim said. “Michelle was slippery, too.”</p><p>I rose. “We need to search the house.”</p><p>We combed the house. We found no sign of the two other shapeshifters: Neither Mina nor August had been in the house for at least thirty-six hours. Their scents were old. I swiped the log from the front office and we escaped.</p> <p>Outside the cold night air swept along my skin, washing away the nasty magic. I headed straight for Pooki and opened the log on the hood. Four different types of handwriting filled the pages. The last entry was three days old. I flipped back a month and scanned the entries.</p><p>“Are you actually reading this or just flipping pages?”</p><p>“Jim? Shush. I need to concentrate.” Shift changes, notes on shapeshifters caught in the city for one reason or another crashing at the house, routine, routine, routine ... Mina’s entries identified different types of herbal tea she drank during her shift. Roger documented the patrol routes of three neighborhood cats, complete with battles for territory and places where they chose to mark it.</p><p>I kept turning the pages, and when I finally saw it, I almost didn’t realize it. Thursday before last, August failed to come in for the shift change. The log showed him signing in fourteen hours later. His ps, gs, and ys showed longer vertical strokes than usual. I ran my fingers on the other side of the page and felt the outlines of the letters. August had pressed too hard on the paper. He was excited when he signed in, confident, angry, maybe determined. His reason for the failure to show up read “overslept,” which made no sense considering the amount of pressure he put on the page. There was something grim about the way he wrote, as if he’d etched each letter into the paper.</p><p>I tapped the page, thinking. A nekomata was a Japanese monster. August was half Japanese, half white by birth, but American culturally. He couldn’t read kanji, and his Japanese was terrible. Atlanta had a large Japanese population, with its own school and stores, a place where American customs didn’t apply. August visited his family there, but he never quite got the Us and Them mentality, and being a halfer, he was looked down on. A few months ago he told me that one of his cousins was gay. August had gone to pick up the thirteen-year-old kid at Japanese school to take him to a family gathering and he’d seen the boy sit on his friend’s lap after recess. I had to explain that it was a cultural thing that didn’t indicate anything about his cousin’s sexuality, but it just didn’t compute from his Southern guy point of view. He didn’t completely believe me either and told me that if anyone ever picked on his cousin, he’d break their legs.</p> <p>Magic tended to stick to nationality and region. People generated magic, and their superstitions and beliefs channeled it. If enough people believed that a certain creature existed and, worse, took precautions against it, eventually the magic birthed it into being. If you had an area densely settled by Irish, you got banshees. If you had Vietnamese settlers, sooner or later ma doi, the hungry spirits, would be haunting the streets. And if you had a Japanese community, you would get yokai, demonic creatures.</p><p>The residue on Roger’s skin really bothered me. Either the top layer of his skin had turned to dust, or he’d been liberally powdered with something. No creature I could think of could do that to a body.</p><p>Of the four people in the office, August would be the most likely to come into contact with a Japanese legend. We had to retrace his steps.</p><p>I flipped the pages. The entries were becoming shorter, more erratic. On Saturday some of them looked unfinished, as if the writer had simply stopped in the middle of a sentence. Sunday had no entries. There should’ve been some. On Monday, a single entry written in Michelle’s neat handwriting read, Can’t stay awake. Help. m.</p><p>Oh shit. Oh shit, oh shit, oh shit.</p><p>“We need to go to August’s place. We need to figure out why he was out on Thursday.” I looked up.</p> <p>Jim was asleep leaning against the car.</p><p>“Jim!”</p><p>No response. I grabbed him and shook his shoulder. “Wake up! Wake up!” He slid to the ground, still asleep. I slapped his face. He didn’t move.</p><p>I pulled Pooki’s door open, popped the trunk, jerked the extra gallon can of enchanted water out, and dumped it on his face.</p><p>The water poured. Come on, come on ...</p><p>Jim coughed and shook himself.</p><p>I dropped the can and grabbed his shoulders. “Wake up!”</p><p>Dark eyes looked at me. “I’m awake.”</p> <p>“Don’t fall asleep! Don’t fall asleep, you hear?”</p><p>He growled and pushed off the ground. “I’m okay.”</p><p>No, he wasn’t okay. We were in trouble. We were really, really in trouble. I paced back and forth. My heart was beating so fast it felt about to explode. Something was wrong with my Jim and if I didn’t fix it now, he would end up like Roger, a dry cadaver full of nasty magic.</p><p>“Calm down,” Jim said.</p><p>“I am calm! Get in the car.” Emergencies called for desperate measures.</p><p>He got in. I flopped into the driver’s seat and chanted the engine into life, watching him like a hawk. He stayed awake. I dropped the parking brake and gunned it out of the parking lot. “Roll the window down,” I yelled over the roar of the engine. “You need wind on your face.”</p><p>“Where are we going?” he roared back.</p><p>“To see my mother!”</p><p>MY MOTHER LIVED in a small cluster of apartment buildings in Riverdale. It took me more than an hour to drive over there through the crumbling city, and the entire time I watched Jim out of the corner of my eye. I punched him in the arm a few times to make sure he stayed awake. After the first eight times he told me to quit it.</p><p>I maneuvered down the smallish road and into the horseshoe formed by the squat two-story townhomes and parked in front of my mother’s house. The pale blue light of her fey lantern filtered through the window. I climbed out. Jim already waited by the door, surveying the houses.</p><p>“Why are those three buildings facing to the left?”</p><p>“Because this is an Indonesian community, mostly older people who practice magic. They’re more superstitious than usual. It’s bad luck to build a house facing north. Some people believe it will make you poor. The subdivision street was already laid out when people moved in, so those three families chose to build their houses facing east.”</p><p>“Aha.”</p><p>“It’s bad luck to build a house facing a field, it’s bad luck to have the kitchen face the front door, and it’s bad luck to build a fence taller than six feet. This is just the way things are, Jim. Just go along with it.”</p><p>“Your fence is taller than six feet.”</p><p>I turned to him as I walked. “I didn’t say they were my superstitions. But they’re important to my mother.”</p><p>We headed to the door. The familiar scents washed over me: rice, onion, chili peppers, cumin, coriander. Mom was cooking nasi goreng, fried rice. I was home.</p><p>Help me.</p><p>Jim sampled the wind. “It’s past one. Does your mother usually cook after midnight?”</p><p>“No, it’s special for me. She sensed us coming.”</p><p>I raised my hand to knock on the door. Before my knuckles touched the wood, it flew open and my mother clamped me in a hug. Looking at her you could tell exactly how I would look in thirty years or so: tiny, skinny, dark, quick to move.</p><p>“Why are you so dirty?” My mother pulled a cobweb out of my hair. “What is happened? Come inside. Who is this man?”</p><p>Here we go. I took a deep breath and walked in. “This is Jim.”</p><p>Jim stepped inside.</p><p>My mother shut the door and peered at him. “He is dark. Very, very dark.”</p><p>Jim grinned, showing a tiny edge of his teeth.</p><p>I felt like slapping myself. “Mother!”</p><p>“What is it you do?” She leaned over to Jim. Her accent was getting thicker. “Do you have money?”</p><p>“He is my alpha. He’s in charge of the whole Cat clan. Very important.”</p><p>My mother’s eyes sparked. Oh no.</p><p>She leaned over and patted Jim’s hand. “That is so nice. My daughter is so smart. Always respectful and well behaved. Never any trouble and she does as she is told.”</p><p>“You don’t say,” Jim murmured.</p><p>“Doesn’t spend a lot of money. Two doctor degrees. Little problem with her eyes, but that’s her father’s side of the family. Very rare magic, a white tiger. One in seven generation. Very special. She can cure evil eye with a touch. And if you had your house cursed, she can purify it for you. Everyone respects my daughter. All our people know her.”</p><p>Jim nodded to her with a solemn look. My stomach lurched. I felt like throwing up. “Mother ...”</p><p>She nodded to Jim, as if sharing a grave secret. “And she’s a good cook, too.”</p><p>Jim leaned a little toward her, his face deadly serious. “I’m sure she is.”</p><p>My mother smiled, as if he’d given her a diamond. “Best match. Of all the girls, mine is best match.”</p><p>Aaaaa! “Mother! There is something wrong with him. He’s magic-sick.”</p><p>My mother stood up on her toes and peered at Jim’s eyes. For a long moment they were eye to eye, my short mother and tall, muscular Jim, and then she switched to Indonesian.</p><p>“Let him go.”</p><p>“No.” I shook my head.</p><p>“He is strong. Very good in the body. But you must find another one.”</p><p>“I don’t want another one! I want him.”</p><p>“He’s dying.”</p><p>“I have to save him. Please help me. Please.”</p><p>My mother bit her lip and pointed at the chair. “Sit.”</p><p>Jim sat. She leaned over and pulled his right eye open with her fingers, examining the iris. “Something is eating his soul.”</p><p>“I figured that out. But I can’t see it.”</p><p>Mother sighed. “I can’t see it either. Until we see it, we can’t do anything about it. We need Keong Emas.”</p><p>The Golden Snail. My heart dropped. My legs gave out and I landed on the couch. The only place we could get a golden snail would be in Underground Atlanta. It used to be a shopping district in Five Points, where all the big buildings stood before the Shift. The Underground started out as a big train depot in the mid-1800s with shops, banks, and even saloons, but eventually the city had to build viaducts over the railroad tracks for the car traffic. The viaducts ran together until a good portion of the train tracks, the shops, and the depot were underground. Before the Shift, it used to be full of little bars and shops. Once the magic hit, the shop owners fled and the black market moved in. The mob-sponsored traders had burrowed deep, cutting tunnels running from their shops right into the ruined Five Points and Unicorn Lane, where the magic ran wild and no sane cop would follow them. Now the Underground was a place where you could buy anything if you were desperate enough. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Is there any other way?”</p><p>My mother shook her head. “Don’t even think about it. You can’t go to the Underground.”</p><p>I exhaled, blinking. “We don’t have any choice.”</p> <p>My mother made a short cutting motion with her hand. “No!”</p><p>“Yes. We need to buy the snail.”</p><p>My mother drew herself to her full height. I stood up and did the same.</p><p>“No, and that’s final.”</p><p>“You can’t keep me from doing it.”</p> <p>“I am your mother!”</p><p>Jim opened his mouth. “Mengapa?”</p><p>Oh my gods.</p><p>He spoke Indonesian.</p><p>My mother’s eyes went wide and for a second she looked like a furious cat. “He speaks Indonesian!”</p><p>“I know!”</p> <p>“Why didn’t you tell me he speaks Indonesian? This is a thing I need to know!”</p><p>I waved my arms. “I didn’t know!”</p><p>“What do you mean, you didn’t know? You just said you knew.”</p><p>“I meant I didn’t know that he did and then he did and I went ‘I know!’ because I was surprised.”</p><p>“Ladies!” Jim barked, standing up.</p><p>We both looked at him.</p><p>“You’re speaking so fast, I can’t understand,” he said. “Why does Dali need to go to the Underground?”</p><p>“You explain it to him,” my mother said. “I will make tea.” She went into the kitchen.</p> <p>I pointed at the chair. “Sit.”</p><p>He sat and lowered his voice. “What happened to your mother’s accent?”</p><p>“We’re past that now,” I whispered to him. “Her little Asian lady act is just for show. She has a master’s in chemistry from Princeton.”</p><p>Jim blinked.</p><p>“Well, where did you think I got my brains?”</p><p>Jim shook his head. “Explain the Underground thing.”</p><p>I sighed. “How much did you understand? And since when do you speak Indonesian?”</p><p>“I’ve got the idea that something is seriously fucked up and it seemed like an interesting language.”</p><p>“Interesting language? Really? So what, you got up one day and said, ‘Hmm, I think I will learn Bahasa Indonesia today’?” He was up to something.</p><p>A green sheen rolled over Jim’s eyes. “Dali, the Underground?”</p><p>There was no easy way to say it. “Something is feeding on your soul.”</p><p>“Explain.”</p><p>I leaned closer. “All people generate magic. Some can use it, some can’t; some generate more than others, but all of us are magic engines: We absorb it from the environment and emit it back out. That’s why we can shift during technology: We store enough magic in our bodies to allow us to change shape. Let’s take Kate.”</p><p>Jim’s voice betrayed a quiet warning. “What about Kate?”</p><p>Kate used to work with Jim in the Mercenary Guild. Kate was gorgeous, funny, and she could kill anything. I hated her. She could say anything to Jim and he would just needle her back. I was so jealous of her I used to have to leave the room, until I realized that Kate crushed on Curran. She was now mated to him, and since he was the Beast Lord, that made her the Beast Lady and not interested in Jim. Kate and Curran had some seriously rough time with an ancient goddess who blew into town, and now Kate walked with a cane and Curran was barely three weeks out of a coma.</p><p>“Ever notice how when Kate gets stressed out the phones stop working?”</p><p>“The phones are unreliable as a rule,” Jim said.</p><p>I shook my head. “No, it’s Kate. She generates so much magic, she short-circuits tech if she isn’t careful. I do the same thing, except I control mine better. She can’t shoot a gun either. I’ve watched her practice and it either goes wide or doesn’t fire at all. And she has no clue. Watch her sometime: She will stomp in, grab the phone, make that growly noise, and walk away. Ten minutes later you can order takeout on the same phone. It’s the funniest thing.”</p><p>“What does that have to do with my soul being drained?”</p><p>“You’re magic, Jim. You absorb and consume magic, emanating it into the environment. By doing so, you modify the environment to be more suitable to your existence. It’s like the evolutionary loop: A species is shaped by its environment, because those with the mutations most suitable to the environment survive and reproduce, but a species also modifies its environment to make it more suitable to its survival.”</p><p>Jim sighed. “Give me the short version.”</p><p>“Something is interfering with your ability to emanate magic. You absorb and convert it, but then something or someone is siphoning it off. That’s why you feel tired and sleepy.”</p><p>“So it’s feeding off of me?”</p><p>My mother walked in carrying a platter with a teapot and three cups. “Yes.”</p><p>Jim frowned. “Makes sense. That’s why it didn’t kill me—the more magic I make, the more it eats.”</p><p>“You do realize that you’re going to die?” My mother shook her head.</p><p>“Yeah, I’ve got the dying part.”</p><p>“You found some sort of zombie instead of a man.” My mother pointed at Jim. “Look, he isn’t even concerned.”</p><p>I poured the tea. “He’s concerned, Mother. He just doesn’t panic, because he’s in charge and if he panics, everybody else will panic.”</p><p>“I can jog around the room pretending to scream if you would like,” Jim offered.</p><p>My mother raised an eyebrow. “You’re working so hard to dig your own grave, you might work yourself to death. Simmer down.”</p><p>Jim drew back as if she’d smacked his hand with a ruler.</p><p>“We have to sever the connection between you and whoever is doing this,” I said before they started slapping each other. “But we can’t see it. To make it visible we need Keong Emas. It’s a magic snail. There is a legend in Indonesia that talks about a beautiful princess, who was cursed and turned into a snail. The legend is figurative and the snail doesn’t turn into an actual princess, but with the right magic, it will reveal hidden things. The only way to get the snail is to buy it at the Underground. It’s rare and expensive.”</p><p>“Money isn’t an issue,” Jim said.</p><p>“It’s not about the money, you stupid boy.” Mother set the teacup down. “She can’t go there because of the yisheng.”</p><p>Jim looked at me.</p><p>“Yisheng is the Chinese word for a medicine man,” I said. “The dealers at the Underground call themselves that, but they aren’t medicine men. They’re animal-parts dealers. Do you remember that big shapeshifter case in Asheville three years ago?”</p><p>Jim frowned. “Vaguely. I was in Florida, dealing with Kaja’s loup pack. I remember there was a fifteen-year-old kid, Jarod, I think. He was a black bear. He said he was walking in the woods, encountered a group of hunters, waved to indicate that he was a shapeshifter, and when he turned away, the hunters shot him in the back and he had to defend himself. By the time the game wardens showed up, Jarod had the shooter pinned and everyone else had cleared out. The medic pulled sixteen bullets out of the kid. The hunter claimed he was attacked without provocation. They had a hard time proving Jarod’s story because his wounds had closed, so there was no way to determine how he’d been shot. The prosecution argued that Jarod was so huge in his beast form that if he was walking away from a hunter, no sane man would have shot him, so the hunters must’ve fired in self-defense. Curran sent the entire legal division down there.”</p><p>Clearly, Jim wasn’t sure what the word vaguely meant.</p><p>“My uncle Aditya testified in that trial,” I told him. “He is a federal park ranger for the Smoky Mountains National Park. The hunter’s name was Williams. Chad Williams, MD. Uncle Aditya testified that Williams has been detained several times on suspicion of poaching with intent to sell animal parts. He had friends in the right places and he was let go every time.”</p><p>“Stupid people believe that bear cures everything,” Mother put in. “Diabetes, stomach pain, weak heart, limp penis ...”</p><p>“A black bear gallbladder goes for about forty-five thousand dollars on the black market,” I said.</p><p>Jim repeated, “Forty-five grand?”</p><p>I nodded. “When your family is sick or your equipment stops working, people get desperate. Especially ignorant white people—they think mystical ‘Oriental’ medicine will cure all their ills.”</p><p>I refilled our cups. “A black bear’s gallbladder is expensive. A bear shapeshifter’s gallbladder is worth even more. Williams shot Jarod on purpose. He wanted his organs. They found silver bullets hidden in his campsite.”</p><p>“Poachers think that if the bear dies in pain, his gallbladder will get bigger.” My mother grimaced.</p><p>Jim’s eyes sparked with green. “They shot the boy with regular bullets to torture him before they killed him.”</p><p>“Yes. Once all this stuff came out on the stand, everybody got involved.” I waved my arms. “The marshals, the FBI, the GBI. Williams even got in trouble with the post office because the idiot used the mail to ship some animal parts down to Atlanta. He went down in flames.”</p><p>“And our family got blacklisted with the poachers forever and ever and ever,” my mother said. “That’s why Dali can’t go into the Underground. A black bear is a valuable animal, but you know what’s better?”</p><p>My mother got up, went to the cabinet, and pulled a folded paper out. Oh no. Not again.</p><p>“A tiger!” My mother slapped the paper in front of Jim. On it a stylized tiger curved his back in a garishly bright watercolor. Arrows pointed to different parts of the tiger’s body, each marked with a label: brain to cure laziness and acne, blood to cure weak constitution and gain power, teeth for breathing problems and venereal diseases, whiskers to help with the toothache ...</p><p>Jim stared at it. His eyes went completely green, glowing with barely restrained violence. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“They will kill her,” he growled.</p><p>“If she’s lucky, they will kill her.” Mother crossed her arms.</p><p>Jim looked at her.</p> <p>“White tiger, powerful magic. She heals very fast. They’ll put her in a cage and harvest her parts over and over. She’ll be their organ factory. We’ve heard of such things happening. She can’t go.”</p><p>Jim’s face was terrible. When Curran was angry, he roared. Jim never roared. Jim did this ... this horrible stone-faced thing, where the only indication of life on his face were his eyes. They were hard and furious and full of icy calculation. He scared me when he looked like that. My throat closed up, and I just wanted to sit in the corner and be small.</p><p>Today I didn’t have that luxury. The anxiety sat in my chest. I swallowed. Come on, blind girl. You can do it. “We need the snail, Mother. He will die without it.”</p><p>“There has to be another way,” Jim said.</p><p>I shook my head.</p> <p>“Then I’ll get it myself,” Jim said.</p><p>“Ha! Keong Emas is not some black bear. It’s very rare. They won’t sell it to you,” Mother said.</p><p>I met Jim’s eyes. “I know what you’re thinking. You can’t show up there with an entourage of shapeshifters and force them to sell you the snail. You can’t buy the snail yourself, because they won’t sell to you.”</p><p>Jim opened his mouth.</p><p>“No, you can’t get a different shapeshifter to go get it, because the snail looks ordinary, until someone with enough magic touches it, and I’m the only one I can think of with that much magic, besides Kate, and Kate is hobbling around with a cane at the moment, so she can’t go either. And no, you have no choice, Jim, because there is no other way.”</p><p>Jim’s eyes sparked.</p> <p>“That won’t work either. Even if you put me under guard, I will still get out,” I told him. “It doesn’t matter how many people you attach to me, I will curse my way out if I have to. I won’t sit here and watch you die.”</p><p>He snarled. I showed him my teeth.</p><p>A rolled-up newspaper landed on my head and then on Jim’s. “None of that in my house!”</p><p>Oh my gods. The alpha of Clan Cat just got smacked with a rolled-up newspaper. “Mom!”</p><p>She pointed at me with the newspaper. “Do not shame me.”</p><p>I clamped my mouth shut. When she pulled out the shame card, it was all over.</p><p>My mother stared at Jim. “You will go with her tomorrow, when the market opens. You will bring my daughter back to me, unharmed, do you hear? And you better be worth it.”</p><p>Jim held her gaze.</p> <p>If he struck at my mother, I’d strike him back.</p><p>Jim opened his mouth.</p><p>I tensed until it hurt.</p><p>“Yes, ma’am.”</p><p>Oh phew. Dodged the bullet. Not that I thought he would really strike at my mother, but you just never know.</p><p>“Take him outside, to the tree,” my mother said. “And keep him awake until morning. He falls asleep, he dies.”</p><p>THE TREE GREW in the inner yard formed by the backs of two houses on one side and a sturdy stone wall on the others. A long twisty pond took up half of the yard. Pink lotus blossoms and yellow lilies thrust from the dark water, flanked by the round leaves. In the middle of the pound, a statue of Lakshmi rose, surrounded by shrinking violets in orange glazed pots and linked to the shore by dark stepping-stones. Philodendrons bordered the pond, fighting for space with bamboo and ferns. Gold bird of paradise plants bloomed here and there. To the left a bunut tree rose with a small teak bench beside it. A bucket and ladle waited by the trunk.</p><p>I led Jim to the bench. “Sit here.”</p><p>He sat.</p><p>I dipped the bucket into the pond, set it between us, and sat on the low stone wall of a flower bed.</p><p>He looked around. “It’s a nice garden.”</p><p>I nodded. “I like it. It quiet and beautiful. Most Indonesians are Muslim, but we’re Hindu. A place for meditation is important to us. The tree you’re sitting under came from the seed of a very special holy tree in Bali, the Bunut Bolog tree. It’s a type of fig. The Bunut Bolog tree is so large and so powerful that it is like a forest by itself. It has a hole at its base, and the hole is so wide, there is a two-lane road running through it.”</p><p>“Why did they build a road through the sacred tree?” Jim asked.</p><p>“It was too dangerous to go around it because of the cliffs. They thought about cutting the tree down, but the spirits of the tree’s guardians refused to allow it, so they just had to make the best of it. It’s not wise to piss off the tree’s guardians. They are ferocious.”</p><p>“What sort of guardians?”</p><p>I gave him a little smile. “Tigers.”</p><p>Jim grinned. “Tigers, huh.”</p><p>“Mhm.”</p><p>He leaned forward. His face was calm and I wanted to kiss him. I couldn’t help it.</p><p>“You looked worried after that newspaper thing,” he said. “I’m sorry for that. I didn’t mean to make you—”</p><p>If he said “scared,” I would make him wear this damn bucket on his head. Vegetarian and half blind, I was still a shapeshifter, a predator. I had my pride.</p><p>“—upset.”</p><p>Hmm, upset I could probably live with. He didn’t need to know that. “I wasn’t upset.”</p><p>“My point is, I would never hurt you or your family.”</p><p>I raised my chin at him. “If you tried to hurt my mother, I would totally kick your ass.”</p><p>“Aha.”</p><p>“Yes. You would be lying on the ground, crying, ‘No more, no more,’ and I would be kicking you in the stomach, wham, wham, wham!”</p><p>He laughed softly. He was so terribly handsome. Here we were sitting two feet from each other, and we might as well be on opposite sides of the Pacific Ocean.</p><p>“I don’t want you to do this,” Jim said. “I don’t want you to go there, I don’t want you to get hurt trying to help me. It’s not your job to save me.”</p><p>“Yes, it is.”</p><p>“Says who?”</p><p>“Says me.”</p><p>“Look, tomorrow I’ll go in there myself, and if I choke somebody long enough, they will bring the snail.”</p><p>“Aha. And how do you plan on determining if they’ve brought a garden snail or a golden one?”</p><p>“I’ll spray somebody’s magic blood around until the snail lights up.”</p><p>“Good plan.” I dipped my ladle into the bucket and tossed the water at him.</p><p>He recoiled. “What the hell?”</p><p>“You’re delirious from lack of sleep.”</p><p>“Dali!”</p><p>“The poachers are smart and a lot of them have magic. Some of them can tell what kind of a shapeshifter you are from a hundred yards just by looking at you. If you go to the Underground tomorrow, you will fall asleep there, alone and helpless, and then the poachers will kill you and cut you into tiny pieces, and then your precious werejaguar bones will be sliced into thin wafers and put into wine, so some sicko can have magic powers in bed.”</p><p>He let out a frustrated snarl.</p><p>“It’s just like with the tea—somebody offers you a gift, and you turn up your nose at it.”</p><p>“You’re taking chances again. I won’t let you do it.”</p><p>“It’s cute of you to think you can stop me, Jim. Usually you order me around and I do what you say. I might gripe and I might make a fuss, but I will do it, because you are my alpha and I respect you. On this, you get no respect. You know nothing about this world. Your rules don’t apply here, but mine do. You will follow my lead and you will let me save you, Jim.” Because thinking about you dying makes me hurt.</p><p>He opened his mouth.</p><p>“If it was the other way around, we wouldn’t be having this conversation,” I told him.</p><p>“I’m your alpha. It’s my job to keep you safe.”</p><p>“It goes both ways,” I said.</p><p>He rubbed his hands over his eyes. I tossed another ladleful of water at him.</p><p>“Quit it!”</p><p>“You looked sleepy.”</p><p>“I’m not sleepy, I’m at the end of my patience with this stupid hocus-pocus shit.”</p><p>“Whatever.”</p><p>Fine. He could be dense and pissed off all he wanted, it didn’t matter.</p><p>We sat in silence. Off to the side night insects chirped and seesawed sad little songs. Tomorrow would suck. It would suck so much, and we didn’t even know what was wrong with him. I wished the markets would be open already so we could get it done before he fell asleep again.</p><p>“Do you at least have a plan?” Jim asked.</p><p>“Yes. Most likely we’ll have to get down to Kenny’s Alley in the Underground. That’s where the most expensive animal parts are sold. I will go inside the shop. You will wait outside. I will offer them a lot of money for the snail. If I get in trouble, I’ll scream and you will get me out.”</p><p>“A hell of a plan.”</p><p>I wrinkled my nose at him.</p><p>“And if I fail to bring you back unharmed, your mother will skin me alive.”</p><p>“She might just turn you inside out.”</p><p>Jim had this funny long-suffering look on his face, and then his eyes sparked. “So does she grill every guy you bring home?”</p><p>I don’t bring guys home, you stupid, stupid man. “Ignore it. She’s just worried. I’m almost thirty and still unmarried. It’s a big deal in my culture.” Not that he would understand.</p><p>“I like it how wealthy trumped black.”</p><p>“Jim, ignore it, okay?”</p><p>“Okay.” He raised his hands up.</p><p>Gah. “She’s desperate, all right? She just wants me to be happy, and she’s afraid I’ll never make a good match.”</p><p>“Why?”</p><p>Oh my gods. “What do you mean, why? Jim, look at me.”</p><p>He did. “Yes?”</p><p>What, now I had to spell it out? Talk about humiliating. “My mother tried to describe me in a glowing light: She went through all my virtues.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’ve got that,” he said. “Especially the part about obedient and respectful ...”</p><p>“Never mind that. She went through the whole list. If I could do origami, she would’ve mentioned it, too.”</p><p>“Okay, and?”</p> <p>“Did she tell you I was pretty?”</p><p>He gave me a blank look.</p><p>“Did the word pretty come out of her mouth? At all?”</p><p>“No,” Jim said.</p><p>“There you go.” Happy now?</p> <p>“So this is it? This is your big hang-up? You’re pissed off because your mother doesn’t think you’re pretty? Don’t let it bother you. It’s not important.”</p><p>Oh, you idiot. It’s not my mother I’m worried about. It’s you. I waved my arms. “Jim, what’s the first thing you said to me when I asked you to describe the strange woman? Let me help you remember: You said she was beautiful.”</p><p>“And?”</p><p>“I bet you didn’t notice what she was wearing on her feet, but you noticed how hot she was.”</p><p>“She was barefoot and her feet were dirty.”</p><p>Him and his stupid memory. “That’s how it goes: Men are supposed to be strong, women are supposed to be beautiful. Well, I’m not beautiful. You can put me into a room of a hundred women my age, and I’ll be smarter than most of them put together, but it won’t make a damn bit of difference, because if you let a man into that same room and let him pick, I would be the last one left. If I were a normal woman, I could use my brain to earn money and then I would get plastic surgery. I would fix my nose, and then I would work some more until I could afford to fix my jaw and so on and so on, until I was pretty. But I’m not a normal woman. Lyc-V won’t fix my eyes, but it will undo any surgery. I know, I’ve tried. I’m stuck this way and there’s not a damn thing I can do about it. And you say, ‘Don’t let it bother you,’ as if that’s supposed to make everything go away!”</p> <p>“And if the surgery did work, when would you stop having it?” he asked.</p><p>“When I walked into the room, and men turned their heads to look at me. I want to be beautiful. I want to be a knockout. I would trade all of my intelligence and all of my mystic tiger magic for that.”</p><p>The green glow backlit his irises. “And be what? A pretty idiot?”</p><p>“Yes!”</p><p>“That’s the stupidest thing I’ve ever heard.”</p><p>I glared at him.</p><p>“Nadene is pretty,” he growled. “Beautiful woman. Dumb as a board. She can’t keep a guy longer than a couple of months. Phillip left her and she wanted me to intervene so I went to talk to him. He told me that she was fun to fuck for a while, but being with her made him feel like he was getting dumber. They couldn’t have a normal conversation. He couldn’t handle it. And you want to be that? Are you crazy?”</p><p>“You don’t even notice the fact that I am female, Jim! I’m just a brain with a pair of glasses that you occasionally have to put under guard so it’s not damaged trying to have a little bit of fun. Did you ever ask yourself why I race?”</p> <p>“I know why you race,” he snarled.</p><p>“Tell me!”</p><p>“You race because you have a chip on your shoulder the size of a two-by-four. You think that because it takes you two minutes to come to when you shift and because you’re not the best fighter we’ve got, you have something to prove. And you do this by making metal cages with four wheels go really fast without any point. You don’t win anything, you don’t accomplish anything, and you hurt yourself all the time. You’re right—that will show everyone how hard-core you are.”</p><p>“Aargh!”</p><p>“The only thing you’re proving is that the smartest woman I know has zero common sense. You have powerful magic, you’re smart, you’re competent, but none of that matters. I have a dozen Nadenes, I only have one you. What good would Nadene do me right now? And I know you’re female. I’ve noticed. This hysterical thing you’re doing right now, that’s female. If you were a man, I would’ve put your ass to haul rocks for the Keep a long time ago.”</p><p>I heaved up the bucket.</p><p>“Don’t do it,” he warned.</p><p>I hurled it at him, water and all. Water splashed, and then a completely drenched, pissed-off Jim grabbed the bucket, scooped water from the pond, and tossed it at me. Water hit me in a cold rush.</p><p>I turned around and stomped off.</p><p>“Where are you going?” he called.</p><p>“Away from you!” I sat on the bench at the far end of the pond.</p><p>“You’re supposed to keep me awake.”</p><p>“I can keep you awake from here. If I see you falling asleep, I’ll curse you with something really painful.”</p><p>“You do that. You’re still wrong.”</p><p>“Whatever.”</p><p>THE MORNING CAME way too slow. Jim had almost dozed off four times and I ended up moving next to him, with my bucket. At some point he asked me if my girly emotional outbursts were over, and I swore at him for a while in Indonesian. And then he ruined it by asking me what some of the words meant, and of course I had to teach him how to pronounce them properly.</p><p>It’s good that my mother stayed inside, or I would have gotten another lecture on how to behave as a proper daughter.</p><p>It was seven o’clock now and we were standing on Pryor Street, in front of a grimy white arch marking the entrance to Kenny’s Alley. Set apart from the main Underground, Kenny’s Alley had no roof, and entering through the narrow ramp off of Pryor Street was the quickest way to get there. It was also the most dangerous—to get down, I’d have to walk up the narrow ramp that squeezed between two brick buildings, enter the old train depot, and then walk along the balcony and down two floors, all filled with people who’d kill me for a dollar. Sometimes people who entered the Underground through Pryor Street didn’t come out.</p><p>The wind swirled, rushing down the narrow gap between the buildings, and flung the Underground’s scents into my face: odors of a dozen of animal species mixed with the bitter stink of stale urine, human and otherwise, old manure, fish from a giant fishmonger tank, pungent incense, and salty blood. The revolting amalgam washed over me and I had to fight not to retch.</p><p>At least the magic had vanished during the night. Usually the miasma rising from the Underground made my head hurt.</p><p>“You don’t have to do this,” Jim said.</p><p>“Yes, I do.”</p><p>He reached over and put his arm around me. I froze. There was so much strength in that muscular arm that suddenly I felt safe. The scent of him, the comforting, strong Jim scent, touched me, blocking out other smells. I would know that scent anywhere. Here he was hugging me. I had wished for it and now I just wanted to cry, because no matter what I did, no matter how much I raced or how belligerent I got, he would never want me. Not in that way.</p><p>I stepped away from him, before I lost it. “I’m going inside. If I go inside a shop, give me about five minutes. If I don’t come out ...”</p><p>“I’ll come in,” he promised.</p><p>“Don’t fall asleep.”</p><p>“I won’t.”</p><p>I looked into his brown eyes and believed him.</p><p>“Okay,” I murmured. “I’m going now.”</p><p>I turned and headed down the narrow alley, into the dark belly of the Underground. Panhandlers and street people lined the ramp and the balcony, swaddled in filthy clothes, hats and tins in front of them. This early in the morning they didn’t even bother begging. They just stared at me as I passed by, all except an old black man, who was doing a wobbly moonwalk across a covered walkway, gyrating to the beat of some melody only he could hear. His eyes were wide-open; he looked straight at me but didn’t see me.</p><p>The ramp led me up to the top floor, to a wide balcony. Kenny’s Alley stretched below: a dank narrow space, filled with stalls and vicious-eyed people, its brick floor barely visible beneath cages and refuse. I kept walking. The balcony ended and I took the stairs down to the lower floor, where vendors hawked their wares. Dull electric lamps were strung out between old Christmas lights, marking the little shops. Despite the hour, customers already flooded the market, men, women, and children of every color and race looking for the magic cure to their problems. They were what allowed the poachers to exist. They’d stop poaching if people stopped buying.</p><p>What I needed wouldn’t be sold here. I had to get to Kenny’s Alley.</p><p>The electric lamps blinked and died. Darkness clenched the Underground in its mouth and spat it out with the hiss and crackle of magic. Fey lanterns ignited with a pale blue glow, their thin glass tubes twisted into kanji and familiar shapes: phoenix, tiger, dragon. Magic flowed and twisted around me. Here and there, wards shielded the storefronts, strong, solid. To the left a wavering miasma of something foul and wrong leaked from behind a closed door. Straight ahead, a stall of small coin charms radiated something pleasant, almost warm.</p><p>Another magic wave. There shouldn’t have been one. Nobody could predict when magic came and went, but it rarely flooded the city twice in twenty-four hours. Just my luck.</p><p>I kept moving, winding my way between the stalls. If Jim was following me, I couldn’t see him. I hoped he stayed awake. I hoped he would with all my might, because if he fell asleep, there was no hope for either of us.</p><p>The entrance to Kenny’s Alley loomed ahead, a rectangle of weak sunrise light. The smell hit me first, that unforgettable stench of too many animals kept too close together. Then came the noise: the braying, the mewing, the snarls. I stepped out into the open. Three-story houses rose on both sides of me, boxing in a narrow alley. Stalls and tables lined the front of the shops, offering dried ox penises, tanks containing geoduck mollusks, deer antlers, bundles of dried herbs. To the left a man dipped steel tongs into a box and plucked out a black poisonous centipede. The insect writhed, trying to break free. The man took the lid off a pot on the kerosene burner and tossed the centipede inside.</p><p>Small-time. I kept walking. I needed a rare-goods dealer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>People were looking at me. From the shop front on the right a middle-aged white woman in camo fabric stared at my legs, then at my head, as if she wanted to shoot me. Magic probed me, teasing, testing. A couple of younger men, probably Chinese, leaned to each other, whispering. I caught bits and pieces. A word stood out: hu. Tiger. Didn’t take them long to see through my human form.</p><p>I felt like a cow being led past a row of butcher shops. I raised my chin. Show no fear, or they will swoop like vultures.</p><p>A stall to the left looked richer than the rest: The table was sturdy and the cloth on it was red silk, the real thing, not a cheap imitation. An old wizened woman, Korean by her dress, sat guarding the wares, looking bored. I stopped and looked at the dried-out parts displayed on the silk.</p> <p>I bowed. “An-nyung-ha-se-yo.” Hello.</p><p>The woman bowed her head back. “Hello.”</p><p>English. Great. My Korean was rusty.</p><p>I paused by a small white sack that lay half open. Inside lay minced leather strips.</p><p>“Bear gallbladder,” the woman said.</p> <p>I picked up a small slice and sniffed it. “Pig.” If it had been a real bear gallbladder, she wouldn’t have let me pick it up. “Do you have bear?”</p><p>The woman reached under the table, pulled out a small wooden box, and opened it. Dried leathery strips. Could be bear gallbladder.</p><p>The woman snapped the box closed. “When were you born? What is your sign? You have nice pale skin, but the eyes are not so good, yes? We have snake glands for the eyes. Dried cicadas, make it into soup, it will make your eyes stronger. Or does your man need help in bed? I have something very special for that. Not like all those dried-out dog parts over there.” She grimaced at the stall across the street. “I have a sure thing. Want to see?”</p><p>I nodded.</p><p>Another box appeared as if by magic. I looked inside. Rhino horn. The genuine article, too.</p><p>“I’m looking for a rare thing.”</p> <p>The woman pondered me. “How rare?”</p><p>“Very rare. Keong Emas.”</p><p>“The Golden Snail.”</p><p>“I will pay well.” I reached into my hoodie and showed her the money, just a hint, but it was enough.</p><p>“Keong Emas is powerful magic.” The old woman stared at me. Her eyes were cold like two pieces of coal.</p><p>“Makes it easy to recognize a fake,” I told her.</p><p>She let out a short little grunt and called out something in Korean, too fast to follow. “You go inside now.”</p><p>I stepped over a small crate containing a pair of frightened rabbits, and went inside. Cages lined the walls. Monkeys, dogs, birds. Big frightened eyes. They screamed and shied away from the bars at my approach. I clenched my teeth. I just had to get the snail. Just get the snail.</p> <p>An adolescent boy came through the curtained doorway and waved to me. “Come this way.”</p><p>I didn’t want to go that way.</p><p>The boy waved at me. “Come! Come!”</p><p>Crap. I followed him through the curtain. A long dark room smelling of blood. Great. We kept going, farther from the street, deeper into the house. I was probably walking into a trap, but I had to get the snail. This was the only way. As long as Jim stayed awake, he would get me out. He would. Of course he would.</p><p>Another set of curtains and I stepped into a large room lined with tables, supporting a medicine man’s smorgasbord, as if a dozen street vendor carts had vomited their contents into the room. Boxes, wicker, wood, and plastic. Bloated glass bottles, skinny glass vials, jars containing powders and liquids. Dried herbs, in bundles and packets. And bones. So many bones: bear bones, wolf bones, tiger bones. Bastards.</p><p>An Asian man sat at the table, wizened and old, dressed in dark clothes. Behind him a white man leaned against the wall. He was tall and beefy, and his fatigue jacket made him look rectangular, like he was made out of bricks. A short reddish beard hugged his chin. A red NC State baseball cap covered his hair.</p><p>In the right corner a large cage sat covered by a tarp. A blond woman stood by it, leaning on a baseball bat. She wore jeans and a huge man’s T-shirt with an oversized blood drop and the words DONATE BLOOD on it. The T-shirt was threadbare and patched in a couple of places.</p><p>Something moved in the cage. I could hear it breathing in long, labored gasps. People moved in the outer rooms, too, to the right of us and behind, making small noises. A lot of people. At least eight, maybe more.</p><p>I just had to get the snail. That’s all. Just get the snail and save Jim.</p><p>The old man regarded me. I wouldn’t bow to this asshole. My back would break.</p><p>“You want to buy Keong Emas.”</p><p>“Yes.”</p><p>The boy who brought me here walked over to the far table and brought a wicker box to the old man. The man opened the box and removed a glass tank with five snails inside. Each had a dull brown shell.</p><p>The old man offered me the tank. “Choose one.”</p><p>This was it.</p><p>I reached into the tank and passed my hand over the snails. The smallest one tugged on me, tiny needles of magic prickling my skin. Gently, I plucked it from its leaf and held it in the palm of my hand.</p><p>A faint glow lit the snail from within. It lingered for a second and burst, painting the snail’s shell with brilliant gold.</p><p>“Only powerful magic can see Keong Emas,” the old man said. “White tiger magic.”</p><p>Oh shit. I clamped the snail in my hand and felt it slide into its shell. “How much?”</p><p>“Take her.” The old man nodded to the guy in the red hat.</p><p>Red Hat peeled himself from the wall. Behind me a man and a woman moved from behind the curtain, cutting off my exit.</p><p>“You shouldn’t have come here,” the old man said.</p><p>“Jim!” I yelled.</p><p>“He won’t help,” the old man said. “Nobody will help.”</p><p>I dashed left, but Red Hat’s hand gripped my shoulder and he jerked me off my feet with superhuman strength. I kicked at him, but he batted my legs aside and carried me back to the corner, where a woman pulled the tarp off the cage. A man knelt in the cage on all fours, filthy, wearing rags smeared with old blood. Plastic ties forced his wrists together, and above them a ragged cloth with a holding spell scrawled in ink bound his forearms. A leather muzzle clamped his whole face, leaving only the narrow strip of space around his eyes visible. Bandages hid his head and all I saw was one eye, mad, furious, and brilliant turquoise.</p><p>There was a second cage next to him. An empty cage.</p><p>Panic squirmed through me. I kicked and thrashed, but the cage kept coming closer and closer. If I went tiger, he couldn’t carry me, but I’d be too dazed to fight and I would drop the snail. I couldn’t drop the snail, or Jim would die.</p><p>Jim would come for me. He wouldn’t fall asleep. He wouldn’t let them kill him.</p><p>I kicked and jerked with all the shapeshifter strength I had.</p><p>“Don’t make this harder on yourself,” Red Hat told me.</p><p>We were almost to the cage. “How can you do this?”</p><p>“Your uncle kept a lot of people from feeding their families.” Red Hat shoved me the final five feet. “We have mouths to feed. I don’t have a problem doing this.”</p><p>I thrust my legs at the cage and braced myself. “Jim! Come get me!”</p><p>The man in the other cage moaned a wordless scream and rammed the bars.</p><p>Red Hat jerked me down. “Nobody’s coming for you.”</p><p>No! No, I will not be put into a fucking cage. I kicked against the cage, pitching myself backward. My head smashed into Red Hat’s face. He dropped me. My feet touched the ground. Yes! I scrambled left.</p><p>Something smashed against my temple. Pain exploded between my ears. I spun. The woman behind me swung again and the bat took me straight in the face. The world shivered and I tasted blood on my lips.</p><p>Red Hat clamped me and muscled me forward. The man in the other cage let out a long desperate wail.</p><p>It was over. Jim fell asleep. Nobody was coming for me.</p><p>RED HAT WAS dragging me to the cage. The blond woman leaned over and swung open the door.</p><p>A man flew through the curtain and slid across the floor, knocking the tables and benches out of the way until he hit the wall. I caught a glimpse of long dark hair. He clenched his hands to his throat. A thin red spray shot from between his fingers. He gurgled, his eyes huge with sharp fear.</p><p>The curtain fell, revealing Jim, drenched in blood. His eyes glowed green and his face was terrible.</p><p>He came! Oh my gods, he came for me. It was going to be okay. Everything was going to be okay.</p><p>A stocky man lunged at Jim from the left, swinging a machete. Jim grabbed him. His knife flashed, and the man crumpled down, his machete slick with his own blood.</p><p>Red Hat threw me aside. I crashed into the cage and thrust the snail into the pocket of my jeans.</p><p>The blond woman by the cage screamed and swung her baseball bat at me. I ripped it out of her hands and bashed her with it. The bat snapped with a sharp wooden crunch. The blow knocked the woman across the room. That’s right, fuck you!</p><p>A man fired a crossbow at Jim. Jim swayed out of the way, leapt, clearing the tables, and struck. The crossbowman fell like a lifeless doll. More people streamed from the back doorway.</p><p>Jim looked at me and smiled.</p><p>Red Hat shrugged his jacket off. A dark pattern swirled along his skin, like the whorls of wood grain. He headed toward Jim. A table got in his way, and he knocked it out of the way. The table splintered. Oh shit.</p><p>In the corner the old man waved his arms. Angry magic streaked through the air.</p><p>Jim was cutting his way toward me, his knife sending arcs of blood left and right. People screamed, wood crashed, Jim snarled. The scent of blood made me dizzy.</p><p>The prisoner moaned at me. The empty cage blocked his door. I pushed it. It didn’t move. I wedged myself between the wall and the cage, planting my feet on its base, and pushed, pushed as hard as I could. Wood creaked, and the cage slid out of the way. I dropped to my knees. A long knotted cord bound the door, the knots holding coins. I grabbed it. Magic scorched my fingers and I jerked back, wincing.</p><p>The prisoner screamed, hitting the bars.</p><p>“It’s okay,” I told him. “It’s okay, it’s okay. I can do this. Just hold on one second.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Red Hat smashed into Jim.</p><p>Everything slowed down as if we were all underwater.</p><p>Jim’s knife sliced, across, down, across the other way, still so fast, like lightning. The blade glanced off Red Hat’s new wooden skin. Red Hat bared his teeth and swung his giant fist. Jim leaned out of the way, lean and graceful, and thrust. The knife bit deep into Red Hat’s left eye. The big man bellowed like a bull.</p> <p>Jim vaulted over him.</p><p>The caged man moaned. I’d need a week to figure how to break the seal without hurting myself. I didn’t have a week.</p><p>Outside the window people screamed. More poachers coming in.</p><p>I grabbed the magic cord and jerked. It broke, leaving dark stripes of burned flesh across my hands. Pain lashed me, but I was too busy. I jerked the door open, grabbed the man by his shoulders, and pulled him out of there. He crashed on his side.</p><p>A hand caught my shoulder and pulled me up. “Time to go,” Jim breathed.</p> <p>“No!” I pointed to the prisoner. “I can’t leave him. Help me.”</p><p>Red Hat spun toward us, screaming, the knife still in the socket of his eye.</p><p>Jim cut, once, twice, and the prisoner’s hands came free. Another cut took the mask from his head, and I stared at the face of the most stunning Asian man I had ever seen. He was like a celestial being from a Chinese watercolor—absolutely flawless.</p><p>The eyes of purest turquoise stared at me and within their depth I saw a spiral of fire.</p><p>Oh no.</p><p>The prisoner surged to his feet. Magic unfurled from him like a mantle in splashes of red and gold, forming the translucent outline of a scaled beast on four sturdy muscled legs.</p> <p>Jim pushed me behind him and raised his knife.</p><p>Transparent claws the size of my hands dug into the wood. The head of a dragon formed upon the massive shoulders. The prisoner stood within the beast, still clearly visible. His hair had broken free of the bandages and it streamed down his back in a long dark wave.</p><p>Red Hat froze in midstep.</p><p>The old man howled a curse and clawed the air. A serpent of bright crimson launched itself from his fingers and bit at the translucent beast. The prisoner waved his arm, and the serpent sparked and melted into ash.</p><p>A Suanmi.</p><p>People burst through the door.</p><p>The Suanmi looked at them. The magic beast’s maw gaped open.</p><p>Red Hat turned and started running.</p> <p>Fire burst from the beast’s mouth, roaring like an enraged animal. It caught the old man first, jerked him upright, and swept by, leaving a charred ruin of a body. The smoking corpse took two steps toward us and fell.</p><p>Jim clamped me to him, trying to shield me.</p><p>The men at the door scrambled to get out, but the fire fanned hot, all-powerful. Screams filled my ears. I shut my eyes and stuck my face into Jim’s chest.</p><p>The screaming went on forever.</p><p>Finally the roar stopped. I pulled my head away from Jim.</p><p>The man within the dragon turned and looked at us. Jim growled, and his clothes exploded off his body. His skin ripped, releasing muscle underneath. Bones thrust, growing, muscle formed new powerful limbs, and a new skin sheathed it, showing the coils of black rosettes against a thin golden pelt. A new creature stood in Jim’s place: half man, half monster. A werejaguar in the warrior form.</p><p>Jim snarled, his black lips framing enormous fangs, and stepped between me and the prisoner.</p><p>The Suanmi opened his mouth. Words flowed in English. “There is no need to fear me.”</p><p>There was every need to fear him. He had dragon blood in his veins. I swallowed. “We mean no harm to you.”</p><p>“I know.” The Suanmi looked at the cage. “I’d come here, sick and helpless. My family had been slaughtered and I was hurt. I came looking for medicine, but I lost consciousness and I awoke here. Nine months. I spent my eighteenth birthday in this cage while they carved pieces of my body to make themselves stronger. Healing the damage and waiting to be cut again. Nine months. Felt like forever.”</p><p>“It was a bad dream,” I told him. “It’s over now.”</p><p>“For me, yes.” The man smiled. The transparent beast stretched his maw, mimicking the smile, baring enormous teeth. “For them, the nightmare is only beginning.”</p><p>I took a deep breath. “We don’t want to be a part of their nightmare. May we go?”</p><p>The Suanmi bowed his head, his turquoise eyes fixed on my face. “I owe you a debt, White Tiger.”</p><p>I bowed back. Just let me and Jim go and we’ll call it even.</p><p>“When you wish to collect it, come here,” the Suanmi said. “It is my place now. I will take it from them by midday and by evening they will be bringing gifts to their new emperor.”</p><p>He turned and walked away, deeper into the house.</p><p>Jim picked me up and took off running. I hugged his neck and then we were out in the courtyard. Around us people ran in panic. Smoke and fire billowed from the buildings.</p><p>“What the hell was that?” Jim growled, his words distorted by his huge mouth.</p><p>“A Suanmi. In Chinese legends the dragon had nine sons, each with their own powers. Turns out the nine sons gave rise to nine families. He is a descendant of the son who wields fire.”</p><p>“He’s part dragon?”</p><p>“Yes!”</p><p>“I don’t care if he’s part dragon. If he looks at you like that again, I’ll cut his face off.”</p><p>“How did he look at me?”</p><p>Jim leapt up the stairs and stopped almost in midstep.</p><p>“Why did you stop?”</p><p>He pointed at the vendor’s cart filled with reproductions of old Japanese pornography. “The scroll with the woman in red.”</p><p>On the fake scroll, the woman lay on the floor, her red kimono falling apart while a man with a huge mutant penis crouched over her. A string of kanji characters explained the scene. “Yes?”</p><p>“The first two characters in the second column, that’s what I saw on the floor in the office.”</p><p>“Put me down.”</p><p>He lowered me to the ground. I leaned toward the scroll. The first character, second column: Joro. Joro? Really? “Are you sure?”</p><p>“I’m sure.”</p><p>“Jim, that’s a very old word for whore. Baita is more common. I’ve never even seen joro on a sign anywhere, it’s that obscure.”</p><p>“That’s what I saw.”</p><p>I had no idea what that meant. How would August even know that kanji? He could barely remember the word for bathroom.</p><p>Behind us someone roared and a burning wood beam crashed down, just like in an old movie. Jim took my hand, and we ran up the stairs, out of Underground Atlanta, and we didn’t stop running until the door of my mother’s house loomed before me.</p><p>AS SOON AS we walked through the door, my family mugged us. My mother had called an emergency. Everyone was there: uncles, aunts, cousins, neighbors. They pulled Jim away from me and took him to the garden. I tried to follow, but my mother stopped me.</p><p>“Do you have it?”</p><p>I dug in my pocket and deposited the snail into her hand. She held up the shell to light. “Alive. Good!” She swept to the corner of the room, where a glass box held the delicate white stars of the jasmine blossoms. She gently deposited the snail onto the snowy petals and shut the box.</p><p>“How long?” I asked.</p><p>“Six hours, if we’re lucky. Ten, if we’re not.”</p><p>People fussed over me and asked me questions, and then I had to explain that the poacher market was no more. Then I was pushed into the kitchen and made to eat. There were so many dishes that the counter had no space. In my family, any emergency was met with an avalanche of food; the more dire the problem, the bigger the spread.</p><p>Over an hour later, I finally snuck away to steal a look at the Keong Emas. The snail had fed on jasmine. Its shell lay discarded and the fat body of the insect glowed with weak golden radiance.</p><p>“It’s going well,” my mother said. “So far.”</p><p>“I’m going out,” I told her.</p><p>“Where to?”</p><p>“To Komatsu Grocery to see August’s family. I want to know what we’re dealing with.”</p><p>My mother pursed her lips. I knew what she was thinking. Of all the nationalities I have come across, the Japanese were usually hardest to talk to. They were always polite to a fault, but they didn’t speak to police and they didn’t speak to foreigners. Family matters were kept private and problems were resolved behind closed doors, so no undue attention would be drawn to the family.</p><p>“A waste of time,” Mother said.</p><p>“I have a plan.”</p><p>My mother clamped her hand to her chest, pretending to be scared. “Dali, do not make Komatsu Grocery explode. Where will I shop?”</p><p>“Mother!”</p><p>My mother rolled her eyes to the heavens with a look of uttermost suffering. I growled and went off to find my alpha.</p><p>By the time I fought my way through my relatives to the garden, Jim was human again and very naked. He was seated by the tree and the four older women were pouring spelled water over him, trying to purify the body.</p><p>His gaze found me, dark eyes pleading for help. I walked over to him, trying not to ogle.</p><p>“Help,” he said.</p><p>I took his hand and held it. “They’re trying to keep the evil out, until my mother can get the snail to hatch.”</p><p>“Snails don’t hatch,” he said.</p><p>“This one does. Stay awake until I come back.”</p><p>“Where are you going?”</p><p>“I have to do something. Nothing dangerous. I’ll be back soon, okay? Don’t worry, my family will take good care of you.”</p><p>The hard alpha mask snapped onto Jim’s face. “I look worried to you?”</p><p>“No. Don’t kill any of my relatives while I’m gone either.”</p><p>“Where are you going?”</p><p>I walked away.</p><p>If you deny a cat information, it will nag at him. If the cat happens to be a spymaster, it will drive him completely crazy. It would keep him awake. Besides, after his lecture on how I was smart but stupid and had a chip on my shoulder, I was allowed a little payback. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>IT WAS ALMOST noon by the time I made it to South Asia. It was a grand name for a small spot in southern Atlanta, where the Asian-themed shops aggregated in a large plaza formed by an old mall. I stopped there a couple of times a month—it was the closest place to buy manga. Also, Komatsu Grocery was hands down the best Asian market in the area. They had a large selection and their seaweed salad was delicious. Whenever I went, I’d buy a two-pound tub of it and then pig out as soon as I got home.</p><p>I parked Pooki on a remote street, stepped out of my car, and stripped off my clothes.</p><p>There was a thing that August’s family would dislike even more than having to speak to outsiders. They would go to great lengths to avoid attracting attention. And I was about to Cause a Scene.</p><p>My panties were off. I crouched and scratched a name in the pavement with the car key: Jim. Next I put my glasses on the passenger’s seat, locked the car, dropped the keys behind the left wheel, and took a deep breath.</p> <p>The world dissolved, swirling into a thousand bokeh, blurry little lights in every color of the rainbow.</p><p>Pretty colors.</p><p>Ooooh, so pretty.</p><p>Mmm, pretty, pretty.</p><p>So many scents. I liked that one, and this one, and this other one was kind of disgusting, and this one made me hungry.</p> <p>I licked my lips. Mmm. Yummy smell, so good.</p><p>The bokeh slowly came into focus: I was lying in a street. Hmmm. I knew this street. This was South Asia.</p><p>Why was I here?</p><p>I looked down. On the pavement in front of me, right between my two paws, was a single word: Jim.</p><p>Jim. My handsome, awesome, scary Jim. Rawr. I smiled and sniffed the name. It didn’t smell like Jim.</p><p>A memory popped in my head like a soap bubble bursting: Jim, dying, soul siphoned, Keong Emas, poachers, August. I came here to find out why August had disappeared for twenty-four hours.</p> <p>I rose and padded around the corner. The magic was still up and when the light caught my fur, every hair gleamed. People stopped and stared. They knew who I was; I had come to South Asia before many times. They knew my magic, too, because it rolled off me with every step.</p><p>I walked over to the door of Komatsu Grocery and lay down in the middle of the street, staring at the door.</p><p>People looked at me, shocked.</p><p>I gave them a nice big smile. That’s right, look what big teeth I have. I knew I was a vegetarian, but aside from Jim and a few friends, nobody else did. Besides, just because I didn’t eat meat, didn’t mean I wouldn’t bite.</p><p>The few people aiming for the store decided they had better places to be.</p><p>After fifteen minutes August’s second cousin, who liked to call herself Jackie, stuck her head out the door. I released my claws and stretched, making long scratches on the pavement. She gulped and ducked back in.</p><p>I could just imagine the conversation inside: “She’s lying in front of our store!” “In front of our store? In the street where everyone can see?” “Yes!” “Oh no.”</p><p>Minutes passed by. A little blue butterfly landed on my nose. I blinked at it and it fluttered to my ear. A big yellow butterfly gently floated over and landed on my paw. Soon a whole swarm of them floated up and down around me, like a swirl of multicolored petals. It happened in my backyard, too, if the magic was strong enough. Butterflies were small and light, and very magic sensitive. For some reason I made them feel safe and they gravitated to me like iron shavings to a magnet. They ruined my ferocious badass image, but you’d have to be a complete beast to swat butterflies.</p> <p>If a baby deer frolicked out from between the buildings trying to cuddle up, I would roar. I wouldn’t bite it, but I would roar. I had my limits.</p><p>I flicked my tail. Hmm, a half hour had passed and we were getting close to the forty-five-minute mark. The family was trying to save face or having an argument, but if nobody came to say hello in the next few minutes, their behavior would be edging on rude. One can’t ignore a mystic white tiger on their doorstep. It just wasn’t done.</p><p>The door opened and August’s auntie bowed and held it open. “Please, come in.”</p><p>I trotted inside, leaving my Lepidoptera entourage outside. August’s auntie led me past the counter to the back room, where August’s grandmother, his uncle, and his mother sat. The entire Komatsu family with the exception of the children and August’s white father. Their faces looked ashen.</p><p>I sat, curling my tail around me.</p><p>We looked at one another.</p><p>“We know why you are here,” August’s uncle said. Mr. Komatsu was a solemn-looking man in the best of times; now his expression was so grave, he could’ve been carved out of stone.</p><p>I waited.</p><p>“August is dead,” he said.</p><p>I sighed. August was the first male son in his generation. The one who would be forgiven every wrong and permitted every privilege, because years later, when his father and uncle were old, he would assume the burden of taking care of Komatsu family. It was a terrible loss for the family.</p><p>“We have buried his body. It is our affair,” Mr. Komatsu said.</p><p>I shook my head slowly. August was a shapeshifter and other shapeshifters died because of him. It was our affair now.</p><p>Mr. Komatsu stared straight ahead.</p><p>The grandmother leaned forward. “It’s the woman. Her name is Hiromi. We do not know her family name. It happened seven years ago, just before the flare.”</p><p>The flare came every seven years. If a normal magic fluctuation was a wave, the flare was a tsunami. Bad magic happened during the flare. It dissipated after three days or so, but those three days were terrible. The flare before last dumped a phoenix onto the city, right over the Asian neighborhoods. We had another flare this year and I made my family go to the Keep to stay safe.</p><p>“The bad magic was coming,” August’s mother said. “People boarded up their houses and flooded the stores to get supplies. Everyone was in a rush. Hiromi came in to buy groceries. I’d seen her before a few times. She looked poor. Her clothes were bad and she was thin. Very skinny. She had her daughter with her, a small little girl. She might have been two or three.”</p><p>“The child liked cookies,” Mr. Komatsu said. “We offered some to her every time. Hiromi would only let her have one. Very proud.”</p><p>August’s mother took a deep breath. “Hiromi bought her groceries and went out, carrying her little girl. A street person stabbed them outside the door. We found him later. He was a crazed old man. The flare had made him insane. He didn’t even remember doing it. He just stabbed them and walked away. Hiromi slumped against the wall, holding her baby, and people walked by. Everybody was in a terrible rush. Nobody wanted to get involved. Nobody stopped him and nobody helped her.”</p><p>How terrible. To lie there and bleed out slowly into the street, knowing your child is dead in your arms. How awful.</p><p>“We didn’t know she was dying outside of our store,” Mr. Komatsu said. “When we found her, she had no pulse. She looked dead. We brought her and the little girl inside, in here. They were both cold and neither had a heartbeat.”</p><p>“The flare had unleashed a phoenix and the city was burning,” August’s mother said. “We had to go. We left her. Meanwhile, the flare had awakened magic within Hiromi and pulled her back from death, but her little girl didn’t survive. When we came back after the flare, she had woven a cocoon within the store. Before she left, she warned us that everyone would pay.”</p><p>I had this sick cold feeling in the pit of my stomach. I knew exactly how this story would end.</p><p>“She remembered everyone who’d passed by her as she lay dying and didn’t stop to help,” Mr. Komatsu said. “On the one-year anniversary of her child’s death, a mark and a note appeared on the door of the first family. Hiromi demanded a sacrifice: One member of the family had to go to her so she could ... feed. If someone volunteered, the rest of the family would be left alone. They ignored it at first. Three days later she took the family.”</p><p>“The families put together our money and hired the Mercenary Guild,” August’s mother murmured. “She killed them. Nobody would help us after that.”</p><p>If only I could speak. They had let this monster terrorize them. They didn’t ask for help. They could’ve gone to the Order, they could’ve gone to the cops. They could’ve gone to the Pack—August was a shapeshifter, after all, and his family was in danger. But they didn’t, because everyone was too ashamed to admit that they had let a young woman and her child die alone on the street in plain view. They just took their punishment, paid their blood debt, and lived with guilt. It was the old honorable way and it cost them so many lives.</p><p>August’s mother kept talking. “She is growing stronger and stronger. She has turned her cat into a nekomata, and it serves her with dark magic. Even her blood is no longer human. She bleeds ichor like a spider. She is growing greedy like one, too. People have been disappearing more and more as time goes by. Every year she marks a new door. This year she marked ours.”</p><p>I’d guessed as much.</p><p>“I said I should go.” August’s grandmother drew herself upright. “I’m old. I’ve lived long enough.”</p><p>“We argued about it,” August’s mother said. “While we argued, August decided that nobody should go. He went to meet Hiromi himself.” Her voice broke and she closed her eyes.</p><p>August had died for them. For his family. The first son of the new generation, the heir to the family. They had lost their future and they were crushed.</p><p>Because August had disobeyed and fought, Hiromi had toyed with him. She must’ve infected him somehow, and he brought her magic with him to the shapeshifter office. Jim was in the wrong place at the wrong time, and now she wanted him. Well, she couldn’t have him. He was mine.</p><p>Mr. Komatsu rose and put his arms around his sister. “We don’t know what happened between Hiromi and my nephew. We found August’s body on our doorstep. He was drained. His corpse, it was devoid of all liquid. We buried him. The mark has disappeared from our door. We cannot help you. Now leave us in peace so we can grieve.”</p><p>I rose and walked out, leaving the shards of a broken family behind me. I felt sick, but I finally knew what my enemy was. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I STOOD NEXT to my mother by the kitchen window. Through it, I could see the garden and Jim by the tree. It had taken eight hours for Keong Emas to mature and every hour had added years to Jim’s face. His beautiful skin looked dull, as if rubbed with ash. Puffy circles clutched at his eyes. He looked exhausted, drained, like a man who had spent a decade working in some hellish mine. Only the eyes remained the same: sharp, dangerous eyes, backlit from within by a lethal green glow. He had the will to live, but no strength to keep going.</p><p>He was dying.</p><p>Poor Jim. My poor, poor Jim.</p> <p>My mother pursed her lips. “It’s not too late to let him go.”</p><p>“It is.”</p><p>“Your magic will not work on her. She is an insect demon.”</p><p>Arachnid, actually. “I have a plan, Mother.”</p><p>My mother turned to me slowly. Her lip trembled.</p> <p>Oh my gods.</p><p>She hugged me, clenching me to her. “My brave baby, you’re the only one I have. The only one. My precious one, my sweet daughter. You’re my everything. I’m begging you, please, please, let him go.”</p><p>I smelled tears and I knew she was crying, and then I cried, too. “I can’t, Mother. I love him so much. I just can’t.”</p><p>She held on to me so tight, she must’ve been afraid I’d disappear into thin air. We stood holding each other for a long minute, and then she let me go. “All right. I will help you then.”</p><p>She picked up the glass jar. Inside it, a single fat pupa hung off the glass wall.</p><p>My mother sniffed back her tears. “We go now.”</p> <p>We went out into the garden, my mother leading the way, and me following, carrying my calligraphy kit and old keris in my hand. The dagger curved in a wavy pattern from the asymmetrical base to the razor-sharp point, and the dozen metals that formed the blade shimmered as if the weapon was forged out of silvery running water.</p><p>Up close, Jim looked even worse. My family had kept him awake, but it had sapped all of his strength. Only the shell of a man was left.</p><p>Jim saw the knife. His lips moved. The words came out slowly. “If you needed a good knife, I’d let you borrow one of mine. You can’t even cut straight with that thing.”</p><p>I almost cried again.</p><p>My mother looked at me. Last chance to change my mind.</p><p>I nodded.</p><p>She sighed, opened the jar, and touched the tip of the pupa with her finger. Magic sparked through the tiny cocoon. It cracked and fell apart, breaking into dust. A radiant moth spread its wings in the pupa’s place. Magic washed over me, warm beautiful magic, so potent and strong, it made my heart skip a beat. I held my breath.</p><p>Golden and glorious, glowing with a soft light, Keong Emas crawled to the lip of the jar. It fluttered its wings, sending tiny sparks of magic into the air, and took to the air, raining golden dust and minuscule bits of magic. It hovered above Jim, circled above him once, twice, fluttered through the garden, and flew away, far into the trees.</p> <p>The entire garden lay bathed in a golden glow, tiny sparks of magic gleaming on plant leaves like precious jewels. I’d never seen anything so beautiful.</p><p>Mother gasped. I spun to Jim. Long strands of spiderweb clenched his neck, stretching upward, growing more transparent with each inch until they finally vanished about three feet above his head.</p><p>I glanced at my mother. “Go.”</p><p>She set the glass jar down, turned, and fled. The rest of my family followed. In a moment, the garden and the house were deserted. Only Jim and I were left.</p><p>I came over and knelt by him. He slumped on the bench. He was so weak, he probably couldn’t even move.</p><p>“How are you?”</p><p>Ashen lips moved. “Great. Never better.”</p><p>“I found out what happened,” I told him. “During the last flare, a woman and her daughter were stabbed in South Asia. They bled out into the street and nobody helped. It was horrible. The daughter died, but the woman survived. She turned into a monster and once a year she demands a sacrifice from the people who ignored her dying.”</p><p>Jim’s voice was weak. “How long has that been going on?”</p><p>“Seven years.”</p><p>“And nobody said anything?”</p><p>I shook my head. “They felt ashamed. They tried hiring the Guild, but she killed the mercenaries. It became every family for themselves. August’s family was the last one targeted. He went to fight the monster.”</p><p>“With no backup?”</p><p>“Yes.”</p><p>Jim sighed. “People are idiots.”</p><p>“That theory seems likely, yes.”</p><p>Jim coughed. “So what now?”</p><p>“There are spiderwebs attached to your throat. I’m going to cut them with my pretty magic knife. When I do, you will faint from shock. Then the woman will come back and try to devour you anyway, because her type never lets prey get away.”</p><p>“Is that why everyone left?”</p><p>I nodded.</p><p>“Are you going to curse her?”</p><p>“Something like that.”</p><p>Jim stared at me. “Dali?”</p><p>How did he always know when I was hiding something? “There is a small problem with that. My curses only work on animals and people. Something with blood. Hiromi has no blood. She has insect slime. Remember the kanji character you saw on the floor? Joro, the whore? That was part of her demon name. That’s why August knew it. His family had been terrified of her for years. She’s jorogumo, the whore spider. So I’ll have to be creative.” And if I fail, you will never wake up.</p><p>He tried to rise but managed only a twitch.</p><p>“You can’t stop me,” I told him. “Don’t worry. I’ve got this.”</p><p>“You should go,” he said. “Leave me.”</p><p>“Having a vegetarian blind girl save your behind really bothers you, doesn’t it?”</p><p>“I don’t want you to get hurt.”</p><p>I took his hand and squeezed it, trying to keep the tears out of my voice. “I’m about to cut the web, Jim. You have about a minute, so if there is something you really need to tell me, you have to do it now.”</p><p>His eyes told me he understood. This could be the last time we spoke to each other.</p><p>“I’m sorry about our fight.”</p><p>“I forgive you,” I told him, and sliced through the first line. The keris severed it in one short cut. It blinked and vanished. “You just don’t understand what it’s like not to be pretty. It’s because you’ve always been hot.”</p><p>He coughed. “Hot?”</p><p>“Mhm.”</p><p>“Have you ever looked at me?”</p><p>“I have. I look at you all the time, Jim.” I severed the second line. It disappeared. A shudder ran through Jim’s body. His legs trembled.</p><p>“About Indonesian,” Jim said. “I learned it so I could talk to you.”</p><p>Oh, Jim. What the hell, I might never see him again. This was my last chance. I leaned over and kissed his lips.</p><p>He kissed me back. It was tender and loving and everything I had dreamed it would be. Tears ran down my face and I couldn’t stop them. I loved him. I didn’t know if he loved me back. He might have kissed me out of gratitude or for some other strange reason, but it seemed so unimportant now. If someone offered me a choice, his life or his love, I would give him up. Even if it meant he would never remember me and we would never speak again. As long as he lived. That’s all I wanted. I just wanted him to be okay.</p><p>We broke apart and I looked into his eyes. “You’re ready?”</p><p>“Kick her ass,” he said.</p><p>I cut the third line.</p><p>His eyes rolled back in his head. He slumped back. I touched my fingers to his neck. Alive. Come on, Lyc-V. Fix him up.</p><p>There was nothing left to do but wait. I sat down. If I were Kate, I could pull out my sword and when Hiromi showed up, I’d spit some magic at her and then cut her to pieces. If I were Andrea, I’d shoot it until it died. If I were Jim’s cousin, who served as the female cat alpha until Jim found a mate, I’d rip into her with claws. But I wasn’t. I was me. All I had was my brain, ink, and some paper.</p><p>I opened my kit and began to write.</p><p>A small noise made me raise my head. A Japanese woman stood on the edge of the garden. She wore a long, flowing white robe. Her skin was like fine porcelain, her eyes were beautifully shaped, and her hair spilled down her back like glossy black silk.</p><p>Twenty minutes. Didn’t take her long at all.</p><p>“You can drop the disguise,” I said. “I know what you are.”</p><p>“And what would that be?” she asked. Her voice was like a silver bell. Even if she didn’t attack Jim, I’d hate her out of pure jealousy.</p><p>“You are a jorogumo. The whore spider.”</p><p>The woman’s kimono split at the bottom and ripped apart. Thick chitin legs spilled forth, bristling with stiff dark hairs. A demonic creature rose before me: her bottom half, spider, and her top half, a human torso sheathed in overlapping bands of black exoskeleton. Her spider body was as long as my Prowler and twice as wide. This was bad.</p><p>Ice clamped my spine. My throat threatened to close up. I bet Kate never got scared like that. I unclenched my teeth. “I think I just threw up a little bit in my mouth.”</p><p>“The man is mine.” Hiromi pointed her slender arm at Jim.</p><p>“No, this man is mine.”</p><p>Hiromi moved forward, one spider leg after another, probing the ground. I watched her come toward me, a dark monster in the glowing garden. In life she had so little, and the only thing she treasured, her daughter, was ripped away from her. If I were Hiromi, I’d see becoming a demon as a great honor. It was my chance to use my powers to punish those who wronged me, to be strong and feared. But the longer she stretched out her revenge, the more selfish she became. Punishing the wicked was no longer enough, I could see it in her eyes. She had given in to greed.</p><p>She was almost to the line I’d scratched earlier in the dirt. Step, another step ...</p><p>If the magic fell, both Jim and I would be in serious trouble.</p><p>The ugly spider leg touched the line. A gold glow sparked and dashed across the grass and rocks, outlining an octagon with Jim in the center. The demon yowled and recoiled. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“A very complicated ward. Took me an hour to make,” I told her. I had made it while still in tiger form, after I had learned at the grocery store what I would be facing.</p><p>“I am Hiromi Jorogumo, the Binding Maiden, the Bloody Mother. You will give him to me!”</p><p>Wow, now she was bestowing titles on herself. I crossed my arms on my chest. “And I am Dali, the White Tiger, the Guardian of Bunut Bolog. My magic is as strong as yours. You will not pass.”</p> <p>I’d guessed right—Hiromi was hung up on being a jorogumo. She viewed it as an honor and she was arrogant and vain, which meant I had a chance. It was a tiny, tiny chance, but it was better than nothing. I just had to play the game by her rules.</p><p>A grimace jerked her face. “I’ve heard of you, Dali Harimau, White Tiger. You can’t guard him all the time. He has to sleep eventually and when he does, I will devour him.”</p><p>“I’m not arguing with you. That’s why I want to offer you a bargain.” I held up the piece of paper.</p><p>Hiromi leaned forward. “What bargain?”</p><p>“A contract. You ask me a riddle. If I answer correctly, you will leave him and me alone.”</p> <p>Riddles were the traditional way to resolve issues. If she truly thought like a demon, it would appeal to her.</p><p>Hiromi’s eyes narrowed. “And if you don’t?”</p><p>“Then you get to eat Jim and me.”</p><p>“You? The magical White Tiger?”</p><p>“Yes.”</p><p>Hiromi’s mouth gaped open, releasing a row of sharp fangs. Saliva stretched down from her teeth in thin strands. She was imagining eating me and drooling. Eww.</p> <p>“Three riddles,” she said. “You answer every one.”</p><p>“Fine.”</p><p>I corrected the contract.</p><p>“What guarantee do I have that you will submit?” she asked.</p><p>“The contract is magically binding.” I put the paper on the ground and pushed it across the ward with a stick. “It’s signed in my blood. If you sign it in your ichor, we will have a deal.”</p><p>Hiromi lowered her big spider body to the ground and swiped the piece of paper with her human hand.</p><p>Come on, Hiromi. Be as greedy as I hope you to be.</p><p>Hiromi struck at her side. Pale translucent liquid spilled out, carrying with it small knots of yellow slime. Ew, ew, ew!</p> <p>The jorogumo dipped her finger into the liquid and drew it across the contract. Magic snapped, clutching at the paper.</p><p>I took a deep breath and touched the ward. It melted into nothing.</p><p>“First riddle.” Hiromi bared her teeth. “It rises to the heavens but never reaches them; it flies like a bird but has no wings; it makes you weep without a cause; those who see it stop and stare; it served as my black funeral shroud and it was the only one I had. What is it?”</p><p>Funeral shroud. What did she see as she lay dying? People walking and the city on fire, because of the phoenix birthed by the flare. And where there was fire, there was ... “Smoke,” I said. “When you died, Atlanta was burning. Next.”</p><p>Hiromi clamped her mouth shut. Her spider legs kneaded the ground. “Men make it, but gods crave it; its loss weakens, its appearance threatens; fear chills it, war heats it; it binds family together, and I watched mine leave me.”</p><p>“Blood. You watched yourself bleed out onto the street.”</p><p>Hiromi rocked back and forth. She had powerful magic, but it didn’t make her smart. The blood riddle was almost painfully obvious. What else could fear chill except for your blood?</p><p>“Last one.”</p><p>Hiromi shifted back and forth, left and right, thinking. On the bench Jim opened his eyes. He blinked and saw the jorogumo. His lips drew back, revealing his teeth. Hiromi saw him and hissed, her legs churning the ground.</p><p>I pointed at Jim. “Stay where you are! Hiromi, we had a deal. The last riddle.”</p><p>Hiromi bit the air with her fangs and hissed at me. “It has eyes but cannot see; it has ears but doesn’t listen; it has fangs, but it doesn’t hunt; it has a womb, but it’s shriveled and dry; it has knowledge but can’t save itself; it will die alone, regretting everything. What is it?”</p><p>Ha! “It’s me. Do you think I don’t know myself, Hiromi?”</p><p>She snarled. Spit flew from her mouth.</p><p>That’s right, rage away. You know you want a piece of me. I’m so tasty. Come get me.</p><p>Hiromi wailed in helpless fury.</p><p>She was almost there. I just had to piss her off enough. “You are stupid, Hiromi. Baka, baka Hiromi. You are dumb like a worm.”</p><p>White substance burst from behind her in wet clumps and flew to the trees and the house, unfurling into webs.</p><p>Behind me Jim tried to rise.</p><p>“Jim, stay down!” I barked. “Look at him, you had him and I took him away from you. Even if you weren’t a freak, he would never be with you. There is nothing you can do about it, Hiromi. Nothing! We will go free. You are weak! Helpless and we—”</p><p>Hiromi let out a screech and charged at me. The huge spider body swept me off my feet. Hiromi’s chitin arms grasped me and dragged me up to her mouth.</p><p>Jim pushed himself off the bench and stumbled forward, like a drunk man on wet cotton legs.</p><p>A sweet, slightly woodsy aroma drifted through the air.</p><p>Hiromi’s mouth gaped at me, the fangs dripping drool and venom.</p><p>A swarm of long yellow petals swirled around us. Wet mist slicked my skin and Hiromi’s chitin.</p><p>Jim conquered the last two feet and clamped onto Hiromi’s spider leg, trying to rip it apart.</p><p>Hiromi’s arms shook. “What is this?”</p><p>“Punishment for eating people.”</p><p>Her fingers lost their strength. I slipped through them and fell clumsily on my butt.</p><p>Hiromi reared above me on her hind limbs, the six remaining spider legs waving in the air. Her back arched, farther and farther, and for a second I thought she would crush me. The jorogumo screamed, a desperate shriek of pain and sheer terror.</p><p>Jim threw himself over me.</p><p>Hiromi twisted left, her legs jerking back and forth, rocked by spasms. She dashed into the water and smashed into the statue of Lakshmi, leaving a yellowish splatter on her side, veered left, banged into a tree, trampled through the oleander bushes, rammed herself into the fence, and spun in place, screaming. The yellow petals chased her, clinging to her skin.</p><p>I pulled Jim up into a sitting position and hugged him in case he fell. He wouldn’t remember it later anyway—far more exciting things were happening.</p><p>Hiromi’s legs churned the ground. She sprinted to the house, ran up the wall partway, until she was almost vertical, and crashed back down. Her human arms flailed. She plunged them into her body and ripped chunks of skin out.</p><p>Her front left leg snapped like a toothpick. She screeched and hammered herself into the house. A yellow stain spread on the wall. She rammed the house again and again. The brick walls shook. Tiny cracks crisscrossed Hiromi’s body. She charged the house again and her body burst. Ichor drenched the wall. The remains of the jorogumo slid down and lay still.</p><p>A sickly salty smell hit us.</p><p>“That’s a hell of a thing,” Jim said.</p><p>He came for me again. He could barely move, but he dragged himself up and threw himself at an enraged demon for my sake. It was enough to make a girl cry. Except that now the danger had passed and my head was clear. I knew I was reading too much into it.</p><p>“What did you do to her?” he asked.</p><p>“I couldn’t curse her directly, so I wrote a contract with a curse in it. She signed it with her ichor,” I said. “She gave it power over herself, and when she broke the agreement, it tore her apart.”</p><p>“And the petals?”</p><p>“Chrysanthemums.” I smiled and rested my cheek on his shoulder. “The punishment curse written into the contract. They produce pyrethrum oil. It’s deadly to insects and arachnids: It attacks their central nervous system, drives them mad, and then kills them.”</p><p>We looked at the yellow mess on the side of the house.</p><p>“My mother is going to kill me,” I said.</p><p>I TOOK THE metal teakettle off the stove and poured boiling water into the smaller ceramic one. The delicate jasmine fragrance spread through my kitchen. Around me my house was quiet.</p><p>It had taken two days to clean up my mother’s house. For two days I did nothing but scrub nasty demonic spider insides off the walls, the benches, and the rocks while Jim got to eat great food and be fussed over by my mother. Last night he got better and left. I spent the night at my mother’s and then came back to my place. The mail had piled up. Pooki probably missed me, although he didn’t say anything when I came to check on him in the garage.</p><p>It was evening now. I poured the tea and sat on my short couch.</p><p>I’d made a total fool of myself. I had kissed Jim and then I hugged him. So embarrassing. Hopefully he wouldn’t remember.</p><p>That’s what happened when you let your emotions get the better of you—you lost the ability to think clearly. Sooner or later we would have to work together. It would be so awkward. I put my hand over my face. I was by myself in the house and I was still embarrassed.</p><p>Sad, pathetic blind girl drinking her tea and hiding her face. I took a deep breath and let it out slowly. I needed another race. It would make me feel better. Somewhere in that stack of paper was the estimate from the repair shop. The sooner I gave them the okay, the faster I’d get Rambo back.</p><p>A familiar male scent tugged on me.</p><p>Oh my gods. No. No, no, no, no.</p><p>I took my hand from my eyes.</p><p>He was inside the room, leaning on the wall next to my patio door. He looked great. Like nothing ever happened.</p><p>What do I do now?</p><p>Jim raised a small wicker basket.</p><p>“What’s that?”</p><p>“That’s a steak for me and mushroom pasta for you. The pasta is made with tofu and palm oil instead of eggs. I cooked it myself. My steak is wrapped in several layers of foil. It’s not touching the container with your food, so no worries.”</p><p>Um ... He made me dinner. He cooked for me. In shapeshifter terms that was like delivering three dozen red roses with a tag that read I LOVE YOU. What in the world was he doing? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I thought you might want a change from your mother’s cooking.” Jim grinned. He looked almost unbearably handsome. “Not that it isn’t great, but three days of rice is a little much.”</p><p>“Jim ...”</p><p>“The problem with being an alpha is that you can never make the first move. Makes you feel like you’re taking advantage of your position. You have to wait until the other person decides they want in.”</p> <p>Jim set the basket on the coffee table and crouched by me.</p><p>“And sometimes it seems like that person likes you, and you try to test the waters, so you try to tell her how you feel, that she matters and that you want to be with her and you’re concerned about her safety. And every time you do that, she waves her arms around and accuses you of being a controlling alpha asshole. So you back off and hope you didn’t completely fuck it up.”</p><p>He was close, too close. I just stared at him. What was happening ... “Why are you telling me this?”</p><p>His voice was low and smooth. “That time when I told you it didn’t matter what your mother thought about your looks ...”</p><p>“Aha ...”</p> <p>“I meant it,” he said. “Because I think you’re beautiful.”</p><p>This was actually really, really happening.</p><p>He kissed me.</p><p>Oh my gods.</p><p>Dear Readers:</p><p>Writing this novella was a blast. We had a lot of fun, and we hope you enjoyed reading about these characters as much as we enjoyed writing about them. We couldn’t fit everything we wanted to into the word limit of the novella, and we have gotten so many requests from readers who want to know more about Jim and Dali’s background that we’re planning to work on a full-length novel featuring these characters in the near future.</p> <p>If you don’t want to wait to read more about the cranky jaguar, check out Gunmetal Magic, where Jim is doing what he does best: keeping the Pack safe and spying on everyone he can.</p><p>Read on for an exciting preview from the new novel in the world of Kate Daniels</p><p>GUNMETAL MAGIC</p><p>by Ilona Andrews</p><p>Available August 2012 from Ace Books</p><p>The world has suffered a magic apocalypse. We pushed the technological progress too far, and now magic has returned with a vengeance. It came like an invisible tide, ripping planes out of the sky, dropping monsters onto crowded streets, sucking the power plants dry, and jamming firearms. Some people awoke and found themselves shapeshifters. Others died, cut down by a magic-fueled disease, and rose again as mindless undead, robbed of their ability to reason and driven only by their all-consuming hunger. Gods became real, curses gained power, and telekinesis and telepathy were no longer the products of illusion and special effects.</p><p>For three days the magic raged and then it vanished without warning, leaving the world reeling, its population decimated, its cities in tatters.</p><p>Since that day, the day of the Shift, the magic comes and goes as it pleases. It floods the planet like a wave crashing on the shoreline, hissing and boiling, leaving its dangerous gifts, and then recedes once again. Sometimes a wave lasts half an hour, sometimes three days. Nobody can predict it and nobody knows what our future holds.</p> <p>But we are resilient. We will survive.</p><p>“40th Anniversary of the Shift”</p><p>The Atlanta Journal-Constitution</p><p>THUD!</p><p>My head hit the sidewalk. Candy jerked me up by my hair and slammed my face into the asphalt.</p><p>Thud!</p><p>“Hit her again!” Michelle squeaked, her teenage voice shrill.</p><p>I knew it was a dream, because it didn’t hurt. The fear was still there, that sharp, hot terror, mixed with helpless rage, the kind of fear that turns you from a human being into an animal. Things become distilled to simple concepts: I was small, they were big; I was weak, they were strong. They hurt me, and I endured.</p><p>Thud.</p><p>My skull bounced off the pavement. Blood stained my blond hair. Out of the corner of my eye, I saw Sarah take a running start like a kicker before a field goal. The flesh on her body boiled. Bones grew, muscles wound around them like cotton candy over a stick, hair sprouted, sheathing the new body, half human, half animal, in a coat of pale sandy fur dappled with telltale hyena spots. The bouda grinned at me, her malformed mouth full of fangs. I clenched up, curling my ten-year-old self into a ball. The clawed foot crashed into my ribs. The three-inch claws scraped a bone and it crunched inside me like a snapped chopstick. She kept kicking me.</p><p>Thud, thud, thud!</p><p>This was a dream. A dream grown from my memories, but still just a dream. I knew this, because ten years after my mother took eleven-year-old me and fled halfway across the country, I came back and put two bullets through Sarah’s eyes. I had emptied a clip into Candy’s left ear. I still remembered the way her skull had blossomed with red when the bullets tore out the other side. I had killed the entire werehyena clan. I wiped those bouda bitches off the face of the planet, because the world was a better place with them gone. Michelle was the only one who had escaped.</p><p>I sat up and grinned at them. “I’m waking up, ladies. Go fuck yourselves.”</p><p>My eyes snapped open. I lay in my closet, wrapped in a blanket and holding a butcher knife. The door of the closet stood slightly ajar, and the gray light of early morning slipped through the narrow gap.</p><p>Fantastic. Andrea Nash, decorated veteran of the Order, hiding in her closet with her knife and a blankie. I should’ve held on to the dream long enough to beat them into bloody pulp. At least then I wouldn’t feel so completely pathetic.</p><p>I inhaled, sampling the air. The normal scents of my apartment floated to me, the hint of synthetic apple from the soap in the bathroom, the fragrance of vanilla from the candle by my bed, and strongest of all, the stench of dog fur, a leftover from when my friend Kate’s poodle Grendel had kept me company. That freak of nature had slept at the foot of my bed, and his distinctive reek was permanently imprinted on my rug.</p><p>No intruders.</p><p>The scents were muted, which meant the magic was down.</p><p>Thud-thud-thud!</p><p>What in the world?</p><p>Thud!</p><p>Someone was pounding on my door.</p><p>I kicked off my blanket, rolled to my feet, and ran out of the closet. My bedroom greeted me: my big bed, intruder-free; the crumpled mess of the blanket on the rug; my jeans and bra, discarded last night by the bed, next to a Lorna Sterling paperback with a pirate in a poofy shirt on the cover; bookcase, stuffed to the brim; pale blue curtains on the barred window, undisturbed.</p><p>I dropped the butcher knife onto my side table, pulled on my pajamas pants, grabbed my Sig-Sauer P226 from under the pillow, and ran to the door. Waking up with a gun in my hand would’ve made a lot more sense, but no, I’d woken up clutching a knife. That meant I must’ve gotten up in the middle of the night, run into the kitchen, taken a knife from the butcher block, run back into the bedroom, grabbed a blanket, and hidden in the closet. All without realizing where I was or what I was doing. If that wasn’t crazy, I didn’t know what was.</p><p>I hadn’t slept with a knife since I was a teenager. This blast from the past wasn’t welcome and it needed to go away real fast.</p><p>Thud-thud!</p><p>I reached the door and stood on my toes to look through the peephole. A tall black woman in her fifties stood on the other side. Her gray hair stuck out from her head in a mess, she was wearing a nightgown, and her face was so twisted by worry, I barely recognized her. Mrs. Haffey. She and her husband lived in an apartment right below me.</p><p>Normally Mrs. Haffey viewed her appearance as serious business. In terms of battle readiness, she was my hero—I’ve never seen her without her makeup and hair perfectly done. Something was really wrong.</p><p>I unlocked the door.</p><p>“Andrea!” Mrs. Haffey gasped. Behind her, long white strands covered the landing and the stairwell. I was one hundred percent sure they hadn’t been there when I’d dragged myself into my apartment last night.</p><p>“What’s wrong?”</p><p>“Darin’s missing!”</p><p>I pulled her into my apartment and shut the door. “I need you to tell me from the beginning, slowly and clearly: what happened?”</p><p>Mrs. Haffey took a deep breath. She had been a cop’s wife for twenty-five years and her experience from dealing with a lifetime of emergencies kicked in. Her voice was almost steady. “I woke up and made coffee. Darin got up to take Chief outside. I took a shower. When I came out, Darin wasn’t back. I went out on the balcony, but he wasn’t in his usual spot.”</p><p>I knew exactly where the usual spot was: two stories under my bedroom window, where the Haffeys’ bulldog, Chief, preferred to mark his territory. I smelled it on my way to work every morning. Of course, Chief smelled my scent and it only made him more determined to pee his way to territorial supremacy.</p><p>“I called and called Darin, and nothing. I tried to go downstairs. There’s blood all over the landing and a white substance on the stairs and it’s blocking the way.”</p><p>“Did Mr. Haffey take his gun with him?”</p><p>Mr. Haffey had retired from the Paranormal Activity Division of the Atlanta Police Department. PAD cops took their guns seriously. As far as I knew, Darin Haffey never left the house without his Smith &amp; Wesson M&amp;P340 snub-nosed revolver.</p><p>“He always takes his gun with him,” Mrs. Haffey said.</p><p>And he hadn’t fired it, because his revolver ate .357 Magnum cartridges. When he pulled the trigger, the shot sounded like a small cannon going off. I would’ve heard the gunshot and recognized it even through the dream. Whatever happened, happened fast.</p><p>The mysterious “white substance” must’ve appeared as a result of the magic wave last night. Kate, my best friend, had warded my apartment months ago. Invisible spells shielded my place in a protective barrier. She’d covered the perimeter walls, the ceiling, and the floor. Anything magic would have a hard time breaking in, which probably explained why I’d slept safe and secure through the night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You know Darin’s blind as a bat.” Mrs. Haffey twisted her hands. “He can’t even see what he’s shooting at. The other day he comes running out of the bathroom, screaming and foaming at the mouth. He’d brushed his teeth with Aspercreme instead of toothpaste ...”</p><p>A note of hysteria slipped into her voice. At five ten, she had eight inches of height on me and she was leaning over. “I called down to the station, but they say it will be twenty minutes or longer. I thought since you were with the Order ...”</p><p>I used to be with the Order. When I was a Knight of Merciful Aid, it was my job to help people when the cops wouldn’t or couldn’t assist them with the magic hazmat. I had decorations and a stellar service record, but none of it mattered when the Order found out that I was a shapeshifter. They branded me mentally disturbed and unfit for duty and “retired” me.</p> <p>But they didn’t take away my training or my skills.</p><p>I pressed a latch in my wall. A panel slid aside, revealing a small niche that used to be a hallway closet and which I had converted into my own personal armory. A row of gun barrels gleamed in the morning light.</p><p>Mrs. Haffey clicked her mouth shut.</p><p>Let’s see. I’d be bringing my Sigs, but I needed something with more power. The AA-12, an Automatic Assault 12-gauge shotgun with a 32-round clip was always a good choice. It fired 300 rounds per minute with minimal recoil. I filled mine with steel slugs. Squeeze the trigger once, and get a single shot that would punch through a car door. Hold the trigger, and anything on the other end, no matter how much hard body armor it wore, would become a smoking pile of meat in six and a half seconds. I’d paid a fortune for it and it was worth every dollar.</p><p>I grabbed the AA-12 and put on a hip holster, into which I stuck my Sig and its twin. “Mrs. Haffey, I need you to stay here.” I gave her a nice big smile. “Lock the door behind me and don’t open it until I come back. Do you understand?”</p> <p>Mrs. Haffey nodded.</p><p>“Thank you, ma’am.”</p><p>I stepped onto the landing and heard the deadbolt slide shut behind me.</p><p>The “white substance” stretched in long pale strands over the walls. It resembled a spiderweb, if the spider was the size of a bowling ball and instead of working in a spiral had decided to weave only in a vertical direction. I crossed the landing and inhaled. Usually there was an up-draft here, the air rising from the front entrance to the top of the building. Today no movement troubled the stairway, but I smelled the sharp metallic odor of fresh blood all the same. Tiny hairs on the back of my neck stood up. The predator in me, the other me sleeping deep inside, opened her eyes.</p><p>I padded down the stairs, moving silently on the concrete steps, my shotgun ready. Even though magic made my existence possible, it didn’t mean that magic and I played nice. Give me guns over spells any day.</p><p>The web grew thicker. At the Haffeys’ landing, it swallowed the walls and the wooden stair rail. I turned, heading down. The stench of blood assaulted my nostrils and I tasted it on my tongue. All of my senses went into overdrive. My heart beat faster. My pupils dilated, improving my vision. My breathing sped up. My hearing sharpened and I caught a distant noise, muffled, but unmistakable: the deep, throaty bark of a bulldog.</p> <p>I took a few more steps down. Blood stained the stairs. A large amount, at least a couple of pints, possibly more, all in big round drops. Either someone bled and walked, or someone bled and was carried. Please don’t be Darin. I liked Darin and I liked his wife. Mrs. Haffey was always kind to me.</p><p>The first floor landing was a narrow tunnel within the web. The door to apartment 1A was intact, but buried in white strands. The same solid wall of white sealed the way downstairs, and none of it was torn. No sign of Darin going that way. The door to 1B lay in a splintered wreck. Bloody marks stretched across the threshold, pointing into the apartment. Someone had been dragged inside.</p><p>I stepped into the hallway. A new scent tugged at me, a slightly sour, prickly odor that set off instinctual alarms in my head. Not good.</p><p>The apartment had the exact same layout as mine: a narrow hallway, opening into the kitchen on the right, the living room on the left, then the first bedroom, and then a short perpendicular hallway leading to the utility room and guest bathroom, and finally to the master bedroom with a bathroom en suite.</p><p>I moved in, nice and easy, slicing the pie around the corner: starting at the wall and moving at a ninety degree angle away from it, leaning slightly away from the wall to see the threat around the corner before it saw me. Jumping around the corners was very dramatic but would get your head blown off.</p><p>Kitchen—clear.</p><p>I moved into the living room.</p><p>On the left, by a coffee table, sat a large wicker basket full of yarn. Two long wooden needles stuck out of it at an angle. Next to the basket lay a severed human arm. The blood had pooled from it, soaking the beige wall-to-wall carpet in a dark red stain.</p> <p>Pale skin. Not Darin Haffey. No, this was likely Mrs. Truman who lived in this apartment with her two cats. She liked to play bridge with her knitting club and collected yarn for “special” projects, with which she never did anything. Now her torn-off arm lay next to the basket with her knitting stash. No time to absorb and deal with it. I still had Darin to find.</p><p>I moved on. The sour prickly scent grew stronger.</p><p>Bedroom—clear. Bathroom—clear.</p><p>A huge hole gaped in the floor of the utility room. Something had smashed through the floor and tile from below.</p><p>I circled the hole, shotgun pointing down.</p><p>No movement. The floor below me looked clear.</p><p>A muffled noise cut through the quiet.</p><p>My ears twitched.</p><p>Woof! Woof!</p><p>Chief was still alive somewhere in there. I jumped into the hole, landed on the concrete floor of the basement, and moved away from the light streaming through the hole. No need to present a clear target.</p><p>Gloom filled the basement, dripping from the web into dark corners. The walls no longer existed. There was only web, white and endless.</p><p>My eyes adjusted to the darkness. Shapeshifter vision guaranteed that as long as there was some light, I wouldn’t bump into things.</p><p>Wet dark smears marred the concrete. Blood. I followed it.</p><p>Ahead the concrete split. A long fissure ran through the floor, at least three feet wide. The apartment building was already none too sturdy. The magic hated tall buildings and gnawed on them, pulverizing brick and mortar until the structure crashed down. The bigger the building, the faster it fell. Ours was too short and too small and so far we had escaped unscathed, but giant holes in the basement didn’t exactly inspire confidence.</p><p>A snorting noise came from inside the gap. I leaned over it. A whiff of dog-fur stink washed over me. Chief, you silly knucklehead.</p><p>I crouched by the hole. The bulldog squirmed below, snorting up a storm. He must’ve fallen into the fissure, and the drop was too sheer for him to jump out.</p><p>I put my shotgun on the ground and leaned in, grabbing Chief by the scruff of his neck. The bulldog weighed eighty pounds at least. What in the world were the Haffeys feeding him, small elephants? I yanked him out and jumped to my feet, shotgun in my hands. The whole thing took half a second.</p><p>Chief pressed against my leg. He was an Olde English Bulldogge, a throwback to the times when the English Bulldog was used for bull-baiting. A powerful, agile dog, Chief feared neither garbage trucks, nor stray dogs or horses. Yet here he was, rubbing against my calf, freaked out.</p><p>I took a second to bend down and pet his big head. It will be okay, boy. You’re with me now.</p><p>We started forward, moving slowly out of the first narrow room into a wider chamber. The web spanned the walls, creating hiding spots in the corners. Creepy as hell.</p><p>I carefully rounded the corner. At the far wall to my right, two furnaces sat side by side: the electric for the times when technology had the upper hand and the old-fashioned coal-burning monstrosity for use during the waves, when the magic robbed us of electric current. To the right of the coal furnace stood a large coal bin, a four-foot-high wooden enclosure filled with coal. On the coal, half-buried, lay Mr. Haffey.</p><p>Two creatures crawled on the concrete in front of the bin. About thirty inches tall and at least five feet long, they resembled huge wingless wasps, with a wide thorax-chest slimming down before flaring into thick abdomen. Stiff brown bristles covered their beige, nearly translucent bodies. Their heads, bigger than Chief’s massive skull, bore mandibles the size of garden shears. Their claws scraped the concrete as they moved—an eerie, nasty sound.</p><p>The left creature stopped and planted its six chitin-sheathed legs. Its tail end tilted up and a stream of viscous liquid shot out, adhering to the wall. The creature scrubbed its butt on the floor, anchoring the stream, and moved away as the secretions hardened into pale web.</p><p>Ew. Ew, ew, ew.</p><p>Mr. Haffey raised his head.</p><p>The creatures stopped, fixated on the movement.</p><p>I fired.</p><p>The shotgun barked, spitting thunder. The first steel slug punched into the right creature, cutting through the chitin like it was paper-thin plywood. The insect broke in half. Wet innards spilled onto the floor, like a bunch of swim bladders strung together. Without a pause, I turned and put a second shot into its buddy. Chief barked next to me, snapping his jaws. The creatures jerked and flailed, dragging their body chunks. The sour, spike-studded odor filled the air.</p><p>Darin Haffey sat up in the bin. “I see Kayla dragged you into this.”</p><p>I smiled at him. “No, sir, I just came to borrow a cup of sugar.”</p><p>“Heh.”</p><p>The web obscuring the rest of the room to my left tore.</p><p>“Incoming,” Mr. Haffey snapped, raising his firearm.</p><p>The first insect burst into the open. I fired. Boom!</p><p>Two more. Boom, boom!</p><p>Boom!</p><p>Boom, boom, boom!</p><p>The broken chitin bodies crashed into each other, making a pile of jerking legs and vomit-inducing entrails.</p><p>Boom, boom, boom! Boom!</p><p>An insect leaped over the pile, aiming for me. I swung the shotgun up. The impact exploded the creature’s gut, spraying foul liquid over me. Bug juice burned my lips. Ugh.</p><p>A smaller insect dashed toward me. Sharp mandibles sliced at my leg. You bastard! Chief rammed the creature, ripping into the thing before I could sink a slug into it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Boom! Boom!</p><p>I kept firing. Finally the revolting flood stopped. I waited, listening, but no more skittering came. My calf burned. The pain didn’t bother me too much, but I’d be leaving a blood trail, which would make me ridiculously easy to track. I had five shots left in the AA-12. No way to know if I had killed them all or if this was the calm before the second wave of insects. I had to get Mr. Haffey out of here.</p><p>He was sitting in the coal bin, staring at the pile of insect parts. “Damn. That’s some shooting.”</p> <p>“We aim to please,” I told him.</p><p>“You aim like you mean business.”</p><p>Funny thing, praise. I knew I was a great shot, but hearing it from the PAD veteran made me all warm and fuzzy anyway. “Have you seen Mrs. Truman?”</p><p>“I saw her body. They ripped her to pieces, the assholes.”</p><p>Poor Mrs. Truman. “Can you walk?”</p> <p>“The fuckers got me in the leg. I’m bleeding like a stuck pig.”</p><p>That’s why he’d hidden in the coal. He’d buried his leg in the coal dust to smother the scent. Smart. “Time to go, then.”</p><p>“You listen to me.” Mr. Haffey put some cop hardness into his gruff voice. “There’s no way for you to get me out. Even if I lean on you, I’m two hundred and twenty pounds and my weight will just take you down with me. Leave me a gun, and you get out of here. Kayla must’ve called over to the station. I’ll hold them off until ...”</p><p>I swung the shotgun over my shoulder and picked him up out of the coal. I wasn’t as strong as a normal shapeshifter, although I was faster and more agile, but a two-hundred-pound man still wasn’t a challenge.</p><p>I double-timed it to the hole, Chief at my heels. The bulldog had a death grip on a chitinous leg as long as he was. He had to lean his head back to carry it, but the look in his eyes said no army in the world could take it away.</p><p>“This is embarrassing,” Mr. Haffey informed me.</p> <p>I winked at him. “What, Mrs. Haffey never carried you over the threshold on your wedding night?”</p><p>His eyes bulged. “That’s just ridiculous. What are you?”</p><p>I’d spent most of my life pretending to be human. But now the hyena was out of the bag, and sooner or later I had to start owning up to it. “A shapeshifter.”</p><p>“Wolf?”</p><p>“A bouda.” Well, not exactly. The truth was more complicated, but I wasn’t ready for those explanations yet.</p><p>We reached the hole. If I were a regular bouda, I could’ve jumped out of the hole with Mr. Haffey in my arms. But I knew my limits and that wasn’t happening. Throwing him out would injure his dignity beyond repair. “I’m going to lift you. Can you pull yourself up?”</p><p>“Is the Pope Catholic?”</p><p>I lowered him down, grabbed him by the hips, and heaved. Mr. Haffey pulled himself over the ledge and I got a real close look at that wound. It was a four-inch rip down his leg and touching his sweatpants left my palm bloody. He needed an ambulance yesterday.</p> <p>I tossed Chief and his prize out of the hole, jumped, caught the edge, and hopped up.</p><p>“Will you at least carry me fireman-style?” Mr. Haffey huffed.</p><p>“No can do, sir. I’m trying to keep your blood from dripping out of your leg.”</p><p>He growled deep under his breath.</p><p>I picked him up and started out. “It will all be over soon.”</p><p>He guffawed.</p><p>I caught the familiar scuttling sound behind me, coming from the master bedroom.</p><p>“I thought the Order didn’t allow shapeshifters.”</p><p>“They don’t. When they figured me out, they fired me.”</p><p>The scuttling chased us.</p><p>“That’s bullshit right there.” Mr. Haffey shook his head. “And discrimination. You talk to your union rep?”</p><p>“Yes, I did. I fought it as long as I could. Anyway, they retired me with full pension. I can’t appeal.”</p><p>Mr. Haffey gave me an appraising look. “You took it?”</p><p>“Nope. Told them to shove it.”</p><p>I dropped him to the floor as gently as I could and spun, shotgun ready.</p><p>A huge pale insect lunged at us. I pumped two slugs into it and it thrashed on the floor. I gathered Mr. Haffey up and double-timed it to the door.</p><p>“Listen, most of my contacts have retired, but a few of us have kids in the department. If you need a job, I can probably fix up something. The PAD will be glad to have you. You’re a hell of a shot. Shouldn’t let that go to waste.”</p><p>“Much appreciated.” I smiled. “But I’ve got a job. I work for a business. My best friend owns it.” I started up the stairs.</p><p>“What sort of business?”</p><p>“Magic hazmat removal. Protection. That type of thing.”</p><p>Mr. Haffey opened his eyes. “Private cop? You went private?”</p><p>That’s cop mentality for you. I tell him I’m a shapeshifter and he doesn’t blink an eye. But private cop, oh no, that’s not okay.</p><p>“So how’s business?” Mr. Haffey squinted at me.</p><p>“Business is fine.” If by fine, one meant lousy. Between Kate Daniels and me, we had a wealth of skills, a small sea of experience, and enough smears on our reputation to kill a dozen careers. All of our clients were desperate, because by the time they came to us, everybody else had turned them down.</p><p>“What does your man think about that?”</p><p>Raphael Medrano. The memory of him was so raw, I could conjure his scent by just thinking about him. The strong male healthy scent that drove me crazy ...</p><p>“It didn’t work out,” I said.</p><p>Mr. Haffey shifted, uncomfortable. “You need to drop that silliness and get back in uniform. We’re talking retirement, benefits, advance in rank and pay ...”</p><p>I ran up to my door. “Mrs. Haffey!”</p><p>The door swung open. Mrs. Haffey’s face went slack. “Oh my God, Darin. Oh God.”</p><p>In the distance the familiar sirens blared.</p><p>THE CAVALRY ARRIVED with guns and in large numbers. They loaded Mr. Haffey into an ambulance, thanked me for my help, and told me that since I was a civilian, I needed to keep the hell out of their way. I didn’t mind. I’d killed most of what was down there and they had gotten all dressed up and gone through the trouble of bringing flamethrowers. It was only fair to let them have some fun.</p><p>I tended the cut on my leg. There wasn’t much to do about it. Lyc-V, the virus responsible for shapeshifters’ existence, repaired injuries at an accelerated rate, and by the time I got to it, the gash had sealed itself. In a couple of days, the leg would be like new, without scars. Some Lyc-V gifts were useful. Some, like berserker rage, I could live without.</p><p>I was scrubbing the bug juice off my face with my makeup removal washcloth, when the phone rang. I wiped the soap off my face and sprinted into the kitchen to pick it up.</p><p>“Hello?”</p><p>“Nash?” a smooth voice said into the phone.</p><p>The smooth voice belonged to Jim, a werejaguar and the Pack’s security chief. He usually went by Jim Black, if you didn’t know him well. I’d dug through his background during my tenure with the Order. His real name was James Damael Shrapshire, a fact I kept to myself, since he didn’t advertise it.</p><p>Atlanta’s Shapeshifter Pack was the strongest in the nation, and my relationship with it was complicated. But the Pack backed Cutting Edge, the business Kate owned and for which I now worked. They had supplied the seed money and they were our first priority client.</p><p>“Hey, Jim. What can I do for you?” Jim wasn’t a bad guy. Paranoid and secretive, but then cats were odd creatures.</p><p>“One of our businesses got hit last night,” Jim said. “Four people are dead.”</p><p>Someone obviously had a death wish and that someone wasn’t very bright, because there were much easier ways of committing suicide. The Pack took care of their own and if you hurt their own, they made it a point to take care of you. “Anybody I know?”</p><p>“No. Two jackals, a bouda, and a fox from Clan Nimble. I need you to go down there and check it out.”</p><p>I headed into the bedroom. “No problem. But why me?”</p><p>Jim sighed into the phone. “Andrea, how many years did you spend as a knight?”</p><p>“Eight.” I began pulling my clothes onto the bed: socks, work boots, jeans ...</p><p>“How many of those did you spend on active cases?”</p><p>“Seven.” I added a box of ammo to the clothes pile on the bed.</p><p>“That’s why. You’re the most experienced investigator I’ve got who’s not tied up in something, and I can’t ask the Consort to look into it, because A) she and Curran are working on something else and B) when the Consort gets involved, half of the world blows up.”</p><p>Kate the Consort. The title still made me grin. Every time someone used it, she got this martyred look on her face.</p><p>“This mess looks to be complicated and the cops are in up to their elbows. I need you to go down there and untangle it.”</p><p>Finally. Something I could actually sink my teeth into.</p><p>I held the phone between my shoulder and my ear and took a pencil and a notepad off the nightstand. “You’ve got an address?”</p><p>“Fourteen-twelve Griffin.”</p><p>Griffin Street ran through SoNo, one of the former financial districts, sandwiched between Midtown and Downtown. The name came from “South of North Avenue.” It was a bad, unstable area, with old office buildings crashing down left and right.</p><p>“What were the shapeshifters doing there?”</p><p>“Working,” Jim said. “It’s a reclamation site.”</p><p>Reclamations. Oh no. No. He wouldn’t do that to me. I kept my voice even. “Who was in charge of the site?”</p><p>Please don’t be Raphael, please don’t be Raphael, please don’t ...</p><p>“Medrano Reclamations,” Jim said.</p><p>Damn it.</p><p>“Raphael is being questioned by some cops, but I’ve sent some lawyers down to make sure they don’t keep him. He’ll join you as soon as they spring him out of there. Look, I know things aren’t good between you and Raphael, but we all have to do things we don’t want to do.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>“Jim,” I cut him off. “I’ve got it. A job is a job. I’m on it.” </p>  </body></html>"]