["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p> Prologue</p><p>Andrew</p><p>New York City</p><p>Six years ago...</p> <p>For the third week in a row, I woke up to a relentless rain falling over this repulsive city. The clouds above were coated in an ugly hue of grey, and the streaks of lightning that flashed across the sky every few seconds were no longer marvels; they were predictable.</p><p>Holding up my umbrella, I walked to a newspaper stand and picked up The New York Times—bracing myself for what lay between its pages.</p><p>“How many women do you think a man could possibly screw in his lifetime?” The vendor handed me my change.</p><p>“I don’t know,” I said. “I’ve stopped counting.”</p><p>“Stopped counting, eh? What did you do, get to ten and decide that was enough before settling down?” He pointed to the gold band on my left hand.</p> <p>“No. I settled down first, then I started f**king.”</p><p>He raised his eyebrow—looking stunned, and then he turned around to organize his cigar display.</p><p>A couple of months ago, I would’ve entertained his attempt to make conversation, would’ve answered his question with a lighthearted laugh and a “More than we’ll ever admit to,” but I didn’t have the ability to laugh anymore.</p><p>My life was now a depressing reel of repeated frames—hotel nights, cold sweats, marred memories, and rain.</p><p>Goddamn rain.</p><p>I tucked the newspaper underneath my arm and turned away, glancing at the ring on my hand.</p> <p>I hadn’t worn it in a long time, and I had no idea what possessed me to put it on today. Twisting it off my finger, I looked at it one last time—shaking my head at its uselessness.</p><p>For a split second, I considered keeping it, maybe locking it away as a reminder of the man I used to be. But that version of me was pathetic—gullible, and I wanted to forget him as fast as I could.</p><p>I crossed the street as the light turned green, and as I stepped onto the sidewalk, I tossed the band where I should’ve thrown it months ago.</p><p>Down the drain.</p><p>Exculpatory Evidence (n.):</p><p>Evidence indicating that a defendant did not commit the crime.</p><p>Andrew</p><p>Present Day</p> <p>The hot coffee that was currently seeping through my pants and stinging my skin was the exact reason why I never f**ked the same woman twice.</p><p>Wincing, I took a deep breath. “Aubrey...”</p><p>“You’re f**king married.”</p><p>I ignored her comment and leaned back in my chair. “In the interest of your future short-lived and mediocre law career ̧ I’m going to do two huge favors for you: One, I’m going to apologize for f**king you a second time and let you know that it will never happen again. Two, I’m going to pretend like you didn’t just assault me with some goddamn coffee.”</p><p>“Don’t.” She threw my coffee mug onto the floor, shattering it to pieces. “I definitely did, and I’m tempted to do it again.”</p><p>“Miss Everhart—”</p><p>“Fuck you.” She narrowed her eyes at me, adding, “I hope your dick falls off,” as she stormed out of my office.</p><p>“Jessica!” I quickly stood up and grabbed a roll of paper towels. “Jessica?”</p><p>No answer.</p><p>I picked up my phone to call her desk, but she suddenly stepped into my office. “Yes, Mr. Hamilton?”</p><p>“Call Luxury Dry Cleaning and have them to deliver one of my suits to the office. I also need a new cup of coffee, Miss Everhart’s file from HR, and you need to tell Mr. Bach that I’ll be late to that four o’ clock meeting today.”</p><p>I waited to hear her usual “Right away, sir” or “I’m on it, Mr. Hamilton,” but she said nothing. She was silent—blushing, and her eyes were glued to the crotch of my pants.</p><p>“Don’t you need some help cleaning that up?” Her lips curved into a smile. “I have a really thick towel in my desk drawer. It’s very soft...and gentle.”</p><p>“Jessica...”</p><p>“It is huge, isn’t it?” Her eyes finally met mine. “I really wouldn’t tell a soul. It would be our little secret.”</p><p>“My f**king dry cleaning, a new cup of coffee, Miss Everhart’s file, and a message to Mr. Bach about me being late. Now.”</p><p>“I really love the way you resist...” She stole another glance of my wet pants before leaving the room.</p><p>I sighed and started to soak up as much of the coffee as I could. I should’ve known that Aubrey was the emotional type, should’ve known that she was unstable and incapable of behaving normally the second I realized she’d made up a fake identity just for LawyerChat.</p><p>I regretted ever telling her that I wanted to own her pu**y, and I was cursing myself for driving to her apartment yesterday.</p><p>Never again...</p><p>Just as I was tearing off a new paper towel, a familiar voice cleared the air.</p><p>“Why, hello...It’s good to see you again,” she said.</p><p>I lifted my head up, hoping that this was a hallucination—that the woman at my door wasn’t really standing there smiling. That she wasn’t stepping forward with her hand outstretched as if she wasn’t the very reason that my life was heartlessly altered six years ago.</p><p>“Are you going to shake my hand, Mr. Hamilton?” She raised her eyebrow. “That is the name you’re going by these days, isn’t it?”</p><p>I stared at her long and hard—noticing that her once silky black hair was now cut short into a bob. Her light green eyes were still as soft and alluring as I remembered them, but they weren’t having the same effect.</p><p>All the memories I’d tried to suppress over the past few years were suddenly playing right in front of me, and the blood under my skin was starting to boil.</p><p>“Mr. Hamilton?” she asked again.</p><p>I picked up my phone. “Security?”</p><p>“Are you f**king kidding me?” She slammed the phone down. “You’re not going to ask why I’m here? Why I came to see you?”</p><p>“Doing so would imply that I care.”</p><p>“Did you know that when most people get sentenced to prison, they get care packages, money orders, even a phone call on their first day?” She clenched her jaw. “I got divorce papers.”</p><p>“I told you I’d write.”</p><p>“You told me you’d stay. You told me you forgave me, you said that we could start over when I got out, that you would be right there—”</p><p>“You f**king ruined me, Ava.” I glared at her. “Ruined me, and the only reason I said those dumb ass things to you was because my lawyer told me to.”</p><p>“So, you don’t love me anymore?”</p><p>“I don’t answer rhetorical questions,” I said. “And I’m not a geography expert, but I know damn well that North Carolina is outside of New York and a direct violation of your parole. What do you think will happen when they find out you’re here? Do you think they’ll make you serve out the sentence that you more than f**king deserve?”</p><p>She gasped. “You would snitch on me?”</p><p>“I would run my car over you.”</p><p>She opened her mouth to say something else, but my door opened and the security team walked in.</p><p>“Miss?” The lead guard, Paul cleared his throat. “We’re going to need you to vacate the premises now.”</p><p>Ava scowled at me, shaking her head. “Really? You’re really going to let them haul me off like I’m some kind of animal?”</p><p>“Once again, rhetorical.” I sat down in my chair, signaling for Paul to get rid of her.</p><p>She said something else, but I tuned it out. She didn’t mean shit to me, and I needed to find someone online tonight so I could f**k her random and unwanted appearance out of my mind.</p><p>Evasion (n.):</p><p>A subtle device to set aside the truth, or escape the punishment of the law.</p><p>Aubrey</p><p>Andrew was the epitome of what it meant to be an ass**le, a shining example of what that word stood for, but no matter how pissed I was, I hadn’t been able to stop thinking about him.</p><p>In the six months that we’d spoken, he’d never mentioned a wife. And the one time I’d asked if he’d ever done anything more than “One dinner. One night. No repeats.” –he’d said “Once,” and quickly changed the subject.</p><p>I’d been replaying that conversation in my mind all night, telling myself to accept that he was a liar, and that I needed to move on.</p><p>“Ladies and gentlemen of La Monte Art Gallery...” My ballet instructor suddenly spoke into a mic, cutting through my thoughts. “May I have your attention please?”</p><p>I shook my head and looked out into the full audience. Tonight was supposed to be one of the highlights of my dance career. It was an exhibition for the city’s college dancers. All of the leading performers for spring productions were supposed to dance a two minute solo in honor of their school, in celebration of what was to come months later.</p><p>“This next performer you’re about to see is Miss Aubrey Everhart.” There was pride in his voice. “She is playing the role of Odette/Odile in Duke’s production of Swan Lake, and when I tell you that she is one of the most talented dancers I’ve ever seen...” He paused as the crowd’s chatter dissolved into silence. “I need you to take my word for it.”</p><p>One of the photographers in the front row snapped a picture of me, temporarily rendering me blind by the flash.</p><p>“As most of you know,” he continued, “I’ve worked with the best of the best, spent countless years in Russia studying underneath the greats, and after a long and illustrious career with the New York Ballet Company, I’ve retired to teach those with untapped potential.”</p><p>There was a loud applause. Everyone in the room knew who Paul Petrova was, and even though most in the field were confused as to why he would ever want to teach in Durham, no one dared to question his decision.</p><p>“I hope you’ll come out and see the first transformation of the Duke ballet program in the spring,” he said as he slowly walked to the other side of the stage. “But for now, Miss Everhart will perform a short duet from Balanchine’s ‘Serenade,’ with her partner Eric Lofton!”</p><p>The audience clapped again, and the lights above them dimmed. A soft spotlight shone on me and Eric, and the violinists began to play.</p><p>Short, soft notes filled the room, and I stood on my toes—trying to dance as delicately as the music demanded. Yet, with each step, all I could picture was Andrew kissing me, f**king me, and ultimately lying to me.</p><p>“I’ve never lied to you, Aubrey. I trust you for some strange reason...”</p><p>I pushed Eric away when he held out his hands, and twirled across the stage until he came after me. He held my face in his hands—as if he was begging me to stay, but I spun away again, launching myself into a full set of nonstop pirouettes.</p><p>I was angry, I was hurt, and I wasn’t holding anything back as I showed off just how well I could dance en pointe.</p><p>The second the violinists struck the last note, the audience let out a collective gasp and applauded the loudest they had all night.</p><p>“Wow...” Eric whispered as he took a bow next to me. “I don’t think anyone will talk shit about you getting the swan role after that...”</p><p>“People have been talking shit about me?” I raised my eyebrow, but I already knew the answer to that. A junior landing the top role over all the seniors was unheard of.</p><p>“Bravo, Miss Everhart.” Mr. Petrova walked over to me. “She’s going to blow you all away in the spring, I’m sure of it!”</p><p>Another round of applause began to build and he moved the mic away from his mouth. “Where are your parents? I’d like for them to come up for a picture.”</p><p>“They’re out of town.” I lied. I hadn’t wasted my time even attempting to invite them to this.</p><p>“Well, that’s too bad!” he said. “I’m sure they’re very proud of you. You can exit the stage now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Thank you.” I headed into the dressing room and changed into a short white silk dress and a grey feathered headband. As I looked myself over in the mirror, I smiled. There was no way anyone could tell that I was an emotional wreck inside.</p><p>I pulled out my phone and noticed a new voicemail from GBH. I knew it was about me missing my internship for the fourth day in a row, so I deleted it. Then something came over me and I googled “Andrew Hamilton” for the umpteenth time this week—hoping something would pop up.</p><p>Nothing. Again.</p><p>With the exception of his perfect, poised photo on GBH’s website and that less than telling bio, there was no information about him anywhere.</p> <p>I tried “Andrew Hamilton: New York, lawyer,” but the results were just as dismal. It was as if he hadn’t come into existence until starting at GBH.</p><p>“Great performance, Aubrey...” Jennifer, one of Duke’s top seniors, suddenly stepped into the bathroom. “It really is an honor watching someone so young and underdeveloped get unnecessary credit.”</p><p>I rolled my eyes and zipped my purse.</p><p>“Tell me something,” she said. “Do you honestly think you’re going to last until the spring performance?”</p><p>“Do you honestly think I’m going to stand here and continue this dumbass conversation?”</p> <p>“You should.” She smirked. “Because between you and me, four years ago—back before your time...There was a certain dancer picked to be the lead in Sleeping Beauty, a double major. She was quite talented—a natural really, but she caved under pressure because she couldn’t devote as many hours to the craft as the dancers who only wanted to dance.”</p><p>“Is there a point to this story?”</p><p>“I took her spot and I was only a freshman.” She smiled. “Now I’m a senior, and a certain someone is dancing in the role that belongs to me. So, just like back then, I’m going to do everything in my power to make sure I get what’s rightfully mine.”</p><p>I shook my head and moved past her, ignoring the fact that she whispered “stupid bitch” under her breath. I was supposed to return to the gallery room and watch the other performers, but I needed a break.</p><p>I slipped past the sliding doors to the other side of the room and stepped into the gallery’s bistro. It was much quieter on this side, and the people sitting at the tables seemed to be preoccupied with conversations not centered on ballet.</p><p>“Miss?” A tuxedoed waiter stepped in front of me with a tray. “Would you be interested in a complimentary glass of champagne?”</p> <p>“Two please.”</p><p>He raised his eyebrow, but handed me two glasses anyway.</p><p>With no grace whatsoever, I tossed one back, then the other—licking the rims to make sure I didn’t miss a drop.</p><p>“Where’s your bar?” I asked.</p><p>“Our bar? I don’t think the patrons of the art gallery are permitted to—”</p><p>“Please don’t make me ask again.”</p><p>He pointed to the other side of the room where a few smokers were sitting, and I walked toward them.</p><p>“What can I get for you tonight, Miss?” The bartender smiled as I approached. “Would you like to try one of our house specials?”</p> <p>“Can any of those help me forget about sleeping with a married man?”</p><p>The smile on his face faded and he set out three shot glasses, filling them with what I could only hope was the strongest liquor in the house.</p><p>I slid my credit card across the counter and downed the first one in seconds—shutting my eyes as the burning sensation crawled down my throat. I held the next one against my lips, but I suddenly heard a familiar laugh.</p><p>It was low and gravelly, and I’d heard it a million times before.</p><p>I turned around and spotted Andrew sitting at a table with a woman who was not his wife. I didn’t want to admit it, but she was pretty. Very, very pretty: Auburn hair with blond highlights, deep green eyes, and perky br**sts that were too perfect to be natural.</p><p>She was rubbing him on his shoulder and giggling every ten seconds.</p><p>Andrew seemed undaunted by her affection, and as he signaled for the check, I could only assume how their night would end.</p><p>I tried to turn away—to act like seeing him with someone else wasn’t affecting me, but I couldn’t help it.</p><p>His date was now leaning over the table—purposely putting more of her cle**age on display, and whispering words that were hard to read. As she playfully licked her lips and stroked his chin with her fingertips, I realized I couldn’t take it anymore.</p><p>Subject: SERIOUSLY?!</p><p>Are you really on a date right now with someone who isn’t your wife?! It’s bad enough that you’re a cheating and lying philanderer, but are you really that much of a sex addict?</p><p>—Aubrey</p><p>His response came within seconds.</p><p>Subject: Re: SERIOUSLY?!</p><p>I’m really on a date right now with someone who’s not going to leave third degree burns on my dick. And I’m not a sex addict, I’m a pu**y addict. There’s a difference.</p><p>—Andrew</p><p>Subject: Re: Re: SERIOUSLY?!</p><p>You are a disgusting and vile ass**le, and I honestly regret ever sleeping with you.</p><p>—Aubrey</p><p>No response.</p><p>I watched as he looked down at his phone and raised his eyebrow. He turned around in his chair—slowly scanning the room until he found me.</p><p>His eyes widened the second they met mine, and his lips slowly parted. His gaze traveled up and down my body, and I could practically feel him undressing me.</p><p>There was suddenly no one else in the room but the two of us and I could tell that he wanted me to come to him—right here, right now. I felt my body responding to his stares, felt my ni**les hardening as he dragged his tongue against his lips.</p><p>I swallowed as I looked him over, realizing that I’d pictured his hair entirely wrong in my dreams this week. I’d finger f**ked myself for hours on end last night—using his face and the memories of his voice for inspiration, and seeing him in person only made me want to feel his c**k inside of me again.</p><p>I leaned forward, wanting to go to him, but my tunnel vision started to clear and I saw that we weren’t alone in this room.</p><p>Far from it.</p><p>His date’s perfectly manicured hand found its way to his chin, and turned his head away.</p><p>I followed suit and asked for two more drinks. I gulped them both and when I looked over my shoulder, I saw that Andrew was staring in my direction with undeniable want in his eyes.</p><p>I forced a smile and opened my mouth very slowly, mouthing, “Fuck. You.” before leaving. I snatched a handful of mints from a random waiter’s tray and rushed back toward the gallery.</p><p>I was halfway there when I felt my phone vibrating. An email.</p><p>Subject: Meet me in the bathroom.</p><p>NOW.</p><p>—Andrew</p><p>I turned off my phone and continued walking toward the gallery doors—damn near running. I reached the lobby, but someone grabbed my arm and pulled me across the room.</p><p>Andrew.</p><p>I tried to jerk away, but he tightened his hold and looked back at me—giving me a ‘Don’t Fuck with Me’ look as the people around us whispered.</p><p>He pulled me into a bathroom and locked the door, narrowing his eyes at me. “You think I’m disgusting?”</p><p>“Extremely.” I stepped back. “I’ve lost what little respect I had for you and if you even try to put your hands on me, I’ll scream.”</p><p>“I don’t doubt that.” A trace of a smile grazed his lips, but it didn’t stay. “You haven’t shown up to work for four straight days. You think just because I f**ked you that I won’t fire you?”</p><p>“I don’t give a f**k whether you fire me or not! Have you ever thought about why I haven’t shown up to work?”</p><p>“Incompetence?”</p><p>“You’re f**king married! Married! How could you—” I shook my head as he closed the gap between us. “How could you leave that part out?”</p><p>“I didn’t,” he said. “And for the record...I’m not technically married, Aubrey.”</p><p>“I’m not technically stupid, Andrew.”</p><p>“You’re making it very difficult to talk to you right now...” His lips were nearly brushing against mine.</p><p>“That’s because you’re not making any f**king sense.” I freed myself from his grasp and headed for the door, but he grabbed me by my shoulders and slammed me against the wall.</p><p>“It’s a contested divorce,” he hissed. “If you were a real lawyer I’m sure I wouldn’t have to explain what the hell that term means, but since you’re not—”</p><p>“It means that you’re still legally married. It means that if you die before the papers go through, that your wife—which is what she is, will still be entitled to everything you ever owned. It means that you’re a LIAR! A f**king liar, who is apparently exempt from his own stupid and ineffectual rules!”</p><p>“I filed.” He gritted through his teeth. “She refused to sign, and there’s a lot of complicated shit that I’ll never feel like discussing, but we’ve been separated and out of touch for over six years. Six. Years.”</p><p>I shrugged and tried to put on my best poker face, ignoring the fact that my heart was skipping every other beat as he wiped my tears away with his thumb.</p><p>“I’ve never lied to you, Aubrey,” he said sternly. “You asked me before if I’d ever lied to you and that answer is still the same. I don’t talk about my life before Durham with anyone, but yes, I did once have a wife and she showed up to my office on her own. I didn’t call her, I never will, and I haven’t called her since I left New York. Our case is extremely complicated and I prefer not to think about it.”</p><p>“I don’t care,” I said. “You’re still wrong. You still neglected to tell me about her for six months. Six. Months!”</p><p>“At what point was I supposed to bring that shit up?” His face turned red. “In between f**king you over the phone? When I was begging your lying ass to meet me in person? When I was unknowingly helping you with your f**king homework?”</p><p>“How about before you f**ked me?” I hated that being around him pulled emotions out of me. I couldn’t pretend to act unaffected if I tried. “How about then?”</p><p>He clenched his jaw, but he didn’t say a word.</p><p>“That’s what I thought,” I said, knowing that I’d won this. “Now, I’m sure you and your lovely D-cup breasted date have a room reserved across the street, so if you don’t mind—”</p><p>“There’s nothing going on between me and my soon to be ex-wife,” he said harshly. “Nothing. And I do have a room reserved across the street. I’ve had the same one reserved for the past four nights with four different women, but I’ve been unable to f**k any of them because I can’t seem to stop thinking about my incompetent-ass-intern and how I only want to f**k her.”</p><p>Silence.</p><p>“Do you...” I shook my head. “Do you honestly think saying shit like that is a turn-on?”</p><p>“Yes...” He trailed his fingers underneath my dress, slightly brushing his thumb against the crotch of my soaked panties. “And apparently you do too...”</p><p>“Me being wet just means that I can’t control my body’s reaction to you. It doesn’t mean that I want to have sex with you. I hate you.”</p><p>“I’m pretty sure that you don’t.” He slipped his hand around my waist and pulled me close—making my breathing slow.</p><p>“Get your hands off me...”</p><p>“Say it more convincingly and I will.” He waited for my request, raising his eyebrow, but I couldn’t bring myself to say those words.</p><p>We stood staring at each other for several minutes, letting that raw, palpable tension build between us before I finally broke the silence. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I think you should get back to your date...” My voice was a whisper. “You’ve said all you had to say so...What more could you possibly want from me?”</p><p>“In this moment?” He trailed his finger against my collarbone.</p><p>“In general...” I turned my cheek before he could kiss me. “I’m never sleeping with you again, I’ll be formally resigning by the end of the week, and I think we need to end our so-called friendship for good.”</p><p>“You mean that?” he whispered.</p> <p>“Yes, I mean that.” I ignored the feel of his hand squeezing my ass. “I want to be friends with someone who’s interested in more than my pu**y.”</p><p>“I’m interested in your mouth, too.”</p><p>I had no response for that, and he must’ve sensed it because he tightened his grip on my waist.</p><p>“I know how hard it is for you to tell the truth,” he said softly, “so I need you to be completely honest when I ask you these next few questions. Can you do that?”</p><p>I nodded, breathlessly, and he leaned closer to my lips. “You don’t enjoy f**king me?”</p> <p>“That’s not the issue.”</p><p>“That’s not the answer. Tell me.”</p><p>I ignored the loud beating in my chest. “I do enjoy it...”</p><p>“Are you really resigning?” He kissed me.</p><p>“No...I just—” I sucked in a breath as his hand cupped my right breast, as he squeezed it. Hard.</p><p>“You just what?”</p> <p>“I want to be reassigned to another lawyer, and I don’t want to see you any more than I have to...”</p><p>He stared into my eyes for a long time, not saying a word as he finally let me go. “That’s how you truly feel?”</p><p>“Seeing as I’m the only one between us who actually feels anything, yes. Yes, that is how I really feel about you.”</p><p>He blinked. Then he suddenly pulled me back into his arms and crushed his lips onto mine.</p><p>“Why are you such a f**king liar, Aubrey?” He hissed. Pushing me against the vanity, he bit down on my bottom lip and snatched the feathered headband out of my hair.</p><p>Keeping his lips on mine, he pushed my dress up my waist—ripping off my panties with one pull.</p><p>“Andrew...” I tried to catch my breath as he picked me up and set me on the sink. “Andrew, wait...”</p><p>“For what?” He grabbed my hand and placed it over his belt, telling me to unbuckle it.</p> <p>I didn’t answer him. I slipped my fingers underneath the metal clip and unclasped it as he pressed his mouth against my neck.</p><p>Trailing his tongue against my skin, he whispered, “You haven’t missed me f**king you?”</p><p>“It was only twice.” I sucked in a breath as his hands caressed my thighs. “Not enough to miss anything...”</p><p>He bit me harshly and leaned back, glaring at me.</p><p>My breath caught in my throat as he slipped two fingers inside my pu**y and teasingly moved them in and out.</p><p>“It feels like you’ve missed f**king me...” He pushed his fingers as deep as they could go, making me moan softly.</p><p>I arched my back as he stroked my clit with his thumb.</p><p>He suddenly pulled his fingers out of me and brought them up to his lips, slowly licking them. “It tastes like you’ve missed f**king me, too.” He pressed another finger against my throbbing wet clit and then he brought it up to my face—placing it against my lips. “Open your mouth.”</p><p>I slowly parted my lips, and he narrowed his eyes as he slid his finger against my tongue. I felt his c**k rub against my thigh, felt him using his other hand to wrap my leg around his waist.</p><p>“Tell me that you don’t want to f**k me,” he said. “That you don’t want me to bury my c**k deep inside of you right now.”</p><p>He grabbed my face and pressed his lips against mine, drawing my bottom lip into his mouth with his teeth.</p><p>I was sliding off the edge of the counter, about to fall, but he suddenly pressed me back against the mirror.</p><p>I kept my eyes locked on his as he unwrapped a condom, as he put it on and stared at me with that same angry expression he’d been wearing all night.</p><p>He grabbed me by my ankles and pulled me forward, sliding his c**k into me as my legs gripped his waist.</p><p>My hands clawed at his neck as he pounded into me again and again.</p><p>“I’ve missed f**king you,” he rasped, threading his fingers into my hair and pulling my head back. “But you haven’t thought about me at all?”</p><p>“Ahhh!” I screamed as he sped up his thrusts. I squeezed my legs around him even tighter, trying my best not to give in.</p><p>I shut my eyes and heard him saying my name—panting, “Fuck, Aubrey...Fuck...”</p><p>“Put your hands on the counter...” he commanded, but I ignored him and tightened my grip around his neck.</p><p>“Aubrey...” He bit my shoulder again, still f**king me harder than ever. “Put your hands on the counter. Now.”</p><p>I slowly unclasped my hands from around him and lowered them to my sides—gripping onto the cold counter. The next thing I felt was his tongue swirling around my ni**les, roughly sucking my br**sts.</p><p>I gripped the tile harder as his kisses became more ravenous—more possessive, and as he f**ked me harder and harder I felt myself on the verge of losing control.</p><p>“Andrew....” I moaned. “Andrew....”</p><p>He released my nipple from his mouth and slid his hands underneath my thighs, picking me up and pinning my back against the wall.</p><p>“I know you love the way I f**k you, Aubrey...” He looked into my eyes, forcing his c**k even deeper into my pu**y. “And I know you’ve touched yourself every night this week, wishing it was my c**k inside of you instead of your fingers.”</p><p>My clit throbbed with his every word, and I was wetter than I’d ever been in my life.</p><p>“Tell me it’s true...” He pressed his lips against mine and slipped his tongue into my mouth—muffling my moans with an angry, unrelenting kiss. “Finally tell me something that’s f**king true...”</p><p>Tremors traveled up and down my spine, and I was seconds away from coming, but he wouldn’t let my mouth go.</p><p>He was still kissing me—glaring at me, begging me to tell him the truth.</p><p>I nodded, hoping that he could read my eyes and see that I needed him to let go of me, I needed to be able to breathe.</p><p>He slammed into me one last time—hitting my spot, and I managed to tear my mouth away from his.</p><p>“Yessssss!” My head fell forward into his shoulder and I gasped for air.</p><p>“Aubrey...” He gripped my waist until he stopped shaking.</p><p>As we both came back down, there were few random knocks at the door, a few “Is anybody in there?” taps, but both us remained silent and breathless.</p><p>Minutes later, when his breathing seemed to be under control, he pulled out of me—staring into my eyes. He tossed the condom away in the trashcan behind him and pulled up his pants.</p><p>I watched as he fixed himself in the mirror, as he smoothed everything so well that no one would ever know that he just f**ked the shit out of me.</p><p>I slid off the sink and looked at my own face—flushed cheeks, wild hair, runny mascara—and pulled my bra straps back over my shoulder. Before I could pull up my dress straps, Andrew moved my hand away and pulled them up for me.</p><p>Our eyes met in the mirror as he smoothed my hair, and for a split second he turned away—to pick up my headband. He gently held it over my head and slid it into place, and then he walked away.</p><p>“You know, it’s rude to just leave someone after sex without saying anything,” I muttered.</p><p>“What?” His hand was on the doorknob.</p><p>“Nothing.”</p><p>“What did you say?” He cocked his head to the side. “I’m not a mind reader.”</p><p>“I said it’s rude to just leave after you f**k me. You could at least say something, anything.”</p><p>“I don’t do pillow talk.”</p><p>“It’s not pillow talk.” I scoffed. “It’s part of being a gentleman.”</p><p>“I never said I was a gentleman.”</p><p>I sighed and turned around. I waited to hear the door close, but his hands were suddenly on my waist and he was spinning me around to face him.</p><p>“What am I supposed to say after I f**k you, Aubrey?”</p><p>“You could ask if it was good for me or not...”</p><p>“I don’t believe in asking pointless questions.” He looked at his watch. “How long do you have to stay here?”</p><p>“Another hour or so.”</p><p>“Hmmm.” He was quiet. “And while you were stalking me and my date how many shots did you have?”</p><p>“I wasn’t stalking you and your date. I’ve been avoiding you all week, or haven’t you noticed?”</p><p>“How many?”</p><p>“Five.”</p><p>“Okay.” He tucked a strand of hair behind my ear. “I’ll take you home whenever you’re ready and have someone deliver your car to your apartment tomorrow.” He planted a kiss on my forehead before heading to the door. “Just call me.”</p><p>“Wait,” I said as he opened it. “What about your date?”</p><p>“What about her?”</p><p>An hour later, I slipped inside of Andrew’s car—a sleek black Jaguar. He held the door open until I was comfortable, and waited until I put on my seatbelt before shutting it.</p><p>On his dashboard, I spotted a red folder with a New York state seal on its center. I picked it up, but Andrew immediately took it from me and locked it inside his glove box.</p><p>He looked offended that I’d touched it, but he quickly turned away from me and revved up the car.</p><p>“Can I ask you something, Andrew?”</p><p>“Depends on what it is.”</p><p>“I googled you this week and nothing came up...”</p><p>“That’s not a question.”</p><p>“Why didn’t anything come up?” I looked over at him.</p><p>“Because I’m thirty-two years old and I don’t waste my time on Facebook and Twitter.”</p><p>I sighed. “And you really haven’t spoken to her in six years?”</p><p>“Excuse me?” He looked over at me as we approached a red light. “I thought we just sorted this out in the bathroom.”</p><p>“We did, but—” I cleared my throat. “You filed for a divorce, and it couldn’t go through?”</p><p>“It takes two people to complete a divorce, Aubrey. Surely you know that.”</p><p>“Yes, but...” I ignored the fact that he was clenching his jaw. “Wouldn’t it be easier for someone like you to make it happen? Six years is a pretty long time to stay married to someone you claim you don’t love anymore, so—”</p><p>“You’d be surprised at how well some people can spin a f**king lie to get what they want,” he said, his voice cold. “My past isn’t up for discussion.”</p><p>“Ever?”</p><p>“Ever. It has nothing to do with you.”</p><p>I leaned back in my seat, crossing my arms. “Are you ever going to tell me the reason why you left New York and moved to Durham?”</p><p>“No.”</p><p>“Why not?”</p><p>“Because I don’t have to.” He steered the car into my apartment complex. “Because like I told you an hour ago, that part of my life never happened.”</p><p>“I’m not going to tell anyone. I just—”</p><p>“Stop it.” He faced me as he stopped the car, and I could see a world of hurt in his eyes. It was the most vulnerable I’d ever seen him.</p><p>“I lost something very special in New York six years ago.” There was regret in his voice. “Something I’ll never f**king get back, something I’ve spent the last six years trying to forget, and if it’s okay with you I’d like to make it to year seven.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I opened my mouth to say sorry, but he continued talking.</p><p>“I’m not sure if I’ve made this apparent over the past six months or not,” he said, “but I’m not the ‘sit up and talk about my feelings’ type. I’m not interested in deep conversations and just because I’ve f**ked you more than once and can’t seem to get you or your mouth off my mind, that doesn’t entitle you to things I haven’t told anyone else.”</p><p>I immediately unbuckled my seatbelt and flung my door open, but he grabbed my wrist before I could get out.</p><p>“I meant what I said a few months ago, Aubrey...” He cupped my chin and tilted my head toward him. “You are my only friend in this city, but you have to understand that I’m not used to having friends. I’m not used to talking about personal shit, and I’m not going to start now.”</p> <p>Silence.</p><p>“If you’re not going to open up to me, what incentive do I have to continue being your so-called friend?”</p><p>He said nothing for a few seconds, but then he smirked. “Get in my lap and let me show you.”</p><p>“Is this a joke?”</p><p>“Am I laughing?”</p> <p>“Do you really think you can just demand for me to have sex with you whenever you want?” I raised my eyebrow. “Especially since you just said you’ll never be that open about your personal life?”</p><p>“Yes.” He unbuckled his seat belt. “Get in my lap.”</p><p>“You know...” I looked down, noticing his c**k slowly stiffening through his pants. “I've let a few things slide the past few times we've had sex, but I have to tell you...” I bit my lip as I slipped out of the car. “I'm really not into the possessive caveman shit.”</p><p>He narrowed his eyes at me as I grabbed my purse and stepped back.</p><p>“I think we need to give your c**k a rest don't you think?” I crossed my arms. “You have a pretty big hearing coming up next week. Don't you need to save all your energy so you can be better prepared?”</p><p>“Get back in the damn car, Aubrey...” His voice was strained.</p> <p>“Are you begging me?”</p><p>“I'm commanding you.”</p><p>“Did you not hear what I just said?”</p><p>He didn't answer. He reached out for my hand, but I shut the door.</p><p>“I'll see you tomorrow, Mr. Hamilton.” I smiled and walked away.</p><p>Liability (n.):</p><p>Legal responsibilities for one’s acts or omissions.</p><p>A week later...</p> <p>Andrew</p><p>There was only one thing in Durham that held no comparison to New York: Court. The lawyers in New York actually took their jobs seriously. They pored over their research all night, polished their defenses to perfection, and presented their cases with pride.</p><p>In Durham, “lawyers” didn’t do shit, and in a moment like this—when I was listening to a young and inexperienced prosecutor embarrass herself, I almost missed those days.</p><p>Then again, I wasn’t paying too much attention to the proceedings today. I was too busy thinking about Aubrey and how many times we’d f**ked in my office this morning.</p><p>We’d said our usual, “Good morning Mr. Hamilton,” “Hello Miss Everhart” greetings and locked eyes as she set my coffee down. She’d opened her seductive mouth to say something else, but the next thing I knew, my hands were in her hair and I was pulling her sexy ass against my desk.</p><p>I was ruthlessly pounding into her from behind as I massaged her clit, and when she collapsed on my carpet, I’d spread her legs and devoured her pu**y.</p><p>I was completely insatiable when it came to Aubrey, and being around her for more than five seconds was enough to send me over the edge.</p><p>There’s no point in even counting how many times we’ve f**ked anymore...</p><p>“As you can see...” The prosecutor’s voice suddenly cut through my thoughts. “Ladies and gentlemen of the jury, all of the evidence that I’ve presented will prove—”</p><p>“Objection!” I’d had enough of this shit. “Your Honor, last time I checked, this was an evidentiary hearing, not a trial. Why is Ms. Kline being allowed to address a nonexistent jury?”</p><p>The judge took off her glasses and shook her head. “Ms. Kline, as hesitant as I am to agree with Mr. Hamilton, he does have a point. Have you concluded with your presentation of evidence? Barring a closing statement to the jury?”</p><p>“I have, Your Honor,” she said, puffing out her chest as if she’d just presented the case of the century.</p><p>“Mr. Hamilton...” The judge looked my way. “Do you care to surprise me today by refuting any of the evidence presented?”</p><p>“No, Your Honor.” This hearing was a waste of time, and she knew it as well as I did.</p><p>“I see.” She put her glasses on again. “Let the record show that while the prosecution has presented a compelling and rather large collection of evidence, it’s this court’s ruling that it is not enough to warrant a trial.” She banged her gavel and stood up.</p><p>Ms. Kline walked over to me and held out her hand. “So, I’ll file an appeal, get more evidence, and see you on this matter again soon, right?”</p><p>“Are you asking me or are you telling me?”</p><p>“Your client committed the highest degree of fraud, Mr. Hamilton.” She crossed her arms. “Someone has to pay for that.”</p><p>“No one ever will if you remain on top of it, will they?” I put my files in my briefcase. “I’ll be waiting for your next move. And yes, you should get more evidence since the judge clearly ruled that what you had was not enough.”</p><p>“So, that means I should appeal? Do you think I could win this thing?”</p><p>“I think you could go back to law school and f**king pay attention.” I scoffed. “Either that, or do your clients a favor and find them a better lawyer.”</p><p>“You mean someone like you?”</p><p>“There’s no one like me.” I slid a pair of shades over my eyes. “But anyone would be better than you.”</p><p>“Are you always this rude to your opponents, Mr. Hamilton?” She cracked a smile. “I mean, I’ve heard stories, but you are really—”</p><p>“Really what?”</p><p>“Intriguing.” She stepped closer. “You are really intriguing.”</p><p>I blinked and looked her over. If I’d met her on Date-Match she might’ve been worthy of one night, but I never mixed business with pleasure.</p><p>At least, I didn’t used to.</p><p>“I’m not sure if you’re seeing anyone or not,” she said, lowering her voice, “but I think you and I have a lot in common, and—”</p><p>“What exactly do we have in common, Miss Kline?”</p><p>“Well...” She stepped even closer and rubbed my shoulder. “We were both staring at each other during the hearing, we both have high profile careers, and we both have a passion for the law—a passion that could clearly be transferred to other things.” She licked her lips. “Right?”</p><p>I stepped back. “Miss Kline, I was staring at you during the hearing because I was trying to comprehend how someone could show up to court and be so unprepared, unprofessional, and utterly annoying. We do both have high profile careers, but if you continue presenting cases like the one you presented today, I’ll be interviewing you for a secretary position at my firm within the next six months.” I ignored her gasp. “And if your passion for the law is anything like the way you f**k, then you and I have absolutely nothing in common.”</p><p>“Did you...” She shook her head, stepping back as her face reddened. “Did you really just say that to me?”</p><p>“Did you really just proposition me for sex?”</p><p>“I was simply probing—seeing if you were interested in going out.”</p><p>“I’m not,” I said—noticing that I wasn’t even the slightest bit aroused. “Am I free to leave the courtroom now or would you like to probe me for something else?”</p><p>“You are an ass**le!” She spun around and grabbed her briefcase off the floor. “You know, for your clients’ sake, I hope you’re a lot nicer.” She spat out as she left the room.</p><p>I wanted to tell her that I actually wasn’t nicer to my clients. I didn’t put up with bullshit from anyone, and since I hadn’t lost a single case since moving to Durham, I didn’t have to.</p><p>Looking at my watch, I figured I’d wait a few minutes before leaving. I didn’t want to run into her in the parking lot, and since the remaining courts were adjourning for lunch, I figured I’d wait a while.</p><p>I stuffed my hands into my pocket and smiled at lacy fabric that grazed my left hand. Pulling it out, I smiled at Aubrey’s black thong from this morning.</p><p>I took my phone out of my briefcase to text her about it, but she’d emailed me first.</p><p>Subject: Wet Panty Fetish</p><p>I’m not sure if you’ve realized that I left my thong in your pocket yet, but I want you to know that I did it for your own good, and that your secret is safe with me.</p><p>Ever since you f**ked me in the bathroom at the art gallery, I’ve noticed that you have a tendency to stare at my panties before taking them off.</p><p>You run your fingers across them, pull them off with your teeth, and then you stare at them again. I have no problem continuing to appease your panty fetish. I’m sure you place them over your face at night, and if you ever need more feel free to let me know.</p><p>Aubrey</p><p>Subject: Re: Wet Panty Fetish</p><p>I did realize that you slipped your thong into my pocket this morning. I’ve noticed that you’ve done this all week.</p><p>Contrary to your unfounded and silly assumptions, I do not have a panty fetish and I do not sleep with them over my face at night. I do, however, have a new fetish for your pu**y, and if you’re interested in letting me sleep with THAT over my face at night, feel free to let me know.</p><p>Andrew</p><p>I waited for a response—watched my screen for several minutes, but then I realized it was Wednesday and she wouldn’t see my email until later.</p><p>I made my way outside and slipped into my car. I didn’t feel like going back to the firm—my case files were all up to date, and it was too early to go home.</p><p>Revving up my car, I coasted down the street in search of a decent bar. As I was turning past the law school, I noticed Duke’s dance hall across the street.</p><p>I wasn’t sure what came over me, but I made a right turn and pulled into the parking lot. I followed the signs that read “Dance Studio” and parked in front.</p><p>There was a sign on the double doors of the auditorium that read “Private Rehearsals: Dancers Only,” but I ignored it. I followed the faint sound of piano keys and violin strings and opened the door to a colossal theater.</p><p>Bright lights shone directly on the stage, and dancers dressed in all white were spinning. Before I could come to my senses and make myself leave, I spotted Aubrey in the front.</p><p>Wearing the same feathered headband she wore at the art gallery, she was smiling wider than I’d ever seen her smile before—dancing as if no one else was in the room. There was a gleam in her eyes that I never saw while she was at GBH, and although I didn’t know shit about ballet, it was extremely clear that she was the best dancer onstage.</p><p>“Extend, Miss Everhart! Extend!” A grey haired man walked onto the stage, yelling. “More! More!”</p><p>She continued dancing—stretching her arms out further, extending her hands. “No! No! NO!” The man stomped his foot. “Stop the music!”</p><p>The pianist immediately stopped and the director stepped in front of Aubrey.</p><p>“Do you know what the characteristics of the white swan are, Miss Everhart?” he asked.</p><p>“Yes.”</p><p>“Yes?” He looked offended.</p><p>“Yes, Mr. Petrova.” She stood still.</p><p>“If that’s so, why don’t you enlighten us all as to what those special characteristics are...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Light, airy, elegant—”</p><p>“Elegant!” He stomped his foot again. “The white swan is all about smooth, gentle movements... Her arms are well poised, graceful.” He grabbed her elbow and pulled her forward. “Your arms are erratic, rough, and you’re dancing like a pigeon on crack!”</p><p>Her cheeks reddened, but he continued.</p><p>“I want a swan, Miss Everhart, and if you’re not up to the part—if your heart is elsewhere, like that other major you have, do me favor and let me know so I can groom someone else for the role.”</p> <p>Silence.</p><p>“Let’s try this again!” He stepped back. “On my count, start the song from the second stanza...”</p><p>I leaned back against the wall, watching Aubrey effortlessly dance again and make everyone else look like amateurs. I watched until I couldn’t watch anymore, until her old director spotted my shadow and yelled at “the goddamn intruder” to leave.</p><p>Later that night, I walked into the kitchen and pulled out a bottle of bourbon,—pouring myself a shot. It was two in the morning and I was beyond restless.</p><p>I hadn’t been able to sleep since I came home and spotted a note from Ava on my door: “I’m not leaving until we talk—Ava.”</p> <p>I’d balled it up and thrown it into the trash, wondering which person at GBH had been stupid enough to give out my address.</p><p>As I tossed back a shot, my phone rang.</p><p>“It’s two in the morning,” I hissed, holding it up to my ear.</p><p>“Um...” There was a slight pause. “May I speak to a...A Mr. Hamilton, please?”</p><p>“This is he. Did you not hear me say what time it is?”</p><p>“I’m sorry, Mr. Hamilton.” She cleared her throat. “I’m Gloria Matter from the parole board in New York City. I’m sorry to call you so late, but I didn’t want to turn in until I returned your inquiry from last week,” she said. “The inmate you called about is no longer an inmate. She was released recently and is now on parole.”</p> <p>“I’m aware that she’s on parole.” I poured another drink. “However, I’m pretty sure leaving the state is a direct violation of those terms. Is New York soft on crime now? Do you let previous offenders roam the world as they please?”</p><p>“No sir, but she checked in with her officer this morning. We also checked her monitor the second we received your phone call so she’s still in the state...I must warn you that we don’t take too kindly to false reporting, Mr. Hamilton. If this was some type of—”</p><p>“I know what the f**k I saw.” I seethed. “She was here.” I hung up. I didn’t care enough to think about Ava right now.</p><p>I headed into my bedroom and lay against the sheets, hoping this second round of alcohol would work better than the first.</p><p>I lay there for an hour, watching the seconds on my clock tick by, yet no sleep came and thoughts of Aubrey began to fill my mind. I was thinking about the things she’d told me when we we’d first met, things she’d told me about her sex life, and I had the sudden urge to hear her voice.</p><p>I rolled over and scrolled down to her name.</p><p>“Hello?” She answered on the first ring. “Andrew?”</p><p>“Why haven’t you sucked a c**k before?”</p> <p>“What?” She gasped. “How about ‘Good morning, Aubrey’? Are you awake?’ How about asking those things first?”</p><p>“Hello, Aubrey.” I rolled my eyes. “You’re clearly awake, so I’ll bypass that unnecessary question. Why haven’t you sucked a c**k before?”</p><p>She was silent.</p><p>“Do I need to drive to your apartment and make you answer the question in person?”</p><p>“Are you really in need of this information at three in the morning?”</p><p>“Desperately,” I said. “Answer the question.”</p><p>“It’s just something I never wanted to do.” There were papers shuffling in the background. “One of the guys I used to date would ask me to do it to him from time to time—to reciprocate, but I just...I didn’t like him enough to do it.”</p><p>“Hmmm.”</p><p>Silence.</p><p>We hadn’t had an actual phone conversation since the last time we had phone sex, right before I found out her real name was Aubrey and not Alyssa.</p><p>“Were you thinking about me?” she suddenly asked.</p><p>“What?”</p><p>“Were you thinking about me?” She repeated. “You’ve never called me this late before. Are you lonely?”</p><p>“I’m horny.”</p><p>She let out a soft laugh. “Would you like me to tell you what I’m wearing?”</p><p>“I already know what you’re wearing.”</p><p>“Oh, really?”</p><p>“Yes, really.” I put a hand behind my head. “It’s Wednesday, which means you had practice until midnight, which means you went home and showered and immediately put your feet in an ice tub without putting on any pajamas.”</p><p>She sucked in a breath.</p><p>“And from the way you’re breathing right now I take it you’re still naked, and the reason you picked up my call on the first ring is because you want to touch yourself to the sound of my voice.”</p><p>Another gap of silence.</p><p>“Am I wrong?” I asked.</p><p>“No...” Her voice was low. “I don’t think you’re horny right now though.”</p><p>“Trust me. I am.”</p><p>“Maybe, but I think you called me because you like me—because you want to hear my voice since we haven’t talked on the phone in a while.”</p><p>“I called you because my dick is hard and I want to make you cum over the phone.”</p><p>She laughed again. “So, you don’t like me?”</p><p>“I like your pu**y.”</p><p>“So, the white roses and the “He’s just yelling at you because he knows you’re the best/Don’t let him get to you” note that was on the hood of my car today weren’t from you?”</p><p>I hung up.</p><p>Retraction (n.):</p><p>The legal withdrawal of a promise or offer of contract.</p><p>Andrew</p><p>“How do you think we should proceed with the client, Harriet?” I leaned back in my chair the next night, dreading my “Let the Interns Help with One Case per Month” required hours.</p><p>“Um, Mr. Hamilton...” She twirled a strand of hair around her finger. “My name is Hannah.”</p><p>“Same thing,” I said. “How do you think we should proceed with this case?”</p><p>“We could put his ex-wife on the stand. She could vouch for his character.”</p><p>“They were married for thirty days.” I rolled my eyes and looked at the intern sitting next to her. “And that was ten years ago. Bob, what do you have?”</p><p>“It’s...It’s actually Bryan.”</p><p>“It’s whatever I say it is. What. Do. You. Have?”</p><p>“I was doing some research on his background and he apparently was reprimanded for breaking his university’s fire wall his senior year. We could start there and build a case around his past of anarchy...”</p><p>I sighed. “He’s our client, Bryan. Why would we intentionally make him look bad?”</p><p>He blinked.</p><p>I turned toward the last intern in the room, a petite brunette. “What do you suggest?”</p><p>“You’re not going to try to guess my name?” She smiled.</p><p>“I just realized that you weren’t my janitor today. What do you have?”</p><p>“This.” She slid a folder across the table. “If we’re trying to prove that he wasn’t in breach of his company’s policies when he took out his initial shares, we could use this case as a reference.”</p><p>I opened the folder, reading the first line of a case that was not only over a hundred years old, but it had been overturned by the Supreme Court decades ago.</p><p>“Did you all smoke the same drugs before your interviews?” I shook my head. “You’re in law school. A few years away from potentially having someone’s future in your hands and this is the type of shit you come up with?”</p><p>“With all due respect, Mr. Hamilton...” Bryan spoke up. “Is there even a right answer to this question? I mean...Is this one of those ha-ha this was just a test to see how our minds work things? Is there really an answer?”</p><p>“Yes.” I stood up.</p><p>“Really? What is it?”</p><p>“It’s go the f**k home.” I started stacking my papers. “All of you. Right now.”</p><p>“But—”</p><p>“Now.” I glared at them, waiting until they all left the room.</p><p>The second I was alone I let out a sigh and sat down again. I was better off letting Jessica help me out on this case. She didn’t know shit about the law but I was sure that she would at least try.</p><p>“Mr. Hamilton, I—” Aubrey stepped into the room with a cup of coffee. “Where did everyone go?”</p><p>“Home.” I took the cup from her, frustrated. “You’re free to go, too.”</p><p>“Are you ever going to formally give me my intern position back or am I forever stuck being your coffee and file organizer?”</p><p>“You’re also in charge of taking phone calls. That’s a responsibility you shouldn’t take lightly.”</p><p>“I’m serious...” She rolled her eyes. “As much as I enjoy having sex with you every morning with your coffee, I would like to go back to feeling like I actually have a purpose here.”</p><p>“Fine.” I took a sip from my cup. “Have you been keeping up with my current case?”</p><p>She nodded.</p><p>“Great,” I said dryly. “How do you think I should proceed?”</p><p>“I think you need to first get ahold of the man who erased your client’s identity.”</p><p>“What? What are you talking about?”</p><p>She took a folder from her purse and set it in front of me. “My parents taught me how to research someone’s background very, very well. That’s the one thing I can credit them for.” She flipped a few pages. “Your client has school records from his childhood—test scores, address changes, et cetera. There’s a record of where he attended college, grad school—even a record of the time he broke into his school’s firewall and got suspended for an entire semester. After that, there’s a short failed marriage to some woman he met in Cabo, and a few founding records for his company. But after that—with the exception of these recent allegations, there’s nothing.”</p><p>I glanced at the pages.</p><p>“Don’t you think that’s odd?” She looked at me. “How you can google someone and nothing about them pops up? How you can search several databases for information and find entire decades are missing?”</p><p>I shut the folder. “It’s slightly odd.”</p><p>“Slightly?”</p><p>“Yes. Slightly. Is this all the evidence you have?”</p><p>“It’s all the evidence you need.” She stared into my eyes. “Find the guy who erased him, or find the guy who erased you and you might have yourself another win under your belt. If not—”</p><p>“Aubrey...”</p><p>“People don’t just come out of nowhere, Andrew,” she said. “You know that, I know that, and I’m pretty sure your client knows that.”</p><p>“Now we’re talking about the client?”</p><p>“There is no record of Andrew Hamilton in any of state’s registered lawyer databases.”</p><p>“I’m not facing a trial.”</p><p>“I called every law school in the state and pretended to be an alumna searching for a fellow alum and there was no record of an Andrew Hamilton getting his degree from any of them.”</p><p>“Are you that obsessed with me?” He smirked.</p><p>“I did the same thing for the law schools in New York. That was a bit trickier, but the results were just the same. There was no record of you going to school during the years you would’ve been in attendance.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And this affects you how?”</p><p>“You humiliated me when you found out I lied to you.”</p><p>“I apologize.”</p><p>“Don’t.” She shook her head. “You made me cry because you told me that I was a liar for hiding the truth and pretending to be someone I wasn’t.”</p> <p>“I’m pretty sure I wouldn’t be the only person to classify you as a liar after what you did.”</p><p>“Yet, every day that I f**k you, every night that I talk to you on the phone, I’m no closer to getting to know anything about you.” There was concern in her eyes. “It’s always me talking about me, or you talking about abstract things that make up a blurry picture.”</p><p>“It doesn’t matter. I told you that I—”</p><p>“That you’ve never lied to me,” she said. “I believe that, and for a moment I thought that you were always completely honest with me, but when I look back, you’re only honest about what you want to talk about. Hence, the random appearance of Mrs. Hamilton, and—”</p><p>“I’ve told you about that already.” I grabbed her hand and pulled her close to me. “So, I’m not going to waste my time rehashing shit I’ve already gone over with you.”</p> <p>“Just...”</p><p>“Look.” I pressed my finger against her lips. “You’re the only woman I’ve f**ked regularly in six years.”</p><p>“Am I supposed to be proud of that?”</p><p>I pulled her into my lap. “You’re the only woman—only person actually, that I talk to outside of my hours at this office, the only woman I’ve ever f**ked over the phone, the only woman who’s been in my car, and the only woman who’s lied to me and still gotten me to stay...”</p><p>She sighed, staring back at me.</p><p>“Now,” I said, “if you don’t mind, I’m going to f**k you in this chair. And when we’re done I’ll kindly show you how to research someone the right way, because contrary to what you think, my client does have a background.”</p> <p>“No, I double checked everything and I—”</p><p>I pressed my lips against hers. “After I f**k you.”</p><p>Consent (n.):</p><p>A voluntary agreement to another’s proposition.</p><p>Aubrey</p><p>Subject: New York /Your Panties</p><p>For the record, I did go to law school in NYC. I was the valedictorian of my class.</p><p>—Andrew</p> <p>PS—If you stash one more pair of your wet panties/“For your fetish” notes in my desk drawer, I’m going to assume that you do want me to sleep with your pu**y over my face. My tongue has been aching to do that since I first “met” you so there’s no need for unnecessary hints...</p><p>“Aubrey?” My mother’s voice took the smile right off of my face. “Aubrey, were you listening to your father just now?”</p><p>“No, I’m sorry.” I sighed, dreading that I was still sitting at a dinner with them.</p><p>They’d called me the second my rehearsal was over and demanded that I drive home so we could all ride to our “favorite” restaurant together. It was where all their country club friends ate regularly, and I knew they just wanted to come here to assert our seemingly perfect family image.</p><p>“Are you listening now?” My father raised his eyebrow.</p><p>“Yes...”</p><p>“We brought you here so we could tell you that...I’m running for governor in the next election,” he said.</p><p>“Do you want my vote?”</p><p>“Ugh, Aubrey.” My mother huffed and snapped her fingers for the waiter. “This is one of the happiest moments of your life.”</p><p>“No...” I shook my head. “I’m pretty sure it isn’t...”</p><p>“All those years of hard work, building our firm to be one of the most impeccable in the city,” she said as she looked into my father’s eyes, “it’s about to payoff in a huge way. We already have a few verbal commitments for the campaign’s budget, and since we’re going in on the same side as the incumbent—”</p><p>“You have a really good chance of being governor.” I cut her off. “Congratulations, Dad.”</p><p>He reached over the table and squeezed my hand.</p><p>My mother couldn’t seem to shut up. “We’ll have to take new family photos—stocks, you know? Photos we can give to the press for their write-ups, so you’ll have to wear your hair in something other than that ballerina thing.”</p><p>“It’s a bun.”</p><p>“It’s an eyesore.”</p><p>“Margaret...” My father chided. “It’s not an eyesore...It’s just—”</p><p>“It’s just what?” I looked back and forth between them.</p><p>“It’s important for us to look like a cohesive All-American unit on the campaign trail.” My mother took a glass of wine from the waiter and waited for him to step away. “We may have to make some stops together as a family.”</p><p>“You’re running for governor, not President, and what twenty-something do you know travels with her parents during a campaign just for photo-ops?”</p><p>“Our opponent has twenty year old twins who are homeschooled,” she said. “They travel to third world countries every summer to help the poor and I’m pretty sure they’re going to be at every stop on the campaign trail.”</p><p>I snorted. “Why are you trying to compete with genuine people? Don’t you think they’re the type that deserve to win?”</p><p>“Aubrey, this is serious.” My dad looked upset. “This has been a dream of mine for a very long time and we want to make sure that nothing stands in the way.”</p><p>The two of them exchanged glances and I raised my eyebrow.</p><p>“Nothing like what?” I asked.</p><p>“Okay...” My mother lowered her voice and looked over her shoulder before speaking. “We need to know if there any skeletons in your closet—any pictures on social media that make you look like a party girl, any ex boyfriends’ or sexual partners that you may have dealt with, or anything that would make us look like bad parents.”</p><p>“You are bad parents.”</p><p>“Stop it, Aubrey.” My father gripped my hand and squeezed it hard. “The two of us have given you everything you could’ve ever wanted growing up and all we’re asking for is a small sacrifice from you.”</p><p>“I don’t have any skeletons in my closet.” I gritted my teeth.</p><p>“Good.” My mother put on her fake smile. “Then, when you pull out of school for your senior year to help us on the trail, it won’t look suspicious. We’ve already spoken to your department chair about online classes and they are, in fact offered. For the ones that aren’t, you’ll have to show up to campus to take those, but they make special considerations for students with circumstances such as yours so—”</p><p>“No.” I cut her off. “No, thank you.”</p><p>“This isn’t up for discussion, Aubrey. This is for the benefit of—”</p><p>“Dad’s dream, right?” I tried not to lose it. “Because he’s the only person in this family who has a dream?”</p><p>“Yes,” my mother said through her smiling teeth. “We’re talking about real dreams, Aubrey. Not no-chance-in-hell and failed ones.”</p><p>“Excuse me?!” I stood up. “You want to talk about failed dreams when the two of you have failed more than anyone I know at the expense of your own daughter?” There were tears in my eyes.</p><p>“Aubrey, sit back down.” She grabbed my hand. “Let’s not make a scene.”</p><p>“Let’s!” I snatched my hand away. “Let’s discuss how I’m twenty f**king two and I’m a junior in college when I should already be a graduate! Shall we? Can you explain why that is?”</p><p>My father’s face reddened and he motioned for me to sit down, but I stood my ground.</p><p>My mother clutched her pearls. “Aubrey...We did what was best at the time, and even though switching school systems twice in two years was unfortunate, it made you who you are today. Now, the campaign won’t start until—”</p><p>“I don’t care when the hell it starts. I’m not going on a pointless campaign trail, and I’m not taking any of my classes online because guess what?” I could feel my blood boiling. “You can’t learn f**king ballet online!”</p><p>The restaurant was suddenly silent.</p><p>“You two are beyond selfish and you don’t even know it.” I shook my head. “I’m voting for the other guy.” I stormed off amidst gasps and whispers from the other tables—slightly content that my parents’ picture perfect family had been publicly scratched a bit.</p><p>“Your number, Miss?” The valet said to me as I stepped outside.</p><p>“My what?”</p><p>“Your number?” He tilted his head to the side. “For your car?”</p><p>Shit... I sighed and looked over my shoulder.</p><p>Patrons were pointing in my direction and I couldn’t bear to go back in there just because I didn’t have a ride home.</p><p>I considered calling a cab, but I knew that was pointless. It would take forever to get here, and I could probably walk back to my apartment faster than they would arrive.</p><p>There was a bus stop a mile or so down, but I only had a credit card. I doubted Andrew would come get me, but I decided to give it a try.</p><p>Subject: A Ride.</p><p>I really need a favor...</p><p>—Aubrey</p><p>Subject: Re: A Ride</p><p>Wanting to take a ride on my c**k in the middle of the day shouldn’t be considered a “favor” at this point.</p><p>—Andrew</p><p>Subject: Re: Re: A Ride</p><p>I’m not talking about your dick. I’m talking about your car...Would you be able to pick me up right now? I was at a dinner with my parents but it didn’t end well...and I don’t have my car.</p><p>If you can’t, I’ll understand.</p><p>—Aubrey</p><p>Subject: Re: Re: Re: A Ride</p><p>Where are you?</p><p>—Andrew</p><p>Half an hour later, he pulled into the country club’s driveway.</p><p>I slipped into his car before he could even park—not looking back at the snooty members who were probably whispering and wondering about what had happened between me and my parents.</p><p>“I’m taking you home, right?” he asked as he pulled off.</p><p>“No...”</p><p>He looked over at me. “Am I taking you to GBH?”</p><p>“If you want. Just not to my apartment.” I paused. “I’m sure my parents will stop by there after dinner and try to talk to me so...”</p><p>“Have you eaten?”</p><p>“Lost my appetite...” I said softly, then I smiled. “But if you’re interested in taking me on a date right now, I’m not opposed to that.”</p><p>“Why would I take you on a date?”</p><p>“Because you owe me one.”</p><p>“Since when?”</p><p>“You once said that you would take me out if we ever met in person, and you haven’t done it yet.”</p><p>We approached a stoplight and he turned to face me.</p><p>“If I was even vaguely interested in taking you out right now—which I’m not, where the hell would I take you if you’ve already eaten dinner?”</p><p>“Surprise me.” I shrugged and leaned against the glass—shutting my eyes. I could practically picture him staring at me, giving me that “You’re out of your damn mind” look, and as he steered the car back onto the street, I smiled—hoping that this would be the start of us going out regularly.</p><p>I was dreaming of him kissing me in the gallery room again when I felt him gently shaking my shoulder.</p><p>“Aubrey...” he whispered. “Aubrey, wake up.”</p><p>I lifted my head and looked outside my window. There were lush plants and a massive glass paned building—an executive condo. My heart skipped a beat because I knew he’d never taken a woman to his place before, and I was happy that I would be the first. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I looked over at him, ready to say something, but then I saw him fiddling with a green parking pass and I looked out the front window—seeing where we really were.</p><p>Outside of a Hilton hotel.</p><p>“Your idea of taking me on a date is bringing me to a hotel?”</p><p>“It’s more about f**king you in the hotel.”</p> <p>“Andrew, this is where you take all your other dates...”</p><p>“And?”</p><p>My heart sank. “Do you not see why bringing me here would hurt my feelings?”</p><p>“Would you prefer the Marriott?”</p><p>I blinked.</p> <p>“They don’t have the same standard of room service,” he said, “but if that’s what you prefer—”</p><p>“Just take me home—right now.” My voice cracked and I leaned against the window, shutting my eyes again. “I’ll deal with my parents...”</p><p>I woke up on a plush leather couch, tucked underneath a soft black blanket.</p><p>Sitting up, I saw that my shoes had been taken off and placed in a rack on the other side of the room. A tray of fresh fruit and chocolates were sitting on the small table in front of me, and there was a bottle of wine sitting next to two stemmed glasses.</p><p>The room looked as if it’d been plucked from a magazine: silk white draperies, taupe walls, and portraits framed in silver. One of those portraits was of a f**king hotel, making it clear exactly where I was.</p><p>I immediately tossed the blanket off—ready to find Andrew and yell at him for bringing me here against my wishes. I walked down the hallway, slowly noticing that the pictures hanging on the wall were of him.</p> <p>In one picture, he was standing on a beach, looking off into the distance. In another he was standing in front of a NYC cab, and in another he was lying against a city park bench.</p><p>He was young in all of these photos—his eyes held a more boyish charm, and if I wasn’t mistaken, he looked happy. Extremely happy.</p><p>In between all of the larger photos, were small wooden blocks in the shape of an entwined “E” and “H.” At first I thought that the “A” for Andrew’s first name was simply missing, that one of the pieces would bear it, but that wasn’t the case: In the last frame at the end of the hall there was a photo of a huge “E” and “H” that were solely compiled of pictures of New York.</p><p>“E” and “H”?</p><p>I continued walking down the hallway, smiling at the more “esteemed” photos he’d hung of himself. I stopped when I heard the sound of running water and followed it into a massive bedroom.</p><p>Everything was cloaked in black—the sheets that covered the king sized bed, the long silk curtains that hung over the balcony’s French doors, and the plush rug that sat atop his polished wooden floors.</p><p>I walked over to his armoire and pulled out the first drawer.</p><p>“What are you doing?” Andrew was standing right behind me.</p> <p>“I was...” I stalled as he wrapped an arm around my waist. “I was looking through your stuff.”</p><p>“Looking for anything particular?” He kissed the shell of my ear from behind.</p><p>“I’m looking for where you keep all my panties.”</p><p>He let out a low laugh. “They’re all next to my bed.” He slid his hand underneath my skirt and stalled once his fingers reached my bare pu**y. “Since you’re not wearing any, do I need to give them back to you?”</p><p>I rolled my eyes and he let me go.</p><p>“Is this better than a hotel room?” he asked.</p><p>“Depends.” I turned around. “How many other women have you had here?”</p><p>“None.”</p><p>“None?” I couldn’t believe that. “In six years?”</p><p>“I like to keep my f**king life separate from my home life.” He clasped my hand.</p><p>“So, I’m the exception to the rule?”</p><p>He didn’t answer. He simply led me across the bedroom and into an all-white en-suite where the water from the shower was still running.</p><p>“I’ve been waiting for you to wake up...” He looked down at me.</p><p>“Because you want to watch movies together?”</p><p>“Because I want to f**k you in the shower.” He pushed my back against the wall and looked into my eyes. “Because I want to f**k you all night.”</p><p>I moaned as he wedged his knee between my thighs and pulled my shirt over my head. He slipped his hand behind my back to unclasp my bra, and as it fell to the floor he trailed his tongue across my ni**les.</p><p>“Take off your skirt...” He backed away from me.</p><p>My hands went to my zipper, but my eyes stayed glued on him as he started to undress himself.</p><p>I’d f**ked him numerous times in his office, recklessly rode his c**k time and time again, but I’d never seen him completely naked.</p><p>He pulled his white V-neck shirt over his head and tossed it into the corner—exposing a set of chiseled abs and a small cursive tattoo that was etched onto his chest.</p><p>I tried to read what the words said, but then he unfastened the drawstring of his black lounge pants and let them fall to the floor.</p><p>I could see that his c**k was hard through his briefs, and I waited for him to take them off, but he walked back over to me.</p><p>Grabbing my hand, he placed it against his waistline. “Take them off of me.”</p><p>I slipped my thumb underneath the elastic, but he stopped me.</p><p>“With your mouth.”</p><p>My eyes widened as I looked up at him, seeing the sexy smirk on his face.</p><p>I bent down slightly and trailed kisses across his waist—hearing him take in a sharp breath as his hands slipped into my hair.</p><p>I gripped his thighs for balance and tugged at the hem of his briefs with my teeth. Pulling the fabric down a few inches, I used my fingers to move them further, but he pulled me back by my hair.</p><p>“Only your mouth.” He warned.</p><p>I gave him a look of understanding and he let me go. I once again grabbed the briefs with my teeth and slowly slid them down his legs.</p><p>I looked up and saw that his c**k was standing at attention, rock hard and ready for my pu**y like always, and from the look in his eyes, I knew he was going to pull me up and f**k me against the wall.</p><p>Before he could get the chance, I sat up on my knees and gripped his c**k with my hand. I pressed my lips against it—trailing my tongue across every thick inch. I wrapped my mouth around his tip and slowly massaged it with my tongue.</p><p>“Aubrey...” He threaded his fingers through my hair and looked down at me. “What are you doing?”</p><p>“I’m...” I felt my cheeks heating. “I’m sucking your cock.”</p><p>He blinked, letting a slow smile spread across his face. “You’re not sucking my cock...You’re kissing it.”</p><p>“I was getting to that part. I was trying to do it like...” I shook my head and stood up, completely embarrassed. “Never mind.”</p><p>“You were trying to do it like what?” he whispered against my lips.</p><p>I shook my head again and he looked into my eyes. “You don’t need to watch anybody else to learn. I’ll teach you...”</p><p>Still smiling, he grabbed my hand and pulled me into the shower. He pressed his chest against mine and slipped a finger into my mouth as the water ran over us. “Is this as wide as you can open for me?”</p><p>I blinked, nodding.</p><p>“You’re going to have to open a lot wider than that if my c**k is going to fit into your mouth...” He sat down on the small wet bench behind him and motioned for me to bend low.</p><p>The water streams from above lashed against my back as I got down on my knees.</p><p>“Lick your lips,” he commanded, and I obliged—feeling completely out of my zone.</p><p>I leaned forward, assuming that I was supposed to take him into my mouth now, but he stopped me.</p><p>“Make it wet.”</p><p>“What?”</p><p>“Put your mouth on my c**k and wet it.”</p><p>Hesitant, I pressed my lips against his dick and slid my tongue across his shaft. I was swirling it against him slowly, but then he pulled my head up.</p><p>“You’re being too gentle,” he said. “I don’t need you to be a f**king lady right now...”</p><p>“I—”</p><p>“I need you to be aggressive, greedy, and sloppy because I’m not going to be gentle when I’m devouring you.” He gently pushed my head down and spread his legs a little further. “Massage my balls with your hand...”</p><p>I immediately cupped them, rubbing them against each other.</p><p>“A little harder...” His breathing slowed and I picked up the pace of my fingers.</p><p>“Now,” he whispered. “Open your mouth as wide as it can go, and take my c**k as deep as you can...”</p><p>I opened my mouth and took in the first few inches easily as he threaded a few fingers through my hair.</p><p>“Keep your eyes on me.” He looked somewhat impressed. “You don’t have to take all of it right now...” He used my shoulders to push me back and then forward. “Keep easing it in and out of your mouth just like this...”</p><p>Groaning, he stared at me with pure lust in his eyes, and then he whispered. “Suck me deeper...”</p><p>I followed his command and he groaned even louder. I could see the muscles in his legs tensing as my mouth covered over half of his cock. I was starting to feel a little bolder, slightly more confident, so I took in a little bit more of him.</p><p>“Fuck...” He breathed.</p><p>I used my free hand to cover the part of his c**k that wasn’t in my mouth, and massaged it the same way I was massaging his balls—soft but aggressive.</p><p>He started to tug at my hair, begging me to take more of him into my mouth. “Take all of it...”</p><p>Feeling as if I was now in control, I denied his request, and sped up my rhythm—bobbing my head up and down.</p><p>“Aubrey...” His words were strained.</p><p>I took him a little deeper—wrapping my lips around him a little tighter, but I didn’t go all the way.</p><p>“Aubrey...” he said again, sounding desperate.</p><p>I wasn’t paying his words any attention. I was loving the way his c**k felt inside my mouth, loving the way my tongue was commanding him and making him react.</p><p>“Stop.” He yanked me back by my hair and glared at me. “Take all of my c**k into your f**king mouth right now.”</p><p>I slid my mouth over him and leaned forward all the way—not stopping until it touched the back of my throat.</p><p>Andrew briefly shut his eyes and sighed. Then he opened them again and spoke firmly. “I need you to let me cum in your mouth...” His voice was raspy. “And I need you to swallow every f**king drop...”</p><p>I gripped his knees and sucked him faster and faster, and his c**k began to throb in my mouth. I could feel it pulsating, constricting, and as he leaned back and finally let go I felt spurts of warmness slipping down my throat.</p><p>His cum was salty and thick, and I honestly loved the taste of it. As the last drop landed into my mouth, I looked into his eyes and he looked back at me. The expression on his face was one of pure satisfaction and awe, and I was more turned on than I’d ever been in my life.</p><p>He stood—pulling me with him, and pressed his lips against mine. “That was f**king perfect.” He turned off the water and led me out of the shower and back into his bedroom—not bothering to dry me off.</p><p>He grabbed me by my waist and tossed me onto the bed. “Spread your legs.”</p><p>I let my legs fall apart and he climbed on top of me. Crashing his lips against mine, he sucked my bottom lip into his mouth.</p><p>I could feel the tip of his c**k rubbing against my pu**y and I lifted my hips—encouraging him to f**k me.</p><p>After being with him in the shower, I didn’t want to do much foreplay and I didn’t want to talk.</p><p>I just wanted to be f**ked. Now.</p><p>His hands caressed my br**sts and I pushed them away. “Fuck me, Andrew.”</p><p>“I am.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Now.”</p><p>He smiled at me, looking as if he wanted to say something smart, but he leaned over and reached into his nightstand for a condom.</p><p>He quickly slipped it on and entered me in one full stroke, causing me to moan in pleasure.</p><p>“Ahhhh...” I reached up and grabbed his hair as his c**k pounded into me relentlessly. I was sure I’d never get tired of him f**king me, each time was better than the last.</p> <p>I shut my eyes as he buried his head in my neck, as he whispered how “fucking good” I felt. Small tremors started building inside of me, and as much as I wanted this to last a little longer, I wouldn’t be able to hold on.</p><p>“Andrewww...” I said his name as my hips started to jerk and my orgasm took over me. I screamed, falling back onto the pillows, and he collapsed on top of me seconds later.</p><p>We both lay there, entwined in each other for a long time—not saying a word. When I finally found the energy to speak, I cleared my throat. “Are you going to sleep inside of me all night?”</p><p>“Of course not.” He pulled out of me, immediately making me miss the feel of him. He walked over to his closet, tossing the condom away.</p><p>“What are you doing?” I sat up.</p> <p>“Getting dressed.”</p><p>“For what?”</p><p>“So I can take you home.” He slipped into a pair of pants. “And so I can go to sleep.” He put on a shirt, and then he looked over at me. “How long do you think it’ll take you to get ready?”</p><p>“I don’t want you to take me home.” I shook my head. “I want to stay.”</p><p>“Here?” he looked utterly confused.</p><p>“Yes, here.”</p> <p>“As in overnight?”</p><p>I nodded, and he stood there staring at me as if I’d just asked him to do the unthinkable. The look he was giving me was one of anguish, regret, and for a second I almost felt bad about suggesting it.</p><p>“Aubrey, I don’t...” He sighed. “I’ve never let someone spend the night.”</p><p>“Then let me be your first...”</p><p>He continued staring at me, tapping his chin, and then he walked over to his closet and grabbed a set of white pajamas.</p><p>“You can sleep in these...” He held them out for me.</p><p>I reached out to take them but he shook his head.</p><p>“Stand up.”</p> <p>I slid off the bed and stood in front of him.</p><p>He took his time helping me into the button up shirt—kissing every inch of my exposed skin until he reached the top button, and when he was finished he kissed my lips.</p><p>I expected him to hold out the pants next, but he tossed them across the room. “Get in the bed.”</p><p>Smiling, I slipped underneath the sheets as he hit the lights.</p><p>He joined me in bed seconds later, pulling me against his chest.</p><p>“Are you happy?” he whispered.</p><p>“Yes...”</p><p>“Are you sure? Is there anything else outside of my comfort zone that you’d like me to do for you tonight?”</p><p>“Not tonight, but you could make me breakfast in the morning.”</p><p>“You’re pushing it...”</p><p>“Just in case you change your mind, I would like Belgian waffles, bacon, sliced strawberries, and orange juice.”</p><p>“Unless you want to eat all of those things off of my cock, it’s not happening.” He pinched my ass. “Go to sleep, Aubrey.”</p><p>In the morning, I opened my eyes and realized I was alone in Andrew’s bed. I looked over at where he’d been sleeping and spotted a note on GBH stationery:</p><p>Had to run to the office to meet a new client. I’ll be back to take you home.</p><p>PS—Feel free to take your panty collection home with you.</p><p>—Andrew</p><p>I slipped out of bed, ready to explore more of his condo, but there was a sudden loud knock at the door. I rushed over and twisted the knob, expecting to see Andrew, but it was a man dressed in all black.</p><p>“Um hello?” I tried not to look too confused.</p><p>“Are you Aubrey Everhart?”</p><p>“Yes...”</p><p>“Great.” He handed me a white bag. “Gourmet waffles, bacon, sliced strawberries, and orange juice, right?”</p><p>Denial (n.):</p><p>A statement in the defendant’s answer to a complaint in a lawsuit than an allegation (claim of fact) is not true.</p><p>A few days later...</p><p>Andrew</p><p>I was officially out of my damn mind.</p><p>I was in my bathtub, and Aubrey was sitting on top of me—panting as she came down from another orgasm.</p><p>She was spending the night at my condo for the third time this week, and it was pointless to even pretend like I minded.</p><p>I wasn’t sure what the hell was happening, but she’d definitely gotten to me. She was infiltrating my every thought, and no matter what I did to try and come back to my senses—to remind myself that this could only be temporary, she slipped deeper into my life.</p><p>“Why are you so quiet tonight?” she asked.</p><p>“I’m not allowed to think?”</p><p>“Not when a naked woman is in your lap.”</p><p>“I was giving her a chance to relax.” I slid my hands underneath her thighs. “What unnecessary bullshit do you want to talk about today?”</p><p>“It’s not unnecessary,” she said. “It’s about your family.”</p><p>“What about my family?”</p><p>“Are they still in New York?”</p><p>I prevented myself from clenching my jaw. “I don’t know.”</p><p>“You don’t know?” She raised her eyebrow. “What do you mean you don’t know? Are you estranged from them?”</p><p>“No...” I sighed. “I just don’t have any parents.”</p><p>She tilted her head to the side. “Then why do I remember you telling me a story about your mom the first month that we met?”</p><p>“What story?”</p><p>“The story about Central Park and ice cream.” She looked into my eyes, as if she were expecting me to say something. “You said she took you to some children’s fair, I think? It was something that happened every Saturday. But the one you remembered most happened when it was raining and she still took you, and you stood in line for an hour just to get a scoop of vanilla.”</p><p>I blinked.</p><p>“Is that story not right? Am I mixing it up with something else?”</p><p>“No,” I said. “That’s right...But I haven’t seen her since.”</p><p>“Oh...” She looked down. “I’m sorry.”</p><p>“Don’t be.” I trailed a finger across her lips. “I turned out just fine.”</p><p>“Can I ask you a few more things?”</p><p>“You have a daily question quota starting today.”</p><p>She rolled her eyes. “What do all the “E” and “H” pictures in your hallway stand for?”</p><p>I felt a sudden ache in my chest. “Nothing.”</p><p>“If you hate New York so much and you don’t like talking about your past or what you lost six years ago, why do you have so many mementos hanging on your walls?”</p><p>“Aubrey...”</p><p>“Okay, forget that question. And the Latin quote across your heart? What does it mean?”</p><p>“Lie about one thing, lie about it all...” I kissed her lips before she could ask me anything else. I was starting to wonder why she hadn’t wanted to be a damn journalist instead of a ballerina.</p><p>“It’s your turn,” she said softly. “You can ask me questions now.”</p><p>“I’d rather f**k you again.” I lifted her with me as I stood up and helped her out of the bath tub.</p><p>We both dried off and went into my bedroom. Just as I was pulling her against me, my doorbell rang.</p><p>I sighed. “Dinner’s early.” I slipped into a pair of lounge pants and a T-shirt and headed to the door with my credit card.</p><p>The second I opened it, I was confronted with the sight of the last person on earth I wanted to see. Ava.</p><p>“Don’t you dare f**king slam it on me this time,” she hissed. “We need to talk.”</p><p>“We don’t need to talk about shit.” I stepped outside and shut the door behind me. “How many times do I have to tell you that you’re not wanted here?’</p><p>“As many times as it’ll take you to actually believe it, which you don’t.” She scoffed. “Ask me why I came to Durham to see you, Mr. Hamilton. Appease me and I’ll finally go the hell away.”</p><p>“You’re going the hell away regardless,” I said flatly. “I really don’t give a f**k why you came here.”</p><p>“Not even if it’s to sign the divorce papers?”</p><p>“You could’ve sent that shit in the mail.” I gritted my teeth. “And since I’m sure you’re running out of loopholes for contesting it, I’m willing to wait until all your options run out. I’m sure your lawyers will drop you as soon as they find out what type of client you are.”</p><p>“All I’m asking for is ten thousand a month.”</p><p>“Go ask the man who was f**king you in our bedroom while I was at work.” I glared at her, livid. “Or better yet, ask the judge you only “fucked for a favor,” or hey, if you’re up to it, f**k my former best friend. Sleeping with him always seemed to make you feel better, right?”</p><p>“You weren’t Mr. Perfect either.”</p><p>“I never f**king cheated on you, and I never lied to you.”</p><p>Silence.</p><p>“Five thousand a month,” she said.</p><p>“Go f**k yourself, Ava.”</p><p>“You know I never give up,” she said, her eyes widened as I stepped back inside my apartment. “I always get what I want.”</p><p>“So do I.” I slammed the door in her face, feeling my heart palpitating, feeling the onset of ugly memories all over again.</p><p>Rain. New York. Heartbreak.</p><p>Complete and utter heartbreak.</p><p>Seeing Ava in person again—hearing her manipulative voice and feeling those familiar pangs in my chest, immediately made me realize that I couldn’t make the same mistake again.</p><p>Aubrey was already asking questions, trying to dig her way into my life as much as she could—thinking that if she stayed around long enough that we would work out together. But I knew that would never happen, not after seeing Ava and knowing just how far she would go to ruin me all over again.</p><p>I was officially done with this monogamous game we’d been playing for the past couple weeks. It was quite fun—different, but since Aubrey could never be mine and I could never be hers, it was quite f**king pointless too.</p><p>I headed back into my bedroom and saw Aubrey smiling as she settled into the bed.</p><p>“Where’s the dinner?” she asked, tilting her head to the side. “Did you leave it at the door?”</p><p>“No.” I shook my head and started packing up her things, stuffing them all into her purse.</p><p>“What are you doing?” she asked.</p><p>“You can’t stay the night.”</p><p>“Okay...” She stood up. “Did something just happen? Do you want to talk about—”</p><p>“I don’t want to talk about anything else with you.” I hissed. “I just want to take you the hell home.”</p><p>“What?” She looked confused. “What’s wrong with you? Why are you—”</p><p>“Make sure you get all of your shit out of my bathroom. You won’t be coming back here again.”</p><p>“Why not?”</p><p>“Because I need to start f**king someone else.” I picked up her headband. “I think I’ve spent more than enough time with you, don’t you think?”</p><p>“Andrew...” Her face fell. “Where is all of this coming from?”</p><p>“The same place it was always coming from. You lied to me once, you’ll lie to me again.”</p><p>“I thought we were over that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Maybe you were, but I wasn’t.”</p><p>“What are you saying?”</p><p>“I’m saying that you need to get all of your things so I can take you home, and from here on out, you are my intern and I am your boss. You will forever be Miss Everhart, and to you I’ll be Mr. Hamilton.”</p><p>“Andrew...”</p> <p>“Mr. Fucking. Hamilton.”</p><p>She rushed over to me and snatched her things, letting a few tears escape her eyes. “Fuck you. FUCK. YOU. This is the last time you’ll ever pull this hot and cold shit on me.” She stormed out of my apartment, slamming the door behind her.</p><p>I sighed and felt an immediate pang of guilt in my chest, but I knew it was the right thing to do. It was either cut this bullshit off now, or be responsible for breaking her heart later.</p><p>I stepped onto the balcony and lit a cigar—looking up at the moonless sky. Even though I felt bad for ending things so abruptly, for putting her out with no explanation, I needed to get back to who the hell I was and fast before I f**ked up and put my heart on the line again...</p><p>Closing Argument (n.):</p> <p>Andrew (Well... back then, you would’ve called me “Liam A. Henderson”)</p><p>Six years ago</p><p>New York</p><p>There’s something about this city that makes me believe again. It’s the hopefulness in the air, the flashing lights that shine brighter than anywhere else, and the dreamers who fill the streets day after day—unwilling to give up on their failures until they finally win. There’s no other city like it, and there’s nothing more alluring outside these state lines—nothing that will ever make me leave.</p><p>As the sun sets in the distance, I wrap my arm around my wife’s waist. We’re standing against the railing of the Brooklyn Bridge—smiling because I just added another high profile client to my firm.</p><p>“You think one day the papers will actually tell the truth about your first case?” She looked up at me with her light green eyes. “Or do you think they’ll keep brushing it under the rug?”</p> <p>“Brushing it under the rug.” I sigh. “I highly doubt the government wants people knowing a kid straight out of law school uncovered a conspiracy. It’s an insult to their organization.”</p><p>“So, you’re fine being reduced to a random Jeopardy question that’ll happen ten years from now? ‘I’ll take lawyers who never got credit for two hundred, Alex.’ You’re fine with that?”</p><p>“Why shouldn’t I be?” I kiss her forehead. “I didn’t need the papers to print my name to get clients. People knew, that’s how they found me.”</p><p>“You should be so much bigger than what you are...” She shakes her head, whispering, “Your name should be plastered across every billboard in the city. Fucking ass**les...”</p><p>Smiling, I tighten my grip around her waist and start the walk back to our car. Out of all the people that have come in and out of my life, Ava Sanchez has been the one constant.</p><p>She’s the only woman I’ve ever loved, and ever since the day I made her mine at our wedding three years ago, I swore that would never change.</p><p>“I was also thinking,” she says as she slips into the passenger seat, “that maybe me, you, and your partner Kevin could go out to a singles’ mixer next weekend.”</p><p>“Why would we go to a singles mixer?”</p> <p>“It’s more so for Kevin...He needs to get his own life. I’m tired of him hanging around us all the time. It’s bad enough that we all work at your firm together, but do we have to spend our every waking moment together, too?”</p><p>Laughing, I drove down the city streets and home to the colossal brownstone we shared. It was the first purchase I’d made after winning the “case that never was,” and Ava had insisted that I buy the most expensive one.</p><p>“Because you f**king deserve it,” she’d said. “And you never treat yourself to anything nice...That’s what I don’t understand about you, Liam. You’re such a nice guy to everyone but yourself...”</p><p>I park our car in front of our home and immediately step out to open her door. As usual, Ava whispers, “I bet she’ll scream for you first,” as I walk her up the steps.</p><p>The second we walk inside, that familiar sweet voice rings out across the room.</p><p>“Daddyyyyy!”</p><p>I let go of Ava’s hand and stoop low so my daughter—Emma Henderson, can run into my arms. She’s the best part of my day, the best part of my life, and seeing her always brings an unbreakable smile to my face.</p><p>I kiss her forehead as she incoherently babbles about her day with the babysitter, and I smile as her blue eyes stare into mine.</p><p>I'm unaware of it now—I’m too blind and happy to see it, but in the months to come, my life will unravel so rapidly and unexpectedly that I'll wish I never existed. The lies that come to the light will be so devastating and crushing that my entire life will crumble around me. But the worst part, the part that will break me, is not knowing that this present moment with my ‘daughter’ will be the last good memory of New York I'll ever have...</p><p>**End of Episode Two** </p> </body></html>"]