["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>Golden Boy</p><p>October</p><p>The Day After My Mother’s Death</p> <p>From the start I had it all—a caring mother, a hardworking father, an older doting sister . . . everything a boy could want. We lived in the most magical place; every day in California was like being on vacation at the beach. Mom stayed home while Dad went to work. We had a nice house and a dog; we laughed, we played, we were very happy. Nothing scratched our perfect existence until the night my father never came home. And then our once shiny happiness was left forever dulled. His sudden absence frayed all that was left of our perfect life, my perfect life.</p><p>Just when I thought there was no mending it, Dahlia London moved in next door. A beautiful blonde-haired girl with the tiniest of noses and pretty heart-shaped lips, she had a love of the beach that could only be matched in intensity by mine. From the very first time I laid eyes on her, I knew she was perfect for me, and she was. She fit into our family like a missing puzzle piece. We grew up being best friends and then one day she was my girl. It was just that easy and it stayed that way for the longest time.</p><p>As happens in life . . . everything between us changed as time passed. We were five when we met and we were twenty-five when we were torn apart. During those twenty years we had created a bond that I thought couldn’t be broken. I’d poured myself into our relationship and I knew she had, too. But she was a little more broken than me, and her fragility made me more her protector than anything else.</p><p>She was fourteen when her parents died and she needed me . . . so I gave her support. She was sixteen when I knew we felt something deeper for each other . . . so I loved her. She was seventeen when her uncle died and she was left alone . . . so I gave up my dream for her. She was the only thing I ever let get in the way of me and my board. It was an opportunity of a lifetime: If I won my next competition, I’d win a sponsorship and get to compete in the Pipe Masters. It was my chance to go pro. But that meant leaving Dahl behind, and she had already lost too many people. So I made a rash decision. I chose to stay with her. I threw the competition on purpose.</p><p>It’s a day I’ll never forget. The weather was perfect. The sun was shining and there wasn’t a cloud in the sky. Surfing conditions were optimal. The water was warm and the waves were high. I paddled out slow and caught my first wave on the shoulder of the peak. Of course I knew better, but the announcer still made the comment that I’d acted too soon, that I didn’t wait for the steep face. He blamed it on my nerves and I let him. My score was well below what was expected from me and I didn’t qualify. There was only one person who figured it out—she never said a word, but I knew all along my mother knew. And with the loss in that competition my dream of competing on the professional circuit came to a screeching halt.</p> <p>When it came time to go to college, Dahl and I knew we couldn’t be apart for four years—so we went together. After college we wanted to start the next phase of our lives—so we moved in together. Then once we had secured our careers, it was time to take the next step, it was a natural progression—so I proposed. But before we even set a date, the world showed what a cruel place it could really be. I was once again forced into making a decision . . . live alone or die together. And that time, I had nothing to throw—so I had no other choice but to leave her behind. I had to protect her.</p><p>That was three years ago and even though I ended up without her, I don’t regret my decision. I had to keep her safe—I loved her too much not to. Life presents choices at every curve and it’s the choices we make that pave the way for our future. Sure, I regret everything up to that point, of course I do. I was a dumb f**k with a huge ego. I thought I could outsmart people who would never let anyone outsmart them. Looking back I should have seen it, but I’d investigated a story that I thought would put me on top of my game and that’s where I wanted to be. Fuck, was I wrong. No, not wrong—plain stupid. The story led to an unbelievable choice. I had to “die,” or I knew my girl and me would both be killed. I know it sounds absurd. Shit like that only happens in the movies, but it was my reality. I wanted to take her with me, I did, but that kind of life wasn’t for my Dahl. So I had to leave my perfect girl behind, and it wrecked me. That choice, my choice—to give her up to keep her alive—is one I could never regret.</p><p>While I was gone, I lived day to day, never looking ahead, never letting anyone in. That is until the unexpected day came. The day I was told the danger was over and I could go home. I had been given a second chance. So I let my shield down and I never hesitated in the least to leave behind the life I had created. Now would come the time to make up for all the wrong I had done. I went back thinking that getting her back wouldn’t be easy, but knowing in my heart it would be worth it.</p><p>Never did I think something so unimaginable would happen. That she would no longer feel the same about me . . . that my beautiful beach-loving, made-for-me girl would have fallen in love with someone else. I didn’t want to accept it. I thought I could win her back. But like I said, the world is a cruel place. She was gone from me before I ever returned. And there was no getting her back. Even if she hadn’t found out about what I’d done, I wouldn’t have been able to. I know that now. I should have let her go long ago, but I’d lost sight of what was real, who she was, who I was. Without Dahl all I had left was my family. And then again the unthinkable happened. My loving, caring mother suffered a stroke and she was gone in the blink of an eye. A loss struck my family again and just like when my father was taken—I was left utterly broken, but this time the girl who had helped me become whole again was also gone.</p><p>If there is a moment in time that comes to alter the course of your life forever—mine would be the day Caleb Holt told me I had to disappear. I don’t even know who I am anymore. I’m alone and left to pick up pieces to a life I don’t have. Rock bottom. It’s a phrase I never thought I’d use to describe myself, but it’s the only one that fits.</p><p>Chapter 1</p> <p>Dead and Gone</p><p>The world spins faster as I stumble forward to enter the front door of what used to be my house with Dahlia. After attempting to hang my keys on the old key shaped holder, they fall to the ground when I miss. I leave them there. Once I’ve made it to the bathroom, I grip the countertop tightly because the wallpaper seems to be tilting and the flowers on it are fading in and out. I lean over the sink to wait for the sick feeling in my gut to pass. When I look up, my vision fuzzes suddenly ̧ blurring her features, but I know it’s her because she’s wearing her pearls. I have to touch her, feel her, so I press my hands to the glass in an attempt to grab her and pull her to me. My pulse thunders in my ears as I splay my fingers against the cool surface and try not to blink, not to lose sight of her. But I can’t help it and when my eyes slam open again, I notice her hair isn’t blonde anymore, it’s red. And this time the pearls are gone, replaced by twinkling emeralds. I shut my eyes tight, willing the room to steady and the delusions to go away.</p><p>“Ben? Are you okay?” a concerned voice asks.</p><p>I pull in a deep breath and open my eyes, cautious, fearful, but this time all I see is the dirty-blonde–haired reflection of my sister and myself. I nod and force all of the air out of my lungs.</p><p>“We have to go. You’re not even dressed. Do you want me to pick out your clothes?”</p><p>I shake my head once and try not to move again for fear the slightest movement will send the room rotating. I can feel her stare, but let the weight of it pummel me before I shift my eyes to hers in the mirror. “No, I can do it. Sorry, just give me a minute to jump in the shower and I’ll be ready.”</p><p>I catch sight of the pain in her eyes. She hastily turns to leave, then pauses but doesn’t twist around as she says, “Okay. The limo is here, but I’ll wait for you in the kitchen.”</p><p>I want to say something else but I can’t. I’m not sure what I’d say anyway. Maybe that I’m sorry. Maybe that everything is my fault. But my mother is gone and nothing I say is going to change that fact. I stand here knowing I have to pull myself together for my mother’s funeral. Without looking in the mirror again, I breathe slowly and finally, breath by breath, the spinning fades just as the hallucinations did.</p> <p>The large red double doors that lead us into St. Mary’s Church feel heavier than they ever have. I must have opened them a couple of hundred times in my life and never thought about the color. It’s the color of apples, the color of blood, but when doors are painted red they are supposed to symbolize a place of safety, forgiveness, and reconciliation. Now as I pass them I have to wonder . . . does that apply to everyone? Even those of us whose souls are ravaged?</p><p>The sanctuary is filled with people, which is no surprise because my mother was friendly with almost everybody in Laguna. Everyone loved and adored her and she felt the same about them. That fact makes me proud. I take the lead and grab my sister’s hand, guiding her down the aisle. As we walk to the reserved pew in the front, I notice the array of flowers that line the altar and wonder if Serena sent some from us. I wish I had thought of it.</p><p>I haven’t been to church in so long that when I kneel and make the sign of the cross before entering the row, it feels foreign, strange even, but natural at the same time. This ritual was instilled in me during my early teen years. After all, I went to Wednesday night Catechism classes until I was fifteen. My mother wanted me to be a good Catholic boy and tried to secure this by making sure that the sacraments of initiation were bestowed upon me. I received the rights of baptism, made my first Holy Communion, and was confirmed like all good Catholic boys. So I guess that means that God has given me the graces necessary to live a truly holy life. I try not to laugh out loud at the thought because the life I have been leading does anything but follow the straight and narrow path.</p><p>Organ music fills the church and Serena starts to cry. When she dabs her eyes with a crumpled tissue, I reach into my pocket and hand her a white hankie that used to be our mother’s. “Use this.”</p><p>She stares at it for the longest time. Catching sight of the monogram only brings more tears to her eyes. My father’s initials, LBC—Lucas Benjamin Covington—are scripted across the corner in navy blue block letters.</p><p>“Where did you get this?” she asks quietly.</p><p>“I found it on the floor in the family room a few days ago.” I don’t tell her it was the day I was supposed to pick her up and go to the funeral home with her to make the arrangements. But since I was late, she had left without me. I don’t need to point out to her what a mess I am. She can see it.</p><p>I just can’t seem to get my shit together no matter how hard I try.</p><p>“I thought I’d lost it,” she says squeezing it tightly in her clenched fingers.</p><p>Suddenly someone leans forward and places a hand on Serena’s shoulder. When I see the large pearl ring emblazoned with diamonds, I know immediately it’s Dahl. I turn and glance at her. She’s dressed in black, like all of us, and she’s wearing her pearls. Next I survey the row, the people sitting with her, him, his brother, and then I notice his sister, S’belle. My eyes dart to her. I want to say I’m surprised she’s here but I’m not. She’s not wearing black, but rather a dark green dress with many gold chains around her neck and I think, rebel. I always got that vibe from her. When Aerie, Dahlia’s best friend since college, makes her way across the pew, I’m forced to shift my eyes away. She nods at me with a sympathetic look, which is more than I would have expected from her. We always had a love/hate relationship. Thinking back, I’m not sure why since we both only ever wanted what was best for Dahl. Then it hits me. Aerie somehow knew all along that I wasn’t what was best for Dahl.</p><p>Caleb, my best friend since I was seven, and really the only friend I have left, is the last person to enter the church and he takes a seat beside me, squeezing my shoulder as he does. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You doing okay, man?” he asks.</p><p>I look over at him and nod. I’m thankful there’s one person in my life that never judges me. He might get pissed at me, we might toss each other around, but he’s like a brother to me and I know he’ll always have my back. He has ever since the second grade—we were in Miss Novak’s class and I was staring out the window, just wanting to be out there, not stuck inside. She had asked me a question that I didn’t hear. He jabbed my foot and muttered the answer. I nodded my head and answered her. After that we were buddies.</p><p>I force myself to focus my attention on what’s happening at the front of the church.</p><p>“Blessed are those who mourn for they will be comforted.” When I hear those words I automatically turn to look for Dahl. The memories of those words and sitting beside her to comfort her when she lost her parents and her uncle send another wave of sadness through my body.</p> <p>There’s a softness in her eyes I wasn’t expecting as she catches my gaze for a minute. Despite the physical and emotional distance between us, and the hatred I know she feels toward me, I find comfort in her being here. But it’s a double-edged sword and I quickly turn back around. She was always a part of my family, but that family has been forever shattered—my mother is gone, Trent is in rehab, and Dahl, well, she’s no longer mine.</p><p>“Friends, as we gather here . . .” The words are muffled as I bow my head and close my eyes trying not to think about my mother lying cold and lifeless in the front of the church. She had passed without receiving the sacrament of last rites. But the good Catholic boy that I was brought up to be, I couldn’t let her go like that. I stepped out of the hospital room after she passed to go find the clergy but saw Dahl out in the rain. I went to check on her, but she didn’t need me and so from there I continued my journey toward the chapel to ask that my mother be anointed so as to ensure her passage into Heaven. Not that she would ever have ended up anywhere else. No, that was for me to worry about, not my beautiful mother.</p><p>Soft organ music plays and I open my eyes to stand. When it stops, we all sit. The priest begins reciting the Final Commendation and Farewell and I move through the rest of the funeral in the only way I can . . . mechanically and distanced. The organ starts to play again and this time when we all stand, I hold my sister’s hand. When I do, I notice her ex-husband sitting next to her and my skin prickles. Jason Holt, Caleb’s brother and my sister’s ex-husband, is a dirt bag. No matter what he does, he always will be. Once my sister divorced him, his visits with Trent were minimal. His goal was always to see my sister through their kid. I don’t care how far he climbs the ladder at work—to me he’s a piece of shit.</p><p>I tug my sister’s hand and start to lead her out of the pew. I step in front of her and Jason moves aside, allowing us to pass. He’s a tall, well-built guy used to demanding respect wherever he goes, so I’m surprised he lets me take the lead. I walk slowly to the front as we make our way to say our final goodbyes. Serena goes first and I stand back, twisting my head, unable to watch. But my turn comes way too fast. Cautiously, I approach the white casket. I can see my mother’s body and wish so much she were alive. My hands clench and unclench at my sides and I take a deep breath as I bow my head. My knees buckle beneath me and I don’t know how I’m going to make it without her. I can’t even find the right words to tell her how sorry I am that we didn’t get to spend the last years of her life together. I swallow, holding back the tears that I’ve forced away for days.</p><p>Voices murmur from behind me. “Ben,” my sister whispers quietly in my ear.</p> <p>Ignoring her, I drop down even further to kiss my mother’s cheek. When I lift my head, I catch sight of her wedding ring shining so brightly and clutch her hand. Fuck, why? Why you, Mom? My sister takes my hand, and this time she’s the one who tugs me away and back into the pew.</p><p>“Mom and Dad are together now,” she says in a broken voice.</p><p>“I know,” I say, and then my tears come in mindless streams that I can’t control. And she’s right. My only solace in any of this is that our parents are finally back together and I know they’ll take care of each other.</p><p>“Come on, buddy,” Caleb says, pressing his hand on my shoulder again. I glance up front one last time and turn back with a feeling of complete emptiness. This time I let Caleb lead the way, guiding my sister and me out of the church. I don’t turn to look for Dahl because I know this time she doesn’t need me; she has someone to take care of her and I am strangely at peace with that.</p><p>Time seems to speed by and the funeral is over before I even realize we’ve moved from the church to the cemetery. I loosen my tie and look around. Branches of a Redwood block the brightness of the sun. I tilt my head to try to catch any shape of a cloud, but all I see is broken fragments of the sky. Swiveling my gaze, I notice the limo is parked just a few feet away. Caleb and Jason are inside waiting for us with the door open. I glance around and suddenly notice everyone else has left. I vaguely recall handshakes and soft-spoken words of condolence. I watch my sister as we both stay frozen in place, two orphans mourning the death of our mother. Then my eyes dart to the ground where our mother’s casket has just been lowered into her grave. And I feel it: grief.</p><p>I’m also filled with guilt, regret, and sorrow. I’m left wondering if her death was my fault. Did my return to California put too much stress on her and cause the stroke? When we took Trent to the rehabilitation center, should Serena and I have insisted that she stay home? Should I have taken my mother to the emergency room the minute she said she didn’t feel well? So many questions and not a single f**king answer.</p> <p>“Are you okay?” Serena asks for the second time.</p><p>I cup her cheeks. “Stop worrying about me. Okay?”</p><p>Her eyes flutter shut and she leans against me. I want to be there for my sister, be the strong one, and see her through everything. But in reality she’s the one seeing me through it. She is seven years older than me, but we’ve always been close, except for the last three years when everyone thought I was dead. But we stepped right back into our easy relationship when I returned—until she thought I’d overstepped my bounds. She was upset at me for not telling her when I found Trent strung out. No matter how many times I try to tell her Trent made his own choices, she still blames herself that he’s ended up in rehab. Blame is a strange thing; it consumes you, haunts you, takes over your life. Hell, she should blame me. I was the one who was the strong male influence in his life until I up and disappeared from their lives. But in the end, my nephew is getting the help he needs and that is really all that matters.</p><p>I should have taken care of everything for today. Instead she organized all of the funeral arrangements while dealing with her son’s situation. I wanted to help but I couldn’t see past the blur of the last two weeks.</p><p>“Hey, Ben, did you hear me?”</p><p>I lift my eyes from the ground to hers. “What did you say?”</p><p>“Come on, we have to leave. Everyone’s waiting for us at the restaurant.”</p><p>“Go ahead of me. I just want to say a few more things to. . . .” I don’t finish because flashes of light blind me. I look over to the tree line at the edge of the cemetery and f**k me if some ass**le isn’t snapping my picture. “Stay here,” I warn my sister and then storm over to the perpetrator. “You’ve got to be f**king kidding me right now,” I yell as I grab his camera and throw it against one of the trees. But he isn’t smart enough to shut the f**k up.</p> <p>He points a shaky finger at me. “Aren’t you the guy who was supposedly shot a few years ago in a car jacking?”</p><p>I level a glare at him. I don’t need this shit right now.</p><p>“You are. I know you are,” he shouts. Then he removes his phone from his pocket and tries to snap another picture.</p><p>I don’t know what comes over me but a switch goes off inside my brain and a rage is unleashed that I can’t control. After the first swing he falls to the ground but I don’t stop. I just keep punching him until my sister pulls me by the collar of my jacket.</p><p>“Ben, stop it!” she screams.</p><p>Before I know it, Caleb is pulling me off him and Jason is quoting some bullshit to him about invasion of privacy. When I stand up and look at my bloody fists and then the perp’s bloody face, I shrug Caleb off me and hastily move toward the limo.</p><p>“Hey, man, wait up,” Caleb shouts behind me.</p><p>I keep walking.</p><p>“Ben, talk to me.”</p><p>I can’t catch my breath. I sit in the limo and cradle my head in my hands. “Fuck, what the hell is wrong with me?”</p><p>“Hey, no one can fault you for laying into that slime ball.”</p><p>I look up at him and give him a twisted smile. The photographer’s camera is in his hand. “Thanks, man.”</p><p>He shrugs. “I found it.”</p><p>I shake my head then ask, “Where’s Serena?”</p><p>He points to a bench near the mausoleum. She’s wrapped in Jason’s arms and my stomach turns. I drop my head. I know he’s a dirty cop. I’ve known it since they divorced. I never had proof; I could just feel it in my gut. It was the things Serena would tell me that made me realize the way he was living his life didn’t add up to the life he was living. Although she’d never admit it, I’m pretty sure Serena knew it and that’s why she divorced him. And now with their son fresh off to rehab, he wants to be here for her. Fuck, f**k, f**k.</p><p>Chapter 2</p><p>Wicked Games</p><p>Voices echo through the small space as we arrive at the restaurant and I look up at the gathered crowd. I brush the doorway with my shoulder not really watching where I’m going and stare unseeing at the thirty or so people scattered around the room waiting for us. There’s a buffet filling a long table off to one side. Some of the flowers from the church are situated in the corners in a failed attempt to brighten the dismal surroundings. As I look around, I wonder how Serena could have possibly arranged all of this.</p><p>“Ben, I can’t do it,” Serena says to me with tears in her eyes.</p><p>“I don’t understand,” I mumble.</p><p>“A few words about mom, I can’t get up there and say a few words about her,” she whispers.</p><p>I take her hand. “I’ll do it.”</p><p>The one thing I’m good at, the only thing that never fails me, is finding the right words. With a newfound strength, I make my way around and talk to those who knew my mother. Then as people begin to fill their plates, I find my sister and we stand together in the front of the room.</p><p>I clear my throat and everyone silences. “My sister and I want to thank all of you for coming today, for being a part of the celebration of our mother’s life. She was an amazing woman who endured a lot in her lifetime. She was the person who kept the people around her from falling apart. I suppose some of her superpower came from the loss of her husband and from being left to raise two children alone. In some people that hardship might have led to a hardening and pulling away. But not Grace Covington; she held a softness that everyone who knew her found amazing.”</p><p>I pause and look around the room filled with those who loved her—Joe the banker, Barb the florist, Noel the guy who took over my father’s shop, his wife, Faith, who was my mother’s best friend. Then I spot Dahl and River. I respect him for being here with her and comforting her. I’m not sure if I were in his situation, I could do the same. I continue speaking.</p><p>“I’m her younger child and I really don’t remember that young mom who was married to the man she loved beyond reason. But my sister told me what she remembers about our parents. She told me that in the loss of her husband and through her sorrow our mother only grew in wisdom and strength. She reached out in ways that I am just now becoming aware of. Through her loss she gained a different perspective on being a mother. She learned that love can help put back together things that don’t seem repairable.” I stop, choking on sobs as I try to get the words out. I glance up and spot the emerald green dress and red hair of S’belle Wilde. Suddenly my thoughts gallop off in a new direction. I know she’s a party planner—my sister must have hired her to plan all of this. She’s clearly in charge, pointing her finger and directing those around her what to do. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But my sister picks up the slack for me when I can’t find the words to continue. She takes a piece of paper from her purse. “I was thirteen when I read the following verse at my father’s funeral and the words are just as true today as they were then. ‘For this reason I bow my knees . . .’” She recites the bible verse she has kept close to her for so many years. Once she is done, together we thank everyone again for being there and I excuse myself needing some air.</p><p>I stagger outside and block out my surroundings for the longest time.</p><p>“Ben, I want you to know I’m here if you need anything.” I’d recognize his voice anywhere.</p><p>I swing around to glare at him, trying to figure out if I should keep my mouth shut but I decide against it. “Jason, look, I know what you’re up to.”</p> <p>“What would that be?”</p><p>“Using our loss and your son’s addiction to get back with my sister.”</p><p>“Is that what you think? Because the way I see it—she needs someone.”</p><p>“She has me.”</p><p>He moves toward me locking his fists at his side but quickly relaxing them. “You know I always thought of you as more than just Serena’s little brother. You were mine, too. I appreciate and admire what you did for them when I couldn’t—the way you took care of my family. And I know you’re under a lot of pressure right now—losing your mother, your girl, and having your life turned upside down—so I’m going to let your attitude pass. But, Ben, remember, I’m on your side.”</p> <p>I want to punch the righteous right off his face. “Oh, is that the way you feel? I’m glad you settled that between us.” I snort.</p><p>“One more thing. Since we’re having such a heart to heart. Trent is my kid, not yours. The next time he gets into trouble, call me. Don’t think you know what’s best for him, because you don’t.”</p><p>My patience for his arrogance has long passed. I move closer and press my finger into his chest. “No, Jason, that’s where you’re wrong. You don’t. You never gave that kid the time of day. I’d even go so far as to say you’re more worried about how it looks that the kid of a vice detective went to rehab than you are about what put him there.”</p><p>“I wish that were the case,” he mutters.</p><p>“Ben, stop it,” my sister calls out as she approaches us.</p><p>I raise my hands and try to talk but she cuts me off. “That’s enough. Just enough for today.”</p> <p>“Right,” I say and walk away. I’ve had enough for today, too.</p><p>Fires have raced up the brushy hillsides and I feel just as pelted by the Santa Anas as those whose homes are surrounded by the blaze. I’m trapped in the flames of misery—lost inside my own ninety mile an hour winds, as time seems to pass so slowly.</p><p>I’m alone. Caleb left town shortly after the funeral. And Serena’s spending more and more time with Jason. He’s been going with her to check on Trent in rehab. But for me the days only bleed into nights. I decide to move out of my house. I can’t stay there. The ghosts are everywhere. I end up catching a break in that there’s a young couple ready to rent it. I move into my mother’s empty house where more ghosts haunt me, but right now, I have no choice. At least I can live off the rental income until I find a job, which isn’t going to be easy. And to boot, that f**king douchebag photographer from the funeral has decided to sue me. Let him see what he can get even if he wins. The house is in Dahl’s name and I have nothing else to speak of.</p><p>I fall into a routine . . . same thing, different day. I go out, get drunk, come home, and descend into oblivion. But the numbness from the alcohol is starting to wane and the pain isn’t fading as quickly anymore. Tonight a new antidote dropped itself right into my lap. I was at the Cliff and just before closing, a chick slipped her hand into my back pocket while I was playing pool. I saw only the back of her before she ducked out, but it was enough to intrigue me. I pulled the note out and read it. I’ve been watching you all night. Meet me around back if you want to know what reward and punishment feels like. I couldn’t turn that down. I exited the bar through the same door as her. I walked around the corner to the parking lot. She was sitting on top of a car, waiting for me. I stared at her as I tried to place her familiarity.</p><p>“Well, well, well, if it isn’t Ben Covington.”</p><p>I was still trying to figure out how I knew her.</p><p>“I didn’t think you’d recognize me. We went to high school together. We were in the same English class.”</p><p>I couldn’t f**king place her and by now it must have been evident.</p> <p>“We were partners on the Tom Sawyer and Huck Finn projects. I made the Mississippi River for you and the blue epoxy stuck to my fingers for days.”</p><p>“Fuck, yes. How the hell are you . . . ?”</p><p>She laughed. “Dawn, Dawn Buckley.”</p><p>I lazily swept my eyes over her and recognition finally hit. She wasn’t the Dawn I remembered. That Dawn was a little freaky—goth, heavy eyeliner, black fingernails. This girl couldn’t look more different. Long, blonde hair, sexy legs, and hot.</p><p>“Yeah, I know I look different so I didn’t expect you to remember me.”</p><p>“No, I do.”</p><p>“I always had a crush on you, you know?”</p><p>I laughed. “Really? No, I didn’t.”</p><p>“You want to get out of here?” she asked.</p><p>She didn’t have to ask me twice. We left in my car and she started things off right when she showed me how this little game of hers was going to go—road head was my reward for inviting her back to my place.</p><p>The porch was pitch dark when we arrived and she began undressing while I fumbled for my key. When we finally made it in the house, we stayed where we landed—in the family room.</p><p>Time must have flown by afterward because now when I stand up and glance out the window I suddenly notice it is light outside and wonder how the night flew by so fast.</p><p>“What time is it?” she asks, squinting as the sun breaks through the blinds.</p><p>“I can’t even tell you what f**king day it is, let alone what time it is.”</p><p>“It’s Sunday or maybe Saturday.” She laughs.</p><p>I shrug and scratch my head wondering why this chick is still here. I should tell her that it is time to end this party, but her presence is helping me forget the things I don’t want to remember. In the kitchen I grab a drink and steel a look at the clock—nine a.m. Fuck, we’ve been at this for hours. I walk back in the room after chugging down another beer and she has a scowl on her face.</p><p>“Did you change your mind?” she asks.</p><p>“No I didn’t.”</p><p>She points to the ground. She wants to punish me and I’m going to let her. Why not? I already knew it was coming—she warned me. She wanted me to go down on her after she got herself all worked up, but I wasn’t into it. Since I refused—punishment it is. I drop to my knees, facing the couch as she instructs. She stays silent. She’s dead serious about this and I try not to laugh. She ties my ankles to the bottom rung of the coffee table with some ribbon she found on my mother’s desk. When she’s done she lies on the sofa and fingers herself. She’s masturbating in front of me and it’s f**king hot. Her method isn’t entirely worthless because I definitely want to touch her now, but her pu**y is too far away. Obviously this is working just the way she planned it—entice me with the view. And I’m enticed. My dick swells while watching her and once she starts humping from her own touch, I take it in my hands and start stroking myself.</p><p>She jumps up in an instant and whips the belt off my shorts. “No, no,” she purrs from behind me. She grabs my hands and tucks them inside the seat cushions of the couch. “Now, don’t make me tie these, too.”</p><p>I’m so turned on by this chick’s forcefulness that my heart is racing . . . I’ll do whatever she wants as long as the rush doesn’t leave. I’m sitting here, naked, on my knees, my back to her, when I feel the cool metal of the belt buckle slide across my ass. From my peripheral vision, I can see her slap it lightly against her palm and my blood starts pumping even faster. How big can a guy’s dick get before it explodes? My ass muscles clench as I prepare for what I think is to come. But she isn’t going to give it to me that easily. She yanks my hair, pulling my head back. “You’ve been a naughty boy. I asked you to do something and you refused. Maybe the next time I ask you—you’ll do it.”</p><p>I have to swallow, not out of fear of course, but, f**k, this is so hot. Her hands are on my balls and she’s squeezing them. “You like it when I touch you?” she asks.</p><p>I’m practically panting and she can’t miss my nod. The leather snaps across my ass and it stings like a son of a bitch. My shoulders hunch and I lean my forehead against the couch when she kneels behind me and again grabs my balls. But this time she runs her other hand up and down my ass crack. “Let’s try this again. Do you like it when I touch you like this?”</p><p>“Yes,” I answer, my voice low and harsh.</p><p>She leans away. “You will learn to give me a complete answer, I promise you,” she hisses and again I can hear the leather slap against her palm.</p><p>But before I can feel the burn of her anger, or the pleasure of it, the sound of my sister’s horrified voice echoes in my ears. Serena screams, “What the f**k is going on? I’m calling the police. Ben, are you okay?”</p><p>I try to get to my feet, but my ankles are tied to the coffee table. “Fuck. Serena what are you doing here?”</p><p>She stands there in shock, as I twist around trying to undo myself. The chick is scurrying to get dressed. Once I’m untied, I rise to my feet and find my shorts. The chick is picking up her things scattered around the room. Serena doesn’t move, but her eyes follow mine every step of the way. Her mouth hangs wide open and the bag of groceries she’s holding is looking pretty heavy. I take the bags from her and set them on the half-round table in the entryway then I flip around. “Hey,” I say to the chick. “Wait for me outside.” At least her forcefulness is only in the bedroom because she hurries past Serena in a flash. I want to tell her to call a cab, but I don’t want to listen to Serena’s shit about my lack of manners.</p><p>I run my hands through my hair. “You should have called first.”</p><p>Serena grabs the plastic handles of the bags and walks toward me, setting them on the coffee table. Why move the bags? I’m not sure, but it got her closer to me. She looks at me with disgust on her face. “Do you even know that girl’s name?”</p><p>I shrug and nod. I shove my hands in my pockets, dropping my gaze to the woolen throw rug.</p><p>“I came over to tell you Dahlia is getting married today. I wanted you to hear it from me first.”</p><p>Everything stops . . . my breathing, my pulse, my churning mind. It takes me a few minutes to pull my heart from my throat. “What day is it?” I ask her.</p><p>“It’s Saturday, October thirty-first, Ben.”</p><p>“Fuck, she’s getting married on Halloween?” My voice falters. I drop to the sofa and cradle my head in my hands.</p><p>After a minute, I look up at my older sister.</p><p>She nods with an equal mix of sympathy and pity and I can’t stand it.</p><p>“She’s getting married on the anniversary of her parents’ death. Why would she do that?”</p><p>“She wants to make it a happy day in her life.”</p><p>I scrub my head. I tried to do that so many times for her. I shuffle to my feet and pace the room. Then I turn back to Serena. “Fuuuck!!” I yell, swiping everything off the desk.</p><p>“Ben!” my sister scolds.</p><p>And that’s all it takes. My trigger. I look at my sister and can tell my eyes go blank. “I don’t give a shit what she does anymore.”</p><p>Serena shouts at me, her face turning red, and disappointment shines from her vibrant blue eyes. “Yes, you do! Of course you do!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With my hand in the air, I walk toward the door. “No. I. Don’t. I don’t give a shit about anyone.”</p><p>“You’re a f**king mess, Ben. Pack your shit and get out of Mom’s house. How dare you disrespect her like this.”</p><p>I spin on my heels ready to argue with her, to tell her she’s wrong. But she isn’t. I am a mess. Her eyes bore into me and I feel like I’m drowning in judgment. I can’t take another minute of it. Keeping my lips sealed, I storm up the stairs where I grab my duffle bag and pack my shit. I’m outta here. I don’t need her trying to be my mother over and over. It only reminds me that my mother is dead.</p><p>When I come down the stairs she’s tidying up the desk. She tips her glance up. “Call me when you get your shit together.”</p> <p>She should try being me for one day. I grab my keys and walk out the front door without glancing back. The sun assaults me and I have to close my eyes for a minute. The glow is relentless . . . yellow and orange burn through my lids. I shade my hand over my brow and look around the house where I grew up, trying hard not to let melancholy set it. The chick is sitting on the planked steps and she glances up at me questioningly. She looks so different from the way she did inside—softer. Dawn, yeah, her name is Dawn. I turn my head and walk past her down the stairs—I don’t need to see soft. “Sorry about that. Mind if we go to your place?”</p><p>“Sure, but I need to get my car first. You can follow me home from the Cliff.”</p><p>I nod and open my door. I start the car and blast the f**king radio before she even gets in. I can’t believe Dahl is getting married to someone else and today of all days. The anniversary of her parents’ death was always the hardest day of the year for her and why she would choose it to marry him—I don’t get. Although I try to erase her from my mind, I can’t let go of the fact that the girl that was made for me found someone who was made for her, and it wasn’t me. I blindly reach to turn the radio up even louder. If I can’t shut my thoughts out, I’ll drown them out.</p><p>Suddenly, I feel fingers creeping up my leg. Shit, I had forgotten she was even in the car. I move her hand to her lap. “Let’s wait till we get to your place.” Once I pull out of the driveway I let my mind wander again. I drop Dawn off to get her car and follow her back to her place.</p><p>She lives in a small, Spanish-style house in the middle of town. It’s in need of a paint job, a number of terra-cotta tiles seem to be missing from the roof, and the grass is sparse, but it looks nice enough. Trees surround it and leaves cover the ground. When I was a kid, I’d rake all the leaves in my yard into a pile and Dahl and I would jump into it over and over. I park in the street and follow her inside. I probably should have asked if she wanted to stop for breakfast after we got her car, but I never thought of it. I was too lost in my thoughts.</p> <p>She waits for me to enter then turns to lock the door, and just like that the quiet, shy chick is gone. She slips back into a dominatrix. Her hands slide into my shorts and reach for me. As soon as she’s touching me, I forget about everything except the feel of her hands. Taking my hand she guides me down a dark paneled hall. I stop and lean against the doorjamb of what I presume is her room. This time she doesn’t close the door behind me.</p><p>“Strip now,” she purrs.</p><p>That’s easy enough. I kick my flip-flops to the side, pull my T-shirt over my head, unbutton my shorts and let them fall. Without having put underwear on, I’m n*ked in an instant. Here’s the thing—it’s f**king daylight out and I’m stone cold sober. “Got anything to drink,” I ask her as she pulls her skirt off and then unbuttons her shirt. Shit, she has big tits. I hadn’t noticed earlier. My dick springs to life when I think of what I can do with those, but I’d still like a drink.</p><p>She walks over and runs her finger up my chest to my chin. “Did I say you could talk?”</p><p>I’m really over her performance by this point. It was fun while it lasted, but that time has passed. A smile crosses her lips as she leans in to kiss me, but I drop my head and start sucking on one of her ni**les. She grabs my hair and tangles her fingers through it. I tug on her hard nipple and swipe my fingers up her pu**y quickly. She’s not waxed and I wasn’t crazy about it when I was wasted and I’m definitely not crazy about it now, but I’m this far already. Shit, I really prefer f**king at night . . . drunk and in the dark.</p><p>She moans when I swipe across her one last time. “Okay, we can do this your way. I’m fine with that. But it’s your loss.”</p> <p>I step back and grin. “I don’t think anyone will be losing.”</p><p>She tugs me toward the bed, but I stay where I am.</p><p>“Where’s the booze?” I ask.</p><p>“Above the refrigerator in the kitchen. I’ll get it for you.”</p><p>“No, I’ll get it. What do you say you lay down and get yourself wet for me?”</p><p>She laughs. But when she asks, “Do you want me to use my hand?” I almost get whiplash. One minute she’s giving the orders and the next she’s asking for mine.</p><p>I leave her on the bed with her fingers circling her clit. The floor tiles are cold on my bare feet as I make my way back to the small kitchen and find a bottle of Jack. Perfect. I open a few cupboards and grab two glasses. Pour and drink. Pour and drink. Pour again. Now, I’m ready.</p><p>I take the two amber filled glasses and head back to the bedroom. She’s lying down with her feet on the floor still going at it. I stand there, watching her.</p> <p>She catches me and smiles. “My fingers are so wet right now. I think I’m ready.”</p><p>I knock back another shot and set both glasses down on the nightstand. I grab my shorts, snatch a condom out of my wallet, and roll it on. I’m ready, too.</p><p>When we finish, I stand up. “Where’s the bathroom?”</p><p>She points to a door on the other side of the room. I scoop up my shorts and hit it. Running my tongue over my lip, I taste sweat . . . it tastes good. I feel good. The water runs and I reach for the soap. It’s shaped like a dolphin and it throws me a bit. I use it to scrub my hands and then throw some water on my face. When my eyes scour the counter for a towel, I notice a cartoon toothbrush on it. I swivel my head around the small space and see a fish shaped step stool and an octopus bathmat. ABC foam letters line the tub. Shit, did I just f**k some kid’s mother?</p><p>The room is bright when I open the door and she’s still lying on the bed. I toss her the towel I found and shrug my shirt on before coming to stand over her, pulling the blanket over her n*ked body. “Do you have a kid?”</p><p>She pushes up on her elbows. “Yes, Jacob. He’s five. He’s with his dad today.”</p><p>I have to swallow. I feel like a shit. “Hey, you probably shouldn’t bring strange men over to your house. It’s a bad habit,” I tell her. Not that she has to worry about me, but you never know about other men and I’d hate for anything to happen to her or her kid. But it really isn’t my business.</p><p>“We went to high school together. You aren’t a stranger.”</p><p>I start to tell her she doesn’t know a thing about me, but let it go. I glance around the room and feel like the air is being sucked from the lungs.</p><p>She tugs on my hand. “Everything okay?”</p><p>“Yeah, I’m fine. I’m just thinking it’s time I head out if you’re cool with that.”</p><p>“Sure, you want my number?”</p><p>“Buckley. Right? Dawn Buckley?”</p><p>She nods.</p><p>“I’ll look you up when I’m back in town.”</p><p>It’s clear she thinks I’m feeding her a line. “Oh, you’re leaving Laguna?”</p><p>“Yes, I think I am. It’s time for me to get the hell out of here.”</p><p>The short walk to my car seems like miles and as soon as I get in, I slam the door and veer away from the curb, accelerating as fast as I can. But I can’t shut the memory out. I was five. It was my Dad’s birthday. Mom baked him his favorite cake and I helped—chocolate with white frosting. She let me lick the bowl like she always did. We had gone to a local dive shop earlier that day and bought snorkeling gear for the family for Dad’s present. “How much fun are we going to have?” my mom said. Her eyes were so blue, just like mine, just like Dad’s. We wrapped the gear in pictures I drew of the beach—pictures of Dad and me building sand castles, me making sand angels, and Serena teaching me how to fly a kite. Things we did all the time—things I’ve never done since. Serena was at cheerleading practice and Dad was supposed to pick her up.</p><p>I close my eyes for one brief second, trying to shut the memory out. When I drive past the beach, I turn around and park. Grabbing a hot dog with extra mustard and a soda, I sit down on one of the breaker walls and watch the waves as they curl over and form tunnels. I have a sudden itch to ride one. I haven’t even surfed since I got back.</p><p>I stare ahead for the longest time, trying to block out the rest of that day, to focus on the surf, but I can’t. The memories come back in pieces, but I recall them all so clearly. Serena called our house. I was icing the cake with a red rubber spatula in my hand. I could hear her yelling at Mom that no one was there to pick her up. My mom took the spatula and let me lick the icing one last time before we left and we went to get her. We picked her up. We went home. We sat. We waited. And waited. And waited. He never came home. Mom started calling around. She called his office assistant; she didn’t know where Dad was. She called Dad’s other employees; they hadn’t seen him, either. She called Adam, Dad’s partner at Blondie’s, their surf shop, and he told Mom he hadn’t talked to him since Dad took the sailboat out to check the sails. He called back and told her the boat hadn’t returned, either. They called the coast guard. The boat was never found. No body was ever found. But that was it. He was gone. No body to mourn. An empty casket just like mine—my mom had to go through that twice. Fuck me.</p><p>A sailboat goes by and its giant mast glints in the afternoon sun, reflecting off the water. Looking out there, I know this is where I need to be, on the water . . . the one place that makes me happy. My Styrofoam cup crinkles in my hands as I stand up and grab my trash. I’ve wasted enough time in my life. I need to get out of here for a while . . . to get away from the scrutiny of the press and forget about all the shit.</p><p>Chapter 3</p><p>Somewhere I Belong</p><p>The people in Australia say they have sand in their souls. I believe it. Thirty thousand miles of paradise and I’ve made sure to circle all of it. Now I’m back to the city that I first landed in six months ago, any surfer’s wet dream—Bondi Beach. I lay in bed, staring out the open window just listening to the sound of the ocean. It’s early, but there’s enough light to reveal a hint of what the waves promise today. It’s my last day in the Bondi Bubble and I don’t want to leave, but I have to. The trial for the drug cartel is about to begin and I’ve been called to testify.</p><p>The time passed here in the blink of an eye. What I’ll remember most is that I was able to forget . . . forget about my life back home for the first time since I supposedly died as Ben Covington so long ago. I feel stronger, more focused, and more determined to make this transition in my life—to finally move on. I’m ready. Being here has helped me put things in focus and I can finally accept that Dahl is happy with someone else.</p><p>Stacks of Surfers End magazines lay on my nightstand. I reach around them to grab my laptop and punch a few keys to bring up my bank account. I officially have less than I paid for my first board in it. Fuck me—where did all my money go? My brilliant plan of living off the rent didn’t work out so well. I shut the lid and lean back thinking about what I’ll do when I get home for money. An hour passes before I decide to get up. When I do, I glance out to the majestic shoreline I’ve enjoyed so much and see families already frolicking on the beach and lifeguards in their signature red and yellow swim caps monitoring them for safety. It’s a slow and easy way of life here—one I could very easily get used to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My clothes are neatly piled on top of the dresser ready to be placed in my bag. My journal is packed, the one I haven’t been able to write in. I survey the room for what’s left—not that there’s much. All I’ll have to do before I leave for the airport is grab my duffle, my briefcase, and my board. But I have time so I quickly shower and head to the Bucket List for breakfast. The diner spills out onto the beach with its wide patio. It’s one of my favorite views of the Pacific. I could sit here for hours staring at the coastline, the glistening sand, and the stone cliffs. The place itself looks like a pirate ship with its faux fisherman style décor, complete with lobster pot lampshades on every table and a namesake mural that looks like a map lining the walls. The only difference being the purpose of the mural is to record your bucket list items and not navigate the sea.</p><p>“You’re finally doing it today?” my waiter Scott asks, pointing to the sharpie I have in my hand.</p><p>I shrug as if it’s no big deal. “I am.”</p><p>“Way to go man, you did it.” He raises his hand and I slap it.</p> <p>After I drink a cup of coffee, I approach the iconic wall with my marker and write my checked off items on it. It reads:</p><p>Ben Covington</p><p>Jog the Bondi Bronte Cliff Walk</p><p>Brave the surf at Tamarama</p><p>Yes, I did do it. I rode the waves of Tamarama yesterday despite its ferocious currents and strong riptides. It took me six months to get back in shape but I can now say: mission accomplished.</p> <p>Time grows short and I move through town in an effort to say my goodbyes—not only to the locals but also to the places. I stop at Icebergs. It’s a local bar with its own outdoor pool wedged right into a cliff. The pool refills itself with seawater whenever waves crash against the rocks below it. And the joint itself is filled with happy, friendly people. No one cares what demons you carry. They’re just here to have a good time. Not to mention, the deeply tanned waitresses saunter around taking drink orders wearing skimpy bikinis . . . talk about living life easy.</p><p>Living in the Bondi bubble . . . life couldn’t be sweeter. But my visit here today isn’t to enjoy the pool or talk to the waitresses, it’s to say goodbye to Kale Alexander, the owner’s son. He and I hit it off right from the start. He reintroduced me to what I once loved—writing. Not just the thrill of catching the story that I had become addicted to, but he reacquainted me with the passion I once felt for words.</p><p>Kale writes for Surfers End Magazine and is worried he’ll be losing his job soon. The publication is tanking in circulation. We’ve had in-depth discussions as to why. His view was very eye opening but I didn’t necessarily agree with it.</p><p>When I walk in he’s sitting where he always does—a table near the railing overlooking the water, notebook in hand. He’s old school—no laptop, just pen and paper. Ironically, I think that’s the issue with the magazine—they need to enter the world of technology.</p><p>I clasp his shoulder. “Hey, man, how’s it going?”</p><p>He looks up, lifting his shades. “Just trying to figure it all out.”</p> <p>I sit across from him. “That’s heavy for this early in the day.” I bob my chin to one of the waitresses and hold up two fingers. She smiles and I direct my attention back to Kale. “Care to elaborate?”</p><p>He sets his pad down and leans with his elbows on the table. “Surfing is at a crossroads.”</p><p>“What do you mean?”</p><p>“Too many of us out there.”</p><p>I scrunch my brows together.</p><p>He points out to the water. “Watch that.”</p><p>I do. Two, three, four, five surfers systematically fading with one another in what at first seems to be some strange choreography. However, once the wave rolls over the surfers are shaking their fists at one another—obviously fighting for the waves and not bothering to wait their turn.</p><p>“Why is no blood being spilled over this? You can’t just fade someone rail-to-rail and get away with it,” he says slamming his fist on the table.</p> <p>It’s a thin fabric that holds surfing together. Kale is a former champion and holds his standards high. I shake my head. “But there are so many unwritten rules out there and some have long passed their use.”</p><p>Our drinks arrive and I push one his way.</p><p>“Too early, man, I have to get something on paper before I can indulge.”</p><p>I push it further toward him. “I’m taking off today.”</p><p>He sits up straight. “Fuck, how about a little warning? I just got used to seeing your scrawny ass around here.”</p><p>“Yeah, right.” I grin and raise my glass before downing its contents. Then I stand up and extend my hand. “Hope to see you in another life, brother.”</p><p>He quickly rises and pulls me to him, patting me on the back. “Take care man and keep in touch. I’m serious about coming out to see your nephew in action. Who the f**k knows, I might even be writing about him some day.”</p><p>“Yeah, wouldn’t that be something. See ya, man.”</p><p>“Oh, and, Ben, make sure you teach your nephew better than what just happened out there. Courtesy is one rule that should never pass its time.”</p><p>I nod. “I completely agree.”</p><p>As I walk away he says, “In my day that would never have happened. If it did someone would have gotten a f**king punch in the head.”</p><p>I twist around and he snakes his arm around one of the waitresses and plunges his tongue in ear before looking over toward me. “Sure you don’t have a little time?” he asks his eyes darting to the chick in his arms.</p><p>I grin at him before I take a last look around. “Next time.”</p><p>I have one final stop to make before I leave—the beach herself. As I make my way through the sand, I think about the many hours I’ve spent here . . . surfing, walking, running, looking for myself. On this beach, I found a part of what I was missing. It was finality, a feeling of closure. Something I missed over and over with everyone I lost. I’ll especially always regret how things ended with Dahl. As I meander down this beach for the last time, I want so much to let that guilt roll off my shoulders. But there are some burdens that just won’t wash away. While I wipe the sand from my feet and slip back into my shoes, I try to focus on the possibility of new beginnings instead of the fact that when I head back to California no one will be awaiting my arrival.</p><p>Just as I enter the gleaming glass doors of the Sydney Airport, my cell rings and I grab for it from my front pocket. I see Caleb’s name flashing across the screen.</p><p>“Hey, f**ker. How’s the newly minted agent?”</p><p>Caleb snorts. “Hey, f**ker, yourself. And you’re being a little premature with your greeting. I haven’t graduated yet, but I am doing f**king amazing. I drove my first surveillance detection route yesterday.”</p><p>“Sounds like a kinky fantasy life if you ask me.”</p><p>“Scraping ice off cars and specialized training classes don’t add up to anything whatsoever kinky.”</p><p>“Sucks to be you then.”</p><p>“Yeah, yeah it does. But not you I’m sure. How’s Australia?”</p><p>“Not a waste of time, I can tell you that, but I’m headed home now.”</p><p>“For the trial,” he asks.</p><p>“Yeah.”</p><p>“Want to talk about it?”</p><p>“Absolutely f**king not. But I do want to hear more about your shenanigans. When are they letting you out of Quantico?”</p><p>“Soon. Really soon.” His laugh is low. “But it’s not like I’m in prison.”</p><p>“I’d say that’s up for discussion.”</p><p>“Over a few beers?”</p><p>“Is there any other way?”</p><p>“Really, how are you doing, man?”</p><p>“I’m managing. I need to get a job when I get back and figure everything out, but right now life is good.”</p><p>“Hey, one day at a time, right?”</p><p>“I’m not in AA, f**ker.”</p><p>“I know, Ben, but when you get back—take it easy. And make up with your sister. Jason said she really misses you.”</p><p>“Yeah, yeah. One day at a time.” I groan and roll my eyes.</p><p>“Listen, I gotta run. I have a simulated bank robbery I have to get to, but I’ll call you next week. And, Ben, I just found out I won’t be home until the end of the year, but I’ll have a month off then and I’m planning on spending it with you.”</p><p>“Aren’t I a lucky bastard then?”</p><p>“Hey, seriously, man, call me if you need me and, Ben, take care.”</p><p>“Yeah, you take care, too.”</p><p>I’ve always liked being independent because if you didn’t depend on anyone, there was no one to let you down. But Caleb and Trent are the exceptions. I looked forward to their calls. Caleb was the one person, besides Dahl, I had always depended on. And Trent was the one person besides Dahl, I’d always allowed to depend on me. The fact that he’s doing so well right now is the shiny spot in my life. He’s out of rehab and back in school. He’s even training for a local surf competition.</p><p>The first time I called Trent from Australia was the hardest. I had just arrived and he told me Dahl went to Paris for her honeymoon. For the longest time when we were younger, I wanted to take her there. I wanted to be the one to show her the Eiffel Tower she had always dreamed of photographing. The days that followed that call are all a blur. After that, whenever I called Trent, I quickly changed the subject whenever her name came up.</p><p>The airplane door swings shut with a thump and I twist my head toward the window. This is it, there’s no turning around—I’m really going back. As the plane takes off I look at the golden coastline and say goodbye to what just might have been my own piece of heaven. White sandy beaches and crystal blue water blend together and I close my eyes as that life fades away.</p><p>When I open them, the wheels are touching down and my old life comes rushing back. Shit, while I was gone I did a great job of not thinking about anything and I only hope I can keep it up. Even Dahl seems to have faded in my memories. Her birthday came and went and I never remembered it until days later. I’m not sure why—maybe the passage of time, maybe the distance. It doesn’t really matter though; whatever the reason, it’s working.</p><p>Standing stiff with tension, I look around Los Angeles International. Home sweet home. I had Trent pick up my car months ago and told him to keep it. Now I have no wheels. I shuffle over to the rental office and take the cheapest they have. I hand the attendant my credit card and get a sick feeling knowing I’m living off of borrowed credit.</p><p>I shove my stuff in the shitty sedan and exit the airport, hopping on the 405S. The freeway is jam-packed with cars, but that’s nothing new. If it’s not an accident or a stalled car bringing traffic to a stop, then it’s construction. I mean really, where else in LA do you get to park your car for free except on the f**king highway. I always hated this town, and today nothing feels any different.</p><p>Thirty minutes later I’m still inching along the road listening to the radio when I look ahead and see the bumper sticker on the car in front of me. It reads, “Life is only what you make of it,” and those eight words remind me of the advice my mother gave me just before we took Trent to the recovery center.</p><p>She looked at me with such sadness and placed her hands on my face before saying, “Please, be happy for the life you have. Make the best of it and don’t waste it. Instead, try to put your life back together. Benjamin, please try. If not for yourself, then do it for me. I only want to see you happy.”</p><p>I grip the steering wheel and jerk my car toward the 110, and away from the road that would take me to Laguna Beach. I silently answer her plea because I didn’t then. “I can do that for you Mom. I can try.”</p><p>With her words ringing in my head, I know what my first step toward a new life has to be—securing a job. So I reluctantly decide to call my old editor from the LA Times. She liked me and I’m sure she’ll be happy to hear from me. I dial the paper and enter her extension. I get her voicemail and leave her a message. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sun is starting to set as I click my blinker, taking the Adams Street exit. I figure the next thing to check off my list is finding a place to stay and it might as well be near the paper since I don’t have a car. When I stop at the light my mind flips to the last time I drove down this street and stopped at this very same place—the day I “died.”</p><p>The glow of the headlights shone through the rain. I hated listening to top 40 music, but I turned the radio station to 102.7 for her because I knew she’d like it and it would make her smile. We were listening to Gavin DeGraw’s “I’m in Love with a Girl,” and I was singing along to the lyrics. She was surprised that I knew the words. Of course I did, I always listened to what she was listening to after all.</p><p>She was watching me, I could feel it, so I turned to look at her. I stopped singing and I told her, “If I ever wrote a song, this is the one I’d have written about you.” Then I got off the 110 the same as I just had and headed toward the Millennium Biltmore. I noticed she was still looking at me. So I asked her, “What?”</p><p>She grinned at me and reached over the console. She placed her hand on my thigh before running it up my leg and said, “We’re going to be late to your first award party, and it’s all your fault.”</p> <p>I grinned and said, “So f**king worth it,” because it was. I needed that one last time with her—I had to show her how much I loved her.</p><p>Then we stopped at a traffic light and she took her hand off my leg to turn the radio station back. I knew the set-up was on. It was time, but f**k I wasn’t ready. I wanted her hand back on me. I wanted to feel her touch forever. But it was too late. Tires squealed. The SUV with heavily tinted windows jackknifed in front of us just as planned. The passenger door opened, and the paid-off shooter in a ski mask jumped out holding a gun with blanks for bullets.</p><p>She screamed, “Oh my God, he has a gun!” but I already knew he would.</p><p>She was afraid and it killed me. I wouldn’t let anything happen to her. I sat there trying to decide if I should just tell her. I couldn’t take it, but once I looked at her, I knew I had to go through with it. She was too perfect, so beautiful, and all too fragile to take with me. So I said, “Just keep calm, Dahl.”</p><p>When I didn’t get out on cue, the gunman tapped his piece against the window a couple of times and then pointed it to her head, reminding me she’d be dead if I didn’t go through with it. So I pretended like I would have tried to flee if I could. I pounded the steering wheel with my fists and said, “We’re f**king blocked in.”</p> <p>Her cries only grew louder and she started to shake.</p><p>I grabbed her hand tightly one last time, while I opened my car door and told her, “Call 911!”</p><p>She sat there in shock and I wanted to cry. But I pulled it together and told her, “Whatever happens, don’t get out of this car. Do you hear me?”</p><p>She screamed, “Ben, don’t!” as I stepped onto the pavement. Then her last words killed me. I didn’t have to be shot to feel the pain because I felt it when she yelled, “You don’t have to be the hero! Come back!”</p><p>Fuck, I wasn’t a hero. I was anything of the sort. But I did what I was taught to do when I heard the shot and fell to the ground. She screamed, “No! No! Noooo!” and that was all I heard from her.</p><p>I hop back on the freeway, wanting to avoid that street. Clearing my head of the memory, I can’t wait to get a f**king drink. I take the next exit I see and pull into the first cheap, extended-stay motel I can find. It’s some kind of Econolodge in West Hollywood. The perks, the check-in clerk tells me, are I’m close to Melrose and Sunset and they have Internet. The only perk I see is that I’m close to the Dodger Stadium and it’s baseball season.</p> <p>I climb the flight of stairs and try to read the sign directing me to room 220. The glow of the moonlight is too dim and the grim that covers the plaque makes it unreadable. With my key in hand, I take a guess and turn right. I pass door after door of peeling green paint and rust. Room 216 swings open, and a chick wearing only her panties stands there. She covers her tits with her hands and then turns to slam the door. I think the squeaking of my sneakers against the stick of the concrete made her think I was someone else. I finally reach my destination and open the door, only to be greeted by the pungent smell of stale cigarettes, alcohol, and if I sniffed hard enough, I’d say sex. The room is a shithole. The carpet is ragged and torn. The walls are dingy. And the TV looks like it’s from 1980. I decide it’s safer to leave what I have in my bag and drop it on top of the dresser. So with the unpacking done, I hit the street in search of a liquor store to buy some liquid relief.</p><p>The sidewalk is crowded—people push and shove each other to move from one place to the next as if that might get them there any quicker. I duck into what has to be a supercenter for booze and peruse the aisle of whiskeys. So many to choose from—tall bottles, shorter ones, blue labels, white labels, darker amber liquids, lighter amber liquids, and then I spot it, Jack Daniels. I grab it off the shelf by its neck and purchase it with my credit card and a smile. My one friend I can always count on. The one who I already know will f**k me up the ass before I even sign my name on the yellow slip.</p><p>The night air is cool and with my brown bag in hand, I take a small detour down La Cienega Boulevard. In the middle of all the high-end establishments sits a bookstore. I pop into it, in search of something to read. I decide on one of my favorite classics—The Adventures of Huckleberry Finn. As I pick up the spine of the dark blue cover embossed with silver letters, a stray memory surfaces. Another one I’ve tried hard to push away, but once it presents itself I can’t stop it. I fight the small smile that crosses my face as S’belle Wilde’s red hair and emerald green eyes pop into my mind.</p><p>Books surrounded me. The library was large and filled with people, along with hushed whispers. I was a senior in college and I was hiding out in the USC library reading Huckleberry Finn, laughing to myself as I reread my favorite part when I felt someone’s stare. Leaning against the bookshelf, I tapped my heel against the mass of books and watched the curious girl set her sunglasses on top of her head and approach me. She thought she was invisible as she snuck my way. But I noticed her . . . I noticed her right way. In fact, I stole glances she didn’t catch as she shuffled books around. First at her green-heeled, pointy-toed shoes that no girl wears to the library. Then at the scarf with quotes on it she had wrapped around her neck. She was slightly overdressed for the library, but she looked f**king amazing.</p><p>I fought laughter as she pushed each book back without even bothering to look at them. I ran my fingers through my hair. My pulse sped up when she swung a glance my way but I quickly averted my gaze. However the first time my eyes caught on her otherworldly green cat eyes, I couldn’t help but stare. When her wildy long, curly red hair bounced with her movement, I became the pretender. I made like I was still reading my book. The cute girl had dropped the book out of her hands and it tumbled to the ground. My eyes stayed glued to her as I bent to retrieve it. My hands grasped it from the floor and as my eyes swept the title, I couldn’t help but smirk. But when she got close enough my smirk turned into a snort, almost a snicker.</p><p>“You’re reading about Kama Sutra?” I raised a brow and tried to feign utter seriousness.</p><p>She answered, but her voice sounded distant. “What?”</p><p>I pointed to the book with a photo of a woman’s body and her panties pulled partially down. “Your book. A Lover’s Guide to Kama Sutra?” This time I had to laugh.</p> <p>“No, no. I wasn’t reading that.” Her eyes widened like saucers and a look of horror crossed her face. She immediately grabbed the book from me and pushed it into an empty space in the shelf. Then she laughed, too.</p><p>After a few moments she pointed to my book. “Homework?” She mimicked me and raised a brow.</p><p>I raised my hands, surrender style. “No. You caught me. Just hiding out reading one of the classics. Fucking Huck Finn. Something he said turned my mind in a way it shouldn’t have.”</p><p>“What?” she asked. Her curiosity peaked.</p><p>“Have you ever read it?”</p><p>She shook her head no.</p><p>“Don’t judge me then,” I said as I opened the book to any page, but recited the line I knew so well.” ‘That is just the way with some people. They get down on a thing when they don’t know nothing about it.’”</p><p>She stifled a giggle as she covered her mouth. And when our eyes locked again, I felt something strange—I felt like she got me. I also knew I should leave. I had a girlfriend that I loved. I blinked, remembering that thought, and handed her the book. “You should read this if you have time. It really is one of the best books ever written.”</p><p>She snickered at that. “Right. It’s up there next to Tom Sawyer.”</p><p>“How’d you know?” I winked.</p><p>I walked backward and kept my eyes on her. I stopped at the end of the aisle, put both my feet together, and leaned forward slightly. I pretended I was tipping an imaginary hat. “It was nice talking to you . . .” I paused, waiting for her to fill in the blank.</p><p>“S’belle,” she finished for me.</p><p>“S’belle.” I grinned. I stood straight again and quickly disappeared around the corner knowing I had to leave.</p><p>She yelled, “Wait, I didn’t catch your name.”</p><p>I called back, “Ben. My name is Ben Covington,” and left the library as fast as I could.</p><p>I clutch the book tight and push the memory away. I’m getting good at that. The word ghost catches my eye and when I glance at the shelf, it’s a book about haunted locations around Los Angeles, I grab it as well. I may despise LA, but certain stories and historical events that occurred in this city fascinate me. As I’m checking out, I see a rack of journals right next to the cash register and pick one up. It’s black with gold gilded pages, similar to my old ones. The ones I no longer have. I haven’t allowed myself to put my feelings on paper since after my mother’s death, since the day I gave Dahl the journal I kept for her, but I think it’s time now.</p><p>Turning the corner back toward my hotel, I spot a small coffee shop like the one in Laguna. The sign on the window reads Four &amp; Twenty Blackbirds and the name catches my eye—pie. I peer in the window. Pressed-tin walls and communal tables with a few booths cultivate a sense of small-town charm and I know I’ll be coming back here. The night’s young but I’m feeling wrecked. I still have one more thing to accomplish today before it’s over. I pull out my phone and search for her number. Making this call might be a risk, but since she hasn’t phoned me back I can only assume she isn’t checking her messages until Monday. So calling my former editor at home is my only option.</p><p>“Hello?” Christine answers.</p><p>“Christine, it’s Ben. Ben Covington. How are you?”</p><p>“Ben.” Her voice breaks. And although I know she already knew I was alive, her surprise is still genuine. Her professionalism quickly returns. “I’ve been meaning to call you.”</p><p>“Good, that makes two of us. Can we get together and talk?”</p><p>“Yes, I’d love that. Unfortunately, I’m out of town until Friday afternoon, but I can meet that night. What do you say to Novels at seven?”</p><p>“Great. I’ll be there. See you then,” I say and hang up.</p><p>I’m almost back to the motel when a flash appears in front of me. Fuck me—the paparazzi found me already. I’m not in the mood for their shit, but game on. I weave in and out of stores until I find one with a back door. Once I lose the douchebag, I hightail it to the fleabag motel.</p><p>Not feeling nearly as tired anymore with adrenaline coursing through my veins, I pour a drink. I flick on the TV, which surprisingly works, and make my way to take a shower. A few stray hairs in the bathroom make me hate my life even more. I glance at myself in the mirror. What the f**k have I done with my life—I’m twenty-seven, staying in a shit bag motel with no money and nothing to look forward to. I stand here in silence and ponder my decision—questioning this supposed new start of mine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A few hours later, I’m struggling to get some sleep when a disturbance from next door gets louder. Male, female, I can’t tell because the voices are muffled, but the act is undeniable. The lack of light through the broken blinds clues me in that it’s either really late or really early. I roll over and cover my head with the pillow, but can’t fall back to sleep. After a few minutes, I turn back around. The moans and groans are gone, replaced by quiet whispers that can still be heard through these paper-thin walls. I stare at the plaster peeling from the ceiling and watch the fan blades moving around as I try to stop my mind from thinking about how I ended up here. It wanders and I mentally scold myself for allowing any form of self-pity.</p><p>I jump out of bed to grab another drink and my journal. I run my fingers along the lines of the page and then let the ink bleed upon it. I write about Australia, how sweet life was there. I write about the upcoming trial, I even write about finding a place to live and calling Christine for a chance at a new job. When I’m done, I close the journal and set it on my lap. New journal. New beginnings. New life. I eventually drift off, spending the rest of my first night back in California alone in a fleabag motel.</p><p>Chapter 4</p><p>Cry Me a River</p> <p>As I exit the door of my fleabag motel room, the unexpected brightness of the outdoor light blocks my vision and the rain assaults me. Once my eyes adjust, I stick my earbuds in, pull up my hood, and blast my music. I’ve been listening to “Cry Me a River” on repeat. Why? I couldn’t say. I f**king hate JT. But the song reminds me of, well, me. I run for as long as I can but honestly I hate running in the daylight. Normally I run in the dark. It gives me a sense of freedom.</p><p>I arrived in this shitty town on Saturday and by Tuesday I was so f**king bored I couldn’t stand it. For the first few days I spent mornings in the library and the nights drinking alone in my room. Now I’ve decided exercise might help pass the time. Breathing in the California air, I think that it couldn’t be any more different from the air in Australia. Thunder rumbles overhead and I watch as everyone scurries for cover. The rain comes down harder and blurs my vision. Flickers of lightning brighten the quickly darkening sky. I glance up to watch the flashes and notice a neon red sign that reads Beck’s.</p><p>Cutting short my run, I slip inside what looks from the outside to be a small hole-in-the-wall. But it’s actually pretty big inside. There’s a jukebox in one corner. A few booths line the wall to my right and a bunch of tables are scattered through the room. What really draws my attention is the giant bar. It’s shaped like an L and behind each side sits a wall of beer taps. There must be almost a hundred different brands.</p><p>Shaking the water from my head I make my way to one of the stools. The guy behind the counter is intent on his laptop screen but he closes it as I approach the bar. He stands and rounds the corner. “What can I get you?”</p><p>“Whatever you have to take the boredom away.”</p> <p>He smirks. “If I had the cure for that I’d be out of the bar business, but rich as hell.”</p><p>I chuckle. “Yeah, probably. I’ll have a beer.” I turn to check out the wall behind him. “Fosters.”</p><p>“Paying tribute to the Aussies?”</p><p>“Something like that.”</p><p>He extends his hand. “I’m Beck Cavanaugh.”</p><p>“Ben,” I say extending mine. “This place yours then?”</p> <p>He grabs a mug. “My Dad’s. I’m helping him out. Well more like I’ve taken over for him temporarily.”</p><p>“He sick?”</p><p>He tips the glass and fills it. When he turns around he says, “Something like that. What about you. What do you do?”</p><p>Just as I’m about to sip my beer, my cell phone rings. I pull it out and glance at the screen before saying, “Excuse me.”</p><p>He nods and flips his computer around to return to it.</p><p>“Hello,” I answer.</p><p>“Ben, this is Agent Bass. We’d like you to come in tomorrow morning to discuss your upcoming trial testimony.”</p><p>“Sure. I wondered when you’d be calling. What time?”</p> <p>“Nine. I’ll send a car.”</p><p>I laugh. “Are you tailing me?”</p><p>“Why do you ask that?”</p><p>“How do you know I don’t have any means of transportation?”</p><p>She dismisses my question. “A car will be in front of your hotel at nine. I’ll explain what I can at that time.”</p><p>I sip my beer. “Okay then.” I guess she knows where I’m staying as well.</p><p>She disconnects and I just stare at the foam settling inside my mug.</p><p>“Another?” Beck asks.</p><p>I put my hand out. “No, I’m good. So what is it you’re doing over there?” I nod my head toward his computer.</p><p>“You know anything about social media and apps?”</p><p>I grin. “I know about them, yes. Do I have a Facebook or a Twitter? No.”</p><p>“Cool. You’d make an excellent beta tester then.”</p><p>I look quizzically at him as he grabs his computer and rounds the bar to sit next to me. He spends the next hour showing me an app he’s developing to combine all forms of social media into one easy-to-use program. It’s rather impressive.</p><p>As the work day ends and customers start to enter the bar, I decide to head out. I need to get my thoughts together . . . prepare myself to think clearly for tomorrow. I thought I had accomplished that while I was in Australia but this week I let my sharpened mind wander. I say my goodbyes and exit the bar.</p><p>When I come to the door, I stick my earbuds in, step out into the rain, and think about the case. Two of the heads of the Mexican drug cartel I’d investigated were arrested last October but there were always believed to be five people running the operation. Well, really, ever since Caleb presented the information to me I thought one guy was at the helm and the other four followed his lead—but I could never prove it. The fifth guy was actually the cleanest. Of course I uncovered a lot about the operation because Caleb gave me a lead that no other reporters had.</p><p>And what I uncovered was an enormous setup of drug runners selling methamphetamines, cocaine, heroin, and more. I always feel uneasy when I think back to what my initial investigation led me to—drops, people, routes, banking info, and other data I never even had a chance to dissect. Facts I had stupidly kept track of even after killing the story. Details responsible for the assault on Dahl. Information I gladly handed over to Caleb before I left for Australia. Fuck . . . why am I still involved in this thing? What am I missing?</p><p>The next morning I glance at my watch, a cheap Timex I bought off a street vendor in Times Square while I lived in New York City. Eight forty-five a.m. I make a mental note to go through the boxes in my mother’s attic when I go back to Laguna to see if my Nixon is in one of them. I was wearing it the day I “died” but I wasn’t allowed to keep it. All of my personal belongings were given to my mother. Serena bought me that watch for my twenty-first birthday because she knew I’d appreciate the tide watch dial.</p><p>A black SUV with heavily tinted windows pulls up to the curb and the door opens. Without a word from the man in a suit, white dress shirt, and tie, I hop in. We ride in silence to the white high-rise building on 11000 Wilshire Blvd. He pulls the car over, hops out again, and opens my door, motioning for me to get out. As soon as my feet hit the pavement another dude dressed just like the driver approaches me.</p><p>“Mr. Covington, follow me, please.”</p><p>After sailing quickly through security, we approach the glass enclosed reception window and my companion offers a single nod. The receptionist hands me a visitor’s badge and I wrap the cord around my neck. My nerves are buzzing as we pass the round gold seal of the Federal Bureau of Investigation, the framed picture of the president, and the various most-wanted posters that I feel I’ve passed a few too many times in my life.</p><p>“Special Agent Bass is waiting for you inside,” the man tells me.</p><p>They’ve arranged for us to meet in the same conference room that we used last year when I first returned. Fuck, it seems like it was yesterday that I sat in this very room waiting for my mother to arrive. My mind flashes back and I suddenly feel shaky.</p><p>The suits had left me in there for hours. The ticking of the clock was my only solace. One suit finally came back in and told me my mother was in the building. I asked where she was, then was informed that she was talking to one of the Special Agents in the waiting room. I tried not to lose my shit as I tore out of that f**king place. I wanted to be there when they told my mother. I knew it would be a shock to her that I was really alive—that I wasn’t actually gunned down that night while on my way to an awards ceremony. I ran through the hall and stopped on my heels when I saw Special Agent Bass talking to my mother. I was relieved when I saw the agent was a woman. Why, I’m not sure, but somehow I felt there would be more sympathy from a woman explaining the circumstances to her than a man. They were sitting in the corner of the room. My mother was crying so I knew she had been told and her tears made me instantly regret ever agreeing to the whole set-up in the first place. She looked like an emotional wreck and the remorse I felt for the choice I made to leave, to not stay and turn this over to the FBI, weighed heavier than ever on me. But once the ball started rolling there was stopping it. Thank f**k Caleb had taken things into his own hands and contacted the FBI shortly after I left.</p><p>When my mother looked up, her mouth fell open, and I could see she was shaky, unsure. She stood up but didn’t step forward and I walked over to assure her I was real. Once I was standing in front of her, she blinked and then sighed before throwing her arms around me. It overwhelmed me and I’ll never forget holding on to her for the longest time.</p><p>She was always my biggest supporter. To her I could do no wrong—I was her golden boy, the son that looked just like his father, the man she had also loved unconditionally. Our brief but emotional reunion was interrupted when the Special Agent Bass ushered us back to this room.</p><p>“Sir, are you okay?” The suited man standing next to me is giving me an odd look since I’m standing frozen before the conference room door.</p><p>So I shake off the memories, nod, and turn the knob to open the door. The escort closes the door behind me. Special Agent Bass is sitting at the end of the table looking through a pile of papers. Two men sit on either side of her. The one to the left is older than I am and the one to the right appears about my age. They all rise when I enter.</p><p>“Ben, I hope this wasn’t too short notice. But I really wanted you to meet Special Agent Gallant and Detective Keyes.”</p><p>After a round of handshakes, Agent Bass sits back down and folds her hands. The older man’s smile is polite and anything but genuine as he shuffles his papers around once we’re all seated.</p><p>“These two men have been working on the cartel case for over four years. They have some questions for you that I wasn’t able to answer.” Her eyes dart to the older man, the detective, and he clears his throat.</p><p>“Mr. Covington, I just want to be blunt. We recovered the flash drive you gave to Caleb Holt and found nothing but a list of names and phone numbers that appears to be taken from a telephone directory.”</p><p>I shrug my shoulders. “I told Agent Bass I didn’t have time to decipher the information.”</p><p>“Yes, we’re aware of that. But we have had the time. In fact we’ve spent an enormous amount of time doing just that only to come to the conclusion that the data means nothing.”</p><p>There is a long pause as everyone stares at me. “Wait, you don’t think I still have information do you?”</p><p>The younger agent clears his throat. “We believe there is information still out there that can help us convict Medina and Blanco. Right now if we proceed with the trial my best guess is they would end up convicted of smuggling. We have the 50-kilogram shipment that we intercepted the night Josh Hart was caught after he attacked Dahlia London and that’s it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“They ordered more than 100 murders. How can that be all you have?” I ask.</p><p>“We have houses purchased to store coc**ne that are empty. That’s what we have.”</p><p>“Fuck!” I yell. “I had it all detailed in the story . . . the routes, the houses, the people, the money trail.”</p><p>“We know but without the data that supported the story we are at a standstill,” Agent Bass informs me.</p> <p>I shake my head. “I gave it all to Caleb. I told you that. I didn’t even keep a backup on my computer. I didn’t want anything left behind.”</p><p>“That’s not entirely true, now, is it?” By this point the detective practically seethes in anger.</p><p>“Phil, Ben has been through a lot. I think he’s given us everything he has.” Agent Bass defends me to the detective.</p><p>Our silence takes over the room as I struggle to compose myself and he does the same.</p><p>Thirty minutes and a dozen of more of the same questions later, I’m walking out the door and being escorted back into the black SUV. As we drive back to my fleabag motel, we pass Beck’s.</p> <p>“Hey, pull over here,” I direct the driver.</p><p>When he does, I hop out and slam the door. I’m pissed as hell that they think I might have held on to information and even more pissed that they can’t figure out what they have. Are they f**king imbeciles? I’d have offered to do it myself but there’s no way I’m opening that Pandora’s box again.</p><p>“You okay, man?” Beck asks when I storm through the door.</p><p>“Could be better.”</p><p>“Want to talk about it?”</p><p>For some reason I do and for the first time in a long time, I open up and tell him everything I’ve tried to forget—and as the weight starts to lift, it feels so f**king good to finally breathe.</p> <p>Chapter 5</p><p>Demons</p><p>Friday morning comes way too fast. I feel hungover as shit and for the first time in a while I don’t get out of bed right away. Everything I worked so hard to move past is right back in front of me and I want to just forget it. When I finally wake up it’s after three. I roll out of bed and run down to the small coffee shop I’ve gone to every day this week. The girl behind the counter has worked every day since I got to LA. And just like the previous days, when I approach she smiles, almost like she feels sorry for me. And just before, I shrug off her attention with a smile in return.</p><p>When I get back to the motel, I read for an hour or so and then grab my journal to write down everything that happened yesterday. A phone book directory? It makes no sense. All the other data I sorted through was pretty straight forward, but I don’t have time to ponder what Bass said. I have thirty minutes until I’m supposed to meet Christine and it’s at least ten blocks away. I take a quick shower and since Novels is nothing fancy I throw on a pair of chinos and a plaid button-down. I opt for my sneakers since I don’t have any dress shoes with me.</p><p>Walking briskly through the cool night air, I arrive at the restaurant just a few minutes after seven. I look around but I don’t see Christine anywhere. I inquire with the hostess and she leads me to a room on the other side of the restaurant. I spot her immediately. She’s seated in a secluded quiet booth in the corner. When I approach, she smiles and stands to greet me.</p><p>“Ben.” She sighs.</p><p>“Hey there gorgeous. Sorry I’m late,” I say, laying on the charm in the way I know she likes.</p><p>“It’s so good to see you.” She hugs me. She pulls back to look at me again and then draws me in a little too close, for a little too long.</p> <p>I finally break free and give her the once over like she’s giving me. The only difference is my examination doesn’t last long and is much less obvious. She’s around my sister’s age, attractive with long hair and dark eyes, but looks older. She’s wearing a short dress with a low neckline, not the same kind of casual I went for. I notice two glasses of wine and sushi already on the table.</p><p>“I thought we would celebrate your return and I ordered us some food. I haven’t eaten all day and I needed something to hold me over.”</p><p>It’s just like old times and I can’t help but give her a big grin. We spend the next thirty minutes talking about what happened to me. I keep to the basics—where I lived and what I did while I was in New York City, avoiding any other details since a gag order prevents me from discussing the case. We consume two bottles of wine in no time and when she prompts me to finish off the last of the sushi, I do. The waiter had approached us a few times to see if we were ready to order dinner, but Christine dismissed him each time with a simple wave of her hand. Finally, she beckons him to our table and I think she’s ready. Not only am I starving, but ordering also puts me one step closer to ending this night. However, when he approaches she only orders another bottle of wine. I don’t say anything. She’s running the show and she knows it. I’m used to this. Every after hours meeting I ever had with her was always on her timetable and always involved at least one bottle of wine.</p><p>“Sir, are you ready to order?” the waiter asks, after pouring the new bottle of wine. I glance across the table directing the question to her.</p><p>“Give us thirty minutes of uninterrupted time, please. We have business to discuss.”</p><p>After one more glass, I am seriously buzzed and I haven’t even gotten to the reason I called her. Wanting to get it out there, I interrupt her chatter as she tells me about management structure changes and circulation issues at the paper. I clear my throat, hoping to sound a little more professional than I feel at this moment. “Christine, I asked to meet with you because I really need a job and I was wondering if you could help me out.”</p><p>Suddenly the restaurant seems very quiet. She takes another sip of her wine. “Oh.”</p><p>“Yes, I’d love my old job back.”</p><p>She stretches out her arms and swirls the liquid in the glass she’s holding while making a face as if in deep thought. She really does enjoy putting on a show. When she sets her glass down and leans forward slightly, I avert my eyes to avoid seeing the tops of her br**sts. But when her cool hand covers mine, I can’t stop myself from flinching. Her fingers stroke my skin, soft, slow. This whole charade literally makes my skin crawl. Some might call it sexual harassment. Me, I see it like it is—an older woman looking for attention. I was always good at giving her just enough. But tonight, walking the line seems more difficult.</p><p>“We might be able to work something out,” she says.</p><p>I look anywhere but at her. “Work something out how?”</p><p>She clears her throat. “Listen Ben I’m not going to beat around the bush. I want the article you wrote before everything happened.”</p><p>I guess the cougar wants my piece, not me. Although I’m not sure I should be shocked by this turn of events. After a beat, I answer. “Come on, Christine. You know I killed that story a long time ago.”</p><p>“Yes, I do. But you wrote it with intentions to publish. Didn’t you?”</p><p>I raise my brows. “Of course I did. Why do you want it now?”</p><p>“Do you really need to ask? It’s breaking news. Front-page news, even. It was the catalyst behind everything that has happened.”</p><p>“You don’t know that.”</p><p>“Ben. No more games. You and I both know what happened. I’ve been around this business too long.”</p><p>“Well, I don’t have it.” The muscles in my jaw tighten. All I want is to put that part of my life behind me and move forward. “That story is old news. You know I’m good at my job. I can help increase the paper’s circulation. You know I can.”</p><p>Her stare is relentless.</p><p>My wasted brain assesses the situation, but there’s no way out of this that will end well. I need some time to think. I set my glass down and decide I’ll hit the restroom. But my shaky fingers let go too early and the goblet tumbles over, spilling the wine everywhere. I grab my napkin and quickly start wiping it up. Her hand covers mine and she leaves it there.</p><p>“Christine, what are you doing?” I mutter with my voice a little strained.</p><p>She looks at me, and her eyes narrow.</p><p>“What?” I ask.</p><p>“Dammit, Ben! You worked for me. You owe me. Give me something.”</p><p>“I owe you? Like you said, you know how this business works. No one owes anyone anything.” I sit up straight and look across the table into her eyes. Now she looks really pissed. What the f**k? Her lips curl and her nostrils flare in the most unsightly way. She reminds me of one of my mother’s friends, one that I’ve never cared much for. The thought makes me wince. The waiter comes to the table to take our order, but he receives another wave of the hand. This one more exaggerated as Christine barks, “Our check. Now.”</p><p>He sputters but doesn’t dare speak.</p><p>My stomach lurches and I make a gagging noise. She shoots me an annoyed look.</p><p>“Excuse me.” I stand up and race to the bathroom. Fuck, I feel sick. I make it to the bathroom and puke my guts out. A cold sweat coats my body. Not sure if it was the sushi, my nerves, or the wine, but all I know is I have to get out of here. I trudge back to the table but remain standing next to her.</p><p>Her stare is unrelenting. The candlelight reflects red on her skin, making her look even angrier. I bow my head and tuck my hands in my pants pockets and try to sound contrite. “Christine, I’m sorry, but I have to leave. I feel really sick.”</p><p>Her lips purse in silent rebuke as her glance sweeps me from head to toe before she waves her hand toward the door.</p><p>I manage to keep my voice even as I say, “Goodnight, Christine. Think about what I said.”</p><p>There’s no response as I turn to walk away. I don’t even care how much the f**king cab costs me because there is no way I can walk home.</p><p>“Taxi!” I yell, as soon as my feet hit the pavement.</p><p>The road is dark and the streets are bustling with people milling about as I sit in the back seat and close my eyes to block it all out. I wish I could just wake up from this nightmare of a life I’m leading.</p><p>When I finally unlock my door, I go straight to bed. The room spins with reflected images from outside onto the ceiling. Again blonde hair morphs into red and pearls turn into twinkling green emeralds across my mind’s eye before there is darkness.</p><p>Chapter 6</p><p>Sail</p><p>I spent the morning on the bathroom floor dry heaving for hours before I felt well enough to make my way back to the bed, where I can’t even pull my shit together long enough to get up for a cup of coffee. Around five, I grab my phone and notice I have a message from Christine. I’m shocked when I listen to it. “Ben, it’s Christine. I thought over what you said yesterday and of course I have a position for you. You start Monday, nine a.m. sharp. See you then. Toodles.”</p><p>Fuck me—I didn’t give in and she’s still giving me a job. I instantly feel better. My life is turning around. I can feel it. I head down to Four &amp; Twenty Blackbirds to grab a drink, a sandwich, and a slice of pie with a feeling of hopefulness I haven’t felt in a while. The chick who’s usually behind the counter isn’t there, but then again it’s later than I usually come in. She’s probably already off work. I order my stuff and sit at my regular booth near the window.</p><p>“You do that a lot,” a raspy voice says.</p><p>At the sound, I look up to see counter girl with her apron off but grasped tightly in her hands.</p><p>“What do I do a lot?” I ask her.</p><p>“Stare out the window and just look at the people walking by.” She takes a seat across from me.</p><p>“They’re interesting to watch.” I point out the window at an older man walking his dog. “See him?”</p><p>She nods.</p><p>“He’s trying to get his dog to listen to him. He thinks he’s training the dog, but really the dog is training him.”</p><p>She laughs. “Yeah, I can see that.” Then she points to a woman with a young boy. “What about her?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I offer her a big grin. “Oh, that’s easy. Her son wants a toy and she has somewhere to be so she’s telling herself she’s compromising but really she’s bribing.”</p><p>She nods again. “Fascinating.”</p><p>We go through a couple more rounds and she gets the idea and begins trying it on her own.</p><p>That gives me a chance to take a good look at her. She’s cute with dark brown hair and freckles. I’d guess her age at no older than twenty-four. She has an innocence about her that reminds me of Dahl when she was younger.</p> <p>“I’m Ben.” I reach my hand out.</p><p>“Ruby,” she smiles.</p><p>“Nice to meet you, Ruby.”</p><p>She blushes and I laugh. I haven’t met someone like her in a long time. We talk for about an hour before she looks at her watch. “It’s getting late. I should probably be going.”</p><p>I stand up and shove my hands in my pockets. I don’t try to dissuade her or ask her out. “Yeah, me too. I’ll see you around.” I extend my hand again.</p> <p>Her grip is weak. She’s timid. And she’s blushing again. After spending the past sixty minutes talking to her, I realize she’s not as similar to Dahlia as I first thought. But that’s okay. She was refreshing to talk to. Even though she seems like a nice girl, any kind of romantic entanglement is the farthest thing from my mind right now. I’m not looking for a love interest—girlfriend or otherwise.</p><p>“Yeah, see you around.” She smiles.</p><p>I’m thinking about heading over to Beck’s as I leave the coffee shop but decide I’ve had enough to drink for a while, and need to be clear headed for my new job on Monday.</p><p>I could always schmooze a congressman’s wife, a publicist’s sister, even a former teacher’s husband, with a few carefully crafted words. Well-rehearsed flirtation is what Dahl used to call it when she heard me in action. When there was a story, I knew how to set about getting it. It was my calling. I can only hope it still is.</p><p>After a week of training for this f**ktastic job, I’m finally on my own. Taking in a deep breath, I tell myself I can do this. I can get the story, regardless of what type of story it is. Today should be like going after any other piece—but I know it really won’t be.</p><p>I button the last two buttons of my shirt and comb my fingers through my wet hair without glancing in the mirror. I shaved for work today, something I rarely do. The worn leather of my messenger bag in my hand makes me smile. It was the one thing I searched for in the boxes of my stuff that my mom had stored in her attic when I first returned from New York City. I grab it and sling it over my shoulder before walking out the door of the fleabag hotel that has become my home. I decided to stay here until I figure out what’s permanent in my life. But I know I’m stuck here at least until after the trial. Once it ends, I’ll be able to decide if I’m staying in California or heading back to New York City. Who knows, I may even go back to Australia.</p> <p>I saw Trent last Sunday. I took a bus out to Laguna and we met at the beach. We surfed all morning and then I took him out to lunch. He looks good. He seems to be doing really well. He asked me to help him—he wants to start competing. We discussed the commitment needed to compete and he seems to have it. I know he’s been up before dawn for months and out there conquering wave after wave. He wants me to talk to Serena—to convince her to take him to Hawaii to get the feel of it. He’s planning to go to college in Hawaii and wants to compete in the Pipe Masters. I told him I would try. I also promised that Sundays at the beach would be our thing from now on, but I’d need a few weeks to get a car first. He wanted to give me mine back, but no way was I taking it from him. I know how much he loves it.</p><p>Making that phone call to Serena was tough but last night I finally did it. She answered on the first ring. We’d been communicating through Trent since I left for Australia, but hadn’t actually talked in over six months. She asked how I was and I told her the truth—that I was a far cry from getting my shit together but I was much better than the last time she’d seen me. I didn’t bring up Jason. I didn’t have to. Trent told me his father was coming around more and that his mother seemed happier—so I decided to just accept it. In the end, the conversation went extremely well. Turns out, she thinks surfing is helping to keep Trent on course and has already arranged for the two of them to go to Hawaii at the end of the month. I was glad to see her on board, but honestly didn’t expect anything different. After all, she is just like our mother.</p><p>Glancing at my watch, I realize I have to jet. Today I have my first official interview. I’ve spent the week learning the ropes, the ins and outs of the job. And I’ve hated every f**king minute of every day. But I still show up, nod my head, and wait for the day to end. Truth is, it pays well and I need the money. I tried to discuss my new position with Christine, but she won’t answer my calls and her secretary just tells me she’s not available. I know her game—she wants what I don’t have to give. So I suck it up and march forward because a job’s a job.</p><p>I make one stop by Four &amp; Twenty Blackbirds for my morning cup and as usual I’m greeted by Ruby’s effervescent smile. She’s so grateful that I introduced her to Beck that she now considers me a friend. Turned out her douchebag ex-boyfriend broke up with her a few months ago for another chick but refused to move out. Ruby’s a nice girl, but a little naïve and I can see how she could easily be someone’s doormat. At first when she told me her story all I could think was I wasn’t looking to be her girlfriend—that I’m not someone’s shoulder to cry on. But she looked really down in the dumps. So I grabbed Beck and we paid the douchebag ex-boyfriend a visit when I knew she was working. With just a little coercion he agreed to move out.</p><p>On my morning coffee stop the next day I invited her along with me to Beck’s after work that night. I didn’t want her to be there when the dickface moved out. She agreed and she and Beck hit it off immediately. They talked nonstop while I drank my beer and tuned them out. When I was ready to head home, Beck said he’d see to it that she got home safely. He did all right. And they’ve been together ever since. Apparently now I’m a matchmaker—fuck me.</p><p>Handsome palm trees loom over the cab as I ride over to the Montage Beverly Hills. I f**king hate having to take a taxi to move around town. I hope to get a new set of wheels over the weekend. I’m actually thinking about a bike. Why not?</p><p>Rows of sycamore trees, manicured topiaries, and sculpted metal benches line the driveway. I’ll give it to them—the place has charm. The lobby is simply decorated, but carries such an air of sophistication that even I wouldn’t mind sitting down and having a drink. The elevators are nestled in the corner and I ride one to the tenth floor. The hallways are so nicely decorated that for a minute I forget I’m actually in a hotel.</p><p>The door swings open and my muscles tense—fuck, I don’t know if I can do this. But I take a deep breath and then realize my interviewee is standing in front of me. I’m surprised she doesn’t have an assistant doing her dirty work. She’s a little skinnier than she looks in the magazines. A little too skinny. The hotel robe she’s wearing hangs off her and her hair looks like she hasn’t brushed it yet today. Yeah, she’s a disheveled mess. I’d be willing to bet that blow is her drug of choice. I worked with people like her for two years. Looking closely into her eyes, I’m pretty sure she’s straight right now or I’d be gone.</p> <p>She pats her hair and then tucks a piece behind her ear. “You must be Ben Covington from the LA Times.”</p><p>“I am indeed.” I grin at her.</p><p>“I’m Sloan Bennett.” She looks down at herself and tugs at her robe to straighten it.</p><p>“I didn’t doubt that for a second. Your beauty speaks for itself.” I extend my hand to greet her. “Pleased to meet you.” I make sure the charm is on full force as I try to take this job seriously.</p><p>She rubs away some black splotches from under her eyes. “I’m so sorry I’m not dressed. In all honesty I was expecting a Dominick Dunne type, not . . .” She clears her throat. “Never mind. Come on in.”</p><p>I laugh and flash her another smile. She leads me to the suite’s main area. The room is large and spacious. Modern chairs and sofas done in monotone colors cluster around a large wooden table.</p><p>“Please sit down. Can I get you something to drink?” she asks casually.</p><p>I sink back on one of the black cushions of the sofa and open my briefcase to remove my list of questions. “No, thanks. I’m good.”</p><p>I look over the list I wrote in my small notebook.</p><p>Questions for Sloan Bennett</p><p>How did she and Tike meet</p><p>Who is designing her gown</p><p>Will the vows be traditional or hand written</p><p>Who is attending</p><p>Where will it be held</p><p>She pours herself a glass of white wine out of a crystal decanter from the bar in the corner and has a seat very close to me. She sets her glass down and reaches across me to grab a pack of cigarettes off the table. “So, Ben, how does a guy like you get a job like this?” she asks tapping on the pack.</p><p>“If I told you you’d never believe it.”</p><p>“Oh, there’s a lot I’d never believe, but that doesn’t mean it doesn’t happen or isn’t true.” She takes one of the cigarettes and lights it up, handing me the pack.</p><p>“No, thanks.”</p><p>She shrugs and tosses the pack on the table. “You’re a real goody two shoes. Don’t drink, don’t smoke, what do you do?”</p><p>“Trust me. Goody two shoes, I’m not.” I stand up. “I think I’ll have that drink.”</p><p>She nods. “Help yourself.”</p><p>The bar is loaded. I survey my choices, soda or alcohol. I opt for the amber colored decanter. I think I’m going to need it to get through this. As I pour the rich colored liquor from the fine crystal bottle, the familiar scent floods my nose.</p><p>“I can’t stand the smell of scotch,” she says.</p><p>“The scent of Band-Aids doesn’t appeal to you?” I mock.</p><p>“That’s exactly how it smells. Oh my God, you’re so right.”</p><p>“They’re both made from the same phenols. That’s why they smell the same.” I tell her.</p><p>“TMI,” she answers, the tip of her cigarette flaring as she inhales it. “I may never drink that again now.”</p><p>I laugh and sit back down. “Are you ready for this?” I ask.</p><p>She nods, blowing out a stream of smoke as she does. I press record on my recorder and set it on the table. I used the same Sony version for years until I had to “die.” I wonder for a moment if the old one is anywhere in my shit that’s stored in my mother’s attic. I make a mental note adding it to my list of things to look for. I clear my throat and start asking her the ridiculous interview questions I prepared. Although she answers each one in a rather flirty manner, the matter-of-factness tone of her actual answers makes me question her motive for marriage. Thirty minutes and one drink refill later the interview is complete. Thank f**king God.</p><p>Sloan reaches into the seat cushion and pulls out a small baggie. “Okay, Goody-two-shoes. Time to prove you’re not Dorothy.”</p><p>I shake my head but can’t help but smile. She’s holding a bag with at least a dozen joints in it. She lights one up and inhales, handing it to me before breathing it out. I look at it, and I look back at her. I figure what the f**k and grab it.</p><p>A few hits later she asks, “Can I ask you a question now?”</p><p>“Sure.”</p><p>“Do you like being blown?”</p><p>I cough, choke, and almost spit. “Come again?”</p><p>“I asked, do you like bl*w j*bs?”</p><p>“Is that a trick question?” I wave off any more of the weed she’s trying to pass me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, just answer the question.”</p><p>“Um, yeah, what guy doesn’t?”</p><p>She snorts and takes one last hit. “My fiancé, that’s who.”</p><p>My eyes meet hers. “Well, baby, shame on him.”</p> <p>And as if what I said was the cue for a scene she’s been rehearsing, she unties her robe and lazily reclines back on the arm of the couch. I watch her with amusement. What the f**k world am I in? Of all the things I expected from this crazy job, this was the last thing I envisioned happening. She pulls her knees up and spreads her legs. I can see she isn’t wearing anything underneath her robe. I haven’t gotten any in a while and the sight of her slick bare flesh makes me harden on the spot.</p><p>Raising her brows as if she’s daring me, she runs her tongue over her lip. I don’t move a muscle toward her, yet I can’t help but stare. I try not to, I really do, but skinny or not, she’s got a hot body and looking at her pu**y is an absolute turn-on. I shouldn’t even be thinking what I’m thinking. What she’s offering should never happen on the job. Plus she’s engaged for Christ sake. I know all of this—but I’m only human.</p><p>A quick fifteen minutes later, I leave her suite. She closes the door behind me and I lean against it. My stomach is in a knot again. My first interview and I let the bride-to-be blow me. Fuck me, I can’t believe I just did that. What the hell is wrong with me?</p><p>I’m mentally scolding myself when the elevator doors slide open and I lift my bowed head. Needing to look twice, I can’t believe who’s walking my way. Her h*ps sway in her tight little dress and she walks like a runway model in those high heels. My heart pounds at the mere sight of her. I prop a foot up against the door and watch her slow her pace. She fumbles around in her purse and when I clear my throat she looks up. Our eyes meet, but she quickly drops her gaze. Keeping her head down, she continues to walk in my direction. I catch her peek up a few times from under the curtain of red hair now shielding her face. I stifle a laugh. She knows I’m watching her, there’s no way she can’t. When she walks past me I consider putting a foot out to stop her, but she takes a step back and pauses right in front of me. She doesn’t look at me, but her lips straighten into a thin line. I can’t help but grin. “Can I help you?” I ask.</p><p>Her mouth falls open, but no words escape. She immediately closes it. Crossing my arms over my chest, I have to drop my head to stop from laughing at her pouty lips. She tucks a lock of that long red hair, no longer wild, but smooth and straight, behind her ear and when she looks up her emerald green eyes bore into mine. The hallway is so quiet I can hear her breathing, or maybe it’s mine. She points to the door I’m leaning against and asks, “Is that room 1516?” Her voice is mildly shaky.</p> <p>I swivel my head to look at the number, even though I already knew it was. I shove my hands in my pockets and tilt my gaze to hers. “I believe it is, S’belle Wilde.”</p><p>She bites her lip and I can’t tell if she’s flirting with me or in deep contemplation.</p><p>Her eyes narrow. “It’s Bell, actually, and you’re in my way.”</p><p>I can safely tell by her tone now that she’s not flirting. She shuffles her feet back and forth and I realize she might be nervous. But when she scrunches her nose and huffs like she’s annoyed with me, I have to laugh.</p><p>“Hmmm . . . I like S’belle myself,” I tell her, and for a second I think she might actually clock me.</p><p>She huffs again and adds an eye roll. “Whatever.”</p> <p>I have to turn my head to stifle another laugh.</p><p>“Do you mind?” she asks, placing one hand on her hip, the other pointing to the door. Does she think she’s intimidating me? Because all I can think about is how cute she looks in that pose.</p><p>She starts to turn a little red and I don’t want to piss her off so I stand up straight and move to the side.</p><p>I place my hand on my stomach and bow slightly, extending my hand, “It’s all yours, Bell.” I stress Bell to show her I paid attention.</p><p>Her face goes blank. Now what did I do? She turns away as quickly as she can and just as she’s about to knock, she pauses and looks over at me again. “What are you doing lurking outside of Sloan Bennett’s door, anyway?”</p><p>Her tone is so sassy that I can’t help but grin. “I just interviewed her for the society page. What are you doing, may I ask, lurking in the hallways of her hotel?”</p><p>Her jaw drops. “You write for the wedding column?” Then she mocks me with a laugh.</p><p>I feign offense because that’s all I can do—something in the universe isn’t right if this is now my job. I grab my heart. “You wound me with your mockery.” I want to show her that I can laugh at myself.</p> <p>She glances at her wrist as if checking the time and ignores the fact that she’s not wearing a watch. She stands even straighter. “Well, I’m Sloan’s wedding planner and I’m late.” She turns around and knocks on the door.</p><p>I don’t say anything as the door opens, and I watch her walk inside. She doesn’t give me a second glance, but I give her one. I stand there and breathe in the scent of lemon left in the air. Then once the door is closed, I walk toward the elevator and remember that smell from another time.</p><p>I smelled her sweet scent the first time she approached me in the library, although I wasn’t sure what it was. The next time we ran into each other I knew for sure she smelled of lemon. Yellow, juicy, ripe lemons like I’d pick from the trees in my mother’s yard so she could make fresh lemonade. Her scent drove me crazy. It created urges in me no other girl should have been able to provoke. Seeing her made me feel like the devil was really trying to f**k with me. Especially when it seemed everywhere I went she was there—the library, the campus coffee shop, and even my own frat house. I did enjoy talking to her but knew our conversations would never be contained to a strictly friends level. I did my best to minimize our contact. I knew she wanted more than I could give—it was in her tone every time we spoke and the way she flirted with me. I had a girl that I loved so I walked away every time . . . until the night came I no longer could.</p><p>At the sight of the elevator doors opening to let me enter, I let go of the memory of how she used to watch me, like she knew me, like she got me. And instead I think about how her sexy little walk caught my attention—I liked it. And I still do.</p><p>Chapter 7</p><p>If I Never See Your Face Again</p><p>Long hair drapes over me, tickling my chin, my chest, my legs as she moves down my body—silky red locks that I could twist my fingers around. Soft flawless flesh, warm to the touch, that smells so delicious I wanted to taste her. Bright green eyes, like emeralds, peek up at me from under thick, long lashes—eyes I could get lost in. Lush full lips sear my skin with each kiss, so wet, so full, and always eager—a mouth that commands, demands.</p><p>Fuck. I wake up in a cold sweat. I’ve been dreaming of her, of our one night together in college, ever since I saw her in the hotel. It was a night full of passion, of my darkest desires being met, but I was in love with Dahl. I never should have slept with someone else while I was in a relationship. So why did I let her tempt me? Why had I given in to her? The simple truth was I wanted her beyond my willpower to fight that urge. For years I had tried to expunge that memory because I was committed to Dahl. But it was a night I could never completely erase from my mind and now it’s back.</p><p>The first half of rush night my senior year will always be a blur but the last part I’ll never be able to forget.</p><p>It was a wild party with kegs lining the room and bowls of food overflowing on every available surface. Easy girls made their way around talking to new pledges. Rush night—for a brother it was unlike any other night of the year.</p><p>“Pledging f**king sucks,” one new recruit had the nerve to say out loud as I passed by.</p><p>I turned on my heels. “Oh yeah. Why?”</p><p>“Dick sucking,” he said matter-of-factly, obviously not having any clue who I was.</p><p>I almost spit my beer out. “Dick sucking?”</p><p>“Well, not literally.”</p><p>I held my empty cup out for him but he didn’t catch on.</p><p>Someone grabbed it except it wasn’t the cocksucker I wanted to refill it.</p><p>“I’ve been assigned as your little sister,” the cute voice said gleefully.</p><p>My eyes went right to her chest. She was wearing a see-through top that drew my attention. But I quickly reverted my attention to the poor sap who should have walked away the minute he opened his trap. He stood there opened-mouthed, now ready to fulfill his role.</p><p>She disappeared and we both watched her ass in that tight skirt. I turned to him and clapped my hand on his shoulder. “I think it’s time for you to head out.”</p><p>He swallowed before trying to respond.</p><p>I moved my hands toward my pants and made as if I was unzipping them. “Unless you’d like to,” I dipped my chin.</p><p>He shook his head looking like he might vomit.</p><p>I laughed hysterically. “Hit it and come back when you have your sexual orientation under control.”</p><p>When I turned she was staring at me. “What?”</p><p>“That’s not really a part of hazing is it?”</p><p>“Fuck, no. I was just busting his balls.” I grabbed my beer. “Thank you. . . .”</p><p>“S’belle,” she finished for me.</p><p>“I know your name,” I said and then I excused myself to talk to some other potential pledges.</p><p>She refilled my beer so many times I lost count and before I knew it the night was over and I was sending the new boys out on a scavenger hunt to find a pair of pink lace panties. The house was unusually empty. It was just her and me and a few others. By that point I was so wasted I could barely see straight. I had propped myself against the wall, leaning forward with my legs crossed at the ankles to keep my balance. I’d just called Dahl and told her not to come over, that I was headed to my room to pass out. As soon as I slid my cell in my pocket she was standing in front of me taking my cup.</p><p>“I’m good.” I put my hand out.</p><p>She batted her eyelashes and I had to laugh. I knew the other girls must have given her tips on how to behave. I found it f**king ridiculous when girls started molding themselves to what you wanted them to be, but the other guys loved it.</p><p>With slightly slurred words she asked me, “Did you have fun tonight?”</p><p>“What’s not fun about naïve college freshmen?” My words were even more slurred than hers. I laughed. “What about you?”</p><p>“I’ve had more.”</p><p>I raised a brow. “Oh, yeah? Do tell.”</p><p>“I spent my freshman year in France and the nude beaches were always full of fun.”</p><p>My eyes may have been unfocused, but I straightened my stance as my c**k swelled. Her voice was sultry, her words seductive, and her body language deliberate. My mouth quirked and I found myself responding without thinking. “When you went to the beach did you do the American thing and wear your bathing suit?”</p><p>She leaned in closer and her breath rushed over my skin. “No, I didn’t even bring one to France.”</p><p>I’m sure my eyes widened and I tried to compose myself, pressing my back against the wall to stop myself from f**king her right there in the living room, although I was pretty sure that was what she wanted. My pulse was throbbing at the base of my neck and my heart was pounding. She glanced down at my jeans and I know she saw the bulge there. When she bit her lip I averted my gaze. Fuck was she hot. Her show went on as she graphically painted me a mental picture of life on the Riviera. I tried to avoid staring at her. But when she smiled, I couldn’t help but smile back and the urge to take her right there was stronger than ever. I knew I had to get out of there. So before she could finish, I abruptly interrupted. “Excuse me, I forgot I have something I have to do.” I turned and walked away without even glancing back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I needed some air so I headed outside. I grabbed a sweatshirt but stopped in one of the downstairs suites on my way outside to throw some water on my face. I heard a knock then the door opening before I could say anything. She walked in, quickly closing the door behind her and locking it. She didn’t give me a chance to say a word before she pulled her skirt down and stood before me in her black lace panties.</p><p>I watched with reckless abandon as she unbuttoned her shirt and glided her palms down her stomach. My pulse skyrocketed when she slipped her fingers inside the waistband of her underwear.</p><p>“They aren’t pink, but will they do?” Her sultry voice was so provocative there was no denying her intentions.</p><p>I couldn’t move away from her. Instead my eyes locked on hers where we stood in the bathroom of the empty fraternity suite. She took her shirt off while I watched. When she removed her bra and twirled around slowly something inside me snapped. I couldn’t hold back. I just wanted to devour her.</p> <p>And when she said, “This is how I looked on the French Riviera,” baring her chest to me, I strode across the room and grabbed the back of her neck, pulling her mouth to mine. I kissed her with a need I couldn’t control—at that moment I let everything I knew in my life go.</p><p>“Take them off,” I ordered.</p><p>I propped myself up against the counter again to watch her.</p><p>Naked before me, she looked f**king edible. I wanted to have her in every way I could and I was pretty sure she wanted the same. The drunkenness seemed to slip away as passion overtook us.</p><p>“Come over here,” I told her.</p> <p>When she came closer I scooped her up and set her on the counter. I was going there and there was no going back.</p><p>I betrayed someone I loved. That night I became someone else—someone who couldn’t get enough. It was a feeling I can’t explain. I didn’t understand it then and I still don’t. But what I’ve come to realize is she was the most provocative girl I’ve ever known. Giving in to temptation, I allowed weakness to conquer strength, desire to win out over love.</p><p>I roll over and force myself to think of anything else until I finally drift off.</p><p>My alarm buzzes and startles me awake. Bleary with sleep, I try to figure out why I set it on the weekend. Oh right. I get the honor of attending a wedding tonight. But first up, some new wheels. Money in the bank and a new ride, that’s enough to get me going and put a smile on my face today.</p><p>When I stop by the coffee shop for my morning Joe, Ruby’s there sitting at a table with her head hung low.</p><p>“Hey, where’s the smile you always wear?” I ask placing my hand on her shoulder.</p> <p>She looks up and wipes tears from her eyes with her thumbs. “Oh, sorry. Bad night, that’s all.”</p><p>Now, I could be the ass**le I know I am and ignore the fact that she’s crying. I could also ignore the comment because like I said, I’m not looking to be her girlfriend. But I woke up in a decent mood and I didn’t even have a hangover, so rather than bolt, I decide to sit down. “Want to talk about it?”</p><p>“Not really,” she answers, pulling her lips upward and taking a deep breath.</p><p>Thank f**k because I wasn’t looking to be her shoulder to cry on. But I do study her for a moment. I take a sip of my coffee, then look out the window for a few minutes. “Hey, see that over there?” I’m pointing to a motorcycle stopped at the light.</p><p>She nods and sits up straighter, the corners of her lips turning up even further. “Yeah, a dad whose son was screaming all morning because there was no Captain Crunch left for breakfast.” She giggles.</p><p>I notice the grocery bag on the back. “You’ve got this nailed. But today I’m not detailing, I’m buying, and I’m shopping for one of those.”</p><p>“Really?” She sounds surprised.</p><p>“Really.”</p> <p>“Stop by later and show me?”</p><p>I nod. “Hey, you sure everything is okay?”</p><p>She smiles. “Go buy yourself a new ride. We’ll talk later.”</p><p>I make a mental note to stop by Beck’s tomorrow and ask what’s going on before I head for the door.</p><p>By sunset I’m jamming my boot down on the kickstand of my new black and silver BMW K 1300S. Sweetest ride I’ve ever bought. Its dynamic performance sold me within the first few feet of the tires hitting the pavement—she can move. As twilight teases the horizon, I toss my leg over the side and step back to admire the beauty of the incredible machine that’s now mine—on credit, but I own it nonetheless. When I glance up, I see someone’s red hair blowing in the wind. There’s no mistaking her—S’belle. I stay frozen in place and observe her standing on the sidewalk. She pulls her phone away from her ear and kicks the flat tire of her car with her high heel.</p><p>Next she goes to the passenger door and bends down, peeking into the window of the white Cabriolet. She looks like she could use some assistance.</p><p>With my helmet in my hand I approach her. “Need some help?”</p><p>Her eyes dart to mine and her mouth forms a frown. “No, I’m good.”</p><p>“Really? Because it doesn’t look that way.”</p><p>Her phone rings and her eyes cut to the pocket she tucked it into and so do mine. I can’t help but notice the way her tight jeans hug her h*ps and thighs. She doesn’t even pull it out.</p><p>I raise a brow. “Not going to answer that? What if that’s your automotive assistance?”</p><p>“It’s my boss. I’m supposed to be at the wedding venue in thirty minutes.”</p><p>“So did you call Triple A?”</p><p>“No, I don’t have Triple A,” she hisses. “I’ve always called my brothers but neither is in town and my mother and stepfather are gone as well.”</p><p>I tap her trunk. “So pop this baby and I’ll change the tire for you.”</p><p>“I’m not completely helpless. I would have done that already but I locked my keys in the car. I’ve spent the last thirty minutes trying to figure out where I left them and there they are.” She points in the window.</p><p>I peer inside. The keys are dangling from the ignition. “Can’t help you there. Left my lock-pick kit at home.” She rolls her eyes. “Do you have a second set of keys?”</p><p>“Not on me,” she barks, and I try not to laugh. I could be offended that she seems to hate me so much but, honestly, something about her fiery attitude makes me yearn to see more of it. I try to control my grin by swiping my hand across my mouth. “I mean at home.”</p><p>Her brows scrunch together. “Of course I do, but that doesn’t help me now, does it?”</p><p>What I’m feeling is an overwhelming urge to spank her for being such a smart-ass but instead I hand her my helmet. “Here put this on.”</p><p>Her hands fly to her h*ps and she bites her bottom lip as if contemplating her fate. When her phone rings again, she glances at her wrist but she’s not wearing a watch. “Just get on,” I order. “I don’t bite. I’ll just run you to get your keys and bring you back here.”</p><p>“Didn’t you hear me? I’m supposed to be at work in thirty minutes. I don’t have time for that.”</p><p>I should have just walked away and left her and her bitchy attitude on the sidewalk. Somehow I couldn’t bring myself to do it. “I’ll run you home to grab a change a clothes and then drop you off at work.”</p><p>She steps forward and my vision blurs red from her closeness.</p><p>“Well . . . ,” she says.</p><p>I blink at her in confusion.</p><p>“The helmet. Are you going to hand it to me?”</p><p>Relief rises as I stretch out my hand and grin. “Here you go,” I say, bowing before her. “Where to?” What the hell is wrong with me?</p><p>“Sunset Place. Do you know where it is?”</p><p>Before I answer, she turns on her heels to head over to my bike. I watch her approach it with caution. She surveys it for a minute and then puts on the helmet. It’s a little big but she looks cute as f**k. Without fastening the strap she tries to clamber on the bike.</p><p>“Whoa, wait let me help you.” I rush to her side.</p><p>She plants both feet on the ground. “I can do it.”</p><p>Over her protests, I grasp the edge of the helmet’s open face and readjust it directly over her forehead. Then I tighten the strap. Already my heart is pounding from our close contact. So I walk around to the left side of the bike and a quirk a finger. “Come over here.”</p><p>With a scowl she does. “I can get on myself.”</p><p>“I’m sure you can but humor me.”</p><p>Again, an eye roll.</p><p>I shake my head in her direction. “Extend your right leg over the seat and then slide gently up onto it.”</p><p>She does with a slight huff.</p><p>“Put your feet on the pegs.” I point down.</p><p>“I’m not a child. I can figure it out.”</p><p>I try not to laugh because she is acting like a child. But surprisingly she does as she’s told.</p><p>“Good.” I’m trying to encourage her.</p><p>She gives me a closed mouth smile; I ignore her obnoxious gesture. “Have you ever ridden on one of these?”</p><p>“No. But how hard could it be?”</p><p>“For you, not very. It’s all a question of balance. Just stay upright and hold on.”</p><p>“Where’s your helmet?” she asks as I hop on.</p><p>“I gave it to you,” I say over my shoulder.</p><p>“You don’t have two?”</p><p>“I just bought the bike a few hours ago. I didn’t think I’d have a passenger so soon.” At that she says nothing. I can’t see her expression to tell whether she’s making a face. I put both my feet on the ground and turn my head. “Ready?”</p><p>“Are you sure you know how to drive this?” she asks nervously.</p><p>“I had one in New York. And besides, I’ve been riding dirt bikes and surfing my whole life. This is a piece of cake.”</p><p>But she stiffens when I climb onto the seat. “Hold on to me,” I tell her, as I click the kickstand up. For once she’s quiet. She says nothing as her arms wrap loosely around my chest. I grin as I jam my boot down on the throttle. “Tighter. You have to hold tighter than that.”</p><p>She clasps her hands together and I lower them. When I do, I feel her shoulders against my back. It’s something I’ve experienced with her before and this time I’m the quiet one as I ride off the few miles to West Hollywood. She moves closer as I zoom out onto the street and with her so close to me, I can’t push away the memories.</p><p>I had her n*ked before me sitting on the bathroom counter and I had to have her. She pulled my head to hers for a deep kiss. I circled my tongue just to taste more of her. Her lips were soft and tasted like mint. As my hands slid down her chest, her full br**sts were too much to resist so I bent down and sucked on them. She still had her heels on and she ran the toe of her shoe up my thigh.</p><p>“Take those off,” I instructed.</p><p>She kicked them to the ground, pressed herself back against the counter and spread her legs apart before running her bare foot back up the same path on my leg. This time her painted blue toes curled around my hard c**k and I stifled a groan. When her hands went to the same spot, she etched my erection with her fingernails. I leaned back and toed off my sneakers then shoved my jeans and boxers down in one swift movement before removing my shirt. Then I lowered my head. “You sure you want to do this?” I asked her as we both stood n*ked in the bathroom.</p><p>She nodded and reached her hand back down to my cock.</p><p>“Say it.” I wanted to make sure she wanted this as much as me.</p><p>“I want you to f**k me,” she breathed.</p><p>“Good, because that’s just what I’m going to do. I promise.”</p><p>She hopped off the counter and before I could ask where she thought she was going she dropped to her knees. As her hands explored what I had to offer, I gripped the counter. But when her mouth plunged around me I yelled, “Fuck!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I heard myself groan loudly as her teeth grazed under my cockhead and her hand grabbed the base. When my throbbing dick hit the back of her throat, I forgot all about where we were and even who we were and just took what she was giving. “Oh yeah, like that, just like that,” I said to her and dropped my head back.</p><p>Most guys start getting blowjobs young, but Dahl and I had been together forever and she never liked to give them. So unless she was really drunk or I begged for it, it wasn’t part of our sex life. And the few times she had attempted it, she never took it very far.</p><p>I looked down. S’belle licked every inch of me, sliding her tongue up and down my length before taking me down her throat again. She worked her mouth, up and down, back and forth. She f**ked me so hard with that mouth, I couldn’t help but yell out, “Fuck, yes! Yeah, that’s it!” Fuck me, nothing could feel better than the way she slid my c**k from one side of her mouth to the other, then down to the back of her throat. “Oh yeah, baby, that’s it, that’s it.” When I was close, I put my hands on the back of her head and guided her. She didn’t pull away—and there was nothing I wanted more than to come in her mouth. “Oh f**k!” The last strokes of her tongue made me explode. I filled her mouth and as she swallowed she still didn’t stop. I f**king loved it—the feeling that shot through my body was like anything I’d ever felt. I kept the pressure on her head for a few more seconds before letting go of everything as satisfaction rippled through me.</p><p>When I let up, she sat back on her heels and I could see the evidence of my pleasure glistening on her lips. I was panting, spent, and so f**ked up, but all I knew was I wanted more.</p> <p>During the ride she squeezes my waist tight when I whip around a corner. Her address turns out to be a nicely kept Spanish style apartment complex. She moves quickly to dismount as soon as I’ve turned off the engine but I reach my hand back. “From the left side, always from the left,” I say. She does as I ask and once her heels touch the sidewalk she whips her helmet from her head and her long red hair tumbles down her shoulders. Her cheeks are red from the cool air, but the smile on her face says what I know she clearly won’t—that she enjoyed herself.</p><p>“I’ll be right back,” she says and hands me the helmet.</p><p>I admire her ass as she enters the iron gate and disappears in the courtyard. Sitting alone, I allow myself to get lost in the memory of our night together.</p><p>“Are you okay?” she asks, having returned with a bag in hand.</p><p>I look up into those emerald green eyes. “Never better. Now hop on so I can get you to work on time.”</p> <p>This time she grips my waist without hesitation—and as I steer out onto the road I feel a sense of happiness I haven’t felt in a long time.</p><p>When I pull over she hops off and hands me the helmet. “Thanks for the ride.”</p><p>She looks at her wrist again and I have to ask. “Why do you keep doing that?”</p><p>“What?” she asks.</p><p>“Looking at your arm.”</p><p>“Oh, I smashed my watch on a serving tray last week and can’t get used to not having it there.” She shrugs. “Habit, I guess.”</p> <p>I nod in understanding.</p><p>“See you around.” She waves and heads toward the sliding doors.</p><p>“Bye, S’belle. See you around.” The whole situation is amusing to me because she obviously doesn’t know I’ll be attending the affair as well.</p><p>She turns and walks backward to continue the conversation. “My name is Bell.”</p><p>I grin and say nothing, thinking, “Sure thing, Red.”</p><p>Shaking her head, she turns her back to me. I glance at my watch. I have an hour to get back here so I pull into the street and race to my fleabag hotel to get changed for work. In the shower I turn the water on full blast. Steam from the hot water fogs the mirror by the time I’m done. I wipe it a few times and push my hair back with both hands. Alone in the bathroom, staring at myself, I see a reflection from a different time.</p><p>The curves of her beautiful br**sts, a face full of promises, wild hair, me slamming into her from behind as she leaned over the counter and I looked in the mirror. Moans of passion that I wasn’t sure were hers or mine. My body shaking . . . hers quivering. I had been drunk, sure, but I felt completely sober when my hands roamed her body. Her pu**y was so sweet I couldn’t get enough. Without any inhibitions, I told her all of my deepest sexual desires. She only smiled in response as I stood and brought her mouth to mine. I felt my dick throb.</p><p>With my body pressed up against hers, heat was everywhere, surrounding us. She pulled back and looked at me with clear eyes. “You’re not from LA, are you?” she asked.</p> <p>“What makes you say that?”</p><p>“You just seem different.”</p><p>“Born and raised in Laguna.”</p><p>“On the beach. Was it fun?”</p><p>I ran my hands through my hair and quirked a smile. It wasn’t the time for conversation. My arms caged her body and my throbbing c**k rubbed against her thigh.</p><p>Her eyes roved up and down my body and she licked her lips before dropping her gaze. “I think I really like surfers.”</p><p>“Oh yeah, what makes you say that?”</p><p>She pushed the hair from my eyes before dropping her stare again. “Tan, sun-bleached hair, hot, and sexy.”</p><p>I moved closer and whispered in her ear. “This hot and sexy guy is done talking now. I want to f**k you.”</p><p>She traced her tongue along my lips and moaned. Breathing heavily she purred, “Please.”</p><p>I urged her closer. She was so wet I slid inside her with unabashed ease. She closed her eyes, but I had a strange need to see her while I f**ked her. I lifted her chin. “Look at me.”</p><p>We stared into the depths of each other’s eyes as I slowly moved in and back out so I could feel the thrill again. Each time I thrust in only felt better than the last. I could see in her eyes how much she was enjoying it and I was f**king loving it, too. Each plunge brought me closer to the brink. I tried to control myself but she was doing crazy things to me. When I could see she was close I said, “Come with me.”</p><p>She dug her nails into my back and wrapped her legs tighter around my waist. The sensation of filling her so deeply was unreal. She called out my name over and over and through gritted teeth I did the same. Once my orgasm subsided, I looked at myself in the mirror and was struck by a huge wave of guilt. Despite it, I closed my lids and felt my c**k swell. It wasn’t anywhere near done and neither was I.</p><p>“Hey, surfer boy.” She pulled my attention back toward her. “Can we do that again?”</p><p>“I plan to.” I pulled away and circled her like she was my prey. “Put your heels back on and show me again how you walked on the beach in the Riviera.”</p><p>Not sure what came over me, I wanted her do as I ordered—it made my heart beat faster and adrenaline flooded me. When she moved passed me, I pulled her flush to my chest. I traced my fingers along the silky fabric covering her cl*t and sucked on one of her ni**les. Her moans of pleasure made my dick ache but also made me feel like I was going to be able to do this all night long. I turned her around. “Watch us,” I told her, as I spread her legs and plunged into her from behind as we both looked on in the mirror.</p><p>Neither of us came but we weren’t done with each other when I stopped. Without a word, I picked her up and moved her to the bedroom. We fell to the mattress where I hovered above her and sucked her tits hard. I inserted two fingers inside her. I moved them in and out, faster and faster. She moaned. Next I used my tongue to plunge in and out of her pu**y. She cried out in pleasure. I f**ked her every way I could with a stamina I never knew I had. We f**ked in ways I never had before. She squeezed her br**sts together and I slipped my c**k in between them. I thrust in and out over and over. It felt f**king amazing. I yelled and grunted and groaned and when I finally came, I came hard. My whole body trembled.</p><p>The last thing I remembered before passing out was grabbing her h*ps and moving her as she rode me. I had one hand on her pu**y while the other hand cupped her full breast. She was screaming my name like a prayer as I massaged her cl*t and tugged her hard ni**les in unison.</p><p>When she started yelling, “That’s it, surfer boy, that’s it! Oh God, oh God, that feels so good!” I came deep and hard inside her.</p><p>When I woke up she was gone and my shirt blanketed my nakedness. The devil in me mourned her absence. But the larger part of me was relieved. The forbidden fruit was already bitten and I knew I needed to stay far away. One night with her had fulfilled every fantasy I ever had but I couldn’t risk my future on a fantasy.</p><p>Chapter 8</p><p>Counting Stars</p><p>The wedding festivities are in full swing when I arrive at the Montage a little late. I missed the announcements—too bad for me. I duck into the bathroom and loop my tie around my neck, thinking I don’t look all that bad—new tan suit, blue shirt. Except I wince at the sight of the tie in the reflection. Fuck the tie. I toss it in the trash and head to the bar to grab a quick drink before I go in search of the happy couple.</p><p>Once I throw back a quick one, I enter the grand ballroom and scope out the subtle signs of wealth and luxury. There are no tapestries, no grand, ornate, golden gilded mirrors, or fringed pieces of furniture that scream money. Instead S’belle did a great job of giving the couple what they wanted. Looking around I definitely feel like I’m in Nantucket—which was their wish. The elegant simplicity inherent in the wooden floors beneath the simple glass-cut chandelier at the center of the room only helps bring the blues and whites to life. Circular tables with toile tablecloths surround the dance floor with hydrangeas filling their centers in clear glass vases. Small candles are floating in water to illuminate the elegance of the fine table settings. And wicker chargers set the place setting for every guest. It’s very Ralph Lauren. Very Nantucket.</p><p>I spot the bride and groom immediately. Sloan lifts one hand in a vague gesture of hello. As I approach, her gaze meets mine and I try to ignore the familiarity in her greeting.</p><p>“Miss Bennett, how nice to see you again.” I take her hand and kiss it.</p><p>She manages to play along and seems just fine with me having paved the way to a drama-free night. “Mr. Covington, I am so glad you could make it. This is my fiancé, well, my husband now, Tike Rodale.”</p><p>I extend my hand and we exchange greetings. After a five-minute conversation with the groom I can see what the problem is—he’s definitely not into women. In fact, I’m pretty sure he wanted to make a pass at me. I retreat at the earliest opportunity and grab a glass of champagne from a waitress walking by. But Tike makes sure the circle containing the three of us stays tight. I continue to ask the questions I need answers to in order to write the column but he’s dragging out his answers and Sloan looks bored as shit.</p><p>Just as he finishes telling me how he proposed to his lucky lady, I hear the sound of throat clearing from behind me. I don’t even have to twist my head or look over my shoulder to know who it is. In an authoritative tone, she says, “Sloan, Tike, the photographer wants some photos of the two of you near the champagne fountain, if you don’t mind.” Tike pats me on the back before excusing himself. As if he forgot his bride, he doubles back to take Sloan’s hand in order to escort her to yet another picture perfect moment to memorialize the day.</p><p>S’belle’s eyes cut to mine and they seem a little softer than they did earlier today, and so does she. She’s changed and looks f**king amazing. Her low-cut green blouse highlights her eyes. Her short black skirt and matching jacket look professional, but sexy as hell. She’s holding a clipboard in one hand with a pencil tucked behind her ear and I have visions of her standing in front of me n*ked with those props. I quickly try to push them aside.</p><p>I can’t help but smirk at the spitfire standing in front of me. “Well, hello again.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her eyes widen in surprise. “Why didn’t you tell me you were coming here tonight when we were together earlier?”</p><p>“You never gave me the chance.”</p><p>She blows a piece of hair out of her eyes. “I’m really busy right now. I have a million things to do. I appreciate what you did for me but I have to get back to work.”</p><p>I take a step closer. “I promise to stay out of your way if you promise to catch up with me later.”</p> <p>A small sound escapes her throat and I try to determine if it’s exasperation or attraction. When her breathing hitches I opt for the latter and try to keep my own attraction at bay.</p><p>“Is there anything I can do to help you?” I ask, pushing the loose tendril of hair from her face.</p><p>Her eyes close when my skin makes contact with hers.</p><p>“You seem flustered.” I breathe against her neck, as my fingers trace a path from her ear to her jaw. I’m hoping in some way she’ll give me the green light to carry on with our flirtation.</p><p>“No,” she says, stepping back, clearly affected by our closeness.</p> <p>When I stifle my chuckle with one hand in front of my mouth, she drops her eyes then turns away and sashays off, her hair bouncing as she goes. I swear if I didn’t know any better I might think she wants me just as much as I want her. My eyes devour the sight of her red waves against her back and her bare skin below her skirt hem to her high heels clicking against the glossy tile floor. When they land on the ground, another thought comes to mind: Her wearing just those heels and prancing in front of me while we are alone.</p><p>I try to shake it off and grab another glass of champagne for distraction, but I still can’t stop following her every move. She’s talking to some brute of a guy in a gray pinstriped suit. He pulls the pencil from her ear and I notice his thumb graze her cheek as he does. She pulls away. He points to her clipboard with the eraser and seems annoyed as he taps it. Every time she steps back, he takes a step forward. If I thought the faces she made at me were disgust, the expression she offers him is one of repulsion. I keep my eye on them, just to make sure whoever that ass**le is stays in check.</p><p>“Ben, there you are.” It’s Tike with a hand on my shoulder, gripping a little too tight.</p><p>I turn around to face him. “Just the man I needed to see. We need to finish this up so I can leave you and your beautiful wife alone.”</p><p>He waves a hand. “Oh, no need to rush. We have time to talk. Come with me, let’s grab a drink.”</p><p>As we walk to the bar I have a f**ked-up thought—what if he wants . . . Fuck, if the word “ménage” leaves his lips, I’m so f**king gone. We spend fifteen minutes talking about bullshit and the whole time I’m waiting for him to say something out of line, but thank you, Jesus, he doesn’t.</p> <p>“Tike, Sloan is waiting for you in the hall. It’s time to officially introduce you as husband and wife. I’d like you both to enter the room together.” We turn in unison to the sweet voice commanding our attention, then I notice that while I’m looking at her he looks at me.</p><p>“Of course, darling,” he responds to her or maybe to me. I don’t know because all he does is wink and walk off.</p><p>My eyes slide to S’belle. “Can I buy you a drink?”</p><p>She looks around the crowded bar area and then at the empty bar stool. She slides into it and looks at me quizzically, scrunching her nose. “Why would you ask me that? It’s an open bar.”</p><p>Fuck, she’s adorable. She really is. “Let me rephrase. Would you like to have a drink with me?”</p><p>She bites her lips. “First, I don’t drink while I’m working and neither should you.”</p><p>“Right, Red, I’ll keep that in mind. And second?”</p><p>Her lips form a sexy pout again that I can’t resist. They’re so pink and full and my mind keeps wandering to. . . . “You said first, and that’s usually followed by a second.” I hold up my glass and drink the entire thing down. “There, now I won’t be drinking on the job.”</p> <p>Her mouth forms a straight line that I think will be turning upside down at any second but she surprises me when instead she smiles at me. I think I might be in—she’s warming up to me, I can tell.</p><p>“Bell,” a stern voice calls from behind me.</p><p>In a huff she says, “I have to go.”</p><p>I turn to see the pinstriped ass**le glaring at her as she hops off the stool. The hint of citrus she leaves in her wake tickles my nose as she spins around and walks away. I breathe it in before pulling out my notebook. Time to finish the checklist. Two things left.</p><p>Information needed to write the Rodale Wedding Piece</p><p>How did Tike propose to Sloan</p><p>Where are they going on their honeymoon</p><p>Details of the ceremony</p><p>Comments from the parents</p><p>Wedding venue details</p><p>I push through the crowd of people waiting to congratulate the new husband and wife and search for the second to last item on my list—comments from the parents of both the bride and groom. They’re easy to spot as they’re sitting together at a table in the center of the room. When I approach, cautiously, not sure how receptive they’ll be to being interviewed, they exuberantly plead with me to join them. They offer me a drink, not that I need any more right now, and eagerly discuss the marriage of their children.</p><p>While jotting down their thoughts and memories, I allow them to blab on and take the opportunity to glance over at S’belle. Again the guy in the suit is standing a little too close and when she shakes her head at him, he reaches around and pats her ass. She steps back but he corners her and puts his hands on her hips. I start to stand, ready to intervene, but they part ways before I can break away. Once my interview is complete, I politely excuse myself. All I have left is to find out the vendor details and then I’m out of there. In order to complete my checklist, I need the wedding coordinator to give me that information. I contemplate skipping out without it, but regardless of how much this work sucks, I would never half-ass a job. So I go in search of the spitfire, but she’s nowhere to be found.</p><p>The lights dim and the dance floor fills with people. The strains of a popular love song play as the couple takes their spot front and center. Maybe it’s too much booze, maybe it’s the thought of this make-believe marriage passing for something real, but I suddenly need some air.</p><p>On the terrace there’s an abundance of small tables with branches as centerpieces stretching as far as I can see, and a dessert bar that goes on for miles. I watch as people line up to fill their plates and then nibble on the small petite fours and mini cake slices on their plate, most of which will just get thrown away—too many calories.</p><p>I’m struggling to suck in a breath and push through all this shit. I turn a corner and head into the courtyard area that’s filled with trees and pathways in the shape of mazes. I take the first turn into the foliage. Glowing path lights guide my way and lead me to a wooden gazebo where I halt. There she sits, alone in the dark. The soft lighting from the ground gleams off her hair—she’s gorgeous. She’s still a hundred yards away, but my heart is already thumping out of my chest.</p><p>I decide to approach her cautiously, not sure if she’s not going to be happy to see me. Her head is bowed but she straightens up when I approach, peering at me cautiously.</p><p>I can see her sad green eyes. “Hey, are you okay?”</p><p>She clears her throat and brushes her long hair back over one shoulder. The same memory I’ve revisited a thousand times resurfaces. I can’t push it away . . .</p><p>I’m behind her and she swipes her hair to one side, tilting her head so I can kiss her neck. Burying my nose in the curve of her neck, I breathe her in, drawing my tongue down her skin—the smell of citrus and the taste of lemon was so enticing.</p><p>I shake it off the best I can as she answers. “Yes, I just needed some air.”</p><p>“Mind if I sit? I promise not to get in your way.”</p><p>She nods and actually lets out a small laugh.</p><p>My main focus as I sit beside her is getting my freaking breathing to steady itself. I try to facilitate the process by leaning down, putting my elbows on my knees. She watches me, her breathing erratic as well, but from her tears, I’m sure.</p><p>“Do you need a ride to get your car?”</p><p>“No, I’ll figure it out tomorrow,” she answers quietly.</p><p>“Did you bring your spare set of keys?”</p><p>“Yes, but I don’t feel like dealing with the flat tonight.”</p><p>After a moment, my eyes cut to hers. “Who’s the ass**le that’s had his hands all over you tonight?”</p><p>Her jaw drops before she manages to pull herself straight up again, her perky tits following as her shoulders move back. “I don’t know what you’re talking about.”</p><p>I tilt my head closer to her. “The guy in the suit you were showing the clipboard to.”</p><p>She huffs. “He’s my boss—and his hands weren’t all over me.”</p><p>“Yeah, they were. Did he upset you?”</p><p>She sets those full lips into a straight line. “It’s really none of your business.”</p><p>I think I struck a nerve. But I need to know if the ass**le is overstepping his bounds. I push on. “Is he bothering you?”</p><p>“Ben, it’s nothing I want to talk about with you.”</p><p>“Look, if you need someone to help you out, I can.”</p><p>“I don’t. He’s my boss and I can handle him.”</p><p>I sit up and press my palms against the bench. “Okay, but if you change your mind, let me know.”</p><p>“I doubt that; we shouldn’t even be talking.”</p><p>“Why is that, Bell?” I intentionally show her I was listening to her earlier, even though I prefer calling her S’belle or Red.</p><p>She wraps her arms around herself. “Come on, you know why.”</p><p>I take my jacket off, handing it to her. “Here, put this on.”</p><p>Her eyes stay glued to mine and when she doesn’t take it, I drape it around her shoulders. “Listen, what I know is that you and I had a thing a long time ago and, yeah, I acted like an ass**le afterward, but that’s not who I am and I think you . . .”</p><p>She cuts me off. “That’s not what I meant.”</p><p>“What is it then?”</p><p>“Do I have to spell it out for you?”</p><p>“Yes, I guess you do. I’m really not dense, but I’m not catching your drift at all.”</p><p>She clutches my jacket and pulls it all the way around her. “Your ex-fiancé married my brother.”</p><p>“Yes, she did . . . but that doesn’t mean we can’t talk. They shouldn’t impact the two of us talking, especially when we’re thrown together in a work-related social situation.”</p><p>Her beautiful green eyes seem to soften. “I’m not mad about that, Ben. I went after you. I shouldn’t have done that. I’m not proud of who I was then, but that’s not who I am anymore.”</p><p>She lets her head drop until I lift her chin to study her face. “Hey, I’m not sure if I should say this. I really don’t know what’s considered right or wrong in this situation, but that night we shared—it’s one I’ve never forgotten.”</p><p>She places her hand over mine and at the gentle touch something surges through my body. I watch as she bites her lip and after a few seconds, she curls her fingers around mine. There are tears in her eyes and I’m not sure if they’re from earlier or fresh. She removes her hand and pulls her chin back as soon as the drops start to fall but the connection between us that threw me lingers on.</p><p>“About that night, I shouldn’t have done what I did,” she says in a shaky voice.</p><p>“Shhh.” I whisper to her and place my finger over her lips. “We don’t have to talk about the past.”</p><p>She shakes her head and more tears fall. “No, I want to,” she says, and I long to comfort her. I thought we were going to talk about her boss, but I guess she wants to talk about that night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There you are. I’ve been looking all over for you.” Sloan appears before us, slurring her words. She’s swaying as she moves through the darkness but stops to stand in front of us. I can tell in an instant by the redness under her nose that her wedding day wasn’t a day to forgo the coc**ne habit.</p><p>Bell, thinking the comment was directed at her, responds. “Oh, sorry, Sloan, did you need something?”</p><p>Sloan smiles at her. “As a matter of fact I do,” she mumbles.</p><p>She sits in between us and places her hand on my thigh. Then she leans over and announces loudly, “I want you to come up to my room so we can have some fun again.”</p> <p>I glance over at Bell whose eyebrows have scrunched together as her eyes follow Sloan’s fingers all the way down to the crotch of my pants. She throws my jacket in my lap then glares at me. “Are you kidding me?”</p><p>“Hey,” I call after her as she walks away, stomping her heels. “Hey, S’belle, wait!” I walk behind her grabbing her elbow.</p><p>I can hear Sloan behind us. “What the hell is going on?” She’s yelling, but I ignore her.</p><p>S’belle whirls around. “You slept with her, didn’t you?”</p><p>I can’t find any words to defend myself. I didn’t sleep with her, but we did do other things.</p> <p>“I know you did, that day at the hotel. Sloan has made a few comments that I chose to ignore. But now I know for certain.”</p><p>“It wasn’t like that.”</p><p>“Really, what wasn’t it like? It wasn’t like you pulled your pants down when you were supposed to be working? Is that what it wasn’t like?”</p><p>I glare at her. When I fail to answer she turns back around, but I stop her with my hands on her hips. “You of all people shouldn’t be judging me.” My words are curt, harsh, and my tone more of a hiss. I regret them instantly.</p><p>She goes stiff. She looks over her shoulder at me and her eyes look like they’re searching for something.</p><p>“I’ve been going through some shit and haven’t been in the right mind space lately.”</p> <p>She turns around slowly, this time to face me and cuts me off. For a moment, by the look in her eyes, I think she understands me. “Here’s the thing, Ben, I don’t care what you’re going through or what you did. Don’t talk to me again. I mean it.”</p><p>So I put my hands up in surrender and let her leave. There’s no explaining what I did because I shouldn’t have done it. I stand there and watch her walk away from me again, all the while thinking I might have just blown the best thing that’s happened to me in a long time.</p><p>Moving onward through the maze of bushes that surrounds me, I leave Sloan, who is still sitting on the bench waiting for my return, without a word. I have something I want to take care, a small gesture to let S’belle know I do care.</p><p>I stop by Beck’s. He’s not there but I find what I need to break into her car in the backroom. I shimmy open her lock and pop the trunk. Once I’ve changed her tire, I hide the keys under the mat, and glance at my watch. I remove it and search for a piece of paper. Finding a stray receipt and a pen I write a quick note:</p><p>Bell,</p><p>Use this until you purchase another.</p><p>And call me if you ever want to talk.</p><p>Your keys are under the mat.</p> <p>Ben</p><p>646-453-1234</p><p>Then I hit the lock button, slam the door, and head back to the motel hating myself for the way the night ended.</p><p>Chapter 9</p><p>Pain</p><p>March first, a new month, almost spring, and it’s also two days until the anniversary of my death—that cluster of f**ked-up events that I can’t wrap my head around. I’ve been reading through my journals—the ones I still have left. I came across an entry from when I first came back to Laguna. I read the pages over and over. How much pain had I caused the people I loved by making that decision? How had I changed the course of everyone’s lives?</p><p>Do you ever try to pinpoint any one event in your life that may have changed everything? I do—all the time. But there seems to be so many I’m not sure changing any one would ever change the whole or make anything better.</p><p>I lie on my bed, closing my eyes, just thinking. My choice to come back wasn’t all that bad. . . . I had helped Trent, I had made my mother’s eyes sparkle, I had been there to help my sister with her son. So, no, it wasn’t all bad. I sit up and grab my journal. Letting it fall open, I read the entry in front of one more time.</p><p>I asked Mom if Dahl was seeing anyone. She was hesitant to tell me anything at first, but admitted there was a guy she was serious about and Dahl had been seeing him for a while. I guess I can assume he’s the same guy Caleb told me about. It’s not that I didn’t want her to move on—I never thought I’d be back. But I just never thought I’d have to see it.</p><p>I also asked if Dahl had dated many guys and she told me no, just the one. I had hoped there were more because that would make her more like me. She would have been doing what I had been doing—trying to find a substitute to fill the hole. When I first got to New York I was lost. I had no one. For months I didn’t go out or talk to anyone. Then after a while I tried to date someone, but everything we did just brought me back to the life I left, the life I missed, and it wasn’t fair to that girl.</p><p>I started teaching that fall, but it didn’t help me forget Dahl. That Halloween I knew she must need me and I wasn’t there. I went out and got shitfaced and f**ked a girl that looked like her. That started me down a road I can’t even remember clearly. Work, eat, drink, f**k. I never thought I’d see Dahlia again so I f**ked just about every tall blond I ran into. And New York was loaded with them. But I never stuck around . . . they weren’t replacements for her and I didn’t want to get that close.</p><p>I stopped trying to replace her over time because no matter how much I wanted it, there was no substitute for her. My love for Dahl never went away, but I met Kimberly shortly after Caleb told me he had seen Dahl with some guy in the Hills. Although I hated that she had moved on, for some reason it brought me closure and I stopped f**king around. Kimberly and I started dating and after a few months, I felt like I’d found a happy medium. I didn’t screw around on her. I liked her enough. Yeah, maybe she looked a lot like Dahlia, but she didn’t act like her. She never called me on my shit and never put me in my place. We had a good sex life and a decent time together. She wasn’t needy and didn’t pressure me for more than I was willing to give.</p><p>I was committed to Kimberly until I was told I could go back, at which point I told her I had an emergency back home and I’d be in touch soon. She didn’t know anything about where home was . . . I was always vague. She knew I was from California and she knew me as Alex. I didn’t want to explain anything different. So I haven’t talked to her since I left. I am going to call her—I owe her that. I just haven’t figured out what I am going to say.</p><p>All along I wanted to believe Dahl’s commitment to this guy was like my commitment to Kimberly—committed until something else came around. I had thought I would not only be her first, but also her last. And now hearing she’s going to marry another guy has torn my heart apart.</p><p>Yeah, my life might suck now, but it also sucked before I returned to things here. I called Kimberly a few times while in Australia but she didn’t answer. I wanted to find closure with her. Thinking back, there are many things I would want to change but the first would be how I handled finding out Dahl was in love with someone else. I knew she was happy. Why couldn’t I just leave it alone?</p><p>Why did I think I should try to change that? Now I miss the friendship we shared. I could have just tried to regain that. But instead I wrecked it.</p><p>The ring tone of my cell jolts me out of my thoughts. Grabbing my phone, I see its Caleb.</p><p>“Where the f**k have you been?”</p><p>“Nice way to answer the phone.” Caleb laughs.</p><p>“I called you over a week ago.” I settle back on the bed.</p><p>“Sorry, man. Haven’t had access to a phone.”</p><p>“I don’t want to know.” I chuckle.</p><p>“So what was so important?”</p><p>“Not so much important. Just odd.”</p><p>“Okay, what was so odd, then?”</p><p>“Strangest thing. Bass called me in her office and told me the data I had given her on the drive was useless. The team working with her thought it might have been pulled from a phonebook put on there to throw them off.”</p><p>“What did you tell them?” Caleb asked.</p><p>“What could I tell them? Just that I hadn’t dissected all the data before I wrote the story.”</p><p>“They’re f**king incompetent. They have no idea how to see their way through what’s right in front of them. I’ll make a few calls and see if I can get a copy of the info. Did Jason see it?”</p><p>“I have no f**king idea. He wasn’t in the room and his name never came up.”</p><p>“Look, man, I have to run, but I’ll see if I can find anything out and let you know.”</p><p>“Sure thing.” And with that we hang up.</p><p>Something about that phone call seems off. Caleb has never mentioned Jason working on the cartel case.</p><p>I glance at the time on my phone and decide to hop in the shower. It’s almost five and I haven’t left this room yet today.</p><p>While I’m washing my hair my mind shifts gears from Caleb to S’belle. I can’t stop thinking about how she looked at me the other night. She had such disgust in her eyes. Fuuuuck! I slam my hand against the glass and the door pops out of the track. What is it about that girl that constantly has me thinking about her? I turn the water off and stand there, letting water drip down my body. When I step out, all I know is that with all the bad ties between us, it’s better our conversation never went any further. Besides, I only f**k up everything I touch.</p><p>I know I need to get out and clear my head. So I quickly get dressed and head over to Beck’s.</p><p>When I enter I see him on the phone arguing with someone. He hangs up and heads over my way. He slams a mug on the counter and I put my hand out. “How about a cup of coffee?”</p><p>He laughs. “Haven’t ever seen you turn down a beer.”</p><p>I ignore his comment. “Everything okay?”</p><p>He shakes his head. “Ruby’s f**king ex is giving her a real hard time.”</p><p>“What do you mean? I thought he moved out.”</p><p>“He did, but he keeps showing up at the apartment, at work. I called the cops and they say there’s nothing they can do unless he poses a threat.”</p><p>“Has he done anything threatening?”</p><p>“No, but something about him tells me he’s off balance.”</p><p>“My ex-brother-in-law used to work this beat. Let me see if he can help out at all.”</p><p>“Fuck, man, that would be great.”</p><p>A little while later I leave the bar sober and feeling like maybe a small part of my life is coming together.</p><p>The next morning I have to shade my eyes against the sun’s glare in the room as I roll over to pick up my cell phone and see who’s calling. Irritation flares through me as Agent Bass’s name flashes across the screen.</p><p>“Yeah,” I answer, as I sit up.</p><p>“Ben, it’s Agent Bass. We were wondering if you could come down to the bureau this morning. Josh Hart’s trial concluded yesterday and I’d like to fill you in.”</p><p>I throw myself back on the bed trying to process what she just said. “Ummm . . . yeah, sure but I was never called to testify.”</p><p>“I’ll explain when you get here.”</p><p>“I just have to swing by the office and then I’ll head over.”</p><p>I hang up. Fuck, what the hell is going on? Why is Hart’s trial concluding already? And why hasn’t the drug cartel’s trial even begun? I can’t stand being left in the dark. All I know is that I am to stay put until all of the legal proceedings across these multiple cases are complete. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Last night I called Jason to ask him if he could help me out with Ruby’s situation. He said it was no problem. He had a buddy still on the force who he’d talk to. I was actually surprised that he agreed so quickly. But when I asked him what he knew about the data on the flash drive, he told me he had no idea what I was talking about. I’m going to throw it all on table today when I meet with Bass. Like I said, I hate being left in the f**king dark.</p><p>Before getting up, I roll over and grab my journal from the nightstand. I quickly flip to the entry made on March third, three years ago—that’s today, the anniversary of my death. Quickly skimming over those painful thoughts, I find an entry that was made much later—the day I learned Dahl had been attacked.</p><p>When I saw her beautiful face bruised and battered, my gut instinct was that that son of a bitch sitting next to her had hit her. It wasn’t until she left and Caleb sat me down that I realized her injuries were a direct result of my actions. Fuck me—what had I done? How can I ever make this up to her? I don’t know how I’ll do it, but I need her to give me the chance . . . because if she does I’ll spend my whole life making it right. I swear I will.</p><p>I knew then the incident must have had something to do with me, and it did. Actually, she was hurt because of me—because for some reason even after I shut up, even after I killed the story, even after I gave everything except that one flash drive to Caleb, it wasn’t enough. I sit there for the longest time with my head in my hands until I’m able to move. Today is the day I get to the bottom of this—Bass needs to come clean.</p> <p>I’m riding as fast as I can, weaving in and out of stopped cars to get to the courthouse. Entering the building, I empty my pockets and walk through the detectors. I announce myself at the reception desk and within five minutes Agent Bass is guiding me down that same f**king hall. She ushers me into the conference room and a fresh wave of panic overtakes me. Why would I get called in at the end of the trial? Is he going free?</p><p>“Ben, have a seat,” she says.</p><p>“What’s going on?” I stare at her.</p><p>She meets my glance head-on. “We couldn’t call you to testify because we couldn’t charge Hart with anything to do with the cartel. We just haven’t been able to link him to the heads of the operation. All the evidence we have is circumstantial and hearsay. He was tried strictly on aggravated assault and battery charges. The court reconvened yesterday and the verdict is in.”</p><p>I look at her in disbelief. “Are you f**king kidding me? A pony charge?”</p> <p>“Ben, look, we’re not giving up. We just can’t find anything solid to link him to the cartel. All we have is the attack on Dahlia London, which isn’t enough. The District Attorney didn’t want to wait, he pushed the case through.”</p><p>My ears start to ring and I feel like I’m beginning to hyperventilate. Bass pulls a chair out and this time I sit. After a few minutes I look up at her. “Did Dahl have to testify?”</p><p>“No, there was a witness and that was enough.”</p><p>Thank, f**k. I’d have hated for her to have to go through that.</p><p>“Ben, we need more information. There has to be a connection. Someone had to have contacted Hart when he was first released. We need to figure out who it was.”</p><p>My jaw clenches. “You have all I had. Did you ask Jason about it?”</p> <p>She forms a scowl. “Jason?”</p><p>“Jason Holt, Caleb’s brother. He’s a vice detective.”</p><p>“No, I haven’t. Should I?”</p><p>I shrug. “I’m not sure, but Caleb mentioned him when I brought up the flash drive. I thought maybe you were working together.”</p><p>“His name isn’t familiar. I’ll look into it. Ben, are you sure you didn’t keep a copy of anything?”</p><p>I slam my hand on the table and stand up. “Yeah, I’m f**king sure.”</p><p>We are face-to-face. Her gaze drifts to the folder on the table. “I just had to ask.”</p><p>Fury crashes through me. “Are we done?”</p> <p>She nods. “Yes, but we need you to stay in this jurisdiction.” Her voice is softer this time.</p><p>“Right!” My pulse thuds as I turn and walk out the door and down the same f**king hallway for what I hope is the last time.</p><p>Lingering on the threshold of sanity, I swerve to the right. My hands grip the bars and my heart pounds. Horns honk, but I keep going. I skid to a stop at a traffic light, wishing I had just run it. I’m not sure why I feel such an overwhelming urge to see that son of a bitch get what is due to him. I swerve to the right and turn on La Cienega. The courthouse is only five blocks away but even that seems too far. I park as close as I can. I flash my press pass and surprisingly it works. For once, I’m grateful for my f**king job. I feel a tightness in my chest as I race up the stairs to the courtroom. I file in quietly and have a seat. All I see is his back, but I recognize him immediately—the slick dark hair gives him away.</p><p>Glancing around the room, I see Jason sitting in the front row. Confusion descends on me. What the hell is he doing here? How is he connected to all of this? I try a million different ways to put the pieces of the puzzle together but they just don’t fit. Thirty minutes pass and Jason sits there, waiting, like me. Time seems to move so slowly. I wait for the ass**le to turn around but he never does. Finally, the judge enters the courtroom. As the jurors file in, the bailiff asks everyone to rise. The jurors all take their seats in the jury box and we follow.</p><p>The judge addresses the jury. “Has the jury reached a verdict?”</p><p>The foreperson responds, “Yes, we have, your Honor.”</p><p>The bailiff hands the verdict form to the judge as he reads aloud, “As to Count 1, the jury finds the Defendant guilty . . .”</p><p>I tune out the rest. Guilty was all I needed to hear. I stand to leave just as he turns. He looks the same—a spray of black bangs over dark round eyes, a slight mustache covering his lip, and a stance like he could never be defeated. I notice the eye contact between him and Jason and know there is something going on. I tense even further at the thought. With my eyes locked on Josh’s, I stay where I am. Fury overtakes his humbled face when he recognizes me. In that instant, he flies into a rage—his eyes turn wild.</p><p>He points to me. “You, you did this to me! You took my family from me, you took everything from me!”</p><p>Looking around I see an old man and a young, rail-thin woman with long dark hair quietly begging him to be silent. But their pleas go unheard as two armed court officers grab him and drag him out of the room.</p><p>But his last words ring in my ears even after he’s left the room, and a shiver rides down my spine.</p><p>“You’ll get yours! An eye for eye. Don’t forget it,” he spat at me.</p><p>Horror had paralyzed me as I watched him being escorted kicking and screaming out of the courtroom, thankful he was being put away. Jason must have passed by me without my noticing. I flee the courtroom and spot him in the hall.</p><p>“Jason, hold up!” I yell, but he keeps moving and disappears into a door marked PRIVATE.</p><p>“Fuck, what is going on?”</p><p>As I exit the building I call Caleb. I get his f**king voice mail again. “Call me. I want to know where you found Josh Hart!”</p><p>Chapter 10</p><p>Leave the Lights On</p><p>The sky has begun to cloud over as I maneuver through the stop and go traffic on Melrose. Cars are parked haphazardly lining the street and I squeeze into a space between an SUV and an Escort. I already decided going back to work was not happening. One turn of the key and the roar of my engine ceases; I stand here with the heavy metal between my legs. I don’t want to go back to that shithole of a room right now. Fuck, I have nowhere else to go. I hop off and just start walking. I stop in at Four &amp; Twenty Blackbirds, but Ruby isn’t working today. I head to Beck’s but he’s not behind the bar. The bartender’s face flashes recognition as I walk up to her.</p><p>“Hey. Is Beck around?”</p><p>“No, he took a few days off. He told me that if you stopped by to tell you he’d be in touch.”</p><p>“That’s mysterious. What’s going on?”</p><p>She shrugs. “No idea. Just passing on the message. You drinking?”</p><p>“No, not this early. I was just looking for Beck. I’ll see you around.”</p><p>I go outside to get some air and clear my head. While I’m walking aimlessly down the crowded street, my cell rings. I pull it from my pocket. Fuck, it’s not Caleb. It’s Bass. “Yeah,” I answer, anything but thrilled that she’s calling me so soon after I left her office.</p><p>“I looked into Jason Holt. He’s not involved in the case but when I crossed his name with Josh Hart’s I found that Hart was one of his informants years ago. Did you know that?”</p><p>My head spins. Has Jason been involved the whole time? “No, I didn’t. But thanks for letting me know.”</p><p>I leave another message for Caleb. Fuck, I need someone to talk to. I want to call my sister but she took Trent to Hawaii a few days ago. Having no place else to go, I end up outside of S’belle’s place.</p><p>I smile when I see her car parked out front—maybe my luck is finally changing. At the metal gate that leads into the courtyard, I debate ringing the bell but I don’t have to hesitate for long. She emerges with that dick of a boss following her. She’s carrying a basket of flowers and he holds the gate open for her. They look pretty cozy. I guess there was more going on between them—just not what I thought it was.</p><p>Turning on my heels I head back to Beck’s. The walk feels so much longer than I remember it being on my way here. When I finally open the door, I’m ready for a drink.</p><p>“Haven’t seen you a while,” the bartender jokes. “Decided to come back for an early one after all?”</p><p>“Something like that. I’ll have a scotch. No ice.”</p><p>She looks thoughtful for a moment. “Sure, Ben, no problem.”</p><p>I see something different in her eyes and wonder if it’s pity.</p><p>“Join me?”</p><p>She leans forward setting two glasses in front of me. “These are on me. Shhh, don’t tell the boss.”</p><p>“I wouldn’t dream of it.” I slam mine back as soon as the bottle clears the glass. I set it down. “Thank you.”</p><p>She refills the glass and we do this move two more times.</p><p>She eyes me. “Rough day, I take it.”</p><p>“Something like that,” I say again. I’m not in the mood for chitchat and she catches on right away because she sets the bottle next me and leaves me alone.</p><p>After an hour passes, I’m ready to talk. The joint is dead, so I call her over. She winds around the bar and has a seat next to me and I spill it all. With whisky-numbed lips, I just can’t seem to shut up. I tell her about the courtroom and the danger to Dahl and how relieved I am the guy got put away. How there’s a girl I want nothing more than to be with but that I blew it. She listens, but never says anything. When a few customers enter the bar, she gets back to work. I sit there with my hands on my head just thinking about how the f**k I got to this place. It’s the same question I’ve asked a thousand times.</p><p>My phone rings and again I think it must be Caleb. I slide it out of my front pocket. The screen flashes Kimberly. Fuck me! A name I wasn’t expecting . . . my girlfriend from New York City, or maybe I should say my ex-girlfriend.</p><p>“Hey, gorgeous.”</p><p>“Hey, Alex. Or should I say Ben?”</p><p>“Fuck, that’s harsh. I called you a few times. You never called me back.”</p><p>Her voice lowers but takes on a serious tone. “Yes, you did. Drunk every time.”</p><p>“You sound drunk yourself right now.”</p><p>“Well, I just might be. I wasn’t ready to talk to you then.”</p><p>“And you are now?”</p><p>“As a matter of fact I am.” Her words sound even more slurred than mine. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Silence occupies the line for a few moments too long, but I can hear her breathing. “I’ve been in LA for a while.”</p><p>“How long is a while?”</p><p>“I actually got a job here.”</p><p>“That’s f**king fantastic news. What are you doing?”</p> <p>“Managing Sound Music Magazine.”</p><p>I turn around on the stool and almost fall off. “Aerie Daniels’s job?”</p><p>“No, I work with her. I moved here in January to prep the new launch. I’ll be managing the entertainment news side. We publish our first edition this summer.”</p><p>“So why are you just getting around to calling me?”</p><p>“Shitty day. Was looking for someone to have a drink with me and your name popped into my mind.”</p> <p>“Where are you staying?” I ask in a low whisper.</p><p>“I’m in Marina Del Ray at the Palazzo Apt 310.”</p><p>I clear my throat. “Can I come over?”</p><p>“Yes.” Her voice sounds familiar and wanting.</p><p>“I’ll be there soon.”</p><p>I head back to where I parked. The night air assaults me as I mount my bike and I feel instantly sobered. I eye the traffic ahead. Red taillights glow for miles. I turn onto Fairfax a little too sharply and almost lose my balance. Maybe I shouldn’t be driving? I keep the speed low throughout the short ten-mile ride making the ride easy and manageable. When I come to a screeching halt at a light, I think about Kimberly—how I felt about her. I really did have feelings for her, but I lost sight of them when I thought I’d have Dahl again. Yeah, it was shitty of me.</p> <p>A sudden twinge of guilt floods me for all the women I’ve been with since I’ve seen her last. I swallow it down and try not to think about it as I enter the elevator of her swanky Mediterranean-style apartment building. But when I knock on the door the guilt returns. The moment she opens it, I forget about everything. She looks f**king beautiful. A slinky dress, no shoes, hair down—gorgeous.</p><p>I grin at her as I lean against the door.</p><p>She stares at me for a long while with a blank expression on her face and a glass of Sangria in her hand. I bow my head, wondering if she’s going to invite me in.</p><p>“Hi,” she says very softly.</p><p>My eyes snap to hers. “Hi, yourself. You look amazing.”</p><p>I take her hand and kiss it and her smile widens.</p><p>“Are you going to stand out there all night or do you want to come in?” she asks.</p><p>“I was just waiting to make sure I was welcome.”</p> <p>She moves to the side and I figure out she’s not wearing a dress, but a silky nightgown. Her tits protrude against the tight fabric and I’m instantly aroused. I step in and when she crosses in front of me to close the door, I lean down and kiss her cheek. When I do I smell the lemon slice wedged on the side of her glass. She doesn’t pull away, so I slide my mouth to hers and lock our lips together. I taste the sweet flavor of sangria on her lips and I pull her closer to me. A sudden surge to devour her overtakes me. She feels so soft and tastes so good.</p><p>Lifting my head, I glance around. We’re standing in her living room and a large purple sofa is only a few feet away. Soft music and candles surround us as the feeling of seduction fills the air. With my hands on her hips, I walk her backward and her free hand tangles in my hair. We reach the sitting area, and with my eyes locked on hers, I can tell her pupils are dilated. I look around and see a bottle of wine, a plate of oranges and lemons, and a clear glass pitcher with a small amount of red liquid left inside it.</p><p>“Are you sure I should be here?”</p><p>“Yes.”</p><p>I grin at her and she smiles back. She circles her fingers around the rim of her glass and picks up the lemon wedge. She sucks on it and drops it inside. My dick throbs at the sight. I take the glass from her and set it down on the table. She watches me with labored breaths—her stare capturing mine. As I straighten, I notice her lips part and, unable to hold back, I seize her mouth so that I can taste her sweetness, practically wanting to devour her.</p><p>When I flop us down on the sofa she breaks free of my lips.</p><p>“You’ve been drinking,” she remarks, pulling away. But her tone is anything but accusatory.</p><p>“So have you.” I point to the bar.</p><p>She smirks. “I have. Do you want one?”</p><p>“No, I’ll just taste it from your lips,” I answer, and let my mouth find the sweet spots down her neck I remember she always liked me to kiss.</p><p>“I’m in a really bad place right now,” she breathes.</p><p>“That makes two of us.”</p><p>She dips her head back. “Then maybe we can help each other out.”</p><p>“Ummmhmm . . .”</p><p>“I know about everything that happened to you. Why didn’t you ever tell me about it?”</p><p>Her words are mumbled as we grope each other, but I understand them. I pull away and lift her drink from the table for a sip. But when the lemon hits my lips I hand it back to her. “Finish it.”</p><p>She downs the rest of the liquid and then stands. She tips her chin toward the bar and moves that way. Watching her, I can see through the thinness of the fabric covering her body that she’s n*ked underneath. A sparkling black counter separates the kitchen from the living room. Her apartment is entirely her—upscale and modern. Oak cabinets, granite counters, stainless steel appliances, and a fireplace now blazing with flames. I suspect there is even a private terrace but the blinds are closed and I can’t tell for sure.</p><p>“You live here alone?”</p><p>“No, with my sister. She moved to LA with me.”</p><p>I nod. “Is she here?”</p><p>“No, it’s just the two of us.”</p><p>“Make us both a drink and show me your bedroom.”</p><p>Her gaze takes me in and her eyes stop at the tent forming in my pants. The corners of her mouth tip up. “My, aren’t you bossy.”</p><p>She comes back into the living room and turns to make us both a drink. I move closer to her so I can swipe her hair to the side and kiss her neck. I breathe in deeply, smelling the lemon she’s squeezing into the sangria. When she rounds the glass with it, my teeth tug at the thin strap on her shoulder. “Take this off.”</p><p>Her breath catches as she sets the wine bottle down. She twists in my arms and does as instructed. I step back so I can watch her as she slips her negligee down her shoulder and lets it fall to the ground. She stands n*ked before me, and when she turns to hand me my drink, I cup her ass. We both gulp our drinks in silence until the desire for her overwhelms me. Setting my glass down, I take hers. She licks her lips and I can see the pulse in her neck throbbing. “Forget the bedroom.”</p><p>I slam my mouth to hers, then slide them down to her breast and suck on one of her ni**les. She moans and her hands go to the fly of my pants. She unzips them. “Maybe we should talk first,” she moans.</p><p>But her hands are already stroking me—we’re way past the time for talking. I try to focus, but I’m seeing two of her and I don’t want to discuss anything right now. “Talk is for later, gorgeous.”</p><p>Her hands continue their magic and mine roam her body. My fingers travel down over her h*ps and to her clean-shaven pu**y. I always loved that about her. I stroke my thumb back and forth over her cl*t and she purrs. I insert one finger inside her to find that she’s already soaking wet. A moan escapes her lips and I know she’s ready. I dip my head to kiss her and the smell of the lemon intoxicates me. In that moment the dynamics between us shift.</p><p>“Turn around,” I order through gritted teeth.</p><p>She turns and braces her palms on the counter and I reach into my pocket for my wallet and pull out a condom. I roll it on quickly and just as hastily push into her. I watch myself in the reflection of the microwave door as I slam in and out. Blonde hair turns into red and I lose myself back in time in a moment—in a fantasy come alive that I’ve never been able to forget.</p><p>She moans out in pleasure and I come fast and hard, not waiting for her. I crave the release and I can’t hold on. And the words slip out without intention. “Fuck, S’belle, you feel so good.” An instant later she’s pushed away from me. I look at her and she has tears in her eyes. “Kimberly, I’m sorry. I don’t know why I said that.”</p><p>She turns around, grabs her nightgown, and heads out of the room. She stops at the doorway leading to a hallway and looks at me. “I don’t know who S’belle is, but just so you know I was thinking about someone else too while you were f**king me. I just didn’t call you by his name.”</p><p>“I’m so sorry.”</p><p>Her hand swipes the room. “This wasn’t set up for you. So don’t worry about it.”</p><p>I ignore her jab and zip my pants up. The pain that never stays away for long comes rushing back worse than ever. Guilt assaults me. It was wrong of me to say someone else’s name with her. I respect this girl too much to be such a prick to her. It’s just everything that happened today has me all f**ked up.</p><p>I follow the hallway and see a light on under a door. I knock lightly. “Kimberly, I’m sorry.”</p><p>With a small sobbing voice she says, “I go by Kay now. Kimberly is long gone.”</p><p>I rub my hands over my face and try to figure out what to say to make this better. Nothing sounds right in my head so I do what she asks and leave, knowing this is just another relationship I have managed to f**k up.</p><p>Chapter 11</p><p>Rock Bottom</p><p>I’m flying down the road, seeking quiet. I’m almost at my destination when flashing lights appear in my rearview mirror. I glance at my speedometer. Fifty-five. Fuck, what’s the speed limit? Thirty up here, maybe? Fuck, f**k, f**k. The police car catches up with me just as I pass the overlook and I pull to the side of the road. I kill the engine and remove my helmet. Cool air rushes over me, but sweat pours from my brow.</p><p>A flashlight beam hits my eyes as the officer stands at a safe distance.</p><p>“Dismount the vehicle,” he calls.</p><p>I toss my leg over the bike. “I was going too fast, wasn’t I?”</p><p>The officer approaches and shines the light in my face and just stares for a few short seconds. “Have you been drinking?”</p><p>I contemplate lying, but I’m pretty sure I was swerving a little too much. “Yes, I have.” When I say those words, all that runs through my head is how f**king stupid I am to have put myself in this situation.</p><p>“Stand with your heels together and raise your arms to your sides,” he says.</p><p>“Now raise your left leg six inches from the ground while counting out loud to ten,” he instructs me, and I try, but by the time I get to five, I have to hop to keep my balance and by the time I get to eight I have to set my foot down. Shit, I don’t even think I could do that sober.</p><p>He’s conducting a field sobriety test. I’ve seen them on TV a million times. I’ve also heard they do nothing in terms of affirming or disproving one’s state, but I do what he asks. I already admitted to drinking. What more does he want—a formal confirmation? Fine.</p><p>“Touch your finger to your nose,” he says next, not saying a word about my inability to stand on one leg.</p><p>I think I manage that, though I’m not sure.</p><p>He has me complete two other tests and I have no f**king idea whether I pass either one. All I can hear is the sound of his pen scratching the surface of his clipboard. He looks up at me to ask, “Will you agree to a Breathalyzer?”</p><p>“Yes.” I’m scared shitless at this point and just want this to end. I breathe in and then blow into the plastic tube. Fuck, the gauge indicates my blood alcohol level is 0.079. And with that final result, I’m promptly arrested, cuffed, and escorted into the back of the police car. I stay silent during the ride to the station. My pulse is pounding and my ears are ringing. Fuck, what have I done?</p><p>Once we arrive, I am formally charged with driving while intoxicated. My photo is snapped and I’m moved to sit at a chair near a desk. Within a few minutes my belongings are confiscated—they say they’ll be returned upon release. I’m shoved into a holding area with at least ten other drunk men—derelicts, winos, scum, bottom of the earth. Fuck—I’m not like them! I’m not! My nerves get the better of me and I sit on the wooden bench with my head hung low just wanting to get out of here. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Once I’m booked, I’m shoved into a cell with no one to call to get me out. Serena’s in Hawaii with Trent, Caleb is God knows where, and I’d call Beck or Ruby but I never got their numbers. Who the hell do I know who would fork out the one thousand dollars needed to post as bond to bail me out?</p><p>As I lay there in the tiny jail cell, suited up in an Orange County prison shirt, it occurs to me how far I am from the road I started on in life, far from where my mother would want me to be. I don’t want to be here. I don’t want to be chained up like a criminal. Fuck—I need to get out of here. Leaning my head against the bars, I know there’s only one person I can call—one person who possibly couldn’t think any worse of me than she already does.</p><p>Back at the desk, I squeeze my eyes shut as I dial the number and the phone rings. When she answers I’m both surprised and relieved. “It’s me, Ben. I need your help. I’ve been arrested.” It comes out on a rush full of shame and regret. My voice is low, maybe too low for her to hear because there’s no response. I repeat myself, this time louder.</p><p>“I’m here. I can hear you, Ben.”</p> <p>Sometime later, in the early hours of the morning, I’m taken back to the booking area where I’m asked to sign a release form. What is this—my get out of jail free card? I still can’t believe I’m even here. The officer explains how lucky I am that my level wasn’t bumped up to .08. He says that I’m free to go. I glance above and silently say thank you. I’ve learned my lesson. I’m handed my clothes and the rest of my shit and directed toward the bathroom. When I come out, I hand back the orange shirt and I’m ushered through a door. Once I get through it, I’m on my own. It must be the central admittance area. It’s crowded. There are people everywhere. I look around and there she sits, on a black upholstered bench—Dahl.</p><p>My body starts to shake. I can’t believe she’s actually here for me. I cross the room, slowly; my walk is full of shame. She meets me halfway and when I lift my head, our faces are so close. I stare at her, the face of the girl I knew my whole life, and all I see, all I want from her is comfort and understanding—I want her to be my friend, I need her. Her eyes lock on mine. Her gaze is unyielding and I feel like she’s studying me. Nothing comes out of my mouth. I have no words.</p><p>“Come on,” she says. “Let’s go somewhere and talk.”</p><p>She leads and I follow, her converse sneakers squeaking against the shiny green floor. The exit doors slide open and she fumbles in her purse, pulling out her keys. Finally, I turn to look at her before she starts the car and swallow the lump in my throat. “Thank you for bailing me out.”</p><p>“Ben,” she says. “I’m sorry I haven’t been there for you.”</p> <p>I shake my head. It wasn’t her job to be there for me.</p><p>Her fingers fly to her cheeks and she wipes away a few tears. “But, I am now. I want to help you.” Her hand finds mine in the early morning light and as she squeezes it, all I can think is—I am so thankful for her just being here.</p><p>She breaks our connection quickly and twists the key in the ignition. “I read the diary you gave me last year,” she says. “Before I came to get you, I read through it. I’m just sorry I didn’t read it sooner. And I want to find a way for us to be in each other’s lives.”</p><p>My gaze travels over her face and once again her eyes meet mine. In this moment I know we’re both silently agreeing that we are friends, that’s all—and honestly, I accept it. I’m okay with it.</p><p>As she turns out of the parking lot, I watch the large three story building fade from my vision and thank God I’m out of there. I rest my head back against the seat and close my eyes. I pay no attention to where she’s taking me. Dahl turns the radio off and we drive in silence. When she gets off at an exit, I open my eyes. We pass so many familiar places in Laguna Beach and a rush of memories from days long gone flood me. This town is our old stomping ground and we spent so much time here. She pulls into the corner coffee shop that I know so well and turns to look at me. “Stay here. I’ll be right back.”</p><p>She hops out of the car and I look around. I love this place. Why did I leave? This is where I belong. When she gets back in it’s with a tray of two coffees. The sun starts to rise as we sit in the parking lot and I tell her everything—everything that I hate in my life, everything I am, and everything that I don’t want to be. I even manage the excruciatingly embarrassing details. And most of all, I apologize. I apologize for the way I treated her when I first came back. I saw she had a new life and that she was happy, I should never have thought I could change that. I had to get it all out—to confess my sins, to cleanse my soul.</p> <p>By the time we pull into my mother’s driveway I already feel a little more like myself. We get out of the car and she starts toward the old weathered plank bridge. I keep my distance, not wanting her to think anything other than how grateful I am for her help. She stops to wait for me before crossing and when I catch up, she grabs my hand and locks our thumbs, then leads me to the beach. This is the one place we always held hands. Every time we walked over this bridge our hands were connected, since we were five years old. But now, those fond memories are just that—memories. I look at the girl leading me and smile at the woman she has become.</p><p>The beach stretches for miles and we sit close to the shore. I throw myself back in the sand and cover my eyes with my arm. “What am I going to do, Dahl?”</p><p>She pulls her knees up to her chest and looks over at me. “Ben, it’s okay to grieve, it’s even okay to be a little lost, but you have a life in front of you. I can’t tell you what to do with it, but I hope whatever you decide makes you happy.”</p><p>Silence passes between us for a long moment as I think about what she’s said. “Are you happy?”</p><p>She stretches her fingers out and looks at her ring. Her face lights up. “Yeah, I am. Really happy.”</p><p>“Dahl, I know I’ve f**ked up a thousand times. But I am sorry for everything I did. I just need you to know all I ever wanted for you was for you to be happy.”</p><p>“I know that now, Ben. I may never understand it. But I get it.”</p><p>I sit up and bow my head.</p> <p>She looks at me. “Ben,” she says softly.</p><p>I glance up at her.</p><p>“You need to figure out what is going to make you happy.”</p><p>“Yeah, happy. Shit, I don’t remember the last time I felt that way.”</p><p>Waves crash against the rocks and birds fly overhead squawking. I shift my eyes toward the water and we sit there in silence for the longest time, but it’s not uncomfortable or awkward.</p><p>“You know me so I’m going to tell it to you like it is—you need to get your head out of your ass and get on with your life because life’s too short not to.”</p><p>I can’t hold back my grin. That’s the girl who was always my friend—the one who told it like she saw it.</p><p>A few moments later, I see her shiver. I stand up and wipe the sand from my pants and then extend a hand. “Let’s get out of here.”</p><p>She takes it and I pull her up. And as we walk over the old weathered plank bridge, I turn and look back at the refuge I’ve sought so many times in my life and I know it’s where I belong.</p><p>Chapter 12</p><p>New Beginnings</p><p>Memorial Day weekend has always been one for barbeques and hanging out at the beach. That’s just what I plan to do.</p><p>My heart races as my hair whips in the wind. I run as fast as I can across the sand, my breathing heavy. I open my mouth wider to get more oxygen in my lungs.</p><p>“You got this Uncle Ben,” Trent cheers.</p><p>I come to a halt and look into the bright blue sky. Where is it? I shield my eyes from the sun and crane my neck further back. I follow the lead from the plastic in my hand to the string to . . . son of a bitch, there it is—the rainbow-colored diamond bobbing and weaving in the wind at least ten feet above my head. For a moment, I’m entranced. I watch as the kite dances wildly in the wind and beam at my nephew.</p><p>“We did it!” I shout.</p><p>“You did it,” he responds.</p><p>“Yeah, I guess I did,” I gloat.</p><p>“Boys, come on. That’s enough playing. It’s time to finish packing up,” Serena calls.</p><p>I look at Trent and shrug my shoulders. “Playtime’s over for now.”</p><p>“Fuck,” he says.</p><p>I tug the string down and the fabric loses its sail, descending immediately. When I’m close enough, I pop Trent in the back of the head.</p><p>He rubs it and looks at me questioningly. “What was that for?”</p><p>“Don’t swear.”</p><p>“Are you kidding me? You swear all the time.”</p><p>I grin at him. “Yeah, but that’s me. Not you. And you know how mad it makes your mother.”</p><p>“Alright, alright. I’ll try to keep it cleaner around her. I promise,” he responds.</p><p>I put an arm around his shoulder and walk with him up the beach toward the house. “Did I ever tell you about the time Grandma put a whole bar of soap in my mouth?”</p><p>He looks over to me. “My mom used to do that to me all the time when I was little.”</p><p>I laugh at the memory. “No, Trent, she did it the day I graduated high school.”</p><p>“Fuck, then that’s where my mom gets it from.” He laughs.</p><p>I pull his head to me. “Damn straight, so cut the f**king swearing already.”</p><p>“What’s so funny?” Serena asks, tugging the door to the rental truck down.</p><p>“Just boy talk. Nothing for you to worry about big sis,” I tell her.</p><p>“Right.” She smirks.</p><p>I nod my head toward the house. “Let me just give it a once over, then we’ll head out.”</p><p>She nods in response, moving to swipe Trent’s hair from his eyes.</p><p>I walk through my family’s house, which now seems so much emptier without some of my mother’s things, and slowly walk from room to room. My sister came back from Hawaii the minute I called her after my arrest and we both cried for forgiveness. I love her and I need her in my life—I finally told her that. We handled our grief in different ways, and I’m not saying either was right or wrong, but we now know we need to stick together no matter what.</p><p>We are all moving into the beach house for the summer and we’ll decide what to do with it in the fall. Right now we are donating some of my mother’s things to charity to make room for all of us to live there. This way I can train Trent and when the fall comes and he heads to the University of Hawaii, he’ll be ready to enter any surfing competition he wants.</p><p>As for Jason, he was involved in the case. When Caleb finally called me back almost two weeks after Bass told me that Hart was one of Jason’s informants, he confirmed that it was Jason who gave him the name. At first he told me Jason hadn’t worked the beat in years and just threw the name at him when he asked for someone to help him out, someone looking for money who was willing to take the fall. But I knew he was lying, I felt in my gut he was the missing piece of the puzzle.</p><p>When I confronted Jason, he pulled me aside. He told me to trust him. That he was way more involved than Caleb or I knew and he’d be able to tell me soon. Whether or not he is on the up and up—I still haven’t been able to figure that out.</p><p>I circle back through the living room and stand where my mother’s desk once stood. I look down at the n*ked space and it doesn’t feel right. I rush out the door and fly down the stairs.</p><p>“Serena, toss me the keys,” I tell her.</p><p>She looks at me. “Did you forget to pack something?”</p><p>“No, I decided I want to keep the desk.”</p><p>“Come on, Ben, it’s so old and broken. You can buy a newer, more functional one.”</p><p>“Just toss me the keys. I want that one.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She looks at Trent. “Here, go help him so we can get out of here.”</p><p>I unlock the door and hop up on the platform. I move a few boxes aside and drag the desk to the end. We ease it out of the truck, but it’s top heavy and tumbles over, crashing to the ground.</p><p>“Fuck!” I yell.</p><p>“Fuck,” Trent mutters.</p> <p>“Trent!” Serena says with her hands on her hips.</p><p>Something shiny catches my eye as I survey the damage and I bend down to retrieve it. It’s a key.</p><p>“What’s this?” I turn around to show Serena, who is still scowling at Trent.</p><p>She takes it from me. “It looks like a safety deposit box key.”</p><p>“Did Mom have one?”</p> <p>“Not that I know of,” Serena answers. “But I’ll call Hale on our way to the church and see if he knows.”</p><p>I nod at her and think about how long it has been since I’ve seen my mother’s attorney. I motion for Trent to get in the truck. He points to the pile on the ground.</p><p>“We’ll clean it up when we get back. Let’s go,” I holler back as I hoist myself into the cab.</p><p>I pull out of the large circular driveway and glance back at the heap of wood in my rearview mirror, hoping I can put the desk back together.</p><p>As Serena and Trent argue about what station to put the radio on I reflect back on the last two weeks and how my life has changed. After Dahlia and I left the beach, she drove me back to LA and dropped me off at the impound lot. She was shocked to see I had a motorcycle, but then just grinned and said, “You always did like to feel the wind against your face. So it makes sense.”</p><p>“Don’t say it,” I teased her as I got out of the car.</p> <p>“Say what?” she called back.</p><p>“That I’m a dog,” I said.</p><p>“That you’re a dog,” she said in unison.</p><p>It was an inside joke we’d had since we were kids. She always made fun of me for loving speed—the speed I felt while pedaling fast on my bicycle, the speed I felt taking a steep hill on my skateboard, or the speed I felt catching a wave on my surfboard. I glanced at her one last time before I walked away from her that day. There was no discussion as to when we’d talk again, but I knew we would and I knew that somehow we would be all right—that we would find our way back to a friendship that worked for both of us.</p><p>After the arrest, I promptly gave my two weeks notice to the LA Times, opting to freelance for a bit. My last day was probably the most interesting one of my stint as a wedding columnist. I had the very distinct pleasure of meeting with the infamous Damon Wolf. Damon Wolf and Ivy Taylor were engaged sometime last year, but hadn’t set a wedding date. The wedding column doesn’t usually run stories on engagements, but Christine made an exception. I guess when you own a magazine you get special treatment.</p><p>My interview was with Damon only and he wanted to meet at Sound Music Magazine. When I arrived he was reaming out Dahlia’s friend Aerie for forgetting to arrange a lunch date for him for some interview. I tried not to get involved, I really did, but I’ve known Aerie for so long that I had to step in. Let’s just say when I did—my day and my job ended early. What an assshole!</p><p>“Did you hear me?” my sister asks, pulling me out of my thoughts.</p><p>I put the truck in park and turn toward her. “No, sorry.”</p> <p>“Hale said he’s been trying to reach us for months. I’m pretty sure he was calling Mom’s house phone. Either way he wants us to meet him at the bank as soon as we finish. He wants to read Mom’s will.”</p><p>I blink my eyes and try to take what she said in. “Did you know she had a will?”</p><p>Serena shakes her head. “He seems to know what’s in the box though.”</p><p>“You should have let me take Uncle Ben’s motorcycle,” Trent tells his mother as he hops out of the truck.</p><p>“I told you, you are never allowed to ride that. And I’m not kidding!” she yells to him.</p><p>“Come on, Trent. Let’s unload and we’ll drop you at the coffee shop while we go over to the bank.”</p><p>He smiles. “Hell, yeah. Hot chicks are always in there.”</p><p>I just grin and shake my head. I notice my sister roll her eyes.</p><p>Serena and I file into the conference room with Hale Reed behind us—box in hand. He’s been our family’s attorney for as long as I can remember. He’s been in and out of the hospital so it’s understandable that we haven’t connected until now. My sister takes a seat at the table and I choose to stand at the window. Hale sets the box down and pulls an envelope out of his pocket, along with a pair of reading glasses. He clears his throat. “Serena and Ben,” he says, as he slips his glasses on and then unfolds the document in his hand. “This is your mother’s will. She hadn’t updated it in a while. It was drafted more than ten years ago, but I am confident these were still her wishes.”</p><p>I lean back against the sill and thump my fingers nervously on it.</p><p>He unlocks the box and takes out a dark blue bankbook. I walk over and glance in the metal case to see if it contains anything else, but there’s nothing there.</p><p>“Hale, what’s with the formality of meeting us for a bankbook? I already have all her account information. Ben and I just haven’t sat down yet to figure it all out,” Serena inquires.</p><p>“No, Serena, you don’t have everything. I manage this account. I’m the trustee.”</p><p>“Okay, why?” Serena asks.</p><p>He clears his throat again. “This account contains a ten million dollar settlement fund issued to your mother. She never touched the principle; but rather she lived off the interest. Your father didn’t have life insurance, so this was how she supported you both. Every year since the year your father died, I’ve dispersed the interest to her but she never wanted more. She said it was for you both.”</p><p>My mouth drops and Serena pales. I make my way to the table and sit next to my sister and take her hand in mine. I’m speechless. Ten million dollars. How could we not have known this?</p><p>There are sounds sputtering out of Serena’s mouth, but none are comprehensible. I make an effort to speak. “Hale, why would our mother have ten million dollars from a settlement? And why wouldn’t she tell us?”</p><p>He slides the box to the side and pushes the stack of papers toward us. “Ben, Serena, a couple of weeks after your father’s death his boat was found.”</p><p>My heart pounds at the news. “Was he alive?” I ask.</p><p>“No, son, he wasn’t. The boat was new and when he took it out and tried to raise the sail, one of the lines malfunctioned. Faulty mechanics—so the company stated.”</p><p>I look at him feeling terrorized by this news and squeeze my sister’s hand tighter.</p><p>“He was . . . ,” he pauses before saying, “hung by the sail’s ropes.”</p><p>I don’t say anything, I can’t.</p><p>Serena’s hand flies to her mouth. “Oh my God, my Daddy,” Serena cries.</p><p>I hear a voice that I think is mine comforting my sister. I pull her to me and hold her. After a few moments I lean away and look at Hale. “Why wouldn’t Mom have told us?”</p><p>“She didn’t want her children to picture their Dad the way you are right now.”</p><p>I nod and draw my sister back in to my arms. All the while hushing her cries and trying to will away my own.</p><p>The shock took us both a while to absorb. Over the past few weeks we discussed in detail why Mom would never have touched the money. All we could surmise was that she didn’t need it. We’d talk about our parents again and again and how lucky we were to have had them. We talked about Dad’s surf shop and our parents’ love for each other. We talked and helped each other through the rough spots. It took us months to be able to go back to the bank and transfer the money into three separate accounts—per my mother’s will. But we did it last week. And now, as we sit together at the kitchen table in the house we grew up in, we watch through the glass as fireworks shoot off into the dark sky and the country celebrates Independence Day.</p><p>Trent closes the pizza box in shock. “We’re f**king rich?” he asks.</p><p>Serena snaps her head toward him and my eyes dart to his.</p><p>“Trent!” we both say.</p><p>He shrugs. “We are,” he answers.</p><p>We hadn’t told him about the money when we first learned about it. We both needed to wrap our heads around it first. And also, truth be told, we were watching him, looking for signs of any possible relapse. But there were none—he was clean and as far as I can tell, he was going to stay that way.</p><p>Serena reaches across the table and pushes the hair from his eyes before putting both her hands on his face. “Honey, we are not anything. That money has been split between the three of us as Grandma wished, but yours will be put in trust until after you finish college.”</p><p>“But, Mom . . .”</p><p>“No buts, Trent. After college we’ll discuss your best investment opportunities.”</p><p>He stands up and tosses the paper plates in the trash. “For the record, you should know I think that sucks.”</p><p>“Trent . . .”</p><p>I leave my sister and nephew to argue about the fairness of having money and not being able to spend it. I pass through the family room and see that the TV is on. The news report catches my attention. Bass called me earlier and informed me about the news. But I still stop in my tracks to watch the reporter share the details.</p><p>“Two more members of the Mexican drug cartel have been arrested. Along with the bust—more than one hundred pounds of methamphetamine, ten pounds of cocaine, and half a pound of her**n was seized in the raid. Vice squad detective Jason Holt said he estimates to have removed nearly five million dollars of trash from the streets. The almost five-year long investigation culminated late last night when a long undercover operation targeting the remaining members of the Cortez Family was brought to a successful end. The Department of Justice said that they believe the trafficking organization run under this family is now shut down. In related news, Josh Hart, believed to be linked to the cartel, was found guilty of aggravated assault and battery in March and was sentenced to three years in prison today.”</p><p>It looks like Jason’s involvement is out there for the world to see now. He called me right after Bass this morning. I’m still not convinced there isn’t more to it. His being in the courtroom when Hart was sentenced placed doubts in my mind.</p><p>I push all that aside for now and walk out to the beach. I think about the last couple of months. Beck and I talk often. He and Ruby are still together. He took her out of town back when I was arrested because her ex-boyfriend was still harassing her. But once they returned the ex never showed his face again. I guess Jason did what he said he would.</p><p>Last month I opened a corporation, naming it Plan B. I’m going to buy small struggling magazines, and the first one on my list is Surfers End. I had written a number of freelance articles for them over the past few months and knew they were in trouble. I think I can actually help them put their mark on the world—or at least I hope I can. Either way, I’m excited to try.</p><p>Aerie has kept in touch with me since I met up with her and her boss that day a few months ago. Kimberly, or Kay, as Aerie calls her, quit sometime at the end of April to work at an LA radio station. The offer was one she couldn’t pass up, is all Aerie would say. Fuck me if Kimberly’s not going to be the next Ryan Seacrest.</p><p>Anyway, Aerie needed a freelance writer to help out. With Kay gone, she was absorbing the responsibility of both divisions, and on top of that, so many employees had quit. I said I would help and have actually done a lot work under my pen name—my New York City name—Alex Coven.</p><p>Yesterday she contacted me to see if I could help her with something important . . . of personal interest to her. She needed some research done right away on Damon Wolf’s companies—I jumped on it like a bulldog. I managed to obtain access to Damon’s company, Sheep Dynamics, under the guise of writing an article on his rise to the top. I knew that would get me in. I perused all of Sheep Dynamics subsidiaries’ financials. I found what she was looking for in no time—information on Nick Wilde’s career. The more I learned through my research the more my stomach turned over for the swine that Wolf is, and the more I knew I could help her. I also discovered that Sound Music Magazine was in the red and they were financially vulnerable. So I decided to take it. Why not? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The night air is warm as I cross the bridge to the beach. I make my way to the rocks and sit. Raising my head, I watch the momentary sonic boom that fills the sky. I think about my life and the choices I’ve made, finally understanding I can’t change any of them. I can only move forward, which I’m trying to do each and every day. Streaks of color cross the sky and I lean back on the rocks to absorb the sounds of the fireworks in the darkness of the beach. I watch the sky come alive with so many vibrant hues, starbursts of color, and showers of light. And as ribbons of smoke blur the sky, I can say for the first time in a long time, my path is clear.</p><p>Epilogue</p><p>Disappear</p><p>October</p> <p>3 months later</p><p>The one year anniversary of my mother’s death</p><p>Tonight journalists from all around the state came to see me receive the award I was originally supposed to get three years ago. At first I intended to turn it down when they approached me again. I reminded myself that it was a time I’d tried hard to forget. But then after I thought about it I decided, yes, I wanted it. I felt I had earned it.</p><p>News of the drug cartel’s trial coming to a successful end had swept the airwaves. Senior management at the Los Angeles Times took notice and decided they wanted to honor me with the honor I was supposed to receive, but never did, almost four years ago—California’s Journalist of the Year Award. They wanted to, and I quote, “Highlight my brilliant work in underground crime investigation.”</p><p>I was nervous as hell. When I wrote my speech, I’d decided I would approach the award with levity. I’d tucked a not ecard into my back pocket. But as I moved to take the podium, I decided to change gears and approach it with honesty instead. I strode across the stage and took a deep calming breath.</p> <p>The podium stood shorter than I imagined and as I pulled the microphone toward me, I glanced around the room. Food was being ushered out to the tables and I knew my time was limited. So with sweaty palms I gripped the wooden sides of the stand and spoke. But before long my attention was taken elsewhere and I paused. Out of the corner of my eye I spotted her as soon as she entered the room. Her red hair flowed past her shoulders and her tight green dress seemed to hug her body in all the right places. I made a mental note that she seemed to wear green a lot. It looked good on her. I realized I’d stalled and I cleared my throat.</p><p>I glanced across the many faces in the room and found hers again immediately. Her mouth took on a scowl as she took notice of me watching her and then she quickly turned away. But it didn’t take long until I scanned the room for her again. She was pointing to a number of trays on a table and directing where she wanted them. The more I watched her, the faster my heart beat. Words spilled mindlessly from my mouth as my ears rung from the thudding echoing in them. When I shifted my gaze to follow her movement, I noticed some of the women dabbing their napkins under their eyes. I could only assume my heartfelt words had moved them. But when I saw S’belle pick up one of the black linen napkins and do the same, the thought that she’d listened to my speech for some reason rather than tuning me out—it took my breath away. I finished my speech.</p><p>My last words came out softly as the syllables caught in my throat. Applause reverberated through the grand ballroom and I closed my eyes for a few moments absorbing everything. When I opened them a grin crossed my lips. But my smile wasn’t for the strangers who surrounded me or even for my friends before me. It was for the red-headed girl in the back of the room whose gaze kept flickering over mine.</p><p>As I exited the stage holding tightly to the award in my hand, I took the steps one at a time and kept my eyes focused on her. With each step I took I couldn’t help but notice that her eyes were locked on mine . . . green to blue. In them I saw a reflection from so long ago, of a memory I’ve never forgotten. And although I wasn’t available to her the first time we met, and I wasn’t in the right mind space the second time we met, I think everything is different now. And I can honestly say . . . the future has never looked brighter.</p>  </body></html>"]