["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>Joseph Anderson sat back in his comfortable chair, enjoying the taste of his hundred year old scotch and the warmth from the softly crackling fire. He was full of great food and thinking back over the wonderful Thanksgiving he just finished with his family.</p><p>He loved when they all gathered together. He was happy to have so many new grandkids running around the house. His youngest granddaughter Emily had just turned a year old a week ago. There was so much to celebrate.</p><p>He just wished his youngest son Mark would find the right woman. Joseph’s breath rushed out in frustration. He’d found a few suitable matches for his boy but Mark was a sneaky one and had avoided both.</p> <p>Joseph guessed Mark had figured him out. He wasn’t one to brag but he had been successful in finding love matches for both Lucas and Alex. Their wives were amazing women and even better, they’d brought him grandchildren to fill the old, empty hallways of his home that had seemed so barren for such a long time.</p><p>Well Mark underestimated him because he would surely find a bride who could lasso his son. He knew his kid was stubborn but Joseph himself was even more stubborn. He couldn’t rest until Mark was happily settled down.</p><p>Joseph suddenly heard a stampede coming down the hall. He smiled, knowing the sound of those shoes.</p><p>“Grandpa hurry up, grandma says it’s time for desert,” Jasmine, his oldest grandchild said, a little breathlessly. She must’ve run the whole way. There was nothing like dessert to motivate a child.</p><p>Joseph put his drink down and held his arms out for his beautiful granddaughter to jump into. “Well, I certainly wouldn’t want to keep you waiting to have some pie,” he said as he carried her from the room.</p> <p>“I know,” Jasmine said, as if the matter was of the upmost importance.</p><p>“Let’s go find everyone and eat some pumpkin pie,” he said to Jasmine before tickling her tummy.</p><p>“Uncle Mark said you were probably up to no good,” Jasmine said in a whisper, acting like she was divulging a huge secret.</p><p>“Your Uncle Mark was right. I’m planning on him giving you some more cousins but let’s keep that between you and me.”</p><p>“I promise,” Jasmine said. She then held her hand up to pinky swear on the matter.</p><p>Joseph hugged her tightly before heading off towards the rest of his family. He was truly a blessed man.</p> <p>Chapter One</p><p>Emily sat nervously in the small diner. She was trying really hard not to fidget with anything but her nerves were stretched beyond the breaking point. She was waiting for Joseph Anderson to meet her for an interview.</p><p>She’d spotted the Help Wanted ad in the paper a week ago and called right away. There must have been a lot of applications because she’d paced by the phone, praying he would call her and had already given up by the time it finally did.</p><p>He asked her to meet him at the small café in the tiny town not far from Seattle. She preferred the country life so much better than a big city, in which you could get lost in. She was down to her last few dollars and had to be out of her motel in two more days. She couldn’t blow the job interview.</p><p>It was for a live in housekeeper and cook. Room and board were included. If she got the position, maybe she could finally give her son some stability. She cringed as she thought about the past year and all her son had gone through.</p><p>Her husband had died in a horrific automobile accident. She’d already been planning on leaving him since he couldn’t remain faithful to her but the accident had really shaken her up. His parents had far too much money and they’d decided they would be more suited to raise her son than she was.</p><p>She’d figured they were just grieving the loss of their only son and would back off, until she’d been served with custody papers. When she’d read the name of the judge on the papers, she’d decided it was time to go on a long vacation.</p><p>Her ex father-in-law was golfing buddies with the judge and she knew if she stepped into the courtroom she would walk out without her son. She’d taken all her savings and been on the run ever since. She simply didn’t have the kind of money it took to fight her son’s grandparents.</p> <p>Her deceased husband had left her nothing, which she was okay with as she didn’t want anything from him. He’d been wrapped around his parent’s fingers and they took everything from her when he passed, even her car. She’d had to buy a beater upper and it was on its last legs.</p><p>She knew her son would’ve been provided for far greater than anything she could ever give him but that meant nothing if he wasn’t given love. She’d ended up in the little town of Fall City in Washington when her car had finally refused to go any further and she’d been staying at the small motel in town ever since.</p><p>She’d been trying desperately to find any kind of work when she'd spotted the ad in the paper for a cook and housekeeper. It was perfect. She could work full-time and still be with her son. She hadn’t exactly told her potential boss she had a son but if he hired her he certainly couldn’t fire her because of her son. That would be discrimination.</p><p>Emily glanced nervously over at the booth across from her where her son was sitting down. She’d bribed him with a huge ice-cream and promises of a movie at the drive in later if he sat quietly while she had the interview.</p><p>Luckily for her, the waitress had given him a coloring book and crayons so Emily could count on him being busy for hours. She loved how her son was so artistic. He had a real gift of drawing, amazing her often.</p><p>The chime of the door opening drew her attention away from her son. There was a very tall, older man walking through the entrance, with twinkling blue eyes and what seemed like a permanent smile on his face.</p><p>“Good afternoon Joseph,” the waitress said to the gentleman.</p><p>Emily’s stomach tightened with nervousness. This was the man she was supposed to meet with. She glanced at her son, making sure he was occupied, then stood and walked over to Joseph.</p><p>He spotted her and smiled. “You must be Emily,” he said in the most booming voice she’d ever heard. She nodded at him and then took the hand he was offering.</p><p>“Did you already order something to eat?” he asked.</p><p>“No.”</p><p>“Well let’s order some breakfast. We can chat while we’re waiting for our food. Molly makes the best omelets in the entire state,” he said as the waitress approached.</p><p>“Can I have some eggs mom?”</p><p>Emily was paralyzed for a moment. She hadn’t wanted her prospective employer to know about her son until she had the job but she figured it was inevitable.</p><p>“I didn’t know you had a son,” Joseph said with the same twinkle in his eyes.</p><p>“I was going to tell you today,” she said guiltily.</p><p>“Of course you can have some eggs. I see your coloring stuff over there. Why don’t you grab your stuff and then come sit here with us,” Joseph said. Emily could tell he was a man used to being in control. She sighed inwardly and went with the flow.</p><p>Joseph ended up ordering for all of them. Emily began totaling the bill in her head, hoping the job came through because breakfast was going to eat up most of her cash.</p><p>“What is your name boy?” Joseph asked kindly.</p><p>“My name is Trevor. I’m five years old,” he stated proudly.</p><p>“Five is a great age,” Joseph said. Trevor beamed at him and Emily could see a little bit of hero worship forming.</p><p>Joseph turned his attention back to Emily. “We only spoke briefly on the phone, so let me tell you a bit about the position.”</p><p>“That would be great,” Emily said. She really didn’t care what the position entailed. She would scrub out toilets or muck out stalls, if it gave her son some stability.</p><p>“The position is for a housekeeper and cook, though more of a cook. There’s a cleaning service that comes in regularly. The place is quite large and frankly too much for one person to handle. Can you cook well?” He asked.</p><p>“Yes, Mr. Anderson. I don’t like to brag but I have a passion for cooking and love to try new recipes. I can make about anything and can easily cook for one, or for a hundred,” she said enthusiastically. She really loved the art of cooking a complicated meal. It had been far too long since she had cooked a meal in a nice kitchen. Being on the run wasn’t pleasant for Trevor or her.</p><p>“The position provides room and board, as well as a weekly paycheck. Are you willing to relocate?” he asked and then glanced at her son.</p><p>“We love this area so much and have been hoping to find a job so we can stay here. Trevor’s a really great kid and you won’t be able to tell he’s around,” she promised him.</p><p>Joseph laughed aloud. “I have three boys of my own and a ranch would be a great place for a kid. If no one knows he’s around then that’s the time to worry about what he’s up to,” he said.</p><p>Emily didn’t know how to respond to his statement. She wasn’t sure if he was saying her son would be welcomed or not. She remained quiet and hoped the man liked children.</p><p>“Trevor, do you like animals?” Joseph asked.</p><p>Trevor tilted his head, as he did when he was thinking deeply about something. “I really want a puppy,” he finally said.</p><p>“Well of course you do, all boys should have a lot of puppies,” Joseph said. He spoke as if it was a matter of life and death.</p><p>Emily was sure there would be some dogs running around the ranch. Her son would be in heaven. They continued to chat as they ate the breakfast. Emily was surprised how good the food was. She was a bit of a food critic and the omelet was light and fluffy and the vegetables were cooked to perfection. She would have to thank the cook before leaving.</p><p>Breakfast lasted for about an hour. Emily was starting to worry a bit. This was unlike any other job interview she’d ever had before. He wasn’t asking her any of the usual questions prospective employers ask. He was far more concerned about her personal life.</p><p>She was surprised when she found herself telling Joseph about her late husband and the automobile accident. She had to stop herself before she brought up the whole custody situation. The man seemed to inspire a person to tell him their life story.</p><p>“Emily, I think you’re a perfect fit for the position. When can you start work?” Joseph asked her.</p><p>“I could start right away,” she replied with real joy.</p><p>“Well, there’s no time like the present. Let me take care of this bill and you can follow me out to the ranch,” he said as he stood up.</p><p>“I can pay for mine,” she said. She wasn’t used to taking handouts, even when she had nothing.</p><p>“Nonsense my dear, this was my interview. Why don’t you gather up your son and meet me out front,” he said. She could tell there would be no arguing, so did as he asked.</p><p>“Where are you parked?” he asked her when he stepped out front.</p><p>“I’m staying at the motel down the street but my car isn’t working right now. I need to get it in the shop.” She was really embarrassed to admit the obvious.</p><p>“Well then, hop in my car and we’ll swing by your motel so you can gather your belongings and get checked out. I’m happy to give you a ride to the ranch. Is your car at the shop here in town?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not yet. It’s still at the hotel,” she quietly replied.</p><p>“That’s no problem. We’ll have it towed there. The guys here in town do excellent work and they can have it delivered when it’s all done.”</p><p>“Thank you,” she replied. She was grateful to have found the ad in the paper. She really didn’t care what the job entailed. She was excited to have a place to stay and her first few paychecks would pay for her car. Life would start getting back to normal for her and Trevor, again.</p><p>Emily didn’t take long getting checked out of the motel. She didn’t have many personal items. She’d packed clothing and some of Trevor’s favorite toys and books but not much more. She’d been in a hurry to leave and she knew possessions could easily be replaced but her son couldn’t.</p> <p>They were soon off and heading up a winding road, away from the small town. “The ranch house is not too far from town. It’s most definitely beautiful country out here,” Joseph said.</p><p>“I agree. I can’t believe I’ve never been out to this area,” she responded.</p><p>“Where are you originally from?” he asked her.</p><p>Emily didn’t know whether to tell him the truth or not but she knew if she started building a huge story around herself it would be difficult to keep it up. She decided it would be best to stick with the truth as much as possible.</p><p>“We’re from the LA area. We got sick of the crowds and pollution and decided to drive north until we found somewhere we couldn’t leave. It turned out Fall City became that place,” she said.</p> <p>“You have great taste, my dear,” he responded.</p><p>Trevor started asking his usual myriad of questions and Joseph happily answered them. Emily sat back and enjoyed the drive in the comfortable sedan.</p><p>They turned off the road and crossed under a huge sign, which read Three Sons Ranch. The driveway was flanked on either side by huge oak trees seeming to be hundreds of years old.</p><p>She couldn’t see anything through the trees and her anticipation grew.</p><p>“My Great, Great Grandfather built this ranch over a hundred years ago, with not a penny in his pocket. He loved the land and knew he could make something out of it. It’s been passed down through the years. My beautiful wife, Katherine and I have chosen to live in the city but Mark has always been a country boy so it belongs to him now. His brothers come up and help out whenever they want to get away but no one loves it like Mark,” Joseph told her.</p><p>Emily was shocked to find Joseph wasn’t going to be her employer. “You don’t live here? I’m going to be working for your son?” she asked.</p> <p>“Yes, you’ll be working for Mark. He had to go to Montana for some ranch business and won’t be back until next week. He asked me to take care of the employment situation for him. Don’t you worry though. There are plenty of staff so you won’t be alone up here. All our employees are trustworthy and good people. You and your son will be more than safe,” he reassured her, misunderstanding her fear.</p><p>She wasn’t worried about her safety. She was worried her boss wasn’t going to like having a five year old boy running around his ranch. She would have to make sure Trevor stayed out of Mark’s way and behaved really well. She figured they would be in some bunkhouse anyway and never run into the boss.</p><p>Emily lost her breath as they rounded a corner and the ranch house came into view. It was magnificent. She thought she’d seen wealth before, with everything her ex in-laws had but it was nothing compared to what was in front of her.</p><p>The home was three stories high and seemed to stretch out forever. It was beautiful and not at all what she’d expected. When Joseph had said a ranch house, she’d envisioned a great little eighteen hundreds farm house with a wrap-around porch. It definitely had a wrap-around porch but it was huge. There was a second story balcony as well, with several different French doors allowing access to it.</p><p>“Wow, is this a hotel? Is there a swimming pool?” Trevor asked excitedly, as they all stepped from the vehicle.</p><p>Joseph chuckled. “No, it’s the main house Trevor. You and your mom will be living here and yes, there’s a pool you can use anytime you want but only if there’s an adult there to watch.”</p><p>“Okay,” Trevor said and started running for the massive front doors.</p><p>“Trevor wait for us, please,” Emily yelled after him.</p> <p>He stopped immediately and turned towards his mom, although he was practically dancing in place, barely able to control his excitement.</p><p>The door opened as they started up the stairs. “Hi Mr. Anderson,” the older gentleman said.</p><p>“Hello Edward. How are you doing today?” Joseph asked.</p><p>“I can’t complain,” the man answered.</p><p>“Emily this is Edward. He does a little bit of everything here and Edward this is Emily, the new cook. This strapping young man is her son Trevor. They will be staying in the East Wing. Can you show them to their rooms so they can get settled in?” Joseph asked. Emily missed the wink Joseph gave to Edward and the answering smile he gave back.</p><p>“It’s great to meet you, Emily and Trevor. Follow me, I’m sure you are anxious to get settled in,” Edward said.</p><p>“It’s really nice to meet you too, that sounds great,” Emily responded.</p><p>“Where are the dogs?” Trevor asked.</p><p>“After you get settled, I’ll take you out back and you can meet Sassy. She had puppies a couple weeks ago and I’m sure they’d love to meet you,” Joseph said.</p><p>“Come on mom, hurry,” Trevor said, grabbing her hand.</p><p>Emily laughed at the excitement shining in Trevor’s eyes. She hoped her new boss was a good man because showing this to her son and then having it taken away from him would be far too cruel.</p><p>“I’m coming,” she responded.</p><p>“I’ll meet you downstairs in the den,” Joseph said before heading off down a long hallway.</p><p>“This place is huge,” Emily said as they followed Edward up a large staircase and down an even longer hallway.</p><p>“You’ll get used to it in no time,” he responded with a kind smile.</p><p>Emily wasn’t so sure but nodded at him anyway. Everywhere she looked there were priceless portraits and antiques. It was all very overwhelming.</p><p>“I know you weren’t expecting two people, so Trevor and I can share a room. It’s really no problem,” she told him.</p><p>“Oh there’s no need for that. There are plenty of empty rooms in this old place just waiting to be filled up. Mark’s granddad built this place originally and Mark updated it by adding more square footage. He wanted plenty of room for his family to visit often. The Andersons’ value family and friends above all else,” Edward said.</p><p>“Here’s your room young man,” he said and opened the door. Trevor squealed, while he ran inside and jumped on the huge bed. The room was bigger than her old living room and dining room combined. “We didn’t know we were going to have a child here, so we will furnish it better for you over the next couple of weeks,” Edward said.</p><p>“There’s no need to do anything extra. This room is beyond fine,” Emily said, awestruck.</p><p>“Your room is right across the hallway,” Edward said and opened the door for her. She actually gasped. It was even bigger than Trevor’s room. There was a magnificent four poster bed centered in the room and a huge window with a comfortable looking window seat. She would never want to leave.</p><p>“You have a private bath through that door there. We’ll make sure it’s stocked up within the hour. Your closet is through the door over there. After you get settled, come downstairs and take the hallway Joseph took.” He turned and left before Emily realized she hadn’t even thanked him.</p><p>“Wow Mom, your room is even bigger than mine. Ooh you have a seat on your window,” Trevor exclaimed, as he came bounding into her room and headed straight for the window. “Oh! Look at all the horses,” he continued on.</p><p>Emily walked over to the window and stared at the picture perfect scene before her. Her bedroom view was the back of the property and a pasture with at least a hundred horses grazing.</p><p>“Look Mom, you can go outside right through here,” Trevor opened the French doors she hadn’t even noticed and stepped outside before she could even gather her thoughts.</p><p>“Trevor be careful,” she said and rushed after him. She breathed a sigh of relief when she noted the railing around the porch. Her son was safe. The porch wrapped around the entire back of the house. She saw another set of doors and wondered where they led but didn’t want to be nosey. It was probably another guest room or a hallway.</p><p>“Let’s unpack our suitcases and then head back downstairs. We don’t want to keep Mr. Anderson waiting on us,” she finally said.</p><p>“Yeah, then I can see the puppies,” Trevor said, before running back into the room and across the hall to his own room.</p><p>She quickly put her few things away and then headed over to Trevor’s room, where he was cramming his clothes into the dresser. She liked to let him do things on his own but knew she would have to redo the clothes later.</p><p>Emily collected Trevor and they began the journey back down the stairs and followed the hallway towards the sound of voices. She heard a loud laugh and stepped through a doorway into an inviting room. A warm fire blazed in the fireplace and Joseph was sitting on a comfortable looking sofa.</p><p>Emily was surprised by the room. It was set up far more for comfort than as a showpiece. She noticed a similar theme around the area of the house she’d seen so far. Expensive artifacts, displayed behind glass decorated the house and yet there were simple touches making it look homey and inviting. Fresh flowers were placed throughout and the furniture was comfortable.</p><p>“There you are. Did you get settled in?” Joseph asked, as he spotted them.</p><p>“Yes we did, thank you.”</p><p>“Can we see the puppies now?” Trevor asked.</p><p>“Trevor wait until Mr. Anderson offers,” Emily admonished him.</p><p>“It’s perfectly okay Emily. I understand Trevor is excited. Let’s go,” he said and led Trevor from the room.</p><p>Emily followed them down the hallway into the kitchen. She stopped and looked around in complete rapture. It was the most heavenly kitchen she’d ever stepped foot into. There was every known gadget she could imagine. She completely forgot about the puppies as she wandered around the massive kitchen, looking in the cupboards and the fully stocked industry sized refrigerator.</p><p>She realized what she was doing and looked up guiltily at Edward, who was smiling from the doorway. “I’m so sorry, I shouldn’t have started getting into things,” she said to him.</p><p>“This is your area; I’m more than pleased to see you’re happy with the accommodations. On average you’ll be cooking for about twenty men a day, five days a week. It can get a bit overwhelming,” he said.</p><p>“This kitchen is a dream come true and I love cooking for large crowds. Please tell me they like to try new things and not just beans and ham,” she begged.</p><p>Edward laughed out loud. “I think if you’re doing the cooking, the men would eat worms.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re far to flattering,” she said with a smile. Emily could tell she and Edward were going to be great friends.</p><p>“Why don’t you spend as much time as you want in here and get used to it. Your son is in puppy heaven right now and will be perfectly fine,” he said and then slipped out the door.</p><p>Emily walked over to the large patio door and spotted her son and Joseph sitting on the covered porch, with six black puppies crawling all over the both of them. Trevor threw his head back and laughed with pure joy as one of the puppies stretched out across his body and licked him right across the face.</p><p>She knew her son was in good hands. She headed back to the kitchen and became familiar with the location of everything she would be using. Taking inventory of what food was there, she found paper and pen and began making up a menu for the next couple days. She couldn’t wait to start preparing a meal.</p> <p>Emily looked up as her son and Joseph came back into the room and then noticed the clock. She hadn’t realized over an hour had already passed. She felt terrible she hadn’t checked on Trevor the whole time. She couldn’t believe how secure she was already feeling in the new place.</p><p>“What do you think about the kitchen?” Joseph asked her.</p><p>“Oh, it’s absolutely perfect. I can’t wait to get started on dinner.”</p><p>“You don’t have to start tonight you know. You can wait until tomorrow.”</p><p>“I don’t mind starting tonight at all. I honestly love to cook and this kitchen is more equipped than a five star restaurant. My hands are itching to get started.”</p> <p>“Only if you insist. I’m sure the guys would much rather have a home cooked meal than the microwave dinners they were going to eat,” Joseph said.</p><p>“What time do they normally eat?”</p><p>“In the summertime, around seven and in the winter, five. We really only have two seasons on a ranch,” he said.</p><p>“I better get started then.” She went over to the fridge to grab some things. “What time should I have breakfast ready?”</p><p>“The guys like to usually come in around nine for breakfast. They’ve already been up and around a few hours by then and are pretty hungry,” he stated.</p><p>“That sounds perfect.”</p> <p>“Do you mind if I take Trevor to look at the horses in the barn?” Joseph asked her.</p><p>“You really don’t have to do that, Mr. Anderson. He can hang out in here with me and color,” she told him, not wanting her son to be a burden.</p><p>“He’s no problem, Emily. I enjoy hanging out with the lad and no boy wants to hang around the kitchen until the food is all done. Come on Trevor, you can pick your favorite horse to ride. The boys love training young ones. We have to let the men know when dinner is ready anyway,” Joseph said. He led Trevor out of the room, before Emily had a chance to protest any further.</p><p>She knew Joseph wasn’t the type of guy who was told ‘no’ too often. She figured if he got frustrated with her son, he’d bring him back in. She started humming to herself as she began several large pots of chicken and dumplings with fresh bread.</p><p>Mark was in an unbelievably bad mood as he returned to his hotel room, which was unusual for the normally happy go lucky guy. Anyone who knew him knew he was far more likely to crack a joke than ever raise his voice.</p><p>He threw his cowboy hat onto the bed and stared at the blinking light on his phone indicating he had a message. His business deal fell through since the guy he’d been speaking to over the last several months had neglected to tell him the ten thousand head of cattle he was trying to sell were on the brink of death.</p><p>One of the few things Mark couldn’t tolerate was animal abuse. He could understand one guy punching another but to abuse an animal was uncalled for. A man didn’t abuse an animal, or ever hurt a woman. Those were pretty basic. When he dealt with scum like the guy he’d dealt with that evening, it took everything in him not to revert back to his teenage years and whoop the guy one.</p><p>He poured himself a drink and let the warmth spread down his throat to help calm his nerves. He then finally listened to his voicemail.</p> <p>“Great news son, I found you a new cook. She’s absolutely perfect. She made dinner for the crew tonight and I think the men gained a few pounds. By the time they had nibbled every last crumb from her apple cobbler, we almost had to have a crane brought in to lift them from the table. Call me back when you get in,” his father’s overly loud voice came across the phone.</p><p>“Good deal. One less thing I have to worry about,” Mark said aloud to himself. He sat down to return his father’s call.</p><p>“About time you called back,” Joseph’s voice boomed over the line.</p><p>“I’m great and how are you, Dad?”</p><p>“Yeah, yeah how are you and so on,” Joseph joked back.</p><p>Mark really loved his father. He loved his entire family, including his sister-in-laws and beautiful nephews and nieces. His family had grown over the last few years and he was starting to feel a bit of loneliness, watching the clear love between his brothers and their wives. He would never admit that to his matchmaking father though.</p><p>“Did you get the cattle?” Joseph asked him.</p><p>“No, the guy turned out to be a real crook,” Mark answered, feeling his anger start to boil up again as he explained the story to his father.</p><p>They talked business a while longer and then Mark told him he needed to get some rest. “I will see you tomorrow. I’m coming home early since there’s no need to stay here any longer,” Mark told him.</p><p>“Good deal son, I’ll drive back out tomorrow. I’ll call the rest of the clan and we can have a family get together. It’s been a few weeks now, which is way too long,” Joseph said with complete seriousness.</p><p>“I agree with you, call the gang and we can have a barbeque. I’ll talk to you tomorrow,” Mark said hanging up the phone. He was already feeling better. There was nothing that made him feel as good as being with his family.</p><p>Chapter Two</p><p>“Can you make some side dishes for the family barbeque tonight? They are bringing everything else,” Edward said to Emily when she came downstairs.</p><p>“Of course,” Emily answered. She was incredibly nervous. Her boss was going to be home that night and not only him but his entire family. She really hoped she didn’t lose her job once Mark found out his new cook had a son.</p><p>She made the crew of men breakfast and lunch and then spent most of the day in the kitchen preparing a variety of dishes for the meal later that evening.</p><p>“Mom may I please swim now?” Trevor asked, as he came running into the kitchen, wearing his swim trunks and a hopeful expression on his face.</p><p>“How can I say no to that face?” she replied. “Let me run upstairs and change and then we can swim for a while,”</p><p>The pool was just what she needed to relax her muscles and stressed mind. There was a diving board and floating toys. She played with her son in the shallow end, enjoying his laughter. They were in the middle of a splashing war when Mark stepped out onto the patio.</p><p>He sucked in his breath when he caught sight of his new cook. She was stunning and he found himself trying to control the tightening of his body. He stood in the shadows and watched as she played with the young boy. Her laughter carried over to him, making him want to strip down and join them.</p><p>She climbed from the pool and the water dripped off her barely clad body. She had long dark hair cascading down her curvy body. She definitely had curves in all the right places. His hands itched to explore those curves.</p><p>She finally looked up and her stunning dark eyes noticed him standing there. They rounded in surprise as they both stood there, staring at each other for what felt like hours. Emily finally pulled out of the trance, wrapped the towel around herself and started walking over.</p><p>She took a deep breath and introduced herself. “Hi, I’m Emily and you must be my boss,” she said with a bright smile. She was hoping if she faked her confidence enough he would see past the fact she had a son and allow her to keep the job.</p><p>He was seriously the sexiest man she had ever seen before. He was well over six feet tall and solidly built. He had muscles in all the right places and the tight shirt and fitted jeans hid nothing from her view. He had dark hair, covered by a worn Stetson hat and his sea blue eyes seemed like they didn’t miss anything. She was having a hard time looking away from those mesmerizing eyes.</p><p>He looked her up and down, before finally replying to her. “I’m Mark Anderson. You’re the new cook my Father hired?” he questioned her, although he knew the answer.</p><p>Trevor had noticed the new man and came running out of the pool. “Hi, I’m Trevor. I like your hat,” he said, grinning at the man, while dripping all over his cowboy boots.</p><p>“Trevor Honey, back up a little. You’re dripping water on Mr. Anderson’s boots,” she said, a little horrified. She was trying to blend in and there she was with Trevor dripping all over the poor man.</p><p>Alex bent down so he was eye level with Trevor. “It’s okay Little Man. You can call me Mark. Are you enjoying the pool?” he asked.</p><p>“It’s the biggest and best pool ever and the puppies are so cute and did you know there are horses everywhere and Doug said he’s going to teach me how to ride them and everything,” Trevor stated all in one breathe. He couldn’t contain his excitement.</p><p>Mark laughed at Trevor’s enthusiasm and then ruffled his hair. Emily finally allowed herself to relax. The man seemed to genuinely like children. He was drop dead gorgeous and had a soft side for kids. She didn’t know men like him existed anymore. She started to feel her first stirrings of relief as she realized he most likely wasn’t going to fire her over bringing an extra person into his beautiful home.</p><p>“Maybe you can help me pick which one of the puppies we keep and give it a name,” Mark said.</p><p>Trevor’s face seemed to fall instantly and there were tears in his eyes. “What’s wrong baby?” Emily asked, as she dropped to her knees next to Mark.</p><p>“Why do the puppies have to leave?” he asked Mark, as tears streamed down his face. All Trevor heard was only one puppy would get to stay and he was devastated about it.</p><p>Mark was completely taken aback. If he saw a child or woman crying, all he wanted to do was fix the problem, no matter what it was.</p><p>“We’ll keep all the puppies. There’s plenty of room for them to run around here. You can name them all,” Mark said in a bit of a panic. He would’ve given the kid a handful of hundred dollar bills if it would have made the tears stop.</p><p>“You promise?” Trevor asked, with some skepticism.</p><p>“Scouts honor.”</p><p>“Thank you,” Trevor said as the tears instantly evaporated and he launched himself into Mark’s arms. Mark held him close and felt his heart grow a little larger. He didn’t even notice the water soaking into his clothes.</p><p>Emily had to turn away from the scene before her. She could see herself falling for her boss and wouldn’t allow that to happen. She needed the job and men like Mark didn’t settle down with women like her so there was nothing that could happen between them more than sex and then her employment ending. She almost wished he was a standoffish bully, instead of a sexy cowboy with a soft heart for children. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Trevor let’s head inside. I need to finish getting dinner prepared, so I can’t watch you out here anymore,” she said, turning towards the house.</p><p>“Ah Mom, I want to swim some more, please,” he begged her. She had such a soft spot for her son and she hated to tell him no but she really needed to finish her cooking.</p><p>“I’ll bring you out to swim tomorrow but I really need to finish dinner.”</p><p>“I was planning on taking a swim. I’ll keep an eye on him,” Mark said. “Hang with your mom in the kitchen for a few minutes while I run upstairs to change clothes,” he finished and then jogged up the stairs, not waiting for a reply from Emily.</p> <p>She figured Mark was like his father and not used to being told no. She wasn’t going to argue with him. She had a talk with Trevor and told him to be on his best behavior.</p><p>Emily enjoyed herself in the kitchen while listening to the sounds of her son’s laughter through the open door. Before she knew it, everything was done so she headed upstairs to clean up. She checked on Trevor, who was more than content to be splashing around with Mark so allowed herself a luxuriously long bubble bath. She laid her head back against the tub, sighing out loud. She couldn’t believe how lucky she was to have found such a great job with a kind boss who was also good to her son.</p><p>An hour later Emily was surprised by the sheer number of people who kept pouring into the house and out to the backyard. There had to be over a hundred of them milling around. Everyone was smiling and laughter could be heard above the sound of the country music playing in the background.</p><p>The grills were lit and the sweet smell of good meat being barbequed made her mouth water. She’d been so busy preparing food all day she’d forgotten to eat anything herself. She hadn’t been sure if she should join the party but Edward had told her staff was always invited.</p><p>“You must be Emily, the new cook?” asked a sexy dark haired man. Emily had been observing all the people around her and hadn’t noticed the couple walk over to her. They could have both graced the cover of GQ Magazine. She was a bit intimidated by them.</p> <p>“Yes I am,” she finally managed to reply.</p><p>“It’s great to meet you Emily. I’m Amy and this obnoxious man here is Lucas, Mark’s older brother,” she said pleasantly.</p><p>“It’s really nice to meet you,” Emily replied shyly.</p><p>“Don’t let this crowd overwhelm you too much, they are all amazing people. My first time around them nearly scared me to death and now I can’t imagine how miserable my life would be without every member of this family,” she said. As Amy was talking, she looked up at her husband and gave him a tender look of love. Emily was unsure if they were done talking and she should walk away and leave them alone.</p><p>“Oh would you guys quit with the gazing thing, you are obviously making poor Emily here uncomfortable,” another extremely sexy man broke into the conversation, saving Emily.</p><p>“Whatever Alex, you can barely be ten feet away from poor Jessica,” Lucas teased his brother.</p> <p>“Well when you’re right, I guess you’re right,” Alex said. “Hi I’m the middle brother Alex and my incredibly sexy wife is getting the kids all settled but will be over in a few minutes. I have to tell you Emily, you’re far hotter than the last cook,” he added with a wink.</p><p>Emily could feel her face turn a deep shade of red. She hated how her emotions were so easy to read. She didn’t know how to reply to Alex’s comment, so decided to not say anything.</p><p>“You boys just never grow up now, do you?” another voice said, which had Emily turning towards another very attractive woman, who was wrapping her arm in Alex’s. “Never mind them; they love to get a reaction out of a pretty lady. When they met poor Amy for the first time she got proposed to by all three brothers,” she said, with a glint in her eyes.</p><p>“By the way I’m Jessica and obviously married to this rogue here,” she said, indicating Alex. “They are all talk and no action though,” she teased her husband.</p><p>“Oh really, I take that as a challenge,” Alex said and then proceeded to dip Jessica low to the ground. She let out a giggle, sounding like a teenage girl, until his lips met hers and then it was obvious she’d forgotten anyone else was around.</p><p>“Um... you two want to go on upstairs or do you want to continue to embarrass my new cook?” Mark asked, while strolling up to the growing group.</p><p>Alex slowly lifted his head, only to glare at Mark. “I would much prefer to kick the crap out of you but that can wait until later,” he finally said and punched his brother in the arm. To Emily the punch looked hard enough to knock a normal man to the ground but Mark just laughed and asked his brother if that was all he had.</p><p>“You boys go help with the grilling. We’re going to sneak into the dessert,” Amy said and then put one arm through Emily and the other through Jessica and dragged them off towards the dessert table.</p> <p>Emily had to hold back tears. She was overwhelmed at being included so easily with the obviously loving family. She’d never really had girlfriends before and hoped she would be around long enough to become great friends with the two women, as they seemed like people she would definitely want to know.</p><p>Mark stood with his two older brothers and couldn’t take his eyes off of Emily as she walked away. The way her hips were swaying in the short summer dress was enough to actually make him drool. He could picture his hands sneaking up under the dress to discover what she was wearing underneath the floral print.</p><p>As he stood there, a wisp of wind picked up the hem of the dress, showing him more of her incredibly shapely thighs. He held his breath, as he wished for a larger gust to take the dress up a little bit higher. He felt his pants get tighter and grimaced. He missed the look that passed between his two brothers. If he would’ve seen it, maybe he could’ve been more prepared.</p><p>“Your new cook is sure hot,” Lucas said casually.</p><p>“Yeah if I were single, I would hire her in a heartbeat, whether she could cook or not,” Alex added.</p><p>“I haven’t really noticed,” Mark lied to them both.</p><p>“So you aren’t interested in her?” Lucas questioned him.</p><p>“Of course I’m not. She’s an employee and we will keep it professional,” he said. He was unsure if he was trying to lie to them or himself. He wasn’t a randy teenager anymore and he could control himself.</p><p>“Well in that case I saw Don over there eyeing her. I think I’ll try some matchmaking,” Lucas said slyly.</p><p>“Like hell you will,” Mark exclaimed. He then seemed to gather himself together a bit and added, “I don’t want employees’ to be having romances, because when things go bad, then it makes life around them miserable and one or both of them will quit. I’d have to do the whole hiring thing over again.” He felt he’d made a pretty good save from his outburst.</p><p>“I do see your point Mark but I know this great single guy at the office. Just the other day he was asking me if I knew any single women. I think they would make a good match,” Alex said and winked at Lucas.</p><p>Both brothers could practically see the steam rising out of Mark’s ears. They were really enjoying themselves at their brother’s expense, which was a typical thing.</p><p>“Can you please leave my cook alone?” Mark almost yelled. Several heads turned towards the brothers. None of them saw the sly look on Joseph’s face, standing within hearing distance, next to Edward.</p><p>“So it looks like your matchmaking is working once again, you sly old man,” Edward said.</p><p>“Why Edward, I have no idea what you are talking about,” Joseph said with a serious face.</p><p>“You forget how well I know you, sir. I worked for you for far too many years before coming to work for your son, to not know when you’re up to something. Besides, since when does the cook have the bedroom right next door to Mark?” Edward asked, calling Joseph’s bluff.</p><p>“Well, talk a little quieter. If that boy knows I’m matchmaking, he will run the other way and even worse, if Katherine hears about it I will never hear the end of it,” Joseph said, while looking around guiltily.</p><p>“If you weren’t so busy meddling, you wouldn’t have anything to be worried about,” Edward said. “I do have to commend you on your taste, though. Emily’s a fresh breath of air and little Trevor is full of energy. It’s nice to see a pretty lady and a young lad in the house.”</p><p>Joseph puffed his chest up a little from the praise. He did have great taste, if he did say so himself. He looked over at Amy and Jessica, as if to prove his point. He’d done matchmaking with his first two boys and look how well that had turned out.</p><p>“Grampa, grampa I have a new friend,” came the insistent voice of his eldest granddaughter Jasmine. She was pulling on his pant leg, trying to get his undivided attention.</p><p>“I can see that. Are you playing nicely?” he asked his mischievous granddaughter.</p><p>“I love him grandpa. We’re going to get married,” she stated in the utmost seriousness.</p><p>Joseph had to laugh at the look on Trevor’s face. Even at five years old the word marriage scared a male.</p><p>“Why don’t you gather your cousins and we’ll have some dinner so afterwards we can make s’mores?” he asked her.</p><p>Jasmine was instantly diverted and grabbed Trevor’s hand as she raced off to find her siblings and cousins. Joseph had so much pride when he looked out at the yard full of friends and family.</p><p>Emily was looking at the nearly empty table in awe. She’d never believed all the food that had filled its space could possibly been eaten but she’d been proven wrong. She’d made enough food to feed an army and on top of that, everyone who’d attended brought at least one dish and it was all gone. There were just a few little bits and pieces lying around.</p><p>She guessed hard working ranchers needed to refuel their energy. She was actually very pleased with how much praise people had given her over her dishes. It made her feel good to have people appreciating her cooking skills.</p><p>Trevor was in the house with the rest of the kids, listening to Joseph read them stories. After story time they were all going to camp out in the huge den and watch movies. Jessica’s nanny Julia had offered to stay with them, in case any of them woke up for some reason.</p><p>Emily was so happy the Anderson family members were all treating her son as if he was one of them. She’d already heard him refer to Jacob as his favorite cousin ever. Little Jasmine took offense to that statement. Emily could tell she liked being the favorite but in a good way. None of the kids seemed to be spoiled. They all just seemed well loved and confident.</p><p>“Hey Emily, we need another person, come change with us and play some water volleyball,” Jessica demanded, as she grabbed her arm and started leading her upstairs to change clothing.</p><p>Emily was a bit uncomfortable prancing around in her swimsuit in front of a bunch of strangers but it sounded like so much fun and she really didn’t want to disappoint Jessica, so she decided to get over her fears.</p><p>They quickly changed and ran back down the stairs. The guys were already in the water, hitting the ball back and forth and dunking each other in the process. Mark jumped out of the water to spike the ball over the net and Emily forgot to breathe for a few moments. The man was unbelievable in nothing but a pair of swim trunks. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The water was cascading down his muscled chest and arms. He was so dark, from all the time he spent outside and Mark was far more fit than any guy who spent hours in the gym. His hair was a little on the longer side and she found herself wanting to run her fingers through the wet strands. The waistband of his shorts were riding low, showing her the trail of hair that led past his navel. She noticed where her eyes had strayed and instantly looked away from him, praying no one else had been watching her reaction to her boss.</p><p>“Hey, you guys aren’t allowed to start without us,” Amy scolded the boys. She ran over and jumped off the side of the pool, making a huge splash with a perfectly executed cannonball.</p><p>“That’s called cheating when you try and blind your opponent,” Lucas said, before grabbing her up in a searing kiss. Emily could swear she saw steam rising up off the water as the two of them embraced.</p><p>“Hey I don’t mind scratching this whole game and heading in, if you guys are too busy to play,” Alex said to Lucas and Amy, before he turned and leered at his curvy wife in her tiny bikini.</p> <p>“No chance,” Jessica replied. She then grabbed Emily’s hand and pulled her into the pool with her.</p><p>Emily came out of the water coughing up water. Suddenly there was a hand pounding on her back. “Are you okay?” Mark asked her, standing far too close for her hormonal body. The feel of his hand on her bare skin was extremely pleasant.</p><p>“I’m fine, I just wasn’t expecting that and forgot to plug my nose,” she coughed out.</p><p>“I’m so sorry,” Jessica said with real concern.</p><p>“I’m fine, I promise. Let’s play,” Emily said. She really didn’t like to be the center of attention in any setting, let alone when she was in a bikini in front of a very virile man, scratch that, several virile men.</p> <p>There were some of the ranch hands and their girlfriends playing against the siblings and their spouses. It was a couple palooza and Emily was a bit uncomfortable when she realized she was Mark’s partner. She hoped he didn’t think she was trying to win him over.</p><p>Emily soon forgot about her concerns and lost herself in the game. The brothers were competitive but a blast to be with as well. They made sure to sneak in several kisses with their wives and were constantly cracking jokes or laughing about something.</p><p>The ball was coming directly towards Emily and she made a dive to save it before it landed on the water. She wasn’t looking where she was going and suddenly slammed into the rock hard chest of Mark. His arms automatically encircled her to keep her from falling. She looked up to thank him and their eyes locked onto each other.</p><p>She couldn’t pull away from him, no matter how much her brain was telling her to laugh and thank him and then let go. He had the most mesmerizing blue eyes she’d ever seen. She automatically started swaying towards him, forgetting anyone else was near them.</p><p>Mark bent his head down and hungrily took her lips and pulled her tightly against him. His arms wrapped around her bare waist and he pushed her against his now bulging erection. Suddenly a splash came over the top of both their heads, making Emily choke a little bit. Mark jerked back, about to kill someone, when he noticed all eyes around the pool were on him and Emily. He looked back at her face and saw the dawning horror in her eyes.</p><p>He could practically read her thoughts. He’d barely met the woman but her face was an open book for anyone who wanted to read it. Her already flushed cheeks became a becoming shade of dark red and she scooted back from him, like he had the plague or something.</p> <p>Mark was trying to figure out what to say to possibly make the situation better, when his brother decided to help him. “Geese Mark, can you quit manhandling the poor girl. I know the water is a bit chilly but there are other ways to warm up, like actually playing the game.”</p><p>“Look who’s talking,” Mark spouted back and then all the men started a huge water fight. The women ran for cover and climbed out of the pool. Emily was mortified and was trying to think of the best way to escape, without it looking like an actual escape.</p><p>“Seriously, I know you’re a bit embarrassed by the kiss but these guys aren’t easy to resist. Just know each of us have been there and no one’s thinking anything, except that’s one lucky girl,” Amy said to her.</p><p>Emily gave her a crooked smile of thanks and decided maybe Amy was right and no one really paid that much attention. Besides, they’d been in the water and pretty much covered up. She wrapped a towel tightly around herself and decided to forget about the whole thing.</p><p>“I thought you said you weren’t interested,” Alex teased Mark.</p><p>“I didn’t mean for that to happen. Hell, I don’t know what happened,” Mark said, a little dazedly.</p><p>“I guess you would take exception to me setting her up then?” Alex added.</p><p>Mark just growled at him before walking away. Lucas and Alex smiled at each other. They both understood the pain their brother was going through. They’d fought their attraction to their wives, although looking back; they realized what idiots they had been. Those women were the best things that ever happened to them.</p> <p>Everyone got changed from their wet clothes and most of the guests started heading out. Mark stoked the fire and the family sat together, telling stories until the early hours of the morning. Emily tried to excuse herself, to let the family have time together but Jessica and Amy had decided she was their new best friend and insisted she stay.</p><p>She didn’t fight them too hard. She was having an amazing time herself and didn’t want to go up to her room all alone.</p><p>“I need to get some sleep,” Lucas finally said and then waggled his eyes at Amy. Emily could feel the slight blush returning to her face. She knew he really wanted to get his wife alone. Jessica and Alex soon followed them and suddenly Emily found herself alone with Mark.</p><p>The fire had died down to mainly embers and it was barely light enough to see his shadowed face. “I better get some sleep,” she said and forced a yawn out. She knew she wasn’t going to be able to sleep for a while, being so wound up.</p><p>Mark placed his hand on her arm when she tried to get up. She sat there, not knowing what to say.</p><p>“Emily I’m really sorry about what happened in the pool. Seriously, I don’t usually grab women and make out with them in front of my whole family,” he said while running his hand through his messed up hair.</p><p>Her hand was itching to smooth his hair back into place but she managed to tuck both hands under her thighs. “It’s no problem. It’s not like I wasn’t a willing participant but I’m sorry too. Honestly I don’t usually do that myself,” she said, still a bit horrified with herself.</p><p>“Okay we’re both sorry,” he said and then smiled. The man should be registered as a lethal weapon so women could be forewarned.</p><p>“So we’re friends right?” he asked her.</p><p>“Yes, of course,” she replied, finally feeling the pressure in her chest start to ease.</p><p>“Good,” he said. “Want to see something really cool?” he asked.</p><p>“Sure.”</p><p>He grabbed her hand and started leading her towards the barn. She figured he would let go but he kept holding on and she didn’t have the will power to pull away. She’d noticed his entire family were all touchy feely people, so she told herself not to read too much into the gesture.</p><p>“My favorite mare is about to give birth. There’s nothing more miraculous and beautiful as that,” he told her excitedly.</p><p>Emily found herself eager to see the new foal. They got to the barn and heard some pained noises. Emily looked up in concern, “is she okay?”</p><p>“She’s fine. I’ve been checking on her the past couple of days and the vet has been looking over her. Everything is on schedule and the foal is in the right position. Giving birth still hurts though.”</p><p>“Yes it does,” she agreed emphatically.</p><p>“I guess you would know more than me,” he said with a sheepish shrug.</p><p>Emily laughed and then quieted as they approached the stall with the laboring horse. She was beautiful, with a dark brown, shining coat and a bulging belly.</p><p>“How you doing girl?” Mark spoke softly to the mare.</p><p>She seemed to role her eyes at the clueless man, or that’s what Emily liked to believe. She remembered when she was giving birth and the doctors had asked how she was doing. She’d wanted to punch them as hard as she could and then ask them the same thing. Guys didn’t have a clue.</p><p>“You’re a pretty girl,” Emily softly said to her, while gently rubbing her nose. The mare neighed a bit at her as if to say ‘at least you understand’ and then went back to ignoring them both.</p><p>Emily had no idea how much time they spent there but when the sky started to lighten, the mare finally pushed the new foal out of her body, along with some help from Mark. She looked at him, sitting there on the floor, with the gangly baby in his lap and felt her heart pounding. He was covered in dirt and blood and still irresistible.</p><p>Once the whole ordeal was over, she realized how exhausted she was. The sun was coming over the hill and she figured she’d better try to get a few hours of sleep.</p><p>“Thanks for sharing this with me. It really was amazing,” she whispered to him. She didn’t want to startle the new horse, so she was talking and moving quietly.</p><p>“Thanks for keeping me company. I didn’t mean to keep you up all night.”</p><p>“It was well worth it,” she responded honestly.</p><p>Mark was busy making sure the new horse was healthy, so Emily slipped out of the barn and headed back towards the house. She lay down and her last thoughts before finally succumbing to exhaustion were about her new employer. She knew she was going to have a problem keeping her distance.</p><p>Chapter Three</p><p>Emily slowly rolled over and realized it was one in the afternoon. She jerked upright in bed, trying to wipe the sleep from her eyes. She couldn’t believe how long she’d slept. She was always up early to make sure her son was okay.</p><p>She took a two minute shower, dressed and ran down the stairs. She was incredibly worried about her son. He may have gotten scared when he woke up and his mom wasn’t there.</p><p>She came running around the corner, into the dining room, where she found her son sitting with all the other kids, Mark and his siblings. All the adults looked like they hadn’t been up too long.</p><p>“Mom did you know a baby horse was born this morning and as soon as we are done eating our lunch Mark is going to take me down to see her,” he practically squealed at her.</p><p>“I did know. I got to watch her be born. I’m so sorry I wasn’t awake with you this morning,” she apologized to her son.</p><p>“It’s okay mom, I didn’t know you weren’t awake. We’ve been playing all day long,” Trevor told her.</p><p>Emily was relieved he’d been okay that morning but a little saddened he didn’t seem to need her so much, the older he got. She covered her disappointed look by going over to the table and grabbing some sandwich fixings.</p><p>“I’m sorry I didn’t make you breakfast,” she said, feeling guilty she hadn’t prepared a meal. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You can’t work seven days a week Emily, I think Edward already told you on the weekends everyone fends for themselves,” Mark said, before stuffing his mouth full, like he was on his last meal.</p><p>“I know that normally but with your family here, they probably would’ve enjoyed a nice breakfast,” she defended.</p><p>“If the rest of your food is anything like some of those salads and desserts you made last night, we would’ve most certainly enjoyed your breakfast. It’s nice to have a make your own sandwich lunch, plus I found a couple bowls of your salad that somehow didn’t make it out to the food table last night,” Amy said, looking pointedly at Mark.</p><p>“Hey I love Potato Salad and I wanted some saved for today,” Mark defended.</p> <p>Emily knew she’d brought that bowl out, so Mark must have snuck it back in. It actually made her feel pretty good he liked her food. He obviously did, as he was piling the stuff into his mouth.</p><p>“Seriously, I snuck into some early last night and then had to sneak it away. I haven’t had this good of homemade salad since...well hell since never. No offense to Mom,” he added as an afterthought.</p><p>“Well you know the way to a man’s heart is through his stomach...among other things,” Alex said with a wink.</p><p>“Amen,” Mark added, without even pausing in his chewing.</p><p>Emily must be getting used to his family, because she was blushing far less already. She knew the brothers were just ribbing each other and they didn’t mean any harm. She simply had to get used to the way they talked to each other if she wanted to be comfortable around them.</p> <p>After everyone ate, the adults gathered up the younger kids, while the older ones clung onto Mark as he led them all to the barn. Emily was amazed when she saw the newborn foal up and wobbling around in the open space of the barn.</p><p>“She was just born, I can’t believe she’s already walking,” she gasped.</p><p>The three brothers laughed. “Animals are much more independent than human babies,” Lucas said.</p><p>“Hey speak for yourself, I’ve always been one of a kind and able to do things faster than the average person,” Mark added.</p><p>“I don’t think so, we all know I’ve always been the smartest one,” Alex said as he thumped his chest.</p><p>“You’re all abnormally strong, sexy and very, very smart,” Jessica said to appease the men.</p> <p>“You’re all those things and so much more,” Alex said before kissing her.</p><p>“Okay I simply haven’t gotten enough sleep to deal with the two of you playing kissy face,” Mark grumbled.</p><p>“Considering I found you down here, asleep on the hay, gives you a little bit of leeway for grumpiness,” Alex conceded. “Of course a romp in the hay would’ve put you in a much better mood than having fallen asleep on it,” he added with a wink at Emily.</p><p>She pretended to not hear that last statement or notice the wink. “Isn’t the baby horse sweet?” she asked Trevor.</p><p>“Mom, horses aren’t sweet, they’re cool,” he grumbled, trying to sound like a big kid.</p><p>“Well I’m sorry about that,” she said with a twinkle in her eye. She loved how much her son was growing up. Some days it broke her heart to think he would be a man before she knew it but at the same time he had so much personality and such a great heart. She wanted to keep him close to her forever.</p><p>“She’s a great looking girl,” Lucas said.</p><p>“Agreed brother, another fine addition to the ranch,” Alex chimed in.</p> <p>“Thanks guys,” Mark said.</p><p>“We have to get going but can come back next weekend,” Lucas said.</p><p>“Ah dad, I want to play with Trevor some more,” Jasmine cried.</p><p>“I promise we’ll come back for you to play with Trevor but Mom has an appointment she can’t miss, Honey,” Lucas said sadly. He hated to see his little girl upset about anything. He was a very easy pushover for his daughter. The business men he’d dealt with throughout the years would have been completely amazed if they could see how easily his daughter was able to get her way from him.</p><p>“Okay daddy,” she said on a wobbly voice. She then threw her arms around Trevor, “I will miss you so much,” she sniffled. He was about to tell her they could stay a while longer, when Amy gave him her mother look. His wife was the only other person able to get away with anything and he wasn’t going to argue with her.</p><p>Trevor hugged her back, before noticing what he was doing. “See ya soon,” he mumbled. Emily could tell he was trying to be tuff in front of Mark but he was close to tears himself.</p><p>“Hey little guy, after all these other kids get out of here, you and I can take a horse ride up the trails,” Mark said, as he ruffled Trevor’s hair.</p><p>“Really?” Trevor’s sadness instantly evaporated, as he looked hopefully up at Mark.</p><p>“Really.” Mark stated. “We can even invite your Mom if she’d like to come,” he added.</p><p>Trevor looked over his mother, as if he was really thinking about it, before finally saying, “I guess she could come with us. She does make good picnic stuff.”</p><p>“Thanks,” Emily said. “I know that was such a hard choice for you,” she added with a smile.</p><p>“We have to take off too, see you really soon. We will go have a spa day,” Jessica said, before grabbing Emily in a hug.</p><p>“That sounds really great,” Emily said, even though she didn’t know how long it would take for her to be able to afford that. If Jessica invited her too soon, she would have to make up some excuse to put it off.</p><p>After everyone left, the three of them set off for their ride. Emily rode an older mare that was tame and easy to handle. She’d never ridden before but found she really liked it. Trevor sat on the horse with Mark and looked way adorable in his arms. She was really going to have to fight her attraction to him with every ounce of willpower she had. It wasn’t going to be easy.</p><p>The day ended about as perfect as it had begun. Mark was witty and charming and had unending patience for her son. She told herself repeatedly they would just be friends and she figured if she lied to herself enough she would start to believe it.</p><p>One day started to run into the next. Mark made no more new moves on her and kept things completely friendly. He was amazing with Trevor and spent hours each day with him. Trevor was even starting to ride on his own.</p><p>Every time she looked at her young man with Mark, it reinforced her decision to fight her attraction she had for her boss. She had to keep it professional, because if she started a relationship with the man, when it ended she and Trevor would have to move.</p><p>It wasn’t like she really had to worry about a relationship though, as Mark hadn’t shown any more personal interest in her. Trevor and her had been at the ranch for a full month and Mark hadn’t touched her once since that steamy night, which seemed like so long ago.</p><p>What irritated her was the fact she wanted him to touch her. She was actually grateful he wasn’t putting the moves on her because she didn’t think she was strong enough to tell him no.</p><p>His family came up a couple of more times and she was becoming good friends with Jessica and Amy. She would be so upset if she somehow lost all she’d gained since accepting the cooking job.</p><p>She finally had a real spa day scheduled the coming up weekend. She’d never done anything like that and it sounded like heaven. To have real girlfriends and a day she was allowed to pamper herself seemed unreal. Most kids got to do things like that during high school but she’d been far too poor to frivolously spend money on girlie things.</p><p>With her resolve set, Emily pulled her gaze from the window where Mark and Trevor were rolling around on the lawn with the ever-growing puppies. She focused on cooking, which always eased her tensions away.</p><p>Emily couldn’t sleep. She laid there for about an hour, tossing and turning, until she finally started feeling claustrophobic. She got up and stepped out onto her balcony. She actually spent a lot of time there in the evenings, enjoying the cooler evening air.</p><p>She started to feel a bit better, as she leaned against the railing and breathed in the fresh country air. She laughed a little bit out loud, as she thought about her weird phobias. She didn’t understand why she got so claustrophobic at times.</p><p>“What are you doing out here?” Mark asked.</p><p>Emily jumped at least a foot off the ground, as she spun around to see Mark standing a few feet away from her, wearing nothing but a pair of boxer shorts, which showed far more than they hid.</p><p>“I...I j...just needed some air,” she finally managed to stutter.</p><p>Mark couldn’t take his eyes off of her. He was looking at her from head to toe and taking his sweet time about it. It was a full moon that night and she was wearing an almost see through short nighty, which was showing him far more of her body than even the bikini had shown. The moonlight seemed to turn the white gown iridescent.</p><p>He could see the dusky outline of her nipples, which hardened to peaks as his eyes roved over them. He could see the outline of her legs all the way up to her most intimate of places. Before he even knew what he was doing, he started walking towards her.</p><p>He was slow and steady as he took those few paces that separated them. Her eyes never wavered from his as he made his approach. It was like they were both in some inevitable trance. He reached his hand up and brushed back the escaped tendrils of her hair, which were floating in her face.</p><p>She couldn’t contain the sigh that escaped her lips, when his fingers made contact with her burning flesh. She started leaning toward him in an unspoken invitation. That was all the prompting he needed.</p><p>He wrapped one arm around her back, pulling her tightly up against his nearly naked body. The other hand wrapped around the back of her neck, tilting her head up, giving him access to her full lips.</p><p>He gave her a moment more to turn him away. It would kill him if she denied him but he would never force a woman. When the moan escaped her moistened lips, he finally brought them both the satisfaction they wanted and brought his lips down to hers.</p><p>She had thought the kiss would be urgent, like it was in the pool but was surprised when his lips barely brushed hers. She moaned again and raised her hands to grip his neck, pulling him closer to her. She wanted to feel him pressed against her in every single way. She had no time for regrets, she wanted him and she needed him to fully kiss her and take the ache away.</p><p>He finally gave them what they both wanted and crushed her lips underneath his. He tilted his head, opening her mouth wider, so he could slip his tongue inside. Their tongues mated, as their hips ground together, mimicking lovemaking.</p><p>He let out a moan as she pushed her softness into his engorged manhood. His hand ran down the round perfection of her backside, until it found the hem of her nightgown. Then he slowly inched his way up her silken thighs, until he was gripping her, pulling her even tighter against him.</p><p>He let out another long moan, as he realized she wore nothing under the wisp of a nightgown. The only thing that separated him from entering her right then was the extremely thin cotton of his boxer shorts.</p><p>He suddenly swung his arm under her thighs, picking her up in his arms. He never broke contact from the passionate kiss they were sharing. He carried her the few feet to his balcony door and walked over to his bed, where he laid her down. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stripped off his boxers and then her robe in two quick motions and lay next to her on the soft comforter. His hands were roaming all over her body. He couldn’t touch her in enough places. He found every pleasure point on her and almost ended things before they had even begun, as she cried out her pleasure.</p><p>He finally tore his lips from hers, so he could trail them down her smooth throat. He licked and nipped at her erratically beating pulse and then made his way down to her generous breasts. She was so curvy and beautiful. Her dusky pink nipples were beaded and shining in the moonlight. He licked around their hardened peaks, before drawing first one and then the other deep into his mouth.</p><p>Emily’s body jerked off the bed as he continued to lick and suck his way slowly down her torso. He circled her slight belly button and then moved lower. As his hands kneaded her thighs and his teeth grazed her skin, she cried out more and more. Then he gently soothed her flesh with the flick of his tongue.</p><p>When he finally spread her legs apart and kissed her intimately in her most sacred place, she begged him to love her. “Please Mark, please I need you inside me,” she cried out. With one more flick of his masterful tongue her entire body jerked up and sweet heavenly release washed throughout her.</p> <p>She couldn’t have even lifted her head; the pleasure was so great and encompassing. He slowly kissed his way back up her body and flicked her still tender nipples, making stirrings start to occur in her core again.</p><p>She didn’t understand how she could possibly need or want any more after the pleasure she’d just received but as he brought their mouths back together, she could feel the heat stirring inside of her again.</p><p>He lay on top of her, pressing himself into her heat. She could feel him throbbing against her aching opening. She opened up even further so he could finally join their bodies together but he still held back.</p><p>He ran his hands down over her hips and then flicked her aching nub, as his tongue danced with hers. She became fully aroused again and lifted her hips up, begging with her body for him to join them together. She couldn’t believe the whimpers she heard were coming from her own throat.</p><p>He slipped his finger inside her, testing her body, seeing if she was ready for him. When he felt she was as ready as he was, he finally stopped the torture and in one swift thrust he was deep inside of her. She cried out in pleasure and wiggled her hips, wanting more.</p> <p>“Give me one minute,” Mark begged her.</p><p>Emily felt a power unlike anything she’d ever felt in her life. She’d made this big, strong man beg her for mercy. It was a euphoric feeling and she wiggled her hips again and smiled as she saw the sweat bead on his forehead.</p><p>He saw her smile and matched it with a wicked one of his own. “You are quite the tease aren’t you?”</p><p>He then started thrusting in and out of her with speed and there was no way she could’ve squeezed any words past her tightened throat. He held her close as he kissed her, simultaneously thrusting in and out of her body. She lost all sense of time, dizzy in the immense feelings building higher and higher inside her.</p><p>He thrust in again and her body convulsed around him, as her pleasure seemed to stretch on and on. With a groan he pushed into her one last time, before he shuddered and then collapsed on top of her. They were both breathing heavily and neither of them seemed to have any energy to move.</p><p>He finally shifted their bodies and pulled her half on top of him and half lying next to him. He was unwilling to let her go. He brought the cover up to keep the chilled night air off her body and closed his eyes, enjoying the feel of her against him.</p> <p>“I should go,” she said sleepily, though she didn’t try and move.</p><p>“Not yet.”</p><p>She didn’t have any energy to argue with him and told herself she would get up in a few moments. She would allow herself to rest her eyes for a minute. They were so heavy and she couldn’t seem to keep them open.</p><p>Emily woke up and stretched her sore muscles. At first she was confused by the stiffness of her body and then the night came back to her like cold water splashed in her face. She sat straight up in the unfamiliar room and looked around.</p><p>Mark wasn’t there, which she was incredibly grateful for. She needed time to gather herself together before she faced him. She’d never before made love to a man she wasn’t in a relationship with. Before Mark, she’d only been with her ex-husband and sex had never been as good as it had been with Mark.</p><p>She’d fallen asleep in his arms, only to be awakened sometime in the night by his roving hands. He had loved her again, giving her more pleasure and then she’d fallen into a dreamless sleep.</p><p>She found her nightgown on the floor, near the bed and slipped it over her head. She then walked to the doors and peaked out at the balcony. No one was out there, or anywhere in the backyard, so she quickly ran to her own bedroom door.</p><p>She hadn’t known Mark’s room was so close to hers. If she would’ve known that sooner she would’ve had an even harder time falling asleep at night. She didn’t think she was going to sleep again with her new knowledge.</p> <p>Emily allowed herself an extra-long shower, trying to ease the achiness of her muscles. She’d used some she didn’t know existed. Even though her body was sore, it was an incredibly satisfying feeling at the same time.</p><p>She allowed herself to smile, as she thought back to the intense pleasure Mark had brought to her. She then pulled herself together and got dressed. She would have to tell him the night was amazing but it couldn’t continue. She really loved working for him and that was far more important than some fling.</p><p>It sounded rational in her mind. She hoped he wouldn’t take it as rejection. She certainly couldn’t tell him it had been the best sex she’d ever had in her life. That wasn’t the way to get him to not want any more of it.</p><p>Emily was feeling more confident as she finally descended the stairs. She walked in and found Trevor and Mark sitting at the kitchen table, each with a large bowl of cereal before them. They both looked up guiltily, as if they’d been caught doing something wrong.</p><p>Emily thought that was strange until she noticed the cereal the two of them were polishing off was Cookie Crisp. She never let her son eat sugary cereal. She always told him she may as well just give him a spoon and let him eat right out of the sugar bowl.</p><p>She was close to scolding Trevor for eating something he knew he wasn’t supposed to but the look on their faces was just too pathetic. She couldn’t contain her smile from slipping through.</p><p>“Don’t get used to eating this,” was all she said. She grabbed a bowl and poured the very little amount left in the box for herself. She was surprised to find it was actually quite good. She wouldn’t admit that to the smug boys staring at her. “I’m only eating this so you two don’t have anymore,” she finally said.</p><p>Mark let a small chuckle escape so she glared at him, then finished her breakfast. He was eating the cereal as fast as he could, like he ate everything. You would have thought the man grew up in an orphanage, the way he ate.</p><p>“Why do you always eat so quickly?” she finally asked, her curiosity getting the better of her.</p><p>“You try growing up with two older brothers and then you would eat fast too.”</p><p>Emily chuckled at the image of Lucas and Alex stealing Mark’s food. He smiled at her and she almost forgot they needed to have a serious conversation later.</p><p>“Mom, don’t forget I’m going to the movie today with Jasmine,” Trevor said, through sips in his chocolate milk.</p><p>“I did forget. Finish up so we can get you dressed. Lucas will be here any time,” she said, while starting to clear away dishes from the table.</p><p>“I’m done,” Trevor said and then dashed up the stairs. He liked nothing more than to spend time with Jasmine, who was his new best friend.</p><p>“Wait for me,” Emily said, as she chased her son up the stairs. She quickly got him ready to go and by the time they came downstairs, she could hear Jasmine calling for him.</p><p>“I’m here Jazzy,” Trevor yelled from the top of the stairs and then jumped on the railing and slid down. Emily stared dumbfounded as her son made the long slide down.</p><p>“Trevor you can’t slide on the rail,” she scolded her son. “Whatever gave you that idea?” she questioned.</p><p>Trevor looked at her guiltily and then shrugged his shoulders. “It’s my fault Emily, I’m sorry. I kind of showed him how to do it,” Mark piped up.</p><p>Emily turned her astonished gaze on Mark. She then threw her hands in the air in defeat. She couldn’t understand men. The banister was beautiful and expensive and they were using it as a slide. She decided to let it go. Sometimes that was the smartest thing to do.</p><p>“There you are,” Jasmine said as they came around the corner. “I missed you,” she grabbed Trevor up in a hug. He hugged her back and they smiled goofy grins at each other. Emily loved how sweet they were together.</p><p>“Are you ready to go?” Lucas asked him.</p><p>“Yes,” Trevor replied with real enthusiasm.</p><p>“Is it okay if he stays the night? We’re going to be done late and they will have a good time,” Lucas asked Emily.</p><p>“If you honestly don’t think it will be a problem.”</p><p>“Are you kidding me? He’s a great kid. I really enjoy him coming over, plus it’s the only time I can get Jasmine to stop talking,” he whispered.</p><p>Emily chuckled and then kissed her son goodbye. She reminded him to listen to Lucas and Amy and to be on his best behavior.</p><p>Lucas took off and suddenly Emily was all alone with Mark. Well, she thought, there was no time like the present to have their conversation.</p><p>“Mark we need to have a talk.”</p><p>“I was afraid you were going to say that.”</p><p>“Last night was magical. It was the greatest night I have ever had.”</p><p>“Well that sounds like a great conversation. I say we end before you add in a but...” he started to say.</p><p>“I wish it were that simple Mark but we both know we can’t let it happen again. Trevor is so happy here and this thing between us won’t last and then everything will fall apart,” she pleaded with him to understand.</p><p>“Why can’t it last?” he asked her.</p><p>“Mark, you’re my boss. You are amazing and your family is incredible and I don’t want to have an affair and then end up with us not liking each other. Can’t we please be thankful we had a great night together and now call it good?” she once again pleaded.</p><p>Mark stared into her eyes for several moments, before letting out a long sigh. “I’m not happy about this and I guarantee you I’ll try and change your mind but if you need me to back off for now then that’s what I’ll do,” he finally conceded.</p><p>“Thank you. Can we please go back to the way things have been?”</p><p>“I need to go work out in the barn for a while,” was his only answer. He walked out the back door and left her feeling a bit rejected.</p><p>If she was doing the right thing, why did she feel so miserably bad about it? Sometimes it would be so much easier to be a child and not have the reservations you developed as you got older. She knew she really was doing the right thing; she just had to convince herself of that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She didn’t see Mark the rest of the day. They both were managing to avoid one another, which was best for them right then.</p><p>Chapter Four</p><p>It took a few weeks but things got back to somewhat of a normal routine. Emily and Mark could be in the same room once again without too much tension and even began some of their earlier teasing.</p><p>Emily was feeling more and more secure. She would still find her eyes drawn to Mark and seemed to always know where he was but she cared far too much about him to risk losing him with a cheap romance.</p> <p>Her body ached each night wanting him badly but she was used to denying herself for the sake of others. In this case she was putting her son’s needs ahead of her own, which made the sacrifice worth it. She at least thought it was worth it, or hoped it was.</p><p>What made the aching even worse was every day she was around Mark she was finding she fell a little bit more in love with him. How could she not love a man who was so gentle with her son and so compassionate to all those around him? He was even a saint when it came to his animals.</p><p>She had yet to find a single flaw. She didn’t understand how he wasn’t already married with ten kids. He would make the perfect father and husband. She dreamed more than once of herself in the role of wife and mother with Mark.</p><p>Emily and Trevor were playing a game of Candy Land in the den when Mark came in. “Mark look, I’m beating my Mom again,” Trevor said as he beamed at his hero.</p><p>“Great job, buddy. Edward just brought in some chocolate cake. If you hurry to the kitchen, you can get some before he puts it away,” he added.</p> <p>“Yeah,” Trevor yelled and took off running down the hallway.</p><p>“You know you’re spoiling him,” Emily admonished but the smile she gave him took away any sting.</p><p>“I really love having him here. He brings so much light to the house.”</p><p>“Thank you,” Emily said, as tears stung her eyes. She was a sucker for anyone who loved her son.</p><p>“Emily we need to talk about Trevor’s school. The year starts in a few weeks,” Mark started out carefully. He was prepared for a minor battle with the stubborn mother.</p><p>“There’s a great school here. I was going to go talk to them next week,” she said, thinking the discussion would be over.</p> <p>“Lucas told me all about the school Jasmine’s enrolled in and it’s not much further from this area. He would have a lot of opportunities there you can’t get from a regular school and he’d get to go with Jasmine,” he told her.</p><p>“Mark there’s no way I can afford to place Trevor in a private school.”</p><p>“You wouldn’t have to pay anything. It would be a part of your employment.”</p><p>“There’s no way I can accept that, Mark. You already sneak things to Trevor all the time, like the dirt bike you got him last week. He will be fine going to the local school here,” she added stubbornly. She already owed Mark far too much and didn’t want to be indebted to him any further.</p><p>Mark was prepared for her argument. He’d already discovered she wasn’t a greedy person. As a matter of fact, she was the complete opposite. It was downright frustrating trying to give her or her son anything.</p><p>“Just let me explain myself before you start getting all defensive and completely close the idea off,” he began.</p><p>“Fine. Go ahead and explain yourself but I’m telling you the answer will still be no. You’re wasting your time,” she said, while crossing her arms.</p><p>“You are the most infuriating woman. I also said not to get all defensive,” he almost shouted.</p> <p>They both stared, neither willing to back down. Emily finally folded and shrugged her shoulders. “Go ahead,” she mumbled.</p><p>“Thank you. As I was saying, the school is top of the line and if Trevor went there he would be provided far more opportunities than a public school could give him. The public school system has had far too many budget cuts. Heck, he wouldn’t even be able to learn another language or participate in any good clubs. Those are things he really needs to secure his future.”</p><p>“But the money...” she began.</p><p>Mark held his hand up. “You can talk to many different employees of mine personally and of the company’s. We have added benefits where we pay for college tuitions and extended leaves. We believe in taking care of our own. I paid for Edward’s kids to go to college and they didn’t fight me on it, so please put Trevor above your pride and allow him to take this opportunity,” he said. He knew that last bit was a low blow but he also knew she was willing to make just about any sacrifice for her son, even if that sacrifice was accepting something from another person.</p><p>Emily sat, fighting with herself. She knew what Mark was saying was right. She knew she really could be hurting her son’s future success by not letting him go to the better school but she really didn’t want to be in any more debt to Mark.</p><p>“I can understand your points and you are right,” she finally conceded.</p><p>Mark looked a little bit smug at her words. She held her hand up to let him know she wasn’t finished speaking. The smile dropped away.</p><p>“I said I can understand your point, however if you expect me to compromise, you need to be willing to, also,” she said, staring him in the eye, to make sure she was getting her point across.</p><p>“What kind of compromise?” he asked suspiciously.</p><p>“If Trevor is going to go to a fancy school, then I insist on contributing to it. We already have no expense here and I receive a generous salary. I’m sure the tuition is a lot, so you’ll cut my salary in half.” She thought that would make an acceptable solution for them both.</p><p>“No way,” Mark told her, with no room for compromise on his part.</p><p>“Then it’s no deal,” Emily added, just as unbending.</p><p>They both stared again at one another, trying to break the other person. When Emily refused to back down, Mark finally held up his hands in defeat.</p><p>“Okay how about your salary gets cut by one hundred a week, not half,” he said. When she started to shake her head he cut her off.</p><p>“Listen, if he’s going to a private school there are extra things you are going to need. You’ll need your salary,” he tried to reason with her.</p><p>Emily hadn’t even thought about an added expense. Mark wasn’t going to tell her about the extra fees for field trips and such. He would just make sure the school contacted him directly, because if she knew any of that she would insist on breaking herself to pay them. He didn’t understand her; the money wouldn’t even be missed by him. He was frustrated with her and at the same time impressed with her independence.</p><p>“I guess we could try it out,” she reluctantly conceded. “But Mark, if the kids there make him feel bad about himself because he’s not rich like they are, he’s not staying. I would rather he have a public school education than for him to ever feel like he isn’t good enough,” she said emphatically.</p><p>“Emily he’ll fit right in. He already has a best friend he’ll be going to school with and he’s outgoing and social. He’ll be friends with every kid in the school,” he told her.</p><p>“Okay, when does registration start?” she asked.</p><p>“We can head up there tomorrow. We’ll take the chopper over to my dad’s and then drive in. I have been promising Trevor for a while to take him on a ride.”</p><p>“I think it would be just fine to drive,” she said nervously. She was terrified of heights and not a fan of flying in anything, let alone a tiny helicopter, which only remained in the air because of a couple of steel bars spinning around.</p><p>“Don’t be such a chicken. You’ll love the view and it’s only about a fifteen minute ride but we’ll probably take the scenic route,” he added with a wink.</p><p>Emily shuddered and resigned herself to having to do things she’d never done before.</p><p>“Come on, Mom. It’s time to go,” Trevor said as he paced around her bedroom while she finished the last touches of her make-up.</p><p>“I’m hurrying,” she lied.</p><p>“Mark said you were dragging your feet cause you were afraid to go in the helicopter,” Trevor said, like he couldn’t believe that were possibly true.</p><p>“Well Mark doesn’t know everything.”</p><p>“Yes he does, Mom,” Trevor said, as if she had lost her mind. “He’s the smartest guy in the whole wide world.”</p><p>Emily cleared her throat to keep from laughing and followed her son out of the room. She really was terrified to go on the chopper ride but there was no way she was admitting that to either her son or to Mark. They would both tease her mercilessly over it.</p><p>“All ready?” Mark questioned when they reached the bottom of the stairs. Emily glared at him, as he tried to wipe the wide grin from his face. When he started to cough, she wasn’t fooled into thinking he wasn’t laughing at her.</p><p>“I just think it’s silly to fly there when it’s not that long of a car ride,” Emily had to say. She knew it was a lost battle but had to try one more time to not get into that helicopter.</p><p>“Ah Mom, you’re just no fun.”</p><p>“Don’t worry Trevor. She'll have a great time once we're up in the air. I’m an excellent pilot,” Mark told him.</p><p>“You’re flying it?” Emily gasped in horror.</p><p>“Do you see any other pilots around here?” Mark answered with his own question.</p><p>“I just assumed you had one come in,” Emily said. She hoped he had, anyway. She knew he could ride a horse better than anyone but she wasn’t so sure he was capable of keeping them up in the air.</p><p>“Don’t worry; I have plenty of hours in. You’re in safe hands,” he said with a wink. She wasn’t reassured one bit but it was too late to back out now. Maybe she could fake an illness. One look at her son’s face and she knew she was going to have to get the ride over with.</p><p>“Let’s go, daylight is wasting,” Mark called. Trevor was on his heels as they headed out the back door and toward the helicopter pad.</p><p>Emily followed at a much more sedate pace, still dragging her feet. When they got to the helicopter and she saw it up close for the first time, her fear kicked in even greater. She might end up passing out on the ride. Of course if that happened, it would all be over much sooner.</p><p>Mark did a pre-trip on the aircraft and then said everything was ready to go. He helped Trevor inside and got him buckled. Trevor grinned hugely when Mark placed the headphones on his head and explained they could talk back and forth through the built in microphones.</p><p>“Ready?” he asked her when she was still staring in the door.</p><p>“I guess so,” she answered, slowly stepping forward.</p><p>Mark placed his hands on her hips and boosted her inside. Emily felt goose bumps rise as his hands lingered on her for a moment longer than necessary. When he placed her in the seat, their mouths were only a couple of inches apart.</p><p>She nearly fainted at the instant heat flaming in his eyes. He continued to stare at her for a few more moments, before handing her the headset and then shutting her door. She let out the breath she hadn’t even realized she was holding and was surprised by the disappointment she was feeling he hadn’t closed the gap and kissed her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She didn’t have time to feel sorry for herself though, because Mark had started the propellers and she was focused on nothing but her fear. As the helicopter started to rise straight up in the air, she was once again holding her breath. The higher up they got, the more she started sweating.</p><p>She couldn’t believe she’d let them talk her into this. She was thinking about demanding to be put back on solid ground, when they shot out across the countryside.</p><p>“Wow Mark, this is the coolest thing ever,” she heard her son say into the microphone.</p><p>“The first time up is the greatest but it’s still pretty cool even after hundreds of times,” Mark said. She saw him reach over and ruffle Trevor’s hair.</p> <p>“Mom’s just silly. There’s nothing to be scared of,” Trevor said bravely.</p><p>“Careful young man, your Mom can hear us,” Mark said and then looked back at her and winked. She was more horrified he’d looked away from the front window than by anything they were saying.</p><p>“Sorry Mom.”</p><p>“It’s okay, you’re just braver than your Mom,” she replied with pride.</p><p>“That’s okay Mom. Guys are supposed to take care of their special women,” Trevor said in all seriousness.</p> <p>Emily was so proud of her son. He really was growing up fast. He was already a gentleman. She knew there wouldn’t be a lady out there who would ever be good enough for him.</p><p>Emily finally realized while she’d been talking to Trevor her fear had started to dissipate and she was even looking around at the scenery below her. She was shocked to find she was starting to enjoy the thrill of being so high up and yet close enough to see all the buildings and fields.</p><p>There was no way she was going to admit to Mark she was starting to enjoy the ride though. The man was right far too often and she refused to give him yet another victory. She sat back and enjoyed looking out the window and listening to Mark and Trevor talk back and forth.</p><p>Before the ride had barely started, they were making their decent. “Is something wrong?” she asked with concern.</p><p>“We’ve arrived at my dad’s,” Mark said.</p><p>“That really was fast,” she replied.</p> <p>“We’ve been in the air about thirty minutes. I told you I was taking the scenic route,” he said smugly. She glared at the back of his head. He sounded far too smug. Well he could think she enjoyed the ride but she wouldn’t confirm it to him. That comforted her somewhat.</p><p>She looked over the lands as they were approaching and was once again awestruck. The house that sat centered made Mark’s place look small. It seemed like a castle, with its rising towers and brick exterior. She looked around, expecting to see a moat and drawbridge. She found herself giggling at the image. Mark was most certainly a man she could imagine rescuing the princess from a tower.</p><p>When she thought of money before, she pictured her ex in-laws who weren’t good in any shape or form. They used their money to lord over other people and look down on the masses. But they’d be considered poor compared to the Anderson’s.</p><p>They landed smoothly, much to Emily’s relief and Mark turned the chopper off. They all climbed out and headed towards the mansion. Joseph came out to greet them about half-way there.</p><p>“Hi Little Man, did you enjoy the ride?” Joseph asked.</p><p>“It was the funnest thing ever,” Trevor exclaimed.</p><p>“Most fun,” Emily automatically corrected her son.</p><p>“Ah Mom,” Trevor complained. She let it go.</p> <p>“Do you want some breakfast before you head off to your new school?” Joseph asked.</p><p>“Sure,” he said and followed Joseph up to the house, with Emily and Mark right behind them.</p><p>“How did you enjoy the ride?” Joseph asked Emily.</p><p>“It was fine.”</p><p>“She was scared,” Trevor piped in.</p><p>Joseph chuckled, as Emily’s face turned red at her son’s statement. “It’s okay young lady, my son is a bit scary.”</p><p>“Thanks dad,” Mark said with a smile.</p><p>“You and your brothers would upset your mom all the time with your daredevil ways. I don’t think she got a full nights rest all the years you were growing up.”</p><p>“Well who taught us those dangerous things?” Mark asked, with a pointed look.</p><p>“There’s no use in pointing fingers,” he grumbled and then decided to change the subject.</p><p>They had a wonderful breakfast at the house and then headed over to the school to get Trevor registered. Emily was pleasantly surprised by the place. It was large but not overwhelmingly so and the staff was friendly. Not one of them seemed to look down on her or her son. If she would’ve felt any of them judging her or Trevor, she would’ve marched right back out the front doors.</p><p>When they got to Trevor’s classroom, Jasmine came running around the corner. “You’re finally here,” she said and gave Trevor a big hug.</p><p>“I got to fly with Mark.”</p><p>“Oh that’s so fun,” she agreed. They both chatted back and forth, faster than Emily could keep up.</p><p>“Mrs. Parson, this is my cousin Trevor,” Jasmine said and dragged him over to the teacher.</p><p>Emily stopped what she was doing and looked guiltily over at Mark, who hadn’t even seemed to notice anything was wrong. Lucas was chatting with his brother and neither of them made the slightest indication they’d heard anything. She was grateful. She would have to pull Trevor aside later and explain to him Mark was just their boss and they weren’t related to Jasmine. How did you break a young man’s heart though? Maybe it wasn’t that big of a deal but she didn’t want her son to think they were a family and going to live together forever. What would happen to him if they had to move? It would break his heart.</p><p>She would have to think about what she was doing and what was best for her son. She didn’t want to leave but she better make sure Trevor knew Mark was the employer and not a substitute father.</p><p>They visited the school for a few hours and got Trevor signed up and Emily was feeling pretty good about letting him attend. They did have some amazing programs she knew he wouldn’t get from a public school. The field trips alone were spectacular. She’d definitely volunteer to chaperone. She hadn’t been to any of the places they talked about.</p><p>“We are going school shopping now; please tell me you can come with us?” Amy asked her, as they were heading out of the school.</p><p>“I guess that’s up to Mark,” Emily said and looked over at him.</p><p>“Well in that case, it’s a definite yes,” Amy said, as she dragged Emily behind her. “Let’s take our car so we can chat and let the guys do all the driving,” she added enthusiastically.</p><p>Emily had an incredible day. She purchased new clothes and school supplies for Trevor and enjoyed lunch at Chuck E Cheese pizza, watching the guys compete with the kids in the games. She laughed so much that by the end of the day her stomach hurt a bit.</p><p>“I’m so glad the kids are going to the same school. We’ll have to chaperone together so we can see each other all the time,” Amy said, as they were getting ready to leave.</p><p>“I was already thinking I would love to chaperone those field trips. I’ll be more excited to go to the places than Trevor will be,” Emily added shyly.</p><p>“Me too,” Amy exclaimed. “These guys are used to all this fun stuff but I still can’t get enough of the amazing world around me,” she added.</p><p>Emily loved how much she and Amy had in common. It gave her hope to see someone who had so much, be so sweet and genuinely great to be around.</p><p>“I will see you soon,” Emily said and hugged Amy goodbye. She knew if for some reason her employment with Mark ended she and Amy would continue to be friends.</p><p>By the time they got back to the ranch, the sun was starting to set. Trevor was rubbing his eyes and Mark carried him up to his room. Emily quickly got him ready for bed and then barely managed to drag herself to her room. It had been a wonderful day and she felt her life was finally starting to be normal. It was a great feeling.</p><p>“Mom, I’m leaving now,” Trevor said, snapping her out of her daydreaming.</p><p>“Sorry Trevor, I lost track of time,” she apologized. She gave him a big kiss and walked out the front door with him. She watched him climb in the car with Edward. Emily waved and stood watching them drive away until they were out of sight.</p><p>It was Trevor’s second week at his school and he couldn’t wait to get out the door each morning. He loved the place so much and always came home telling her the amazing things he’d done.</p><p>She still felt a little bit guilty over the exorbitant cost of the school’s tuition, so she worked from morning until night, making sure the house was spotless and the meals were incredible.</p><p>She headed inside and finished making breakfast for all the hands. They’d started coming in earlier each day and were usually there about an hour before the actual meal was ready. She loved to talk with them and started preparing some fruit and breads the night before so they had things to munch on while waiting on their hot food.</p><p>“Emily I think I’ve gained ten pounds since you became our cook. Pretty soon I’m not going to be able to button my Wranglers anymore,” one of her favorite ranch hands said. He leaned back in his chair and groaned.</p><p>“I don’t think you could gain a single pound with how hard you work. You need your fuel for the day.”</p><p>“I think I’m in love with you,” John said and gave her an adoring smile.</p><p>“You’re in love with my cooking skills.”</p><p>“Come on Emily, run away with me,” he teased her.</p><p>“John, don’t make me call your Mom. She wouldn’t be happy to hear her eighteen year old son was hitting on an older woman,” she teased.</p><p>“Heck she would tell me how smart I was,” he replied.</p><p>“John don’t make me put you on muck duty all day,” Mark said, as he entered the room. He ruffled John’s hair showing how fond he was of the boy.</p><p>“I’m trying to convince Emily to run away with me. She’s being stubborn though,” John said, with a full blown grin at Mark and then Emily.</p><p>“If anyone tries to convince Emily to run away with them, it would be me,” Mark said in a teasing voice but also with a serious look in his eyes.</p><p>“Okay no more chocolate muffins for you guys in the morning. It makes you all too rowdy. Now go get to work,” Emily said and pushed all the men out of the kitchen. “I will see you at lunch.”</p><p>She watched the men fondly as they made their way towards the barn. She cleaned up the kitchen and started her prep work for their lunch. She loved the huge country kitchen and couldn’t imagine ever getting bored working her magic in it.</p><p>Even more, she loved to cook for people who appreciated her food so much. It wasn’t as fun to prepare meals only for yourself and a toddler.</p><p>She was also well used to the men flirting with her. She knew it was all harmless but it was good for her ego. If any of them flirted a little beyond what she thought was appropriate, she quickly put them in their place and things went back to normal.</p><p>There was a new guy though who Mark had hired a couple of weeks after she’d started who gave her the creeps. He never talked to her but she would find him leering at her every once in a while. She was sure she just had an over exaggerated imagination. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>There would be no way she would say anything to anyone about her fears of the new guy. She was sure he was harmless, like the rest of the men and just trying to make a living.</p><p>The guys returned for lunch in no time. Mark always looked so sexy in his dust covered wranglers and worn out Stetson hat. It took every ounce of willpower not to stare at him, or pull him close.</p><p>“Hey Emily we’re going over to the Three Rivers tonight. There’s this great new singer who’s performing. Do you want to come with us?” one of the hands asked her.</p><p>Emily was pleased to be invited but she was worried about her son. Edward was in the kitchen and seemed to be able to read her mind. “I can keep an eye on the Little Man if you want to get out for a while,” he offered her.</p> <p>“Are you sure?” she asked Edward.</p><p>“I would love to watch him. We’ll make some buttery popcorn and watch the new Disney Movie,” he said.</p><p>“Well in that case I would love to,” she said. She was mentally going through her closet, really excited to have a night out. It had been far too long.</p><p>“I can give you a ride in,” John offered.</p><p>“I will bring Emily,” Mark said, brooking no room for argument from any of the men.</p> <p>“I thought you said you couldn’t make it boss,” John whined a little.</p><p>“I changed my mind,” he stated, before throwing his hat back on and slamming out the back door.</p><p>“What’s gotten under his burr?” John grumbled.</p><p>“I think he’s marking his territory,” one of the other guys said.</p><p>“We’re not a couple. He probably just didn’t want to put any of you out,” Emily defended.</p><p>“Sure,” a couple of the guys chorused together. Everyone suddenly found great interest in their food and no one else said a word as they finished their lunch and then rushed out the door.</p> <p>Emily cleaned up quickly and rushed upstairs to get ready for her evening out. She had the whole afternoon to pamper herself, since everyone was going to eat dinner at the bar. She was actually a little giddy as she took a long bath and spent extra time on her hair, clothes and make-up.</p><p>“Damn girl, you look good. I call the first dance,” her favorite ranch hand, Eric said, as she walked into the smoky bar with Mark, who hadn’t said one word to her on the ride there. He seemed to be angry with her and she couldn’t figure out why.</p><p>“Thank you Eric and yes I would love to dance with you,” she told the man. He wasted no time in abandoning his seat and pulling her out onto the dance floor.</p><p>Emily was having an amazing time. She had no idea how long she’d been dancing, because as soon as one song ended another of the hands grabbed her and she was off doing another two-step. She had not laughed so much in far too many years.</p><p>“It’s my turn to take this lady around the dance floor,” the creepy ranch hand Chris said. He was standing far too close to her and placed his hand on her back. She felt violated by just that little bit of touching.</p><p>She was trapped because she hadn’t turned any of the other guys down but she really didn’t want to dance with him. He didn’t put off good vibes at all. She was getting ready to get through the dance as best as she could.</p><p>“This dance is already taken,” Mark said, as he cut in. Normally Emily would’ve been really irritated with any man who was as high handed as Mark was being but she was so relieved to not have to dance with Chris she gladly accepted his offer.</p><p>Neither Mark nor Emily noticed the look Chris gave them both. He didn’t say a word but his hands clenched tight and if looks really could kill, they both would’ve been dead.</p> <p>“You seem to be having a good time,” Mark said through clenched teeth.</p><p>“I haven’t been out in such a long time. I’m always just Mom, so yes I’m having a really great time. It’s nice to have some adult time,” she said and then actually giggled as he spun her around.</p><p>The giggle stopped instantly when he slammed her body into his, pressing her close. He rubbed his hands from her shoulders, down her lower back and up again. She felt electricity shooting from her stomach, all the way to her toes.</p><p>“If you’d wanted to go out, all you had to do was say something,” he snarled.</p><p>“Mark why are you so upset? This is a fun night and you should be enjoying yourself,” she said to him, completely clueless.</p><p>“How do you expect me to enjoy myself when you’re in the arms of other men? I’ve respected your wishes and haven’t been pursuing you but damn it, I shouldn’t have to watch you in the arms of my crew,” he said, growing louder with each word he spoke.</p><p>He had her pulled so tightly against him she could barely breathe. She didn’t even notice they’d stopped dancing. Luckily the bar was loud and smoky, with a lot of people on the dance floor and no one was paying them any attention.</p><p>Mark finally growled low in his throat and then crushed his lips down to hers. He pushed his tongue up against her bottom lip, demanding entrance and she willingly obliged. She forgot about all the reasons she’d decided being with him was a bad idea and just enjoyed being in his arms again.</p><p>His hands caressed her silk covered thighs, making the fabric draw up inch by inch. He was slowly walking them into a dark corner, where they could have more privacy. She couldn’t even feel the movement of her own two feet. She was focused on nothing but Mark and what he was doing to her body.</p><p>His caressing fingers reached the edge of her dress and were stroking the uncovered top of her thighs. She could feel the heat pooling in her core and she wanted him to relieve the pressure continuing to build there.</p><p>Her hands gripped tightly behind his neck, pulling him even closer. The kiss continued until she needed so much more from him than just his lips on hers. She needed him to join them together again. She needed it more than she needed air.</p><p>His lips left hers, allowing a gasp of air to enter, only to be rushed back out when he ran his tongue along the length of her throat. He nipped at her tender flesh and she moaned in pleasure. “Please Mark...” she begged.</p><p>“Uh boss...” a voice interrupted them.</p><p>Emily slowly became aware of her surroundings again and realized they were practically making love up against a dirty wall in a bar. She was horrified at her own behavior. She wasn’t ever that brazen kind of girl. She ducked her head into Mark’s neck, hoping to avoid anyone’s eyes.</p><p>“What do you want?” Mark snapped at the unfortunate guy.</p><p>“Um...the bouncer over there said you guys need to break it up,” the poor guy was so embarrassed he was stuttering.</p><p>Mark finally seemed to realize where he was and what he’d been doing and backed up a little bit from Emily. “Thanks,” he mumbled to the kid. He then grabbed her hand and started pulling her towards the doorway.</p><p>“We are getting out of here now,” he stated.</p><p>Emily had no desire to argue with him. She’d been fighting her own desires for too long and it was time she got some satisfaction. “I’m ready to leave,” she purred.</p><p>Mark walked out of the bar, never letting go of her hand. When they reached his truck he picked her up and sat her in the seat, slipping in between her opened legs. He pulled her close and kissed her deeply again. His hand slipped between their bodies and he caressed her hardened nipple.</p><p>She heard a moan and was startled to realize the sound had come from her. “Please take me home,” she begged him.</p><p>He kissed her one more time and then pushed her legs into the truck. He jumped in the driver’s door and pulled out of the parking lot like the place was about to explode. The drive back to the ranch took half the time it had taken to get to town. The silence was just as noticeable on the return trip but for far different reasons.</p><p>They screeched to a stop a few feet from the front steps and he leapt from the truck. “Please don’t change your mind,” he pleaded, as he pulled open her door. Emily didn’t answer him with words. She smiled seductively at him and then reached down and rubbed her hand over the bulging evidence of his desire, as she leaned into him and ran her tongue over his neck.</p><p>“This is going to end far too quickly if you keep that up,” he croaked. He then scooped her up into his arms and ran into the house and up the stairs. Emily didn’t even know if he got the front door closed.</p><p>He made it to the bedroom and then took her hard and fast against the door. Neither of them could hold out long enough to reach the bed.</p><p>Emily woke to find Mark staring down at her, while rubbing her from the top of her thigh, to her neck and back down. She could feel the desire start to pool again and didn’t see how it was possible.</p><p>After their explosive love making, they’d passed out in each other’s arms on top of the covers. When the cool night air woke them, he’d made slow sweet love to her again, before they fell asleep, too exhausted to even move.</p><p>She glanced at the clock and was shocked to see it was almost noon. She’d slept for nine hours straight. She never did that. She groaned a bit as Mark’s hand caressed her tender breast and then teased the nipple.</p><p>“Mark we need to talk...” she began.</p><p>“No,” he said simply.</p><p>“Mark listen...”</p><p>“No this time you listen,” he said, before pinning her hands above her head with one of his hands, as the other one continued caressing her body.</p><p>She was really trying to reason with him but he was making it impossible. The feeling of being trapped under him and having him in complete control was extremely erotic. The hand that was touching her was causing her to lose all thoughts of stopping.</p><p>“You will not run away this time. I understand all your reasons for wanting to keep things distant but when two people have the kind of chemistry we have together, it’s a crime not to pursue it. If it works out great, if it doesn’t, I promise I will take care of you,” he said in between kissing her and nipping at her in places she didn’t even know were sensitive until he touched them.</p><p>“You’re making me sound like a mistress,” she gasped at him. She was trying to remember that was a bad thing.</p><p>“No, I want you as my girlfriend, my companion, my lover. I would never try and buy you,” he said with complete seriousness.</p><p>As he paused in his administering, to show her how serious he was she couldn’t think of a single argument against what he was saying. She wanted him so much and she really didn’t see how they could go backwards at that point anyway.</p><p>“But what about Trevor?” she said in a last ditch effort to reason with him.</p><p>“I love Trevor,” he said matter-of-factly.</p><p>That was all it took for Emily to cave into the man. She couldn’t fight him or the relationship anymore. He was still looking at her, waiting to see what she would say.</p><p>“Please kiss me,” she finally pled. Her simple words were all it took to break the damn. They didn’t leave the room for a few more hours.</p><p>Emily felt so guilty when she finally made it downstairs. Edward gave her a wink when she stepped through the kitchen doors, which made her face turn a deep shade of red.</p><p>“How was your night?” he asked knowingly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It was great to get out,” she mumbled. “I’m sorry I slept so long. Thank you for looking after Trevor.”</p><p>“Trevor is a great kid,” he replied. Trevor was sitting at the table coloring and hadn’t even noticed his mother’s absence.</p><p>“How you doing, Love?” she asked him, as she walked over to kiss him on the head.</p><p>“Good, Mom. I got to stay up till after midnight,” he said with awe.</p> <p>“Wow, that’s really late. You’re simply getting too big.”</p><p>“Mom I’m five,” he said like it was such an old age.</p><p>“I know. I just want you to stay my baby forever,” she told him a little sadly.</p><p>“You can have another baby and then I would be a big brother,” he stated matter-of-factly.</p><p>Emily was taken aback by the desire his statement caused inside of her. She’d always wanted several kids but her ex had said one was more than enough. He’d never been the kind of father Trevor deserved.</p> <p>“Maybe one day,” she whispered wistfully.</p><p>“I can help you with that,” Mark murmured in her ear, as he entered the kitchen.</p><p>Emily turned an even darker shade of red and glanced at both Edward and Trevor, to make sure they hadn’t heard. They weren’t paying any attention, thankfully but his words put such a yearning desire in her heart she felt an ache there and unconsciously rubbed at her chest.</p><p>She didn’t see the dark desire in Mark’s eyes. He may have been goading her but he was incredibly surprised to realize he would be ecstatic if she were to become pregnant. He realized they hadn’t once used protection.</p><p>She was turned sideways, so he glanced down at her flat stomach, imagining it blooming outward as his child grew there. The desire was so intense he could barely breathe. He was going to make sure she didn’t leave his life.</p><p>“I need to go tend the horses,” he suddenly said and practically ran out the door. Emily breathed a sigh of relief. She didn’t know how she was supposed to be acting around him. She didn’t know if he wanted Edward to know they were a couple. She didn’t know anything. Oh well, she figured they had time to figure it all out.</p> <p>Chapter Five</p><p>Emily felt like someone was following her. She kept looking back but the eerie feeling wouldn’t go away. Trevor was at school and Mark was working somewhere on the ranch so she’d wanted to get some fresh air. Now that she was a couple of miles away from the house and felt someone was stalking her, she was thinking maybe it hadn’t been such a good idea.</p><p>Just calm down she told herself. You’re just letting your vivid imagination get to you. Everything is fine. Even though she was trying to calm herself, she picked up her pace a bit to head back for the safety of the house.</p><p>When she heard a shuffling in the bushes, not far from where she was, a little squeal escaped her lips and she began to jog. She looked over her shoulder the entire way back and breathed a huge sigh of relief when she saw the barn come into view but she still couldn’t shake the eerie feeling.</p><p>“Where have you been?”</p><p>Emily’s heart jumped into her throat as a light scream escaped her lips. She whipped around, to see Mark astride his huge horse and he was eyeing her suspiciously.</p><p>“Calm down boy,” Mark soothed his animal. He gave her another curious look.</p><p>“Sorry Mark, you startled me,” she said, completely out of breath.</p> <p>“I can see that. Are you okay?” he asked, as he jumped down from his horse and walked over to her slowly, like she was a scared animal.</p><p>“I’m fine. I just spooked myself out on my walk. I got too far away from the house and started picturing evil forces following me,” she said with a laugh. Now that she was back in the safety of the ranch, she realized how silly she had been.</p><p>“Were you out that way?” she asked him, while pointing in the direction she’d just come from.</p><p>“No I just came in from the East fields,” he replied and looked quizzically out into the woods she had come from. “Did you see something?”</p><p>“No it was nothing like that. I’m sure some squirrels were playing around in the bushes. I seriously have got to stop reading all those Stephen King Novels,” she said sheepishly.</p><p>“I agree. You do tend to jump at the smallest sound.”</p><p>“Come with me, I want to show you something,” he added and then took her hand. He led his horse with the other one.</p><p>“Do you never get enough?” she teased him.</p><p>He pulled her into his arms and kissed her gently, before reluctantly releasing her and then heading towards the smaller of the barns. “Baby I never get enough of you but that’s not what I want to show you,” he answered, with a gleam in his eyes.</p><p>They fell into a comfortable silence, as they strolled toward the barn. Mark handed his horse off to one of the men and then led her to the loft. Inside a hole in the hay lay a mamma kitty and five brand new kittens. They were crawling all over her, looking for food.</p><p>“Oh, Mark they’re adorable,” she cried and sat down to pet the mamma. She purred and leaned her head into the rub. “I can’t wait to show Trevor,” she added, as she gently ran her finger down the little orange one’s head.</p><p>The mamma got tired of being used for only her milk and sauntered off, leaving the kittens crying out. “Will they be okay?”</p><p>“Of course they will. She just went off to get some food. She won’t leave them long,” he said gently.</p><p>“Can I hold one?” she asked him with hope.</p><p>“Sure.”</p><p>She carefully picked up the pretty little orange kitten and cuddled it to her breast. It rooted around for a moment and when it came up empty, let out a frustrated cry, then quickly fell asleep. Emily didn’t know how long she sat there cuddling the new kitten but soon it’s mamma returned, so she reluctantly laid it back down to nurse.</p><p>“Are you keeping them?” she asked hopefully, trying to come off nonchalant but he wasn’t fooled.</p><p>“Do you want to keep them?” he asked her.</p><p>“It’s up to you,” she stalled, trying to sound as if it didn’t matter.</p><p>“You’re so stubborn. Just admit you want to keep the kittens.” He exhaled as his hand combed through his untamed hair.</p><p>“Fine, I want them to stay,” she mumbled and folded her arms across her chest, pouting a bit. She knew it was irrational to be so against asking for even the smallest thing but the more Mark did for her and Trevor, the more she was afraid of losing it all. She was already impossibly attached. The kittens were just one more piece of a puzzle, linking her to the ranch.</p><p>“Now was that so hard?” he asked.</p><p>She realized she was being silly but she didn’t know how else to protect herself. They’d been making love nightly for almost a month and he treated Trevor like a son. She was afraid everything was to perfect.</p><p>“We like to have a lot of cats around. They keep the mice and rats away,” he told her.</p><p>“Rats are so much bigger than them,” she exclaimed, looking around as if a huge rat was going to come pounce on the innocent things at any moment.</p><p>“I think the other cats will take care of the rodents until these guys grow up a bit more,” he said with a chuckle.</p><p>Mark left her with the kittens, while he finished his chores. She hadn’t realized how much time had passed, when suddenly Trevor was racing into the barn.</p><p>“Mom, Mark said you have a surprise to show me,” her son said, trying to gain his breath, as he laid his head between his legs.</p><p>“Come over here and don’t be loud,” she whispered.</p><p>Trevor’s eyes got big as he walked over to his mom and then he squealed when he saw the babies. “Are they all ours?” he asked with excitement.</p><p>“Yep, Mark said we get to keep them all,” she told him.</p><p>“Yeah, can I hold one?”</p><p>“Sure you can. But you have to be really gentle and pet their mamma for a few minutes first.”</p><p>Trevor obediently gave attention to the adult cat and then gently held the tiger stripped one. They stayed there for a while longer and then Emily had to head up to the house to get dinner ready.</p><p>“Can I stay out here with Mark, please?” Trevor pleaded. Emily looked down to where Mark was and he shook his head yes.</p><p>“Okay but be good and when Mark tells you it’s time to come in, no fussing,” she told him.</p><p>“Of course, Mom,” he said like she was the one who was a child.</p><p>Strange things kept happening to Emily. It was several different occurrences, not one single thing that was too alarming but when all the things added up it was starting to creep her out. She’d received a dozen red roses, with a note in them that said they were from a secret admirer.</p><p>She’d thought Mark was trying to be cute and hadn’t thought much about it, until he asked her where they had come from. When she showed him the note, he laughed it off and told her it was probably John, the young ranch hand who had a slight crush on her. She thought he may be right and didn’t want to embarrass the kid, so she displayed the roses on the kitchen table and thought nothing else of them.</p><p>Then over the next few weeks she found little notes in the mailbox at the end of the road saying she was beautiful and smart. None of them were harmful in the least and she still wasn’t concerned but then she also had the feeling someone was secretly watching her. When everything was put together, it was enough to really give her the creeps.</p><p>She thought the flowers could’ve come from John but not the notes. She knew he had a slight crush but he wasn’t the stalker type. Plus the eerie feeling of being watched would happen to her when she knew for a fact John was nowhere near the house. She thought some of it could be the creepy ranch hand but again things were happening when she knew he was nowhere near the house.</p><p>She figured she was just overwhelmed and kept all the little incidents to herself. She didn’t want to concern Mark with any of it. Feeling a little freaked out wasn’t a reason to call in the National Guard. She attributed it to her overactive imagination and decided to take a few more safety precautions.</p><p>The next day though, when Emily went to check the mail and found an envelope in the box addressed to her, everything changed. There was no return address on it but it had been mailed locally. She opened it, not thinking much about it until she read the words.</p><p>I have been watching you. I love how your hair blows in the breeze when you step out onto the balcony late at night. You are truly a vision. I know you’ve noticed me as well but have to keep up appearances. I just wanted to let you know I’m here for you and will always be here. We were meant to be together. Nothing will keep us apart. I know you’ll enjoy what I have planned for us. It will be magical. Until we’re together, know I’m keeping an eye on you. I hope you’ve appreciated my poetry and the gifts I have left for you. Just know if I can’t have you, then no one else can either. We will be a true family soon.</p><p>With my love always,</p><p>Your Secret Admirer.</p><p>Emily dropped the letter and started shaking uncontrollably. She looked around the place, fearful there was someone watching her at that moment. A shiver of fear ran down her spine and tears filled her eyes. She was terrified to know her fears had been real. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She fell to the floor and sobbed. She knew things were too good to be true. How could she stay now when there was someone out there trying to get to her? What if he harmed her son while trying to harm her?</p><p>Mark walked in the front door, his heart almost stopping, when he saw Emily huddled on the floor, with sobs racking her entire body. He dropped to his knees and gathered her into his arms.</p><p>“Emily what’s happened? Is Trevor okay?” He asked in a panic. He gently shook her shoulders so she would look at him. He needed to know what was wrong.</p><p>She stared up at him with haunted eyes. She looked terrified and he knew he would go to the ends of the world to fight whatever demons were after her. He gathered her close, while the sobs kept racking her body. His eyes were searching frantically for Trevor. He could deal with anything else that was happening, if he knew Trevor was okay.</p> <p>Edward walked into the room and immediately walked over. “What has happened?” he asked.</p><p>“I don’t know,” Mark answered. “Is Trevor okay?”</p><p>“Yes, Trevor is fine,” Edward answered. Mark visibly relaxed.</p><p>“Can you go stay with Trevor and make sure he doesn’t come in? I’m going to take Emily up to our room and find out what is going on,” Mark asked.</p><p>“Of course, sir,” Edward answered. His eyes followed Mark as he gently carried Emily up the stairs. He was as concerned about her as Mark was. Emily had already become a loved member of the household.</p> <p>Mark laid her on the bed and then stretched out next to her, holding her until the sobs finally started to quiet down. When she was down to just a few hiccups, he pled with her to please tell him what was going on.</p><p>“W...we are g...going to have to m...move,” she finally managed to get out between hiccup sobs.</p><p>Mark felt as if his whole world had been flipped upside down. “Why would you even think that?” he asked her.</p><p>“Trevor isn’t safe,” she managed to gasp out and then handed him the letter that was crushed in her hand.</p><p>Mark read through the letter and then read it again to make sure he was really seeing what was there. He still held her close and made sure to gently rub her back but if she would’ve been able to see his eyes, her terror would have tripled.</p><p>He was simmering with so much fury it took all the well trained will-power he’d ever developed, not to smash up the entire room. He knew he had to stay calm and strong for her but how dare someone try and threaten his woman?</p> <p>He’d always heard people talk about seeing red when they lost their temper and had thought it was nothing more than an expression. He now understood the reality of it. His fury was so intense he could actually see a red hue around the corners of his vision.</p><p>“It’s okay baby, I promise you this person will never come near you or Trevor,” he said with so much menace in his tone, she actually stopped long enough to look up at him in surprise.</p><p>He didn’t want her to see his eyes so he gently tucked her head back down to his shoulder, while he continued stroking her.</p><p>“You don’t understand Mark, he knows where I live. He could hurt Trevor trying to get to me,” she said. The tears were finally starting to dry.</p><p>“Emily I will repeat to you that I will never let anything happen to you or Trevor. I guarantee this guy won’t touch you,” he stated. He lifted her chin up, looking deeply into her eyes. He’d finally managed to somewhat control his turbulent emotions.</p><p>“How can you promise me that?” she asked.</p><p>“I was raised to always protect those I love,” he simply stated.</p><p>Emily inhaled as she realized what he’d said. She didn’t think he even realized he’d said he loved her. Her heart filled with so much warmth and light, after the total devastation, she felt like it was going to beat right out of her chest.</p> <p>She snuggled even deeper into Mark’s strong arms and fell asleep, feeling comforted by his embrace and the warmth of his words.</p><p>Once Mark knew Emily was sleeping he got up and made a few phone calls. The first one was to an old high school friend, who was a classified military man. If anyone could get some answers into who was stalking Emily, it was Chad.</p><p>Chad reassured him he would be there within a couple of days. He would find out what was going on and the guy would never harm either Emily or Trevor. Mark smiled at the tone in his friend’s voice. He knew he’d made the right choice in calling him.</p><p>The next call was to his father. Joseph listened as Mark read the letter. “I’ll be right over. I’ll call your brothers,” was all he said, before hanging up the phone.</p><p>Mark went back to the bedroom so he could lie next to Emily again. He didn’t want her to wake up alone and panic. He needed to be there for her, to reassure her everything was going to be okay.</p><p>Emily woke in Mark’s arms and for a moment forgot all about the letter and the devastation. He was pressed up against her back and his desire for her was obvious. She rubbed against him, automatically stretching and pressing her backside closer to his hardness.</p><p>“Seriously woman you’re trying to kill me,” Mark mumbled into her hair, as he kissed her neck and ran his hand gently up her side, to cup her ample breasts. The peaks hardened instantly at his touch and she wiggled, trying to get as close to him as possible.</p><p>“That’s the plan,” she purred.</p><p>He flipped her over and they made love with a sweetness that was beyond anything she’d ever felt before. She was really starting to feel loved by the wonderful man, who she still couldn’t believe was a part of her life.</p><p>“I would much prefer to stay here in bed with you all day but we have guests,” he said to her, as he nibbled on her neck some more.</p><p>Suddenly the hours before she’d passed out came flooding back and Emily’s whole body stiffened. She was saddened to be brought back so suddenly to reality.</p><p>“It’s okay baby, I called my family and they are here, so we can all come up with a game plan. We are a family and we protect each other.”</p><p>“You shouldn’t have bothered them with this. You are safe,” she said perplexed.</p><p>Mark stared at her as if she’d lost her mind. “Do you really think either you or Trevor are any less important than me?” he asked her incredulously.</p><p>“I just meant your family didn’t have to drop everything because I got some creepy letter,” she tried to explain.</p><p>“That letter should be taken seriously and we are going to make sure you are safe,” he told her with finality. He was far too aware letters like that could lead to grave danger. When you grew up as wealthy as he had, things were always taken seriously and he didn’t want her to know how scared he really was.</p><p>Emily shrugged, caving in to his demands. “I’m going to shower really fast before heading down.”</p><p>“Do you need someone to scrub your back?” he asked with a wink.</p><p>“Then neither of us would ever get down there,” she said. She gave him a quick kiss and then firmly shut the bathroom door behind her.</p><p>Mark laid on the bed thinking of each moment he spent with her. He loved her strong will and he loved her kindness. He was falling in love with her. It scared the hell out of him but at the same time it felt right.</p><p>He finally made his way down the stairs and was surprised to see his entire family. Not only had his dad come with his brothers but their spouses and children too.</p><p>“Uncle Mark,” Jasmine yelled and threw her arms around his legs. “You took forever to come down. Daddy said you were comforting Aunt Emily,” she said and put quotation marks around comforting, like her daddy had done. She had no idea what she was saying but Mark glared at his brother anyway.</p><p>“Isn’t my niece a little bit young for you to be teaching bad habits?” Mark asked Lucas.</p><p>“Hey I was just telling her what a good comforter you are,” Lucas goaded him.</p><p>“Quit your fighting, we have things to discuss and people to beat the crap out of,” Alex said.</p><p>“Language Alex,” Jessica scolded him.</p><p>“Sorry, Honey,” Alex said sheepishly.</p><p>“I called Chad. He’ll be here in a couple days. I’m not sure where he’s flying from but it must be far away,” Mark informed them.</p><p>“I’m glad to hear he’s coming in to help out,” Joseph added, with relief evident.</p><p>“Me too,” Mark said. He was already feeling better about Emily’s safety just having his family in the room. There was no way anyone would get to her with his brothers there.</p><p>“We’re staying here until this gets solved,” Lucas said. The rest of the people in the room all nodded their heads in agreement.</p><p>“I’ve already prepared the rooms,” Edward added, as he set out some drinks and snacks.</p><p>Mark blinked several times as his eyes began to sting. He couldn’t imagine life without his family. He truly felt sorry for those millions of people who didn’t have the same support system.</p><p>He was grateful he had more money than he could possibly ever spend but he would give up every last dime before he would give up one member of his family. He realized that included Emily and Trevor as well.</p><p>Mark poured himself a double shot of whiskey and enjoyed the burning sensation as it slid down his throat and burned its way to his gut.</p><p>“Thank you guys, we’ll get this solved immediately,” he said to everyone.</p><p>Emily walked into the room just then and her eyes widened at the large crowd before her. She didn’t have time to say anything though because Jessica and Amy ran up to her and wrapped her in a group hug. “We are so sorry someone is trying to scare you,” Amy said. “We’ll never let anything happen to you,” Jessica added.</p><p>The three women stood together. They wiped a few tears and then quickly laughed, feeling secure as a unit. They’d already formed a bond stronger than most sisters. The guys crept back from them as if they were contagious. They didn’t know how to deal with women emotions.</p><p>“Women,” Alex whispered.</p><p>“Yeah, I know,” Lucas said.</p><p>“I don’t get them,” Mark added.</p><p>“Seriously, guys kill the problem while girls are always crying but that’s why we have to be there to protect them,” Joseph piped in.</p><p>All four men shook their heads in unison while heading to the barn to start discussing safety measures on the property. They didn’t have a clue one person was watching them the entire time. One person they would’ve never even thought about suspecting.</p><p>Chapter Six</p><p>The next couple of days flew by with no more incidents. No one let Emily get out of their sight. She was beginning to feel a bit claustrophobic. She had been staying almost nightly in Mark’s room, so he moved all her things in there, making it more permanent.</p><p>Mark explained it was safer for her to stay with him and with all the extra house guests they needed her room anyway. She was scared it was going to affect Trevor but he didn’t even seem to notice anything was unusual about the situation.</p><p>Mark and Emily made love each night and her worry seemed to fade away into nothingness. She knew beyond a shadow of a doubt she was in love with Mark and if he were to grow bored with her, she would fall to pieces. She was in the very situation she’d tried so hard to avoid. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>How could she not love him when he was so caring about her and treated her son like he was his own? The rest of his family treated her and Trevor as if they were a part of their family as well. She choked up the first time Jasmine called her aunt Emily but was starting to get used to it. She found she really liked how it sounded.</p><p>She was sitting out on the back deck, when a huge guy with short dark hair and aviator glasses stepped out the door. The man was built like a Sherman tank. She wouldn’t want to be on his bad side, she decided quickly.</p><p>“Chad, you made it,” Mark exclaimed, as he came around the corner.</p><p>“Sorry I couldn’t get here sooner,” Chad replied and then the two men headed into the house. Emily had heard about Mark’s longtime friend. She decided they must put something special in the food around this area because all the men seemed to be far too sexy for any normal person’s good.</p> <p>“Okay Chad I want the guys to think you’re a new hire. Luckily you’ve been out of the country long enough only my foreman knows who you are and I already filled him in on what’s going on, so he won’t say a word. You’re going to get far more information if the guys think you are one of them. I’m sorry you’re going to have to sleep in the bunk house,” he added with an evil grin.</p><p>“Yeah, you look sorry about that,” Chad said. “Good thing I’ve slept in much worse places.”</p><p>“Yeah, I kind of wish it was a little rougher out there,” Mark continued.</p><p>“You’re a peach. Well I better get changed. I want to check things out right away. The sooner we make sure your Emily’s safe, the sooner everyone can relax.”</p><p>“I appreciate you dropping everything to do this. She’s the one, Chad. I’ve never felt this way about another woman,” Mark said to his friend.</p> <p>“I knew the second we spoke on the phone she was the one,” Chad told him, before heading off to change into some less conspicuous clothing. He was going to have a hard enough time blending in with his size and demeanor but add the clothes he was currently wearing and the man looked like the military man he was.</p><p>Chad changed quickly and headed down to the bunkhouses where the ranch foreman was. He was alert to everything around him. He noticed the men working on the fence off to his right and the guy to his left feeding the horses. He wasn’t an easy man to sneak around. He would catch this stalker in a matter of days if not hours.</p><p>He wasn’t a cocky man, he was just incredibly confident. He’d been in the military for almost twenty years and those years had taught him well. There were few people in his life he would drop everything for. Mark happened to be one of those select men.</p><p>If it hadn’t been for Mark and his family, his life would have turned out significantly different. They had believed in him and helped him get out of the horrible circumstances he’d been in, to make a success out of his life.</p><p>Chad shook off the distracting thoughts and stepped through the bunk house’s doors. He spotted the foreman right away, along with a couple of other ranch hands sitting down at a table.</p><p>He walked up to the men with his usual confidence and introduced himself.</p> <p>“Hi I’m Chad, Mark hired me and said to come on down here to get set up,” Chad said, while sticking out his hand.</p><p>The men eyed him warily, as if sizing up a new cow. The foreman finally stood and Chad was impressed with the man’s acting skills. A normal observer would never know they knew each other.</p><p>“Good to meet you Chad, I’m Bob, the foreman here,” he said and clasped his hand.</p><p>“Good to meet you as well.”</p><p>“Why don’t you get settled in today and get the lay of the land. You can begin work tomorrow,” Bob said, giving Chad the time he needed in order to scope out the area and do some snooping through the hands things.</p><p>Once the other men headed back out to do their work, Chad and Bob sat down and discussed things. Bob promised to keep the men away from the bunkhouse between three and five. Chad headed out to survey the grounds.</p><p>He didn’t see anything suspicious right off but he didn’t have much time and would have to do a more thorough search the next day. He really wanted to go through the hands rooms. He was far more likely to find suspicious items there.</p><p>At three on the dot he slipped back into the bunkhouse, without anyone seeing him and began searching through the men’s belongings.</p> <p>“It’s time to get out of here for a while. The guys can take care of the kids. I’m in desperate need of a pedicure,” Jessica said to Emily and Amy.</p><p>“Ooh great thinking Jess, I’ll let Lucas know and be ready to leave in twenty minutes. I just want to change,” Amy said and then dashed off towards her room.</p><p>“That does sound nice. I hate to leave Trevor with everything going on though,” Emily added.</p><p>“He’ll be fine. No one can get through our men,” Jessica reassured her.</p><p>Emily really loved to think of Mark as her man. She wasn’t really sure where they stood but so far things seemed to be just about as perfect as they could get. Well, as perfect as things could be while she was being stalked by some unknown psycho.</p><p>“You’re right, of course. I’ll go change and be down quickly,” Emily conceded and ran up to change.</p><p>“Be careful and don’t stay gone to long,” Mark said to Emily. He knew he would be worried about her while she was out. He also knew she needed some time away from the house. Her nerves were fried.</p><p>“Try not to max out the charge cards,” Lucas teased them.</p><p>“I’m sorry but we cannot make any promises,” Amy told her husband with a wink. Lucas smiled as they headed out the doors. Amy was so much more confident from the woman he’d met years ago. She was still far too frugal but she finally felt like an equal in the marriage. He’d drummed into her head money was nothing without love and she finally felt she could go out with the girls, without having to justify every little purchase. He was relieved about it.</p><p>“I love that woman,” Lucas said as the three women disappeared down the driveway.</p><p>“Ditto, Brother,” Alex said.</p><p>“I’m right there with you,” Mark added. Both brothers turned to smile at Mark. They were happy he seemed to have found the one. The fact she came with an instant family was an added bonus.</p><p>“I can’t believe how hard we all fought to hold on to our bachelorhood. What the hell were we thinking?” Alex asked.</p><p>“Seriously,” Lucas agreed.</p><p>“I thought falling in love with just one woman would be the end of me but watching you guys with your wives and how happy they’ve made you over the years has really put a longing in me for something more. I’ve felt like there was something missing. I still was determined not to get married but since Emily has stepped into my life I can’t seem to think of anything else,” Mark said.</p><p>“At least we found our own women without Dad’s meddling,” Lucas said.</p><p>The three men laughed at what they perceived as their independence. Joseph happened to be around the corner and heard his three sons talking. He laughed to himself. Someday he would tell them the truth, or maybe not.</p><p>“Oh my gosh, this feels so good,” Emily exclaimed, as the woman rubbed some lightly scented lotion into her feet.</p><p>“Seriously I think I have died and gone to heaven,” Amy purred, as her feet were sitting in the hot, bubbly, scented water.</p><p>“I’m never leaving,” Jessica added, as her toe nails were being painted a deep shade of red.</p><p>The three girls were being pampered in luxuriously comfortable chairs and talking about anything and everything.</p><p>“I love being a mother but it’s so nice to get away and have some time with my two best friends,” Amy said.</p><p>“Agreed,” both Jessica and Emily said.</p><p>After they finished with their pedicures and manicures, they walked through the huge Seattle Mall. “I’m in need of some sexy lingerie,” Amy said.</p><p>“Great thinking, let’s go to Victoria Secret,” Jessica said.</p><p>The two women coerced Emily into buying a couple of outfits that made her blush, even as they sat on the display rack. All three women walked out of the store with new lingerie, lotions and perfume.</p><p>“I can’t wait to try this on for Lucas tonight. He’s going to go crazy,” Amy said with confidence.</p><p>“Don’t expect Alex and I down until late afternoon tomorrow,” Jessica said with a wink.</p><p>Emily was terrified of putting the stuff on. What if Mark didn’t like it? What if he thought she was trying too hard? The girls demanded she wear the bright red one, to match her toe nails and give them a full report on Mark’s reaction the next day.</p><p>She couldn’t chicken out, so she would have to get brave. There was no way he was going to turn her down, she knew that much. She just needed to quit being such a wimp.</p><p>The three women went through the mall and ended up buying far too many items. Most of the things were for their kids and men but they threw in some new clothes and shoes for themselves as well. Emily felt a little guilty about spending so much money but she hadn’t done any major shopping since she’d gotten Trevor set up for school, so she allowed herself to enjoy the day.</p><p>By the time they pulled up in front of the house it was dark and all three guys were pacing on the front porch, waiting for them.</p><p>“What took so long?” Mark questioned, concern showing on his face.</p><p>“Oh Mark, quit being so overprotective. You know it takes us girls a long time to find those perfect outfits,” Jessica chastised him.</p><p>“You three can carry in our bags,” Amy added.</p><p>“Except for these,” Jessica said with a wink at her own husband.</p><p>The three men spotted the girls carrying the Victoria Secret bags and their irritation instantly evaporated. They knew what that store carried.</p><p>“Well it’s really late and the kids are in bed,” Lucas suddenly said with a fake yawn.</p><p>“Yeah I’m ready to turn in,” Mark added eagerly.</p><p>“Let’s go,” Alex said.</p><p>“You three can sit in the parlor with your father and have a drink. We’ve been shopping all day and need to have a bite to eat and then clean up,” Amy said.</p><p>“Fine,” Mark grumbled and followed his brothers into the house with his arms loaded down with bags. He was really happy to discover several of them belonged to Emily. She needed to go out and spoil herself more often.</p><p>An hour later Mark was done waiting and jogged up the stairs to his shared room with Emily. He stepped inside, locking the door. The bathroom door was shut so he shed his clothes and climbed into the bed to wait for Emily. He’d missed her and wanted her back in his arms.</p><p>When the door finally opened and she stepped out, Mark couldn’t even breathe for a few moments. She literally took his breath away. When he finally managed to catch his breath, her scent just about sent him into cardiac arrest.</p><p>She shyly walked over to him, wearing two tiny scraps of red lace that didn’t hide anything from his view. The garters at the top of her thighs were begging him to roll them slowly down her legs and the heels on her delicate feet showed the sexy red polish on her toes to perfection. She was a walking dream and he had to control himself not to take her in one quick plunge. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’d spent the time to make herself into his fantasy come true; the least he could do was show his appreciation, by fully pleasuring her.</p><p>“You are so damn sexy,” he managed to get past his parched throat.</p><p>She smiled shyly at him. “You like the outfit? The girls insisted I get it,” she said a bit self-consciously.</p><p>“Like is not even a strong enough word,” he gasped. He stood up to walk the few feet over to her and she could see his obvious pleasure with the outfit. He was completely naked and his engorged arousal was all the evidence she needed.</p><p>Emily gained more confidence and pushed him back down to the bed, so he was sitting on the edge. She stood between his thighs and slowly brought her lips down to his. He reached up to pull her down to him and she shook her head. “No touching,” she whispered in his ear and then licked the lobe.</p><p>Mark shuddered as her warm breath caressed the sensitive spot. He obediently placed his hands on the bed beside him, although it about killed him. He really liked this game she was playing and was determined to let her carry it out.</p><p>She licked the side of his neck and then nipped at his pounding pulse point. She soothed the area with her lips and then made her way up the side of his rugged cheek, until she finally placed her lips back against his. She brushed her tongue across his bottom lip and he obediently opened his mouth, allowing her access. Her tongue tangled with his, as her hands stroked his arms and chest. She rubbed her womanhood against his pulsing erection and he about jumped off the bed. He started to reach for her again and she pulled back and shook her head.</p><p>Mark moaned out loud as he obeyed her again. “You are killing me Emily,” he whispered, as another wave of pleasure washed through him. She smiled seductively at him and then slowly pushed him back on the bed. His legs were still hanging over the side and she bent over him, to kiss her way down his throat.</p><p>She continued kissing her way across his muscled chest and flicked her tongue over his nipples. He jumped as she nipped the sensitive flesh and then soothed it out with her tongue. When she lowered her head to continue her path down his stomach, he groaned out loud. He couldn’t take much more. He was going to end this seduction, without even being inside her.</p><p>When her hand enclosed his ridged staff and rubbed at the sensitive head he cried out. “Emily, please,” he croaked.</p><p>“Please what?” she said breathlessly. She was so turned on by seeing his reaction she wasn’t going to be able to hold off much longer herself.</p><p>“I can’t take much more before this ends far too soon,” he cried out.</p><p>She smiled at him and then took him into her mouth. The sight of her red lips surrounding his engorged erection made him shake. He could feel himself start to lose it. He tried to reach for her again but she shook her head, causing her mouth to rotate on him. He wasn’t going to make it.</p><p>Her hand gripped the base of him tightly and her mouth took him deeply inside her. He was a goner. She pulled up and dipped down again and he cried out as the orgasm rocked through him. She kept stroking his erection drawing out the pleasure. When she finally pulled back and licked the still sensitive head, his entire body shook.</p><p>“Baby, I’m sorry. That wasn’t supposed to happen,” he said, as she crawled up to him. She just smiled and started stroking him from head to toe.</p><p>“Yes it was,” she said, with a devilish light to her eyes.</p><p>“You’ll be my death,” he groaned, before flipping her onto her back. “Give me a few minutes to torture you and you’ll be singing a different tune,” he said, as his tongue stared doing magical things to her neck.</p><p>He kissed his way down to her barely covered breasts. His hands kneaded the ample mounds and then he bent his head to suck the peaks through the thin material of her lingerie. She gasped out at the sensation. He finally tore the delicate fabric away and sucked the peak into his mouth. His tongue danced around the pink nipple, which made her back arch off the bed.</p><p>As he took turns sucking on each nipple, while rubbing the other one, he was shocked to find his satisfied body start to respond again. He was growing hard in anticipation of plunging inside her. He couldn’t seem to get enough.</p><p>He moved his lips down her body, until he reached her belly button. His tongue swirled in and around it, while his hands stroked lower still. He pulled her legs apart and then buried his head between her moistened thighs.</p><p>The first stroke of his tongue on her sensitized nub brought her off the bed. He ran his tongue all over her, kissing her soft pink folds intimately. He was ready to take her in a matter of seconds.</p><p>He dipped his fingers inside her, feeling her wet heat surround him. She gyrated her hips to take him in deeper. He started pumping his fingers faster in and out, as his tongue swirled around the hardened nub. “Mark,” she yelled out as her body started to convulse around him. He slowed his hands and tongue and then nipped the inside of her thigh.</p><p>She completely collapsed on the bed, breathing heavily. He slowly kissed his way back up her stomach. He stopped at her breasts and gently ran his tongue over the peaks, before continuing up to her neck.</p> <p>He nestled himself inside her thighs and slowly sank himself deep within her. She gasped, as she felt his engorged staff fill her up. He could see the surprise in her eyes that he was ready for her again so soon.</p><p>He started moving slowly in and out of her, pleasuring them both. They could now take their time and draw out the pleasure. She started groaning and he captured her lips once again, as he continued the slow, deep strokes inside her heat.</p><p>She wrapped her legs around him so he could delve even deeper inside her. Their breaths both started coming out in short pants, as his speed started to pick up. The feel of his chest rubbing against her sensitive nipples was causing her pressure to build back up.</p><p>The feel of him inside of her, touching her everywhere, was taking her back over the edge. She raised her hips up to meet him, loving the pounding of their hips meeting in the oldest dance of all time.</p><p>Her nails raked down his back as he kept kissing her, mimicking the motion of their bodies. He finally gripped her hips to increase the speed of his pumping. He was pushing so fast and hard she knew her body would pay the next day but at that moment she just wanted more.</p><p>“Harder,” she gasped as he pushed into her. He groaned out loud and then obeyed her. He thrust into her a few more times, when her body started shaking with her release. She gripped him tightly as the spasms overtook her.</p><p>He cried out her name as he shot his release deep inside her, with her body clenching around him. He kept them tightly connected as he tried to get his breathing under control.</p><p>He finally managed to roll over onto his side, taking her with him. He rubbed her back for a while, kissing her gently. He took in her swollen lips and looked down to see her reddened hips, where his fingers had gripped her.</p><p>“Emily, I’m sorry. That was too rough,” he apologized to her.</p><p>She looked up at him with an awestruck expression. “Are you kidding me? That was amazing. You are amazing. I’ve never in my life had such amazing sex. I know I keep saying amazing but there’s just no other word for it,” she said on a purr.</p><p>She kissed him deeply so he could really understand how great she was feeling. “Thank you, Mark, for showing me how a woman is supposed to be loved,” she said, meaning every word.</p><p>Mark visibly relaxed. He could tell she truly meant it. “If you give me about a week I can show you again,” Mark said.</p><p>“I don’t think I can possibly wait a week,” she told him, as she brought her hand down his body and rubbed him.</p><p>“Woman you are trying to kill me,” he said to her as he kissed her again. They spent the next several hours kissing, touching and laughing. No one emerged until very late the next afternoon.</p><p>Chapter Seven</p><p>“Mark, I found a lot of pictures of Emily in Chris’s belongings. I’m going to do a search on him and see what I can find out. Keep an eye on the guy, I should have everything back within a couple of hours,” Chad said.</p><p>“I will,” Mark replied, deciding Chris would be working with him that day.</p><p>Mark walked out to the barn and found Bob with Chris and some of the other guys. “Hey Bob I’m going to steal Chris from you. I need some help with the South pasture,” Mark said.</p><p>“No problem, boss.”</p><p>Chris followed Mark out to the field and that’s where Chad found them a couple hours later. “Hey boss can we go inside, I have some stuff to show you? Chris can come along,” Chad said, nonchalantly.</p><p>Mark knew Chad had found the answers he was looking for from the look he gave him. He was just trying to get Chris away from any other people at that point. Luckily Chris didn’t seem to realize anything was up.</p><p>Chad was a smart enough man to have gotten the rest of the family away from the house while they got it all settled. They stepped into the den and a couple of police officers were there waiting for them.</p><p>“What’s going on?” Chris asked, with some suspicion.</p><p>“That’s what we want to ask you,” Mark said with venom.</p><p>On the table were the pictures Chad had found and the paper with Chris’s history on it. The man narrowed his eyes to dangerous slits and glared at Chad. Chad smiled at him with an expression that seemed to say ‘bring it on buddy.’</p><p>“What the hell is this? It’s okay to go through people’s stuff now?” Chris yelled.</p><p>“What are you doing with all these pictures of Emily?” Mark asked in a deadly calm voice. He was in no way calm but he wouldn’t let that show to the disgusting man.</p><p>“I can have pictures of whoever I like,” the man sneered.</p><p>Chad pulled out pictures of the other girls he’d found. “These don’t look like women to me,” Chad snapped, barely maintaining control of his temper. He’d found not only pictures of Emily but also indecently exposed pictures of young women taken through windows, without their knowledge.</p><p>Chris’s face paled as he saw those pictures. Chad must have found them in some secret hideaway the man thought was safe. He looked nervously over at the police officers.</p><p>“Once I found out you were a convicted felon and on parole I decided to look around a little deeper,” Chad said. “I found your stash of photos below a loose floorboard. I think these would be a breach of your parole.”</p><p>“You can’t prove those are mine,” Chris sneered. “They could be any of the guys,” he yelled, with barely controlled fury.</p><p>“Actually we can prove they’re yours, as we also found the camera that took them,” Chad countered.</p><p>“I can’t believe you were able to fool me,” Mark said. “I can’t believe I let you near my family.”</p><p>“I guess you’re not so smart, you rich piece of crap,” Chris sneered.</p><p>“Officer I would like to press charges for this man stalking my wife. All the evidence has been saved and is in the other room,” Mark said. He was done having a conversation with the piece of scum.</p><p>The officer walked up to Chris and started reading him his rights. “What the hell are you talking about? I haven’t been stalking her, I only took a few pictures,” Chris said, cutting the officers off. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No one listened to the man and the officers quickly hauled him out of the room. Mark felt like a fifty pound weight had been lifted off his shoulders. Chris would be going back to prison for parole violation and probably have a few more years added on, depending on the age of those girls he’d violated.</p><p>He was disgusted with himself for letting him into his home. He normally was a great judge of character. He must’ve been more distracted than he thought. Now that Emily and Trevor lived there and his nieces and nephews came over so much, he was going to have to start having background searches done on all his employees. There was no way he wanted any more men like that one to slip through and be so close to those he loved.</p><p>“Thank you Chad, you found the man much quicker than I would have thought possible. It may have taken me a long time,” Mark said to his friend.</p><p>“You know there’s nothing I wouldn’t do for you,” Chad told him.</p> <p>“You owe me nothing but I do appreciate you coming,” Mark said sincerely.</p><p>“Well we’ll just have to disagree on the owing thing,” Chad told him, then slapped Mark on the back.</p><p>“You most certainly are a stubborn man,” Mark responded.</p><p>“Look who is talking. Are you the kettle today or the pot?” he said with a smile.</p><p>“Yeah, yeah,” Mark mumbled and then rolled his eyes.</p> <p>“I have to get back, you know?” Chad said, reluctantly.</p><p>“I know. How much longer are you going to be gone?” Mark wanted to know.</p><p>“I’m not sure.” They talked a while longer and then Chad left just as quickly as he had come.</p><p>“Now that everything is safe, the rest of us are going to get back to our lives too,” Lucas said, when the family returned.</p><p>“I appreciate all of you dropping everything and being here for us,” Mark said.</p><p>“Of course, Brother,” Lucas told him.</p> <p>The family quickly packed up and was gone before Emily knew it. She was sad to see them all leave. She really had grown fond of Amy and Jessica and the children running through the halls.</p><p>Emily and Mark quickly got back into their old routine. She offered to move back to her room, although she really didn’t want to. He’d told her in no uncertain terms he didn’t want her leaving his bedroom. She was relieved.</p><p>Trevor was thriving and the time was passing by pleasantly. One day, while Mark was out giving Trevor a riding lesson, a knock sounded at the door. Edward was doing some shopping so Emily went to answer.</p><p>A man was standing there in a uniform with a clipboard that Emily didn’t think anything about. “Are you Emily Jackson?” the man asked her pleasantly.</p><p>“Yes, how can I help you?” she asked him, still not concerned.</p><p>“I have a special delivery for you, can you sign here?” he asked.</p><p>“Sure,” she responded and signed the paper, thinking it was something Mark had ordered.</p><p>“Thank you, you’ve been officially served,” the man stated and quickly walked away.</p> <p>Emily looked down at the papers the man had handed her. Her ex in-laws had found her and were serving her with new custody papers. They listed her as being in contempt of court and if she didn’t show up in California by the following Monday, which was less than a week away, she would be arrested and Trevor would be taken from her.</p><p>Emily immediately began to panic. She didn’t want to go to that courthouse, where the judge was in the pockets of her very wealthy ex in-laws. She knew beyond any doubt they would win.</p><p>She started doing some calculations and made the decision she would have to go on the run again. She had saved most of her income and had enough to get settled somewhere else and survive for several months but it would run out and if she didn’t find a job quickly, then her son and her would be homeless.</p><p>She didn’t want to leave Mark. She already loved him so much and Trevor was thriving. He would be so upset to move away. She saw how much he’d bonded with Mark. She couldn’t believe she had allowed herself to become so attached, when she knew all along the living situation was going to be a temporary one.</p><p>She was sitting at the kitchen table, silently crying when Mark and Trevor walked through the door. They were laughing and talking about how funny the new horses were while learning to walk around. One of the puppies, which was now huge, was trailing at Trevor’s feet. The sight of them made fresh tears fall.</p><p>She turned away and wiped her face, not wanting to upset her son. She hated she was going to have to pull him away from the ranch and the entire family. Was she a terrible mother to do it to him? It was the only way to keep them together, she reasoned with herself.</p><p>Mark immediately could tell something was wrong and sent Trevor upstairs to clean up and change for dinner. Once he was safely out of ear shot Mark sat down and waited for Emily to tell him what was wrong.</p><p>“They found me,” she simply said.</p><p>“Who did?” Mark asked her with confusion. She realized at that point she hadn’t told him anything about her custody issues.</p><p>“It’s kind of a long story,” she said to him.</p><p>“Well there’s no time like the present to start then,” Mark reassured her. Emily took a deep breath and then began the story.</p><p>Mark never said one word as she explained her terrible marriage and the controlling husband she’d been with. His eyes turned to slits as she talked about her ex in-laws and how they had tried to take her son from her. When she finished with the part about the Judge being in their pocket, he simply nodded like he understood.</p><p>“I didn’t have any other choice but to get away from there. I had to keep Trevor with me. I know they can provide him with everything money can buy but they would never give him love. They only want him because they lost their only son and are trying to look like the loving and concerned grandparents. They’ve barely acknowledged his existence before, though. They are nothing at all like your family Mark,” she finished.</p><p>“I’m sorry you’ve been through all of that Emily,” Mark said, as he took her hand in his. “I wish you would’ve shared with me sooner, so I could’ve been there for you. We could’ve already had this dealt with as well,” he continued.</p><p>“Mark I can’t beat these people. They know where we are now. I have no choice but to leave,” she said, on a little sob, as new tears started running down her flushed cheeks.</p><p>Mark said nothing for several minutes, as her tears continued to fall. He sat next to her, rubbing her back, as she got the last of her emotions under control. He then lifted her chin up so she was looking him in the eyes.</p><p>“Emily do you want to leave?” he asked her. He needed to know how she felt. He was going to help her no matter what the answer was but he needed to know she wanted to be there with him.</p><p>“Of course I don’t want to leave. Trevor is so happy here and I love you. I just can’t lose my son,” she said, exasperated.</p><p>In the heat of her passion and frustration she hadn’t noticed she’d told him she loved him for the first time. Mark let it wash over him and felt his heart growing. They were going to be okay.</p><p>“Emily you don’t have to leave. I want you and Trevor here. We are going to get married and have the custody hearing moved up here, where the judge can’t be bought. First we will try and get the Jackson’s to settle but if they want to fight, we will fight them. If Trevor’s grandparents want to fight you, they are going to have to go through me,” he said to her.</p><p>Emily stared at him with a mixture of horror and hope. He’d just proposed, or more like, demanded marriage and promised to keep her and her son together. She didn’t know what to say to him.</p><p>“Mark I can’t ask you to do that,” she finally responded.</p><p>“Emily, I love Trevor already as if he were my son. My family loves him too and we protect our own. I also can’t imagine waking up each day without you. I want you here and I won’t let these people pull us apart.” He said.</p><p>He wasn’t quite ready to actually express his love. He knew he couldn’t imagine his life without her but if he told her he loved her and she rejected him, it would kill him. He couldn’t go there.</p><p>“Emily, I‘d never planned on marrying before. Then I watched as both my brothers got married and had children and I realized it wasn’t such a bad thing. We could be really good together if you’ll just give it a chance. If things don’t work out for some reason, it’s not like you would have to be stuck with me forever,” he said with a shrug like it was no big deal.</p><p>It hurt her more than he would ever know to have him talk about them ending like it was nothing but he was right. If them marrying would keep her with him longer and keep Trevor safe, she had nothing to lose. She loved him and he said he cared about her, so maybe that would turn into love someday.</p><p>“Are you sure about this?” she asked him, giving him a last chance to back out.</p><p>“More sure than anything,” Mark said and gave her one of his sexy smiles. He leaned over and kissed her with a desire that took her breath away and left her wanting so much more.</p><p>“I have a lot of phone calls to make to get things started. We will wed on Saturday. Are you okay having it here at the ranch, or do you want a church wedding?” he asked.</p><p>“I would love to have it here. It doesn’t have to be anything formal,” she said reluctantly. She had always dreamed of her wedding day, with all the bells and whistles but this wasn’t your typical wedding and she couldn’t expect to plan anything extravagant in only a couple of days.</p><p>Mark actually laughed out loud at her statement. “I’m sorry to tell you Emily but the second I call my father this wedding is no longer a small thing. He would never let that happen. Be prepared for one huge extravaganza,” he said. He then left her to make his calls.</p><p>Emily was a bit disappointed. She knew what he said but there was no way possible a huge wedding could be planned in only a couple of days. She didn’t necessarily want it to be huge; she just would like it to be magical.</p><p>She shook her head at her own selfishness. She shouldn’t be disappointed she wasn’t going to get her dream wedding, when she was getting her dream man. She smiled, as she thought about being Mark’s wife. Even if he was talking about it as a temporary thing, she was still going to be his wife.</p><p>Emily barely made it through dinner before she headed up to their bedroom to lie down. She was exhausted and just wanted to sleep for a while. She was out before her head even fully hit the pillow.</p><p>The next morning Emily awoke to find Mark already gone. That was unusual, as he almost always woke her up by kissing her softly all over her body. She was sure he just had a lot to get done that day.</p><p>She took her time taking a shower and getting dressed. She knew she was going to have to make a lot of plans in order to at least have some flowers and cake at her wedding. She didn’t have anyone to invite, so she didn’t need invitations, or party favors but she would ask Jessica and Amy to stand with her.</p><p>She wouldn’t have them go overboard with fancy dresses. She herself was going to most likely wear a simple church dress. There was just no time to find her perfect fairytale dress. Mark most likely wouldn’t like that anyway. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She heard voices as she walked down the stairs and stopped as she entered the den. She looked around her in shock. There were people everywhere and every available space was covered with items. No one noticed her at first and she looked around at all the items.</p><p>She heard Joseph before she saw him, “No, no, no, that just won’t do,” she heard him yell at someone, in his loud and overpowering voice.</p><p>“I’m sorry Mr. Anderson. I will get rid of these right away and get the next set,” she heard some man say and then saw a little guy with a panicked expression rush by her and out the door.</p><p>“I can’t believe he even thought that would be good enough for my youngest boy and his beautiful bride,” Joseph said to someone.</p> <p>“Emily, there you are sleepy head,” Jessica said as she came running up. “I wanted to wake you up an hour ago but Mark threatened death to anyone who dared to disturb you,” she finished.</p><p>“What is going on?” Emily gasped.</p><p>“Plans for the wedding of course,” Jessica said, as if Emily had a screw loose.</p><p>“I don’t understand. Why are there so many people here?” she asked.</p><p>“You can’t have a great wedding in only three days without an army of people getting things done,” Jessica answered her.</p> <p>“I just thought we would have a small backyard wedding,” Emily managed to get out, as she stared at all the chaos around her. Jessica actually laughed at her.</p><p>“Come on Emily, you’ve been around this family long enough to understand they never do anything half-way. There’s no way Joseph would allow his last child to have a small backyard wedding,” she said through more giggles.</p><p>“Don’t panic too much, Emily. I thought I would hyperventilate on my wedding day. I was so not expecting the huge event they’d planned. I thought it would be us and a judge but trust me, I’m grateful now I got my dream wedding. I look through the pictures with Jasmine and she talks about the beautiful princess in the pictures, which just so happens to be me. I actually did feel like a princess. Let us help you make your wedding day the best one in your life,” Amy said, as she joined the conversation.</p><p>“I guess then I’m in your capable hands,” Emily said and soon would regret those words. The girls dragged her throughout the house, which she soon found was just as chaotic as the den. She tried so many cake samples she got a stomach ache. She was also measured, plucked and waxed.</p><p>The only part of the day that wasn’t overwhelming was when she sat down with the wedding dress designer. He let her describe her dream wedding dress to him and wrote it all down. He said it would be worked on night and day to make sure it was perfect in every way. She didn’t think it could be done but secretly hoped.</p><p>By the time the day was finished, she was practically crawling up the staircase to reach her room. She was sore from all the beauty treatments and beyond exhausted. She climbed into her big bed and passed out instantly again.</p> <p>The next couple of days were much of the same thing. She woke up to a houseful of people and ran from morning to night. She barely caught glimpses of Mark and didn’t even know if he was sleeping in the same bed. She couldn’t wait for the actual wedding to be over with.</p><p>“You’re not allowed to see Mark at all today. His brothers have whisked him off for a bachelor party, to an unknown location. The kids are all over at my house and will be tended to and we are off on the company jet to Las Vegas,” Amy said, as she came bursting into Emily’s room first thing in the morning.</p><p>“What?” Emily questioned her, trying to wipe the sleep from her eyes.</p><p>“It’s the day before your wedding, which means it’s time for your bachelorette party,” Jessica said, as the two girls jumped on her bed.</p><p>“I really hope you aren’t wearing one of your sexy lingerie pieces,” Amy added with a giggle.</p><p>“Me too,” Jessica said and then ripped the covers off of her. Luckily Emily had not been feeling sexy and was wearing her favorite old t-shirt and a pair of boxer shorts.</p><p>“Hurry up and get ready, we are leaving for the airport in one hour,” Amy said and then the two girls gave her some privacy.</p><p>Emily groggily got up and obeyed the two women. She was downstairs in thirty minutes and incredibly grateful for the fresh brewed coffee sitting on the counter. She poured herself a large mug and burned her tongue with her first drink.</p> <p>“Are you excited?” Amy asked.</p><p>“We are staying at the Mirage,” Jessica added.</p><p>Emily thought about it for a few moments and found she was actually excited. “I have never been there before,” she said shyly.</p><p>“Oh I wish it were for more than one day. There’s so much to do. I went there a couple years ago, for the first time with Lucas and had such an amazing time he let us stay a few extra days. We saw so many shows and I hate to admit it but I got hooked on black jack and ended up playing till it got light out one night. It was so much fun. I’m excited to have some girls to go shopping with this time. I love Lucas to pieces but he can’t understand the joy of shopping,” she finished off excitedly.</p><p>“Well let’s quit talking about it and go,” Jessica said.</p><p>“Don’t we need to pack anything?” Emily asked.</p><p>“Not a chance. We’ll buy whatever we need there. We don’t want to take anything with us, cause then that’s less room for bringing our purchases back,” Amy said.</p><p>“Sounds good to me,” Emily admitted. The three women headed out the door to the awaiting limo and drank some sparkling cider on the way to the airport.</p><p>They boarded the company jet and Emily looked around in awe. It was more beautiful than any of the hotels she’d been in. The luxuriously big seats were comfortable and there was even a flight attendant on board.</p><p>“Hello ladies. My name is Lana and I’ll be helping you on your short trip,” the far too perky blonde said.</p><p>“Hi Lana,” the three girls chimed together.</p><p>“What would you like to drink?” she asked them.</p><p>The girls put in their orders and Lana went off to get them their drinks. When she returned she told them breakfast would be served once they were at cruising altitude. Emily stared out the window, filled with excitement as the jet picked up speed and lifted off into the air.</p><p>“This is just too amazing,” Emily exclaimed.</p><p>“That was my reaction the first time too,” Amy said with a smile. “To tell you the truth it all still amazes me,” she added.</p><p>Emily smiled at her gratefully. They reached a certain altitude and the perky flight attendant came back with some fresh fruit and croissants. “The hot breakfast will be out in a few moments,” she said and left them again.</p><p>The girls ate their breakfast and made plans for the day. The first thing they were doing was some major shopping and then some gambling, followed by a couple of shows. Emily couldn’t wait until the luxurious jet ride ended.</p><p>They landed in no time and were whisked off from the airport in another limo. They drove down the strip and Emily’s eyes were glued to the window. She was looking everywhere she could. She wished they were going slower so she could see more of the area.</p><p>They pulled into the Mirage and were taken to their luxury suite. “Mark made the reservation for us. I told him it was silly to get such an expensive room, considering we weren’t going to be spending much time in it but he insisted on only the best for his bride,” Jessica said to Emily.</p><p>Emily was so awed by the amazing suite she had tears in her eyes. The room was bigger than her old apartment, by twice the size. There was a huge living room area and three bedrooms. Fresh fruit, chocolate and flowers were displayed on the table. She wished she had an entire week to spend in the suite alone.</p><p>“Time to go,” Amy said, barely able to contain her excitement.</p><p>“I agree, there’s a lot of shopping to do and very little time to do it,” Jessica added.</p><p>“Okay,” Emily reluctantly agreed and followed her two friends out.</p><p>Emily may have been reluctant to leave the luxurious suite but soon found herself glad she did. The strip was phenomenal and she wanted to stop and look at everything. When they reached Caesars Palace and started shopping, she was hooked.</p><p>She’d never been a materialistic person and was still reluctant to use the credit card Amy had placed in her hand but it was hard not to enjoy the gorgeous mall they were traversing through.</p><p>“Mark said if you didn’t come home with several bags, he wasn’t going to be happy,” Amy said as she pulled Emily towards an exclusive lingerie boutique. “I think this would be a great place to start,” she said with a giggle.</p><p>They shopped for several hours, then had their items taken back to the suite, while they enjoyed a buffet lunch. “I think I’m going to gain ten pounds on this trip,” Amy said, as she sat back, rubbing her very flat stomach.</p><p>“I agree,” moaned Jessica.</p><p>“I’m not going to fit into my own wedding dress,” Emily added with a satisfied smile.</p><p>“Well we better go walk off all this food then,” Amy said and they were off to explore some more of the city.</p><p>They watched a pirate fight in front of Treasure Island and a volcano explode on the strip. They took a gondola ride and walked so much Emily’s feet were killing her by the end of the night.</p><p>The girls finally stopped in the casino and played some blackjack, which they were horribly unsuccessful with, then crawled back to their room as dawn was breaking, to catch a few hours of sleep.</p><p>When their car picked them up at noon, they were all much quieter on the trip home and fell asleep the entire jet ride back. Soon they were picked up from the airport, heading back to the ranch to be pampered and dressed for the evening wedding.</p><p>Emily didn’t even have time for her nerves to get the better part of her. Before she knew it she was standing behind a set of closed doors, waiting for her time to walk down the aisle. Her panic started to set in at that moment.</p><p>Chapter Eight</p><p>Jessica and Amy were fussing with Emily’s dress, making sure everything was perfect. She was breathing deeply in and out, trying to calm herself, as the music began. She couldn’t calm the rapid beat of her heart.</p><p>She reached up her hand to rub the pounding. She was scared to death. Her son was already out there, looking so handsome in his little tuxedo. She’d been so proud when he’d told her he was standing up with Mark as one of his best men.</p><p>“It will be okay, take some more deep breaths. Jessica and I will walk down the aisle and then you’ll follow us out in about two minutes okay,” Amy said to her.</p><p>Emily felt instant panic at the thought of walking down that aisle on her own. She didn’t think she’d be able to do it.</p><p>“Wait,” she said in a panic. “We don’t have to do it the traditional way, we can all walk together,” she begged the girls.</p><p>They looked at each other like she had lost her mind, saw the panic in her eyes and then shrugged. “Sure,” they said in unison.</p><p>“Thank you.” She started to feel a little bit better.</p><p>“Hey it’s our job as your maids of honor to get you down the aisle. We wouldn’t be doing it right if you ran in the other direction,” Amy said with a smile. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You guys are the best.”</p><p>“Don’t you dare ruin your make-up,” Jessica said as she wiped at her own eye.</p><p>The three women laughed and then threw their arms around each other. Emily could feel her pulse start to slow down.</p><p>There was knocking at the door. “Is everything okay in there?” Joseph asked through the doorway.</p> <p>“Everything is fine. We are coming out in a moment,” Jessica said.</p><p>“Good to hear,” Joseph said and then they heard his footsteps start to retreat.</p><p>Jessica stepped out of the doorway, with her two new sisters on either side of her. There was a gasp from the audience as the three beautiful women made their way towards the stage. Not one of them realized the stunning picture they made.</p><p>The men standing at the end of the aisle couldn’t take their eyes off the glorious women. The sight of them was enough to stop traffic, or cause a riot.</p><p>Mark’s chest puffed out in pride, as he realized in just a few short moments, the beautiful vision walking towards him would be his wife. He wanted to run to her and pull her into his arms. It took everything he had to stand there and wait for her to reach him.</p> <p>The ceremony went by in a blur and before Emily knew it the preacher was pronouncing them man and wife. Mark took her in his arms and pressed his lips gently to hers. It was slow and sweet and took her breath away.</p><p>She felt like she was floating on a cloud as they made their way back down the aisle and then stood there greeting guests. She was on autopilot as they cut the cake and sipped champagne. She wouldn’t be able to repeat a word that was said during the toasts. She had ears and eyes for nothing but her husband.</p><p>When it was finally time for the dancing to begin, Emily melted into Mark’s arms and laid her head against his chest. He gently rubbed her back, soothing her nerves completely. He was the most magnificent man she could have ever hoped for.</p><p>He sang along to the country tune that was being played by the live band and she glided along the star lit dance floor, like a true princess, being courted by her prince charming. She couldn’t believe a wedding could be so magical or she was Mark’s bride.</p><p>“Have I told you how beautiful you look?” he asked her.</p><p>“Only about a hundred times tonight.”</p> <p>“You’re always gorgeous but seeing you walking down the aisle in that dress has taken all rational thoughts from my head,” he said as he spun her around.</p><p>“Seeing you in that tuxedo, looking so striking has made me want to strip it from you piece by piece,” she whispered.</p><p>Mark’s whole body tensed at her softly spoken words. He pulled her tightly against his body and even through the layers of silk and lace she could feel how her words had affected him.</p><p>“Let’s get out of here,” he pled with her.</p><p>“That sounds perfect to me,” she responded and took his hand as he started to lead her off the dance floor.</p><p>They both heard a commotion over by the caterer’s station and turned to find out what was going on. They heard one of the security guards on staff tell someone to leave immediately, before there were consequences.</p><p>They both walked towards the commotion to find out what was going on. Emily gasped when she discovered who was causing all the turmoil. She spotted them about two seconds before they saw her.</p><p>“Do you really think the judge is going to believe this sham of a marriage you little slut?” a middle aged woman spat at Emily.</p> <p>“What are you doing here?” Emily asked them in complete shock.</p><p>“We came to get our grandson. You stole him from us and with your husband barely in the grave, it looks like you found yourself a new man to throw his money at you. You always were a gold digger. We begged our son not to marry you. We even told him the boy wasn’t his. We were shocked when the DNA results came in,” the woman continued to throw insults at Emily.</p><p>“You had my son tested without my knowledge,” Emily raged at her. Mark was impressed the only thing she even bothered to comment on was the violation against her son.</p><p>“Of course we did. You didn’t think we were going to take the word of some tramp the boy was really our son’s did you?” the woman spit out.</p><p>“If you don’t want anything to do with him, then why would you fight for custody?” Emily asked the horrible woman.</p><p>“You took our son from us, now we will take yours from you,” the woman said in explanation.</p><p>Mark was stunned by the hatred coming from the woman who used to be Emily’s mother-in-law. He didn’t know someone could be that cruel and evil. He’d never been tempted to hit a woman in his life but had to fight like hell not to slap her.</p><p>“You won’t come near my son. You never wanted him and you won’t use him as some pawn in a game I don’t want to play,” Emily said, with the full force of a mother’s protectiveness in her voice.</p><p>“You stupid little girl, you can’t beat us,” the woman spat.</p><p>“You try and take my son and you’ll see how I beat you,” Emily said, deliberately misinterpreting her meaning.</p><p>“We’re taking Trevor tonight. Where is he?” the woman said and started moving towards the wedding reception area.</p><p>“Over my dead body,” Mark told the woman, stepping in front of her.</p><p>She sneered at Mark and then stumbled backwards, as he was flanked on either side by his brothers. The three of them standing there made an intimidating sight.</p><p>“Security, escort this couple off my grounds. If they fight you in any way call the sheriff. He’s a personal friend and will be here in minutes,” Mark added as he glared at the hateful woman.</p><p>“Fine we will go for now but enjoy your pretend family, because come Monday morning, the boy will be ours,” she said, before turning around and stomping away. Her husband followed meekly behind and the security guards followed behind them both, making sure they really did leave.</p><p>“Emily I’m so sorry that happened,” Mark said to her, as he pulled her shaking body into his arms.</p><p>“No Mark I’m the one who is sorry. You shouldn’t have to be involved in this,” she said on a sob.</p><p>“You didn’t deserve any of the things she said to you. Don’t let her have power over you by affecting you in any way at all,” he said as he clasped her chin in his gentle hands.</p><p>Emily looked into his eyes and realized he was right. If she broke down then she was giving a small victory to the woman. She refused to do that.</p><p>“Do you want to leave?” he asked her.</p><p>“No, you are right; I’m not going to let her ruin my wedding day. If you’ll give me a few minutes to freshen up, I would like to dance some more,” she said to him with a brave smile.</p><p>“Anything you want,” he answered her.</p><p>Emily walked into the house and began attending her smeared make up. As she stared at herself in the mirror, she was surprised by the look of determination in her own eyes. You’re stronger than you thought, she mumbled to herself. She placed a smile on her face and then walked out to enjoy the rest of her wedding night with the new family she was so lucky to have become a part of.</p><p>“I’m sorry your honeymoon is being postponed,” Mark said to her, as they flew down to California in the luxury jet.</p><p>“Oh, Mark there’s no way I could enjoy a honeymoon with this stuff hanging over our heads.”</p><p>“Well still, it’s not right.”</p><p>“I don’t need some fancy honeymoon, or this big diamond on my finger. I just need to know Trevor’s safe and you’re in my bed each night,” she said sincerely.</p><p>“Woman, you are a gift from the heavens,” he whispered to her before kissing her with his usual passion. They were interrupted by the perky Lana as she brought them their lunch.</p><p>“I know this is petty and mean but I’m not comforted by the fact you’ll travel at times without me and be alone with that woman. She’s far too pretty and nice,” Emily said with a slight pout.</p><p>Mark threw his head back and laughed out loud. “I have to say I enjoy this jealous side of you,” he teased her.</p><p>Emily glared at her new husband. He wasn’t going to enjoy it when she poked him in the eye with her fork, she thought.</p><p>“I’m sorry for laughing but Lana is perfectly harmless. She’s very happily married to the pilot in front so you have absolutely nothing to worry about. Do you really think Amy and Jessica would allow their husbands to travel the world with a single lady?”</p><p>Emily didn’t know why she hadn’t asked the girls if Lana was single. The topic had just never come up in their whirlwind trip.</p><p>They reached their destination far more quickly than Emily had expected and were driven to an attorney’s office. They had a scheduled meeting with the Jackson’s before the hearing the next day. Mark said he thought he could get them to drop the case.</p><p>She was praying Mark was correct and the whole mess could be left behind them. She wanted nothing more than to have a worry free and normal life. She was a little afraid though, after the danger went away Mark wouldn’t feel the marriage was necessary.</p><p>They’d only been married a few days and it would destroy her if he asked her to get an annulment. She was strong though and could make it through anything, as long as she had her son with her.</p><p>They walked into the fancy attorney’s office, holding hands, showing a united front. She was shaking on the inside but to anyone looking at them, she looked confident and at ease. She was thankful no one could see the pounding of her heart.</p><p>“Just breathe,” Mark whispered to her as they neared the conference room.</p><p>“I’m trying.”</p><p>They were led into a huge room with a square table surrounded by chairs. There were two extremely well dressed men sitting at one end, otherwise the room was empty.</p><p>Mark led her over to the chairs next to the men and sat down. A woman came in bringing coffee and tea. There were several baked goods sitting out as well but there was no way Emily would be able to get anything down her throat. She was barely even able to sip the coffee and did so more to occupy her hands than for any other reason.</p><p>“Thank you for arriving early Mr. and Mrs. Anderson. We have the papers all drawn up and the investigators report. I think this meeting will go in your favor and you can put all this behind you and get on with your lives,” the older gentleman said.</p><p>Emily was a bit confused, as there hadn’t been much time for Mark to fill her in on everything. He’d told her a private investigator had been hired to look into the Jacksons past and current lives but she didn’t know much beyond that.</p><p>Mark glanced through the papers and then sat back with a huge smile on his face. “You’ve done your usual amazing job Dillon, thank you,” Mark said.</p><p>Emily looked at him questioningly but at that moment her ex in-laws stepped through the door with their attorney. Mrs. Jackson glared at both Emily and Mark but didn’t say anything as they moved around the table to sit across from them.</p><p>“Hello I’m Mr. Abrams and I’m representing Mr. and Mrs. Jackson. I’m glad you wanted to meet before the hearing, as this could speed things up. My clients went through the legal system to secure custody of their poor and neglected grandson. Ms. Jackson, um excuse me, Mrs. Anderson now, thought she was above the law and fled. It’s pretty cut and dry she’s not fit to raise the child. We have agreed to a supervised visitation schedule, which I think is more than generous, considering the circumstances,” the man said as soon as were seated. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mark smiled at the attorney and at the Jackson’s. So they thought by jumping right in and going for intimidation was their best tactic, well they had never dealt with a man as powerful as him before. He found he was actually enjoying himself.</p><p>He glanced over at Emily and saw the fear in her eyes and his enjoyment evaporated. He may have been used to dealing with crooked people but she wasn’t and he needed to remember that. He placed his hand on her leg and gave it a reassuring squeeze, to let her know it would all be okay.</p><p>“Mr. Abrams, I don’t want this to turn into a power match, so we’re going to get right to the point. We have documentation here showing the harassment your clients have done to Mrs. Anderson. We also have witness statements from personal friends of the Jacksons, showing they’ve shown no interest in the child, ever. Here’s the video from the wedding showing Mrs. Jackson’s true intentions for taking custody of the child,” their attorney began.</p><p>“This is all hearsay and you know it,” Mr. Abrams said, seemingly unconcerned.</p> <p>“We also hired a private investigator, who has managed to find some interesting information on how Mr. Jackson runs his business,” the attorney said and passed copies of all the evidence. Emily watched as both Mr. and Mrs. Jackson turned white as they glanced down at the papers before them.</p><p>Their attorney, who had seemed so confident and smug only moments before, now looked confused as he bent his head to speak privately with his clients. Mark sat back and watched them try and regroup. Their own attorney said nothing else as they waited for the full realization of the situation to set it.</p><p>“This has nothing to do with the custody case,” Mr. Abrams sputtered, trying to recover from the shock.</p><p>“You’re very correct that it doesn’t have anything to do with the custody case but Trevor has nothing to do with the case either. The Jackson’s are trying to take custody for some sort of position within their community, or for revenge but not out of concern for the child. My client’s a loving mother and isn’t going to relinquish custody. If your clients want to pursue this matter further, then we will bring all of this evidence to court. If they would like to go ahead and sign these papers here, giving up this battle, we’ll leave them alone,” their attorney said, with a deadly calm.</p><p>Emily realized why Mark had chosen this particular law firm. The men were really good at their job. She was actually starting to have some real hope.</p> <p>“We will return in a moment. I need some time to talk privately with my clients,” Mr. Abrams said, as he stepped out of the room with her ex in-laws.</p><p>Mark turned to smile at her. “We have them on the run. This will all be over in a matter of minutes,” he reassured her.</p><p>“Are you sure?”</p><p>“They’ve never wanted Trevor. They just wanted to play some power game with you and they’ve lost. They’re going to have no choice but to admit defeat,” he reassured her.</p><p>Emily wouldn’t celebrate until the paper was signed. If and when it was, then she’d jump up and down for joy. She warily eyed the Jacksons and their attorney as they walked back into the room. They seemed older to her somehow, as they stepped through those doors.</p><p>There was no glaring this time around. No one even made eye contact as they made their way back to the table and sat down.</p> <p>“My clients have agreed to sign the documents, so long as you sign a paper saying you’ll never pursue this other matter,” Mr. Abrams quietly said.</p><p>Their attorneys looked over at them and Mark shook his head yes. “Done,” the attorneys said. It was all over within a few minutes and Emily found herself sitting alone with Mark.</p><p>“It really is done?” she asked him.</p><p>“Yes, they can’t come after you again. They’ve relinquished all rights to Trevor,” he reassured her.</p><p>“Thank you so much Mark. I don’t know how I can possibly repay you,” she gasped. She threw her arms around him and held on tight, as the tears of relief washed down her face. He rubbed her back, as she let the joy and sorrow wash through her.</p><p>“Now that all of this mess is over, how about we start our honeymoon?” he asked her.</p><p>Emily looked into her strong husband’s eyes and was in total conflict. She wanted to be rushed off to a romantic location, where they could lay by the beach for hours, making love all night but the mother in her needed to hold her son and be reassured they really were going to be together, with no chance of him being taken away.</p><p>Mark saw the turmoil in her face and was one step ahead of her. He’d known she would want to be with her son. He knew Emily more than she realized.</p> <p>“Why don’t we start with a nice lunch? You’ve barely eaten the last couple of days,” he said.</p><p>Emily realized she was starving. The stress of the upcoming court battle had taken all appetite away and now, with it over she could clear out an entire buffet table.</p><p>“That sounds great. I could really use some Mexican food,” she said hopefully.</p><p>“Great, then I know the perfect spot to take you,” he told her and hailed a cab once they got outside.</p><p>He brought her to a great little Mexican cantina and Emily gobbled down almost the entire bowl of chips and salsa. She laughed a little sheepishly and shrugged at him.</p><p>They sat there, right on the beach with the wind blowing over the patio and had a few margaritas, eating far too much food and Emily felt pretty good. She was anxious to get to her son though.</p><p>“Can we head back tonight?” she asked Mark.</p><p>“I want to show you something first,” he said to her.</p><p>“Okay,” she agreed reluctantly.</p><p>He paid the bill and then headed out to the street to call another cab. It pulled up in front of a fancy hotel and Emily had to fight her disappointment. She did love Mark and spending time with him was always amazing but she wanted to reassure herself her son was safe. She needed to hold him in her arms.</p><p>She followed Mark inside and resigned herself to seeing her son the next day. Mark was tired and didn’t want to make the return flight home. She could understand that.</p><p>Mark stepped through the lobby and around the back of the hotel, through a double set of doors. They were standing at a huge pool with slides, diving boards and fountains. There was even a little bar floating in the middle of it all.</p><p>“Wow Mark, that’s the coolest pool I’ve ever seen,” she said.</p><p>“I thought you may like that,” he said with a wink.</p><p>“Mom, Mark you finally got here,” Emily heard her son calling.</p><p>She whipped her head around and running down the side of the pool was Trevor, followed by Jasmine. She saw Lucas and Amy, Alex and Jessica and all the other kids milling around too. Her eyes filled with tears once again, as she thought about how amazing Mark was. He knew she would need to be with her son, so he was giving her a honeymoon and her son. She kissed him gently on the lips, before bending down to take her son into her arms.</p><p>“Mom I got to fly on a real airplane with Jasmine and everyone. They gave us drinks with tiny umbrellas in them and we even got to watch a movie. It was so cool, Mom,” he was talking to her at ninety miles an hour.</p><p>“Wow, Trevor. That sounds so great.”</p><p>“I’m going to swim some more with Jasmine. We swim to the spot over there and then the guy gives us soda in a coconut,” Trevor said, trembling with his excitement.</p><p>Emily laughed at her son’s enthusiasm. She loved he was having such a great time. She loved how happy he was and she loved that Mark was the person responsible for it all.</p><p>“Have fun then baby, I will keep an eye on you from here.”</p><p>“Ah mom, I’m not a baby,” he mumbled and looked around to see if anyone else had heard.</p><p>“I’m sorry, Honey, or course you aren’t,” she apologized and then ruffled his hair.</p><p>Trevor was appeased and jumped back into the pool with Jasmine, where they made a beeline for the floating bar.</p><p>“Have I told you how completely amazing you are?” she asked Mark, as she once again threw her arms around him.</p><p>“I don’t think I’ve ever heard you say that,” he joked with her.</p><p>“Well you’re the most amazing man in the world. You think of everything, don’t you?”</p><p>“I’m thinking I should take you up to our room to change right now,” he said seductively, as he pushed on her lower back, bringing her in contact with his hard body.</p><p>“Mmm, see, you’re always thinking,” she said and rubbed her tongue over his bottom lip. Mark groaned, before locking his lips onto hers and gripping her backside, so she could feel his desire.</p><p>“I hate to break this up guys but there are kids all over the place and you are getting a bit X-rated,” Lucas spoke to them, while unsuccessfully trying to hide his laughter.</p><p>Mark finally broke the kiss but only to glare at his brother. “We’ll be back,” Mark growled and took Emily’s hand, as he led her towards the elevators.</p><p>“Poor Lucas, you were kinda rude to him,” Emily teased Mark.</p><p>“He’s lucky he didn’t get punched in the face,” Mark growled.</p><p>Mark pulled her onto the elevator, where thankfully they were alone. He slipped his hand under her shirt and massaged her aching breasts, while his lips devoured hers. When the bell chimed its arrival at their floor, he dragged her down the hallway and had her in the room in seconds.</p><p>They didn’t return back to the pool for several hours. When they did, Lucas and Alex looked knowingly at the newlywed couple and Jessica and Amy made their own plans to get their husbands alone a little bit later.</p><p>Chapter Nine</p><p>“Let’s go, Mom,” Trevor said, as he jumped on the bed between Mark and Emily.</p><p>“What time is it?” she groggily asked her son.</p><p>“It’s Eight already. We have to hurry so I can have breakfast with Mickey Mouse,” he said while bouncing on the bed.</p><p>“Okay, Okay,” she mumbled. “Go back over with the other kids so Mom can get a shower and get dressed,” she pled with her son. He sighed at her like she was killing him but obeyed.</p><p>“How about I join you in the shower and wash your back,” Mark offered with a wicked smile.</p><p>“If you do, we’re never going to make it downstairs and Trevor will disown us both,” Emily said sadly. She was reconsidering having her son on her honeymoon. They’d switched hotels yesterday and were now staying in the Disneyland Park. The kids were all excited and she had to admit she was enjoying it too.</p><p>She was enjoying everything except getting up far too early, when she’d made love with her new husband half the night.</p><p>She and Mark made their way downstairs to the lobby, where the rest of their family was already sitting down. Trevor was squealing with joy as Mickey Mouse was talking to him. Jasmine was smiling up at one of the Disney Princesses and the adults were all gulping down coffee like it was a lifeline.</p><p>“You look tired, Bro,” Alex said with a smirk, as they approached. “Did something keep you up all night?” he asked and then winked at Emily. Her face instantly turned a dark shade of red.</p><p>“You’re one to talk, as I see some pretty dark circles under your eyes,” Mark said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hey, some of us didn’t get so lucky because of all the kids in our room,” Lucas grumbled good naturedly.</p><p>“Thanks for watching Trevor,” Emily said shyly. She was embarrassed at the thought the adults at the table knew what she and Mark had been doing the night before.</p><p>“Don’t worry my new sister, you’ll be returning the favor tonight,” Amy said with a wink.</p><p>“Hey this is our honeymoon, we should be kid free,” Mark said.</p> <p>“There’s no way I’m not taking advantage of one kid free night while out here,” Lucas said before punching Mark on the arm. Mark conceded his defeat.</p><p>The three couples wore out the children by taking them all over Disneyland. They were excited about the rides and Trevor insisted on going on the Indiana Jones ride three times. Jasmine wanted to go in the haunted house and then buried her head in her daddy’s neck the entire time.</p><p>It was a day full of fun. By the time they got back to their rooms, no one had any energy for anything other than sleep.</p><p>The next day the family was heading home with Trevor. Mark needed to get at least a couple nights alone with his new bride and was surprising her with an unknown location. She couldn’t wait.</p><p>Emily waved goodbye as the family climbed into an awaiting limo and headed for the airport. She and Mark were going to catch a commercial flight since the jet was being used. He took her through the terminal and she was surprised to find they were heading down to Mazatlan. She’d never been to Mexico and to be heading to a resort was pretty exciting.</p> <p>They arrived at the luxury resort and Mark led her to their suite. It was stunning. There was a balcony with a view of the beautiful Pacific Ocean and she could see the private pool with a panoramic view. A private hot tub sat in the corner with more space than any two people would need.</p><p>She rubbed her hand over the luxuriously silky bedding and couldn’t wait to crawl in with Mark. He came up behind her, putting his arms around her waist. He started rubbing her flat stomach and slowly inched his way up to her already aching breasts.</p><p>His mouth was nipping and licking at her neck and she leaned back into him so he could have easier access. His hand made its way back down her body and started rubbing her from the outside of her thin shorts. She could feel the warm heat pooling in her core.</p><p>She tried to turn around in his arms but he trapped her where she was. His hand slipped inside the waistband of her shorts and was suddenly rubbing the swollen nub, as he continued playing with her hardened nipple from outside of her shirt. His mouth licked and caressed her neck and ear.</p><p>“Please Mark,” she begged him. He groaned but still wouldn’t let her turn. He stroked her over and over again until she was falling apart in his arms. He flicked his finger a last time, which sent a shudder throughout her entire body and then gently sat her down on the bed, since she could no longer stand.</p><p>Emily sighed in pleasure as her body was so relaxed. The man knew how to turn her world upside down in a matter of minutes. She was at face level with his obvious erection. He wasn’t saying anything but she could see the affect their playing had on him.</p> <p>She began to unbutton his pants, when he laid his hand over hers. “That was just for you,” he said through gritted teeth.</p><p>Emily smiled up at him, as she pushed his hand away and continued undoing his pants. “And this will be just for you,” she said, before she took his throbbing staff deep into her mouth. He cried out in pleasure, as his hands gripped the back of her head.</p><p>She took him deeper inside, loving the feel of his hot and pulsing flesh filling her mouth. “Emily I can’t...” he began to cry out, when she felt him shake hard and felt his release wash down her throat. She licked along the length of him and gently nipped the head before finally releasing him.</p><p>He fell across the bed pulling her with him. “I love you,” he said quietly, while stroking her hair. She stilled as her world seemed to be completed. She looked deeply into his eyes to see if he was going to start to panic. He just smiled at her and brought his lips to gently kiss hers.</p><p>“Oh Mark, I love you more than you could ever imagine,” she said. They both lay there for a while, enjoying the feeling of being in one another’s arms.</p><p>“I’m starving,” she finally said, as her stomach protested not being fed. He laughed and pulled her off the bed.</p><p>“Let’s take a quick shower, eat and then go exploring,” he said feeling charged.</p><p>“Sounds great.” Their shower ended up not being so quick but she didn’t care. When she was in his arms, all her hunger was focused on him and not food.</p> <p>They made their way around the city and Emily was enchanted with all the shops and ended up loading Mark’s arms with souvenirs. She had to get something for everyone. He was so patient with her and even agreed to the big straw hat she insisted he wear. He grumbled about preferring his Stetson but took it all in good stride.</p><p>As the evening air cooled them off, they strolled barefoot down the beach, letting their feet soak in the warm ocean water. They enjoyed the moonlight and listened to the sounds of laughter surrounding them. Their hands never separated, creating a feeling within her of being treasured and wanted. She would be sad to leave their little piece of paradise.</p><p>They ate a candlelit dinner, in a little outside diner, right on the beach. Listening to the sounds of the waves crashing against the shore, she reveled in her new found happiness.</p><p>She looked around at the other couples, with their heads bent close together. Some were whispering to each other, while others were locked in passionate embraces. The location was an aphrodisiac for love and she was completely pulled in.</p><p>As they made their way back to their suite, she felt anticipation burning in her stomach. She couldn’t believe how much she always wanted her new husband. When they weren’t making love, she was thinking about it. She was ready to fall into his arms at any moment and she knew what they had was special.</p><p>He ordered champagne and strawberries and they laid on the bed, drinking and nibbling the berries, with the juices running down their bodies. He slowly began to lick up the mess she was causing.</p><p>Her breathing deepened, as he dipped into the cleavage of her shirt and sipped the sweet juice. He slowly began undressing her, kissing every inch of new skin he exposed. She was ready to take him inside of her in a matter of seconds.</p><p>His lips started trailing down her exposed flesh and when goose bumps appeared from the exquisite pleasure, he licked them away. “Mark,” she sighed his name.</p><p>He made his way back up her body, until their lips were once again dancing together. She slipped her tongue inside the moist recesses of his mouth and loved the shudder that ran through him. Her hand strayed down to his covered erection and rubbed the length of it.</p><p>He yanked the rest of their clothing away in seconds and then covered her body with his. He slipped inside her wet folds and sighed as he buried himself as far as he could go. Emily wrapped her legs around him, as he began the gentle thrusts, bringing her close to completion and then stopping, drawing out the torture for both of them.</p><p>She raked her nails down his back and pleaded with him to go faster. He nipped her neck and told her to be patient. When he leaned up on his arms, so he could push deeper, she ran her tongue along his hardened pecs, making him gasp. He finally gave them what they both wanted and crushed his lips to hers, as he sped up his rhythm.</p><p>She was convulsing around him in seconds, crying out his name, as the waves of pleasure washed through her. “Mark,” she cried out again as the sensations were taking her over the edge.</p><p>He exploded inside of her, pulsing over and over again. He laid there, his weight almost crushing her but she didn’t care. She could lie like that forever. She once again fell asleep in her husband’s arms, feeling at peace with the world.</p><p>“Don’t be afraid,” Mark coaxed Emily. She was terrified and thought her husband had lost his mind. There was no way she could be strapped to the flying tarp, as she referred to it. They were on a boat in the beautiful ocean and he had the brilliant idea for them to go parasailing.</p><p>“Trust me you’re going to love it. There’s no other experience quite like it,” he continued to coax her. Without Emily really being aware of what was happening, she found herself being strapped into the contraption she’d been desperately trying to avoid.</p><p>“I can’t do this Mark,” she said in a panic.</p><p>“If you don’t do it, you’ll have regrets. Close your eyes and the scary part will be over before you know it,” he said to her and then added insult to energy, by smacking her on the butt.</p><p>Emily glared at Mark and then with a determined look gave the okay to the boat captain. He seemed to know he couldn’t give her time to change her mind, because the next second he was speeding up and she started lifting in the air.</p><p>Her breath whooshed out of her at the sensation of flying. She was terrified at first but as she got to her full height and realized it wasn’t that far, her fears started to fade away and she found she was enjoying the ocean breeze running through her hair.</p><p>It was unlike anything she’d ever experienced. She started laughing at the sheer joy of flying through the air above the beautiful Pacific Ocean. She wouldn’t admit any of that to Mark, though. He was far too cocky as it was.</p><p>Mark could see the laughter on Emily’s face. He asked the captain to keep her out there a while longer. He knew once she tried it she’d think it was great. The first step in any new adventure was always the hardest.</p><p>When the Captain began to pull Emily back in Mark saw the disappointment cross her features. She made it safely to the boat and Mark asked if she enjoyed herself. She tried to play it cool and then gave up and threw her arms around him, thanking him for talking her into it.</p><p>“You can wipe that smug look off your face,” she said as she playfully slapped him on the arm.</p><p>“I wasn’t saying anything,” Mark defended himself.</p><p>“You didn’t have too, your face says it all.”</p><p>“Sorry about that,” he said but still was unable to wipe the smile away. Emily gave up on her mock anger because she was having far too much fun to even pretend to be upset.</p><p>“Do you want to do it again?”</p><p>“Can I?” she asked excitedly.</p><p>“How about we go together?”</p><p>“That sounds great,” she answered. The crew hooked them both up and soon they were in the air. Mark was holding onto her hand and the experience was even greater being high up in the sky with him.</p><p>“Look over there,” Mark said to her. Emily turned her head and then gasped as she saw a school of dolphins leaping from the water. They were beautiful as they rose into the air and seemed to hop across the water. They were talking to each other and looked like a group of kids playing.</p><p>When the crew brought them back down, Emily was once again disappointed. She found she had a new favorite activity and didn’t want it to end.</p><p>“Can we do that again tomorrow?” she asked him.</p><p>“Next time you don’t want to do an activity, I want you to remember this moment and maybe you won’t fight me so hard,” he said with laughter. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fine, I will remember and not be such a pain.”</p><p>The next adventure he took her on was snorkeling. She was getting so many new experiences and wanted to do every one of them forever.</p><p>Emily grabbed Mark’s arm as she gazed down into the water. She pointed below her and Mark watched as a turtle glided by. He pulled her into another location and pointed out the schools of colorful fish swimming by.</p><p>It was an exciting experience and by the time they came out of the water, they were both water logged and wrinkled up. They had lunch under an umbrella and rehydrated.</p> <p>As they sat at the table, some musicians came up, playing music and serenading them. Emily thought it was wonderful and searched her purse to give them a tip. “Thank you,” she told them.</p><p>“No, thank you pretty senorita.”</p><p>Another vendor stopped by with a basket of roses and Mark bought every last one for her. She blushed as the other patrons all clapped at the romantic gesture.</p><p>“You’re far too beautiful to have only one color rose.”</p><p>“You’re far too romantic to be real,” she replied. She leaned across the small table and kissed him softly. “Thank you, Mark.”</p> <p>“Ready to head to the room?” he asked hopefully.</p><p>“I’m very ready but you’ve promised me romance and I want to go dancing.”</p><p>“You are very right. Let’s enjoy the pool for a while and then I will take you to a salsa club,” he said, with a wiggle of his eyebrows. They laid out by the pool, soaking up the last few rays of sunshine, before the brilliant colors overtook the skies as the sun set.</p><p>They went to the room, where he once again tried to talk her into staying in but she was determined to go dancing in the romantic city. He took her to a smoky club and as she looked around, she was grateful it was dark, because the way people were dancing made her blush once more.</p><p>“Let’s dance,” he whispered huskily into her ear. Emily followed him out onto the floor and fell into his arms.</p><p>He began a game of seduction and she was a willing participant. His hands rubbed along her back and up her sides, brushing against her breasts. His mouth trailed down her throat and then back up to her lips, so he could tangle their tongues together.</p> <p>“Mark, you make me feel so...” she gasped, as he pressed his hips into hers. She moved her hands from his neck, gripping his hips, to pull him even closer. He groaned as he mimicked lovemaking with her on the dance floor.</p><p>They played with each other, anticipating the night to come, building up desires, so when they did finally come together it would be with an explosion.</p><p>“We have to leave now, before I forget we’re in a public place,” Mark growled into her ear and then licked along the lobe.</p><p>“I’m ready whenever you are,” she purred and wiggled her hips against him a bit more, just to test her power over him. By his reaction she had quite the control.</p><p>Mark led her out of the club and hailed transportation. There was no way he had the patience it took for the long walk back to the comfort of their room.</p><p>Emily woke up to the smell of fresh coffee and hot food. She was starving after her adventurous day and night. She climbed from the bed and slipped on the silky robe, feeling extremely feminine.</p><p>“How did you sleep, Beautiful?” Mark asked, as he came from the other room to join her at the table. She already had her mouth full of food and had to swallow before she was able to answer him.</p><p>“I kept getting woke up for some reason,” she teased him.</p> <p>“I can’t imagine who would ever do that.”</p><p>“I would have to say though, if I keep getting satisfied the way I have, it’s most definitely worth losing sleep over,” she said and gave him a seductive smile.</p><p>“Want me to show you some more pleasure?”</p><p>“I need nourishment,” she begged him, as she bit into a juicy piece of cantaloupe. Some of the juice dripped down her chin and Mark was quickly there to clean it up.</p><p>“I can’t seem to get enough of you,” he growled, before carrying her off towards their bed. They stayed there for a very long time, before finally deciding to enjoy their last day on the beach.</p><p>Mark showed her some new sites, took her for a romantic lunch and of course took her parasailing again. By the time they headed back to the hotel, Emily was once again ready to pass out. She couldn’t imagine a more perfect honeymoon than the one Mark was giving her.</p><p>Emily was sad as they packed their bags, to be taken downstairs. She wasn’t ready to return to the real world. She’d loved her time alone with Mark and was afraid that by stepping back into their normal lives they’d lose a piece of the magic they’d created.</p><p>The ride to the airport was silent as Emily took in everything she could before the inevitable plane ride. Mark could see her sadness and gently rubbed her back as they rode through the streets of Mazatlan.</p><p>She glanced out the window and saw a couple flying through the air on a parasail and sighed. She could easily stay there in the city for another week or even a month. Well she could if her son was there with them. She was already missing him and that made going home more bearable.</p><p>They walked through the airport and were seated in their first class seats before she knew it. The flight attendant offered them a drink and soon they were up in the air. A tear slipped down her cheek as she watched the beautiful Pacific Ocean slowly disappear beneath the low hung clouds.</p><p>“I will bring you back anytime you want,” Mark tried to sooth her.</p><p>“It’s not that Mark, it’s just been such a wonderful time being alone with you.”</p><p>“We will have plenty of time to be alone together,” he reassured her.</p><p>“You promise me?”</p><p>“Baby, I’ll be begging you to run off alone with me,” he said with a wicked smile. Some of the tension and sadness disappeared as she looked into Marks eyes. Maybe things would stay the same even with the real world intruding on them once again.</p><p>Chapter Ten</p><p>Emily smiled as she looked out into the yard at her son playing with the puppies. Mark was chasing them with the hose and Trevor was giggling while running away with two huge puppies at his heels.</p><p>As Mark doused them with water, the puppies started to yap and Trevor fell to the ground giggling. Emily couldn’t help but laugh along with them.</p><p>She’d been so reluctant to give up her fantasy world in Mexico but they’d been back for almost a month now and things had just gotten better each day. Mark hadn’t pulled away from her as she feared he might. He found excuses throughout the day to come into the house and steal kisses and chat with her, as she worked in the kitchen.</p><p>She had a secret to share with Mark but wanted to wait until she knew for sure. She thought he’d be really happy about it but there was a small piece of her mind that was insecure. She rubbed her still flat stomach, already protective of the child growing there.</p><p>She loved her son so much and knew she would love her new child with an equal passion. Her two favorite men burst through the kitchen door, soaking wet and laughing so hard there were tears rolling down their faces.</p><p>“You’re getting my floor all dirty,” she scolded them. She tried to keep the stern expression on her face but their pitiful looks worked their magic on her. “Go get cleaned up and come back with the mop,” she said with a smile. They rushed out before they could get in anymore trouble.</p><p>Emily laughed, as she continued to work on their dinner. She’d been having some horrible morning sickness and had missed making breakfast for the hands a couple of days that week alone. She felt really guilty about it but no one was complaining.</p><p>She was making it up to the guys by making extra special dinners and sending them with leftovers to snack on later. They told her if she kept cooking such good dinners, she could miss breakfast every day.</p><p>Mark stopped her paychecks and put her on all his accounts. She’d tried to insist on keeping things separate but he wouldn’t hear of it. He told her everything he had was now hers, too. She didn’t feel right about that.</p><p>He told her he was looking for another cook, because he wanted more time with his wife. She’d stubbornly refused to accept anyone else. Several people had come by for interviews and she’d managed to find something wrong with each one of them. It didn’t help they’d all been women and a few of them far too sexy to be around her husband, daily.</p><p>She knew it would be nice to have someone share the cooking, especially since she wasn’t feeling good but she loved to do it and was afraid if she allowed someone else in she’d be completely pushed out.</p><p>She made a decision if the perfect person came by it was meant to be, if not, her husband would have to deal with missing her.</p><p>The hands all decided to barbeque at the bunkhouse that night, so she finished making them salads and sent everything down with Trevor and Mark. They’d told her she didn’t need to make them anything but she would’ve felt too guilty about it.</p><p>As Mark, Trevor and her shared an intimate dinner alone together, which was a rare thing; Emily relaxed and ate with her first real appetite in several weeks.</p><p>“Mom, you and Mark are married now, right?” Trevor asked her.</p><p>“Yes baby, we are,” she said. He must’ve been really distracted, because he let her get away with the pet name.</p><p>“Does that mean we’re going to stay here forever?” he asked again, while looking at his plate. She was unsure where he was going with the conversation.</p><p>“Yes Trevor, that’s what it means,” Mark answered the question for her. Trevor smiled at Mark with the happiest expression she’d ever seen pass his little face.</p><p>“Does that mean you’re my Dad now?” Trevor asked shyly. Emily held her breath, not knowing what to say.</p><p>“I’m your Dad if you want me to be,” Mark said, with a little crack in his own voice.</p><p>“Then can I call you Dad?” Trevor asked with pure innocence. The next words Mark spoke could make or break her son. Emily held her breath without realizing it.</p><p>“Nothing in the world would make me happier or prouder,” Mark said and held his arms out to Trevor. Their son jumped out of his chair and rushed into Mark’s arms. Mark squeezed him tightly to his chest.</p><p>“I love you, Dad,” Trevor said and a little tear slipped from his eye.</p><p>“I love you, too,” Mark said, while holding on tightly. Emily couldn’t stay seated and wrapped her arms around them both, joining in the hug. They really were a family now. She could no longer keep her secret to herself.</p><p>“How would you feel about having a baby brother or sister?” she asked Trevor.</p><p>“I think that would be okay,” her son said, after thinking about it for a moment.</p><p>“I think it would be more than okay,” Mark added with a smile. “Do you want to get working on it?” he added, with a waggle of his eyebrows.</p><p>“We don’t need to work on it,” she said and laid her hand against her stomach. Mark’s eyes widened, as he realized what she was telling him.</p><p>“You are?” he said in awe. She shook her head yes. He jumped up from his chair and lifted her off her feet. He spun her around as he laughed with joy. Her head started spinning a bit and she pled with him to set her down. “I’m so sorry, are you okay?” he asked, as he rubbed her all over. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m fine Mark, maybe a little less spinning though,” she said with a smile. He smiled back at her sheepishly.</p><p>“I can’t wait to tell my family,” he said excitedly. “Not only do I get one son but soon another child. Thank you so much for all you’ve brought into my life.”</p><p>“You’re the one we should be thanking. You’ve given us so much, most importantly of all, making us a real family.”</p><p>“Let’s compromise and agree we’re all great together,” he said.</p> <p>They finished having their dinner together, then sat by the fire watching a comedy. The evening ended on a perfect note, with laughter and snuggling on the couch.</p><p>The next morning Emily was making the hands lunch when Joseph walked into the kitchen, startling her.</p><p>“Good morning, young lady. I hear congratulations are in order,” he said to her with a smile from ear to ear.</p><p>“Thank you, Joseph. Yes, you’ll have a new grandchild in about eight months,” she said with a radiant smile lighting her face.</p><p>“I will officially have a new grandson in a couple of days, since Mark submitted papers to officially adopt that beautiful boy of yours. Then I will also get the added bonus of another grandchild in eight months,” he corrected her.</p> <p>Emily smiled with joy at the pure acceptance of her child into the Anderson clan. She knew if ever anything were to happen to her he’d still be a part of their family and they’d always take care of him. That was the greatest gift any mother could receive.</p><p>“I was stopping by today anyway to let Mark know I’d found him the perfect cook and maintenance man, when he gave me the great news,” Joseph said.</p><p>“Who is this person?” Emily asked with suspicion. After all, Joseph had been the one to find her and she really didn’t want a young woman to be there all day.</p><p>“It’s actually a married couple. They’ve worked for the company for many years but want something different now. I told them about Mark needing another cook and they asked if he could use a maintenance man as well. With a place this big, two more people would be a blessing, especially with Mark’s growing family,” Joseph said.</p><p>Emily knew it sounded a bit selfish but she really didn’t want to share the house with two more people. She loved having Edward there but he always gave them privacy and most of the time you didn’t even know he was around. It would be much harder to get any privacy with her husband if two more people moved in.</p><p>“Mark has a little cottage right around the corner. They could live there and you wouldn’t have to share your newlywed space,” Joseph said with a wink.</p> <p>Emily turned scarlet, as she looked up at him. She was a little worried the man was a mind reader, among other things.</p><p>“I didn’t know that was there.”</p><p>“It was built years ago for a married couple, who worked here, but it has been empty for some time. We’ll have to bring a crew in to fix it up, but they could start in about a week if you like them,” he said.</p><p>“It wouldn’t be up to me.”</p><p>“Of course it’s up to you, Emily. You’re the lady of the manor now. Mark already knows them, they’re coming over for you to interview.”</p><p>“Oh,” she responded.</p><p>The couple arrived about an hour later and Emily fell instantly in love with them. They were in their early fifties and full of life. Mary had as much passion for cooking as Emily did and she knew they’d work well together. She also knew if she wasn’t feeling good Mary would be perfectly capable on her own.</p><p>Scott was her husband and although he was quiet, his face lit up when Trevor came into the room. He explained the two of them hadn’t been successful in having children and so they both took great joy in spoiling everyone else’s kids.</p> <p>“I would love it if you both worked here,” Emily said to them sincerely after visiting for a couple hours.</p><p>“I think we’re going to work wonderfully together,” Mary said to her, then gave her a hug. Emily agreed with her. It was going to be nice to have someone helping in the kitchen, especially when her stomach got in the way, eventually.</p><p>Mark came in and invited Scott to come over to the cottage with him. The two men were going to figure out exactly what the place needed and get the right people out there immediately. Emily was actually excited for the week to go by and the sweet couple to move in.</p><p>“Seriously, I’m so incredibly happy you’re working here,” Emily said to Mary. They’d moved in the previous week and Emily didn’t understand how they’d ever survived without them. Emily had been fighting morning sickness for a week straight and Mary had whipped her up some magic drink, completely curing her.</p><p>Emily was currently sitting at the table, with her feet up and the magic drink in her hands. Mary had insisted she rest until she was a hundred percent and had made the whole lunch on her own. The men were enjoying her cooking as much as Emily’s. They made sure to give the women equal praise, which was smart of them.</p><p>The incredible aroma of lunch cooking brought the men trampling into the kitchen, where they sat down at the table, bringing in non-stop laughter, talking and mud.</p><p>Emily loved every minute of the busy ranch life. She felt completely at home and each hand had a special place in her heart. Mark walked through the door with his usual tag along, her son, right behind him.</p><p>“Mom we’re going to rope cows today,” Trevor said excitedly.</p><p>“That sounds fun.”</p><p>“Yeah and then we’re gonna cas...cas... what are we gonna do again, Dad?” Trevor tried to get out.</p><p>“We’re going to castrate them,” Mark said with a smile. All the men groaned slightly.</p><p>“Oh,” Emily said and felt herself blushing.</p><p>“It’s just all part of ranch life,” Mark said with a shrug.</p><p>“Isn’t he too young to do that?” Emily asked with concern.</p><p>“He’s a big guy,” Mark said and patted Trevor on the head. Emily didn’t have the heart to say no to anything her boys wanted.</p><p>“This stew sure is great,” one of the guys said in between huge bites.</p><p>“Well, you have Mary to thank. She did all the cooking today,” Emily said fondly.</p><p>“Thank you Mary,” all the boys chorused together.</p><p>“You’re very welcome.”</p><p>The guys inhaled their food and then headed out the doors as quickly as they’d come in. “I’m getting quite attached to those boys,” Mary said as they all left.</p><p>“I know how you feel,” Emily agreed with her. The two women cleaned up the dishes and started prep work for dinner.</p><p>Their days continued in much the same way. Mark stayed closer to the house and let his hands get more things done, as he worked with Trevor every available moment. Emily spent her time in the kitchen and would sneak out with her boys any chance she got.</p><p>Over the next couple of months her stomach started to round slightly, not enough to show much but just enough to prove there was a baby growing. Mark would lay there for hours in the evenings, rubbing her stomach and talking to their growing baby.</p><p>He was an incredible father. Trevor loved him so much and he’d already gotten the nursery ready for the baby. She was content to spend her days cooking and visiting with Mary and her nights in her husband’s arms. She was finally allowing herself to accept her life was great and nothing was going to ruin it.</p><p>Chapter Eleven</p><p>“Do you really have to go?” Emily whined as Mark was packing his overnight bag. He’d gotten called to Montana for some urgent business. She normally would’ve gone with him but Trevor had a field trip the next day and she’d already agreed to chaperone it.</p><p>“Believe me, I don’t want to leave,” he said to her, as he paused in his packing, to pull her close to him and kiss her softly.</p><p>Mark slowly undressed his beautiful wife and loved her gently, not wanting to leave for even one night. They hadn’t spent a night apart since their wedding day. He was going to miss her more than he could imagine.</p><p>They got dressed and she walked with him downstairs. He kissed her one more time before heading out the door. He turned back to see a tear falling down her cheek and almost said to hell with it and walked back in. He hated to see her hurting.</p><p>“I’ll be fine, I’m just going to miss you,” she reassured him, when he paused as if undecided in what he should do.</p><p>“Are you sure you’ll be okay?” he asked her while he stood by the car, unsure of whether to open the door or not.</p><p>“I’m going to be fine. This is just pregnancy hormones acting up,” she reassured him.</p><p>“I’ll be back before you even realize I was gone.”</p><p>She stood watching until the car was out of sight. Walking into the house, she was engulfed with loneliness. The hands were all out on the North pasture, several miles away. Edward was at his families for a few days and Mary and Scott were doing some shopping. She wasn’t normally all alone in the huge ranch house and she decided she really didn’t like the feeling of it.</p><p>She decided to walk down to the far barn where new kittens had been born a couple weeks back. She knew the sight of them would definitely cheer her up until Trevor returned home from school.</p><p>Emily walked down the path to the now familiar barn. She went inside, which felt a bit eerie since no one was anywhere around. She laid there petting the kittens, feeling sorry for herself.</p><p>She heard a noise behind her but before she was able to turn around and see what it was, she felt a shooting pain in her head and all went black.</p><p>Mark reached the airport when his cell phone rang. He picked it up, thinking it would be Emily calling for one last goodbye.</p><p>“Hey Mark, you can cancel the trip, we got the issue solved,” the voice said.</p><p>“Are you sure?” Mark asked but he was already turning his car around to head towards home.</p><p>“Yeah we got it all fixed up. You can stay there, where I know you really want to be,” the man said with a chuckle in his voice.</p><p>“You got that right. I would much rather be with my family,” Mark said with a relieved sigh.</p><p>“What’s going on over there, you’re all falling head over heels?”</p><p>“We’ve just discovered it’s much nicer to have a beautiful woman at our side every night than to be out trying to find a new girl every weekend,” Mark said sincerely.</p><p>“I think I will go ahead and hold onto my bachelorhood,” his friend said and then hung up the phone.</p><p>Mark pulled up in front of the house and called out to Emily. He didn’t get an answer so he headed up the stairs. He smiled as he pictured her laying there in their bed. She did tend to take a few naps now and then with the pregnancy wearing her out.</p><p>He quietly opened the door and stepped inside. Emily wasn’t there either. He was still unconcerned. He searched through the house and then the pool and still couldn’t find her. He knew she had to be around because her car was sitting in the garage.</p><p>The property was far too quiet. He glanced around, then thought of the barn. She was most likely down there playing with the kittens again. He jogged down there and was relieved to see the open doors. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>None of his guys would leave the door open, so she had to be in there. He stepped through and was stunned to not find her. He crept over by the kittens and his heart seemed to stop in his chest.</p><p>He dropped down to his knees and fingered the scarf he knew belonged to his wife. When he examined the drops of blood laying there in the hay, his panic was escalated. What had happened? He ran back up to the house and called the hospital. Maybe she’d injured herself and called an ambulance to pick her up.</p><p>A few minutes later Mark had zero answers. It was time to call in for some help and send out a search party. His wife never strayed far without telling someone where she was. He picked up the radio and had all his men come in immediately. He then called his father, who would call his brothers.</p><p>Mark organized the guys and they all took different sections of the ranch. He’d been gone for less than an hour, so she couldn’t have gotten too far. He quickly thanked God he hadn’t gotten on that jet. If he hadn’t come home sooner she could’ve been out there all night before someone noticed her missing.</p> <p>Mark shook his head as he realized he was most likely overreacting. She was probably down by the lake, or reading a book, not far from the house. He seemed to have an irrational fear something was wrong. He couldn’t get the blood spatters from his mind. If it weren’t for that, he wouldn’t be nearly as panicked.</p><p>After the men searched every inch of the property, they met back at the house. Mary and Scott had returned and made coffee, tea and sandwiches and set them out for everyone. “You all need to eat and keep up your energy to find Emily,” she demanded of the men. They all obeyed, even though no one had an appetite at all.</p><p>Every person on the ranch had fallen in love with Emily and with her missing there was huge stress among all the hands. Mark’s family arrived while they were making a new game plan and he was relieved to have his father and brothers by his side.</p><p>“I’ve called search and rescue. They are going to bring out the dogs. We’ll take them to the barn, which is the last place we suspect her being and they will track her,” Lucas said.</p><p>“I don’t understand where she could’ve possibly gone,” Mark said, with his head in his hands. “It’s been hours and she never leaves without letting someone know. Trevor will be home in a few minutes and she’s always here when he walks in the front doors.”</p> <p>“We’ll find her, Brother. I promise you,” Alex said with conviction. He laid his hand on his brother’s arm in comfort.</p><p>The three brothers continued to talk about different options, as the women made call after call, trying to see if she’d been seen anywhere.</p><p>A news crew showed up and Joseph gave them a brief statement and then asked them to put her picture up. When someone disappeared, who was associated with the Anderson’s, it was front page news. Joseph hated he had to take the time away from his sons’ to give a statement, even if it was a short one.</p><p>Joseph finished and then told them to please stay back from his family. He knew he wasn’t going to get them to leave completely but he could keep them away from the house.</p><p>“Did they leave, Dad?” Mark asked when Joseph walked back in.</p><p>“Well, you know they won’t leave completely until she’s found but they’re at the end of the drive and away from the house,” Joseph reassured his son.</p> <p>“We’re going to find her right, Dad?” Mark asked his father. At that moment he felt more like a child, needing his father’s comfort, than a grown man with children of his own.</p><p>“I guarantee you we will find her and she’ll be okay,” Joseph promised his son. He prayed to God he could keep that promise.</p><p>Emily woke up with a pounding head. She tried to lift her hand up, to feel what the pounding was and found she was unable to move her hands. She tried to sit up and couldn’t move her body at all. She began to panic and started pulling her arms and legs.</p><p>She opened her eyes to view her surroundings. She was in some dingy bed, in a tiny room and her arms and legs were tied down. She started to cry as terror filled her. She couldn’t understand what was happening.</p><p>“Mark,” she cried out with a pain filled voice. There was no answer. “Mark,” she yelled again louder.</p><p>She heard a noise and at first felt relief, thinking Mark had found her. The door opened and a strange man walked through it. She’d never seen him before but he scared her to her very core.</p><p>“You finally woke up, I was beginning to worry,” he said to her, as he leered from across the room.</p><p>“Where am I and why am I tied up?” she asked the man, with a trembling lip.</p> <p>“You’re home,” the deranged man said. Emily didn’t know how to respond to what he’d said. She didn’t want to provoke his anger but she didn’t want him to think she wanted to stay.</p><p>“I don’t understand.”</p><p>“It’s really simple to understand,” the man sneered, as he moved closer to her. A shiver of disgust moved down her spine as the man leered over her.</p><p>“We had a connection and then you chose that stupid rich man instead of me. You accepted my flowers, you read my love letters and you still married him. Well, you’re mine now and you won’t be leaving here,” the man said.</p><p>Emily looked at him in horror. This was the person who’d been stalking her. She didn’t understand how that was possible. They’d found the pictures of her in Chris’s stuff and he’d been a convicted felon. She stared at the guy in confusion, as the reality was trying to sink in to her befuddled brain.</p><p>“I really don’t understand, because I’ve never met you before,” she said to him.</p><p>“We did meet. You helped me pick out some fruit at the supermarket when you were new in town and I told you I’d repay the favor,” he said. For the life of her she couldn’t remember the event.</p><p>“You said that would be nice and you would see me next time. I kept coming back to the store at the same time but you never showed up, so I sent you the flowers. I watched your face as you accepted them and you were smiling. I then sent you the notes and letters. I knew you wanted to be with me but Mark wasn’t letting you leave. Then you went and married him and cheated on me so I’ve been waiting until I could get you alone,” the creepy man said.</p><p>He was now sitting on the edge of the bed and Emily was beyond terrified. She was at his complete mercy, with no way to get away. Mark would never be able to find her; she didn’t even know where she was. She was so scared she was going to lose her baby due to this cruel man. She wanted to place her hand protectively over her womb but couldn’t move her arms.</p><p>“I’m really bad with names, can you tell me yours again?” she asked him, hoping to stall the man until she could figure something out.</p><p>“It’s Joshua remember?”</p><p>“Oh yes, now I remember,” she lied to him. She still couldn’t recall him.</p><p>“See we did have a connection, I knew if I got you away from that place you’d remember me,” he said as he ran his dirty hand down the side of her face.</p><p>“I’m really uncomfortable Joshua, can you untie me?” she asked him, in what she hoped was a friendly voice.</p><p>“Not yet,” he said and started to pace. “You could be trying to fool me. My daddy taught me women lie all the time to get what they want,” he spat at her.</p><p>“Joshua I wouldn’t lie to you,” she said, hoping to gain his trust.</p><p>“Just shut up,” he yelled at her and lifted his hand in the air, like he was going to hit her. Emily cringed away but luckily he never threw the punch. She lay there silently and cried. She prayed somehow Mark would find her.</p><p>“I’m going to make us some dinner, like a real family and then I will take you outside to use the bathroom because tonight you’ll finally be mine,” he said, before stepping out of the room.</p><p>Emily immediately began twisting against her restraints, trying to get at least one limb free. If she could get one hand out, she could undo the rest and perhaps run away. When the struggle was doing nothing but wearing her out, she finally gave up and decided to save her strength. It looked like her only shot would be when he released her to go outside. She’d been a pretty good runner when in high school, so if she could just get lose from him, she may have a shot at getting away.</p><p>The biggest problem was it was already getting dark out and she had no idea what direction to run in. She didn’t care. She would run until she just couldn’t go any further and then find somewhere to hide. The darkness would at least conceal her from him too. She would wait it out until dawn if that’s what she needed to do. She wouldn’t stay there and let the man violate her.</p><p>She laid there until finally the pain and exhaustion she was feeling overtook her and she drifted off into a restless sleep.</p><p>Emily was awakened by dogs barking and men shouting. She felt her hopes start to grow. Maybe Mark had found her and this whole nightmare would be over with. She waited and then heard the sound of her name being called.</p><p>The search team arrived at the house and Mark led the men to the barn. The dogs smelled the area and then immediately started pulling at their chains to follow her scent. Mark didn’t waste any time in following them.</p><p>Lucas and Alex were right there at his side and the three of them followed the search team through the woods. Mark couldn’t figure out why she would have possibly come this way unless it was against her will.</p><p>About a mile through the woods that bordered his property, the search crew leader stopped, pulling everyone in for a talk.</p><p>“I see a cabin over the rise there and the dogs seem to be leading us straight to it. Now we don’t know if Emily got hurt and sought out refuge, or if she was kidnapped but with the blood and the direct path leading to this place, it looks more like a kidnapping to me,” the search leader said.</p><p>“Let’s go then,” Mark said with a growl. If some beast had his wife, he was going to get her back right then and rip the man to pieces.</p><p>“Mark, I know you want to immediately rush in but that’s not the smart thing to do. We need to sneak up on the property. If someone has taken your wife and he’s inside with her and knows we’re there, it will turn into a hostage situation. The best outcome for Emily is if we can catch this guy on the outside. We’re going to come at the cabin from different directions. Let’s do a radio check to make sure your ear pieces are working. No one speaks louder than a whisper,” the leader commanded.</p><p>It was obvious to all involved the guy was a former military man. Mark was grateful he was the one in charge of the operation.</p><p>They split up and slowly made their way towards the cabin. Mark was with his brothers and the search leader was coming in from the side. As they crept closer, Mark heard a commotion and the dogs started going crazy.</p><p>“I’ve got him,” Mark heard someone yell.</p><p>“Check the cabin,” another voice piped in. Mark didn’t need any more prompting than that. He sprinted the last hundred yards, calling out Emily’s name and threw open the door, not worried about his own safety. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When Mark looked in the dimly lit cabin and saw Emily lying there, tied to the bed, every instinct in him said to run back out the doors and kill the man who had done this to her. There was no way he could leave her long enough to do that, though.</p><p>“Mark, I knew you’d find me,” she sobbed, as he gently sat on the bed and touched her. He felt all over her body, to make sure nothing was broken and then bent down to gently kiss her swollen mouth.</p><p>“I’m so sorry this happened to you, baby,” he said, through clenched teeth. He began untying her and had to hold the rage in, as he saw her reddened wrists and ankles. He couldn’t believe what that monster had put her through.</p><p>“I’m okay Mark, you got here before he could hurt me,” she said to him, with tears streaming down her dirty cheeks.</p> <p>Mark lifted her up onto his lap and sat there holding her close, so grateful she was safe. He continued to rub her back and run his hand over the bump on her belly. “The baby?” he asked, afraid to hear if anything was wrong.</p><p>“The baby is fine, I’ve been feeling movement but I definitely want to go get a check up right away. He hit me pretty hard in the head.”</p><p>Mark could see the dried blood on her beautiful hair and his whole body was tensed for a fight. He lifted her up and carried her out of the cabin. He couldn’t stand to have her in there for one more minute.</p><p>Soon they heard the sound of sirens, as the police and paramedics were coming down the overgrown dirt driveway. Mark held her in his arms until the ambulance came nearer. He quickly walked over to it and laid her gently down on the stretcher. The paramedic hooked her up to some machines and soon the sound of their baby’s heartbeat could be heard over the chaos all around them.</p><p>Mark breathed his first sigh of relief since discovering she was gone. He glared over at the man who was currently being loaded into the back of a police cruiser.</p> <p>“Mr. Anderson we have some questions we need to ask both you and your wife,” an officer said as he approached the ambulance.</p><p>“My wife needs to go to the hospital right away; can you please follow us there?” Mark asked the man.</p><p>“We can do that. This guy is getting taken into lock-up, so he won’t be harming anyone tonight,” the officer said and then walked away.</p><p>“We’re going to jog back over to the ranch and meet you at the hospital,” Lucas said, before he turned and started running up the hill with Alex.</p><p>Mark felt better as the ambulance started making its way towards the hospital. He would feel much better when they confirmed everything was okay with both his wife and his unborn child.</p><p>Emily was rushed into the ER and soon after, seen by one of the doctors, who happened to be a personal friend of Mark’s.</p> <p>“She’s going to be fine,” the doctor told them. “I want you to keep an eye on her tonight while she’s sleeping because of that bump. It looks like you got really lucky in finding her so quickly,” he finished.</p><p>“Thank you so much Jim, I appreciate you seeing her so fast,” Mark said, as he shook the man’s hand.</p><p>“You know I would do anything for you Mark,” Dr. Jim said and then left.</p><p>The doctor had given her some pain pills so her head wasn’t pounding anymore but she was sore and her wrists and hands burned. She wanted nothing more than to shower the grime off her body and sink into a bubble bath.</p><p>Mark helped her dress and she had to smile at the irony. He was usually trying to get her out of her clothes, not put them on. “This is a change,” she said with a flirty smile at him.</p><p>Mark looked at her in shock as he realized she was joking with him. “I love you, Emily. I can’t even think what could’ve happened if we hadn’t gotten there when we did,” he said with a thick voice.</p><p>“Mark, you did get there in time and I simply don’t want to think about that man or place anymore. I’m one of the lucky ones who was found because I have you,” she said, as she ran her hand over his cheek.</p><p>“Okay, for you I’ll try to stop worrying,” he said with a weak smile.</p> <p>“Thank you. Now let’s go home.” He took her hand and led her out to the ER waiting area. Lucas and Alex jumped up as soon as they spotted them.</p><p>“Are you okay? Is the baby okay?” they asked in unison. Emily nodded her head yes and then on impulse hugged each of the brothers.</p><p>“Thank you for caring about me. I’m glad to have you as my brothers,” she said as a tear slipped out. Both men were too choked up to say a word and instead hugged her tighter. A few minutes later they made their way outside to the car.</p><p>The men were treating her like a porcelain doll. Mark even held her head as she bent down to get in the car, worried she might bump it on the door jamb.</p><p>She sat in the backseat, snuggled up in Mark’s arms, on the short ride back to the house. When they pulled up the front door opened and the porch filled with her sisters, Joseph and Katherine, Mary and Scott and Edward.</p><p>She was once again overcome by emotion, as she looked at the amazing group of people who were her family. She walked up the steps and was engulfed in hugs and kisses and then led into the den, where she sat down, with a blanket thrown over her and a steaming mug placed in her hands.</p><p>“You drink this up and then we’ll get you upstairs to clean up before you have to do any talking,” Mary said, taking over like a mother hen.</p><p>Emily obediently drank the soothing liquid and realized it did make her feel better and seemed to give her some added energy, which she was seriously depleted of.</p><p>When she finished the drink, Amy and Jessica led her upstairs and she was relieved to jump under the soothing spray of hot water. She took her time washing any traces of the man who had taken her away and turned her skin pink from scrubbing so hard.</p><p>By the time she stepped out and put on some clean flannel pajamas she was feeling almost human again. “Please burn those clothes,” she said about the mud covered clothing she’d been wearing.</p><p>“No problem,” Jessica said and whisked the clothes off the floor, throwing them in the trash can. “They will be gone before you come in here again.”</p><p>The girls made their way back down the stairs and Emily was once again placed on the couch with a blanket thrown over her. Mark sat down next to her and pulled her tightly against his side.</p><p>Emily explained the whole story of how she’d been in the barn and she figured the man had approached her from behind, hitting her in the head with something.</p><p>“Is Trevor okay?” she asked.</p><p>“We didn’t tell him what was happening. We thought that would be best,” Joseph said.</p><p>“Thank you Joseph, I wouldn’t have wanted him to know,” she said, feeling relieved. She would check on him when she went up to bed, even though she knew he was safe.</p><p>“I know you’re all worried and waiting for me to fall apart any moment. I was terrified beyond anything when I was locked in that cabin but the terror ended the minute Mark walked through the door. I knew somehow he would be there to save me and I want you to know you really don’t have to worry about me,” she told them sincerely.</p><p>“Okay, we’ll quit the worrying,” Jessica said. “Well, we might worry a little but we’ll be sure to hide it from you,” she added with a laugh.</p><p>“Everyone can either use guest rooms here or head home but I’m taking my wife up to take a nice long bubble bath to ease her aching joints and then bed,” Mark said to his family.</p><p>“I think we’ll head home and hug on our children for a while,” Amy said as she walked over and hugged Emily.</p><p>“That sounds like a great idea,” Emily told her.</p><p>“We’ll do the same but we’re coming over this weekend with the kids so we can have a big family barbeque,” Jessica told her.</p><p>“Perfect. Thank you Jessica,” Emily said, excited to have the family over for another get together.</p><p>“Your mother and I are going to stay the night. We’ll feel better in the morning if we get to spend time with our grandson,” Joseph said. He and Katherine gave Emily a kiss before heading off towards the stairs.</p><p>“I love you guys,” she called after them.</p><p>“I’m going to make you some dinner to eat for after your bath. I’ll leave it on the table by the door. It will be something easy on your stomach,” Mary said and then rushed off to the kitchen.</p><p>“I really am grateful you’re okay. Since you’ve come into this old home there’s noticeably more laughter. You’re a beautiful woman inside and out,” Edward told her.</p><p>“Thank you, Edward. All of you are my family,” she said and then kissed his cheek. He mumbled something and then shuffled off.</p><p>“You, my beautiful wife, are incredibly loved,” Mark told her when they were finally alone.</p><p>“That’s the greatest gift I could’ve ever received,” Emily said to her husband.</p><p>Mark lifted her into his arms and gently carried her to their room. He sat her on the bed and then drew her a warm bubble bath. He slowly stripped the clothes from her body and kissed her gently, before carrying her into the bathroom, softly releasing her into the soothing water.</p><p>“Do you want to join me, I could use a foot rub?” Emily asked him. Mark stripped his clothes off and climbed into the opposite side of the tub. He lifted her foot into his lap and began to gently massage it.</p><p>Mark rubbed her feet and slowly massaged his way up her shapely calves and thighs. All thoughts of the day were washed away as Mark stroked her, from the soles of her feet to the top of her thighs and back down.</p><p>He turned her around and gently washed her back, then brought his hands around and ran his soapy fingers along her stomach and over the mounds of her breasts. She leaned her head back into his neck and let the sensations of his touch wash over her. She could feel his arousal pressing into her back and smiled with how masculine her husband was.</p><p>He finally rinsed them both off and carried her wet body to the bed. He ran the towel over her, making her ache for him. He then tucked her into the bed and pulled her into his arms.</p><p>“You know how much I love you, right?” he asked her, as he gently kissed her lips and throat.</p><p>“I think as much as I love you,” she answered him and then groaned.</p><p>“I think I was in love with you from the second I first saw you and Trevor standing there, so beautiful, after I’d been through such a rotten day,” he told her, as he continued to slide his hands all over her body.</p><p>“I fell in love with you the first time you talked kindly to my son,” she said, with tears in her eyes.</p><p>“Oh Emily how could I not love him, how could I not love you?” he said. He showed her how much long into the night.</p><p>Epilogue</p><p>Joseph sat in the chair, watching all his grandkids tear open their Christmas Presents. He was cuddling baby Tassia close to his chest. She was only a few weeks old and as beautiful as the rest of his grandkids. Mark and Emily certainly had the right recipe for creating a beautiful baby.</p><p>He smiled as he watched Trevor and Jasmine sharing chocolate. Jasmine had been a bit disappointed to find out Trevor was her cousin and she couldn’t marry him but she soon recovered when she found out it meant they got to spend more time together. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Isaiah and Emily were each rocking on their brand new horses and giggling in a way that made the whole room light up.</p><p>Katherine was playing Christmas songs on the piano and all the kids were singing along. Jessica had a really beautiful voice and when it was accompanied by Amy and Emily it sounded like angels from above.</p><p>The three boys were sharing a drink by the fire and every few minutes they would glance over at their wives, as if to make sure the women didn’t disappear on them.</p><p>Joseph was filled with pride at how well his matchmaking had turned out. He now had the large family he’d longed for and if things kept going as well as they’d been, he would be blessed with even more grandkids.</p> <p>He had to admit he was a bit disappointed he didn’t have anyone else to match up. He found he was really quite good at it.</p><p>“Dad, come have some of this Cognac, it’s really good,” Lucas called to him.</p><p>“Give me a minute,” he said. He reluctantly got up and placed Tassia in her portable bassinet, standing over her, making sure she didn’t wake up. He would be more than happy to pick her up again.</p><p>She stayed asleep, giving him no excuse to cuddle her close again. He walked over to his boys and held his hand out for a glass.</p><p>“I have to admit, Dad, Christmas keeps getting better and better each year,” Mark said as he once again glanced over at his wife and son.</p> <p>“I thought marriage would be the end of my life and yet I find it was truly the beginning,” Lucas admitted.</p><p>“I never thought I would take the plunge but without Jessica I’m only half a person,” Alex said.</p><p>“Of course all those wonderful babies sure makes the holidays bright again,” Joseph added as he glanced around the room filled with music and laughter.</p><p>“I hate to admit you were right, Dad, but we’re going to have to give you one,” Lucas said.</p><p>“Well that’s sure nice to hear every once in a while,” Joseph said, while puffing out his chest a bit.</p><p>“Merry Christmas everyone,” Alex said to the room in general. The room was filled with choruses of Merry Christmas’s and Joseph knew life was as great as it could possibly ever be.</p>  </body></html>"]