["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>Trip</p><p>“Scotch on the rocks,” I told the bartender before turning back to the party. Doing a quick sweep of the room, I took in all the crap hanging from the ceiling, streamers, paper bells and bird-shaped shit. The confetti and champagne glasses were strewn across every surface. It looked like cupid had walked in and puked on the place. The lovey-dovey shit was for the birds.</p><p>My eyes fell on Mace and Scarlett holding each other on the dance floor. Scarlett looking up at Mace like he’d hung the stars and moon. Mace looking down at her like she was God’s gift made just for him. The way they were with each other made me wanna poke my eyeballs out with a fork. Don’t get me wrong, I was happy for them. There weren’t two people I knew who deserved to be as happy as those two were, but the thought of being with one person for the rest of my life made me nauseous and claustrophobic.</p> <p>Turning back to the bar, I picked up my glass and downed it in one hit. I’d need a good bit of booze to get me through the night, to deal with all the sweet-cutesy crap.</p><p>I scanned the room, again my gaze landing on Teeny sitting quietly on her own in a corner, smiling sadly at the happily engaged couple. As somber as she looked, she was still a knock out, and she still wasn’t speaking to me. Not nicely anyway. One night of stupid, drunken decisions and I’d royally screwed up years of carefully constructed friendship.</p><p>I was an asshole, but I’d warned her I was. In all fairness, I’d been upfront about my one night rule before I took advantage of a liquor-fueled situation. Still, I felt like I’d screwed shit up. Teen looked at me like she wanted to do bodily harm; gone was her usual happy-go-lucky sweet smile.</p><p>Mace and Scar broke away from their lip lock as Teeny stood up and made her way in my direction toward the bar. My eyes instantly dropped to her swelling cleavage and rounded hips. I’d never wanted to bang a chick more than once in my life; it was confusing. On one hand, I figured it was because she was in my life so much. I mean, of course, I would want more; she was without a doubt the best lay I’d had, not to mention she was a great girl. On the other hand, perhaps I was just turning into a pussy.</p><p>Mace’s voice behind me drew me out of my thoughts “You gonna stare all night or do something about it?” he asked as he clapped me on the shoulder, leaned over the bar and ordered a beer.</p> <p>My eyes still trained to Teeny’s short green dress. The shoes she was wearing made her legs look unbelievably long. Shrugging my shoulders was the only answer I had for Mace. I couldn’t decide what I wanted to do about the whole cockeyed situation.</p><p>“You look really happy. You’re one damn lucky bastard that woman said yes to your stupid ass,” I told him with a smile. “Though I still don’t understand why you’d wanna be all wifed-up.”</p><p>“Happy doesn’t even scratch the surface; Scar’s everything I’ll ever need. You’ll get it one day, little brother.” His face went from the soft expression he held when talking about Scar to a small smile. “Probably the day you can put your dick away for five minutes and look at what’s in front of you,” he answered looking toward an approaching Teeny.</p><p>“Don’t you fuckin’ start too; you sound like Ma. Teeny can’t stand me. Besides, I like my dick outta my pants; it finds all kinds of fun shit to do.”</p><p>“Who said I was talking about Teeny?” Mace smirked, adjusted his arm in his sling and took a step off to the side leaning against the bar facing the party. No doubt looking for Scar— those two were practically attached at the hip.</p><p>I ordered another scotch and a vodka tonic, and pushed it in front of Teen as she stepped up to the bar. She looked down at it and sniffed. A look of disgust crossed her pretty face as she pushed the glass aside. “Can I have a ginger ale please?” she asked the bartender.</p> <p>Sick of her testy attitude, I called her on it. “What the fuck did I do to you?”</p><p>She turned toward me, her face hardening and sneered, “You’ve done enough!”</p><p>“Oh, Princess, I haven’t even started on what I want to do to you,” I told her, the honest answer leaving my mouth before my brain could filter it. Her face crumpled and she turned and raced toward the restrooms.</p><p>Fuck this shit.</p><p>I was gonna find out what her problem was with me if it killed me. I downed the last of my drink and pushed off from the bar. “Hold up, bud, I’ll walk with you. Scar’s takin’ too long.”</p><p>With a nod, we both made our way across the busy room avoiding grabby aunties as we went.</p><p>The moment I stepped around the corner into the long walkway, I came to an abrupt halt. A mixture of emotions hit me all at once; jealousy, anger, protectiveness and something that made my chest tight.</p><p>Scar’s voice drifted to my ears, “The stress isn’t good for the baby, sweetie. You need to tell him.”</p> <p>Teeny stood there, her back to us, Scarlett holding the tops of her arms. The second Scar lifted her gaze, her eyes flicked around and a whispered, “Oh shit!” escaped her lips.</p><p>Teeny spun around with an audible gasp, tears marking her face. Her hand went to her stomach along with my gaze.</p><p>WHAT THE FUCK!</p><p>I hesitated to move closer; annoyed she hadn’t felt like she could tell me. I mean, she wasn’t seeing anyone but the dude who knocked her up; I’d already decide that he’d better step up and help her, or I’d beat the crap outta him. A shadow of anger at the thought of her being in somebody else’s bed, having somebody else’s hands on her body, those lips around somebody else’s—I shook my head to clear my shitty and confusing train of thought.</p><p>I took a few big strides putting myself in front of her small frame and asked, “Whose is it?”</p><p>Teeny’s body went stiff, her face void of all emotion. Her hand pressed tighter to her stomach. She turned to walk away, but I reached out and gripped her free hand stopping her escape.</p><p>“Whose kid is it?” I asked again as Mace’s hand connected with the back of my head. “What the hell, dude?”</p><p>“Dumbass!” he muttered taking a step toward Scar and Teen. His insult rolled off my back; I didn’t care if I was being an ass. I wanted to make sure Teeny’s guy was gonna take care of her.</p><p>“Fuck you!” she whispered, not looking at me.</p><p>“I never pegged you for stupid, Trip.” This from Scar.</p><p>“Me stupid? Why? Wait—” My head was spinning like I’d drunk an entire bottle of tequila. The air I was gulping wasn’t getting to my lungs. “Do you mean...?”</p><p>My hand shot out reaching for the wall to steady myself. The room spun out of control as the situation started seeping in. My heart pounded in my chest.</p><p>“Not possible,” I breathed. A million thoughts ran through my head as my eyes slowly moved up to meet Teeny’s, unshed tears glistening in her eyes, her chest heaving.</p><p>Scarlett’s words bounced around in my head. Baby. Teeny was pregnant. Pregnant with a baby, a baby that may be mine. A baby that’s mine?</p><p>How the fuck is this happening? I looked at her hand pressed tightly to her stomach, her very flat stomach where...no. Just no.</p><p>“You sure?” I asked her quietly, my eyes still fixated on her hand. Deafening silence filled the air and I looked back up to her face to see her tough-girl mask firmly in place.</p><p>“No, Trip. No I’m not sure at all. I haven’t had needles jammed into my arms, pissed on sticks and spent most of my days for the last few weeks throwing up for shits and giggles,” she snapped at me.</p><p>Fuck! Fuck! Fuck!</p><p>“I can’t—I mean, I don’t know what to say,” I told her trying to sort through the conflicting emotions. I’m too young to be a parent; I wouldn’t even know what to do. Surely I’d do more damage than good. I mean is she sure it’s even mine? I never forgot protection, never, not once had I forgotten including that night.</p><p>I realized right away I severely screwed up in more ways than one when Teeny opened her mouth and icily said, “You don’t have to say or do a damn thing. It’s not your problem.” Barging past me, Teeny took off toward the front door without looking back. Scar kissed Mace and scooted past us with a pat to my shoulder on the way. I slumped against the wall and brought my hands up to run through my hair as Mace stepped up leaning against the wall beside me.</p><p>“Did somebody forget to give you the ‘wrap it before you whack it’ talk? This is...this is big. What’re you thinking?” Mace asked.</p><p>“I don’t have a fucking clue what to think right now. I know I suited up. I never skip that step; it’s ingrained, but Teen isn’t a slut. She never has been.”</p><p>“Leaves only one conclusion. Congrats, dude. You’re about to be a dad.”</p><p>“Shit,” I rasped sliding down the wall. I landed on my ass as my head started spinning again.</p><p>A dad.</p><p>Chapter One</p><p>Trip</p><p>Loud banging at the front door pulled me from my fitful sleep. I rolled out of bed and stumbled down the stairs squinting at the bright sunlight as I threw the door open. “What?” I snapped running a hand over my tired eyes.</p><p>“Wake the fuck up, dude. It’s midday and I brought beer. The game starts in half an hour.” Mace leaned back with a look of amusement on his face. “Get your ass in the shower. You smell like shit.”</p><p>I cringed at his choice of words. It wasn’t that long ago I had said something similar to him when he’d fucked up his relationship with Scarlett. I figured acting like an asshole was the best way to go; it was my fall back for everything after all.</p><p>“Screw you,” I grouched half-heartedly. “Where’s Scar? Amazing to see you two pry yourselves off each other for a little fresh air,” I grumbled slamming the door after Mace pushed his way past me. Mace had moved out and started living across the road with Scarlett, his fiancée, about the time he was shot in the shoulder by his raving crazy-ass bitch ex-girlfriend. He’d been discharged from the hospital to find all his crap over at her place. Courtesy of me, or rather me following orders from a very determined and equally pissed off Scarlett.</p><p>“Snarky bitch doesn’t suit you,” he gibed. “Have you heard from her yet?” I knew exactly who he was talking about and the reminder spiked my irritation.</p><p>“No. Not a damn word. She hasn’t answered any of my calls, texts or voicemails,” I retorted running my hand through my greasy, unwashed hair.</p><p>“Right, well, it’s only been a week. Give her time to calm down. Scar spoke to her this morning and she’s fine. Just pissed at you,” he informed me as he picked up the remote, flopped down on the couch and dumped the six-pack on the coffee table. “Go shower and we’ll watch the game. Scar’ll be over soon. She’s just finishing up at the parlor.”</p><p>I turned and stomped up the stairs without another word wondering what I’d have to do to get Teeny to talk to me. I needed to apologize for being an ass. I should have been more careful about what I said to her. I mean, it was a shitty way to find out, and it was kind of sprung on me. What was I supposed to do? Skip around in circles smiling and handing out candy canes while rainbows came out my ass? This wasn’t something I’d ever thought about. Shit, I never wanted to be a parent; it was a huge responsibility; one that people screwed up more often than not. Until a few weeks ago, I’d never even thought about sleeping with the same girl twice. Fuck, I’d never slept in the same bed with a chick until that night. It just wasn’t something I did. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Loving somebody changed people. It made them do stupid things. It made them change who they were and I’d seen it firsthand. My family had loved and lost, been broken and damaged. They changed important things about themselves and their lives. And for what? The idea of soul consuming love, which in my opinion, didn’t exist. It was simply the idea of love that they wanted; the bullshit they were fed growing up.</p><p>I dried off quickly and pulled on a pair of grey sweatpants before I went back downstairs. The second my foot hit the bottom of the stairs, I rolled my eyes; Mace and Scarlett sat on the sofa mid make out session. “Get a room,” I muttered as I flopped down in the only other chair. “You two are kind of nauseating,” I grumbled, my bad mood seeping out as I threw my feet up on the coffee table.</p><p>Mace smiled as Scarlet shifted off his lap to curl up beside him. She looked over at me and called me on my shit. “Stop being a bitch. She just needs some time to get her head together. She’s scared,” Scarlett told me looking unsure and a little guilty. This didn’t bode well for me.</p><p>“You know something I don’t?” I asked; the expression on her face confirming my suspicions. “Spill it, Scarlett.” My palms began to sweat and my empty stomach rolled in an unpleasant way.</p> <p>“Well, it’s not my something to tell. You should talk to her soon though. Just, umm...it’s something important you two should talk about,” she told me quietly avoiding my eyes. It was unlike Scarlett to be quiet about something. Usually, she’d be stomping around and ranting like a crazy chick.</p><p>My body went rigid at the possibilities of this ‘something’. Jealousy hit me in a rush. The first thought I had was what if Teen had met somebody? No, I was being a dick. It’d been a week since I found out she was knocked up. A week wasn’t long enough to...Fuck!</p><p>How many times had I given the business to more than one broad in a week? A week was too long for me not to have talked with her about this clusterfuck. I shook my head in an attempt to dispel my messed-up thoughts. I was a slut at the best of times, but she wasn’t me. She wasn’t a slut; she was pregnant with my kid. My kid. And she was fucking my head up. This shit wasn’t normal. My mind was a constant tornado of thoughts, worries and confused-as-fuck feelings.</p><p>I didn’t get jealous; that word shouldn’t even be in my damn vocabulary, and it never had been before. Elbows on my knees and head in my hands, my mind ran a thousand miles an hour giving me whiplash. I figured it was time to sort this crap out. I had no clue what the hell to do, but I had to do something. I knew it wasn’t fair to Teen to go through this alone. It was as much my problem as it was hers. I sure as shit wasn’t ready to be a dad, but it looked like I didn’t have a choice in the matter. And if I had a kid, it wouldn’t grow up not knowing who I was, not being in my life. Every kid needs a dad, right?</p><p>I picked up my cell from the coffee table and dialed Teen’s number for what felt like the thousandth time, only to get a recording telling me the voicemail was full. I pulled the phone away from my ear and stared slapping it against my palm, while worrying my lip rings between my teeth. “I’m going over there,” I told nobody in particular as I stood, determined to talk to her one way or another.</p> <p>“She’s at work tonight,” Scar warned.</p><p>My steps faltered. “Fine. I’ll go there then. I have to make sure—“</p><p>“You’ll only piss her off more if you show up there and embarrass her. You know that,” she reminded me.</p><p>“Well, I can’t let it keep going on, can I? I know she’s mad at how I reacted, but she needs to understand I’m fucking confused,” I answered running my hand through my hair with agitation.</p><p>“Sit down, shut the fuck up and wait till tomorrow. You want to win her over? You have to play this her way. Not yours.” Scarlett clearly thought she was onto something, while Mace sat there daring me to wipe the smirk of his face. Cocky asshole.</p><p>My feet rooted to the spot, I told her, “I don’t want to or need to win her over. I just need to talk to her,” I finished on a growl.</p> <p>“Sure thing,” Scar smiled handing me a beer with a satisfied smile and nodding her head to my vacated seat.</p><p>With a scowl, I took the cold bottle and slumped down into the cushions flipping my cell around in my hand and completely ignoring the game starting on the TV. Scarlett was probably right. After all, she and Teen had been best friends since they were kids; I’d only known them for about three years. It’d only piss her off if I went storming into the bar where she worked demanding she talk to me. Scar was definitely right. I had to wait.</p><p>“Will you two cut that shit out,” I bitched at them during the game. Every time I moved to get another beer, I’d come back to them in various stages of make out. “If I end up seeing your ugly, white ass bobbing around on my sofa, I’ll be scarred for life.”</p><p>“Suck it up. It’s not like I haven’t had to endure years of you and your dirty bimbos trying to jump each other’s bones even before you got in the damn door,” Mace smirked. He’d changed in the last few months. He was, well, he was happy. The happiest I’d seen him in a long time. As sickening as they were, I was good with it. Mace deserved it, Scar too. When they fought, it was funny as fuck; those two could give as good as they got. Mace was a bossy prick, and Scar, she didn’t take his shit; he pulled it she called him on it. They both had their fair share of bad hands, but they both came out winning.</p><p>Scarlett was my boss. I worked as an artist and body piercer in her tattoo parlor Needle’s Kiss. We had been good friends until the day my big brother Mace walked into the shop after he finished his last tour in the Special Ops. Ever since then, we’d become a family. Or rather, as close to family as you can get. Scar and Mace were due to get married and this was another example of the L word changing people. Mace was now doing private investigation work for his buddy, and Scarlett, shit, she was talking about dresses and flowers and crap; something I never thought she’d do, but that’s the proof: love made you forget who you were. Mace smiled often, which made me and everyone else around him happy, I hadn’t seen a smile on his face since the day he lost his little girl, my niece, that is, until he met Scar.</p><p>The game wrapped up and Mace called out as they headed to the door, “Get your head sorted before you see her or you’ll say something assy.”</p><p>Scarlett slapped his ass and laughed, “You’d know all about assery of the mouth, wouldn’t you?” When Mace picked her up and threw her over his shoulder, she screamed, “Put me down, asshat!” He nodded his head to me and left with a goofy smile on his face.</p><p>Bored out of my mind, I just sat around for a while, played a game on my cell and tried to draw some new art for a client. Nothing was distracting me; I was twitchy and thinking too much again. I’d normally find entertainment in the form of a bottle of bourbon and a willing female body, but I had been in somewhat of a rut since this entire fiasco with Teeny had started. Maybe I was coming down with the flu...that made perfect sense; it was the flu I decided ignoring the fact that I hadn’t been sick since I was a kid. I tapped out a tune on my knees for a while, and then played with my eyebrow ring. I mindlessly flicked through the pages of the new Harley Davidson Magazine.</p> <p>Screw it</p><p>Looking at the time on my cell, I realized what felt like forever had only been two very long hours. I couldn’t sit still. I couldn’t sleep. I needed to talk to her. Throwing on a fresh set of black jeans, a grey cotton shirt, beanie and my boots, I grabbed my cell, wallet and keys and shoved all my crap in my pockets. I jumped on my Harley to take the short ride to Teeny’s place. The beautiful matt-black metal of my girl, the rumble of her between my legs, the power under my hands did nothing to settle my nerves. A ride on my Fatboy Lo always calmed me down. On the way to Teen’s though, my nerves were shot to shit. Why the fuck am I even nervous?</p><p>I pulled up along the side of her building and cut the engine. The bike went silent, the metal still warm under my thighs. Taking a deep breath, I steeled myself, walked quietly up the stairs to Teeny’s second-story apartment and knocked on the poorly painted front door. It was in darkness. Her beat-up Honda wasn’t out front either. I was tired of this game of ‘hide the baby momma’, so I figured I’d just wait for her to get home. I kinda looked like a creeper standing outside her door, so I made my way down to sit on my bike; it was out of the way hidden in the shadows. Yeah, cause that wasn’t creepy either.</p><p>I didn’t have to wait long. Less than half an hour later, I heard her piece-of-crap car long before I saw her pull into the parking lot out front. I threw my leg over my bike and headed toward the complex. The street light out front was busted causing the place to be darker than normal; there was just enough light, that as I walked behind her, I could see her sexy little ass encased in those prissy jeans she always wore. I caught up to her at the bottom of the stairs and I reached out to touch her arm before she could make it any further.</p><p>Next thing I knew, Teen spun, her fist flying right into my nose. At the same time, she drove her knee up into my groin dropping me like a sack of shit to the ground.</p><p>“Fuckkkkkkkk,” I groaned cupping my junk as I rolled up onto my knees trying to get my breath back. Pain shot up into my stomach with each attempt. No go. I dropped down onto all fours. My sack had to be in my throat; I could feel it choking me.</p><p>“Oh, it’s just you,” Teeny breathed hard.</p><p>I looked up at her through narrowed eyes. “Oh, it’s just...fuck. Princess, what the hell you do that for?”</p><p>“Well, you deserved it. You don’t sneak up behind a chick and expect not to get hit. Now, get up, dipshit. You’re making a scene,” she hissed looking around the complex.</p><p>“You put me on my ass. How am I the one making a scene?” I growled as I stumbled to my feet, the pain slowing to a deep throb. “Damn it, Teen. You near on broke my nose and I’m pretty fuckin’ certain my balls are permanently damaged.” The urge to vomit was coming in waves.</p><p>“What are you doing here?” she asked making for the stairs.</p><p>I took tiny shuffling steps after her. “We gotta talk. This isn’t goin’ away and you need to talk to me,” I told her as I took the stairs tentatively.</p><p>“Listen, captain obvious, I told you it wasn’t your problem.” I shuffled through the door once she opened it and eased down on the sofa.</p><p>\"Look, I helped get us into this mess, and I...well...I just wanted to apologize for the way I handled it when I first found out. I was taken by surprise, but it still wasn't cool. I never expected anything like this to happen. I mean, we used protection and I just assumed that you'd be using something too. Something chicks use. The pill or some shit. Birth control. Weren’t you on the pill?\" Great. I was rambling.</p><p>Teeny ignored my verbal diarrhea coming back out of the small kitchen where she’d wandered while I’d been speaking.</p><p>“Oomph, shit,” I swore when she threw a bag of frozen peas that landed a bit too heavily on my crotch. “I didn’t know you could do that,” I grumbled adjusting the makeshift icepack. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What?” she sighed slipping her black stiletto boots off and leaning against the wall across the room from me.</p><p>“Hurt a dude like that. I didn’t know you could.” I nodded down to my lap for emphasis.</p><p>“I had to learn. Look, Trip, I know you want to do the right thing here, but I told you it’s not your problem. I’ll take care of it myself, so you should just go,” Teeny rushed her words out looking down at the floor.</p><p>“I’m not leavin’ till we talk, Princess.” The cold seeping through my pants was helping to numb the pain still lingering in my favorite place.</p> <p>“I just want a hot shower and to fall into bed. I’ve had a long day. My feet hurt and there isn’t anything to say to each other. We had a thing; it was one night, and I knew that; you knew that. We were drunk. It was stupid so forget it ever happened.” She closed her eyes tightly and wrapped her arms around herself. She sounded exhausted.</p><p>“Few things wrong with that little speech. First of all, I won’t forget about it. Second, if I have my way, it won’t be a ‘one night’ thing, and lastly, we’re havin’ a kid together. I’m gonna be around a lot. In fact, I think we should try this,” I indicated between the two of us, “us thing. I don’t know how it’s done, but it’d be best for the kid,” I blurted, not even thinking before the words left my mouth.</p><p>Apparently, I had said something stupid because her tired face went hard. Her eyes flared and she pushed off the wall taking a few steps toward me before opening her mouth, “First of all, you don’t get to walk into my damn life and tell me how it’s going to go. We are never going to be in the same room together unless it is for a death, a wedding or hell freezing over.” She ticked each one off on her fingers. “Even then, I might push you out in the storm. Second of all, don’t be a cocky prick, and lastly, I’m not even sure I’m keeping it!” she yelled the last right in my face. My stomach dropped and blood roared in my ears. I balled my fists up at my sides and stared.</p><p>“Say again?” I asked in a deathly calm voice that was anything but how I was feeling.</p><p>Chapter Two</p> <p>Teeny</p><p>I knew I’d pushed too far the moment he went solid as a statue. I took a step back as his face went from confused to furious in the space of a breath. He stood up from the couch, his eyes boring into me.</p><p>“Say that again,” he spat out. “Do not fuck with me, Teeny.”</p><p>Oh, he was mad, really mad. Just before I went to speak up and apologize, I gave myself a mental slap around the head. This was not up to him. He did not get to be mad at me. Screw him.</p><p>“I don’t know the first thing about kids. Look around; you think a kid should live in a tiny apartment like this? With somebody like me?” I pointed to my chest emphasizing my rant. “I never planned on having any, and especially not with somebody like you,” I explained.</p><p>He took a big step forward right into my personal space and hissed, “That’s my kid too. I didn’t really get that before, but that’s my kid too. I get a say in this. I might not be a stand-up role model, but for the right reason, I can fucking change that.” He took a deep breath and closed his eyes. Shaking his head, his tone softened, “Princess, there ain’t a God damn thing wrong with you, never has been. Anyone would be lucky to have you in their life, despite your temper and smart mouth.”</p> <p>Yeah right, all I’d ever been was a one-night stand. He could sprout his bullshit elsewhere. “Can you just leave? I’m too tired for this shit. I haven’t decided anything. I’ll let you know when I make my mind up.”</p><p>“No.” His eyes flared again, his gorgeous face hard with anger. “I’m as much a part of this as you. When do you go to the doctor or whatever it is you gotta do?”</p><p>“I’ll let you know. Just let me be, Trip. I didn’t ask for you to be here for me. I don’t need your help and I don’t want it,” I breathed out exasperated.</p><p>“Don’t be like that, Teeny. I just wanna do what’s right,” he said, his body still radiating waves of ‘pissed way the hell off’.</p><p>Fuck him. I was no charity case. “You know where the door is. I’ll let you know one way or the other,” I dismissed him as I started for the bathroom. My feet hurt from the twelve-hour shift I’d just finished. I was hungry, tired and just flat out fed up.</p><p>I didn’t bother to look back at him, and by the time I made it to my bedroom to get my pajamas, I heard the front door slam shut rattling the pictures on the walls. Sliding down the wall to sit on my ass, I waited until I heard the roar of his bike taking off before I pulled my knees up to my chest and broke down into big ugly-girl sobs. If this was what hormones did, I didn’t want a part of it. I cried at the drop of a hat; I was tired all the freaking time and I was being a grade-A bitch. But Trip, he couldn’t come round demanding rights and all that bullshit. He didn’t want me; he wanted something for a kid that didn’t even really exist yet. He was doing the ‘noble thing’ and sacrificing his happiness and mine, for what? A lie. That’s all we would ever be, a lie. I didn’t think I would be able to live a life where I was the chick he knocked up and stayed with because it was the right thing to do. Besides, Trip was the least of my worries. I had a big decision to make.</p><p>I never planned to have children. Depression ran in my family. My mother overdosed when I was eight-years-old. She’d somehow managed to survive the overdose. However, as an eight-year-old child walking into their parents’ room to ask for breakfast only to find mommy on the floor choking on her own vomit, was enough to damage anybody for life. She was diagnosed with postpartum depression right after I was born. My father decided it was too hard to deal with so he turned tail and ran, right into the beds of half-the-states’ female population. He was a slut, no other way to put it. I had at last count nine brothers and sisters, all of whom I had nothing to do with. So as a whole, I came from a screwed-up family that I no longer saw, spoke to or acknowledged. As far as I was concerned, they were dead to me. My family now was Scarlett, just Scarlett. I worked long, late hours at a bar; I lived in a tiny one-bedroom apartment with peeling paint and shitty worn-out carpet. I drove a death trap of a car. I spent a stupid amount of money on designer clothes I found at bargain prices hoping to feel special or something like it, and I was left with the hard choice of whether I could bring a child into this kind of life; a life I didn’t even like. A life where I might be a mother like mine was.</p><p>Deep breath in, deep breath out, in and out, I repeated my mantra calming my shaking body as I wiped away the tears streaming down my face. Standing on trembling legs, I made it into the bathroom and ran a hot shower. Pushing down the urge to puke again, I thought about how much longer I would have to deal with this. Am I going to be one of those women who upchucks every day for forty freaking weeks, or is there some sort of cutoff date? Whoever the moron was who said pregnancy was beautiful, lied through his ass, because all I’d done was vomit, sleep and cry. None of which resembled anything close to fun.</p> <p>After a short and mostly warm shower, my nightly routine of vomit, teeth brushing, rinse and repeat, I choked down a few dry crackers and half a glass of ginger ale. I crawled into bed tossing and turning before falling into a fitful sleep full of dreams about the perfect American life that I convinced myself I didn’t want or need.</p><p>Not ever.</p><p>I’d made my decision and it was the right one for me. I knew it was.</p><p>“You weren’t planning on telling me about this, were you?“ Startled, I looked up to see a set of stone-cold blue eyes. “You were just going to leave me out of it. I want to be here, Teeny. You should have told me this was what you decided on.” The strong smell of antiseptic assaulted me as another woman was called in from the waiting area. I ran my sweaty palms down the front of my jeans before looking up at where he stood in front of me. He looked gorgeous dressed in scuffed black boots, faded black jeans and a blue cotton t-shirt. His full-arm sleeve tattoos were on show and his hair was covered by one of the beanies he’d taken to wearing lately. I bit the inside of my mouth to stop myself from blurting something inappropriate considering we were in the middle of a clinic waiting room, and well, it was Trip. He didn’t need to know what he did to my libido. The fact he wasn’t supposed to know I was there registered, so I pulled him down into the hard plastic chair beside me and asked barely above a whisper, “How did you know I was here? Did you follow me?” Avoiding eye contact, I cleared my throat.</p><p>“No, I didn’t fucking follow you. I’m not some creeper,” he hissed quietly. “You should have told me you were coming here today. Why won’t you let me help? I can hold your hand or some shit.” I made the mistake of looking up at him; a look of hurt crossed his face before I could put my walls up and tell him to leave. Reaching over, I put my hand lightly on his arm; the contrast of his colorful skin under my pale hand did nothing to help my resolve.</p><p>The story inked into his skin had always piqued my interest. While I’d always wanted to, I’d never had the opportunity to really look at them. They meant something to him, every single one of them marked a point in his life where something significant enough had happened for him to permanently put that moment under his skin with ink and needles. It was a photo album of sorts, just out there for the world to see. His stormy blue eyes met mine. For a moment, I lost all ability to breathe; he’d always had that effect on me, but right then, it was like he was looking at me instead of through me. He leaned forward slightly, his eyes dropping to my mouth. A shudder wracked through my body at the thought of his lips on mine. He raked his teeth over the twin pieces of metal that hooked through the bottom corner of his lip making up the snakebite piercings. Goosebumps broke out across my skin as he leaned in a little closer. My eyes drifted shut and my breath hitched, my body suddenly on fire. The smell of his cologne shut down all brain function as it invaded my senses. The heat radiating off his mouth, just inches from mine, was driving me wild, my chest rising and falling with each fast breath giving away my instant reaction. I leaned in to close the gap.</p><p>“Ms. Garret?” the male voice broke through the haze. Trip and I jolted back from one another. Realizing what had almost happened; I mentally chided myself and moved my shaking hand to pick up my purse as Trip stood. Following the doctor, I slowed when I realized he was on my heels. “What are you doing?” I asked putting a hand on his chest to stop his progress.</p><p>“I’m coming in with you,” he told me matter-of-factly. Before I could argue, he took my hand in his much larger one and pulled me in the direction of the doctor.</p><p>“Good morning, Mr. and Mrs. Garret. It’s nice to meet you. My name is Dr. Stanza and I’m going to be taking care of you today.” The doctor handed me a folded piece of blue fabric. “Now, I’ll just step out while you change into this gown and hop yourself up on the bed over there. When you’re ready, we can get this underway.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I froze. The only thing registering was the implication that Trip and I were married. I tripped over my words to correct him. “Umm...we aren’t...I mean he isn’t....we don’t...”</p><p>“Cheers, Doc. She’ll be ready in sec. Won’t you, dear wife?” If I could, I would have reached over and smacked the cocky smile right off his face. “I’ll just be sitting over here if you need a hand or something.” I stood clutching the blue gown glaring and praying a spaceship would miraculously appear and zap him into space while Trip smirked, shook the doctor’s hand and sat down on the plastic chair in the corner of the tiny room.</p><p>I waited for the doctor to leave the room before I snapped at him, “What the hell, Trip? You needed to correct him, not lie. For shit’s sake, now he thinks we’re married!”</p><p>“Calm your tits, Princess. It’s not like it matters what he thinks; it’s just easier that he thinks we are.”</p> <p>“You make no sense. And you’re pissing me off,” I added as an afterthought. “You still can’t stay in here while I get dressed,” I hissed glaring at him, while he sat and played with his eyebrow ring like he hadn’t just poked a cranky bear.</p><p>“Worried you can’t contain yourself and you’ll end up jumpin’ my bones? Gotta say, I won’t be fighting you off, sweetheart,” he told me biting his lower lip and making a show of adjusting his crotch.</p><p>“In your dreams, little man.” Before I could get another word out, I was pinned against the wall. Trip’s hard body pressed against me, emphasis on hard. One of his hands was flat against the wall beside my head and his face was inches from mine. The other hand gripped my hip as he ground his erection against me. My body short-circuited and my hands instantly went to press flat against his chest not pushing him away nor pulling him close.</p><p>His breath blew warm over my parted lips. “There ain’t one little thing about me, Princess, and you know it. I’m sure you haven’t forgotten, but I’m always happy to refresh your memory.” He pressed his hips in tight against me and rolled them one more time as a growl left his throat.</p><p>I was so turned on I actually considered it for a second before remembering where I was and why. “It’s cute how you think you were that memorable, but honey, I’ve had more memorable moments with a flat vibrator. Now, get off me before you lose what little you have goin’ on down there.” I shoved at his chest hoping my heavy breathing didn’t betray me. As I slipped out from between him and the wall, the glint in his eyes told me I’d just lit a fire I had no chance of putting out.</p> <p>Shit!</p><p>Chapter Three</p><p>Trip</p><p>Game on.</p><p>Teeny wanted to play it like that. I was more than happy to keep chipping away at the layers until she cracked and fell back into my bed, or hers. I stood in the same spot, hand pressed against the wall, while mentally reciting every needle size and ink color in the drawers at the parlor in an attempt to tame my raging hard-on before the doctor came back in. Knowing she was getting naked in the same room wasn’t helping the situation at all.</p><p>“You about done or you need my help getting naked? I’m a bit of a pro at making that happen,” I called turning my head hoping to catch a glimpse; Teeny bending over was a sight to see. All long legs and porcelain skin, her blonde hair, which usually hung down her back, was tied up in some kind of knot thing on the back of her head. This left her bare back on show, a perfect canvas. I had a book full of tattoos I’d drawn up just from thinking about her ink-free back. I quickly averted my eyes when she stood back up so I wouldn’t get caught checking her out and wind up with a black eye.</p> <p>“I’m decent. You can turn around”</p><p>I turned to see her sitting up on the paper-covered bed. Her hands gripped together tightly in her lap, she looked like she was about to bolt. “You’re nervous. Close your eyes and take a deep breath.” This was my thing. I could do this bit; nervous or scared chicks on a table I could handle. I dealt with it every day as a tattoo artist; it was a part of the job. She glared at me for a moment before reluctantly doing what I’d said. “Right, keep breathing, big slow breaths in and out. Wiggle your toes and concentrate on doing it.” The amount of people I’d had almost pass out in my chair was decent, so I’d learnt how to distract them early on in my career. Her whole body relaxed after a second. “See, all better. So, I thought now you’ve decided to keep the baby, maybe when we finish here we can—“</p><p>Teeny cut me off before I could finish with a look that conveyed I might have assumed wrong. “Trip, I haven’t...I’m not, I mean. I’m making the decision that’s right for me.”</p><p>My stomach dropped. That feeling of uselessness I was familiar with crept in. “Then, why are you here having a scan thing? Why bother if you’re just going to go ahead and do that, why?” I finished with gritted teeth.</p><p>She looked down at her hands and quietly answered, “It’s a part of the process. I have to have a scan to make sure it’s still early enough to go through with it.” Before I could say another word, the doctor walked in followed by a nurse in pink scrubs. The doctor directed me to stand on the other side of the bed as he set up a strange machine that looked kind of like a high-tech TV and the nurse messed around with Teeny’s sheet until her stomach was on show squirting a heap of lube on it. The whole time I stood there, I wondered what the fuck I was even doing there. She’d already made her mind up; it was written clearly across her beautiful face. I took a tiny step back, my eyes darting all around the room looking for a way out.</p><p>“There, see that little jelly-bean shape? That’s your baby.”</p><p>My eyes snapped up at the doctor’s words. My baby. I focused on the screen in front of me, the doctor pointing to a dark grey splotch wiggling around on the screen. Teeny’s gasp had my eyes flicking down to her face; a mix of shock and awe filled her face. My throat tight, I looked from Teeny to the doctor and back to the screen. My nose started to tingle. Clearing my throat a little, I stammered. \"Wow. I—I—is that it? Right there?” The doctor nodded and hit another button. Next thing I knew, the room was filled with a whoosh whoosh whoosh sound.</p><p>\"God. That's something else. That’s—“ I reached out and took ahold of Teeny’s hand tightly. My voice shook as I tried to keep it together. \"We made that. That's our baby, Princess.\" A single tear fell down my cheek as I looked from the screen to Teeny’s stomach and back at her face. Overwhelming emotion clamped down on me, constricting my chest and setting off a herd of elephants in my gut.</p> <p>Leaning down close, I gently pressed my lips to hers. Locking eyes, I laid myself bare. \"Been a fuck up my whole life...but I swear. Teeny, if you let me, I'll do this right. I’ll do this one thing right.\" She tore her eyes from mine. Tears streaming down both cheeks, she looked from the screen back to me. “Teen, please don’t take this from me. Don’t take our baby.”</p><p>She cleared her throat and turned back to the doctor. “How—how...umm...”</p><p>“About eleven weeks. That right there, the pulsing, that’s your baby’s heartbeat.” The doctor pointed to a fluttering of grey and black on the screen. “Nice and strong. Healthy little bub by the looks. Here.” He pressed a button, passed her a square of paper and turned the machine off, cutting off what might be the only time I would ever see my baby. The nurse stayed silent shooting me a sympathetic look as she cleaned Teeny’s stomach. “We’ll give you a few moments before I come back in and talk you through your options, and how things will work.”</p><p>The seconds ticked by as I stood praying she’d change her mind. “I can’t—I can’t do it.” Right at that very moment, I swear I felt my heart crack, a piece breaking off and stabbing me straight through my lungs, four tiny words had just sliced me open.</p><p>“I can’t kill our baby.” It took a second for her words to register, and then relief flooded through me as my knees gave out and I landed hard on the ground taking deep breaths forcing the emotion back into the big black hole where it belonged. What could have been moments or hours later, I rose up on my feet and stumbled over to where the desk and chairs sat on the other side of the room. I sat holding my head in my hands until I had myself pieced back together enough to form a sentence.</p><p>The doctor came back into the room, sat down and explained a heap of things I didn’t have a clue about. He then handed a huge thick envelope of flyers and information sheets to us before I walked Teen out to her car.</p><p>“Sorry about all that in there. You didn’t really need to be here. From now on, I’m pretty sure I can do this shit on my own.” She was kind of cute when she rambled; I think I liked nervous Teeny almost as much as feisty Teeny. She stopped and rustled through her giant bag. Pulling out her keys, she rested her ass against the door.</p><p>Watching her lean against her piece-of-crap car, looking all unsure and vulnerable, arms crossed tight over her chest, worrying her lip like crazy, I realized I had to get even a small part of my life moving in the right direction if I was hoping to stand a chance. No matter how much she protested it, she’d need me at some point and I had to be ready for that.</p><p>“Look, Princess, I know you don’t like it, but you’re gonna have to suck it up. I’ll be at the next one, and every other one after that. My kid’s growing in you. I need to make sure everything is good, I need to know what you want from me and what you need me to do.” Teeny wasn’t big on dealing with bullshit so I thought honest was the best way to do this.</p><p>Biting down harder on her lip, her eyes shining wet, she looked right at me and whispered, “I don’t need anything from you.” Before I could say another word, she spun around, jumped into her car, started it up and took off in a cloud of black smoke and rattling pipes.</p><p>This was why I never got involved; bitches were stubborn. Even worse, Teeny was stubborn and hot, a deadly combination in my book. I needed to sort out what was next, because I sure as shit didn’t know what the hell I was going to do with a kid, but I wouldn’t be an absentee father. I had been raised better than that. I just had to take a class or read a book or something. Yeah, that’s what I needed. I mentally added a stop at the baby place on my way home.</p><p>“What the fuck?”</p><p>I was frustrated. Why the hell were instructions always written in gibberish? I’d spent the last five hours painting walls, instructing delivery boys where to leave flat pack boxes, while putting together baby furniture; I never even knew a kid needed so much crap. What I had thought was going to be a quick trip to the baby store turned into two hours of picking the perfect crib, bouncy chair, baby swing, mobile, blankets and a hundred other things I’m pretty sure nobody needed. I hated shopping and now my wallet was considerably lighter; my patience was fried and the disgusting overpowering perfume smell from the overbearing sales assistants who’d fallen all over themselves to help me find the perfect stuffed puppy dog seemed to be on everything. It was making me gag. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Turning the instruction sheet upside-down and back again, I still couldn’t make any sense of it. I needed help, even if I didn’t want to ask for it and there wasn’t a single person I could think of that knew how to put shit like this together. Ma was out of town with the girls, and no other moron I knew was stupid enough to knock up their chick. No, not their chick, their friend who they happened to one-night fucking stand.</p><p>“Get it together, asshole; you can do this.” It was just a few screws and some wood. I’m a man and men can do this shit. “Right?” I threw the instructions over my shoulder, picked up the discarded drill and took ahold of one side of the crib. I then got stuck into making a room Teeny would be excited to lay our baby down in. Who needs fucking instructions!</p><p>I leaned over and dropped the baby mattress inside the finished crib. Admiring my handy work, I picked up the patchwork puppy and sat it inside when the whole thing collapsed. “FUCK!” I kicked the metal toolbox sitting on the floor; shooting pains tore up my bare foot. “Motherfucker! “ This shit was frustrating.</p><p>“Swearing at it ain’t gonna help you none.” I spun around catching my foot on a pile of bags and going ass over tit. I landed sprawled on the floor surrounded by blankets, toys and plastic bags. Almost instantly, Mace was looming over me trying to hold in his laughter.</p> <p>“What the fuck are you doin’ here?” I asked staring up at the freshly painted ceiling hoping whatever was digging into my back wasn’t broken.</p><p>“I saw the delivery truck a few hours ago. That and your yelling held a sort of allure even I can’t resist,” he chuckled putting a hand out to help me up, which I batted away half-heartedly.</p><p>“You could have come helped me earlier, asshat. I’ve ripped my hands up. I have paint every fuckin’ where and I’m about ready to take an axe to this piece-of-shit crib,” I grumbled pulling myself up into a sitting position and pulling a squeaky toy out from under my ass.</p><p>“Consider it payback for not helping me with the flowers in Scar’s yard,” he smiled as he moved to the middle of my mountain of screw up that should have been a nursery already.</p><p>“That was a pussy-ass move,” I grumbled. I still couldn’t believe he’d gone to such extremes to win her back. His plan to annoy her into forgiving him had been more of a success than I thought it ever would.</p> <p>“It pissed her off enough to take me back, so I’d say my pussy-ass move worked,” he said smugly as he crossed his arms over his chest.</p><p>“You gonna help me or just stand there, Romeo?” I grouched picking myself up off the floor and being extra careful not to go down again.</p><p>Mumbling under his breath, he picked up a few tools and got to work smiling like a fool the whole time. It only served to make me want to slap him a little. He always did find too much amusement in my misfortune. Scar rocked around about an hour later with beer and pizza claiming she wanted to feed us. I was pretty sure she wanted to drool over my brother, sans shirt, building baby shit and laugh at my stupid ass.</p><p>“I gotta go visit with Ma. You wanna come?” I asked stopping myself from flicking my tongue stud against my lip rings. If I were afraid to tell one person, it would be my mom.</p><p>“You aren’t taking Teeny then? “ he asked looking confused. The clicking from the metal piercings started up again while I processed his question.</p><p>I hadn’t actually thought to take her; it was probably a good idea. Ma came across as a sweet lady, but I knew full well what happened when you did something wrong. I’d been on the short end of her wooden spoon enough times as a teenager to know you didn’t cross her, ever. If I had Teeny with me, it might serve to lessen the fall back on me. A dick move? Maybe. But I knew Ma didn’t have a rude bone in her body, so as long as Teen was there, everything would be good.</p> <p>“You’re a fuckin genius!” I smiled. Shoveling through diapers, fluffy toys and baby creams, I finally spotted my cell and typed out a quick message.</p><p>Trip: Dinner at Ma’s Tuesday night.</p><p>A few seconds later, my phone vibrated.</p><p>Teeny: What! Why?</p><p>Trip: Gotta tell her you’re knocked up.</p><p>Teeny: You’re an asshole</p><p>Trip: I know.</p><p>Teeny: Screw you.</p> <p>Trip: I’m up for that. Just tell me where and when, Princess.</p><p>Silence. I smiled to myself knowing I was rattling her chains. She was so easy to rile up, and Teeny riled up served to give me a hard-on. Something about seeing her spittin’ mad turned me on; she’d get this look on her face that was almost the expression she had gotten just before she came all over my face; it was damn close to heaven.</p><p>“What are you smiling about?” Scarlett asked from the doorway and interrupting my thoughts. Good thing too. I was about two seconds away from sporting said hard-on.</p><p>“Nothin’,” I grunted and turned my body slightly away from her to hide the semi evidence.</p><p>“Get back to work if you want this finished today.” She picked up a soft toy frog and threw it at the back of my head. “You still gotta put all these toys away.” Looking around my feet, I took in how much work there still was to do. I sighed and got back to work.</p><p>“You gotta get out of the truck sometime tonight, Princess,” I told Teeny leaning against the open passenger’s side door.</p><p>“I can’t believe I’m doing this,” she hissed glaring daggers at me. She had that particular move skilled to almost perfection; it was just lucky on my part that it didn’t scare me.</p><p>“Don’t make me throw you over my shoulder. Come on,” I warned. I leaned over her to unclick her seatbelt earning a slapped hand and a scowl.</p><p>“What’s the deal with the truck anyway?” she asked “You said you’d never own anything and I quote that you couldn’t ride hard.” I didn’t miss the bitchy tone she used.</p><p>“Got a baby comin’. Can’t strap Midget to the back of my Harley.” After two days of putting together baby stuff and folding clothes and sheets, I opened the last box or dangly car toys from the nursery only to realize I needed something bigger than my bike to put a car seat in once we’d gotten one. This meant it was time to buy a truck, and if I was going to buy a truck, it was going to be a truck that suited me.</p><p>“Midget?” she asked with a puzzled look on her face.</p><p>“Yep, that’s what I’m calling the kid for now,” I explained. I wasn’t sure why I’d decided on that nickname, but it sounded a lot more manly than jellybean. Her face softened and transformed into an expression I struggled to read before the walls went right back up again.</p><p>“You could have gotten a regular truck you know. This thing is enormous. How’s anyone supposed to get down from it without breaking something?” She didn’t miss a beat before she was back to cussing out my truck choice. If I knew she’d let me buy her a new car without having a conniption, I would have done that too, or maybe I would anyway.</p><p>Twenty minutes late and running out of patience, I reached in quickly, undid her belt and picked her up. Ignoring her squeal of surprise, I pulled her purposefully flush against me, one hand full of lush ass, the other on her hip. Lowering my head to her neck, I took a deep breath catching the soft vanilla scent of her blonde hair. Taking as much as I could get, I gently bit her earlobe and then ran my lips over the same spot.</p><p>“Don’t push me, Princess. I’m clear out of give–a-fucks and my dick’s so hard it could hammer nails. Move that sweet ass before I bend it over and fuck it into oblivion,” I growled in her ear driving the point home with a quick swat to her ass.</p><p>Making sure her feet were on the ground, I let go and stalked for the house adjusting my now very tight-in-the-crotch jeans. I didn’t miss the soft moan from Teeny before she cleared her throat and mumbled something about assholes and penis trucks. Damn, the girl made me smile.</p><p>Chapter Four</p><p>Teeny</p><p>“Stop glaring at me,” Trip murmured as we walked in the front door of his mother’s house.</p><p>“I’m not glaring. I’m taking great pleasure in hurting you with a rusty fork in my head,” I hissed. Trip had this way of ticking me off. He got under my skin like nobody else. He even had the audacity to drag me along for the let’s tell my mom I knocked you up after a drunken one-night stand talk. Times like these I was glad I had no family.</p><p>He didn’t get a word out before his mom, Marcy, was in front of us handing out hugs and welcomes.</p><p>“You don’t come home nearly enough, Javerio.” Marcy held his face in her hands and leaned up on tiptoes to plant a kiss on his forehead.</p><p>Huh? I knew he went by his nickname, but he’d never told anybody what his real name was, no matter how much we asked.</p><p>I was standing stock still more than a little dumbfounded when Marcy wrapped her arms around me with a big smile and said, “So glad you’re here, Teeny baby.” Trip’s mom was everyone’s mom; you didn’t come in her house and not call her Ma, and it had been this way for as long as I’d know Trip.</p><p>The very first time I’d met her, she insisted I call her Ma. She was the sweetest, kindest person you would ever meet, but still, I was nervous at telling her I was carrying an accidental grandchild.</p><p>“You look great, Ma. I missed you.” It was the truth. I had missed her. She had that warm way of making you feel loved, even if you weren’t her own child.</p><p>“Hush now, baby. Come sit. Dinner is ready,” she said wrapping an arm around me and guiding us to the dining room with Trip on our heels.</p><p>After a round of hugs and catch up questions with Trip’s two younger sisters, Haven and Milla, we settled at the table. Wringing my hands together on my lap, I looked around apprehensively.</p><p>“So I wanted to tell you something important, Ma,” Trip announced drawing the attention of everyone to where we sat side-by-side. Reaching under the table, he grabbed my hand and excitedly blurted, “Teeny and I are havin’ a kid.” He smiled like a kid who had been locked in a candy store while I squeezed my eyes shut and reined in the urge to backhand Trip for his less that charming announcement. He could have said it a little less...I don’t know, in your face? The deafening silence that followed just about pierced my eardrums. All eyes on us, I started to fidget. My worry for their reaction took over, while Trip just looked like he’d won the World Series and a Nobel Prize.</p><p>The metal spoon Marcy was holding dropped with a clang to the table. I couldn’t read her expression, which made me wonder if it was a good time to turn tail and run for the door. She slowly walked around the table to me, her eyes trained to my stomach. I stood up unsure of what to say or do. As soon as I got to my feet, she enveloped me in her soft arms and let out a sob. Stiff as a board and darting my eyes from Trip to Marcy and back again, I hadn’t been sure what to expect, but this wasn’t really it. Wrapping my arms around her, I rubbed her back. “A grandbaby? I’m so happy for you, Nena,” she sniffled. Pulling back, she smacked Trip around the back of his head before leaning down and kissing his cheek. Marcy always reverted back to speaking part Spanish when she was emotional. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What was that for?” he whined rubbing his head.</p><p>“Eres un tonto, hacer una chica honesta de ella,” she told him with a smile. I had no idea what she just said, but he looked perplexed and maybe a little conflicted. Before I could even ask what she’d said in Spanish, the girls launched into a round of questions.</p><p>“Javerio?” I asked in a hushed tone while walking out to his truck at the end of the night.</p><p>“Don’t. Only family calls me that,” he snapped. His harsh words triggered a pang in my chest and an anger that I needed to keep tightly reined in. He was absolutely right; I wasn’t his family. I wasn’t anybody’s family.</p> <p>“What did your mom say in Spanish?” I asked referring to the words she’d spoken at dinner; ones I had no hope of understanding.</p><p>With a scowl he mumbled, \"She told me I was a fool, and I needed to make an honest girl of you.\" He shook his head in what I was sure was part annoyance and part disgust. I already knew the mere idea of Trip settling down and making an honest girl of anyone was ludicrous, so I bit my tongue and stared out the window.</p><p>The drive home was more than a little tense, but as he pulled up to my apartment, I decided I wasn’t going to let him be an asshole or hurt my feelings. I also had this uncontrollable urge to push his buttons and call him on his shit whenever he pulled it, which more often than not, was when he opened his mouth and sound came out.</p><p>“You know what? Screw you. I won’t have you treating me like one of your whores.” My assumption that he didn’t want women he slept with knowing his real name, knowing his real self, was dead on the money from the grunt and maddened facial expression I was so nicely graced with.</p><p>Jumping down from the truck and starting up the walkway, I stopped short at his gruff voice behind me. “You weren’t ever one of my whores. Never will be, Princess.”</p> <p>His warm hand on my arm turned me around to see his face; chewing on his lip and looking down at me with his bright blue eyes, he looked unsure. It wasn’t a look I’d seen on him before and the mere idea that Trip, of all people, was unsure of anything stopped my smart reply in its tracks.</p><p>“Don’t think you’re anything less that special to me, Teen. Even before this,” he gestured to my stomach, “above all of it. Even if nothing happens with us, we’ll share something pretty damn special.” His hands cupped my face and he laid his lips gently to my forehead leaving a whisper soft kiss. With a long sigh, he turned and jumped into his truck disappearing down the road.</p><p>I let myself inside the front door of my shitty apartment locking the deadbolts behind me. The neighborhood wasn’t a great one and was most definitely far from safe.</p><p>As if on cue, banging and screaming started up from the apartment next door kicking off the normal building dramas. I really needed to find a bigger and safer place, but with the pathetic shifts I was getting at the run-down bar I worked at, there wasn’t much hope.</p><p>After my nightly routine of bath, puke and PJs, I curled up on the sofa with a movie and blanket. I was feeling lonely. I didn’t want anything much, just a little companionship, even somebody to curl up with and hold me. These things didn’t usually bother me, so I simply put it down to hormones and sulked into my pillow. I was used to being alone. I’d lived on my own since I was sixteen years old. I’d never needed anyone before and I promised myself I wouldn’t ever need anybody. I was a big girl. I could do it all on my own. Yeah, and your pride has absolutely nothing to do with it, an annoying voice in the back of my head mocked.</p><p>I zoned out before the opening credits even rolled by. Playing the night over in my head, I came up with endless questions and scenarios, all of which just served to cause a twisted knot in my stomach.</p> <p>While Trip seemed excited and proud, my own self-doubt crept in turning my mind in to a little vortex of what ifs and maybes. I didn't want anyone to have to have me, just because I was pregnant. Then there was Ma and the girls, Milla and Haven. What if Ma thought I did this on purpose? Oh no! Maybe that’s what she said in Spanish? I don’t speak Spanish. Shit, what did she say? Trip hadn’t looked upset when she’d said it, so it couldn’t have been too bad, but there was confusion there. Maybe I was over reacting? Probably, but I just couldn’t get a grip on all of the self-doubt. Useless tears welled up in my eyes for no reason other than because they could. This pregnancy crap was driving me nuts. I’d never had so many emotions run through me in the span of five minutes. When I wasn’t being a nasty, bitchy little brat, I was crying over nothing. Even some stupid commercial about assholes that kicked puppies was enough to have me hysterically bawling my eyes out.</p><p>Where the hell had my sass gone? Sniffling, I wiped the tears away as they slowly trickled down my cheeks and I shuffled to the kitchen. My food cravings were already out of control. Chocolate ice cream and pickles. Yeah it was gross, but I wanted it so I had to have it. I opened the near-empty fridge in search for my precious pickles, only to find three jars completely empty, apart from a little juice in the bottoms. “No!” I cried. “No, no, no, no!” I reached into the freezer feeling around in the hopes there might be a tub of ice cream that would magically pop up, but again, nothing. “Why me?” I burst into tears, again. My chest heaving, I sat on the cold, battered-up linoleum floor for a good ten minutes wailing like a kid whose pet bunny had just died. I knew exactly how unreasonable my tears were, but at that point, it was completely out of my control. I crawled over to the coffee table and snagged my phone. Shit, it was late; Scarlett would be asleep; besides, I wasn’t in the habit of bothering her and Mace. This left me with one option. Trip. Looking between the kitchen and my phone, I weighed my options. Did I dare call him? Were pickles and ice cream really that important? Yes, yes they were.</p><p>Chapter Five</p><p>Trip</p><p>My cell vibrating on my chest woke me from a near perfect dream of Teeny riding me and screaming my name. My dick was hard as nails and I swear I was about ten seconds from making it a wet dream to remember.</p><p>“Shit,” I mumbled fumbling around as I came back to my senses. Without checking the screen, I hit the button and pulled the phone up to my ear.</p><p>“Lo,” I grumbled thinking it better be a house burning down or a zombie apocalypse to wake me from those fantasies.</p><p>“Trip.” The voice on the other end caught my attention; the sniffling behind it had me snapping upright in bed and my stomach dropping out.</p> <p>“What’s wrong? What happened? “ I rushed out jumping up and pulling clothes on as fast as I could.</p><p>My adrenaline had kicked in; a two am phone call from my baby momma couldn’t be a good thing. Something was very, very wrong. Sending up a silent prayer, I focused on the sniffling and hiccupping words coming though the speaker.</p><p>“I wanted—“ More sniffling. \"I wanted some. hic. But, there isn’t any. hic. And then I just started. hic—\" Between her hiccupping and sobbing, that’s all I got before she burst into tears. Pulling my beanie on and slamming the front door, I rushed to the truck. I needed to get to her.</p><p>“Okay, Princess. You need to calm down. Tell me what’s wrong. Is something wrong with the baby?” I asked as calmly as I could jamming the truck into gear and taking off, tires squealing.</p><p>“No. sniffle I wanted pick—pickles hic There’s no pickles!” she wailed and started balling again. What the fuck? I was now thoroughly confused.</p><p>Pulling the truck off to the side of the road, I slumped in my seat relief washing over me. “You called me at two am crying because you’re out of pickles?” I clarified, the edges of my lips tipping up slightly.</p><p>“Y—Ye—yes! “ she howled in my ear. I burst out laughing at the hilarity of the whole situation. She’d called me. At two am. Teeny called me.</p><p>With a chuckle, I asked, “Tell me what you need and I’ll pick it up.” Pulling a pen and paper out of the dash, I waited.</p><p>“I—I don’t know,” she sniffed. “I want pickles and...stuff.”</p><p>“I got that, Princess. You really want pickles. I’ll get you pickles. Is there anything else you want while I’m at the store, so we don’t have you upset again tonight?” At the top of the paper, I wrote PICKLES in large print. I’d be fucked if I forgot them.</p><p>“Ice cream. I—I like chocolate ice cream with my pickles.” Scrunching my nose up at her strange food requests, I jotted it down.</p><p>“Okay, is that it then?” I drew a few thick lines under the two words on the paper in front of me.</p><p>“Y—yes,” she blubbered and blew her nose.</p><p>“Okay, Princess, hold tight. I’ll be there soon.” Throwing the paper and pen on the passenger’s seat, I pulled back onto the road looking for a twenty-four-hour store so I could ride in on a white horse bearing pickles and ice cream. I shook my head at the ridiculousness of it and muttered, “Crying over freakin’ pickles.”</p><p>Pushing past her, I dumped the four bags full of food on the coffee table and flopped down onto the sofa. “Pickles, ice cream.” I pointed to the bags. ”Did you know there are twelve different kinds of chocolate ice cream?” I shook my head at the drama I’d had deciding what one was the right one. “There’s Skittles, choc chip cookies, Hershey bars, almost every kind of candy bar they stock, tissues, some kind of swollen foot cream thing and a lovey-dovey book with some long haired girly-boy on the front.”</p><p>Snuggling up in the corner of the sofa under a blanket, she stared at me red-rimmed eyes and quivering chin. Figuring I should explain, I blurted, “I told the chick at the store you were knocked up and crying about pickles. She helped.”</p><p>She instantly burst into tears a-freaking-gain. “What’d I do now?” I asked pulling her over to me.</p><p>She lay her head on my chest and sniffled, “You’re being nice to me. But I’m not nice, so you shouldn’t be nice.” Smiling to myself, I rubbed circles on her back and held her close. I would take whatever she was willing to give and maybe push for a little more.</p><p>Rubbing her head into my chest, she said, “Oh, yeah. That feels nice.” My ears peaked. I liked that she was letting me do something nice for her. She was usually a pain in my ass. Rubbing firmer into her back, she moaned and groaned a full minute before I realized I was harder than rock.</p><p>Shifting around, hoping my happy friend wouldn’t press into her, my eyes widened when she stopped me and snuggled into me. Shock wasn’t the right word for what I felt when she pressed even deeper into me, into my erection and said huskily, “I read in my pregnancy books that women who are expecting are hornier than usual.”</p><p>Eyes wide, I stilled waiting for her to go on. Pushing her perfect tits into my chest, she whispered, “It’s not even a regular type of horny either. It’s the crazy type of horny. You know? The type where you feel like if you don’t get some, you’ll just die.”</p><p>Holy shit! I was about to make a mess of myself. This was so unlike Teeny. I blinked rapidly ensuring I wasn’t hallucinating. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Swallowing hard, my hands still rubbing her back, I replied as steadily as I could, “You feelin’ that crazy right now, babe?”</p><p>Teeny looked up and right into my eyes. She didn’t need to say a thing. Her eyes were begging. Begging for me to take her. Begging for me to not make this a big deal. Begging for me to not make her beg.</p><p>Shit.</p><p>Make her beg?</p><p>Fuck that. I might never get an opportunity like this one again. I wasn’t stupid enough to let a horny Teeny go to bed and finish herself off. After all, I was really just taking care of my baby momma. It was my duty. Or at least, that’s what I told myself.</p><p>My breathing picked up coming in short fast bursts. I reached lower on her back until my hands cupped her firm ass. I squeezed the perfect globes and lowered my face to hers. The way she lifted her head to mine showed me just how much she needed this, and I’d be damned if I denied her anything.</p><p>Our lips are a hair’s breadth away from each other’s, I ran my nose along hers and took in the soft sigh she let out. I whispered, “Let me take care of you.”</p><p>She didn’t respond. Not with words, anyway. Her lips parted and she licked my top lip. My eyes closed and I took in the sweet taste of her tongue. Fuck me. She was perfect.</p><p>My hands at her ass, I rubbed her back once again before my hand came forward, slid down her belly and lowered to the heat between her thighs. As soon as my fingertips brushed her pussy, she pressed her lips to mine with a long low moan.</p><p>She was killing me.</p><p>What had started off slow and wary, quickly turned into something else entirely. Within minutes, I had Teeny straddling my lap, her panties pulled off to the side and my fingers flicking her clit as she ground against my hard-on. Our breathing in sync, heavy and labored as her chest moved up and down, I freed one perky swollen tit from her lacey pink bra. I leaned in and flicked my tongue against her hardened nipple pulling the silver ring between my lips and giving it a little tug. A gasp escaped her lips at the same time as I moaned against her skin.</p><p>The friction of her grinding on me was bringing me dangerously close to embarrassing myself. I had to think fast, problem was with Teeny letting loose like she was, I wasn’t thinking much beyond getting my end in as soon as fucking possible.</p><p>Thinking quickly, I grabbed her hips and flipped her onto her back while tearing her panties clean off. Her squeak of surprise turned into a gasp when I dropped my mouth down into her hot sex and began eating her like a starving man. Flicking my tongue ring against her clit, I proceeded to lick long and slow, from top to bottom.</p><p>“Ohh, God, yes,” she cried out gripping the back of my head and holding me against her heat. “More, I need more,” she keened. She was so wet I had no problems slipping two fingers in. Her back arched and she cried out, her muscles clamping down on my hand. My jeans were now that tight I was pretty sure I’d forever have zipper imprints. I pulled my fingers out and back in again, making sure to hit that sweet spot every single time. Teeny’s legs started closing as her muscles locked up; she came so hard her arousal was running down my hand.</p><p>Not able to wait any longer I pulled at my belt and ripped my jeans down. It suddenly occurred to me I didn’t have any condoms with me. “Wait, I don’t—shit. I don’t have anything on me, Princess”.</p><p>“Does it matter anymore? Just put it in already” she snapped, her chest rising and falling fast.</p><p>She had a point. It didn’t, but at the same time it did. “I’m safe, I mean. There hasn’t been anyone since...I’m safe,” I rambled.</p><p>“I know. Now shut up and fuck me!” she yelled.</p><p>Well, clear and straight to the point, I didn’t hold back. I moved over the top of her and slid home with a growl. Heaven. That was the only word to describe it. I ground against her trying my hardest not to pull back and pound her sweet pussy into oblivion.</p><p>“Trip, please,” she moaned against my shoulder grinding her own hips into mine. The silver bar in the end of my dick was not only sending me into a spiral of tingling and ball clenching stupidity; it was rubbing against all the right spots to bring her right back to the edge. I fucking loved having my junk pierced at that moment.</p><p>“Shit, baby. I’m gonna be fast. Tell me how you want it,” I groaned shifting slightly so I was all the way in and pressed tight to her body.</p><p>“Brutal.” She bit down on my shoulder and murmured, “Fuck me hard, Trip. Please, I need you to fuck me hard. Make me scream.” Her words had my balls drawing up. The animal in me broke its shackles and let loose. With a roar, I pulled back and pounded into her at an unforgiving pace. Our hips smashing together, the slap of skin and heavy noises of our pleasure were all that filled the room.</p><p>“I’m gonna come, Princess,” I ground out trying to hold back just a bit longer.</p> <p>I pulled her nipple into my mouth and sucked hard; she arched up under me and screamed, “Fuckkk, Oh God. God. Fuck,” as she clamped down on my painfully hard shaft setting me off into bliss with a roar of her name.</p><p>Shaking, I pulled back leaning my weight on my forearms. Teeny lay under me looking limp and completely satisfied; her pussy still contracting around me every few seconds. Wondering how long it would be before she freaked out on me, I simply stayed put peppering small wet kisses down her neck to her perfect tits and back up again.</p><p>Something occurred to me once I’d finished showing my appreciation for said perfect tits. “You know, they have to come out soon?” I asked flicking my tongue against the metal in her nipple.</p><p>“What?” she replied on a small moan sounding distracted.</p><p>“The rings. They have to come out soon. You want me to do that for you?” I was all for playing with her boobs. The fact they were bigger than when I had pierced them wasn’t lost on me.</p><p>Thinking back to that day had me smiling with satisfaction. Teeny had come in to the parlor to have them done. I hadn’t wanted to do it. Just the thought of her exposing her goods in the back room of the shop had me rock hard. Scar had given me shit about Teeny, and at the time, I had known it was a bad idea. But once she’d stripped thinking she had one up on me when I’d blushed...needless to say I’d firmly put her in her place.</p><p>“Quit playin’ with me, Princess,” I warned her. Her answering smirk told me I was warning her in vain.</p><p>“Oh, I’d love to play with you, Trip. I hear you know how to take a girl on the ride of her life.” Reaching forward she brushed her tiny hand over the prominent bulge in the front of my pants. Moving fast, I kissed her hard leaving her stunned silent. I took advantage pushing my hand down the front of her jeans, flicking, tweaking and sliding my fingers into her amazingly tight pussy.</p><p>I’d made her come hard while I pierced those pretty pink buds. She’d been blushing like a schoolgirl once we were done, and one thing was for sure, never had I looked at that table the same. Every time I walked into the piercing room, all I saw was Teeny and the way she had fallen apart at my hands and whispers of all the dirty things I could do to her. Afterward, she’d gotten dressed and made a hasty exit while I walked around for the rest of the day with blue balls and a smile as big as my boner had been.</p><p>“Mmm if you keep that going, you can do whatever you like.” My still semi-hard dick jumped at the sound of her husky voice and just-fucked expression.</p><p>“You’ll have to stop grinding your hips if you want me to take ‘em out, baby. I can’t concentrate when you do that.” On top of grinding, she started to breathe heavily again. Her hooded eyes made contact with mine. She smirked and clenched around me taking me from half-mast to full-sail all over again.</p><p>Chapter Six</p><p>Teeny</p><p>Opening my eyes, I took in my surroundings; a very warm very hard body was pressed to my back, his hand wrapped around me cupping my deliciously sore lady bits. Last night hadn’t been planned, but the moment he touched me, my entire body lit up. Damn freaking hormones were wreaking havoc on me. One minute I was crying about pickles, the next I was begging to be stuffed with one. Speaking of pickles, I needed some; I hadn’t managed to get my fill. I was torn between shifting my hips onto the one poking me in the back, or the jar Trip had shoved in the fridge after screwing me senseless on the kitchen floor. Warm breath on my neck sent goose bumps across my naked flesh. Trip’s fingers twitched against me causing a small moan to escape my lips.</p><p>I’d spent weeks fighting off his sweet talk and bullshit gestures, but maybe, just maybe, he could be good. If nothing else, I would get amazing sex from it. Hope poked its ugly head out and looked around the room smiling at me with its beady little eyes.</p><p>“Mornin’, Princess.” Trip’s husky morning voice shot a bolt of pleasure straight to my crotch as he slipped a finger inside me and left tiny wet kisses along the back of my neck.</p><p>Then it happened, my morning reminder. Ripping the sheet back, I jumped from the bed and bolted for the bathroom making it just in time to lose last night’s midnight snack.</p><p>“Shit,” I heard mumbled behind me as I continued to dry heave. My hair was pulled up into a holder and the tap behind me was turned on before a wet washcloth was draped over my neck.</p><p>“Go-way,” I grumbled between gags. I was more than a little mortified that he was in the bathroom while I sat naked on the floor and retching.</p><p>“This happen often?” he asked in a gruff voice while loading up my toothbrush.</p><p>“Yes,” I reluctantly admitted, “every morning and most nights.” My stomach rolled again but didn’t bring anything up this time. Without another word, Trip handed my toothbrush over and helped me up off the floor. With an odd, pensive look on his face, he turned on the shower and left the barely big enough room. He shut the door hard enough that the flimsy beat-up vanity rattled.</p><p>I stepped into the tiny shower and attempted to let the water wash away the stress and embarrassment that weighed down my shoulders. I didn’t want anybody to see me weak, let alone Trip, yet that was exactly how I was feeling. I needed to be the strong girl I usually was. Not only had I called him while crying, I’d then gone and thrown myself at him like a nymphomaniac. Stepping out of the shower, I rationalized my situation. I had to be clear with him; this wasn’t going anywhere and it never would. We would share a child and that alone would give us a kind of bond, but that’s where it would stay. No more of this weak, helpless teary crap, I was turning into a hot and cold bitch and it was getting on my nerves.</p><p>Wrapping a towel around myself, I decided it was time to call a truce with Trip. He might be a cocky ass and a notorious ladies’ man, but he was trying to be helpful and responsible, even if it was just for the baby and most likely wouldn’t last. I needed to pull up my big-girl panties and meet him halfway.</p><p>My steps faltered when I caught a glimpse of Trip leaning his backside against the kitchen counter, legs stretched out, ankles crossed, barefoot and a pair of black jeans slung low on his hips. It took a moment to realize he didn’t look too happy. I didn’t quite understand why; I hadn’t done anything to piss him off yet. Unless, it was the fact he hadn’t gotten morning glory on account of my stomach. I could feel the anger radiating off him. His usually bright blue eyes were a stormy grey. I took a tiny step back when he moved his arms up and crossed them over his naked chest. I’d only seen him this mad once before; the moment he’d learned I was pregnant. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This shit stops today,” he barked out. Oh good, we were on the same page, I thought to myself despite his harsh tone.</p><p>“Thanks for last night. I didn’t mean to come on to you like that, but I’m glad you didn’t get the wrong idea about us.” I told him, a mixture of relief and a little sad, that I was going back to my special toy drawer; the real thing was always better.</p><p>If at all possible, his expression turned even more murderous. “I’m not even touching that comment right now.” Huh? I was thoroughly confused. What was he—</p><p>Cutting off my thoughts, his ground out words completely threw me, “You need to cut back on work. You shouldn’t be working while you’re this sick.”</p> <p>“Excuse me?” I asked completely dumbfounded. My confusion fell away, replaced immediately by annoyance. Like hell he was telling me what I could or couldn’t do.</p><p>“You’re too fucking sick. You need money, you come to me and don't even get me started on that shit-box car. What if you have an accident or it breaks down?” Pushing off the bench, he took a step toward me filling the room with his fury.</p><p>“I suggest you shut the fuck up before I really lose my shit, asshole.”</p><p>“I’m buying you a new car today. It’ll be here before you leave for work.” Oh hell no! I felt the last of my restraint snap like a rubber band. The need to defend my piece-of-shit car kicked in. He might be right, but it was about all I had left.</p><p>“The fuck you will! I don’t need your charity. My car will do just fine, thank you very much,” I snarled at his alpha attitude.</p> <p>“How you gonna get to work if it blows up? It’s my kid which makes it my responsibility,” he barked out. I was heading quickly toward furious when he pushed me right over the edge. “You need to get out of this piss-ant apartment. It’s no place to raise a kid, especially not my kid.”</p><p>“You think I don’t know my life isn’t ideal for a baby? You think I don’t see this! I’m not a fucking idiot. Getting to work doesn’t matter because I don’t have a damn job anymore. The apartment will do until I find something else, which is none of your business. I don’t need the added stress of you and your crap, so take your concern and shove it far up your ass!” I screamed, the blood roaring in my ears and my breath coming fast. I’d gotten so mad I’d let slip that I’d been fired. I didn’t want him to know. I wanted to find a new job and just pretend it hadn’t happened.</p><p>“You lost your job? Were you even going to tell me?” he growled in a truly menacing voice. I had no idea if it was meant to intimidate, but not this woman. Fuck no.</p><p>Clenching my fists around my towel, I glared at him daring him to challenge me some more. “Like I said, it isn’t your business. Now get the fuck out!” I snapped pointing at the door.</p><p>Moving past me, he stopped suddenly leaning into my face and sneered, “We aren’t done here. I have plenty more to say when I’m not late for work.”</p><p>Before I could curse him out or punch him in the jaw, he turned and stormed out the front door slamming it hard behind him. Quickly snapping back to reality, I paced the living room. I was so angry I couldn’t think straight.</p> <p>I stomped down the short hallway determined to calm down and start my day over again. Grabbing my clothes, I quickly dressed myself and padded into the bathroom forgetting about the tiny tear in the linoleum. My foot caught and I ripped forward. Before I could right myself or even throw my hands out to break my fall, my stomach slammed into the corner of the vanity. My body rigid and my mouth forming an O, I cried out as a sharp pain ripped through my belly.</p><p>Attempting to right myself, I waited for the pain to subside.</p><p>But it didn’t.</p><p>After a full minute it became very clear I was in trouble.</p><p>My very first thought as I reached for my cell was on my baby. Oh God! God, no. Please! Not the baby.</p><p>Chapter Seven</p><p>Trip</p><p>After a quick stop at home to shower, change and swap the truck over for my Harley, I pulled into work spying Scarlett’s Cobra in its usual parking spot. Hopefully, she’d not give me shit about being late. I was in no mood to deal with it this morning. Why couldn’t she see I was just trying to do what was right? I was helping her. She had lost her job; she lived in a rundown apartment and her car should have been set fire to years ago. She was so damn stubborn. I had not meant to get so angry, but seeing her sick like that and dealing with it quietly on her own with nobody to take care of her, just pissed me right off. She should have asked me for help, or at least told me she’d been having a hard time.</p> <p>Walking quickly through the parlor with my head down, I made my way to my station and set up for the day. My first appointment was already in the waiting room so I had to get my shit together.</p><p>I was still stewing on the shit-storm that had gone down hours later, cleaning up after the client who’d just left. I snapped off my gloves throwing them in the trash when Scar came running in the room looking panicked. “You have to go.” She rushed out clutching her cell to her chest.</p><p>“What? What are you on about?” I asked, confused by her words.</p><p>“It’s Teeny!” She took a deep shuddering breath “You have to go, now.” My stomach dropped and my ears pricked.</p><p>“Slow down. What’s going on?” A cold sweat broke out across my face.</p><p>“It’s the baby. Teeny and the baby. She’s hurt,” Scar cried.</p><p>Jumping up, I knocked over the tray of instruments and grabbed her by the shoulders. “Hurt, how? Scar, tell me what you know?” I begged giving her a small shake.</p><p>Snapping out of her panic, she locked her teary eyes with mine. “She fell. You need to get to St Joseph’s hospital. Now.”</p><p>Without a second thought, I was out the door and driving way over the speed limit rushing to get to the emergency room. I just had no idea what I would find when I got there.</p><p>“Which room?” I yelled toward the group of nurses. My nerves were shot and I was out of breath. I’d almost been carted off by security trying to get into the ward. I actually had to tell them I was her husband just to get past the big white doors. A woman in a white coat approached me carefully. “I might be able to help you. Who are you looking for?” she asked in a placating voice.</p><p>“My—my wi—my Teeny. She fell and...the baby. My baby. She has my baby.” I stuttered. My stomach in knots, I looked around feeling completely useless and utterly terrified.</p><p>“Oh, I’m so sorry. Please follow me,” she said quietly turning and walking ahead of me. Sorry? She was sorry... My mind immediately went into overdrive thinking the worst had happened as we approached a room toward the end of the hall. “She’s just resting now. I’ll be back in about ten minutes to check on her and answer any questions you might have.”</p><p>Nodding, I pushed into the darkened room; the only light was streaming in through a crack in the curtains. With quick purposeful strides, I made it to her bed. Teeny glanced up at me and did a double take. “What—what are you doing here?” she asked honestly confused. “Scarlett,” she snapped accusingly as the pieces clicked together. My heart was still pounding behind my ribs as I ran my eyes over her.</p><p>Looking between her stomach and face, I seemed to have lost all ability to speak. Ice-cold fear gripped me; the thought that we might have lost our unborn baby had me feeling like I was standing on broken glass. It must have been written clear across my face because Teeny grabbed my large inked hand in her tiny soft one and whispered, “The baby’s fine. Everything is fine. It’s okay, Trip.” The breath I didn’t know I’d been holding rushed from my burning lungs and my shoulders lost most of their tension.</p><p>Something snapped inside me. I had been so damn scared she was hurt. I hadn’t stopped to think about the fact it wasn’t just the baby I was scared for. A squeak left her lips as mine unexpectedly crashed down on her mouth. Cupping her pretty face in my hands, I put everything I was, everything I had, and everything I wanted to be into that one kiss.</p><p>Pulling back, I stared into her surprised eyes and spoke thickly, “You scared the shit outta me. Don’t ever do that again. Never.” Taking a deep breath, I tried steadying my frayed nerves. “Damn, Princess. What the hell happened?”</p><p>She gave me a quick rundown of how things had gone after I left, up to the point I’d arrived. The sick feeling in the pit of my stomach still hadn’t lessened any at the thought of how badly the whole thing could have ended. I couldn’t even take pride in the fact my point had been proven; she needed somebody to take care of her.</p><p>“What happens now?” I asked. “They’ve checked you out properly, right?”</p><p>“Yeah. I just have to wait for the doctor to look me over once more before I can go home.” Home? I glared down at her wondering how I was going to make sure she wasn’t left on her own. Maybe I could call on the girls and Ma to help me out, drop in and make sure she was okay when I couldn’t.</p><p>The sound of the door opening interrupted my moment. In walked the lady doctor who’d helped me in the hall, pushing an ultrasound machine.</p><p>“Okay, we’ll just have a little look at bub to see everything is okay, and then I’ll do a quick exam”</p><p>Once again, I was completely blown away by the grainy images on the screen. The tiny flicker of a beating heart absolutely absorbed me.</p><p>“Everything looks perfect. There’s no problems there. Do we want to know the sex of your baby while you’re here?” The doctor looked at us waiting on an answer. “You’re eighteen weeks now and we usually like to wait until twenty weeks, but seeing as this is the last opportunity to see, I figured I’d ask.”</p><p>“Oh, can we?” Teeny piped up looking from me to the doctor asking for clarification from her and permission from me. She was including me, unknowingly so, but the gesture was more than a little wanted.</p><p>“Have at it,” I smiled looking back up at the screen in awe; unlike last time, the baby wasn’t a jellybean. Our kid had hands and feet, a nose and ears. It was amazing and completely breathtaking. A lump rose up in my throat as I stared in wonder at its tiny form.</p><p>“Ohh, damn. Stubborn little thing.” Teeny’s laughing voice drew me back to the present.</p><p>“What?” I asked shaking the fog from my head.</p><p>“Your little one has its legs crossed. No chance of finding the sex out before birth. Sorry guys.” The doctor turned the machine off as she spoke and cleaned the goop off Teeny’s belly.</p><p>“I’ll be back in a few moments, and if everything is okay with the last lot of blood tests, you can go home,” Doctor Wood explained once she had finished poking and prodding Teen’s belly.</p><p>“You’re sure?” I pressed, still not quite convinced.</p><p>“With a small smile, the doctor turned to me. “Teeny and the baby are fine. They were both very lucky.” She patted me on the shoulder with a small laugh on her way out the door leaving us alone in the quiet room.</p><p>Rather than standing around fidgeting, I busied myself trying to be useful. “Here, drink some more of this.” I pushed the cup toward her face again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I don’t want anymore,” she snapped, clearly annoyed by my efforts. “Stop coddling me “</p><p>‘I’m not coddling. I’m being helpful,” I argued with a pout.</p><p>“You’re coddling me and it’s annoying. I told you I’m fine. The doctor told you I was fine. The baby and I are fine. Stop, please,” she chided.</p><p>“You fell,” I pointed out.</p> <p>“Yes I did, but both the baby and I are fine.”</p><p>Out of the corner of my eye, I saw the doctor move back into the room and sit on a stool at the end of the bed. “What is she—“</p><p>Lifting the sheet up to Teeny’s knees, the doctor pulled her tray table a little closer and reached for a small tube. She sat closer down between her legs. My brows furrowed.</p><p>Was she?</p><p>“Are you supposed to do that? Down there, I mean. Is that safe? I don’t think you should be putting anything up there. There’s already something up there. I mean, don’t break it or anything. I need that.” This chick was makin’ me nervous.</p> <p>Shifting from one foot to the other, I leaned forward to do fuck knows what. When Teeny wrapped her hand around my arm, she hissed “Move any further down that way and I will break you”.</p><p>My brows bunched but I decided to heed her warning. She sounded pretty serious and the mean look on her face was enough to have anyone backtracking.</p><p>While she was down the business end, Doctor Wood asked, \"How many times a week do you have sexual intercourse\"</p><p>My face lit up. I answered quickly figuring Teen wouldn’t want to talk with a chick’s hand up her snatch. “A lot! Probably, umm, twenty,” I nodded my head, crossed my arms and puffed my chest out. Teeny made a gurgling sound biting down on her lip and trying not to laugh at my elaborate lie. “Yeah, about twenty times a week. That sounds about right, doesn’t it?”</p><p>Shaking her head with a smile, the doctor then asked, \"What do you do?”</p><p>I pondered for half a second and answered, “Well, sometimes she's on top and sometimes I'm on top, or I take her from behind.” I thought it had some bearing on the baby being okay and all that.</p> <p>Laughing and shaking her head, she clarified, \"No dear, I meant what does she do for a living?”</p><p>“What’s that got to do with anything?” I asked completely confused. Far as I knew, it wasn’t good form to ask questions when you already had the goods in your hand so to speak.</p><p>“It doesn’t, dear. It’s just polite conversation,” Doctor Wood smiled, lowered the sheet and rolled back on her chair snapping her gloves off.</p><p>“Ha! All I had to do was get her drunk to get my hand up there.” The second the words left my mouth, I could feel the daggers Teeny was staring at my back. I turned and winked at her, “Don’t sulk, Princess. It’s the truth.” And it was. The reason she was lying on the table knocked up with my kid was because after a few drinks, I’d gotten my hand up to the sweet spot.</p><p>Doctor Wood flushed and shook her head. Turning to Teeny, she said, “Everything’s fine. Baby is sitting in the right spot. All your measurements are perfect. The blood tests are all clear and you haven’t done any damage. You live alone though, right? “</p><p>“Not anymore she doesn’t. She’s moving in with me,” I piped up smiling smugly at the spur of the moment decision that I knew was going to get me the evil eye in three, two, one...</p><p>Bam!</p><p>There it was. Teeny glared at me like she could single-handedly turn me into a pile of ash.</p> <p>“Good! I think that’s a great idea to have somebody around at the moment.” Doctor Wood softened, “You need to keep your mind on what’s good for you and the baby right now.”</p><p>Teeny’s answer was to simply scowl. I shrugged my shoulders and pointedly looked at her with my eyebrow raised. It was fine by me; I wasn’t giving her a choice anyway.</p><p>Chapter Eight</p><p>Teeny</p><p>“Did you leave any of my stuff behind?” I grumbled as Trip, Mace and Remy walked past me with more boxes. Seemed to me, they’d ignored my directions and brought everything I owned.</p><p>“Just so you know, I’m not staying long, so this...” I gestured to the pile of boxes from my perch on the sofa, “was unnecessary and a waste of time.”</p><p>“We left the furniture,” Mace grinned proudly at me before grabbing Scarlett around the waist, throwing her over his shoulder and making for the door.</p><p>With a giggle, Scarlett waved and said, “We’re leaving apparently. Dinner tomorrow night.” I nodded and she called out, “Don’t forget!” just as the door slammed shut behind them.</p><p>Smiling and watching after them, I was loving how happy Scarlett was. It’d been a long time coming and hadn’t been an easy thing for her to let the walls down and accept Mace was her somebody. A pang in my chest reminded me I still hadn’t found that somebody, and I likely never would. The little person growing inside me would be the most important thing in my life, and I knew dating would be near impossible. “I’ll make you two some lunch,” I said. Shaking off my serious thoughts, I began pushing up from my spot on the sofa.</p><p>“You move from that sofa and it won’t be pretty,” Trip scowled from the end of the sofa I’d been laid up on for the last week. I’d been put on light duties by the doctor after my fall, just in case. Trip took light duties as not moving around. The one time he’d caught me in the laundry with a full basket of clothes propped on my hip, he unceremoniously picked me up and put me to bed, ranting and cursing about being a stubborn shit. He was driving me crazy to the point it was beginning to get suffocating. Not only had he waited on me hand and foot, he’d offered to ‘help’ me shower.</p><p>Yeah...right!</p><p>That wasn’t happening. I’d meant it when I decided the thing between us wasn’t going to happen again. Besides, I’m sure he had an entire black book of booty call phone numbers to choose from. The thought of Trip and one of his whores turned my stomach. I had to keep reminding myself he wasn’t mine. He wasn’t what I—Shit, who was I kidding! I could easily fall for him just so long as I didn’t mind having my heart torn to shreds in the process.</p><p>“If I have to stay on this sofa for one more minute...” I said slowly pronouncing each word as if speaking to a foreigner, “I’m. Going. To lose. My. Shit.” Feeling slight satisfaction when his scowl deepened, I added, “And it’ll be directed at your bossy ass.” I could hear Remy chuckling softly from the direction of the front door. Looking over, he waved and quickly left, apparently realizing how this situation was about to go. Smart man.</p><p>Trip’s smirk was cut short by a throw pillow to the face.</p><p>Direct hit!</p><p>I burst out laughing at the incredulous look on his face. My laughter died just as quickly when his lips turned up in a manic smile. The glint in his eyes didn’t bode well for me. I was automatically on the defensive. “No, no, no. I’m sorry. I—Trip, stop. I’m sorry! Really!” He was taking calculated steps toward me, and getting closer by the second. My eyes darted around the room looking for the best escape. Just before he got to me, I jumped up and ran toward the front door. Without a second thought, I raced across the quiet street to Scar and Mace’s place, with Trip yelling behind me that I needed to get back on the couch. I pushed through their back gate and came to a quick halt; Trip grabbing me around the hips as he crashed into my back from the sudden stop. “What the—Oh my God! Oh my God!” I screamed covering my mouth.</p><p>“Fuck me,” Trip muttered under his breath.</p><p>“Holy shit!” Mace yelled startled.</p><p>“Ahhh!” Scarlett screamed.</p><p>We’d just witnessed something that nobody needed to see. Scarlett had old-style vinyl pool loungers along one side of her pool, and right there in the dusk moonlight, was Mace’s very nice, very firm ass in the air, board shorts around his ankles, Scar under him thrashing and moaning. We’d interrupted them having sex in the backyard! I felt the blush rise up my neck and face. Scar had told me he had a sexy ass but holy crap...he really did. It was almost as good as Tr—No, not going there. I shook my head to erase not only my train of thought, but the fact I had just ogled my best friend’s fiancé’s ass.</p><p>A scream and loud splash of water had me rushing forward in a panic. Mace, fortunately with his pants up, dove into the pool as Trip ran past me and did the same.</p><p>“Hurry, hurry!” In all the commotion, Mace had jumped up from the lounger so quickly, it’d set the springs in the chair off causing it to fold up around Scar and slide right into the pool.</p><p>Both emerged with one side of the chair each. All I could see clearly was Scarlett completely naked, and her white backside poking through the soft plastic slats.</p><p>Snagging a nearby towel, I threw it over her bare body while the boys extricated her from the clusterfuck that was Scarlet, Mace and any sexual activity near water.</p><p>Out of nowhere, Scar burst out laughing. “I think we need floaties and protective eyewear next time, baby.” She looked up at Mace’s smiling face.</p><p>“Oh, gosh! How disgusting, Norman! They’re at it again!” We all turned in the direction of the female voice to see Scar and Mace’s nosey old neighbor poking her head over the fence, a look of disgust plastered on her face.</p><p>“Fuck off!” Scarlett yelled still smiling. The hilarity of it all sunk in leaving me laughing so hard, I had tears in my eyes. Scarlett, wrapped tightly in her towel, was safely in Mace’s arms still giggling.</p><p>My laughter abruptly cut off and turned into a gasp when I was scooped off my feet. My arms instantly went around Trip’s neck. “What the hell?” I asked slightly confused.</p><p>“Told you. Stay on the sofa, Princess.” His lips turned up slightly and all I could think was how much I wanted to suck on that lip. A shiver that had nothing to do with the fact he was soaking wet ran over me, and my nipples instantly perked against my bra. Each step he took, jostled me slightly causing them to rub and become painfully hard. He cleared his throat when a tiny moan escaped my lips. I could clearly feel his erection poking against my back. This didn’t surprise me in the least; it was as if he constantly had a hard-on. It made my days harder than they needed to be, not to mention his habit of walking around in nothing but a towel or loose fitting pants that rode dangerously low on his hips. Living with Trip was fast becoming my favorite torture. It had, however, given me plenty of visuals for my B.O.B time. I mentally reminded myself to pick up some extra batteries.</p><p>“That a gun or you happy to see me?” I couldn’t help myself. I seemed to get a kick out of poking the sleeping bear so to speak.</p><p>A grunt was the only answer I got as he pushed through the front door and gently dropped me on the couch. He turned his back and stomped toward the stairs. Smiling to myself, I pushed him further. “There’s some lotion on my dresser if you need to take care of that.”</p><p>He stopped mid-stride, spun around and grabbed my head in his hands crashing his lips down on mine. Kissing me like a sex-starved maniac, he stole any smart-assed reply I may have had. My brain thoroughly scrambled, he pulled back panting hard and growled, “Don’t push your luck. I could have you spread out with my dick buried deep inside you at any time. I’m trying to behave, but my restraint is slipping. Fast.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I couldn’t even process that cocky statement seeing as I was in a fully-fledged lust coma so I just sat there panting and watching his retreating form. I gripped the sofa so as not to race after him and have him make good on his threat.</p><p>Trip</p><p>Fucksake!</p><p>Teeny was seriously pushing my buttons. I’d had constant wood since she moved in, and I meant constant. Stripping down and jumping into the shower, I mumbled to myself, “Freakin’ woman.” The hot water running over my sore muscles, I replayed what I was sure had to be purposeful punishment over the last week.</p> <p>Day one: she walked around in tiny short shorts and a barely-there tank top that showed her lacey red bra underneath. This inadvertently made me kick my bare toe on the coffee table when she’d bent over.</p><p>Day two: I came in from work to find her asleep on the couch in a pair of shorter shorts that very well could have passed for panties and another torturous singlet top that had her boobs spilling out.</p><p>Day three: I woke up from a wet dream. Yes. A wet fucking dream like some teenage boy who’d just discovered his first peek at a Playboy magazine.</p><p>Day four: ...well, you get the point. I hadn’t beat the meat this much since I’d figured out what it was for. I was ninety-percent sure I was forming blisters and I was ready to take out shares in the world’s largest lotion company. I needed to be inside her again before I lost my ever-loving mind. From the moment I’d first gotten Teeny under me, I’d lost interest in all other women. If my dick wasn’t constantly standing to attention when she was around, I’d start thinking it was broken. She’d ruined me; it was finally time I laid it all on the line. Yep, I was gonna man the fuck up and get the girl.</p><p>But first, I had a problem to sort out.</p> <p>Teeny</p><p>As I got to the bathroom door, I open my mouth to call out and let him know I was making dinner, but stopped dead. The door was slightly ajar and I could see a very sculptured back, strong long legs and a perfect ass. One arm was bent on the wall leaning his head against it, while his other arm moved back-and-forth in a slow rhythm. I opened my mouth to take a deep breath and choked on my tongue.</p><p>Oh, sweet baby Jesus! He was jacking off.</p><p>Being as quiet as I possibly could, I took a step back, my face flushed and nipples instantly hard against my shirt.</p><p>“Mmmm.” His low throaty groan sent a pool of heat to my poor neglected nether regions. I looked around quickly, because you know, there might have been another creeper watching my roommate and baby daddy whacking it in the shower and all.</p><p>His hiss drew my attention back to what he was doing. Squeezing my thighs together and trying to ease the ache, I stood staring at him. The pumping of his arm, the muscles in his ass moving with every other stroke strengthened my ache. My breathing picked up speed and my body started to tingle.</p> <p>I was on the verge of spontaneous combustion. My entire body was warming. Holding in a groan of my own, I took a tentative step forward watching his body move under the stream of water. Quietly and carefully, I slid my hand down my chest palming my aching breasts and pinched one very sensitive nipple. This was so wrong and so dirty, but I was so turned on I couldn’t stand it anymore.</p><p>I closed my eyes for a moment. “You like watching me, Princess?” His rough, sexy voice made me squeak in fright; my busy hand shot up to my mouth and my face flamed bright red.</p><p>Busted.</p><p>Standing millimeters in front of me, completely naked and dripping water stood a very hard, very sexy Trip.</p><p>Planting his lips on mine, he pulled me forward into his wet chest. Flicking his tongue out to lick my lower lip, he then slid it in my slightly parted mouth.</p><p>Okay, pull away. Pull away, now. Pulling away. No, don't push into him! Loosen the kiss! Not deepen it!</p><p>My arms came up to his neck. My hands gripped his hair on their own accord. Holding onto him for dear life, my fear and pride faded into the background and my mind became all too clear. If it were okay to have a sexual relationship with anyone, it would be with the father of my baby, right? And why shouldn't I have sex with him? What’s the worst that could happen? I can’t get pregnant times two! Right?</p><p>Trip opened his mouth a few times, clearly unable to get out what he wanted to say. “I want you,” he finally whispered.</p> <p>After looking at each other for a long while, I nodded and whispered back, “Okay.”</p><p>He picked me up off the ground and carried me back to his room. Laying me down gently on the bed, he proceeded to devour me with a gentleness I didn’t know he possessed.</p><p>Afterward, sweaty and tangled up together in bed, Trip hid his face in my neck and mumbled something incoherent. “I can’t hear you while your face is in the pillow.”</p><p>Pulling back, he nervously asked, \"So...can we do this? Again, I mean? Because I don't know how I'm going to keep you around without becoming a walking hard-on, Princess. My balls are gonna fall off soon; they’re that blue and I think I have a blister.\" He held up his palm to show me; there was absolutely nothing wrong with his hand.</p><p>Tension broken, I laughed, \"I—I guess. I mean, we're not hurting anyone, right?\"</p><p>Except myself.</p><p>My smile faded at the thought of Trip ripping me apart. Protecting my heart, I stipulated, \"But this doesn't mean we're exclusive.\"</p><p>Trip’s entire body went stiff as a board; the anger radiated off him. \"What do you mean we're not exclusive?\"</p><p>\"You can still fuck who you want, and I can still sleep with whoever I want to, but we gotta be safe. Nothing unprotected and we don’t bring them home,\" I clarified knowing full well that I was not okay with Trip fucking someone else, and by his reaction, knew he wasn’t okay with me fucking someone else either.</p><p>I took a small piece of comfort in that knowledge, but pushed the issue so much that he gave in.</p><p>My plan was to not only keep my own walls up, but push Trip into finding an infatuation with somebody else. I was certain I had just signed over permission for him to break me. I just had to hope I could pick myself up afterward.</p><p>Chapter Nine</p><p>Trip</p><p>Hours after she fell asleep pulled tight to me in my bed, I lay there feeling more conflicted than I ever believed possible. I’d never felt this way before. I’d never wanted this. I wasn’t even completely sure what this was. A few things I did know though were that I was slowly chipping Teeny’s protective layers away. The idea of her laying like this in somebody else’s arms, some other fucker touching her, didn’t bode well. In fact, it clear pissed me way the fuck off, and if I was being completely honest with myself, I couldn’t imagine banging anybody but her. I couldn’t see anything past her.</p><p>All of this brought me to one obvious conclusion.</p><p>I’m as good as fucked.</p><p>Chapter Ten</p><p>Teeny</p><p>Four weeks later...</p><p>“Hey, tart,” Scarlett said closing the front door behind her.</p><p>“In here,” I called out letting her know I was in the kitchen. I shoved the barbecued pork ribs back in the oven and turned around to give her a peck on the cheek. “The guys left yet?” I asked pulling out a cold beer and sliding it into her waiting hand. I then snagged an orange juice for myself.</p><p>“Yeah, they left about ten minutes ago,” she said after downing half of her beer. The girl could drink. In fact, she’d drunk the guys under the table on more than one occasion.</p><p>“The girls will be here in a few minutes, but seeing as I have you all to myself, I wanted to ask you something,” Scarlett piped up looking a little unsure, which was odd and so unlike Scarlett.</p><p>Licking my lips, I braced myself for questions about Trip and me. We’d been seeing each other for about two weeks. Although Scarlett knew all the details, I had been waiting for her to put her two-cents worth out there. “Shoot,” I said leaning back against the kitchen counter.</p><p>“Well, I’m getting married.” I snorted and didn’t bother pointing out that I was quite aware she was getting hitched, seeing as this was her bachelorette party and I’d been helping plan the entire thing for months. “I’m also going to be on my honeymoon.” She was stalling, which meant whatever she had to say must be important for her to be pussyfooting around. Nodding my head, I gestured for her to keep going, a little more at ease that I hadn’t just landed myself in a Scar-type lecture. “I wanted to ask you if, I mean, you can say no and I won’t be offended but—“ she took a big breath and rushed out, “willyouworkforme?” Her cringe made me laugh out loud. It figured she’d be worried about asking me. Six weeks ago, I would have glared at her and told her I didn’t want her handouts. I had been slowly working on lowering my pride and accepting a little help without snapping about being a charity case. Maybe I was getting soft or maybe I’d just come to realize the people around me genuinely cared about me and just wanted to help me out.</p><p>The hilarity of the wary look on her face and the way she was gripping the bottle in her hand had me laughing louder. She was waiting for a fight that wasn’t going to happen. “What is it you want me to do? You know I’m not licensed to ink.”</p><p>“You can be though! I don’t know why you never came back,” she said quietly with regret shining in her eyes.</p><p>I had been about two-months shy of completing my apprenticeship when I quit to take care of my mother during her last breakdown. Scarlett supported my decision knowing how hard it was to take care of the woman who’d looked at you like a disease for most of your life; however, she’d always encouraged me to go back and I never had.</p><p>Don’t ask me why I continued putting it off. Maybe it was me listening to my mom and the millions of times she’d told me I’d be nothing but a waste of space. A nobody.</p><p>I’ll admit I was a pussy. A scared little bitch.</p><p>Mindlessly rubbing my hand over my swelling belly, I smiled and made a decision that I should have made years before. “You know what, I might just do that.” With one simple sentence and small choice made, I felt giddy at the possibilities. This might just be the second best decision I’d made recently. I’d made the first best decision walking out of the doctor’s office knowing I was going to be a mom and not fighting it.</p><p>“‘Bout fucking time, bitch!” Scarlet all but whooped, smiled and breathed out hard. “I thought I was gonna get my head taken off for that. When can you start?”</p><p>“Wait, how am I going to finish my apprenticeship with you away?” I asked confused, and then it dawned on me. “Trip?” A million excuses ran through my head.</p><p>Could I spend all that time with him? Could I have him instruct me without me biting his head off? Unlikely. An idea struck. “What about Remy?” Yeah, that’d work. “Remy can do it, right?” Please, please, please, I mentally chanted to myself hoping I didn’t have to spend that much one-on-one with Trip. He was already breaking down my carefully erected barbed wire fence.</p><p>Regardless of the non-exclusive stipulation I’d put on us, he was home every day right after work, and taking me out on weekends or hanging around when I was tired. We were fast becoming a very real something. If it kept going the way it was, I was liable to screw everything up and fall in love with the big ape. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The big sexy ape, I might add.</p><p>“Remy’s leaving,” she told me sadly. “Day after the wedding, he’s leaving.” My hand came up to my mouth in shock. Remy had been at Needle’s Kiss since Scarlett first opened her doors.</p><p>“What?” I asked “Why? I’m so sorry. That’s bad timing, babe.” Why he’d leave right when Scarlett needed him was beyond me.</p><p>“It’s sad to see him go but he has some family issues to sort through. He wasn’t very forthcoming, but I know it means he has to move away and he doesn’t have a lot of time.” She shrugged shaking her head, and then jumped up and snagged another beer from the fridge before turning back to me, eyes pleading. “This is why I really need you in the shop. I know you won’t be able to do full time and you can make your own hours or whatever, but I do need the help and if I could choose one person to take over for him,” she smiled softly, “it’d be you.”</p><p>My throat clenched. “Shit, don’t get all squishy on me. I will cry, you know! And I’m so freakin’ sick of crying. Stupid tears.” I sniffed busying myself with pulling snacks out and dumping them in bowls. “One more day, honey. One more and you’ll be a missus,” I reminded her, changing the subject on the sly and attempting to ignore the fact that I’d not only be living with Trip but working very closely with him for the foreseeable future. Denial. That was the best way to deal with it. At least, that’s what I’d keep telling myself.</p><p>A big smirk behind her beer bottle was her only reply to that. She was happy which in-turn made me more than just happy. Instantly, she ruined my feeling of elation by opening her mouth “So, you and Trip, huh?” Ah, fuck here we go, I thought rolling my eyes.</p><p>“It’s just convenience. We’re living under the same roof and my hormones are apparently turning me into a horny sixteen-year-old boy seeing his first boob and...well... Trip is a sixteen-year-old boy trapped in a very fuckable, well-sculptured man-candy body.” My mouth started to water at the thought of that very sculptured body and what it’d done to me not twenty minutes before Scar had walked in. “It’s nothing. Just scratching each other’s itches is all.” And boy, oh boy, did the man know how to scratch an itch.</p><p>“You, my sweet little Teeny, are blushing like a schoolgirl in a confessional.” She laughed, “You can’t bullshit a bullshitter, babe. You’ve been crushin’ on that boy for years and you’re telling me it’s just sex? Nope. Not buying it.” She shook her head “I know you as well as I know myself, and any chance you’ve ever gotten you’ve eye fucked the shit out of that boy.”</p><p>I broke out in a sweat and repeated completely unconvincingly—myself entirely aware of the fact I was trying to assure both of us, “It is just sex.”</p><p>Scarlett simply smiled, picked up her plate of food and wandered into the living room. Luckily for me, the doorbell sounded letting me know Trip’s sisters were here. “I got it,” Scar called out leaving my lying ass to organize the drinks.</p><p>“What the fuck?” Halfway through a game of Never Have I Ever, I was sitting cross-legged on the floor mouth gaping open at Haven’s empty glass after Scarlet pulled out the ‘I’ve never had sex on a Harley’ question. Not only was I processing the fact that only my juice and Haven’s shot were gone but there weren’t many people in town that owned Harleys and she looked more than a little guilty.</p><p>“Never have I ever slept with—,“ my question was cut short when the front door swung open and four of the hottest guys I’d ever see stumbled inside, all in varying degrees of drunk off their tits, except for the designated driver and man in question, Jude.</p><p>“Haven,” I whispered gaining her attention from the doorway. “He’s your brother’s best friend, honey.” The blush that tinged her cheeks along with the sideward glace toward the door answered any doubt I may have had. “Ah, shit,” I mumbled. Haven bit her lip and quickly looked away.</p><p>“I’ve come to drag you to my den,” Mace announced on a loud slur causing Scar to giggle hysterically. “Don’t laugh. I am caveman.” He jabbed his thumb into his own chest and then pointed at Scarlett. “You pretty lady. Cave, now.”</p><p>“Mace, you aren’t supposed to see her until the morning,” I reminded him as Trip came up behind me plopping down with a leg either side of mine.</p><p>“S’okay, I’ll bring her back in an hour,” he smiled and hauled her out the door.</p><p>“What’re we playin’, Princess?” Trip whispered in my ear; his warm breath sent a pleasant shiver over my body and scattered my thoughts.</p><p>“Um,” was that all I could muster as a reply? Um? His tongue darted out when he kissed the spot on my neck he knew made my knees weak. With a sigh, I gave in and tilted my neck to the side giving him more access. Who the hell was I kidding? Gave in? I’d given in weeks ago and this meant I was in big trouble.</p><p>“You girls stayin’?” Trip gruffly asked his sisters.</p><p>“I’ll take ‘em home,” Jude jumped in snapping his eyes away from Haven. Busted. “I have to take Remy anyway.” I couldn’t very well go and say anything with Trip sucking on my neck and a room full of people, so I settled for a very pointed look as Haven, who quickly grabbed her bag and shoes, hightailing it out the door behind everyone.</p><p>“We’re alone,” Trip growled into my throat where his lips were still working against my overheated skin. “I’m so hard I could cut glass and there’s only one place I want my cock.” My shoulders relaxed at his admission of not sleeping with anyone that night, I was constantly worried my stupidity would blow up in my face. I knew how much of a fool I was telling him we weren’t exclusive, but it was the only thing I could do to show him I wasn’t interested in having a real relationship. I should rephrase that; it was the only thing I could think to do to get him to move on from me, and let me be alone. In the meantime though, that itch was getting scratched.</p><p>Trip’s hand snaking around the front of me and up my skirt pulled me from my thoughts. “You okay, Princess?”</p><p>“I will be in a minute,” I smiled as his fingers gently ghosted up my inner thigh.</p> <p>“What where you girls playing?” he asked nibbling on my ear. My breathing picked up right along with my libido.</p><p>“Never Have I Ever,” I breathed out finding it hard to concentrate with his mouth and fingers going places.</p><p>“Hmmm.” The rumble of his voice shot right through me burning its path directly to my crotch. “Your glass is empty. What was the last question before I walked in?” What? My foggy brain couldn’t comprehend what he was asking; it was preoccupied. His fingers disappeared from running slow lines along the junction of my thigh and aching pussy when I didn’t answer him.</p><p>“Have you ever had sex on a Harley?” I pouted at the loss of his hand.</p><p>“You liked me drilling you on my bike, didn’t you?” he asked brushing my hair away from the back of my neck. “You’re the only chick ever been on my girl. Fucked or otherwise.” I gasped when he ran his tongue along the shell of my ear. “We need to do that again sometime. I loved having you spread out, my cock buried in you.” Trip’s dirty mouth only served to work me up even more. Flipping the switch, he pulled me up onto my knees in a demanding gesture.</p><p>“Mmhmm.” I loved when he got all macho and took control; it turned me on like nothing else. I also really loved drunk sex with Trip. It was out-of-this-world good and happening immediately if I had anything to do with it.</p><p>Trip</p><p>“You want this, Princess?” I ground my hips against her, one hand gripping her hip the other running back up and under her skirt.</p><p>Teeny pushed her ass back into me and whimpered. I could feel the heat even with my hand inches away from her cunt. She was primed and ready to go. Good thing too ‘cause I needed in her like I needed to breathe. I was so hard my dick was throbbing like a motherfucker. So hard it hurt.</p><p>“I need in you now, baby.” My voice was low and husky with hunger. I was still buzzed from drinking, which meant I needed it hard and fast.</p><p>“Oh, yeah,” she moaned low in her throat when I pulled her lacey panties to the side and slid two fingers in. I nearly came on the spot with how wet she was. Primed was an understatement; she was nearing explosion. Damn, this woman could bring me to my knees. In more ways than one.</p><p>“Gonna go hard, baby.” After a few quick thrusts of my fingers, I pulled them out and licked them clean. Fuck, I loved the taste of her! I pressed down on her back showing her how I wanted her and lifted her skirt up so her perky ass was perfectly lined up. One hand wrapped around her panties and the other freeing my cock, I nudged her legs apart.</p><p>“Love you on your hands and knees,” I murmured and let go of my dick, only to tear the lace that was barely covering her clean in half and threw it behind me. “Owe you another pair,” I distractedly mentioned, because God only knew how many pairs I’d already torn. Running one hand across her smooth skin, the other wrapped around my hard on, I moved my hand slowly from base to tip and then back again. Teeny was breathing like she’d run a marathon, I bent and used my teeth, tongue and lips against her lush cheeks, all the way down and between her thighs.</p><p>Fuck, she was so responsive. Rubbing the tip of my dick through the wet heat between her pussy lips, I braced a hand tight on her hip, my fingers digging in.</p><p>“Trip, I need you in me,” she said hoarsely rocking back and forward trying to impale herself on my shaft. She was that desperately turned on. Without any more thought, I slammed home balls deep and threw my head back with a long growl. Drawing back, I did it again. Teeny clamped down on me and started riding out her orgasm. I’d barely touched her, but we had a raw sexual passion that I’d never had with anyone else before. I couldn’t get enough of her. I wanted to stay buried deep inside her for the rest of my sorry-assed life.</p><p>“Fuck, fuck, fuck. Oh fuck!” she screamed out as I pounded into her. The carpet beginning to burn my knees didn’t even register as I reached up to pinch her nipple hard. She threw her own head back and screamed loud uncaring who heard her as she gripped my dick like a vise.</p><p>She loved it rough.</p><p>Sweat beading across my back, I reached up ripping my shirt off, never breaking my merciless thrusting.</p><p>The hand I had on her breast came back to swat her gently on the ass testing her. Yelling out in bliss, she pushed her hips back into mine. Oh, yeah, my girl liked it dirty. I swiftly pulled out and flipped her onto her back; the need to own her overwhelming me. Teeny’s hand instantly went to her clit rubbing in a small figure of eight, her hooded eyes on me. I took my throbbing cock in my hand and stroked back and forth, back and forth, faster, flicking my wrist as I felt my balls draw up tight. I leant over her, thrusting my fingers into her heat as she came apart. When she did, it wasn’t the name Trip that came from her mouth. It was my real name. The name no woman has ever screamed during sex. The name no woman but her had ever had the right to scream out like that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Javerio,” she cried out, her back arching off the ground. That did it for me. I couldn’t hold back any longer.</p><p>A primal growl ripped from my throat and I pumped my cock harder and faster. Flicking my wrist, I let loose and I came all over her pussy and tits leaving her completely unaware that I’d just done the unthinkable and marked my territory.</p><p>Marked what was mine.</p><p>I had a feeling if she knew why I’d done that, she’d be pissed way the fuck off. In fact, I don’t think she even realized she had called me by my real name. And if she did, she was playing the ignorant card.</p> <p>“Drunk sex fucking rocks,” she panted heavily and closed her eyes looking worn out and totally content covered in my cum. Nope. She didn’t realize, but I heard her and was not in a hurry to forget.</p><p>Chapter Eleven</p><p>Teeny</p><p>“Hold the fuck still before you lose an eye,” I snapped at Scar. She’d been squirming for the last ten minutes while I put her makeup on.</p><p>“‘Fuck up, bitch! I’m nervous alright. What if I fall ass over tit and break my neck?” she rushed out fidgeting with her lace cami top.</p> <p>“Are you shittin’ me?” I laughed. “You? The fearless Scarlett, nervous?”</p><p>In perfect Scar form, she flipped me the bird and smiled, “Shut up and pass me my beer, please.”</p><p>“Here. Now, hold still. If I don’t get this stuff done, you’ll never get out there and Mace’ll think you stood him up.” I passed her drink and moved on to her hair.</p><p>We’d spent months making sure everything about this day was perfect and it was finally time. I was about to watch my very best friend get married to the man of her wet dreams. In all seriousness, I’d never seen two people more made for each other than they were. They challenged each other daily, but behind all the macho and tough exterior, they had found what we were all truly looking for. They’d found their special somebody.</p><p>With Scarlett’s dad been gone for a few years, she’d decided to walk herself to her future husband. The wedding party was small just me as the maid of honor and Trip as the best man; this was something I wasn’t looking forward to. In my stupid ‘protect my heart’ moment, I’d encouraged him to bring a date. Stupid, right? Something told me this was about to backfire on my ass in a big way.</p><p>It may have been the blonde bimbo I saw arriving in the too tight black dress. Who the hell wears a black dress to a wedding anyway? You wear black to a funeral not a wedding. I told myself my nit picking had nothing to do with the fact that she was here with Trip. My Trip.</p> <p>“Ready to get this dress on?” I asked after zipping my own floor-length strapless one, my belly poking out in front. Scarlett had offered to move the wedding date until after the baby was born. We argued about it for two days until I laid it out for her. If she got married while I was pregnant, baby midget would be in her bridal party too. Yes, the nickname had caught on, and yes, that reasoning was enough for Scarlett to carry on with her original wedding date.</p><p>“Ready as I’ll ever be,” she mumbled sounding anxious.</p><p>“Who ever thought you’d be saying that?” I whispered giving her a peck on the cheek.</p><p>“Not me, that’s for sure,” Scarlett breathed out shakily.</p><p>“Don’t cry. You’ll ruin the masterpiece I created,” I told her when I turned back around noticing her shining eyes.</p><p>Shaking her head, she held my hand and squeezed tightly. She quickly put on a brave face and perked up. “Here, I’ll do it. Your fat ass can’t bend properly.”</p><p>Poking my tongue out like a true lady, I slipped my white satin pumps onto my feet and steeled my own nerves.</p><p>“Oh, shit,” I jaggedly whispered when I took her in. Swallowing past the sudden lump in my throat, I croaked, “Now, I’m going to cry.” I breathily added, “You look stunning, honey.”</p> <p>She would never know just how much I meant what I was saying. She looked like an angel; glowing beautifully beyond belief and most importantly, happy.</p><p>“You cry, then I’ll cry, then we’ll both be a hot mess, and we’ll have to go out there looking like pair of raccoons that were sifting through garbage!” Scarlett told me smoothing out the front of her gorgeous wedding gown. A delicate shade of ivory fitted to her stunning curves. The bottom layer of satin was topped with an intricate lace that included a beautiful diamond baring the silken skin of her back showing off her tattoos.</p><p>Tattoos that were part of her. Tattoos she was proud to show.</p><p>“Turn around,” I whispered through the thickness in my throat. She turned and the view was no less amazing from the back of the gown. A fishtail train finished with more intricate lace and scalloped edging. Swarovski crystals were delicately sprinkled throughout with rich decorative beading at the empire waist.</p><p>In short, the dress was stunning. But I think it was Scarlett and the way she was glowing that made it even more so.</p><p>“You can do this. You’ll be fine. Just walk to the end of the aisle and stand there,” I rushed on a quick breath.</p><p>“Yeah, I’m pretty sure I know how to do this bit, Teen,” Scar smiled and took her bouquet of black and white roses from my hand.</p><p>“I wasn’t talking to you. I mean, I’m—just never mind let’s do this.” I turned, took a deep breath and waited for the double doors to open and the music to start.</p><p>“You know, I remember this really smart bitch telling me to pull my head outta my ass and get with the motherfucking program. Might be time for her to take a little of her own advice,” Scarlett finished in soft voice just as the music started up and the doors swung open.</p><p>“I’m not sure he’s anybody’s knight in shining armor though,” I whispered to myself remembering the day I’d told Scarlett those words.</p><p>Taking slow practiced steps, I managed to get halfway down the aisle before looking Trip’s way. My breath caught in my chest, my heart beating hard against my ribs. He stood beside Mace hands clasped in front of him complete in a black suit with a white shirt unbuttoned at the top, a tiny piece of his ink peeking out from underneath. His eyes trained on me as I tried not to fumble. Chewing on his lip piercings, he smirked. The idiot was so full of himself. I’d have bet he knew exactly how good he looked.</p><p>Ten more steps. Just ten more steps.</p><p>There was only one perfect song for Scar to walk down the aisle to. It was a no-brainer. Mace and Scarlett had their first real run in with the words of Daughtry playing in the background. Mace stood at the front of the room looking so handsome in his suit waiting for his girl. “I Know There’s No Life After You” played. The music kicked up a notch, and gasps sounded from across the room as Scarlett stepped into sight. Tears pricked at my eyes watching my best friend walk down the aisle toward Mace who was watching her like she was the only thing in the world. The love that burst from those two was something everyone surely hoped to find someday.</p><p>My heart constricted in my chest at their love. God, how I wanted that, but I was shit scared of it at the same time.</p><p>Four steps to go, my eyes were drawn once more to Trip’s. His gaze was unwavering, and his smirk slipped when I saw something else flicker in his eyes. Holy fuck. I had no idea what that look was, but it sent a flutter of longing through my belly and straight to my lady bits. I tried desperately to pull away from his stare as I edged closer, but for the life of me, my traitorous body just wouldn’t behave. I needed to remember he was here with somebody else.</p><p>Before I knew it, I was standing to the side of the altar eyes still fixed on Trip. His gaze didn’t waver. A flash of white filled my peripheral vision as Scar finally reached Mace.</p><p>Thank fuck! I was able to drag my eyes away from Trip to focus once more on the bride and groom. They looked amazing together. Scar’s art on full display looking sexy as hell, teamed with her rocking dress and bright red heels. Mace looked down at her with such unabashed love that there was no holding back the small tear that trickled down my cheek.</p><p>Shit. Do not cry. Do not cry!</p><p>I swiped at my eyes with the back of my hand, pretending to be scratching an itch. If worse came to worst, I could always claim Trip’s date had sneezed on me and given me something contagious. Blood sucking troll. I resisted the urge to check and see if Trip was looking at me.</p><p>The celebrant stepped forward and proceeded to start the ceremony, all eyes still on Mace and Scarlett; they were absolutely breathtaking together.</p><p>I changed my focus from Scar to Mace and bit down on my tongue to stop myself from sobbing. Is that a tear clinging to the corner of his eye? He was trying to hold it back, doing that sniffling thing that men always do when they want to pretend they're not capable of shedding tears. But there it was, falling down his cheek like a shooting star. I swear, the lights reflected right off that beauty and flashed its presence to the entire world. That one single tear just solidified how much he really did love my best friend. And I knew with my whole heart, she had just transformed from my Scar to Mace’s Scarlett. It was bittersweet and everything I secretly dreamed of.</p><p>“I do.” Scarlett’s words pulled me back to the moment. Smiling through the tears in my eyes, I pulled the tissue I had stashed in my bra out and began dabbing at my eyes.</p><p>“Do you Mace take Scarlett to be—”</p><p>“Hell yes!” Mace rushed out cutting off the celebrant. The entire room erupted in laughter at his eager response.</p><p>“Very well then, I now pronounce you husband and wife.” By this stage, I was choking up so badly I almost missed the next part. “You may now ki—“ The poor guy didn’t even get to finish before Mace had Scarlett pinned to his body giving her a kiss that was sure to make the room spontaneously combust. Cheers, whistles and loud clapping bounced off the walls. Sniffling, I mopped up the last of my tears and cleared my throat, ready to finish out the rest of my bridesmaid duties. I was so proud at the moment; I could have burst.</p><p>Following behind the bride and groom, Trip stepped up beside me placing his hand on my exposed back and leaning in close. His hot breath touching my ear, he whispered, “You looked fucking beautiful up there, Princess.” Dropping a small kiss to my cheek, he pulled away and kept walking beside me until we had made our way outside for the quick yet silent drive to Bob’s bar for their reception. Yes, Bob’s bar. It was the place Mace took Scar on their first date so it was a no-brainer, and the only thing Mace had asked for.</p><p>Damn. My feet hurt.</p><p>I was almost certain they were completely swollen and stuck into my shoes. I wiggled my toes to try and alleviate some of the pressure. I was starving because this kid apparently didn’t like me going more than an hour without shoving something in my mouth and I needed a nap.</p><p>Hundreds of photos had been taken before we’d even made it back to the reception; it was time for Scar and Mace’s first dance and Trip was nowhere to be seen. If it weren’t for the fact I had my eyes on his dumbass date, I would have thought he was off banging her. My stomach churned at the thought. I was thinking I should have stipulated no bimbos on the non-exclusive rule.</p><p>Could I do that? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>What was I talking about? The point of the non-exclusive rule was so he could find somebody else and move on from trying with me, essentially saving my heart from being crushed.</p><p>“Evenin’.” My head snapped up at the static voice drifting through the speakers. What the hell? “I’ve been asked to do somethin’ pretty damn special by my brother, so I figured I couldn’t say no.” There he stood on stage looking sexier than sin on a sick; his jacket gone, his white shirt unbuttoned at the top showing the colorful ink on his chest, the shirt sleeves rolled up just below his elbows and his hair looking like he’d been nervously running his hands through it, made him absolutely lickable.</p><p>“Before I start, I just want to say you, my brother, are one lucky son of a bitch, and in case you missed the memo, Scar, welcome to the family, darlin’.” My God, his voice set a fire inside of me that I had no chance of putting out; it was raspy and deep. It was the epitome of dirty sex and it made my girly bits sit up and take notice.</p><p>Clearing his throat, he stepped back and nodded to the band that I hadn’t seen entering the stage. Fuck me running! He was going to sing? I was so screwed. By the time he was done, I’d be a pool of jelly on the floor.</p> <p>The music started and the lights dimmed slightly. The guitars began to whisper across the crowd kissing our ears with sweet sound. Each pluck of the strings made my heart beat faster, so by the time the drums kicked in, my body was already pumping in time with each slap of the sticks.</p><p>That’s when it happened.</p><p>Trip opened his mouth and started singing; it was like the earth was pulled out from under me, and his voice was the only thing holding me up.</p><p>“Angel Without Wings” from Saving Abel was flowing from his mouth like an extension of him. His eyes were tightly closed, his face conveying the words that rumbled from his chest. Holy hell, he was gorgeous. A light sweat broke across my skin when he bent slightly at the waist belting out the lyrics like he meant them. Not like he was just singing, but he really meant them, which was ridiculous in itself. I mean, this was Trip we were talking about. He wouldn’t ever have feelings like that for anyone. But by God, I wanted him to feel that. I wanted him to feel that for me, even if he did break me in the end. He just dripped sex and bad decisions up there; I would even go so far as to say he should have been a freakin’ rock star; he was that good. He even had the cocky attitude down, and of course, the playboy ways. I wanted to get up there and lick him head-to-toe.</p><p>Either way, I had to stop and remind myself he wasn’t mine to keep.</p> <p>Chapter Twelve</p><p>Trip</p><p>The bass was thumping through the soles of my boots, the sweat running down my back making my shirt stick to my skin and the adrenaline rush through my veins. The words resonated so damn true. Teeny was everything I always thought I didn’t want but needed all at the same time.</p><p>I was going out on a limb in the hopes she’d wise up and hear what I was singing to her. This wasn’t for anyone but her. Mace and Scar had actually given me the idea seeing as I hadn’t sung since my band split up about five years back.</p><p>Nervous was an understatement before I stepped up on the stage. I was sure I’d puke but the moment the music kicked in and washed over me. I was in my own world; the only thing I could see was her.</p><p>Angel, that was Teeny in a nutshell; she was my angel. She walked around with her barriers up, but I could see that light beaming from the tiny cracks in her armor. I just needed to get close enough for her to let me in. She brought out something in me that I didn’t even know existed. She made me want to wipe my slate clean and start over.</p> <p>I would start over for her.</p><p>I finally understood what Mace meant when he said Scarlett made him want to be a better person. All this time, I had convinced myself that people lost their hopes and dreams, changed themselves when they cared about somebody.</p><p>I was wrong.</p><p>I cared for her. I cared about her and I cared enough to know I wanted...something more.</p><p>As the music faded out, I looked out at the crowd hoping to catch her face and find out if she heard what I was saying, but she wasn’t in sight. Feeling deflated and stung, I put that microphone on the closest speaker, and wiped my sweat-slicked face with the bottom of my shirt. I told myself it didn’t matter.</p><p>Screw it, if she hasn’t figured it out by now, what the hell is the point?</p><p>Chapter Thirteen</p><p>Teeny</p> <p>Making my way over to him where he was stepping down from the stage, I was taken back by the octopus hands of his date as she snaked up to him oohing and aahing, just about climbing all over him with praise, tits and no class.</p><p>Twirling one finger around a lock of hair and running the other up and down Trip’s chest, she smirked over at me, her skanky red nails standing out against the stark white of his dress shirt.</p><p>“Is this the chick you knocked up?” Stripper Barbie snarkily asked when I reached them.</p><p>Dumbfounded, I looked from Trip to her and back again. I never had an issue standing up for myself, but with one simple sentence, I felt crushed. It stung. That’s exactly what I was...just the chick he knocked up.</p><p>Trip’s silence only served to make me feel betrayed. I had nothing I could even say to that statement, and he clearly wasn’t going to defend me. Without another word, I spun on my heel and rushed out, only stopping when I stumbled to rip my shoes off.</p><p>Getting out of there as fast as I could, ignoring the strange looks I was getting, I burst out the front doors.</p><p>The sky opened up and cold wet droplets bucketed from the dark black skies. Bolts of lightning lit up the sky, followed by cracking thunder. Goosebumps broke out over my skin. Jealousy, anger and hurt radiated from my body.</p><p>I was pissed. Pissed at him and his whore date. Pissed that he was moving on. And pissed at myself twice over the first for encouraging it and the other for not giving enough of a damn to do something about it when I had the chance.</p><p>Unable to hold it back, I flung my stupid heels as hard as I could, just wanting to hurt something. Landing with a thud on the wet ground, I stood there in the pouring rain contemplating how I’d managed to screw everything up so royally. My dress stuck to my body, and I began to shake, perhaps from the water running over me or maybe it was the anger.</p><p>“What the fuck is wrong with you?” Trip’s voice penetrated the rain. I could only just make out the sound of his shoes in the heavy rain.</p><p>“Fuck off!” I screamed spinning around to face him. Trip completely ignored me and stomped closer, rivulets of water coming down his face.</p><p>“You need to get your fucking head straight. That was bullshit!” he ground out roughly.</p><p>“Don’t you dare come to me talking about bullshit! Don’t you fucking dare!” I couldn’t tell what was louder the storm or the blood rushing in my ears.</p><p>“You had no reason to be pissed at me. None, Teeny. I’ve bent over backwards for you, for our kid, for us and you still aren’t getting it.” A loud crack of thunder sounded somewhere close to us.</p><p>“Oh, I get it! I get it loud and clear. Once again, you gotta have some whore in my face. You just can’t not have some bimbo at your beck and call to suck your dick!“</p><p>His already mad expression turned furious. “What the fuck do you want from me? You want me to keep begging at your feet for crumbs? Is that it? You want me to be waiting in the wings for the next time you feel like making a mistake, or getting caught up in the moment? You asked for this, and then you get pissed when I do it. You want something I can’t be, Teeny. I’m not a fucking lap dog!”</p><p>He couldn’t be further from the truth. I did want what he was. I just didn’t want to wind up broken and damaged when he got tired of me and my shit.</p><p>My stomach hurt seeing him with the Barbie wannabe on the dance floor. I didn’t want it to hurt. I didn’t want any of my body to react to him in any way shape or form. I didn’t want to want him as much as I did.</p><p>“I don’t want anything from you! I don’t want you! Just leave!” I screamed as a bolt of lightning lit the sky above us. “Turn the hell around and go back to your whore Trip.”</p><p>“You know what? I think I’ll do just that. I don’t understand you. I thought I was okay with this thing between us. I thought I could make you see and change your mind.” He gestured between us with his hand. “This is not okay. None of it is. I’ll still be around, mark my words, Teeny. I’ll still be around because that’s my kid too, but me trying to please you is fucking done.” With that, he turned around and left me standing in the rain. My stomach had now dropped and I again cursed myself for caring about what he did, who he did and him in general.</p><p>“Fuck!” I screamed into the rain thinking briefly how perfect it was. I was standing in the middle of a shit-storm. No matter which way I looked, there was danger.</p><p>Turning to go back into the building, I saw a familiar shadow move quickly in the darkness, accompanied by a tall slim figure. Trip, he was leaving. With her. Tears of frustration streamed down my face, my nails digging into my hands close to breaking the skin. The rain was coming down harder than before flooding the ground around me and running off my cold skin in streams.</p><p>“Teeny, sweetheart, come inside, please,” Remy called out, “Just come out of the rain, honey. You’ll get sick,” he coaxed when I didn’t move.</p><p>I took the short walk back to the front entrance where he stood waiting with an outstretched hand, the rain masking the tears that were no closer to slowing down. “It’ll be okay, babe. He’s just mad. You’re both just mad right now. Let him cool off,” he rumbled into my hair once he’d tucked me into his side.</p><p>Nodding, I held on tight to his suit jacket trying to hold back the sniffles. “I was nasty to him. God, Rem, I was so nasty. I pushed him to it.” He moved around a little before my wet body was covered with something dry and soft.</p><p>“Shhh, it’s alright. Just let it out,” he soothed.</p><p>I took a deep breath and was assaulted with his smell. Blinking back more tears, I looked to my shoulders only to find it was Trip’s suit jacket draped over me. For some reason unknown to me, this started another bout of crying.</p><p>“Come on. Let’s get you home.” Home? Home was Trip’s place and I wasn’t sure if I wanted to witness what was no doubt going on there. I didn’t know if I could handle that, but I didn’t exactly have anywhere else to go. An idea struck. I’d stop there, get some clothes and then go back to my apartment. I may have been staying with him, but I’d kept my apartment; I just had no clothes there. Yes, that’s what I’d do. Clothes then home. I would have somebody pick up all my crap from Trip’s tomorrow. Hell, I’d pay somebody to pick it all up if I had to. Enough was enough. Living under the same roof as him was only serving to confuse my weary heart and conflicted head even more. It was time to go home, build a life that would work for the baby and me, and let him ... go. Was that even the right word for it?</p><p>“Okay,” I hiccupped letting Remy guide me forward to his car stopping for a second to pick up my ruined satin heels. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The ride home was quiet apart from my sniffling and shaking. We pulled up to the house and I pulled the jacket tightly around my cold body. “Keep in touch, won’t you?” I smiled shakily knowing he was leaving the following day.</p><p>“Of course, honey. You’ll be alright here?” he asked looking unsure.</p><p>“Yeah, I’ll be fine. Drive safe.” Leaning over, I gave him a quick hug and a peck on the cheek before I pushed the door open and stepped out into the rain.</p><p>I’d had time to reflect on the drive home and I’d quickly decided I had every right to be mad. He didn’t say a damn word when his whore had been cruel to me, and that showed me exactly what I meant to him.</p> <p>I put the key in the front door lock as it swung open. I stumbled falling right into Trip’s arms. Quickly righting myself, I pushed past him. “I’m just getting a few things then I’ll be out of your way.”</p><p>“Stop,” he ground out, hands balled into fists by his side. Ignoring his demand, I kept walking up to my room to grab as many things as I could, as quickly as I could, and prayed to God I wouldn’t run into his tart along the way. I wasn’t sure I could take it if I did.</p><p>“Teeny!” he yelled up the stairs. “Will you fucking stop for a second?” The thud of his bare feet pounding on the stairs urged me to close my door and start ripping clothes from their hangers. Within seconds, it was shoved open slamming into the wall behind it, a fuming Trip in the doorway.</p><p>“I’m just getting my stuff. Please, just leave me be,” I told him in a hushed voice. I was wet, tired, mad and hurt. I didn’t have any energy left to give him.</p><p>“You aren’t leaving,” he told me as a soft fluffy towel was wrapped around my shoulders. “You’re cold and wet. You’ll get sick.”</p> <p>Really? That comment seemed to perk me up a bit because the next words from my mouth where laced with sarcasm. “Well, fuck a duck, Trip. Who’d have known I’d get cold after standing out in the rain. On. My. Own.”</p><p>“Shit. I’m sorry!” he bit out rubbing the towel vigorously over my arms to try to warm me up. “I was a prick and I’m sorry, alright. I’m fucking sorry,” He whispered the last part of his apology.</p><p>“That’s great, but I wouldn’t want to keep you from your date, and I sure as fuck don’t want to be here for it, so I’ll just go.” I took a step forward and pulled out my suitcase from the bottom of the closet dumping it on my bed.</p><p>“I took her home. I was never going to sleep with her. I just wanted, shit, I just wanted you to see,” he rushed out running his hands through his hair with agitation.</p><p>“You wanted me to see what, Trip? You wanted me to see me put in my place? You wanted to see me humiliated in front of our friends? She was right, you know? I’m just the chick you knocked up and I sure as shit heard your silence loud and fucking clear.” Damn it. I was tired. I needed to hurry up and get out of his space. The anger started to drain out of me, and all I was left with was a bone-deep tiredness that could only be cured with days of sleep and pints of Ben &amp; Jerry’s.</p><p>“You can’t go,” he whispered. “I—well, I didn’t want you to go back to that dump, so I convinced the landlord to break your lease,” he rushed out, sounding worried.</p> <p>“You what?” I ground out. “You’d better be fucking with me. Tell me you’re fucking with me, Trip.” He wouldn’t. He—shit, he totally would. The look on his face confirmed that he had. I closed my eyes tightly and rubbed at my temples, the beginnings of a killer headache kicking in.</p><p>“It was a dump. You can’t live there. Not you or our baby. You just can’t.” He was worried I was about to lose my temper at him, but I didn’t have it in me. I would have eventually moved, but it was up to me to do it not him.</p><p>I had a bit in savings still, and hopefully, he’d been able to get my security deposit back. I’d have to find a job—Shit— I had to work with him. I couldn’t let Scarlett down. I couldn’t do that to her or to me. I wanted that job; it would make a better life for the baby. For that reason and that reason alone, I had to swallow my pride, again, and stay with Trip. You could bet your bottom dollar I wouldn’t be staying in his bed though.</p><p>“Can you please leave me alone? I’m cold and I need a shower. And I most definitely some sleep.” Not giving him a choice, I grabbed some pajamas and went to the bathroom closing and locking the door behind me.</p><p>Sliding down the wall of the shower with the hot water pounding down on me, I stared at the pile of ruined red silk that was my bridesmaid dress wondering how the hell I was going to fix what I’d broken.</p><p>In retrospect, the entire thing could have been avoided if I hadn’t insisted and pushed him to bring a date. It was a stupid thing to do, but I needed to distance myself from him before he hurt me further. Before I hurt myself. It was time to call it quits with Trip. If I could pull back and keep my feelings to myself, I might be able to survive this. I hated that I was turning into a drama queen, and not all of it could be blamed on raging hormones. No. A big part of it could be blamed on my feelings for him. The feelings I had been trying to ignore, which were blowing up in my face. The alternative was even worse. Fall in love with him and have him go back to his playboy ways, or worse still, have me fall into a pit of postpartum depression and end up just like my mother only to have Trip leave...just like my father did.</p><p>Nope. It was time to pull up my big girl panties, zip up my boots and kick my own ass into gear. First, though, I needed to cry. And that’s exactly what I did. I sat in the bottom of his shower and cried my heart out, letting it all go.</p><p>Only after I stepped out of the shower with red-rimmed eyes, I irrationally decided what the next step was. I reached into the cabinet and pulled out the box of hair dye I’d found when I unpacked all my toiletries. Trip was attracted to blonde bimbo types; well, this chick wasn’t about to be appealing to him anymore.</p> <p>Chapter Fourteen</p><p>Teeny</p><p>Stomping down the steps to his ridiculous penis extension truck, I grabbed my coat and purse slamming the door on the way out of the house.</p><p>“Freakin’ ass,” I muttered while roughly shoving the key into the lock and climbing inside the monstrosity.</p><p>Finally, I fell asleep after a gruelling day of sickness, back ache and irritation, only to be rudely awakened by my phone ringing. I answered to a rambling Trip going on about peanut butter and jelly sandwiches, Tinkerbelle and a cucumber.</p><p>“I should just leave his ass there,” I grumbled pulling out of the driveway.</p><p>Not ten minutes later, I pulled up at the address I was given and parked on the curb. Music and rowdy voices floated from the windows as I made my way up the path to the run-down house. The door wide open. I walked in and started scanning the room for Trip. Anyone would think they’d stepped back in time to a high school party the way these idiots were carousing. Girls in guys’ laps, people making out in the corners, red cups spread around the tables and a group of people playing beer pong and smoking what smelt like pot.</p><p>Stepping over a body on the floor, I moved through the crowd making it to the kitchen before I spotted Trip.</p><p>“Oh, fuck off!” I said to no one in particular.</p><p>My temper instantly flared. He sat on a bar stool with skanks falling all over him. Not even a joke. Four trashy-looking bitches were virtually climbing onto his lap running their hands over his chest and shoulders. They were grinding up against his leg like dogs in heat to the pounding music. He simply sat there, not stopping them, not looking like he cared one way or the other that they were rubbing their dirty STD-infested cracks all over him.</p><p>I stormed over to him grabbing a handful of badly dyed red hair attached to the closest skank. She let out a squeak of protest when I pulled her out of my way. Trip’s eyes went wide and his mouth dropped open. “You called me out here at 3 am to what? Take you for a chlamydia test?” I snarled at him more than a little tired and way the hell pissed at having to drive over just to see this kind of shit. If I was being honest, it stung a little to witness his antics. I should have known he wouldn’t change.</p><p>“Princess, wait!” Trip called out as I turned away and stormed out of the house. Screw him. He could find another way home. I made it as far as the mailbox before a large hand clamped down on my arm. “Get off me, Trip!” I yelled turning my head only to find it wasn’t Trip at all but some wasted man with a creepy predatory smile towering over me. My stomach lurched at the strong smell of tequila and puke on his breath. The hairs on the back of my neck stood on end and an eerie feeling washed over me. My hand instantly came up to my stomach in a protective motion. There was something wrong with this guy. The pupils of his eyes were dilated and a light sheen of sweat covered his face.</p><p>“Where you off to in such a hurry, lady?” he slurred in my face. I gagged at the intensity of the putrid spittle he was covering my face with.</p><p>“You should probably let me go. Now.” I looked pointedly at his grip on my arm. This guy was off his rocker and I was alone in the dark and pregnant.</p><p>“I like ‘em feisty. Let’s—” His words were cut short. Before I could blink, he was on the ground, a very pissed off Trip pummeling his fists into the guy’s face. I stood staring as it happened in slow motion. I wasn’t about to stop him. First of all, I was pregnant and a fight was no place for baby bump, and secondly, the dude needed to learn a lesson. There might have also been the fact that it was almost chivalrous of Trip to ditch his tarts and defend me. Trip reared his arm back and landed it on creeper’s nose with a sickening crunch.</p><p>\"Get off of him! He's already out! Stop!\" A huge muscle-bound guy grabbed Trip and dragged him off the unconscious moron. Puffing and panting, Trip ground out “Get the fuck off me. I’m done.” Shrugging off his captor, he stalked toward me, shirt ripped and sweaty. Blood dripping from his eyebrow.</p><p>Trip stopped right in front of me, still fuming. He looked me up and down running his hands over me where he could, and then wrapped his arms around me, crushing me firmly against him. “You okay? He hurt you?” I smacked him away remembering the skanks that he was letting touch him. My anger swelled. I was way the fuck pissed off for a bucket load of reasons. None of which I was going to address with a bunch of partygoers looking on.</p><p>“I’m fine. Get your stupid ass in the truck. I’m leaving,” I snapped stomping to where I’d parked. Trip followed behind me and jumped up into the passenger’s seat. He’d barely closed his door when I took off from the curb with a slight squeal of the tires.</p><p>Slamming the truck into park, I climbed down and stormed up to the house. The entire ride home had been silent. I’d kept my focus on the road and Trip had sat stiff as a board beside me, not uttering a word, and barely moving a muscle except to clean the blood from his knuckles and face with the baby wipes I had stashed in the glove compartment. I made quick work of letting us inside and headed for my room. I wasn’t in the mood to hash shit out with his royal assholeness. The thumping of boots on the stairs behind me alerted me to the fact Trip was behind me. I got as far as the bathroom door when he spoke, “You’re not talkin’ to me now?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No.” Plain, simple. My give–a-fuck button was broken, and would be for at least six more hours.</p><p>“What the fuck’s your problem?” he snapped. “Why you gotta be all queen bitch? Every fuckin’ time you get pissed it falls on me.”</p><p>“Excuse me?” My body stiffened. Mad was an understatement. I was about to blow my top. “How fucking dare you!” I spun around and glared at him.</p><p>“Me? You go around actin’ like I’ve done some horrible fuckin’ thing to you, and half the time I have no damn clue what’s up your ass!”</p><p>“You have to be the stupidest motherfucker I’ve ever met! Calling me out at a ridiculous time of the night to come get your drunk ass. I get my very tired self out of bed and do just that so you can be a prick. Go back to your tramps, Trip. I’ve had e-fucking-nough of this crap.” I poked at his half-exposed chest. “You called me to a fuck-fest party with dirty creeps!”</p><p>His eyes flared and he took a step forward getting into my personal space “They weren’t my anything. I called you to see if you’d come and you did.”</p><p>“You what?” Oh, hell no! “My back hurts. My feet hurt. I’m damn near exhausted and you were what? Trying to prove I’d run around after you?” I yelled.</p><p>“I was proving a point. You keep telling me you don’t give two shits about me, yet here you are. Coming to my rescue at the drop of a hat,” he smirked and I had to fight off the intense urge to slap his perfect face.</p><p>“Oh, screw you, asshole. You think you have it all figured out, don’t you?” I yelled louder.</p><p>“You want me, Princess, and you just can’t help it.” The corner of his mouth tipped up as he continued, “You came in and saw those bitches all over me and you couldn’t help it. You. Were. Jealous.” He took a step forward with every word backing me up against the wall.</p><p>“Don’t flatter yourself. I was disgusted. Not jealous,” I sneered in his face.</p><p>He pulled his bottom lip between his teeth taking the twin piercings with it. “Princess, you want this as much as I do.” One more step forward, one hand moved to the wall beside me the other to my hip as he pulled himself against my body. “Don’t think I don’t know why you colored your hair either. You look fucking hot as a brunette. And it didn’t turn me off in the least. Your plan failed.” He leaned his face forward slightly with a twinkle in his eye daring me to deny why I’d done it, daring me to call him out on why he hadn’t mentioned it earlier. “Quit fighting it.”</p><p>“I hate you,” I threw out with very little venom and no real truth behind it. “Stop smiling.” I pushed at his chest, but he didn’t move an inch.</p><p>Studying my face for only a second, he slammed his mouth down on mine and kissed me hard; the metal in his lip pressed into mine and his hard length pressed to my stomach twitched beneath his jeans. A gasp left my mouth allowing his tongue to dive in.</p><p>My hormones went crazy. My brain short-circuited, and before I knew it, I was tearing the last shreds of his shirt from his body and throwing it to the floor. Trip growled against my mouth, reached down, gripped my ass and lifted me off the ground. My legs instantly wrapped around his waist. He stalked off toward his bedroom tearing a moan from me as the pressure of his hard-on rubbed against my clit and shot sparks off though my body.</p><p>“Hope to hell you’re ready, Princess.” He dropped me down on the bed pushing my skirt up and tearing my lacey boy-shorts off in one quick movement.</p><p>My already hard nipples pulled tight against my soft shirt, and before I knew it, his mouth was on me. “Holy shit!” I cried out at the intense feeling of his tongue and the tiny metal ball in it flicking just right on my clit. “Ohhhhh, yes, fuck yes!” I screamed as he pushed two thick fingers in fast and deep. I fisted the sheets and held on tight.</p><p>Before I could take another breath, he bit down gently on my clit, sucked it into his mouth sending me careening into an orgasm that had me shaking and screaming at the top of my lungs. “Holy shit, Trip! Don’t stop!” He pumped his fingers harder and faster, nibbling, licking and sucking until I was a boneless panting mess.</p><p>“Taste as good as I remember.” I watched as his licked his fingers clean while pumping his rock hard cock in his other hand. Licking my lips, I was almost drooling at the sight of him with his pants undone and hanging off his hips. The silver bar that ran through the top of his angry-looking dick made my pussy twitch just remembering how good that was going to feel.</p><p>Trip leaned forward so I was lying on the bed before he grabbed both my ankles pulling me forward. Hooking his arms under my knees, he slammed home. My long moan matched his deep throaty groan as he gripped my hips hard, pulled back and drove in balls deep again. Picking up a brutal pace, he smashed into me his pelvis hitting against my clit with every punishing movement of his hips.</p><p>“God, oh God,” I whimpered digging my nails into his muscled ass. His answering growl was all it took for me to let go again. My body tightened up, the waves crashing over me like nothing I’d ever felt before.</p><p>“Gotta come in you, Princess. Gotta come hard.” His cock twitched, and with another hard and fast pump, he threw his head back and shouted his release. I loosened my grip on him and the post orgasm fog started to slowly lift.</p><p>Leaning over the top of me with his arms bracing his weight, the moment and its seriousness started to sink in. What did we just do? How could I have let this happen? Again.</p> <p>Because you’re in love with him, you idiot.</p><p>Oh, this is a bad idea. A very bad idea.</p><p>Chapter Fifteen</p><p>Trip</p><p>“Don’t. You’re overthinking shit. Just don’t,” I whispered. Her body had gone still and I knew she was coming up with all her bullshit reasons why we were a bad idea...why I wasn’t good enough.</p><p>“Don’t make this a big deal,” she told me as I got up, pulled my jeans back up my hips and went to the bathroom to clean up.</p><p>“It is a big fuckin’ deal,” I snapped. I’d about had enough of her run-around routine. I stormed back into the bedroom to find her slipping one of my shirts over her head.</p><p>“It doesn’t have to be. Just let it go,” she mumbled looking around for her discarded clothes. “It was probably just crazy hormones and the heat of the moment. Forget it.”</p><p>Was she freaking kidding me? Same old shit different day. Teeny ran from anything that might get under that tough exterior she was wearing around her like armor. I moved around the room trying to tramp down the urge to shake some sense into her. Seething, I threw a fresh shirt and new beanie on. Forget calming myself. I was way beyond that point now.</p><p>Blocking the doorway and her hasty escape, I grabbed her arms and leaned in close. “Stop running away! Act like a fucking grown up for once,” I demanded.</p><p>“Don’t you dare tell me what to do! Don’t patronize me. And get the hell out of my way!” she yelled shoving at my chest.</p><p>“Stop!” I barked. “Just hear me out.”</p><p>“What the fuck for, Trip?” Taking a deep breath, she glared, “So you can have an easy piece on the side?”</p><p>Dumbfounded that she’d even think that after the shit I’d gone through to show her I wanted her—just her— I needed to take action. I might have gone about it ass about face, but she’d left me no choice but to do whatever I could to get a reaction.</p><p>“What do you want from me?” she screamed clearly having lost her cool as well.</p><p>\"For shit's sake, Teeny, I'm in fucking love with you!\" I yelled pulling my beanie off and fisting it.</p><p>My throat burned an uncomfortable and alien feeling. My voice softened when I looked into her disbelieving eyes, \"I'm in love with you and I don't know what to do about it.\"</p><p>Two tears fell from her eyes and trailed her cheeks. She looked away quickly. The breath in my lungs stuttered. Fuck. She didn't give a fuck. I laid it all out and she didn't care. I'd got my answer.</p><p>I pulled my keys from my pocket and left closing the door quietly behind me. Not looking back. I felt completely broken and plain tired.</p><p>The harsh rain started almost the exact time. I’d pulled my heart out of my chest and handed it over on a silver platter. The rain stung my face as I rode across town to the lookout. It was the spot I came when I needed time to think, room to breathe or just when everything was turning to shit.</p><p>And everything had just turned to shit.</p><p>Pulling over to the side, I turned my bike off, threw my leg over and grabbed the bottle of whiskey I’d stopped for. I ripped my helmet from my head and tossed it to the side. Thankfully, I’d left my jacket on my bike the last time I’d gone for a ride; otherwise, I’d be freezing my ass off. As it was, the worn black leather wasn’t offering as much shelter from the rain as I would have liked.</p><p>But it didn’t matter. I was numb.</p><p>I sat on the very edge of the lookout staring into the darkness and city lights.</p><p>So, this was what rejection felt like.</p><p>I’d never experienced it before. This tightness in my chest, the sick feeling in the pit of my stomach, the lump in my throat, it was all new to me.</p><p>I unscrewed the lid from my poison of choice and lifted the bottle to my lips, tipped it back and swallowed hard. The burn that rushed down my throat and warmed my stomach did nothing to ease the pain of losing the one woman I ever loved.</p><p>Love fucking sucked.</p><p>Looking down at the still almost full bottle in my hands, I wondered what I was supposed to do next; she’d rejected me. Flat out looked right at me, reached into my chest and ripped my heart out. Pulling my arm back, I threw the bottle against the rocks below me. Shattering into a million tiny pieces, I left it the same way my insides felt.</p><p>I don’t know how long I sat there in the cold night staring into space. A thousand words swirled through my head, countless emotions I never even knew I possessed tearing through my soul. It must have been a while because the dark sky started to lighten with the dawn; my body was still numb from the cold rain that had pounded down on me. I was soaking wet and no doubt looking as shitty as I felt.</p><p>Climbing onto my bike, I started her up and took a moment to tamp down some of the heartache. Heading toward home to get a quick shower, I stopped at the intersection and put my feet to the ground steadying myself; lights hit my tired face moments before a screech of tires and sounds of metal on metal pierced my senses. As if in slow motion, my fingers were ripped from the handlebars and I flew through the air landing on the wet bitumen with a sickening thud. My vision went blurry and I couldn’t feel anything except the excruciating pain radiating through my head. I attempted to lift my hand to it, but all that happened was a foggy feeling and a heavy weight in my limbs.</p><p>A clear vision of Teeny and her swollen belly flashed through my mind before everything went black.</p><p>Chapter Sixteen</p><p>Teeny</p><p>Pacing the living room, I glanced over at the clock again. My stomach clenched for what would probably be the hundredth time that day.</p><p>1:49 in the morning.</p><p>He’d been gone for almost twenty-four hours. This wasn’t like Trip. But then again, he was under the assumption he’d just been rejected. I could see the pain crystal clear in his eyes. I had unintentionally ripped his heart out. After I snapped out of my shocked state, it’d been too late; Trip had already taken off on his bike. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I figured he needed some time to calm down before he came home. So I waited and waited, and eventually, I fell asleep clutching my cell phone to my chest, curled in a ball on the sofa. Morning came and it became apparent he didn’t just need a little time.</p><p>Was he coming home at all or had I pushed him too far?</p><p>I was worried. Worried I’d messed it all up. He loved me. Me of all people, and I went silent—radio silent—at the most important time of my life...I went freaking silent.</p><p>I had called every single friend I knew of his from his phone including his mom and sisters. Not a single one of them had seen or heard from Trip. This was why I was now wearing a hole in the living room floor.</p> <p>He was on his bike when he left. There was a storm when he left. And that alone scared the living hell out of me.</p><p>He could be hurt and I’d not know. I spent approximately thirty seconds wondering if I’d driven him into the arms of some random skank, but decided that wasn’t a thought I wanted to travel down.</p><p>He had to have gone for a drink and gotten arrested. That was it; he’d gone for a drink, gotten into a fight and gotten arrested. Except, he must have been arrested across the other side of the country because I’d already called the police station and he wasn’t there. I’d also called Scarlett’s shop hoping he’d fallen asleep there, and my last resort, I’d called all the local hospitals. And nothing.</p><p>Radio silence.</p><p>Twelve Hours later...</p> <p>I was rocking back and forth with the phone clasped to my chest, visible black rings under my eyes, and feeling like I couldn’t breathe.</p><p>The phone rang and I jumped without looking at the number. I quickly answered hoping for some news, any news. All I got was Trip’s sister, Haven, checking in; they’d been franticly searching from their end, but to no avail.</p><p>All I could think, while my eyes blurred with unshed tears, was what have I done?</p><p>Twenty-Four Hours later...</p><p>Tears streaming down my face, I took slow steps toward the door. I reached out and turned the knob. There weren’t many reasons a doorbell would ring at nearly two in the morning. I slowly cracked the door open to see two uniformed police officers looking somber and apologetic. The older of the two’s eyes fell to my stomach where I held a protective hand over it and he winced.</p><p>He winced.</p> <p>“Ma’am,” The younger officer nodded at me. “Sorry for calling by this late but is this the residence of one Javerio ‘Trip’ Torres?”</p><p>Numbness took over as my body shook with silent sobs. My wet tears slid down my face hitting the arm holding onto my belly.</p><p>I did, however, feel my heart fall to the floor seconds before I crumpled to my knees and let out a long keening cry.</p><p>Chapter Seventeen</p><p>Teeny</p><p>“Whoa! Are you okay, Ma’am?” The younger officer bent on one knee and watched me warily.</p><p>My heart hurt. This absolutely couldn’t be happening. This was not happening. “What—I—Trip?” I spluttered feeling a panic attack coming on.</p><p>“I’m afraid there was an accident involving Mr. Torres and we were sent to inform you.” The older officer stepped forward and started talking, “He’s okay, Ma’am. He’s been there for a while however. He had no identification when he was brought in, so it took some time to find out who he was.”</p> <p>Dipping my chin, tears of relief came easily while I chanted mentally, No more fights, never again.</p><p>Then a thought settled into my brain. Why didn’t he tell them who he was?</p><p>My stomach dipped. A million of the worst possible scenarios flittered through my mind. I was now breathing short and shallow trying to wrap my head around it all.</p><p>“Is he okay? Really okay?” I asked quietly, terrified of what answer I might get, yet understanding in that moment what it meant to love somebody unconditionally.</p><p>As the officer nodded with kind eyes, my mind wandered.</p><p>No matter how bad this may be, I would stand by him. Picking myself up off the floor with a shudder, I pushed through the door still in my pajamas and made for the truck.</p><p>“Wait, Miss. Would you like us to take you to the hospital he’s been admitted to?”</p><p>“Oh, umm.” Shit! I didn’t even know where he was. I looked from Trip’s truck to the patrol car and back again.</p><p>“It might be best. I don’t think you‘re in any condition to drive right now. I insist.” The older salt and pepper haired officer steered me gently toward the back seat.</p><p>The entire drive I stared into space, scared out of my mind about what I was about to walk into.</p><p>“Right this way, please.” The plump nurse walked beside me. “You’re his Teeny, right?” she asked slightly amused. I was taken aback and my forehead scrunched in confusion.</p><p>“Pardon?” I asked.</p><p>She chuckled sweetly, “Since he woke up, he’s been asking to call his Teeny. I assume that’s you seeing as he’s described how stunning you are to anyone who’ll listen.”</p><p>“Is he okay? I mean—does he have...” I put my hand on her arm to slow her walk down. I needed to know what was wrong before I went in there. what to prepare myself for. Maybe he’d hit his head and had brain damage or something.</p><p>She smiled kindly, “He’s fine, honey. Just a little medicated. He has a few bumps and bruises, a broken pinkie finger and a couple of stitches on his head. The doctor has him on some strong painkillers so he’s a little out of it.” A giggle broke through as she shuffled us forward.</p><p>What’s so funny?</p><p>She pushed open a door and stepped through warily. And that’s when I saw him.</p><p>“Oh my God,” I gasped and rushed forward but stopped short of him. Trip was standing up over by the window. Butt naked.</p><p>The open, full-length, glass window, I might add. I looked back to a smirking nurse opening and closing my mouth like a fish out of water.</p><p>“He refuses to wear a gown. Says he’s a dude and dudes don’t wear that shi—” she coughed, “...stuff. We’ve had security up here three times this morning to get him away from the window and cover up. I gotta say, I don’t mind the view. Your guy has a nice tush.” She was standing by the door not even attempting to do anything about his situation. I was still in shock. Seeing the cuts and bruises littering his body had my heart racing again. I moved forward a step when the nurse touched my arm bringing me to a halt.</p><p>“Wait for it.” The nurse looked from me and tipped her head to Trip. Before I could ask what the hell was going on, he did the funniest thing I’d even seen.</p><p>Placing his arms out by his sides, he stumbled a little before taking in a deep breath and belting out, “I’m a little teapot...”</p><p>I gaped. I tilted my head to the side and then I burst out laughing at the hilarity of it all. I had prepared myself for the worst and I found Trip high as a kite singing a kid’s lullaby. He was even doing the actions facing the window, just naked. Naked and singing about a teapot. He was okay. I could see it with my own eyes so I knew he was okay.</p><p>“...Short and stout!” he kept going.</p><p>Pulling out my phone, I shot a group message off letting his family know he was okay and I’d call soon with details, when suddenly, an idea hit me. It was just too good of an opportunity to pass up. So I went ahead and did what any normal person in this situation would do.</p><p>I hit record on my phone’s video camera and lifted it, taking in Trip’s performance as well as his spectacular ass. Something like this was too good to miss. Everyone needed to see it. I told myself it was all in support of him being fine. But my brain called bullshit.</p><p>“...Here is my handle. Here is my spout...” On the word spout, Trip openly and extremely obviously pointed to his dick. Laughing so hard that the phone shook, I watched as he kept up with his actions not even aware I was in the room. Snickering behind me was a group of female nurses all huddled together once they realized I was filming him.</p><p>A young male doctor walked into the room just as Trip finished his teapot rendition and cleared his throat causing the nurses to scatter. Slipping my phone away, I kept an eye on Trip trying to twirl like a ballerina but looking more like a monkey spinning in circles.</p><p>“You must be the famous Teeny then?” he smiled and stuck his hand out. He had a thousand-watt mega smile and a cute dimple in one side. His hands were strong and firm. I had a thing for man hands. I was also acutely aware that I was standing in front of a drop-dead gorgeous guy in my pajamas, no bra and a rat’s nest of hair sitting on top of my head. I felt the blush creep up my neck when my nipples peaked under my shirt. “I’m the resident doctor. You can call me Alex though.” His thumb rubbed gently over the back of my hand that he was still holding onto.</p><p>“I guess. I mean...I’m not famous. I’m just Teeny. I mean...I’m just me.” Flustered, I shook my head and stared down at my slipper-covered feet. Alex’s face was scrambling my head and looking at his chest hadn’t helped my hormones due to the fact he had a body like a God and arms to match. He wasn’t as hot as Trip but he had this air about him that would lure old ladies and desperate woman or just horny women. Apparently, I fell into that category.</p><p>I almost swooned when he put his hand on my arm and smiled down at me, “You’re as pretty as I thought you’d be.” The doctor coughed to hide his slip up. “I mean as he said you’d be.”</p><p>Good Lord, was he flirting with me? I wasn’t entirely sure seeing as it’d been a while since that had happened. “Oh,” was all I managed to squeak out before Trip cleared his throat behind us.</p><p>“Would you like a seat?” At the reminder of Trip, I checked myself. Shit, how could I be standing with Trip in the room—the man I had come to realize I loved—yet I was blushing at another guy? I was an ass, plain and simple. My hormones were controlling every reaction I had and it was not cool. “I’ll just get Trip settled first. He’s...umm, very under-dressed.” Turning, I shuffled toward Trip who was now glaring at the doctor with his hands on his hips and an erection that was more than a little impressive; the silver bar that was ever present catching the light and drawing extra attention. It appeared the drugs were starting to wear off and I was left with a very naked, very horny and rather pissed off Trip to deal with.</p><p>“Trip, honey, can you come put some clothes on now?” I asked stepping in front of him to conceal his lack of modesty.</p><p>“I don’t know. Is this jackass going to keep hitting on you?” he fumed and continued shooting daggers at the doctor. Oh dear, his jaw was ticking and the smiling, happy Trip was gone. He was now clenching his fists by his side.</p><p>“You have a problem though. One you need to cover up,” I hissed completely uncaring about his issue with the doctor.</p><p>Trip reached for me pulling me tight to his body and planted a heavy kiss on my lips. “My problem is there because you’re here. I can’t see you and not get hard. Deal with it,” he told me honestly while eyeing off the doctor over my shoulder. Holding me possessively to him, he was obviously proving a point. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A snort escaped me, “Next time, just piss on me. It’d do the same thing and probably save splitting your lip open again.” I noticed the cut on his lip had opened up from his caveman display.</p><p>With a grunt, he moved me behind him and shuffled to the bed sliding under the covers. He gripped my hand once he was settled. “Lay it on us, Dick, I mean, Doc. What’s the verdict?” I dug my nails into the side of his hand as a warning.</p><p>“Well, you seem to be in good health. Everything appears to be fine. Our only concern is the fact you had a head injury and were unconscious for a good period of time,” Alex told us keeping his eyes on the clipboard in his hands.</p><p>“My head’s fine. I remember everything I need to and I want to go home,” Trip said quietly letting my hand go and pulling the blanket up higher.</p> <p>My heart sank. He really did think I didn’t love him.</p><p>Apparently, we were either as blind as each other or just ignorant. I hadn’t realized he loved me because I never thought it was even a possibility. He’d taken my silence as me not feeling the same. I needed to tell him how I felt, but I feared it might already be too late. The show he’d put on before was just that, a show, and only for the doctor. While it frustrated the hell out me, I was in no mood to be in the middle of a pissing contest. I was his. It was finally time to stop the games and the shitty sidestepping.</p><p>“I would be more comfortable if you stayed overnight just to keep an eye on you and make sure you have no neurological problems. It’s a precautionary measure that I strongly suggest you accept.” Dr. Alex looked at Trip who was wincing but nodded anyway. “Okay, I’ll have the nurse come in and give you some more pain medication. Your head should stop hurting over the next few hours. In the meantime, you need only take something to take the edge off.” Trip looked toward the window clearly dismissing us. The doctor wrote something down, turned and left the room leaving us alone with an awkward silence.</p><p>“Thanks for coming. I’m okay so you can probably go now,” Trip whispered not looking at me.</p><p>I felt my nose sting and the tears pool in my eyes. He didn’t want me here. I had messed this up, but I was wearing my big girl knickers and it was time to step up. “No!” I burst out, “No, I won’t go anywhere. I’m staying right here. And you’re going to give me a chance to explain.”</p> <p>His head snapped back like I’d slapped him across the face. He glared at me but didn’t say a word, so I decided to push on with my speech. “You didn’t even give me time to answer you before you stomped out of the house like a petulant child.” I put my hand up at him when he opened his mouth to cut me off. “I had things to say to you and you didn’t let me.“ His scowl stopped my rant in its tracks.</p><p>He scoffed, “You cried. I handed you my heart and you fucking cried. You don’t feel the same. I got that, but don’t sit here now acting all high and mighty like I did something wrong. Excuse me if I didn’t want a play-by-play of all the reasons why you don’t want me,” he snarled, his face a mask of anger that didn’t hide the underlying hurt he was feeling.</p><p>“I do though. That’s just the thing. I love you. I just lost my words. I never thought it was possible for you to feel like that about me. Besides the fact, we’re all wrong for each other, damn it, Trip. I do freakin’ love you.” I ranted at him. Tears streamed down my face and I was pretty sure I looked like ass.</p><p>Trip’s eyes searched my face while I kept up the rambling. “I—you just didn’t give me a minute to tell you that. I was crying because, well, I cry! That’s what I do! Not before, but now, I cry all the damn time. Shit, I cry when the fabric softener commercial comes on! I cry when we’re out of pickles! I just cry and I—” My rant died as Trip pulled me down to him and kissed the words right out of my mouth. He slid his tongue across my bottom lip and bit down gently tearing a small gasp from me. Before I knew it, his hands were in my hair and he was devouring me.</p><p>He pulled back just enough to growl against my lips, “You love me.” A statement. Fact.</p><p>He pulled me down onto the bed beside him. Lying face-to–face, pressed as tightly as my swollen belly would allow, I nodded and leaned my forehead against his. Squeezing my eyes closed, I focused on regulating my jagged breathing.</p> <p>“You scared me. We couldn’t find you,” I mumbled relaxing when his hand ran slowly over my hip. “I was terrified. The police came to the door and I thought...” Closing my eyes, I whispered, “I thought you were gone.”</p><p>The tears started again at the mention of my early morning visitors. “Shhh, Princess. I’m okay.” He pushed the hair off my face and kissed my forehead ever so gently. “I’m not goin’ anywhere. I’m right here.” I couldn’t even feel badly that I was curled up crying in his arms because they were warm and safe. They held promises I couldn’t even believe I deserved. Promises that I had craved since I was a young child and alone.</p><p>“What happened?” I sniffled against his neck where I had dropped my face.</p><p>“I’m still not entirely sure, but the police told me a driver clipped the front wheel of my bike. It was raining and only just daylight. I don’t remember much of it, but I do remember that I flew through the air, and next thing I knew, I woke up here.” He rubbed a thumb softly up and down my arm and went on, “I was brought in here but I had no wallet or phone, nothing to identify me so they couldn’t tell who I was until I woke up and could talk. The only thing I managed to get out was your name before I passed out again. I guess they tracked you down and that’s it; that’s all I know.”</p><p>I fell silent wondering where he’d been the entire night. I had just gotten up the courage to ask when a nurse poked her head in the door and smiled brightly, “I just need to check a few things before I give you some pain relief.” She shuffled in and set to work taking Trip’s temperature and blood pressure. I shifted to move off the bed and out of the way when Trip’s hold tightened and he whispered, “I was up at the lookout, alone. All night. Just thinking.” His gorgeous eyes implored me to hear him and understand. He was beaten and bruised in a hospital bed, yet he was comforting me.</p><p>“I’ve gotta get home and get dressed. You made me leave the house in pajamas, no bra and slippers. I look like crap.” I snuggled back into his side making no attempt to leave. For the first time in a long time, I felt safe and wanted. The irony of it was, the person who had originally made me feel lost and out of touch, was making me feel like I was home for the very first time in my life.</p><p>The nurse quietly fluttered about poking and prodding Trip before pushing a syringe into his IV. He tightened his arms and kissed the top of my head before mumbling, “I love you.” Before I knew it, his breathing evened out and his arms went soft.</p><p>I slid down off the bed and called a cab to take me home. He looked so peaceful sleeping, one arm cocked behind his head, the sheet riding low on his hips, that a warmth I’d never felt before flowed over me and a small smile broke over my face at the possibilities. Our relationship didn’t promise to be an easy one, but I’d be damned if I didn’t make sure it was worth every second.</p> <p>Chapter Eighteen</p><p>Trip</p><p>Two weeks later...</p><p>“Just let me carry it,” I told her again. We’d spent the last twenty minutes playing tug of war and arguing about who was carrying all her crap. As a result, we were going to be late for the birthing class. “Give it here. You’re too big to be dragging all this shit around.”</p><p>“Did you just call me fat?” Teeny’s eyes flared. Her bottom lip quivered.</p><p>Fuck! She was gonna cry. Again.</p><p>“No, Princess. I just meant you look uncomfortable and I’m sure your back’s hurting carrying the baby on top of your own weight,” I explained in a gentle voice trying to stop the waterworks from turning on.</p><p>“You are calling me fat!” she sniffled, her eyes tearing.</p><p>It didn’t matter what I said, she always took it the wrong way and cried or threw a fit. I was exhausted just dealing with her mood swings. Twenty-nine weeks of this and I was biting my tongue almost as much as I was putting my foot in my mouth. Fuck knows how she was handling it. Something so innocent like wanting to carry her bag and pillow had turned into a meltdown.</p><p>“Damn it. I’m not calling you fat. I’m trying to help.” I leaned down into the passenger’s side of the car, snuggled my face into her neck dropping a line of small kisses, with a nibble thrown in for good measure. “I’m not calling you fat, Princess. You get to carry the baby around all the time. I want to carry your things so I don’t feel left out,” I mumbled into her neck playing the bullshit left-out card. It worked every time.</p><p>“Oh,” she breathed. “Well, I don’t want you to feel like that.” Her hand came up to the side of my face. She pulled my lips towards hers. “You’re in my way and you’ve made us late now.” There she went again, switching gears from teary to pissy in a millisecond. I swear I had whiplash.</p><p>“I made us late? You just had another—”</p><p>She promptly cut me off pulling herself out of the car as I stepped aside. “Yes, you made us late. Now, let’s go.” I locked the car doors, tucked her pillow under my arm and the stupid flowery bag over my shoulder before catching up to Teeny’s waddling ass. “You kind of made a big deal about nothing. I’m pretty sure you aren’t going to feel left out for long,” she giggled moving as fast as her legs could go.</p><p>“What do you mean?” Something about the glint in her eye and the way she was powering on said she was up to something. “Teeny?”</p><p>“Oh look, a restroom. I need to pee. Be right back.” Teen quickly ducked in through the door leaving me standing in the walkway looking like an idiot with her prissy-ass bag and hot-pink pillow. I leaned back against the wall rubbing my hand back-and-forth over my beanie waiting. The door swung open a few minutes later. A smiling Teeny waddled out, stopped and laid a hot heavy kiss on me before pulling back. Smiling and wandering off in the direction of the classroom, she left me to follow after her with a boner that threatened to pop my jean’s buttons.</p><p>“Will you do something about that thing?” Teeny hissed quietly. I’d worked at getting rid of my hard-on until the idiotic teacher lady had Teeny get on her hands and knees doing some breathing exercise. About three point four seconds later, I was back where I started. Who the hell comes up with something like that anyway? She’d told us, ‘Partners, please kneel behind your ladies and gently rub her back in a slow circular motion. This will help to reduce some of the pressure and just generally relax mommy while she’s in labor’. Teen was sitting between my legs, and leaning back against me waiting on the teacher to show us some other way to breathe or rub a back, or how to talk to a chick in labor.</p><p>“I can’t do anything about that thing, because that thing likes you on all fours wiggling your ass in the air,” I whispered in her ear nibbling on her neck. If I was gonna be turned on, so was she; it was only fair. I snuck my hand up under the pillow she had clutched in front of her and gave her nipple a quick flick causing her to gasp and land an elbow right into my stomach. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ompf,” I smirked and bit her shoulder again whispering against her skin, “You know I like it when you get all rough.”</p><p>“Who would like to try the belly first?” the teacher called out snapping me back to what was going on around us. There she stood holding up some kind of contraption trying to make eye contact with some poor asshole.</p><p>“Trip would love to go first. Wouldn’t you, honey?” Teeny turned just enough for me to see the sweet-as-pie smile on her face; the one that meant she was getting me back.</p><p>“I can’t stand up right now, Princess. Unless, you want everyone to get a good look at the constant state you’ve got me in,” I grumbled quietly so only she could hear.</p> <p>“How nice! Come on up here, Trip, and I’ll set you up. You’re such a good sport!” The teacher smiled looking right at me, daring me to say no.</p><p>“You’ll pay for this, Teeny. That’s a promise,” I growled into Teeny’s ear as I stood up counting backward from a hundred.</p><p>“Okay, class, this here is a belly simulator. It lets you know what it feels like to be pregnant! It is a weighted suit that replicates the weight that your significant other is carrying around day in and day out. It’s heavy and very uncomfortable.” She reached forward and slipped the backward vest with a huge bump in the front onto my shoulders.</p><p>“Ompf. Holy shit.” The room snickered as I tried to right myself. The added weight almost had me face planting the floor.</p><p>“Now this is a useful tool to help you gain empathy for your partner. Remember, you’re lucky enough to be able to remove it in a few moments. A pregnant woman on the other hand...not so lucky”.</p> <p>An hour later than planned, we were pulling up at home. Teeny drove with a huge smile plastered on her face. Me? I was sulking. “Stop smiling. It’s not fucking funny.”</p><p>Teeny burst out laughing, turned the car off and climbed down; I watched, annoyed at myself for not being able to help her. I threw open the passenger door and hopped out before she could try to baby me and my bruised ego any further.</p><p>“You know the doctor said plenty of guys puke and pass out when they watch that movie, so it isn’t like I’m the only one.”</p><p>Stupid movie. Who wants to see that happen to a happy place? Nothing so traumatic should ever be shown to a dude. It’s just not right. I shuddered at the thought of the images now forever burned into my mind. “It’s not meant to stretch that much. It’s not natural”.</p><p>“Come on, honey. You need to lay down for a while.” She was being a smartass of course, laughing at my misfortune. I mean, I couldn’t have been the only person to make a fool of myself in one of those classes.</p><p>“I don’t need to lay down. I’m fine,” I grumbled stomping in the house.</p> <p>“Yeah, sure. Would you like me to run you a shower? You really need to wash the vomit smell off,” she asked wrinkling her nose up like a skunk had crawled up there.</p><p>“Hrmph, I have to anyway. I gotta get into the parlor. I have appointments this afternoon,” I grumbled stomping toward the stairs.</p><p>“Oh, I um...no, you don’t. I already called Scar and told her what happened.”</p><p>“You what? Now, next time I see her, she’s gonna give me so much crap about it! Shit, Teeny. I’m never going to live this down,” I grumbled, padded down the hall shutting myself in the bathroom and took a deep breath. The whole morning was traumatizing. If I could offer a soon-to-be dad one piece of advice, I would gladly tell them to skip the movie. Nobody needs to see that. Ever.</p><p>I was now entirely sympathetic to Teeny and her extreme mood swings though; she was about to have her lady junk stretched nine ways from Sunday. I know if I was a chick, I would be unreceptive to the idea of having something the size of a watermelon claw its way out of there. Damn, I wasn’t a woman and I wasn’t real stoked at the idea of my fun house turning into an escape hatch. I felt like I needed to do something special for her to show my appreciation. It wasn’t like Hallmark had a card that read ‘Thanks for destroying your vag with my spawn’ so I had to come up with something else. I had the perfect idea too. I just had to hope she’d get the gesture behind it.</p><p>Chapter Nineteen</p><p>Teeny</p><p>“Honey, I’m home,” Trip called out as he shut the front door.</p> <p>“Very funny, smartass. I’m in the kitchen,” I called back smiling to myself. It was a little scary how quickly we’d fallen back into a routine.</p><p>I’d been working for Scarlett for a few weeks and I was so damn close to finishing my license. Trip and I seemed to work really well together. We drove in to Needle’s Kiss when I was on, which was only three days a week for the time being. I knew I had a full time spot at the parlor when I was ready to go back to work after the baby arrived, but for the time being, I had been ordered by Trip and Scarlet to take it easy. Apparently, my waddling around with a big belly looking every part the thirty-one weeks huge I was, provided hours of entertainment for them.</p><p>“Favorite thing, ever.” I turned around wiping my hands on a dishtowel to find Trip leaning back against the counter, legs crossed out in front of him, his piercing blue eyes hooded. He let his bottom lip out from between his teeth and pinned me with a look that was sure to set any woman’s cootch on fire.</p><p>“What?” I all but panted, my heartbeat picking up and my nipples standing to attention. One of his hands left the countertop he was gripping and traveled down to the bulge in the front of his pants.</p><p>“You, in the kitchen, barefoot, pregnant and bent over. Fuckin hot, babe.” He grabbed his junk and squeezed, his eyes taking a slow purposeful trip down my body kicking the temperature in the room up a few notches.</p><p>My body was on fire; he was doing nothing short of eye fucking me right there in the middle of the kitchen. Pushing off the counter, he took a predatory stride toward me, reminding me of a lion on the prowl. “Casserole,” I blurted backing up a step; my brain had short-circuited. His smirk dropped when I licked my very dry lips. His gaze zoned in and he growled low in his throat.</p><p>“Trip, dinner’ll burn.” I watched as his pupils dilated further and he took another stride toward me. I was pinned between the oven and a very turned-on hunk of muscle oozing sex.</p><p>“You want it,” he rumbled deep from his fast rising chest. I did. I so badly wanted it. All of it, over and over again.</p><p>I smiled coyly and sidestepped him. I wasn’t fast enough though; he grabbed me and kissed the ever-loving hell out of me. At some point during the brain-scattering onslaught of his talented tongue in my mouth, he’d turned us around and backed me up against the kitchen table. Trip broke the kiss, leaned past me and pushed the silverware, placemats and napkins to the floor before effortlessly lifting my ass onto the bare table. He tore my sundress over my head. I locked my legs around his waist grinding my hips and taking pleasure in his rock-hard cock. I rubbed the perfect spot, which sent delicious tingles right through me.</p><p>He ripped his cotton t-shirt over his head while I fumbled with his jeans’ buttons—not able to get him naked fast enough. He dropped to his knees and buried his face in my panty-clad crotch alternating between pulling at the thin scrap of material with his teeth and sucking on my clit. I fell back, my arms barely holding me upright on the tabletop as he worked me over until I could do nothing but scream his name.</p><p>Good Lord have mercy. The image of Trip standing before me breathing hard and wiping my cum from his mouth in a pair of undone jeans, boots and nothing but ink and leather wristbands, had me ready to mount him and ride the shit out of him until I couldn’t move.</p><p>With no patience left, he pulled my underwear to the side, freed his angry-looking cock from his jeans and slammed into me balls deep. Both of us moaning in unison as he took me right back to the edge of bliss.</p><p>“I messed up the cute table. Shit, I’m sorry,” he mumbled against my sweaty skin. Still breathing heavily after a mind shattering orgasm, I couldn’t even form words to tell him I didn’t give a damn about the table. I was pretty much limp from head-to-toe and I had no intention of moving even if I could.</p><p>“Dinner,” I mumbled out when the oven timer buzzed signaling dinner was ready.</p><p>“I’ll get it, Princess. You go clean up and we’ll eat in the living room.” He kissed me sweetly, pulled out and did his pants up. I, however, laid in a boneless heap on the kitchen table, not caring in the slightest that it was more than a little unhygienic.</p><p>“I think I like being a house bitch,” I mused once I’d managed to get myself standing.</p><p>Trip laughed and handed me my clothes. As I shuffled from the kitchen, I heard him say, “Love that woman.” This of course made me smile in a giddy-girly kind of way.</p><p>I came back downstairs a few minutes later to see he’d set the coffee table with our dinner, fresh cutlery and a sad looking candle. The sweet gesture had my stomach erupting with butterflies. He told me once he wasn’t good at being romantic. He’d lied. He was good and it’d get him lucky on more than one occasion.</p><p>“You choose,” he said passing me the remote. A list of movies was up on the television screen. I must have been looking at him like he’d just landed from Mars ‘cause he laughed and nodded to my hand. “Don’t think about it, just pick one, Princess, and hurry up or dinner will get cold.” It didn’t end there. He then proceeded to pass me my bowl filled with steaming hot casserole and a fork, and then he pulled my feet up onto his lap. I just sat there looking like a moron gaping like a fish out of water. He was being ridiculously sweet. “Eat, stop looking at me like I’m weird,” he smirked when I snapped back to reality. I was going to lap it all up. God only knew when I’d see this awesome side of Trip again. I clicked on the cheesiest chick flick I could find and waited for the smartass comments to begin, but alas, I got nothing more than a smile as he shoveled food into his mouth and moaned.</p><p>“I think I’ll keep you. This is the shit, Princess,” he mumbled around a mouthful of casserole. Smiling to myself, I got comfortable with my bowl resting on top of my very round stomach and enjoyed the peace of being where I was. Right there with Trip, feeling all of the things I was feeling, rather than a pang of jealously that I usually felt, I was instead filled with contentment.</p><p>Not twenty minutes later, he started rubbing slow circles on my feet. My eyes snapped up from the movie to see him concentrating on his task looking a little angry. I pulled my feet away to signal he didn’t have to rub them figuring he was annoyed at having to play with my fat-assed ankles; they were less than appealing.</p><p>“You don’t have to,” I said quietly looking down at the monstrosity that was my hulk feet. Trip gently tugged them back into his lap and kept rubbing as I tried to stop my eyes rolling into the back of my head from the heavenly pressure of his fingers working deep in the muscle.</p><p>“They look sore. You shouldn’t be on them so much,” he grumbled. “I should be keeping an eye on this sort of crap to make sure you aren’t overdoing it. I’m not taking care of you properly.” I laughed at his expression; he was mad because he thought he could stop my feet from swelling. Not because they looked gross. That warmth enveloped me again as I sat ignoring the movie and just taking in the shirtless muscle of sexy doting on me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Cankles,” I whispered under my breath. “I have cankles.” My bottom lip dropped to a pout.</p><p>“The fuck are cankles?” he asked smiling at me like I was crazy. He slid his hands up to said cankles and continued his onslaught.</p><p>“Cankles are when your ankles and calves turn into one thing, there is no definition left; they are just that. Cankles,” I finished on a moan. “I’m thinking I need to be in the kitchen more often when you get home.” I felt him shift as the bulge in his pants inflated. I liked screwing with him, so I purposely groaned and threw my head back while biting down on my bottom lip to stop the smile from breaking over my face.</p><p>My eyes snapped open when my feet were pushed from his lap. He stood, adjusted himself and picked me up bridal style. I couldn’t help the snort that burst out when he strode with purpose up the stairs to what had become a shared bed.</p> <p>Chapter Twenty</p><p>Trip</p><p>The next morning, I got up early and set to work on my plan. I called in favors from Mace and Scarlett, who had only just gotten back from their honeymoon, in hopes that I could surprise Teeny and show her I could be what she needed. Wracking my brain last night while I’d lain awake, I came up with a foolproof idea. I was going to convince her she didn’t need anyone else. I would be all she needed, not some fool who wanted a quick screw. Nobody was gonna touch her but me. I was going to be sweet. So sweet she’d get a damn toothache.</p><p>“Up, Sleeping Beauty,” I smiled tugging at the sheet wrapped around her still-naked, warm body. The smell of peaches and sex filled the air; with an adorable grumble, she shoved her head under the pillow and tried to ignore me.</p><p>“C’mon, Princess.” I pulled the pillow out of her vise-like grip and threw it to the ground. “You gotta get up.” I chuckled at the scowl she was throwing me and sat down on the side of the bed picking up the ginger ale and plain crackers I’d brought up. Ma told me they were good for the puking, so I had stocked the house full of both.</p> <p>“I don’t like you right now,” she grumbled at me. A strange warmth hit me right in the chest. Even first thing in the morning, with bed hair and morning breath, she still looked fucking gorgeous.</p><p>“Quit being a brat and get up. I have the day off and we got shit to do.” I passed her the glass and a cracker. Instantly, her face softened. “You brought me stuff.” Her eyes started to mist up.</p><p>Shit, what’d I do now?</p><p>“I—well, Ma said and...shit, Princess, don’t go cryin’ on me,” I told her softly.</p><p>Sniffling, she took a sip of her drink and a bite of cracker. “I can’t help it. I just cry sometimes. It won’t stop and you did this.” She held up the cracker, dropped her head and mumbled, “It’s sweet, probably the sweetest thing anyone’s ever done for me.” The comment alone had my chest panging with guilt and something I couldn’t put my finger on. This woman deserved sweet and sweet she’d get. I could do sweet, or at least, I hoped I could.</p><p>She was a hot mess ninety-percent of the time. We had read up on all the pregnancy things, and the morning sickness was supposed to have stopped months ago, but Teeny being Teeny, had to do everything in her own time. She was still getting sick in the mornings. We had, however, managed to figure out that if she ate small amounts often, it would lessen her being sick, but the morning one was still baffling.</p> <p>Three hours later—yes, three, because apparently it took three freakin’ hours to get one person dressed; this included a meltdown over not being able to reach her feet and some crap about hidden vaginas and furry mountain lions—we pulled up to the baby store, our first stop of the day. Jumping out, I rounded the truck and opened Teeny’s door offering my hand to help her down.</p><p>“Why are we here?” she asked, her eyes darting around with a mixture of excitement and awe.</p><p>“We need stuff for Junior.” Nudging her forward with a hand to her back, I passed the over-eager sales chicks and headed toward the back of the shop.</p><p>“Junior?” she asked quietly.</p><p>“Yep, that’s what I’m callin’ the kid now. He’s too big for midget.” Gesturing my head toward the huge shelves of baby carriers, I told her, “Pick one.”</p><p>She looked unsure, so I nudged her and repeated myself. “Pick one, Princess.”</p><p>With wide eyes, she whispered, “I can’t yet. I have to save more money first.” I simply rolled my eyes and gestured to the sales girl hovering off to the side of us. “Teen, I told you I’d help. This is me helpin’.” I turned toward the approaching woman effectively ending the conversation before she could argue.</p><p>“What can I help you with today?” Looking to her nametag, I turned on my charm “Kerri, I’d like to see the best carrier you have on the market please.” With a smile, she moved to the shelves. “This one here is—” Whatever she was about to say died on her lips as the carrier hit the ground.</p> <p>“Trip! What are you doing?“ Teeny rushed forward grabbing my arm and apologized to the sales girl, “I’m so sorry. I don’t know what’s wrong with him.”</p><p>“I gotta make sure it’s a safe one,” I answered flipping the carrier the right way up before I buried my head in the padding. “Yep, this one’s soft. We will take this one, but I want a new one. This one’s been thrown around a bit.” Kerri, the sales girl, smiled and nodded. Turning to Teeny who had a shocked look on her face, I put it to her, “So, you wanna pick the stroller?” Unsurprisingly, she nodded and walked quickly toward the display.</p><p>“Kerri,” I called to the still smiling sales girl, “we might need a big-assed cart.” With a quick nod and a laugh, she rushed off to get one.</p><p>Walking up behind Teeny, I slipped my arms around her rounded waist. “Which one?” A tiny tinkling laugh escaped her lips as she pointed to the one she wanted.</p><p>“That’s not very manly,” I pointed out.</p><p>“How do you know it’s a boy? We might have a girl.” She turned in my arms slightly and looked up at my face.</p><p>My eyebrows drew together at the idea of a little girl. “My seed is strong, woman. It makes big healthy boys. With large penises.” Teeny snickered at me and patted my chest.</p><p>A girl? I couldn’t have a girl. Although...well...the thought hadn’t even occurred to me that a girl was even a possibility. “I don’t know anything about little girls,” I said sounding a little put out. Teeny being Teeny didn’t comfort me but laughed instead.</p><p>“Don’t worry, baby. I’m sure you’ll figure it out.” Before I could argue, the sales girl came back and loaded the stroller Teeny picked on the cart with the carrier.</p><p>“Will there be anything else?” Kerri asked snapping me out of my pondering.</p><p>“A sling thingy, like this.” I pulled a folded-up piece of paper from my back pocket and handed it over. Teeny looked at me like I’d just stepped out of the twilight zone. “I looked some stuff up and printed it off.”</p><p>Lifting up on tiptoes, she kissed my cheek and whispered, “Thank you.” I liked this side of Teen, all soft and cute.</p><p>Pulling up to the house with the truck full of baby stuff, my phone vibrated. A text from Mace confirmed everything was set. Thank God. He’d cut it close on the timing, but he always did like to mess with my head. Nerves racked me as we walked up to the front door and I slid the key in the lock.</p><p>“Come with me.” Grabbing her hand, I pulled her up the stairs with me and stopped in front of the white bedroom door. It had been a hell of job keeping her out of this room for the past few months. I’d had everything covered, and a shit load of boxes filling the room trying to push her off the scent. That and of course I kept the door locked. The boxes were just in case she’s decided to try to pick the lock. Pregnant women did crazy shit sometimes. I hadn’t known how to show her everything that I’d bought for our baby all those months ago. I hoped to fuck that I’d finally picked the right time.</p><p>“What are we—“ I shushed her question with a quick kiss, reached forward and pushed the door open. Her gasp broke the silence of the room. “What do you think?” I asked, worried she’d hate it.</p><p>She openly gaped at everything in front of her. Her voice turned thick as she said, “Oh, it’s gorgeous,” moving toward the mahogany crib. “You did this?”</p><p>A shot of pride had my chest swelling. She liked it. While she was occupied, I hurried myself and poured the non-alcoholic grape juice into two fancy-ass glasses. Thank God, my brother was a pussy and knew what to get; otherwise, we would have been drinking out of red plastic beer cups.</p><p>“I’m glad you like it,” I whispered coming up behind her a glass in each hand. Sweet, sweet, be sweet, I internally chanted.</p><p>“I thought you were hiding something weird like a stripper pole or a collection of women’s underwear in this room; the door was always locked.” I smiled at that, knowing it annoyed the hell out of her that I’d kept this room shut away.</p><p>“I can always install a stripper pole. I wouldn’t be opposed to seeing you on one,” I mumbled mentally scanning the house layout for the best place to install one and quickly deciding our bedroom would be the best place. I needed to make some calls and get that happening, nothing would be better than seeing Teen put on a show just for me. The idea alone sent a rush of blood to my dick.</p><p>Bringing my arms around her from behind, I passed her a glass and dropped a kiss on her neck; I loved how soft the skin was there. “Move in with me,” my lips gently brushing against her throat as I spoke.</p><p>Goosebumps broke out over her skin and she breathed out, “I’m not sure if you realized this but I’m kind of here already.”</p><p>“No, move in with me, move in with me. Not stay with me. Move in with me,” I clarified. I wasn’t sure where the idea had come from, but at some point, the idea of not having her here when we got home from work or waking up in the morning to an empty bed made my chest tight and my stomach burn.</p><p>“Why?” Of course, she has to ask that. I was convinced she secretly got a kick out of making me lay all my feelings out there.</p><p>“You’re gonna make me say it, aren’t you?” Her answering snort made me smile. She always did that adorable snort when she gave me shit, and it was just plain old cute. “Fine,” I mock grumbled snuggling my face deeper into her neck. “I want you in my bed to take care of morning wood.” So much for sweet, I thought before rephrasing. ”I want to wake up to your pretty face every day. I want to take care of you and Junior.” I wasn’t so good at this feelings stuff, but I had to get better because Teeny deserved the best.</p><p>“You really want me to move in?” she asked quietly with a wobble in her voice. My arm wrapped around her, I placed my hand on her stomach. “I want you both to move in with me.” The baby decided that was the perfect moment to make itself known and kicked. A lump formed in my throat as the emotions crashed down on me. I had never contemplated being a father, but right then, I couldn’t think of anything I’d rather be. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh,” Teeny gasped. I scooted around in front of her and dropped down to my knees lifting her shirt up and placing a kiss right where Junior’s little foot had pushed out. Awe and wonder filled me as I watched Junior moving around under her skin. I could honestly say I’d never seen anything so magical in my entire life.</p><p>“He’s strong,” I murmured completely enthralled by his movements.</p><p>“She, she’s strong. Junior might be a girl. We’ve talked about this.” My head snapped up to look at her smiling face.</p><p>“Nope, it’s a boy. There’s testosterone. I can sense these things you know.” My brows scrunched; it better be a boy. I would be pretty screwed if I had a girl who looked like her mother. I’d be beating up ten-year-olds and decapitating teenage boys before I knew it.</p> <p>“I’m still betting on a girl. You need to be kept on your toes.” Teeny reached out and cupped my face in her hands. An insanely terrifying thought punched through my chest.</p><p>“What if I’m no good at it,” I worried aloud.</p><p>“No good at what, honey?” she asked confused by my sudden outburst.</p><p>“Being a dad. What if I’m no good at it and mess it all up. What if it—” My eyes went saucer-wide as I locked eyes with her. “What if Junior turns out like me?”</p><p>“Trip, hear me now. I’m only going to say this once. There is nothing wrong with being you; you’re sweet and kind. You’re funny and fiercely loyal. Don’t be ashamed of who you are. I know the real you and I love you for it. If our child turns out anything like you, that would be a blessing,” she gently reassured me. My mind was blown. Teeny wasn’t often the type to get all deep and meaningful, but right there, me on my knees, she meant it. I could see it shining from her eyes. She really meant every damn word she’d said.</p> <p>If I wasn’t sure I loved her before, I would have known with every part of me in that moment. She was it. She was my everything.</p><p>Chapter Twenty–One</p><p>Teeny</p><p>“I feel like a whale,” I pouted unnecessarily flopping back on the bed. “I’m not going.”</p><p>“Do I need to show you again how fucking hot you are?” Trip smirked standing in the bathroom doorway, one hand extended above his head touching the top of the doorframe. I licked my lips. My body warmed up as I watched a drop of water slowly travel down the tattoos on his defined chest. It gently trickled over his ripped abs, down one side of that awesome V muscle and soaked into the low slung towel that barely held on to his waist.</p><p>“Huh?” I asked completely distracted by the muscles that were stretched under his inked skin. The metal ring in his nipple caught the last rays of light streaming in from the window. He chuckled and smacked out a beat with his hands on the doorframe before pushing off and stepping in front of me. “You look sexy. Don’t doubt it.” A blush crept up my face as his eyes locked on mine daring me to argue back. He leaned down, cupped my face and kissed me hard. “You. Are. Fucking. Hot.” I sat flushed and speechless as he wandered off and got dressed like he was completely unaffected.</p> <p>“Humph,” I muttered pushing myself up from the bed and waddling to my cute flat sandals; my dress swished with each step. “You could go ahead and get fat with me; it’d make me feel better.”</p><p>“Princess, you aren’t fat. I’d tell you if you were fat. Your tits are fucking awesome. I’m actually thinking about making sure you stay knocked up. Those bad boys rock,” he snickered and dodged the ballet slipper flat I threw at him. I didn’t miss the suggestion of more kids, even if it was only him joking around. Rather than over analyzing it, I grabbed my purse and took myself downstairs ready for our first official date complete with a belly full of butterflies, arms and legs.</p><p>“I need to go again,” I sighed. “It’s your fault I need to use the bathroom so much. Your kid is heavy and pressing on my bladder.”</p><p>“You only went before we left the house,” Trip complained as he opened the restaurant door for me. I walked through choosing to ignore his comment. Instead, I just toddled up to the maitre’d stand. I opened my mouth to speak but was abruptly cut off when the young woman behind it locked her eyes on Trip and all but humped his leg.</p><p>“How can I help you tonight?” The tall brunette waitress cooed up at Trip batting her eyelashes and poking her very fake chest out. Unbelievably, she ignored my presence all together.</p><p>“Table for two, please. Somewhere quiet if you can,” he drawled smoothly while I glared at the flirty girl in front of him. Then he went and pulled out sweet Trip again and put an arm around my waist. My lips tipped up at the corners.</p><p>“Sure,” she sulked looking like she’d just sucked on a lemon. “If you’d like to take a seat at the bar over there, I’ll have somebody come and get you when it’s ready.”</p><p>“I’ll get us a drink while you go to the bathroom.” He dropped a kiss on my forehead and I shuffled off in the direction of the ladies’ room.</p> <p>I stepped back out of the ladies’ room with a giant smile on my face. As far as first dates went, this one was a little late, as in thirty-six weeks late, but so far nothing short of wonderful. Trip had been thoughtful and cute. Never complaining about how slowly I was teetering about on my heavy legs, opening doors and dismissing the waitress. I knew he wouldn't change.</p><p>Ten steps in and my smile died as fast as it had appeared, “You’ve gotta be shitting me,” I grumbled, a sick feeling swirling around my stomach. Trip leaned against the bar his back to me, a stunning woman leaning into him with her hand on his bicep giggling and flirting. I should have known better; it was too good to be true and I was an idiot for thinking otherwise. Once a player, always a player.</p><p>Unable to help myself, I stepped up a little closer, just enough to be within hearing distance. My heart stopped when Trip reached up and grabbed the girl’s hand that was running up and down his arm. My stomach dropped to my feet as I realized I was being played a fool. I was on a date with him and he was hitting on some chick the first chance he got.</p><p>My body locked up when he began speaking. I waited for that final blow where he got her number or organized a hook-up.</p><p>\"Listen, I get what you're trying to do and you look like a nice girl and all, but my woman will be back in a minute. And I wouldn't trade her for anyone, doll.\"</p><p>Wait, what? I did a double take, my stiff posture relaxing when his words sunk in. He wasn’t picking her up; he was dismissing her. For me. His words washed over me like magic. I watched as the girl turned her nose up at being rejected and stomped off in a snit. Trip simply shook his head and scoffed.</p><p>I quickly decided I didn’t want him to know I had witnessed the whole thing or had momentarily doubted him, so I ducked back around the other side of the wall and waited a beat. Smoothing my dress down, I watched him pull out his wallet and pay for our drinks before I walked back around the corner and straight up to him.</p><p>He’d just shown me that all his focus was on me. His simple words and easy gesture had soothed my thoughts as simply as if he’d flicked a switch. I stopped in front of him. Trip slid my drink over looking relaxed; he obviously didn’t realize I had witnessed the whole thing, so I decided I would act like it hadn’t happened. Rather, I would simply bask in the knowledge that he had validated me, us, without knowing it.</p><p>“Everything okay?” he asked noticing my wide smile.</p><p>\"Everything’s perfect,\" I replied meaning those words more than he’d ever know.</p><p>Chapter Twenty–Two</p><p>Trip</p><p>“Keep ‘em closed till I say,” I whispered in her ear shuffling her forward. I couldn’t help but lean in and run my nose up her throat.</p><p>“Oh,” she gasped. “Will there be sex? I can do sex. I like sex,” she rambled confirming she was the most perfect woman ever created. The last few weeks, she’d been insatiable. I was pretty sure my dick was close to shriveling up and running away; still, I wasn’t complaining. I didn’t think I’d ever get enough of her. She claimed it was just hormones and it’d stop once the baby was born. Me, I was hoping at least some of her over-excited appetite would stay.</p><p>I barked out a short laugh at her one-track mind. “No, no sex. Yet.”</p><p>“Damn,” she pouted making me smile even bigger.</p><p>“Okay, we’re going up a step now, ready?” I asked.</p><p>“Where are we going?” she asked sounding slightly giddy from the excitement of being surprised. I had woken her up in the most toe-curling way. I’d been as discreet as possible, even going so far as to blindfold her after helping her up into the truck.</p><p>“You’ll see in a minute. Be patient, baby.” Once I guided her up the step and pressed myself to her back, my arms curled around her very big belly. I couldn’t not touch it; it was a pretty special thing, and every time I did Junior would roll or kick, almost like it knew I was there.</p><p>“Congratulations!” Everyone yelled when Teeny stepped inside the tattoo parlor. The entire place was decked out in balloons and streamers. Mace and I had snuck off after dinner the previous night leaving Teeny and Scarlett to their girls’ night in while we slaved over the decorations. Well, maybe not slaved, but close enough.</p><p>Teeny’s eyes watered with unshed tears as she smiled shakily holding a hand to her chest in surprise. “What? I don’t...who did this? What’s it for? I mean...”</p><p>Damn, it was adorable when she babbled.</p><p>“You graduated, Princess. You are a fully qualified tattoo artist.” I rested my chin on her shoulder.</p><p>“You did this for me?” she asked sounding a little choked up. I reached into to my pocket and pulled out the tissues I’d had the good sense to grab. I was getting the hang of this crying thing. I just had to have provisions all the damn time.</p><p>I handed her off to Scarlett and pushed the tissues into Teeny’s hand. “I’ll be right back. I just have to take care of something,” I assured her before nodding to Mace and ducking into the backroom of the parlor.</p><p>“You all set?” Mace asked walking in behind me and shutting the door.</p><p>“Yes, no. I don’t know.” I ran a hand over my face and took a deep breath. “Fuck me.”</p><p>“Yeah, you’re ready,” Mace laughed and slapped me on the back.</p><p>“Have you got it?” I asked shifting from foot-to-foot nervously. Mace reached over and passed me the box I was after.</p><p>“She’s going to skin you alive when she finds out what you’ve done.” Mace laughed when I nodded.</p><p>“I know, but it had to be done.” I hid the box and moved to the refrigerator pulling out the cake Scarlett had picked up that morning. “I feel kinda sick,” I regrettably told Mace.</p><p>His answer was to laugh and head back out to the party with me following not far behind. As soon as I stepped back into the crowd of our family and a few close friends, Teeny’s eyes locked on me and she waddled over.</p><p>“This isn’t just for my graduation.” Obviously while I was in the back, she’d noticed the decorations that all said baby shower. I shook my head smiling, placed the cake on the table and cupped her face in my hands. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Looking down at her sparkling eyes and blindingly happy smile, I felt almost like a superhero. I’d put that smile there. Me. “Enjoy it. You deserve it.” I brushed my lips over hers and nibbled the side of her mouth, and then spoke against the soft red skin of her lip. “You want something to drink or eat? I got pickles just for you.” Her answer was to snort and nod her head.</p><p>When I pulled a jar of pickles out of a bag under the table and handed it to her, she pecked me on the cheek and took off as fast as her heavy frame would allow. I chuckled when she eased down on the waiting room sofa and opened the jar, popping a pickle straight in her mouth. I could even hear her moan from across the room. “Damn, pickles,” I muttered busying myself again.</p><p>“I’m not sure what you were thinking picking this cake,” Ma chastised stepping up beside me.</p><p>“What’s wrong with the cake?” I asked confused. It was what the lady had suggested at the bakery when I called the order in.</p> <p>“It’s blue,” she pointed out softly.</p><p>“Yes, it’s blue. I’m relieved you aren’t color blind yet, Ma.” I ducked right away, but her hand still miraculously connected with my ear. “Ouch,” I complained rubbing my lobe between my fingers.</p><p>“You don’t know you’re having a boy, bebe.” Ma’s warm smile made me more than a little happy.</p><p>“It has to be. Look at the genes in play here.” I pointed to my puffed out chest.</p><p>“Still so modest,” she mumbled leaning up and kissing me on the cheek before finding her seat again.</p> <p>It was a damn near perfect day. Teen was smiling like a loon surrounded by baby crap of every possible variety. So why was my stomach churning like a bitch?</p><p>Teeny</p><p>Once everything was cleaned up and all our friends and family had left, Trip smiled and told me with a sparkle in his eyes, “I have another surprise.” He had been acting all cute and discreet, and made me close my eyes. Shuffling through the parlor, I held onto his hand and let him lead the way.</p><p>Still with my eyes closed, he told me, “Lay down right here. I’ll guide you.” He held my hips until I was sitting on the tattoo table and then gently helped me to lay down. The paper sheet crinkled under me as I got comfortable.</p><p>“So I’ve been working on this tattoo piece for your ribs. I want to show you,” Trip told me cautiously.</p><p>“Won’t I need my eyes open to see it?” I pointed out smiling. He was being coy and a little obscure.</p> <p>Buzzzzz</p><p>At the sound of the tattoo gun, my eyes shot open and I sat up, ramrod straight.</p><p>“What are you doing?” I barked out. Trip had the tattoo gun in his hand. “You can’t tattoo me! I’m pregnant!” I screeched. My hand flew up to my chest and my heart raced a million miles an hour. A giant smile took over his face and he burst out laughing. It was then that I realized he’d intended to frighten me.</p><p>“You should have seen your face,” he wheezed holding his stomach with one hand. “That was priceless.”</p><p>I slapped his arm. “You scared me to half to death, you asshole,” I giggled.</p><p>“I was just messing with you.” He calmed himself down enough to put the tattoo gun down and picked up a sharpie. “I have this instead.” He waved the pen around and raised his eyebrows.</p><p>“Okay, you’re in charge here.”</p><p>Rather than just pulling up my top, he gripped my hips, squeezed my waist then slowly slid his hands up my ribs causing my top to lift and goose bumps to break out over my skin. His thumbs brushed against my ribs in a small affectionate gesture.</p> <p>“This might be a little cold,” his husky voice penetrated the cloud of lust around my head. Uncapping the marker, he sat me up, legs dangling over the side of the table and then rolled himself on the stool between my legs.</p><p>\"You gotta keep still, Princess,\" Trip whispered against my skin. The wet tip of the sharpie tickled my ribs as he leaned in close and started drawing lines, shapes and patterns I wasn’t able to see yet.</p><p>I let out a long breath and relaxed under his hard warm hands.</p><p>“Oh, that’s pretty.” I glanced at the intricate vines he had sketched over my taut skin within minutes.</p><p>“I’ve barely started,” he grinned concentrating on his task. I was entrapped by the look on his face; every so often, his tongue would shoot out and wet his lips. Not only had my sex drive flown through the roof, but any normal woman would have wanted to jump his bones. He was damn sexy when he was drawing; he always had been. There were more than a few times when I’d been at the shop visiting Scarlett and he’d been sketching something, so absorbed in his project that he wouldn’t notice me watching him. The way he’d bite his lip and furrow his brow was enough to make me combust.</p><p>I must have become lost in thought, as the next time I looked down, he had made a lot of progress. Along one side of my ribs was an amazingly detailed vine with whisper-soft baby’s breath; the background was the perfect pattern of wind and blowing leaves.</p><p>“That’s amazing. Is it done?” I asked trying to see further past his tattooed hands.</p><p>“Nope, I’ve been wanting to do this for a long time. I’m savoring it,” Trip murmured completely focused.</p><p>“What do you mean a long time?” I hadn’t realized before now, but he had drawn the entire thing without a sketch. He’d told me he drew up the design, so it wasn’t just him messing around with a pen; he had committed it to memory beforehand.</p><p>“I told you. I’ve been thinking about this for a long time, probably since the first time you walked into the parlor. You were wearing those fucking tight jeans that made your ass look like heaven and a backless shirt-thingy,” he all but moaned.</p><p>Dumbstruck, I searched his face to find him lost in thought, the black marker raised mid-stroke. A cheeky grin slowly crept over his face and he shook his head.</p><p>“Explain, please,” I demanded softly. The pen tickling as he steadily created his masterpiece.</p><p>“You didn’t know?” he asked looking up at me as I shook my head. “Babe, every fucking time you walked in the room, I’d have a hard-on the size of the Statue of Liberty. I lost count of the number of times I whacked off with you on my mind.”</p><p>“Oh, I didn’t know. Why didn’t you ever...?” I wanted to ask, but I was afraid of the answer. I still had this niggling fear he had fallen in love with me only because I was carrying his child.</p><p>Capping the pen, he put it aside. “I never wanted to mess up the friendship we had. If I had thought for a second fucking you six ways from Sunday would have gotten me what I have now, I wouldn’t have hesitated. I wasn’t ready then. I am now.” The easy, simple way he spoke those words melted my heart.</p><p>“I’m stuck between wanting to punch your pretty face and wanting to kiss the hell out of it.” He didn’t want to mess up our friendship?</p><p>“My face isn’t pretty,” he injected with a scowl. “It’s manly and handsome.”</p><p>I chose to ignore his disgruntled comment and pointed out, “Our friendship wasn’t exactly a healthy one.”</p><p>“I figured you knew I was hot for you, that’s why you pranced around in next to nothing or skin-tight shit. You were torturing me on purpose.”</p><p>“No, I didn’t.” My browns creased then an idea formed. “I could have banged the hell out of you long before now. I’m thinking we have to make up for time lost.”</p><p>With a shake of his head and a heated look, he picked up the sharpie and moved between my legs.</p><p>“Not there. I won’t be able to see it if you do it there,” I giggled when the marker pressed to the underside of my stomach leaving the wet black lines.</p><p>“I’m strangely turned on right now,” he smirked wickedly.</p><p>“I can help with that.” I immediately jumped at the chance.</p><p>“Be patient, Princess.” He put the lid back on the sharpie pen and tossed it on the table beside him. He then moved back a little to view his work. He smiled before slowly leaning forward and pressing his lips to my stomach, while squeezing my hips. He leaned his forehead against it and took a deep breath. The gesture was so sweet that it made me want to cry.</p><p>Only two more weeks of the damn pregnancy hormones if luck was on my side.</p><p>Trip lingered at my belly pressing kisses to it for a moment longer before he picked up a small mirror and held it to his chest. My interest was more than piqued. He was acting a little strangely.</p><p>Holding out a hand, he helped me down from the table. “Stand there. I’ll show you.” He proceeded to trace my stomach and walk me through his design. “You saw most of it; here’s our part.” Stretched out along the middle of my belly was a timeline of sorts. “There’s donuts because you always used to bring them in to the parlor, and you made sure I got my favorite.” Pointing to the tiny images, he dragged his fingertips to the next. “There’s board games. From the first night we made out, you remember that? We hadn’t known each other long.” I nodded. I did remember.</p><p>We’d gotten drunk together at Scarlett’s one night, all of us just lounging around playing stupid kids’ board games. She had passed out cold and we ended up making out like a couple of teenagers. It’d turned hot and heavy, but something had snapped and he pulled us to a stop. I’d been overly pissed off, but played it like I didn’t care either way. I’d cared. I already had a crush on him by then.</p><p>“This here is the drink you threw at me that night at Bob’s bar when I chased that douchebag away from you.” He pointed to a perfect glass that looked exactly like the rum and coke I’d been drinking that night. “He was screwing the waitress in the hallway in between dances with you.” Trip told me, his face getting stormy as he no doubt remembered that night.</p><p>His fingers, whisper–soft, moved over further. “This is for the first time we heard Midget’s heartbeat.” He smiled softly pointing to a little zigzag heartbeat pattern. “This one is his first teddy bear. Next, a microphone for the song I sang to you at the wedding.”</p><p>“To me?” I asked.</p><p>“Yeah, that was all for you. That’s where this comes in.” He pointed to an angel holding up a tiny ball of light. There were other little pieces of art scattered across my skin, all representing a little piece of our story. The main focal point above the whole thing was a princess crown, which made me laugh. When he first started calling me that, I would get so mad at him I’d glare daggers at him for days. He’d simply laugh and saunter off.</p><p>Slightly emotional I went to move as he stood up. His hand on my arm stopped me and he dropped down onto his knees holding the mirror to his side.</p><p>“This one is really important.” Holding the mirror so I could see the underside of my bump I read the script, and read it again and gasped. Looking down into his nervous blue eyes, I opened my mouth to speak.</p><p>He stopped me and read the words out loud. “Princess, I’m so in love with you; it hurts. You make me crazy and you drive me nuts. You know me like nobody else. I want to be your somebody for the rest of my life; you’ll forever be my somebody. Will you be my wife? Marry me?” he finished shakily. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Just as I was about to answer, I felt a rush of warmth. I looked down further and gasped as it hit me. “Trip, my water just broke.”</p><p>Chapter Twenty–Three</p><p>Teeny</p><p>“Huh?” Trip asked blinking rapidly, his hand in his back pocket.</p> <p>“My water just broke,” I squeezed out when a pain ripped through my lower stomach almost like it was in a vise.</p><p>“But, I’m trying to—SHIT! “ He shot up off his knees and ran out the door. I stood there staring at him and gripping onto the table all the while hearing him rambling, ”I need more time. We have more time! Junior isn’t due for two more weeks!”</p><p>“Trip, I think you might need me to come with you.” I looked down at the wet floor and back up at the door. “Perfect time for him to get scared and run away,” I grumbled as the pain subsided.</p><p>“You have the baby. I need you to come with me,” Trip said panicked when he rushed back in the room looking flustered.</p><p>“Calm down, honey.” I skirted around the table. “I need a mop.”</p> <p>“Fuck the mop! Your water broke.” Poor Trip looked so freaked out. I was about to reassure him but another pain gripped me again. I grabbed his arm and breathed nice and slow, concentrating on a spot on the wall behind Trip.</p><p>“We need to call 911. We need the paramedics,” he rushed out looking around a little helplessly.</p><p>“Calm the hell down.” I gritted my teeth. His freak out was nothing but amusing. The pain passed and I directed him toward the door. “Can you please get me my cellphone so I can call Scarlett?”</p><p>“Stuff, we need your stuff. You start for the car. I’ll get your stuff.” Dear Lord, he was rambling.</p><p>Standing beside the monstrous truck, I was close to cursing him. When he raced out of the parlor, a cell pressed to his ear, I glared at him. He pulled the phone away and raced toward me. “What’s wrong?” he yelled looking between my stomach and me.</p><p>“Your stupid penis truck is what’s wrong!” I complained. “I told you a truck was a stupid idea. Didn’t I tell you? I damn well told—” His lips on mine abruptly muffled my rant.</p> <p>Pulling back, he held onto both my arms until I was steady. “Shut up. We have to get to the hospital.”</p><p>Chapter Twenty–Four</p><p>Six hours after arriving at the hospital, I was getting panicky. Surely, she shouldn’t be in so much pain. It couldn’t be normal. Shit, something’s wrong, something has to be wrong.</p><p>Every few minutes, she’d start those breathing-things that stupid teacher lady from the classes had showed us. Her face would scrunch up and she’d look at me like she was wishing a thousand scorpions would attack my crotch. Frankly, she was scaring me a little.</p><p>I took a very slow step forward and handed Scarlett the cup of ice chips before mumbling, “Gotta update Mace. Be right back.” The foul look both the girls gave me only made me hightail it out of the room faster.</p><p>“How’s she doing?” Mace asked as soon as I walked into the waiting room.</p><p>Sighing, I flopped into the chair beside him, pulled my beanie off and ran my hands through my messy hair. “She’s hurtin’ and I can’t do a God damn thing about it.” Arms on my knees and head in my hands, I really didn’t want to open the can of worms on him, but I needed to know. “Did it take this long for—I mean did she take this long to—” Cringing at the stupid words coming from my mouth, I didn’t know how to ask him without hurting him.</p><p>Mace grabbed my shoulder and squeezed once. “Belle took fourteen hours to get here, bud. You’re doin’ fine.”</p> <p>“I’m sorry. You holdin’ up okay?” I asked. No doubt this was bringing up all sorts of hurt and shit for him.</p><p>“I’m good. Now, pull your shit together and get back in there,” he smiled a little sadly.</p><p>“Sure, you call Ma?” Standing, I pulled my beanie back into place.</p><p>“Yeah, she’s on her way, now go.” He shoved me toward the door. I had a feeling I was about to walk into the pits of hell, or at least find Teeny replicating a demon. Taking a deep breath, I walked into the room where Teeny was lying on the bed looking like I assumed. I very cautiously shuffled up to her and took over from Scarlett wiping a wet washer over her forehead.</p><p>“Arrggghh. I freakin hate you right now!” Teeny yelled at me puffing and panting. “This is all your fault!” she snapped crushing my left hand as another contraction ripped through her body.</p><p>“You want some drugs yet?” I ground out; she’d just dislocated two of my fingers. I was thinking I might be the one needing the drugs soon. “It’s been hours, Princess. It’s okay if you do. Maybe I’ll just call the nurse to get some, yeah?”</p><p>“I know how long it’s been! I can feel how damn long it’s been!” she snarled. “I don’t want drugs. I want this kid out of me. Now!”</p><p>Just then, Doctor Wood walked through the door and handed me a gown and gloves. “Suit up, Daddy. You’re going to help me,” she smiled.</p><p>“What? I can’t. I don’t know what—I mean—” I stuttered at the idea of what might be down there.</p><p>Ignoring me, she spoke to Teeny, “You’re moving along nicely. How are you doing up there, Teeny?” Doctor Wood asked with a few quick nods of her head at the nurses and a pointed look at me.</p><p>Throwing the stuff she’d given me on, I moved as a nurse gently pushed me toward the doctor and Teeny’s business end. A tray of metal instruments was wheeled over to us, and Doctor Wood looked up at me with a serious look on her face.</p><p>Ahh Shit, the nerves got the best of me and I started to ramble, \"Is it broken? Oh God, it's broken, isn't it? Fuck me! You know, Mom never could give me anything as a kid. Toys. I'd break ‘em. New clothes. I'd mess ‘em. Now, I fuck up my favorite part of my woman! Goddamn it! Tell me it'll be okay, Doc!\" I rambled looking for assurance that my happy place was going to come out the other side okay.</p><p>“Holy shit! “ I looked from between her legs up to her sweaty red face. “Babe, there’s either a head comin' out or you're pissin' a fucking baseball! Holy shit, Teen, it's the head!”</p><p>“I know. I can freakin’ feel it!” she screamed looking like she’d take my head off if it were within reach. I peeked back down and heard her grunt.</p><p>Excitement filled me. \"The head! It’s out!\" My excitement fizzled when bloody water gushed out. Starting to feel woozy, I swallowed hard and my lip curled. \"Is it meant to do that? My breathing became heavier. “I don't like that.\" I stepped back and away a little, my stomach rolling. \"Nope. Babies are meant to be soft and fluffy. Teen's not having a demon baby.\" I held the wall for support, panting. \"I'm in bad shape over here. You just keep doing what you're doing, Princess. I'll be right there.\" I doubled over, breathing deep and trying not to pass out.</p><p>Scar snapped at me from beside Teeny, “Get your shit together. You got her here. Now pull up your lace panties and help her.”</p><p>Teeny grunted and pushed again. I took a tentative step forward to see the doctor pulling and yanking at my kid’s shoulders. Teeny's bits looked like they might tear in half. I winced, \"That's gotta hurt.\"</p><p>The sight of her vagina stretched so much made me want to cry or stomp my foot or something, just to show my distress. Perhaps, I’d have a meltdown.</p><p>The doctor pulled again. ”Oh God, it's not a rubber band. It ain't meant to go like that! Put it back! Put it back!\" I was sounding hysterical. At that point, Teeny and Scar both yelled at me to shut up.</p><p>I fisted my glove-covered hands against my temples finally, reaching freak-out mode. Mace may have been smart to sit this one out. I was sure that I had just witnessed what was the equivalent of watching your favorite bar burn down.</p><p>\"Okay, Daddy, this bit I need your help with, you ready?\" the doctor calmly asked.</p><p>\"Yeah,\" I forced out ignoring my brain screaming NO FUCKING WAY. Doctor Wood grabbed my hands pulling me into place.</p><p>\"Okay, ready one more big push, Teeny, and go.\" She moved my hands, and as Teen pushed, the doctor moved my hands with hers. We moved the baby's shoulders this way and that, followed by a gush of more blood and gross shit that I didn't even notice because in my hands was our baby. Our tiny little baby.</p><p>“Holy shit,” I whispered, emotion clogging my throat.</p><p>The doctor put a plastic squeezy-thing in its mouth and nose, and then it screamed. Loud. My nose burned, my throat constricted and a tear fell down my face. I was holding a part of us. I did this. I helped make this tiny little perfect person, and it might be the only good thing I’d done in my life.</p><p>\"Congrats, Daddy. You have a son.\"</p><p>A son.</p><p>My son.</p><p>Oh God.</p><p>I have a son.</p><p>Shit just got real.</p><p>I smiled down at my little boy. \"Hey, little buddy, what's your name?\"</p><p>Shit.</p><p>Looking up at Teeny, I asked, “What's his name, baby?”</p><p>With a tired smile, she hoarsely whispered, “Javier. Javier Hector Torres. “</p><p>“He’s fucking perfect.” My vision blurred as I looked down at a real-life miracle.</p><p>The nurse put a hand on my shoulder. “I’m just going to clean him up and wrap him now, okay.” My eyes flickered from Teeny to the nurse, and back to baby Javier, before reluctantly handing him over to her. I followed a step behind, not taking my eyes off my son.</p><p>They put him on some kind of machine and wrote down a few numbers, measured him head to toe before wiping him down and wrapping him in a blue blanket. They popped a tiny knit beanie on his head and handed him back to me.</p><p>I immediately took the beanie off and handed it back to the nurse, reaching into my back pocket I pulled the tiny white beanie with black print and slid it onto his head; it was an exact replica of the one I wore. “I knew you were gonna be a boy,” I whispered to my little man.</p><p>“He looks like you,” Scar said quietly looking over my shoulder. “You did good, honey. I’m gonna go out and let Mace know. Give you two a minute.” A kiss on my cheek and she was gone leaving me alone with my family. I made my way carefully over to Teeny taking small careful steps so as not to jostle the little bundle in my arms. She’d been somewhat cleaned up and was sitting up in the bed watching us with tears in her eyes.</p><p>“Don’t cry, Princess. Look what we did. Look at him.” I placed Javier in her arms and leaned down kissing her softly on the lips.</p><p>“Thank you. For him, for you. Thank you for giving me a family of my own.” I wiped the lone tear rolling down her cheek with my thumb, and kissed her once more before moving back a step to watch the two most important people in my life.</p><p>The two people that would forever consume my entire being.</p><p>Chapter Twenty–Five</p><p>Trip</p><p>“Yes,” she whispered softly, her warm breath tickling my lips.</p><p>“Huh?” I mumbled sleepily. It was a few hours after the most precious thing I’d ever held arrived, and we were laying face-to-face on the tiny hospital bed. Javier sleeping in a cot beside us. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes, I want to be your wife,” she told me, her breathing hitching on the last word. My world stopped. I stared. I blinked.</p><p>“Best. Day. Ever,” I muttered placing soft kisses on her lips between every word. I pulled her face to mine, crushed my lips down on hers and proceeded to kiss the ever-loving shit out of her.</p><p>“You sure?” I asked breathless and completely terrified she’d tell me it was a big fat fucking joke.</p><p>“You trying to change my mind?” she yawned. I let out the breath I hadn’t realized I was holding and snaked my arm over her hip.</p> <p>“Best. Day. Ever.” That was all I could say. It was the truth.</p><p>Teeny</p><p>“Quit pouting,” I snickered walking up the front walkway and unlocking the door.</p><p>Trip walked in after me carrying a sleeping Javier in his baby seat. “Six weeks. That doctor lady said six-freaking-weeks. What am I supposed to do for six weeks?” he sulked.</p><p>“Your hand,” I said pointedly and moved to unclip the baby carrier belt. Trip merely scowled and quickly slipped Javier out of the seat and up onto his chest. He walked away with an indignant sniff and a tender hand on our son’s tiny back.</p> <p>My heart melted as I watched Trip whispering to Javier. I spun my engagement ring around on my finger as realization hit me.</p><p>I had a family.</p><p>For the first time in my life, I had a family that I cared about, that cared about me and I was very okay with that. I slowly followed after the boys straining my ears to hear Trip’s sweetly whispered words; there wasn’t anything more moving than a father bonding with his child; it had the ability to take the breath right out of a person’s lungs.</p><p>“Mommy’s going to have a nap, and you and I, we’re gonna hang out,” Trip said in a gentle voice. “How ‘bout we watch a game? You can have your bottle.” Trip held onto the bottle of breast milk. “And I’ll have my bottle.” He reached forward and picked up his bottle of beer. At my giggle, his head came up, a gorgeous smile covering his face. It slipped for a second replaced by a tiny frown. “Is that allowed? I’m allowed to do that, right?”</p><p>I just shook my head and shuffled up to my boys dropping a small kiss on Javier’s head followed by a peck to Trip’s lips. “A beer while you two hang out won’t hurt. You don’t have to ask me if you’re doing every little thing right. He’s your son too. You know as much as I do, honey.” His eyebrows knitted together, the light shining in through the kitchen window catching on his eyebrow piercing.</p><p>“What if I do something dads aren’t supposed to do? Like not check his diaper enough or forget to feed him, or not burp him? I might teach him the wrong things and mess him up, and then he’ll hate me for being a screw up of a dad.” It was cute when he rambled but this; this was adorable. All the things I assumed about Trip in the beginning were so far from the truth; it was ridiculous. I always hoped under his playboy ways he was something else, but this? No, it never crossed my mind. He went on, “Then, he’ll start cussing at home, skipping school and get in with a bad crowd. I’ll tell him to grow up and he’ll tell me he hates me. He’ll go out one night and skip town.” Looking terrified at his own mind’s story, he adds, “Then we’ll be the sobbing parents on the news begging their kid to come home. You’ll be all sniffles and tissues, and I’ll be the dad who tries to put on a tough face but...” He looks up at me through wide-eyes, “...my chin will wobble. I’ll be the wobbling chin dude. People will remember me as the wobbling chin guy on the news who fucked up his son by not changing his diaper on time.”</p> <p>I blinked at my future husband.</p><p>What the hell is he on?</p><p>“You’re fine. You’ll do fine. If you get worried or you need me, come and get me.” I leaned in and kissed him gently as I turned and made my way up the steps.</p><p>I heard him grumble, “Six-freakin’-weeks. I’m gonna explode in one.”</p><p>After my shower, I’d slid into bed and passed out for what felt like only minutes. When I opened my eyes again, Trip was lying beside me with Javier wrapped in a blue bunny rug in-between us. His eyes were wide and taking everything in. No words were said. Trip just glanced down at our little guy and back up smiling a blinding happy smile at me. His hand reached out and he brushed his thumb across my cheekbone before cupping my face. The love and adoration he felt consumed me as I brought my hand up to cover his. I was right where I was supposed to be and nothing could top this.</p><p>“Were you watching me sleep?” I asked, my voice still husky from sleep.</p><p>“Yeah, you were drooling.” My eyes widened in horror. He grinned, “It was cute.”</p><p>I might not have been the prettiest girl in the world or even the smartest, but I was the girl he'd given his heart to, the promise of his name to, but most importantly, I was the girl he’d given his entire world to.</p> <p>And I would give him mine.</p><p>I would be the wife he deserved. I would be the mother Javier would love freely. I would remind myself daily of the love surrounding me. And in return, Trip would hold my heart forever. Whether he knew it or not</p><p>So much had happened over such a short time. I didn’t quite remember all the details, but I remembered the small things.</p><p>Trip wanting me.</p><p>Trip protecting me.</p><p>Trip fighting for me.</p><p>A smile graced my lips and I wondered how I’d gotten so lucky.</p><p>I had won the boyfriend lottery.</p><p>And I wasn’t letting him go. Not ever.</p><p>Chapter Twenty–Six</p><p>Trip</p><p>“Oh, come on, buddy.” I grabbed the burp rag and wiped at my bare shoulder where the spit-up had landed. “Now we both smell like puke.” Javier wiggled in the crook of my arm for a few seconds before his eyes fluttered shut and he was asleep. I leaned back in the rocking chair and just took a second to relax; I’d gotten up with him for his four am feed seeing as Teeny was so worn out.</p><p>Our little dude was fairly mellow. He ate. He slept. He crapped, but on the rare occasion he decided he wasn’t happy, nobody else was either. I think that mostly had to do with the fact that he was a lot like his momma. Prefect would be the only word to describe him, just perfect.</p><p>It astounded me that one night could have such a butterfly effect. I’d caved to my selfish wants and taken a friend to bed knowing full well it would change our relationship, but not a having a clue it would be the best change my life had ever seen. As a result, I had a family of my own and a million and one reasons to smile.</p><p>“I’m gonna make you and mommy real happy, little dude,” I whispered against the soft fluffy hair on Javier’s head. My tattooed hand on his tiny back was a contrast to say the least; he was so damn tiny and fragile. I was forever worried I’d break him. He was definitely lavished with enough attention though. The moment he made a noise, somebody was cuddling him, and surprisingly Scarlett was the worst one for it. Javier didn’t even have to cry for her to be all over him. Most times, she had him in sight for barely three seconds before he was in her arms.</p><p>“Nothing can beat this, nothing,” I murmured in the dark rocking back-and-forth in the wooden chair.</p><p>Before I knew it, the sun was up and I was still sitting in the rocking chair. Javier started to move around in his crib where I’d put him in the early hours of the morning. Don’t ask what possessed me to stay there all night, but I was always glad when I did. Seeing him waking up in the morning opening his sweet blue eyes and taking in the world around him, was now one of my favorite pastimes.</p><p>I pulled him up to my chest and shuffled over to the change table. Snatching up a diaper, I set to work on our morning routine hoping to let Teen sleep a bit longer.</p><p>“You slept like a rock, little man. Not a peep outta you. You must have been tired, huh?” Unclipping his onesie, I got rid of the wet diaper and started putting a fresh one on, when without warning, a warm wet something hit my naked chest. “What the—” I sputtered taking a small step back, but keeping my hand on Javier’s stomach so he wouldn’t wriggle off the table. “Dude, you whizzed on me,” I announced incredulously.</p><p>Soft laughter drew my attention to the door where a freshly showered Teeny stood smiling and looking content. “You go shower. I’ll take care of that,” she smiled walking toward us. “Trip,” she called putting one hand on my arm to stop me walking out of the room. “I’m already more than real happy, honey.” It occurred to me she’d been listening in to me rambling with Javier last night. “Baby monitor was on.” She nodded her head to the device sitting in the corner of the room. “You already make me more than happy.” I leaned down and kissed the top of her head taking a deep breath to catch the soft vanilla smell that always surrounded her. The smell that never failed to remind me I was home.</p><p>Epilogue</p><p>Teeny</p><p>Seven months later...</p><p>“What?” Scarlett all but screamed, her face turning a pretty shade of red. “The boys are going to flip their shit.” With a wince she added, “Fully flip their shit. Someone might end up deformed and or dead.”</p><p>“Oh, I know,” I sighed. She was right. Both Mace and Trip were going to lose it in a bad way. “I had a clue what was going on for a while now, but I’m not sure what to do about it.” I flicked my eyes over at the clock; the boys would be back any minute, so we had to wrap this up quickly. “She’s an adult. She can make her own choices.” I pointed out. Scarlett nodded with a vacant look to her eyes. I was almost certain there were a million different scenarios playing out in her head and all of them ended with injury.</p><p>“Maybe we should talk to her? Make sure she knows how pissed they’ll be?” I was betting Haven already knew the score there, so I just shook my head and flicked the baby monitor on. Haven had just volunteered to put Javier down for a sleep and I liked to keep an ear out just in case. “How long though?” Scarlett asked still looking worried.</p><p>“You know the night of your bachelorette thing we had here?” She nodded so I kept going, “Well, one of the questions that night was ‘have you had sex on a Harley’...” I trailed off letting her figure the rest out. She frowned, still not understanding. “I drank. Haven drank. Jude owns a Harley and—”</p><p>“Shit!” was Scarlett’s mumbled reply when she pieced it together. Just as she was about to say something else, the front door burst open and three sexy-as-sin guys strolled on in, followed by two handsome little guys. Trip’s eyes met mine, and the second they did, a bright smile lit up his face. It was unbelievable how happy he made me and vice versa. We fought. Oh boy did we fight. It was childish the things we did bicker about. He’d shout. I’d bitch; we’d purposely piss each other off and then make up like the world was about to end. Those were some of my favorite times too. Nothing beat make-up sex with Trip. Nothing.</p><p>Mace made a beeline for Scar and Jude’s twin boys ran past us right out the back door to the massive tree house in the yard. Jude hung back closing the front door, his eyes darting around the room. He nodded to Scar and me and then excused himself to go to the bathroom. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>“Missed you, Princess,” Trip whispered coming up behind me and running his nose down my throat. I smiled to myself and leaned back into his ripped body. “Where’s my little man?” His lips ghosted along my shoulder as he spoke.</p><p>“Your sister took him upstairs for a nap.” Haven had been spending as much time as she could between school and work visiting, just to spoil her nephew.</p><p>“She’s still here?” he asked with a laugh. I nodded and turned around to wrap my arms around him. My stomach sunk and Trip’s entire body went solid as a rock under my hands.</p><p>“What the mother fuck?” he boomed, his eyes shooting from the baby monitor to the ceiling and then back to the small white speaker again.</p> <p>“We can’t do this here, sweetheart.” Jude’s voice was clearly amplified through the room.</p><p>“Bathroom. I need you. I need you so badly, Jude.” Trip’s face was now a picture of rage as he glared at the baby monitor.</p><p>“Your brothers are downstairs and—fuck. Don’t do that.” Jude’s groan echoed through the painfully silent room.</p><p>“Fuck. No,” Mace growled through gritted teeth looking like his head was about to explode. I gripped Trip’s arm to no avail; he all but sprinted out of the room and up the stairs, Mace already two steps ahead of him.</p><p>“Sweet baby Jesus, here we go,” Scar stated echoing my thoughts exactly. We shot each other a pained look and took off after the boys.</p> <p>“If they break my house, I’m going to break them,” I grumbled stomping up the steps toward what promised to be World War Three. </p>  </body></html>"]