["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sat in a small, drab office, one of many in the Atlanta chapter of the Order of Knights of Merciful Aid, and pretended to be Kate Daniels. Kate’s phone didn’t ring very often, so I didn’t have to pretend very hard.</p><p>Unfortunately, when it did ring, like right now, the person on the other end was rarely interested in a facsimile. They wanted the real thing.</p><p>“Order of Knights of Merciful Aid, Andrea Nash speaking.”</p><p>A female voice on the other end murmured hesitantly. “You’re not Kate.”</p> <p>“No, I’m not. She’s on medical leave. But I’m filling in for her.”</p><p>“I’ll just wait until she comes back.”</p><p>I said good-bye to the disconnect signal, hung up, and petted my SIG-Sauer P226s lying on Kate’s desk. At least my guns still liked me.</p><p>The real Kate Daniels, my best friend and partner in butt-kicking, was on medical leave. And I intended to do my best to let her stay on medical leave, at least until her wounds stopped bleeding.</p><p>The magic wave fell. The mysterious orange and yellow glyphs on the floor of Kate’s office faded. On the wall, the charged air inside twisted glass tubes of a feylantern turned dark, while the ugly warts of electric lights in the hallway ceiling ignited with soft light. Inside my skin, the secret me stretched, yawned, and curled up for a nap, with her claws securely tucked away.</p> <p>We lived in an uncertain world: magic flooded us in waves, screwed things up, and vanished. Nobody could predict when it came and went. One always had to be prepared. Sometimes though, no matter how prepared you were, the magic left something behind that you simply couldn’t handle, and then you called the police, and if they couldn’t help, you called the Order. The Order would send a knight, someone like me, who would help you with your magic problems. At least, that’s how it was supposed to work.</p><p>Very few people could have expertise in both tech and magic. Kate chose magic. I chose tech. Give me a firearm and silver bullets over swords and sorcery any day.</p><p>The phone rang again. “Order of Knights of Merciful Aid, Andrea—”</p><p>“Can I speak to Kate?” An older male voice tinted with country accent.</p><p>“I’m filling in for her. What do you need?”</p><p>“Can you take a message for her? Tell ’er this is Teddy Jo callin’ down from Joshua Junkyards. She knows me. Tell her I was drivin’ on through Buzzard, and I saw one of them fellers she hangs out with, the shapeshifters, run like hell through the Scratches. Right below me. There was a big dog chasin’ him.”</p> <p>“How big was the dog?”</p><p>Teddy Jo mulled it over. “I’d say as big as a house. A one-story. Maybe a bit bigger. Not as big as one of them colonials, you understand. A regular-person house.”</p><p>“Would you say the shapeshifter was in distress?”</p><p>“Hell yeah, he was in distress. His tail was on fire.”</p><p>“He ran like his tail was on fire?”</p><p>“No, his tail was on fire. Like a big, furry candle on his ass.”</p><p>Bingo. Green five, shapeshifter in dire distress. “Got it.”</p><p>“Well, you tell Kate I said hello and not to be a stranger and all that.”</p> <p>He hung up.</p><p>I grabbed my gun belt and sent a focused thought in the direction of Maxine, the Order’s secretary. I had no telepathic abilities whatsoever, but she was strong enough to pick up a thought if I concentrated hard enough. “Maxine, I have a green five in progress. I’m responding.”</p><p>“You have fun, dear. I hope you get to kill something,” Maxine’s voice said in my head. “By the way, do you recall that nice young man whose calls you aren’t taking?”</p><p>Raphael. He wasn’t exactly the type of man a woman would forget. “What about him?”</p><p>“He usually calls for you twice a day, at ten and at two. He hasn’t phoned today. At all.”</p><p>I killed a twinge of disappointment. “Perhaps he got the message.”</p><p>“Could be. Just thought you would like to be aware.”</p><p>“Thanks.” Raphael was trouble. And I had enough trouble as it was.</p><p>I picked up my favorite pair of P226s and ducked into the armory, where I kept my assortment of guns. As big as a house, huh? I took my Weatherby Mark V rifle off the rack, petting the hand-laminated fiberglass-and-Kevlar stock. A classic. When you absolutely have to have a job done correctly, use the best tool for it. There was only one weapon with more stopping power in the armory. Referred to as Big Unit by male knights, and Boom Baby by me, it sat in a glass case all by itself. Boom Baby ate Silver Hawks: .50 armor-piercing, incendiary, explosive, silver-load cartridges. To get Boom Baby out of its case, I’d have to show a lot of probable cause. That was fine with me. The Weatherby would more than do the job.</p><p>I grabbed .416 Remington Magnum cartridges and headed out the door, before somebody decided to stop me.</p><p>In our age, a woman could have a gasoline car, which worked only during tech, or a vehicle that ran on charged water, which worked only during magic. My Jeep was Order issue and equipped with an electric engine and a magic one, so it functioned during both tech and magic. Unfortunately, it didn’t function very well.</p><p>The engine started on the fourth try. I hopped in and steered out of the parking lot, joining a steady stream of riders and carts heading west. Mine was the only hoof-free transport on the street. The rest consisted of horses, mules, donkeys, and oxen.</p><p>The city lay in ruins. Heaps of dusty rubble and small mountains of broken glass marked the locations of once stately office buildings, ground to dust by magic’s relentless jaws. Atlanta grew around them. New apartment buildings, built by hand rather than machine, sprouted atop the carcasses of the old ones. Stone and wood bridges spanned the gaping drops of crumbled overpasses. Small stalls and open markets replaced Wal-Mart and Kroger. The old Atlanta might have fallen like the trunk of a great tree struck by lightning, but its roots were too strong to die.</p><p>I liked the city. I wasn’t born here, nor did I come to Atlanta by choice, but now the city was my territory. I had walked its streets, sampled its scents, and listened to it breathe. Atlanta wasn’t sure about me. It tried to kill me every now and then, but I was confident we’d come to an understanding eventually.</p><p>Forty minutes later I turned off the main road on James Jackson Parkway and followed it around the bend to Buzzard’s Highway. When magic was up, it flooded deep in this part of the city. Tall trees flanked the road, huge pines and dogwoods, still green despite the impending October. A twisted metal sign slid by: the white letters spelling out SOUTH COBB DRIVE, all but covered by BUZZARD scrawled in black paint. Pale wind chimes, made of turkey vulture skulls and string, hung from the tree limbs overshadowing the road. A cheerful welcome. Not quite sure what they were trying to tell me. My goodness, could it be some sort of a warning?</p><p>My Jeep slid onto an old bridge over the Chattahoochee River. The old maps claimed that heading north would bring me into Smyrna and turning southwest would deliver me to Mableton, but neither any longer existed.</p><p>I crossed the bridge and pulled over to the side of the road. A vast network of ravines lay before me. Narrow, twisted, some a hundred yards deep, although most were shallow, they tangled together and veered apart, like tunnels of a giant dirt-eating termite. Here and there remnants of the old buildings perched, halfway down the slopes, flanked by sickly brush. A highway cut through the ravines, running atop the cliff tops, interrupted with wooden patches of bridges. Above it all, black-winged vultures glided on the aerial currents.</p><p>The locals called it the Scratches, because from above the place looked like a giant buzzard had scratched in the dirt. The Scratches came into being after the very first flare, when the magic returned to the world in a three-day wave of disasters and death. With every magic wave, the ravines grew a little deeper.</p><p>Far to the south, the Scratches united into a gorge that eventually became Honeycomb Gap, another hellish magic spot. The highway itself served as the favorite drag-racing spot for idiot juvenile delinquents. Somewhere in this mess of soil and air was my green five, the shapeshifter in distress. Hopefully still alive and nursing a singed tail.</p><p>Atlanta housed one of the largest shapeshifter societies in the country. The Pack, as it was known, counted over fifteen hundred members, subdivided into seven clans according to their animal forms. An alpha couple ruled each clan. The fourteen alphas made Pack Council, presided over by Curran, the Beast Lord of Atlanta. Curran wielded unbelievable power and ultimate authority. He was the Alpha.</p><p>To understand the Pack, one had to understand the shapeshifters. Caught on the crossroads between animal and human, they could give in to either one. Those who surrendered to the animal side began the catastrophic descent into delirium. They reveled in perversion and cruelty and gorged themselves on human flesh, raping and murdering until people like me put them down like rabid dogs. They were called loups, and they were killed as soon as they were discovered.</p><p>To remain human, a shapeshifter had to live his life according to a very strict mental regimen detailed in the Code, a book of rules, which praised discipline, loyalty, obedience, and restraint. A shapeshifter knew no higher calling than to serve the Pack, and Curran and his Council took the idea of service a step further. All shapeshifters underwent martial arts training, both as individuals and in squads. All learned to channel their aggression, to handle being shot with silver bullets, to use weapons and firearms. Coupled with their numbers, their strict discipline, and their high degree of organization, having the Pack in the city was like living next to a thousand and a half highly skilled professional killers with enhanced senses, preternatural strength, and power of regeneration.</p><p>The Order found the Pack’s presence very troubling. The shapeshifters didn’t trust the Order, and rightfully so—the knights viewed each shapeshifter as a monster waiting to happen. So far Kate was the only agent of the Order who had managed to earn their trust, and they preferred to deal exclusively through her. Getting a shapeshifter out of a bind would go a long way toward improving my standing with both organizations. At least on paper.</p><p>I put the parking brake on and walked upwind from the Jeep. Hard to smell anything with the exhaust fumes searing the inside of my nose. Teddy Jo had probably exaggerated the dog’s size—eyewitnesses usually did—but even if it was as large as a “regular-person house,” finding it in the labyrinth of the ravines would prove tricky. The highway didn’t just run straight. It veered and split into smaller roads, half of which led nowhere; the other half ended up rejoining Buzzard. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I crouched on the edge of the ravine and let the air currents tell me a story. A touch of sickeningly sweet rot of decomposing flesh and the odd, slightly oily stink of vultures eating it. Twin musk of two feral cats enjoying a bit of competitive spraying over each other’s marks. A harsh bitterness of a distant skunk. The scent of burning matches.</p><p>I paused. Sulfur dioxide. Quite a bit of it, too. It was the only scent that didn’t fit the usual odors of animal life. I returned to the Jeep and followed the matches north. There were times when my secret self came in handy.</p><p>The stench of burning sulfur grew stronger. A low growl rolled through the ravine below, dissolving into heavy wet panting, followed by a frustrated layered yelp, as if several dogs had whined in unison.</p> <p>I guided the Jeep along the edge of the ravine and peered down. Nothing. No giant dogs, just a shallow twenty-five-foot gap with a bit of scarce shrubs and trash at the bottom. A broken rusted fridge. The remains of a couch. Multicolored dirt-stained rags. A house had apparently thrown up down the slope and now perched in a ruined heap on the edge, where the ravine veered left.</p><p>An excited snarl rumbled through the Scratches, the deep primeval sound of an enormous beast giving chase. The hairs on the back of my neck rose. I stood on the brakes, swiped the Weatherby from the seat, and jumped out, taking position on the edge.</p><p>A shaggy shape exploded from around the bend of the ravine. Saffron-colored with a sprinkling of dark spots on its sloped back, the animal flew over the refuse, the muscles of its powerful forequarters pumping hard. A bouda. Shit.</p><p>The werehyena saw me. A cackle of trilling terrified laughter exploded from its muzzle.</p><p>Please don’t be Raphael. Please don’t be Raphael. Please . . .</p> <p>The bouda veered toward me, changing in midleap. Its body snapped, twisting like a broken doll. Bones thrust out of the flesh, muscles sliding up the new powerful limbs, a carved chest, and a humanoid torso. The beast’s jaws exploded, growing disproportionately large, its face flattened into a grotesque semblance of human, its forepaws stretched into hands that could enclose my entire head. A bouda in a warrior form, a monster halfway between hyena and man. For a shapeshifter, to assume this form was a victory, to make it proportional was an achievement, and to speak in one was an art.</p><p>The werehyena’s jaws gaped open, displaying three-inch fangs. A bloodcurdling scream ripped from him. “Drive away, Andrea! Drive!”</p><p>Raphael. Damn it.</p><p>“Don’t panic.” I sighted the bend through the scope. “I have it under control.” A thing that sent a bouda in warrior form running, especially one as crazy and lethal as Raphael, had to be treated with respect. Fortunately, the Weatherby delivered respect in a Magnum cartridge. It would stop a rhino at full gallop. It sure as hell would handle an oversized dog.</p><p>The ground shook as if from blows of a giant hammer. The refuse on the ravine’s floor jumped in place.</p><p>A colossal thing burst from around the bend, nearly level with the ravine’s wall. Blood-red and massive, it slid on the trash and crashed into the curve. The impact shook the slope. The remnants of a house quaked and slid down in a shower of bricks, bouncing from the creature’s three canine heads.</p> <p>A twenty-foot-tall three-headed dog. Whoa. This was quite possibly the coolest thing I’d ever seen through the scope of a rifle.</p><p>The dog shook, flinging rubble from his fur. Thick, deep-chested, built like an Italian mastiff, it gripped the ground with four massive paws and charged after Raphael. Behind it a long whiplike tail lashed, the barb on its end shaped like a snake’s head. The mouths of its three heads hung open, displaying gleaming fangs longer than my forearm. Three forked serpentine tongues hung out as it thundered to us, flinging foam from between the horrid teeth. The drops of drool, each big enough to fill a bucket, ignited in midair.</p><p>It was built too thickly. The bullet might not penetrate.</p><p>However, I didn’t need to kill it. I just had to delay it long enough for the knucklehead to reach me. I sighted the muzzle of the center head. The nose shot would deliver maximum pain.</p><p>“Run, damn you!” Raphael howled, scrambling up the slope toward me.</p><p>“There’s no need to scream.” Excitement buoyed me, the ancient thrill of a hunter sighting his prey. The beast’s dark nose danced in my scope.</p><p>Steady. Aim. Breathe. You have time.</p><p>A triple snarl ripped from three huge maws.</p> <p>Gently, slowly, I squeezed the trigger.</p><p>The Weatherby spat thunder. The recoil punched me in the shoulder.</p><p>The dog’s middle head jerked. The Weatherby’s magazine held two rounds and one in the chamber. I sighted and fired again. The middle head drooped. The beast yowled and spun in pain. Perfect. The Weatherby wins again.</p><p>In a desperate leap, Raphael launched himself up the slope toward me. I caught his arm and hauled him up. We dashed to the Jeep. I hopped into the driver’s seat, Raphael landed in the passenger’s, and I floored the gas pedal.</p><p>A howl of pure frustration shook the highway. In the rearview mirror the dog sailed out of the ravine as if it had wings and landed on the road behind us.</p><p>“Faster!” Raphael snarled.</p><p>I drove, squeezing every last drop out of the Jeep’s old engine. We hurtled down the highway at a breakneck speed. The dog gave chase with a triumphant howl that shook the ground beneath the car wheels. It closed the space between us in three great bounds and bent down over the car, its mouths opened wide. The foul, corrosive breath washed over me. Raphael jumped up and snarled back, his hackles up. Burning drool hit the backseat, singeing the upholstery in an acrid stench of melted synthetics.</p><p>I swerved, taking a sudden turn onto a wooden bridge and almost sending the Jeep off the edge into a gap. Monstrous teeth snapped a foot from the backseat.</p><p>The dog snarled. In the rearview mirror I saw its muscles bunch as it gathered itself for a leap. Before me, Buzzard’s Highway ran straight and narrow, ravines on both sides. Nowhere to go. That’s it, we’re done.</p><p>Inside me, an animal raked at my flesh, trying to spill out of my skin. I clenched my teeth and stayed human.</p><p>The dog jumped. Its huge body flew toward us and then jerked back, as if an invisible leash had snapped, reaching its full length. The giant canine fell, its paws waving clumsily in the air. In the rearview mirror I saw it rise. Its bark rang through the Scratches. The dog barked again, whined, and jumped back into the ravine.</p><p>I slowed to a speed that would let me make a turn without sending us to a fiery death in the gap below. “You! Explain!”</p><p>In the seat next to me Raphael shuddered. Fur melted into smooth human skin, stretched taut over a heartbreakingly beautiful body. Coal-black hair spilled from his head to his shoulders. He looked at me with smoldering blue eyes, smiled, and passed out.</p><p>“Raphael?”</p><p>Out cold. With magic down, changing shape took a lot of effort and combined with the strain of that run, Lyc-V, the shapeshifter virus, had shut him down for a rest.</p><p>I growled under my breath. Of course, he could’ve stayed conscious had he not changed into a human. But he knew that if he shifted shape, he would pass out on the seat next to me, nude, and I would be forced to stare at him until he slept it off. He had done it on purpose. The werehyena Casanova strikes again. I was getting really tired of his ridiculous pursuit.</p><p>Ten minutes later I pulled into an abandoned Shell station and parked under the concrete roof shielding the pumps.</p><p>I hugged my rifle and listened. No snarls. No growling. We were in the clear.</p><p>My heart hammered. I tasted a bitter patina on my tongue and squeezed my eyes shut. A delayed reaction to stress, nothing more.</p><p>Inside, my secret self danced and screamed in frustration. I chained it. Control. In the end it was all about control. I had learned to impose my will over my body in childhood—it was that or death—and years of mental conditioning in the Order’s Academy had reinforced my hold.</p><p>Breathe. Another breath.</p><p>Calm.</p><p>Gradually the bestial part of me settled down. That’s it. Relax. Good.</p><p>All shapeshifters struggled with their inner beast. Unfortunately, I wasn’t an ordinary shapeshifter. My problems were a lot more complicated. And the presence of Raphael only aggravated them.</p><p>Raphael sprawled next to me, snoring slightly. Until he awoke, speculating on why a giant three-headed dog with burning drool had chased after him would be pointless.</p><p>Look at him. Napping without a care in the world, confident I would be watching him. And I was. I had met handsome men in my life, some born with classically perfect features and the physique of Michelangelo’s David. Raphael was not one of these men, and yet he left them all in the dust.</p><p>He had his good qualities: the bronze skin, the masculine jaw, the wide sensuous mouth. But his face was too narrow. His nose was too long. And yet when he looked at women with those dark blue eyes, they lost all common sense and threw themselves at him. His face was so interesting and so . . . carnal. There was no other word for it. Raphael was all tightly controlled, virile sensuality, heat simmering just beneath the surface of his dusky skin.</p><p>And his body took my breath away. He was built lean, with crisp definition, proportionate and perfect with wide chest, narrow hips, and long limbs. My gaze drifted down to between his legs. And hung like a horse.</p><p>He had been kind to me, more kind than I probably deserved. The first time, when my body betrayed me, he and his mother, Aunt B, saved my life by guiding me back into my shape. The second time, when my back was pierced by silver spikes, he held me and talked me through pushing them out of my body. When I thought back to those moments, I sensed tenderness in him and I wanted very badly to believe it was genuine.</p><p>Unfortunately, he was also a bouda. They had a saying about werehyenas: fourteen to eighty, blind, crippled, crazy. Boudas would screw anything. I had witnessed it firsthand. Monogamy wasn’t in their vocabulary.</p><p>Raphael had seen the true me and he’d never come across anyone similar. To him I was the TWT-IHFB. That Weird Thing I Haven’t Fucked Before.</p><p>The more I thought about it, the madder I got. He could speak in a warrior form just fine. Had he stayed awake, I would’ve gotten the whole explanation from him by now. Not to mention that if something attacked us, I’d be left to defend a limp man who outweighed me by about eighty pounds. What exactly was I supposed to do with him? Did he expect me to sigh heavily while admiring his naked body? Or perhaps I was supposed to take advantage of the situation? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I reached into the glove compartment and got out a Sharpie. Taking advantage of the situation didn’t sound bad at all.</p><p>An hour later Raphael stretched and opened his eyes. His lips stretched in an easy smile. “Hey. Now that’s a beautiful sight to wake up to.”</p><p>I leveled my SIG-Sauer at him. “Tell me why the nice puppy was chasing you.”</p> <p>He wrinkled his nose and touched his mouth. “Is there something on my lips?”</p><p>Yes, there is. “Raphael, concentrate! I know it’s hard for you but do try to stay on target. Explain the dog.”</p><p>He licked his lips and my thoughts went south. Andrea, concentrate! Try to stay on target.</p><p>Raphael remembered to look cool and leaned back, presenting me with the view of a spectacular chest. “It’s complicated.”</p><p>“Try me. First, what are you even doing here? Aren’t you supposed to dragging around giant rocks right now?” About six weeks ago, the lot of us had entered the Midnight Games, an illegal, to-the-death fighting tournament. We did it to prevent a war against the Pack. Both the Order and Curran, the Beast Lord, took a rather dim view of this occurrence. As a result, Kate was on medical leave, and the Beast Lord, who had actually ended up participating in the tournament with us, had sentenced himself and the rest of the involved shapeshifters to several weeks of hard labor building an addition to the Pack’s citadel.</p> <p>“Curran released me due to family hardship,” Raphael said.</p><p>Not good. “What happened?”</p><p>“My mother’s mate died.”</p><p>My heart jumped. Aunt B was . . . she was kind. She saved my life once and she kept my secret to herself. I owed her everything. And even if I hadn’t, I felt nothing but respect for her. Among boudas, as in nature among hyenas, the females ruled. They were more aggressive, more cruel, and more alpha. Aunt B was all that, but she was also fair and smart and she didn’t tolerate any nonsense. When you’re the alpha of a bouda clan, you have a lot of nonsense thrown at you.</p><p>Had I grown up under Aunt B instead of the bitches who ruled my childhood, perhaps I wouldn’t be so messed up.</p><p>“I’m so sorry.”</p> <p>“Thank you,” Raphael said and looked away.</p><p>“How is she holding up?”</p><p>“Not that well. He was a very nice man. I liked him.”</p><p>“What happened?”</p><p>“Heart attack. It was quick.”</p><p>Shapeshifters almost never died of heart complications. “He was a human?”</p><p>Raphael nodded. “They’ve been together for almost ten years. She met him shortly after my father died. The service was set for Friday. Someone stole his body from the funeral home.” A low growl laced his words. “My mother didn’t get to say good-bye. She didn’t get to bury him.”</p><p>Oh God. I gritted my teeth. “Who took the body?”</p> <p>Raphael’s face turned grim. “I don’t know. But I’m going to find out.”</p><p>“I want in on it. I owe your mother.” Aunt B had a right to bury her mate. Or bury the thing that took her mate’s body. Either way worked for me.</p><p>He grimaced. “Did you smell matches?”</p><p>I nodded. “It’s the dog.”</p><p>“Yeah. I picked up this scent at the funeral home and trailed it here. There was something else under it, but the dog stink is so damn acrid, it drowns everything else.” Raphael gave me a hard look.</p><p>I motioned with my fingers. “Give.”</p><p>“I thought I smelled a vampire.”</p><p>A giant three-headed dog was bad news. A vampire was much, much worse. The Immortuus pathogen, the bacterial disease responsible for vampirism, killed its victim. Vampires had no ego, no self-awareness, no ability to reason. They had the mental capacity of a cockroach. Ruled by insatiable bloodlust, they killed anything that bled. If left to their own devices, they’d wipe out life on Earth and then cannibalize themselves. But their empty minds made a perfect vehicle for the will of a navigator, a necromancer, who piloted a vampire like a marionette, seeing through its eyes and hearing through its ears. Necromancers came in several varieties, the most adept of which were called Masters of the Dead. A vampire piloted by a Master of the Dead could destroy a platoon of trained military personnel in seconds.</p><p>And 99 percent of the Masters of the Dead were members of the People. The People were bad, bad news. Set up as a corporation, they were organized, wealthy, and expert in all things necromantic. And very powerful.</p><p>“Do you think the People stole the body?”</p><p>“I don’t know.” Raphael shrugged. “I thought I’d throw it out there, before you jump in with both feet.”</p><p>“I don’t care. Do you care?”</p><p>“Fuck no.” Raphael’s eyes glinted, making him look a bit deranged.</p><p>“Then we’re in agreement.”</p><p>We nodded to each other.</p><p>“So you tracked the sulfur scent here, then what?” I asked.</p><p>“I ran into Fido. He chased me into a crevice. I sat there for about an hour or so, and then he wandered off and I ran the other way. Apparently, he didn’t wander off far enough. What kind of creature is Fido, incidentally?”</p><p>“I have no idea.”</p><p>All of my training had been in contemporary applications of magic. I could recite the vampiric biocycle off the top of my head, I could diagnose loupism in early stages, I could correctly identify the type of pyromagic used from burn pattern, but give me an odd creature and I drew a complete blank.</p><p>“Who would know?” Raphael asked.</p><p>We looked at each other and said in unison, “Kate.”</p><p>Kate had a mind like a steel trap, and she pulled absurdly obscure mythological trivia out of her hair. If she didn’t know something, she would know who would.</p><p>I pulled a cell phone out of the glove compartment. There was only one functioning cellular network. It belonged to the military and as a knight of the Order and an officer of peace, I had access.</p><p>I stared at the phone.</p><p>“Forgot the number?” Raphael asked.</p><p>“No. Thinking how to phrase this. If I say the wrong thing, she’ll be dashing down to the ley line in minutes.” Kate had never met a person she didn’t want to protect, preferably by hacking at the hostile parties with her sword. But Kate was also human and needed the rest.</p><p>Raphael gave me a dazzling smile. My heart skipped a beat. “Could it be that you want some alone time with me?”</p><p>I dropped the safety off my gun.</p><p>He raised his hands palms out, still grinning like an idiot.</p><p>I put the safety back on and dialed the number.</p><p>“Kate Daniels.” My best friend’s voice filled my ear.</p><p>“Hey, it’s me. How’s your stomach?”</p><p>“Stopped hurting. What’s up?”</p><p>“I need to ID a twenty-foot-tall three-headed dog with blood-red fur and burning spit.” That’s right, routine, casual, business as usual, I encounter giant three-headed dogs every day . . .</p><p>A small silence filled the phone.</p><p>“Is everything okay?” she asked.</p><p>“Everything is fine,” I assured her, smiling brightly at the phone, as if she could see me. “Just need an ID.”</p><p>“Does the tail look like a snake?”</p><p>I considered the long, whip-thin tail with a barb on the end. “Sort of.”</p><p>“Are you in the office?”</p><p>“No, I’m in our Jeep, out in the field.”</p><p>“Look under the passenger seat in a black plastic bin. There should be a book.”</p><p>Raphael hopped out, dug under the seat, and pulled out a dog-eared copy of The Almanac of Mystical Creatures.</p><p>“Got it,” I said into the phone.</p><p>“Page seventy-six.”</p><p>Raphael flipped the book open and held it up. On the left page a lithograph showed a three-headed dog with a serpent for a tail. The caption under the picture said CERBERUS.</p><p>“Is that your dog?” Kate asked.</p><p>“Could be. How the heck did you know the exact page?”</p><p>“I have perfect memory!”</p><p>I snorted.</p><p>She sighed into the phone. “I spilled coffee on that page and had to leave the book open to dry it out. It always opens to that entry now.”</p><p>I examined the dog. “It definitely looks similar. Ours was bigger.”</p><p>“Ours? Who is there with you?”</p><p>“Raphael.”</p><p>Kate’s voice snapped. “I’ll be in Atlanta in three hours. Where are you?”</p><p>“I said it’s nothing major.”</p><p>“Bullshit. You wouldn’t work with Raphael unless the Apocalypse was imminent and that was the only way to prevent it.”</p><p>Raphael put his hands over his face and shook, making choking sounds that suspiciously resembled laughter.</p><p>“Hardy har har,” I growled. “We’re completely fine on our own, thank you very much. If you want to help, tell me more about Cerberus.”</p><p>“He belongs to Hades, god of the Greek underworld, where souls spend their afterlife. His primary function is to guard the front entrance. Also Hades occasionally sends him on an errand, according to myths. He’s supposed to hate sunlight.”</p><p>“This one had no trouble with the sun. Can you think of any possible reason he would manifest?”</p><p>“Well, a defilement of Hades’ shrine might do it. But Hades didn’t exactly have shrines. The ancient Greeks were scared to death of him. They averted their faces when sacrificing to Hades. They refused to even say his name. So I’m not sure.”</p><p>“Thanks.”</p><p>“You sure you don’t need me to come?”</p><p>“Positive.”</p><p>“Call me if anything.”</p><p>I hung up and looked at Raphael. “Your mother’s mate, what was his name?”</p><p>“Alex Doulos.”</p><p>“Was he a Greek pagan?”</p><p>A frown twisted Raphael’s face. “I have no idea. It didn’t come up. We had a careful relationship. He didn’t try to be my dad and I didn’t try to be his son. We met at holiday dinners and talked about sports mostly. It was a safe topic. What are you thinking?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I shook my head. “I’m trying very hard not to think anything. I’m just collecting data at this point. Did you see the way Fido fell?”</p><p>“Like he was on a leash and it ran out.” Raphael drummed a quick rhythm on the dashboard.</p><p>“It probably means he’s somehow bound to a specific area. I think we should go and look at it.”</p> <p>“I’m game.” Raphael shivered. “I don’t suppose you have any spare clothes?”</p><p>“You should’ve thought of clothes before you decided to go human.”</p><p>The sinful smile was back. “I always dreamt of being naked with you. Couldn’t pass up the chance.”</p><p>I started the Jeep. “Could you get any more full of yourself?”</p><p>“I’m mostly interested in getting you full of me.”</p> <p>The vision of being full of Raphael zinged through my brain, short-circuiting rational thought. “Come to think of it, there is something on your lips. Why don’t you use that side mirror over there to check it out?”</p><p>He glanced into the side mirror and stared, slack-jawed. His lips were solid black. A thick black line of guy liner outlined his deep-set eyes and a little black tear dripped down his left cheek-bone. He touched his cheek, stretching the skin to better examine the tear, his face a flat mask, glanced at me, and exploded with laughter.</p><p>I stood atop the Jeep’s hood and slowly swept the vast network of ravines with binoculars. The Jeep itself sat on the edge of a shallow gap, just beyond the spot where Cerberus almost took a bite out of our backseat. Raphael, still gloriously naked, sat in the passenger seat and plucked random Hades-related trivia from the book.</p><p>“A fun guy, this Hades. Apparently he bridenapped his wife.”</p><p>“Things were much simpler in ancient Greece if you were a god. I’m sure he got himself a harem of mistresses, too.” The wind swirled with Raphael’s scents: the light musk of his sweat, the delicious redolence of his skin . . . I was having trouble concentrating.</p><p>“No,” Raphael said, flipping a page. “Actually, Hades didn’t screw around. His wife was the daughter of Demeter, goddess of youth, fertility, and harvest. After Hades stole Persephone, Demeter refused to let the plants grow, starving everyone, and they had to reach a compromise: Persephone spends half of the year with him and half with her mother. The guy only had her for six months out of the year, and he still remained faithful. That must be some sweet sex right there.”</p> <p>I took the binoculars down so I could roll my eyes. “Do you ever think of anything but sex?”</p><p>“Yes, I do. Sometimes I think of waking up next to you. Or making you laugh.”</p><p>I was beginning to regret this.</p><p>“Of course, I do occasionally get hungry . . .” he added. “And cold.”</p><p>A white speck caught my eye. I adjusted the binoculars. A house. A two-story colonial, seemingly intact, sitting in the bottom of a ravine. I could only see the roof and a small slice of the upper story.</p><p>Interesting.</p><p>“Kate was right: the Greeks lived in fear of this guy. Instead of speaking his name, they called him the Rich One, the Notorious One, the Ruler of Many, and so on. Despite his sour disposition, he was considered to be a just god. The one sure way to piss Hades off was to steal one of the shades—souls—from his realm or to somehow avoid death. This dude Sisyphus apparently finagled a way out of death a couple of times, and Hades had it and made him drag an enormous boulder up a mountain. Every time Sisyphus almost gets to the top, the boulder rolls down and he has to do it all over. Thus the term ‘Sisyphean task.’ Huh. I never knew that’s where it came from.”</p><p>He showed me a page. On it a man and a woman sat side by side on simple thrones. To one side of the pair stood Cerberus. To the other an angel with black wings and a flaming sword.</p> <p>“Who is that?”</p><p>“Thanatos. Angel of death.”</p><p>“Didn’t know the Greeks had angels.” I turned back to watching the house. And just in time, too. Cerberus trotted out of the ravine to the left of the house. I could barely see his back. He passed by the building and began to circle it.</p><p>“I see a house,” I said.</p><p>Raphael landed next to me with inhuman agility. I passed the binoculars to him and he straightened, almost a foot taller than me. Standing next to him was a trial: his scents sang through me, the warmth of his body seeped through my clothes, and his skin practically glowed. Everything about him said “mate” to me. It wasn’t rational. It was the animal me, and I had to be better than that.</p><p>“I’ll be damned,” he said softly. “Here is Fido. Going round and round. I wonder what’s in that house?”</p><p>“I wonder why he doesn’t just go in and get whatever it is.”</p><p>“I think we should find out. Andrea?”</p><p>“Yes?” I wished he would stop saying my name.</p><p>“Why are your eyes closed?”</p><p>Because you’re standing next to me. “It helps me think.”</p><p>I felt the heat wash over me and knew he had leaned to me. His voice was a soft masculine rasp, entirely too intimate. “I thought you were trying not to think.”</p><p>I opened my eyes and found the deep smoldering blue of his irises right next to me. I lifted my index finger and pushed his chest. He slid on the Jeep’s hood, distorted by the charged-water engine underneath, and had to jump off, landing with the grace of a gymnast on the ground.</p><p>“Personal space,” I told him. “I protect mine.”</p><p>He simply smiled.</p><p>“How do we get to the house with the dog making shark circles around it?” I asked.</p><p>“Fido doesn’t see that well,” Raphael said. “It took him a while to find the crevice where I was hiding before, and he had to sniff me out. We fool his nose by masking our scent, we can probably get close enough.”</p><p>“And how do you propose to do that?”</p><p>“The old-fashioned way.”</p><p>I sighed. “Which would be?”</p><p>Raphael shook his head. “You really don’t know?”</p><p>“No, I don’t.”</p><p>He trotted off to the side and dived into a ravine. I waited for a couple of minutes, and he emerged, carrying two dark objects, and tossed one of them to me. Reflexively I caught it even as the reek lashed my nostrils. A dead, half-decomposed cat.</p><p>“Are you out of your mind?”</p><p>“Some people roll in it.” He grabbed the dog carcass and ripped it in a half. Maggots spilled. He shook them out. “I prefer to tear them and tie pieces on myself. But if you would prefer to rub it all over your skin, you can do that, too.”</p><p>All my fantasies of touching him evaporated into thin air with a small pop.</p><p>“Hunting one-oh-one,” he said. “Didn’t your pack ever do the hunts in Texas?”</p><p>“No. I wasn’t in that kind of pack.” And I had fought my way out of shapeshifter society before it was too late.</p><p>My face must’ve showed my memories, because he paused. “That bad?”</p><p>“I don’t want to talk about it.”</p><p>Raphael reached to the backseat and pulled a roll of cord we kept there. He uncoiled a foot-long piece and tore the tough hemp rope like it was a hair. “You don’t have to do it,” he said. “I keep forgetting you’re not—”</p><p>Not what? Not normal? Not like him?</p><p>“—properly trained. I’ll be back shortly.”</p><p>He wasn’t better than me. Whatever he could handle, I could deal with as well.</p><p>I picked up the roll of twine. If I had been straight bouda, like my mother, I would’ve enjoyed all of the enhancements Lyc-V brought, but even though I wasn’t as strong as a regular shapeshifter, I could handle the damn rope. I tore a piece, sighed, and pulled the cat apart.</p><p>“It’s a good thing I’m part hyena,” I murmured, moving along the bottom of the ravine. Bits of the cat corpse dangled from me, strategically positioned on my limbs and suspended from a cord off my neck. To a human nose, all decomposition odors were similar, but in reality each corpse gave off its own specific scent just as it did in life. And this particular carcass reeked of something nauseatingly sour. “If I were a cat, I’d probably die of the stink and the sheer indignity.”</p><p>“You know who can’t handle it?” Raphael scrambled up the slope like a gecko. “Doolittle.”</p><p>“The Pack’s doctor?” Even carrying my Weatherby, I made it out of the ravine faster than he did. What I couldn’t match in strength, I made up in agility and speed.</p><p>“Yeah. Badgers are very clean. In the wild, foxes sometimes steal badger burrows by sneaking into them and crapping all over the place. The badger is so prissy, he’d rather dig a new burrow than clean his old one up. Doolittle will do open-heart surgery if he has to, but hand him a chunk of a putrid cadaver and he’ll run for the hills.”</p><p>An echo of a growl washed over us. He clamped his mouth shut. We’d reached the dog’s hearing range.</p><p>A few minutes later we went aground on the edge. Several ravines converged here, forming a gap almost wide enough to enclose a football field. The house sat in the center of the gap. Two stories high, with a row of white columns supporting a triangular roof, it looked at us with twin rows of windows blocked by dark shutters. Its black front door stood closed and so did the doors of the cellar on the left side. A ten-foot-tall fence topped with coils of barbed wire guarded the house.</p><p>As we watched, Cerberus trotted out of the ravine. He whined softly, spit dripping in burning clumps of foam from between his fangs, and inched toward the fence. The left head stretched on his shaggy neck and sniffed at the mesh. A blue spark jumped from the metal to his nose. Cerberus yelped, clawed the ground in frustration, and trotted off.</p><p>Electrified fencing. Peculiar. No wires stretched to the house, so the power must have come from inside. I strained and heard the faint hum of a generator.</p><p>The doors to the cellar rose slowly. Something squirmed beneath them, something pale. The right half of the cellar door fell open and a creature leapt into the open. Its gaunt, vaguely humanoid body had lost every iota of its hair and fat long ego. Thick, bloodless skin sheathed the dry cords of its muscles, every rib distinct beneath its leathery hide. Its stomach was hard and ridged. Huge yellow claws tipped the fingers of its hands and its long toes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A vampire. And where there was a vampire, there had to be a navigator. I raised the binoculars to my eyes.</p><p>The vampire’s face was horrible, a death mask sculpted with human features devoid of emotion, intellect, and self-awareness. The creature paused, perched on the edge of the cellar entrance. It unhinged its maw, displaying twin sickles of yellow fangs, leapt straight up, and clutched on to the wall of the house like a fly. The vamp scuttled up the wall, ran along the dark roof to the white stub of the chimney, and hopped in like some nightmarish Santa.</p><p>We could possibly deal with the electric fence. But a vampire would prove problematic. We had no way of knowing how many of them were in that house. Two would present a challenge. Three would be suicide. Especially if magic hit.</p> <p>“Andrea?” Raphael’s voice was a soft cloud of warmth in my ear.</p><p>I glanced at him. What?</p><p>“Did you like the thing I left for you?”</p><p>The thing? Oh. The thing. Shapeshifters had an odd way of courtship. Mostly it involved proving to your prospective mate what a stealthy and sleek operator you were by prancing in and out of her territory. Because all of the land belonged to the Pack overall, “territory” came to be defined as the potential mate’s house. Most shapeshifters broke in and left presents, but boudas had an odd sense of humor. They broke into the houses of their intended and played practical jokes.</p><p>Raphael’s father glued Aunt B’s furniture to the ceiling. Raphael’s uncle lock picked his way into Raphael’s aunt’s house, flipped all the doors around, and hung them back on their hinges so the handles were inside. In fine bouda tradition, Raphael somehow snuck away during the Midnight Games, broke into my apartment, and left me the thing.</p> <p>“You want to know that now?” I hissed in a fierce whisper.</p><p>“Just tell me yes or no?”</p><p>“Do you really think this is the best time?”</p><p>His eyes flashed with red. “There might not be any other time left.”</p><p>I turned and saw Cerberus crouching in the ravine behind us. He stood there absolutely still, the three pairs of his eyes fixed on us with baleful fury.</p><p>I turned very slowly to Raphael.</p> <p>“Did you like the thing?” he asked with quiet desperation.</p><p>“Yes. It was funny.”</p><p>He grinned, his face made unbearably handsome by the flash of his smile.</p><p>With a deafening growl, Cerberus charged us. Fur sheathed the monstrous bloom of Raphael’s jaws. I flipped on my back.</p><p>Cerberus’s center head dove at me, his black maw gaping, ready to swallow me whole.</p><p>I fired.</p><p>The first shot punched the back of the dog’s mouth. It yelped and I sank two more in the same spot. Flesh exploded and I saw sky through the hole where the back of the beast’s throat used to be. The head drooped down. I rolled clear just as an enormous paw clawed the spot where I had dropped. The smallest claw grazed my side and leg, ripping the clothes in a hot flash of pain.</p><p>I leapt to my feet. The left head dove for me and missed as Raphael launched himself into the air, slicing Cerberus’s nose with his claws. Cerberus jerked back and Raphael clutched on to his muzzle. The dog shook, but Raphael clung to it, flinging bloody chunks of dog flesh to the ground.</p> <p>I backed up, reloading. Raphael carved huge clumps out of Cerberus’s muzzle in a frenzied whirl of fur and claws. Blood spurted in dark streams.</p><p>The right head snapped at him, great fangs clamping together like a bear trap. Raphael hooked his claws into the dog’s nose, dropped out of the way, swung his legs like a gymnast on a pommel horse, and smashed his clawed feet into Cerberus’s right head.</p><p>I snapped the Weatherby up, anticipating Cerberus’s recoil.</p><p>The huge head swung back, as if in slow motion, the ruby eye clear and bright.</p><p>Steady. Aim.</p><p>An ancient tie stretched between Cerberus and me, vibrating like a live wire. The bond between the hunter and her prey.</p><p>The head reared higher and higher.</p><p>I have time.</p><p>I fired.</p><p>Blood burst from the back of Cerberus’s head. The head jerked straight up, its nose pointing to the sky. Fire leaked from its ruined orbit. The flames surged, engulfing the head. As it crashed down, bouncing once on the hard dirt, Raphael leapt to the ground. Behind him the last head shuddered and fell, catching the flames. Raphael straightened, a dark demonic figure silhouetted against the orange fire, his eyes two points of red light.</p><p>If I weren’t a trained professional, I’d have fainted from the sheer overload of his badassness.</p><p>I pointed my rifle straight up, resting the butt against my hip, and put on my Order face. Move along, nothing to see here, I do this every day. I thought of blowing imaginary smoke from the rifle barrel, but the Weatherby was long and I’m barely five feet four, so I’d look pretty stupid.</p><p>Raphael strode to me. His voice was a ragged growl torn to tatters by his fangs. “Are you alright?”</p><p>I nodded. “A bit scratched up. Nothing major.”</p><p>We walked away, slowly, trying to maintain our coolness. A greasy stench of charred flesh tainted the air currents.</p><p>“That was a hell of a shot,” Raphael said.</p><p>“Thank you. That was a stunning display of hand-to-hand.”</p><p>We killed a damn Cerberus. Kate would turn green with envy.</p><p>Then the magic wave drowned us, and we paused in unison as it penetrated our bodies, awakening the inner beasts.</p><p>A bright blue glow surged from the ground. It flashed and vanished—the ward, a strong magic barrier, going active. Approaching the house during magic would be problematic. We’d have to somehow break through the ward.</p><p>A ghostly white light ignited in the wall right in front of us. It struggled free of the house and approached us, moving in sharp jerks. Its fuzzy radiance halted just before reaching the boundary of the ward and solidified into a translucent older man with kind eyes and pale hair.</p><p>I jumped back and snapped my gun up on reflex. Not that it would do anything with magic up.</p><p>A grimace strained the ghost’s face, as if he were pulling a great weight. “Raphael,” he gasped. “Not safe . . .”</p><p>A spark of magic snapped from the house. It clutched the ghost and jerked him back into the wall. Raphael lunged at the ward. The defensive spell flashed with blue, twisting a snarl of pain from his lips. I grabbed him and pulled him back.</p><p>“Is that Doulos? Your mother’s mate?”</p><p>He nodded, fury boiling in his eyes. “We must get him out!”</p><p>An odd sucking sound rolled behind us. I looked over my shoulder. Inside the ball of flames, Cerberus’s skeleton rose upright. The fire flared once more and vanished, snuffed out like a candle. Flesh spiraled up the colossal bones. Oh shit.</p><p>“Run!” Raphael snarled. We dashed down the ravine.</p><p>We were halfway to the wall when the first growl announced the hellhound giving chase.</p><p>“And you’re sure Doulos was dead?” I drove like a maniac through Atlanta’s troubled streets. Next to me Raphael licked a burn on his arm.</p><p>“He was embalmed. Yeah, pretty sure.”</p><p>“Then what was that?”</p><p>“I don’t know. A shade? A soul on its way to Hades?”</p><p>“Is that even possible?”</p><p>“We’ve been almost eaten by a giant three-headed dog. There is not a hell of a lot that I consider not possible at this point. Watch out for that cart!”</p><p>I threw the wheel to the right and barely avoided a collision with a teamster, who flipped me off. “We need a bigger gun.”</p><p>“We need a shower,” Raphael said.</p><p>“Gun first. Shower later.”</p><p>Ten minutes later I walked into the Order’s office. A group of knights standing in the hallway turned at my approach: Mauro, the huge Samoan knight; Tobias, as usual dapper; and Gene, the seasoned former Georgia Bureau of Investigations detective. They looked at me. The conversation died.</p><p>My clothes were torn and bloody. Soot stained my skin. My hair stuck out in clumps caked with dirt and blood. The reek of a dead cat emanated from me in a foul cloud.</p><p>I walked past them into the armory, opened the glass case, took Boom Baby out, grabbed a box of Silver Hawk cartridges, and walked out.</p><p>Nobody said a thing.</p><p>Raphael waited for me in the Jeep, a spotted monster smeared with blood and dirt. A fly apparently had fallen in love with a spot on his round ear, and he kept twitching it. I put Boom Baby in the backseat and hopped into the driver’s seat. Raphael yawned, displaying a pink mouth bordered with thick conical fangs. “Big gun.”</p><p>“Where do you want me to drop you off?”</p><p>The hyena man licked his lips. “Your apartment.”</p><p>“Ha. Ha. Seriously, where?”</p><p>“Your face was exposed when we fought the dog and later when we spoke to Alex’s shade. The bloodsucker saw you, which means the navigator would’ve seen you through its eyes. It’s likely the navigator knows who you are. It’s equally likely he’s doing something he isn’t supposed to in that ravine. Last I checked, stealing corpses was illegal.”</p><p>Stealing corpses was very much illegal. With magic making new and interesting things possible, the lawmakers took theft of cadavers extremely seriously. In Texas, you got more time in a forced-labor camp for stealing a corpse than you got for armed robbery.</p><p>Considering the remote location and the electric fence, it was highly likely someone was up to no good. If it had been a legitimate operation of the People, we would’ve been approached by a human or vampiric sentry. Because of our law enforcement status, all navigators knew the knights of the Order by sight and recognized that we were an annoyingly persistent lot. The People would’ve made contact to convince me they weren’t involved in anything illegal and get me to go away.</p><p>Since they didn’t, either whatever was taking place in that house was too dirty for the People to admit their ownership of it, or it didn’t involve the People at all. The second possibility meant greater danger. For all of their nauseating qualities, the People were tightly regulated and mostly law-abiding. For now, anyway. They wouldn’t dare to attack a knight of the Order, knowing that the consequences would be public and painful. But a rogue navigator armed with a vampire had no such compunction. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Raphael’s thoughts ran along the same lines. “The navigator will want to silence you before you create a paper trail he can’t destroy. You might end up hosting a bloodsucking party tonight. So we go to your apartment, take what you need, and then go to my place. He didn’t see me except in bouda form.”</p><p>“Absolutely not.”</p><p>Raphael twitched his nose. “Are you so scared to stay with me that you’d actually prefer to be ripped apart by a couple of vampires?”</p> <p>“I’m not scared of you.”</p><p>His lips stretched back in a nightmarish smile, exhibiting a wall of teeth capable of snapping a cow’s femur in half like a toothpick. “I promise to keep my hands, tongue, and other body parts to myself. You risk your life by staying home. It’s late and we’re both too wiped out to go climbing into the People’s lair tonight. What do you risk by coming with me?”</p><p>“A huge migraine from being in your company.” Try as I might, I couldn’t find any fault with his reasoning. It was logically sound. And I wanted to see his place. I practically itched with curiosity.</p><p>“I’ll share my aspirin,” he promised.</p><p>“And that’s all you will share. I mean it, Raphael. Touch any part of me with any part of you without permission and I’ll put bullets into you.”</p> <p>“I understand.”</p><p>It took me almost ten minutes of chanting to start the Jeep. Equipped with an enchanted water engine in addition to its gasoline one, the Jeep managed to attain the speed of nearly forty miles per hour during the magic wave, which in itself was an enormous achievement of magic manipulation. Unfortunately, it suffered from the illness affecting every magic-capable vehicle: it made noise. Not the typical mechanical noise of an engine either. No, it snarled, coughed, roared, and belched thunder in its effort to attain sonic supremacy, so all conversation had to be carried out at a screaming level. I kept quiet and Raphael napped. When a tired shapeshifter wants his rest, you could fire cannons next to him. He won’t care.</p><p>A few minutes later we pulled up before my apartment. Raphael followed me up the stairs, dimly lit by the pale blue glow of feylanterns, and sauntered into my living room. I opened the side door leading to one of the two bedrooms, which I used for storage, and heard Raphael suck in the air through his nostrils.</p><p>I glanced up and saw the thing. He had left it in the living room, but I kept bumping into it and eventually moved it here, to a corner by the barred window. A six-foot-tall metal chandelier-like contraption made of thin brass wire, the thing stretched from the ceiling to the floor, rotating slowly. Branches of wire stuck out from it and on the branches little glass ornaments shimmered, suspended on golden chains. The ornaments contained thongs.</p><p>“You kept it,” he said softly.</p><p>I shrugged. I actually hadn’t taken into account the effect it might have on him. A miscalculation on my part. “It beats digging for my underwear in the drawer.”</p> <p>His eyes widened. “Are you wearing one now?”</p><p>“Mind out of my pants!” I ordered. “One more infraction, and I’m staying home.”</p><p>He said nothing. I grabbed a blue duffel bag and went about the bedroom collecting equipment. My travel kit: spare toothbrush, toothpaste, hairbrush, deodorant. Crossbow bolts in neat bundles, their broadheads safely wrapped in soft wool in a box. Sharpshooter IV, a nice light crossbow. I pulled open the dresser and plucked a few boxes of ammo from it. Silver point.</p><p>“You’re the only woman I know who keeps bullets in her dresser,” he said.</p><p>“I use this room for storage.”</p><p>“There are bullets in the other dresser, too,” he said.</p><p>I suppose it was inevitable. He was a man, a bouda, and he had access to my apartment. It would be impossible for him not to have examined the contents of my dresser. At least he didn’t write on it in a big red marker, RAPHAEL WAS HERE.</p><p>“I like to be prepared. I don’t want to wake up in the middle of the night, empty my clip into some crazed shapeshifter sneaking about my apartment, and then have to run around looking for more ammo when he doesn’t stay down.”</p> <p>Raphael winced.</p><p>If he knew I had lied about the thing, he wouldn’t be wincing. He’d be grinning ear to ear. I wasn’t sure myself why I had kept it, except that it must’ve taken him hours to assemble it all, and it would’ve required nearly godlike ninja skills to slip away from the strict security of the Midnight Games to set it up. He went through all that trouble for me. I couldn’t throw it away.</p><p>Having filled my duffel with weapons of destruction, I headed to my bedroom and shut the door in his face when he tried to follow. He didn’t need to see me pack my spare underwear.</p><p>I packed a change of clothes and paused. I was incredibly filthy. Incredibly disgustingly filthy. I had to take a shower either here, where I had my shampoo and my soap, or in Raphael’s apartment. I grabbed a change of clothes and a firearm and stepped out of the room. “I’m going to shower. Stay out of my bathroom.”</p><p>“Okay.”</p><p>I got into the bathroom, slid the tiny deadbolt closed, and heard him lean on the wall next to it. “I’ve seen you naked, you know,” he said. “Twice.”</p><p>“Near-death experiences don’t count,” I said, stripping off my clothes and trying not to think of Raphael holding me firmly and whispering soft encouragements in my ear, while Doolittle had cut silver out of my body. Some memories were too dangerous to carry around.</p><p>When I emerged, clean, dressed, and smelling mostly of coconut with only mere traces of dead cat, I found Raphael examining the photographs on my shelf. Short little me and my mother, a petite blonde, standing side by side.</p><p>“You’re about eight?” he guessed.</p><p>“Eleven. I was always small for my age. Weaker than everyone else.” I touched the photograph gently. “In the wild, hyena cubs are born with functioning eyes and teeth. They start fighting the moment they’re born, and the stronger female tries to kill her sisters. Sometimes the weaker girls get too scared to nurse and die of starvation. The adults try to stop it, but hyena cubs will dig tunnels, too small for adults to enter, so they’ll fight to death there.”</p><p>“Boudas don’t dig tunnels,” Raphael said softly.</p><p>“You’re right. They don’t have to hide their violence from adults either.” They just try to beat you to death in the open. They do it right in front of your mother because they know she can’t protect you.</p><p>I reached into the frame and pulled out a small photograph resting behind it. The man on it hunched over oddly, nude, yet still dappled with faint outlines of hyena spots. His arms were too thickly muscled, his face too heavy on the jaws, its skin darkening at the nose. His round eyes were solid black.</p><p>Lyc-V, the virus that created shapeshifters, infected humans and animals alike. Very rarely it produced an animal-were, a creature who started his life as an animal and gained the ability to turn human. Most didn’t survive the transformation. Of the rare few who did, the majority suffered from severe retardation. Mute and stupid, they were universally reviled. The human shapeshifters killed them on sight. But once in a while, an animal-were turned out to be intelligent, learned to speak, and could express his thoughts. And even more rarely, he could breed.</p><p>I was the product of a mating between a female bouda and a hyenawere. My father was an animal. The shapeshifters called people like me “beastkin.” And they killed us. No trial, no questions, nothing but immediate death. That’s why I hid my secret self deep inside and never let her out.</p><p>Raphael’s clawed, furry hand rested on my shoulder gently.</p><p>I wanted him to hold me. It was a completely ridiculous feeling. I was an adult, more capable than most of protecting myself, yet as he stood there next to me, I had the heartbreaking longing to be held almost like a child, to draw strength from him. Instead I shrugged off his hand, slid the photograph back into the frame, and headed for the door.</p><p>“Home, sweet home,” Raphael growled, pointing to a beautiful two-story brick townhome.</p><p>“Yours?”</p><p>He nodded. It was a lot of house and it looked quite dignified from the outside. Considering his Casanova tendencies, the inside was likely to feature heart-shaped vibrating beds and disco balls.</p><p>“What is it you do, Raphael?”</p><p>“This and that,” he murmured.</p><p>I had run a background scan on him when he first came on to me, but aside from his first name and his status as the only child of Aunt B, the alpha of Clan Hyena, nothing came up. He belonged to the upper level of the Pack’s command and his records were sealed. To dig deeper, I needed a warrant.</p><p>However, I had also made some inquiries with a couple of female boudas. His name was Raphael Medrano. The Pack owned a number of businesses, and Raphael ran one of them: Medrano Extractors. When magic brought down a structure, it ground concrete to useless powder, but it left the metal behind. The extractors went in and salvaged what could be saved and then sold it to the highest bidder or bought it themselves. The job carried a high level of danger, but with half of the world in ruins, Raphael wouldn’t be out of a job anytime soon.</p><p>He took my duffel, unlocked the door, and held it open for me while I carried Boom Baby inside. The door opened into a spacious living room with a vaulted ceiling. The floor was wood, the rug plain and beige, matching an oversized soft sofa diligently guarded by a blocky dark wood coffee table. A flat screen hung on the wall, angled toward the couch. Massive cubes of wooden shelves lined the opposite wall, housing books and DVDs.</p><p>The walls were custom painted in a light-brown-and-gray pattern resembling stone. No pictures decorated them; instead, Raphael displayed weapons: swords and knives in every shape and size imaginable. The place was clean, neat, and uncluttered, free of knickknacks and throw pillows. A very masculine house. Like stepping into the lair of some medieval lord with a penchant for frequent dusting.</p><p>Raphael locked the door. “Make yourself comfortable. My fridge is your fridge. I’m off to shower.”</p><p>I placed Boom Baby under the window for easy access in case of emergency and sat on the couch. Above me the soothing noise of the shower announced Raphael scrubbing himself clean. He’d napped on the way to the Order, so he would likely manage the transformation without passing out. The thought of naked human Raphael in the shower was terribly distracting. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Suddenly I was so tired.</p><p>I crawled off the couch and forced myself into the kitchen. Eating Raphael’s food was out of the question. Shapeshifters attached a special significance to food. A shapeshifter approaching his or her mate would try to feed them. That’s how Kate got burned once: the Beast Lord of Atlanta, the Pack’s head alpha and the final authority, fed her some chicken soup. She ate it, having no clue what it meant, which, according to her, the Beast Lord found incredibly amusing. Curran had a peculiar sense of humor. Cats. Weird creatures.</p><p>I tried the phone. No dial tone. The magic was still up.</p> <p>I went back to the sofa and closed my eyes just for a moment.</p><p>The enticing aroma of meat tickled my nostrils. My eyes snapped open. Raphael, clean and mind-numbingly gorgeous, stood in the kitchen, trimming a piece of steak.</p><p>My mouth watered, and I wasn’t sure if it was the man or the steak that caused the reaction. Probably both. I was so hungry. And I so deeply wanted Raphael. I should’ve never come here.</p><p>Raphael glanced at me, his eyes like blue fire. My heart actually skipped a beat. “I’m cooking you dinner,” he said. “Shocking.”</p><p>“You know I can’t take that from you,” I said.</p> <p>“Why not?”</p><p>I shook my head.</p><p>He casually flipped the knife in his fingers. His knife skills were uncanny. A flash of irritation flared in his eyes. He hesitated. “Look, I know you’re starving. If you won’t let me cook for you, will you at least cook for yourself?”</p><p>That was the first time I had ever seen him irritated. I pushed off the couch. “Sure.”</p><p>He opened the fridge. A complicated web glistened in the back of it, gathering into a knot in the corner. An ice spider. It cost an arm and a leg. I, like most other normal people, had to buy friz-ice from the Water and Sewer Department to keep my fridge from getting warm when the tech failed and magic robbed it of electricity.</p><p>Raphael pulled another steak and slapped it on the cutting board next to his. “Here.”</p> <p>“Thank you.”</p><p>“You’re welcome.”</p><p>We stared at each other for a second, and then I took the saltshaker and began to season my steak.</p><p>We glided in the small space of the kitchen, boxed in by the island and counters like two dancers, never touching each other, until we ended up next to each other searing our steaks on twin burners.</p><p>“I would just like to know if I have a chance,” Raphael ground out. “I’ve been patient.”</p><p>“And I owe you something because of that?”</p><p>He glared at me. “I just want an answer. Look, it’s been half a year now. I call you every day—you don’t take my calls. I try to meet you and you blow me off. But you look at me like you want me. Just tell me yes or no.”</p><p>“No.”</p> <p>“Is that your answer or are you refusing to tell me?”</p><p>“My answer is no. I won’t sleep with you. I’ve never led you on, Raphael. I told you from the beginning this wasn’t going to happen.”</p><p>Raphael’s eyes went dark. “Fair enough. Why?”</p><p>“Why?”</p><p>“Yes, why? I know you want me. I see it in your face, I smell it in your body, I hear it in your voice. That’s why I kept coming back after you like a fucking idiot. At least you can tell me why.”</p><p>I unclenched my teeth. This talk was almost six months in coming. “Your mother is a good person, Raphael. Her clan is a good clan. But it’s not like that everywhere. My mother was the weakest of six females in a small bouda clan. The others beat her every day. There were only two males and my mother didn’t get to mate. Hell, if one of them looked at her, the others attacked her. In other places boudas don’t stick that strictly to the Code. There’s no Beast Lord to hold them to it and no punishment. They get to govern themselves, and the pack’s only as good as the alpha. You know what my first memory is? I’m sitting in the dirt and our fucking alpha, Clarissa, is beating my mother in the face with a brick!”</p><p>He recoiled.</p><p>“My mother didn’t want to mate with my father. They forced her to do it, because they got off on the perversity of it. He didn’t know any better. He didn’t understand the concept of rape. All he knew was that there was a female and she was made available to him. For three years my mother was raped by a man who had started his life as a hyena. He had the mental capacity of a five-year-old. And when I was born, they started beating me as soon as I could walk. I was beastkin. No rules applied to me. Under your precious Code, I was an abomination. Every bone in my body was broken before I turned ten. As soon as I healed, they started on me again. And my mother couldn’t stop it. She could do nothing. They would’ve killed me, Raphael. I was weaker and smaller than them and they would’ve kept beating me and beating me until there was nothing left, if my mother hadn’t gotten together what little shreds of courage she had left. I live now because she grabbed me and ran across the country.”</p><p>His face turned bloodless, but now it was too late to stop.</p><p>“When Kate drove me to the flare to your mother, I kept trying to get out of the cart, because I was sure Aunt B would kill me. That’s what ‘bouda’ means to me, Raphael. It means hate and cruelty and disgust.”</p><p>I shoved my pan off the fire to save the half-burned steak.</p><p>“So you refuse to be with me because of what I am,” he said. “You can’t be that shortsighted. What happened to you was awful. But I’m not them. I would never hurt you. My family, my clan, we would never hurt you. We protect our own.”</p><p>“What you are is only a part of it. If you were a different man, maybe I could get over it. But you’re a typical bouda male. I want love, Raphael. I might not deserve it, after some of the stuff I’ve done, but I want it. I want security and kindness and a home. I want monogamy and consideration for my feelings. What do you have to offer me? You’ve slept with every bouda woman who isn’t related to you. Everybody had you, Raphael. They offered to give me pointers on what you like in bed. Hell, you didn’t stop with boudas. You played with wolves, and with rats, with jackals . . . To you, I’m just another weird thing to hump. For God’s sake, you got stuck inside a jackal girl while you were both in beast form and they had to call Doolittle out to separate you two. What were you thinking? You outweighed her by a hundred and fifty pounds and you aren’t even of the same species!”</p><p>“I was fourteen,” he snarled. “I didn’t know any better. She wiggled her ass in front of me . . .”</p><p>“You’re like a greedy kid in an ice cream store. You want everything and so you make this giant rainbow mess of a cone and gorge yourself on sweets until you can’t even think anymore. You have no restraint and no discipline. Why would I want to get involved with you? So the next time someone wiggles her ass before you, you’ll take off like a rocket? Please.”</p><p>I grabbed a fork, stuck it into my steak, and marched out of the kitchen, carrying off my charred piece of meat. I got outside, climbed in my Jeep, and realized I had left my guns and my keys inside. There was nothing left to do but chew on my steak. I really wanted to cry.</p><p>I was so screwed up. I tried so hard to be a human, and he unhinged me. I just fell apart like a doll. The beatings, the humiliation, the fear—I had left those things in the past. I had interacted with other boudas and never once had been bothered by them. But with him all of it came flooding back in a choking painful wave.</p><p>Only Kate, the boudas, and the Beast Lord knew what I was. If the Pack found out that I was beastkin, the Beast Lord would protect me from physical harm. Curran had considered the issue of beastkin and come to the conclusion that he wouldn’t tolerate genocide against us. But at least some of the shapeshifters would still despise me. If the Order found out what I was, they would expel me. The Order took a dim view of monsters in their ranks unless they were fully human.</p><p>Years of hiding, first in adolescence, then during the grueling training at the Order’s Academy, stressed to my limit, tortured physically and mentally, hammered into shape, into a new me, then service in the name of the Order. I had rigidly maintained my humanity and composure through it all, and what undid me? Raphael, with his blue eyes and warm hands and voice that made me want to press against him and purr . . .</p><p>How could I have fallen for a damn bouda?</p><p>I slumped forward and rested my head on the steering wheel. Why did I tell him all that? What possessed me? I should’ve just laughed off his dinner invitation. But it had been eating at me for months now and I just couldn’t help myself. There was this bitter emptiness inside me and it made me want to scream, It’s not fair! and I didn’t even know why.</p><p>It wasn’t fair. It wasn’t fair that I wanted to wake up next to Raphael. It wasn’t fair that he was a bouda. It wasn’t fair that for eleven years boudas tortured me and my mother.</p><p>Half an hour later Raphael emerged onto the porch and held open the door. Remaining in the Jeep was childish. Even storming out in the first place was childish. I took my fork, hopped out of the Jeep, and went inside with as much dignity as I could muster.</p><p>Raphael closed the door behind me. An odd light played in his eyes. He grabbed me by my shoulders and pulled me to him.</p><p>The breath jumped out of my lungs.</p><p>His stare was hard. “You will give us a chance.”</p><p>“What?”</p><p>“Things happened before I met you and before you met me. Those things don’t matter. You had no control over your past, but here, right now, you control the situation and you’re voluntarily giving it up. You’re punishing both of us because of something that happened half a lifetime ago. It makes no sense.”</p><p>I tried to pull away, but he held me.</p><p>“There hasn’t been anyone since I met you. I’ve been good, and don’t think for a moment it was because of the lack of wiggling asses. Have you ever seen me with another woman since we met? Have you heard of me being with another woman? The same women who wanted to give you pointers will tell you that I haven’t touched anyone since I saw you. Are you jealous of them? Is that it?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My face went hot and I knew I had flushed. I was jealous of them. Of all of them.</p><p>“Andrea, you can’t be jealous of someone I met before I knew you. I didn’t know you existed back then. I don’t want anyone else now. Has there been anybody for you?”</p><p>I shook my head.</p> <p>“I think of you a lot. Do you think of me, Andrea? Don’t lie to me.”</p><p>“Yes!” I snarled, my face burning. “Yes, I do! All the time. I can’t get you out of my head. I wish I could!”</p><p>He hugged me so hard, my bones nearly crunched. “You’ve made yourself into a new person and so have I. We deserve a fucking chance. I want you and you want me. Why aren’t we together? I’ll deal with your hang-ups if you’ll deal with mine, but if you’re still too scared to even try, then you’re not worth waiting for. I have some goddamn pride left and I won’t wait forever.”</p><p>He let me go.</p><p>I could either take control of it now or walk out. I clenched my teeth. This was my decision. I owned it, I took full responsibility for it, and no memories would make me cower and run away from him. I was worth it, damn it. He was worth it.</p> <p>I did what I had wanted to do since I first saw him. I dropped my fork and kissed him.</p><p>We never made it upstairs to the bedroom.</p><p>The problem with falling asleep wrapped in a comfy blanket on the floor between the coffee table and the sofa is that in the morning, when the phone rings and wakes you up, you forget the coffee table is there. At least Raphael did. There was a solid thud as he sat up, smashing his head against the table, and then a string of foul curses as he staggered into the kitchen and picked up the phone.</p><p>“It’s for you!”</p><p>I got up, wrapped the blanket about myself like a cape, and went to get the phone.</p><p>“Aha!” Kate’s voice said on the other end.</p> <p>“Aha what?”</p><p>Raphael must’ve recovered from his unfortunate connection with the table, because he set about trying to steal my blanket.</p><p>“Nothing. Nothing at all,” Miss Innocence said.</p><p>“How did you get this number anyway?” I smacked Raphael’s hand away.</p><p>“Jim gave it to me a long time ago. I tried your cell, the Order, and your house. This was the next logical number. I’m a trained detective, you know.”</p><p>“You couldn’t detect your way out of a shoe if someone lit the way with neon signs.”</p><p>Raphael finally won the battle for the blanket and molded his body against mine, nipping gently at my neck. “Hold on a minute.”</p><p>I covered the phone and turned to him. “About dealing with my hang-ups—this is one of them. I’m on the phone. Please let me be.”</p> <p>He sighed and went about the kitchen getting eggs out.</p><p>“I’m here,” I said, pulling my blanket back up.</p><p>“How did it go with Cerberus?”</p><p>I briefly sketched it for her. “Even if destroyed, he continues to remanifest as soon as the magic is up. He’s bound to that house. I’ll be talking to the People today about the vampire. I doubt they’ll tell me anything.”</p><p>“How important is this?”</p><p>I explained about Aunt B.</p><p>“I’m so sorry.”</p><p>“Me, too.”</p><p>“Ghastek owes me a favor,” Kate said. “I have it on paper, signed in the presence of witnesses. Call him on it.”</p><p>“Thanks.”</p><p>“It’s the least I can do. Say, how did you even get into this mess?”</p><p>“Some man called Teddy Jo called it in.”</p><p>Kate hesitated. “Be careful with Teddy Jo,” she said softly.</p><p>“Why?”</p><p>“I don’t have anything solid, but there is something that bothers me about Teddy. Just watch him carefully if he ever shows up.”</p><p>I hung up. After Nataraja, the head of the People in Atlanta, Ghastek was the most talented of the Masters of the Dead. And also the most dangerous.</p><p>“Are you off the phone?” Raphael inquired mildly.</p><p>“Yes.”</p><p>A hint of danger added edge to his smile. “Good.”</p><p>When one says “pounce,” most people typically think of a cat. Maybe a dog. But none of them can manage to pounce quite as well as a horny male werehyena.</p><p>It took us nearly forty-five minutes to get out of the house, partly because Raphael had jumped me and partly because I had lingered. I lay next to him, wrapped in his arms, and tried to sort it out, and all the while my brain feverishly pulled apart my emotions, the secret creature inside me purred and snuggled up to Raphael, blissful in her simple happiness.</p><p>Raphael went all out: black jeans, black T-shirt, black jacket, enough knives to fight off a gaggle of ninjas. At least he didn’t wear leather, or we would’ve caused a slew of traffic accidents.</p><p>He had also called his mother. During his life, Alex Doulos was a Greek pagan, and he did worship Hades. Aunt B didn’t know the particulars. Raphael didn’t mention that her mate’s shade was trapped behind a ward by some sort of necromancer. We both agreed that she could be spared that knowledge.</p><p>“What’s bothering you?” Raphael asked, as I slid the Jeep into traffic. The magic had dropped again during the night. At least we could speak without yelling over the roar of the water engine. “Was the morning not good for you?”</p><p>He was worried. If he knew how completely he’d blown my socks off, his head would swell to twice its normal size. I tried my best not to laugh. “Sex, it’s what for breakfast.”</p><p>“Seriously?”</p><p>“It was great.” The best I ever had, but he didn’t need to know that. “Couldn’t you tell?”</p><p>“You never know. Women are more complicated.” He shook his head. “If not that, then what is it? You have that pinched look on your face.”</p><p>“Aren’t men supposed to be bad about reading women’s faces?”</p><p>Raphael sighed. “Not when they are reading the face of a woman they’ve obsessed over for the last six months. Tell me.”</p><p>I didn’t say anything. He would think less of me if I did.</p><p>“This is one of my hang-ups,” he said. “I’ll keep asking you what’s wrong until you tell me.”</p><p>Fair enough. “I’m a professional,” I said. “I went through the training, got knighted, the whole thing. I have decorations for meritorious service. But I have to rely on Kate to get the People to talk to me. It bothers me.”</p><p>He waited for more.</p><p>“Back in Texas, my partner and I took out a group of loups. My partner caught Lyc-V and went loup. I killed her. The Order tested me, but I got the all clear.”</p><p>“How did you manage that? The virus is in your blood.”</p><p>“I had a silver ring implanted under my skin in my arm just below the armpit. It pinched off my blood supply and then I shot liquid silver into my veins. It killed the virus. I cut my wrist to bleed out the dead virus cells, and the ring kept Lyc-V from the rest of my body from entering my arm.” The mere memory made me want to curl in pain.</p><p>“That was insanely dangerous. You could’ve lost your arm.”</p><p>“I almost did. But the blood work came back clear, and the amulet in my skull, the one you pulled out during the flare, kept my magic from leaking into an m-scan. I was given a clean slate, but they still shipped me off to Atlanta. Ted Monahan, the knight-protector, put me on the back burner. Before coming here, I was on the way to becoming Master-at-Arms, Firearm.”</p><p>Raphael nodded. “I take it that’s a big deal.”</p><p>“Very. I had all of my security briefings, passed all of the tests. All that remains is the formal nomination from my chapter’s knight-protector. But Ted will never do it.”</p><p>“Why not?”</p><p>“Because he senses there is something wrong with me. He isn’t sure what, and until he figures it out, I’m the only knight without any active cases. I don’t even have an office.”</p><p>Raphael’s jaw took on a stubborn set. I had seen it before a few times, and I knew what it meant. “I know that look.”</p><p>He turned a dazzling smile at me. “What look?”</p><p>“Promise me that you’ll cause no harm directly or indirectly to Ted by acting on my behalf. I’m dead serious, Raphael. Promise me.”</p><p>“What he’s doing to you—”</p><p>“Is exactly what I would do in his place. I knew the risks when I got into the Order. The Order has done absolutely nothing to renege on the terms of our bargain. All the fault lies with me. I deceived it, and if discovered, I’ll pay the price. I accept that.”</p><p>“What is the price?”</p><p>A spike of anxiety pinched me. My throat closed up for a moment. “They’ll throw me out on my ass.”</p><p>“Is that all?” he asked. “Are you sure they won’t send someone after you to make sure you don’t join the opposite side?”</p><p>“I’m sure,” I said. “Their conditioning is very good. It would take a lot to break my devotion to the Order even if they put me out on the street. Promise me.”</p><p>“Fine. I promise.”</p><p>We drove in silence for a few minutes.</p><p>Raphael’s eyes darkened. “Maybe we should be careful with public displays of affection.”</p><p>I gave him my thousand-yard stare. “Oh no. I think you misunderstand the nature of our relationship. You are mine. If there is an attractive female in speaking range, you will be publicly affectionate to me. Otherwise I’ll end up pistol-whipping them off you, and I’m pretty sure injuring innocent civilian hussies would be considered ‘conduct unbecoming a knight.’”</p><p>Raphael showed me the edge of his teeth in a slight smile. “And what will Ted think of you shacking up with a bouda?”</p><p>“Ted is welcome to show me a section in the Order’s regulations that forbids me to do so. My knowledge of regulations is extremely extensive. I can quote entire passages from memory. I guarantee that I know the rules much better than Ted.”</p><p>My brain took a second to process the words that had just left my mouth and realized how many things I had taken for granted. I said softly, “At least I hope you would be publicly affectionate.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Raphael laughed softly, like a bemused wolf. “You ruined a spectacular alpha snarl.”</p><p>I had seen Raphael fight. He was devastatingly lethal. The way he tore up Cerberus’s head took both skill and the berserk frenzy that made boudas feared in any fight. Physically he could overpower me. I was barely five feet four; he was six feet and change. He outweighed me by about eighty pounds of hard muscle, toughened by constant exercise. He was without a doubt the best fighter of the bouda clan. But he was also a male, and bouda males preferred the beta role. I had snapped into an alpha mode without even realizing it.</p><p>“I didn’t mean . . .”</p> <p>“I trust you to take the lead most of the time,” he said. “With the understanding that when I really insist, you will listen.”</p><p>I exhaled. “Agreed.”</p><p>The Casino, the People’s HQ in Atlanta, occupied the enormous lot that had once housed the Georgia Dome. The People’s architect had taken the Taj Mahal as a model and expanded the blueprint to twice its original size. Pure white in daylight, the Casino seemed to float above the asphalt, buoyed by the glittering streams of many fountains surrounding its walls. Its slender towers reached to a dizzying height, flanking the ornate central cupola. Elegant passageways united the towers, ethereal as if woven of spider’s web or carved from a chunk of ivory by a patient sculptor. Its elaborate central gates always stood open, just as the guardhouses and engines of war on its thick walls were always manned.</p><p>I parked in a side lot and nudged Raphael to put Kate’s book down.</p><p>A hundred yards from the gates, both of us paused in unison. The stench of undeath spread through the lot like a sickening miasma. No words could adequately describe it, but once you smelled it, you never forgot it. It was a sharp, leathery, dry stench, unmistakably of death but not of rot, the scent of sinew and bone wrapped in a foul, foul magic. I nearly gagged. Raphael slowed and I followed his example.</p> <p>I’ve had the acclimatization training to accustom me to vampiric scent and presence, but it was one thing to watch a single vamp held tightly in check twenty yards away and completely another to be walking into the den of more than three hundred of them.</p><p>We made it through the doors past twin sentries dressed in black and armed with wickedly curved scimitars and stepped into the sea of slot machines. The air rang with a discordant cacophony of bells and chimes. Lights flashed. People screamed in manic glee, cursed, and laughed. More than half of the slots had been reworked to be completely independent of electricity. Even when the magic hit, the one-armed bandits would continue to quickly and mercilessly siphon cash out of the public’s pockets and into the coffers of the People. Necromantic research wasn’t cheap.</p><p>We halted before a service desk and I told a young man in a business suit who I was, flashed my Order ID, and explained I was here to see Ghastek. The young man, having introduced himself as Thomas, promptly affixed a smile on his face. “I’m sorry, ma’am, he’s incredibly busy.”</p><p>“Tell him I’m here on behalf of Kate Daniels.”</p><p>Thomas’s eyes went wide. He tapped the intercom, whispered into it, and nodded at us. “Unfortunately, he’s in the stables and can’t leave at the moment. He’s most eager to see you, and someone will be here to guide you to him very shortly.”</p><p>We walked over to the waiting area by the wall. A row of chairs waited for us, but I didn’t feel like sitting down. I felt like someone had painted a giant bull’s-eye on my chest and a dozen hidden snipers were ready to take a shot.</p> <p>Raphael’s lips bent in an odd little smile. If you didn’t know him, you could mistake it for the dreamy absentminded grin of a man quietly enjoying his private thoughts. This little smile meant Raphael was a single infraction away from whipping out his knives and slicing everything around him to pieces. He wouldn’t do anything unless provoked, but once provoked, nobody could hold him back. The Pack and the People represented two sides of the same power coin: among all civilian factions in Atlanta, they were the most powerful. They had divided the city between them and stayed out of each other’s territory, knowing that if open conflict broke out between the two of them, the fight would be long, bloody, and costly, and the victor would be so weakened, he wouldn’t survive for long.</p><p>But as much as they avoided provoking each other, both found it prudent to show their opponent their teeth—and Raphael was all about proper etiquette.</p><p>A vampire dropped into the doorway. Female and probably black during life, now it had gained an odd purple tint. Hairless and emaciated, as if knitted together from twine and tough jerky, it stared at us with hungry eyes. Its mouth unhinged with mechanical precision, and the voice of a female navigator issued forth. “Good morning. My name is Jessica. Welcome to the Casino. Master Ghastek sends his deepest apologies. He’s engaged in something he cannot postpone, but he instructed me to take you to him. With my sincere regrets for your inconvenience, I must ask you to please leave your firearms at the desk.”</p><p>They wanted my guns. “Why?”</p><p>“The inner facilities house a lot of delicate and in some cases irreplaceable equipment. Occasionally our guests experience a heightened sense of anxiety and discomfort due to the presence of vampires, particularly when they visit the stables.”</p><p>“I wonder why,” Raphael said.</p><p>“We’ve had incidents of accidental discharge of firearms by our guests. We don’t request that you surrender your bladed weapons, only your firearms. I’m afraid this rule can’t be bent. My deepest apologies.”</p><p>“That will be fine,” I said, and deposited my P226s on the desk. Without my weapons, I felt naked.</p> <p>“Thank you. Follow me, please.”</p><p>We followed the creature down an opulent hallway to a stairway and then down, and down, and down, beyond the daylight to the artificial illumination of electric lamps. The vampire crept lower and lower, moving on all fours, making so little noise, it was uncanny. We wove our way through a maze of dim tunnels, interrupted only by the occasional bulb of electric light and dark, foot-wide gaps in the ceiling.</p><p>“Is there going to be a minotaur in this labyrinth?” Raphael growled.</p><p>“The maze is a security measure, necessary for proper containment,” the navigator’s voice answered through the vamp’s mouth. “Unguided vampires are ruled by instinct. They don’t possess the cognitive capacity to navigate the tunnels. In the event of a massive breakout, the tunnels will act as a buffer zone. The ceiling contains a number of heavy-duty metal grilles that will drop down, separating the vampires into easily manageable groups and minimizing damage resulting from bloodlust-induced infighting.”</p><p>“How often do breakouts occur?” I asked. The stench of undeath had grown to a nearly unbearable level.</p><p>“Never. This way, please.” The vampire scuttled to a brightly lit doorway. “Watch your step.”</p><p>We entered a huge chamber and descended a dozen stairs to the floor. Harsh white light streamed from the high ceilings, illuminating every inch. A narrow hallway stretched to the center of the chamber, its walls formed by prison cells. Each six-by-six-foot cell housed a single vampire, chained by the neck to the wall. The chains were thicker than my thigh. The vampires’ eyes burned with insatiable bloodlust. They didn’t vocalize, didn’t make any noise; they just stared at us, straining on the chains as we passed by them. Every hair rose on the back of my neck. Deep inside, my secret self gathered into a tight clump, watching them back, ready to leap out at the slightest opportunity.</p><p>The hallway terminated in a round platform, from which more corridors radiated like spokes from a wheel. On the platform stood Ghastek. He was a man of average height and thin build. His light brown hair receded from his forehead, focusing attention on his eyes: dark and sharp enough to draw blood. His attire was black, from tailored slacks to the long-sleeved shirt, collar unbuttoned and sleeves very carefully and precisely rolled up, but where Raphael’s black was an aggressive, kick-ass darkness, Ghastek’s black was the laid-back, business-casual shade, an absence of color rather than a statement of attitude.</p><p>He glanced at us, nodded briskly, and turned his attention to three young people standing to the side next to a console. They wore identical black slacks, gray dress shirts, and dark violet vests. Journeymen, the Masters of the Dead in training. One of the three, a tall young male with red hair, stood very rigid. His hands curled into fists. He stared straight ahead, at the cell where a single vampire sat at the end of its chain.</p><p>Ghastek nodded. “Are you ready, Danton?”</p><p>“Yes, Master,” the redhead said through clenched teeth.</p><p>“Very well. Proceed.”</p><p>The vampire jerked as if shocked with live wire.</p><p>“Easy,” Ghastek said. “Remember: no fear.”</p><p>Slowly the bloodsucker took two steps back. The hunger in its ruby eyes dimmed slightly. The chain sagged and clanged to the floor.</p><p>“Good,” Ghastek said. “Maria, you may release the gate.”</p><p>A female journeywoman with long dark hair tapped the console. The gate of the cell crept up. The vampire stood still.</p><p>“Disengage the collar,” Ghastek ordered.</p><p>The vampire snapped the collar open.</p><p>“Bring him forward.”</p><p>The vampire took a tentative step forward. Another . . .</p><p>Its eyes flared with bloodlust like two glowing coals. Danton screamed. The bloodsucker charged us, eyes shining, jaws unhinging, huge claws scratching the platform.</p><p>No gun.</p><p>I dashed forward, pulling a field knife, but Raphael beat me to it. He swung, slashing in a precise arc, and checked himself in midmove.</p><p>The vamp froze. It simply stopped, petrified, one clawed foot on the ground and the rest in the air. Raphael had stopped his knife blade a mere half an inch from the undead throat.</p><p>“You have excellent reflexes,” Ghastek said. “A shapeshifter?”</p><p>Raphael simply nodded.</p><p>“I sincerely apologize,” Ghastek said. “I’m piloting him at the moment, so he won’t cause us any further concern.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The vampire leapt backward, landing at Ghastek’s feet, and hugged the floor, his forehead pressed to stone. Ghastek’s face showed no strain. None at all.</p><p>Raphael stepped back, the knife vanishing into the sheath at his waist.</p><p>On the platform, Danton slumped into a heap, moaning softly, white clumps of foamy spit sliding out of his mouth. A medical team with a stretcher emerged from the side corridor and loaded him up, strapping him in.</p> <p>Both remaining journeymen stared at Danton in horrified silence.</p><p>“You may go,” Ghastek said.</p><p>They fled.</p><p>“A shame, that,” Ghastek said softly.</p><p>“What happened to him?” I asked.</p> <p>“Fear. Done correctly, the contact with the undead mind, while repulsive to some, is completely harmless.”</p><p>The vampire uncoiled and rose straight up. It had been quite tall during life, but its body had shifted to a quadruped locomotion. Yet it stood straight as an arrow, probably in pain but staring right into Ghastek’s eyes. The Master of the Dead studied the twin points of furious red. “Fear of contact, however, can bring about horrible consequences, as you saw.”</p><p>The vampire dropped on all fours. “Perhaps we had best continue this discussion in my office.” Ghastek smiled drily. “Please.”</p><p>I walked next to him, Raphael on my right, the vampire on Ghastek’s left. “Navigating a vampire is similar to riding a large wave: you have to stay on top of it or it will crest and pull you under. Danton, unfortunately, permitted himself to drown. If he’s lucky, he should be able to regain enough cognitive ability to feed himself and tend to his own personal hygiene. If he’s unlucky, he’ll spend the rest of his life as a human vegetable. Would you care for an espresso?”</p><p>The vampire sprinted ahead.</p><p>“No, thank you. Watching a man foam at the mouth tends to short-circuit my thirst and appetite.” What happened to Danton deeply bothered me, but I knew the People’s contracts, and everything that had transpired was completely within the law. The journeymen signed their lives away when they chose to work for the People.</p> <p>“Again, my apologies. I could have postponed the test, but Danton had avoided it twice already after daring to brag about how well he would do. I don’t tolerate displays of baseless egocentricity. The test had to proceed as scheduled. He’s a rare case. Most of our journeymen manage to fail without quite so much melodrama.”</p><p>We climbed the stairs and headed through the maze of the hallways until Ghastek opened the door to one of the rooms. Spacious, it resembled a living room rather than an office: a semicircle of sectional sofa upholstered in a warm red shade, a plain desk in the corner, books lining the shelves. To the left, through the door, I saw a small kitchenette and a vampire mixing a drink. To the right, floor-to-ceiling windows offered a view of the stables from above.</p><p>“Please sit down.”</p><p>I took a spot on the sofa. Raphael sat next to me, and Ghastek opposite. The vampire squirmed into the room and offered Ghastek an espresso. The Master of the Dead smiled quietly at his drink and sipped with obvious pleasure. The bloodsucker dropped to the floor and sat at his feet. It moved so naturally and Ghastek was so relaxed, I found it difficult to believe that the Master of the Dead controlled the vampire’s every twitch.</p><p>“I believe we’ve met before,” Ghastek said. “In Kate’s office. You pointed guns at my vampire.”</p><p>“You questioned my reflexes,” I said.</p><p>“I was quite impressed by them. That’s why I requested that you disarm.”</p><p>“You expected the journeyman to fail?”</p> <p>“Precisely. This particular vampire is appraised at $34,500. It would be bad business sense to put it into a situation where it would endure a dozen bullets shot through its skull.”</p><p>What a cold, cold man.</p><p>Ghastek sipped his espresso. “I assume you’re here to call in the favor I owe to Kate.”</p><p>“Yes.”</p><p>“How is she, by the way?”</p><p>Something in the perfectly neutral way he asked the question set my teeth on edge.</p><p>“She’s recuperating,” Raphael said. “And as a Friend of the Pack, she’s enjoying the Pack’s protection.” He had been staying quiet so far and I knew why. Anything he said would be used by the People against the Pack. He minimized the amount of conversation, but he made the message crystal clear.</p><p>Ghastek chuckled. “I assure you, she’s quite capable of protecting herself. She tends to kick people in the face when she finds them offensive. Is it true she broke a red sword during the Midnight Games by impaling herself on it?”</p><p>An alarm blared in my head. “I don’t remember it quite that way,” I lied. “As I recall, a member of the opposing team meant to strike with the sword. Kate interrupted his strike, and when he tried to free the blade, he cut himself on it. The blood from his hand shattered the sword.”</p><p>“I see.” Ghastek drank the last of his espresso and handed the cup to the vampire. “So what may I do for you?”</p><p>“I would like you to answer a series of questions.” I had to phrase the questions very carefully. “This interview is conducted in confidence. I ask you to not discuss it with anyone unless required to do so by law.”</p><p>“I’ll happily do so, provided your questions are within the range defined by the conditions in the original agreement.”</p><p>The agreement specified that he wouldn’t do anything to directly harm himself, his team, or the People as a group.</p><p>“Are you familiar with the area known as Scratches, located west of Red Market?”</p><p>“Yes.”</p><p>“Is it true that the People routinely patrol a large area of the city surrounding the Casino?”</p><p>“Yes.”</p><p>“Do any patrol routes pass through Scratches?”</p><p>“No.</p><p>So the vampire wasn’t the People’s observer. “To your knowledge, are the People currently conducting any operations in the Scratches?”</p><p>“No.”</p><p>“Are you familiar with Greek paganism?”</p><p>I watched him carefully, but he showed no signs of being surprised by the question. “I have a moderate knowledge of it, within the limits common to most educated individuals. I’m not, by any means, an expert.”</p><p>“Keeping in mind the previous question, how would you define the term ‘shade’?”</p><p>“An incorporeal entity representing the essence of a recently departed, a disembodied ‘soul,’ if you will. It’s a purely philosophical concept.”</p><p>“If confronted with a shade, how would you explain its existence?”</p><p>Ghastek leaned back, braiding his long fingers. “There are no such things as ghosts. All ‘spirits,’ ‘lost souls,’ and so forth are superstition. To exist in our reality, one requires a solid form. So, if confronted with a shade, I would surmise that it’s either a hoax or a postmortem projection. For some magically capable individuals death comes slowly, in that even after their bodies cease their function and become clinically dead, their magic keeps their minds functioning for an extended period of time. In effect, they are mostly dead. In this state, some persons may project an image of themselves, especially if they are aided by the magic of a trained necromancer or a medium.</p><p>“Folklore is full of examples of such phenomena. For example, there’s a tale in Arabian Nights that features a sage whose head was struck off his body after death and set upon a platter. It recognized people familiar to the sage and was able to speak. But I digress.” He invited the next question with a nod.</p><p>“Are you aware of any necromancers unaffiliated with the People and capable of vampiric navigation who are currently active in the city?”</p><p>Ghastek’s face registered distaste, as if he had smelled something unpleasant. He plainly didn’t want to answer the question. “Yes.”</p><p>“Please identify the individuals described.”</p><p>“Lynn Morriss.”</p><p>Oh wow. Spider Lynn was one the seven premier Masters of the Dead in Atlanta. All of the People’s Masters of the Dead branded their vampires. Lynn’s brand was a small stylized spider. “When did she leave the People?”</p><p>“She withdrew her membership three days ago.”</p><p>According to Raphael, that was Alex Doulos’s date of death. It could be a coincidence, but I highly doubted it.</p><p>“She also purchased several vampires out of her stable,” Ghastek volunteered.</p><p>“How many can she pilot at once?” Raphael asked.</p><p>“Three,” Ghastek said. “Up to four on a good day. Her control becomes shaky after that.”</p><p>“Why did she leave?” I asked.</p><p>“She became disillusioned. We all seek to attain our goals. Some are willing to wait and others, like Lynn, lose their patience.”</p><p>“How would you describe her?”</p><p>Ghastek sighed. “Precise, ruthless, single-minded. She was neither liked nor disliked. She did her job well and required little attention.”</p><p>“What caused her to leave the People, in your opinion?”</p><p>“I don’t know. But it was deeply profound. One doesn’t walk away from fifteen years of hard work without a reason.”</p><p>I rose. “Thank you very much for your time.”</p><p>Ghastek nodded. “Thank you. When I made the agreement with Kate, I never imagined the restitution would be so easy. Let me see you out.” The vampire moved by the door. “A word of caution: if Lynn Morriss has decided to make her new home in the Scratches, I would advise you to stay away from it. Lynn is a formidable opponent.”</p><p>“Do the People plan to take any action against her?”</p><p>“No,” Ghastek said with a small smile. “There is no need.”</p><p>Outside I hopped into our vehicle, the taint of vampiric magic clinging to me like greasy smoke. “I feel soiled.”</p><p>“Like walking into a room after a day of work, falling into bed, and realizing the sheets are covered in cold K-Y jelly,” Raphael said.</p><p>I just stared at him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“With a funky smell,” he added.</p><p>My Order conditioning failed me. “Ew.”</p><p>Raphael grinned.</p> <p>“I’m not even going to ask if that’s happened to you.” I started the vehicle. “Has that happened to you?”</p><p>“Yes.”</p><p>Ew. “Where?”</p><p>“In the bouda house.”</p><p>Ew!</p> <p>“I was really tired and you’ve seen that place: everything smells like sex . . .”</p><p>“I don’t want to know.” I peeled out of the parking lot.</p><p>“So where are we going?”</p><p>“To Spider Lynn’s house. We’re going to dig through her trash, and if that doesn’t work, we’ll do some breaking and entering.”</p><p>Raphael frowned. “Do you know where she lives?”</p><p>“Yes. I memorized the addresses of all the Masters of the Dead in the city. I have a lot of time on my hands.”</p> <p>He squinted at me, looking remarkably like a gentleman pirate from my favorite romance novels. “What else do you store in your head?”</p><p>“This and that. I remember the first thing you ever said to me. You know, when you carried me from the cart into the tub so your mother could fix me.”</p><p>“I imagine it was something very romantic,” he said. “Something along the lines of ‘I’ve got you’ or ‘I won’t let you die.’”</p><p>“I was bleeding in the bathtub, trying to realign my bones, and my hyena glands voided from the pain. You said, ‘Don’t worry, we have an excellent filtration system.’”</p><p>The look on his face was priceless.</p><p>“That can’t be the first thing.”</p><p>“It was.”</p><p>We drove in silence. “About the K-Y,” Raphael said.</p> <p>“I don’t want to know!’</p><p>“Once I washed it out of my hair—”</p><p>“Raphael, why are you doing this?”</p><p>“I want to make you go ‘Ew’ again.”</p><p>“Why in the world would you want to do that?”</p><p>“It’s an irrepressible male impulse. It just has to be done. As I was saying, once I washed it out—”</p><p>“Raphael!”</p><p>“No, wait, you’ll like the next part.”</p><p>By the time we reached Spider Lynn’s house, my endurance had been tested to its limits.</p><p>Her place was a small ranch-style house, set way back from the road and hidden by a six-foot-tall wooden fence. I opened the trash can. A cloud of rancid stink hit me. Filthy but empty.</p><p>Raphael examined the fence, took a running start, and sailed over it, flipping in the air like a vault gymnast. I did it the old-fashioned way: I ran, jumped, gripping the edge, and pulled myself up and over. Raphael pulled out a couple of lock picks and inserted them into the lock. The door clicked and we entered a dark, empty garage. I blinked a couple of times, adjusting to the gloom, and then my night vision kicked in. Some people’s garages resembled a yard sale postbombing. Spider Lynn’s was orderly and precise, a collection of tools and cleaning utensils carefully hung on hooks. The floor was freshly swept. If I had a garage, mine would look just like it.</p><p>The door leading from the garage to the house was predictably locked and took ten seconds to be sprung by Raphael. Inside was an upscale suburban kitchen with stainless steel appliances and brand-new furniture. Perfectly clean sink. No odor of rot from the garbage disposal.</p><p>The scent signatures were old. She hadn’t been in the house for two days, at least.</p><p>“Interesting,” Raphael said.</p><p>I came to stand by him.</p><p>A large dent marred the living room wall just below a painting of some geometric shapes. A stain spread about it. Below, shards of broken glass glinted, weakly catching the daylight from the windows, among shriveled green stems. Someone had thrown a vase against the wall.</p><p>“How tall is she?” Raphael asked.</p><p>“Two inches taller than me.”</p><p>“It might have been her then. I’d hit a lot higher.”</p><p>We look at the stain. “She was angry,” I said.</p><p>“Very.”</p><p>“Not a lover.”</p><p>Raphael nodded. “White flowers.”</p><p>I inhaled, sorting the pollen aroma: barely noticeable scent of white lilies, light perfume of carnations, sweet fragrance of snapdragons, dryness of baby’s breath . . .</p><p>“Sympathy arrangement,” we both said at the same time.</p><p>I crouched by the pile of stems and dug through it. My fingers slid against a damp rectangle. I pulled it free: a small card with a logo, a snake coiling around a wineglass. The letters under it said, “Bright Light Hospital, Thaumaturgy College of Atlanta.”</p><p>I opened the card and read it out loud. “I am so sorry. Ben Rodney, MD, CMM.” Doctor of Medicine and Certified Medical Mage.</p><p>Raphael bent down and tapped the card. “Alex was a patient there. I know what this is: when there is nothing more they can do, they send you the ‘set your affairs in order’ flowers.”</p><p>“She was dying.”</p><p>“Looks that way.”</p><p>“At least we’ve established the connection between her and Alex.” I looked at the card.</p><p>We searched the rest of the house. In the office we found a filing cabinet full of medical records. Spider Lynn was diagnosed with Niemann-Pick disease, type C. A progressive, incurable disease, it affected her spleen and liver and damaged her brain. Simple things like walking and swallowing had become increasingly difficult. She had trouble looking up and down. Her vision and hearing were fading. Soon she would be a prisoner in her own body, and then she would die.</p><p>“Come see this,” Raphael called.</p><p>I followed him to the library. Open books covered the floor. Raphael picked up one. “And so Hades seized Persephone and bore her away in his chariot to the depths of the bleak realm of the dead. In vain her mother, the generous Demeter, searched for her daughter. Alone the Goddess of Harvest wandered the world, clothed in rags, like a common woman, and in her sorrow she had forgotten to tend to the soil and cultivate plants. Denied her precious gifts, the flowers withered on their stalks, the trees shed their leaves in mourning, and everything that had been green and alive shriveled and died. Winter had come upon the world and the people wailed in hunger. Even the golden apples in Hera’s orchard had fallen off the bare branches of the sacred tree.”</p><p>“Cheery.” I checked a couple of other books. “Same thing.”</p><p>“This one is in Greek.” Raphael held up a huge, dusty tome and pointed to the page. On it was a picture of an apple.</p><p>“So she is obsessed with Hades and apples. What do we know about these apples?” I looked through the book.</p><p>“Here’s one,” Raphael said. “‘Eris, the Goddess of Discord, alone was not invited to attend the wedding. Quietly she sulked until, consumed by her need for revenge, she picked a golden apple, wrote “Kallistri,” meaning “To the Fairest,” upon its golden skin, and tossed it in the midst of the celebrating Olympians. And thus began the Trojan War . . .’”</p><p>“Well, that was slick, but it doesn’t help us any.” I searched through my book. “Here is the eleventh labor of Hercules. He needs to get the golden apples of immortality from Hera’s orchard.” I stopped and looked at Raphael.</p><p>“Immortality apples,” he said. “How about that.”</p><p>I tapped the book. “What do we know so far? Spider Lynn is terminally ill. She’s obsessed with apples of immortality, probably because she thinks they can cure her. She’s holding the shade of Alex Doulos hostage for unknown purposes. Alex was the priest of Hades.”</p><p>“Hades stole Persephone, who was the daughter of Demeter, Goddess of Harvest, who controlled the seasons, which affected Hera’s apples of immortality. It’s like playing six degrees of separation.” Raphael flipped through his book. “It says here that apples are the food of the gods. They and ambrosia keep the gods young and immortal. What do you suppose happens if that bitch eats them?”</p><p>“Nothing good.” We had both dealt with two wannabe gods during the flare. I still had nightmares. I could tell by Raphael’s face that he didn’t care to repeat the experience either.</p><p>“We’re going to have to break into that house.”</p><p>“Yes.” Raphael’s face was grim.</p><p>A house guarded by a giant hellhound, surrounded by an electric fence and a strong ward, and hiding at least three vampires, piloted by a woman overcome by anger and terrified of death.</p><p>It’s good that I had Boom Baby.</p><p>We stood leaning against the Jeep, on the very edge of Cerberus’s territory, waiting for the magic to drain from the world. Raphael leaned next to me, still engrossed in the book of Greek myths. He read, playing with a small knife, flipping it absent mindedly with his left hand, his fingers catching whichever end happened to point down. Tip, handle, tip, handle. The sun set, bleeding orange blood onto the pale sky. I sampled the evening breeze and petted my giant gun.</p><p>Being a professional meant you nurtured your fear. You struggled with your terror until you tamed it and made it serve you. It made you sharper and helped you stay alive. But no matter how tame your fear became, it still gnawed on your soul. I didn’t want to go into the house full of vampires. I didn’t want Raphael to be hurt.</p><p>I had fought so hard not to fall for him, but I had anyway, and now, having been with him, having woken up next to him, I knew we had something. It was a very small, fragile something, and I would rip through a hundred vampires to keep it safe.</p><p>“You’re my Artemis,” Raphael said.</p><p>I blinked.</p><p>“Fierce, prickly, beautiful huntress, forever pure and uncompromising.”</p><p>Prickly? More like bitchy. “I’m not that pure.”</p><p>He leaned over. His hand brushed the back of my neck and I felt the light press of teeth on skin. Every nerve in my body tingled. My nipples went tight, and a slow, hungry heat blossomed below my stomach.</p><p>Raphael’s voice was a smooth whispery seduction in my ear. “There is nobody to see us for miles and miles, but you’re blushing. How is that not pure?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His smile was pure sin. I shifted closer to him and leaned against his chest, resting my head on his shoulder. He stiffened, surprised, and I snuggled closer, soaking up the warmth of his body with my back. He raised his arm and put it around my shoulders. I concentrated and heard the steady beating of his heart, strong and a little too fast. He was anxious, too.</p><p>“If we get out of this mess alive and undamaged, would you like to spend the night in my apartment or do you want me to stay with you?”</p><p>“Either way will work,” he said softly.</p> <p>The six-month storming of my castle had put a definite dent in Raphael’s body armor. It would take me a long time to convince him that he didn’t have to be charming, witty, and sexy around me twenty-four-seven. Some part of me had hoped that once we had sex, everything would smooth itself out. But in the end, he was still insecure and I was still broken. Sex was simple. Being together was a lot more complicated.</p><p>We stood together and watched the sunset.</p><p>The magic crashed.</p><p>“Time to pry Doulos’s shade from that bitch,” Raphael said.</p><p>“You realize that if we’re right and Cerberus is after his corpse, he will follow Doulos wherever we take him?”</p> <p>“Yes. But my mother deserves to say her good-byes.”</p><p>He took off his clothes, stood still for a moment, the breeze fanning his perfect form, and opened his mouth. A groan broke free, deepening into a hair-raising growl, as his body stretched and thickened, hard muscle encasing it. Fur sheathed him. He glanced at me and his eyes were completely wild.</p><p>I lifted Boom Baby. Raphael picked up a six-foot metal pole he’d wrenched from the slope on the way here. We headed down through the ravines to the house.</p><p>“Those bullets are the size of a dollar bill,” Raphael said.</p><p>“They are Silver Hawks: armor-piercing, incendiary, explosive, silver-load cartridges. They slice through armor, set things on fire, and explode inside the target, delivering a load of extremely potent silver pellets. Boom Baby fires two hundred of these per minute.”</p><p>An excited snarl rolled ahead of us. The ground trembled in sync with the beat of the giant paws.</p> <p>“Can they handle the dog?” he asked.</p><p>“We’re about to find out.” I raised Boom Baby. “Here, Fido . . . Here, boy . . .”</p><p>Ahead, Cerberus rounded the curve and charged us.</p><p>I squeezed the trigger. A high-pitched whine of bullet flurry ripped through the air. Boom Baby bucked in my hands, the recoil hitting me hard. The bullets bit into Cerberus’s chest, punching through the muscle to the heart. Blood flew. The great hellhound ran three more steps, not realizing the lethal swarm had already shredded his life, stumbled, and fell, paws over head. He rolled and slid to a stop five feet from me in a smoking ruin.</p><p>“Nice gun,” Raphael said.</p><p>Five minutes later we reached the electric fence. Raphael braided the fingers of his hands together and offered them to me like a stepping stool. I stepped, pushing hard, and he threw me, adding his strength to my jump. I shot over the fence, flipped in the air, and landed in the dirt. Boom Baby came flying next. I caught it and gently lowered it to the ground. In the cramped quarters inside the house, it would restrict my movements too much. I pulled out my P226s, the familiar weight of the twin firearms reassuring in my hands. Raphael took a running start, pole in hand, and vaulted over the fence, landing gracefully next to me. There were times when Lyc-V came in handy.</p><p>We jogged to the house and I pressed against the side. Raphael hammered a single kick to the door and it flew off its hinges, crashing into the darkness. I cleared the doorway and stepped into the gloom. The door led to a narrow foyer. On the right, stairs led to the second floor. Straight ahead lay a hallway and past it, through a doorway, a sitting room waited steeped in the twilight, the dark bulky shapes of furniture like the spines of sleeping beasts.</p><p>The nauseating stench of undead flesh laced my nostrils. It clung to the floor, permeating the carpets. If smell had color, this reek would drip from the draft in oily, fat drops of black. It was impossible to tell where it came from.</p> <p>A moment later I caught another scent entirely: the bitter, clinical scent of embalming fluid. A human body waited for us somewhere in the house.</p><p>My eyes adjusted to the low light. We padded through the foyer on silent feet, cleared the doorway, and emerged into the hallway.</p><p>Slow and steady, room by room. An undead waited at the end of this race, and I had a feeling it would find us before we found it.</p><p>Two small, musty rooms later, we stepped into the family room. The old furniture had been haphazardly piled at the walls. In the center of the room, on the filthy old rug, lay the corpse of Alex Doulos. A huge chain caught the body’s ankle, binding it to a rod driven into the floor.</p><p>Two red-hot eyes sparked in the heap of furniture at the opposite wall.</p><p>I fired. The first two bullets punched the bloodsucker’s head.</p><p>The vampire leapt.</p><p>My guns spat thunder and bullets in a lethal rhythm, trailing the bloodsucker as it hurtled through the air.</p><p>Raphael lunged from the left, and I raised the guns’ barrels up a fraction of a second before he fell onto the vamp from behind. The bloodsucker went limp in his hands. My bullets had chewed its skull to mush. Raphael grasped the vamp’s chin, exposing the neck; his knife flashed, and the head went flying across the room.</p><p>I reloaded. The bloodsucker had been unpiloted. Its eyes had been too crazed and it attacked me straight on, without any consideration for the fact that there were two of us. Spider Lynn was gone. She had left the vampire to us as a present.</p><p>It took us ten minutes to search the rest of the house. Empty as expected. I didn’t think she would sacrifice another vampire. We did find the generator and I shut it off, cutting the power to the fence.</p><p>We returned to the body. Alex lay on his side, thrown on the floor like a dirty rag. Death had robbed him of warmth, but his features still kept hints of his personality: a network of laugh lines around the eyes; strong chin; wide, tall forehead. His hair was pure white and worn long enough to reach his shoulders. A small green object lay by him. I picked it up. A little toy car. How odd. I tucked the car into my pocket.</p><p>We had to take him out of this terrible place. Raphael touched the chain securing Alex’s ankle and jerked his hand away. A silver-steel alloy.</p><p>The chain clasped Alex’s ankle too tightly. Neither one of us could get it off without burning all the meat off our fingers. I ripped fabric off the nearest couch, wrapped it around the rod the body was chained to, and strained. It didn’t even shiver.</p><p>“Let me.”</p><p>Raphael grasped the rod. Veins on his face bulged and he ripped it free. He slung the body over his shoulder and let the chain trail behind him. It would have to do.</p><p>It took us three hours to cross the city. We drove through the dilapidated remnants of the industrial district and left Atlanta behind. Woods replaced ruins. The road grew bumpy. Neither of us said anything. The corpse wrapped in a blanket and resting in the backseat kept me from talking, and Raphael seemed immersed in thought.</p><p>Cold wind fanned us. The night was vast and filled with a flurry of scents. A sprinkling of stars shone high above, indifferent to us and our little problems.</p><p>Thirty minutes later we pulled onto the side road, dipping into the dense forest. The dirt road veered, we turned, and a large ranch-style house came into view. The bouda house. Usually it was full of life: sentries prowled the woods, and insane laughter floated on the wind currents, mixing with moaning and snarls of sexual release. But now it lay quiet. Raphael had said that everyone had left, letting Aunt B grieve in private, but it didn’t hit home until I actually saw it.</p><p>A woman waited for us on the porch, her hands crossed under her breasts. Middle-aged and plump, she wore her hair atop her head in a bun. Careworn shadows distorted her usually happy face. She looked like a very young grandmother who had just realized her grandson’s school bus was ten minutes late.</p><p>We parked. Raphael hopped out and gently picked up Alex’s body. Alex’s white hair spilled over Raphael’s shaggy arm. Aunt B looked on without a word as the monster who was her son and my mate carried her lover’s body to her and held it out. A single word escaped his monstrous mouth. “Mother . . .”</p><p>Aunt B’s lips trembled. She slumped against the porch post. Her shoulders shook and she covered her mouth with her hand. Tears swelled in her eyes. No sobs escaped her lips. She simply stood there and cried, grief plain and raw on her face.</p><p>What do I do? She was the bouda alpha. Alphas didn’t . . . they didn’t show weakness. They didn’t cry.</p><p>She was just a woman.</p><p>I walked up on the porch and hugged her. “Let’s take him inside.”</p><p>For a moment I thought she would snap my neck, and then she nodded wordlessly and I opened the door. We took him in and laid him to rest on a table in the back room. She sank into a chair next to him. Raphael sat on the floor next to her and she stroked his head.</p><p>I went into the kitchen, brewed herbal tea, and took it to her. Raphael was gone and Aunt B sat alone. Her face was wet with tears. Her eyes glanced at me. Still sharp and hard. She took the cup. “Thank you.”</p><p>I nodded, not knowing what to do with myself.</p><p>“Are you and my son together?”</p><p>Everything inside me clenched, reminding me I was beastkin and she was the boudas’ alpha. “Yes.”</p><p>“That’s good,” she said softly. “I always liked you.” She glanced at Alex. “Make the best of it. The way we did.”</p><p>The magic surged, drowning us. The outline of Alex’s body shimmered. A pale glow broke free of the corpse and congealed into Alex Doulos. He saw Aunt B. His voice was like the whisper of dry leaves underfoot. “Beatrice?”</p><p>“Yes,” she said softly.</p><p>I tiptoed out of the room.</p><p>I found Raphael outside, on the porch. Too bulky to fit into a chair in his warrior form, he sat on the floor. Hard knotted muscle corded his back. His long arms lay folded on his knees and the claws of his right hand protruded, crisp in moonlight.</p><p>He truly looked monstrous. Just like the secret me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sat next to him.</p><p>“If I die, will you grieve for me?” he asked.</p><p>“Yes. But before I do that, I’ll fight to save you.”</p> <p>“Why?”</p><p>I put my hand onto his furry forearm. “Because I feel good when you’re near me. It’s not just sex, and it isn’t loneliness, it’s more than that. It’s kind of frightening. I think that’s why I fought it for so long.”</p><p>The lawn before us seemed to go on forever, each grass blade slick with reflected moonlight. Soon Cerberus would come running, his paws mashing big ugly holes in the perfect grass.</p><p>“Do you think we’ll ever have what they had?” he asked.</p><p>“I don’t know. I think what they had grew over many years. We still have a lot of things to work out. But I’d like to try, Raphael. When I said you’re mine, I meant it. I don’t do things halfway. For better or worse.”</p> <p>We heard light footsteps. The door opened. “He wants you,” Aunt B said.</p><p>Alex Doulos had a soft, kind voice. “My time’s short,” he said. “Do you know the myth of Hades and Persephone?”</p><p>“Yes,” Raphael answered.</p><p>“Good. That will make things simple then. I’m a priest of Hades. My family has served him for generations. One of our duties is to tend to secret shrines of Hades. They’re scattered all over the world and kept hidden. During the flares, one of the shrines randomly grows an apple tree, which bears fruit.”</p><p>“Hera’s Apples,” I said.</p><p>Alex motioned with his arm. “The Vikings call them Idun’s Apples, the Russians call them Apples of Youth, and we call them Persephone’s Apples. The name doesn’t matter. The apples are supposed to grant youth and long life span to gods. When eaten by normal humans, who don’t have Persephone’s gift or immunity to it, the apples produce horrible consequences. That’s why we guard the tree until the apples ripen and sacrifice the fruit to Hades. No part of the apples must remain in our world. It is my duty to make sure the apples are destroyed. It’s the purpose of my service. But I’ve failed.</p> <p>“My body was kidnapped by a woman who calls herself Spider Lynn. She’s dying and she wants the apples for herself. She mustn’t eat them. It’s very, very important. She must not eat them.”</p><p>“Where is Lynn now?” I asked.</p><p>“I imagine she’s at the shrine. It’s in the woods behind my summer house. Raphael, you remember, we had a cookout at that house last year.”</p><p>I glanced at Raphael. “It’s across the wood, bordering our territory. Not too far,” he said. “How did she know the location of the shrine?”</p><p>Alex’s shade shuddered. “I told her. She realized that she couldn’t compel me to reveal it and she kidnapped my nephew. His parents are away and I was watching the boy. I couldn’t let the vampires hurt the child.”</p><p>I pulled the green toy car from my pocket. “The boy . . .”</p><p>“Yes,” Alex confirmed. “It’s his. Raphael, I know that you’re not my son and you owe me nothing. But I beg you, please, don’t let her get the apples. Save the boy. And whatever you do, don’t eat them.”</p><p>“I’ll do it,” Raphael said simply.</p> <p>“The shrine’s guarded by a serpent, but it won’t last against Spider Lynn’s vampires for long. Take the bracelet off my arm. It’s keyed to the ward that’s guarding the shrine. Lynn has enough magic to force herself past the defensive spell, but it will leave her weakened. She’ll need time to recover. You won’t.”</p><p>A deafening roar shook the house. Cerberus had found us.</p><p>“He’s come for me.” Alex smiled. “It’s time to go. Take the bracelet. It will unlock the ward and let you pick up the apples.”</p><p>Raphael slipped the simple metal loop off the corpse’s right wrist and placed it over his own. The bracelet barely enclosed two thirds of his wrist. “Are you really going to Hades?”</p><p>“I don’t know,” Alex said. “But the last of my power is fading. My body is dead, Raphael. I can no longer hold on to it. Earth is the home of the living, not the dead. Don’t mourn me. My life was full and well lived. I was fortunate. Some might even say blessed. I only wish that I had lived a few days longer so I could destroy the apples myself instead of forcing this burden on you. That and your mother’s tears are my only regrets.”</p><p>Aunt B rose, picked up the corpse, and strode outside. We followed her. She walked onto the lawn. They said something to each other, too quiet to hear, and then she lowered him into the grass and stepped away.</p><p>The trees rustled. A giant shape muscled through the trunks and trotted into the open, its three heads close to the ground. The center head sniffed Alex’s body and picked it up, clamping it in its great fangs.</p><p>“Take care of your mother, Raphael,” a ghostly voice called out.</p><p>The body burst into flames. The great dog howled and vanished.</p><p>Raphael’s eyes shone once, catching the moonlight. “Are you with me?”</p><p>“Who else will protect your furry butt?”</p><p>“I’m coming, too,” Aunt B said.</p><p>Raphael shook his head. “We’ve got this.”</p><p>Her eyes flashed with red, a precursor to an alpha stare.</p><p>“He didn’t want you involved,” Raphael said. “He asked me, not you. The clan needs you.”</p><p>“We’ve got it.” I nodded.</p><p>We turned our backs on her and headed to the Jeep. “Did we just defy your mother, who’s also your alpha?” I murmured.</p><p>“Yes, we did.”</p><p>I glanced over my shoulder and saw Aunt B standing there with a bewildered look on her face. “Let’s go faster before she realizes that.”</p><p>The magic was up and Boom Baby was useless. I took a crossbow and bolts from the Jeep and followed Raphael into the woods. He broke into a run, inhumanly fast in warrior form, and I struggled to keep up.</p><p>Half a mile later Raphael stopped. “The magic is up,” he said softly.</p><p>“I know.”</p><p>“You’re slower in this form.”</p><p>I had run as fast as I could. When we were both in human form, I was faster. But in warrior form, he beat me.</p><p>“You can’t keep up.”</p><p>I realized what he was saying. “No.”</p><p>“Andrea . . .”</p><p>“No!”</p><p>“We’re short on time,” he said. “There’s a little boy out there with at least two vampires. We don’t even know if he’s alive.”</p><p>My heart hammered in my chest. “You don’t understand. I lose control when I’m her.”</p><p>“Andrea, please,” he said. “We’re losing time.”</p><p>I closed my eyes. He was right. We had to save the boy. We had to get the apples away from Lynn. I had to . . .</p><p>I stripped off my clothes and reached to the beast living inside me. She smiled and leapt out, flowing over my arms, my legs, my back, giving me her strength. My bones stretched, my muscles swelled, and there I stood, revealed and naked.</p><p>The shapeshifters got a choice: human, warrior form, or animal. I had only two: the human me and the secret me.</p><p>Raphael’s eyes shone with red. He ran.</p><p>I swiped up my crossbow and then dropped it. My claws were too long. I wouldn’t be able to work it. I’d have to fight with my claws and teeth. I grabbed the little toy car and hid it in my fist.</p><p>Raphael was a mere shadow in the distance. I burst into a run. It felt like flying, light and easy. My muscles welcomed the exertion and I sprinted, catching him with ease. Together we dashed through the woods, two humanoid nightmares, fast and slick, our voices faint whispers on the draft.</p><p>“I can’t see you.”</p><p>“I don’t want you to see me.” I purposely picked my way so he caught only the mere flashes of me.</p><p>“Don’t hide from me,” he asked.</p><p>I ignored him.</p><p>Suddenly he burst through the brush. I had no chance to hide. He saw all of me: my limbs, my face that was neither animal nor beast, my breasts . . .</p><p>“You’re lovely,” he whispered as he passed me in a burst of speed.</p><p>“You’re sick,” I told him.</p><p>“You’ve a perfect union of human and animal: proportionate and elegant and strong. Your form is what we aspire to. How’s that sick?”</p><p>“I’m a human!”</p><p>“So am I. You don’t have to hide from me, Andrea. I think you are beautiful.”</p><p>Nobody, not human, not shapeshifter, not even my mother had ever told me that the beast form was beautiful. Inside me, the human me put her hands on her face and cried.</p><p>Miles flashed by. We passed a house in a blur of speed. Trees parted, underbrush snapped, and we burst into a clearing. A ward ignited with gold, barring our way in a translucent wall.</p><p>Inside the ward, a dark-haired boy crouched on the ground, hugging his knees. Past him a dead vampire lay broken on the grass, its skull shattered. To the left, an unnaturally large snake was dying on the grass, a second vampire caught in its coils. The vamp’s neck was broken, its vertebrae crushed. Blood drenched the snake’s coils. With each new squeeze, more blood washed the scales.</p><p>Past them, a ring of colonnades carved of pure white stone guarded a narrow apple sapling. Four yellow apples hung from the branches. The fifth apple, with a small piece bitten off, lay on the grass, by the hand of a dark-haired woman. She slumped on the grass. Her horribly distended stomach had ripped through her tailored slacks.</p><p>Oh no. She ate it. We were too late.</p><p>“Now look what you did.” A man walked up to us, his eyes fixed on Spider Lynn. “I done told you to leave the apples alone.”</p><p>Raphael snarled. The fur on his back rose.</p><p>The man was tall and broad-shouldered, built with strength in mind. Dark stubble peppered his face. He wore a white T-shirt, a pair of old jeans, and yellow work boots. A flannel shirt hung from his blocky shoulders. He looked like a good old boy in search of a porch with a rocking chair and a glass of iced tea. He turned to us and said, “Hi.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was surreal. “Who are you?” I asked.</p><p>“I’m Teddy Jo.”</p><p>“You’re the man who called me about Raphael running from Cerberus?”</p> <p>“I called Kate,” he said. “You answered the phone. Do you have the bracelet?”</p><p>“What?”</p><p>“Doulos’s bracelet. You have it?” He saw the bracelet on Raphael’s arm. “Oh good then. We’re in business.”</p><p>Lynn squirmed on the grass and began to cry. “What is happening to me?”</p><p>Teddy Jo glanced at her. “You’ve brought this on yourself.”</p> <p>Raphael lunged at him. His clawed fingers closed about Teddy Jo’s throat, the bracelet glinting with steel on his forearm. “What are you doing here?”</p><p>“Well now, you might want to rethink that,” Teddy Jo said, raising his arm. His sleeve fell back, revealing an identical bracelet, but made of gold. “Given as we’re on the same side.”</p><p>Magic slammed my senses. Teddy Jo’s eyes turned solid black. The flannel shirt ripped on his back and two colossal black wings thrust into the night. Fire ran from his bracelet down into his hand and snapped into a flaming blade.</p><p>“Thanatos,” Lynn squeaked.</p><p>The angel of death clamped Raphael’s wrist and squeezed. Raphael bared his teeth and crushed Thanatos’s throat.</p><p>Lynn’s stomach twisted. She howled as if cut. Alex’s nephew jerked.</p> <p>“Stop!” I barked at the two men. “There’s a kid in shock sitting behind that ward, locked with whatever is about to crawl out of Lynn’s gut! Raphael, break the damn ward. Teddy Jo, I swear, you don’t let go of him this instant, I’ll rip your wings off!”</p><p>The two of them stared at me.</p><p>“Do it!”</p><p>Teddy Jo let go. Raphael thrust his arm into the ward and the wall of gold drained down, revealing the shrine.</p><p>I leapt inside and swept the boy up into my arms. “Listen to me.”</p><p>He stared at me with empty eyes. To him I was a monster.</p><p>I opened my hand and showed him the car. He touched it gently and I handed it to him. “I won’t hurt you. Uncle Alex’s house, do you know where it is?”</p><p>He nodded.</p> <p>“I want you to run to it and not look back. Okay?”</p><p>He clutched the car in his fist. I set him down and he ran.</p><p>Raphael snarled at Teddy Jo. “What the hell are you doing here?”</p><p>Teddy Jo shrugged his massive wings. “I’m here to set things right. I serve Hades just like Doulos, except that he was a priest and I’m something other.”</p><p>“Where were you until now?”</p><p>“Look, fella, I follow the rules. I would have liked to come down earlier and start chopping people’s heads off, but I have to sit on my hands and wait until someone bites the damn apple. I’m the emergency brake here. That’s what makes me the good guy.”</p><p>Lynn screamed.</p><p>“And there she goes,” Teddy Jo said.</p><p>Lynn’s stomach tore. A slithering green mass spilled forth, and as it boiled out, Lynn was sucked in, almost as if her body had turned inside out. The mass grew larger and larger, bigger than a house, bigger than Cerberus. Scales formed on its surface. Magic roiled inside it, whipping my senses into overdrive.</p><p>The mass flexed and uncoiled. An enormous reptilian body thrust across the clearing. Three dragon heads snapped at the air with wicked teeth, jerking on long necks.</p><p>The dragon tasted the night and roared.</p><p>Teddy Jo shot straight up and hovered, his sword a beacon of light. “I’ll take the center head. You two do as you please.”</p><p>Lynn the dragon whipped about and I saw her eyes: cold and green, devoid of any humanity or feeling. Something inside me snapped. Fury drowned the world, flushing the rational thought. I was very angry. She had stolen the body of a man, denying his mate her mourning. She had tortured that man. She had kidnapped and terrorized a child. She deserved to die.</p><p>Teddy Jo swept at the dragon. The flaming sword carved through her neck like it was butter. The head tumbled down in a whiff of scorched meat. Then the stump quivered and split in half, and two new heads sprouted in its place and lunged for Teddy Jo.</p><p>“A hydra! Gods damn it!” Teddy Jo veered out of the way.</p><p>I smelled her flesh, waiting for me just beneath her scales. My fingers flexed. My tongue licked my fangs. Rage warmed me from the inside, hot and sharp and so very welcome. Andrea, the knight of the Order, would have to sleep through tonight. Tonight I was beastkin, the daughter of a hyena.</p><p>The dragon’s flesh beckoned, elastic and smooth, coiling before me, begging for a taste.</p><p>The world went red. I charged.</p><p>Blood. Rip, claw, rip, rip, more, dig, dig into flesh.</p><p>A huge, pulsating sac swelled before me. I sliced into it, laughed when blood drenched me, and kept ripping. All around me, wet, hot redness shuddered.</p><p>“Enough!” A force clamped me and tossed me aside. I flew through the air, landed on all fours, and charged my assailant. He tripped me and I fell. The air burst from my lungs in a rush. My head swam.</p><p>The reality came back with ponderous slowness. I lay on my back in the grass, my body slick with reptilian blood. Slowly the rage faded and I saw Raphael.</p><p>“Are you hurt?” I asked him.</p><p>“Nothing dire.”</p><p>The dragon’s corpse lay on its side, a dozen half-formed heads sprawling like the stalks of some disgusting flower. A big hole gaped in her gut. It looked like someone had tunneled through her. Teddy Jo stood bent over near her, breathing hard.</p><p>“Did I do that?”</p><p>Raphael nodded. “You ripped apart her heart. That’s what finally killed her.”</p><p>“The apples.” I tried to get up, but my legs refused to obey.</p><p>Raphael scooped me up. “Are you okay?”</p><p>“Overdid it.” Drowsiness swept over me. My muscles turned to cotton. I stuck my ugly head against his neck. I felt dirty and awful. My stomach clenched.</p><p>If he hadn’t pulled me out, I would’ve cut and sliced until I passed out.</p><p>Slowly it sank in: we won.</p><p>“I’ll take care of the apples,” Teddy Jo said. “You take your lady home.”</p><p>Raphael looked at him. “Good fight,” he said.</p><p>“Yeah,” Teddy Jo answered. “We didn’t do too bad. I live down in the Warren. Look me up if you wanna have a beer some time.”</p><p>Raphael carried me off.</p><p>“Don’t forget the boy,” I whispered.</p><p>“I won’t. We’re going to get the boy and drop him off with my mother. Then I’ll take you to my house. I have a garden tub. We’ll get nice and clean and then crawl into our bed and sleep until noon. Would you like that?”</p><p>“Very much,” I said and licked his neck. “Raphael . . .”</p><p>“Yes?”</p><p>“I killed them. The boudas who tortured me and my mother. I went back after Academy, and I challenged them and killed them all one by one.”</p><p>He licked my cheek. “Come home with me,” he said simply.</p><p>I held on to him and whispered, “You couldn’t keep me away.”</p><p>No matter what job a man has, he always ends up hating parts of it. Now, I loved my job, the sword, the wings, the chopping off the evildoers’ heads and all, but I bloody hated flying down to Savannah. Every time I swung this way, I hit wet wind off the ocean flying through Low Country. It ate its way through me all the way to the bone. Enough to give a man the liking for one of those dumb-looking paratrooper jump-suits.</p><p>It took me a bit of time to finally find the right house in the predawn light, a small place with white siding and green roof, nothing special except for the damn industrial-strength ward on it. I circled it once and felt the magic defenses go down: Kate had seen me. Nothing to do but land, which I did, right on the path before the porch.</p><p>Kate sat on the porch with a book on her lap. She was on the pretty side, tan, dark-eyed, dark-haired. Exotic, even. Didn’t look like she was from around here, but then who did nowadays? Her sword lay next to her, a pale sliver. I paid attention to her eyes and the sword. She was a bit quick on the trigger with it.</p><p>“I always knew there was something odd about you, Teddy Jo,” she said, nodding at my wings.</p><p>“Likewise.”</p><p>I felt the magic coil about her. Too much power there. Way too much. She hid it well, though.</p><p>“How did it go?”</p><p>I shrugged. “Killed the snake responsible. Everybody’s alive. Your friends are in one piece. I expect they’ll celebrate in bed once they sleep it off.”</p><p>She arched an eyebrow. “They were together? Like together-together?”</p><p>“Looked that way to me.”</p><p>A grin bent her lips. Why now, she had a pretty smile. Who knew?</p><p>“I’ve got something for you here,” I said, and showed her a sack of apples.</p><p>She closed the book and set it aside. The title read, Lion, King of Cats: Exploring the Pride. I handed her the sack.</p><p>“Couldn’t find anybody else immune to Persephone’s immortality?” She chuckled.</p><p>“You guys don’t exactly grow on trees. I tried burning them, but fire does nothing to the damn things.”</p><p>“That’s because they are meant to be eaten or sacrificed.” She picked up her sword, cut a small chunk, and popped it into her mouth. “Tart. Think they’ll keep for a week? I’ve got company coming next Friday, and I’d like to make them into a pie.”</p><p>“Can the company handle Persephone’s Apples?”</p><p>“He can.”</p><p>I made of note of that he. Didn’t know there was anybody else in the area immune to Persephone’s Gift. If I had to put money on it, I’d bet it was the Beast Lord. Magic was a funny thing. The older it was, the stronger it was. True, Hades’ fire-power was of an ancient variety, but the magic Kate threw around was so much older, it gave me a start the first time I felt it. Now, I’d seen the Beast Lord once. He’d passed by me and I about choked. The magic that rolled off him was even older than Kate’s flavor. Primeval—not your regular shapeshifter. Enough to give a man a complex. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>“I don’t see why they wouldn’t keep,” I said aloud. “Damn things are near indestructible.”</p><p>She lifted the sack. “Thanks!”</p><p>“Thank you.”</p> <p>I pushed from the grass and shot into the sky. The sun was rising. Its rays warmed my wings and I headed back toward Atlanta. I had had a hard night. It was time to get home, drink me some coffee, and feed my dogs. Cerberus made sweet puppies, but the damn things sure ate a lot. </p>  </body></html>"]