["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Engrossed as she was in Glamour's Do's and Don'ts, Jeannie Lawrence scarcely noticed when the elevator jolted to an abrupt halt. She did notice when the lights went out.</p><p>\"Oh, come on!\" she cried, slapping her magazine shut. Getting stuck in an elevator during a power outage was nowhere on her to-do list. Today, anyway.</p><p>\"Not now,\" a voice muttered, and she nearly shrieked. She hadn't known anyone else was in the elevator with her. When she had her nose in a book or magazine, she wouldn't have noticed if Barney the Dinosaur was in the elevator with her.</p> <p>\"Well, this is a fine fix, huh?\" she asked the voice. \"Of all the days to drop my ad copy off early! I guess it's true—no good deed goes unpunished. What are you going to be late for? Me, I'm trying to beat the rush hour traffic to the bridge. I can't stand it when—\"</p><p>\"Hush.\"</p><p>The voice was a pleasant baritone, one she liked despite its abruptness. She hushed, not offended. Some people didn't like talking to strangers. Or maybe this guy was claustrophobic. Or—what was fear of the dark? Darkophobic? Whatever it was, he was clearly unhappy to be trapped in an elevator for who knew how long. Poor guy. She hoped he didn't get the screaming meemies. There was nothing worse than a grown man having hysterics.</p><p>\"Sorry,\" she said, then added, \"I'm sure we won't be here long.\"</p><p>She heard a sound and recognized it immediately: the man trapped with her had taken a couple steps back. Almost as if he was trying to put as much space between them as he could.</p> <p>Exasperated, she said, \"For crying out loud! I don't have cooties. Anymore,\" she added, hoping to lighten the mood.</p><p>\"Be quiet. And step into the far corner. Now.\"</p><p>\"The hell I will!\" She turned toward the voice. \"Look, just because you're feeling antisocial doesn't mean I—\"</p><p>\"Don't.\" No pleasant baritone that time. That one sounded like a growl, like he'd forced the word out through gritted teeth. \"Don't come near me. Keep away. When you move, you stir around the air currents and I get more of your scent.\"</p><p>\"And that's bad, right?\" Great, she thought with grim humor. Trapped with someone who skipped his medication this morning. Why didn't I take the stairs?</p><p>\"No. It's not bad.\" His voice, low in the dark, was a throbbing baritone she could feel along her spine. \"It's . . . extraordinary.\"</p> <p>\"Gosh, thanks.\" Uh-huh. Clearly a nutcake, sexy voice or no. She hadn't had time to put perfume on after her shower. He couldn't smell a damn thing, except maybe a lingering whiff of Dial soap. \"Do you have a special doctor you tell these things to? Someone you should call when we get out of here?\"</p><p>He barked laughter. \"I'm not insane. I'm not surprised that's the conclusion you've drawn, though. What is your name?\"</p><p>\"Jane Doe.\"</p><p>He chuckled softly. \"What harm could it do to tell me your real name?\"</p><p>\"All right, but only if you promise not to freak out on me. More than you already have, I mean. It's Jeannie Lawrence.\" There were a million Lawrences in the greater St. Paul area, she comforted herself, so if he was a serial killer he likely couldn't track her down when this was over. \"Now remember, you promised . . .\"</p><p>\"Actually, I didn't. Not that promising would have done any good.\" He sighed, a lost sound in the dark. Absurdly, she felt sorry for him, this perfect crazy stranger who talked so oddly and in the sexiest voice she had ever heard. \"You smell wonderful.\"</p><p>\"Don't get started on that again,\" she warned.</p><p>\"The moon's coming. I can feel her.\" She heard him swallow hard. \"There isn't much time.\"</p> <p>\"Boy, have you got that right.\" She put her arms out in front of her, feeling in the dark, then stepped forward and banged on the elevator door. \"Hello!\" she shouted. \"Anybody up there? A nice girl and a raving lunatic are trapped in here!\"</p><p>\"You're ovulating,\" he said directly in her ear, and she shrieked and flung herself away from him, so hard that she bounced off the far wall and would have fallen had he not caught her. Even in her startlement, she was conscious of the easy strength of his hand, in his scent, a crisp, clean, utterly masculine smell that she liked very much, despite her sudden fear.</p><p>\"You—\" Her mouth was dry; she swallowed to force moisture and finished her rant. \"You scared the hell out of me! Don't sneak up on me like that, for the love of—and you can let go of me, too.\" She yanked her arm out of his grip, her heart yammering so loudly she felt certain he could hear it. And what was that absurd thing he had said? Had he really said—</p><p>\"It's too late. You're ovulating,\" he said, his voice a low rumble in the dark. \"You're . . . in heat, to put it a little more crudely. And I'm too close to my change.\"</p><p>\"Then empty your pockets,\" she said rudely. \"Let your change out.\"</p><p>\"You don't want me to do that,\" he said softly. \"Oh, no.\"</p><p>She supposed some women would be reduced to panic at this turn of events, but this weirdo with the sexy voice and strong hands had no idea who he was dealing with. She had a black belt in karate, could drill a dime at fifty yards, and had once put a would-be mugger in the hospital with cracked ribs. If this guy tried anything with her, he was going to have a very bad day.</p><p>\"Look, I'm sorry you're feeling . . . uh . . . unwell, but if you just stay calm, they'll have us out of here in no ti—\"</p><p>With that same shocking suddenness, his hand was behind her neck, tilting her face up, and she could feel his mouth near her temple, heard him inhale deeply. \"You're in heat,\" he murmured in her ear, \"and the moon's coming up.\" He inhaled again, greedily. Frozen by his actions, she waited for his next words. \"I'm very sorry.\"</p><p>Then his mouth was on hers. Pressed against the far wall of the elevator, she could feel his long, hard length against her body, could feel his hands on her, could hear his rasping breath. She had the absurd sense he was wallowing in her scent, glorying in it. And she came absurdly close to relaxing in his embrace, to kissing him back. Instead, moving independently of her brain, her hands struggled up and pressed against his chest, hard, but it was like trying to move a tree.</p><p>\"Oh, Christ,\" he groaned into her hair.</p><p>\"Don't—\"</p><p>\"I'm sorry.\"</p><p>\"—stop it—\"</p><p>\"I'm very sorry.\"</p><p>\"—before I break your—\"</p><p>\"Do you believe in werewolves?\"</p><p>\"—big stupid—what?\"</p><p>\"I'm a werewolf. And my change is very near. Otherwise I might be able to—but the moon's too close. And so are you.\"</p><p>\"What are you talking about?\" she cried.</p><p>\"I'm trying to explain. Why this is going to . . . why this must happen. Don't be afraid.\"</p><p>\"I'm not afraid,\" she hissed, shoving at his chest again. This time, it worked. Or he stepped back.</p><p>\"You're a liar.\" Odd, how he could make that sound like an endearment. \"I can smell your fear.\"</p><p>\"I'm not sure how to break this to you,\" she said through gritted teeth, \"but I'm not afraid of any man. And I don't smell.\"</p><p>\"Not afraid. Anxious, then,\" he soothed. \"I don't blame you a bit. If I was trapped in a box a hundred feet off the ground with a werewolf an hour from his change, I'd be out of my mind.\"</p><p>\"About the werewolf fixation,\" she said, striving for a note of humor—she'd always had a perverse need to make light of any seriousness. \"I confess this concerns me a bit. Perhaps there's a support group that can help. Men-who-love-werewolves-and-the- women-trapped-in-elevators-with-them.\"</p><p>He laughed, a throaty chuckle.</p><p>\"Couldn't you have waited another hour to have your nervous breakdown?\" she complained, pleased that she amused him. If she could keep him distracted, off balance, maybe the power would come back on and she could—</p><p>Then she felt his hands on her arms, gently pulling her forward. \"I am sorry,\" he said, his voice heavy with regret. Again, she caught his pleasant, utterly masculine scent, and again she fought her unwitting attraction. Jeannie didn't plan to let him do anything he'd be sorry for. She took a deep breath and prepared to strike him, palm out, with all her strength. A crippling blow, and, if she nailed him on the bridge of the nose, a killing blow. She hoped she would get him in the forehead or cheek. She didn't want to kill the lunatic. That was her thought as she smashed her hand into his chin and felt him rock backward with the blow.</p><p>\"Ouch,\" he said mildly.</p><p>She felt her mouth pop open in stunned surprise. She hit him, she knew she hit him! Her hand was numb from the force of it. He should be unconscious, or at least groaning on the floor.</p><p>\"That was some punch,\" he continued, as if commenting on a drink and not a blow it had taken her four months to learn. \"You've had training.\"</p><p>\"You're out of your mind,\" she whispered. Or she was. Could it be true? Was he a—ludicrous thought—werewolf? She felt for him in the dark, sure he had to be bleeding, and her fingers encountered his smooth cheek. She jerked her hand away. \"You're completely crazy, you know that?\"</p><p>\"No.\" She sensed him step close to her and threw another punch, no more fooling around—and her fist smacked into his open palm.</p><p>He had blocked her punch. In itself, almost impossible unless he was also a black belt. And what were the chances of being trapped in an elevator in the Wyndham Tower with a crazy man who was also a black belt? More worrisome, he had seen her strike coming. Whereas she couldn't see her hand in front of her face.</p><p>She felt his fingers curl around her small fist, felt his thumb caress the knuckle of her first finger. Her knees wanted to buckle, either from sudden, swamping fear or the sensation his warm fingers were calling forth. \"Brave Jeannie Lawrence,\" he murmured, his voice so low it sounded like tearing velvet. \"What a pity you didn't wait for the next elevator.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Then he deftly swept her legs out from under her and she was falling—but he was coming down with her and cushioned her fall and was on top of her in an instant, his mouth on her throat, his hands busy at her blouse. She shrieked in anger and dismay, raining blows on his shoulders, his chest, his face, and he took them all without being deterred from his task. She heard a rending tear as he ripped her blouse away, tugged at her bra . . . then felt the shock of it to her toes as his warm mouth closed over her nipple.</p><p>She tried to lunge away from him but he pinned her easily with one hand on her shoulders, while the other tore at her clothes. \"I'm sorry,\" he was groaning against her breast, \"don't be afraid, I won't hurt you . . . ah, God, your scent is driving me out of my mind.\" That last ended on a growl, an ominous rumble that filled the dark elevator.</p><p>She drew in a breath to scream the building down—and sobbed instead. He was too strong for her, she was punching him and clawing him and kicking at him and he was barely noticing. This . . . thing he meant to do, it was really going to happen. To her. Daughter of a cop and a Special Forces veteran, a man and woman generous with their teaching, who never wanted their daughter to be a rape or murder statistic. Jeannie could pick a lock and knock out most men with one punch. But she couldn't stop this man from taking her by force. Never mind the fact that her mind kept shrieking that this wasn't happening to her, this was not, was not, was not. It was.</p><p>\"Don't cry,\" he begged, and she could feel his hands shaking as he gathered her against him. \"We'll be done soon. It won't hurt. I'm so sorry to scare you.\"</p><p>\"Please don't,\" she whispered, hating the way she sounded—so helpless, so frightened—but unable to do anything about it. \"Please don't do this.\"</p><p>He groaned again and squeezed her in a rough hug. \"I have to. I'm not mated, I don't have any control over this, just like later I won't have any control over—but you don't believe me, so we won't talk about that.\" His voice was still soothing, and now his hands were beneath her, stroking her back, forcing her chest up, and his mouth was buried in her throat, kissing and licking and even—very gently—biting.</p><p>She could hear his breathing roughen in the dark, heard another rip as her skirt was torn. She remembered herself and struck out at him again, blindly, connecting hard but with no apparent effect. He shredded her linen skirt like it was paper . . . Christ, he was strong! But his hands on her bare flesh were gentle, almost languid. They were everywhere, stroking her skin, sliding across her limbs, and she felt her nipples harden so much it was almost painful. When his lips brushed across one she almost wept with relief, even as she was pushing against his shoulders with all her strength. He rubbed his cheek against that same nipple, his stubble rasping across the sensitive bud, and her fingers curled into fists so she wouldn't touch him with tenderness. She couldn't give in to him, no matter how—</p><p>Stubble?</p><p>He had been clean shaven two minutes ago.</p><p>She shoved that thought away, hard. His rough tongue swept across her nipples, a blessed distraction that made her want to scream, made her want him, and she hated wanting him. She tried to remind herself that this man was raping her, but the only thing she could really understand was that he was making her feel as no one had ever made her feel. She was no stranger to sex, but the only man she had ever been intimate with was her college boyfriend, and that was almost three years ago.</p><p>In the back of her mind, a constant refrain: this isn't happening. It's not real. Ten minutes ago I was on my way home; now I'm having sex in the dark with a stranger. Thus, this is a dream. It can't be happening, ergo it's not happening. Tempting to believe that voice, to give in to the pleasure he could so skillfully offer her, to . . .</p><p>She realized she hadn't hit him in quite a few seconds. That she no longer wanted him to stop. That traitorous thought alone galvanized her into raining more blows on his head, until he caught her wrists and pinned them above her head with one hand.</p><p>\"Enough,\" he said hoarsely, and she cringed, wondering if he was going to hit her back. \"I don't blame you one bit, but . . . enough, Jeannie.\"</p><p>He pinned her knees apart with his own, kept her hands out of his way by keeping them above her head, and bent to kiss her. He jerked back and her teeth snapped together, bare centimeters from his mouth. He could apparently see in the dark like a cat.</p><p>Or a wolf.</p><p>She put the ridiculous thought out of her mind as quickly as she could. That way lies madness. That way lies . . .</p><p>His thumb was stroking the soft cotton of her panties. And moving lower. Her breasts were pressed against his chest, her knees were flat against the carpet, forcing her thighs wide apart, and now his damned fingers were—were—inside her panties. His breathing was so harsh in the dark, almost panting, and she could feel his body thrumming with tension, could hear his teeth grinding together as he fought—what? It was clear he was in the grip of urgent lust, that he wanted to surge inside her and thrust until he could no longer move, but something was holding him back. And now his fingers were delicately brushing the plump lips between her thighs, stroking so sweetly and tenderly . . . and then his thumb slipped between her nether lips while his tongue thrust past her teeth and she nearly shrieked, so intense was her pleasure.</p><p>He groaned into her mouth and then his fingers were spreading her plump folds apart and his thumb was slipping inside her and his tongue was licking, darting, and she sobbed with frustration and strained against him. His fingers danced across her slick flesh, sweetly stroking, probing, oh so gently rubbing a circle around her throbbing clit, a circle that got smaller and smaller . . . and then his thumb was dipping inside her again while his fingernail flicked past her clitoris, and she shivered so hard she nearly bucked him off.</p><p>He growled. The sound did not frighten her. It kindled her blood, made her want to growl back, made her want to sink her teeth into his flesh while his flesh sank into her again . . . and again . . . and again . . .</p><p>She realized dimly that he wasn't growling, he was saying her name, but his voice was so thick and deep she could hardly understand him. \"Jeannie—let your—hands go?\"</p><p>\"Yes!\" she screamed, wild to touch him, to feel his flesh against hers, to rip off his clothes as he had ripped hers. He released her wrists and in a flash her arms were around him, pressing him closer, she was tearing at his shirt, frantic to get the damned cloth off him and he was helping her and now her clothes weren't the only ones in shredded ruin, after all, what was sauce for the goose was sauce for the werewolf, and—</p><p>His hands were beneath her buttocks, raising her to him, and she could feel that long, hard, hot part of him nudging for entrance. For an instant, reason reclaimed her. Was she really going to do this? This crazy thing? She had no protection and without it, in this day and age, she was taking her life in her hands. And why was she cooperating in her own rape, for the love of God?</p> <p>\"Wait—\" she said in a thin, high voice, but he drove forward, thrust into her with power and searing heat and her good sense left her; she threw back her head and screamed until she thought her throat would burst, screamed at him to never never stop and still he came, that hot hard length parting her, filling her, and it should have hurt, it should have, he was very large and she hadn't known a lover in years, but her need for him was as great as his for her, and instead of hurting, she needed more.</p><p>When he was seated completely within her, somehow, somehow, he made himself stop; he gathered her against him and she could hear the furious hammering of his heart. His hands behind her back were hard fists and he was shaking as though he had a fever, and still he stopped. When he forced the words out she could barely understand him.</p><p>\"—doesn't—hurt?\"</p><p>\"No,\" she gasped, wriggling against him, his throbbing cock within her making her frantic. \"No no no please, please you can't stop now you can't you can't you—\"</p><p>\"You're—very small—sure—doesn't hurt?\"</p><p>\"—you can't you can't please I please don't make me—\"</p><p>\"Don't—be afraid—tell truth.\" He took a deep, shuddering breath; his fists were still clenching beneath her and, very distantly, she heard carpet tearing. \"Can try—wait—if you—\"</p><p>\"—beg, don't make me beg, please please please PLEASE!\"</p><p>He pulled away but before she had time to groan her disappointment he slammed forward. His mouth covered hers, his tongue mating with hers as he took her again and again, as they made love so fiercely the elevator shook. And above it all, beyond it all, she could hear someone screaming with hoarse joy and dimly realized it was she making the noise.</p><p>Her orgasm slammed into her as he was, spasms so fierce she could actually feel her uterus contracting. He stiffened at the height of her climax, threw his head back, and roared at the ceiling in pure animal triumph.</p><p>For long moments, she didn't think she would ever be able to move. She could smell the scent of their lovemaking, could hear his heavy breathing, hear her own. Her pulse thudded in her ears and she was damp with sweat and . . . other things.</p><p>He pulled back and out, his hands frantically feeling her limbs, her neck. \"Are you hurt?\" he asked hoarsely. \"Did I hurt you?\"</p><p>\"No,\" she said tiredly, ready to sleep for a week. A year. \"No, it was a surprisingly painless rape.\"</p><p>She felt him flinch, and wondered who she thought she was fooling. It might have been rape for the first minute, but after that she had been an eager participant. Shame made her flush.</p><p>\"Jeannie—I'm so very sorry. I don't expect you to understand.\" She felt his hand on her arm and cringed back, hating herself, hating him, and most of all, hating the fact that she wanted to do it all over again, right now. Right here. \"I'm sorry,\" he said again, quietly. \"My poor Jeannie. You were so brave.\"</p><p>\"Don't call me that,\" she snapped. She tried to pull her shredded blouse together, but might as well have tried dressing with confetti. \"Don't call me anything. Don't talk to me at all.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"We need to get you out of here,\" he said urgently, completely ignoring her order. \"And quickly. The moon's almost up.\"</p><p>\"Do not start that again,\" she ground out.</p><p>\"Out,\" he was muttering, \"Need to get you out. Not safe here.\"</p> <p>\"Brother, have you got that right.\" She started to stand and nearly pitched forward; she would have thought her eyes would have adjusted to the dark by now, but she was still effectively blind. And exhausted. And—how was this for the stupidest thing ever—she wanted him to put his arms around her and promise everything would be all right.</p><p>What if she was stuck in here with him all night? What if he decided to take her again? Could she fight him off? Did she want to?</p><p>She heard him stand, heard him bang experimentally on the elevator roof, then heard the groan of metal as he somehow forced the locked hatch. She shook her head at the sound, amazed at his strength. He could have broken my neck, she thought dumbly. Anytime he wanted.</p><p>\"Why the hell didn't you do that twenty minutes ago?\"</p><p>He gripped her waist and lifted her up, up . . . and through the small trapdoor. \"I had other things on my mind,\" he replied shortly. \"Like how badly I needed to touch you.\"</p> <p>\"Bastard.\"</p><p>\"Yes,\" he said quietly. \"But now I can think again. For a while.\"</p><p>\"Don't flatter yourself,\" she mumbled, cautiously getting to her knees on top of the elevator. She heard him chuckle beneath her and then abruptly, shockingly, he was crouching beside her on the roof. Off the floor and through the trap door in one bound, apparently. It was almost enough to make her wonder . . .</p><p>But that was ridiculous. This was the 21st century, and there were no such things as werewolves, dammit!</p><p>\"Why have we left the relative safety of the elevator, to teeter out here on top of the elevator, you nutcake?\" she asked with saccharine sweetness.</p><p>\"I'm definitely planning on falling in love with you,\" he said casually, in a tone he might have used to ask her to close the window. \"Any woman in mortal danger who can tease her assailant after being terrified is definitely worth taking to mate. Just so you know.\"</p> <p>\"Save it for your parole hearing, pal,\" she said. Before she could elaborate on what the judicial system would do to him with her blessing, she heard their death warrant: the elevator cables groaning from stress. She belatedly realized she was in danger of more than forced sex this evening. \"Oh, God,\" she said, abruptly terrified. Had she thought she was scared when Tall, Dark, and Horny had taken her against her will? She hadn't known what scared was. \"Oh, God—what should we do?\"</p><p>\"Live,\" he said simply and, absurdly, she took comfort in that. She had to, because never was the dark more terrifying. She could hear his rapid movements, hear twangs as parts of the cable give way under the stress, hear the elevator doors two feet above her creaking as they were forced open.</p><p>\"Be careful!\" she said sharply.</p><p>\"Always,\" he said, and suddenly his hands were on her again, and she felt herself effortlessly boosted and shoved. She reached out and clutched wildly, and felt the carpet in front of her. The building was as dark as the elevator had been, but she could tell he had held her up, almost over his head (no one is that strong) and boosted her through the elevator doors. In the pure dark, she could sense no one else around, which was just as well, given the shredded ruin of her clothes. Now his hands were on her heels, and he shoved, hard. She zipped across the carpet as if it was wet tile, her entire front going warm from the friction (he's not crazy, he really is a werewolf).</p><p>She turned around and crawled back toward the open doors, groping for the drop-off. \"Come out!\" she cried in the dark, hearing the sharp twang of more cable parting. \"Jump out! Quick! You can do it, weirdo!\"</p><p>\"Stay back from the doors!\" he said sharply. \"You can't see a thing, you'll fall right back down here. Stay—\"</p><p>She would obsess about that for weeks, that his last words were warnings to her. Because at that moment, the main cable parted and the elevator car plummeted five floors into the basement.</p><p>Her rapist had become her savior. And paid the price with his life. She shouldn't have cared. She should have been relieved. And she was relieved. So relieved that she put her face down on the dusty carpet and sobbed as if her heart would break.</p> <p>Chapter Two</p><p>Of course, there were questions. There were always questions. And when she stopped crying, Jeannie tried to answer them. No, she didn't know the elevator passenger's name. No, she didn't know how he'd managed to break the hatch lock and lift her several feet to safety. No, she didn't know how he'd over-ridden the safety locks on the doors, forcing them open. No, she didn't need to see a doctor. No, she couldn't identify the body—when they found it—because she had never seen his face. No and no and no.</p><p>She supposed she could sympathize with the building's management. A half-naked, hysterical woman cheated death on their property and now only wanted to go home . . . of course they were loathe to let her go.</p><p>She had her chance to tell them what he had done to her, how he had forced her—there was even a lawyer in the room to take her statement (the building management's corporate counsel, doubtless prepared to beg her not to sue)—but she couldn't do it. As much as he had scared her, used her, she couldn't bring herself to lay charges against him. If the price for her life was forced sex and mind-numbing pleasure, she was going to count herself very lucky indeed.</p><p>She saw a doctor at their insistence, a doctor who raised his eyebrows at the shredded ruin of her clothes but said nothing, a doctor who could tell she had recently had sex but, after her rude replies to his carefully phrased questions, said nothing to the others. Probably assumed it's my nature to seek out quickies in elevators, she thought darkly, and at the thought of her \"quickie\" partner, crushed and dead, she nearly started crying again.</p><p>The doctor had tried to insist on an overnight hospital stay; she had been firm. Like mountains were firm. She would not stay, she would spend the night in her own bed, thank you, will someone call me a cab?</p><p>They gave her a cab voucher—her purse was at the bottom of the elevator shaft, along with her wallet, ATM card, credit cards . . . and her rapist/savior. The cab came. She got in. The cab dropped her at home. She got out. Went inside. Threw her clothes away. Showered for a long time. Wept for a longer time.</p><p>Three weeks later, about the time she noticed her period was late, her martyred rapist/savior showed up on her doorstep.</p><p>Chapter Three</p><p>Michael Wyndham III stepped from the car, nervous as a bridegroom. Which, he supposed, he was. It had taken him nearly three weeks to track Jeannie down, weeks of frustration and guilt and worry. But now he was going to see her again. The thought of taking in her scent, maybe even touching her, made his pulse pound in his ears. Oh, he had it bad.</p><p>He grinned. It was marvelous, to find his mate. And in such a strange way! His father had tried to tell him, but Michael had never believed, had always figured one female was as the next. But he had found his mate through purest luck and, best of all, most wonderful of all, she was an extraordinary human! And homo lupus, unlike homo sapiens, mated for life.</p><p>Now to persuade Jeannie, who thought her future husband was nuttier than a granola bar.</p><p>Derik and Jon got out of the car and the three of them examined the apartment building before them. Minimum security—not that that would be a problem for three werewolves in their prime—and a pleasing location, right on the lake, with a park across the street. Best of all, less than a four hour drive from the Wyndham estate.</p><p>\"Remember,\" he told his men. Derik and Jonathan were his closest friends, his fiercest protectors. \"She was scared to death. I forced her, and she had to assume I died. She'll be terrified when she recognizes me.\"</p><p>\"If she recognizes you,\" Derik reminded him. He was as blonde and fair as Michael was dark. \"Her eyes aren't as good as yours. It was probably pitch dark in the elevator to her.\"</p><p>\"If she recognizes me,\" Michael agreed. \"I'm just reminding you, you'll need—\"</p><p>\"Patience,\" Derik and Jon echoed, then laughed at him. Michael rolled his eyes and cuffed Jon in the back of the head.</p><p>\"It's true,\" he said, \"I might be repeating myself.\"</p><p>\"Quit fretting, Michael,\" Derik said. \"We'll not muss your mate.\"</p><p>\"Do you think she's pregnant?\" Jon asked with hopeful curiosity. He was a curly-haired redhead with boyish features. He looked all of sixteen, and was twice that. \"The pack has been after you for a long time to mate and provide an heir. It would be wonderful if she—\"</p><p>\"Was pregnant and happy to see our pack leader, and embraced our lifestyle with open arms, and settled into the pack as if she was born to it?\" Derik shook his head at his friends. \"None of this is going to be easy, for her or for us. Better that she not be pregnant. Then Michael can let her go.\"</p><p>\"Enough,\" Michael said sharply. Let her go? Let that witty, beautiful, sensual woman go? In his dreams, his ears still rang with her cries of ecstasy. Let her go?</p><p>Moot, he comforted himself. She was surely pregnant. Her scent had been all sweet ripeness, like a bursting peach. And beneath him, she had felt—</p><p>\"Excuse me, O mighty king of the werewolves,\" Derik said dryly, \"but you're about to walk into that pillar.\"</p><p>\"I am not,\" he said, swerving at the last moment. He grinned at his friends, who rolled their eyes. Jon had taken a mate last year, and thus knew exactly what his pack leader was going through. Derik had not, and thus thought his leader was being foolishly sentimental.</p><p>\"She was scared,\" he said aloud, remembering, \"but she never showed it.\"</p><p>\"I still think this is nuts,\" Derik said gloomily. \"And bad luck. Of all the times to get stuck in an elevator—with an ovulating female who couldn't fight you off, who just happens to be human and not believe in werewolves—\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Gosh,\" Jon interrupted with a grin, \"what are the chances?\"</p><p>Derik ignored his friend.\"—who's going to go right out of her mind when we try to bring her home. Man, I hope she's not pregnant.\"</p><p>\"It will work out,\" Jon said, but they both heard the doubt in his tone. \"Humans mate with werewolves all the time, and vice versa.\"</p> <p>\"All the time' was a gross exaggeration ('once or twice a generation' would have been more accurate), but neither Derik nor Michael pointed that out.</p><p>\"Jon's right, pardon me while I choke on that phrase,\" Derik said, giving his pack leader a friendly clap on the shoulder that would have felled a human male. \"It'll work out. C'mon, chief. Let's go get your mate.\"</p><p>At least, Jeannie thought grimly, I don't have to worry about chasing anyone down for child support.</p><p>She was in her bathroom, staring at the double pink line which, the instructions assured her, meant she was positively pregnant. One bout of sex after going without a partner for three years, and she was well and truly caught.</p><p>Among other things, it was problematic that her baby's father had been a little unhinged. It was also problematic that he was dead. Jeannie had no idea—none at all, not even a smidgen of an idea—what to do now. Her mind, after taking in the double pink line (such an innocuous color for such a momentous event), had shut down, and the same thought kept cycling through her brain: now what? Now what? Now what?</p> <p>There was a firm rap on the door and, annoyed at the intrusion, she went to answer it. She peeped through the eyehole and saw three large men standing quietly on the other side of the door. They were dressed in dark suits; the one in the middle was the tallest, with dark hair, and he was flanked by a blonde and a redhead.</p><p>What fresh hell is this, she wondered. Normally she would have at least asked for their names before opening the door, but the shock of that double pink line was still governing her actions, and she swung the door wide.</p><p>The one in the middle was almost enough to distract her from her news—he was, simply put, one of the finest looking men she had ever seen. He was tremendously tall, with longish, wavy black hair that looked thick and touchable; her fingers itched to see if it felt as lush as it looked. His eyes were a funny, gorgeous color—the pupils were large and dark, the irises yellow-gold. His nose was a blade, and his mouth had a sinfully sensuous twist to the lower lip. His shoulders were ridiculously broad; his coat was belted at a slim waist.</p><p>\"Yuh . . .\" She coughed and tried again. \"Yes?\" She glanced at his companions and they wouldn't lose any beauty contests, either. One blonde, one a redhead, both fair and green-eyed, powerfully built and even broader across the shoulders than the brunette.</p><p>All three of them were staring at her. She covertly felt her face to make sure ants weren't perched on her nose or something equally disgusting. \"What's up, boys?\" They must be selling their hardbody calendars door to door, she thought, that's the only explanation for the abrupt arrival of three gorgeous men on her—her!—doorstep. .</p><p>\"Jeannie,\" the brunette said. With that one word, she recognized his voice—that deep, velvet voice—and went cold to her toes. Forcing her expression to remain neutral, she raised an eyebrow at him.</p> <p>\"Yes?\" she said, with just the right amount of impatience.</p><p>His shoulders slumped a little and the blonde man shot him a look of compassion. Mouth drawn into a sorrowful bow, he said haltingly, \"I—ah—this is difficult, Jeannie. You probably don't remember me . . . whurggggh!\"</p><p>He said 'whurgggh!' because she had hoisted her sneakered foot into his testicles with all her strength. His breath whooshed out in an agonized gasp and he crashed to his knees. She shouldered past the astonished redhead and bent over him, shaking a finger in his face.</p><p>\"You bet your demented ass I remember you! A) Thanks for saving my life, and B) drop dead! Again, I mean! Now get lost, before I lose my temper—\"</p><p>\"You haven't lost your temper yet?\" the blonde asked, aghast.</p><p>\"—and forget that you saved my life and remember that you raped me in an elevator that was about to plummet into a basement. If you'd taken five more minutes to get your jollies, we'd both be dead! You're lucky I don't call the cops on you!\"</p><p>\"I don't think he feels lucky right now,\" the redhead said, staring at the rapist/savior, who was clutching himself and writhing on the floor in an undignified way.</p><p>\"And as for you two,\" she said, rounding on the redhead, who took a step back and covered his crotch with both hands, \"your friend here has some serious psychological problems. He thinks—\"</p> <p>\"—he's a werewolf,\" the blonde said from behind her. She whirled, part of her not liking the way the three of them, purposely or not, had boxed her in very neatly.</p><p>\"You know about the delusion?\" Now might be a good time, she thought uneasily, to step back into my apartment and close the door.</p><p>\"We share the same delusion,\" the blonde said, smiling at her with very white, very sharp teeth.</p><p>\"Well, great,\" she snapped, concealing her unease . . . which was rapidly turning to fear. At her tone, the blonde's eyebrows arched in appreciation. \"Maybe you can share the same shrink, too. You—what are you doing?\"</p><p>He was sniffing her, like a dog. He didn't touch her, but he got entirely too close and sniff-sniff-sniffed her neck. \"Shit,\" he said, right before she shoved him hard enough to rock him back on his heels. He turned to her felled giant, who had been helped to his feet by the blonde. \"She's pregnant.\"</p><p>The brunette grinned in triumph, and he stared at her with a gleaming gold gaze, a gaze too proud and possessive for her taste.</p><p>\"Congratulations,\" the redhead said politely, \"to both of you.\"</p><p>To her astonishment, the blonde reached out and put his hand on her flat stomach. \"Here grows the next pack leader,\" he said respectfully. \"Congratulations, ma'am.\"</p><p>She gritted her teeth. \"Hand. Off. Now.\"</p><p>He complied hastily. Before she could think of what to do or say—nothing had been controllable since that double pink line—the brunette spoke up. His color was coming back, and he had recovered from a ball-stomping much faster than she expected. \"Jeannie, the short version is: I'm a werewolf—as I believe you heard—the pack leader, you're pregnant with my heir and successor, I have enemies who would steal my mate and unborn child so it's not safe for you to stay here, you have to come home with us.\"</p><p>Without a word, she turned around and went into her apartment, firmly closing the door in their faces, twisting the deadbolt with a click. Once inside, she started shaking so hard she looked around for a place to sit down.</p><p>\"Jeannie?\"</p><p>It was the brunette, calling her from the hallway. Sure, like she'd open the door and say, 'Yes, dear?'</p><p>\"Jeannie, get away from the door.\"</p><p>Having seen his strength before, she had a good idea what was coming, and went at once to the small chest on the living room endtable. There was a tremendous thud and her door shuddered in its frame. She flipped the top of the chest and grabbed her 9mm Beretta, cursing herself for being so paranoid about gun safety that she kept the clip—fully loaded—in her bedroom. No time to go for it now—</p><p>THUD!</p><p>—her door had just been kicked off the hinges.</p><p>She turned, her palm cupping the handle of the gun to conceal the emptiness where a clip should be, and leveled it at him, sighting in on the hollow of his throat. The brunette—odd, how she still didn't know his name—stepped across the threshold into her home. His friends, she was relieved to see, were nowhere in sight.</p><p>\"You're going to shoot the father of your child?\" he asked with honest curiosity. He picked up the door and set it neatly aside, then strolled toward her.</p><p>\"In a New York minute,\" she said coldly. \"Stop. Turn around. Go now.\"</p><p>\"I can't imagine your rage and hurt and frustration.\" His tone was serious; he never even glanced at the gun; his gaze was locked on her face. \"I told you I had no choice, and I hope someday you'll be able to see me as more than a conscienceless monster.\"</p><p>\"Kicking down my door wasn't a good start to that end,\" she said curtly. \"Last chance, Romeo.\"</p><p>\"Sorry.\"</p><p>Before she could figure out how to keep bluffing him, he had zipped forward, so quickly she couldn't immediately track the movement. He slid forward, under her gun sights, across her prized hardwood floor, and tackled her around her knees. With one hand he cushioned her back as she fell to the floor; with the other, he pulled the gun from her grasp. Hefting it, he knew at once it had no clip, and he smiled at her. \"Good bluff. I never doubted you.\" He tossed it over his shoulder.</p><p>\"Get off me!\"</p><p>\"I will. Wait. Tell me now, while we have some privacy—you weren't hurt that night? After, I mean? I had to be rough when I threw you out the elevator door. There wasn't time to—\"</p><p>Part of her anger—a tiny part—diminished. He was a wannabe kidnapper and a rapist, but he was awfully concerned for her well-being. She remembered his concern that night, too, after he had taken her. Him on top of her, both of them still panting, and his hands running over her limbs, checking for injuries, making sure she wasn't hurt.</p><p>\"No,\" she admitted through gritted teeth. \"I wasn't hurt. Not even a skinned knee. They told me you died.\"</p><p>His gold eyes twinkled at her. \"Just a couple of broken legs. But I'm a fast healer. Were you sorry? When you thought I was dead?\"</p><p>\"No,\" she said stiffly, remembering her sobs, the way it had taken her an hour to stop crying after the elevator fell down the shaft.</p><p>\"If I had died,\" he whispered, leaning in close, nuzzling her ear—to her annoyance, her entire left side started tingling. \"If I had died, I would have taken a beautiful memory with me. I would have died sated, knowing my seed had found a home, knowing the bravest woman I ever met was going to mother my child.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Shut up,\" she said thinly, bringing her hand up to push his face away—he went easily, and she had the feeling he went because it pleased him, not because of anything she had done. \"Shut up, I hate you, I wish you had died.\"</p><p>\"I know,\" he said sadly. \"Your opinion is not about to change.\" Abruptly, he shifted his full weight on her, and she felt his fingers come up and settle on the junction between her neck and shoulder . . . and start to squeeze. Black roses bloomed in her vision and she felt herself fading, fading, using up precious strength to get him off her rather than trying to drag his fingers away from her neck and what the hell was that, anyway? Was that—</p><p>Chapter Four</p> <p>She woke in an unidentified bedroom . . . and came to consciousness yelling. \"What the hell was that! Did you actually use the Vulcan Neck Pinch on me, you freak?\"</p><p>Then she realized she was alone. The bedroom was small—the bed took up nearly the entire room, and paneled with pastel-striped wallpaper. There were two large windows on each side of the bed, and . . .</p><p>And the bedroom was moving. She bounded off the bed, swaying for a long moment as a wave of dizziness swamped her, then lurched to the nearest window.</p><p>The bedroom was on a highway. Traveling roughly seventy miles an hour.</p><p>There was a short 'rap-rap' on the door, and then Tall, Dark, and Weird stuck his head in. \"Are you all right?\"</p> <p>She whirled on him and he grinned as she snapped, \"I am so sick of hearing that question from you—usually after you've done something horrible to me! No, I'm not all right! I'm a rape victim and a kidnap victim and a—a pregnancy victim and a Vulcan Neck Pinch Victim and now I'm in some sort of mobile bedroom—\"</p><p>\"It's an RV,\" he said helpfully, easing into the room, keeping his hands in sight. She felt like a rabbit, easily spooked, like she might bolt any second. Apparently he had the same impression, because his voice was low and very soothing. \"I wanted you to be comfortable for the trip.\"</p><p>\"How very fucking considerate of you,\" she said with acid sarcasm. \"Why, I don't know when I've been kidnapped by a nicer man.\"</p><p>His smile faded. \"Jeannie, I have enemies who would kidnap you and take your baby from you and then kill you, all so they could raise the next pack leader and have a voice of power. How could I let that happen to you?\"</p><p>She took a deep breath and forced calm. On top of everything else—the physical power, the sexy voice—did he have to be so handsome? If she'd gotten a look at him in the elevator before the lights went out, he probably wouldn't have had to force her. Much. \"Look. I'm not saying you're a liar, okay? I'm not saying that. I'm sure you believe all this stuff.\"</p><p>\"Thanks,\" he said dryly.</p> <p>\"But the fact is, you can't force women in elevators and then show up and yank them from their homes and take them who-knows-where. You can't. Don't you know it's wrong? Don't you care?\"</p><p>He sat on the edge of the bed and nodded soberly. \"I do know it's wrong. By your laws.\"</p><p>She threw her hands up in disgust. \"Oh, here we go.\"</p><p>\"I do care,\" he continued. \"As angry and humiliated as you are, I'm as embarrassed to find myself having to play the villain. But it's far worse to use you for my pleasure and then never give you another thought. Especially when I knew you were ovulating, knew there was an excellent chance I'd made you pregnant. How could I turn my back on you after using you? How could I never look in on you, make sure you were out of danger?\"</p><p>\"Fine!\" she shouted, stomping toward the bed. \"Look in on me! Tell me you're not dead! You could have apologized for forcing me and scaring me and—and other stuff, and I could have thanked you for saving my life, and then you could have gone your way and I'd have gone mine. Instead you do this,\" She gestured to the RV bedroom. \"I loathe rooms on wheels,\" she hissed.</p><p>\"There was the small matter of my enemies finding you,\" he reminded her calmly.</p><p>\"Very small—you knew my name and it still took you three weeks to find me.\"</p><p>\"Even if there was only a chance in a thousand you were in danger, do you think I'd risk you for an instant?\" he asked sharply. \"You're angry with me now, but what if I had never come back in your life . . . but my enemies had? You would have died cursing my name. I couldn't have borne that.\"</p> <p>\"Oh, please.\" She turned her back on him. \"You don't give two shits for me. I was a piece of ass you couldn't resist. That's—aaah!\"</p><p>He had come up behind her with that liquid, silent speed she had seen before, startling her badly. His hand fell on her shoulder and he turned her toward him. His eyes, locked on hers, were gold and blazing. \"Do not say that again,\" he said with an icy calm that terrified her, even as it fascinated her. \"It's disrespectful of me, as well as yourself. I'm not in the habit of forcing unwilling females, despite what you must think.\"</p><p>\"Sorry,\" she said quickly, through numb lips. Then, despising her fear, she added coldly, \"Remove the hand.\"</p><p>His hand fell away. \"And now I've frightened you,\" he said with real regret. \"Forgive me, Jeannie.\"</p><p>\"It's just that, since you don't even know me, I don't see how you can claim to feel anything for me,\" she said carefully.</p><p>His hand came up slowly, carefully, and when she didn't flinch, settled on her cheek like a dove's touch. \"I do know you,\" he murmured. \"There is much more to you than beauty.\"</p><p>She flushed; against her hot skin, his hand felt cool. \"I'm not beautiful.\"</p><p>He laughed. \"With all that curly blonde hair?\"</p><p>\"It's frizzy,\" she corrected him.</p><p>\"And all those adorable freckles?\"</p><p>\"Ugh.\"</p><p>\"And that pale skin, like the richest cream?\"</p><p>\"When I go to the beach I look like a fucking vampire, thanks very much, and could we get off my looks, please?\"</p><p>\"Then we'll just have to talk about your intelligence and courage and razor wit,\" he said with faux regret. \"What a bore.\"</p><p>She laughed; she couldn't help it. And immediately bit off the sound.</p><p>\"I've never heard you laugh before!\" he said, delighted. \"Do it again.\"</p><p>\"I can't laugh on command. Look,\" she said briskly, getting back to business, wondering how long he was going to be touching her face, \"let's talk facts, here. Facts, not delusions and you're the king of the werewolves and you've got enemies out to get me even though they don't know me—cold hard facts. Where is your home?\"</p><p>\"Barnstable, on Cape Cod,\" he said, amused.</p><p>\"Ah, yes, Cape Cod,\" she said sarcastically, \"a hotbed of shape-shifters. I always thought so. The tourists had to be going there for some reason . . .\"</p><p>He laughed again, and his hand slid down, toward her collarbone. She knocked it away and backed up, so fast that she hit the far wall. Startled, he went after her, politely backing off when she kicked out at him.</p><p>\"Don't touch me there again. Ever. Ever ever. If you do, I swear I'll—\" She couldn't think of something bad enough. \"I'll do worse than rack you in the 'nads.\"</p><p>Understanding dawned. \"I wasn't going to knock you out again,\" he said. To her amazement, he actually sounded hurt. \"I just like touching you.\"</p><p>\"I don't give a shit! You're contemptible, showing up uninvited, pinning me down and pinching me until I was out cold—\"</p><p>\"I had a feeling,\" he said dryly, marching to her and dragging her, kicking, out of the corner. He shoved her gently to the bed and then walked around it, standing on the far side of the room. \"I had a feeling you wouldn't cooperate in your—uh—removal. Steps had to be taken. But think about this—think about the things I could do to you if I didn't cherish your well-being.\"</p><p>She'd been trying not to. She had realized in the elevator he could have killed her, crippled her, as easily as stomping a spider. If he wanted to hurt her, he'd had ample opportunity. Hell, she'd visited upon him the worst pain a man can know . . . and there had been no retaliation.</p><p>\"It's still wrong,\" she said firmly.</p><p>He shrugged. \"You had more questions?\"</p><p>\"What happens when we get to Cape Cod?\"</p><p>\"You'll stay at my family home.\"</p><p>\"Until?\"</p><p>He hesitated. She gritted her teeth and repeated the question.</p><p>\"Until you accept your destiny and freely agree to stay with me. Us.\"</p><p>\"Forever?\" she asked, aghast.</p><p>He nodded.</p><p>\"You've kidnapped me forever? Unless I escape or blow the place up or whatever?\"</p><p>\"Yes.\" He paused. \"I don't expect you to agree right—\"</p><p>She launched herself at him. It was time to take advantage of the fact that he wouldn't hurt her, and do some major damage. Her first punch missed—he caught her wrist in time—but her simultaneous kick hit the mark, and he winced as her foot cracked into his shin.</p><p>\"I hate you!\" she was shouting, raining blows down on him. He held her wrists and took her kicks stoically, only blocking the ones to the groin with his thigh. \"You can't do this! It's not my destiny, you weirdo, it was just dumb luck! I won't stay with you, I won't! I have a life! And it does not include hanging out on Cape Cod with a creep who thinks he's a werewolf!\"</p><p>\"Understood. But it doesn't matter; you're staying.\" At her shriek of rage, he continued. \"And while we're talking, I don't like being hit, or kicked,\" he said calmly, wincing as she brought her foot down on his instep with all her strength, \"so there will be consequences in the future.\"</p><p>\"Fuck your consequences!\" She brought her head forward in a devastating head butt; he jerked his head aside and she ended up banging her forehead into his neck.</p><p>\"Starting now,\" he said, and pulled her too him so sharply she lost her breath. Then his mouth was on hers in a bruising kiss that stole the strength from her knees. He pinned her arms to her sides and, when her teeth clacked together in an attempt to bite him, contented himself with gently nibbling her lower lip. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Don't,\" she managed, and when her mouth opened his tongue slipped past her teeth.</p><p>He pulled back before she could gather the sense to bite him again. He was breathing hard. Almost as hard as she was. His effect on her was infuriating and she practically gnashed her teeth in rage.</p><p>\"So,\" he said coolly, but his eyes gleamed, \"now that you know there are consequences, feel free to punch away. Because, afterward, I can put my hands on you without feeling a bit guilty, under those conditions.\"</p> <p>\"You should die of guilt,\" she choked out. \"I hate you.\"</p><p>He was staring at her mouth, his own a line of sadness. \"I know.\"</p><p>He left, slamming the flimsy bedroom door behind him. Jeannie sat down before her knees betrayed her.</p><p>Chapter Five</p><p>\"This,\" Tall, Dark, and Disgusting said to the fifteen or so assembled people, \"is my wife-to-be, Jeannette Lawrence.\"</p> <p>\"Ma'am,\" the small crowd said in respectful unison.</p><p>Jeannie opened her mouth to tell them exactly what she thought of what's-his-name, but the black-hearted bastard beat her to the punch.</p><p>\"She's here entirely against her will,\" he went on, \"and isn't happy about it. She's also pregnant by me—\"</p><p>A happy gasp from the crowd.</p><p>\"—and not happy about it. It happened, as some of you probably guessed, during the last full moon.\"</p><p>Nods. Sympathetic glances. She bit her tongue, hard, so as not to shriek with embarrassed rage.</p> <p>\"Thus, she will be rude, throw things, and do her best to escape,\" he went on casually, as if she wasn't standing at his elbow and hearing every word. \"She doesn't understand her vulnerability and can't appreciate her delicate position. And she won't thank any of you for pointing it out.\" He paused. \"Be patient with her.\"</p><p>Jeannie rolled her eyes. At the edge of the crowd, a petite, elfin blonde woman saw it and winked at her.</p><p>\"Moira, if you'll show Jeannie to her rooms?\"</p><p>The small blonde nodded and stepped forward at once. Psycho Boy turned to her and asked with ridiculous politeness, \"Did you have any questions, Jeannie?\"</p><p>\"Just one.\" She paused. He waited, the crowd waited, expectantly. \"What the hell is your name?\"</p><p>Score! He flushed a little, and there were a few outright laughs in the crowd. Moira giggled, and quickly choked off the sound as he glanced at her with a frown. \"Ah—that's right, we never got around to that, did we? It's Michael. Michael Wyndham.\"</p><p>\"Great,\" she said, unsurprised. After the month she'd had, nothing could surprise her. The Wyndhams controlled a vast shipping empire and were reputed to be slightly more wealthy than God. The father of her child owned the tower she'd taken the ill-fated elevator in, probably owned the magazine she worked for. It figured. \"Psychotic and rich.\"</p><p>\"I'm afraid so,\" he said with an irritatingly sexy smile. She looked away, disgusted.</p> <p>Moira led her out of the yard, into the astonishing mansion she'd glimpsed from the RV. After her last confrontation with Tall, Dark, and Wyndham, she'd cried herself to sleep. And when she woke, they had been pulling up to the most beautiful manor home she had ever seen. She was so stunned at the home's size and majesty, she hadn't said a word when Michael gently led her out of the RV and introduced her to the household staff who, the redhead (whose name was Jon; the blonde had introduced himself as Derik) had assured her, all shared Michael's \"delusion.\"</p><p>She was so impressed with the ocean-side mansion, she could hardly fret about being kept prisoner by fifteen people who were all as nutty as Wyndham. True unease would come, she had no doubt, in time. Like as soon as her shock and surprise wore off. Then there'd be hell to pay. Then there'd—</p><p>\"I hope you'll come to like it here,\" Moira was saying, leading her through a home that made Gone With The Wind's Twelve Oaks look like a claim shanty. \"We've been waiting for you for a long time.\"</p><p>\"Waiting for me?\"</p><p>\"For our leader to take a mate,\" Moira explained. She was a lovely, delicate blonde with eyes the color of the sky, and skin so pale it was almost translucent. She was tiny; almost a head shorter than Jeannie, and Jeannie herself was five-ten. \"He needs an heir. It's just unfortunate that . . .\" She trailed off, seemingly embarrassed.</p><p>\"You don't know how unfortunate,\" Jeannie said dryly. \"Look, Moira, I don't suppose there's any chance you'd help me—\"</p><p>\"Don't even ask, ma'am,\" she said firmly. \"I'd die for Michael. Any of us would.\"</p><p>\"In other words, don't waste your breath asking anyone else to crack out of this pokey,\" she finished.</p><p>\"Your 'pokey', ma'am,\" Moira said with a grin, throwing open a set of mahogany doors. Jeannie stepped into the most beautiful room she had ever seen—all gleaming blonde wood floors, lush throw rugs, a fireplace large enough to roast two pigs, and several doors. And the bed! A king-sized monstrosity, large enough to comfortably sleep a family of six.</p><p>\"Bathroom, closet, closet, balcony,\" Moira was saying, opening all the doors.</p><p>\"Whoa!\" Jeannie said, staring, goggle-eyed. Moira giggled again. \"Okay, so, this place ranks high on my Top Ten List Of Places To Be Held Prisoner. But it still sucks, you know.\"</p><p>\"Hmmmm?\" Moira said, turning down the bed.</p><p>\"Being held here against my will,\" Jeannie reminded her impatiently. She waited for Moira to blush, to acknowledge guilt, to do something . . . something besides shrug and look unconcerned, dammitall. Then a thought struck her, and she asked sharply, \"Where does Wyndham sleep?\"</p><p>\"His is the adjoining room,\" she said simply.</p><p>\"Over my dead body!\"</p><p>\"You'll have to discuss that with him, ma'am.\"</p><p>\"And stop calling me ma'am! I'm not ninety!\"</p><p>\"As you wish, my lady.\"</p><p>\"Out!\" she hissed, and to her relief and surprise, Moira obeyed at once. Jeannie threw herself on the bed, which enveloped her at once in an eiderdown embrace. She was too mad to cry again, which was a relief—she'd done entirely too much crying lately. Now was the time for action!</p><p>\"Would you like to have something to eat before you try to escape?\"</p><p>It was Wyndham, poking his head through the doorway that doubtless adjoined his rooms to hers. She'd like to slam that door shut, watch his eyes pop out as his neck broke.</p><p>She glared up at him from her bed. \"I want to go home.\"</p><p>\"Yes, I know.\"</p><p>\"Now!\"</p><p>\"Sorry.\"</p><p>She reared up in the bed, tottering to stay balanced on her knees amid all the fluff of the quilts. His mouth twitched as she struggled to right herself. \"Wyndham, I'm telling you this for the last time: I won't stay here with you. I won't have anything to do with you. You're a criminal and a jerk, a miserable combo.\"</p><p>\"You're not afraid,\" he said with a satisfied sigh. \"I knew you wouldn't be.\"</p><p>\"Don't flatter yourself. I'm too pissed to be afraid. Listen, dickhead: there are going to be some horrific consequences if you try to keep me here. We're talking broken bones and FBI raids. I'm out of here the second the opportunity presents itself.\"</p><p>He actually looked alarmed—at the chance of losing his sex toy? Or a deeper reason? Then his expression cleared. \"There will be consequences if you try to escape,\" he said simply, stepping into her room and softly closing the adjoining door. He had changed from his suit to khaki shorts and a white t-shirt, and if possible, looked yummier in casual clothes that showed off his finely muscled legs and upper body. He was ridiculously tan, ridiculously handsome. \"Are you going to try to escape soon?\" he asked, as if inquiring about the temperature in her room.</p><p>\"You—you—\" She sputtered wordlessly at his absurd question. \"You're not supposed to want me to get away.\"</p><p>\"You won't get away. We'll catch you. I don't want you to leave—it's dangerous. So, as I warned you earlier, there will be consequences if you try and escape.\"</p><p>\"What consequences?\" she asked, but had a sinking feeling she knew.</p><p>His gaze was level. \"Elevator consequences.\"</p><p>Her mouth went dry, even as her heart sped up. \"Seek help, Wyndham. As quickly as possible.\"</p><p>\"Do you think I'm pleased with this scenario?\"</p><p>\"Yes! I think you're very pleased,\" she said bitterly.</p><p>The bum actually looked hurt. She couldn't believe his nerve. \"It's the only way I can think of to keep you from trying to leave,\" he sighed, \"since you don't believe me about the danger.\"</p><p>He walked to the bed and stared down at her. A blind woman could have seen the hunger in his gaze. \"I won't lie—part of me wants you to try and escape,\" he husked. \"Don't misunderstand—I'm sorry about the circumstances that brought you here. And I'm sorry you don't like my home.\"</p><p>\"I never said I didn't like your home,\" she interjected sharply.</p><p>\"But if you try to escape, just as if you try to hurt me again, I can take you without guilt.\"</p><p>\"You—\"</p><p>\"I can hardly stand to be this close to you without touching you,\" he said, and for a moment she saw such pain and longing in his gaze, she had to glance away. \"Having you sleeping just a few feet away is going to drive me mad. But I won't take you again by force, Jeannie—except as a deterrent. Because,\" he added sadly, \"as much as I long for your touch, I know you can't stand to be near me, that you despise me. So lovemaking relieves my hunger while punishing you.\" He turned away. \"I wish it could be different between us,\" he said without turning around. \"I'd give anything for things to be different.\"</p><p>\"You know what I'd give anything for?\" she asked sweetly, groping behind her for something to throw at him, and finding nothing more deadly than a pillow. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He laughed shortly, and left the room. The pillow smacked into the door and fell to the floor with a fat thump.</p><p>Chapter Six</p><p>Since Wyndham, the sadistic cretin, was panting at the thought of her escape, and since he'd alerted the household she was an unwilling guest, Jeannie decided to stay put for a while, provided her situation didn't change (read: Wyndham didn't decide she was in heat again, or Moira didn't spike her milk with broken glass).</p> <p>So she took lunch with Wyndham and his staff, who were obviously more friends than employees, in a dining room that had more windows than a solarium. Sunlight splashed across the table and gleamed from the blonde wood floors. She sat in the finest dining room she'd ever seen and commented on how delicious everything tasted. They had all been watching her expectantly, and seemed disappointed when she didn't throw things or leap across the table through the French doors that led to the beach.</p><p>\"How long have you known you were expecting our leader's child?\" Derik asked, sliding the bread basket toward her.</p><p>She helped herself to another piece of the sun-dried tomato and basil loaf and looked at her watch. \"About six hours and fourteen minutes.\"</p><p>Wyndham looked up from his soup. \"You did one of those home tests? You haven't seen a doctor?\"</p><p>\"I had an appointment for this afternoon. Which I missed. Guess why, King Psycho.\"</p> <p>He remained unruffled, though she saw a few of the staff hiding smiles. \"Well, then, you need a doctor. Moira, see to it.\" He glanced at Jeannie with a frown, then added, \"A female physician, if you please.\"</p><p>\"Yes, sir.\"</p><p>\"Like there are so many werewolf doctors to choose from?\" Jeannie interrupted sarcastically. \"What, is there a directory or something?\" As the others laughed, she had a sudden thought. \"Oh, will we have to go to town for that?\"</p><p>Derik, seated at Wyndham's left (she was at his right), snickered. \"Nice try. The doctor will come here.\"</p><p>\"Well, goody for him.\"</p><p>\"Her,\" Michael corrected sharply.</p> <p>Jeannie raised her eyebrows, said nothing, and ate her chicken. Wyndham was jealous? Of a male doctor? Ridiculous. Still, that might be a handy button to push. She filed the thought away.</p><p>\"Are you mad because you think we're all crazy, or because you're here against your will?\" Jon asked curiously.</p><p>\"I don't think that's a fair question,\" Michael said reproachfully.</p><p>\"Yeah, I mean, there's so many reasons for me to be furious at all of you, how can I pick just one?\"</p><p>\"I meant,\" Jon said, flushing a little, \"the full moon is in three days. And you could watch some of us change, or even one of us change, and then you wouldn't think we were crazy anymore, so it might be easier to accept—um—are you okay?\"</p><p>She could actually feel the color draining from her face, could feel the trembling in her hands. She dropped her spoon in her soup and fled the table, running, running, for her rooms.</p><p>Michael caught up with her on the stairs. She wrenched away from him and kept going. Never one to take a hint, he followed her into her bedroom.</p><p>\"The full moon?\" she asked, hating the shrill, panicky note in her voice. He shut the door to assure some privacy; she barely noticed. \"The full moon again? I can't go through that again! I can't go through that craziness with you again! Don't you touch me!\"</p> <p>He had been reaching for her, ignored her shriek and pulled her, struggling, into a firm embrace. \"It's all right,\" he said into her hair. \"I had planned to leave the grounds when my change came. I wouldn't have forced you again. I promised you I wouldn't force you, except as punishment.\"</p><p>\"What good is a promise from you?\" she choked, resting her forehead against his shoulder. He smelled so good. It was as comforting as it was irritating.</p><p>\"I've done many things to you, Jeannie, but when have I broken a promise?\"</p><p>She shrugged sullenly. Then stiffened, remembering. She leaned back to look at him. \"But what about the others? They all think they're werewolves, too, they all—\"</p><p>\"You have nothing to fear from the females, because as my mate, you're alpha female. No, listen, Jeannie—if it's a delusion, at least we all have to follow the same rules, right? And the males won't—can't—touch you without my permission.\" His voice hardened. \"And I won't give it. Ever. So you have nothing to fear.\"</p><p>She choked on a laugh.</p><p>\"You really don't,\" he said, pressing a warm kiss to her brow. \"Now come back and finish your lunch. You don't want the baby to starve, do you?\"</p><p>\"No,\" she sighed. She glanced at him again; he had put an arm around her shoulder and was steering her out the door, back to the dining room. A thought struck her—late, but her thought process was continually being thwarted by shock upon shock. \"What do you think? About my being pregnant, I mean? I never got a chance to ask you. Not that I care either way,\" she added hastily.</p><p>\"I'm thrilled,\" he said simply, giving her a warm smile. He leaned close and she had the sense he wanted very much to kiss her. Something—belated concern for her feelings?—held him back. \"I love children. The pack needs the continuity of succession. And I get to keep you now, don't I?\"</p><p>His voice ended on a teasing note, but she wasn't amused. \"For a minute there, I was almost liking you,\" she said evenly, pushing his arm away. \"Thanks for turning back into a creep.\"</p><p>At the dining table, the other werewolves—people—were still glaring at Jon, who was miserably embarrassed. \"I'm really sorry,\" he said at once upon seeing Jeannie. \"I shouldn't have reminded you about the full moon. I forgot that—\" He paused, glanced at Michael, blushed harder. \"I have no excuse. I'm so sorr—\"</p><p>\"Please stop,\" she said, rolling her eyes and sitting back down. \"I'm the one who should apologize. I can assure you it's not my usual M.O. to drop cutlery and flee for the bedroom when the word 'moon' is introduced into the conversation.\"</p><p>The others laughed, Michael harder than anyone. Jon smiled at her with pure gratitude. And Derik forked another chicken breast onto her plate.</p><p>\"How about a tour, Moira?\" she asked briskly, after the lunch dishes had been cleared away. \"Might as well check out my new home.\"</p><p>\"She'll try to escape,\" Derik warned, finishing the last of his peach sorbet.</p><p>\"I know,\" Moira said defensively. \"You don't have to tell me everything, Mr. Right Hand Man.\"</p><p>\"Bring her to me once you've found her again,\" Michael said casually, but his eyes were gleaming in a way Jeannie didn't much care for.</p><p>\"Hello!\" she shouted. \"Prisoner still in the room, here! Can you have this conversation where I can't hear you?\"</p><p>Moira giggled, and extended a hand. Surprised, Jeannie took it. \"Come on,\" she said. \"We'll start with the gardens. If you cosh me over the head to escape, try not to muss my hair.\"</p><p>\"For God's sake,\" she muttered, but obediently followed Moira out the door.</p><p>She had, in fact, decided to escape in the next day or so—well before the full moon. Michael's assurances aside, she had no intention of sharing a home, however sprawlingly luxurious, with twenty people all sharing the same delusion. And she didn't plan to be in the same state with Wyndham when he went through that again. She wasn't afraid of being forced, so much as being forced to pleasure. Her cheeks burned with humiliation every time she remembered how he had made her scream in ecstasy. In a flash she was back in the warm, dark elevator, Michael's cock surging between her thighs, her fingers digging into his skin, wordlessly urging more, more . . .</p><p>She shook herself, and concentrated on the tour. Now was no time for daydreaming. Now was the time to plot and plan and eventually escape these crazies.</p><p>In the rose garden, Moira said in a low voice, \"We don't blame you. For being upset, I mean. It must have been . . .\" She trailed off, then asked timidly, \"Was it very awful?\"</p><p>\"Huh? You mean being stuck in the elevator with your boss? Well, the lights went out, so we couldn't read my Glamour . . .\"</p><p>\"It's kind of you to joke, but . . . I can't imagine how it must have been for you—a pure human, and an unbeliever, besides. Tearing clothes and scratches and bites, and being forced on your knees and taken without so much as a 'please' . . . I suppose you had to see a doctor.\" She looked as though she was going to burst into tears. \"I suppose you—you tore and . . . and—no wonder you hate him. Us.\"</p><p>\"Uh . . . yeah. Yeah, it was an unending torment. What's that building over there?\"</p><p>As Moira obediently showed her the gardener's shed, Jeannie's mind whirled. What Moira imagined hadn't been at all what happened. Michael had gone out of his way to soothe her, to bring her pleasure, to make sure she was ready for him. He'd had that much control, at least. What would sympathetic Moira think if she told her it had been the most exciting, pleasurable sexual experience of her life? What did that mean, that he'd been nearly out of control, but cared for her enough to do his best not to hurt her, even to bring her pleasure?</p><p>In a flash, she was back in the warm, dark elevator—</p><p>Jeannie pushed the thought away with a firmness she didn't feel.</p><p>\"You can't leave the grounds,\" Moira was saying casually, \"until we kill Gerald. But after that, it should be all right.\"</p><p>\"What?\" She nearly fell into a rose bush. \"Now you're talking about killing someone so I can leave?\"</p><p>\"Didn't our leader explain about Gerald?\"</p><p>\"Frankly, I tend to tune him out when he's babbling about all the reasons it's okay for him to break the law where I'm concerned.\"</p><p>\"Your law,\" Moira pointed out calmly, \"not ours.\"</p><p>Jeannie bent to sniff a rose so gray it was almost silver. \"Okay, I'll bite. What is your law?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Safety of mates and children first, above and before everything else. Michael has to keep you safe. Because he knows it's right, and because he must set an example. How could the rest of us follow someone who can't even protect his own mate?\"</p><p>\"I'm not his mate,\" she said sharply.</p><p>\"Yes,\" Moira said simply, \"you are.\"</p> <p>Jeannie stewed over that one for the five minutes it took them to walk from the rose garden to the beach. \"How does Gerald fit into all this?\" she asked at last.</p><p>\"He's our enemy. He went rogue five years ago. His mate was giving him nothing but female cubs and he wanted an heir, someone he could train to challenge the pack leader. He's too cowardly to try a challenge himself; he wanted a son to do the dirty work.\" Cute, delicate Moira spat in the sand to express her disgust.</p><p>\"Whoa, whoa, watch those loogies.\" Jeannie took off her shoes and wiggled her toes in the surf, scanning the horizon and judging the wisdom of swimming to England to escape. Still, this was a fascinating delusion. \"His mate was giving him daughters? Did the creep never crack a biology textbook? Sperm chooses gender.\"</p><p>\"Gerald is . . . old-fashioned,\" Moira said reluctantly. \"He represents the pack before the Wyndhams took over. Savage, undisciplined. Gerald killed his mate after the birth of his fourth daughter. Michael would have killed him, but for the intercession of Gerald's other daughters, who begged their leader to spare their father's life. Michael did, but banished him. Now Gerald's rogue, and the only way he can come to power is if he gets his hands on the pack leader's child.\"</p><p>\"Thus, I be kidnapped,\" Jeannie said dryly.</p> <p>\"If you ever crossed Gerald's path, he would kill you to revenge himself on Michael—for what is worse than the loss of a mate? Or he would keep you until you whelped, take the child from you, and then kill you. And he would be well-revenged indeed, for he would be as father to the next pack-leader, and come to power quickly. And we would be back in the days of savagery and blood.\" Moira turned an unblinking, wide-eyed gaze to Jeannie. \"It would be the end of all of us.\" Pause. \"You can't leave while Gerald lives.\"</p><p>Despite herself, Jeannie felt a thrill of fear. Determinedly, she pushed it away. It was all part of their delusion, it was a way for Michael to justify kidnapping her. She wouldn't believe it.</p><p>There had to be a way out of here.</p><p>Exhausted—either from the wild events of the last few hours, or fatigue brought on by an early pregnancy—when Moira brought her back to the mansion, Jeannie went straight to her room and stretched out on the bed to nap. The bed was ridiculously comfortable, her room astonishingly beautiful, and if she wasn't being held here against her will she'd probably be having the time of her life.</p><p>Hell, she thought drowsily, watching the light play against the rich gold wallpaper, there hadn't been anyone in her life since college. Under different circumstances, she'd gobble Wyndham with a spoon. She'd rape him. Gorgeous, rich, intelligent, and a gentleman—when he wasn't raping and kidnapping. A real catch. And those eyes . . . those eyes . . .</p><p>Yes, she could definitely wish things had been different, that they had not met in such drastic fashion. But, as her mother used to say, done can't be undone. Her mission was not to play nice with the lunatics, it was to get the hell out of here.</p> <p>With that unsettling thought, she drifted into sleep. And found herself in the elevator again—for the last month, she'd stumbled into that elevator two or three times a week. Only this time, Michael didn't save her. This time, he used her and left her, turned his back on her and left the elevator in one bound, leaving her in the car, in the dark, and there was a terrifying Snap! as the cables parted and then the sickening sensation of free fall, her feet left the floor and her head banged on the ceiling and her stomach climbed into her throat and she screamed all the way down, screamed for him to save her, and—</p><p>\"Jeannie . . . hush, Jeannie, it's all right. You're safe here.\"</p><p>\"Ha,\" she said weakly, opening her eyes. To her surprise, while she dreamed she had been pulled into his embrace. He was sitting on the edge of the bed, holding her in his lap like the world's biggest doll.</p><p>As she rested her head against his chest, she was absurdly comforted by the thud-thud of his heartbeat in her ears. \"Do you dream about the elevator often?\" he asked, his voice against her ear a deep rumble.</p><p>\"No,\" she lied. In a moment she would have to pretend outrage and shove him away. In a moment. For now, it was too damn nice to be held with tenderness. Even if he was crazy. Even if he'd landed her in more trouble than she'd ever been in. \"No, never.\"</p><p>\"I do, too,\" he said softly, as if she'd told the truth. \"Only, in my dreams, I can't save you. And down you go. And I wake up with a scream in my throat.\"</p><p>She shuddered against him, closing her eyes. He stroked her back and murmured to her; she caught no words but was comforted by tone. \"In mine,\" she whispered, \"you leave me. You use me and leave me and the elevator falls into the basement and they scrape what's left of me into a jelly jar.\"</p><p>He tightened his grip. \"Never. I'd die myself before letting that happen to you.\"</p> <p>\"I know,\" she said and, to her surprise, she knew that as a fact, as she knew her own name. \"You proved it, didn't you? But I can't help dreaming about it.\"</p><p>\"Nor I,\" he agreed.</p><p>She noticed his right nipple, which was about two inches from her mouth, was stiff. Probably from her; every time she opened her mouth, breath puffed across it. She had the absurd urge to kiss it. To taste it. Run her tongue across it and test the texture. Her mouth had actually gone dry from her sudden, startling need to take part of him into part of her.</p><p>He was rubbing his cheek against the top of her head and she could feel that odd tension in his body, as she had felt it the night in the elevator. He wanted her, she realized with a bolt of excitement. But he was afraid to do anything, afraid she'd fight him, scream the house down, call him names. He wanted to preserve this temporary peace between them as long as he could. What would he do, she wondered with a strange, thundery joy, if I leaned over and kissed his nipple? And slid his shorts down to his ankles and took him into my mouth?</p><p>\"I came to get you,\" he said, and she thought his voice sounded thick, \"because the doctor is here.\"</p><p>In a flash, she remembered herself: she was pregnant, by him, against her will, in his house, against her will. She sat up and shoved him away. Christ, she mentally groaned, standing up and walking out the door, what was I thinking? I've got to get out of here before I forget I hate this creep.</p><p>The doctor, who introduced herself as Rose Madison, was waiting for them at the foot of the stairs. Jeannie greeted her with, \"Nice to meet you, I'm Jeannie Lawrence, they're all crazy and they're holding me prisoner, mind getting me out of here?\"</p><p>The doctor, a small brunette with whiskey-colored eyes, was all commiseration as she explained she, too, was a werewolf, and she was very honored to be tending to the pack leader's mate as well as her future pack leader, and would my lady mind peeing in this cup?</p><p>Jeannie snatched the plastic cup out of Dr. Madison's hand, shot a sizzling glare toward Michael, ignored Derik's smirk, said loudly, \"I hate every one of you,\" and marched into a nearby bathroom.</p><p>Within half an hour, Dr. Madison had confirmed her pregnancy and handed her what looked like—yes, it was. An ice cream bucket full of pre-natal vitamins.</p><p>\"What the hell?\" she asked helplessly, hefting the bucket and astonished at its weight.</p><p>\"You'll need at least four a day, due to your increased metabolism,\" Dr. Madison informed her.</p><p>\"Sure I will,\" she said, humoring her. Dr. Madison let that pass, cautioned her about her diet, and told her she would see her again in two weeks.</p><p>Sure you will, Jeannie thought. She glanced around at Michael, Moira, and Derik. Now or never. If any of them came with, she was toast. \"Dr. Madison, can I talk to you in private about—uh—a female thing?\" she asked, feigning embarrassment.</p><p>\"Of course,\" the doctor said quickly, even as the others did a respectful fade. \"Come, walk with me to my car.\"</p><p>Once outside, Jeannie glanced around again, saw no one, and followed Dr. Madison to her car, a nifty little Ford Taurus. \"Uh—the werewolf thing. Should it turn out to be true, will I have a litter? Will I have a puppy?\"</p><p>Dr. Madison laughed kindly. \"No, you won't have a litter. Two, at the most—and that is rare for our kind. And werewolves don't change until puberty. He or she will seem like a perfectly normal-looking child until, oh, about age thirteen or so.\" She grinned. \"Then all hell is going to break loose. Don't worry about being human mother to a werewolf, though. Our leader will help you. We'll all help you.\"</p><p>\"It takes a village to raise a werewolf,\" Jeannie said wryly, casually hefting the huge container of pre-natal vitamins. Who ever heard of taking four a day? The doctor had given her enough to last ten years.</p><p>\"To raise the next pack leader, certainly.\" Dr. Madison turned to look at her with a serious gaze. \"One thing, though. Your child will be highly prized. Not only because of his status in the pack, but because often the child of a human/werewolf mix is able to control their Change. To turn into a wolf at any time, not just during the full moon.\"</p><p>In spite of herself, Jeannie was fascinated by the complexity of the fantasy. \"Is that why the others don't resent me? I'd think, if anything, a human would dilute the strain.\"</p><p>\"Not in this case. Human mothers are prized. Smart, courageous ones even more so. Every time you snap at Michael or crack a joke, or make a determined effort to hide your fear, they like you more. He likes you more.\"</p><p>\"Oh,\" Jeannie said, completely mystified.</p><p>\"Well,\" Dr. Madison said reasonably, \"who wants a dishrag for a consort?\"</p><p>\"Not me,\" she said, and swung the heavy container, hard sidearm, at Dr. Madison's head. The blow knocked the small woman into the car, where she bounced off and hit the gravel drive, hard. Jeannie prepared to step over Dr. Madison's unconscious body, and was astonished to see the woman was still clinging to consciousness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Don't,\" she slurred, trying to get to her feet. \"It's too dangerous. Gerald will kill you.\"</p><p>\"Sorry,\" Jeannie said, and she was. The doctor was almost a foot shorter, after all. But tough as hell. Jeannie jumped into the car, starting the engine with one twist of the keys conveniently left in the ignition. \"Christ,\" she muttered, slamming the car into first gear, \"hit her over the head and her only concern was for me. Damn.\" If she wasn't careful, she'd get attached to those loonies.</p><p>She was down the lane and out the gate before the alarm was raised.</p> <p>Chapter Seven</p><p>Knowing better than to outrun them—who knew how many fleets of cars, choppers, and what-have-you Wyndham had at his disposal—she screeched to a halt in front of the Barnstable Police Station. Sprinting up the stairs, she burst into the station and yelled, \"Help! I've been kidnapped by a group of nuts who think they're werewolves!\"</p><p>The three people in the room—the desk sergeant, an off-duty patrolman, and a plainclothes detective—turned to stare at her. \"Quiet town,\" Jeannie mumbled, keeping an ear cocked for the sounds of pursuit.</p><p>\"I'll take this one,\" the detective said. He was a large man, a good four inches taller than she, with mud-colored brown hair, eyes the same color, and fists the size of bowling balls. He gestured to a door at the end of the hall. \"C'mon, honey. Tell me all about the big bad wolf.\"</p><p>\"Werewolf,\" she corrected him, walking down the hall. At his nod, she pushed through the door and found herself outside, in a small alley. Surprised, she turned—and ran smack into the detective's chest. To her shock, he shoved her away, hard.</p> <p>\"You've got Wyndham's stink on you. You must be his new bitch,\" he snarled, snuffling her ear. She jerked away, appalled. His tongue flicked out and ran across his thick lips; he looked about as evil a creature as she had ever seen. \"And is that his little bitty babe I smell in you?\"</p><p>\"Are you Gerald?\" she asked dumbly.</p><p>\"I was. Now I'm going to be stepdaddy to the new pack leader.\" His big fist came looping through the air toward her; she ducked under it, darted forward, and snatched his sidearm out of his holster. In a flash she had the barrel jammed into the soft meat of his throat.</p><p>\"Guess again, Detective Stupid,\" she growled. \"Christ, has everyone gone crazy? Am I the only sane person in an insane world? Can it be that—?\"</p><p>\"If you're going to kill me, get it over with,\" Gerald grunted, \"but don't make me listen to you whine.\"</p><p>\"Oh, shut up,\" she snapped. \"Who else on the force thinks they're a werewolf?\"</p> <p>\"Thinks they're a werewolf?\" As she dug the barrel deeper into his flesh, he added, \"Three others. They're all on Wyndham's side. Too bad for you they're on patrol, eh?\"</p><p>\"Guess again, rogue,\" a cool female voice said. Jeannie snapped a gaze over her left shoulder and saw two uniformed patrolmen and another plainclothes detective—this one a woman—pointing guns at them. At Gerald, hopefully.</p><p>\"Our leader told us you'd probably stop here first,\" one of the patrolmen said, almost apologetically. \"Step away from Gerald, please, ma'am.\"</p><p>\"You might want to mention to Michael that I had everything under control,\" she said, obeying.</p><p>\"If I were you, ma'am,\" the detective said, not taking her gaze off Gerald, \"I would not mention that I had even met this man, much less drew down on him.\"</p><p>\"Good advice,\" Jeannie mumbled. She tucked the piece into the back waistband of her jeans, ignoring Gerald's burning glare. \"I like to keep souvenirs,\" she told him, then let herself be escorted to a patrol car.</p><p>In the back (feeling like a POW, to tell the truth), her curiosity impelled her to ask, \"Are you guys going to get in trouble? For pulling a piece on a fellow cop, a member of the brotherhood, that sort of thing?\"</p><p>\"Pack business is private,\" the lady detective said, turning around to look at her through the mesh. \"And Gerald doesn't outrank me.\" Her buddy behind the wheel laughed at that one, and Jeannie shook her head, wondering what the joke was.</p> <p>To her surprise, the cop-werewolves let her keep the piece. To her further surprise, upon return to the mansion she was not instantly dismembered. Instead, Dara, the chef, politely asked if she wanted to eat and, upon declining, Jeannie was escorted to her rooms and locked in. That was it. No yelling, no threats, no thunder-voiced Michael promising doom. No Michael, period.</p><p>\"Well, hell,\" she said, looking at her watch. She'd been free for all of twenty-seven minutes. She tucked the pistol away in a bedside drawer and prepared to kill a few hours.</p><p>She amused herself watching daytime reruns (The Brady Bunch and Wings were particular favorites) until dinner time. Moira, pale and quiet, brought supper.</p><p>\"What's up with you?\" Jeannie asked, pouncing on the covered plates. She lifted the lids to reveal prime rib, baby red potatoes, green beans. Bliss, except for the green beans—blurgh. \"And why hasn't your lord and master been in here to play 'Jeannie is a bad girl'?\"</p><p>\"He's so angry,\" Moira practically whispered. \"He's staying away from you until he calms down. When he heard Gerald had his hands on you—the builders are coming tomorrow to fix the holes in the wall.\"</p><p>The bite of prime rib stuck in Jeannie's throat. With an effort she swallowed, coughed, and said, \"So, the cops ratted me out, eh? Fascists. Did they mention when they came on the scene, Gerald was saying hello to the barrel of his gun? Held by me? Because I got the drop on the overconfident son of a bitch?\"</p><p>Moira flashed a smile, which eased the tension lines around the smaller woman's eyes. \"They did. They practically fell over themselves assuring our leader you were never in any danger. You made quite an impression on them.\"</p><p>\"You should see the mark on Gerald's neck, you want to see impression,\" she chortled, forking down another bite of the delicious prime rib.</p><p>She was halfway through the meat before she realized it was raw. She waited for the urge to puke, or faint, but it didn't come. Moira saw the look on her face and quickly explained, \"It's normal, my lady, don't fret. You're growing a werewolf, after all. You'll crave raw meat throughout your pregnancy.\"</p><p>\"My God!\" Jeannie said, putting down her fork. \"I'm catching your delusion!\"</p><p>Hours later, she was soaking in the tub—which was more like a miniature pool—when the bathroom door opened and Michael said, quite calmly, \"You put yourself in danger. You put my unborn child in danger. On purpose.\"</p><p>She swallowed a mouthful of water and sat up, looking behind her to see him standing in the bathroom doorway, stone-faced. She opened her mouth, but before she could speak he said, \"Finish your bath,\" and walked out.</p><p>An hour later, she was still in the tub. Wrinkled and shivering, but defiant. He wasn't the boss of her, dammit! She'd get out of the tub when she was damned good and ready, thank you very much—</p><p>\"Jeannie. If I have to remove you from the tub, you won't like it.\"</p><p>—and that was right now. She climbed out of the tub, dried, and shrugged into the clothes she'd been wearing earlier. She wrapped her soaking hair in a towel and padded into the other room to take her medicine.</p><p>Wyndham was apparently a helluva boy scout, because he'd kindled a respectably-sized fire in the fireplace. He was crouched before the flames, balancing on the balls of his feet, and she had the impression he'd been in that position some time, waiting for her. He turned his head when she entered the room and came to his feet at once.</p><p>\"Why aren't you wearing a nightgown? There are plenty of clothes for you to wear.\"</p><p>\"They're not my clothes,\" she pointed out. \"You stocked up before snatching me, didn't you? Bought a bunch of stuff in my size? I saw it earlier. Well, forget it. I'm wearing my own clothes.\"</p><p>By firelight, his eyes were yellow. His voice, though, was still cool and calm, which reassured her somewhat. \"Everything in this room is yours.\"</p><p>\"This room isn't mine. Nothing here is mine. Now, about this afternoon.\" She swallowed and lifted her chin. \"I admit to some remorse about cold-cocking the doctor, but . . .\"</p><p>He crossed the room and tore the shirt off her body, ignoring her outraged squawk, then leaned down and tugged at her leggings until they, too, were shreds. \"Your old life is over!\" he shouted as he dragged her to the bureau. He yanked open a drawer, found a nightgown, thrust it at her. \"You belong to me, and you will wear my clothes and stay in my home and be safe and you will damned well like it!\"</p><p>Shocked at his rage and loss of control, she couldn't grab the nightgown and it floated to the floor. \"You weren't this out of it in the elevator,\" she said, brushing the scraps of t-shirt off her arms, hating the way her hands trembled. \"What's your problem?\"</p><p>\"My problem,\" he said with savage sarcasm, yanking the towel from her hair and furiously towel-drying the soaked tresses, \"is a willful mate who doesn't care about her own safety or, apparently, my child's.\"</p><p>\"I'm not your mate!\"</p><p>\"You are. And all your protests won't change the fact. Werewolf law is a hell of a lot older than human law, Jeannie, and as such, you're mine, as the child is mine, forever and ever, amen.\" He finished drying her hair and tossed the towel at her. \"So I strongly recommend you get over it.\"</p><p>\"I hate you,\" she said hopelessly, furious at herself for not being able to come up with anything better.</p><p>\"I suggest you get over that, too,\" he said carelessly. He pulled his t-shirt over his head, unbuttoned his shorts, let them drop, and stepped out of them.</p><p>\"Wrong,\" she said, and oh God, her throat was so dry. \"Not in a thousand years, pal. Never again.\"</p><p>\"I'm not your pal,\" he said coldly, but his cheeks were flushed with color and his gaze was hot. \"I'm your mate. It's time you were reminded of the fact.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"And you can't wait, can you?\" she hissed. \"All day you've been hoping I'd escape, so you can rape me. Again. Well, I did try, and now you get to play—or at least you think you do—so why are you so mad?\"</p><p>\"I never expected you to end up in Gerald's literal grasp,\" he growled, stalking toward her. She took a great, clumsy step backward and nearly tripped over an endtable. He was there to steady her, his hand on her arm surprisingly gentle. \"Jesus! He could have torn your throat out and you wouldn't have known it until you woke up in the afterlife!\"</p><p>\"The only one in danger of throat trouble was Gerald,\" she retorted, and swallowed to get the lump out of her throat. \"I had his gun. I—\"</p> <p>\"There was no bullet in the chamber, you idiot!\" The heat of his rage baked her face; he shook her so hard her hair flew into her face, her eyes. \"The gun wouldn't have fired! Gerald knew it, he could have killed you at any time! Now he knows your status, knows where you are, knows if he gets you he gets the next pack leader. You've been reckless and you might have paid the price with your life, if my people hadn't gotten there in time, you stupid, stupid . . .\" Then she was crushed to him in an embrace so tight it drove the breath from her lungs. His chest heaved and he shuddered all over, trying to force calm. \"How could you have risked yourself? Risked our baby? Frightened years off my life?\"</p><p>\"I didn't—I didn't—\"</p><p>His mouth was suddenly on hers in a bruising kiss even as he moved, pulling her with him. The backs of her knees connected with the bed and she twisted away from him, gasping, only to have him casually toss her on the bed. He stripped off his undershorts and she couldn't help but stare at him, at the thing that had gotten her into this mess. Fully erect, almost curving under its weight, thrusting from a lush nest of black hair, she looked for a long moment, almost spellbound. Then her gaze was drawn upward until she was staring into his gleaming gold gaze.</p><p>\"I can't,\" she whispered, but oh, part of her wanted to. \"Not with you. Not again.\"</p><p>\"You will. Only with me.\"</p> <p>He climbed onto the bed, easily avoiding her kick, and then his chest was settling against hers and his hands were in her hair, tugging, forcing her head back. He dipped his head and inhaled her scent, seeming almost to savor her, but she could feel that hot, hard pressure against her lower stomach and knew he wasn't going to be satisfied with just her natural perfume.</p><p>\"Don't.\"</p><p>\"I can't help it. I've always loved your scent.\"</p><p>\"Don't!\" she said, almost gasped, as he licked her throat. \"I don't want you. Don't do that!\"</p><p>\"It doesn't have to be punishment,\" he said, and sounded almost—could it be?—desperate. \"Let me make it good. I want you,\" not your body. I don't want to take by force what you could share with both of us.\"</p><p>\"Don't you understand?\" she screamed at him, startling him, startling herself. \"I can't! The qualities that make you like me also fix it so I can't . . . give . . . in.\" No matter how much I want to, she thought desperately. \"Now leave me be!\"</p> <p>\"Please,\" he said again, and his eyes were haunted. \"I'll overlook what happened. I shouldn't have backed us both into this corner. Just let me—\" He dropped a soft kiss to her throat. \"You'll like it.\"</p><p>That's what I can't bear, she said to herself. Oh, God, anything but that—anything but me begging him again. I'd rather be taken in anger than reduced to humiliating screaming and begging, shouting myself hoarse while I come so hard I can't think straight . . .</p><p>And he was wrong. He was wrong to keep her here, Gerald or no Gerald. Her outraged pride could never escape that fact. Nobody held Jeannie against her will, God damn him.</p><p>\"I'll escape again,\" she said through gritted teeth, as he licked the underside of her left breast. Her nipple rose, a taut pink rosebud, and he rubbed his cheek against it. She whimpered, the tiny sound escaping before she could lock it back.</p><p>He smiled at the sound. \"I was so afraid,\" he said quietly, pressing his mouth to her cleavage for a brief, sweet kiss. \"So terrified. When they told me who you'd run to. When they told me that mate-killing bastard had actually put his hands on you.\" His head dropped to her shoulder. \"Jeannie, I was so scared for you,\" he said, so low she could barely hear the words.</p><p>She wanted to comfort him. She wanted to thank him for his concern. And she hated every tender feeling he was calling up in her. Forcing on her. Better to be forced, better to be victimized, than a willing prisoner. Anything but that.</p><p>\"I think I could get a better deal with Gerald,\" she said with cruel casualness. \"As soon as I escape again—and I will—I'll have to track him down. At least he'll leave me alone until the baby's born.\"</p><p>He froze against her and she held her breath. He raised his head and gave her a long, level look.</p> <p>\"I will leave,\" she said evenly, and felt shame, and felt anger at feeling shame. \"I won't stay here against my will. Let me go now, tonight, or I'll find Gerald just as soon as I can.\" A bluff—she wasn't going near Gerald on a bet—but Michael wouldn't know that.</p><p>He said nothing. Instead, he calmly rose and padded out of the room, stark naked. She went limp with relief, unable to believe she'd gotten off so lightly.</p><p>She rose from the bed and put away the nightgown he'd thrown at her earlier. She'd meant what she had said, about not wearing clothes he'd picked out during his shop-for-my-future-prisoner spree. It wasn't to be borne, not any of this male-domination bullshit, and if he thought she was the type to . . .</p><p>He was back, carrying something.</p><p>He kicked the door shut behind him, his face dark with anger, then he unscrewed the top to the tube, squeezing a handful of—of something onto his hand. He rubbed the handful all over his turgid cock, until his member was shiny and slick with lubricant.</p><p>She watched this cold procedure—his expression never changed—with her mouth hanging ajar. Then understanding hit and she turned to run . . . somewhere. But his hand was on her elbow before she'd even taken a step. He thrust her, screaming her denial, face down on the bed. She scrambled to her knees and he let her, then he grasped her hips and plunged inside her. She shrieked again at the shock of it, the brutal intrusion, the taking of her for punishment.</p><p>He reared behind her, plunging and withdrawing, and her screams of anger—for, in truth, this didn't hurt, but it couldn't exactly be called pleasurable, either—gave way to furious weeping. He never missed a stroke, and after a minute he was shuddering behind her.</p><p>He let go of her hips and she dropped to the bed, which shook with her sobs. He let her cry for a long moment, then put a hand on her shoulder and eased her on her back. She couldn't look at him.</p><p>\"That was for what you just threatened to do,\" he said hoarsely. \"Never think of going near him. He'll kill you. I couldn't bear that.\"</p><p>He left her on the bed, going around the room and shutting off the lights. She tried to get a grip on herself, tried to stop crying, but it was all too much—the stress of the last three weeks caught up with her, not to mention the stress of the last minute and a half.</p><p>When he eased into bed beside her she cringed back, expecting to be used again, but he shushed her and pulled her, oh so carefully, into his arms, as if he thought she might shatter if handled too roughly. His large warm hands stroked her back and he pulled her face into his throat. In the dark, his voice rumbled against her cheek, sad . . . almost lost. \"You wouldn't know this, but . . . that's how a werewolf punishes his mate. Using her but withholding pleasure. You had frightened me so badly, you weren't listening, I—I couldn't think of what else to do.\" Pause. \"And I was very angry, tremendously angry.\" He licked the tears from one cheek and, when she didn't cringe or flinch, but just sobbed softly and steadily, he licked the tears from the other. He licked the ones that had dripped to her chest, chasing one errant tear all the way to her nipple.</p><p>He trailed soft, sweet kisses down to her naval and she could feel herself stiffen beneath him. He paused, obviously expecting a protest, but the agony of her recent humiliation was too great, and she was afraid to stop him. \"It's all right,\" he said sadly, reading her mind, or perhaps smelling her fear. His tongue flicked out, caressed the cup of her navel, moved lower. \"No matter what you do or say, I'm done with cruelty for tonight. I've found I don't have the taste for it when you're involved. Do you want me to stop? Leave?\"</p><p>Wary of werewolf tricks, she said nothing, but couldn't stifle a gasp of protest when he settled himself between her legs. He started lapping the inside of her thighs, cleaning his seed from her, and a treacherous warmth began to spread through her limbs. She could feel herself relaxing by inches when long minutes went by and all he did was nuzzle and kiss and lick her inner thighs. When his tongue brushed her clitoris, there and gone again, she didn't even have time to squirm before he was back to tending to the less sensitive skin of her thighs. Then his tongue was delving inside her, darting, flicking, probing . . . and then back to her inner thighs.</p><p>Soon the trips to her inner thighs were shorter, and all his attention was on her cunt, which had began to throb in delighted abandon. She tried to bite back a groan, but he heard the muffled sound and murmured, \"It's all right to like it.\"</p><p>Not with you, she thought despairingly, and nearly groaned again when he suckled her clit, swirling the impudent bead with his tongue. Then she felt his finger ease into her and her back bowed off the bed, her teeth biting her lips bloody in her efforts not to show him how his wonderfully skilled touch was affecting her.</p><p>Everything clenched within her, and suddenly her orgasm was blooming through her like a dark flower. Even as sweet aftershocks made her limbs tremble, he was pulling her toward him, and then he was on his back and she had straddled him. Murmuring encouragement, he took himself in one hand, nudged her thighs a bit further apart, and then his tip was in her, while she braced her hands on his chest to keep from falling. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stopped. She looked at him in the near dark.</p><p>\"Go ahead,\" he urged softly, hoarsely. \"Take me inside you. Or not. This time, it's your decision.\"</p><p>Still she didn't move, wary, wondering what he was up to, wondering if he was going to punish her again, the black-hearted (he's never hurt you) bastard, oh, how she hated (you were no match for that crooked cop) him, wished him dead, hated him for humiliating her (if the cavalry hadn't shown up, you'd have been toast) and then bringing her pleasure. He was contemptible, and she was trapped (you don't really think they're all crazy, do you?).</p> <p>She shut out the despicable voice and abruptly, hatefully, let her weight drop on him, slamming him all the way inside her, until she could feel his tip touching her womb. Then she lifted . . . and dropped again. And again. Beneath her, Michael gasped, a ragged sound. \"Jeannie—\"</p><p>Lift. Drop. Again.</p><p>\"Stop, Jeannie, you're not—this is all for me, you're not getting any—\"</p><p>Again.</p><p>\"—please, stop it, stop it, let me help you come again, don't do this—\"</p> <p>Again.</p><p>\"—don't do this, don't, don't—\"</p><p>Again. She kept it up, riding him with savage intent, ignoring his pleas that she slow down, that she allow herself pleasure. She used him as he had used her, and from the look on his face, her expression was every bit as mean and ugly as she felt. After an eternity, he threw his head back, his protests ending in a ragged groan. She felt him pulse within her, felt her muscles grab at him greedily, milking him, and hated herself almost as she hated him.</p><p>Without a word, she climbed off him and curled up on her side, away from him.</p><p>I'm trapped, she thought with dull despair. They're all nutty, the whole town's infected, they're all in on it, they'll help him keep me. I can't get away, and if I try again, there's more of . . . of this.</p><p>I can't get away.</p> <p>I can't stay.</p><p>She wept again, silently, ignoring Michael's soft entreaties that she look at him, that she forgive him, that she try to understand.</p><p>\"You're pregnant with a child who will grow up to safeguard and lead some 300,000 werewolves across the globe. That's bigger than your pride, Jeannie. Your safety has to come before everything. I'm—\"</p><p>\"Don't say you're sorry again,\" she said coldly, and he shut up.</p><p>Chapter Eight</p><p>\"You've broken her!\"</p><p>The accusation brought Michael wide awake. After leaving Jeannie, he'd paced his room for hours, wondering what, if anything, he could have done differently. Werewolf discipline had been a mistake—or had it? If it kept her from fleeing to Gerald, it was worth the tears and hatred. He'd rather she hated him forever than love him and die tomorrow.</p><p>It all came down to their natures, to the fact that he had different rules than she was used to, but she couldn't accept this because she couldn't accept them. She thought they were all deranged. Perhaps Jon's suggestion had been correct. If she saw them Change, even one of them Change, she could look at her situation in an entirely new light.</p> <p>But oh, she would be terrified, would expect to be forced again. Could he put her through that, even though he knew he was right?</p><p>Was he right?</p><p>Finally, he'd dozed off at dawn, only to be brought awake by his door slamming open and Derik shouting at him.</p><p>\"What?\" he asked fuzzily, blinking sleep out of his eyes. He looked out the window . . . and was startled to see it was mid-afternoon. \"What's the matter?\"</p><p>His boyhood friend slammed the door so hard, a splinter the length of his forearm jumped off the frame and landed on the floor. \"You've broken your mate, that's what's the matter. She's been curled up in the window seat all damn day, won't speak a word to anybody, won't eat a thing—naked, for God's sake, she won't get dressed, won't talk, won't eat—\"</p><p>\"You're repeating yourself,\" he said sharply, quelling the dart of worry that made an instant appearance at Derik's words. \"Is she hurt? Has anyone seen to her?\"</p><p>\"She's not hurt,\" Derik said, aggravated, \"I keep telling you, she's broken. You smashed her spirit. And we think that rots.\" He paused, coughed. \"Sir.\"</p><p>\"We?\" he asked, sliding from the bed. \"My loyal staff and pack members, you mean?\"</p><p>\"I can smell her all over you,\" his friend said quietly. \"You took her again, didn't you?\"</p><p>\"When I heard about Gerald—that he'd actually had his hands on her—\"</p><p>Derik groaned and collapsed on the bed. \"Not mate-punishment, tell me, tell me you didn't take a human for punishment?\"</p><p>Silence.</p><p>Derik sat up and glared at his pack leader. \"Jesus, Michael, she's delicate! She's human. You shouldn't have done that, no matter how badly she scared you. You can't treat her like a werewolf, even if she is your mate.\"</p><p>A low growl got Derik's attention, and he dropped his eyes at once. \"Okay, hell, I'm upset. I shouldn't tell you how to handle your female.\" He paused, then burst out angrily, still keeping his eyes respectfully downcast, \"But you'd better get up there and fix it, O mighty king of all werewolves, because your mate is in a sorry state and it's all your fault. She's got to eat. And it would be nice if she got dressed, too.\"</p><p>\"I can't go near her,\" he said, pacing the same stretch of carpet he'd walked so many hours last night. \"I'm part of the problem. She doesn't understand our rules, doesn't understand—\"</p><p>Derik looked up. \"Then make her understand,\" he said, clearly exasperated.</p><p>\"I'm trying!\" Michael managed to restrain himself from kicking a hole in the dresser. \"I'm trying, but how do you teach a blind person how to look at things? How do you tell a deaf person what a symphony sounds like? You can't make them. You can only hope they get it . . . even though your worst fear is that they never will. You know she's my mate, and I know . . . and we both know she's alpha female, and a valued member of the pack. But she doesn't understand any of that. It's too soon. A month ago, she'd never met me. A month ago, I had no idea I'd—I'd—\"</p><p>\"Fall in love?\" Derik asked quietly.</p><p>Michael groaned. \"How could everything turn to shit so quickly? She hates me, Derik, and I can't blame her for that. I've been a disaster for her since I stepped on that elevator. The worst thing is, even if she saw me Change, if she knew we weren't crazy, she'd be terrified.\"</p><p>\"But what's the alternative?\"</p><p>The pack leader had no answer.</p><p>\"Please, ma'am, please . . . Jeannie . . . try some of the bread. Dara saw how much of it you ate yesterday, she made a whole loaf just for you, won't you please try just a piece?\"</p><p>Moira's entreaty became a soft drone as Jeannie looked out her window, out to sea. The ocean looked exactly like she felt: grey and stormy. The weather matched her mood; it was a perfect day to stay inside and brood. Even the sand looked cold and forbidding, like dirty snow. She'd give anything to be a weredolphin, a weregrouper, a wereminnow, anything that could swim the sea and never never come back to this crazy place. Her stomach, which had been gnawing and rumbling most of the morning, had finally quit and was now a still stone in her abdomen. Vanquished. Defeated.</p><p>The way she'd like to defeat Michael Wyndham.</p><p>They'd tried to get her dressed. Moira and another woman, one she didn't know, had come in and gently pulled her from her window seat, and dressed her in clothes that weren't hers, clothes Michael had bought for her when he was dreaming about stealing her. She tore them off her, not as spectacularly as Michael had torn hers, but enough to get her point across and then, naked, she had gone back to the window seat, resting her forehead against the panes and wishing she were a wereguppy.</p><p>Moira whispered that she understood, she could smell Michael all over her and understood completely, but why punish the baby for the sins of the father, and wouldn't she please try some of this soup?</p><p>Somehow, the day passed. Jeannie was thinking harder than she had in her life (ha) but couldn't see a way out of the trap (except to quit letting your pride call the shots).</p><p>Night came, and she dozed off in the window seat, ignoring the cramping in her legs. And there came a point in the dark when she was gently lifted, carried, and placed in bed. She roused herself enough to catch Michael's scent and tried to fight all the way back to wakefulness, to get back to the window and look out at the sea and freedom, to get his hands off her, his wonderfully comforting hands . . .</p><p>\"Go back to sleep, Jeannie. The window will be there tomorrow.\"</p><p>Reasonable advice, she thought muzzily, and sank back to sleep.</p><p>Michael, keeping uneasy watch out Jeannie's window, turned when she sat up. He saw at once she wasn't really awake; her dreaming, wide-open eyes looked right past him.</p><p>She got out of bed. Having a good idea of her destination, he followed her out the door, steadying her on the stairs when her sleeping feet stumbled. Jon, back from a late-night hunt, passed them in the dark, his eyes widening appreciatively at Jeannie's nudity. Then he saw she was asleep, saw Michael behind her, and passed on after a polite nod to his pack leader.</p><p>She wandered aimlessly on the lower level, until he gently steered her toward the kitchen. Once there, he opened the fridge for her and saw the small plastic container with her name on it. He popped the lid and caught the rich, savory scent of raw ground beef mixed with raw eggs, onion, and lots of salt and pepper.</p><p>He handed the container to Jeannie, who did not hesitate to grab a fistful and eat it. She ate until the container was empty, and while he shut the fridge and put the container in the sink, she delicately licked the raw meat from her fingers. He watched her without words.</p><p>Then she woke up.</p><p>He saw it at once; her dreaming gaze became clouded, then utterly astonished. She looked down at herself, then looked around, saw him, saw where they were. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I—thought I was dreaming.\"</p><p>\"You were hungry,\" he said simply. \"So you sleep-walked down here to feed the baby.\"</p><p>\"I ate—I ate all that raw hamburger?\" She touched her mouth, revolted. \"I can still taste it.\"</p> <p>\"You were hungry,\" he said again. \"And I think the taste in your mouth is good to you. It's just the idea of it that tastes bad. Jeannie . . . can you see me? Do you know where we are?\"</p><p>\"We're in a kitchen. Yes, I can see you.\" She added, with a snap of her old fire that heartened him, \"Ask another stupid question.\"</p><p>\"It's pitch dark, Jeannie. A month ago, in equal darkness, you couldn't see anything.\"</p><p>A long, strained silence, broken by her whisper. \"What's happening to me?\"</p><p>\"You're pregnant with a shapeshifter,\" he said simply. \"You share a blood stream with the baby. You'll eat raw meat and see in the dark and probably get stronger before you birth the baby. It's natural.\"</p> <p>\"It is not natural. None of this is.\" She rubbed her face. \"Oh, Jesus, I'm catching your delusion, you've all got me turning as crazy as you are . . .\"</p><p>\"That's not true,\" he said, reaching up and stroking her shoulder, lightly, a butterfly's touch. \"And I think you're coming to know it.\"</p><p>\"It has to be true,\" she said, almost moaned. \"What's the alternative? That everything you said was right? That everything you—everything you did to me was understandable? Okay, even? That's not acceptable, I won't tolerate it!\"</p><p>\"Jeannie . . .\"</p><p>She broke away from him and ran out of the kitchen, navigating her way past boxes and stools without hesitation, though most people would have been effectively blind in such utter darkness.</p><p>He came to her room the next morning to find her huddled in the window seat, looking out at the near-full moon with a dazed, almost hypnotized expression.</p> <p>\"Jeannie,\" he began, and then trailed off helplessly. His fingers itched to touch the smooth skin of her back; luckily, his hands were full. His lack of physical control had gotten her into this mess. Christ, he was like a pup around her, only thinking about physical pleasure, about the sounds she made when she . . . \"I'm glad you ate your breakfast.\"</p><p>\"Starving myself doesn't work,\" she said hopelessly, not turning around. \"It just makes me sleepwalk and search out raw meatloaf, for God's sake. Better to have my scrambled eggs, please go away.\"</p><p>He decided it would not be prudent to mention her cravings would get worse, not better, before she gave birth.</p><p>\"I brought you something.\"</p><p>She didn't answer.</p><p>He set the suitcases down, bent, unsnapped all four catches. At the sounds, she snuck a glance over her shoulder, then came off the window seat in astonishment. \"My clothes!\"</p><p>\"Some of them,\" he confirmed, while she elbowed him out of the way and took a closer look. \"I went to get them last night. I can't have you running around naked for the next eight months, can I?\"</p><p>She grinned at him, so wide and natural he actually felt his heart catch: ka-THUD! \"Thanks!\" She made an aborted movement with her arms; for a moment of pure astonished happiness, he thought she was going to hug him. Then the moment passed and she was wriggling into panties, shorts, and a sweatshirt.</p> <p>Well, what did you expect, fool? he asked himself bitterly. That she'd kiss you and say, 'Hey, PsychoBoy, I forgive you for the whole raping thing—twice—and love you and want to stay with you forever, thanks for the clothes.'</p><p>He turned to leave.</p><p>\"Michael,\" she said tentatively.</p><p>He turned around, hope jumping in his chest like a rabbit. A continuously lusty rabbit hopelessly infatuated with someone who hated him. \"Yes, my—my dear?\" He'd almost called her 'my own mate', a common werewolf endearment he was positive she would not appreciate.</p><p>\"Michael . . . can I ask a favor?\"</p><p>He waited. She looked out the window at the moon, nearly full, the moon which would ripen tonight and call to his blood. Her eyes were wide with distress, dilated with fear. \"Can I please stay somewhere else tonight? I promise I won't try to get away. I'll—I'll do whatever you want, if you don't make me stay in the house with—with all of you tonight.\"</p><p>\"It's not safe for you anywhere else,\" he said, as gently as he could. \"And I'm still planning to leave. You don't have to worry about a repeat of what happened last month.\" She didn't have to worry no matter where he was, he thought but did not say, because she certainly wasn't ovulating this time. What he would likely want to do in wolf-form is hunt food for her, then stay close. Following her from room to room, drinking in her scent, worshipping her with his eyes. She'd be terrified . . . or hate it—him . . . or both.</p><p>He closed his eyes against the pain that thought brought, then opened them as she did something he never thought she would do . . . never thought she was capable of.</p><p>\"Please!\" she begged. \"I don't feel safe here! It's beautiful here, but I don't feel safe in your home.\" Every word was a knife in his heart, but she didn't notice, just rushed on in her agitation. \"Every minute that goes by, I feel like something terrible will happen, something I'm in the middle of! Please, please let me stay somewhere else. I'll do anything, Michael, anything you want.\"</p><p>\"Don't beg,\" he said thickly, \"I can't bear it,\" but she wasn't hearing him. She crossed the room in an instant and flung herself into his arms; he hugged her to him automatically, stepping backward with the force of her assault. \"Jeannie, listen. It's not—\"</p><p>He quit talking because her frantic mouth was on his, her hands were pounding on his chest and then scratching the fabric of his shirt, her scent—orchard ripe, succulent peaches—overwhelmed him. The force of his return kiss bent her backward. \"Anything,\" she hissed into his mouth. \"Anything.\"</p><p>The man in him managed, 'Wait! She's giving herself to you for a favor, she thinks if you take her, she can leave tonight. Stop, idiot!' before the wolf took over, yanked her sweatshirt over her head, divested her of her shorts, tore her panties in his haste, tossed her on the bed. He was on her, her limbs were entwined with his and everywhere was her scent and he couldn't get enough, could never get enough of her. He buried his face in the sweet slope of her throat, cupped her breasts with their impudent velvet nipples, kissed her so hard they were both panting when he pulled his mouth from her.</p><p>Part of him thought, even as he put his hands on her, his mouth on her, that she must be frightened indeed to give herself to him, a woman who had starved herself and gone without clothes to show her contempt for him. He made a last, heroic effort. \"You can't leave,\" he growled, then bit her earlobe, and wondered how he could make himself leave her with his cock on fire and her musk in his nostrils. \"It's not safe.\"</p><p>She bowed her head, resting her forehead against his shoulder. \"I know. I knew you wouldn't let me, but I was desperate. I've been watching that damned moon and getting upset and now I'm . . . oh, God, I'm so ashamed.\"</p><p>He kissed the slope of her breast. \"Don't say that.\"</p><p>\"I am, though.\" She seemed content to let him nuzzle her breast; one hand was in his hair, almost absently. He gloried in her touch, in her temporary acquiescence, even as he craved more.</p><p>\"Because you used your body to try and get what you want?\"</p><p>She didn't answer, but he felt her swallow hard.</p><p>\"It doesn't make you bad. It makes you formidable.\" He chuckled. \"The remorse, now, that makes you human.\" He licked the underside of her breast, then nipped the sensitive skin. She jumped and he heard her swallow a gasp.</p><p>\"I think,\" she said carefully, trying to ease herself from beneath him, and, because he wasn't cooperating, having no luck at all, \"that since you won't let me leave, there's no reason for us to finish this.\"</p><p>\"You're not going to send me away, are you?\" He probably looked as horrified as he felt, because she got a downright devilish look in her eyes.</p><p>\"Yes,\" she said, \"I am. You promised you wouldn't force me unless it was to punish me. I haven't done anything wrong—\"</p><p>\"Today,\" he interrupted dryly.</p><p>\"—so you have to go,\" she finished triumphantly. He could tell she was loving it, loving the power she had over him, and was curious to see if he really would leave her, when they could both feel the throbbing below his belt.</p><p>\"Jeannie, I am begging you.\"</p><p>\"No,\" she said, pouting, but she was watching him, watching, and he caught the sharp scent of her wariness. He groaned theatrically and stumbled from the bed, adjusting his jeans to ease the stiffness between his legs.</p><p>\"About that promise . . .\"</p><p>\"Out!\"</p><p>The last thing he saw before leaving was the delighted, surprised look on her face.</p><p>Chapter Nine</p><p>Jeannie spoke around a mouthful of chocolate. \"What do you mean you're all leaving?\"</p><p>Moira had made the bed, over Jeannie's protests that she 'didn't need a maid, dammit'. Now she was clearing her mistress's lunch plates, and looked up. \"Only the females, my lady.\"</p><p>\"Why?\"</p><p>\"Because you want us to,\" she said simply.</p><p>\"But I never said—besides, Michael's the boss of you guys, not me.\"</p><p>\"The alpha female has expressed distress to her mate at the thought of being around us this evening. Thus, we depart.\" Moira shrugged. \"Simple.\"</p><p>\"But I'm not the—\" At Moira's look, Jeannie reversed herself. \"Okay, say I am. I never told you guys to go. I only told Michael.\"</p><p>\"Werewolf hearing,\" Moira said with a smile, \"is very acute. Besides, we can smell your torment. We don't want to add to it.\"</p><p>\"You're really leaving your home tonight? For me? Even though I didn't ask?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Moira just gave her a look, something along the lines of, 'yes, dummy'.</p><p>\"Of course,\" Jeannie said slowly, \"you could just be leaving so I don't see you're not werewolves.\"</p><p>\"After everything you've seen? Felt? Eaten?\"</p> <p>\"Ugh, don't remind me.\"</p><p>\"You still think we're crazy? Half the town? And everyone in this house? And the father of your child?\"</p><p>Jeannie harrumphed. \"Well, I'm not saying you're not convincing . . .\" But she squirmed under Moira's stern regard.</p><p>\"Well.\" Moira picked up the tray. \"As it is, we're leaving. I'll see you tomorrow.\"</p><p>\"Wait!\" She bounded to her feet and fought the urge to pluck at Moira's sleeve like a child. \"You said the females are leaving. What about the guys?\"</p> <p>\"The 'guys',\" she said dryly, \"think you should get over it. But we won't go there.\"</p><p>\"No,\" Jeannie shouted at Moira's retreating back, \"we certainly won't!\" She kicked a pillow across the room.</p><p>There was a tap on the adjoining door, and Michael poked his head in. \"We certainly won't what? And stop kicking that pillow, it's a hundred years old.\"</p><p>Jeannie, bending to retrieve the pillow, dropped it like it was hot. \"The girls are all leaving,\" she said in an accusing tone.</p><p>He frowned. \"Yes. They told me they were. They've gotten quite loyal to you in . . .\" He checked his watch. \"Seventy-two hours.\"</p><p>\"But the men aren't leaving.\"</p> <p>\"No.\" Seeing the confusion on her face, he added, \"The females will do what the alpha female wants, period. The males will do what is best for her. Not always the same thing.\"</p><p>\"Fascinating. Really, and I mean that.\" She yawned theatrically, and rubbed her eyes, feeling sudden, surprising weariness she didn't have to feign. Then she looked at him and said, no screwing around, no wise cracks, \"I'm afraid.\"</p><p>\"I know.\"</p><p>\"Why do you have to sound like that?\" she asked crossly, rubbing her eyes again. \"All loving and nice.\"</p><p>\"Because I have great admiration for you. Not just, as you think, your physical charms.\" He paused, then said, as baldly as she had stated her fear, \"I love you.\"</p><p>She choked in mid-yawn, and stared at him with wide eyes. \"No, you don't.\"</p><p>\"No?\" He smiled, that slow, sexy smile that always charmed her.</p><p>\"You just love the way I smell. Michael, be reasonable,\" she said, trying to sound reasonable herself, \"you don't know me well enough to love me.\" Thinking with surprised, giddy joy: He loves me! He loves me!</p> <p>\"Yes, I do,\" he said casually.</p><p>\"Michael,\" she said slowly, wanting to cross the room and touch him, but unable to make herself take that step, \"if you really love me, why'd you—why'd you shame me like that?\"</p><p>\"Are you going to run away and find Gerald?\"</p><p>\"No!\" She shouted the word before she thought, then blushed furiously. \"I mean, yeah, maybe, what's it to ya?\"</p><p>\"That's why,\" he said simply. \"I didn't want to punish you. I wanted to take you, but I wanted you to enjoy it. I hated having to scare you.\" To her astonishment, she saw his hands were shaking. \"I hated every second of it,\" he added with savage emphasis, \"but I would do it a thousand times if it meant you would keep away from Gerald.\"</p><p>There was a short silence while they looked at each other. \"Um . . . thank you? I guess,\" she muttered.</p><p>He smiled a little. \"Are you tired, sweet?\"</p><p>\"No,\" she said defiantly, but her eyelids felt ridiculously heavy. \"I want to keep talking about this so-called love.\"</p><p>\"Talk while lying down,\" he said, taking her arm and pushing her gently onto the bed. Before she could turn around or sit up, he had slipped into bed behind her, snuggling against her, spoon-style.</p><p>\"I don't want to nap with you,\" she said, wriggling against him.</p><p>\"If you don't stop moving,\" he warned, his breath tickling her neck, \"you won't be napping.\"</p><p>She went rock-still, and yawned again. \"Seriously, though. Why should I reward you for—\" He loves me, she reminded herself. \"Oh fine, stay then,\" she grumbled. \"See if I care.\"</p><p>His rumbling laugh was the last thing she heard.</p><p>It was dark when she woke, but she could see everything in the room quite clearly. She refused to think about what that meant (you've been doing lots of refusing to think this week, huh, babe?) and instead focused on Michael, who was pacing at the foot of the bed. His face was sheened with sweat and he kept running his fingers through his hair. In the gloom, his eyes were a tortured gold. He must have fallen asleep, too, she realized, and now there isn't time for him to leave before . . . before . . .</p><p>\"Michael?\" The word practically stuck in her throat. He didn't turn, didn't even glance at her. \"Are you all right?\"</p><p>\"Fine,\" he muttered.</p><p>Abruptly, she decided: no more fear. She couldn't fear rape if she was the aggressor. And, to be completely honest, the bastard had a touch like nothing she'd ever felt. She wanted it. At night, in her lonely bed, she craved it.</p><p>\"No more fear,\" she announced, and stood up in the bed. Then she leapt at him.</p><p>He caught her, as she had known he would, and staggered back so hard his back slammed into the wall.</p><p>\"My thinking is,\" she said into his astonished face, as she looped her legs around his waist, \"I've been terrified of a repeat of the elevator scene, right? All week, I've been worrying about it. Hell, I even tried to seduce you so you would send me away. Well, if I rape you, there's nothing to be scared of. Then I can go back to sleep.\"</p><p>\"Are you out of your—\"</p><p>She kissed him. Then she bit his lower lip. He groaned and staggered with her.</p><p>\"Jeannie—\"</p><p>She snaked her tongue inside his mouth. His own met hers in a frantic duel before he wrenched his face from hers. \"No! It's not like earlier, it's not—this close to my Change, if you change your mind I won't be able to stop.\" He set her down and shook her. \"I won't be able to stop! And I can't bear to force you again, even for punishment. If I find out in the morning that you were frightened, hurt—no.\"</p><p>She ripped open his shirt.</p><p>He spun away from her, panting. \"No.\"</p><p>\"For God's sake,\" she muttered, and jumped on his back. Looping her arms around his neck, she ignored his hoarse demand that she stop this at once, took his ear in her teeth, and bit. He howled and grabbed for her head, trying to pull her away . . . then changed his mind and pressed her face into the side of his head, hard. She bit him again and he groaned, \"I will never understand you.\"</p><p>\"Tough luck,\" she said sympathetically, then bit the side of his neck, and licked the spot.</p><p>He staggered to the bed and dropped, pinning her beneath him. She released her legs and he rolled over, shoving her sweatshirt to her neck and burying his face between her breasts. \"Last chance,\" he moaned.</p><p>\"My thought exactly,\" she grunted, pulling the shirt over her head, wriggling to get free of her shorts. He helped her with hands that shook and in moments they were both nude.</p><p>She started having second thoughts when he turned her over and eased her on her knees. \"Michael,\" she managed as he kissed the base of her spine. \"Anything else—any other way—but I'm not sure I'm ready for this yet.\"</p><p>He didn't answer, and she was about to try again when she felt his tongue flick past the opening of her vagina . . . then delve deeply. She bit back a moan and thought, What the hell am I hiding from? I love it, and he knows I love it.</p><p>When his thumbs spread her wide and his tongue lapped at her exposed flesh, she groaned so loudly she was fairly certain Moira, wherever she was, could hear her. He laughed at the sound, a rumble of unbridled delight, and then his tongue was inside her again, darting and wriggling.</p><p>In less than a minute she was rocking back against his sweetly busy mouth, keening softly, feeling the familiar delicious warmth start in her stomach, feeling the all-over tightening that meant her orgasm was approaching . . .</p><p>. . . then she felt the tip of him, engorged with blood, the head so like a delicious plum, ease into her . . . and then he shoved forward, the quick, hard thrust instantly jolting her into orgasm.</p><p>She shrieked his name and rocked back, meeting him thrust for thrust, on a roller coaster of pleasure, one swooping orgasm instantly merging into another. His low groans, so like growls, fired her blood and made her want to bite something.</p><p>She felt his teeth on her shoulder, gently, and then felt him pulsing within her. She thrust back once more, greedily, then felt him slide from her.</p><p>\"Oh,\" she said, almost sighed.</p><p>\"Christ,\" he groaned, and flopped face down on a pillow. She giggled, and he reached out, snagged her waist, and nestled her against his side. \"Tell the truth,\" he rasped, and when he looked at her, she saw his pupils were huge, his irises only faint rings of gold. \"You're trying to kill me, right? Wearing me out before I Change?\"</p><p>She laughed again. \"Does that mean you're not up for seconds?\"</p><p>He didn't smile at her jibe. Instead he reached out a finger and touched her mouth. Then his rough palm was cupping her cheek. \"Don't be afraid,\" he said, his voice so deep it was difficult to understand him. \"I couldn't bear it if you were afraid.\"</p><p>\"The funny thing is,\" she said seriously, \"I'm not. The thing I worried about most . . . I made it happen. I had to throw myself at you—literally. But I didn't mind, because it's easier to be scared if you're the passenger, not the driver.\"</p><p>\"Don't be afraid,\" he said again, panting. \"I can't hold it off anymore.\"</p><p>He began to Change. And it happened so quickly, if she had blinked she would have missed it. His features and limbs and body seemed to shift, to melt, shrinking into a furred, four-legged wolf with a lush black coat the exact color of Michael's hair, and deep gold eyes. There wasn't a smell. There wasn't even a mess. She had just witnessed a physical impossibility. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Guh,\" she said, blinking, staring, before the wolf gave her a sloppy lick on her cheek. The large, furry head bent and licked her stomach, where their child nestled. \"Michael, oh Michael,\" she whispered, reaching out a shaking hand and touching the luxurious pelt. When the wolf—Michael—didn't move away from her touch, merely sat calmly, she gave her delight and curiosity free reign, running her hands over his strong limbs, his tail, stroking the noble head, even burying her face in his rich, black coat. She realized dimly her face was wet as the pent-up emotions—fear, anger, despair—departed as easily as Michael had shed his human form.</p><p>It was all true. They weren't crazy fools. She was the fool, for blinding herself to the truth. He was pack leader, she was his mate, she carried the next pack leader. She was in danger as long as Gerald wanted power. Michael had been right to track her and bring her to his home. She had been wrong to escape.</p><p>\"Michael,\" she whispered into his fur, \"I love you.\"</p> <p>She didn't know if he could understand her in his lupine form, but all the same, he made a deep, rumbling noise in his chest, quite like a purr. She hoped he understood. On the other hand, she had a lifetime to repeat the phrase.</p><p>The rumbling abruptly shifted in pitch, from purr to growl. She pulled back from him, instinctively knowing Michael was incapable of hurting her in whatever form he took, but still wary. He sprang from her side and arrowed at the balcony doors, slamming into one of them hard enough to crack the heavy glass.</p><p>\"Whoa!\" she said, scrambling to her feet and running for the door. \"You want out? No problem, just a second.\" After a moment she had the door open and Michael dashed past, scrambling up the railing and then fearlessly leaping into the dark.</p><p>Behind him, Jeannie watched him drop two stories, landing in a crouch on all fours. \"Well, hell,\" she breathed, \"no wonder the elevator fall didn't kill you.\"</p><p>She was still staring, mouth open like a rube idiot, when another wolf darted out of the cover and went for her lover's throat. This wolf had mud-colored fur the exact color of Gerald's hair, and she knew at once who the wolf had to be . . . and who he had come for. Michael avoided the attack, and the two powerful males squared off and charged.</p> <p>He's nuts! was her first thought. Taking Michael on in his own territory? Maybe Gerald had heard all the females were gone, and assumed Jeannie would be easy for the taking . . . maybe he'd also heard Michael had planned to be gone this evening. And probably figured, tonight, or not at all . . .</p><p>Her thoughts were interrupted by a noise; she turned in time to see a butterscotch-colored wolf with Derik's green eyes rocket past her, straight over the balcony railing. Four other wolves had by now surrounded the snarling, fighting males, and Derik unhesitatingly went for the throat of the closest traitor.</p><p>Jeannie turned and went at once to the endtable drawer where she had so carelessly dropped Gerald's gun—was it only yesterday? She popped the clip, noted with grim pleasure that it was full, then slapped the clip back in, pulled back the slide, and ratcheted a load into the chamber. So Michael was right, she thought distractedly, walking back out on the balcony. Gerald's gun wouldn't have fired, and he could have killed me then. Well, well. Note to self: apologize to lover, after saving lover's ass.</p><p>A distant part of her reminded her that the room was pitch dark and there was not enough starlight for her to see by. Still, she could make out everything as clearly as if it was noon: the wolves' coloring, the lush green of the grass, even some of their eye colors. Thank you, baby werewolf, she thought, and then sighted in on Gerald, who had, she noticed with detached rage, just taken a chunk out of her lover's shoulder. She had no idea how Gerald expected to hustle her off Wyndham property in his wolf form. Maybe he was part human and could control his change. Regardless, she wasn't about to stand by and let him damage others—Michael!—in his quest for power.</p><p>The two wolves were locked together in an age-old battle for territory and females, and Jeannie, whose cop mother and Marine father knew a little something about battle, waited for her chance. In the meantime, Derik had chased off his opponent and, though one leg was bloodied and one ear gone, was turning hungrily on another.</p><p>Gerald reared back and went for Michael's throat. Instead, Jeannie got his—two shots, right where she guessed the adam's apple was on a werewolf.</p> <p>\"How about that, Gerald?\" she shouted down. She picked off Derik's newest opponent with a clean head shot, and Derik jumped back from the newly-dead werewolf with a yip that sounded suspiciously like a laugh. \"In case you didn't realize, trespassers will be shot!\" Thinking: thank goodness, the stories about silver bullets aren't true.</p><p>The other traitors froze, and looked up at her, except for Gerald, who was coughing out his life on the lawn.</p><p>\"This is the alpha female speaking,\" she said, and as the fatally wounded Gerald made one last try for Michael, she put four into his head. \"Playtime's over.\"</p><p>The other traitors—only two, now—took off, Derik hot on their heels. Michael looked up at her, coiled, and made a clumsy jump for the balcony. She gasped when she saw his wounds.</p><p>\"Lucky for us you're a fast healer,\" she said, and popped the live round out of the chamber. She put the gun away, then went to tend to her mate.</p><p>Chapter Ten</p><p>In bed, she could hear them chatting at breakfast, even though they were a floor below her.</p><p>\"And then Michael's trying to keep Gerald off his throat, right?\" Derik said. She could picture him holding the group spellbound, talking with his hands, eyes gleaming with suppressed excitement. \"And I've got my hands full with those other two assholes. And Michael and I are both thinking, Cripes, are there more on the grounds? Can we take them even though the girls aren't here to help? And we're assuming Jeannie is just about out of her mind, right? I mean, I would have been scared at the sight. Then—ka-blammo! Close enough to singe Michael's fur, Gerald's got a couple holes in his throat, and we all look up and there's our pack leader's mate—naked, no less—holding a smoking gun and yelling at Gerald, who's been causing trouble since he was whelped.\"</p> <p>\"Then what?\" Moira asked excitedly.</p><p>\"Then she drills my guy, puts a few more in Gerald, binds Michael's wounds, and ate a big supper at 2:00 a.m.\"</p><p>\"I knew it! I knew Michael had chosen wisely! And you said she'd never fit in, Dara.\"</p><p>\"I did not. I said after a few months, she'd never fit in her clothes. That's all.\"</p><p>Hearing her staff speak of her with such admiration brought a warm flush to her cheeks. And really, she hadn't done all that much. Just saved the day.</p><p>The thought made her laugh out loud. Beside her, Michael was sleeping deeply, and stirred at the sound. She hushed at once and examined his shoulder. The wound looked months old, and she again thanked God for werewolf metabolism.</p><p>She touched her stomach lightly, with love. There was a werewolf growing inside her, which should have scared her—should have creeped her out at the very least—but instead, she was filled with a joyful acceptance of her future. She didn't know much about werewolves, but she was going to learn, oh yes. Michael would help her. Her pack would help her.</p><p>A large brown hand covered hers, and she looked into Michael's golden eyes. \"My own mate,\" he said slowly, savoring the words, \"and so brave. Even when we were in the elevator, you were brave.\"</p><p>\"Well, of course. You weren't going to let anything happen to me.\"</p><p>\"As you, apparently, won't let anything happen to me,\" he said wryly. \"Remind me to instruct you on the finer points of werewolf etiquette. Number one: never interfere with a Challenge.\" But he was smiling as he said it, and she knew that, though his male pride might be a bit ruffled, he was pleased with her.</p><p>\"And number two?\"</p><p>\"Always take a human to mate,\" he said, and pulled her to him for a long kiss. When he pulled back, she was breathless, and his eyes glinted with satisfaction. \"Before we were so rudely interrupted last night, you told me something. I very much want to hear the words again.\"</p><p>\"So you can understand me when you're a—\"</p><p>\"The words, Jeannie.\"</p><p>\"I love you. Dork. What, you think I'd shoot a man for just anybody?\"</p><p>\"For a while,\" he said seriously, \"I wondered if you might shoot me.\"</p><p>\"I was an idiot,\" she admitted. \"A blind fool. It was all right in front of me, and I wouldn't accept it.\"</p><p>\"You were perfect,\" he assured her, \"considering the circumstances. The words again, Jeannie, please.\"</p><p>\"I love you.\"</p><p>\"Let me show you how I feel,\" he whispered, and kissed her.</p><p>Their lovemaking was slow and almost dreamlike, and for Jeannie, who had only known fierce, fast, couplings with this man, it was like discovering a whole different side to her mate. He took his time, touching her with skilled reverence, gaining pleasure from her own. Even when she was begging him to enter her, tugging on his shoulders and whimpering pleas that made his eyes narrow with lust, he held back. \"No,\" he said, almost moaned, \"this time, I want it to last.\"</p><p>Shuddering with pleasure beneath his hands, she had the sense that he was finally touching her as he had always longed to, and she gloried in it. When he slid into her she shivered in his arms and gasped her love, and he closed his eyes in gratitude, deeply moved. He opened his eyes and she stared into his curious gold gaze. \"Oh, Jeannie,\" he breathed, \"I love you, too, my dearest, my own mate.\"</p><p>They rocked together, both of them creatures of savagery and passion, and cried out until they were hoarse. And when they were done, and drowsing in each other's arms, Jeannie had time for one thought before she spiraled down into sleep: Thank God I didn't take the stairs. </p> </body></html>"]