["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Joaquin Morales supposed that every small town had its own hero—too bad Holland Springs’ was the biggest horse’s ass on the planet.</p><p>Too bad that the horse’s ass was him.</p><p>Joaquin waved at the crowd flanking each side of Broad Street. His lips were frozen in a tight smile as his eyes did what they had been trained to do, put into action for the past twelve months—scan for snipers, out of place looking buildings and suicide bombers posing as families.</p> <p>He didn’t deserve this honor. This back of the Christmas Parade position by the Snow Queen with Old Saint Nick trailing behind them. No, there had been others more worthy. But instead of a ride in a convertible, they had a one-way ticket home in a casket draped with an American Flag in the underbelly of a plane.</p><p>Festive decorations lined the street. Garland wrapped around light posts while wreaths with dark red bows swayed with each gust of wind. Dirty slush lined the sides of the street, a strange sight to see in North Carolina, since the coldest part of winter tended not to hit until about February.</p><p>Eyes blurring, he blinked and exhaustion hit him hard. Twenty-six hours ago, he’d turned in his weapons and gear, given his landlord notice, packed up his truck and driven straight home.</p><p>Or rather the place he used to call home.</p><p>Not much had changed in the years Joaquin had been gone.</p> <p>The corner drugstore still served vanilla cokes and grilled cheese sandwiches at its lunch counter. The only movie theater in town still played movies two months after their release for discount prices. Tetterton’s Hardware still had the same two rocking chairs being rocked by the same two men arguing over the same game of checkers.</p><p>A loud popping noise made him dive for cover in the back seat as he shouted, “Get down.” Adrenaline infused his bloodstream. His heart beat a sharp staccato.</p><p>Time seemed to freeze and speed up all at once. He heard every beat of Holland Springs High School’s drum line as they marched down Broad Street while the screams of the crowd become one long roar.</p><p>“Let me up,” a voice screeched in his ear, but he didn’t. He couldn’t. In fact he shoved the head belonging to that voice into the floor mats.</p><p>The popping noise went off again, followed by the sound of children’s laughter. Firecrackers. Firecrackers. Dammit.</p><p>He looked down.</p> <p>This year’s Snow Queen, Ella Swanson, lay pinned under him, murder gleaming in her perfectly made-up eyes.</p><p>Oh, shit.</p><p>He scrambled off of Ella, grabbing her arm to pull her up to a sitting position. Her crown was askew, hair halfway out of its perfect bun and her dress had a rip. Frowning, she patted her hair into place and looked down, then smacked her hand over her mouth. Unfortunately, it didn’t completely muffle the scream of fury and he winced.</p><p>“What’s your problem?” she hissed, her frown giving way to the biggest fake smile he’d ever seen.</p><p>“Sorry, it...I—” What was he supposed to say—that he saved her from kids messing around with a bag of Snap Pops? Inspiration struck. “There was a bird getting ready to er, poop in your hair.” Never mind it was December and too cold for even the birds to venture out.</p><p>Tears filled her eyes as she quickly fixed her hair. “You really are a hero.” She whipped out a pair of scissors from a bag in the floor and began working on her dress.</p><p>Joaquin didn’t know what impressed him more—her acting skills or how quickly she pulled herself together. “You’re welcome.”</p><p>They resumed their former positions and the crowd let out a loud cheer. He struggled not to flinch from the sound. A part of him wanted to jump out of the car and run away from the humiliation. And yet another wanted to find the closest bar and drink his way to oblivion. But he had a job to do after this parade.</p> <p>One that scared the ever-loving hell out of him.</p><p>“Smile bigger, sugar. Maybe put your arm around me,” the perky brunette beside him whispered. He glanced at her, watching in morbid fascination as her glossy red mouth barely moved as she spoke. “I’ve been waiting two years to beat Hannah Jane Simpson, and you’re not gonna ruin my moment.”</p><p>He really didn’t want to put his arm anywhere near her. Hell, he really hadn’t wanted to be in the Christmas Parade in the first place, but saying no to Pastor Mike was unthinkable. Especially since Pastor Mike was also the newly elected Mayor of Holland Springs. All Joaquin had wanted was a steaming mug of decaf and some sleep. But all he’d gotten was a cold cup of obligation.</p><p>Exhaling, he forced a smile as well as his arm around Ella, barely touching her back.</p><p>“Want to be my date to the Lighting of the Christmas Tree Ceremony?”she asked, executing a pageant wave.</p><p>His brows shot up. “How old are you?”</p><p>“Nineteen.” She snuggled up to him, then wrinkled her nose and edged away. “What’s that smell?”</p><p>Thank God and three cheers for wearing old ACL’s, ones that he’d dug out of one of his duffle bags. Pastor Mike had insisted on it. Besides, barely legal wasn’t remotely appealing to him, not even if he were single. “It’s the smell of ‘I’m way too old for you’.” And war. He still smelled of sand, sorrow and violence. There wasn’t enough detergent on the planet to get it out of his clothes. Not enough soap to scrub it from his skin. And there was nothing that could rip it out of his soul.</p><p>Ella started talking again, but he’d already tuned her out and looked at the clock tower sitting on top of the courthouse. Only ten more minutes and he’d be free.</p><p>Sweat trickled between his shoulder blades. The small of his back itched. Jesus, he needed a shower. He rubbed at his jaw, bristles scratching his skin, and a shave.</p><p>Auburn hair glinted in the morning sun and his heart sped up. The crowd shifted to the left, obscuring his view. He craned his neck and pushed up on his hands, searching for another glimpse.</p><p>“Would you sit down,” Ella said, tugging on his uniform. “What are you looking at?”</p><p>Miraculously, the crowd parted and there she was—just as beautiful as he remembered. Pretty grey eyes framed with black square glasses and curves that made his mouth water and his hands itch to caress. The beginnings of a smile crept on his face.</p><p>The vision before his eyes crossed her arms and glared back at him.</p><p>“Sage Caswell?” Ella asked, her voice incredulous. “But y’all’s parents hate each other. Oh! So, that’s why you won’t go out with me.” She sighed dreamily. “Like Romeo and Juliet.”</p><p>Sage waved a piece of paper at him, and the tips of his ears grew hot.</p><p>“Something like that.” But only if Juliet had woken up and stabbed Romeo.</p><p>Sage knew.</p><p>Of course, she knew, he rationalized. Sage was one of the most intelligent people he knew. Maybe she would understand why he’d done what he’d done. That he’d been a coward, but ultimately, he had wanted to make it up to her, to earn her forgiveness...and love.</p><p>Sage had always had a soft spot for dumbasses. Hell, she’d fallen for him hadn’t she? Hard and fast. Bright as the summer sun before he’d left town. Without her.</p><p>Sage tore his letter into pieces and he cursed under his breath. She threw them into the air, turned on her heel and stormed away. White confetti trailed behind her as it was tossed around by bodies and small gusts of wind.</p><p>Defeated, he sank back down and mentally licked his wounds. Guess it was time for Plan B.</p><p>Chapter Two</p><p>“Hi, I’m the Snow Queen. Let me bat my eyelashes and pout my trouty lips while you eat it up,” Sage cooed in a falsetto, then lowered her voice to a husky baritone. “As soon as this parade is over, I’m going to show you just what you can do with those lips.”</p><p>Rolling her eyes at the childish conversation that was most definitely not caused by jealousy, Sage made a sharp right on Oak, walking as fast as she could to her family’s car dealership.</p><p>Waving at Eddie and Fred as they washed inventory, she ducked through the open side door, and made her way to the back office.</p><p>Pressing trembling hands to her cheeks, she tried to get a grip on her volatile emotions. Emotions that hadn’t gotten the best of her in years. And it was all his fault. Joaquin Morales, looking all irresistible with his muscles and soulful brown eyes. And hands. Good Lord, his hands....and mouth. That kissable mouth that could form the sexiest of smiles.</p><p>She unwound her scarf from her neck and pulled off her knit hat, hanging both on a hook near the door. Breathe and get back to work, she told herself.</p><p>“Thought you were going to the parade,” a voice boomed, making Sage almost jump out of her skin.</p><p>“It’s over.” She moved to the file cabinet and began sorting through the manila folders on top. “I’m yours until closing.” Her dad made a noise and she turned around. “Something you need?”</p><p>“Morales has a Twelve Days of Christmas deal going on and we’re gonna price match.” Charles Caswell grimaced, then gulped down his coffee and threw the paper cup in the trash. “I’m sick of losing business to that underhanded son of a bitch.”</p><p>Sage turned back to her work and bit back a sigh. Same story, different day. Caswell versus Morales. Morales versus Caswell. It had been that way for the past fifteen years and would most likely be that way for fifteen more. Usually, she made a quick exit when her dad got all riled up, but today, she needed the distraction he could provide.</p><p>“He’s getting all the construction crews from Jacksonville, and the soldiers coming home,” Charles complained.</p><p>“Maybe because Mr. Morales has the cars they want,” Sage said, but she knew he wasn’t listening. Their family’s car business depended on repeat customers, but they were ageing, and a young veteran returning from war didn’t want a Cadillac. Neither did those constructions crews. They wanted minivans, trucks or sports cars.</p><p>“I got in two minivans and three SUVs last month.” He pointed to the lot in front of the store. “And they’re still sitting there.”</p><p>“You put them on the left side, toward the back. No one can see them, and you didn’t tell Fred to push them,” she pointed out, then opened the second file drawer.</p><p>The desk chair creaked as her dad sat down and back. “Fine, I’ll have Eddie drive them to the front and put some balloons on the antenna. People love balloons.”</p><p>Sage turned as Eddie entered the office and said, “Hey, boss. Morales is cooking and giving away hotdogs and hamburgers—just started.”</p><p>“What the hell for?” Charles asked, brow creasing.</p><p>“Joaquin is home from Afghanistan, for good, I heard,” Eddie said. “It’s a celebration.”</p><p>Sage mentally braced herself for her dad’s reaction.</p><p>Charles’s face turned red, but remarkably he held his temper. “Go put the minivans up front and tie on some balloons, add some garland. Make it look festive.”</p><p>“Yes, sir,” Eddie said, then left.</p><p>Charles turned to her. “You know about this?”</p><p>Her heart was in her throat but she managed to speak around it. “Why would I?”</p><p>“With all those letters he wrote you, I figured you might have some insider information.”</p><p>She blinked. “Momma told you?”</p><p>“Said she was worried, is all.” He pulled at his collared shirt. “So was I.”</p><p>Face flaming, she started to give her dad a smile. “I’m fine.”</p><p>“Well?” He pulled out a pen and a yellow legal pad. “What did the Morales boy tell you?”</p><p>“That’s all that concerns you? Not my feelings, not...” She hit the file cabinet drawer with her hip, closing it.</p><p>“You just said you were fine.”</p><p>She grabbed her purse and fished her keys out of it, fury and disappointment making her hands shake as she yelled over her shoulder, “This is the south: it’s what you’re supposed to say.”</p><p>Three hours and a pint of Cherry Garcia later, Sage texted her best friend, Mandy Little, to let her know that she would not be going to the Lighting of the Christmas Tree Ceremony tonight.</p><p>Of course Mandy texted her right back to let Sage know that she would be over in a couple of hours for them to talk. And by talk Mandy meant drink margaritas until they couldn’t form coherent sentences and passed out laughing—or crying.</p><p>Which was fine with her, because there was no way in hell she’d chance another encounter with Joaquin. In the meantime, she could work on lesson plans.</p><p>Sage threw the empty ice cream container in the trash and washed her hands.</p><p>Although she would miss the change of pace that working at her parents’ dealership had been providing over winter break, she was ready to get back to what she loved—teaching fourth graders. But she wasn’t too proud to admit she would miss the extra cash once school started in January. This past summer, she had insisted on getting paid and her dad had agreed without too much fussing.</p><p>Usually, she didn’t rock the boat, and did what everyone expected of her, no matter what her heart was telling her. Her heart couldn’t be depended upon anyway. It made her think and do things that her brain would have logically concluded were extremely bad for her well-being.</p><p>Like get romantically involved with a man like Joaquin Morales.</p><p>After drying off her hands, she moved into her bedroom. On the dresser she kept a small jewelry box, the top engraved with her initials. Opening it, some silly love song played. She picked up the diamond ring hidden in a side chamber.</p><p>Sliding it on, she held it up and splayed her fingers to examine the tiny jewel in the center. This was dumb. They had been dumb. Shaking her head, she pulled at the ring, but it wouldn’t budge.</p><p>“Oh, come on,” she muttered, then walked to the bathroom. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After ten minutes of tugging and applying every slippery concoction to her ring finger, she gave up and plopped down on her bed. Tomorrow she’d go down to Nelson’s and get Henry to cut the thing off. Then she’d take the stack of letters from Joaquin and cut them into tiny pieces, just like he’d done to her heart.</p><p>Just like she’d done today. The sweet revenge of seeing the shock on his face had made her want to cheer. Heck, it had made her want to tear up three more of his letters and lead the town’s parade.</p><p>Flopping back on the bed, she let out a soft snort.</p> <p>Who was she kidding? That “letter” she’d torn up in front of him had been her yesterday’s grocery list. Her stupid heart had told her to hold on to the sweet memories of them for just a little bit longer. To give him a chance to explain why he had deceived her. Why he had made her fall in love with a fictional character, because it couldn’t be him she was actually in love with.</p><p>Like always her heart had been wrong.</p><p>When she’d first spotted him, sitting on the back of one of his dad’s shiny convertibles, her heart had gone into overdrive, beating so hard she had been shocked it hadn’t flown out of her chest. For the briefest of moments, she felt nothing but pure joy at seeing him. Pure joy that he was home safe and sound from danger.</p><p>It was all she could do to keep herself from running out there and jumping into the car with him. To put her arms around him and kiss his face.</p><p>Then his smug grin and strong arm around a perky brunette with pouty red lips had dashed all that away and made her want to lob mugs of hot chocolate at his head.</p> <p>One thing she needed to remember and keep close was that Joaquin had always liked a challenge and loved to do the exact opposite of what was expected of him. It was the reason they’d gotten together in the first place. She had been forbidden, the enemy’s only daughter.</p><p>Turning on her side, she faced the nightstand and the very first letter he’d ever written her. Had it been only twenty-four hours since she’d figured out that Gage Huntstone didn’t exist? That Joaquin had gone so far as to disguise his handwriting, or worse, gotten someone else to do his dirty work. Had he and his buddies laughed and talked about her? About how naïve she was? About how much of a fool she was?</p><p>For the life of her she couldn’t figure out why Joaquin had done this, nor could she stop the tears from falling as she picked up the letter and began to read the words she knew by heart.</p><p>Dear Ms. Caswell,</p><p>I wanted to thank you for your letter. It was really nice of you to think of someone like me. I haven’t gotten a lot of mail since I deployed, mostly because my family isn’t exactly what I’d call supportive of my decision. Anyway, everyone in my unit enjoyed the pictures your class drew and the letters y’all wrote. Guess our unit should thank the powers that be that ours was the winner of your class’s writing assignment. Nothing beats getting letters from home.</p><p>We’ve put them up on a makeshift bulletin board. Every time we’re sent out on a mission, we touch one of the drawings or letters for luck. So far, so good. (Except for Sanford smacking his head on the door of an M-WRAP, but he doesn’t count, because he couldn’t find his way out a room with one door and no windows.)</p> <p>I know you sent this to ‘any soldier’, but I could really use someone like you in my life right now. Would it be too weird to ask you to me write again?</p><p>Sincerely,</p><p>Gage Huntstone</p><p>She should have replied with a firm but polite no. Actually, she shouldn’t have replied at all, but all she had been able to think about was Gage being lonely.</p><p>What if he died without a letter from her? What if the only thing that kept him going in a war-torn country was a little piece of home? Couldn’t she make that ice cold sliver of distrust that pierced her heart melt for someone like him? A man who was doing something noble, going against his family’s wishes and putting his entire life on hold to protect people like her. It really was the least she could do for a soldier serving in a war.</p><p>Dear Mr. Huntstone (or should I say 1st. Lt. Huntstone?),</p><p>Writing to you would be an honor.</p><p>I’m sorry your family doesn’t support you, but maybe they’ll come around one day. I know a little bit of how you’re feeling—there have been times that my family hated the choices I made. But you can’t live your life for them, otherwise it would be their life and not yours.</p> <p>And that sage (ha!) piece of advice only took me four years to put into practice. You do, however, have my support. Although, I’m not sure how much a small town girl like me could help you feel better.</p><p>We’ve been getting ready for the statewide writing test in class, and my students love practicing their skills with letters to your unit. After that test is over, we have end of grade testing for reading and math. Summer vacation can’t come fast enough for my class.</p><p>It’s been really windy here and we’re anxiously awaiting March to go out like a lamb. Last week’s storm ripped off the roof of Carter’s Repair Shop and it ended up twelve miles away in Narron County. According to the local news, the farmer whose field it landed in and John Carter are arguing over who now owns it. The cows taking shelter under it have no opinion on the matter.</p><p>What’s it really like in Afghanistan? My class looked it up on Google Maps, and I’ve been doing mini-lessons in Social Studies, but you can’t substitute a book for actual experience.</p><p>I hope my letter finds you safe.</p><p>Your friend,</p><p>Sage</p><p>“So stupid,” she whispered through her tears. She should have signed it ‘the biggest fool in five counties’.</p><p>There was a knock on her door, then another.</p><p>“Just a minute,” she called out. Rising from bed, Sage wiped away her useless tears and glanced at her clock. It was too early for Mandy.</p><p>Frowning, she let out a big sigh.</p><p>It had to be her momma. That woman couldn’t leave well enough alone, and to be sure, Sage’s dad had told Virginia about the great stomp off. Or her mother was here for their monthly “pep talk” to encourage Sage sell this house.</p><p>She could hear mother’s voice in her head, noting all the reasons why Sage should follow her advice: A single woman didn’t need something so big. Why, what if a man was interested in her and already had his own house? Better to live in apartment and not risk scaring him away. And why didn’t Sage just move back home, like God intended?</p><p>Heck, if Virginia had her way, Sage would be working full-time at the dealership and heading up projects for the Holland Springs Town Improvement Committee.</p><p>Sage opened the door, prepared to give her mother a piece of her mind for telling her dad about the letters, and to defend herself for acting like a three year old.</p><p>Instead she found the most gorgeous man on the planet staring back at her, his smoldering brown eyes searched her face, then slowly traveled the lines of her body. A thick blanket of heat covered her, making her palms wet and her body tingle—in all the unfortunate places.</p><p>Joaquin looked pointedly at her left hand and her face heated.</p><p>Their eyes met again, and she shoved her arm behind her back, fixing him with her best teacher glare.</p><p>A grin broke out on his face as he said, “Missed me, Mrs. Morales?” He held out a bouquet of flowers.</p><p>“What do you think?” Then Sage did exactly what her heart and brain agreed was a good idea. Something that the old Sage would never have done in a million years.</p><p>She slammed the door in his face.</p><p>Chapter Three</p><p>“That went well,” Joaquin muttered to the flowers, then knelt down to set them beside her door. He flipped up the doormat, raising an eyebrow as he found the spare key. His safety girl was really living on the edge these days.</p><p>“That’s the old one. I had the locks changed,” she yelled through the door. The deadbolt clicked and he rose to his feet.</p><p>Okay, so maybe she was still a couple feet shy of the edge. Laughing, he shook his head. “Wouldn’t expect nothing less, sweetheart.”</p><p>“I’m not your sweetheart.”</p><p>“But you are Mrs. Morales.” And she was wearing his ring. That had been a shot of pure lust. Forget skimpy outfits. That tiny diamond declared before the world that Sage Caswell was his. No greater aphrodisiac had existed in that moment.</p><p>“Be quiet before someone hears you.”</p><p>His lips flattened. “You’ve kept our marriage a secret?”</p><p>“Haven’t you?” she shot back. “And there is no ‘us’. There hasn’t been an ‘us’ since you went for a drive and never came back.”</p><p>He hadn’t merely gone for a drive. Eight weeks he had given her to tell her family. Eight damn weeks he’d given her before he expected her to join him in Texas at Ft. Hood. He had picked out an apartment off-base for them to live in. Nothing fancy, but nice. The familiar stirrings of anger and resentment threatened to derail their reunion.</p><p>Determination to set things right made him try again. “Well, I’m back, and we’re still married.”</p><p>“Not for much longer,” she said. “This time there won’t be any unsigned paperwork mistake.”</p><p>A large part of him had hoped she had purposefully not signed the annulment papers. Yeah, hope was a four letter word that could suck it. He placed his palm on the blue door, wishing he could sweep the lacy curtains aside and look in the small window at the top. “What did you do, Sage?”</p><p>The door flew open, dislodging his palm and making him take a step back. She stood in the doorway, her grey eyes stormy behind her glasses and her cheeks flushed. “What did I do?” She poked him sharply in the chest with her finger. “Do you really want to go there, Joaquin?”</p><p>“What I want is for us to talk,” he said, keeping his voice calm. The old him would have stomped off and not talked to her for a couple of days while he brooded. What an ass he’d been.</p><p>She tilted her chin and raised her brows at him. “You’ve got five minutes.”</p><p>“That’s not long enough,” he protested. He took off his cap and wiped his forehead with his arm.</p><p>“Four minutes and thirty seconds.”</p><p>“Now wait just a—”</p><p>“Three,” she said, her grey eyes like steel.</p><p>“You can’t—”</p><p>“I can do whatever I want. This is my house.”</p><p>“Don’t give me that teacher voice. I’m not one of your students.” He’d forgotten how damned bossy she could be.</p><p>God, he missed her.</p><p>“Two.” It sounded as though she relished taking away his time.</p><p>He had this whole speech rehearsed. He knew every word by heart and thought it would melt hers, but there was no way it would work. She’d slam the door in his face before he would be able to get to the best part—the down-on-his-knees-apology.</p><p>Instead he blurted out the first thing that came to mind. “Spend Christmas with me, like we—”her eyes narrowed “—planned. Then I’ll head back to Texas.”</p><p>“We planned?”</p><p>He sliced his gaze to the side, then back at her. “Fine. Like you and Gage planned.”</p><p>“You’re such an ass, and you’re not going back to Texas. Do you really think I’d miss the ginormous U-Haul trailer hitched to your truck?” She punched him in the arm, just like she’d done when they were in high school whenever he’d done something stupid to get her attention. He was pretty sure pretending to be someone else was ranked way up there on the stupidity scale. “Besides, in what reality would I spend even an hour with you?”</p><p>“Dammit, Sage, I don’t want to be alone.”</p><p>“If you’re so darn lonely, then ask the Snow Queen to spend time with you.”</p><p>She was jealous? This was a good sign. A very good sign. “I don’t want her. I want you.” There. The truth all laid out.</p><p>Sage fisted her hands on her hips. “Well, you can’t have me, so learn to deal with disappointment!” Then she shut the door in his face again.</p><p>Time for Plan C. “If you don’t come with me, Sage, I’m gonna tell everyone that we’re married. I’ll go to church on Sunday and make an announcement in front of God and your momma. I’ll even announce that we ah, consummated our marriage in the back of your daddy’s Cadillac.”</p><p>The door flew open again. “You wouldn’t!” Bright spots of color highlighted her cheeks and her eyes flashed.</p><p>He placed a palm on the doorframe and leaned in, his mouth inches from hers. Good God, he wanted to kiss those sweet lips. They’d be soft and supple, and she’d taste like heaven. Like his Sage. His wife. “Try me.”</p><p>There was a wariness in her eyes, but wariness gave way to fury. “I’m calling bull on you. There’s no way you’d embarrass your parents like that.”</p><p>He threw up his hands in defeat. She was right. “Fine!”</p><p>“Have fun with the Snow Queen,” she said in her sweetest voice, one that made him want to choke something—mostly himself for goading her.</p><p>Shoving his hat back on his head, he gave her a long hard look that made her squirm. Good. “See you Sunday.” Then he stomped off to his truck and drove off.</p><p>He really was full of bull. There was no way he’d embarrass anyone like that, especially Sage. But maybe it would make her think a little about what he’d said. Then again, maybe he should have told her how proud he was of all she had accomplished. Like her sunny little cottage she’d bought, or how she’d graduated at the top of her class in college, and that she’d done all of it without help from anyone.</p><p>Sure he had told her in the letters he’d written her, but that had been Gage talking, not him. He patted his uniform, searching for the pocket over his heart and pulled out a creased piece of paper. It was one of the many he had kept stowed away in his pockets. They were his ties to a world he’d used to live in, one full of sunny days, starry nights and no bombs. One without helpless families being starved and abused by evil, powerful men that used religion and ignorance to keep them in line. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her second letter to him had almost made him tell the truth. Almost made him reveal that he was the one writing to her, not a fictional man he named after a wounded dog his unit had adopted and nursed back to health.</p><p>One way or another he was going to convince her to spend Christmas with him. He tucked the letter away and smiled. There was no need to read it. He knew the words by heart. Hell, he knew every word of every letter she’d written and the ones he’d written, too.</p><p>Sage and Gage.</p> <p>He rolled his eyes. That should have been her first clue. It sounded like a couple on one of those soaps his abuela faithfully watched on Univision.</p><p>Dear Sage,</p><p>Please call me Gage. Mr. Huntstone makes me sound old and you’re not one of my ‘men’, so no 1st Lt. anything in our letters.</p><p>It’s not too bad here. When the sun sets just right, the country looks peaceful and for a little while, a man can forget what he’s been sent here to do. Sometimes, when I’m going to sleep, I pretend I’m at the ocean, drinking a Corona while listening to Sublime on my iPod. It’s easier than you’d think. My ‘bed’ is a hole dug in the ground since the only structures we have around here are a chow hall and command center.</p><p>I know it would probably be easier for us to chat on Skype or Facebook, but our internet connection is sketchy at best, and non-existent at worst. Don’t tell anyone, but I don’t have a Facebook page, and I don’t use my army email for personal correspondence.</p> <p>Please keep writing me. I won’t be able to respond right away the next few weeks or so, because I’ll be heading up more missions into certain regions. Can’t say when I’ll be back, or even where I’m going exactly—mostly because I’ll get in trouble (just kidding...sorta).</p><p>Keep me in your prayers; you’re in mine.</p><p>Your friend,</p><p>Gage</p><p>Dear Gage,</p><p>I guess it’s official—we’re pen-pals! Dare we identify our relationship to the world? It has been two months since we first ‘found’ each other.</p> <p>Although I appreciate your police description of yourself, I wish you would send me a real picture (your hand on the unit’s adopted dog doesn’t count and neither did the one with the gas mask covering your entire head). I’d like a face to picture when I’m writing to you...or thinking about you.</p><p>However, it’s easy to imagine your brown eyes when I close mine. They’re my favorite color eyes.</p><p>I’m so sorry your dad and mom haven’t written back, but at least you tried. If you’d like I could write to them, or even drive to their house to talk to them in person. North Carolina isn’t that big of a state, and you said you were from Alleghany County. I’m sure I could find their house.</p><p>Anyway, I’ve been thinking more and more about your missions and how dangerous they are. It led me to do some research on the Army and I found out it has a patron saint. So, in the care package I sent you, I included a Saint Christopher’s medal. You don’t have to wear it, of course.</p><p>Missing and thinking of you,</p><p>Sage</p><p>Sweet Sage. That was one of the things he loved the most about her—her soft heart. There would be no Sunday announcement. He would have to do things the old fashioned way, with some old-fashioned courting. By Christmas Day, he would have her in his life again. Permanently this time.</p><p>But first he had to deal with his parents.</p> <p>“What the hell?” Joaquin slowed his truck down, raising his brows at all the fanfare.</p><p>Balloons, cotton candy machine, jugglers—jugglers?—a stainless steel pig cooker where his dad stood serving up hotdogs and hamburgers, but overshadowing it all was a giant banner with the words, Welcome Home Our Hero, Joaquin!, strung from one end of the car lot to the other.</p><p>Now he was a hero?</p><p>After four years and not one damn letter or phone call, they were proud of him? Exhaling, he focused on what he’d come here for. Besides, things could have changed. His parents really could be proud of him. Hell, knowing he was coming home today let him know they’d gotten his voice mail. Maybe they had read all the letters he’d sent, too.</p><p>He loved his parents—despite what they had done to him, or maybe because of it. Kicking him out had forced him to grow up, to quit playing at being a man and skating through life with his family’s money. Although if he had to be honest, there had been many times he wished he’d had that security.</p><p>Scanning the parking lot as he parked his truck in an out of the way spot, he smiled faintly at all the balloons secured to antennas and the tops of open hoods, showcasing polished chrome head gaskets. On every vehicle parked on the strip of grass by the highway, windshields were covered with bright red and green lettering that proclaimed: ‘Great on Gas!!’, ‘Great Family Car!!’ or ‘Great Deal!!’.</p><p>The trifecta of sales, according to Juan Morales: Exclamation points, car swag and the overuse of the word ‘great’.</p><p>He allowed his grin to widen. Some things never changed.</p><p>Then he noticed all the discount car tie-ins to his homecoming and his grin faded. Some things really never changed and his dad’s focus on the almighty dollar was one of those. This wasn’t a homecoming; it was a sales gimmick. One that had probably driven Charles Caswell to price matching and cursing the day the Morales family moved to Holland Springs.</p><p>Out of the corner of his eye, he spotted his dad and turned.</p><p>Juan cooked hotdogs and hamburgers on a huge stainless steel grill, complete with twenty foot flagpole and gas burners on each side. Old Glory waved in the constant breeze as families stood near fake Christmas trees eating and talking. Families that were in no way related to him, confirming what he knew to be true.</p><p>What a fucking joke.</p><p>Joaquin backed the truck up, then found the nearest exit and sped away. He hadn’t talked to his mom and dad in four years. What would another day hurt?</p><p>All that mattered was getting Sage back in his life—permanently.</p><p>Sage sat on the steps of her front porch, her head in her hands when he pulled in the drive.</p><p>Joaquin cut off the engine and got out, slowly making his way to her. He shivered. In the last few minutes the weather had turned bitterly cold, so cold that he could see his breath.</p><p>Sitting down beside her, he left just enough distance between them so she didn’t feel crowded and he didn’t fall off the step.</p><p>“I’m sorry,” he said and she looked up at him, red rimming her eyes.</p><p>After wiping at her nose, she balled up the tissue and shoved it into her pocket, then gave a little sniff that shredded his heart. “What for—lying to me? Threatening to embarrass me? Leaving me four years ago, or for getting caught?”</p><p>“Everything, but the getting caught part only because I’d come to tell you in person what I’d done, but you’d already found out,” he admitted and rocked his neck from side to side, trying to relieve the tension that had been building up since is plane had landed. “What gave me away?”</p><p>“Your cousin.”</p><p>That certainly narrowed things down. He had tons of cousins living around Holland Springs. “Which one?”</p><p>“Roberto let it slip about the dog while he was cutting my hair last week.”</p><p>He should have seen that coming a mile away. Roberto was Joaquin’s mother’s favorite nephew and hairdresser. Roberto loved to gossip with his clients. Hell, Roberto loved to gossip with anyone who’d listen. Joaquin didn’t know how Roberto’s wife, Carmen, put up with him. The man never shut up about anything. “I swear to God, the next time I see him—”</p><p>“It’s not his fault or your mom’s. It’s yours,” Sage pointed out. “Besides, I’d begun to suspect it a couple of weeks earlier. Still...” She tucked and untucked a strand of auburn hair behind her ear, something she’d always done when she was nervous. “I’d always wondered why things seemed to flow so easily with us. It was like we were old friends who hadn’t seen each other in a while. It felt like...”—She paused, her eyes the color of rain on a dreary winter day—“we were meant to be.”</p><p>They were!, he wanted to shout. Instead he cleared his throat, struggling for the right words. “It was supposed to be my apology. A way to start over. Show you the man I’d become.”</p><p>“Right now, you don’t seem much different from the boy I knew.”</p><p>A low shot from her, considering what he’d given up for her. “I’d like the chance to prove to you that I am; that those letters were me, and I wrote what was in my heart. Consider spending Christmas with me.” He held up his hands. “No strings attached. No expectations—just you and me as...friends.”</p><p>“On one condition,” she replied, so softly that he couldn’t be sure she’d actually said the words.</p><p>“Anything.” And he meant it. He’d salsa butt naked down Broad Street if she wanted him to.</p><p>She held out her hand, the tiny diamond ring glimmering, making it hard to breath. “Get this off of me.”</p><p>Chapter Four</p><p>Coffee colored eyes blackened and his jaw hardened. Sage thought for sure Joaquin would say no. That he would stomp off and go brood.</p><p>But he didn’t. Instead, he gently caught her hand and her breath hitched. She had missed his touch, but now she knew she’d also craved it.</p><p>“Stuck?”</p><p>She could only nod.</p><p>Holding it closer to his face, she could feel his hot breath on her skin, and she shivered. “You already tried getting it off?”</p><p>“I’ve tried everything, but it won’t budge.”</p><p>He turned her hand sidewise, his brows coming together. “There’s a raw spot on your knuckle.”</p><p>“Yes, I—”</p><p>“Poor thing.” He kissed that little red spot and her eyes went wide. She tried to snatch back her hand, but his grip tightened. “No, it’s my turn to get this ring unstuck.” Then he did the unthinkable. He put her finger, ring and all, in his mouth and began to suck.</p><p>Good Lord, she didn’t want to pull her hand away. Not only did she not want to pull it away, she let it stay there. She might had even let it slide deeper into the recess of his mouth. He swirled his talented tongue around the ring and her finger, making everything slippery and hot.</p><p>Oh, so very, very hot.</p><p>She placed one hand on her chest as it rose and fell. As if that could calm her wild heart.</p><p>He stared into her eyes as he licked and sucked on her finger, and to her mortification her nipples tightened. Unable to take his knowing gaze, she closed her eyes and simply felt. remembering their last night together:</p><p>His tongue licking the backs of her knees and between her thighs. His hands cupping her breasts and his fingers pinching her nipples. He’d whispered how sexy she was, how beautiful she was, how much he loved her, before he thrust inside of her and the world went up in flames.</p><p>A moan slipped past her lips as his teeth grazed her skin, then cold air hit her finger.</p><p>Her eyes snapped open to find Joaquin holding her ring, longing and desire etched on his face. Her gaze dipped down to his lap. She drew in a sharp breath, then jerked her gaze back to his.</p><p>“I told you I want you. Only you,” he rasped, then a hard smile covered his face. “I’ll come by tomorrow and take you to breakfast, in public.”</p><p>Her mouth dropped open as he tucked her ring in his pocket and walked away. She started to argue, but he stopped in his tracks. “You made the condition and it was met.”</p><p>“You said consider.”</p><p>He gave her a look and she let out a thick sigh. He was right. She had only made that condition because she’d thought he wouldn’t be able to get the ring off. She had gambled and lost.</p><p>“I’m done playing games, Sage.”</p><p>So was she. She thought she was finally done with him. Finally able to move on with a man the opposite of her should-have-been ex. For a long while she studied him. There were dark circles under his eyes, his mouth was drawn tight and weariness worn in the lines of his face. The boy she knew and had married wasn’t there.</p><p>“You look exhausted.”</p><p>“This is nothing.” His lips curled at the corner a little. “Remember that letter I wrote about my mission to take wheat and water to the locals?” She nodded and he continued, “We’d been on the road sixty hours straight, taking turns driving and keeping watch. At one point, I fell asleep in the middle of a sentence I was writing to you.”</p><p>“I had wondered where those lines came from,” she said on a smile.</p><p>He shifted from side to side. “Do me a favor?”</p><p>She licked her dry lips. “Um, depends.”</p><p>“Can I shower, then crash here for a couple of hours?” He rubbed the bridge of his nose. “I promise to leave afterwards. You can even call the nearest hotel and get me a room.” A grin kicked up the corners of his mouth. “I assumed you cancelled the one at Haven’s”</p><p>“Yeah and she’s already rented it out.”</p><p>“What about Fairway?”</p><p>Shaking her head, she said, “Closed two years ago. Mr. and Mrs. Bell are travelling around the country in an RV.”</p><p>“I’ll think of something.” He frowned, then looked at her house. “Why haven’t you decorated for Christmas?”</p><p>Actually she had, but once she confirmed his deception, she’d taken everything down and shoved it in her guest bedroom. The tree she’d bought had been placed on the back porch. Only a love of all things living had kept her from chucking it in the forest, so she kept it watered. “Why bother,” she said with a shrug. “It’s just me and I planned on spending it at my parents’ house.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Looks like your plans have changed,” he said with a smile so smug that she almost reneged right then and there.</p><p>“Us spending Christmas together entails family time.”</p><p>“Great.” Grunting, he shoved his hands in his pocket. “About that shower?”</p> <p>He’d fallen asleep sitting up on the sofa, head back with his mouth slightly open and his eyes closed tight, dark stubble on his jaw and cheeks. Unbidden, sympathy flooded her heart.</p><p>“Joaquin,” she whispered, gently patting on his arm. His lids opened and closed, drowsy eyes staring up at her. “Let’s get you comfy, okay?” Snagging an afghan from a basket by the sofa, she shook it out and held it up.</p><p>A thick sigh left him as he stretched out on her sofa. She covered him up, resisting the urge to brush back his hair or kiss his forehead.</p><p>“Thank you,” he rumbled, then yawned.</p><p>She smiled, pushing her glasses back in place. “You’re welcome.” Turning away, she moved to the kitchen to fix herself a pot of hot chocolate. In some ways he looked exactly as she remembered, while in others, she didn’t quite recognize him at all.</p> <p>Joaquin hadn’t been a bad guy. She wouldn’t have fallen in love with him if he had been. They’d been young, stupid and head-over-heels in love, hiding their relationship from almost everyone for months.</p><p>The Morales cousins had loved to race her Caswell cousins as often as possible for pink slips. Somehow, they would all avoid getting arrested or ticketed by the sheriff, but that hadn’t stopped most of the town from viewing them as rival gangs.</p><p>Apparently, this had amused the Moraleses to no end and they had perpetuated the stereotype by cruising through town in flashy cars with tinted windows while blasting rap music. Not to be outdone, the Caswells had driven jack-up trucks and serenaded Broad Street with Hank Williams, Jr and Lynyrd Skynyrd.</p><p>The summer before her senior year of high school, she’d started sitting in the back of flashy cars instead of her cousins’ trucks—first with Mandy and a couple of other girls as sort of a dare. It had been fun and exciting to be with the Moraleses, their laughter and camaraderie contagious.</p><p>Every time she saw or talked to one Morales in particular, she couldn’t stop the sweet thrill that had run through her body. They’d been friends since middle school, deciding that their respective parents’ problem with each other was just that—their problem, not Sage and Joaquin’s.</p><p>The more Sage was around Joaquin, the more she liked him, until like had turned into a full blown crush. Not that she thought anything would’ve come of it. He was a year older and dated lots of girls, never settling for just one. She dated boys her parents approved of—safe, boring and most importantly, not a Morales.</p> <p>She’d never forget the way Joaquin had swaggered over to her, confidence gleaming in his smile when he asked her to go for a ride. She had said no for three weekends straight, until one night he’d ditched his cousins and asked her out on a real date, one that had ended with them steaming up the non-tinted windows of his truck.</p><p>Sage frowned as she poured the hot chocolate into her mug and added tiny marshmallows to the top.</p><p>The second date, however, hadn’t ended so well. Her cousins, Fred and Lloyd, had found them parking in the woods and called their daddy, the Sheriff. Uncle Neil had threatened to arrest Joaquin for trespassing, and her for breaking curfew.</p><p>From then on, they’d sneaked around and headed out to Palm Beach to have their alone time. A month later and she’d given her virginity to him. College hadn’t stopped them from dating. There they could be a couple out in the open and Sage came home every weekend to see her parents, making them none the wiser.</p><p>One month after Joaquin had graduated from college, he’d asked her to marry him and for one wild moment she’d said yes, despite having one more year to go. They’d driven all night, across several state lines to get married, then spent their honeymoon in a rundown, seaside motel with no hot water and only one working light.</p><p>It had been magical.</p><p>Turning from the counter with her cup of hot chocolate, she moved to the living room and stared at the man sleeping. Yeah, they’d been young and dumb, but in love.</p><p>And now she was older and wiser. Joaquin didn’t have a chance.</p> <p>Liar, her heart whispered</p><p>Chapter Five</p><p>A gentle shake of his arm had Joaquin blinking and yawning awake. He rubbed his eyes and cracked the side of his neck.</p><p>“Sorry to wake you, but you need a driver,” Sage slurred in his ear. “I mean we need a driver.”</p><p>“We need a transfusion,” another woman giggled.</p><p>“Is that your professional opinion, Mandy Doctor, er, Doctor Mandy?”</p><p>“Mandy Intern is the correct ansher.”</p><p>He blinked and sat up. Sage and her best friend since first grade stood beside the sofa, watching him. They both listed to one side at the exact same time. Dear God, he’d bet his truck that they been watching a marathon of Buffy the Vampire Slayer. “Which season?”</p><p>“British bras and slangs straps,” Sage said, her brow wrinkling. “Wait, switch that.”</p><p>“Aren’t you two a little old for drinking games?”</p><p>“We did it during the Presidential debates,” Mandy said, her chin-length black hair glossy in the light. “There was this thing on Twitter.”</p><p>“Good to know Twitter has its usefulness.” Pushing the afghan to one side, he rose to his feet and stretched, then walked to the bathroom. When he returned, he found Sage wrapping a yellow scarf around Mandy’s head.</p><p>“Doctor’s orders are to take me home,” Mandy said, her eyes narrowing on him. “And you’d better be good to my girl this time or I’ll scalpel you.”</p><p>“Message received. First, let me get my coat and warm up the truck.” He glanced behind him and paused. “I was going to say that you two get your coats, but...” Mandy shoved a knit hat over Sage’s head, covering her eyes, until Sage flipped up the edge. “Looks like y’all got it covered.”</p><p>Five minutes later, they were on the road and heading into town. He glanced in the rearview mirror and shook his head. Mandy leaned against Sage, her mouth wide open.</p><p>“At least she doesn’t snore,” Sage said, her words remarkably not drunk sounding.</p><p>“I’ve always liked her,” he said, his eyes back on the road. Spattering of rain and sleet hit his windshield. “Do you usually pretend to be drunk?”</p><p>“No. I wasn’t in the mood, but Mandy was determined to cheer me up and I didn’t have the heart to tell her no. Mine were virgin.”</p><p>Silence reigned as they entered the town limits of Holland Springs.</p><p>“Which street?” he asked as the highway turned into Broad Street. Everything in Holland Springs was accessible from Broad.</p><p>“Left on Oak, then right on Poplar. There’s a new apartment complex called Poplar View.”</p><p>“They went all out with the name, didn’t they?” He made a left at the light, then sped up. “What’d the two of you talk about?”</p><p>Sage snorted. “What do you think?”</p><p>“Whether Spike or Angelus is the biggest badass.”</p><p>“Among other things.”</p><p>“She give you any advice about us?” he asked.</p><p>“Yes.”</p><p>“And?”</p><p>“The advice wasn’t for you,” Sage said, her voice firm.</p><p>A smile kicked up the corners of his mouth. If Mandy’s advice had been to kick him to the curb, Sage would have relished telling him. Hell, he wouldn’t have had to ask what they talked about. He glanced up at the rearview, catching Sage’s eye. The reflection from the lights in the dashboard made her face glow.</p><p>“I think you should follow Mandy’s advice to the letter.”</p><p>Sage rolled her eyes, but she didn’t say a word.</p><p>“Me, too,” Mandy said suddenly, coming to. “Especially the part—”</p><p>Sage slammed her hand over her best friend’s mouth.</p><p>“Yeah, especially that part,” he said, laughing. Then he parked his truck and helped Sage get Mandy into her apartment.</p><p>Joaquin drove back to Sage’s house in silence, but at least his wife had deigned to sit up front with him.</p><p>He glanced over at Sage. Her posture was rigid and she had a death grip on the seatbelt. “Trying to delay the inevitable?” he asked.</p><p>She didn’t answer him. Instead she stared straight ahead.</p><p>A couple minutes later, he pulled the truck in the driveway, cut off the engine and opened the driver’s side door. Light illuminated the interior. “It’ll be alright,” he said softly. “No expectations, remember?”</p><p>Her hands visibly shook as she searched her purse. “I’m not so sure about that.”</p><p>“Why not?” Sure, he’d almost exploded when she let out that little moan while he was working the ring off of her finger. Hell, he’d almost scooped her up and taken her to bed when a look of pure lust covered her face, but he’d been truthful. He had no expectations of what would happen between them while he was here.</p><p>However, it didn’t mean that something couldn’t happen.</p><p>Auburn lashes free of mascara slowly lifted, revealing luminous eyes ringed in black and infused with distrust. “I’m not sure if I can trust myself around you.”</p><p>A part of him wanted to pump his fist in the air, but the look in her pretty eyes made his gut clench, and he tempered his response considerably. “Then trust me to not hurt you this time.”</p><p>She gave him a brittle smile. “You’re asking too much of me.” Then she opened her door and slid out.</p><p>Grabbing his bag from the back, he caught up to her on the porch and took the keys from her noticeably shaky fingers, unlocking the door.</p><p>“I should’ve worn my gloves,” she said as he handed her the keys and their fingers brushed.</p><p>Her fingers had been toasty warm. “I’ll remind you next time.” Opening the door, he said, “Ladies first.”</p><p>She slid past him and he followed, closing the door behind him with an easy back kick. “So where should I put my stuff?”</p><p>Stopping in the middle of the living room, she pointed to a door on the right. “That room is mine.” There was a noticeable emphasis on the word ‘mine’. Walking another couple of feet, she flipped on the light switch in the hallway. “Your room and bathroom are down there, got it?”</p><p>“Yes, ma’am.” He saluted her with two fingers and the hint of a smile played on her lips. Encouraged, he tried to make her comfortable. “Look, it’s eight o’clock and I’m starving. Any place around here deliver?”</p><p>“Blue Moon delivers pizza.”</p><p>“Sounds good.” He dug his wallet out of his back pocket and held it out to her. “My treat. There should be enough cash to pay for the pizza and give the guy a tip.”</p><p>Her brows raised, but she gave him a nod, walking so close to him that he could have touched her when she took his wallet. “You trust me not to spend all your money? Maybe go online and clean out your bank account.”</p><p>“What’s mine is yours...and you’re mine.” Deliberately, he let his gaze drop to her lips. Her pink tongue darted out and licked the bottom. He went rock hard.</p><p>“That’s not how the saying goes,” she said breathlessly. Her chin tipped up fractionally, but it was enough to make him step closer, so close that only a small distance separated them and he bent his head.</p><p>Her hand pressed against his chest and he trembled, imagining how it would feel against his bare skin. How soft her skin would be. How sweet her touch. It was everything he needed, softness and comfort. He dreamt of it, of her, night after night. The tangible and intangible—the rarest of commodities while fighting a war. “That’s how it goes for us.”</p><p>Clasping her hand tighter to him, he watched as her lashes drifted down and her pink lips parted on a sigh. God, he wanted to kiss her. He wanted to devour her, mark her and claim her for his own. He knew that if he kissed Sage, he wouldn’t stop until he was inside of her and she was crying out his name.</p><p>“Do it already,” Sage said. “It’s why you’re here.”</p><p>He jerked away from her. A bucket of ice dumped down the front of his pants wouldn’t have been more effective than her words on his libido. There was no way in hell he’d touch Sage now, not with her thinking herself a martyr, or that she was just a convenient piece of ass for him. “No.”</p><p>Her eyes snapped open. “No?”</p><p>“No, because when we make love—”He ignored her snort.—“it’ll be for all the right reasons. It will be because you love me as much as I love you and want to stay married. I won’t accept any less.” He stalked past her, then paused beside the kitchen counter and tossed over his shoulder, “Thing is, Sage, I didn’t drive for twenty-six hours just to fuck you. That I could’ve gotten in Texas, without all the bullshit.”</p><p>Sage made an inarticulate noise as he walked down the hall to her guestroom.</p><p>His wallet smacked the wall near his head, but he didn’t take the bait. If Sage had wanted to hit him, she could have—without trying. When they were in high school, she had been captain of the varsity girls’ volleyball team and her deadly accurate serve had won many a game.</p><p>He calmly shut the door and locked it behind him. Time for Plan D.</p><p>Sage sat in the living room, pulling out the last of the Christmas decorations with jerky movements that sent a helpless elf flying across the room to land on top her fireplace mantle. She retrieved the elf, tossed in on the sofa and sat down in one of the large chairs by the bay windows. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For over an hour, she’d been out here alone. Blue Moon had called to cancel their order, because the roads had become too slick. Snow fell in thick white flakes beneath the yellow glare of the utility pole in her yard.</p><p>Curling her legs to one side, she balanced her elbow on the arm of the chair and leaned her jaw into her hand. She sighed, thick and loud enough for him to hear, but Joaquin remained in the guestroom. She’d offered to fix him something to eat, but he had declined through the door. God forbid he actually open it and talk to her.</p><p>Although she couldn’t exactly blame him for not wanting to come out.</p> <p>There had been no excuse for what she’d done. She’d never been a violent person in her life; never striking out at anyone with pure spite. The only reason she’d missed hitting Joaquin in the head was her last second hesitation. The only reason she’d thrown the wallet was because what he had said pissed her off. Instead of using her words, like she would have scolded her students for not doing, she resorted to throwing things.</p><p>But there was so much water under the bridge, and he’d broken her heart once before.</p><p>Rising to her feet, she moved to her bedroom and pulled out the stack of letters she’d left on her dresser. Briefly, she contemplated throwing them in the fireplace.</p><p>Her fingers traced the thin yellow ribbon holding the letters in one tight bundle. It could not have been true what he had written. She must have imagined the emotions in his letters, the heartbeats in his words and the love in every paragraph.</p><p>Determined to prove him a liar, she pulled out the third letter from the bottom and removed it from the envelope, then sat down on the bed and began to read.</p> <p>Dear Sage,</p><p>There are times when words cease to matter. When words cease to be able to describe the horrors I’ve seen, the people I couldn’t help and the rage I had to keep in check.</p><p>Today was one of those days.</p><p>But if I don’t get it out, if I don’t tell someone—I’m going to go out of my mind. If you want to stop reading now, I won’t hold it against you; just the thought that you’ve got my back and won’t give up on me gives me comfort and keeps me sane.</p><p>It’s a razor thin edge, sweetheart, but I’ll keep walking the line for you.</p><p>Our mission was nothing unusual—taking wheat and water to the locals, and keeping our eyes and ears open for any insurgent talk. I guess you could say we’d gotten a little cocky, a little too used to ordinary days of war (if ever such a thing existed).</p> <p>Sanford was moaning about having to relieve himself every five minutes. Pretty soon the rest of the guys were joining in and I was the only adult. It reminded me of this trip I took to Miami with my cousins. What should have taken thirteen hours, ending up being almost twenty. I thought my dad and Uncle Cesar were going to lose it and kick us all out of the van before we hit Las Palmas.</p><p>Finally, growing so sick of their bitching and moaning, I ordered the convoy to stop and for everyone to get out. So we’re all standing around, stretching our legs, but keeping an eye on things, when I see a local heading our way. He’s walking all determined and I notice Sanford gets this funny look in his eye, before he starts heading for the local.</p><p>Everything inside of me is screaming that something wrong. I start shouting at him to get back, but that hardheaded ass doesn’t listen. The local starts running away from us, I start running and so do three of my men. Next thing I know, Sanford tackles the bastard and there's a loud noise; moon dust starts flying everywhere and my ears are ringing. I’m on the ground, sprawled on my stomach and coughing up sand. The whole situation is FUBAR.</p><p>Visibility is nonexistent, but I scramble to my feet and start shouting Sanford’s name. My ears are still ringing and I start stepping on things, only those things turn out to be hands and feet and, well, you get the picture.</p><p>I found Sanford only a couple feet away, his mouth open and staring at the sky. He starts blinking, and so do I, because half his body is missing and he’s bleeding out. The rest of our brothers join us, keeping watch and trying to get Sanford as comfortable as possible.</p><p>What I am supposed to tell his wife? His little girls?</p><p>Jesus Christ, I want to scream. I want to rip the bastard that blew up my brother into pieces, but he’s dead. And the worse part, the biggest fuck you of all, was his death was instantaneous while Sanford held on while we waited for Medevac. All I could do was grip Sanford’s hand and lie to him. Give him bullshit lines that everything was going to be okay.</p><p>Tell me, Sage. Write to me and tell me that what I feel for you is real—that what you feel for me isn’t a fucking dream. That I haven’t been reading between the lines you’ve written.</p> <p>If I’m wrong, then feed me bullshit lines. Maybe that will fill up the hallow parts of my soul.</p><p>All my love,</p><p>JGage</p><p>So she had, but she hadn’t fed him lines.</p><p>Dear Gage,</p><p>I love you.</p><p>No matter where you go, or what you have to do in this hateful war, I won’t stop. You are a good man, an honorable one and I wish I could be with you.</p><p>I’d hold you tight, so tight that you could feel my heart as it beats for you. Keep walking the line for me, but just know that I’ll catch you if you fall and help you get right back on.</p><p>Since I can’t be with you, I’ve sent my emissary. She’s soft and fluffy. There are some spots on the ears that are missing fur, but it only means she’s been well loved.</p><p>A long time ago, there was a boy who loved a girl, and she loved him right back. Well, this girl wanted the ugliest looking bear you’d ever seen. But to her, it was so ugly it was cute. Anyway, that boy, despite his grumblings, spent fifty dollars playing a rigged county fair game and won that bear. (A bear that they would later find out cost five dollars at Wal-Mart.)</p><p>Unfortunately, the boy and girl couldn’t stay together forever—no matter how much the girl wished they could have, so she took that ugly bear and slept with it every night, instead of the boy she loved.</p><p>Now that ugly bear’s ready to give you sweet dreams, but only on one condition You have to deliver my bear in person when you get back. And you will come back. Come home to me. Spend Christmas with me...maybe even longer.</p><p>All my love,</p><p>Sage</p><p>There was only one person she would have sent that ugly bear to and that was Joaquin, only she’d been too much of a coward to admit it. He’d all but shouted who he was in his last letter.....In every letter.</p><p>She owed him the chance to tell his side—and she owed him an apology.</p><p>The house was quiet, only the hum of the refrigerator and warm air blowing through the vents made any noise. If the auxiliary heat came on, she’d have to start using the wood-burning fireplace.</p><p>Taking a deep, shaky breath, she made her way out of her room and down the hallway. He didn’t answer on the first knock so she tried again. She tried turning the knob, but it was locked; however, the key was sticking out on top of the frame and she made use of it.</p><p>Light from the hallway illuminated her way as she tiptoed to the side of the bed. She found him bare-chested, with the covers riding low on his hips as he slept. The St. Christopher medal she’d sent him, hung on a thin gold chain around his neck.</p><p>“Oh my God,” she gasped and smacked her hand over her mouth.</p><p>A guilty flush heated her cheeks. She really shouldn’t be ogling the man in his sleep, but his body fascinated her. It was different than what she remembered, but parts of him remained the same. He was still lean, but new muscles from hard work defined his chest and arms, his abs and the dents on the side of his hips.</p><p>He mumbled, then moaned. His hands unclenched and clenched into fists. His moans turned into shouts as he tossed and turned in the bed.</p><p>Sage reached out, murmuring his name over and over as she lightly touched his face. Joaquin began to settle down and finally his breaths became less labored. She smoothed away the damp hair from the top of his brow. It had always grown fast. He had told her in his letters that he didn’t have to keep it in a buzz cut anymore, because the Army had slightly relaxed its rules in order to attract new recruits.</p><p>She began to rise from the bed, but he grabbed her hand and held it to his chest. His skin was smooth and hot to the touch. “Don’t go.” His eyes slitted open. “Nightmares.”</p><p>“I’ll stay for as long as you need me, okay?” She sat down beside him and he scooted over, making room for her. However, her hand stayed firmly in place. “Do you wear that often?” She touched the gold chain with her free hand, then placed her hand back on the bed.</p><p>“All the time.” As his eyes drifted shut, she thought he whispered, “Thank you.” Or had it been, “Love you.”</p><p>Her heart flipped in her chest and tears tightened her throat.</p><p>It didn’t matter what he said, she knew what he meant. She slid down into the bed, lying beside him with his heart beating steadily under her palm as she breathed him in.</p><p>Chapter Six</p><p>He woke up with the unmistakable shape of a woman’s breast in his hand and her ass tucked in his groin. Automatically, he pressed closer and pulled her tighter against him. The scent of vanilla invaded his senses as silky hair tickled his mouth.</p><p>“Sage,” he mumbled.</p><p>“Hmm?” came her sleepy answer.</p><p>His eyes snapped open. Holy shit. He was in bed with Sage, and he was feeling her up. He let go of her breast like it was burning piece of coal . Which might not be far from the truth, because he was seriously hot, seriously overheated and in need of a cold shower.</p><p>Rolling away from her, he grimaced.</p><p>He scrubbed at his face, then rubbed his eyes. What a way to repay the woman who’d helped get him through the night. He couldn’t count the number of times he’d woken up sweating and grasping for his sanity. Sage had been there every time, whispering words of comfort and tenderly wiping his face with a cool cloth.</p><p>Not one time had she tried to get him to talk about what was keeping him up. There was the very real possibility that he might never share those nightmares with her, even if she knew the underlying cause—Sanford’s death.</p><p>After pulling the comforter over her, he slid out of bed and headed to the bathroom. A quick shower and shave, along with minty fresh breath, made him feel human again.</p><p>Glancing at the clock on his cell, he made up his mind to go for a run. He ducked into the guest room to grab his shoes. Sage mumbled in her sleep and he quietly padded over to her, placing his cell on the nightstand beside her glasses.</p><p>Waves of auburn hair spilled over her shoulder and along her face. He lightly touched her cheek, moving the bright strands to reveal smooth skin, highlighted with gold freckles. She stirred and he tucked the blankets around her, the way he had on their wedding night. “Go back to sleep.”</p><p>They’d been so young, so convinced that their love would overcome any obstacle thrown their way. Except they hadn’t counted on him acting like a spoiled child, then joining the Army as a big fuck you to his parents.</p><p>He hadn’t counted on her to be a coward and stay in Holland Springs. He hadn’t counted on her falling for her mother’s full-press guilt. Hell, she hadn’t bothered to even tell her family that they were married. And she was still afraid to rock the boat. .</p><p>Pressing his lips together in a flat line, he let his gaze linger on her, then walked out of the room, softly closing the door behind him.</p><p>The smell of the snow hit him first. Fresh and clean, not the acrid stench of death. Sparkling white and untainted, tempting him to plunge in headfirst, to see if it could do the same for him. If it could make him the man he was before he’d kicked up the first cloud of moon dust, without blood and death on his hands. But like the Army shrink had said, Joaquin had to move past this, but not by forgetting. He needed to honor those who didn’t make it out by living life fully.</p><p>Easier said than done, he thought with a grimace. But he would try with everything inside of him.</p><p>He stretched his calf muscles and arms.</p><p>Snow gave away easily as he began to run, his sneakers sinking deeper with each depression. Sweat trickled down his back and gathered on his brow. He ran until he couldn’t, then he simply walked, hands low on his hips taking in great gulps of cleansing air.</p><p>Passing a Christmas Tree farm, he watched a family pick out the perfect tree. Little squeals and shouts as healthy children with rosy, plump cheeks ran around the place. Everyone had a Christmas cheer glowing about them as they wandered in and out of the rows of trees.</p><p>The mental container he’d packaged those memories in tipped over, images spilling out and merging with the present. Scrawny arms and legs, stomachs distended from hunger, and brilliantly colored eyes rendered dull and ancient. Men and women’s bodies riddled with tumors, with defeat and despair—the most he’d been able to offer them were words of kindness in another language, wheat and fresh water.</p><p>In less than a week he had to convince Sage that they made sense. That they still belonged together. Despite their past, they had a future.</p><p>If he failed, he wouldn’t last a day.</p><p>Turning from the happy families, he began the long trek back.</p><p>Sage appeared in the kitchen as he flipped the last pancake, the comforter wrapped around her and her hair all tangled around her shoulders. Her rumpled appearance and cute black glasses made him want to take her back to bed and spend the rest of the day in it with her.</p><p>“Good Morning.” He looked at the clock on the microwave, then back at her and smiled. “Make that ‘Good Afternoon’.”</p><p>Her lips curled up at the corners as she sat down at the bar. “Hi.” The comforter slipped down around her shoulders, unfortunately for him she still had her shirt on from the day before.</p><p>Grabbing a plate, he filled it up with her favorites.“Blueberry pancakes, cheese eggs and apple juice.” Astonished eyes flew to his. “It’s the least I can do after last night.” He set the plate in front of her, then handed her a container of syrup before joining her. There was no use in being embarrassed about what had happened. She had seen him at his most vulnerable and stayed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You don’t have to do this.” She shifted her gaze away from him, staring at a point over his shoulder.</p><p>Was she embarrassed? He began dragging her plate along the counter. “Then you won’t mind if I eat your breakfast and mine?”</p><p>“Yes, I mind, you hog,” she giggled, snagging the plate from him. In her attempt, their fingers collided.</p> <p>His throat caught on a sarcastic reply. He hadn’t heard her laugh in four years. No, the times he’d actually spoken to her on the phone had ended up with accusations, shouting and blocked numbers.</p><p>Abruptly her laughter stopped and she flushed, the guilty look in her eye reminding him of the time he’d caught her spying on him skinny dipping with Angelica Braxton the summer before his senior year.</p><p>Grand plans of seducing the soon-to-be college freshman had dwindled to the size of his shrunken libido as soon as he’d spotted Sage’s fiery hair. He’d shouted her name and half ran/swam to shore after her. The shrieks of laughter belatedly emitted by Sage and her best friend, Mandy, as they disappeared into the woods had added insult to injury. The beauteous Angelica had stomped to shore, put on her clothes and had given him the silent treatment the entire way to her house.</p><p>Clearing his throat, he pushed his eggs around on his plate. “So, I was thinking about what we should do today.”</p><p>She took a sip of apple juice, then speared a bite of pancakes. “If it includes long talks about our feelings, how you were wrong to deceive me and why we should give our sham of a marriage another chance—count me out.”</p> <p>Guess last night had been a fluke. Maybe he had imagined the tenderness in her touch and voice. Frustration simmered in his gut, but he kept his voice cool as he said, “I was thinking we should take advantage of the weather today, maybe go pick out a tree and shop for presents. Tonight they’re calling for sleet and more snow.”</p><p>Amazingly, she flushed even more and nodded at the back sliding glass door. “I already have presents and a tree. I’m sure you saw the boxes of decorations in the guest room.”</p><p>He blinked and followed her line of vision. A large Christmas tree sat on the back porch, its limbs devoid of decoration or lights. There had been three large boxes of decorations in the room he’d slept in last night. She really had gone all out for Gage.</p><p>God, he felt like an ass.</p><p>Taking a last bite of scrambled eggs, he washed them down with coffee. “I’ll bring the tree inside.”</p><p>Rising from the barstool, she said, “I’ll help.”</p> <p>The smell of Christmas hit him, all pungent and nostalgic. Kneeling, he grasped the tree at the base and lifted it. Water sloshed around the bottom, making the tree extra heavy and awkward to lift.</p><p>“To the right,” she said, helping him guide the tree through the door. “Now three steps to the left.”</p><p>His hip hit the stove and he grunted. A tree branch scraped his cheek.</p><p>“Sorry, should’ve been two steps.”</p><p>“We all make mistakes.”</p><p>“Don’t turn this into a life lesson, Joaquin,” she warned.</p><p>Pursing his lips, he hefted the tree higher. Luckily for him, the ceiling in her house had been stripped down to the original exposed beams and allowed him to move the tree without scraping it. “Where do you want it?”</p><p>“In the living room, right in front of the bay window. I’ll get a sheet to put under it.” He heard doors opening and closing, the sound of her footsteps. “All set,” she said.</p> <p>He peered around the tree. Sage knelt on the hardwood, smoothing out a corner of a green sheet. Shuffling forward, he managed to place the tree exactly in the middle.</p><p>Exhaling, he brushed off his hands, then moved to the kitchen to wash off the tree sap. “Looks good.”</p><p>“Do you want to decorate it?” She rose to her feet and moved to the iPod dock in the corner. Turning to face him, she smiled as she tucked a lock of hair behind her ear. “I have a whole playlist of Christmas songs.”</p><p>Just as he was about to answer, his phone buzzed. Drying his hands, he pulled it out of his side pocket and read the text message from his mother. Time to face the music. “How about tonight? When I—”</p><p>“Whatever.” She shrugged, but disappointment clearly shone in her silver eyes before she turned away and began to rearrange the Christmas village on her mantle. “I’ll do it myself.”</p><p>He strode to her, cupping her slender shoulders and turning her to face him. Her lashes fluttered down, skimming her cheekbones. “Sweetheart, I’m not blowing you off.”</p><p>“It’ doesn’t matter,” she said, still not looking at him.</p><p>“Yes it does.” Hooking a finger under her chin, he lifted it up. A pink tongue darted out to lick at her top lip and he couldn’t stop himself from doing the same. She gasped, her full lips parting at his touch. Never one to let opportunity slide by, he nipped at her full bottom lip. “Ask me.”</p><p>Her hands came between them, lightly resting on his chest. The heat of her palms searing him. “You’re not playing fair.”</p><p>“This isn’t a game.” He let his hands travel the length of her arms, then back up again to cup her elbows and pull her closer. Full breasts pressed against him, her hands drifting lower to grab the waistband on his jeans. He hadn’t been with a woman in years, his determination to make something of himself and winning her back his only goal. Meaningless one night stands weren’t part of the plan, which totally explained the hard-on pressing against the zipper of his jeans. “Ask me.”</p><p>What seemed like an eternity passed before she replied, “Kiss me.”</p><p>Chapter Seven</p><p>Sage expected him to go in for the kill, mostly because that’s what she felt like doing, but she restrained herself, locking joints and tightening muscles. However, Joaquin had other things in mind.</p><p>He started at the base of her neck, his tongue and teeth working in tandem to make everything inside of her warm and gooey.</p><p>“I won’t hurt you, not this time,” he whispered against her jaw, pressing butterfly light kisses along it. He teased the corner of lip. “Open.”</p><p>And as if that was somehow a magical command, she did. In her next heartbeat, his mouth was sealed over hers and he was drinking her in. She couldn’t stop kissing him, touching him, or moaning in his mouth. Four years of longing passed between them. In that moment time fell away, old regrets and new frustrations erasing from her heart with each toe-curling kiss.</p><p>Their tongues touched, then tangled as her body cried more. He was hard against her stomach and she touched him there, sliding her hand under the waistband of his loose jeans and caressing him until she was so damn weak in the knees that she all but thanked God when Joaquin swept her off of her feet.</p><p>Their mouths tasted and explored one another, remembering and showing exactly what the other liked as he carried her to bed. Don’t think, don’t think, she chanted in her head.</p><p>Her back hit the mattress, then the delicious weight of Joaquin pressed against her. Moaning into his mouth, she pushed at his shirt and sat up. “I want this off.”</p><p>He sat back on his calves, then gently removed her glasses and set them on the nightstand.</p><p>“That’s an order, soldier.”</p><p>“Yes ma’am,” he said on a laugh and pulled his shirt over his head, in the sexy way that men do. Tight abs greeted her and she kissed the center of his chest, rubbing her cheek in the crisp black hair. “Damn, woman.”</p><p>Tugging her own shirt over her head, she arched off the bed when his hands cupped her breasts. “Oh God.” Her bra was the next to go, then their pants and underwear. Panting, she lunged for him, kissing, licking and biting at every inch of his skin.</p><p>“Christ, you’re killing me.” He lifted her to his face, slanting his mouth over hers and burying his fingers in her hair. This time he kissed her like a man starving. His kiss dominated, taking and demanding.</p><p>Heat and desire swept over her, tangling together. Four years she had missed this. Four damn years she had gone without a man’s touch and kiss.</p><p>His hands coasted down her side, grabbing her hips and squeezing. His erection pressed against her sex as he settled himself between them. Kissing his way down her body, he stopped at her breasts, tugging on her hard nipples and sucking them deep into his hot mouth. She sank her hands into his short hair, her nails scraping as he growled low in his throat.</p><p>Suddenly, he shoved her thighs wide and buried his face between them. She screamed at the first pass of his tongue, then again when he sucked her clit into his mouth. “That’s it, baby,” he said against her tender skin and slid a finger inside of her. “Oh hell, you’re so damn tight and wet.” Pulling her to her knees, he sank another finger inside of her and ordered her to move her hips. “So fucking beautiful. Look at us, Sage. Watch me fuck you with my fingers.”</p><p>Helpless, she glanced down just as he added a third finger. She whimpered at the slight pain, but then his thumb brushed her clit and she bore down on his hand.</p><p>“Easy, baby...” He caught a tight nipple with his lips and teased the tip of it mercilessly. Blood pounded in her ears. Her heart galloped in her chest. He bit down on her nipple and did something with his talented fingers that shook her entire body.</p><p>It all became too much.</p><p>Grabbing his wide shoulders, she held on for dear life; her body shattering into a million pieces as she moaned his named with one long exhalation of air that left her limp and weak.</p><p>Joaquin gently lowered her to the bed and pressed a kiss to her forehead. “Keep the bed warm. I’ll be back in a little while.”</p><p>As he moved away from the bed and picked up his shirt, she frowned. “Where are you going?”</p><p>“Have to see my parents.”</p><p>She gave a pointed look at his groin, where he remained hard and mouthwateringly ready for her. Of course she still wanted him. The orgasm he’d given her was merely an appetizer. “Like that?”</p><p>“Thought I’d give you something to think about while I’m gone.”</p><p>“Oh, trust me, I won’t get the image of that—” She waved her hand in the direction of his penis. “—out of my head.”</p><p>A slow grin covered his face, wicked and full of desire. “You gonna do something about it?”</p><p>Licking her lips, she nodded. “I think I can help you out.”</p><p>“Like you did for me,” she added, lest he think that what she wanted was something more.</p><p>His features turned grim for only a moment, then dropped his shirt and moved to stand beside the bed. She rolled to one side, facing him. A drop of arousal had formed on the tip of his cock. “Taste me.”</p><p>Closing her eyes, she took the head of him into her mouth and slowly caressed the length of him with her fingertips. He grunted and captured her chin. “Just your sweet mouth.”</p><p>Opening her eyes and lips, she took him deep inside, letting him set the pace as he held on to the sides of her head. Sucking harder, she let him hit the back of her throat and he cursed. She rolled to her hands and knees, and took him deeper.</p><p>She licked the hard length. “Want more?”</p><p>“Hell yes,” he said, his voice raspy and deep as she traced her name on the underside of his erection with her tongue. “Open up.” She did as he commanded, her eyes closing once more as he breached her lips. Slowly and steadily he thrust his length into her mouth, his fingers curling in her hair. Doubling her efforts, she sucked on him until her cheeks hollowed.</p><p>“I have to come, Sage. You—”</p><p>She caressed his balls, then lightly squeezed when he exploded in her mouth. The taste of him making her wetter and hotter, not stopping until he gently pushed her away. Licking her lips, she looked up at him and smiled. “Now we’re even.”</p><p>His brown eyes were dark and guarded, not what she expected. Stepping away from her, he dressed in silence.</p><p>“Are you okay?” Probably the dumbest thing she could’ve asked.</p><p>Looking at her, his mouth opened and closed, then thinned. “Fine.”</p><p>Her stomach dropped to her toes, but she put on a bright smile. “I’d think you’d be better than fine.” Feeling more than exposed, she grabbed the throw at the end of her bed and wrapped it around her. “I know I am.”</p><p>“I didn’t take you for that kind of woman.”</p><p>“Excuse me?”</p><p>He paused at the bedroom door, his broad shoulders rigid. “The kind to play mind games.”</p><p>“Are you kidding me?” She rose from the bed, one hand clenching the blanket around her and the other fisting. “I’m not the one who pretended to be someone who didn’t exist. That was you, Joaquin. You. “</p><p>“And this hot and cold act is my punishment?” He turned to face her.</p><p>“Yes...no. I don’t know.” She threw her free hand in the hair, then let it drop. “You messed with my mind and my heart. I was expecting Gage to be here at Christmas, not you. I bought him presents, not you. I decorated my entire house for him, not you. Yet you expect me to say ‘It’s okay Joaquin. I forgive you for breaking my heart again. I forgive you for lying to me.’” Her lower lip trembled, but she would be damned if he saw her cry. “You haven’t even apologized.”</p><p>“You’re right.”</p><p>“I am?”</p><p>He took a step towards her. “Yeah. “ A shaky breath left him. “I’m sorry for fucking up your life, for deceiving you. But most of all I’m sorry I didn’t stay and fight for us.”</p><p>“But now you’re going to?” She bit at her bottom lip.</p><p>Another step and he was standing so close that he could almost touch her. He nodded. “With everything inside of me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Whirling away from him, she clutched the blanket tighter around her and placed her other hand over her heart. It beat a million miles a minute. “I don’t know if—”</p><p>“Don’t fight me on this, Sage.”</p><p>“I don’t want to fight.” She sighed. “I want my life to return to normal.” The blanket slipped lower along her back, exposing a circular scar on her shoulder blade.</p> <p>Unable to help himself, he traced it and she shivered. “I’ll never forget the day this happened.”</p><p>“Me neither. It hurt like all get out,” she said with a sniff.</p><p>Sage had fallen on a floating log while knee boarding with her cousins on the Pamlico Sound. They hadn’t been dating then, but he’d almost swallowed his tongue when he’d seen her fall.</p><p>Diving into the water to get to her hadn’t been a second thought, or a regretful one. Not even when his cousins were catcalling him from their boat. Floating and holding her while she cried and bled all over his hand had nearly made him cry, too, as they waited for her cousin’s boat to turn back around to get her.. A temporary truce had been brokered that day between the Morales’ and Caswells, as they worked together to get them both out of the water and Sage to the closest emergency room.</p><p>A week later he worked up the nerve to ask her out. It had taken a little over three weeks before she’d said yes. And only two weeks more to realize he was crazy about her. Only a month more to realize he’d found the woman of his dreams.</p> <p>“You saved me,” she added.</p><p>That he had. “I need you to save me back.” He kissed a bare shoulder. “I need you, Sage. I’ve brought all my worldly goods in that moving trailer. Holland Springs is my home and I plan on making a life here, with you. I want babies and t-ball games...and ballet lessons. I want you to yell at me when I track mud in the house or when I say something majorly stupid, then have make-up sex. I want to grow old with you and drive real slow on Sunday afternoons. “</p><p>“I need more time, Joaquin,” she whispered.</p><p>It wasn’t what he wanted to hear, but she hadn’t said no. “You can have more time, sweetheart, but I’m coming home, to this house, when I’m done talking with my parents,” he said. “Then we’ll decorate the tree...Hell, we’ll finish decorating the house like we’re the Griswolds.”</p><p>She bent her head, dark red strands falling forward, exposing the nape of her neck. An eternity seemed to pass before she turned to face him. Grey eyes soft like rain. “Guess I’ll need to tell my parents, too.”</p><p>“My parents already know,” he admitted.</p> <p>Her eyes went wide. “How long?”</p><p>“It’s part of the reason they disowned me and kicked me out of the house.”</p><p>She grabbed his hand. “Why didn’t you tell me?”</p><p>He made a face. “I did, in my first letter to you, remember?”</p><p>“Not really.” Pain sliced his heart like a knife. “But I mean then.”</p><p>Tipping his head to the side, he asked, “Is that why you keep all of them by your bed?”</p><p>Her cheeks turned red, eyes dropping to the floor. “No,” she whispered. “I got them out to tear up in front of you.”</p><p>Clenching his jaw, he fought to remain calm. “Like I said, I’ll be back later. I’ll text you when I’m on my way—unless you changed your number again.”</p> <p>She shook her head. “It’s the same.”</p><p>Despite the rage and pain he felt, he kissed the top of her head and left the room.</p><p>Chapter Eight</p><p>Joaquin barely made it in the door before he was assaulted with hugs and kisses from his family. Aunts and uncles talking to him in a mixture of Spanish and English.</p><p>Jesus, he missed this. Almost as much as he’d missed Sage.</p><p>“My baby!” Mariela charged through the group, throwing her arms around his neck while she sobbed. “I’m sorry. I’m so, so sorry.”</p><p>Guilt and relief flooded him. He hated not talking to her, hated that she’d worried, but in his mind, she’d chosen to side with his father- his stubborn, hard-head father.</p><p>He tightened his arms around his mother. “I missed you, too, Mamá,” he said, his voice gruff. Damn, but if he didn’t feel like crying like a five year-old.</p><p>She pulled away, inspecting him from head to toe, her brown eyes liquid and filled with everything he was feeling. Her hands shook as she touched his face. “You look older...still my Joaquin though.” Smiling, she patted his arm. “Too skinny. Let’s eat.”</p><p>“Let me see my son,” Juan boomed and the crowd parted like the Red Sea. His father strode up to him, proud and pompous as usual. Joaquin braced for the lecture and the insults. That he wasn’t welcome at this house, the car dealership, yes, but never here.</p><p>Joaquin ticked up his chin. “I’m home and still married to Sage Caswell.”</p><p>To his utter shock, his dad’s face crumpled as thrust out his hand. “Forgive me. I was wrong. Forgive me, por favor.”</p><p>Unable to move, Joaquin stared at him. There was a vengeful part of him that wanted to tell his dad to go screw himself. That he’d had four years to ask for his forgiveness. Too little, too late. But the larger part of him, the part of him that his parents had instilled deep in his heart, and had been honed in the Army knew when to show mercy.</p><p>His father had bent; Juan Morales had swallowed his pride first. A feat Joaquin thought he’d never see.</p><p>“I’m sorry, too, papá,” he said, grabbing his dad’s hand and pulling him in for a hug.</p><p>Joaquin sat at a table big enough to seat twenty, but his mother still had to bring in two more folding tables. It was amazing how easily he slipped back into the role of the doted upon son. His mother fixed his plate, his drink, and if he had let her, would have cut up his enchilada.</p><p>“Where’s your wife?” Juan asked. “Shouldn’t she be here celebrating, with her husband and family?”</p><p>Mariela tsked, shaking a finger Juan. “Leave him alone.” Then she patted Joaquin’s cheek. “Eat up, niño.”</p><p>“It’s okay.” He speared a bite of chicken and green chilies. “She’s talking to her parents, papá .” Not wanting to hurt their feelings, he didn’t add that he wasn’t sure how she’d be treated here. “We plan on decorating our house tonight.”</p><p>“Decorating?” his cousin smirked. “Is that what they’re calling it now days?”</p><p>Carmen smacked Roberto on the back of the head. “Manners.”</p><p>Joaquin bite back a grin at the couple. “I should take you out back, Berto, for telling Sage.”</p><p>Roberto toasted him. “You’re welcome.”</p><p>Eying his mother, he leaned in and asked, “Why don’t you and papá come over Christmas Day.”</p><p>Smiling, Mariela teared up once more. “We wouldn’t miss it.”</p><p>“Can’t stay long though, sales strategies to plan,” his dad said around a bite of empanadosas. “The day after Christmas can be very good.”</p><p>Mariela smacked the table and everyone grew quiet. “No, Juan. We will stay as long as Joaquin and Sage want us there. Sales can wait.”</p><p>Joaquin fully expected his dad to storm away from the table, muttering and cursing in Spanish, but once more Juan surprised him. He wiped his mouth with a napkin, looked at his wife, then at Joaquin and nodded once. “Fine.”</p><p>Everyone resumed talking and eating, as though something spectacularly amazing hadn’t just occurred before their very eyes.</p><p>“Guess a miracle really can happen at Christmas,” Roberto whispered to Joaquin.</p><p>“Do they happen twice?” Joaquin asked, his mind turning to Sage. “Because I’m in need of another one.”</p><p>It was just another Saturday night at the Caswells’ house. Her aunts, uncles and cousins were hanging out in the rec room, shooting pool, playing Wii, and drinking at the built-in bar in the corner.</p><p>“That rat bastard’s truck was seen at your house last night,” her cousin, Rachel said. “I got a set of keys ready and willing to write something pretty on the side.”</p><p>Had her momma told everyone in the family about those letters? Struggling to maintain her composure, she lined up her Wii remote with the flatscreen. “You’ve really got to quit listening to Carrie Underwood songs,” Sage said.</p><p>“Just saying.”</p><p>“So noted and appreciated, but Joaquin’s being less rat-bastardly for the moment.”</p><p>“Sage, darling, come over here and sit with your momma.” What was it about southern mothers that made them talk in the third person about themselves and no one called them out for it?</p><p>Handing off her remote to Rachel, Sage joined her mother on a gold sofa with large plaid pillows. “Yes ma’am?”</p><p>“Why do you insist on those horrible glasses? Contacts would do you a world of good.”</p><p>“I like my glasses and I only need them to see far away.” And since it was easier to keep them on all the time, instead of just when she needed them. Besides, it was another victory over her mother’s insistence on what Sage should do, wear or act.</p><p>“Then we’ll call Dr. James and schedule you for laser eye surgery.”</p><p>“I’ll think about it,” Sage said, earning a pleased smile from Virginia.</p><p>“That’s my girl.” Virginia handed Sage a manila envelope and smiled. “Merry Christmas, sugar. Hope you don’t mind it’s early, but your Uncle Joe came by today.”</p><p>Sage tilted the envelope to one side, dread making her heart pound. Uncle Joe was a divorce attorney in Charlotte. He was vicious and mean, and always got his client the most amount of money and custody, whether they deserved it or not. A stapled document slipped out.</p><p>After reading through it quickly, Sage shook her head and shoved it back in the envelope. “How did you know I’d married?”</p><p>Tossing back a glossy strand of red hair, Virginia smiled sweetly. “A mother always knows.”</p><p>Meaning a mother that used her brothers and sisters jobs to snoop and spy on people knew everything about everyone. Was her dad that much of a push-over?</p><p>“I’m not sure about this. I think I want to try to work things out with Joaquin. He’s staying at my house and we plan to spend Christmas together,” Sage began, but Virginia suddenly went pale, her breaths coming out in little gasps.</p><p>“I can’t breathe,” she panted, her hand over her heart.</p><p>“Daddy,” Sage shouted, moving to the end of the sofa to prop up her mother’s feet. “Momma’s having one of her dizzy spells.”</p><p>Charles came hurrying over, beer in hand, and a frown on his head. “I’ll call Doctor Reed.”</p><p>“No need,” Virginia said, all breathless and pale cheeked. “Just give me a minute.” She sliced her gaze to Sage. “You know how my condition affects me.”</p><p>For years, Sage had suspected that her mother used her asthma and heart murmur as an excuse to get her way, but she’d never tested that theory. “I know and wouldn’t it be great to have a son-in-law like Joaquin to help out in times like these? Just think of all the things he could do with Daddy, so you don’t have to worry?”</p><p>Virginia frantically waved her hand in front of her face. “Oh, dear. I swear, my heart is beating so fast. Get me my pills, Charles.”</p><p>Her dad hurried off</p><p>A warm hand clasped hers. “Sage, darling, I want you to swear that if anything happens to me that you’ll take care of your daddy. He’s looking at that Cutter boy to take over and who knows what will happen with that.”</p><p>“I assumed Hank would buy Daddy out.”</p><p>Long lashes fluttered closed. “But what would happen to my baby girl? You know those Moraleses will try to leave you high and dry. Better make the first move.”</p><p>“I should divorce Joaquin in order to—”</p><p>“Here you go, sugar,” Charles said, kneeling on the floor with two pills and a glass of water.</p><p>Virginia took the meds and sipped at the water, flashing her husband a grateful smile. “What would I do without you?”</p><p>Sage rolled her eyes.</p><p>Her mother accepted a kiss on the cheek and waved her husband away, fixing her bright blue eyes on Sage. “I’m so glad you agree, Sage.”</p><p>“I didn’t agree to—”</p><p>“My word...it’s happening again,” her mother said, cheeks even paler.</p><p>“Let me think on it.”</p><p>Her mother beamed at her, all signs of breathlessness and heart problems magically gone. “Don’t take too long. While Uncle Joe is family, he ain’t cheap.” Virginia rose from the sofa and made her way to the bar.</p><p>For a few minutes Sage watched her mother laugh and carry on as if she hadn’t a care in the world or a heart problem. Had Sage really been that gullible? Rising to her feet, she grabbed the envelope and made her way upstairs to her parents’ bathroom. In the medicine cabinet, she found her mother’s pills.</p><p>They looked legitimate, with a prescription filled by Sage’s Aunt Helen. She popped off the top and frowned. The pills looked exactly like the ones she had to take before she flew across the country by herself. Anxiety pills, Aunt Helen had told her, nothing that could hurt or form an addiction from taking a couple.</p><p>All this time, her mother had been taking anxiety pills?</p><p>Fury coursed through her. All this time, Sage had thought she’d done the right thing by staying in Holland Springs with her family, because her mother needed her close.</p><p>She hadn’t told her mother about the marriage, only that he’d asked her to marry him. Her mother had had one of those “spells” as she called them that had lasted for weeks. So Sage had stayed, and when Joaquin never came back to home to get her, or even try to convince her to come with him in person, she had just known she’d made the right decision. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Just like she had known her mother had medical problems.</p><p>Sage walked to the toilet and opened the lid, then poured every damn one of those pills in and flushed, leaving the empty bottle and the manila envelope on the counter in plain view.</p><p>With her head held high, she left her family’s house and drove straight home to wait for Joaquin.</p> <p>Chapter Nine</p><p>Sage tackled Joaquin as he walked in the front door. He caught her up in his arms and she wrapped her legs around his waist.</p><p>“I’m sorry,” she sobbed, between kisses. “I’m so thankful and grateful and happy you’re alive; you’re healthy and home.”</p><p>He kissed her back, murmuring, “Stop it. We were both young and dumb. Well, you were. I was most recently dumb.”</p><p>A small bit of laughter escaped her lips and he drank it in. He only wanted laughter or happy tears with Sage.</p> <p>“I forgive you,” she said, leaning back in his arms. “I should have known it was you in those last letters, but I was too stupid to realize it and the handwriting threw me off.”</p><p>“I had to improve my penmanship during officer school,” he teased, sitting on the sofa with her. She laid her head on his shoulder and he closed his eyes, sending up a prayer of thanks. “Got hazed for my chicken scratch.”</p><p>“Come to bed with me, Joaquin.”</p><p>His cock stood at attention with that softly uttered command, but his brain made him say no. He wasn’t sure what had changed her mind, but he couldn’t have sex with her, only for things to fall apart when or if her parents or his decided to go against them.</p><p>“We should wait.” He kissed the top of her head. “Let’s decorate instead.”</p><p>“Are you turning down sex?” Disbelief colored her words. “I thought it had been a while for you.”</p> <p>“Oh it’s been longer than a while.”</p><p>Sage jerked up. “How long?”</p><p>“Since June twenty-second, two-thousand and—”</p><p>“Not since our wedding night?” Her eyes were round and full of hope.</p><p>Hope was so his friend right now.</p><p>“That so hard to believe?” He cupped her face. “We were still married and once I make a promise, I keep it. Although I will admit there were times I wanted to break that promise. Luckily, I got Rosie and her five sisters with me at all times.” He waved one of his hands at her.</p><p>Her brows drew together, then understanding dawned. “Ooooh.”</p><p>“Don’t tell me you didn’t take care of business.”</p> <p>“I prefer to call it my happy time.”</p><p>“You would.” He snorted. “Wish I could have seen you do it.”</p><p>Glancing away, she nibbled on her bottom lip. “Maybe tonight.”</p><p>Oh yeah, that would be perfect. Then she ground her sweet ass into his dick. “You’re killing me,” he groaned.</p><p>Her fingers tiptoed their way down to his zipper. “I can make it better.”</p><p>He grabbed her wrist. “No.”</p><p>She blinked. “No?”</p><p>“We need to talk first, spend some time together and—” She ran her free hand under and up his shirt, caressing his chest. He swallowed a moan. “Take things slow.”</p><p>“Like this afternoon?” Her tongue touched the base of his neck and he struggled to keep his hands from going to the hem of her sweater.</p><p>“About that,” he began.</p><p>“I’m all about that, Joaquin.” She kissed her way up his neck, then bit down on his earlobe, nibbling and sucking. “Let go of my wrist.” Taking a deep breath, he did as she asked and placed his hands on each side of her waist. She dropped back a little, looking him in the eyes. “Did you ever come back here, after you left?”</p><p>He nodded. “I drove up from Georgia the very minute I was able.” It had rained the duration of his ten hour trip. By the time he’d arrived at Sage’s house and she still hadn’t answered his calls or texts he had sent at every stop sign or light, he’d been pissed off and unreasonable. “Your mother wouldn’t let me in and she said you didn’t want to see me.” Hating the words that had damned her mother, he continued, “I sent you letters and called you every damn chance I got. Even after Virginia sent me away and I got stationed at Ft. Hood, I kept writing and calling, until, well, that day.” Hoping and praying that Sage would tell him to come get her. When he had finally gotten her new number from his cousin, Roberto, and had called, Joaquin had been a first-rate ass to her.</p><p>“I didn’t get the letters or any of your calls while you were at boot camp and officer school.” She rubbed her temples. “I’ve told you this a million times. The first call I got from you was in November and we fought the entire time.”</p><p>“I know. Being served annulment papers tends to bring out the beast in me.” He titled his neck to one side, then the other. “Doesn’t excuse my behavior. You didn’t deserve to be talked to that way. I’m sorry, sweetheart.”</p><p>“Thank you.” Tears glistened in her eyes. “I’m pretty sure my mom kept me from getting your letters, and she’s the one that dropped my phone in a tub full of water.” She laughed bitterly. “And I thought she was being so nice for once, buying me a new phone and offering to pay for it, even though I had to get a new number.”</p><p>“Then you got another new number.”</p><p>“Who kept giving you my number?”</p><p>“Your neighborhood hairdresser.”</p><p>Sage made a face. “He would.”</p><p>“Hey, Roberto can’t help but be a romantic. It’s the Latin in him.” Joaquin smiled sadly. “Your mom doesn’t want you to ever leave Holland Springs. She pitched a fit over you going to college an hour away from here.”</p><p>“Still, if I was adult enough to decide to get married, I should’ve acted like a married woman.”</p><p>“And I should have acted like a man, instead of a spoiled brat who didn’t get his way. It’s called communication and I’ve been studying up on it.”</p><p>She sighed, her curious fingers roaming beneath his shirt and touching his stomach. “I hate that it took a war to bring us back together.”</p><p>“I love being here with you.” He wrapped his arms around her, squeezing her tight. “I love you Sage.”</p><p>This time when she kissed him, he didn’t stop her. He kissed her back, hungry and eager for the taste of her.</p><p>Time seemed to slow as he undressed Sage. He lowered her to the floor, in front of the fireplace, where her capable hands had started a fire. Staring at the lovely vision as firelight played on her perfect skin, he debated where to start first. His memories of this afternoon not even doing justice to the body laying before him, all lush curves. Everything about her was sexy and feminine, from her tiny hoop earrings to her red and green toe nails.</p><p>Now this was a homecoming every hot-blooded man should have with his wife.</p><p>“You have on too many clothes,” she complained, her nipples tightening to hard peaks that begged for his mouth.</p><p>Leaning over her, he licked one and blew on it. “Better this way. Gives me time to have some fun. Studying what you like and what makes you hot.” Her nipple tightened even more and he gave a low laugh. “You still like being talked to during sex.”</p><p>“It’s an acquired taste since you’d never shut up,” she said on a squeal. “I can’t believe you just bit me there!”</p><p>Stroking the side of her firm breast, he traced a lazy path down her body and stopped right where the thin strip of curls began. “How much do you want to bet that you liked me biting you there ?”</p><p>“You are so—” His fingers parted her and she bucked her hips. “So not fair,” she gasped.</p><p>Touching her with the tip of one finger, he found her sleek and hot. “And you are so damn wet.” He slid two fingers inside of her, briefly closing his eyes as her tight inner muscles clenched. “In exactly five minutes, I going to put my cock right here and make you scream.” Curling his fingers inside of her, Sage let out a moan. “Then I’m going to come inside of you, marking you.” His dick pressed hard against his fly. If he didn’t watch it, all of his talking would turn five minutes into five seconds. “But first, I need to do things right by you.”</p><p>Lowering his mouth, he tongued her clit and teased the delicate folds that were open to him. All hot pink and wet and tasting like heaven. He feasted on her, until all he could taste, see and breathe was Sage. Until she was wild and pulling at his head while moaning his name.</p><p>Unable to take much more, he tugged off his shirt and shucked off his jeans and boxer briefs, before settling himself between her thighs. Placing his elbows on either side of her, he cupped her face and kissed her with a gentleness that he did not remotely feel. “I have to ask. Are you on the pill?”</p><p>Her legs parted and she coasted her hands down his back as she answered, “Yes and I’ve been faithful to you, too.”</p><p>He didn’t deserve her, not for one damn second. Not for the way he’d left her behind. But he would take her forgiveness, her apologies and work on making the next sixty years worth taking another chance on him.</p><p>One of her hands guided his erection to her sex. He sealed his mouth over hers, plunging his tongue and cock inside of her. Her body jumped, hands clenching at his back and her tight warmth surrounding him. She felt beyond wonderful, beyond anything. Being inside of her with nothing between them was a first for him. Hell, being inside of anyone without a condom was a first for him.</p><p>Rolling his hips, he kissed and held her close. He whispered to her in Spanish and English all the reasons why he loved her. He wanted, he craved to do the right thing, to speak of love and the future, but the more he thrust inside of her, the less he thought and the more he felt. The more he concentrated on her breathy sighs and sexy moans.</p><p>She didn’t have to say a word when she talked like that.</p><p>“Just like that, baby. Move your hips.” He kissed her jaw. “I feel you tightening around me and you’re so fucking wet.” Sinking deep inside of her, he pulled a thigh over his arm. “Know you like this. I know how you like your legs on my shoulders and me pounding that sweet—” He groaned as her ankle hit his shoulder, opening her up to him in the most amazing of ways.</p><p>“I can’t take much more,” she moaned. “Please...I need you.”</p><p>Reaching between them, he found her clitoris, pressing down and rubbing it firmly. She screamed his name. He joined her, driving deep and hard until he saw stars and shouted her name.</p><p>Sweat trickled down his back as he lowered himself beside her and enveloped her in his arms. He kissed her nose and watched as her eyes drifted shut. Then he did the same, thinking he could die a happy man right about now.</p><p>Chapter Ten</p><p>Over the next six days, Sage existed in her very own happy bubble. Not even a snowstorm could pop it. Oh no, being snowed in with Joaquin was pure joy, consisting of hot showers, making love in every room in the house—including the kitchen table—and decorating their tree.</p><p>Their tree.</p><p>She smiled dreamily out the window, watching as Joaquin gathered more firewood from the woodpile outside. Suddenly, he turned her way and gestured for her to join him. Dressing as quickly as possible, she ran outside and jumped into his waiting arms. He spun her around until she threw back her head and smiled up at the sky.</p><p>“Wanna build a snowman?” he asked, setting her on her feet.</p><p>“How about a snow family?”</p><p>“Husband and wife?”</p><p>“Maybe a baby or two.”</p><p>“Or three or four.”</p><p>“No way!” Scooping up some snow, she threw it at him, hitting him squarely in the chest. “I’ll be fat and tired.”</p><p>Brushing off the snow, he flicked some back at her. “You’ll be beautiful. And I plan on helping with the kids.”</p><p>“I know.”</p><p>They worked together to make a snow family, complete with two kids and a snow dog.</p><p>“You can’t put the carrot there,” Sage said, pulling the carrot out of the bottom of the snowman and placing it on the face.</p><p>“But how will people know he’s the guy?”</p><p>“I think they’ll figure it out.”</p><p>Wrapping a scarf around the snow toddler, he asked, “How would you feel about my parents coming over tomorrow? I asked them to spend Christmas Day with us.”</p><p>“You did?” Usually she spent Christmas Eve and Day at her parents. In fact she had planned on Gage spending it with them, but now she didn’t want to spend Christmas with her parents. Heck, her dad had called two days ago to check on her, since Virginia had told him Sage hadn’t been herself since that Morales boy had gotten back.</p><p>It had been all Sage could do to not give her dad the real story. Instead she’d asked how Virginia was doing and if Charles was going to fry a turkey this year. They avoided the big question of whether or not Joaquin would be welcome at their house.</p><p>Sage still felt like a coward for not bringing it up.</p><p>“Guess I should have talked to you first, but—”</p><p>“No! Your parents are more than welcome to come over. Just...I usually spend Christmas at my parents, and this year”—She shrugged.—“I’m all up in the air with my plans.”</p><p>Catching her hand with his, he laced their fingers together as they walked back to the house. Their boots crunched in the snow as they walked. A stiff breeze lifted the hair sticking out of the bottom of her knit hat.</p><p>“Let me take care of dinner tonight. I’ll grill some steaks. You know, manly stuff involving fire.”</p><p>“Have at it. While you do that I’ll finish decorating Christmas cookies and wrapping presents.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A blast of warm air greeted them as they walked in the side door. Kicking off their boots and hanging up the coats, scarves and hats, they made their way to the fireplace.</p><p>“Crazy weather, huh?”</p><p>Joaquin rolled his shoulders and sliced his gaze to her. “Have we already come to this: Boring weather talk?”</p> <p>“Yeah, cause it snows all of the time in eastern North Carolina.”</p><p>“Maybe the Hollands put a spell on the weather,” he said with a grin.</p><p>“Maybe one Holland in particular is finally going to get her happily ever after for Christmas.” Sage sighed and held out her hands, wiggling them. “Rose certainly deserves it, after all the trouble she goes to helping everyone else.”</p><p>“Who’s the lucky guy?”</p><p>“Not anyone you would know.” Sage grinned at him. “He’s hot, charming, blonde, and has an English accent. Something every American girl loves.”</p> <p>“It’s a good thing that you like tall, dark and Cuban then,” his voice deepened as he turned her to face him, his hands on her hips. “And I know what my Southern accent does for you.”</p><p>Lifting her chin, she stood on her toes. “Don’t be jealous.”</p><p>His hands moved up her body, following the curves of her waist to cup her breasts, thumbs rubbing the tips of her them through her shirt until her nipples tightened. “Show me why I shouldn’t be.”</p><p>Taking one of his hands, she led him to the chair by the window. She slid off her glasses and placed it on the windowsill. “Take off your clothes.”</p><p>“Giving orders to a Lieutenant in the Army, Mrs. Morales?”</p><p>“Former Lieutenant, Mr. Morales. Now strip.”</p> <p>“Yes ma’am.” Grinning big, he took of his pants, socks, and blue thermal shirt.</p><p>“Where’s my salute?” she asked before pulling her sweater over her head. Her jeans and panties hit the floor next.</p><p>He nodded at his erection. “I’m standing at attention right now.”</p><p>As she bent down to tug off her non-cooperating socks, she nipped the head and stood up. “That you are.”</p><p>Suddenly, Joaquin whirled her around and bent her over the side of the chair. “I know you were trying to teach me something, but I’m no good at learning when all I can see is naked breasts.” He parted her, finding her shamelessly wet. “So I’ll show you why some pansy-ass foreigner will never be a threat to me.”</p><p>He drove into her with a hard thrust, his hands coming around to massage her breasts and tease her nipples. She gasped and shoved back against him, wanting him deeper. Wanting him to never leave her again.</p><p>She moaned her approval of his methods.</p><p>“I can’t believe you’re letting do this, right here in front of the window where anyone could see you.” He kissed her back and bit her shoulder.</p> <p>“There aren’t...many people on the road...today.”</p><p>“Then who’s that coming up your driveway?”</p><p>She heard the unmistakable and slightly muted sound of a car engine and tires crunching gravel.“What?” She tried to rise, but he placed a large hand on back and pushed her down, then smacked her butt. She shot him a dirty look over her shoulder.</p><p>“Ah, ah, ah. You wanted to make me jealous. Mission accomplished, baby.”</p><p>Closing her eyes, she felt her cheeks flush. “Okay, okay. I’m sorry. Can we stop?” Yet even as she said those words, she arched her hips to take him deeper.</p><p>“You don’t want to stop, baby.” He slid halfway out of her and coasted a hand around her thigh, finding her swollen clit. Brushing it lightly, he resumed his pace, keeping her on edge. A knock sounded on the door. “Should I tell them to come in?”</p><p>“No!”</p><p>“Are your eyes closed?”</p><p>“Yes.” She had squeezed them shut at the first knock.</p><p>“Good.” He lifted her to a semi-standing position, his forearm across her chest, the pace of his thrusts maddeningly slow and steady.</p><p>Another knock on the door had her face heating.</p><p>“Now that’s what I call persistent.” Once more, Joaquin teased her swollen flesh and she moaned.</p><p>“Peeking in your windows is going to give Hank Cutter quite a show.” He nibbled on her ear and adjusted her position. Sunlight hit her eyelids and she knew they were in full view of the bay window. “He’s watching us now. Watching me touch your breasts and between your thighs.” Joaquin’s hands roamed her body doing everything he described to her in detail. “Jesus, Sage, you just got wetter. Put one of your arms around my neck.”</p><p>Lifting an arm, she placed them behind his neck and he gripped her hips. “Oh God.”</p><p>“Touch yourself. Show me...him, how beautiful you are when you come.” Of its own accord, her free hand slipped down to do just that. “Oh fuck...Sage,” he groaned as she orgasmed. As she shook and cried out her release.</p><p>He pushed her down and over the side of the chair again, pounding into her so hard that she gripped the other side and chanted his name. One last hard thrust and he cursed in English and Spanish, then rested on top of her. Their skin was slick between them. Against her back she could feel his heart beat in time with hers.</p><p>“You okay?”</p><p>“Yes.”</p><p>“Good. All’s clear now.”</p><p>Her eyes flew open as she stood. Joaquin slid her glasses into place and stepped back. She gasped. There was no one at the window or even a car in her driveway. Mouth gaping and heart beating frantically she said, “I thought—”</p><p>“He knocked on the door and took off.”</p><p>“Why you—”</p><p>A wicked grin kicked up the corners of his sexy mouth. “Do you really think I’d let anyone watch us? Especially that horn-dog Hank Cutter. Back in the day, he couldn’t stop talking about you in the locker room. Dumbass tried to tell everyone you’d been screwing him in his brand new truck. He hasn’t changed one bit. According to Roberto, Hank’s been going around and saying that y’all are becoming...how did he put it—oh yeah, reacquainted.”</p><p>“Seriously?” This was the man her mother had been trying to push on her and their family business? “I guess you found out the truth when we had sex the first time. Although now you’ll just have to take my word that Hank and I haven’t been getting reacquainted.”</p><p>“And I guess Hank couldn’t see out of one eye for days after he said that shit in high school. Coach hadn’t been too happy about his star pitcher not being able to throw the ball right.”</p><p>“You did that for me? Before we were together?” Her heart swelled. She loved him so much, but she couldn’t make bring herself the words.</p><p>“Real men don’t need to brag.” Joaquin pulled his shirt over his head and snapped his jeans. “I believed you when you said you’d been faithful. No need to defend yourself to me.”</p><p>“As for the other, I’m honored as hell I was your first, but it wouldn’t have mattered if I wasn’t,” he added, tugging her closer. “I was in love and I’m still in love.”</p><p>She hugged him tight, not letting go even as the phone rang. She should just woman-up and admit that she loved him. “Joaquin, I—”</p><p>The answering machine kicked on, her mother’s voice ringing loud and clear. “Sage, this is your momma. We’ll be eating at two tomorrow, on account that your Uncle Joe will be joining us. You can sign the divorce papers while you’re here and he’ll file first thing Tuesday morning.”</p><p>Sage began to shake as Joaquin stiffen in her arms. Then his stance relaxed and he began to stroke her back.</p><p>“I hope you’ve gotten that boy out of your system and come to your senses, Sage Charles Caswell. Cold feet are not what a Caswell is about.” Virginia’s voice sweetened to honey. “See you tomorrow at two, sugar. Unless you’ve decided to betray your family and stay married to him.” The answering machine clicked off.</p><p>“Still going for the drama, I see,” Joaquin said, his hands still gliding up and down her back soothingly.</p><p>“I’m not signing those papers. I didn’t hire Uncle Joe. She did.”</p><p>“When I first got here you told me that we—”</p><p>“I had planned on divorcing you...so I could be with Gage.” Unbidden, tears slipped down her cheeks. “I’d hired a local guy to re-file the papers. All I had to do was sign, but I couldn’t.”</p><p>“Why?”</p><p>She shook her head. “Because I had to know that Gage was worth it, in person and not just in his letters. That what I would be giving up, my last tie to you, didn’t mean anything to me anymore. I thought it didn’t, but your last couple of letters were different. It was like you were trying to get me to figure it out. Then Roberto just happened to mention that one of the guys in your unit took home a dog named Gage with him,” she said, her voice cracking with emotion. “I tore up the papers and told Sam Vance I didn’t need his services anymore. You were coming home to me, you were safe and alive and-and I couldn’t not give us another chance. Then I saw you at the parade...I was so angry and confused and—”</p><p>Lifting her chin with the crook of his finger, he smiled down at her. “Stop beating yourself up. We’re done with that part of our life. You saved my ass in Afghanistan, with your letters, and with that fugly bear I won for you. Guys kept calling me Huggy Bear when they found it.”</p><p>“I wouldn’t have sent that to anyone but you.”</p><p>“It doesn’t matter. What matters the most is that we’re together. But—”</p><p>“But what?” Cold dread sliced through her happiness.</p><p>“I’m not going to stop you or give you a hard time for going to spend Christmas Day with your parents. They’re family, my family too.” He let go of her, walked to the kitchen counter and grabbed the phone. Holding it out, he said, “Call them and say you’ll be there for Christmas. I’ll spend it with my parents. I’m not going to make you choose between us.”</p><p>Hand trembling, she took the phone. “Let me shower and change first.”</p><p>Joaquin took a deep breath as she punched in the number on the phone. This was it. His last Plan. He’d had so many in the past week that by now he was probably up to letter X.</p><p>Though he meant what he’d said to Sage, a small part of him wanted to be chosen over them. She picked them over him before, always the good daughter, dutiful and loyal to her parents. So easily made to feel guilty about the smallest of things.</p><p>God he nearly hated them right now.</p><p>“Momma,” Sage said, breaking though his thoughts. “No...No! Let me speak, then you say what you want or hang up.”</p><p>Raising his brows, he leaned against the wall and crossed his arms over his chest.</p><p>“Number one: I’m not signing any papers. So you can tell Uncle Joe to put them through the shredder in Daddy’s office. Number Two and most important: I’d be happy to come over on Christmas Day with my husband. We’re a package deal.”</p><p>Astounded, he had to make himself stay right where he was and not take the phone from her, throw it across the room and march her into their bedroom.</p><p>He watched as his wife’s lower lip trembled and her shoulder shook. “I’m sorry you feel that way, but...” Suddenly, Sage’s eyes flashed. “Stop it. I refuse to be a part of your drama.”</p><p>Would it be too much to start clapping for Sage? He winked at her in encouragement.</p><p>“However, if you and Daddy would like to come over to our house tomorrow, y’all are more than welcome.” Then Sage hung up the phone and gave him a shaky smile.</p><p>He went to her then, arms wide open. She snuggled right up against him, her slender arms holding on tight. “Proud of you, baby.”</p><p>“That’s the first time I’ve ever fussed at my momma.”</p><p>“You did good.” Actually, she was spectacular, but didn’t think she’d want him crowing over her putting Virginia in her place. “Ready to make some of our own Christmas memories?”</p><p>“I think we’re off to a pretty good start.”</p><p>He nuzzled her hair. “You know when I was in the ‘Stan, I saw a falling star one night, then about a dozen more right after it. One of the prettiest things I’d ever seen in my life.”</p><p>“Did you make lots of wishes?”</p><p>“Only one.” He dipped his head, his lips inches from hers.</p><p>“Did it come true?”</p><p>“We’ll see in a minute.” Smiling, he fished her engagement ring out of his pocket and slipped on her finger.</p><p>“I’m never taking this off again.” She smiled at him, her lips trembling. “I love you, Joaquin, with everything inside of me.”</p><p>His heart felt near to bursting right about now. Words he’d longed to hear from her, in person, had finally been said and she meant it. He blew out a steadying breath. “Looks like my wish came true.” He captured her mouth with his and kissed her.</p><p>Epilogue</p><p>Christmas Day, One Year Later</p><p>“We’re under the mistletoe,” Joaquin said to his wife as she passed him in the living room. He grabbed her, rubbing a hand over her belly and bending to press a kiss to it. A swift kick had him stumbling back and laughing.</p><p>“I don’t think he’s too happy with you getting in the way of his dinner,” Sage laughed.</p><p>“A Morales though and through,” Juan said, raising his glass.</p><p>Joaquin shook his head. “I think she is happy to hear her daddy.”</p><p>After the first miracle Joaquin had received, he hadn’t expected to be blessed with more. But last year, after a bittersweet Christmas due to Sage’s parents not joining them, Charles had shown up on New Year’s Eve, with Virginia and an apology. Since then, some things had remained the same, while others had gotten better. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“While I don’t understand why you wouldn’t want to know the sex,” Virginia said with a sniff. “The nursery needs to be finished and—”</p><p>“Oh I agree, Virginia,” Mariela said, placing a hand on the other woman’s. “These two want it to be a surprise. How much more surprised can you get?”</p><p>Sage’s best friend, Mandy, waddled around the room, stopping by her husband and giving him a kiss on the cheek. “Try finding out you’re having twins.”</p> <p>“Kevin almost fainted, you said.” Sage winked at Mandy and her husband.</p><p>Kevin grinned like a happy fool and shook his head. Joaquin recognized that smile, because he sported it himself twenty-four hours a day, seven days a week.</p><p>“Have y’all picked out any names?” Charles asked, grabbing a gingerbread man from the tray on the table. “My grandfather—”</p><p>“Not this again,” Juan said with a roll of his eyes. “The baby will be named after—”</p><p>“Matthew, after both great-grandfathers,” Sage said with a smile.</p> <p>“It will be Mateo when he is with me,” Juan muttered, then his eyes widened. “It’s a boy?”</p><p>Joaquin put his arms around Sage as their parents and friends rushed to them, hugging and laughing.</p><p>“Finally, this stupid feud can be put to rest,” Mariela said, wiping her eyes.</p><p>“Because joining our businesses together wasn’t enough?” Joaquin asked. It had been his idea to merge. Both companies had what the other wanted. Except his dad had room to spare while Charles’ dealership was slowly being zoned into residential and small shops, with the city’s downtown revitalization plan that it didn’t fit in.</p><p>Charles gave Joaquin a hearty clap on the back. “That’s why you’re in charge, son.”</p><p>Sage snorted. “So why do you and Juan keep going to the office?”</p> <p>“Someone has to make sure he doesn’t run us into the ground,” Juan said and Charles nodded.</p><p>“Give my son-in-law some credit,” Virginia suddenly said, shocking everyone into silence. “What...a zebra can change its stripes. Besides, it’s all about tiger prints this year.”</p><p>Joaquin grabbed Sage’s hand and led her to the nursery. Soft yellows, greens and blues greeted them. A crib made of natural wood still in its box sat in the corner.</p><p>“One more month, and then it’s not just us,” Sage said, her red hair brushing his shoulder as she passed by him. She picked up a stuffed giraffe and tossed it to him.</p><p>He shrugged. “I was getting kinda of tired talking to you anyway. We need some excitement around here.”</p><p>Rolling her eyes, she moved to him and kissed his cheek. “Merry Christmas, Mr. Morales.”</p><p>“Merry Christmas, Mrs. Morales.” </p> </body></html>"]