["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>“Easy, Red. Fuck yes, baby, there we go, take it all.” Red, or Kimberly Madison, lay back on the walnut table, her hands tied to the straps attached to the sides of it, her legs elevated by Sax as he slowly fed his cock up her tight, well-lubricated ass.</p><p>Her head thrashed on the hard surface; beads of perspiration dotted her face, her full luscious breasts and peaked nipples. It ran in rivulets down her waist, a small amount pooled in the tiny indention of her bellybutton and her thighs glistened with it and the added mixture of thick juice that accumulated from her bare, flushed pussy.</p><p>Sax had her thighs spread wide, bracing them with his muscular arms as he slowly fucked the petite little redhead while she screamed and bucked against him, begging for release. It was a sight Jared Raddington was certain would be burned in his mind forever.</p> <p>He hadn’t expected this when he accepted membership with The Club, and he sure as hell hadn’t expected it when he left the Madison estate, furious that Kimberly had left before his arrival. She had been making a habit of it in the past six months, disappearing just before he arrived.</p><p>Why he had taken such an overwhelming interest in her, he wasn’t certain. She wasn’t the type of woman who normally attracted him. She was smaller, barely five four to his six two. She was rounded rather than model slim with full breasts, lush hips and a delightfully rounded little tummy. He could imagine the pale curve of her stomach decorated with a jeweled belly ring, perhaps emeralds to match her beautiful green eyes. And above all else, he could see her in his bed, his dick tunneling up her ass rather than Sax’s, his hand spanking the soft curve of her buttocks, her voice screaming his name rather than the other man’s.</p><p>Long, fiery red curls fell over the side of the table, strands of thick silk that would have caressed her hips but brushed the floor instead. Hair that dared a man to touch, stroke.</p><p>“Please, Sax,” she screamed as she fought the bonds. “Let me go. I can’t come like this. Please.”</p><p>Dark male flesh glistened with sweat as the hard thrusts increased, the bronzed length of his cock powered up the snug little channel in driving strokes, parting the exquisite curves of her ass and filling her with every inch of his dark, steel-hard erection.</p> <p>Jared felt every muscle in his body tighten at the primal demand in her voice. She was poised on an agonized peak of need, a peak he wanted to push her over. The sight of another man’s cock up her ass, stretching that little entrance, tormenting her with the pleasure/pain of every thrust was driving him crazy. Would she enjoy a ménage with the same brutal hunger?</p><p>Jared rose from his chair in the secluded corner he had chosen hours ago when he entered The Club. His first night there he wanted to get a feel for the place and the members, but he hadn’t expected the shocking scene that had unfolded.</p><p>Kimberly had walked in as pretty as you please, ordered a drink and stepped over to the tall, dark engineer for Delacourte Electronics. For the first time in the year Jared had known her, she was without makeup, her expression displaying honest, bare emotion, even if it was lust, and the thin veneer of cold haughtiness she presented to the world was gone. This wasn’t the ice princess he had come to know. This woman was wild, fiery hot, a witchy temptation no man could resist.</p><p>“Harder. Please, Sax, please.” She was nearly in tears now, begging for release. She strained against the bonds that held her, her hips writhing against the hard penetration of a thick dick tunneling up her ass in increasing strokes.</p><p>Her clit was swollen, peeking desperately above the folds of flesh that protected it, the little knot of nerves red and glistening in hunger.</p><p>“What’s with her?” Jared finally questioned one of the other members sitting close to him.</p> <p>He thought he knew her, had thought that seducing her into his hungers would take time and finessing. He had been wrong. But he suspected that the woman he was seeing now wasn’t the total picture of who and what Kimberly was, either.</p><p>“Red?” Lucian Conover’s voice softened as he glanced at the scene. There seemed to be an odd note of affection in his voice, distant, sympathetic. “Too much stress usually. She shows up about every three months, usually after the forced physical to prove she’s still a virgin, and lets off some steam. She’s a good kid.”</p><p>Kid? She was twenty-four years old and screaming now for release, begging another man to fuck her ass harder, deeper. If it went much deeper, she’d be giving the bastard a head job as it came up her throat. She was tiny, barely five four, delicate and as fragile as a fairytale princess. Or so he had thought. No fragile princess could take a cock up her ass like that and beg for more.</p><p>“Forced exam?” he finally found his tongue long enough to ask.</p><p>Conover grimaced. “That’s Senator Madison’s daughter. Her mother’s will stipulated that she had to be a virgin on her wedding night to collect whatever the hell her inheritance was. Evidently Daddy dearest wants it,” he sneered. “He had a judge order the quarterly exams to prove she was still eligible to inherit upon her wedding, whenever that may be. Should she fail the test, the good ole Senator collects it all.”</p><p>Jared clenched his teeth at the information. He knew Madison was a bastard, but even this was more than he had expected from the man. The tension in the Madison household was always elevated when Kimberly was there. She had rarely spoken more than a few words in his presence, and was more often than not arriving late and leaving early to whatever function she showed up for. Why his mother had married the bastard he still hadn’t figured out. And though he knew about the exams, he hadn’t been entirely clear on why.</p><p>“Damn you, Sax,” she screamed. “I can’t stand this.”</p><p>Jared barely controlled his own flinch. Her voice echoed with a dark hunger that he knew the other man would never quench.</p> <p>She was being tortured with her own sexuality. He could hear the dark cravings in her voice, the carnality that made his loins tighten with his own hunger.</p><p>“She needs clitoral stimulation,” Lucian told him, his voice low. “Sax will have to delay it until he gets her to the point that he can get her off easily. The only members here today, besides him, are married.” There was a thread of amusement in his voice. “Except you.”</p><p>The Club wasn’t a brothel. It was just as the name implied, an atmosphere where men whose base desires went deeper than most. The married men there had never been known to touch another woman, but the unmarried men were often thirds in occasional ménages with the other men’s wives. They were drawn together because of their need to dominate their women’s sexuality, to bring them the ultimate release, the ultimate pleasures. It was a men’s club, but one created as a support base for those whose desires often crossed the line of acceptable depravity.</p><p>It wasn’t a swinger’s club. The married members of The Club, so far, had no desire for any women other than their wives. Fidelity was one of the cornerstones behind The Club’s existence. Just as female pleasure was.</p><p>Jared stared back at Kimberly then. She was bucking, begging, as Sax fought his own release.</p><p>“What does she need?” he asked then, knowing he was damning himself.</p><p>“Not much.” Lucian shrugged. “Smack her pussy a little and she’ll come like the Fourth of July. After that, she’ll have a drink, play a few hands of cards and take a room for the night to sleep.”</p><p>That might have been what she usually did. Tonight though, her schedule was about to change. He would slap that pretty little pussy, for now. But his cock was raging for more. Soon he would fuck it just as hard.</p><p>As he crossed the room, Sax looked up; the strain of holding back was clearly reflected on his dark face.</p><p>“Help her,” he panted. “Fuck, I’m not going to last.”</p><p>The other man was panting, so close to his own release that his expression looked pained. Between Kimberly’s thighs his dick powered hard and thick inside her. Thankfully, it was condom-sheathed. Jared was honest enough with himself to admit that he didn’t want another man’s seed inside her body, anywhere. Not yet. Not until he decided who would be the third in the relationship he was determined to build with her.</p><p>“No. No. Don’t stop yet. Please...” Her voice trailed off as Jared rounded the table.</p><p>Her eyes widened, her face paled then hard, violent shudders began to rack her body as she suddenly exploded, Jared’s name a keening cry on her lips as Sax suddenly thrust inside her hard and heavy, before pausing, his expression twisting with his own release.</p><p>Jared leaned close, one large hand framing her face as she gasped for breath. He could smell the scent of her lust, wild, sweet and subtle, making him long to get closer, to taste every spicy drop of her need. And he would. Soon.</p><p>“Next dick up your ass will be mine,” he swore forcefully. “No more, Kimber, not without me. Never again...”</p><p>Chapter Two</p><p>A rare, unknown rage gripped Jared as he released Kimberly from the wrist restraints and pulled her quickly from the table. He managed to stay silent, just barely, by clenching his teeth and jerking her robe from a nearby table.</p><p>She was pushing him though. Before he could wrap it around her shoulders, she jerked it from his hands and shrugged it on with deliberate provocation. A slow, teasing move that made him want to growl with the need rising like a hungry beast in his loins.</p><p>“Well, well, well, and here I thought the saying ‘farmers like it dirty’ was just an old wives’ tale,” she said with cool mockery. “Shame on you, Jared. Just think how disappointed Daddy will be.”</p><p>He was aware of the silence of the room, the eyes that watched them. Under different circumstances, he really wouldn’t have given a damn, but this wasn’t sexual. To be honest, he felt like turning her over his knee and paddling her ass in a way that had nothing to do with pleasure, and everything to do with asserting his control over her.</p><p>“Considering my daddy helped found this little home away from home, I can’t say he would be disappointed,” he quipped as her eyes widened in surprise. “But I doubt yours would feel the same.”</p><p>Her eyes narrowed then, the dark green color sparkling with a surge of anger as he gripped her arm and began to pull her from the room. Reminding her of her father wasn’t guaranteed to garner any points in his favor, but at the moment, he didn’t give a damn. He had played her game for a year now, and it was time to change the rules, as well as the balance of power.</p><p>“I’m not one of your stupid cows,” she snarled as she tried to dig her bare heels in and fight his hold on her. “Let me go, dammit!”</p><p>“Even my stupid cows know better than to argue with the bull in charge, Kimber.” He tightened his fingers around her slender wrist and headed for the stairs. “Keep balking back there and I might show you why they know better.”</p><p>She paused for just a second but seemed to resist a little less until he crossed the threshold to her room and slammed the door behind them. God help him, he was in such a state of arousal it was all he could do to keep from throwing her to the bed and fucking the hell out of her now.</p><p>A fucking year she had danced just out of his reach, her teasing green eyes laughing at his attempts to corner her, her pouty lips curving into a smug “dare you” smile every time he warned her that he wasn’t going to let her escape him forever.</p><p>The smile was gone, the laughter in her eyes was dimmed by the anger, and the freckles across her cheeks and nose were readily apparent beneath the pale flesh of her face.</p><p>“You have no right to drag me around like that.” She faced him with her hair falling in disarray down her back, the spiral curls tempting his fingers to clench in them, to drag her to him...</p><p>Wrong direction, he chastised himself. Thoughts like that would get him zero answers and likely end up hurting his cause right now, more than helping it.</p><p>“I took the right,” he growled, crossing his arms over his chest to keep from touching her. “Like I should have taken a year ago.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her upper lip lifted in a silent snarl that had his cock reacting with a fierce throb of hunger. She had kept him so damned hot over the past months that the hard-on was almost constant.</p><p>“Oh, get over yourself, Jared.” She waved a hand negligently before tightening the belt of her robe with a controlled jerk. “The he-man attitude is long out of style. Didn’t you know that?”</p><p>He could see the anger trembling through her body though, the glow of it in her eyes. Just as he could see the hard little nipples beneath the silk of their covering and the flush of arousal on her face. She might be pissed, he had no doubt, but she couldn’t hide the lust now, either.</p><p>“That never goes out of style, Kimber,” he reminded her with deceptive gentleness. “Otherwise, sweet little ladies like yourself would have no place to let off all that steam.”</p><p>He locked the door slowly, watching her carefully as it clicked securely into place. The pulse beat with sudden, renewed speed in the side of her neck, as her pupils dilated just enough to assure him that she wasn’t unaffected. She wasn’t frightened in the least; he could see that in the sudden, stubborn set of her chin. She was excited though. Her breasts were rising and falling at a faster rate, her face flushing a soft, delicate blush that entranced him.</p><p>Damn if she wasn’t pretty as hell. Not really beautiful, but damned pretty with her pert little nose, slanted cat’s eyes and all that glorious red-gold hair falling around her shoulders. She faced him like a little enraged goddess, certain of her own power and her determination.</p><p>“My ‘steam’ as you call it, is my business,” she reminded him with an attempt at her past icy hauteur. “I don’t need your interference.”</p><p>Of course she didn’t. From what he had seen downstairs, he was a weakness she was determined to keep to herself. But he had seen the heat, the hunger—hell, the lust that glowed in those brilliant green eyes when he caught her unaware, fighting for her release. He had been the trigger. The hunger had been for him. The need whipping through her body had been for him.</p><p>Jared wasn’t untutored in either the ways of lust, or of women. He had known since their first meeting a year before that Kimber was different, special. At least to him. She had drawn him as no other woman had, despite her shield of aloof disinterest; he had known something was there. He was certain of it now.</p><p>“You needed my interference downstairs,” he pointed out as he pushed his hands into his pants pockets.</p><p>His palms were itching with the need to touch her, to pull her against him and taste the silky texture of her skin. The desire was raging through his blood, tensing his body and reminding him just how long it had been since he had taken any other woman. The need for this one had surpassed even the interest in taking another.</p><p>“You surprised me.” She shrugged in an attempt to hide her earlier reaction. “It turned me on. We are after all, family.”</p><p>She cast him a wicked, mocking look tinged with a bitterness that ate at his soul. He wanted to wrap her in his arms. Wanted to shield her from the pain he could see in her eyes. The sudden urge to protect her, rather than fuck her, was overwhelming.</p><p>Jared snorted. “Be damned glad we’re not family, Kimber,” he warned her. “Because if we were, I’d be breaking more than one damned rule before this night’s over.”</p><p>Something flashed in her eyes then. Regret? Pain? It was so fleeting he couldn’t quite pinpoint the cause of it.</p><p>“You won’t be breaking any rules, Jared.” Her voice firmed, the edge of steel that always dared him to see how far he could make her bend, echoing in her voice. “Whatever thrill you got downstairs will be all you get from me.”</p><p>There was the pain. It was almost hidden, nearly overshadowed by the cold edge of purpose. She wasn’t willing to give an inch. Jared smiled with slow, easy confidence. That was okay though, because he had a hell of a lot more than an inch to give to her.</p><p>“Oh, I don’t think so, Kimber.” He advanced on her then, narrowing his eyes as she swallowed tightly and began to back away. “You see, baby, I’ve waited almost twelve full months to figure out exactly where your weaknesses were and how to use them to my own advantage. I found them tonight, and I’ll be damned if I’ll let you run from me now.”</p><p>“Stop, Jared.” Something in her voice had him doing just that. He stopped no more than a foot from her, staring down at her silently. Waiting.</p><p>“This can’t happen,” she told him then, trying to cover the regret in her voice with steely demand. “You have to understand that. What you saw downstairs, that’s all I want. All I need. Whatever you’re offering, I can’t accept, I won’t accept. You don’t have a choice but to let it go. Now.”</p><p>Jared shook his head as his lips tipped mockingly. He stepped to her, backing her into the wall she had retreated against as his hands framed her face. It amazed him, how small and delicate her catlike face was beneath his hands. His fingers slid into the sides of her hair as he held her still before him, the tips relishing the cool, silken texture.</p><p>“There are choices, Kimber,” he told her. “And then, there is determination. You may as well stop fighting, because I won’t let you go now. My name was on your lips when your body bucked in release. I saw the hunger in your eyes and felt it in the shudders that racked your body. You can’t hide from it anymore than I can.”</p> <p>“No.” Her hands gripped his wrists as she stared up at him, her eyes no longer filled with anger, pain or regret, only weariness, and the weariness pierced his heart. “I can’t, Jared. Even if I wanted to, even if what you say is true, I can’t accept it. Because if I do, I lose everything. There is nothing or no one worth the risk I would be taking.”</p><p>Her father. Jared wanted to curse the man for his unjust treatment of his daughter, for the pain, the anger and that damned weariness. But she was going to have to learn that there was more to dreams, more to needs, than the empty satisfaction she was allowing herself.</p><p>“I won’t let you go,” he told her again.</p><p>Before she could respond, he lowered his head, taking her open lips in a kiss that surprised them both. Flames shot through his body at the speed of light, making his muscles draw tight in hunger as his erection threatened to burst the zipper that held it at bay.</p><p>And Kimberly wasn’t unaffected. After her first surprised gasp, her nails bit into his wrists, but her tongue met his with a speed and hunger that had him throttling a savage growl. His fingers threaded into the long curls of her hair, feeling them twine around his hands as he tipped her head back further and began to drink from the passion erupting through her body.</p><p>It was like a narcotic, ambrosia, it was the most sensual, most erotic dance of lips and tongues that he had ever known. They ate each other, both ill-prepared for the sudden fires erupting through the other.</p><p>She could spout her denials until hell froze over, but here, she couldn’t hide. Beneath his lips she couldn’t lie, couldn’t refuse the pleasure that burst through their bodies like a firestorm of the senses. And he wouldn’t let her if she tried.</p><p>Jared forced one hand free of her hair, lowering it to her back and lifting her against him as he pressed her into the wall. Instantly, her knees clasped his hips, a startled cry erupting from her throat as he pressed his cock against the hot, wet pad of her pussy.</p><p>“Feel that,” he snarled against her lips, staring down at her fiercely. “You’re so damned wet you’re soaking my slacks. So hot you burn me alive. And you expect me to take no for an answer?”</p><p>Shocked, drugged with passion, her eyes widened as he ground his erection against her.</p><p>“No.” She swallowed tightly, shaking her head in denial despite the flow of heated liquid that damped his pants. “I can’t, Jared...”</p><p>“Oh, but you will,” he assured her darkly. “I’m warning you now, baby. The next dick that slips up that tight little ass will be mine. The next man to touch you, taste you, hold you, will be me. Only me, Kimber. Until you admit to the fever burning us both alive, no other man will touch you.”</p><p>Her fierce shove against his chest had him stepping back. Reluctantly, he released her, seeing the simmering fury pulsing in her gaze as she faced him now.</p><p>“You do not own me.” She was fighting to even her breathing, to still the desire pulsing hard and hot inside her, as it was him. “I won’t let you dictate to me this way.”</p><p>“Oh won’t you?” he asked her, almost wincing at the dark, rough tone of his voice. “Too late, sweetheart. I know your weakness, and I know your hunger. And Kimber...” he watched her closely now. “I know your secrets. Don’t think for a minute I won’t use every weapon I can find to have you. That would be a mistake you don’t want to make.”</p><p>She drew in a deep, hard breath, the flush of arousal receding as she realized that now, he most likely knew far more than she had ever wanted him to.</p><p>“I’m still a virgin.” She drew herself stiffly erect as a little painted smile of mocking triumph curved her lips. But her eyes were dark with pain. “And unless you’re into rape, you won’t win, Jared. You or Father.”</p><p>The bitterness in her tone tugged at his heart. He could see the suspicions in her eyes, the fear that he was somehow working to aid her father’s triumph. Nothing could be further from the truth.</p><p>“Your father can go straight to hell. And no, Kimber, I’m not into rape,” he finally said gently. “But I will be into you. Sooner or later, one way or another, that I can promise you. You can keep your virginity, but I’ll be damned if you’ll continue to run. Not anymore.”</p><p>He turned away from her, knowing if he didn’t leave now, then he may do something both of them would end up regretting. His control was shakier than he had ever known it to be, his hunger deeper than he could have imagined.</p><p>“Jared, this won’t work,” she warned him again as he opened the bedroom door, pausing in the doorway. “You have to forget what you saw tonight.”</p><p>He turned back to her, smiling with a bit of mockery himself now.</p><p>“Do I, Kimber?” he asked her, his tone musing. “Tell you what, when you can look at me and not let me see the memories in your eyes, then we’ll discuss whether or not I can forget. Then we’ll discuss just how the hell I’m supposed to fucking let you go.”</p><p>Because despite the obstacles he suspected he faced in possessing her, Jared had a feeling he would never manage to push her out of his head now. And if he did manage that, how was he supposed to break the threads weaving around his heart?</p><p>Chapter Three</p><p>“She’s going to make me crazy. A year. I’ve chased the woman for a blasted year and still she’s running from me.”</p><p>Jared pushed his fingers restlessly through his short hair as he paced the length of his mother’s kitchen two days later, uncomfortable under the eagle-eyed scrutiny of his too perceptive mother, Carolyn Raddington Madison.</p><p>He couldn’t get Kimberly out of his head. It was frustrating, aggravating, driving him insane with the liquid heat pulsing through his bloodstream and keeping his cock in a constant state of readiness. But even more was the ache in his arms to hold her. Fuck, he just wanted to hold her close to his heart, to shelter and protect her from the pain he had glimpsed in her shadowed green eyes. He wanted to see laughter there. Wanted to see warmth and passion and naked need, and happiness.</p><p>He couldn’t sleep for the image of her lying across that table, fighting for her orgasm. And he knew, deep in the darkest hours of the night that it wasn’t the orgasm she was reaching for as much as it was a sense of freedom and escape. It was her escape. As extreme as it was, coming to The Club and baring her tempting little ass for a fucking was Kimberly’s way of escaping the pressure, hopelessness and needs that had not as much to do with the sexual, as it did with the emotional. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Really, Jared, as you say, she’s been running for a year. What has you so upset over it now?” Carolyn’s voice was lightly amused and more than a little curious.</p><p>Jared stopped his pacing before turning his head to look at his petite, conservatively dressed mother. Her soft graying brown hair was upswept and held at the back with a silver clasp his father had given her for their tenth anniversary. Around her neck she wore pearls he had bought her for a birthday. She wore a plain wedding band on her left hand; on her right she still wore the simple engagement ring and thicker band she had worn as Judge Victor Raddington’s wife.</p><p>She was still a beautiful woman, one of the most beautiful Jared had ever known. With her pretty features and dark blue eyes, she wasn’t classically beautiful, but there was an air of calm stateliness about her that always comforted him. At least, at most times.</p> <p>“I’m tired of this,” he finally sighed roughly as he turned back to her and paced over to the light oak kitchen table and returned to his seat. “I can’t get her out of my head. I can’t let her keep running like this.”</p><p>She was destroying herself. He had seen that much, had glimpsed the bitter rage that filled her the moment before he kissed her. And that kiss. He breathed in deeply, still affected by the sensations that had swept through him. It was wildfire. It was an explosion of the senses, too intense to fight, too deep to ever let go.</p><p>“And how do you intend to stop her, Jared?” His mother lifted her coffee cup to her lips, but he saw the grin edging her lips. “Kimberly is a grown woman. You can’t force her into a relationship with you. Those days have long since passed, son.”</p><p>She was amused. Hell, had there ever been a time when she hadn’t been amused when he and his father displayed what she called their “male quirkiness”?</p><p>He leaned back in his chair, watching her silently for long moments. She was married to Senator Madison, and though she didn’t appear deliriously happy, she did appear content. The shadows still lingered from her first husband’s death, though. That veil of sadness that he knew would never completely lift.</p> <p>Her relationship with Victor Raddington had been tempestuous, passionate and, he knew, deeply loving. He had been raised in the shelter of their love, and later, after his adult years, in the unspoken knowledge of the fact their sexuality wasn’t what others would consider “normal”.</p><p>His father had helped found The Club. The secretive membership of highly public figures that had created the group had done so out of a need of privacy and protection. A judge, a governor, a vice president hopeful. Their sexuality would have been a smear on their public images.</p><p>“What do you know about this Trust her father’s holding over her head, Mother?” He finally asked the question eating at his mind. There had to be an answer to this, though after his meeting a few hours before with Senator Madison, it wasn’t looking as though it could be answered in his favor.</p><p>Carolyn glanced back at him with some surprise before a glimmer of understanding entered her gaze.</p><p>“She told you about it?” she asked curiously.</p><p>Jared shook his head. “Not in so many words, but this is Washington, you forget—there are few secrets.”</p> <p>She sighed in acknowledgement. “It was established generations ago. It states that she must marry a man her father approves of and that she must be a virgin to inherit Briar Cliff, the estate that has passed down in her mother’s family for generations.” She held her hand up when Jared would have protested. “It’s entirely legal, Jared, I checked this myself. Her father enforces an exam every three months to ensure that she’s fulfilling the terms of the trust. It’s all entirely legal and unbreakable. In five years, the conditions of the Trust will become null and void. If there is no female child, or the female child has lost her virginity and not married with the approval of the father, signed and notated before the Trust lawyers, then Briar Cliff reverts completely to the oldest male heir or to the father. If neither father nor surviving male heir is in existence, then and only then, does it revert to the female child unconditionally. Daniel is determined that she will marry a man who can restrain her passions, not someone who will encourage them.”</p><p>Rage tightened his chest, clenched his jaw as he stared back at her. The bitterness in her gaze, the pain in her voice was beginning to make sense now. He had hoped, hell, prayed that the information he had been given at The Club had been wrong. Though he had suspected it wasn’t.</p><p>“Why did you marry this...” he bit off the words with a snap of his teeth, “...person?”</p><p>A soft smile curved her lips as he covered the more explicit terms he would have used.</p><p>“Really, Jared, my marriage to Daniel has nothing to do with his relationship to his daughter. Though I was unaware of the conflicts between them at the time.” She shook her head as she wrapped her fingers around her cup, staring into the remains of her coffee pensively. “It pains him, the distance between him and Kimberly, but he does what he feels is right. And the terms of the Trust were not his doing. It was done five generations ago by a strict, straight-laced mother who entirely disapproved of what she called the ‘unnatural’ desires of the females of her family. She was determined that her ancestors would comport themselves with all respectability, and she made it stick.”</p><p>Jared breathed in roughly as he began to suspect the obstacles that now stood in the way of possessing the woman his heart seemed attached to.</p><p>“If it pained him, he would do something to right the situation, such as allowing her to marry someone she cares for rather than someone he chooses.” He restrained the fury burning in his gut. “Are you aware he considers me unacceptable as a husband to his daughter?”</p><p>Why he had bothered to approach the Senator that morning he still wasn’t certain. He hadn’t formally stated an intention to marry Kimberly, but he had been curious as to the qualifications the Senator approved.</p> <p>Carolyn’s lips thinned with carefully controlled anger. The news didn’t sit well with her any more than it had with him.</p><p>“I understand why he feels that way,” she surprised him with her statement. “Wait, Jared.” She shook her head when he opened his mouth to argue. “As you said, this is Washington, there are few secrets that aren’t told in glistening detail. The rumors of The Club, the Trojans, and their lifestyle have been prevalent in the past year or so. Your name was linked to it no sooner had you joined. Daniel considers The Club and its members, the epitome of what he’s determined to save his daughter from.”</p><p>Jared rubbed his hand over his face wearily. Some people couldn’t keep their mouths shut if their lives depended on it. In this case, a bitter divorce and a less than sober ex-wife had broken the secret of the exclusive men’s club to a society that soaked up the rumors.</p><p>“His daughter’s sexuality isn’t his business,” he growled.</p><p>“No more than yours is my business,” she pointed out. “Yet, I’ve fielded questions concerning your membership there for several months.”</p><p>There was no censure in her voice, only the acceptance he had always known from her.</p><p>“I’m sorry.” He could only shake his head wearily. “I won’t apologize, I knew the risks.”</p><p>Carolyn sighed deeply. “Tell me, are the rumors concerning Kimberly’s membership there exaggerated, or true?”</p><p>She picked up her cup as though the question wasn’t dropped like a bomb.</p><p>Damn! The leak was worse than he had been warned it was. They were going to have to find the person or persons responsible for it.</p><p>Jared watched her carefully. Anything between them, he had no doubt, would stay between them, but this was Kimberly’s secret to bear, not his.</p><p>“You’re so like your father,” she chuckled then. “I will assume she is, and I will assume that your temper this week is due from learning of it yourself.” She leaned forward somberly then, her blue eyes dark and intent. “Jared, that estate means everything to Kimberly. Everything. Her mother’s last words were a plea for her to stop the cycle that the women of her family have endured for over five generations. If she loses her virginity, her father gains control of the estate, the house, everything that has been passed down, mother to daughter, for so very long now. In each case, the mother was forced to wed a man chosen by her father, one deemed capable of restraining her passions and her sexuality. The cycle is destroying her and, in many ways, Daniel as well.”</p><p>“He can break it,” Jared pointed out, aware that the anger pulsing inside him colored his voice as well. “He’s destroying her.”</p><p>“He believes he’s saving her.”</p><p>“For God’s sake.” He came out of his chair in a surge of energy born of the fury pulsing inside him. “When did we return to the Middle Ages, Mother? She’s a woman, not a child.”</p><p>“Jared, you can’t fight this,” she said softly, regretfully. “I’ve discussed this with Daniel until I’m blue in the face. He won’t relent. It’s the only conflict we’ve had in our marriage in a year now. He believes he’s right. He believes Kimberly should marry a man of restrained passions, one capable of controlling what he considers her ‘wild inclinations’.”</p><p>“He’s a self-righteous prig,” he snapped.</p><p>“Why do you care?” she asked him, frowning now as he paced the room. “I understand your desire for her, Jared, but there have been other women you’ve desired and couldn’t have as well. What makes her different?”</p><p>“She makes me crazy,” he growled, pushing his hands into the pockets of his slacks as he hunched his shoulders against the tension invading them. “She makes me want to throw her over my shoulder like a damned caveman, and at the same time I want to wrap her in cotton and protect her from anything and everyone who could hurt her. I want her happy.”</p><p>His voice, his body, vibrated with that need, with the complete certainty that he could make her happy.</p><p>“And you think marrying her will do that?” she questioned him with a shadow of mockery. “Jared, Daniel will never allow Kimberly to marry a man as sexually intense as you so obviously are. And she’ll lose everything she’s fought for to this point if she accepts you.”</p><p>“She’s mine.” He winced as the words tore from him. “Damn, didn’t that sound arrogant enough?” He laughed with an edge of self-mockery.</p><p>But he couldn’t escape the claim he had just made. As the words came from his lips, the knowledge wrapped around his heart. She was his, even if he couldn’t have her. He had seen the pain in her eyes, the sexuality that tormented her, the ache that shadowed her eyes. And so much more. He saw the need to be touched, to be held, to let go and share the passion, the heat that built within her.</p><p>“Do you love her, Jared?” his mother asked again, her voice firm now, demanding.</p><p>He stared back at her, meeting her gaze with a determination of his own.</p><p>Did he love her? He sighed with weary acceptance. Yeah, he loved her, more than he had thought it possible to love a woman.</p><p>“More than you know,” he finally said, his own need echoing through his body. “More than you could ever know, Mother.”</p><p>For a moment compassion filled her eyes. She had waited years for him to find the one woman he felt he could spend the rest of his life with, and settle down into a relationship that fulfilled him, as much as her marriage to his father had fulfilled her.</p><p>“Then you have a choice to make,” she said gently. “All her life Kimberly has been forced to choose, and always it’s been a choice that’s ripped another wound in her soul. Can you ask her to add your heart and your needs to her burden?”</p><p>He stared back at her, restraining the fury erupting inside him. Swallowing tightly, he shook his head with a rough, negative movement. He couldn’t force her to make such a choice, and they both knew it. But he didn’t know if he could force himself to let her go, either. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Carl Stanton had a lot to pay for. It had been the nasty divorce with his wife that had spurred the first of the rumors. Kia Stanton had wanted out of that marriage, and when Carl had refused, she had let the first rumor free. But Kia was no longer associated with the membership there, so how had the rumors of his and Kimberly’s membership leaked out? Even more worrisome though, was the threat that his father’s previous association would be revealed as well.</p><p>“Does Madison know about Father’s connection to The Club?” he asked her then. “Is this causing you problems?”</p><p>He would kill the bastard if he had dared to abuse the petite, fragile woman that Jared knew his mother was.</p> <p>She smiled mirthlessly. “You forget Jared; this is a marriage of convenience. But as far as I know, Daniel hasn’t heard any rumors he shouldn’t have. But if he did, it would serve him no good. He can’t harm me with it. But that isn’t the point. What will you do now?”</p><p>What else could he do?</p><p>“Let her go,” he whispered bitterly. “The only thing I can do.”</p><p>Chapter Four</p><p>She could have been a spy, Kimberly thought, but the additional training didn’t go hand in hand with enforced chastity. There was always modeling, but Kimberly always thought that doing without pizza and losing that extra fifteen pounds that tormented her would have just been too painful. And being a rich man’s mistress was just out of the question; there was only so much shopping one could do before it became rather boring. Besides, just like being a spy, it would require the loss of her virginity. Everything else was just boring, so she joined the Police Academy instead, going from there to several security agencies that specialized in protection.</p> <p>The work wasn’t really abnormally dangerous, and she got to wear a gun. She liked that part. Especially when the assignments required her to be in close proximity to arrogant men with more testosterone than good sense. Those assignments were few and far between thankfully, but occasionally they reared their ugly heads. Then there were those assignments that just sucked. The ones that she knew were going to test her patience and her training. This was one of them.</p><p>She stared back at her boss and one of her dearest friends, dumbfounded, restraining her disbelieving laughter. This one was just too bizarre to be real.</p><p>“Could you repeat that?” she asked carefully, certain she had to have heard wrong.</p><p>Richard Decker’s thick gray brows snapped into an instant frown.</p><p>“You heard me, Kimberly,” he said with careful emphasis. “You will be assigned to Raddington’s team, despite the alert that your welfare could be on the line as well. You will stick close to Raddington, and the team will surround you for the duration of time it takes to ascertain if the threat is real or imagined. You’ll head out to the Raddington Farm tonight, and you will stay there until this assignment is over.”</p><p>Kimberly stood stiffly before him, breathing in carefully through her nose as she gritted her teeth with the effort it took to restrain her sarcastic reply. This was a farce if she had ever heard of one. How in the hell had it happened?</p> <p>“Richard, I don’t believe this is a good idea...”</p><p>“It isn’t your place to make that determination,” he said coolly. “The order has come down from the Capitol itself. There is no other option.”</p><p>Another deep breath. Deep breaths, she reminded herself. She could control the explosion building at the top of her head; all she had to do was breathe. At least, that’s what that arrogant, soft-spoken martial arts expert had told her.</p><p>“Then I’ll resign.” It wasn’t a threat. It wouldn’t be the first time she had resigned from an agency, and she doubted it would be the last.</p><p>“You could do that.” Decker nodded his head slowly, watching her dispassionately as she stood before him. “You’re a big girl, Kimberly, you can do whatever you want to. If you want to keep running. Or, you can face the fact that there will be times you’ll have to knuckle down and accept the inevitable. Especially if your father is chosen as the vice presidential hopeful in the next election as is rumored.”</p><p>So the rumors were true. Just what she needed.</p><p>“I don’t consider it running...”</p><p>“Well I do, dammit,” he growled. “I put my ass on the line to hire you, if you remember correctly. I didn’t think I was bringing on a damned quitter.”</p> <p>She almost flinched. He didn’t raise his voice, but Richard Decker didn’t have to, his dark brown eyes could slice you in half when he felt the need.</p><p>“It’s a trick,” she argued, dropping the pretense of subordination as anger fed the resentment that had been building within her for weeks. “It’s not his first, it won’t be his last,” she said as she spoke of the father she had given up on years before.</p><p>She shook her head, fighting the need to confide in the only person who had reached out to her in years.</p><p>Richard Decker wasn’t just her employer; he and his wife had become friends of hers. They had supported her need for independence from her father, and had provided her a quiet, peaceful retreat in their home when she had needed it. Turning him down ate at her soul, but the risks were too great.</p><p>“If you walk away from this assignment, then you can kiss your future in security work goodbye. You’ll never get another decent agency to hire you. And you know it.” He leaned back in his chair, his arms lying comfortably on the sides as he regarded her. “Is that what you want?”</p><p>She resisted the urge to clench her fists. “You know it isn’t,” she said heatedly. “But this is insane, Richard. There’s no more a threat to Raddington and myself than there is to you. It’s another of his asinine little plots, nothing more.”</p><p>“And we can’t be certain of that,” he retorted. “Until we are, you will take this assignment Kimberly, and you will do it to the best of your ability. If for no other reason, than for me. I really don’t relish the ass chewing I’ll get from my boss if you pull out.”</p><p>Emotional guilt. She hated that and he knew it. He knew it and he was using it against her anyway.</p><p>“That’s low,” she snarled.</p><p>“But effective.” He leaned forward once again. “You’ll take Matthews, Adams, Lowell and Danford with you. They’ll take shifts patrolling the main grounds while you stick close to Raddington. Stay with him. Just until we’re certain.”</p><p>Stay with him, close to him, be in the same house with him. Kimberly wanted to groan miserably at the thought. The past week had been hell already, the arousal that normally taunted her was turning into a torment. She dreamed of Jared, craved his touch, his kiss. The emptiness that echoed between her thighs seemed to echo through her soul now.</p><p>He wouldn’t take “no” for an answer for long. He would have what she had denied every other man at that club, and she knew it. In the process, he might very well steal her heart. She couldn’t afford to let any man touch her heart.</p><p>She breathed out wearily. She was tired. Sleep was getting harder and harder to attain and she knew she was going to deal with the exhaustion claiming her soon. Another trip to The Club was out of the question. After the last episode with Jared she had a feeling the relief she had found there would be nonexistent now.</p><p>“Fine,” she finally muttered, knowing she was making a mistake, feeling it so deep in her soul that it reverberated through her body. “We leave tonight. Anything else?”</p><p>Richard’s eyes narrowed thoughtfully.</p><p>“Is there something you’re not telling me, Kimberly?” he finally asked. “Something that could affect this assignment?”</p><p>Yeah, she wanted to fuck the client so damned bad that even now, her vagina wept with the hunger of it.</p><p>“No,” she answered instead. “Other than the suspicion that Senator Madison is playing yet another of his games, I can’t think of anything.”</p><p>“Would Jared go along with it?” She could see the automatic need to protect her in his eyes. Richard and his wife had been lifesavers in the past few years, but as she had told him before, there was nothing anyone could do to save her from her relationship with her father.</p><p>“I doubt Jared is involved in any scheme he would hatch up.” She finally shook her head at the question. “I don’t even think his mother knows all the details. The Senator wouldn’t want to ruin his good image.” It was all she could do not to sneer in contempt.</p><p>“Even I don’t know all the details,” he grumped. “Does anyone?”</p><p>She smiled mockingly. “The Senator and myself, and as far as I’m concerned, that’s two too many.”</p><p>Richard’s gaze was compassionate, but it did little to still the demons raging within her.</p><p>“I would pull you out of this if I could,” he told her softly. “You know I would Kimberly. But it’s not my call.”</p><p>She nodded bleakly. “I know Richard. Don’t worry, I won’t mess this up. We’ll leave tonight.”</p><p>He nodded slowly. “I’ll keep in touch with any new developments. As I said, at this point, the threat is only suspected based on intel coming through Homeland Defense. Your father’s a dirty son of a bitch, Kimberly, but he’s working wonders in Washington in national defense. That makes him a target, and it makes you and Jared a target. You can’t get away from that.”</p><p>“There are a lot of things I can’t seem to get away from,” she bit out fiercely. “Doesn’t mean I have to like any of it... I’ll get ready to leave now, if there’s nothing else.”</p><p>Richard sighed heavily. “No, there’s nothing else, Kimberly.”</p><p>She nodded shortly and turned and left the room. She managed to hide the fine tremble in her body until she reached her jeep, but as her fingers wrapped around the steering wheel, she felt the small shudders that reverberated inside her.</p><p>Jared. She stifled a moan as she laid her head against the wheel for long seconds and fought for her composure. For some reason, it seemed fate was out to destroy her. She could be strong away from him, but how the hell was she supposed to hide the hunger that ate at her soul for him, if she was forced into such proximity with him? And why was she suddenly wondering if the fight she was embroiled in with her father was even worth losing out on so much as a minute in Jared’s arms?</p><p>Jared stood on the back porch of his home staring into the twilight of a Virginia summer evening. He remembered, long ago, watching his father stand here as he debated some problem, staring into the surrounding forest with a frown on his dark brow as though the answers he sought were to be found there.</p><p>“The fact of the matter is, it’s Kimberly’s life in jeopardy, Jared,” his mother continued to speak behind him. “I’ve managed to convince William Lance, the head of the Secret Service, of my plan. He in turn has convinced her father that this is the only course they can take in protecting both of you. I didn’t think you would want this left to strangers.”</p><p>The mist was rising along the mountains now, he noticed distantly. Like gentle wisps of fairy dust, easing along the ground. Soon, they would enshroud the land as night took over, bringing an eerie comfort to the darkness.</p><p>“How high is the risk?” he finally asked her, keeping his voice carefully even.</p><p>“They aren’t certain yet. But you know how these things are. It could be rumor; it could be fact. I didn’t think you would want to take the chance with her life, though.”</p><p>Never. There could be no risk.</p><p>“How many are on the team with her?” he asked her quietly.</p><p>“Four, though two of them are iffy. I attempted to get them pulled, but when William approached her father with the idea he was vetoed out of hand. Their records aren’t as good as I would have preferred.”</p><p>He nodded slowly. “I have several of the men who were with me in the Forces working here. I’ll pull them in to the house and set up safeguards. As for the men on Kimber’s team, I’ll need their records as well as any intel on them.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I have everything with me,” she said, smiling back at him gently as he turned to face her. “Do you have any idea how much you remind me of your father when you stare off like that?” she asked him fondly. “He solved his most difficult problems here on this porch.”</p><p>Her voice echoed with the memories.</p><p>“He solved most of mine out here, too,” he sighed. Damn, he could have used his father’s advice now.</p><p>Jared rubbed his neck tiredly. He had returned from Texas that morning to find his mother awaiting him with the news that Kimberly’s safety could possibly be in danger and the plan she had set in motion to protect her.</p><p>“Does Madison know you’re behind William’s brilliant plan?” he asked her suspiciously. He had a feeling the Senator only knew what Carolyn wanted him to know.</p><p>She smiled serenely. “Daniel might not approve of you marrying his daughter, but he’s very well informed of your qualifications to protect her.” Not exactly an answer, but he knew that tone of voice well. He wasn’t going to get any more out of her.</p><p>“And how much does Kimberly know?” he asked her.</p><p>“That she’s to protect you, the team is to protect both of you. It’s simply a matter of protecting two birds with one shield so to speak. You are aware of the budget crunch the government is in the middle of, dear. Cost effectiveness is a major consideration.”</p><p>He snorted at that one.</p><p>“When does she arrive?” He needed time to go over the information his mother had brought with her and get his own plans in place.</p><p>“She’s leaving D.C. this evening. They should arrive here at the farm by morning. Kimberly is less than pleased with the assignment as I understand it, but I’m certain she’ll settle in nicely.”</p><p>Jared cast her suspicious look. “Are you sure there’s nothing you’re leaving out here, Mother?” Carolyn Raddington was as sharp as a dagger when the need presented itself, and he could clearly glimpse the sharp edges in the cultured, cool tones of her voice.</p><p>She watched him with a gleam of laughter in her eyes as her lips curved at the corners in a sedate smile. “I’ve told you everything I know, Jared,” she said soothingly, causing him to wince. Damn, he knew there was something she was holding back now. The only thing he was confident of was that it would be personal information, rather than anything he needed to keep Kimberly safe.</p><p>He faced her, resignation filling him now. He had stayed away from Kimberly, just as he had known he should, and now, for some reason, they were being thrown together in such a way that keeping his distance would be impossible.</p><p>The need for her was eating him alive. He tasted her kiss on his lips, could smell the sweet scent of her on the air around him. And at night, when he should be sleeping, he was stroking the tormented length of his cock instead, fighting to ease the hunger racking him. He hadn’t been back to The Club, even though he had a job to do there. He didn’t think he had enough control to restrain himself if he found Kimberly there again.</p><p>“Are you staying all night?” he asked her as he opened the kitchen door for her and stood aside.</p><p>“Not this time,” she said, her voice soothing, compassionate. “I need to get back to D.C. by morning. I have a luncheon I can’t miss.”</p><p>He shook his head. His mother had her fingers in too many organizations and charities for him to keep track of. She was a political dynamo, and he hoped Madison realized the gem he had in her. If Carolyn had her way, she would see the Senator standing in the Presidential wings. He just hoped she knew what the hell she was doing.</p><p>He escorted her to the front of the house and out to the limo awaiting her. Kissing her cheek, he saw her into the back of the car and watched as she rode away. She had brought the seeds of his destruction with the information on Kimberly and the threat endangering her. God help them both, he didn’t know how the hell he was going to keep his hands off her.</p><p>Chapter Five</p><p>“Matthews, you and Adams have days, Lowell and Danford can take nights,” Kimberly informed the four men as they were escorted by Jared’s housekeeper to their individual rooms. The men were downstairs, Kimberly was upstairs. Right next door to Jared.</p><p>“Will do, Kimberly.” David Matthews nodded his dark head solemnly, his puppy dog eyes smiling back at her. “Lighten up, we shouldn’t be here long. Raddington doesn’t seem the type to really like company.”</p> <p>Kimberly snorted. Jared had stopped just shy of rude when they drove in that morning.</p><p>“What the hell an ex-Special Forces soldier needs us for, I have no idea. He didn’t look like he had grown lazy,” Tim Adams grumped as he tossed his suitcase on one of the two double beds that filled the large bedroom.</p><p>The agents’ rooms were connected, two to a room, at the back of the house. The rooms were airy and comfortable, but not exactly homely. Jared evidently wasn’t one to encourage overnight guests.</p><p>“He’ll get used to it.” She shrugged as though unconcerned, but it bothered her as well.</p><p>Jared was considered one of the best soldiers in the Special Forces when he retired after his father’s death. His record was impeccable, his mission successes rated at ninety-nine percent. He could take out all five of the bodyguards sent to protect him, and likely take on a full assassination team with the advanced notice he had been given.</p><p>She focused instead on the four men she had been assigned. She was aware that Jared had approached her father in regards to what he considered suitable for a husband for Kimberly. Senator Madison had been extremely derogatory when he relayed that information to her.</p><p>As though I would consider him,he had told her, derision thickening his voice. You need restraint, Kimberly, not a man as deviant as you more than likely are yourself.</p><p>Deviant. He had no idea, she thought in smug satisfaction as she wondered if he had any idea how effectively she had sidestepped the Trust’s conditions. Anal sex might not be the most satisfying act, but it eased the fury and the tension that drove her.</p><p>But he knew Jared’s interest in her now, and she knew how the Senator worked. One of the men with her was sent, not to guard anything, but to report back to the Senator instead.</p><p>“Keep your eyes open and keep me updated,” she told the four as they watched her now. “I’ll get unpacked and meet you back down here for dinner. The housekeeper said it’s five sharp, no later. Let’s try not to disturb his routine too severely.”</p><p>She actually preferred to make certain they didn’t disturb Jared at all; he hadn’t looked pleased with their presence.</p><p>Taking a deep breath, she moved down the hall to the back stairs and climbed them quickly to return to her own room. It was on the far side, a small suite with a large queen bed that looked so damned inviting she wanted nothing more than to sink into it. She had spent nearly a week with little sleep and it was making her sluggish. She couldn’t afford not to have her wits about her on this job.</p><p>She closed the door behind her, locking it automatically as she moved through the small sitting room and into the much larger bedroom. The deep forest green carpet cushioned her feet as she kicked her sneakers off her feet and moved them to the side of the door.</p><p>Her suitcase sat on the large rosewood trunk at the bottom of the bed, opened invitingly, her gown lying on the top of her serviceable clothing. Closing the lid to the case, she stared around the room silently. The dark cherry wood furniture made the room seem warmer, comforting. This room was meant to pleasure, to soothe, and it did that far too well.</p><p>“Do you like the room?”</p><p>Kimberly jumped in surprise as she turned, facing the door on the opposite side of the room that Jared had managed to open without a sound.</p><p>Her breath caught at the swift punch of desire that contracted her womb and sent heat spreading through the vulnerable flesh between her thighs. She could feel the thick, warm juice spilling along the folds there, preparing her for him, making her ache all the more.</p><p>He looked good enough to eat. Leaning against the doorframe, his muscular arms crossed over his chest, his gaze somber as he watched her. His gray eyes were stormy, the color flowing and ever-changing as tension thickened the air around them.</p><p>“It’s beautiful.” She cleared her throat, hiding her grimace at the thick huskiness of her voice.</p><p>She was so weak. She pushed her hands into the pockets of her jeans as she fought the need to touch him, to taste his kiss again. Her heart was racing out of control, the blood pumping furiously through her veins and echoing in the swollen bud of her clit.</p><p>Drawing in a deep breath, she swallowed tightly as she watched his eyelids lower sensually. She could see the sexual tension moving through his body. Darkening his eyes, swelling the front of his jeans.</p><p>“You know this won’t work,” he growled the words at her. “You, here, in this house. I couldn’t even keep from putting you in the room beside mine, how much longer do you think it will be before I have you in my bed, Kimber?”</p><p>Images too hot to escape flashed through her mind. His hard body bare, perfect, muscles gleaming with sweat as he came over her, his powerful thighs moving between hers...</p><p>“I didn’t want this. Not for you, nor me.” She shook her head fiercely, fighting the temptation. And it was a temptation. The need to go to him, to accept him and to forget the vow she had made so long ago.</p><p>She remembered his kiss, dark and intoxicating, the sensations whipping through her system as his lips dominated hers, his tongue forging past hers to take possession of her mouth.</p><p>“I know you didn’t. And I know what we’re both risking.” He straightened from the doorframe. “It’s why I’ve stayed away from you. It’s why I jack off at night instead of kidnapping you and tying you to my bed where I can fuck you at will. It’s why I think this is one of the dumbest things I’ve ever done in my entire life.”</p><p>He gripped her shoulders, ignoring her gasp as he pulled her against him, his head lowering.</p><p>She was caught. Helpless. God, he tasted too good. Too hot and seductive. Her hands gripped his hard waist, her lips opening for him as his tongue pressed past them, a groan vibrating from his chest as she met it with her own.</p><p>This wasn’t a kiss. It was a possession. It was a hunger, a temptation and an addiction. And she couldn’t get enough. She wanted to wrap around him, to lose herself in the pleasure and the heat that was Jared.</p><p>“God help us both,” he growled as his lips tore free of hers, only to string nipping little kisses across her jaw, along the line of her throat.</p><p>His arms were wrapped around her, holding her still as he bent to her, his lips burrowing beneath the opened neckline of her blouse to run his tongue over the smooth, swollen curves of her upper breasts.</p><p>Her head fell back, helpless against the pleasure, her muscles unable to hold her neck upright now as streaking delight seared through her.</p><p>“Jared.” She arched to him, to his touch.</p><p>Her nipples ached, throbbed for the touch of his mouth. This was insanity. It was too much temptation, but it was unlike anything else she had known. This wasn’t an urge, nor was it an exercise in controlling the fury that sometimes built within her. This was a firestorm taking over her body and her mind. Heat and lightning and a demand that he only fed as his tongue licked over the lace edge of her bra.</p><p>“You taste as good as I knew you would,” he groaned roughly. “Like sweet honeysuckle and summer heat. God help us both, Kimber, I don’t think I can control the need to touch you, to taste you.”</p><p>She had a week to remember this. A week to regret, to need, to ache for even the simplest, smallest touch.</p><p>“Jared.” She fought to find her breath, to speak past the clawing, brutal arousal rising in her body.</p><p>She couldn’t speak further, couldn’t make anything more intelligent than a long, drawn out cry of blistering hunger escape her throat as his lips managed to push the cup of her bra aside enough to allow his tongue to rake the hardened point of her breast. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She went on her tiptoes then, her hands holding his head, pressing him closer, harder to her.</p><p>“More,” she gasped as he licked again. She wanted to feel his lips closing over her, drawing on her, sucking the tight point into his mouth.</p><p>“I was going to stay away,” he muttered gutturally. “I wasn’t going to taste. To touch...”</p> <p>He lifted her against him, moving her to the bed, laying her back against the comforter as he moved quickly to her side. His lips covered hers again and the storm inside her body fed on the growing hunger of his kiss.</p><p>Kimberly was only distantly aware of his fingers at her blouse, tearing the buttons from their holes; his calloused hands were sensually rough, demanding as he pushed the material aside and quickly loosened the catch of her bra.</p><p>She couldn’t fight them both. She was starved for this. This something that his touch held that no others ever had. As though a stroke of his finger alone was a narcotic to her senses.</p><p>“Son of a bitch, I’ll go to hell for this for sure.” There was no pausing between her lips and her pierced nipples.</p><p>Kimberly’s back bowed, arching tightly to him as a cry tore from her throat. His lips covered one aching tip as his fingers went to the other. Nimble and hot, his tongue rasped over it as his mouth drew on her, tugging at the little gold ring that pierced the center of the elongated tip.</p> <p>His fingers plucked at the other. Pulling at the gold ring, sending shards of desperate, fiery heat flowing through her body as her fingers gripped the fabric of his shirt, pulling at it, eager to feel his skin against her.</p><p>This was the stuff of her dreams. Jared overtaking her, forcing the pleasure from her body, giving her no time to think, to fear.</p><p>“I want to touch you,” she moaned, shuddering from the exquisite sensations ripping through her body. “Let me touch you, Jared.”</p><p>He growled back at her. She didn’t know if it was a yes or a no.</p><p>“Now.” She bucked against him, pulling harder at the shirt.</p><p>“Fuck no.” His head rose from her reddened nipple as his hands gripped her wrists, jerking them above her head and holding them with one hand as he stared down at her, his gaze dark, sexual. “Don’t touch me, Kimber. Not now. Not like this. I’ll end up doing something we’ll both regret.”</p> <p>Kimberly fought for breath.</p><p>“You can have me,” she whispered. “Like Sax...”</p><p>She couldn’t deny him, not any longer. She was too hungry, too wild for his touch. She had thought she could hold herself aloof. Thought she could deny her need and his lusts, but she knew now it wasn’t going to happen. This wasn’t just a need. It was a craving, an addiction.</p><p>He stared down at her, his chest rising and falling as quickly as hers, his face flushed with his arousal, with his lusts. She could see the battle waging in his eyes, the desperate need for anything she would offer, the knowledge it would never be enough.</p><p>“It’s all I have, Jared,” she whispered painfully. “All I can offer.” But it wasn’t. Not really. She had the heart she was terrified he already held.</p><p>His head lowered, his forehead meeting hers as he stared into her eyes.</p><p>“Such a pretty little rear you have,” he whispered, his voice suggestive, dark with lust. “Do you know how many nights I’ve dreamed of you, Kimberly? How often I’ve lain awake hungry for you?”</p><p>She licked her lips, weakening desire washing through her body.</p> <p>“I’m here,” she whispered.</p><p>His hand rose to her face, his fingers smoothing over her cheek with a touch as soft as a whisper.</p><p>“Here you are,” he agreed. “And yet you’re further away than you ever were.”</p><p>Kimberly watched in confusion as he loosened her wrists and forced himself from her. And he did force himself. She could see it in every line of his body, in the tight, angry grimace of his mouth.</p><p>“What do you mean?” She shook her head, pulling the edges of her shirt together as he rose from the bed and stood staring at her from beside it.</p><p>It broke her heart, needing him as she did and knowing she could never have him and keep the vow she had made to herself and to her mother. A vow that was weighing down her soul more and more by the day.</p><p>He shook his head shortly. “I have to get the hell out of here before I take something you don’t want to give. And that would only hurt both of us.”</p><p>Before she could speak, he stalked through the connecting doorway, closing the door firmly between them.</p><p>“But I do want to give it to you, Jared,” she whispered bleakly. “More than you know. More than you will ever know.”</p><p>Chapter Six</p><p>He should have stayed the fuck away from her, just as he had intended. He shouldn’t have gone into her room and he sure as hell shouldn’t have touched her. But he had. Helpless against the need to taste her, to touch her. She was like a narcotic to his senses, wrapping around him, a siren’s call of lust and heat that he was helpless to deny. He craved her.</p><p>Jared couldn’t remember a time in his life when need had struck him so hard, so imperatively. No other woman had ever affected him this way; no other had ever tested the control he had fought to preserve over the years.</p><p>A good woman is worth any sacrifice, son. The memory of his father’s words washed over him as he stared into the darkened forest from the back porch. She’ll soothe your soul even as she makes you burn inside and out. That kind of woman is worth dying for, but even more, she’s worth living for.</p><p>He knew his parents hadn’t had an easy time of it together. Their relationship had been hampered by her parents, and by Victor Raddington’s extreme sexuality.</p><p>Jared still remembered coming home that first time when the knowledge hit him. He had been in college, nearly a grown man and had returned home unexpectedly. He had walked in on something that even now, simply because it was his parents, he wished he never had walked in on.</p><p>He hunched his shoulders against the uncomfortable memory. But the thought of it was enough that it brought Kimberly to mind. How erotic it would be, holding her, watching as another man touched her, fulfilling all her most sensual fantasies.</p><p>She was a highly sexual creature. He had seen that at The Club, and the information he had learned later had only reinforced that impression.</p><p>Her requests when it came to sexual conduct with the club members were simple. She didn’t want foreplay, she didn’t want to be kissed or held; she had only wanted to be fucked. And she had enforced those demands herself. Because they made her weak. They made her want. And Jared knew he made her want those things she could never have more than others.</p><p>And now she was here. A part of his home, of his life. He had no choice but to stay close to her, to protect her, and to shield her from the plant Madison had placed within his home to watch Kimberly and to report any sexual misconduct.</p><p>He shifted uncomfortably as he leaned against the wide post, wishing he could ease the pressure in his jeans just a bit. His erection was killing him. Walking away from Kimberly was the hardest thing he had ever done in his life, but God help him, he was dying for her.</p><p>“You can have me...like Sax...” The words whispered through his mind as his eyes closed in tormented desire.</p><p>Like Sax. He could have her anally.</p><p>Fury pulsed inside him as he clenched his teeth against the need to have all of her. He wanted everything, and the fact that he couldn’t fight the shield placed between them enraged him.</p><p>He could fight another man, or any danger that raised its head to threaten her. He could seduce her, if it was only her stubbornness, out-argue her if it was her anger holding them apart. But it was something out of their control. Something that would destroy her if he forced her to choose.</p><p>So he had to choose. Because he couldn’t bear the pain he saw in her eyes, and the need he felt shuddering through her body. He couldn’t still the need to hold her, to show her, if only with his touch, the love he had for her. A love he knew would destroy him eventually, because he couldn’t fully have her. Not now. Not ever.</p><p>“You’re not here to advise me on this one, Dad,” he whispered as he stared into the mountains his father so loved.</p><p>He missed the man whose advice he had so come to rely on throughout his adult years. His death, five years before, had left a hollow spot in his soul that echoed with regret in times like this.</p><p>His father had raised him with solid values, with a sense of family and honor, one he refused to break now. Fact was fact. He couldn’t fully possess the woman he loved with every beat of his heart, but he could give her a time without pressure, without demands. A time to hold to their hearts in the long, lonely years that would come.</p><p>He lowered his head, his hands gripping his forearms as he crossed them over his chest and nudged at the side of the support post with the toe of his boot. There was nothing else he could do.</p><p>“You know, it’s not real bright to stand in full view like that when you could possibly have a terrorist or other unknown assailant waiting to pop your ass.”</p><p>He grinned as Kimberly spoke from the back door, her voice irritated and still shadowed with arousal. He wondered if she knew how that husky little sound made him crazy to fuck her.</p><p>He turned, glancing back as she stepped outside, watching him warily.</p><p>“Sorry, some days my control is not what I would want it to be,” he grunted with an edge of self-mockery. “So much for my Trojan status, huh?”</p><p>“The Trojans.” She shook her head at the title that had been given to the eight men that Stanton’s wife had identified as being part of the exclusive men’s club. “I imagine you’re more like them than either of us wants to admit to right now. But it doesn’t change the fact that you aren’t indestructible. You shouldn’t be out in the open like this.”</p><p>“My neck’s not itching. I’m not worried,” he told her, wondering at the pleasure that just the sight of her brought him.</p><p>He wanted to see her clothed in nothing but moonlight, reaching for him, her body shimmering with moisture, her eyes glazed with need. His hunger for just that rocked him to the very core of his being.</p><p>“Oh Lord, another man whose neck itches,” she grumped. “I’ll tell you the same thing I tell my boss—they make salves for that sort of thing.”</p><p>A surprised chuckle escaped his lips. She was daring and sharp as hell. He loved that about her. He had missed her blistering little retorts, her teasing laughter. He hadn’t realized how much until now.</p><p>She moved closer to him, the scent of her, clean and fresh, with just a hint of peaches enveloped him, making him hunger to taste her again. He wanted to spread her legs wide and lick up all the sweet cream her body had to give. To gorge himself on her passion, her cries and her sweet release.</p><p>“Come here.” He pulled her into his arms, ignoring her slight, indrawn breath at the intimacy of the act.</p><p>It was one of her taboos, he knew. No cuddling, no foreplay. Those rules he could and would break.</p><p>He was surprised though, when after a second’s stiffness, she relaxed against him, her hands settling cautiously at his waist as he rested his cheek against the top of her head. His hands smoothed down her back, fingers working at the muscles there, a smile tipping his lips as they slowly eased.</p><p>“I’m sorry,” she finally whispered. “I don’t want to make this harder for either of us than it already is.”</p><p>He smiled against her hair. If he got any harder he would burst right out of his jeans.</p><p>“Just let me hold you,” he finally whispered deeply, responding to the need to feel her against him, the ache to shelter her like a knife through his soul. “Just for a minute, Kimber. Let me hold you.”</p><p>The night wrapped around them, quiet, soothing. The sound of the frogs in the pasture pond, the hoot of a faraway owl, a whippoorwill in a tree in the backyard. The night enveloped them, hid their fears, their hungers, and for those few precious minutes, brought a measure of peace to them both. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Seven</p><p>He didn’t come to her bed that night as she expected. Kimberly lay awake, long into the night, listening for him, her body sensitized, ready, aching for him. She watched the connecting door until her eyes finally closed in exhaustion and sleep claimed her as restless dreams haunted her.</p><p>The next morning she sat bleary-eyed and irritable over a cup of coffee, listening to Matthews and Adams as they discussed the reports from the previous day. No sign of intruders, not a whisper of danger. Other than a deer munching the grass in the backyard, there was nothing to report.</p><p>“I’ll cover the inside today,” Matthews said thoughtfully. “Adams will take the outside. I gather you’re stuck with Mr. Dark and Gloomy Raddington,” he snickered at her.</p><p>Kimberly lifted her brow mockingly. “Dark and Gloomy?” she asked him curiously.</p><p>“Yeah, he came down earlier for breakfast looking like a thundercloud before retreating to his office. Barely said two words to us.”</p><p>At least he spoke to them.</p><p>She lifted her shoulder as though unconcerned. “Maybe he just doesn’t like company.”</p><p>Tim Adams snorted. “Maybe we’re the wrong company. From what I saw last night, he liked you pretty well.”</p><p>She looked over at him slowly, careful to keep her expression blank.</p><p>“Excuse me?” she said carefully, her body tensing at the implied insult in his voice.</p><p>He stared back at her, his gaze condemning.</p><p>“I saw you on the porch with him last night,” he sneered. “Getting a little close and personal weren’t you?”</p><p>“Getting a little nosy aren’t you?” she snapped back.</p><p>“I would say too nosy.” Jared’s voice was dangerously soft as he walked into the room. “Should you have an opinion on how close I am or am not, with my stepsister?” he asked the bodyguard softly as he moved to the table.</p><p>Kimberly took one look at him and came to her feet quickly.</p><p>“Geez, is there enough testosterone in this room?” she growled irritably. “What the hell is with you guys?” She turned back to Tim Adams. “What I do is none of your damned business. And you,” she poked a finger in Jared’s chest demandingly, fighting to hold back a shiver as those steel-cold gray eyes turned on her, “are not my keeper. I don’t need anyone to defend my honor or whatever the hell you think it is you’re doing.”</p><p>This was just great. She was pretty certain she knew who her father’s plant was. Tim Adams was as moralistic as they came. His views on women and what they should or shouldn’t do was as rigid as the Senator’s.</p><p>Jared’s expression didn’t change. It remained hard as stone and more dangerous for it as his gaze turned back to Adams.</p><p>“I’ll call your superior myself,” he said flatly. “Until then, stay the hell out of my sight, or you’ll regret it.” He snagged Kimberly’s wrist as her eyes widened in surprise. “And you, I need to talk to.”</p><p>Before she could stop him, he was pulling her along behind him, again. Dammit, she was getting tired of him dragging her along like medieval chattel.</p><p>“Jared, has anyone ever told you that you’re a pain in the ass?” she snarled as he propelled her into the study and slammed the door behind them.</p> <p>“Has anyone told you that you’d test the patience of a saint?” he retorted shortly. “You should have let me kill him. I would have enjoyed it.”</p><p>She rolled her eyes at his bloodthirsty tone.</p><p>“He’s a moron. If you killed all of them, there wouldn’t be any men left to continue the species,” she informed him sarcastically. “What the hell is your problem anyway?”</p><p>“The bastard was sneaking around my house all night,” he snarled. “If I had caught him listening at either of our bedroom doors again I would have killed him.”</p><p>Surprise widened her eyes as she stared back at him.</p><p>“Just what I need,” she sighed roughly. “Ignore him. It won’t do any good to have him taken off the assignment, because I suspect at least two of them were sent here deliberately to watch me. It’s the Senator’s favorite sport, having me spied upon.”</p><p>His lip lifted derisively. “I won’t give you my opinion on the Senator,” he bit out. “I can’t believe my mother married that bastard.”</p><p>Kimberly had a hard time believing it herself. Carolyn was a warm, caring person, besides being smart as hell. It was one of the most unlikely matches that she had ever seen.</p><p>“Is that why you’re so pissed this morning?” She moved over to the couch and sat down wearily. Damn, she needed a few more hours sleep, or a pot of coffee to herself.</p><p>“I’m not pissed,” he informed her rudely. “I’m pure mean mad. I don’t like people sneaking around my house listening at doors, Kimberly. I’ll take him apart the next time I catch him.”</p><p>Kimberly sighed at his snarling voice, her fingers smoothing back the stray curls that had fallen from her thick braid.</p><p>“Take him apart then.” She shrugged negligently. “It’s your house, not mine.”</p><p>He grunted at that, moving to stand over her, staring down at her as his eyes went from cold steel to stormy gray.</p><p>“Take your hair down,” he ordered softly. “Slowly.”</p><p>Her breath caught in her throat, her womb clenched with instant arousal. A quick glance to his thighs showed that he wasn’t in a bargaining mood. He was fully erect, his cock straining the zipper of his jeans as he watched her.</p><p>“What about the ears at the doors?” she asked him breathlessly.</p><p>“Let him listen,” he snapped. “I’m not going to take your virginity, but I’ll be damned if I’ll leave that sweet mouth of yours innocent much longer. Tell me, Kimberly, is it true you’ve never been taken there? Never felt the hunger to have a hard cock straining between your lips, pulsing with the need to fill your mouth?”</p><p>Oh God. Her mouth was watering with the need now while her lips were drying with nervous excitement. She licked over them quickly, her breath hitching as his eyes darkened at the movement.</p><p>“I haven’t.” She shook her head, entranced by the shifting color of his eyes.</p><p>She never had. Had known no desire for it, until now. Her hand gripped the cushion beneath her, her nails biting into the fabric as the bulge inside his jeans seemed to get larger.</p><p>“I won’t follow your rules,” he growled. “You’ll share my bed. I’ll touch you, hold you, kiss whenever I damned well please. If you can’t handle that, Kimber, then you better get the hell off my farm now. Because I’ll be damned if I’ll fight the need knowing how hot and hungry you can get.”</p><p>She lost her breath. Sitting there, staring up at him, fire exploded in her body, washing through her veins and sending the juices spilling from her desperate pussy. She couldn’t contain the whimpering moan that whispered past her lips, or the sudden, overwhelming urge to experience every touch, every sensation he had painted on the canvas of her imagination.</p><p>“Undo that fucking braid,” he growled. “Now.”</p><p>The braid? She blinked up at him for a second in confusion, her mind so entranced with pictures of them entwined, his arms wrapped around her, his larger body shielding hers, possessing her, that for a moment she wasn’t certain what he meant. Then she blinked as it connected, her hands raising, pulling the length of her hair over her shoulder as she pulled at the stretchy band holding the braid in place.</p><p>Within minutes her hair was spread out over her shoulders, the long, fiery ringlets falling around her in wild disarray.</p><p>“God, that’s so pretty,” he whispered, his voice thick with longing as she pushed the mass over her shoulder nervously.</p><p>“Now, stand up. I want to watch you undress. All the way, Kimberly. Let me see that hot little body I’ve been dying for.”</p><p>She could hear the raging hunger in his voice; see the lust glittering in his darkened eyes. She rose slowly to her feet, her hands going to the buttons of her blouse as she fought to stand steady.</p><p>He towered over her. She had never noticed that before, not really. How tall and broad he was, how much stronger and heavier. He would cover her like a living blanket; shield her from even her own fears.</p><p>“I’m scared,” she suddenly whispered, though her fingers never paused as she finished with the buttons. “I’ve never done this before, Jared.”</p><p>Not like this. Before, at The Club, she had known the rules, known what was coming. She showed up, undressed and prepared herself in the privacy of her room before donning a robe and heading to the bar area. There, she would order a whisky over ice, down the liquid courage and turn to whichever member awaited her.</p><p>There were few preliminaries before she was bent over a table or pulled onto a hard, willing cock. There were no kisses, no foreplay, no breathless anticipation.</p><p>His fingers paused as he unbuttoned his own shirt. Stepping closer, his hands framed her face, his gaze holding hers hostage as he whispered a kiss over her lips.</p><p>“I’m going to eat you up,” he warned her sensually. “There won’t be a place on your body that doesn’t know my kiss, or a single cell that isn’t crying for my touch. There’s no reason to be scared, honey. No reason at all. All I’m going to do is love you.”</p><p>Chapter Eight</p><p>She could drown in his kiss. Kimberly whimpered beneath the lustful demand as Jared held her against his half naked body long moments later, his hands roaming over her back and hips as his lips and tongue possessed her with an assurance, an ownership she knew she could never deny.</p><p>Her hands buried in the thick, short strands of his hair as she arched closer, trying to feel every inch of him, every hard muscle and strong contour of the fierce male body she was plastered to. She couldn’t get close enough, couldn’t feel him deep enough inside her skin.</p><p>Every breath she took was filled with his scent, with his passion, until she felt consumed by him.</p><p>“Good, baby,” he groaned roughly as he tore his lips from hers long moments later, his hands pushing her blouse from her shoulders before his lips slid down her neck, finding the creamy, swollen curves of her upper breast as she arched to him. It was heaven and hell. Ecstasy and agony.</p><p>“You’re killing me,” she whimpered, feeling his fingers on the buckle of her belt, releasing it quickly before he attacked the snap and zipper of her jeans.</p><p>Within minutes he had everything stripped from her except the damp, violet thong she wore. Her juices spilled from her pussy, wetting the small triangle between her thighs as Jared slid the backs of his fingers over the soft fabric.</p><p>“I’m going to make you scream for me,” he warned her, his voice husky, deeper, darker than she had ever heard it before. “I’m going to make you burn, Kimber, in more ways than one.”</p><p>She shuddered in pleasure from his voice alone. The gravelly tone rasped over her nerve endings and made her ache in ways she had never ached before. She had never known this overwhelming compulsion, this craving for another person’s touch.</p><p>“Jared, it’s killing me,” she panted with the excess sensation, trembling as his lips teased the tip of her nipple, his breath wafting heatedly over it, his lips barely smoothing it, toyed with her.</p><p>“Then you’ll surely die before it’s over if it’s killing you now.” She could hear the wisps of amusement lingering at the edges of his passion. “Just relax, Kimber. You don’t have anything to worry about here. Nothing to fear. I’ll take care of you, baby.”</p><p>She jerked, crying out as his lips snagged the small gold ring that pierced one of her nipples and tugged. She could feel the pleasure whipping through her body, bolts of it spearing into her womb as her hands fell to his shoulders, her nails piercing the hard muscles there.</p><p>“Mmm,” he murmured softly. “How responsive you are. Let’s see what else you like now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His tongue curled around the tip as his mouth covered the peak of her swollen breast, sucking it inside the wet heat of his mouth as a strangled plea erupted from her throat.</p><p>She couldn’t bear this. Her head fell back on her shoulders, her eyes closing helplessly as he moved her back to the couch, laying her full length upon it as he came over her. His mouth never broke its fierce suction; his tongue never paused in its tormenting flicks of ecstasy against the gold ring that pierced her flesh.</p><p>He lay over her, his chest bare, his hands stroking the fire that raged through her bloodstream as he caressed her. The calloused warmth of his fingers stroked over her side, her hip, her thigh, growing steadily closer to the agonizing ache between her thighs.</p><p>When he cupped her there, Kimberly arched to him, her shattered plea breaking from her throat unbidden.</p><p>“Oh God, Jared,” she cried out. “Please, I hurt...”</p><p>She wanted to cry from the overwhelming pleasure, the hollow, never-ending ache that seemed to grow more intense with each touch.</p><p>“Easy, baby.” His lips whispered over the shell of her ear. “I’ll make the ache go away, Kimberly. Eventually...”</p><p>His fingers moved more firmly against the damp mound of her pussy, his hand pressing on her tortured clit and sending brilliant explosions of white-hot heat racing through her bloodstream.</p><p>Eventually? At this rate she would dissolve from the electric pleasure before he ever got around to easing it. But she couldn’t protest, couldn’t deny the intense sensations he was building within her body.</p><p>“Damn, your pussy is so hot you’re scalding my hand,” he growled, his voice tortured with his own arousal now as his lips moved back to her breasts then lower.</p><p>Kimberly’s breath caught in her throat as she felt his lips travel down her stomach, her abdomen, his tongue licking her flesh, the heat of his lips searing her skin.</p><p>“Do you know what I’m going to do, Kimber?” he asked her softly as they came to the band of her silk panties.</p><p>She whimpered at the warning tone of his voice.</p><p>“I’m going to do what no other man at The Club has dared to do. I’m going to eat your sweet pussy until you’re screaming to come. Begging me to ease the ache that’s going to consume you.”</p><p>“I’ll do it now,” she cried out, certain there was no way she could bear the additional pleasure. “I’m begging now, Jared.”</p><p>He chuckled against the silk over her clit, causing her to flinch at the sensation. She wouldn’t be able to bear it. Already her body was honed to a fever pitch of excitement.</p><p>“Then,” he continued. “I’m going to turn you over and I’m going to spank that pretty ass until it turns a bright, fiery red, for making me wait so damned long for you.”</p><p>She shuddered, her womb convulsing as she nearly climaxed from that threat alone.</p><p>“You like the thought of that?” he asked her, his voice too gentle, too deep to be anything other than a warning. “I can tell you do, baby. Your panties are so damned wet now they’ll be dripping soon.”</p><p>Her hands tightened in his hair as his fingers slid beneath the elastic band and began to lower the material. Slowly, so slowly, until the silk revealed the swollen, bare folds to his gaze.</p><p>He paused then, his body tensing above her as she watched him with drowsy heat.</p><p>His face was flushed, his lips swollen and sensual; his eyes were like thunderclouds, swirling with more shades of gray than she thought existed. Then his head lowered.</p> <p>Suspended on a rack of torturous pleasure, Kimberly could do nothing but shudder violently as his tongue swiped over the cream-slick flesh of her cunt before insinuating itself into the narrow slit and slicing through it with devastating results.</p><p>It was humiliating to climax so easily. She should have had enough control to at least know the orgasm was coming. Instead, the height of excitement, the heat of his tongue, and the explosive pleasure undid her.</p><p>She arched to him, her cry shattering the silence of the room as everything inside her detonated at the lick. Her clit throbbed, pulsed, her vagina spilling the slick essence of her release.</p><p>“I’m sorry,” she cried out, shame eating at her even as the storm within her body stole her reason. “Oh God. Jared. I’m sorry.”</p><p>Her panties were ripped from her thighs and discarded as he moved lower, pressing her legs further apart, his hot breath like a whiplash of sensation against her sensitive pussy.</p><p>Kimberly shuddered with the excess of sensation still surging through her, as well as the hunger. She couldn’t control the need, the fierce throb of desperation or her own gasping cries. Despite her release, she needed more. So much more.</p><p>“Shhh, baby, we’re not done yet,” he soothed her, his voice tight, a harsh growl that eased her, that assured her that her pleasure had only pushed his arousal higher. “It’s okay, Kimberly. Now, I get to build you back up. I’m not done with you by a long shot.”</p><p>Chapter Nine</p><p>She was being tortured. He was a cruel, black-hearted sadist to do the things he did to her.</p><p>Lying between her thighs, his mouth worshipped, his tongue alternately soothed and enflamed the swollen folds of her cunt. His tongue pressed inside her vagina, sending her into an orgasm that had her screaming for mercy. She twisted against his hold, fought the hands that anchored her to the couch and begged, pleaded with him to ease the storm riding mercilessly through her body.</p><p>When he finally rose from between her thighs, his eyes were black with lust, his face flushed with it. Kimberly shuddered with exhaustion, with her own needs and the blood thundering through her body. How she could even conceive of the need to climax again, she didn’t know. But the whipping, pleasure-induced flames that licked over her body assured her that she was more than ready for more. Ready and willing, hungry and eager.</p><p>Her breath stopped in her throat as his hands went to the buckle of his belt. She licked her lips, her eyes lowering with the excess passion surging through her body and watched as he slowly unbuckled it. The wide leather fell to the side and his hands were loosening the metal buttons that strained to stay closed over his erection.</p><p>“I wish you could see your face,” he whispered. “Flushed and damp, your lips swollen and red and so very, very fuckable. It’s my turn, Kimber. Are you ready for me?”</p><p>His turn. She wanted to whimper at the knowledge of what was coming. Instead, she watched in eager anticipation as he lowered his jeans and the snug boxer briefs, revealing the thick length of his erection to her gaze.</p><p>Her womb convulsed in painful arousal as her mouth watered at the sight of the dark flesh. Thick veins pulsed with blood, the flared head glistened with pre-cum, flushed a ruddy red and eager for attention.</p><p>“Sit up,” he growled. “I want to watch you take me into that sweet mouth of yours, Kimber.”</p><p>She sat up slowly, her eyes trained on the demanding length of male flesh as it came closer, closer, to her mouth. Within seconds, it was nudging at her lips as a harsh, male groan wrapped around her senses.</p><p>Her lips opened, her tongue reaching out to smooth over the glistening head of his cock, tasting the wild, salty essence of him. A low moan came unbidden from her chest as her hands rose, the fingers of one wrapping around the lower portion of the shaft as the other tentatively touched the taut spheres below.</p><p>“Sweet Heaven,” he groaned, his hands threading through her hair, clenching the strands until small darts of pain began to flicker along her skull. “That’s good, baby. So good.”</p><p>She stared up at him dazed, poised on a pinnacle of arousal she had never known before. Her entire body ached for release, though she had spent the past hour experiencing one orgasm after another. She couldn’t seem to come hard enough, long enough though, to still the flames raging through her body. She only became hotter...hungrier.</p><p>“God yes,” Jared hissed as her mouth opened and she took the head of his cock inside its heat.</p><p>She closed her lips over him, her tongue stroking him as her hand moved on the steel-hard flesh. She watched, entranced, as ecstasy consumed his face, his eyes glittering beneath partially closed eyes as he fought to breathe.</p><p>Kimberly let her tongue caress and stroke as her lips moved over him. She drew on him, sucking him as deep as she dared, loving the rasp of his breath, the way his fingers tightened in her hair with his pleasure. It was more than just arousing. It was destructive to her senses, to her emotions.</p><p>“Damn, you’re pretty like that,” he rasped, his teeth snapping together as her tongue wriggled against the ultra-soft flesh just beneath the head.</p><p>His thighs tightened at the caress, his abdomen flexing with a convulsive shudder.</p><p>“That’s good,” he bit out. “Suck me deeper, baby. Just a bit harder... Hell...yeah...”</p><p>His big body seemed to be racked with fine, fierce tremors. She could feel the hard flexing of his cock in her mouth and beneath her hand, see the effort it took to control his need for release, in the taut contours of his stomach.</p><p>“Kimberly,” his hips were thrusting his erection deeper into her mouth now, sending the flared, flexing head closer to her throat. “Baby, I’m going to come,” he warned her hoarsely, both hands pulling at her hair as he obviously fought to keep from sending his cock too deep into her mouth. “Baby, I can’t wait. Let me go if you don’t want this.”</p><p>His hands didn’t relinquish their grip though. He held her still for the penetration of her mouth, shuttling faster between her lips as his cock seemed to swell against her tongue.</p><p>She moaned, a low, reflexive sound, signaling her own need for his release, the desire to taste the passion she could never fully experience.</p><p>“Now.” He moved faster, fucking past her lips with a desperation that only spurred hers.</p><p>She tightened on him, suckling harder, drawing him deeper until a ragged, almost enraged growl tore from his throat a second before his release began spurting inside her mouth. Deep, hard jets of semen pulsed from the head of his cock. His taste was earthy, primitive, addictive.</p><p>She fought to swallow each jetting spurt, her moans rising as her hand pumped his flesh, fighting to give him every second of pleasure that he could wring from the experience while tremors of excitement flashed through her own system.</p><p>She was shaking, exhausted, yet her body still ached. A hollow, haunting pain that she feared she would never rid herself of now.</p><p>Kimberly licked her lips wearily, tasting the essence of him as he knelt before her. His hands framed her face, his gray eyes staring somberly into hers as his thumbs smoothed along her cheekbones, then her swollen lips.</p><p>“You’re like a narcotic,” he whispered. “So powerful, so damned addictive, you make me fear for my sanity.”</p><p>Warmth exploded through her system. His touch, his look, both were filled with such gentle amusement, and such heated hunger that she didn’t know if she should laugh or cry over the fact that they were only making themselves ache further.</p><p>“Jared...” Her hands gripped his wrists, feeling the strength there as he leaned forward, caressing her lips gently with his.</p><p>“We better get dressed and get out of here before your spy decides to pick the lock.” He grinned as he pulled back and moved away from her. “Son of a bitch, if this room wasn’t damned near soundproof then I’d have to kill him yet.”</p><p>She couldn’t say anything. Kimberly felt the words locked in her soul, emotions, frightening in their extremity rising within her. She licked her lips, tasting him yet again, and trembled as her vagina rippled in growing demand.</p><p>She followed his example though, dressing quickly, ignoring her shaking hands and the tears that locked in her throat. Just as she ignored the growing certainty that her life, from this point forward, would never be the same again.</p><p>Chapter Ten</p><p>It didn’t take Jared long to find his prey. After escorting Kimberly to her bedroom where she swore she was going to take a nap, Jared went hunting. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Knowing that one of the men Kimberly should be able to trust was no more than a Judas sent by her father was more than he could stomach. The Senator was beginning to piss him off in ways that Jared knew wasn’t healthy for either of them.</p><p>Kimberly should have never been a pawn in whatever fanatical vision her ancestor had. The Trust was bad enough, holding over her head the preservation of an estate that should have rightfully been hers without such extreme conditions. But to know that her father, the man who should have cared more for her happiness and welfare, cared only about the preservation of her chastity, that should be criminal.</p><p>Kimberly hadn’t been born to restrain the natural sensuality that burned within her body. It was like a flame, white-hot and intense, threatening to burn the man lucky enough to tap into it. As Jared had. His body tightened at the knowledge that he had released a passion inside her that he knew even she had been unaware existed.</p><p>His ears still rang with her screams, her pleas for release. The scent of her arousal had been like the dew, fresh and wild, sweet and clean. Her body had been like a flame, undulating beneath his lips and tongue, spilling the sweet essence of her need to his greedy lips. He’d be damned if he’d let her pay for the pleasure she had found in his arms.</p><p>He moved silently through the house, his eyes narrowed as he entered the hall in time to see his office door closing silently. Within seconds, he had opened the door, pushing it forcefully into the bastard on the other side before stepping in and grabbing the bodyguard by the back of the neck and shaking him like a recalcitrant pup.</p><p>For a bodyguard, the bastard was a simpleton. Jared had seen more experience in street thugs than he saw in the moron he threw away from him.</p><p>“Hey... Dammit, what’s your problem?” Tim Adams turned on him, his body moving into an attack position before he saw Jared.</p><p>Jared smiled in anticipation. He could see the other man’s desire to jump, to attack. It quivered in the muscles of his body, glittered in his hazel eyes and flushed his pale face with an unattractive ruddy color.</p><p>“Go for it,” he said simply, his body relaxed, ready for any move the other man would make. “I dare you.”</p><p>Adams tensed, then evidently thought before attacking the man he had been sent to guard.</p><p>“This is my office,” Jared said simply, warningly as the other man stood down. “You don’t have any business here.”</p><p>Adams’ lips firmed as his gaze went around the room before pausing at the couch. There was no mistaking the dampness that still lingered on the center cushion, proof of Kimberly’s passion and her need.</p><p>Jared watched as fury built within the younger man, his body shaking with it.</p><p>“Sorry,” he finally snapped with no sign of apology. “Wrong turn.”</p><p>He moved to pass Jared and escape.</p><p>“I don’t think so, junior.” Jared caught Adams in a neck hold that had him gasping for breath, his body tensing in surprise.</p><p>“I think you know just how easy it would be for me to snap your neck right now,” Jared kept his tone pleasant despite the fury pouring through him. “Someone as well trained as yourself, Adams, should know better than to ever turn your back on your enemy. And trust me, you just made an enemy,” he growled at the other man’s ear. “Now you listen here, and you listen good. Kimberly is none of your business. Period. And don’t think you can report this to the Senator and get away with it. Won’t happen, son, I’ll hear about it. And when I do, I’ll kill you. You understand me?”</p><p>Adams choked with fury, the harsh sounds of his anger and his fight to breathe filled the room for long seconds before Jared loosened his hold enough to allow him to take a breath.</p><p>“You understand me, Adams?” he repeated the question, keeping his voice soft, deadly.</p><p>“He’ll find out,” Adams gasped. “She won’t get away with it.”</p><p>Jared smiled tightly. “As long as she remains a virgin, she can get away with whatever the hell she wants to, right?” He tightened his hold as Adams struggled vainly for release. “Answer me, boy, before I break your neck now.”</p><p>“Yes,” Adams hissed.</p> <p>“Exactly.” Jared loosed the grip on his neck further. “But whether she does or not, you’re not going to be spreading any tales are you, pissant? You want to know why? Because you know who I am. You know what I can do. And you know I will kill you. Don’t you, Adams?”</p><p>“Yes.” Raw helpless rage echoed in the voice.</p><p>“Good boy,” Jared commended him mockingly. “Now, you make sure you remember this little lesson, because I would sure hate to have to spill blood in my house. My housekeeper gets real testy when she has to clean up the mess. We wouldn’t want that, would we?”</p><p>Jared released him slowly, watching with narrowed eyes as Adams tore out away from him. The smaller man turned back, his eyes flashing with anger.</p><p>“Do you think the Senator doesn’t know what she is?” Adams snarled. “Do you think he won’t have her checked first thing after this assignment?”</p><p>Jared stilled the need to kill the other man. Hiding the body would be a pure pain anyway.</p><p>“Won’t matter,” he finally said, his voice chillingly cold. “She’ll be a virgin. He won’t win and neither will you. I’ll make certain of it. Now get the hell out of my office before I lose my control and show you just how far you’re pushing me right now.”</p><p>He evidently didn’t have to give a second warning. Adams shot out of the room, the curse that fell from his lips echoing in the room behind him.</p><p>“Get fucked.”</p><p>Jared sighed wearily. If only...</p><p>Chapter Eleven</p><p>Kimberly admitted she had little experience with the male of the species. And she had even less experience with this relationship deal that Jared seemed to want. She felt unprepared for him, inadequate in the face of the experience she was beginning to suspect he had.</p><p>She had merely played at The Club. A visit every three months, a quick tumble across whatever table was handy and off she would go. There had been no emotional attachment, no sentiment. And she hadn’t wanted any, couldn’t afford any.</p><p>But she was learning that Jared intended to play the game by a whole other set of rules. The truly frightening part was the fact that rather than feeling intimidated or threatened by the intimacies he had warned her were coming, she was instead, excited, nervous, balanced on a laser point of uncertainty and exhilaration that should have been terrifying.</p><p>As she stepped from the shower later that evening and toweled off slowly, Kimberly admitted she was in deep trouble where Jared was concerned. But she had known for months now that he represented a danger to the goals she had kept firmly in mind for the past six years.</p><p>She had only five years left to go. Remain a virgin for five more years and she would win. She would do what no other woman in her mother’s family had been able to in five generations. She would laugh in the face of the edicts that had governed her life since adulthood and in her father’s face in particular.</p><p>Five more years.</p><p>She sighed deeply as she smoothed lotion over her body, paying particular attention to the waxed folds of her cunt and her firm breasts. Her nipples were peaked and hard, her flesh sensitized as she remembered Jared’s touch.</p><p>A small smile tipped her lips as she shook her head, drawing her hands firmly away from her body and picking up the blow dryer. The unruly mass of long, red gold curls took forever to dry. But she loved the sensuous feeling of it as it slid over her bare back and curled around her shoulders. She felt feminine, desirable. And when Jared’s fingers threaded through it, flexing and tugging at the long strands, sending shards of pleasure and intense sensuality erupting along her nerve endings like wildfire, it increased the wanton sensations.</p><p>He was a creature of sexuality, of pleasure. A grin tugged her lips at the thought. Jared would understand why it felt good to lay naked in the sun, or to swim nude in the ocean. He might not do it, man that he was, but he would understand her need to do it.</p><p>A frown tipped her brow at that thought. Why should she care if he understood? He wouldn’t be a part of her life; she couldn’t allow him to be a part of her life. Five years could be an eternity if she let her emotions for Jared get out of hand. Or it could slide by without a ripple if she kept her heart free.</p><p>She had a feeling though, her heart was already involved.</p><p>She flipped off the dryer and laid it carefully on the sink as she closed her eyes, drawing in deep, controlled breaths. Just the thought of him made her more aware of her own body and the satisfaction she was denying it.</p><p>She had accepted years ago that she would be tormented by the same desires that her father claimed were demons inside her mother. An intense sexuality, a need to be touched, a need to feel more than just a tame caress from her lover.</p><p>She wanted to be spanked. She loved having her ass opened, feeling a cock boring deep inside that forbidden entrance. Having her nipples roughened, her hands restrained. And the thought of experiencing those acts with Jared sent moisture weeping desperately from her vagina.</p><p>“Now there’s a look that could bring a grown man to his knees.”</p><p>Kimberly breathed in roughly as she jerked around, staring back at Jared as her blood began to race through her veins, her heart pounding in double-time to the throb in her clit.</p><p>“You don’t believe in knocking?” she asked him, wondering at the husky pitch of her own voice.</p><p>He leaned against the doorframe, crossing his arms over his chest, and watched her intently as she pulled the blue silk robe from the hook beside the sink and shrugged into it.</p><p>“It’s my house,” he excused himself with an amused smirk as she belted the robe.</p><p>“Lord of the manor, huh?” she asked him with a smile, her gaze going over his tall body, and feeling the helpless femininity he never failed to inspire in her.</p><p>“If I can get by with it.” His eyes gleamed with laughter as the sensual curve of his lips deepened.</p><p>She shook her head, feeling something inside her loosen and lighten with his laughter.</p><p>“You’re too arrogant for your own good,” she warned him then. “One of these days, someone is going to knock you down a peg or two, Jared.”</p><p>He grunted at that, a sound of disbelief and superior male self-assurance all in one.</p><p>“You can try if you want, baby,” he told her, the smug smile firmly in place as his gaze went over her body. “The struggle could get interesting.”</p><p>Kimberly licked her lips as she fought the nervousness determined to attack her system. Nerves or uncontrolled arousal, at this point she wasn’t certain which it was, the only thing she knew for certain was her inability to fight the attraction building between them.</p><p>“Think you’ll win, do you?” she asked as she approached him slowly, watching his eyes narrow, darken with lust.</p><p>“Definitely.” His voice was laced with such arrogance she didn’t know if she wanted to grit her teeth in irritation or laugh at the subtle challenge she knew he was deliberately laying in front of her.</p><p>“And what is it you’re playing for?” She stopped directly in front of him, staring up at him, determined to stay as cool and amused as he appeared.</p><p>She could feel the subtle undercurrents though, the tension rising between them as her breasts became more sensitive, her nipples harder. She could feel him, his very presence, sinking into her. It was a strange, oddly comforting feeling, and all the more terrifying for it.</p><p>His lips tilted self-mockingly as his eyes gleamed with rueful laughter.</p><p>“Whatever the hell I can get,” he growled as he reached out for her, his expression changing abruptly from amused arousal to hard, driving lust.</p><p>Before she could do more than gasp his name, he was pulling her through the connecting door and into his bedroom. She had a quick impression of heavy, dark wood furniture, reflected in the dim light from the bedside table before he picked her up and tossed her on the thick mattress of the bed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kimberly came to her knees quickly, her eyes narrowing as she watched him unbutton the dark blue cotton shirt he wore. His deeply tanned fingers worked at the buttons quickly, freeing the cloth before shrugging it from his muscular shoulders.</p><p>She had no intentions of fighting him. No desire to delay the promise she could see glittering in his dark gray eyes. Her lips opened then, her tongue peeking out to dampen the curves as his hands went to the belt of his jeans.</p><p>“Am I about to be ravished?” she asked him huskily while her heart raced out of control.</p><p>His lips quirked in a sideways smile that had melted her heart for a year. Did he know, she wondered, what that smile did to her?</p><p>It warmed her heart, heated her arousal and made her feel like the most beautiful woman ever created. A smile she considered hers alone, simply because she had never seen him smile in such a way with anyone else.</p><p>“Ravished, ravaged, eaten alive,” he growled. “You have no idea, Kimberly, just how eager I am to possess that sweet little tush of yours.”</p><p>His words shouldn’t have sent heat striking forcefully into her womb, but that was exactly what they did.</p><p>Then her breath caught in her throat as he loosened his jeans and began to push them from his lean hips, revealing the full extent of his arousal. His cock was fully erect, engorged with his need for her. She watched, entranced, as the fingers of one hand encircled it, stroked slowly as he kicked the jeans away and advanced on the bed.</p><p>“Take the robe off.” His voice was deep, dark. A forbidden vein of emotion throbbed beneath it, making her throat tighten in response.</p><p>Her fingers fumbled at the belt for a second before the loose knot came free, allowing the edges to fall apart until they draped enticingly over the swollen curves of her breasts.</p><p>Her nipples ached, burned for relief. The weight of the gold rings that pierced them was more pronounced, an erotic little pain that reminded her of the rasp of his teeth against the sensitive points.</p><p>“Take it off,” he ordered again, watching her from beneath lowered lids.</p><p>“You take it off.” She was breathing so harshly she could barely say the words.</p><p>That smile. It flashed again, slightly crooked, a bit boyish.</p><p>He was having fun. That knowledge was nearly as strong as the arousal. He was having fun with her. Had anyone ever had fun with her? She was sure they must have, but she had never felt the knowledge that they were like she did now.</p><p>“A dare.” He appeared to approve. “I think I can handle that, Kimber...” He caught her ankles, pulling her to the edge of the bed with a quick movement. “But can you?”</p><p>She expected another of the hard, hungry kisses he destroyed her mind with. Expected him to consume her. Instead, he destroyed her.</p><p>He rested his forehead against hers, staring into her eyes, allowing her to see the shifting color, the unchecked emotion, the essence of him as his hands moved to her shoulders and began to slowly, gently ease the silk from her.</p><p>“Jared...” Chills of pleasure raced over her body, making her shiver at what she saw, at what she felt.</p><p>She blinked back tears, and yet didn’t understand why they welled in her eyes, why she felt shaken to the very core of her being.</p><p>“Your eyes are darkening, baby,” he whispered roughly. “I can see the heat rising within you; see the need growing to a fever pitch. Do you know what that does to me? How hard it makes me to know I can turn those pretty green eyes almost black with hunger?”</p><p>The silk slid over her hands as she lifted her arms, pooling about her hips as she raised her hands to his face. Her fingers touched his lips. Trembled. They were warm, not moist or slick but like heated velvet against her fingertips.</p> <p>She whimpered, her lips parting with a soundless cry as his eyes darkened in turn. Stormy. Like the turbulent center of a storm she feared she would never survive.</p><p>She shuddered then as his hands moved as well, cupping the swollen weight of her breasts, his fingers rasping over the hard nipples and sending flares of white-hot heat spearing to the depths of her pussy.</p><p>She was burning alive. She could feel the blood racing through her veins, boiling with the intensity of sensation building within her. A touch shouldn’t do this, she screamed silently. It shouldn’t wrap her, not just in pleasure, but in an emotion that terrified her.</p><p>“I could touch you forever.” His lips moved against her trembling fingers, his breath a caress she felt clear to her soul. “You’re like hot silk and satin, as seductive as sin itself, Kimber.”</p><p>His head lowered then, turning to brush her fingers against his chin, to nudge them aside as he sought her lips in a kiss so soft it was like the caress of fairy wings against hers.</p><p>“Touch me, baby,” he whispered the heated plea against her lips. “Touch me, Kimber, like we’ll never touch again...”</p><p>Like he was touching her.</p><p>Chapter Twelve</p><p>Each touch was another layer of emotion, of pleasure. It was an unspoken vow, a memory Jared knew he would never be free of.</p><p>He watched her eyes; the dark green depths were liquid with her rising passion and the heat and hunger filling her body. Her face flushed, her lips becoming fuller as he nipped at them.</p><p>“Are you going to tease me to death?” she asked him huskily as he bent to her, his hands smoothing over her shoulders, her back. Had he ever touched anything or anyone as soft as Kimber?</p><p>“It would be my pleasure,” he growled, restraining his smile at her soft expulsion of laughter.</p><p>“That wasn’t what I meant,” she informed him, her voice breaking on a moan as his fingers tested the lush fullness of her hips. “I’ve been teased enough, Jared. I need you.”</p><p>He could hear the hunger that raged through his own body, heating her voice. Yes, she needed, just as he needed, wanted, craved. She was the air he breathed now, the beat of his heart. Letting her go would eventually destroy him.</p><p>“Move up.” He gripped her hips, easing her further up on the mattress as he spread her out before him. “This is my fantasy,” he told her roughly as he drew the strap he had anchored to the center of the headboard to the middle of the bed. “Give me your hands now.”</p><p>The long leather strap held two Velcro cuffs at the end. It would allow him to turn her to either her back, or lay her on her stomach without worrying about readjusting the position of the restraints.</p><p>He watched her eyes go wild with excitement, her nipples tightening further as a whispering moan left her throat.</p><p>“Oh yes, you like this don’t you, baby.” He smiled tightly as he raised her arms and strapped her wrists into the restraints. “I like this too, Kimber. Having you helpless beneath me, unable to fight your needs, or mine. Seeing you go up in flames has to be the most beautiful sight in the world, baby.”</p><p>And it was. Jared could think of nothing more exciting, more arousing, than Kimberly’s lust. He wanted to fuel it, wanted to see how hot, how high he could make her burn.</p><p>He watched her tug at the restraints, saw her realization that unlike those at The Club, there was no escape from the ones he used. She strained against them, her body arching as lust began to overwhelm her.</p><p>“There you go,” he whispered as his hand smoothed between her breasts to the rounded contours of her abdomen. “Go wild for me, Kimber,” he encouraged her as his cock strained for relief between his thighs. “You’re nice and safe here. No one can see you, no one will take anything you can’t give. This is just for you, baby, all for you...”</p><p>Her lust was for him, though. He saw the desperation begin to glitter in her eyes as he reached for the items he had laid out on the bedside table earlier. The tub of lubrication gel, the little vibrating butterfly he would attach around her thighs to rest against the swollen protrusion of her clit, the remote that would activate the different levels of stimulation it was programmed for.</p><p>“Now, let’s spread those pretty little thighs.” He forced her legs apart, smiling tightly as she resisted, bucking against him as her hot little moans fueled his own passions.</p><p>Jared moved between her thighs, holding them apart with his own as his hands gripped the upper portion, his thumbs within inches of her glistening pussy. The silken folds were unfurling, a soft blush pink thick with the nectar of her passion.</p><p>His mouth watered at the sight of the soft, feminine passion fruit. He moved his hands closer, his thumbs pressing back along the outer lips, watching the little slit widen to reveal the rosy, cream-laden interior.</p><p>Kimber was twisting beneath him now, her hips arching as she tried to force the aching flesh firmer into his touch.</p><p>“Stay still,” he growled, raising one hand and allowing it to fall firmly on the pad of her cunt.</p><p>“Oh God. Jared...” She cried out his name as her hips bucked higher, flinching from the pleasure rather than the pain.</p><p>Perspiration dotted her face, her breasts, her soft little tummy.</p><p>“You like that, don’t you, Kimber.” He tapped at the delicate flesh again, relishing her lusty growl of feminine demand.</p><p>His fingers trailed along the slit as he lowered himself along the bed, tucking his cock carefully beneath him as the thick flesh throbbed painfully.</p><p>“Spread your thighs wider, Kimber, or I might have to forget about the little treat I’m dying to taste here. I have to be able to get to it, baby,” he warned her, keeping his voice rough, with an edge of danger.</p><p>She shivered at the sound, but spread her thighs wide, opening the soft folds further. The tiny entrance to her vagina tempted him, causing him to draw in a hissing, hungry breath. He couldn’t fill her there with his cock, but he would make certain he fucked her insane with his flickering tongue.</p><p>“Lift up.” He placed a hand beneath her buttock, enforcing the demand as he dragged a thick cushion from the bottom of the bed.</p><p>It was pillow-sized, but firmer, ensuring that her hips remained elevated for what he had in mind. He pushed it beneath her hips, leaving the lower portion of her buttocks without anything to hamper his desires.</p><p>His gaze met hers as he lifted the tube of lubrication then and spread the gel along his fingers. She could barely hold her eyes open, the excitement was rising so high. They lay at half-mast as she fought for breath while the storm of pleasure raged inside her body.</p><p>“Are you ready for me, baby?” He smiled down at her, feeling emotions he had never thought he would know with another person. The emotions his father had once described that he felt with his mother.</p><p>Tenderness, passion, a wild hunger that no other woman would ever be able to sate. He had been born for Kimberly alone. As trite as it sounded, as much as it went against the hard-edged warrior philosophy he had always lived by, still, he knew it to be the truth. He lived to love her.</p><p>“Jared...” She screamed his name, causing his cock to spill a silky stream of cum at the excitement that shot through his own body then.</p><p>Her voice was hoarse, ragged, the sexual hunger like a living thing inside her as his tongue slid through the narrow channel of her pussy and his fingers tucked against the puckered opening of her anus.</p><p>He felt the taut muscles of her ass flexing, drawing at his fingers as he held them against her while his tongue began to lick at the quivering folds of her pussy, drawing the sweet, seductive nectar deep into his senses.</p><p>Her clit throbbed against his tongue, her hips bucked against his caresses as her voice became thicker, pleading, drawing him deeper into the sensual spell she cast over his heart and his loins.</p><p>She tasted sweet and spicy on his lips, the flood of her juices only spurred his own lusts higher, made him crave more and yet more of the seductive screams that erupted from her throat.</p><p>His tongue circled her clit, his lips sucked at it, drawing it into the heat of his mouth and working it with tender, firm motions. He drew her to the very edge of reason, then slowly drew her back, grimacing at her pleading little moans. His fingers slowly, slowly began to finally sink inside the reflexive clasp of her anus, feeling her open for him, the sensitive tissue stretching for first one finger, then another. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her hips strained against the impalement, pushing them deeper as her hands gripped the short strands of his hair and fought to hold him to the straining bud of her clit.</p><p>He growled against her flesh, feeling her flinch with the impending orgasm a second before he went lower. His tongue rimmed the convulsing entrance to her pussy a second before he began to push it slowly inside her.</p><p>One gentle thrust, then another, he filled the entrance, pressed against the tightened muscles and felt her unravel beneath him. Her climax exploded through her, sending her sweet cream rushing to his mouth as the tight tissue surrounding his thrusting fingers began to quiver in response. She shook apart, burning like a flame as she erupted in her pleasure.</p><p>Jared didn’t give her time to ease down from the storm riding her. Before she could pulse in yet another explosion, he was on his knees, his fingers spreading a thick coating of the lubrication over his cock as he lifted her feet to his shoulders, tucked his cock at the rear entrance and began to press forward.</p><p>Kimberly was lost in the orgasm that continued to shudder through her as she felt the thick width of Jared’s cock begin to press against her anal entrance. Fire shot through the nerve endings there as pleasure and pain converged, swamping her senses and pushing higher despite the release that still shook her body.</p><p>She was only barely aware of him donning the condom before he began entering her, but it in no way affected the sensations ripping through her.</p><p>Fiery heat filled her anus as the flared head of his cock opened her ass wide and began to push deeper, deeper inside her. She could feel every vein, every thick inch pushing inside her, caressing sensitized tissue, sending electrical shards of sensation ripping through her body to explode in sizzling bursts of hunger deep inside her pussy.</p><p>Her hands gripped his wrists where he held her thighs open, her feet resting on his broad shoulders as he stared down at her intently. She could feel the tension gathering in her body, in his body, as slowly, inch by torturous inch he filled her to overflowing.</p><p>“God, I’m worse than a kid with his first woman,” he panted above her as his cock throbbed imperatively within the tight clasp of her anus.</p><p>“Jared.” The excruciating pleasure/pain building within her was more than she could bear. As though the excess juices that flowed from her pussy was desensitizing her yet driving her higher, hotter. She needed more to climax now; she needed the sharp, painful sensations to drive over that furthest edge.</p><p>“I know, baby,” Jared groaned as he lifted the vibrating butterfly from the bed.</p><p>With quick, expert movements, he attached the straps to her thighs before positioning the powerful little device over her clit.</p><p>“Get ready, baby.” He smiled down at her as she watched him with wide, innocent eyes. She had no idea where she was about to fly.</p><p>He flexed his hips, dragging his cock back to the entrance of her tight ass before he flipped the vibrator to its highest setting and plunged inside her again. He knew the sharp, electrical pulses that would attack her sensitive bud would send her screaming toward climax as he raided the hot back channel.</p><p>It did just as he anticipated. Her entire body stiffened for a second as her anal muscles locked on his thrusting cock. Then her scream rocked his soul as her release tore through her. Over and over she clenched and jerked against him, the rhythmic milking of her ass on his cock destroying his own control until he plunged inside her one last time and spilled his seed into the latex covering he had barely remembered to don.</p><p>His chest heaving for breath, his release shuddering through him, Jared collapsed over Kimberly’s shuddering body, groaning in regret as he forced himself to ease from the tight clasp and dispose of the latex protection.</p><p>Weakly, he released the stras to the butterfly and removed it from her quivering body. The restraints came next. He pushed the strap back and pulled Kimberly gently into his arms. His hands smoothed down her back, soothing the shuddering tremors, the little whimpers she emitted every so often.</p><p>“Okay?” he panted as he whispered a kiss over the top of her head.</p><p>“...dead...” she muttered. “Shuttup and let me rest in peace.”</p><p>He chuckled. A rough, exhausted sound that refused to be held at bay.</p><p>“Rest, baby,” he grunted, jerking the comforter from the foot of the bed and drawing it over them before collapsing against the pillows.</p><p>He would get her up for a shower soon. For now, he wanted just this. Kimberly sleeping against him, holding her tight in his arms, the scent of her filling his senses. His eyes closed, his body relaxed against her and followed her quickly into sleep.</p> <p>Chapter Thirteen</p><p>Keeping up with Jared on the farm would have been an impossible task if he hadn’t been willing to let her keep up with him. By afternoon, she was dragging with exhaustion and all she had done was follow from one point to another as he oversaw what she was learning was a vast operation.</p><p>Was there anything he didn’t do?</p><p>First thing that morning he was meeting with some poor farmer who was convinced that the sperm of a prize bull Jared owned was worth more money than Kimberly made in a month. She had sat and listened in amazement as a deal was reached, a check was written out, and some misguided fool left with a test tube of cow soldiers for a price that should have been illegal.</p><p>“Highway robbery,” she accused Jared under her breath as the happy little man left with a broad smile on his face.</p><p>“Do you have any idea how much I paid for that bull?” He arched a brow as he stared down at her in amusement. “Trust me, sweetheart, Mr. Cunningham got a good deal, and he knows it.”</p><p>Kimberly snorted. “I saw a lot of cows on my way here, Jared,” she said, fighting to hold back her laughter. “He could have stopped on the way, jacked one off and gone home without losing a fortune. No wonder farms are failing across the nation; you guys don’t let the poor critters breed the natural way.”</p><p>He swatted at her rear, laughing as she jumped out of his way and tossed him a saucy grin in reply.</p><p>“Woman, you’re a menace,” he had growled, catching her to his chest and dropping a quick kiss to her lips. “Come on, I have to check on the horses before we head back to the house for lunch. I have a ton of paperwork waiting on me.”</p><p>Kimberly was still waiting for lunch. She propped her foot on the lower rail of the corral and watched at he talked to the foreman. His sun-bronzed face was creased into a thoughtful expression, his sensual, slightly fuller lower lips had tightened, the five o’clock shadow had come early to his chin, giving him a dangerous, sexy look. She wanted to drag him back to bed, run her hands over his body, and lick him from head to toe.</p><p>She had nearly accomplished that task earlier that morning. Unfortunately, she made it as far as the thick length of his cock and became sidetracked by the power and promise in that hard flesh.</p><p>She propped her hands on the upper rail of the fence, rested her chin on them and wondered what the hell she was going to do now. She was falling in love with him. Hell no, she wasn’t. She was already in love with him; had been for nearly a year now and had refused to admit to it.</p><p>Was it his smile that first invaded her heart? That quirky, crooked little smile that he seemed to have for her alone? Or was it his eyes, a stormy gray one minute, a soft, gentle slate the next? No, it was all of him—his teasing, his gentleness, the many ways he had found to make their meetings special, to give them an air of fun no matter how crazy he made her. There was something about him; as hard and dangerous as she sensed he could be, she could also see the soft, inner core of him.</p><p>The buzzing of the cell phone at her waist jerked her quickly out of her thoughts and back to reality. Jerking the little device from its holder at her side she quickly checked the caller display and grimaced in distaste before flipping the receiver up and connecting to the call.</p><p>“I’m on assignment,” she said coolly. “What do you want?”</p><p>There was a moment of silence across the line.</p><p>“Typical response.” Her father’s voice was as righteous and prim as ever. “Are you ever not on assignment, Kimberly?”</p><p>“Not if you’re calling,” she assured him.</p><p>“You should be here at home, where I can see you properly protected,” he snapped. “I should have known better than to expect you to take a reasonable course of action. Thankfully, Carolyn’s son might be a pervert, but he is trained where you’re lacking.”</p><p>Boy, was that the truth. Kimberly grinned at the sensual knowledge, though she knew her father was talking about an entirely different matter.</p><p>“Yes, I’m alive. Jared is alive. The bad guys haven’t won yet. Anything else?”</p><p>There were days she felt a flare of guilt for the animosity she showed the man who should have been her father. His caustic attitude and sniping tone never failed to dissuade her from the feeling though.</p><p>She heard the shuffle of papers through the phone line, felt the tension that suddenly invaded it.</p><p>“Stay out of his bed, Kimberly.” His voice, when he spoke again was hard and icy cold. “I’ll never approve a marriage to him and I doubt seriously that a man of Jared’s temperament will be willing to wait the required five years. Don’t make the mistake of thinking you can play him as easily as you think you can play everyone else.”</p><p>Why did it still hurt? For a moment, she was amazed at the ever-present slice of pain that struck her chest whenever he revealed his contempt of her.</p><p>“Did you receive the doctor’s report last week?” she asked him rather than answering his accusation.</p><p>“Of course,” he snarled. “They are sent directly to me.”</p><p>“Then I will assume you are aware I am still a virgin,” she said sweetly. “Until the reports say otherwise, anything I do and whoever I do it with is none of your concern. Correct?”</p><p>The blatant, falsely sweet tone of her voice would have his face turning red, his hazel eyes nearly bulging. She felt a flare of satisfaction at that thought.</p><p>“You think this is about no more than the tests?” he raged. “You are as corrupt...”</p><p>“Don’t say it.” She couldn’t bear to hear it. Not now. “I’ll hang up the second you do. If you don’t have anything pertaining to this assignment to say, then I’ll hang up so fast you won’t know what’s hit you.”</p><p>“He shares his women, Kimberly, shares them with his friends and God knows who else. No daughter of mine will be part of that.”</p><p>She wished she wasn’t his daughter. It would have made things much easier on her.</p><p>“When you’re ready to be a father, rather than a moral barometer, be sure to let me know.”</p><p>She disconnected the call slowly as she stared across the corral at Jared. He was staring back at her with a frown, one that didn’t ease when she sent him a quick smile. Her father’s accusations flitted through her mind, reminding her of who and what Jared was. A member of The Club. A man whose sexuality was so far advanced, so out of any other male’s league, that the sheer scope of it sent her pulse racing.</p><p>Yes, if he possessed her, he would share her. He would pick a third, just as the other members of The Club did, and he would share her, stroke her every fantasy and give her a freedom to enjoy it that most women could only dream about.</p><p>Did it make her love him less? It made her love him more. It made her hurt more, because no matter how she might dream, or how often she assured herself that five years wasn’t that long, she knew better. It could be a lifetime.</p><p>“Kimber.” He stood on the other side of the fence now, watching her worriedly, his brow furrowed into a concerned frown. “Everything okay?”</p><p>“Fine.” She swallowed tightly as she stemmed the tears and the knowledge of everything she was being denied. “Are you hungry yet? Lunch was an hour ago, Jared. I think I’m starved, it’s been hours since breakfast.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She knew by the narrowing of his eyes that she wasn’t hiding anything from him. For the first time in her life she was faced with someone she couldn’t fool.</p><p>“Kimber.” He reached across the fence, his hand cupping her cheek and only then did she feel the slight dampness that had fallen from her eyes to her cheeks.</p><p>Her smile fell.</p> <p>She licked her lips, staring up at him regretfully, aware of the rising emotion that began to fill the air.</p><p>“I want too much,” she finally whispered. “As always, I just want too much.”</p><p>She turned away from him then and rushed across the barnyard, heading for the house. She couldn’t face him any longer. Couldn’t face the past, the future without him, or the demands suddenly whipping through her. She couldn’t face Jared, or she would never survive the choice she had sworn she would make.</p><p>Chapter Fourteen</p><p>Jared watched as Kimberly stalked back to the house. He could see the tension in every line of her body, had seen the hopelessness blooming in her gaze. He propped his hands on his hips and shook his head helplessly.</p> <p>He had learned patience while in the service. Had learned to sit and wait for what he wanted, what he needed. And though waiting on Kimberly went against every possessive instinct he had, he would do it. But that didn’t mean he would watch her suffer.</p><p>The sexual tension and anger raging inside her was her own worse enemy. Even with her visits to The Club, she hadn’t yet learned how to control that intensity and anger, or how to relieve it.</p><p>A smile crossed his lips as he pulled his cell phone from his belt and hit the speed dial for The Club.</p><p>“Let me talk to Ian,” he said quietly when Thom came on the line.</p><p>Ian Sinclair was the owner of The Club. The inheritance had merely stroked the fires of the other man’s sexuality. He was the perfect third for what Jared had in mind.</p><p>“Jared, you’re slacking.” Ian’s voice was rough, a deep lazy rumble that did nothing to disguise the powerful enemy he could become.</p> <p>Jared snorted. “Not hardly. But we’ll talk about that later. I need a favor.”</p><p>“A favor?” Amusement crept into Ian’s voice. “This sounds interesting.”</p><p>“You have no idea,” he sighed. “I need a third.”</p><p>Silence filled the line then. It was a well-established rule that Ian did not participate as a third. A first perhaps, the dominance the other man possessed rarely allowed him to take a backseat in anything.</p><p>“Why?” he finally asked.</p><p>Jared explained the situation briefly, keeping his voice level, his driving need banked. But damn if Ian wouldn’t be perfect to join him on this adventure into Kimberly’s sexuality. He was restrained, perfectly in control, and despite appearances, a compassionate man.</p><p>Once again the other man was quiet. Silence stretched between them for long minutes.</p><p>“Son of a bitch,” he finally muttered. “Remind me to back whoever’s running against the Senator in the next election.”</p> <p>“Let’s keep politics out of it,” Jared sighed. “Mother’s backing him so I don’t even want to think about losing here.”</p><p>Ian snarled. There was no other way to describe the curse that sizzled across the lines.</p><p>“Anal or oral sex is a very poor second to the real thing, Jared,” he sighed.</p><p>Jared knew that well. He was walking around with a hard-on that would eventually kill him. No matter how many times he took her ass or her sweet mouth, he knew he would never know real satisfaction until he managed to fuck her hot little pussy.</p><p>“It’s her only option right now, Ian,” he growled.</p><p>“So let me get this straight,” he sighed. “No vaginal, period. You know, don’t you, that we’re both going to have a case of blue balls from leaving that pretty little cunt untouched.”</p><p>Jared grinned. “Yeah, that pretty much describes it. Come on, Ian, you can get your rocks off anytime. This is Kimber we’re talking about. She needs this.”</p><p>She was a member of The Club, and a woman, and that gave her a certain standing with Ian. It meant he had personally selected, invited and approved her. He likely knew more about the situation than even Jared did.</p><p>“Why did I know this call was coming?” he finally asked Jared with a thick vein of amusement. “How will you get rid of the bodyguards? The bedroom is the wrong place for this, Jared. If you’re going for intensity, you’re going to have to add that extra level of danger for her while keeping her in the security of your home. Otherwise, I would suggest bringing her here to The Club.”</p><p>“No. We’ll use the living room here.” Jared shook his head at the alternative. “I have a few of the men from my old team here. We’ll arrange the particulars, you just be here.”</p><p>“Blindfold her, it will roughen the edges of her security.” Ian’s voice deepened further, indicative of his interest and arousal. “I’ll be there at ten.”</p><p>Jared’s cock jerked in the confinement of his jeans. Ian had forgotten more about stroking a woman’s arousal and submissive instincts than most men would ever consider.</p><p>“I’ll have everything ready.” He smiled slowly, envisioning the evening ahead. “See you at ten.”</p><p>He disconnected before turning his head to stare back at the house. There was Adams skulking around the house again. Matthews and Danford were watching him with a frown from their positions. That left the fourth man in the house, most likely watching Kimberly.</p><p>Bastards. Lowell and Adams were riding his last nerve and if they weren’t careful they would find themselves finishing out this assignment locked in the basement. He paused at the thought. That wasn’t a bad idea, actually. Matthews and Danford he could trust. The other two were the problem.</p><p>Yes, the basement was beginning to look better every minute.</p><p>Kimberly could feel the tension growing in her. It was worse than before. Like a bone-chilling craving she couldn’t identify and had no hope of fulfilling. Was this how her ancestors felt? Those women who had been restricted from fulfilling the heightened sexuality that tormented her.</p><p>A curse they had called it. She poured a cup of fresh coffee as she breathed out roughly, stilling the trembling in her fingers as she carried the cup to the kitchen table. It was worse than a curse.</p><p>She stared through the window, watching Jared as he worked around the barns. Lean hipped, muscular. He moved with a grace she had rarely seen in other men, and he mesmerized her.</p><p>Why was he different? Why had he been the one to slip under her guard and steal her heart?</p><p>She turned away from him, her hands wrapped around the cup as her head lowered, eyes closing.</p><p>She wanted so much more now than she had ever dreamed of. Before learning the terms of the Trust, before the betrayal of the exams, she had decided she would never endure the pain her mother had known. Her virginity had been a matter of pride. Her self-respect and her determination to know a life opposite of her mother’s had often been all she’d had to hold on to.</p><p>After the shock of the examinations she had fought back in the only way she knew how. Smug, triumphant, she had learned she could have her cake and eat it too. She could assuage the lusts that built within her body and still pass the tri-monthly tests her father demanded.</p><p>And that had been enough. Until Jared.</p><p>“What now?” she whispered, her gaze returning to the window, to the man. “What do I do now?” Because she knew it was no longer enough, and it never would be again. Now, she wanted it all.</p><p>Chapter Fifteen</p><p>“Kimber.” Jared’s voice had her breath catching hours later as she walked out of the bathroom, tightening the belt of her robe.</p><p>He stood across from her, leaning against the footboard of the bed, his gaze dark, heavy-lidded, his jeans straining at the crotch.</p><p>Kimberly stopped in the middle of the room, watching him somberly.</p><p>“I’m sorry about earlier,” she whispered. “Sometimes I...” She waved her hand, grimacing at her reluctance to explain the turbulent emotions that filled her.</p><p>A gentle smile quirked his lips.</p><p>“That’s okay,” he said softly. “I’m not upset, but I do think I’ll punish you for it.”</p><p>She stared back at him in surprise.</p><p>“Excuse me?” Her heart began racing in her chest as she interpreted the dark expression that came over his face.</p><p>Now he looked dominant, dangerous. A shocking thrill shook her body, making her tremble in awareness.</p><p>“The house is empty and will be for the rest of the night,” he began to explain, his voice deep, throbbing with arousal. “You’ll keep your virginity, Kimberly, but the rest of you belongs to me. Unconditionally. Agreed?”</p><p>She swallowed tightly.</p><p>“How?” She licked her lips nervously.</p><p>He shook his head firmly. “It doesn’t matter how. All I need is your agreement. Unconditional surrender, Kimberly. Can you sacrifice your control for tonight? No matter what happens, no matter what I ask.”</p><p>She could feel her body responding to the heat in his eyes, the arousal and demand in his voice. Her clit ached unlike anything she had known in the past. She could feel her vagina moistening, spilling her juices along the folds of flesh beyond.</p><p>Her breasts were swelling, her nipples becoming hard and sensitized beneath the silk of her robe.</p><p>“All control?” she asked weakly.</p><p>She had never dared to attempt such a thing before.</p><p>“All control, Kimberly.” He would demand nothing less.</p><p>She fought to breathe normally, but the rising excitement made it impossible. Her breasts were rising and falling harshly, the blood pumping fiercely through her veins.</p><p>Kimberly pushed her hands deep into the pockets of her robe, staring back at Jared intently. What did he have in mind? He wouldn’t hurt her, he wouldn’t breach her virginity. What was left that she would need to surrender her control?</p><p>“No explanations, Kimberly.” He forestalled her request for just that. “Either you trust me or you don’t. There’s no in-between.”</p><p>“I trust you.” There was no question of that.</p><p>He smiled again, a crooked, tender smile that caused the muscles of her stomach to clench in response.</p><p>“Come here.” He held out his hand to her, though there was nothing so weak as a request. It was a demand.</p><p>She stepped forward slowly, taking his hand, expecting him to pull her into his arms. She was surprised when he stopped her inches from his chest.</p><p>“I’m going to blindfold you,” he said firmly. “You will leave it on, no matter what. Agreed?”</p><p>She had never been blindfolded. She had never been stripped of even the security of her sight. She shuddered at the demand but nodded in compliance.</p><p>Jared touched her cheek with the pads of his fingers before leaning close to touch her lips with his.</p><p>“I’ll blindfold you here, then carry you to another room. Your safe word is sacrifice; by saying it, you’ll sacrifice a pleasure, baby, unlike anything you’ve known yet.”</p><p>What could he have planned?</p><p>Kimberly nodded jerkily, trembling before him as he picked up the black eye mask from the bed and pulled it over her head. It covered her eyes only, the elastic fitting snugly at the back of her head and blocking all light.</p><p>“I’ve never done this, Jared.” She reached for him, her hands gripping his forearm desperately as she became lost in a world of darkness.</p><p>“I know, baby,” he whispered. “Just let go. I’ll take care of you.”</p><p>She stilled at the small, almost hidden vein of emotion in his voice that she caught then. Despite the arousal, the absolute pleasure, underlying the dominant satisfaction was...sadness?</p><p>“I’m going to pick you up,” he told her a second before he swung her in his arms. “You don’t have to do anything yet, Kimber. Just relax.”</p><p>Relax? She was blind and becoming paranoid. His voice was making her crazy. What was that emotion, that hint of something in his tone that sent a shaft of pain piercing her heart? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She gripped his shoulders as he cradled her against his chest and began to walk. She tried to picture the path in her mind, but the turns he made didn’t make sense, unless he was trying to deliberately disorient her.</p><p>“Are you going in circles?” She tried to smile, but felt her lips trembling in the attempt.</p><p>“Of course.” She heard the smile in his voice. “Where would be the fun in it if you knew where you were?”</p> <p>He was demanding the complete sacrifice of every shred of control she possessed. And she was giving it to him. That was the part she found truly amazing. She had no qualms in giving it to him, to trusting him to care for her, to protect her.</p><p>They stopped moving, and after a pause, she felt him stoop to lay her on the thick comfort of a well-padded mattress. She lay still, listening.</p><p>She heard the sounds of him undressing as she shifted against whatever bed she lay on. She wanted him naked, wanted him taking her. She could hear him beside her, but she could feel movement on the other side. A depression to the mattress that made no sense.</p><p>“Jared?” She swallowed tightly as she called out to him.</p><p>“Yeah, baby.” He answered from the position beside her, just as she had heard him.</p> <p>She whimpered as she felt hands at the robe. Confident, self-assured, they began to loosen the belt. And it wasn’t Jared.</p><p>“Oh God,” she whimpered as the strap loosened and the edges of her robe fell to her side.</p><p>Calloused, broad hands lifted her, smoothing the material from her as she shuddered in the grip.</p><p>“Easy, Kimber.” It was Jared who smoothed back her hair from her neck, uncovering her breast to another’s gaze.</p><p>She was shuddering, trembling from the inside out with reaction. The hands smoothing along her sides were warm, not rough, but firm, demanding. When they covered her breasts a tremulous cry escaped her lips as her womb convulsed in pleasure.</p><p>She knew nothing but sensation. Nothing but touch, sound. Her hands fisted in the sheet beneath her as she arched to the touch, Jared’s name bursting from her lips in a plea for what, she wasn’t certain.</p> <p>“Damn, you’re pretty, Kimber. The most beautiful sight I’ve seen in my life.” Jared’s voice was filled with adoration as he came down beside her, his hand cupping her jaw, turning her head to him. “I want to see you burn, baby. Burn for me...”</p><p>Male hands spread her thighs as Jared’s lips came over hers. She screamed into his kiss as lips, hungry and intent covered the soaked folds of her pussy.</p><p>Kimberly could feel her body shaking, shuddering with pleasure as Jared’s hand spread through her hair, gripping the strands and pulling erotically as his tongue danced around hers.</p><p>His kiss fed her arousal, fed the wild, untamed fire that burned low in her belly, sending her rocketing into a place of sensation that she had never known existed. Whoever fed from her cunt, licking, sucking, his tongue spearing inside her to fuck her with shallow lazy strokes, was a master at what he did. But there was no pleasure greater than Jared’s kiss. Then his lips at her breasts, his tongue stroking her nipples, teeth rasping them, tugging at the little gold rings that pierced them.</p><p>Below, between her spread thighs, invading male fingers pressed into the narrow channel of her anus, lubricating the tight little hole, stretching her with sensual, slow strokes.</p><p>Blind, her other senses now took over, becoming more sensitized, clearer than ever before. She lifted her hips, bearing down on the fucking fingers as she screamed against the pleasure shaking her soul.</p><p>“Yes, baby,” Jared urged her pleasure higher. “Burn, sweetheart, let me see you burn.”</p><p>Her nails bit into his scalp as he sucked at her nipples until his hands gripped her wrists and slammed them to the mattress. She was restrained, helpless beneath them and she burned.</p> <p>“Let me come,” she was screaming the demand, arching to the lips sucking erratically at her swollen clit.</p><p>No sooner than she thought her peak would be reached than the lips gentled, lessening the pressure and easing the tightened muscles of her womb.</p><p>“Not yet, darlin’.” The voice was deep, so deep it rasped over her nerves and sent her shuddering in response. “I like to play, Kimberly. For a long time...”</p><p>His tongue swiped through her exposed slit before playing demonically with the little ring that circled her clit. At the same time, Jared pulled at the rings on her nipples. One with his mouth, the other with his tormenting fingers, sending her shrieking with an agony of exquisite pleasure/pain.</p><p>She was burning just as he wanted. Burning alive with the need to orgasm, and very well aware of the fact that she would be denied until the men holding her captive deemed the time appropriate.</p><p>Despite the evenings she had spent at The Club, she had never been without her control. Her choice. It had never been like this.</p><p>“Jared.” She strained against his hold on her wrists, terrified as emotions and sensation swamped her.</p><p>Her head tossed on the mattress as the fingers tormenting her rear sank deeper, sending flames shooting from her anus to her clit. The two digits scissored inside her, stretching her further.</p><p>“I’m here, baby,” he soothed her, despite the roughness of his voice as his lips moved to caress her neck, the shell of her ear. “I’m right here.”</p><p>“Hold onto her,” the voice at her cunt warned him then. “I’m going to give her more here. Let’s see how hot she can burn.”</p><p>“Come here, Kimber...” They lifted her, positioning her to her knees though the fingers invading her ass stayed in place.</p><p>She knelt on the mattress, following Jared’s whispered instructions to lower her shoulders to the bed.</p><p>“Anal sex can bring you complete satisfaction, Kimber,” he whispered deeply as she felt her buttocks being parted as another finger began to push its way inside her. “If you know how to take it, which you do. If the person giving it knows how, which he does. It can take you places you can never go any other way.”</p><p>Her back arched as the fingers stretched her further. She was in agony. Pleasure and pain rocked her body as she strained backward, desperate for more.</p><p>A second later she screamed in outrage as a hand landed firmly on her buttock. She stilled, thinking it would ease. Believing the swat was for her desperate movements to push his fingers deeper. But it came again, on the other side.</p><p>“Bastard,” she screeched, intending to jerk away, to push aside the blindfold and face her tormentor.</p><p>“Bad Kimber,” Jared chuckled when her hand moved to the blindfold. He caught her wrists, holding them before her as he lay beside her now. “Haven’t you ever been spanked, baby? Feel it Kimber. Relax with the heat, let it heighten the pleasure. You love the pain, you know you do. It’s just another form of it.”</p><p>The hand landed again, and despite her need to deny it, the pleasure rode a hard edge on the stinging burn. As though in reward, Jared’s hand moved beneath her, tucking between her thighs, the palm of his hand exerting a firm, sensual pressure against her clit as he lifted her to lay against his chest.</p><p>The hand struck again, and this time the fingers stretching the entrance to her ass moved deeper.</p><p>“Oh God...Jared... I can’t stand it...” The hand landed again, causing her to tighten on the fingers invading her and making white-hot spears of sensation rip through her pussy.</p><p>“More, Kimber...” His voice was rougher now, demanding. “You can take more, baby, you know you can.”</p><p>Another series of burning slaps were followed by a smooth, even thrust of the fingers into her ass as Jared tugged at the ring piercing the hood of her clit. She was shaking violently, shuddering with the pleasure and intensity as she bucked into each thrust.</p><p>“Now, baby...” She was lifted from his chest and propped on hands and knees as he moved before her. “Open wide, Kimber. I want your mouth so damned bad I’m about to come just thinking about it.”</p><p>She felt Jared’s cock press against her lips and opened to him as she moaned in regret for the fingers slowly exiting her rear.</p><p>Her mouth was filled with the hot male flesh she loved so dearly. Jared, his cock throbbing against her tongue, his thumbs pressing at the hinge of her jaw as she felt her buttocks being parted again.</p><p>She stilled, whimpered.</p><p>A second later reality exploded in a kaleidoscope of brilliant bright pleasure/pain as she was invaded. Not by fingers, but a cock that tunneled inside her with one sure, quick thrust that destroyed her.</p><p>She lost reason. Madness consumed her. Her lips tightened on Jared’s thrusting flesh as her rear burned in ecstasy. She was taken, impaled, possessed in a way she could have never imagined. She could feel every hard inch buried between her buttocks, taste the potent passion in the cock thrusting between her lips. She was possessed, taken, sacrificed to such pleasure that she was certain she would never survive.</p><p>She could feel the flames washing over her as the hard body behind her covered her. His hand went between her thighs, his hard fingers moving on her clit a second before he delivered a series of hard, rapid little slaps that pushed her over a precipice she had never known existed.</p><p>She exploded, only dimly aware of Jared’s semen jetting hot and hard down her throat, and the flex and throb of the cock in her ass releasing as well. All she knew, all she could process was the pleasure burning her, rocking her...destroying her.</p><p>She fell to her side, curling into a tight ball as her muscles shuddered and her pussy began to flex in protest. And she knew, despite the agonizing ecstasy that still echoed through her, that never again would the driving pleasure mixed with pain ease the terrible ache in her body. It had only triggered a hunger for more. A hunger she knew only one man would ever ease...</p><p>Chapter Sixteen</p><p>Jared stood inside the shower, feeling the spray pounding on his back as he leaned his forehead against the tile wall. His eyes were closed, every muscle tight with the effort to control the raging demand that pounded through his body and his mind.</p><p>She was his, goddammit. The fierce demand raged through his mind. His heart. His fucking soul and he was wasting away beneath the force of the water rather than laying in satisfied exhaustion in her arms.</p><p>The ménage with Ian should have stilled part of the hunger, but it only made it worse. It wasn’t enough. Nothing he knew now would ever truly be enough until he took her as he was meant to.</p><p>His cock was like living stone, near to bursting with the raging of his emotions. He could taste her on his tongue, feel her on his skin. He could still hear her ragged cry as she convulsed beneath him. Did she even realize what she had cried? Could she know the effect her words had on him?</p><p>“...not enough...oh God, Jared, it’s not enough...” The words had been a ragged, nearly incoherent cry as she shuddered through her earlier orgasm.</p><p>No, it hadn’t been enough. It would never be enough.</p><p>Would he live another five fucking years before he could claim her? He grit his teeth at the thought of it. It would be a hell he could have never imagined before now. Hell yes, he would wait. But it would fucking kill him.</p><p>“Jared?” Her voice was a whisper of hunger, of the needs that raged within him as well.</p><p>He opened his eyes, ignoring the water that poured over him as his turned to meet her gaze.</p><p>Her green eyes were dark with pain, with goodbye. Fuck. Not yet. He wasn’t ready yet.</p><p>“The Agency just called.” His heart clenched at the sound of her voice, at the misery in it. “The threat has been deemed a prank. I’ve been called back first thing in the morning.”</p><p>She had put her robe back on, had belted it tightly around her waist and pushed her hands deep into the little pockets at the side. Her hands were clenched, her fingers bunched together to restrain the pain he saw reflected in her gaze.</p><p>“Fuck.” What now? Damn them, he wasn’t ready to let her go, wasn’t prepared to do without her warmth in his bed. Son of a bitch, he had just managed to get her into it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Jared...” He watched her swallow convulsively; saw the regret that filled her eyes, and the tears.</p><p>“No!” he growled.</p><p>Straightening abruptly he jerked her into the shower, ignoring her gasp, pushing aside the knowledge that no matter how hard he wanted, how much he loved, that it was time for her to go.</p> <p>“I’ll always be here.” His arms wrapped around her, pulled her against his chest as he maneuvered his body to protect her from the full force of the water. “Always Kimber. I’ll be right here, baby, anytime you need me. Anyway you want me. I’ll be here.”</p><p>Her arms tightened around his shoulders, holding fiercely to him as he felt the heat of her tears against his chest. God surely hadn’t meant for a man to have to endure this sorrow? He prayed for mercy, because he couldn’t cry with her.</p><p>Leaving the farm was the hardest thing Kimberly had ever done in her life. She didn’t think she would have the strength to do it. Not after the past night. Not after the realizations she had come to herself.</p><p>But she did it. She threw her suitcase into the SUV where Matthews sat waiting on her. The others had left hours before, eager to get back to the offices, file their reports and head into more adventurous assignments. Kimberly hadn’t been able to tear herself away as easily.</p><p>Jared stood behind her silently. He had watched her pack, his expression worn, his gaze turbulent. But he hadn’t made any demands, hadn’t asked for any promises, he was simply letting her go. Reluctantly, she could tell, but he was letting her go.</p> <p>She turned back to him as she closed the rear door, staring up at him, realizing that the pain in her chest was more than just regret. It was a hollow, gaping wound she feared would never ease.</p><p>“Remember to let Mother know when you’re back in town,” he told her softly. “She worries, even if she never says anything.”</p><p>Kimberly nodded, smiling though her heart was breaking. “First thing,” she agreed.</p><p>“And don’t drive too fast,” he growled. “Matthews told me you scared the hell out of him on the way up here. The man has a family to feed you know. Stop risking his life.”</p><p>She would have laughed if it hadn’t hurt so damned bad.</p><p>“And remember, you always have a place to stay here,” he finished. “Anytime, Kimber. All the time.”</p> <p>She wanted to weep at the softness of his voice.</p><p>“Jared...” There was so much she wanted to say.</p><p>“No.” He shook his head regretfully, reaching out to touch her cheek with a caress so light, so tender she felt it rock her soul. “Just remember that, baby. You know where I’m at if you need me. Always.”</p><p>She had to look away from him or she would never hold back her tears. How was she walking away from him? She could feel everything inside her screaming out in rage that she would do so.</p><p>“Go,” he said then. “You’ll be late getting back if you don’t leave soon.”</p><p>Her lips trembled as she turned back to him. She blinked fiercely to hold back her tears, fighting her head and her heart as she stared up at him.</p><p>She loved him. She could feel the emotion exploding within her, violently protesting the decision to leave, to stand firm to the vow she had made so long ago.</p><p>“I want...” He cut her words off, laying his fingers against her lips as he flinched slightly.</p> <p>“Don’t, Kimber,” he whispered. “Don’t make letting you go impossible for me to do. Or for you to do. There’s always tomorrow. We aren’t saying goodbye, remember?”</p><p>She licked her lips, feeling her soul shatter. God help her. He loved her. She could see it in his eyes, in that crooked, pain-filled smile that was hers alone. It was hers alone because he loved her.</p><p>She was barely aware of the whimper that left her throat but there was no mistaking the strength, the need in his body as he jerked her against him, holding her tight to his chest, sheltering her with his big body as one hand held her head to him.</p><p>“Listen to me,” he growled fiercely. “You don’t have to say anything, Kimber. You don’t have to do anything. Come back when you need to. Know I’ll be here. That’s all. Damn you, this isn’t forever. I won’t let it be.”</p><p>He pulled her head back, his fingers tangling in her hair, destroying the perfection of the intricate braid she had painstakingly worked the strands into. But she didn’t care. He was holding her, his lips were on hers, his tongue taking possession of her mouth, wiping away the destructive agony piercing her soul. It wasn’t goodbye. Not yet.</p><p>One hand gripped her hip, rocking her against his erection as his mouth ate at hers, his groan vibrating against her lips as the hunger that raged between them began to gnaw at her resolve.</p><p>“Damn, you’re going to send me up in flames right here in my driveway, woman. Is that any example for me to set for my work hands?” He dragged his lips from hers, a weary, entirely false spurt of laughter leaving his lips as he stared down at her. “I’m too old for this, baby. Now get out of here, so I can get some work done.”</p><p>He stepped back from her, ripping her heart from her chest when he did so.</p><p>“Go on,” his voice softened as he nodded at the jeep. “I’ll see you soon.”</p><p>She backed away. She couldn’t turn away from him.</p><p>“Soon?” She heard the desperate plea in her own voice.</p><p>“Very soon, baby,” he promised. “Anytime you need me.”</p><p>“What about when you need me?” she wondered aloud.</p><p>His expression flinched. A subtle expression of pain that had her stilling the cry in her throat.</p><p>“I’ll always need you, Kimber,” he said softly, roughly. “Always.”</p><p>She had turned away from him. Walked away. With every step she felt the regret grow, felt the knowledge weighing on her soul. She was making the same choice five generations of women before her had made. She was choosing the past over the future.</p><p>The further she drove away from him, the more that knowledge was driven home. In the space of a year, he had steadily weakened her resolve, shown her laughter, patience, and a hunger she hadn’t known could exist. He had filled her dreams, waking and asleep, and he had reshaped her views of herself.</p><p>“What now?” she asked aloud, unwilling to hold back the pain, unable to bear the separation in silence.</p><p>“Only you can answer that one, Kimberly.” Matthews reminded her that she wasn’t alone, and that the rest of the world wasn’t blind. “He’s a good man. I hope you know that.”</p><p>She glanced over at him, seeing the compassion and sympathy in his eyes.</p><p>“He’s the best,” she said slowly, her gaze returning to the road as her fingers clenched on the steering wheel.</p><p>“My daddy always said anything worth having was worth waiting on,” he finally said philosophically. “Guess you’ll have to find that one out for yourself though, huh?”</p><p>Jared was worth waiting on, but for what reason? She shook her head as she watched the road, counting the miles as they separated her from the farm and the man awaiting her there. He was worth waiting on. But was she?</p><p>Chapter Seventeen</p><p>Briar Cliff. A week later, Kimberly turned into the long driveway that led to the stately Pennsylvania estate. Huge oaks lined the paved road, casting a dappled pattern of sunlight and shade over the dark path. She had once found it comforting, the sheltering limbs as they spread over the road, embracing each arrival. Now, she found it oppressive, restraining.</p><p>Pulling into the long circular driveway, Kimberly drew in a deep breath as she attempted to control the emotions overwhelming her. She hadn’t returned to the home she had been raised in, since her mother’s death. The conditions of the Trust would have allowed her to live there; her father would have preferred it because he could not continue residence there without her. Which had been one of the main reasons she had refused to stay.</p><p>It hurt, remembering the past. For years she had tried to block the memories, to keep from reliving the pain and fear she had known as a child. To keep from remembering her mother, so frail and fragile, huddled in a corner, her arms wrapped around her body as tears streamed down her face.</p><p>She shook her head. She wasn’t here to remember, yet somehow she knew that was inescapable.</p><p>Opening the door to her beat-up sedan, she stepped outside and stared around the grounds with a sense of déjà vu. She could hear her childish laughter, her mother’s voice calling out to her, filled with amusement and...love?</p><p>Kimmie, you know your father won’t like you climbing that tree. Was it laughter? Her chest tightened with the remembrance of the smug undertones of her mother’s voice. It had been like a dare. And Kimberly had accepted it as such.</p><p>My sweet Kimmie, don’t worry, baby, we won’t let mean ole daddy ruin our fun will we, baby...</p><p>That hadn’t been love in her voice, it had been satisfaction.</p><p>She shook her head fiercely. Was this why she had never returned? Why each time she had planned to come back to Briar Cliff something inside her had made her change her mind, there had always been something more important to do.</p><p>She pushed her hand into her jeans pocket and pulled out the single key she carried there. It would open the doors to Briar Cliff, and the memories she had fought to hold back for longer than she had realized herself.</p><p>The wide, oak, double door opened smoothly. There wasn’t a squeak or a hesitation as they swung on their well-oiled hinges.</p><p>Kimmie, this is all yours. Yours and your daughter’s and your daughter’s daughter’s. Don’t let him ever take it, Kimmie. Not ever...</p><p>She had been six, standing in the foyer after yet another of her father’s furious exits. Her mother had been in tears, her shoulders heaving with her sobs, her green eyes shadowed with misery.</p><p>She stood in the same marble foyer, staring around her, seeing the past rather than the gleaming oak and teak wood trim, or the centuries old antique hall tables and cushioned chairs, or the priceless crystal decorations.</p><p>Over two centuries of dedication to the stately home had made Briar Cliff a resource unto itself. It was quite simply, as a whole, priceless. The trust set up six generations before had ensured that there would be no sales, no chance of mortgages, or of loss. It had grown only more valuable over the generations.</p><p>But the antiques and delicate wood carved borders were only glanced over. Kimberly had never seen Briar Cliff as a heritage, it had been her home. But now she saw it, felt it as something more. It wasn’t a home. It wasn’t a heritage. It had been a curse.</p><p>She moved slowly through the house, room by room, the voices of a past she hadn’t wanted to remember washing over her.</p><p>God damn you, you stupid whore. All I asked you to do was play hostess, not the slut...</p><p>You fucking bitch, he’s gone... Do you hear me? He left. Took the money your father gave him and ran. Are you so fucking lame you can’t even remember he didn’t want you...</p><p>Kimberly wanted to cover her ears, but there was no blocking the memories.</p><p>Her mother’s tears, her screams for mercy, and her father’s voice, rough-edged and filled with fury as he stood over her mother’s cowering body.</p><p>Whose do you want her to be?</p><p>Kimberly shuddered. How could she have forgotten that? She had been seven, hiding outside the drawing room, trembling in fear, terrified her father would actually hurt her mother.</p><p>She remembered her mother’s voice, slurred drunkenly, smug and amused.</p><p>Her mother hadn’t been crying. Kimberly stood outside the drawing room now, staring into the shadowed room, and seeing the ghosts of what had been.</p><p>Damn you, you lying bitch, I wouldn’t believe you either way,he had screamed. She’s your daughter. Yours. And likely just as depraved and perverted as you ever were...</p><p>What had her mother done?</p><p>She moved slowly through the house, room by room. The drawing room, the family room, the dining room. In each area she relived the fights, the screaming matches, her mother’s tears, her mother’s smug vindictive words laced with her bitter sobs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He loved me... At least he loved me...</p><p>For God’s sake, the bastard took your father’s money and left. Are you so insane you’ve forgotten that... He didn’t love you, bitch, he used you...</p><p>I could have loved you...</p> <p>I never wanted your love, whore... But her father’s voice had been bitter, furious...hurt.</p><p>Her bedroom. Her refuge. The one room her father had never stepped foot in. Her bed was still there. The wide, white-canopied confection of lace. It was a room made for a princess.</p><p>Remember, Kimmie, you’ll be free... Be free for both of us, Kimmie...</p><p>Each night her mother had whispered those words to her until her teen years, until her father had put a stop to it. He had sent Kimberly away to school. An exclusive girls’ school that had effectively placed a distance between her and the mother who had nurtured her. Who had nurtured a hatred for the father.</p><p>Why had she not remembered that?</p> <p>She moved from her room, down the long hall, and to the room her mother had taken her last breath.</p><p>I was wrong... So many things...her mother had wheezed that last day. Don’t make my mistakes, Kimmie, swear to me, you won’t make my mistakes... I wanted you free, Kimmie... I wanted you free...</p><p>Free of what? Free of her father or free of Briar Cliff?</p><p>Each room she visited was more of the same. An unending collage of memories flooding her mind, her heart.</p><p>In the library, the walls were lined with the portraits of all those who had their time to possess Briar Cliff. From the first, Horace and Catherine St. Montrose. The first Briar Cliff family. It was said Catherine had been a creature of sexuality, a woman as comfortable with her body and her female desires as she was with the wealth she had inherited from her father, a Lord of the English realm. She and her husband had built Briar Cliff.</p><p>Her oldest daughter, Elizabeth St. Montrose Michaels and her husband, Hugh, wore the same happy, contented expressions of the first two. The portraits ranged around the room, a gleam of laughter, of satisfaction in the eyes of those inhabitants until she reached Tabitha Elizabeth Montageau and her husband, Diego Santiago. There was bitterness there, in Tabitha’s deep brown eyes, in the pinched contours of her lips. There was a sadness in her face only emphasized by the self-righteous arrogance of her husband.</p> <p>It had been Tabitha who had established the Trust. Who had broken with willing the entire estate to the first-born daughter and set the restrictive and soul-destroying provisions on the inheritance. It was she, most likely at the direction of her husband, who decided that the desires the women of her line possessed were depraved and perverted and needed to be extinguished.</p><p>She had condemned her daughter and all those who came after her to a life of restriction and pain. And Kimberly had been her mother’s last hope of breaking the cycle. The Trust terminated in only five more years. But in waiting, in turning her back on what she had seen in Jared’s eyes, what would she be gaining? And what would she be losing?</p><p>Love endured. If Jared loved her, truly loved her, he would wait. He would wait. She had seen it in his eyes, heard it in his voice. He would make that sacrifice for her. But to what end?</p><p>She wandered over to the oaken locked shelf that she had been given the key to six years before. She knew what it contained, but she had never had the courage to open it. Five generations of journals and diaries. Accounts of the lives, the loves, and she knew, the pain the women of Briar Cliff had endured.</p><p>Slowly, she drew the key from her pocket and opened the door on a past she had sworn she would never visit.</p><p>Chapter Eighteen</p><p>Father has sworn Matthew Timmons will save me from the demons of lust that are the curse of my birth. I will do as he bids, but my heart breaks, for I know I will never again see my beloved Daniel... Sarah Santiago. She had been Tabitha and Diego’s first-born daughter.</p><p>Father was right. I am cursed. My female needs torment me both sleeping and awake. James is disgusted by my very presence, of course. I cannot blame him for this. I am a blight upon my family... Samantha Fieldings. Her husband had been James Fieldings, a religious and righteous leader of the community at the time.</p> <p>God save me. I have wed Davis Eldon as Father ordered. What have I done? I have refused the demand of the one I love for this life. A life of ease, of all I knew should have been mine, for what? For the suffering I now endure. What have I done? My heart breaks for my one true love. My soul aches... Elissa Fieldings Eldon.</p><p>They can make me marry as they please, to satisfy the terms of this insane Trust. But they cannot make me suffer. Grayson may be the choice of my father, but it is his brother, Lawrence, to whom my heart and body belongs. I will not suffer the fate of those before me. I will know love, if only in the darkness of the night and the sheltering arms of deception... Karen Eldon Marshal</p><p>If only I were as strong as my parents. They loved, they laughed, and they knew at least a small measure of happiness. The man I loved, precious Kimmie, I won’t say his name. He was not your father, he was never my lover, and as your father was prone to remind me, he preferred the money. I am too weak, and I know I will not survive this illness. Should I die, then Briar Cliff and its protection falls to you. All that the women of our line have dreamed of falls upon your shoulders, my precious daughter. You can have it all. It can all be yours, just as it was meant to be. But for what? You are inheriting generations of pain, anger, deception and tears. It is truly a curse, and one I pray you deny. Love, Kimmie. Laugh. Let your heart be free and your body be your own. A house, no matter how beautiful, or how priceless, will ever take the place of those things.</p><p>I hope you are reading this diary, that you have read those who have gone before, now that I myself have passed on. I hope that the years you have spent away from this house, from me, have given you a chance to grow strong, to break away from the curse this house brings.</p><p>So many years I refused your father the truth he often pleaded for. He wanted only to know that you were his true daughter, and I, in my selfishness, refused him that. I realize now, as the end draws near, that I leave you alone, where before I had thought I would be here to see you triumph. I leave you alone. Without the father who perhaps would have treated you with kindness had I not driven the wedge between you.</p><p>I suffer now for my selfishness. No, not I, for I will pass on. But I go, knowing I will never rest, because you shall now suffer.</p><p>Briar Cliff is the curse, Kimmie, not your desires or your femininity or your gentle heart. It is this estate, and the past that has cursed us all... Claire Marshal Madison. It was dated the week of her death.</p><p>When Kimberly looked up from the final diary it was to see that night had overtaken the house. The light beside her glowed eerily, a single point of illumination within to emphasize the darkness that surrounded not just the estate, but her soul as well.</p><p>She had been away at school when her mother had become ill, and she hadn’t been called home until the last moment. She had believed for so many years that it had been her father’s decision to keep her unaware of her mother’s health. But now she knew the truth. It had been her mother’s.</p><p>They had both deceived her, had used her as weapon, one against the other until nothing had been left of the child in their eyes. She had been a sword and she had been the one to suffer.</p><p>She wanted to scream, to rage, to destroy the house brick by brick until nothing remained of the agony that resonated through her body. She wanted nothing more than to wipe away the memories of a past that should have never been.</p><p>She was crying. She wiped at her cheeks as she closed the diary and laid it beside those she had glanced through before. She stared around the library. Centuries of books graced the shelves and Kimberly knew that many more were in storage. Books that museums would salivate over. In five years, they would have been hers. It would have all been hers.</p><p>She shook her head tiredly as she rose from the chair, staring around her as the tears continued to dampen her cheeks. She had been denied her mother as well as her father because of this place. The scars on her soul that her parents had placed there through her younger years would never completely fade. She would never forget that her father’s hatred of what her mother had done had extended to her. She would never forget that the mother she had loved, had trusted and believed in, had used her as well.</p><p>But was she any better?</p><p>She had sacrificed her life, six long years to the battle lines that had been drawn six generations before.</p><p>She had walked away from Jared.</p><p>A sob racked her body, shuddering through her as pain sliced through her chest. An agonizing burst of never-ending regret shook her, causing her breath to catch as a low, racking moan escaped her. She curled into herself, her arms wrapped around her stomach as she whispered his name.</p><p>God, it hurt. It tore through her, echoing through her soul and ripping wide the door she had closed on her heart so long ago. Even before she had learned the terms of the Trust. Before her father had demanded the exams. She had closed herself off from any chance of heartache or pain to ensure that what had happened to her mother could never happen to her.</p><p>She had been determined to never love. But Jared has sneaked into her heart with his crooked smile and his stormy eyes. His determination and sheer male presence had stolen past her safeguards and marked her forever.</p><p>There had been no jealousy when he had caught her at The Club. There had been only fiery heat and overwhelming hunger. He had catered to her every desire on the ranch, giving her the gift of his touch, his desire...his unspoken love. And he had never demanded more from her than she had thought she could give.</p><p>“Kimberly, you’re breaking my heart.” His voice washed over her senses, a figment of her imagination, a condemnation for walking away from him?</p><p>“Baby, you can’t cry like this, you’ll make yourself sick.”</p><p>She jerked in shock when she felt his hands grip her shoulders and draw her forward. Her eyes flew open and there he was. His gaze a million shades of gray, lines bracketing his mouth, sorrow in his expression as he drew her to his chest.</p><p>“Jared...” She cried out his name, her hands reaching for him, clutching at him as his arms tightened around her, pulling her into his arms as he rose so he could lift her before taking her place in the chair.</p><p>She was cradled on his lap, her head buried in his neck as he soothed her. Soft, broken words in a voice ragged with emotion.</p><p>“Baby, it’s okay,” he whispered at her ear before he placed gentle kisses along her brow. “It’s okay, Kimber. You’re not alone anymore.”</p><p>He had promised he would always be there, and now, when she needed him the most, he was there. He was holding her, his arms sheltering her, his kisses soothing the gaping wound that had grown in her soul.</p><p>“Why are you here?” She tried to stem the tears, but they refused to be held at bay.</p><p>Jared sighed roughly. “Mother called when you came for the key last night. She was worried about you.”</p><p>Kimberly nodded jerkily. Carolyn had watched her too closely and Kimberly had known there was no hiding the proof of the tear-filled nights she had spent since leaving the farm.</p><p>She was raw from the inside out. She couldn’t sleep for dreams of Jared, couldn’t get through the day without his name coming to her lips. Without crying for all she had walked away from.</p><p>“I don’t want it,” she finally whispered. “This place. This legacy, Jared. I can’t...I don’t want it.”</p><p>She felt him tense, felt his arms tighten around her.</p><p>“Five years isn’t so long...” She heard the pain in his voice, heard all the needs that she felt in his soul.</p><p>Raising her head, she lifted her hand and placed her fingers against his lips. He stared back at her silently, though his eyes raged with emotion.</p><p>“I won’t ask for promises,” she whispered. “I don’t want them. Yet. But I need this, I need you now. Just like this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His smile, God, she loved his smile, even covered by her fingers as it was.</p><p>“I told you,” he growled roughly. “I’ll be here Kimber, whenever, however you need me. That’s not a promise. It’s a fact.”</p><p>He drew her back to his chest, tucking her head beneath his chin as the tears finally eased.</p><p>“Just rest, baby,” he said then. “Right here, in my arms. Just let me hold you...”</p> <p>Night moved on, yet Jared never released her. They spoke in hushed whispers, and he listened in silence as she told him of her childhood, of her lonely years in boarding school.</p><p>He laughed with her when she told of the pranks she often pulled on the good sisters who ran the school. He hugged her tight when she related the punishments that she considered a fair trade for the fun she had managed to eke out of those years. And he rocked her tenderly when she related the horrifying event of arriving home within hours of her mother’s death.</p><p>Finally, her eyes closed wearily and sleep claimed her. And Jared still held her, watching her tenderly, his heart breaking for the loneliness she had endured even as his soul swore she would never know it again.</p><p>Jared drove her home the next morning after arranging for someone to bring her car in behind them. He held her hand through the hour-long drive, allowing her to sit in silence until they pulled into her driveway.</p><p>Kimberly stared at the little brick house, realizing that it had been more of a home to her in the past six years than Briar Cliff ever had been.</p> <p>“Come in with me,” she whispered.</p><p>She didn’t want to let him go. She didn’t want to face the loneliness awaiting her.</p><p>Jared sighed wearily as he lifted her hand to his lips, placing a gentle, destructive kiss in the center of her palm.</p><p>“I don’t have that much control today, baby,” he whispered. “I don’t think either of us do.”</p><p>She turned her head, staring at his exhausted face and seeing the same needs swirling in his gaze that burned in her body.</p><p>“I’m not asking for your control, Jared,” she whispered. “I don’t want it...”</p> <p>He shook his head, stopping her flow of words.</p><p>“No, Kimber,” he said tenderly. “I won’t let you make this decision while your emotions are this ragged. Go inside and rest. I’ll see you in a few nights, I promise.”</p><p>She would have argued with him, she would have pressed him for more, and she knew eventually, he would give in. But if he did, he would never be certain that the decision she had made in the deepest part of the night was made with her heart and not with her pain.</p><p>She nodded slowly. “I’ll hold you to that.”</p><p>He smiled that special smile. “You won’t be able to keep me away.”</p><p>He leaned to her, his lips touching hers, the restraint he used evident in the tense lines of his face and the darkening of his eyes.</p><p>“Soon,” she whispered, pulling back before hurrying from the car.</p><p>She had an appointment to make, and she was more than eager to finish it and to begin the life she prayed was waiting for her.</p> <p>Chapter Nineteen</p><p>She faced him, her father, Senator Daniel Madison in the offices of Caruthers, Brickley and Morton, the Estate lawyers who had handled the Briar Cliff Trust from the beginning. Actually, it had been Caruthers senior who had first put together the original Trust. It was his great grandson, Caruthers IV who now faced her from the head of the antique cherry wood conference table.</p><p>Across from her sat her father and Attorney Brickley. Morton sat at the other end with a stenographer off to her side.</p><p>“Let me get this straight, Ms. Madison, you are rescinding all claim to Briar Cliff, effective immediately?” Brian Caruthers asked her sternly. “This isn’t a decision to make lightly, young lady. This is centuries of preservation we’re talking about. A heritage anyone can be proud of.”</p><p>“Proud of?” She flicked the lawyer a glance before returning her gaze to her father’s silent face. “I’ve endured a physical exam every three months to prove my eligibility to hold Briar Cliff. My life, my every move is under scrutiny. I have no pride in Briar Cliff.” There, she had said it.</p><p>She watched her father’s eyes widen marginally before they narrowed in censure.</p><p>“She has obviously broken the conditions and doesn’t want to admit it,” he finally snapped.</p><p>Kimberly smiled sadly. Somehow, she had known that would be his first defense. She reached into the briefcase she carried with her and pulled free the doctor’s report.</p><p>“I saw Dr. Morgan first thing this morning,” she said softly. “Here are the results of those tests.”</p><p>She slid the paper across the table. She knew what it said. The hymen was still intact.</p><p>He slid the paper to the lawyer next to him.</p><p>“What are you up to?” he growled, his hazel eyes accusing, censorious. “A year ago you sneered in my face and swore I’d never live a night in ‘your’ home, as you called it.”</p><p>Kimberly drew in a deep breath as she watched the man who should have been there for her graduation and wasn’t. Who should have cared the first time she was wounded during an assignment, but hadn’t. The man who should have shared in her joys and her fears, yet he never had.</p><p>“I wish I had been given the chance to love you,” she whispered then, ignoring the shock on his face. “I wish the Estate hadn’t stood between us, and that your own morality and beliefs hadn’t eroded what could have been, Father. I wish I could have been the daughter you needed, instead of the tool for revenge that you and Mother turned me into.”</p><p>He paled. She watched his swarthy expression blanch and shook her head wearily.</p><p>“The Trust ends in five years, Ms. Madison,” Caruthers reminded her. “Whatever has fueled this decision can surely wait that long.”</p><p>Make Jared wait? She didn’t have the patience.</p><p>“I have a life to plan,” she said firmly. “Briar Cliff won’t be a part of it, because after tonight, I’ll never pass another of those asinine exams.” She flicked her fingers towards the report. “Five years is too long to wait to tell him I love him.”</p><p>“No!” Her father’s hand smacked imperatively against the pristine polish of the table, the crack resounding around the room as Kimberly flinched at the fury of the sound. “I won’t allow you to make such a foolish decision. It’s Jared, isn’t it?” He sneered the name, his eyes piercing her with his anger. “The little bastard has somehow corrupted you...”</p><p>“Enough.” Kimberly stood to her feet, pushing her chair back as she faced her father with her own growing anger. “You have it, Father. All of it. Content yourself with that.”</p><p>“I won’t let you whore yourself to him and his friends,” he snapped, coming to his feet as well. “Do you think I don’t know he belongs to that depraved club?” he spat out. “That I’m unaware of his practices, his lifestyle. Are you insane, girl?”</p><p>She lifted her chin, staring back at him with a strength she had never known she possessed. His rages had always terrified her; his harsh words had never failed to rip through her heart. Now, she felt only sorrow, only pity that it had come to this.</p><p>“No, I finally found my sanity,” she said softly. “You can have the papers mailed to me, Mr. Caruthers,” she informed the lawyer. “My time here is finished.” She turned back to her father, allowing her regret, a lifetime’s worth, to fill her face and her voice. “Goodbye, Father.”</p><p>She moved away from the table, heading for the door, for freedom. She could feel her heart lifting, her soul becoming lighter with each step.</p><p>“Kimberly.” Her father’s voice stopped her as she opened the door, imperative, demanding.</p><p>She turned back to him slowly, seeing so many things she had missed before. Her father had aged in the last six years. He was only fifty, but he looked much older, more bitter than she remembered.</p><p>“If you walk out that door you lose it all,” he reminded her. “Everything.”</p><p>She smiled tiredly. “No, Father. I win,” she said simply.</p><p>He sneered slowly. “You’re just like your mother.”</p><p>Kimberly ignored the pain at the implied insult.</p><p>“No, I’m not,” she replied slowly. “I’m stronger than she was. I’m stronger than both of you were, because I’m not willing to sell my soul for a piece of land that will neither keep me warm at night, nor love me in return. Unlike you and Mother, I’m not willing to turn my back on love for profit. That was your curse, it won’t be mine.”</p><p>She left before he could reply, before he could hurl the insults she could see gathering on his face. She walked from the offices into a day filled with sunshine and hope and ran toward her future.</p><p>Chapter Twenty</p><p>He was waiting for her when she arrived. His mother had called and relayed Daniel’s fury when he returned from the lawyers’ offices. The Senator was coldly disapproving she had said, but Jared had read more than that in her voice.</p><p>“Should I come after you, Mom?” he had asked her carefully, concern rising within him.</p><p>“No, dear. Daniel isn’t a violent man. But neither am I pleased with him at the moment,” she had said with a vein of irritation. “You take care of Kimberly. She’s renounced Briar Cliff for you. I expect to plan the wedding, of course. And it will take more than a few weeks, young man. I expect six months at the least. I deserve this. You waited long enough to find the woman that makes your lips curve into that smile your father always got with me.” Her voice had turned misty with memories, though he had no idea what she meant. “Give her my best, and I’ll see both of you soon.”</p><p>He had hung up the phone, and waited. Night had fallen more than an hour before and still he stood on the front porch, his heart in his chest, his throat tight with the knowledge of what she had given up for him.</p><p>She had given up an estate estimated to be worth millions. More than he would ever accomplish in his lifetime, more than he had dreamed his love meant to her. She had only five years to wait, and he would have been there beside her. He would have given her that time.</p><p>It both awed and humbled him, and scared the living hell out of him that she had given it up.</p><p>Finally, just as he was certain she must have changed her mind, he saw the lights of the jeep topping the rise a quarter of a mile away. And she was there. Everything inside him responded to that sight. His chest tightened with emotion, and his erect cock throbbed in thankfulness. The damned thing hadn’t relaxed since she had walked out the door more than a week before.</p><p>He held his position on the porch, his arms crossed over his chest as the jeep pulled into the driveway and turned around the circular drive. The engine had no sooner been turned off then the door was opening and there she was.</p><p>Her long, red-gold hair flowed around her, unbound, as wild as the passion that burned within her. She was dressed simply in clothing that he figured would take no more than six seconds to tear from her body. A light cream-colored sundress and leather sandals. Four seconds max, he revised.</p><p>She moved slowly to him, stepping up on the porch, her eyes dark with emotion.</p><p>“I love you,” she whispered. “I can’t wait, Jared. No matter what. No matter how long you want me, I can’t wait.”</p><p>He drew in a hard, determined breath as he glanced away from her. He couldn’t say what he had to say while staring into those beautiful eyes.</p><p>“I can ease the desire for you without this sacrifice...”</p><p>“No.” Tears thickened her voice as pain resonated in it. “We tried that, Jared; it only made it worse. Don’t you understand? It’s not the need for release. It’s not the arousal. It’s you. Just you. I need all of you, not just a little bit... I need all of you. You love me, Jared. I know you do. You have to.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He turned back to her, the emotional storm riding within him as unfamiliar as the tears filling her eyes now.</p><p>“Love you?” he questioned her roughly. “No, Kimberly. This isn’t love. This is a part of my soul that rips out every time I have to let you go. But by God, I won’t let you give up everything you’ve fought for like this. It’s only five years.”</p><p>She shook her head slowly, a single tear falling from her eye, breaking his heart.</p><p>“Five years that I can be warm beside you. Five years that I can laugh with you, that I can love you. Five years versus something that was my mother’s dream, but never mine. I want you, not the curse that estate has become.”</p><p>He should have argued further, he thought. He should have made her see exactly what she was giving up, but he couldn’t fight past his need to hold her, to kiss her. His need to shelter her and hear the screams he had every intention of fucking out of her.</p><p>He reached out, his body clamoring to take and take until he was so sated he collapsed in exhaustion. But nothing could still the need to give until he saw her eyes fill with happiness, with satisfaction.</p><p>His fingers touched her cheek gently.</p><p>“Be certain,” he whispered. “Because I’ll never let you go, Kimberly. It would kill a piece of my soul to ever have to let you go again.”</p><p>Her hand covered his, pressing it to her lips as her lips caressed his palm with a butterfly touch.</p><p>“Do I have to tie you down and rape you, Jared?” she asked him with a tearful smile. “Or are you going to tie me down and love me?”</p><p>“No restraints,” he vowed as his arms went around her and he swept her against his chest. “Just me and you, Kimber. Me and you and the fires that are going to explode around us.”</p><p>Kimberly gasped at the heat and warmth of Jared’s body as he carried her into the house and up the stairs to his room. He didn’t exactly walk; his movements were too quick, too filled with purpose for such a sedate pace. But neither did he rush.</p><p>Her lips moved to his neck as he stared up the staircase. Her teeth nipped at his flesh, her tongue soothing the ache as a broken growl left his lips. She wanted to give him the pleasure he had always given her. She wanted to consume him, wanted to melt so deep into his body that she never had to worry about being apart from him again.</p><p>Finally, he was pushing his way into his bedroom and laying her on the bed as he stared down at her, his gray eyes turbulent with the swirling shades of gray that colored his eyes.</p><p>She propped herself up on her elbows, watching as he undressed. He tore his clothes from his body, dropping them carelessly onto the floor until every hard, muscular inch was revealed to her avid gaze.</p><p>“Are you attached to that dress?” he growled then.</p><p>She glanced down at the dress in surprise. “It’s just a dress.”</p><p>“Good.” He reach for her, his hands hooking in the neckline, and before her amazed eyes, he tore the fabric from her body.</p><p>Laughter welled inside her and would have escaped her throat if he hadn’t covered her lips with his own, coming over her as he pressed her back to the bed, his legs pushing demandingly between her thighs.</p><p>“I don’t know how long I can wait,” he whispered between the kiss. “I’m dying for you, Kimber. So damned starved for you that I feel as clumsy as a callow youth.”</p><p>“Never clumsy,” she panted as his hands framed her breasts a second before his lips moved to her hard, aching nipples.</p><p>Pinpoints of rapturous sensation began to tingle over her body as his mouth covered one distended tip. His mouth drew on her with a hunger she couldn’t have imagined. She thought she had known him at his most passionate, his most aroused, but she had been wrong. This was Jared, raw, unconcerned with control, but no less intent or powerful for it.</p> <p>Her head fell back on the bed as her hands moved over his shoulders, his head, her fingers tangling in the short strands of his hair. She wanted, no, she needed to touch him. She had to feel the bunching muscles of his shoulders, hold his head to her as he sucked at her breast, driving her insane with the pleasure.</p><p>When his lips began to move lower, his tongue licking over her flesh, she arched to him, knowing that as the fires inside her began to rage out of control, that Jared would once and for all put out the flames.</p><p>“I love your taste,” he groaned as his mouth poised over the aching, wet folds of her cunt. “So sweet and hot, Kimber. I could eat your pussy for hours.”</p><p>“Later,” she begged. “God, Jared, I’ve been in misery for a year now. Make it stop...”</p><p>Her eyes closed as a ragged moan escaped her lips. His tongue swiped between the sensitive lips, circled her swollen clit then moved down to tongue the entrance to her greedy vagina.</p><p>“Damn you, fuck me,” she demanded roughly as her pussy wept with its need. “I’ve waited long enough, Jared.”</p><p>She needed him inside her, needed him to fill the empty aching places, not just in her body, but in her soul as well.</p><p>“Condom,” he panted as he pulled himself to his knees, his eyes wild, his face flushed. “...have to find one...”</p><p>“No.” Her hands fell to the jutting length of his cock, wrapping around it as they both groaned at the touch. “I’m protected, Jared. I took care of it. I need you like this. All of you.”</p><p>Her eyes met his. Neither of them had known another’s touch without that layer of protection. She needed no protection from Jared. She didn’t want any.</p><p>As though her words had broken the last threads of his control, he lifted her thighs, opening her further as he came over her, pushing her hands from the rigid length of his erection, and positioned himself carefully.</p><p>He was breathing hard and fast, just as she was. Perspiration covered his body, dampened his hair. He stared down at her, his eyes nearly black as he guided the wide, flared head of his cock through the narrow slit of her pussy.</p><p>Kimberly whimpered with the pleasure. The mushroomed crest was satin soft and hot as fire as he tucked it against her opening.</p><p>“I don’t want to hurt you,” he groaned, leaning his forehead against hers as he fought for breath.</p><p>“I like the pain, remember?” She tried to smile, but her breath was catching in her chest with each new, violent burst of pleasure. “Take me, Jared. All of me...”</p><p>He closed his eyes, his hand moving to grip her hip a second before he surged inside her.</p><p>Kimberly’s eyes flew open wide, not from the pain, but from the filling. He stretched her impossibly, working his cock inside her with stiff, hard strokes that had her gasping for breath, had a scream building in her throat with no air to let it free.</p><p>“God, Kimberly,” he groaned desperately as she struggled to take the thick width of his erection. “Fuck, you’re so damned tight. Too damned tight.”</p><p>She felt the penetration of the thin membrane she had protected for so long. Her back arched as a cry escaped her, her legs lifting to allow her knees to clasp his hips, to open herself further for him.</p><p>Her hands gripped his shoulders, fingers biting unconsciously into his skin as the next hard stroke sent him deeper, stretched her further. Each breath was a gasping cry. Each inch that sank inside her, another slice of ecstasy she feared she would never survive.</p><p>Finally, his hands gripped her hips hard as he pulled back a second before he pushed inside her, hard and heavy, a spearing impalement that let loose the scream building inside her.</p><p>Electricity sizzled over her flesh as tremors shook her body. She could feel him inside her, every hard, throbbing, heavily veined inch of his cock buried to the last depth of her pussy.</p><p>She stared up at him as his eyes opened, gasping for breath, her eyes wide, her hips rocking against him. And she could say only a single word. “More...”</p><p>Jared lost his mind. For a second, for one blissful second he thought he could hold on to the control he needed not to ravish her. But that word, that single word, so filled with hunger, with desperation, tore it from him.</p><p>He came over her fully, catching his weight on his elbows and began to fuck her with all the driving, greedy desperation he had locked inside his soul for a year now. His hands tangled in her hair, holding her still as his lips came over hers, his tongue pushing past her lips as he surged repeatedly into the fist-tight depths of her cunt.</p><p>She was tight. So tight she gripped him like a silken vise, the walls of her cunt dragging over his cock and driving him closer and closer to the edge of release.</p><p>Her lips opened to him as eagerly as did the rest of her body, her hands moving over his shoulders. Flames whipped over his body as his chest tightened with a surge of protectiveness and overwhelming emotion.</p><p>His arms cradled her close to him as he felt his scrotum tighten almost painfully at the base of his cock. He gritted his teeth against the whiplash of sensation that began to move up the base of his spine. The slick, satin softness of her tight cunt flexed and rippled around his erection. Tiny fingers of bursting sensation speared inside the swollen flesh, striking with destructive results to the depths of his balls.</p><p>He couldn’t hold back. She was burning in his arms, searing him with her pleasure, her cries urging him to thrust harder, faster, to fuck her with the last measure of strength he possessed. He was helpless against her need, her hunger.</p><p>Jared was shocked at the sound of the ragged groan that escaped his chest as he began to hammer inside her. Quick, deep strokes, the sound of her wet pussy sucking at his cock, driving him over the edge of reality.</p><p>“Jared...Jared...” She was gasping his name, her body tightening beneath him as he felt the first warning contractions of her cunt around his cock.</p><p>She was close, so close.</p><p>“I love you, Kimberly,” he growled at her ear then, the emotion surging through him like a tidal wave. “Come for me, baby. Come for me now, sweet baby. Right here in my arms.”</p><p>As though his voice was the trigger needed, she bucked in his arms, her breath strangling past her lips, as he raised his head to watch those incredible eyes as the storm took her.</p><p>They were nearly black, wide, unfocused, as a keening cry escaped her lips. Her sweet, sweet pussy clamped down on his cock like the tightest fist as hard, spasmodic shudders began to convulse through her.</p><p>Then he felt it. The rush of her release vibrated against his erection as her legs tightened further, her pussy flexing, releasing, gripping and sucking at his hard flesh until his head, his heart, his very soul exploded in a release that had a rough, desperate groan tearing from his chest.</p><p>On and on it went. Every pulse of his seed inside the liquid heat of her body was like a whiplash of fiery sensation. His hips pressed deeper, determined to spear into the very heart of her womb as he spilled every drop of his semen into the flexing depths of her cunt.</p><p>When it was over, it was like a puppeteer cutting the strings on his creation. Jared collapsed over her, loath to pull free of the velvet depths of her body. He had to be crushing her, but her arms wrapped tight around his neck, her lips whispered, pleaded that he hold her forever.</p><p>“I love you, Kimberly,” he whispered again, humbled by the emotions that swept through him as exhaustion claimed them both. “I love you...”</p><p>Chapter Twenty-One</p><p>Three weeks later</p><p>“Your mother is insane,” Kimberly accused Jared as she hung up the phone and lowered her head into her hands. “Six months? Six months to plan a wedding?” She gazed up at him pleadingly from where she sat at the kitchen table, her coffee cooling in front of her. “I have to wait six months, Jared? That’s no fair.”</p><p>He stood across from her, leaning lazily against the counter, his jeans lying low on his hips, the top snap still undone, his chest bare. God, he was so sexy she just wanted to eat him up.</p><p>His dark hair was tousled, his lips still appeared swollen. She barely remembered biting that lower curve as her release rocked her body earlier that morning. Looking at him now, she couldn’t imagine how she had managed to keep her hands off him as long as she had. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Stop looking at me like that,” he growled sensually. “After last night and this morning, you’re in no shape to follow through on it.”</p><p>And he was right. She was still amazed that Ian Sinclair had agreed to be the third in their relationship. Ian rarely participated in any of the club members’ relationships, and as far as she had known, he had never acted as third. First maybe, but never third.</p><p>The experience had been wild, erotic, a giving unlike anything she had ever known as Jared held her in his arms, his gaze locked with hers as Ian began to fill her greedy, soaked cunt.</p> <p>She shivered now at the memory, staring back at Jared as love exploded in her soul. It still amazed her that he was truly hers.</p><p>“Finish your coffee, sweetheart.” His voice was a smooth, sexy rumble as the front of his jeans began to fill out demandingly.</p><p>She was poised to rise to her feet and attack him when the doorbell chimed, forestalling the sexual intent building like wildfire in her mind.</p><p>She rose instead as Jared held his hand out to her in invitation to follow him. Their home. He took every opportunity to prove to her that the house he so cherished was their home. Not just his, but hers as well.</p><p>“Expecting someone?” Her ever-present smile deepened as his arm curled around her back.</p> <p>“Not hardly,” he grunted as they reached the wide oak panel. “Let’s get rid of them fast though.”</p><p>Laughter welled in her throat as he gripped the doorknob and opened it wide.</p><p>Shock held her immobile.</p><p>“Hello, Kimberly.” Daniel Madison stood on the threshold, a gaily wrapped box clutched in his white-knuckled hands as he stared back at her coolly.</p><p>She stiffened, blinking in disbelief.</p><p>“Senator Madison.” Jared’s icy greeting was less than hospitable. “What do you want?”</p> <p>He appeared to flinch at the rough tone of Jared’s voice, but his gaze never left hers.</p><p>“I would like a moment to speak with you,” he said austerely. “I promise not to take much of your time.”</p><p>“You’ve said enough...” Jared started to growl.</p><p>“No.” Kimberly pressed her hand to his chest, her gaze never leaving her father’s. “I’ll talk to him, Jared. This can’t hurt me now. I promise you.”</p><p>She felt his denial of her facing the parent who had attempted to control her for so many years.</p><p>“Come into the living room,” she invited him warily. “It’s a bit messy right now. We haven’t gotten around to putting all my stuff away yet.”</p><p>They had cleaned out her small house the week before, but boxes still littered the living room, packed with a lifetime of memories that she couldn’t bear to part with.</p><p>Her father nodded, his gaze flickering for a moment, appearing bleak and pain-filled before he glanced away from her.</p> <p>She led him into the living room, standing uncomfortably as he stepped past several boxes, still clutching the bright pink and yellow box in his arm. Suddenly, he stopped, his gaze caught by the contents of childish mementos that she had kept over the years.</p><p>Hesitantly it seemed, he reached into it and pulled free a ragged little book. Sleeping Beauty. It had always been her favorite book.</p><p>He blinked rapidly as he cleared his throat.</p><p>“I used to read this to you,” he said faintly. “When you were just a tiny thing. Every night before bedtime, you wanted me to read it to you.”</p><p>Kimberly watched him curiously. “I don’t remember that,” she said as she thought back, trying to move past the memories of his rage with her mother to the years before the fights.</p><p>He flinched as though she had struck him and carefully laid the book back in its place.</p><p>“You were very small,” he said. “Too young to remember perhaps. Here...” He handed her the box he carried. “I have a gift for you. Your birthday arrives soon and I saw this...” He shrugged, as though uncomfortable.</p><p>Confused, Kimberly took the box. This wasn’t the father she remembered.</p><p>“I apologize for the wrapping.” He cleared his throat again. “I don’t know where my secretary was yesterday. I had to wrap it myself.”</p><p>She could tell. The paper was uneven, clumsily taped, but for a moment Kimberly had to battle back a sob at the knowledge he had wrapped it himself. He hadn’t done that since she was five. And she did remember that. The uneven, clumsily wrapped box he brought her and her mother’s derision.</p><p>You didn’t even care enough to have it wrapped properly,her mother had charged, furious. It’s as clumsy as you are, Daniel.</p><p>Her fingers smoothed over the crookedly tied bow as she blinked back tears. Carefully, she untied it, laying the ribbon aside before easing open the paper in the same manner. She would save it. Just as she had saved the ballerina paper he had used so long ago.</p><p>Finally, she opened the long box and simply stared down at the contents in amazement.</p><p>“It was nothing really,” he almost snarled. “I saw it in the shop window. The doll’s face reminded me of you.”</p><p>Reminded him of her? She looked at the little tag on the long white satin wedding gown. It was a Remee, a designer original, and the face resembled her because it was her face. She had long admired the maker’s porcelain dolls but had never been able to justify the outrageous price to own one.</p><p>Long red-gold curls fell down the doll’s shoulders and back beneath a lace and gauze veil. Tiny seed pearls, satin and lace, graced the stunningly white wedding gown, and precious satin slippers covered the porcelain feet.</p><p>“Why?” She ran her finger gently over a row of tiny pearls on the long train of the gown that had been folded carefully to the side.</p><p>She looked up at him then, seeing someone she didn’t know. This wasn’t the father she had fought for so many years. The self-righteous bastard who had, on more than one occasion, all but called her a whore.</p><p>He lowered his head slowly, shaking it helplessly as he pushed his hands into the pockets of his slacks.</p><p>“I’ve not been a father to you since you were five,” he said, almost too low for her to hear. “I won’t excuse myself. There is no excuse, Kimberly. I won’t make one. But I wanted you to know...” he swallowed tightly, “I always loved you. Even when I didn’t want to. When I tried not to. I loved you.”</p><p>He shrugged his shoulders uncomfortably as she lifted a slender envelope she glimpsed tucked beside the doll. Curious, she opened it, pulling the papers free. She scanned the legal documents in disbelief before looking at him again.</p><p>What the hell was going on here?</p><p>“It was always meant to be yours,” he snapped then. “If you had married a derelict from the streets, I would not have taken it from you. I married your mother for the money, I admit that. But by God, I didn’t get her pregnant for the money, nor was it an accident.”</p><p>He appeared angry, as he always did. His voice was rough, a little too loud, but this time she saw something she realized had always been there in the past. His pain.</p><p>“I can hear you,” she said softly. “Don’t yell at me, Father.”</p><p>He grimaced tightly, glancing away again. “I don’t mean to yell.” He attempted to throttle the sound. “My fellow cabinet members are forever chastising me for it. Sometimes, I don’t realize...” He broke off again.</p><p>“Why now?” She couldn’t figure that part out. “Why come to me now when I needed you years before?” Her voice was roughening with tears, and she hated that. She shouldn’t hurt; she shouldn’t care.</p><p>He cleared his throat again, shifting uncomfortably. “I read her diary. You left it out at Briar Cliff. When you renounced the estate, I was given a letter she wrote me before her death. I went to Briar Cliff to try to make sense of it, and I found the diary.” He blinked jerkily.</p><p>“When you were five, the evening of your birthday, she led me to believe you may not be mine. It’s no excuse,” he snapped furiously. “No excuse for what I did. But while I was reading her words, I realized we hurt you. In our selfish attempts to hurt each other, in my own moralistic, self-righteous belief of right and wrong, I had committed an even greater sin. I had denied the child I accepted on her birth. Shouldn’t have mattered if she had lied to me, or if she had truly cheated me. I accepted you. And I was wrong.”</p><p>He stared straight ahead as he spoke, his hazel eyes a bit watery, his hands bunched in his pockets as Kimberly watched him in shock, uncertain, confused. She glanced back down at the doll. It had taken longer than a few weeks for this creation. He would have to have commissioned it more than a year before.</p><p>“I don’t expect forgiveness,” his voice was rising again. “Don’t deserve it. But I wanted you know. I know what he does, that man you’re marrying. That Club he’s a part of. I know what it means. I don’t like it. You know I don’t like it...” He stopped, obviously attempting to control the volume of his words. “You’re my daughter. What you do in your privacy is none of my business... I just want...” He broke off again.</p><p>Kimberly stared back at him silently.</p><p>“One day...” he continued, “you might have children. Maybe a little boy, too. I want...” He cleared his throat roughly. “I don’t want to lose the chance to know your children, as I denied the chance to know you... Dammit, don’t cry woman. I won’t have those tears,” he yelled then.</p><p>Before Kimberly could respond he had jerked a handkerchief from his pocket and pressed it to her cheeks. A bit roughly, wiping at the tears before pushing it into her hands.</p><p>“Clean it up...” he snapped, gritting his teeth, lowering his voice. “I can’t stand to see you cry. Reminds me of too many things, Kimberly. Too much pain I caused in the past. Please don’t cry. I didn’t mean to make you cry.”</p><p>“She tried to tell me at the end,” she sniffed. “And I misunderstood.”</p><p>He nodded bleakly. “I know. I heard what she said and I misunderstood as well.” He patted her head roughly. “I have to get back. I have work to do, girl. I don’t have time to stand around here. Just...” He swallowed tightly. “Be happy, Kimmie. That’s all I ever really wanted for you.”</p><p>He turned and began to stalk to the doorway.</p><p>“Father.” He paused as she called out to him. “I’m getting married. Carolyn informs me the wedding is in six months.”</p><p>He grunted roughly. “That woman’s a busybody.”</p><p>Strangely, his voice was filled with a fondness she hadn’t expected.</p><p>“Yeah, she is,” she agreed. “But I’ll need someone to give me away,” she said hesitantly, wondering if she was only hurting herself with the words.</p><p>He turned slowly. It was his turn to be shocked, filled with disbelief.</p><p>His lips opened. Closed.</p><p>“I don’t deserve to,” he finally whispered. “I never expected to be able to.”</p><p>“If you want to,” she said, aching for the years lost, the father she realized she never knew. “Love me, love my husband, Father.”</p><p>He blinked roughly. “He stole my daughter,” he growled. “But I was doing a lousy job taking care of you anyway. And I would be proud...damned proud, Kimmie, to give you to him. I sacrificed your love for my own selfish pride. But I’d be damned proud to give you away.”</p><p>She licked her lips warily. “I never hated you.” She couldn’t say anything more. Right now, she was stunned, unable to explain to herself how this had happened.</p><p>He nodded jerkily. “I’m thankful for that. Now, I have a country to try to help slap back in shape for my grandkids. You keep that man you’re marrying in line.” He pointed a finger at her demandingly. “He’s too damned stubborn and sure of himself. Gives the rest of us a bad name...” He pressed his hands nervously into his pockets again. “Love you, Kimmie.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>He turned and left abruptly then, weaving quickly around Jared as he passed him in the hall.</p><p>Kimberly met her lover’s eyes. He stared back at her in surprise, his lips quirking in sudden amusement.</p><p>“Your father has issues,” he said with all seriousness.</p> <p>She shook her head, a smile curving her lips as he came to her, his arms wrapping around her.</p><p>“You’re worth every sacrifice, Kimberly. He only realized that,” he said as he pulled her to his chest a second before her tears flowed again. “Every sacrifice. And trust me, dealing with that pious father of yours is going to be a sacrifice...”</p><p>She laughed tearfully at the teasing tone of his voice, because there had been nothing pious about her father. Nothing self-righteous. He had made a sacrifice she had never expected.</p><p>She held onto Jared tighter, realizing the gift she had been given in his love. The acceptance, the patience and sheer depth of emotion that now bound them. There had been no sacrifice. Even if she had never seen Briar Cliff again. This, this moment in his arms, was worth losing it all. </p>  </body></html>"]